{"summary":"Major mining pools filtering transactions from sanctioned addresses would mean a whole new era for Bitcoin, with protocol-level censorship.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267759\/bitcoin-faces-risk-of-protocol-level-censorship-as-miners-under-increasing-regulatory-pressure","publishDate":"2023-12-26T06:20:02","id":2295,"type":null,"title":"Bitcoin faces risk of protocol-level censorship as miners under increasing regulatory pressure","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.72%\n    <\/span><\/a> <!----><\/span><\/span> miners declining to process transactions for sanctioned addresses is a rare occasion now, but there's a risk that it could become common practice in the future as regulatory pressure on the industry increases.&nbsp;<\/span><\/span>","<span data-v-f87c67ca=\"\">U.S. regulators have their eyes on crypto, and even if miners are not in the crosshairs right now, there are reasons for them to be cautious, according to Ben Hutten, a partner at law firm Orrick.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“If miners are providing services to people on the [sanctions] list, that could be deemed by OFAC to be materially supporting a sanctioned person, and it could be a basis for the imposition of sanctions on the service provider,” Hutten told The Block, referring to the Office of Foreign Assets Control.<\/span>","<span data-v-f87c67ca=\"\">Christopher Bendiksen, bitcoin research lead at CoinShares, shared this view and said he believed some miners would ultimately start to censor transactions connected to addresses on the OFAC list, \"and that will be a cost of business in the West for them.\"<\/span>","<span data-v-f87c67ca=\"\">To get ahead of the curve, some miners might voluntarily impose anti-money laundering measures on-chain, and there are some signs that this is already happening.<\/span>","<span data-v-f87c67ca=\"\">On Nov. 20, a pseudonymous bitcoin researcher who goes by 0xB10C published a <\/span><a href=\"https:\/\/b10c.me\/observations\/08-missing-sanctioned-transactions\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">blog post<\/span><\/a><span data-v-f87c67ca=\"\"> that said their mempool-monitoring tool spotted six bitcoin transactions that were not included in blocks by three major mining pools: ViaBTC, F2Pool and Foundry. All transactions involved addresses that OFAC had previously put on its sanctions list.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">To be clear, 0xB10C believes what they witnessed was an isolated event that doesn't signal anything bigger. \"One pool not including a few transactions does not result in censorship – that might just be the pool owner's preference,\" they told The Block.<\/span>","<span data-v-f87c67ca=\"\">The transactions 0xB10C highlighted in their <\/span><a href=\"https:\/\/b10c.me\/observations\/08-missing-sanctioned-transactions\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">blog post<\/span><\/a><span data-v-f87c67ca=\"\"> were sent in September and October, and most of them included inputs from an <\/span><a href=\"https:\/\/www.blockchain.com\/explorer\/addresses\/btc\/3PKiHs4GY4rFg8dpppNVPXGPqMX6K2cBML\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">address<\/span><\/a><span data-v-f87c67ca=\"\"> attributed by OFAC to <\/span><a href=\"https:\/\/ofac.treasury.gov\/recent-actions\/20230414\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Chinese fentanyl precursor sellers<\/span><\/a><span data-v-f87c67ca=\"\">. Another transaction had an input from an <\/span><a href=\"https:\/\/www.blockchain.com\/explorer\/addresses\/btc\/1ECeZBxCVJ8Wm2JSN3Cyc6rge2gnvD3W5K\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">address<\/span><\/a><span data-v-f87c67ca=\"\"> connected to the Russian sanctioned OTC service <\/span><a href=\"https:\/\/ofac.treasury.gov\/recent-actions\/20210921\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">SUEX<\/span><\/a><span data-v-f87c67ca=\"\">, according to the blog post.<\/span>","<span data-v-f87c67ca=\"\">All of the transactions in question were later picked by other miners and ended up recorded on the Bitcoin blockchain, 0xB10C said. Analysis suggested that the two transactions were likely rejected by ViaBTC and Foundry by accident, while the F2Pool filtered them intentionally, the researcher wrote.<\/span>","<span data-v-f87c67ca=\"\">That was informally confirmed by F2Pool co-founder Chung Wang, who commented in a now-deleted post on X: \"Why do you feel surprised when I refuse to confirm transactions for those criminals, dictators and terrorists? I have every right not to confirm any transactions from Vladimir Putin and Xi Jinping, don’t I?\"<\/span>","<span data-v-f87c67ca=\"\">In another now-deleted but <\/span><a href=\"https:\/\/archive.ph\/UFP8l#selection-425.5-425.118\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">archived<\/span><\/a><span data-v-f87c67ca=\"\"> post, several hours later, he said F2Pool would \"disable the tx filtering patch for now, until the community reaches a more comprehensive consensus on this topic.\"<\/span>","<span data-v-f87c67ca=\"\">Foundry and ViaBTC declined to comment.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Ben Hutten, the lawyer at Orrick, said that miners have every reason to feel a target on their backs. OFAC and FinCEN will only ramp up pressure on the crypto industry, he told The Block.<\/span>","<span data-v-f87c67ca=\"\">Sanctions and legal actions against crypto mixers, including, most famously, Tornado Cash, showed that the regulators are willing to be innovative in their ways.<\/span>","<span data-v-f87c67ca=\"\">\"FinCEN (the U.S. Treasury’s Financial Crimes Enforcement Network) issued a <\/span><a href=\"https:\/\/www.fincen.gov\/sites\/default\/files\/federal_register_notices\/2023-10-19\/FinCEN_311MixingNPRM_FINAL.pdf\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">proposed special measure<\/span><\/a><span data-v-f87c67ca=\"\"> designating all of cryptocurrency mixing as a primary money laundering concern,” Hutten said. \"Historically, it's only taken such measures against a jurisdiction or against a financial institution. Recently, however, it took those special measures against a class of transactions.\"<\/span>","<span data-v-f87c67ca=\"\">There is still little risk for small individual miners, Hutten believes. \"But if you're a mining service, for example, you find a new block, you get a new bitcoin, you hold it, then you split it up 20 ways and send it out, and in that case you very well will be caught by [the rules] and have a regulated status in the United States as a money transmitter,\" Hutten said.<\/span>","Recent news related to the stablecoin tether offers another glimpse of how the relationship between crypto and U.S. regulators may develop in the near future. Tether has been freezing crime-related addresses for years now and has recently <a href=\"https:\/\/www.theblock.co\/post\/266872\/tether-freezes-all-ofac-sanctioned-wallets-in-proactive-security-measure\" data-v-f87c67ca=\"\">announced<\/a> that it blocked addresses from a U.S. sanctions list. The company also <a href=\"https:\/\/www.theblock.co\/post\/267973\/tether-weve-onboarded-fbi-secret-service-to-our-platform\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">reported<\/a> that it \"recently onboarded the United States Secret Service into our platform and is in the process of doing the same\" for the FBI.","In 2021, U.S. mining firm Marathon Digital <a href=\"https:\/\/www.theblock.co\/linked\/106865\/marathon-ofac-bitcoin-mining-pool-taproot\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">briefly introduced<\/a> transaction filtering for addresses on the sanctions list.&nbsp;","\"The feature proved to be both immensely unpopular and impractical, so we discontinued it,\" Charlie Schumacher, vice president of corporate communications at Marathon, told The Block. He added that it was impractical for companies to \"filter\" Bitcoin transactions, but that the company would comply if there was a legal requirement to do so.&nbsp;","\"Everybody in the industry recognizes that they’re not going to win a firefight with the U.S. government,\" concurred CoinShares’ Bendiksen. U.S. miners and pools with publicly known teams and founders will likely comply, even with rules they don’t necessarily agree with, he added.","The idea of transaction censorship makes no sense for miners economically, Bendiksen continued. If you’re not mining this or that transaction, someone else will mine it and snatch the fee, he said.","<span data-v-f87c67ca=\"\">However, problems with U.S. regulators might cost even more. In a hypothetical situation where all major pools agree to filter a certain list of transactions, there still will be miners who won't follow those rules. But they will represent a smaller part of the total hashrate, so it might take hours or even days for a \"prohibited\" transaction to be finally written into the blockchain, Bendiksen said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">It's theoretically possible that an emerging, unofficial consensus could push not just for the avoidance of mining OFAC-blacklisted transactions, but also for the orphaning of blocks with such transactions mined by other miners, refusing to build new blocks upon them. That could be considered a sort of 51% attack on Bitcoin, leading to a chain split, Bendiksen said, and such an idea has already been entertained in Washington policy circles.<\/span>","<span data-v-f87c67ca=\"\">Carole House, a former White House director for cybersecurity and secure digital innovation, who is now executive in residence at Terranet Ventures, spoke at the <\/span><a href=\"https:\/\/decenter.princeton.edu\/events\/decenter-spring-conference\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">DeCenter Spring Conference<\/span><\/a><span data-v-f87c67ca=\"\"> at Princeton University in April, proposing exactly that.<\/span>","<span data-v-f87c67ca=\"\">In her <\/span><a href=\"https:\/\/vimeo.com\/819245954\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">speech<\/span><\/a><span data-v-f87c67ca=\"\">, House suggested that it would be great if miners, as well as validators of proof-of-stake blockchains, came together and agreed not to mine OFAC-blacklisted transactions, as well as not to build upon blocks with such transactions. She also noted that having as much hashpower as possible in the U.S., where miners have to comply with the sanctions, would help make that vision a reality.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"My feeling based on my interaction with the industry this year is that there is much more of a concern about compliance, particularly in the second half of this year,\" Hutten said. <\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Chung Wang","content":"PERSON"},{"type":"DeCenter Spring Conference","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"the second half of this year","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Marathon","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Orrick","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"FinCEN","content":"ORGANIZATION"},{"type":"United States Secret Service","content":"ORGANIZATION"},{"type":"Christopher Bendiksen","content":"PERSON"},{"type":"White House","content":"ORGANIZATION"},{"type":"Terranet Ventures","content":"ORGANIZATION"},{"type":"Foundry","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"+0.72%","content":"PERCENT"},{"type":"Princeton University","content":"ORGANIZATION"},{"type":"OFAC","content":"ORGANIZATION"},{"type":"U.S. Treasury’s Financial Crimes Enforcement Network)","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"Ben Hutten","content":"PERSON"},{"type":"Vladimir Putin","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"FBI","content":"ORGANIZATION"},{"type":"Bendiksen","content":"PERSON"},{"type":"51%","content":"PERCENT"},{"type":"House","content":"ORGANIZATION"},{"type":"Office of Foreign Assets Control","content":"ORGANIZATION"},{"type":"Orrick","content":"ORGANIZATION"},{"type":"Carole House","content":"ORGANIZATION"},{"type":"Nov. 20","content":"DATE"},{"type":"CoinShares’ Bendiksen","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Charlie Schumacher","content":"PERSON"},{"type":"Hutten","content":"PERSON"},{"type":"Marathon Digital","content":"ORGANIZATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["BITCOIN"],"authors":["Anna Baydakova","The Block"]}