{"summary":"According to reports, Twitter appears to be testing out tips using bitcoin on the Lightning Network.\nIt will be using Bitcoin Lightning app Strike.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/116320\/twitter-appears-to-be-adding-the-ability-to-tip-using-bitcoin","publishDate":"2021-09-01T07:16:30","id":2296,"type":null,"title":"Twitter appears to be adding the ability to tip using Bitcoin","category":["Bitcoin"],"content":["Twitter is seemingly trialling the ability to tip using bitcoin, per multiple reports. According to <a href=\"https:\/\/www.macrumors.com\/2021\/08\/31\/twitter-beta-ios-bitcoin-tips\/\" data-v-f87c67ca=\"\">MacRumors<\/a>, the current Twitter beta indicates that this service is being tested, while mobile developer <span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Alessandro Paluzzi<\/span> has <a href=\"https:\/\/twitter.com\/alex193a\/status\/1432963409151135744\" data-v-f87c67ca=\"\">leaked an image<\/a> of what the service will look like.","According to the reports, the tipping function will use the Lightning Network to make smaller bitcoin payments. It will support custodial and non-custodial wallets.","Based on the leaked image, Twitter is clearly working closely with Bitcoin Lightning App Strike, and will use the service to generate bitcoin invoices. As a result, Twitter users will need a Strike account to receive tips.","In July, Twitter CEO Jack Dorsey <a href=\"https:\/\/www.theblockcrypto.com\/post\/112299\/bitcoin-big-part-twitter-future-ceo-jack-dorsey\" data-v-f87c67ca=\"\">implied that bitcoin<\/a> would be coming to the Tip Jar, a service for making tips on Twitter. He added that it could also be used for its other products including Super Follows, Commerce and Subscriptions.","Dorsey's other company Square holds bitcoin on its balance sheet and recently <a href=\"https:\/\/www.theblockcrypto.com\/post\/110916\/jack-dorsey-square-bitcoin-hardware-wallet\" data-v-f87c67ca=\"\">committed<\/a> to building a bitcoin hardware wallet. Plus Square has its own crypto team, Square Crypto, which works on bitcoin development kits and other open-source code.","The Block reached out to Twitter for comment and will update this article if the company responds.&nbsp;","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to subscribe to The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/t.me\/the_block_crypto\" target=\"_blank\" rel=\"noopener noreferrer\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Telegram<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>"],"hashtag":["BITCOIN","TWITTER"]}