{"summary":"The daily average gas fee on Ethereum is trending toward a two-month low after surging amid last month&#x27;s memecoin trading frenzy.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/233072\/ethereum-fees-after-memecoin-may","publishDate":"2023-06-05T02:54:40","id":2297,"type":null,"title":"Ethereum fees trend toward two-month low after May&#x27;s memecoin mania","category":["LAYER 1S"],"content":["The Ethereum blockchain's daily average gas fee — the flexible toll charged to conduct a transaction or execute a smart contract — is trending toward a two-month low after surging to expensive highs amid last month's memecoin trading frenzy.","According to on-chain data from The Block, the average transaction fee on Ethereum — using a seven-day moving average — has dropped to $7.34 from a high of over $20 last month. The last time fees were this low was April 17, when the metric hit $6.57.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/average-transaction-fee-on-ethereum\/embed\" title=\"Average Transaction Fee on Ethereum (7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The story remains the same when measured in gwei, a denomination of ether equivalent to one billionth of a whole coin. Data from Dune Analytics user @hildobby shows the daily median gas price dropped to 24 gwei from a high of over 140 gwei last month. The last time prices were the same was on April 12.","<span data-v-f87c67ca=\"\">Ethereum's daily median gas price has dropped to levels not seen since April after last month's memecoin-driven surge. Source: <a href=\"https:\/\/dune.com\/hildobby\/Gas\" data-v-f87c67ca=\"\">Dune Analytics \/ @hildobby<\/a><\/span>","Driving gas prices in May was <a href=\"https:\/\/www.theblock.co\/post\/231675\/crypto-traders-flock-to-dexes-amid-memecoin-mania\" data-v-f87c67ca=\"\">the rise (and return) of memecoin trading<\/a>, which pushed The Block's DEX to CEX ratio — a comparison of spot trading volumes on decentralized exchanges against centralized exchanges — to an all-time high of over 20%. The ratio has since fallen back under 15%.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/dex-non-custodial\/dex-to-cex-spot-trade-volume\/embed\" title=\"DEX to CEX Spot Trade Volume (%)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Because centralized exchanges are traditionally somewhat slow to list memecoins — many of which openly have little to no value outside of pure speculation — traders flocked to decentralized exchanges, such as Uniswap, to trade the likes of Pepe and others. The demand for block space to execute decentralized swaps for memecoins was primarily responsible for the increased Ethereum transaction fees.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$20","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$6.57","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"$7.34","content":"MONEY"},{"type":"April 12","content":"DATE"},{"type":"Uniswap","content":"LOCATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"CEX","content":"ORGANIZATION"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"April 17","content":"DATE"},{"type":"Dune Analytics \/ @hildobby","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"last month","content":"DATE"},{"type":"April after last month","content":"DATE"}],"hashtag":["ETHEREUM"],"authors":["Adam James","The Block"]}