{"summary":"Binance has started blocking U.S. users from accessing its platform, The Block has learned.\nAn email obtained by The Block directed a user to withdraw their funds within 90 days if they were based in the U.S. \nThe move comes more than a year after Binance first announced that it would stop serving U.S. residents from September 2019.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/84020\/binance-blocking-us-users-exchange-email-2","publishDate":"2020-11-09T14:18:24","id":230,"type":null,"title":"Binance has begun to block U.S. users from accessing its exchange platform","category":["Exchanges"],"content":["Crypto exchange Binance has begun blocking U.S. users from accessing its exchange platform, The Block has learned.","The move comes more than a year after Binance <a href=\"https:\/\/www.theblockcrypto.com\/post\/27252\/us-customers-to-be-blocked-from-trading-on-binance-com\" data-v-f87c67ca=\"\">first announced<\/a> in July 2019 that it would stop serving U.S. residents from September of that year.","Until now, the exchange was still effectively allowing U.S. users to access its platform. <a href=\"https:\/\/www.theblockcrypto.com\/daily\/80377\/three-big-questions-bitmex\" data-v-f87c67ca=\"\">As The Block reported recently<\/a>, a U.S. resident just had to click \"I'm not [American]\" to set up an account on Binance.com. It remains possible to create an account in this fashion.&nbsp;","Binance is now sending emails to U.S. residents based on their IP addresses in what appears to be a significant step toward enforcing its previously announced blockade of such users. One such email, sent Sunday and obtained by The Block, reads:","\"If you are a U.S. citizen or resident, please transfer your assets out of your account within 90 days. You may consider using Binance U.S. or other U.S. platforms,\" the email continues.&nbsp;","A member of Binance's customer support team told The Block that \"once our system detects the access of account or the factors mentioned in the email are detected within the account then the following email notification will be sent out to users.\"","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Recent issues<\/strong><\/span>","Binance's move comes soon after the U.S. government launched twin legal cases against crypto derivatives exchange BitMEX.","The U.S. Department of Justice and the Commodity Futures Trading Commission recently <a href=\"https:\/\/www.theblockcrypto.com\/linked\/79483\/cftc-bitmex-charges-lawsuit\" data-v-f87c67ca=\"\">charged BitMEX and its founders<\/a> for violating know-your-customer (KYC) and anti-money laundering regulations, among other allegations. In light of this case, <a href=\"https:\/\/blog.bitmex.com\/accelerating-the-bitmex-user-verification-programme\/\" data-v-f87c67ca=\"\">BitMEX accelerated its KYC program<\/a>, requiring all customers to be verified by November 5 — three months earlier than its original deadline of February 2021.","BitMEX rival <a href=\"https:\/\/www.theblockcrypto.com\/post\/81874\/deribit-crypto-derivatives-verification-2020\" data-v-f87c67ca=\"\">Deribit will also require all users to become verified<\/a> before the end of this year, as The Block reported last month. (Deribit already blocks U.S. residents based on IP addresses).","Binance itself appears to be on regulators' radar for avoiding scrutiny. In September, the Financial Action Task Force <a href=\"https:\/\/www.theblockcrypto.com\/daily\/80027\/crypto-exchange-fatf-red-flags\" data-v-f87c67ca=\"\">(FATF) published a report<\/a>, hinting that Binance has spent years shifting the heart of its operations from place to place, ostensibly to avoid regulations.","Most recently, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/82873\/forbes-leaked-document-binance-avoid-us-regulatory-scrutiny\" data-v-f87c67ca=\"\">Forbes published a report,<\/a> detailing what it described as Binance's efforts to avoid U.S. regulators' scrutiny. The report alleged that Binance \"conceived of an elaborate corporate structure designed to intentionally deceive regulators and surreptitiously profit from crypto investors in the United States.\"","A dedicated U.S.-based arm, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/39958\/binance-u-s-to-launch-on-wednesday-barring-13-states\" data-v-f87c67ca=\"\">Binance.US, was launched<\/a> in September 2019. Yet its volumes have remained tepid compared to Binance's primary platform.&nbsp;"],"hashtag":["BINANCE"]}