{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley. They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/17644\/ousted-etherdeg-ceo-requests-2-25m-default-judgement","publishDate":"2019-03-29T12:37:26","id":230,"type":null,"title":"Ousted EtherDEG CEO requests $2.25M default judgement","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\". This week’s guest post by Susan Joseph is “SJ”","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]Wenqing Liu v. Jun Chen, 2019 N.Y. Misc. LEXIS 1134 *; 2019 NY Slip Op 30662(U) (March 15, 2019)[SDP]<br data-v-f87c67ca=\"\">\n<\/strong><\/em>","If you don’t respond to a lawsuit, a court will enter a default judgment against you. That’s what this order concerns — a request for a default judgment in a case involving “EtherDEG”, a so-called decentralized cryptocurrency exchange incorporated in the British Virgin Islands.","According to the opinion, the Plaintiff alleges that in the go-go days of the last crypto boom, December 2017 to be precise, “he was appointed the CEO of EtherDEG and was granted an annual salary of $125,000, an 11.25% equity stake, and the right to receive commissions (he does not allege how much) from EtherDEG’s initial coin offering (which occurred on January 15, 2018).” He was then allegedly kicked out by the Defendant, a Chinese citizen.","Plaintiff filed the lawsuit almost a year ago, on April 30, 2018. Per the opinion, Plaintiff claims to have served EtherDEG with the complaint on its registered agent in BVI, but neither EtherDEG nor Jun Chen responded or filed any opposition papers.","One of the things Plaintiff asked the court to do is issue an Order permitting him to deposit EtherDEG cryptocurrency, which he claims is worth $2.25 million, into the court’s “registry” so the court can say who owns it.","What is a court registry exactly? It can be a safe deposit box, a bank account, a locked file drawer. What’s unclear here is how Plaintiff figures his “EtherDEG would be” held by a state trial court in Manhattan and in a footnote the court says “it expresses no opinion at this time as to whether this is possible.” (Private keys in an envelope? Hardware device? Software wallet? Is a court really gonna wanna tangle with this? If I were asking a court to hold crypto in a registry I’d be excruciatingly detailed about what this means exactly).","Plaintiff also seeks $10 million, but even though the Defendant hasn’t answered the court seems skeptical of this claim, noting that “[t]he basis for seeking this amount from EtherDEG for breach of contract is unclear as plaintiff’s annual salary was only $125,000. The claim to compel delivery of stock is not a claim for monetary, damages and this cause of action does not seek unpaid commissions (see Dkt. 18 at 1 ['EtherDEG’s breach of contract caused me to lose at least $10,000,000 in compensation, including but not limited to the destruction of the value of my equity']).” (Practice note — while it’s possible under limited circumstances, it’s very hard to prove fraud and breach of contract at the same time if the alleged fraud is really just a rehash of the contract claim).","Anyway … there’s a basic problem with the Default Judgment motion which is that the court wasn’t convinced that Plaintiff could prove liability or damages. Per the court, under New York law, default judgments aren’t rubber stamps for liability once jurisdiction is established. So, the court denied the motion and told the Plaintiff to present a more detailed explanation of liability and a precise explanation of what contract terms governed and were breached.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part I of this week's analysis, Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Wenqing Liu v. Jun Chen","content":"PERSON"},{"type":"$125,000","content":"MONEY"},{"type":"December 2017","content":"DATE"},{"type":"$2.25 million","content":"MONEY"},{"type":"Dkt","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"British Virgin Islands","content":"LOCATION"},{"type":"Misc","content":"LOCATION"},{"type":"Manhattan","content":"LOCATION"},{"type":"$10,000,000","content":"MONEY"},{"type":"$10 million","content":"MONEY"},{"type":"Stephen Palley","content":"PERSON"},{"type":"January 15, 2018","content":"DATE"},{"type":"Rosario","content":"PERSON"},{"type":"1134","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"April 30, 2018","content":"DATE"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"March 15, 2019","content":"DATE"},{"type":"BVI","content":"ORGANIZATION"},{"type":"Palley","content":"PERSON"},{"type":"Susan Joseph","content":"PERSON"},{"type":"11.25%","content":"PERCENT"}],"hashtag":[],"authors":["Stephen D. Palley","The Block"]}