{"summary":"TON Society and HumanCode are teaming up on a Toncoin initiative worth more than $5 million using palm scanning for proof of personhood.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286963\/forget-eyeballs-new-ton-ecosystem-initiative-offers-5-million-usd-toncoin-palm-scanning-incentive","publishDate":"2024-04-08T09:02:51","id":2302,"type":null,"title":"Forget eyeballs — new TON ecosystem initiative offers $5 million palm-scanning incentive","category":["INFRASTRUCTURE"],"content":["<span data-v-f87c67ca=\"\">Worldcoin’s eyeball-scanning Orbs for on-chain identity verification could soon have a new challenger, with a one million Toncoin (over $5 million) incentive program set to use palm scanning for proof-of-personhood in the <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248363\/toncoin-ton-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ton_symbol.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">TON<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +7.88%\n    <\/span><\/a> <!----><\/span> ecosystem.<\/span>","TON Society, a community of hubs contributing to the TON ecosystem, is teaming up with AI company HumanCode to launch the initiative. It is designed to offer Toncoin users a voluntary tool that scans the palm of a user’s hand to verify their human identity on the blockchain while preserving their physical anonymity.","Announced earlier today at the Hong Kong Web3 Festival, the program aims to enable digital identity for 500 million Telegram users within five years. Telegram initially developed the Telegram Open Network, as it was then known, raising $1.7 billion in a private sale the same year before abandoning the project following SEC investigations. In 2022, open-source developers saved and rebranded the blockchain as The Open Network with a functional mainnet.","“Supporting Proof of Personhood protocols like Humancode is a step towards a practical reputation system that has real-life use cases for everyone entering our ecosystem,” TON Foundation Director of Growth Ekin Tuna said in a statement shared with The Block. “A scalable, private, and decentralized identity will help to onboard the first one billion users to the Web3 ecosystem in Telegram. We look forward to going further and seeing what exciting use cases it will unlock for the community and TON developers alike.”","The HumanCode incentives will be distributed to TON Society members who complete the palm scan and prove their personhood. Beyond the incentives, the idea is to create a new tool for combatting on-chain bots while offering users control over their online identity. The palm-scanning technology is available via any smartphone and can prove the user is human within a few seconds, the entities claim.","“We have reached a stage where bots present a significant risk to the Web,” HumanCode founder Dr Zhang said. “Whilst other proof-of-human solutions exist, HumanCode’s palm system offers greater user privacy protection and does not require specific hardware. With over 900 million monthly active users, we strongly believe Telegram is the tool to deliver Web3 mass adoption, and we are excited for HumanCode to support the TON community.”","Worldcoin’s proof-of-personhood project has run into a series of regulatory troubles over the past year, with Portugal’s data regulator being the latest to order Worldcoin to <a href=\"https:\/\/www.theblock.co\/post\/284719\/worldcoin-data-collection-portugal\" data-v-f87c67ca=\"\">halt<\/a> its collection of personal data following a similar ban in Spain.","However, Worldcoin also <a href=\"https:\/\/www.theblock.co\/post\/284123\/worldcoin-to-end-storing-users-personal-data\" data-v-f87c67ca=\"\">introduced<\/a> “Personal Custody” last month, eliminating the option for the crypto project to store biometric data, which now will solely be held on users' own devices for greater control and privacy.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Portugal","content":"LOCATION"},{"type":"TON Foundation Director of Growth Ekin Tuna","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Humancode","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Worldcoin","content":"PERSON"},{"type":"Telegram","content":"LOCATION"},{"type":"Telegram Open Network","content":"ORGANIZATION"},{"type":"Telegram","content":"ORGANIZATION"},{"type":"TON Society","content":"ORGANIZATION"},{"type":"Spain","content":"LOCATION"},{"type":"+7.88%","content":"PERCENT"},{"type":"Zhang","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"$1.7 billion","content":"MONEY"},{"type":"$5 million","content":"MONEY"}],"hashtag":[],"authors":["James Hunt","The Block"]}