{"summary":"The move follows the inscription of a Super Nintendo Entertainment System emulator onto the Bitcoin network last month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278608\/nintendo-64-emulator-inscribed-onto-bitcoin","publishDate":"2024-02-22T10:39:52","id":2309,"type":null,"title":"NFT platform inscribes Nintendo 64 emulator onto Bitcoin","category":["GAMING"],"content":["Blending 1990s gaming nostalgia with blockchain technology, NFT platform Ninjalerts has inscribed a Nintendo 64 emulator onto the Bitcoin network — enabling users to play multiplayer games in their browser across Ordinals explorers and marketplaces.","The move is part of the company’s “Pizza Ninjas” profile picture NFT project and follows the inscription of a <a href=\"https:\/\/www.theblock.co\/post\/270892\/snes-emulator-bitcoin-ninjalerts\" data-v-f87c67ca=\"\">Super Nintendo Entertainment System<\/a> emulator onto the Bitcoin network last month. Ninjalerts also provides tools and <a href=\"http:\/\/ninjalerts.gitbook.io\/\" data-v-f87c67ca=\"\">guidance<\/a> for uploading permanent and functional video games onto Bitcoin — explaining how to store Read-Only Memory game files on Bitcoin in an encrypted and password-protected format.","Regarding compliance with copyright laws, Ninjalerts emphasized it was committed to advancing these technological capabilities within legal and ethical standards. “The project explicitly avoids inscribing any copyrighted games and focuses instead on facilitating discussions within the archivist community about the possibilities of blockchain technology in game preservation,” it said in a statement.","Ninjalerts’s GitBook <a href=\"https:\/\/ninjalerts.gitbook.io\/ordinals\/not-legal-advice-game-emulation\" data-v-f87c67ca=\"\">states<\/a> that “Under U.S. Copyright Law, particularly Section 117 of the Copyright Act, owners of legal copies of computer programs (including video games) are allowed to make a backup copy for archival purposes.”","“Ninjalerts recommends users find legal methods to utilize these tools for video game preservation, such as making personal backups of owned games, and avoid any activities that could be considered copyright infringement,” it adds.","While the terms \"Ordinals\" and \"inscriptions\" are often used interchangeably, an ordinal is technically a unique serialized identifier for a single satoshi, and an inscription is the content or data attached to that specific satoshi.","Nintendo did not respond to a request for comment from The Block.","Ninjalerts didn’t think an N64 emulator was practical initially. “A 16-bit system like SNES is likely the largest we can practically go (from a file size perspective) for putting old video games and software emulation fully on Bitcoin,” Owens said following the SNES inscription.","The “maximum inscription size per transaction is around 400 kb without going to a miner,” Owens told The Block at the time. “Most SNES games are 1 MB to 4 MB, which can get below 400 kb or under 1 MB with the right compression. Game Boy Advance, on the other hand, is a 32-bit system, where the smallest games are 4 MB and better games are 32 to 64 MB.” Nintendo 64, as the name suggests, is a 64-bit gaming system.","However, the recent implementation of the Brotli compression into the Ordinals protocol dramatically reduced file sizes by around 80% without compromising quality, Ninjalerts said, meaning that inscribing larger systems like N64 and its games is now more realistically feasible. N64 games like GoldenEye 007 can be shrunk from 12.4 MB to 3.15 MB after compression — enough to be efficiently stored within a single Bitcoin block or split across eight transactions under 400 kb, Owens <a href=\"https:\/\/x.com\/TO\/status\/1760463331645702476?s=20\" data-v-f87c67ca=\"\">posted<\/a> on X.","Though variable, as Bitcoin network fees are at the lowest levels since Ordinals began, inscribing this would only cost $6,000, Owens added. “Totally reasonable for a community of gamers with a vested interest in seeing these classic games preserved forever,” he said.&nbsp;","Ninjalerts has merely inscribed the N64 emulator on Bitcoin, with Owens again emphasizing that it did not inscribe GoldenEye 64 or any games that are currently under copyright, referring users to its <a href=\"https:\/\/ninjalerts.gitbook.io\/ordinals\/not-legal-advice-game-emulation\" data-v-f87c67ca=\"\">GitBook<\/a> for a more detailed explanation of the legalities around ROMs and gaming emulators.","“This technological breakthrough comes at an opportune moment, as Bitcoin transaction fees are currently at their lowest in over a year, largely due to the anticipatory decline in BRC-20 minting volume ahead of the Runes protocol launch,” Ninjalerts said. “This has created a unique window for inscribing larger files at minimal cost, making it the perfect time to enable the preservation of larger and more complex games like those of the Nintendo 64 era.”","The Pizza Ninjas project will embed the N64 emulator in each Ninja profile picture NFT, allowing users to play games in their browser across any Ordinals explorer or marketplace by loading ROMs from their computer or existing inscriptions on Bitcoin.","As the emulator files exist independently on Bitcoin, they also have a broader application beyond the Pizza Ninjas project, Ninjalerts previously noted.&nbsp;","Still, users will have to wait for Ninjalerts to develop the UI before it can enable game-playing functionality within the Pizza Ninja NFTs. “We wanted to take the opportunity while the mempool fees were low to get the biggest chunk of the files inscribed as we expect fees to go crazy after the halving,” Owens said.","The rise in popularity of <a href=\"https:\/\/www.theblock.co\/post\/207086\/what-are-bitcoin-nfts-ordinals-and-how-do-they-work\" data-v-f87c67ca=\"\">Ordinals<\/a> on Bitcoin last year fueled <a href=\"https:\/\/www.theblock.co\/post\/266512\/why-bitcoin-miners-are-unlikely-to-fight-a-moral-battle-over-ordinals\" data-v-f87c67ca=\"\">debate<\/a> over whether or not inscriptions representing things like NFTs and BRC-20 tokens on Bitcoin should exist. Inscriptions rely on Bitcoin’s OP_RETURN function — used to store arbitrary data in the blockchain.","The popularity of inscriptions caused transactions to surge on Bitcoin, as well as <a href=\"https:\/\/www.theblock.co\/post\/266272\/brc-20-style-tokens-are-spreading-to-chains-beyond-bitcoin-but-why\" data-v-f87c67ca=\"\">other blockchains<\/a>, late last year, with the share of Bitcoin miner revenue from transaction fees compared to the block reward subsidy rising concurrently.","However, the activity also led to congestion, causing fees to rise, with Bitcoin users encountering delays in processing transactions without paying the higher fees. Transaction fee revenue has since subsided alongside the drop in inscriptions activity.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoin-miner-revenue-daily\/embed\" title=\"Bitcoin Miner Revenue (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Owens","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"80%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$6,000","content":"MONEY"},{"type":"SNES","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Nintendo","content":"ORGANIZATION"},{"type":"Brotli","content":"PERSON"},{"type":"20","content":"DATE"},{"type":"1990s","content":"DATE"},{"type":"Ninjalerts","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"BRC","content":"ORGANIZATION"},{"type":"Pizza Ninja NFTs","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["BITCOIN","GAME"],"authors":["James Hunt","The Block"]}