{"summary":"An institutional crypto custody provider, KNØX, launches today with backing from Fidelity Investments Canada\nKNØX claims to provide up to 100% insurance for its custody solution via insurance giant Marsh\nAlex Daskalov, co-founder and CEO of KNØX, told The Block that the firm’s custodial service is “capable of insuring the full value of a customer’s assets”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/40851\/fidelity-backed-crypto-custody-provider-knox-launches-today-claiming-to-provide-up-to-100-insurance-via-marsh","publishDate":"2019-09-24T08:01:06","id":2311,"type":null,"title":"Fidelity-backed crypto custody provider KNØX launches today, claiming to provide up to 100% insurance via Marsh","category":["Custody"],"content":["A new Canada-based cryptocurrency custody provider has entered the marketplace, claiming to provide up to 100% insurance coverage for clients’ assets.","KNØX, which is backed by Fidelity Investments Canada, has officially launched, according to an announcement Tuesday. The startup said it recently raised $6.2 million in funding led by Initialized Capital and iNovia, with participation from Fidelity Investments Canada, FJ Labs, and Ferst Capital.","Alex Daskalov, co-founder and CEO of KNØX, told The Block that the round formally closed in June 2018, and that the firm had been operating “silently” since then. Now with the public launch, financial institutions, including asset managers, liquidity providers, and exchanges, can sign up to KNØX’s services.","KNØX said it provides up to 100% insurance coverage via its partner and insurance giant Marsh. “Our custodial service capable of insuring the full value of a customer's assets,” Daskalov told The Block.","Other offerings in the market give “a false sense of security,” KNØX claimed. Giving an example, it said:","“A customer with $100 million in digital assets may choose to keep their funds with a custodian holding $1 billion in assets, and advertising a $100 million insurance policy. The custodian is 10% insured, yet the customer is given a false sense of security believing that the $100 million policy will be able to cover their holdings. In fact, in the event of a total loss, the customer will be reimbursed $10 million, forced to accept a $90 million loss. The total limit is most commonly shared across clients.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nMarsh senior vice president, Jennifer Hustwitt, told The Block: “There are a wide range of risks related to crypto assets that remain uninsured, but the insurance market for digital assets is expanding. Over the past six months, we have seen a net expansion of insurance capacity as the technology continues to mature and regulatory frameworks emerge.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nKNØX is currently offering an insured cold storage custody service, and charges customers a fee based on their assets held under custody and based on the insurance allocation they select, which can be as high as 100% of the value of their holdings, Daskalov told The Block.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nKNØX said that it received the first \"multi-million dollar deposit\" of bitcoin (BTC) in the summer of 2018, and has been expanding operations since then.","Interestingly, <a href=\"https:\/\/www.theblockresearch.com\/fidelitys-bitcoin-custody-business-is-live-a-conversation-with-fidelity-digital-assets-head-tom-jessop-15048\" data-v-f87c67ca=\"\">Fidelity itself<\/a> officially launched its bitcoin custodial service earlier this year. Such services continue to grow. Last month, John Dantoni of The Block <a href=\"https:\/\/www.theblockresearch.com\/mapping-out-custody-services-across-the-blockchain-ecosystem-37822\" data-v-f87c67ca=\"\">mapped out<\/a> custody services across the blockchain ecosystem and found that at least 29 companies are operating in the space. Coinbase Custody alone, for instance, manages over $7 billion in assets under its custody with its recent acquisition of Xapo’s institutional business. Other companies include BitGo, Anchorage and Gemini, et al."],"hashtag":[]}