{"summary":"Neon Machine&#x27;s game is expected to launch next year after first becoming available to paying customers in December.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/259283\/call-of-duty-style-crypto-video-game-shrapnel-raises-20-million","publishDate":"2023-10-25T09:15:32","id":2316,"type":null,"title":"Call of Duty-style crypto video game &#x27;Shrapnel&#x27; raises $20 million","category":["METAVERSE & NFT"],"content":["<span data-v-f87c67ca=\"\">The arms race to build the first high-quality AAA blockchain video game that can stack up against titles popular on consoles like Playstation and Xbox has been raging for quite some time with no clear leader to emerge despite some intriguing candidates.<\/span>","<span data-v-f87c67ca=\"\">One of the space’s leading contenders, however, “Shrapnel,” has secured some additional funding that could help improve the game’s chances of being a hit with consumers. The company developing “Shrapnel,” Neon Machine, has raised $20 million in Series A financing with Polychain Capital leading the round.<\/span>","<span data-v-f87c67ca=\"\">Griffin Gaming Partners, Brevan Howard Digital, Franklin Templeton, <\/span><span data-v-f87c67ca=\"\">IOSG Ventures,<\/span><span data-v-f87c67ca=\"\"> and Tess Ventures also participated. This latest raise follows a 2021 seed round of $10.5 million, coming at a time when VC funding <a href=\"https:\/\/www.theblock.co\/post\/248626\/crypto-vc-funding-two-half-year-low\" data-v-f87c67ca=\"\">has fallen<\/a>.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">“Shrapnel” is a first-person shooter game akin to the wildly popular and mega successful Call of Duty franchise and created using Unreal Engine 5. The game is expected to launch in December, first to paid users, before eventually evolving into a free-to-play game available to the general public in 2024.<\/span>","<span data-v-f87c67ca=\"\">“This funding comes at a critical time for the team as they begin incremental playable releases over the coming months,” Neon said in a statement. “Key upcoming milestones include launching the Shrapnel Marketplace, where in-game items will be purchasable and tradable, as well as further developing its creator tools for players to build skins, maps, and other in-game items.”<\/span>","Other high-profile blockchain gaming projects that hope to deliver AAA-level gameplay include \"Illuvium\" and \"<a href=\"https:\/\/www.theblock.co\/post\/241558\/star-atlas-pitches-harvesting-cash-from-mobile-gamers-golden-tickets-in-fight-for-survival\" data-v-f87c67ca=\"\">Star Atlas<\/a>\"","<span data-v-f87c67ca=\"\">The team developing \"Shrapnel\" has worked on games for high-profile brands such as Halo, Call of Duty and Star Wars, the company said in its statement. “Shrapnel” CEO Mark Long said the vision is to create a “<\/span><span data-v-f87c67ca=\"\">blockbuster-quality shooter where players truly own and create game assets.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tess Ventures","content":"ORGANIZATION"},{"type":"Brevan Howard Digital","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Star Wars","content":"ORGANIZATION"},{"type":"Shrapnel Marketplace","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"$20 million","content":"MONEY"},{"type":"$10.5 million","content":"MONEY"},{"type":"” Neon Machine","content":"ORGANIZATION"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"Mark Long","content":"PERSON"},{"type":"Griffin Gaming Partners","content":"ORGANIZATION"}],"hashtag":["ASSET MANAGERS","GAME"],"authors":["RT Watson","The Block"]}