{"summary":"Bitcoin was trading at around $28,200, up about 2.4% over the past week. \nArbitrum’s ARB fell over 7% following news that the Arbitrum Foundation had sold ARB before a community vote had ratified its budget. ","author":["Adam Morgan McCarthy","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/224434\/crypto-prices-steady-arbirtrumdao-drama-whats-coming-markets","publishDate":"2023-04-02T15:43:25","id":2317,"type":null,"title":"Crypto prices steady, Arbitrum DAO drama and what&#x27;s coming down the line in markets","category":["Markets"],"content":["Crypto prices shrugged off the Commodity Futures Trading Commission's case against Binance early in the week as bitcoin clocked its best quarter since 2021.","Bitcoin was trading at $28,200, up about 2.6% over the past week, according to Coinbase data via TradingView.&nbsp;The first quarter of the year saw bitcoin jump more than 70% as risk assets rallied, leading to its best quarter since the first of 2021.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/price-performance-ytd\/embed\" title=\"Price Performance (YTD)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Binance and CEO Changpeng Zhao are being <a href=\"https:\/\/www.theblock.co\/post\/223015\/cftc-sues-binance\" data-v-f87c67ca=\"\">sued<\/a> by the CFTC for allegedly violating federal laws and not registering the exchange in the U.S.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\"> The r<\/span>egulator's move caused crypto prices to dip at the top of the week before shrugging off the news. The BNB coin fell about 3% to $314 over the past week.","Ether was up about 3.2% over the past seven days, trading around $1,800. Ripple's XRP added around 18% <a href=\"https:\/\/www.theblock.co\/post\/217017\/ripple-industry-wait-to-see-if-xrp-case-will-be-a-small-splash-or-a-tsunami-for-crypto\" data-v-f87c67ca=\"\">following news from its case with the SEC<\/a>, although a verdict is still some time off. Cardano's ADA added over 8%, and dogecoin jumped 7.5% in the same period.","The price of ARB fell to $1.18, down 7.2% over the past 24 hours, according to data via <a href=\"https:\/\/www.coingecko.com\/en\/coins\/arbitrum\" data-v-f87c67ca=\"\">CoinGecko<\/a>.","The drop followed the <a href=\"https:\/\/www.theblock.co\/post\/224444\/arbitrum-sells-tokens-aip1\" data-v-f87c67ca=\"\">news<\/a> that the Arbitrum Foundation had begun selling ARB tokens for stablecoins before the community had formally ratified its budget.&nbsp;","With the first quarter of 2023 over and done with, several <a href=\"https:\/\/www.bls.gov\/ces\/publications\/news-release-schedule.htm#:~:text=*%20The%20Employment%20Situation%20report%20is,the%2012th%20of%20the%20month.\" data-v-f87c67ca=\"\">key economic indicators<\/a> lie ahead in April for the U.S. Traders and the Fed will keenly watch next Friday's U.S. jobs report. Any signs of a softening labor market could impact interest rate expectations.&nbsp;","Inflation data for March on April 12 will also prove pivotal to any potential Fed pivots or pauses. An advanced estimate of first-quarter GDP will be released on April 27.&nbsp;","There's no Fed decision in April, with the next FOMC interest rate decision expected on May 3. The CME's FedWatch tool <a href=\"https:\/\/www.cmegroup.com\/markets\/interest-rates\/cme-fedwatch-tool.html\" data-v-f87c67ca=\"\">shows<\/a> markets are split on whether the Fed will pause or increase by 25 basis points again.&nbsp;"],"hashtag":["BITCOIN","BNB","CRYPTO MOVERS","CZ","ECONOMIC INDICATORS","EQUITY MOVERS","ETHEREUM"]}