{"summary":"The race to build the world’s most suitable zk-EVM is very much underway, with Scroll reaching its first milestone.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215343\/scrolls-zk-evm-layer-2-goes-live-on-ethereums-goerli-testnet","publishDate":"2023-02-27T13:17:57","id":232,"type":null,"title":"Scroll’s zk-EVM Layer 2 goes live on Ethereum’s Goerli testnet","category":["CRYPTO ECOSYSTEMS"],"content":["Scroll released a testnet version of its Ethereum Layer 2 network on the Goerli testnet, moving the zk-EVM from a pre-alpha to an alpha testing phase.","Until now, Scroll was available to try out on a testnet that was built on the project’s own clone of Ethereum. By moving from this to running on a public testnet, Scroll has taken a step forward in its path toward a full launch in the second half of this year.","“We’ve been testing with mock mainnet transactions on our pre-alpha testnet but by having a more public testnet you can have more time to battle test it and make sure that everything is working properly — because of the huge difficulty of building a system like this,” said a researcher known as Pseudotheos at Scroll, in an interview.","The testnet will be permissionless but it will remain largely centralized, particularly in terms of the computers that do the complex processing required for the network to operate. The code for the network will be open-source, meaning that the network can start building resiliency. Also, a bridge has been set up to transfer assets between the Goerli testnet and Scroll.","Scroll has been working on its network for two years and currently has 60 team members, alongside a wider network of external contributors.","Zk-EVMs are Layer 2 networks built on Ethereum that use zero-knowledge proofs to achieve scalability. The EVM part refers to the Ethereum Virtual Machine (EVM), the bit that runs applications instead of simply processing them. By being EVM-compatible, these networks are able to support Ethereum applications while also running at scale.","There are two functions that make a zk-EVM work. First the <i data-v-f87c67ca=\"\">sequencer<\/i> batches up a lot of transactions. Then the <i data-v-f87c67ca=\"\">prover<\/i> does the complex zero-knowledge proof calculations to generate a proof that these transactions are all legitimate. This proof is then broadcast to the Ethereum network and the transactions get approved.&nbsp;","Right now, Scroll is getting its network out in public so it can be battle tested but at the same time, it’s working on decentralizing the sequencer and the prover — a key requirement of making the network decentralized.","“We want to build the most robust and secure zk-EVM out there and that’s why we’re doubling down and working on a decentralized prover and sequencer network. After mainnet, that’s our main priority,” said Pseudotheos. “After the zk-EVM gets out the door, we’re not even close to done. We have years of work cut out for us, as far as properly decentralizing — but that’s our main priority.”","Scroll has an in-house security team trying to make sure the network is secure. It has also frozen some of its codebase and sent it to an auditor for review. It plans to have further audits down the line.","There are two main ways that zk-EVMs can be built (technically more in-between, but let’s not go too deep).","On one side, you can use a programming language designed for zero-knowledge proofs and then have to translate Ethereum applications from Solidity — Ethereum’s native language — to the new language. This is easier to build but makes life harder for developers porting from Ethereum to the platform.","On the other side, you can build a zk-EVM to use the same code currently used for Ethereum applications. This makes it really easy to port applications over to the network. However, this is a much harder task because zero-knowledge proofs work in a very different way to how the Ethereum Virtual Machine&nbsp;operates —&nbsp;so you have to code them to work in a way they’re not designed to.","Scroll is taking the more challenging route to building a zk-EVM, but, it hopes, one that will be more compatible with Ethereum and should spearhead greater adoption.&nbsp;","“When the EVM was designed, it was not designed for zero-knowledge proofs in mind at all. The way you write a zero-knowledge program is completely different from the way you write traditional software,” said Pseudotheos.","This approach is kind of like writing a sentence in English while complying with the syntax rules of another language. Tricky but not impossible.","It has benefits: it should make it much easier for Ethereum developers to build on Scroll and port their projects to it. And that’s why Scroll reckons the hard graft will be worth it.","Polygon is also working on this type of zk-EVM, while StarkWare is taking the opposite approach and zkSync is somewhere between the two.","While Scroll is neck and neck with multiple other projects aiming to bring out a zk-EVM, Pseudotheos doesn’t think being first to market will make much of a difference. They pointed to Arbitrum and Optimism, which were released a few months apart — yet are both still finding traction.&nbsp;","“It doesn't matter who’s first,” they said. “I think that there’s room for co-existence, especially as a lot of these rollups are taking different approaches and their nuances with [zero-knowledge proofs].”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"second half of this year","content":"DATE"},{"type":"Pseudotheos","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Scroll","content":"ORGANIZATION"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"EVM","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ZKEVM"],"authors":["Tim Copeland","The Block"]}