{"summary":"SEC chair Gary Gensler has directed his staff to examine ways to increase order-by-order competition and mitigate the conflict of payment-for-order-flow practices.\nThe staff is considering recommending auction practices for equity markets. \nThe process came after last year’s “meme stocks” controversy. ","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/150934\/secs-gensler-floats-routing-equity-trades-to-auctions-to-increase-competition","publishDate":"2022-06-08T15:18:39","id":232,"type":null,"title":"SEC&#x27;s Gensler floats routing equity trades to auctions to increase competition","category":["Market Structure"],"content":["Securities and Exchange Commission Chair Gary Gensler is considering new requirements to increase order-by-order competition.","In remarks delivered at the Piper Sandler Global Exchange Conference today Gensler said he's directed his staff to make recommendations around how to enhance order-by-order competition and mitigate conflicts that can arise when platforms use PFOF practices or rebates. That includes a potential auction practice unless investors are getting midpoint or better prices.","\"The listed options exchanges have operated auctions for retail orders for many years,\" said Gensler. \"I’ve asked staff, in considering any recommendations for stock auctions, to draw upon lessons from the options market, focusing on assuring full competition among all market participants to provide the best prices for retail investors.\"","To mitigate PFOF conflicts, Gensler has also asked his staff to consider whether exchange fees and rebates should be more transparent.&nbsp;","In 2020, the SEC began requiring broker-dealers to report information related to how they route trades. The disclosures <a href=\"https:\/\/www.theblockcrypto.com\/post\/68875\/not-just-robinhood-brokers-combined-big-traders\" data-v-f87c67ca=\"\">shed light<\/a> on the way a number of firms utilized payment for order flow (PFOF) practices when an electronic market maker compensates a broker for client orders.","Because brokers are required to route orders according to best price for the trader rather than according to who's paying for the order flow, the SEC has scrutinized the practice.&nbsp; Firms like Robinhood made millions each quarter utilizing PFOF practices – and drew the ire of the regulator.","Robinhood <a href=\"https:\/\/www.theblockcrypto.com\/linked\/88235\/robinhood-sec-settlement-charges\" data-v-f87c67ca=\"\">settled<\/a> with the SEC for $65 million for failure to disclose its PFOF activity and failure \"to satisfy its duty to seek the best reasonably available terms to execute customer orders.\"","An auction system would see trading firms compete to fill the orders as in the options market. The idea is that this format would increase competition and ensure retail traders receive a better price compared to when their orders are routed to a handful of large electronic trading firms that are paying the broker.&nbsp;","Gensler was clear in his remarks that this is the start of the Commission's consideration, and there's a road of procedures and comment periods before any rule changes come.&nbsp;","\"In terms of payment of order flow and rebates, as I say, they present inherent conflicts to the market,\" he said. \"Three other jurisdictions and a fourth, a big one, Europe, is considering getting rid of them. So I continue to ask staff, 'what should we do there?' But as we put this all together, we're going to put it out to notice and comment and obviously hear from the public as well.\"","As the Wall Street Journal <a href=\"https:\/\/www.wsj.com\/articles\/robinhood-executive-attacks-secs-plans-to-shake-up-stock-trading-rules-11654701401?mod=article_inline\" data-v-f87c67ca=\"\">reported<\/a>, Robinhood is already gearing up to push back on the SEC's stance.","Robinhood's Chief Legal Officer Dan Gallagher said he was concerned the SEC's actions would \"muck with\" an otherwise favorable climate for retail investment that includes zero-commission trading and swift order execution.&nbsp;"],"hashtag":["ROBINHOOD","SEC"]}