{"summary":"The U.S. Securities and Exchange Commission is also investigating Avraham Eisenberg’s role in extracting $110 million from the Mango Markets protocol. \nEisenberg has already been charged with various market manipulation offences by the Commodity Futures Trading Commission and the Department of Justice.","author":["Benjamin Robertson","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/200339\/sec-also-investigating-mango-exploiter-eisenberg-cftc-commissioner","publishDate":"2023-01-10T03:13:01","id":2322,"type":null,"title":"SEC also investigating Mango exploiter Eisenberg: CFTC Commissioner","category":["People"],"content":["The U.S. Securities and Exchange Commission is also investigating self-confessed Mango Markets exploiter Avraham Eisenberg over his role in extracting $110 million from the decentralized protocol.&nbsp;","Kristin Johnson, a Commodity Futures Trading Commission commissioner, <a href=\"https:\/\/www.cftc.gov\/PressRoom\/SpeechesTestimony\/johnsonstatement010923\" data-v-f87c67ca=\"\">noted<\/a> the SEC's parallel investigation in a statement published Monday. The CFTC <a href=\"https:\/\/www.theblock.co\/post\/200255\/cftc-files-its-own-case-against-mango-markets-exploiter?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">filed<\/a> its charges against Eisenberg, alleging manipulation of the decentralized swaps markets.","A spokesperson for the SEC did not immediately respond to an email sent out of hours seeking comment.","Eisenberg is currently in custody after the Department of Justice <a href=\"https:\/\/www.theblock.co\/post\/198172\/mango-markets-exploiter-arrested-in-puerto-rico-for-alleged-market-manipulation\" data-v-f87c67ca=\"\">filed<\/a> criminal charges against him last month. He <a href=\"https:\/\/www.theblock.co\/post\/177424\/mango-markets-exploiter-comes-clean-claims-all-actions-were-legal\" data-v-f87c67ca=\"\">admitted<\/a> on Twitter to being responsible for draining most of Mango Markets' capital, arguing that his trading strategy was legal and used the protocol as designed.&nbsp;","Investigators allege he illegally manipulated the price of Mango's own token, MNGO, to make substantial illicit profits."],"hashtag":["CRIME","DEXS","EXPLOITS","SMART CONTRACTS"]}