{"summary":"Talos is now a unicorn with $105 million in new funding from Citigroup, Wells Fargo and others.\nThe crypto trading infrastructure firm plans to expand in Europe and the Asia Pacific region.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/145995\/crypto-firm-talos-raises-series-b-citi-wells-fargo","publishDate":"2022-05-10T06:34:21","id":2324,"type":null,"title":"Citi, Wells Fargo join $105 million round for crypto trading infra firm Talos","category":["Infrastructure"],"content":["Talos, a crypto trading infrastructure firm that provides tooling for institutional investors across the trade lifecycle, has raised $105 million in a Series B round as it plans global expansion.","Growth investor General Atlantic led the round, with Citigroup, Wells Fargo Strategic Capital, BNY Mellon, DRW, SCB 10x, Stripes, Voyager and others joining as new investors, Talos announced on Tuesday.","Previous investors, including Andreessen Horowitz (a16z), PayPal Ventures, Castle Island Ventures and Fidelity Investments, also participated in the round. The round brings Talos's valuation to $1.25 billion. The firm raised $40 million in a Series A round last year.","Talos provides tooling for institutional crypto investors across pre-trade, execution and post-trade stages, Samar Sen, head of Asia Pacific at Talos, told The Block in an interview. In the pre-trade stage, the firm aggregates liquidity from multiple venues, including exchanges and over-the-counter trading desks. For the execution stage, Talos uses algorithms and smart order routers on its platform. And on the post-trade side, the firm provides settlement services.","Talos was founded in 2018 in New York and now has offices across the globe. With fresh capital in hand, the firm specifically plans expansion in Europe and Asia Pacific. \"We have been growing organically in these regions but now want to scale our reach through outbound strategies,\" said Sen.","To that end, Talos also plans to increase its current headcount of 80, according to Sen.","Sen declined to share absolute numbers on trading volumes Talos has supported on its platform to date, but said it grew 20x in the past year and its end-user base is now more than 20 million.","Talos currently supports centralized crypto trading venues on its platform, but it is also exploring launching support for decentralized finance (DeFi) platforms, said Sen.","Talos's close competitors were recently acquired by big crypto firms, including <a href=\"https:\/\/www.theblockcrypto.com\/linked\/67458\/why-coinbases-acquisition-of-tagomi-could-pose-neutrality-problems-according-to-su-zhu\" data-v-f87c67ca=\"\">Tagomi by Coinbase<\/a> and <a href=\"https:\/\/www.theblockcrypto.com\/linked\/130845\/gemini-acquires-crypto-trading-platform-in-push-to-offer-prime-services\" data-v-f87c67ca=\"\">Omniex by Gemini<\/a>. As for Talos's exit plan, it intends to remain an independent company for the near future, CEO Anton Katz said in an emailed statement.","\"We enjoy being independent and the ability to work with the wide-range of different service providers and entities across the entire digital asset ecosystem,\" said Katz."],"hashtag":["BNY MELLON"]}