{"summary":"Crypto exchange LGO is taking what it views as a more traditional route to assure users that its exchange and token are secure. The company claims it is","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/33518\/lgo-receives-big-four-audit-with-similar-crypto-examinations-on-the-rise","publishDate":"2019-07-25T18:21:33","id":2325,"type":null,"title":"LGO receives Big Four audit, with similar crypto examinations on the rise","category":["STARTUPS"],"content":["<span data-v-f87c67ca=\"\">Crypto exchange LGO is taking what it views as a more traditional route to assure users that its exchange and token are secure. The company claims it is the first Eurozone crypto company to be audited by Big Four auditing firm PwC.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">PwC’s French branch reviewed the company’s financial statements for several months, establishing ownership of cryptocurrencies and tokens the company received and created during its ICO.&nbsp;<\/span>","LGO's journey, which was long and marked by the difficulties proving ownership of assets during the audit period, reflects the difficulties auditors face in examining cryptocurrency firms. <span data-v-f87c67ca=\"\">PwC’s <\/span><a href=\"https:\/\/press.pwc.com\/News-releases\/ALL\/pwc-launches-solution-supporting-audit-of-cryptocurrency\/s\/5e3ec5e1-0cf3-4a75-b5af-4f9d23402e88\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Halo tool<\/span><\/a><span data-v-f87c67ca=\"\">, released late June of this year, solved that problem by corroborating private keys to public access. <\/span><span data-v-f87c67ca=\"\">It also corroborates information on blockchain transactions and balances through “interrogating” the ledger.<\/span>","<span data-v-f87c67ca=\"\">Indeed, crypto auditing is known to present further problems, according to Jeremy Nau, a manager of accounting firm Armanino’s blockchain practice. It can be challenging to convince regulators that funds on an exchange even exist. Nau’s firm does so by corroborating on-chain transactions as money moves from place to place.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Unreliable data and fake volumes also introduce headaches. In a crypto to crypto transaction, there isn't a U.S. dollar amount applied, so an auditor needs to apply a price, but with large and often faked volumes that can be challenging, according to Nau. He said an auditor relying on blockchain evidence can utilize some tools, but that it's still a challenge given the sheer variety of blockchains in existence. In some cases, auditors must run their own nodes to obtain reliable data, which can be difficult for those who come from an accounting background rather than crypto or computer science.<\/span>","<span data-v-f87c67ca=\"\">“The tools surrounding these pretty immature blockchains are very hard to use and you have to basically be a computer scientist to use it,” he said. “The skill set is completely changing from understanding numbers and financial statements to needing to be an auditor as well as really good with computers.”&nbsp;<\/span>","Indeed, Nau said the accounting industry is moving to a place where it's seeking to hire both skillsets. Many firms have a blockchain unit, according to Nau, and some are actively hiring those with blockchain or computer technology skills.&nbsp;","<span data-v-f87c67ca=\"\">LGO CEO Hugo Renaudin said partnering with a Big Four audit firm like PwC gives the exchange an institutional stamp of approval, positioning them as an institutional grade partner for both traditional and crypto clients. But that might be marketing spin. Nau<\/span><span data-v-f87c67ca=\"\"> said an audit isn’t completed just to go the extra mile, it’s required for certain money transmitter licenses. Nau said for the most part, no one does an audit just for fun.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Most of these companies are getting an audit because they need to, either by a legal, regulatory, investor or user demand,” he said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Renaudin said he thinks other crypto companies will soon follow suit, and some already have. U.S.-based exchange Gemini <a href=\"https:\/\/bitsonline.com\/gemini-exchange-audit-deloitte\/\" data-v-f87c67ca=\"\">announced it completed a SOC2<\/a>, a security and privacy focused test, with Big Four player Deloitte at the start of this year.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"PwC","content":"ORGANIZATION"},{"type":"Jeremy Nau","content":"PERSON"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Renaudin","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Nau","content":"ORGANIZATION"},{"type":"Hugo Renaudin","content":"PERSON"},{"type":"Armanino","content":"ORGANIZATION"},{"type":"Deloitte","content":"ORGANIZATION"},{"type":"late June","content":"DATE"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}