{"summary":"Virtual reality and gaming industry leader Carmack has resigned as consulting CTO at Meta. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195940\/meta-loses-virtual-reality-virtuoso-john-carmack","publishDate":"2022-12-17T05:29:54","id":2326,"type":null,"title":"Meta loses virtual reality virtuoso John Carmack","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">John Carmack, a virtual reality trailblazer and co-founder of video game developer id Software, has resigned as consulting chief technology officer at Meta.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We have a ridiculous amount of people and resources, but we constantly self-sabotage and squander effort,” Carmack <a href=\"https:\/\/www.facebook.com\/permalink.php?story_fbid=pfbid0iPixEvPJQGzNa6t2x6HUL5TYqfmKGqSgfkBg6QaTyHF5frXQi7eLGxC7uPQv5U5jl&amp;id=100006735798590\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">wrote<\/a> in a Facebook post, sharing his internal message to the Meta team after it was leaked. “There is no way to sugar coat this; I think our organization is operating at half the effectiveness that would make me happy.”<\/span>","<span data-v-f87c67ca=\"\">He added: “I wearied of the fight and have my own startup to run.”<\/span>","<span data-v-f87c67ca=\"\">Carmack joined VR hardware and software producer Oculus in 2013, before it was acquired by Meta (then Facebook) the following year. He reduced his role to consulting CTO in 2019 to invest more time in his Keen Technologies startup, focusing on artificial intelligence.<\/span>","<span data-v-f87c67ca=\"\">Carmack is known for developing many video games, including Doom, Quake, Wolfenstein 3D and Commander Keen.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Carmack","content":"PERSON"},{"type":"John Carmack","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"Meta","content":"ORGANIZATION"},{"type":"CTO","content":"ORGANIZATION"},{"type":"2019","content":"DATE"}],"hashtag":[],"authors":["Inbar Preiss","The Block"]}