{"summary":"MicroStrategy&#x27;s bitcoin holdings are in profit for the first time since June 2022. But it likely wouldn&#x27;t be able to sell for a profit yet.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225643\/microstrategys-bitcoin-michael-saylor","publishDate":"2023-04-11T05:22:47","id":2329,"type":null,"title":"MicroStrategy&#x27;s $4 billion bitcoin bet in the green as price hits $30,000","category":["COMPANIES"],"content":["Thanks to the latest rally in the crypto market, MicroStrategy's bitcoin holdings are in the green, on paper at least.","Bitcoin was trading at $30,103 by 4:40 a.m. EST, up 1.6% over the past 10 hours, according to Binance data via TradingView. The cryptocurrency is up 82% year-to-date and recently registered its best quarterly increase in two years. The rise in bitcoin has been linked to the prospect of interest rate increases peaking amid banking stress in the U.S. and across Europe.","The surge in prices has pushed the price of bitcoin above MicroStrategy's average purchase price of $29,803. While that means the company is technically up, it's only by a few hundreds dollars, which is a small buffer. Since the company owns so much bitcoin, if it was sold in a short period of time, it would likely push the price down significantly in the process. This means the company likely wouldn't be able to sell all of its bitcoin for a profit yet if it wanted to.","MicroStrategy's bitcoin holdings have been in the red since last June. At the time, the collapse of crypto lender Celsius and the failure of crypto hedge fund Three Arrows Capital propelled the markets down even further. During this time, the U.S. Federal Reserve also increased interest rates to combat rising inflation.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/public-companies\/microstrategy-bitcoin-holdings\/embed\" title=\"MicroStrategy Bitcoin Holdings\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Recent bitcoin purchases lowered MicroStrategy's average purchase price. MicroStrategy <a href=\"https:\/\/www.theblock.co\/post\/225009\/microstragey-bitcoin-investment-saylor\" data-v-f87c67ca=\"\">added<\/a> 1,045 bitcoin on April 5, following up on a March 27 <a href=\"https:\/\/www.theblock.co\/post\/222948\/microstrategy-buys-bitcoin-prepays-silvergate-loan\" data-v-f87c67ca=\"\">announcement<\/a> that stated it had bought 6,455 bitcoin.&nbsp;","MicroStrategy and its subsidiaries now hold approximately 140,000 bitcoins, at an aggregate purchase price of approximately $4.17 billion, according to The Block Research data.&nbsp;","Shares in the firm are up 114% year-to-date, outperforming bitcoin, and are trading at $312.78.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"TradingView","content":"ORGANIZATION"},{"type":"April 5","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"4:40 a.m. EST","content":"TIME"},{"type":"$30,103","content":"MONEY"},{"type":"1.6%","content":"PERCENT"},{"type":"March 27","content":"DATE"},{"type":"last June","content":"DATE"},{"type":"114%","content":"PERCENT"},{"type":"82%","content":"PERCENT"},{"type":"Europe","content":"LOCATION"},{"type":"hundreds dollars","content":"MONEY"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"$312.78","content":"MONEY"},{"type":"$29,803","content":"MONEY"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"$4.17 billion","content":"MONEY"}],"hashtag":["BITCOIN","EQUITY MOVERS","MOVES"],"authors":["Adam Morgan McCarthy","The Block"]}