{"summary":"Crypto firm Sparkster and its CEO agreed to pay over $35 in a settlement with the SEC over an an unregistered crypto asset offering.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/171092\/sparkster-and-its-ceo-to-pay-harmed-investors-35-million-in-sec-settlement","publishDate":"2022-09-19T15:55:43","id":2332,"type":null,"title":"Sparkster and its CEO to pay &#x27;harmed investors&#x27; $35 million in SEC settlement","category":["LEGAL"],"content":["Crypto firm Sparkster and its CEO Sajjad Daya agreed to pay more than $35 million in a settlement with the U.S. Securities and Exchange Commission (SEC) over an \"unregistered crypto asset offering\" in 2018.","The SEC issued a cease-and-desist <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2022-167\" data-v-f87c67ca=\"\">order<\/a> Monday against the two, claiming that they raised $30 million from 4,000 investors by offering them \"crypto asset securities called SPRK tokens.\"","The money will be put in a fund to be distributed to harmed investors.","“The resolution with Sparkster and Daya allows the SEC to return a significant amount of money to investors and requires additional measures to protect investors, including the disabling of tokens to prevent their future sale,” said Carolyn M. Welshhans, associate director of the SEC’s Division of Enforcement.","\"Without admitting or denying the SEC’s findings, Sparkster agreed to destroy its remaining tokens, request the removal of its tokens from trading platforms, and publish the SEC’s order on its website and social media channels,\" the SEC said in a press release.","Daya also agreed to not participate in offerings of crypto asset securities for five years.","In relation to this case, the SEC also <a href=\"https:\/\/www.theblock.co\/post\/171042\/sec-files-ico-suit-against-crypto-influencer-ian-balina\" data-v-f87c67ca=\"\">charged crypto investor and YouTuber Ian Balina<\/a> over his involvement.","Balina promoted SPRK on social media without disclosing that he would get a 30% bonus on the $5 million in tokens he bought, the SEC said.","Sparkster and Daya were found in violation of the offering registration provisions of the Securities Act of 1933.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Daya","content":"ORGANIZATION"},{"type":"Sajjad Daya","content":"ORGANIZATION"},{"type":"$35 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"YouTuber Ian Balina","content":"PERSON"},{"type":"$30 million","content":"MONEY"},{"type":"30%","content":"PERCENT"},{"type":"1933","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Sparkster","content":"PERSON"},{"type":"Carolyn M. Welshhans","content":"PERSON"},{"type":"SEC’s Division of Enforcement","content":"ORGANIZATION"},{"type":"$5 million","content":"MONEY"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}