{"summary":"U.K.’s central bank formally issued a discussion paper on digital currency today\n“We’re interested in CBDC because this is a period of significant change in money and payments,” said the Bank of England\nMark Carney, Governor of the Bank of England, said if CBDC were to be introduced, it would need to be “very carefully” designed.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/58530\/bank-of-england-issues-discussion-paper-on-central-bank-digital-currency","publishDate":"2020-03-12T10:06:56","id":2333,"type":null,"title":"Bank of England issues discussion paper on central bank digital currency","category":["Cryptocurrency"],"content":["The Bank of England, the U.K.’s central bank, has today formally issued a discussion paper on digital currency.","The <a href=\"https:\/\/www.bankofengland.co.uk\/-\/media\/boe\/files\/paper\/2020\/central-bank-digital-currency-opportunities-challenges-and-design.pdf?la=en&amp;hash=DFAD18646A77C00772AF1C5B18E63E71F68E4593\" data-v-f87c67ca=\"\">57-page paper<\/a> outlines an “illustrative model” of central bank digital currency (CBDC), designed to store value and enable payments by households and businesses.","“We’re interested in CBDC because this is a period of significant change in money and payments,” <a href=\"https:\/\/www.bankofengland.co.uk\/paper\/2020\/central-bank-digital-currency-opportunities-challenges-and-design-discussion-paper\" data-v-f87c67ca=\"\">said<\/a> the Bank of England. “The use of banknotes – the Bank’s most accessible form of money – is declining, and use of privately issued money continues to increase, with technological changes driving innovation.”","CBDC could present a number of opportunities, according to the central bank, including a “more resilient” payments landscape and a “building block” for better cross-border payments in the future.","But it would also introduce challenges and risks, such as impacts on monetary policy and financial stability.","“If significant deposit balances moved from banks to CBDC, there could be implications for the balance sheets of both the Bank of England and commercial banks,\" the central bank explained. \"This could affect the amount of credit provided by banks to the wider economy, and in turn, how the Bank implements monetary policy and supports financial stability.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Designing a CBDC<\/strong><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","Notably, the Bank of England acknowledges that a CBDC would be “an innovation in both the form of money provided to the public and the payments infrastructure on which payments can be made.”","While the central bank has not yet made a decision on whether to introduce CBDC, it said if it were to issue a digital currency, “it would be denominated in pounds sterling, so £10 of CBDC would always be worth the same as a £10 banknote.\"","\"Any CBDC would be introduced alongside — rather than replacing — cash and commercial bank deposits,” it concluded.","Mark Carney, Governor of the Bank of England, said if CBDC were to be introduced, it would need to be \"very carefully\" designed.","\"We need to consider the questions carefully and in good time, alongside Her Majesty's Government,\" said Carney. \"This paper is intended to be the basis for further research and dialogue between the Bank and the payments industry, technology providers, payments users, financial institutions, academics, other central banks, and public authorities. I encourage anyone with an interest on these fundamental issues to respond to the Bank on the potential benefits, risks, and practicality of CBDC.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nEarlier this year, the Bank of England <a href=\"https:\/\/www.theblockcrypto.com\/post\/53545\/uks-central-bank-to-explore-digital-currency\" data-v-f87c67ca=\"\">also created a group<\/a> with five other central banks – the Bank of Canada, the Bank of Japan, the European Central Bank, the Sveriges Riksbank (Sweden) and the Swiss National Bank, to explore potential uses cases for CBDCs.","The discussion paper is open to the public for comments until June 12, 2020."],"hashtag":[]}