{"summary":"Lael Brainard, vice chair of the Federal Reserve, is calling for more regulation on crypto while it&#x27;s still contained.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156567\/federal-reserves-brainard-urges-crypto-regulation-before-industry-becomes-more-entangled-with-the-financial-system","publishDate":"2022-07-08T10:28:25","id":2333,"type":null,"title":"Federal Reserve&#x27;s Brainard urges crypto regulation before industry becomes more entangled with the financial system","category":["POLICY"],"content":["Lael Brainard, vice chair of the US Federal Reserve, is calling for more regulation on crypto while it's still contained.","\"To date, crypto has not become sufficiently interconnected with the core financial system to pose broad systemic risk,\" Brainard said in a July 8 <a href=\"https:\/\/www.federalreserve.gov\/newsevents\/speech\/brainard20220708a.htm\" data-v-f87c67ca=\"\">speech<\/a> at the Bank of England Conference. However, she continued:&nbsp;","\"It is important that the foundations for sound regulation of the crypto financial system be established now before the crypto ecosystem becomes so large or interconnected that it might pose risks to the stability of the broader financial system.\"","Specifically, Brainard highlighted stablecoins and the increasing involvement of banks in crypto activities as areas of concern due to \"heightened risks of spillovers to the core financial system.\"","As to policy proposals, Brainard was relatively vague. She instead noted that many of the costs of traditional financial services were worthwhile. \"When a service appears cheaper or more efficient, it is important to understand whether this benefit is due to genuine innovation or regulatory noncompliance,\" she said.","Brainard's comments come following months of shock and awe within the crypto industry. A bear market in crypto assets has led to the collapse of a series of crypto projects. The first major fall was TerraUSD, an <a href=\"https:\/\/www.theblock.co\/post\/146691\/terra-disaster-fuels-work-of-congress-on-stablecoin-legislation\" data-v-f87c67ca=\"\">algorithmic stablecoin that slipped its peg<\/a>. The widespread issues across the crypto industry have led many policymakers to become <a href=\"https:\/\/www.theblock.co\/post\/152262\/following-celsius-freeze-us-policymakers-are-on-high-alert-for-crypto-systemic-contagion\" data-v-f87c67ca=\"\">keenly alert to any signs of further systemic contagion<\/a>.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"US Federal Reserve","content":"ORGANIZATION"},{"type":"Bank of England Conference","content":"ORGANIZATION"},{"type":"July 8","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Lael Brainard","content":"PERSON"},{"type":"Brainard","content":"PERSON"}],"hashtag":["FEDERAL RESERVE"],"authors":["Kollen Post","The Block"]}