{"summary":"Twitter will expand new trials of its Tweet Tiles feature to five NFT platforms, which will allow them to display NFTs directly within tweets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/178707\/rarible-magic-eden-join-twitter-pilot-to-embed-nfts-in-tweets","publishDate":"2022-10-28T06:00:04","id":2336,"type":null,"title":"Magic Eden, Rarible join Twitter pilot to embed NFTs in tweets","category":["NFTS"],"content":["Twitter will expand its trial of its Tweet Tiles feature to five NFT platforms, which will allow display of NFTs directly within tweets.","Marketplaces Rarible, Magic Eden, Dapper Labs and Jump.trade will join the pilot, making them the second batch of companies to test the new format.","Tweet Tiles are a way to attach customizable formats to a Tweet. They're still in the testing phase but Twitter is making a bit that the company can boost engagement with larger images, text and buttons.","The social media company first tested Tweet Tiles with news outlets The New York Times, The Wall Street Journal and The Guardian on Aug. 25.","The announcement is Twitter's latest NFT experiment. Twitter began rolling out its long-awaited NFT integration for profile pictures in January this year. Initially only available on Twitter Blue, its subscription service, the feature was rolled out across the platform in March.","The most common NFT profile pictures on Twitter. Source: <a href=\"https:\/\/www.nftinspect.xyz\/rank\/collections\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">NFT Inspect<\/a>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"January this year","content":"DATE"},{"type":"March","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Aug. 25","content":"DATE"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Dapper Labs","content":"ORGANIZATION"},{"type":"Magic Eden","content":"ORGANIZATION"}],"hashtag":["MAGIC EDEN","RARIBLE","TWITTER"],"authors":["Callan Quinn","The Block"]}