{"summary":"Bitcoin miner Riot reduced its power use in July, amid a heatwave in Texas, which led to an estimated 21% cut in bitcoin production.\nAt the same time, the company got $9.5 million in power credits, outweighing what it could have generated in mining revenues, according to its own estimates.","author":["Catarina Moura","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/161226\/riot-mined-28-less-bitcoin-in-july-and-earned-9-5-million-in-power-credits","publishDate":"2022-08-03T12:50:09","id":2336,"type":null,"title":"Riot mined 28% less bitcoin in July and earned $9.5 million in power credits","category":["Mining"],"content":["Crypto miner Riot reduced its bitcoin production in July by an estimated 21% as it powered down in response to the extreme heat in Texas and the state's grid operator's <a href=\"https:\/\/www.theblock.co\/post\/156974\/as-texas-grid-operator-calls-for-energy-conservation-some-bitcoin-miners-paused-operations\" data-v-f87c67ca=\"\">call for energy conservation<\/a>.","Overall, the company mined 28% less bitcoin compared with June, but it also earned an estimated $9.5 million in power credits, \"significantly outweighing the reduction in BTC mined,\" according to a statement from CEO Jason Les on Wednesday. Power cuts contributed, but were not the only factor in the reduction.","The energy credits amount to roughly 439 BTC, based on an average price of $21,634, which is higher than the additional mining revenues it could have had in July had it not powered down, Riot estimates.","\"When applied to anticipated power costs for the month, the power credits and other benefits are expected to effectively eliminate Riot’s power costs for July, further enhancing the company’s industry-leading financial strength amid a challenging macroeconomic environment for the industry,\" Les said.","In total, the company reduced operations by 11,717 megawatt-hours in July, which would be \"enough to power 13,121 average homes for one month,\" Les said.","Many Bitcoin miners in the state have set agreements with the Electric Reliability Council of Texas (ERCOT), which operates the state's power grid, to power down at peak energy demand times. Advocates say this kind of flexibility <a href=\"https:\/\/www.theblockcrypto.com\/news+\/145817\/bitcoiners-take-it-as-a-given-that-a-mining-rush-will-improve-texass-grid-not-everyone-is-convinced\" data-v-f87c67ca=\"\">can be an asset to the grid<\/a>.","Riot's current mining fleet of 40,311 machines has a hash rate capacity of 4.2 exahash per second (EH\/s). The company expects to reach 12.5 EH\/s of self-mining by the first quarter of 2023, as it expands capacity at its Whinstone Facility (which will ultimately grow to 400 megawatts).","Last month, Riot broke ground on the construction of its massive new <a href=\"https:\/\/www.theblock.co\/linked\/143773\/bitcoin-miner-riot-announces-massive-1-gigawatt-expansion-plan-in-texas\" data-v-f87c67ca=\"\">1-gigawatt site in Navarro County<\/a>, Texas.","It also ended a hosting agreement with Coinmint and shipped all of its remaining miners to the Whisnestone facility. About 12,146 machines are currently offline, as the redeployment process is underway.","\"As a result of this relocation of miners, the company expects to further reduce its cost of production through lower power costs and by eliminating all third-party hosting fees on its hosted mining fleet,\" the company said in a statement."],"hashtag":[]}