{"summary":"Caroline Ellison told a federal court in New York that she knowingly misled lenders about how much the firm had been borrowing, Bloomberg News reported.\nEllison said she and former FTX CEO Sam Bankman-Fried had agreed to hide the arrangement by creating false financial statements.","author":["Nathan Crooks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/197795\/caroline-ellison-tells-court-she-knowingly-misled-lenders-bloomberg","publishDate":"2022-12-23T16:43:16","id":2338,"type":null,"title":"Caroline Ellison tells court she knowingly misled lenders: Bloomberg","category":["Crypto Infrastructure"],"content":["Caroline Ellison, the former CEO of Alameda Research, told a federal court in New York that she knowingly misled lenders about how much the firm had been borrowing from the collapsed FTX crypto exchange and knew that her actions were wrong, Bloomberg News <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-12-23\/ellison-said-she-bankman-fried-agreed-to-mislead-ftx-lenders\" data-v-f87c67ca=\"\">reported<\/a>, citing a transcript of a plea hearing on Dec. 19.","\"From 2019 through 2022, I was aware that Alameda was provided access to a borrowing facility on FTX.com, the cryptocurrency exchange run by Mr. Bankman-Fried,” Ellison said, according to the transcript cited by Bloomberg. \"In practical terms, this arrangement permitted Alameda access to an unlimited line of credit without being required to post collateral, without having negative balances and without being subject to margin calls on FTX.com’s liquidation protocols.”","Ellison said she and former FTX CEO Sam Bankman-Fried had agreed to hide the arrangement by creating false financial statements and that she knew that Alameda accounts with negative balances signified the firm was borrowing funds from FTX customers.","Ellison and FTX co-founder and former CTO Gary Wang <a href=\"https:\/\/www.theblock.co\/post\/197573\/ellison-and-wang-guilty-pleas-unsealed-as-bankman-fried-granted-bail\" data-v-f87c67ca=\"\">pled guilty<\/a> to multiple charges earlier this week related to the collapse of Alameda and FTX. Bankman-Fried extradited to the U.S. from the Bahamas and appeared at federal court in New York on Thursday, where a judge said he'd be released on a $250 million bond package while he awaits trial.&nbsp;","Wang, at his plea hearing, said he had been \"directed\" to make changes in code he knew would give Alameda special privileges, Bloomberg reported.","“I knew what I was doing was wrong,” Wang said in a transcript cited by Bloomberg.","<em data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/em>"],"hashtag":[]}