{"summary":"Better Markets called the potential approval of a Bitcoin ETF &quot;a regulatory mistake of historic proportions&quot; in a letter to the SEC.  ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/270760\/crypto-skeptical-nonprofit-better-markets-urges-sec-to-deny-spot-bitcoin-etfs","publishDate":"2024-01-06T13:11:53","id":234,"type":null,"title":"Crypto-skeptical nonprofit Better Markets urges SEC to deny spot Bitcoin ETFs","category":["FINANCE FIRMS"],"content":["The non-partisan nonprofit Better Markets, which lobbies for more stringent financial regulations, has submitted a comment letter to the Securities and Exchange Commission (SEC) urging the agency to deny several pending applications for a Bitcoin-trading ETF, or exchange-traded fund, a product <a href=\"https:\/\/www.theblock.co\/post\/270638\/crypto-proponents-think-a-spot-bitcoin-etf-would-be-watershed-moment-that-could-add-billions-of-value\" data-v-f87c67ca=\"\">strongly desired<\/a> by crypto proponents.&nbsp;","Better Markets' CEO and co-founder, Dennis M. Kelleher, argues in the letter that the SEC's approval of a spot Bitcoin ETF would pose a \"grave threat\" to investors, unleashing \"...a speculative, volatile, and socially useless financial product on tens of millions of American investors and retirees.\"&nbsp;","The SEC's approval of the spot Bitcoin ETF would set a dangerous precedent, Kelleher wrote, making it harder for the agency to win future legal battles and unleashing a maelstrom of \"propaganda\" by the crypto industry meant to urge \"countless retirement savers...to diversify their portfolios\" into crypto.&nbsp;","In his <a href=\"https:\/\/www.sec.gov\/comments\/sr-nasdaq-2023-019\/srnasdaq2023019-357999-883442.pdf\" data-v-f87c67ca=\"\">letter<\/a>, Kelleher brought up several specific arguments against the approval of a spot Bitcoin ETF. On the base merits of whether or not the Bitcoin market is mature enough to warrant an ETF, Kelleher rejects that notion, citing the potential for wash trading and the high concentration of Bitcoin among a few owners.&nbsp;","\"The potential for fraud in the spot bitcoin market is so great that the rules of an exchange cannot permit the listing and trading of a spot bitcoin ETP and still be consistent with the requirement that the exchange’s rules be designed to prevent fraud and manipulation and protect investors and the public interest,\" Kelleher wrote.&nbsp;","Kelleher also seemingly argues that Bitcoin's volatility should itself disqualify the product from being offered to investors, writing, \"A simple chart showing that the price of bitcoin can lie flat for prolonged periods of time and then suffer from wild fluctuations during other periods of time indicates that a spot bitcoin ETP poses risks to the public that are inconsistent with the obligation to protect investors and the public interest.\"&nbsp;","Kelleher also claims the regulated market is too small to prevent manipulation and that surveillance-sharing agreements would add little in the way of deterrence, closing by calling the potential approval of the spot Bitcoin ETFs \"a regulatory mistake of historic proportions.\"&nbsp;","A nonprofit non-partisan organization, Better Markets lobbies for increased financial regulation on Wall Street — the organization was <a href=\"https:\/\/www.nytimes.com\/2012\/05\/31\/business\/kelleher-leads-a-nonprofit-better-markets-in-fight-for-stricter-banking-rules.html\" data-v-f87c67ca=\"\">once described<\/a> by the New York Times as \"Occupy Wall Street’s suit-wearing cousin.\"","The lobbying firm once caught the eye of FTX, which once offered the organization a $1 million donation to support the crypto firm's application for approval to the CFTC. Kelleher loudly <a href=\"https:\/\/www.wsj.com\/livecoverage\/stock-market-news-today-11-28-2022\/card\/ftx-spending-spree-included-offers-to-washington-advocacy-groups-2V3bmXZVna1H5IdC29Ye\" data-v-f87c67ca=\"\">rejected<\/a> the donation, calling it \"a direct quid pro quo,\" and urged the CFTC to reject the application.&nbsp;","The lobbying firm has been relentless in its criticism of crypto; the new letter is the latest in a <a href=\"https:\/\/bettermarkets.org\/analysis\/setting-the-record-straight-on-crypto-ftx-sam-bankman-fried-jamie-dimon-the-sec-and-cftc-and-the-revolving-door\/\" data-v-f87c67ca=\"\">series of similar pleas<\/a> to lawmakers and regulators to stop expanding crypto's regulatory acceptance. The organization, which has earned <a href=\"https:\/\/bettermarkets.org\/who-we-are\/testimonials\/\" data-v-f87c67ca=\"\">endorsements<\/a> from figures such as President Barack Obama, Senator Elizabeth Warren, and current SEC Chair Gary Gensler, spent a total of $3 million in 2022, according to its <a href=\"https:\/\/bettermarkets.org\/wp-content\/uploads\/2023\/07\/Better_Markets_Annual_Report_2022.pdf\" data-v-f87c67ca=\"\">annual report<\/a>.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dennis M. Kelleher","content":"PERSON"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Kelleher","content":"PERSON"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Barack Obama","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$3 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"$1 million","content":"MONEY"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"ETP","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Elizabeth Warren","content":"PERSON"}],"hashtag":["PACS","SPOT BITCOIN ETF"],"authors":["Zack Abrams","The Block"]}