{"summary":"A deep-dive into the state of rule-making and guidance around cryptocurrencies and blockchain applications among U.S. states.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/69321\/state-lawmaking-at-the-heart-of-blockchain-regulatory-evolution","publishDate":"2020-07-25T11:13:04","id":2340,"type":null,"title":"State lawmaking at the heart of blockchain regulatory evolution","category":["REGULATION"],"content":["<em data-v-f87c67ca=\"\">The following article was contributed by Michael Henson and Dean Galaro, attorneys in Perkins Coie LLP’s <a href=\"https:\/\/www.perkinscoie.com\/en\/industries\/technology-media-entertainment\/blockchain-technology-digital-currency.html\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Blockchain Technology industry group<\/a>.<\/em>","Supreme Court Justice Louis Brandeis labeled states as the “laboratories of democracy,” and this is being borne out in real-time with the rapid development of blockchain-based technologies and the spread of cryptocurrencies. These technologies have garnered much attention from federal agencies in recent years, but there has been little definitive rulemaking. Instead, federal agencies have relied on well-settled law to address these issues, thus enabling states to take the lead in innovating.","There were many reminders in 2019 that existing law still largely applies to new types of assets.","On April 3, 2019, the SEC <a href=\"https:\/\/www.sec.gov\/corpfin\/framework-investment-contract-analysis-digital-assets\" data-v-f87c67ca=\"\">published<\/a> its “Framework for ‘Investment Contract’ Analysis of Digital Assets,” which detailed the circumstances under which digital assets may be considered “investment contracts” and therefore securities. This framework expanded on the SEC’s 2017 <a href=\"https:\/\/www.sec.gov\/litigation\/investreport\/34-81207.pdf\" data-v-f87c67ca=\"\">DAO Investigative Report<\/a> (“DAO Report”), which assessed initial coin offerings (“ICOs”) under the <i data-v-f87c67ca=\"\">Howey<\/i> test and found they bore the indicia of traditional securities offerings. On October 9, 2019, the IRS released <a href=\"https:\/\/www.irs.gov\/pub\/irs-drop\/rr-19-24.pdf\" data-v-f87c67ca=\"\">Revenue Ruling 2019-24<\/a>, which gave guidance on gross income as a result of a cryptocurrency’s hard fork or airdrop. CFTC Chairman Heath Tarbert <a href=\"https:\/\/www.cftc.gov\/PressRoom\/PressReleases\/8051-19\" data-v-f87c67ca=\"\">told<\/a> Yahoo! Finance on October 10, 2019, that Ethereum's native token, ETH, is a commodity. On October 11, 2019, the Chairman of the CFTC, Directors of FinCEN, and Chairman of the SEC issued a <a href=\"https:\/\/www.sec.gov\/news\/public-statement\/cftc-fincen-secjointstatementdigitalassets\" data-v-f87c67ca=\"\">joint statement<\/a> “remind[ing] persons engaged in activities involving digital assets of their anti-money laundering and countering the financing of terrorism (AML\/CFT) obligations under the Bank Secrecy Act (BSA).”","The absence of digital asset-specific rulemaking, however, has not stopped enforcement actions against ICOs that to a great extent mimic initial public offering of stock.","In particular, the SEC has been active in spotlighting ICOs as unregistered securities offerings. For example, in March 2020, the SEC won a <a href=\"https:\/\/www.sec.gov\/litigation\/litreleases\/2020\/lr24763.htm\" data-v-f87c67ca=\"\">default judgment<\/a> against ICOBox for an unregistered offering and unregistered broker activity, resulting in a disgorgement of $16 million and a civil penalty of $192,768 against ICOBox’s founder. FinCEN has also taken action, assessing a civil penalty of $33,350 in <a href=\"https:\/\/www.fincen.gov\/news\/news-releases\/fincen-penalizes-peer-peer-virtual-currency-exchanger-violations-anti-money\" data-v-f87c67ca=\"\">April 2019<\/a> against the operator of a peer-to-peer virtual currency exchanger for violations of the Bank Secrecy Act.","Several Congressional bills have been introduced but have received little traction. The <a href=\"https:\/\/www.congress.gov\/bill\/116th-congress\/house-bill\/2144\" data-v-f87c67ca=\"\">Token Taxonomy Act<\/a> was introduced in 2018 (and then again in 2019) by Representatives Warren Davidson and Darren Soto to exempt certain cryptocurrencies and other digital assets from federal securities laws (among other things). And in March 2020, Representative Paul Gosar introduced the <a href=\"https:\/\/www.congress.gov\/bill\/116th-congress\/house-bill\/6154?q=%7B%22search%22%3A%5B%22crypto-currency+act%22%5D%7D&amp;s=2&amp;r=1\" data-v-f87c67ca=\"\">Crypto-Currency Act of 2020<\/a> to define categories of digital assets and clarify which federal agency will oversee each tranche.","For a deeper dive into SEC guidance, enforcement actions, and speeches relating to the application of the federal securities laws to digital assets, visit the interactive <a href=\"https:\/\/www.virtualcurrencyreport.com\/2020\/04\/updated-4-2020-digital-asset-sec-timeline\/\" data-v-f87c67ca=\"\">Digital Asset SEC Timeline<\/a>. Beginning with the DAO Report, this timeline includes relevant information for analyzing the offering, issuance, and trading of certain digital assets in the context of the federal securities laws.","","","While legislation at the federal level has been gradual, state governments have been more aggressive in passing laws that regulate applications of blockchain technology. Over a few short years, action has shifted from guidance to rulemaking.","In 2014, the Texas Department of Banking issued <a href=\"https:\/\/www.dob.texas.gov\/public\/uploads\/files\/consumer-information\/sm1037.pdf\" data-v-f87c67ca=\"\">Supervisory Memorandum 1037<\/a> (later revised in 2019). It was the first official position on cryptocurrencies taken by a U.S. state. In the memorandum, the Texas Department of Banking clarified that the state’s money transmitter and currency exchange laws did not apply to transactions that involved only cryptocurrencies because cryptocurrencies did not fit the definition of currency or money under Texas law. As Texas Banking Commissioner Charles G. Cooper stated in the <a href=\"https:\/\/www.dob.texas.gov\/public\/uploads\/files\/news\/press-releases\/2014\/04-03-14pr.pdf\" data-v-f87c67ca=\"\">press release<\/a> for Supervisory Memorandum 1037, “[a]t this point a cryptocurrency like Bitcoin is best viewed like a speculative investment, not as money.” <a href=\"http:\/\/www.osbckansas.org\/mt\/guidance\/mt2014_01_virtual_currency.pdf\" data-v-f87c67ca=\"\">Kansas<\/a> soon followed with guidance modeled on the Texas memorandum. It reached the same conclusion: cryptocurrencies are neither “money” nor a “medium of exchange,” and therefore the state’s money transmitter and currency exchange laws did not apply to transactions involving solely cryptocurrencies.","Hawaii took the opposite approach, with the state’s Department of Commerce and Consumer Affairs issuing a <a href=\"http:\/\/cca.hawaii.gov\/dfi\/bitcoin-warning\/\" data-v-f87c67ca=\"\">warning<\/a> that the Hawaii Division of Financial Institutions had not licensed any cryptocurrency companies as money transmitters. In response to the collapse of Mt. Gox in February 2014, Hawaii’s Department of Commerce and Consumer Affairs warned that it “has not licensed any crypto-currency companies to do bitcoin exchanges, wallets or ‘mining’ activity. If companies are offering to transmit bitcoins, they are doing so in violation of Hawaii’s money transmitter laws.”","Guidance and warnings quickly turned into rulemaking. On June 24, 2015, the New York Department of Financial Services published virtual currency <a href=\"https:\/\/www.dfs.ny.gov\/docs\/legal\/regulations\/adoptions\/dfsp200t.pdf\" data-v-f87c67ca=\"\">regulations<\/a>, now known as the “BitLicense” program. The regulations require a licensee to engage in “virtual currency business activity,” which is <a href=\"https:\/\/govt.westlaw.com\/nycrr\/Document\/I85908c68253711e598dbff5462aa3db3?viewType=FullText&amp;originationContext=documenttoc&amp;transitionType=CategoryPageItem&amp;contextData=(sc.Default)\" data-v-f87c67ca=\"\">defined<\/a> to include, among other things, transmitting virtual currencies, storing virtual currencies on behalf of others, and issuing virtual currencies.","Other states took a lighter touch than New York. Some used existing money transmitter laws to regulate the flow of cryptocurrencies. Connecticut passed <a href=\"https:\/\/legiscan.com\/CT\/bill\/HB06800\/2015\" data-v-f87c67ca=\"\">House Bill 6800<\/a> in June 2015, which defined “virtual currency” and applied the state’s money transmitter laws to businesses transmitting virtual currencies. Similar laws were passed in <a href=\"https:\/\/legiscan.com\/NC\/bill\/H289\/2015\" data-v-f87c67ca=\"\">North Carolina<\/a>, <a href=\"https:\/\/legiscan.com\/SC\/bill\/H4554\/2015\" data-v-f87c67ca=\"\">South Carolina<\/a>, and <a href=\"https:\/\/legiscan.com\/PA\/bill\/HB850\/2015\" data-v-f87c67ca=\"\">Pennsylvania<\/a> in 2016. Others, like Vermont, were early adopters of blockchain’s application to areas outside of finance. Vermont passed <a href=\"https:\/\/legiscan.com\/VT\/bill\/H0868\/2015\" data-v-f87c67ca=\"\">a law<\/a> in 2016 amending the state’s rules of evidence to include blockchain-based digital records.","While state laws regulating blockchain applications have not coalesced around specific regulations, certain themes have emerged.","States have started to share definitions for blockchains, cryptocurrencies, and other related terms.","A 2019 bill in North Dakota, <a href=\"https:\/\/legiscan.com\/ND\/bill\/1045\/2019\" data-v-f87c67ca=\"\">HB 1045<\/a>, defines “blockchain technology” as “distributed ledger technology that uses a distributed, decentralized, shared, and replicated ledger, which may be public or private, permissioned or permissionless, or driven by tokenized crypto economics or tokenless and which is protected with cryptography, is immutable, and auditable and provides an uncensored truth.” Almost the same definition was used for “distributed ledger technology” in a Tennessee bill from 2018, <a href=\"https:\/\/legiscan.com\/TN\/bill\/SB1662\/2017\" data-v-f87c67ca=\"\">SB 1662<\/a>: “any distributed ledger protocol and supporting infrastructure, including blockchain, that uses a distributed, decentralized, shared, and replicated ledger, whether it be public or private, permissioned or permissionless, and which may include the use of electronic currencies or electronic tokens as a medium of electronic exchange.” In 2019, Wyoming passed <a href=\"https:\/\/legiscan.com\/WY\/bill\/HB0057\/2019\" data-v-f87c67ca=\"\">HB 57<\/a>, which defined “blockchain” in a simpler fashion as “a digital ledger or database which is chronological, consensus-based, decentralized and mathematically verified in nature.”","The most popular category of state laws by far concerns corporate records and filings. For example, Delaware has passed several bills since 2017 that affect distributed ledger recordkeeping. In <a href=\"https:\/\/legiscan.com\/DE\/bill\/SB69\/2017\" data-v-f87c67ca=\"\">2017<\/a>, Delaware enacted a law allowing corporations to use networked electronic databases to maintain corporate records. In 2018, the state expanded this policy to <a href=\"https:\/\/legiscan.com\/DE\/bill\/SB183\/2017\" data-v-f87c67ca=\"\">limited liability companies<\/a> and <a href=\"https:\/\/legiscan.com\/DE\/bill\/SB194\/2017\" data-v-f87c67ca=\"\">statutory trusts<\/a> in service of Delaware’s “initiative to implement policies enhancing the State’s position as a leader in the adoption of distributive electronic network and database technologies.” And more recently, in 2019, Delaware followed suit with <a href=\"https:\/\/legiscan.com\/DE\/bill\/SB90\/2019\" data-v-f87c67ca=\"\">limited partnerships<\/a>. Other states followed Delaware’s lead in 2019, including <a href=\"https:\/\/legiscan.com\/ND\/bill\/1045\/2019\" data-v-f87c67ca=\"\">North Dakota<\/a> and <a href=\"https:\/\/legiscan.com\/TX\/bill\/SB1859\/2019\" data-v-f87c67ca=\"\">Texas<\/a>.","Some states, like Wyoming, have taken additional steps. In early 2019, Wyoming enacted <a href=\"https:\/\/legiscan.com\/WY\/bill\/HB0070\/2019\" data-v-f87c67ca=\"\">HB 70<\/a>, which authorized the Secretary of State to develop and implement a blockchain commercial filing system before December 31, 2020. However, with less than a year to go before the bill’s deadline for implementation, it is still unclear how much progress Wyoming has made toward realizing such a system.","States that have created working groups to study the uses and impact of blockchain include <a href=\"https:\/\/legiscan.com\/CA\/bill\/AB2658\/2017\" data-v-f87c67ca=\"\">California<\/a>, <a href=\"https:\/\/legiscan.com\/CT\/bill\/SB00443\/2018\" data-v-f87c67ca=\"\">Connecticut<\/a>, and <a href=\"https:\/\/legiscan.com\/CO\/bill\/HB1247\/2019\" data-v-f87c67ca=\"\">Colorado<\/a>.","California’s working group was tasked with evaluating blockchain’s uses, benefits, and risks as well as the legal implications for California businesses and residents. On the other hand, Connecticut’s group was created to identify growth opportunities, review workforce needs in the blockchain industry, and make legislative recommendations to promote “growth by reducing barriers to and expediting the expansion of the state’s blockchain industry.” Other states such as Colorado have sought more specific guidance, creating a working group to study agricultural applications for blockchain technology.","As noted above, some of the earliest state action in response to the expanding use and understanding of blockchains was to offer guidance with respect to money transmitter laws.","One of the first states to act was Oregon, which passed <a href=\"https:\/\/legiscan.com\/OR\/bill\/SB277\/2015\" data-v-f87c67ca=\"\">a law<\/a> in May 2015 that expanded the term “money” to include, in addition to fiat currency, “a medium of exchange that . . . [r]epresents value that substitutes for currency but that does not benefit from government regulation requiring acceptance of the medium of exchange as legal tender.” Connecticut followed a month later with the enactment of <a href=\"https:\/\/legiscan.com\/CT\/bill\/HB06800\/2015\" data-v-f87c67ca=\"\">HB 6800<\/a>. This bill was much clearer—specifically including virtual currencies in the money transmitter laws.","But starting in mid-2017, the tide began to shift in some states, leading to a group of states exempting virtual currency transmission and exchange from existing money transmitter laws. New Hampshire enacted <a href=\"https:\/\/legiscan.com\/NH\/bill\/HB436\/2017\" data-v-f87c67ca=\"\">HB 436<\/a> in June 2017, which exempted from money transmitter licensure “[p]ersons who engage in the business of selling or issuing payment instruments or stored value solely in the form of convertible virtual currency or receive convertible virtual currency for transmission to another location.” One of the bill’s co-sponsors, Keith Ammon, <a href=\"https:\/\/reason.com\/2017\/06\/13\/new-hampshire-exempts-bitcoin-and-other\/\" data-v-f87c67ca=\"\">explained at the time<\/a>: “We certainly don’t want to put up a signal that we are hostile to a burgeoning industry.” Wyoming was close behind, passing <a href=\"https:\/\/legiscan.com\/WY\/bill\/HB0019\/2018\" data-v-f87c67ca=\"\">HB 19<\/a> in March 2018, which exempted “[b]uying, selling, issuing, or taking custody of payment instruments or stored value in the form of virtual currency.” This move came two years after Coinbase <a href=\"https:\/\/www.newsbtc.com\/2015\/06\/29\/coinbase-suspends-its-services-in-the-wyoming-state\/\" data-v-f87c67ca=\"\">suspended operations<\/a> in the state. Coinbase resumed operating in Wyoming in <a href=\"https:\/\/blog.coinbase.com\/coinbase-is-coming-back-to-wyoming-9d0f75148f8b\" data-v-f87c67ca=\"\">August 2018<\/a>.","State lawmakers, for the most part, have deferred to the federal government. Because of federal preemption, it makes sense that states will wait until federal agencies provide guidance before legislating. Nevertheless, <a href=\"https:\/\/legiscan.com\/CO\/bill\/SB023\/2019\" data-v-f87c67ca=\"\">Colorado<\/a> and <a href=\"https:\/\/legiscan.com\/MT\/bill\/HB584\/2019\" data-v-f87c67ca=\"\">Montana<\/a> have both enacted exemptions from their state securities laws for so-called utility tokens. In California, a recent <a href=\"https:\/\/legiscan.com\/CA\/bill\/AB2150\/2019\" data-v-f87c67ca=\"\">proposed bill<\/a> would amend the state’s definition of a “security” to exclude certain digital assets.","The Midwest and West Coast have taken big steps in the last two years to be leaders and innovators with respect to regulating the use of blockchain and building the infrastructure for economic growth in this sector.","Wyoming has been hailed as the <a href=\"https:\/\/www.wired.com\/story\/newest-haven-cryptocurrency-companies-wyoming\/\" data-v-f87c67ca=\"\">newest haven for cryptocurrency companies<\/a> and as <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2018-05-15\/wyoming-aims-to-be-america-s-cryptocurrency-capital\" data-v-f87c67ca=\"\">America’s cryptocurrency capital<\/a>. In the wake of Coinbase’s departure from the state because of issues with Wyoming’s money transmitter statutes, Wyoming changed course and enacted a group of 13 laws in rapid succession starting in early 2018. Some of the more recent bills include <a href=\"https:\/\/legiscan.com\/WY\/bill\/HB0019\/2018\" data-v-f87c67ca=\"\">HB 19<\/a> (exempting virtual currencies from the state’s money transmitter laws), <a href=\"https:\/\/legiscan.com\/WY\/bill\/HB0070\/2018\" data-v-f87c67ca=\"\">HB 70<\/a> (exempting utility tokens from the state’s securities laws), <a href=\"https:\/\/legiscan.com\/WY\/bill\/SF0111\/2018\" data-v-f87c67ca=\"\">SF 111<\/a> (exempting virtual currencies from being taxed by the state as property), and <a href=\"https:\/\/legiscan.com\/WY\/bill\/HB0101\/2018\" data-v-f87c67ca=\"\">HB 101<\/a> (allowing corporations to keep corporate records and sign votes via blockchain).","One recent example of Wyoming’s innovation are its new <a href=\"http:\/\/wyomingbankingdivision.wyo.gov\/home\/areas-of-regulation\/laws-and-regulation\/special-purpose-depository-institution\" data-v-f87c67ca=\"\">special purpose depository institutions<\/a> (SPDIs). This new type of bank will act in both a custodial and fiduciary capacity and is meant to allow businesses to hold digital assets safely and legally in Wyoming. As stated in the <a href=\"https:\/\/docs.google.com\/viewer?a=v&amp;pid=sites&amp;srcid=d3lvLmdvdnxiYW5raW5nfGd4OjMwNjZmODUxNjUzZWVhMTU\" data-v-f87c67ca=\"\">enacted bill<\/a> creating SPDIs, they “will provide a necessary and valuable service to blockchain innovators, emphasize Wyoming’s partnership with the technology and financial industry and safely grow this state’s developing financial sector.” Applications for charters were first accepted on October 1, 2019.","Another area of innovation: land records, including warranty deeds, mortgages, release of liens, and other similar documents. Medici Land Governance, a subsidiary of Overstock’s venture arm, has successfully put Teton County’s land records on a blockchain platform and is <a href=\"https:\/\/finance.yahoo.com\/news\/medici-land-governance-develop-blockchain-215100087.html\" data-v-f87c67ca=\"\">going to do the same<\/a> for Carbon County, Wyoming.","While Colorado has been a front-runner state in the normalization and legalization of cannabis, it has also been gathering blockchain market share. In the 2019 legislative session, Colorado’s legislature enacted several blockchain-related bills, including <a href=\"https:\/\/legiscan.com\/CO\/bill\/SB086\/2018\" data-v-f87c67ca=\"\">SB 18-086<\/a> (requiring state authorities to research uses of blockchain cryptology for protecting state records) and <a href=\"https:\/\/legiscan.com\/CO\/bill\/SB023\/2019\" data-v-f87c67ca=\"\">SB 19-023<\/a> (exempting cryptocurrencies from state securities regulations). In February 2020, Governor Jared Polis bragged to <a href=\"https:\/\/www.coindesk.com\/governor-colorado-startups-have-raised-50-million-in-venture-capital\" data-v-f87c67ca=\"\">CoinDesk<\/a> that Colorado had attracted over $50 million in venture capital funding for blockchain startups.","In contrast to Wyoming, which has focused on innovation through rapid legislating, Colorado’s locus of activity has been state government agencies. In July 2018, then Colorado Governor John Hickenlooper created the <a href=\"https:\/\/choosecolorado.com\/blockchain\/\" data-v-f87c67ca=\"\">Colorado Council for the Advancement of Blockchain Technology Use<\/a>. This group operated through June 2019, when its term ended and various state agencies took up the mantle of supporting blockchain flourishing in Colorado. The Council’s <a href=\"https:\/\/choosecolorado.com\/wp-content\/uploads\/2019\/07\/BlockchainReport_update_7-2019.pdf\" data-v-f87c67ca=\"\">final report<\/a> described myriad legislative proposals for resolving state-level issues related to taxation, securities regulation, banking, and voting, among other issues. The <a href=\"https:\/\/coloradoblockchain.com\/\" data-v-f87c67ca=\"\">Colorado Blockchain<\/a> website, a partnership between the Colorado Office of Economic Development and the Colorado Department of Regulatory Agencies, makes a sales pitch for starting or moving blockchain businesses to Colorado.","Legislation at the federal level has been reactive with respect to digital assets and virtual currencies, leaving ample room for state-level response.","Many states have enacted blockchain-related bills, with more states enacting more bills each year. While state laws have coalesced around certain topics, such as money transmitter laws and corporate records, there is still a wide variety of bills being proposed and enacted, and many states are putting their own spin on these issues. So far, the heart of innovation in blockchain regulation has been the West, specifically states such as Wyoming and Colorado, which are pushing hard to catch the blockchain lightning in a bottle.","If past is prologue, the places to watch for innovation in blockchain regulation will continue to be state legislatures.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 24, 2015","content":"DATE"},{"type":"State","content":"ORGANIZATION"},{"type":"Colorado Office of Economic Development","content":"ORGANIZATION"},{"type":"Colorado Council","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Hawaii","content":"LOCATION"},{"type":"October 11, 2019","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"HB 19","content":"DATE"},{"type":"Keith Ammon","content":"PERSON"},{"type":"March 2018","content":"DATE"},{"type":"February 2020","content":"DATE"},{"type":"May 2015","content":"DATE"},{"type":"June 2019","content":"DATE"},{"type":"AML","content":"ORGANIZATION"},{"type":"June 2017","content":"DATE"},{"type":"December 31, 2020","content":"DATE"},{"type":"June 2015","content":"DATE"},{"type":"Crypto","content":"LOCATION"},{"type":"Jared Polis","content":"PERSON"},{"type":"Colorado Department of Regulatory Agencies","content":"ORGANIZATION"},{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"North Dakota","content":"LOCATION"},{"type":"July 2018","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"February 2014","content":"DATE"},{"type":"$33,350","content":"MONEY"},{"type":"$192,768","content":"MONEY"},{"type":"Texas","content":"LOCATION"},{"type":"Colorado","content":"LOCATION"},{"type":"Supreme Court Justice Louis Brandeis","content":"ORGANIZATION"},{"type":"‘Investment Contract’ Analysis of Digital Assets","content":"ORGANIZATION"},{"type":"IRS","content":"ORGANIZATION"},{"type":"March 2020","content":"DATE"},{"type":"Oregon","content":"LOCATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"California","content":"LOCATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"West Coast","content":"LOCATION"},{"type":"Heath Tarbert","content":"PERSON"},{"type":"Charles G. Cooper","content":"PERSON"},{"type":"$16 million","content":"MONEY"},{"type":"House Bill 6800","content":"ORGANIZATION"},{"type":"August 2018","content":"DATE"},{"type":"$50 million","content":"MONEY"},{"type":"2014","content":"DATE"},{"type":"2016","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"April 3, 2019","content":"DATE"},{"type":"Delaware","content":"LOCATION"},{"type":"Perkins Coie LLP","content":"ORGANIZATION"},{"type":"South Carolina","content":"LOCATION"},{"type":"1045","content":"DATE"},{"type":"Blockchain Technology","content":"ORGANIZATION"},{"type":"24","content":"DATE"},{"type":"Bank Secrecy Act (BSA","content":"ORGANIZATION"},{"type":"Carbon County","content":"ORGANIZATION"},{"type":"FinCEN","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Department of Commerce and Consumer Affairs","content":"ORGANIZATION"},{"type":"John Hickenlooper","content":"PERSON"},{"type":"Paul Gosar","content":"PERSON"},{"type":"Hawaii Division of Financial Institutions","content":"ORGANIZATION"},{"type":"Tennessee","content":"LOCATION"},{"type":"Secretary of State","content":"ORGANIZATION"},{"type":"October 10, 2019","content":"DATE"},{"type":"Yahoo! Finance","content":"ORGANIZATION"},{"type":"Montana","content":"LOCATION"},{"type":"October 9, 2019","content":"DATE"},{"type":"Pennsylvania","content":"LOCATION"},{"type":"Delaware","content":"ORGANIZATION"},{"type":"Texas Department of Banking","content":"ORGANIZATION"},{"type":"Warren Davidson","content":"PERSON"},{"type":"October 1, 2019","content":"DATE"},{"type":"Connecticut","content":"LOCATION"},{"type":"Advancement of Blockchain Technology Use","content":"ORGANIZATION"},{"type":"Michael Henson","content":"PERSON"},{"type":"Wyoming","content":"LOCATION"},{"type":"America","content":"LOCATION"},{"type":"Wyoming","content":"ORGANIZATION"},{"type":"last two years","content":"DATE"},{"type":"North Carolina","content":"LOCATION"},{"type":"Vermont","content":"LOCATION"},{"type":"Dean Galaro","content":"PERSON"},{"type":"Howey","content":"PERSON"},{"type":"Digital Asset SEC Timeline","content":"ORGANIZATION"},{"type":"Colorado Blockchain<\/a> website","content":"ORGANIZATION"},{"type":"April 2019","content":"DATE"},{"type":"Bitcoin","content":"PERSON"},{"type":"Darren Soto","content":"PERSON"}],"hashtag":[],"authors":["Michael Henson and Dean Galaro","The Block"]}