{"summary":"Members of the Rare Bears NFT community have lost assets to the tune of $790,000 due to a phishing attack.\nThe team said weakened security of its Discord group allowed a perpetrator to spread a phishing link. ","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/138250\/hacker-steals-790000-of-nfts-and-crypto-from-owners-of-rare-bears","publishDate":"2022-03-17T12:15:39","id":2341,"type":null,"title":"Hacker steals $790,000 of NFTs and crypto from owners of Rare Bears","category":["Hacks"],"content":["<span data-v-f87c67ca=\"\">Collectors of Rare Bears, a recently-launched NFT project, have lost around $790,000 worth of NFTs and other cryptocurrencies in a phishing attack.<\/span>","<span data-v-f87c67ca=\"\">Rare Bears is an NFT collection of 2,400 cartoon-themed bears on Ethereum. It was created by a New Zealand-based digital artist called Enox and was launched via a public mint last week.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On Wednesday, an unknown person gained unauthorized access to the project's Discord server and posed as an official moderator. This enabled them to share a phishing link that was designed to steal people's funds.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">“Discord has unfortunately been compromised. Please DO NOT click any links, connect your wallet and block all incoming DMs in our discord. Our team [is] working on the situation as we speak,” said Rare Bears in a <a href=\"https:\/\/twitter.com\/BearsRare\/status\/1504293859467350019\" data-v-f87c67ca=\"\">post<\/a> on Twitter.<\/span>","<span data-v-f87c67ca=\"\">The perpetrator shared a message saying there was a new NFT mint, providing a link to a phishing website. A user going by “steldes” on Twitter <a href=\"https:\/\/twitter.com\/steldes\/status\/1504301285457088516\" data-v-f87c67ca=\"\">posted<\/a> a screenshot of what appears to be the phony announcement by the person masquerading as a Discord admin named Zhodan. In the announcement, they informed the members of an additional 1,000 rare NFTs being added to the collection at a mint price of 0.1 ETH ($280).<\/span>","<span data-v-f87c67ca=\"\">According to security firm PeckShield, the website hosted a malicious smart contract that — when interacted with — gave them control over the victim's wallets. <\/span><span data-v-f87c67ca=\"\">With this control, the hacker stole <\/span><a href=\"https:\/\/etherscan.io\/address\/0xc76c8bd46488f4a20bd609a4d29b197750b61c23#tokentxnsErc721\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">179 NFTs<\/span><\/a><span data-v-f87c67ca=\"\"> and other assets belonging to everyone who participated in the mint. Among the stolen NFTs included Rare Bears and many other high-value items from popular collections: CloneX, Azuki, mfer, 3landers and Sandbox.<\/span>","<span data-v-f87c67ca=\"\">The hacker proceeded to move the assets to their <\/span><a href=\"https:\/\/etherscan.io\/address\/0xc76c8bd46488f4a20bd609a4d29b197750b61c23#tokentxnsErc721\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum address<\/span><\/a><span data-v-f87c67ca=\"\">, starting at 7:34 PM UTC on Wednesday. Shortly after, most of the NFTs were sold one by one to the tune of 286 ETH, roughly equivalent to $790,000. Of this amount, <\/span><a href=\"https:\/\/etherscan.io\/txs?a=0xc76c8bd46488f4a20bd609a4d29b197750b61c23&amp;f=2&amp;p=1\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">213 ETH<\/span><\/a><span data-v-f87c67ca=\"\"> was routed through mixing service Tornado Cash and the 72.3 ETH was sent across three wallets, likely in the hacker’s control.<\/span>","<span data-v-f87c67ca=\"\">While it is still unclear how the Discord was compromised, the creator of Rare Bears said a hacked device may have been responsible.<\/span>","<span data-v-f87c67ca=\"\">In the past, similar phishing attacks on NFT owners have taken place on Discord. In October 2021, someone stole $340,000 in ETH from the Creature Toadz NFT project using a phishing link, only to return it later to their victims.&nbsp;<\/span>"],"hashtag":[]}