{"summary":"Seeking to capture some of the growing stablecoin market, Ripple is launching a competitor to Tether and Circle&#x27;s stablecoins.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286372\/ripple-to-launch-usd-stablecoin-cto-david-schwartz-hopes-will-rival-usdt-and-usdc","publishDate":"2024-04-04T09:00:02","id":2344,"type":null,"title":"Ripple to launch USD stablecoin that CTO David Schwartz hopes will rival USDT and USDC","category":["STABLECOINS"],"content":["<span data-v-f87c67ca=\"\">Ripple has announced plans to launch a U.S. dollar-pegged stablecoin that will initially be available on the <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248352\/xrp-xrp-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/xrp-symbol-white-128.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">XRP<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.062%\n    <\/span><\/a> <!----><\/span> Ledger and Ethereum blockchains.&nbsp;<\/span>","\"Issuing our stablecoin on the XRP Ledger and Ethereum will serve as a pivotal entry point to unlock new opportunities for institutional and DeFi use cases across multiple ecosystems,”&nbsp; Ripple President Monica Long said in a statement Thursday. \"Bringing a trusted stablecoin onto XRPL will drive more adoption and development, contributing to a vibrant ecosystem.”","The company also said the stablecoin, slated for launch later this year, will be backed by \"USD deposits, short-term U.S. government treasuries, and other cash equivalents,\" according to its statement. \"These reserve assets will be audited by a third-party accounting firm, and Ripple will publish monthly attestations.\"","At the moment, the two dominant USD-pegged stablecoins are Tether's USDT and Circle Internet Financial's USDC. Ripple said in its statement the stablecoin market, now worth more than $150 billion, is expected to surge to $2.8 trillion by 2028.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/stablecoins\/usd-pegged\/total-stablecoin-supply\/embed\" title=\"Total Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Ripple Chief Technology Officer David Schwartz told The Block that \"in retrospect\" he and his team would have liked to launch a stablecoin sooner. However, after learning more about the market and monitoring economic factors, he said, issuing one this year makes strategic sense.","\"The interest rate increase makes it a much more attractive market,\" he said. \"Also there's kind of been a shakeup, and really, Tether is almost a no-go for us because of the regulatory issues. There's just so much uncertainty around it.\"","He went on to say: \"We've used USDC before [and] there's nothing wrong with it. It's just, you don't want to have only one option.\"","In the case of USDT, the largest stablecoin by supply, JPMorgan analysts <a href=\"https:\/\/www.theblock.co\/post\/277655\/jpmorgan-tether-ofac-comments\" data-v-f87c67ca=\"\">recently predicted<\/a> its use is likely to decline amid upcoming stablecoin regulations. Tether CEO Paolo Ardoino has suggested JPMorgan's analysis is the result of its jealousy concerning USDT's dominant position among stablecoins. USDT makes up about $110 billion of the more than $150 billion stablecoin market supply, according to <a href=\"https:\/\/www.theblock.co\/data\/stablecoins\/usd-pegged\" data-v-f87c67ca=\"\">The Block Data Dashboard<\/a>.","While Schwartz said Ripple would \"love\" to usurp Tether's dominance, he sees room in the market for multiple options \"particularly in DeFi applications where concentrated risk is a huge problem.\"","Schwartz said Ripple believes both the company's customers and the global market will respond positively if there is a stablecoin that organizations can feel more secure using, specifically one on the XRP Ledger. \"There's a lot of great assets on the XRP Ledger, but not really a good stablecoin, and even if you had one, you don't want to build a business around a single option,\" he said.","When asked about specific use cases, Schwartz said he believes the new stablecoin should be attractive to small- and medium-sized enterprises and non-banking financial institutions like payment companies.","\"I really hope we can drive enterprise-grade institutional adoption of the stablecoin, which I think has been a little bit lacking both because of regulatory issues and the lack of someone to package something together as a product,\" added Schwartz. \"We'll have a leg up because of our compliance.\"","Like <a href=\"https:\/\/www.theblock.co\/post\/165513\/tether-says-its-not-freezing-tornado-cash-until-government-tells-it-to\" data-v-f87c67ca=\"\">Tether<\/a>, Ripple has faced public scrutiny. The Securities and Exchange Commission and Ripple have been <a href=\"https:\/\/www.theblock.co\/post\/284538\/sec-plans-to-ask-judge-for-2-billion-in-fines-and-penalties-from-ripple-labs\" data-v-f87c67ca=\"\">engaged in a legal fight<\/a> since 2020 after the agency accused the company of raising $1.3 billion through the sale of XRP, which it says is an unregistered security.","In its statement, Ripple said it is committed to compliance and noted that it \"has a growing license portfolio in key regions around the globe.\"","While initially Ripple's stablecoin will only be available on the \"XRP Ledger and Ethereum networks using XRPL native functionality and ERC20 token standards,\" there are \"plans to expand to additional blockchains and decentralized finance protocols and apps over time,\" the company said in its statement.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"$150 billion","content":"MONEY"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Circle Internet Financial","content":"ORGANIZATION"},{"type":"Ripple","content":"PERSON"},{"type":"Schwartz","content":"PERSON"},{"type":"David Schwartz","content":"PERSON"},{"type":"-1.062%","content":"PERCENT"},{"type":"USDT","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2028","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"$1.3 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$110 billion","content":"MONEY"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Monica Long","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Paolo Ardoino","content":"PERSON"},{"type":"The Block Data Dashboard","content":"ORGANIZATION"},{"type":"$2.8 trillion","content":"MONEY"}],"hashtag":["TETHER","USDC","XRP"],"authors":["RT Watson","The Block"]}