{"summary":"Star Atlas has released its first pre-alpha gameplay demo on the Epic Games Store.\nBut with at least half a decade until the game is rolled out, it has faced questions as to whether it can deliver on its lofty goals.","author":["Callan Quinn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173645\/star-atlas-offers-first-glimpse-of-gameplay-with-debut-on-epic-games-store","publishDate":"2022-09-29T17:30:41","id":2346,"type":null,"title":"Star Atlas offers first glimpse of gameplay with debut on Epic Games Store","category":["The Block"],"content":["<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Star Atlas has released its first pre-alpha gameplay demo on the Epic Games Store, offering fans a long-awaited glimpse of what they might expect in the full version of the massively multiplayer online role-playing game (MMORPG).<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The demo introduces players to Asha, a pilot and captain of the Council of Peace, and gives them option to summon and view their NFT ships on launching pads in the \"Showroom.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Based on Solana and built using Unreal Engine 5, Star Atlas is one of the most ambitious gaming projects in the space. Its lore is based around three factions&nbsp;<\/span>struggling for resources, territorial conquest and political domination in the year 2620.","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The project launched in 2020 and it's already attracted a loyal following. Fans have spun off ship-making guilds and even a dedicated news site based on the game.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">But with almost $200 million spent on NFTs for a game that — by co-founder CEO Michael Wagner’s own estimate — may not be rolled out for another 5-7 years, it’s faced questions as to whether it can deliver on its lofty goals.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">In July, Wagner faced off against Illuvium co-founder Kieran Warwick in a <a href=\"https:\/\/www.youtube.com\/watch?v=PWT8MkXZUJk\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">debate<\/a> over the sustainability of the project following a Twitter spat in which Warwick said Star Atlas was “gonna burn the fuck out of retail.”<\/span>","Warwick compared Star Atlas to Star Citizen, a non-blockchain game with a similar space theme that blends combat gameplay, world building and commerce. Despite more than a decade of development, a substantially larger team than Star Atlas and half a billion dollars in funding, it remains in alpha.","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Nevertheless, Star Atlas maintains that it will continue to develop and release further gameplay iteratively through modules. I<\/span><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">t is aiming for a full Showroom with expanded functionality release in the fourth quarter of this year.&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">It is one of several blockchain projects that have launched or plan to launch on the Epic Games Store, including Blankos Block Party, which also <a href=\"https:\/\/www.theblock.co\/post\/173526\/metaverse-unicorn-mythical-games-hopes-to-lure-mainstream-gamers-to-its-party\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">launched<\/a> this week.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Unlike Minecraft creators Mojang Studios and Steam creators Valve, Epic Games has not banned NFT and blockchain-based gaming from its platform.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">However, it told The Block that the company itself doesn’t have special partnerships with blockchain game makers above those it has with other games on its platform. Epic Games doesn’t itself produce any blockchain or web3 games.<\/span>"],"hashtag":[]}