{"summary":"New York&#x27;s top financial watchdog proposed bolstering its oversight of crypto firms looking to list coins in the state.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/251502\/new-york-financial-watchdog-proposes-strengthened-crypto-guidelines","publishDate":"2023-09-18T11:29:45","id":2346,"type":null,"title":"New York financial watchdog proposes strengthened crypto guidelines","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">New York’s top financial watchdog proposed bolstering its oversight of crypto firms looking to list coins in the state.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The New York Department of Financial Services published proposed guidance on Monday aimed to strengthen how those firms list or delist coins, as well as guidance on adding coins to the state’s \"greenlist.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Since joining DFS, I have made it a priority to ensure the Department's regulatory and operational capabilities keep pace with industry developments to protect consumers and markets,\" NYDFS Superintendent Adrienne Harris said in a <a href=\"https:\/\/www.dfs.ny.gov\/reports_and_publications\/press_releases\/pr202309181\" data-v-f87c67ca=\"\">statement<\/a> on Monday.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">NYDFS has been active in regulating crypto in the state for years, having launched its BitLicense regime in 2015. A slew of firms have virtual currency licenses in the state including Coinbase, Inc., Circle Internet Financial, LLC. and Robinhood Crypto, according to its <a href=\"https:\/\/www.dfs.ny.gov\/virtual_currency_businesses\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">site<\/span><\/a>, although some firms <a href=\"https:\/\/www.theblock.co\/linked\/130119\/xapo-closes-shop-in-new-york-gives-up-bitlicense\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">closed<\/span><\/a> up shop in the state.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">On Monday, NYDFS proposed requiring crypto firms to have certain standards on how they assess risk, including fraud, price manipulation and whether there is enough liquidity to meet customer demand.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The proposal also requires firms to develop and submit a coin-delisting policy, the regulator said.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"In the event a listed coin is identified as presenting newly elevated risk, whether through a VC Entity’s monitoring process, a Department-identified weakness or vulnerability, or otherwise, VC Entities must be able to discontinue support of that coin in a manner that is consistent with safety and soundness and with protection of customers and the general public,\" the NYDFS said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">A crypto firm would not be able to self-certify any coins until the regulator gave it written approval of its coin-listing policy, under the proposed guidelines.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Comments on the proposed guidelines are due Oct. 20.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2015","content":"DATE"},{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"Coinbase, Inc.","content":"ORGANIZATION"},{"type":"Robinhood Crypto","content":"ORGANIZATION"},{"type":"LLC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"DFS","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"Oct. 20","content":"DATE"},{"type":"Department","content":"ORGANIZATION"},{"type":"Adrienne Harris","content":"PERSON"},{"type":"Circle Internet Financial","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}