{"summary":"The Federal Reserve has decided to cut the interest rate by 50 bps\nBitcoin price surged briefly upon the news, but soon fell back to below previous level \nWhile some believe that the rate cut is good news for bitcoin, past data shows otherwise","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/57581\/fed-announces-50-bps-emergency-rate-due-to-coronavirus","publishDate":"2020-03-03T11:08:25","id":2349,"type":null,"title":"Fed announces 50 bps emergency rate cut due to coronavirus","category":["Macro"],"content":["The Federal Reserve announced today an emergency rate cut in preparation for the mounting economic threat of the coronavirus.","The cut brought the interest rate down by 50 bps to a target range of&nbsp; 1% to 1.25%. In a statement, the Fed said the move was a response to the \"evolving risk to economic activity\" that coronavirus poses.&nbsp;","\"In light of these risks and in support of achieving its maximum employment and price stability goals, the Federal Open Market Committee decided today to lower the target range for the federal funds rate,” the Fed said in a statement.&nbsp;","Following the news, bitcoin price quickly surged from around $8750 to $8880, although it soon pared gains and fell to $8710.&nbsp;","Some market participants believe that the emergency rate cut, a first since the 2008 financial crisis, is a bullish sign for the crypto markets as investors look for alternative investment opportunities.&nbsp;","\"The Fed’s emergency rate cut is fundamentally bullish for the crypto markets, especially if concerns mount about the fiscal sustainability of this approach and\/or the dollar weakening on the back of this action,\" Blockchain.com head of markets Charles McGarraugh wrote in an email to The Block.&nbsp;","However, as The Block previously <a href=\"https:\/\/www.theblockresearch.com\/uncorrelated-is-uncorrelated-data-continues-to-suggest-bitcoin-clearly-not-a-haven-asset-56928\" data-v-f87c67ca=\"\">reported<\/a>, a rate cut does not necessarily have a positive impact on bitcoin price. On the contrary, over the past three rate cuts, bitcoin's median return across 1-week, 1-month, and 3-month lag were -5.0%, -20.9%, -11.0%, respectively.&nbsp;","",""],"hashtag":[]}