{"summary":"The news comes hours after the regulator ordered Paxos to stop issuing the Binance USD stablecoin, citing &quot;several unresolved issues related to Paxos&#x27; oversight of its relationship&quot; with Binance over the branded stablecoin. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/211196\/circle-warned-regulator-about-rival-binance-stablecoin-last-year-bloomberg-says","publishDate":"2023-02-13T14:25:18","id":235,"type":null,"title":"Circle warned regulator about rival Binance stablecoin last year, Bloomberg says","category":["COMPANIES"],"content":["Circle filed a complaint with the New York State Department of Financial Services last year over rival Binance's \"mismanagement of reserves\" for its own tokens, Bloomberg News <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-02-13\/circle-usdc-alerted-new-york-over-binance-peg-busd-issues?srnd=cryptocurrencies-v2\" data-v-f87c67ca=\"\">reported<\/a>.&nbsp;","The news comes hours after the regulator ordered Paxos to stop issuing the Binance USD stablecoin, citing \"several unresolved issues related to Paxos' oversight of its relationship\" with Binance over the branded stablecoin.&nbsp;","Circle, which offers the USDC stablecoin, alerted the NYDFS last fall that Binance didn't have enough reserves to back the tokens it issued, Bloomberg said, citing an person familiar with the matter.&nbsp;","Reuters earlier reported that the NYDFS found that Paxos “violated its obligation to conduct tailored, periodic risk assessments and due diligence refreshes of Binance and Paxos-issued BUSD customers to prevent bad actors from using the platform.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"last fall","content":"DATE"},{"type":"Paxos","content":"PERSON"},{"type":"New York State Department of Financial Services","content":"ORGANIZATION"},{"type":"Bloomberg News","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":["BINANCE"],"authors":["Larry DiTore","The Block"]}