{"summary":"Avalanche users have paid millions of dollars to mint and move inscription-related tokens over the last five days.\nThis appears to be due to a big increase in network activity.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/268078\/avalanche-users-pay-13-8-million-in-fees-for-inscriptions-over-5-days","publishDate":"2023-12-18T07:50:35","id":2350,"type":null,"title":"Avalanche users pay $13.8 million in fees for inscriptions over 5 days","category":["Crypto Ecosystems"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Avalanche <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248368\/avalanche-avax-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/Avalanche_Circle_RedWhite_Trans.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">AVAX<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.52%\n    <\/span><\/a> <!----><\/span><\/span> users paid $13.8 million in transaction fees over the last five days to mint and move tokens and NFTs created with inscriptions.<\/span>","Inscription-based tokens are created by writing text in normal blockchain transactions and using an off-chain numbering system to keep track of them. They were created as a workaround on the Bitcoin network owing to its lack of native support for tokens. They’ve <a href=\"https:\/\/www.theblock.co\/post\/266272\/brc-20-style-tokens-are-spreading-to-chains-beyond-bitcoin-but-why\" data-v-f87c67ca=\"\">recently spread to many other blockchains for various reasons<\/a>, one of them being that they can be cheaper to move around than native tokens.&nbsp;","This lower cost has been the case on most blockchains. While tens of millions of inscription-based tokens have been created on blockchains like Polygon and BNB Chain, users have paid around a million dollars in fees for each chain in total.","As for Avalanche, transaction fees spent on inscriptions have risen as high as $5.6 million per day in the last few days, according to a<a href=\"https:\/\/dune.com\/hildobby\/inscriptions\" data-v-f87c67ca=\"\"> Dune Analytics dashboard<\/a> created by Hildobby, a pseudonymous researcher at VC firm Dragonfly. The total amount of $13.8 million is roughly 70% of all fees spent on inscriptions across all blockchains tracked by the dashboard.","Avalanche has experienced two significant periods of interest in inscriptions. The first, lasting about five days in late November, generated transaction fees totaling approximately $1.5 million. However, fees have been substantially higher in the more recent period.","This seems to be largely due to a significant rise in non-inscription transactions during the latter period, resulting in increased overall demand for block space. Transaction costs have been climbing steadily this month, with a notable <a href=\"https:\/\/dune.com\/hildobby\/Gas?Blockchain=Avalanche+C-Chain\" data-v-f87c67ca=\"\">spike exceeding<\/a> 5,000 nAVAX, the gas price per unit on the blockchain, on December 18.","Overall, Avalanche has processed 61 million inscription-related transactions, ranking third after BNB Chain with 77 million and Polygon PoS with 161 million transactions. According to the Dune Analytics dashboard, Avalanche <a href=\"https:\/\/dune.com\/queries\/3256830\/5451318\" data-v-f87c67ca=\"\">hosts<\/a> over 1,160 inscription collections.","Those minting and moving inscription-based tokens on Arbitrum have also seen an increase in transaction fees. Around $3 million has been spent doing so over the last three days. This makes up around 15% of fees spent on the blockchains tracked in the dashboard.","Although the total number of inscriptions across all blockchains has remained stable, there has been a sharp rise in the number of addresses used for making inscriptions recently. While previous high days involved around 50,000 addresses making inscription-related transactions, yesterday saw 180,000 addresses doing so. This was primarily due to activity on BNB, Avalanche and zkSync Era.","Whatever the reasons for the sudden spread of inscriptions, as long as miners and validators can handle the increased network activity, they will surely appreciate the extra income. Although that excludes Avalanche validators who don't receive transaction fees, which are burned instead.","<em data-v-f87c67ca=\"\">Update: Added a note to clarify that Avalanche validators don't get transaction fees.<\/em>"],"hashtag":["AVALANCHE"]}