{"summary":"Sam Bankman-Fried’s criminal case and the FTX bankruptcy played out on a split screen this week.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/213046\/sam-bankman-fried-is-embroiled-in-legal-drama-ftx-is-moving-on-without-him","publishDate":"2023-02-17T16:15:10","id":2351,"type":null,"title":"Sam Bankman-Fried is embroiled in legal drama. FTX is moving on without him.","category":["LEGAL"],"content":["Beleaguered crypto exchange FTX is charging ahead in bankruptcy court, preparing for high-profile clawbacks to begin at the end of the month.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Meanwhile, the company’s former CEO could lose most of his access to the internet before his criminal trial, in part because he apparently used a VPN to watch the Super Bowl.","The split screen between Sam Bankman-Fried’s mounting legal woes and his ex-company’s progress in bankruptcy court came into view in courtrooms in Manhattan and Delaware this week.","“It's not uncommon that bankruptcy travels one path and the criminal case travels another,” said Ira Lee Sorkin, a partner at the law firm Mintz &amp; Gold who represented infamous Ponzi schemer Bernie Madoff<span class=\"s2\" data-v-f87c67ca=\"\">.<\/span>","Bankman-Fried has been in legal limbo for weeks after the government accused him of contacting a potential witness in his criminal case and using a virtual private network that could conceal his internet use.","Bankman-Fried is facing a litany of charges for alleged wrongdoing that led to the collapse of FTX, the crypto exchange he founded that was once valued at $32 billion. The former crypto boss, who is awaiting an October trial on a $250 million bond, could be sentenced to more than 100 years in jail if he is convicted on all charges.","“I’m not sure how often the courts have encountered a defendant quite like [Sam Bankman-Fried],\" said Carol Van Cleef, a Washington, D.C. lawyer and CEO of Luminous Group. \"He is truly a millennial defendant who is used to living life large on social media and using all of the latest in encrypted and other communications channels to disseminate his views, which may raise issues in the context of court proceedings like this.”&nbsp;","Prosecutors are seeking stricter changes to Bankman-Fried’s bail terms, and the judge presiding over his case raised the specter of a felony during a court proceeding this week.","“There is probable cause he attempted to commit a felony while on pretrial release,” Judge Lewis Kaplan said during a <a href=\"https:\/\/money.yahoo.com\/judge-warns-ftxs-bankman-fried-your-freedom-can-be-revoked-225436982.html\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">hearing<\/span><\/a> on Thursday.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Prosecutors recently discovered Bankman-Fried had used a VPN, or virtual private network, while under house arrest at his parents’ home in California. A VPN establishes an encrypted connection between a computer and the internet, providing a higher level of privacy. Bankman-Fried’s lawyers said he used the private network to watch the Super Bowl and other NFL games, but that did not stop prosecutors from asking that his internet use be curtailed.","A Bankman-Fried spokesperson declined to comment.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“He shouldn't be anywhere near the computer or any of these things, or he's going to end up in a place where you can't use a computer,” said Michael Popok, a lawyer and co-host of the “Legal AF” podcast. “They're gonna really tighten the screws on him … He still thinks he's the smartest person in the room and the judge is gonna disabuse him of that right quick.”","Kaplan extended temporary restrictions to Bankman-Fried’s bail, barring him from contacting current or former employees of FTX, using a VPN or using encrypted or ephemeral messaging apps. The judge asked lawyers for the government and Bankman-Fried to file proposed bail orders next week.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“He could revoke the bail. He could put stricter provisions under the bail,” Sorkin said. “There are any number of things the judge can do.”<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The bail fiasco isn’t Bankman-Fried’s only legal blunder. The FTX founder had fought to keep private the names of two Stanford University academics who co-signed his bond with his parents. He lost that battle in court when the names of his co-signers, Larry Kramer and Andreas Paepcke, were revealed this week.&nbsp;","Bankman-Fried’s legal woes could soon get even worse. A third member of his inner circle, Nishad Singh, is <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-02-17\/top-bankman-fried-associate-nears-plea-deal-in-us-probe-of-ftx\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">reportedly<\/span><\/a> planning to plead guilty to criminal charges in connection with his role as the former director of engineering at FTX.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","As Bankman-Fried hashes out his bail terms in a Manhattan courtroom, the FTX bankruptcy case is cruising through another court 126 miles south in Wilmington, Del.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“That's because Sam's not involved,” Popok said. “Once you get into that hermetically sealed world of bankruptcy and you're dealing with bankruptcy professionals, lawyers who do this for a living, judges who do this for a living … It’s chugging along. It's got dates, it's got deadlines, it's got filings.”","A judge rejected a motion to appoint an independent examiner in the bankruptcy on Wednesday, siding with new FTX CEO John Ray and saying an investigation could cost the estate more than $100 million and pose security concerns. A spokesperson for FTX did not respond to a request for comment.","“Mr. Ray is a consummate professional, highly qualified with decades of experience in taking control of companies in dire financial condition,” Judge John Dorsey said when issuing his ruling, offering a vote of confidence in Bankman-Fried’s successor.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The bankrupt crypto exchange is on track to make progress on recouping the cash it needs to pay back creditors in just a few days.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The firm told recipients of political contributions and other donations that they have until Feb. 28 to return the money. FTX and its former executives doled out approximately $93 million to political causes over the last several years, bankruptcy court filings show, and lawmakers and political groups are expected to give much of the money back.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","A trio of major Democratic groups, including the Democratic National Committee, have already set aside more than $1 million in contributions to return to the bankruptcy estate.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The firm has also received approval to sell some assets, and the Official Committee of Unsecured Creditors in the FTX case has set up a public Twitter account and was cleared to use its chosen financial advising firm.","FTX’s lawyers even used some newly-granted authority to put their own legal pressure on the former boss.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The FTX debtors asked the court for permission to serve subpoenas to Bankman-Fried and his family in an effort to gather additional information about the collapse of the company. Lawyers received approval and served him last week.","<i data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/i><span class=\"s4\" data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$32 billion","content":"MONEY"},{"type":"John Dorsey","content":"PERSON"},{"type":"Official Committee of Unsecured Creditors","content":"ORGANIZATION"},{"type":"Delaware","content":"LOCATION"},{"type":"Michael Popok","content":"PERSON"},{"type":"$250 million","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"Ray","content":"PERSON"},{"type":"Feb. 28","content":"DATE"},{"type":"Stanford University","content":"ORGANIZATION"},{"type":"Del.","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Sam","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Mintz &amp; Gold","content":"ORGANIZATION"},{"type":"VPN","content":"ORGANIZATION"},{"type":"Manhattan","content":"LOCATION"},{"type":"Luminous Group","content":"ORGANIZATION"},{"type":"NFL","content":"ORGANIZATION"},{"type":"Larry Kramer","content":"PERSON"},{"type":"Lewis Kaplan","content":"PERSON"},{"type":"Andreas Paepcke","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"Wilmington","content":"LOCATION"},{"type":"Washington","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Carol Van Cleef","content":"PERSON"},{"type":"Sorkin","content":"PERSON"},{"type":"Bernie Madoff","content":"PERSON"},{"type":"Nishad Singh","content":"PERSON"},{"type":"$93 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Popok","content":"PERSON"},{"type":"Democratic National Committee","content":"ORGANIZATION"},{"type":"California","content":"LOCATION"},{"type":"Bankman","content":"LOCATION"},{"type":"$1 million","content":"MONEY"},{"type":"December 2022","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"Ira Lee Sorkin","content":"PERSON"},{"type":"John Ray","content":"PERSON"},{"type":"Michael McCaffrey","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"D.C.","content":"LOCATION"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}