{"summary":"Binance.US can buy failed crypto lender Voyager Digital’s assets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/217901\/binance-us-gets-green-light-to-buy-voyager-digital-assets","publishDate":"2023-03-07T18:02:18","id":2352,"type":null,"title":"Binance.US gets green light to buy Voyager Digital assets ","category":["COMPANIES"],"content":["Binance.US can buy failed crypto lender Voyager Digital’s assets, a federal judge confirmed after a four-day marathon hearing that stretched from last week to this one.&nbsp;","Judge Michael Wiles confirmed Voyager’s modified restructuring plan on Tuesday, which includes the $1 billion deal with Binance.US.","The plan faced objections from the Securities and Exchange Commission, other regulators and some individual creditors who raised issues about Binance.US. Wiles acknowledged the concerns but said he had not seen actual evidence that suggested Binance.US should be denied.&nbsp;","“I am in the absolutely unenviable position of having to make a ruling about the proposed transaction in the face of hearsay accusations of potential wrongdoing in an industry where other firms have apparently engaged in real wrongdoing,” Wiles said. “I have been given no evidence … that Binance.US will misuse customer assets, or that it cannot be trusted.”<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The judge’s decision is subject to changes he proposed to the final restructuring plan, he noted, including tweaks to an exculpation provision for parties who carry out the transaction and details about how Binance.US will handle customer data.","A spokesperson for the company called the SEC lawyer's allegations \"regrettable\" but praised the Wiles' approval of the sale.&nbsp;","“Our goal has always been to return customers their cryptocurrency on the fastest timeline possible and empower users to make their own decisions about their own assets. We look forward to completing the transaction and welcoming Voyager customers to <a href=\"http:\/\/binance.us\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\" data-safelink=\"true\" data-linkindex=\"0\" data-v-f87c67ca=\"\">Binance.US<\/a> where they can expect the highest levels of service and support,” a Binance.US spokesperson said via email.&nbsp;","<span class=\"s2\" data-v-f87c67ca=\"\">The plan, which could still be derailed by the inter-agency Committee on Foreign Investment in the United States, includes a “toggle” option to allow Voyager to self-liquidate assets if the sale is unsuccessful. CFIUS, which can reject foreign purchases of U.S. companies, has said in court filings that the <a href=\"https:\/\/www.theblock.co\/post\/198587\/binance-us-deal-with-voyager-may-fall-under-federal-committee-review\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">transaction<\/span><\/a> between Binance.US and Voyager could come under review.<\/span>","In issuing his ruling, Wiles acknowledged the unusual nature of the bankruptcy case and the shifting regulatory environment.","“The current regulatory environment can only be characterized as uncertain, but the future regulatory environment can only be characterized as, in my mind, virtually unknowable,” Wiles said. He also nodded to other collapsed crypto firms, including FTX, which tried to buy Voyager’s assets before filing for bankruptcy last year.","Of the 6% of creditors who voted on the proposed Voyager plan, 97% voted in favor. Customers could see a 73% recovery under the proposal, Voyager lawyers say, although that percentage would drop to 48% if claims from bankrupt crypto exchange FTX and its sibling company Alameda Research are successful. More than 167,000 customers have already signed up for the Binance.US platform.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Wiles tussled with several government agencies during the hearing. He admonished the SEC for telling the court that its staff believes Binance.US is operating an unregistered securities exchange in the U.S., but not taking an official position on the matter or providing evidence to prove it.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Wiles also had sharp words for the lawyer representing the U.S. Attorney’s Office for the Southern District of New York, who objected to providing a criminal exculpation for parties who carry out pieces of the Voyager plan.","J.D. Barnea, the co-chief of the office’s tax and bankruptcy unit, said it was inappropriate for a bankruptcy court to enjoin criminal prosecution for anyone. Wiles responded by saying that the attorney’s office did not provide evidence that anything in the deal was illegal and called Barnea’s suggestion “preposterous.”<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“The very suggestion offends me to no end. I can’t believe you would even take the position in front of me,” Wiles said “People who have to do what my order will compel them to do are entitled to know, okay? And they’re entitled to clarity.”<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Wiles came to his decision on the restructuring plan after hearing well over 20 hours of testimony during a lengthy hearing in the U.S. Bankruptcy Court for the Southern District of New York. The judge thanked creditors for the “unusual amount of work and energy that they have put into following this case.”","“This bankruptcy case has been pending since July 2022. Customers and creditors have been denied access to their assets for many months and they deserve to have a resolution of this case,” Wiles said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<em data-v-f87c67ca=\"\">Update: Story updated with new comment from Binance.US on sale approval.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"6%","content":"PERCENT"},{"type":"Wiles","content":"PERSON"},{"type":"Committee on Foreign Investment","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Southern District of New York","content":"ORGANIZATION"},{"type":"Barnea","content":"PERSON"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"97%","content":"PERCENT"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"73%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"J.D. Barnea","content":"PERSON"},{"type":"48%","content":"PERCENT"},{"type":"the Southern District of New York","content":"ORGANIZATION"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"July 2022","content":"DATE"},{"type":"Michael Wiles","content":"PERSON"}],"hashtag":["BANKRUPTCY FILINGS","BINANCE","COURT HEARINGS"],"authors":["Stephanie Murray","The Block"]}