{"summary":"Hedge fund and information marketplace Numerai has closed a $3 million token sale\nUnion Square Ventures, Placeholder, CoinFund, Dragonfly Capital and Numerai founder Richard Craib participated in the fundraising\nThe fresh capital will be used to develop Erasure, an information staking protocol built on Ethereum","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/67223\/numerai-3-million-token-sale-staking-protocol","publishDate":"2020-06-03T11:00:18","id":2354,"type":null,"title":"Union Square Ventures, Placeholder among the investors in Numerai&#x27;s new $3M token sale","category":["The Block"],"content":["Numerai, the startup known for hosting data scientist tournaments to find the best trading strategies for its hedge fund, has concluded a $3 million token sale of its native token, NMR.&nbsp;","Announcing the news on Wednesday, Numerai said the new capital will be used to fund the development of its information staking protocol Erasure, which is separate from the company's hedge fund business. Purchasers of the tokens include Union Square Ventures, Placeholder, CoinFund, Dragonfly Capital and Numerai founder Richard Craib.&nbsp;","\"[This fundraising] gives us a lot more money that goes directly to developing Erasure and increasing the number of stakes, increase the users, and letting the protocol be used all over the Internet,\" Craib told The Block.&nbsp;","According to DeFi Pulse, a total of $2.1 million worth of tokens are locked in the Erasure protocol. It is currently used as the underlying technology of Numerai's data scientist tournaments, as well as its stock prediction marketplace Erasure Quant and the information marketplace Erasure Bay.","On all three platforms, users are required to deposit NMR or the stablecoin DAI as stakes before posting information. These stakes are forfeited if the information they provide is deemed inaccurate.&nbsp;","Among the three use cases, Erasure Bay is Numerai's latest initiative, having been launched in March. While users could previously submit predictions related only to the equity market, with Erasure Bay they can exchange any information. Since launch, the platform has seen users asking for a <a href=\"https:\/\/twitter.com\/ErasureBay\/status\/1240753132793024513\" data-v-f87c67ca=\"\">valuation model for NMR<\/a>, the <a href=\"https:\/\/twitter.com\/ErasureBay\/status\/1265511086255677442?s=20\" data-v-f87c67ca=\"\">most beautiful Chinese song<\/a>,&nbsp;<a href=\"https:\/\/twitter.com\/ErasureBay\/status\/1262868376470163456?s=20\" data-v-f87c67ca=\"\">feedback on Ethereum wallet Authereum<\/a>, etc.&nbsp;","The company conducted an initial token sale last year, raising $11 million from Paradigm and Placeholder. However, while this previous round was mostly used to fund the operations of Numerai's hedge fund, the newly-raised $3 million will focus on Erasure.","\"It is really a continuation of that. It is also all going towards Erasure, whereas in the previous round, some of the money went more towards Numerai hedge fund. And so this is really like a sort of Erasure series B round,\" Craib said.&nbsp;"],"hashtag":["DAI"]}