{"summary":"Roger Ver, known to some as “Bitcoin Jesus,” sued a Matrixport subsidiary for $8 million last year. \nVer claims Matrixport’s billionaire founder, Jihan Wu, froze his funds because Wu held him responsible for losses on CoinFLEX. \nMatrixport said, however, that the move resulted from an investigation into trading irregularities.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/261597\/roger-ver-matrixport-lawsuit-frozen-crypto","publishDate":"2023-11-06T03:59:20","id":2356,"type":null,"title":"Roger Ver is suing Matrixport over $8 million in frozen crypto","category":["Policy"],"content":["<span data-v-f87c67ca=\"\">Roger Ver, a crypto entrepreneur and Bitcoin Cash evangelist, last year sued an offshoot of billionaire Jihan Wu’s Matrixport in the Seychelles over frozen funds — a case that has remained hushed up until now.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Ver told The Block in written statements that he sued Smart Vega Holding Limited, a subsidiary of Matrixport, in August 2022 for $8 million after he was unable to withdraw the same amount from the company’s derivatives-focused subsidiary, bit.com, amid the crypto credit crunch that crippled the industry last year.&nbsp;<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Ver alleges that his request to withdraw $8 million from bit.com in June 2022 was blocked by Wu, who is also a co-founder of Bitmain, explicitly because he held Ver responsible for his personal losses at CoinFLEX — another bankrupt crypto business with <\/span><a href=\"https:\/\/www.coindesk.com\/business\/2023\/10\/25\/hobbled-crypto-exchanges-creditors-are-suing-its-ceo-and-want-to-claw-back-money-from-bitcoin-jesus\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">which Ver is in dispute<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">“The reason my Funds were unavailable for withdrawal was because Wu had instructed Respondent not to release them to me. Wu had done so because he believed I owed sums to a third party who owed sums to him. His belief was both false and irrelevant,” Ver wrote in an affidavit filed to the Supreme Court of the Seychelles in September 2022. “Wu is improperly co-mingling his personal interests with that of the defendant.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A Matrixport spokesperson gave a different version of events.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Mr. Ver is a bit.com customer. This matter stems from the outcome of an exchange investigation into Mr. Ver’s margin trading irregularities on bit.com, which found that he was in breach of his contractual obligations. Subject to a penalty fee for margin call defaults, Mr. Ver was free to withdraw his funds but instead disputed the penalties payable,” said Ross Gan, head of public relations and brand at Matrixport.&nbsp;<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Gan said that Ver “continues to make unreasonable demands” beyond the withdrawal of his funds, adding that the company has been advised by lawyers to withhold the funds until a court decision is made, but has offered to place the disputed amount in a third-party custody account.&nbsp;<\/span><span data-v-f87c67ca=\"\">“We will respect the legal process and the ultimate Court ruling on this case and reserve all our rights to take further legal action in this ongoing dispute with Mr. Ver,” Gan said.&nbsp;<\/span>","Both Ver and Wu were also instrumental leaders in the creation of Bitcoin Cash and promoters of the high-profile Bitcoin hardfork.","<span data-v-f87c67ca=\"\">Ver also applied “for a compulsory winding up (liquidation) of the company” by filing a windup petition in the Seychelles, based on what he described as “Jihan’s written admission that Matrixport was forfeiting funds it owed me for his own personal reasons.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The September 2022 petition includes Telegram exchanges between Ver and Wu, in which Wu allegedly said: “My position is very simple. I am a creditor of CoinFlex, and CoinFlex is a creditor of you. You just send your USDC back to CoinFlex to repay the debt there and CoinFlex release the 5m$[sic] USDC to me.”<\/span>","<span data-v-f87c67ca=\"\">Matrixport’s Gan said that the petition, currently under review by the court, is “without any merit.”&nbsp;<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Matrixport is solvent and well capitalized. Without commenting on the details of the case, it is our understanding that based on our strong legal grounds, Mr. Ver’s petition will be struck down by the Court,” he added.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">News of the dispute comes with CoinFLEX, the exchange formerly run by Mark Lamb and Sudhu Arumugam, embroiled in a complex restructuring.&nbsp;<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">CoinFLEX <\/span><a href=\"https:\/\/www.wsj.com\/articles\/crypto-exchange-coinflex-files-for-restructuring-in-seychelles-11660151657\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">filed for restructuring in the Seychelles<\/span><\/a><span data-v-f87c67ca=\"\"> in August 2022 after a public spat with Ver in which it accused the former Bitcoin.com CEO — who was also an investor in CoinFLEX — of defaulting on an $84 million debt owed to the company.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Ver said in a statement, however, that it was in fact he who first sued CoinFLEX for $200 million in June 2022 and that CoinFLEX filed its counterclaim later. <\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Last week, <\/span><a href=\"https:\/\/www.coindesk.com\/business\/2023\/10\/25\/hobbled-crypto-exchanges-creditors-are-suing-its-ceo-and-want-to-claw-back-money-from-bitcoin-jesus\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">creditors of CoinFLEX accused Lamb of going rogue<\/span><\/a><span data-v-f87c67ca=\"\"> by diverting resources from the company to help set up OPNX, a new exchange that emerged earlier this year with an <\/span><a href=\"https:\/\/www.theblock.co\/post\/202589\/3ac-zhu-davies-new-crypto-exchange\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">audacious plan to raise $25 million<\/span><\/a><span data-v-f87c67ca=\"\">. Kyle Davies and Su Zhu, co-founders of the collapsed crypto hedge fund Three Arrows Capital, spearheaded OPNX alongside Lamb.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The CoinFLEX creditors hope to claw back money from Ver, whose debt they claim Lamb <\/span><a href=\"https:\/\/x.com\/CoinFLEXreal\/status\/1717496751991439697?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">settled in secret earlier this year<\/span><\/a><span data-v-f87c67ca=\"\">. Ver, on the other hand, said the arbitration was settled on a drop-hands basis, adding that as part of the settlement he is “to receive the first $100,000,000 from the responsible third parties in further legal proceedings that are now being contemplated.”<\/span>"],"hashtag":[]}