{"summary":"Three Arrows Capital co-founder Kyle Davies said that it wasn’t luna, an ensuing credit squeeze or declining crypto prices that brought the hedge fund to its knees.\nHe said 3AC’s death knell came from being liquidated on FTX before it collapsed.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193649\/three-arrows-capital-co-founder-says-it-wasnt-luna-that-took-it-out-but-ftx","publishDate":"2022-12-09T09:32:25","id":2364,"type":null,"title":"Three Arrows Capital co-founder says it wasn’t luna that took it out, but FTX","category":["Companies"],"content":["It wasn’t the collapse of the cryptocurrency luna that ultimately caused the downfall of Three Arrows Capital, according to 3AC co-founder Kyle Davies. Instead, it was the firm’s final position being liquidated on FTX.&nbsp;","Davies broke down how the hedge fund unwound on a <a href=\"https:\/\/www.youtube.com\/watch?v=tJiQiL5bLY0&amp;t=539s\" data-v-f87c67ca=\"\">podcast<\/a> with hedge fund manager Hugh Hendry. He claimed that the fund survived the collapse of luna, the ensuing credit squeeze and decline of crypto prices — only to succumb when it was liquidated by FTX. He also claimed FTX and Alameda shared internal information and that the trading firm knew its liquidation level and deliberately hunted it.&nbsp;","Davies started by downplaying how much luna affected the fund. “So for me it was a hit. I put $200 million in, it went up to [$600 million] and then went to zero. So it was a hit, but I was a $4-plus-billion fund so it wasn’t an enormous hit,” he said.","He said a bigger hit came when credit was squeezed across the crypto ecosystem and lenders started recalling loans. He claimed 3AC returned all loans that were requested during that period.","At the same time, the wider crypto market saw a big decline in prices. Davies noted that bitcoin, ether and many native coins for Layer 1 blockchains all saw huge declines following the collapse of luna — dropping 40%-50%. Yet even then, he said this wasn’t a huge problem and the firm didn’t need to file for liquidation.","There were a few other big impacts of luna’s demise. Davies noted that the discount for Grayscale’s Bitcoin Trust fell from 20% to 40%. Similarly, he pointed to staked ether, a token that’s backed by ether — but not yet redeemable for it — started trading below par with ether. He said it dropped as low as 80 cents on the dollar and that people were saying it could go to 70 cents. Both of these impacted 3AC, yet even then, Davies maintained, it was not game over.&nbsp;","“For me, it was OK, still at that point,” he said. “We were hurt but we were still alive.”","It was only after all of this that 3AC was brought to its knees. This related to one of its positions on FTX, while it was still operational, being liquidated.","“For us the final killer was, after all of these hits, our final position ended up getting hunted on FTX. They saw — there’s FTX the exchange, there’s Alameda, the prop trading firm — they share positions, I’ve got internal chat of a guy bragging about our liquidation level and sure enough it gets hit and we get taken out,” he said.","The Block has reached out to FTX and Alameda to address these claims.","Beyond this, Davies said, there were many things he could have done better, but argued that the role of a hedge fund is to take risk. He said he could have done more analysis of Luna, but downplayed this as it wasn’t the main loss for the fund."],"hashtag":["CRYPTO BANKS AND LENDERS","INVESTMENT FIRMS"]}