{"summary":"Canaan strategic partner Interhash and market maker GSR have tied up to launch derivatives for bitcoin miners\nCristian Gil, co-founder of GSR, said that bitcoin miners are currently either “under-hedged or outright un-hedged against adverse price action”\nThe new products are expected to launch next month.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/51226\/bitcoin-miners-could-soon-hedge-their-risks-as-canaan-backed-startup-and-gsr-are-set-to-launch-derivatives","publishDate":"2019-12-20T05:45:12","id":2366,"type":null,"title":"Bitcoin miners could soon hedge their risks as Interhash and GSR are set to launch derivatives","category":["Mining"],"content":["Bitcoin miners could soon protect themselves against volatility in bitcoin prices with derivative products.","Cryptocurrency market maker GSR and Canaan Creative strategic partner Interhash&nbsp;<a href=\"https:\/\/www.businesswire.com\/news\/home\/20191219005597\/en\/\" data-v-f87c67ca=\"\">have tied up<\/a> to launch derivatives for bitcoin miners.","The companies are preparing to launch customized structured products, including swaps, to allow bitcoin miners to protect themselves against losses and earn returns on their inventory.","Cristian Gil, co-founder of GSR, said that bitcoin miners are currently either “under-hedged or outright un-hedged against adverse price action.” He added that the unpredictability of their business models warrants better ways of hedging risks.","<span data-v-f87c67ca=\"\">\"There is an increasing need to hedge when you have CFOs, and a board of directors, and investors, rather than someone who has a basement mining operation. We are helping deliver risk management solutions to help identify and reduce these exposures from mining,” GSR co-founder Richard Rosenblum told The Block.&nbsp;<\/span>","To start, the firm's derivatives products aim to help miners mitigate two risks - price movement of bitcoin and the uncertainty in hash rate. Rosenblum likened hash rate to crude oil while bitcoin to gasoline, saying that just like in the traditional oil industry, in mining the producers of hash rate and of bitcoins will be separate eventually, and these groups need to hedge their risks respectively.&nbsp;","<span data-v-f87c67ca=\"\">\"At this stage, there is a lot of groups trying to play multiple roles in the market, but ultimately over time these roles are probably going to break up, there are miners that produce hash rate, then changing the hash rate into bitcoin is more of a separate process that splits out,\" Rosenblum said. \"Hashrate isn't discussed as much, but it's potentially more of an important element rather than the focus on the resulting product, which is bitcoin.\"&nbsp;&nbsp;<\/span>","\"Bitcoin is a better hedge than doing nothing, but there is still some left overexposure if they haven't hedged out that left-over component,\" Rosenblum added.&nbsp;&nbsp;","Some $3 billion worth of bitcoin is expected to be mined globally next year at current prices, according to GSR. While the firm did not provide a specific date for the launch of new derivatives, it said miners can expect these next month.","Founded in 2013, GSR already provides several products and services, including a Bitcoin Variance Swap. The <a href=\"https:\/\/www.theblockcrypto.com\/linked\/20903\/gsr-launches-new-bitcoin-hedging-product\" data-v-f87c67ca=\"\">swap<\/a> “allows traders, investors, businesses or anyone who holds a serious portfolio, to hedge against and take advantage of one of the most common and intimidating parts of crypto markets: volatility,” Gil said at the time.","<strong data-v-f87c67ca=\"\">Where is the market?&nbsp;<\/strong>","Still, <a href=\"https:\/\/www.theblockresearch.com\/money-2-0-stuff-say-no-to-sudoku-derivatives-46724\" data-v-f87c67ca=\"\">there are worries<\/a> that derivatives products on hash rates may not be able to generate enough interest to form a liquid market.","As bitcoin is still a feledging market, a lack of understanding of risks associated with mining may hinder some market participants from taking the other side of miners looking to hedge out their risks. However, Rosenblum believed that the interest in mining and the risk premium are high enough for mining-related derivatives to have a market.&nbsp;","<span data-v-f87c67ca=\"\">\"We are getting calls multiple times a day by groups who want help to get out of this exposure, and when it comes to the risk premium, if they are willing to pay to take down this risk, there is going to be groups out there that are willing to take over that exposure and have that risk premium be the form of compensation,\" said Rosenblum.&nbsp;<br data-v-f87c67ca=\"\">\n<\/span>","Indeed, interest in mining is on the rise as large multi-billion funds looking for bigger bets and higher returns than merely purchasing bitcoins. Fidelity Digital Assets Tom Jessop recently <a href=\"https:\/\/www.theblockcrypto.com\/post\/50345\/the-scoop-live-fidelity-digital-assets-president-tom-jessop\" data-v-f87c67ca=\"\">pointed out<\/a> that current liquidity in the overall cryptocurrency markets still could not support billions of dollars of new capital coming into it.","As such, some large funds will be looking to mining to take a bigger position on bitcoin, according to Rosenblum. And, instead of directly participating in mining, they will seek to gain this kind of exposure through structural products that wrap around mining.&nbsp;","<span data-v-f87c67ca=\"\">“There is definitely not the potential but certainty that today funds are looking to buy bitcoin, but whether tomorrow is next quarter or two years out, funds are going to be not only participating in the infrastructure but more of the picks and shovels like they are today, but in a bigger way, as they understand the space more,\" said Rosenblum. \"They are looking for less directionally exposed businesses so its less volatile, but I also think they are going to invest in these more core products than bitcoin to get some direct exposure to hash rate.\"&nbsp;<\/span>","At present, <a href=\"https:\/\/www.theblockcrypto.com\/post\/50274\/chinese-bitcoin-miners-control-65-of-the-crypto-networks-processing-power-bitmains-market-share-continues-to-decline\" data-v-f87c67ca=\"\">Chinese bitcoin miners<\/a> control 65% of the cryptocurrency network's processing power (hash rate), according to research by digital assets manager CoinShares. The new derivative offerings could help them better manage their risks.","<strong data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Correction:<\/em><\/strong><em data-v-f87c67ca=\"\">&nbsp;This article has been updated to reflect that Interhash is a strategic partner of Canaan. This report has been updated with more information.<\/em>"],"hashtag":[]}