{"summary":"Upstream has created an all-in-one DAO builder, which brings voting and governance together in one place.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/124685\/social-platform-upstream-is-building-a-dao-it-yourself-kit","publishDate":"2021-11-18T12:00:45","id":2366,"type":null,"title":"Social platform Upstream is building a DAO-it-yourself kit","category":["GOVERNANCE"],"content":["DAOs are undeniably catching hold in the crypto world, enabling people to come together and buy expensive NFTs, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/121542\/nft-ownership-collaborative-pleasrdao-says-it-purchased-rare-wu-tang-clan-album\" data-v-f87c67ca=\"\">unique music albums<\/a> — and potentially even a <a href=\"https:\/\/www.theblockcrypto.com\/post\/124288\/a-dao-is-trying-to-buy-a-rare-print-of-the-us-constitution\" data-v-f87c67ca=\"\">rare version of the U.S. Constitution<\/a>.","But they remain difficult to set up and fragmented across multiple decentralized services. Voting is done via snapshot, governance via Aragon, communication via Discord channels and smart contract interactions by hand. It’s disorganized.","That’s why Upstream, a company focused on networking and live events, is launching an all-in-one DAO offering: <a href=\"https:\/\/blog.upstreamapp.com\/introducing-upstream-collectives\/\" data-v-f87c67ca=\"\">Upstream Collective<\/a>. It lets anyone launch a DAO by issuing tokens. These tokens can then be used to create proposals and vote on them. If a proposal passes, the proposed actions will be automatically carried out on-chain. Participants won’t even need to know how to code.","While the DAO will provide these services, it won't custody tokens. So participants in the DAO will need to use their own Ethereum wallets to store the tokens and sign transactions.","Upstream Collective is launching today in beta mode, with initial access to Upstream’s biggest NFT community, but will be expanding toward the end of the year. The platform will also be adding a chat functionality in the same timeframe to enable communication between DAO members.","One of Upstream Collective's main priorities is to keep it accessible. In the same way that Top Shot refers to <i data-v-f87c67ca=\"\">collectibles<\/i> instead of NFTs, it’s using the word <i data-v-f87c67ca=\"\">collectives<\/i> to replace the word DAO.&nbsp;","“We are taking these complex blockchain crypto worlds and making them something that is accessible and usable. From our experience, the reason most people haven’t joined a DAO is because they’re not technical or don’t have financial means,\" said Upstream co-founder Alex Taub. \"We think there’s a middle ground that doesn’t exist yet — that we’re hoping to create.”","Taub explained that when he previously built a platform for analyzing your social following, called SocialRank, it was dependent on Twitter and Instagram — and when they changed their APIs, it would break the software. The frustrations from that experience led him to focus on building everything in-house. That’s why the new service doesn’t simply connect to all the pre-existing tools needed for a DAO; it seeks to provide an alternative to using each of them individually.","In its first form, Upstream Collective will prohibit users from building DAOs that are used for investment purposes. This is to avoid running the risk of creating securities. But Taub said that the next version might be more flexible in this regard and provide options for those building DAOs to make them regulatory compliant.","Upstream was launched in November 2019. The team is made up of 11 full-time employees who work remotely. It raised $750,000 in a pre-seed round at the end of 2020 and $2.5 million in a seed round in May 2021.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Upstream Collective","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"May 2021","content":"DATE"},{"type":"Taub","content":"PERSON"},{"type":"November 2019","content":"DATE"},{"type":"$2.5 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Alex Taub","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Aragon","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"$750,000","content":"MONEY"}],"hashtag":[],"authors":["Tim Copeland","The Block"]}