{"summary":"Sam Altman’s Worldcoin is working with manufacturing giant Jabil in Germany to ramp up production of its iris-scanning orbs.\nThe project is eyeing a mainnet launch in the first half of this year, at which point it will be capable of producing 400 orbs a month.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/220402\/worldcoin-outsourcing-deal-jabil-iris-scanning-orbs","publishDate":"2023-03-16T12:02:59","id":2368,"type":null,"title":"Sam Altman’s Worldcoin signs outsourcing deal to ramp up production of iris-scanning orbs","category":["Companies"],"content":["Worldcoin, the identity-focused crypto project co-created by OpenAI CEO Sam Altman, has signed a deal with contract manufacturer Jabil as it ramps up production of its controversial eyeball-scanning orbs.&nbsp;","Worldcoin is working with the Florida-based global manufacturing giant to outsource production of the portable, iris-scanning devices that were first unveiled in 2021,&nbsp;according to two people familiar with the matter.","Through a contractual relationship with a German unit of Jabil, Worldcoin can now produce 400 orbs a month, the people said. One year ago, it had just 30 orbs in circulation, according to a Bloomberg <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-03-16\/worldcoin-the-eyeball-scanning-crypto-unicorn-hits-signup-snags\" data-v-f87c67ca=\"\">report<\/a> at the time. A spokesperson for Jabil declined to comment.","In the past year, Worldcoin transitioned from producing a prototype orb internally to working with an external manufacturer, giving it the capacity to prepare to scale the project when ready, said a third person with knowledge of the matter. They added that the number of orbs in circulation at any given moment today has risen to 250.","While Worldcoin is growing, progress has been slower than forecast. Worldcoin CEO Alex Blania told Bloomberg the project would have 6,000 orbs and 20 million to 30 million sign-ups by the end of 2022. The project has registered just 1.3 million users so far, according to an announcement this week.","Worldcoin plans to begin increasing production of the orbs once its mainnet and token go live — a hotly anticipated launch scheduled for the first half of this year. Public interest in the launch has only been heightened by the spectacular success of Altman’s OpenAI, parent company of ChatGPT. Microsoft agreed to <a href=\"https:\/\/www.cnbc.com\/2023\/01\/23\/microsoft-announces-multibillion-dollar-investment-in-chatgpt-maker-openai.html\" data-v-f87c67ca=\"\">invest billions<\/a> of dollars in the startup in January, reportedly valuing it at $29 billion.","Worldcoin published a considerable amount of information about how its orb is made in a January <a href=\"https:\/\/worldcoin.org\/blog\/engineering\/opening-orb-look-inside-worldcoin-biometric-imaging-device\" data-v-f87c67ca=\"\">blog post<\/a>, while also releasing “all relevant, hardware-related engineering files for its current version in our repository.” It didn't mention any details of production, beyond noting that \"manufacturing of the latest generation of Orbs is already well underway in Germany.\"","With more than 250,000 staff spread across over 100 sites in 30 countries, Jabil serves a wide range of industries from telecommunications to healthcare. The company is listed on the New York Stock Exchange, with a market capitalization of $10.7 billion. Its shares have enjoyed a lengthy period of growth since the outbreak of the COVID-19 pandemic, roughly quadrupling over the past three years.","Though The Block was unable to confirm exactly which Jabil unit Worldcoin is working with, it’s worth noting that the company has an Optical Technology group based in the German city of Jena. Jena boasts an area known as “Optics Valley,” which is also home to a museum of optical instruments. On its <a href=\"https:\/\/www.jabil.com\/contact\/locations\/jena.html\" data-v-f87c67ca=\"\">website<\/a>, Jabil’s unit in Jena touts its expertise in “miniaturized optical engines and specialized camera systems.”","Tools For Humanity (TFH), the lead software contributor to the Worldcoin project, led the research and development of both the Worldcoin protocol and the orb. Once the network is live, later this year, a non-profit entity called the Worldcoin Foundation will assume responsibility for continuing to develop the protocol as it pursues decentralization. Meanwhile, TFH will support the foundation, in part by continuing to manufacture and ship the orbs.","The orbs themselves are just one way participants in the Worldcoin project can get verified. Phone number verifications, for example, are also on offer — albeit with less accuracy. When Worldcoin first <a href=\"https:\/\/www.coindesk.com\/tech\/2021\/06\/30\/gaze-into-the-orb-to-collect-your-worldcoin\/\" data-v-f87c67ca=\"\">unveiled<\/a> the orbs in June 2021, they drew outcry from leading privacy advocates, including Edward Snowden.&nbsp;","But Tiago Sada, head of product, engineering and design at Tools For Humanity, told The Block in a recent interview that there are “a lot of misconceptions out there” about how the orbs work. “A lot of people don’t know that your biometric data gets destroyed at the orb,” he said. Users can opt in to having their biometric data stored, which, though not incentivized by Worldcoin, helps improve the protocol.","Earlier this week, Worldcoin announced <a href=\"https:\/\/www.theblock.co\/post\/219541\/sam-altmans-worldcoin-unveils-world-id-protocol-and-sdk\" data-v-f87c67ca=\"\">the launch<\/a> of World ID, its underlying identity protocol powered by zero-knowledge technology, which people can use with mobile wallets to prove who they are online without ceding personal information.","The startup is also running an <a href=\"https:\/\/worldcoin.org\/blog\/worldcoin\/what-is-worldcoin-operator\" data-v-f87c67ca=\"\">operator program<\/a> that compensates businesses for getting people scanned. A <a href=\"https:\/\/twitter.com\/ashleshbiradar\/status\/1630837126106611713?s=20\" data-v-f87c67ca=\"\">recent post<\/a> on Twitter shows the orb in action in Delhi on top of a Worldcoin stand displaying the words, “Reserve your free share today.”","Worldcoin is valued at $3 billion after reportedly raising $100 million from Khosla Ventures and Andreessen Horowitz in March 2022. The Block <a href=\"https:\/\/www.theblock.co\/post\/210014\/sam-altman-worldcoin-fundraise\" data-v-f87c67ca=\"\">revealed<\/a> in February that the company is seeking another round of funding at the same valuation."],"hashtag":["HARDWARE"]}