{"summary":"The European Central Bank is gauging whether a digital currency has a part to play in improving its interbank transaction activities, according to a speech by an executive board member.\nBut the ECB is unlikely to be the first-mover around a central bank digital currency, said a member of its board. ","author":["Inbar Preiss","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/172812\/european-central-bank-preparing-for-broad-digital-currency-adoption-scenario","publishDate":"2022-09-26T11:27:19","id":237,"type":null,"title":"European Central Bank preparing for broad digital currency adoption &#x27;scenario&#x27;","category":["Policy"],"content":["The European Central Bank (ECB) is analyzing options for integrating decentralized ledger technology (DLT) into existing payment settlement systems, Fabio Panetta, an executive ECB board member, said in a <a href=\"https:\/\/www.ecb.europa.eu\/\/press\/key\/date\/2022\/html\/ecb.sp220926~5f9b85685a.en.html\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">speech<\/a> on Monday during a symposium in Frankfurt dedicated to the topic of settlements.&nbsp;","But the senior central banker suggested that the ECB will not be a first-mover in the space, instead monitoring how widely stablecoins and central bank digital currencies take hold.&nbsp;","If stablecoins and central bank digital currencies become more widely adopted, the ECB will look at creating bridges between existing European real-time payments systems or its own digital euro, said Panetta.&nbsp;","Bankers see the most potential for stablecoins in large daily wholesale transactions that take place between banks internationally due to the existing complications of cross-border and cross-currency payments, Panetta said. But he noted that the ECB, which exists in part to ensure a stable euro, is wary of the fact that major blockchain networks primarily exist in areas outside of Europe, \"which raises concerns about strategic autonomy,\" Panetta said. &nbsp;","\"But despite the uncertainties surrounding DLT’s potential, we want to be prepared for a scenario where market players adopt DLT for wholesale payments and securities settlement,\" said Panetta.<strong data-v-f87c67ca=\"\"> \"<\/strong>We must ensure that, in such a scenario, central bank money would still retain its role as the settlement asset for wholesale transactions.\"","Panetta implied that the ECB's path forward will largely depend on how prominently stablecoins or central bank digital currencies figure into payments. The central bank's current research efforts are more focused around continuing to \"anchor\" the euro as a stable currency by being poised to build infrastructure better connecting existing payments rails to stablecoins, CBDCs, or more decentralized networks if needed.&nbsp;","Panetta noted that the European financial system already has real-time payments, a major selling point of stablecoins, and that blockchain-based payments will need to “prove” that they are superior to other existing technologies. Furthermore, “implications for governance, settlement efficiency and liquidity management need to be carefully assessed.”","The ECB is amping up resources towards digital currencies and its use cases. It kick-started a two-year investigation into the digital euro in July 2021, and <a href=\"https:\/\/www.theblock.co\/post\/170734\/amazon-among-five-companies-to-develop-digital-euro-prototype-for-the-ecb\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">announced<\/a> the partners in the prototype development earlier in September. The evaluation and results of the project is anticipated in March 2023."],"hashtag":["ECB"]}