{"summary":"As Bitcoin’s price continued to rise this week, the continued rally has affected some crypto-related stocks better than others. \nMining companies Bitfarms, Core Scientific, and Argo Blockchain were among the biggest-gaining crypto-related stocks of the past week on Wall Street, though bigger player Riot’s stock underperformed Bitcoin’s price. ","author":["Zack Abrams","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266871\/crypto-stock-recap-wall-street-isnt-treating-all-bitcoin-miners-alike","publishDate":"2023-12-09T16:24:47","id":2373,"type":null,"title":"Crypto stock recap: Wall Street isn&#x27;t treating all Bitcoin miners alike","category":["Market Recap"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.27%\n    <\/span><\/a> <!----><\/span><\/span>'s price rose another 6.6% while the stock market was open this week, but the recent rally in the coin's price hasn't affected all crypto-related stocks equally.<\/span>","Here's how last week's stock market returns stacked up for the top crypto-related stocks.&nbsp;","<strong data-v-f87c67ca=\"\">Small miners posted big gains<\/strong>","This week's winners appear to be smaller Bitcoin mining firms Bitfarms (up 46.2%) and Core Scientific (up 43.5%), handily outperforming Bitcoin's gains. Argo Blockchain and Terawulf also posted more modest gains of 31% and 20% on the week, respectively, according to data from TradingView.&nbsp;","Not every smaller miner fared the same, though. Cipher Mining faced a loss of 4.3% on the week, while Hut 8's stock fell 3.9%.&nbsp;","As for the industry's leaders, while Marathon managed to beat out Bitcoin with gains of 10.1%, Riot underperformed Bitcoin with gains of only 2.5%. J.P. Morgan recently <a href=\"https:\/\/www.coindesk.com\/business\/2023\/12\/08\/bitcoin-miner-cleanspark-cut-to-neutral-riot-platforms-upgraded-to-neutral-jpmorgan\/\" data-v-f87c67ca=\"\">updated Riot's rating<\/a> from neutral to underweight with a price target of $12.&nbsp;","<strong data-v-f87c67ca=\"\">Coinbase and Microstrategy underperformed<\/strong>","Some large crypto stocks gained on the week, but failed to outperform Bitcoin's price gains. In the past week, Coinbase's stock gained only 1.5% when compared to Bitcoin's rise of 6.6%. Microstrategy, led by Michael Saylor, also underperformed compared to Bitcoin, but still managed to gain 5.1% on the week, according to TradingView.","<strong data-v-f87c67ca=\"\">Last week's biggest losers<\/strong>","Canaan, developers of Bitcoin mining hardware, had a tough week on Wall Street as its stock slid 19%, far underperforming Bitcoin's gains. Canaan was joined by Galaxy (-1.62%) and Bakkt (-3.80%) as some of the only stocks to lose value this past week.&nbsp;","Next week is seen as a critical week for the stock market to <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-12-09\/stock-market-s-last-decisive-moment-of-2023-fuels-a-wall-of-worry\" data-v-f87c67ca=\"\">set the tone<\/a> going into 2024, with Tuesday bringing November's consumer price index data and the Fed's interest-rate deceision on Wednesday.&nbsp;"],"hashtag":[]}