{"summary":"&quot;We are working hard to engage and educate D.C. on the issues,&quot; Circle CEO Jeremy Allaire told The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239558\/circle-plans-policy-push-as-us-congress-considers-new-legislation","publishDate":"2023-07-13T18:27:15","id":2374,"type":null,"title":"Circle plans policy push as US Congress considers new legislation","category":["COMPANIES"],"content":["Stablecoin issuer Circle is aiming to ramp up is messaging as the U.S. Congress <a href=\"https:\/\/www.theblock.co\/post\/239210\/lummis-gillibrand-to-introduce-revised-comprehensive-crypto-bill\" data-v-f87c67ca=\"\">considers new legislation<\/a> for the sector. The company on Thursday posted a new 2-minute <a href=\"https:\/\/twitter.com\/jerallaire\/status\/1679475765165842432?s=46&amp;t=Se54l14sCsYxHI60OfmIMA\" data-v-f87c67ca=\"\">video<\/a>, in which it argues that the country needs robust regulation if it wants a digital dollar or USD stablecoin to become the global reserve currency.","\"We are working hard to engage and educate DC on the issues, as this likely goes from a HSFC bill into law that’s being considered by the entire House of Representatives coming out of the summer recess,\" Circle CEO Jeremy Allaire told The Block.","\"We are at a key moment in development of U.S. policy, with expected upcoming votes in Congress, and we are trying to help present a simple and compelling case to economic and policy leaders around the importance of getting stablecoin laws done in the U.S.,\" he continued.","The firm's message will be seen on various social and digital outlets, he added.&nbsp;&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S. Congress","content":"ORGANIZATION"},{"type":"House of Representatives","content":"ORGANIZATION"},{"type":"Jeremy Allaire","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"summer","content":"DATE"}],"hashtag":["USDC"],"authors":["MK Manoylov","Frank Chaparro","The Block"]}