{"summary":"Blocto closed a Series A round at a valuation of $80 million, with participation from Mark Cuban and 500 Global.\nThe wallet startup would not disclose the amount of funds raised in the round.","author":["Kari McMahon","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/213890\/blocto-crypto-wallet-closes-series-a-round-at-an-80-million-valuation","publishDate":"2023-02-22T09:00:16","id":2376,"type":null,"title":"Blocto crypto wallet closes Series A round at an $80 million valuation","category":["Deals"],"content":["Multichain wallet Blocto has closed a Series A funding round at a valuation of $80 million.","The startup would not disclose the funding amount for this round. Entrepreneur Mark Cuban, <a href=\"https:\/\/www.globenewswire.com\/news-release\/2022\/02\/21\/2388654\/0\/en\/LINE-FRIENDS-to-Change-Its-Corporate-Name-to-IPX-the-Digital-IP-Platform-Starting-Off-the-Metaverse-and-NFT-Digital-IP-Business.html\" data-v-f87c67ca=\"\">IPX<\/a> and returning investor 500 Global participated in the raise,&nbsp; the company said in a release. Cuban's involvement with the startup was <a href=\"https:\/\/cointelegraph.com\/press-releases\/crypto-wallet-blocto-receives-funding-from-mark-cuban\" data-v-f87c67ca=\"\">announced<\/a> late last year.","Blocto most recently raised funds in the Spring of 2021. It closed a $8 million token <a href=\"https:\/\/token.blocto.app\/\" data-v-f87c67ca=\"\">round<\/a> from investors including Animoca Brands, SevenX Ventures, collapsed trading firm Alameda Research and Roham Garegozlou, the CEO of Dapper Labs.","The startup's valuation has increased eightfold, the company said in the release, without specifying a timeframe for that gain. It was launched back in 2019 by its parent company Portto. <span data-v-f87c67ca=\"\">The funds from the raise will&nbsp; be used to support Blocto as it develops the infrastructure to onboard users into crypto.<\/span>","\"<span data-v-f87c67ca=\"\">We believe the continuous growth of Blocto users in the current environment is indicative of Portto’s commitment to be one of the most influential blockchain companies in the industry,\" Tony Wang, a managing partner at 500 Global, said in the release.<\/span>","Blocto recently rolled out on Aptos and natively supports other chains such as Ethereum, Solana, Polygon, Flow and BNB Chain. The startup also <a href=\"https:\/\/www.coindesk.com\/business\/2022\/11\/03\/crypto-wallet-blocto-launches-3m-fund-for-aptos-based-projects\/\" data-v-f87c67ca=\"\">rolled<\/a> out a $3 million Aptos ecosystem fund late last year.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">This story has been updated to clarify that Blocto raised funds from only a token round last year and that information online about an equity raise is incorrect.<\/i>"],"hashtag":["SERIES A","WALLET MAKERS","WALLETS"]}