{"summary":"Anchorage Digital is enabling ETH-backed loans via a new partnership with BankProv, a nearly 200-year-old U.S. bank.\nThe partnership is specifically for institutions that work with the firms.\nAnchorage President Diogo Monica said the crypto lending space could rapidly accelerate towards supporting a wide variety of assets in addition to Bitcoin. ","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/107147\/anchorage-eth-loans-bankprov-lending","publishDate":"2021-06-03T17:46:08","id":2377,"type":null,"title":"Anchorage Digital rolls out ETH-backed loans with America&#x27;s 10th oldest bank","category":["Lending"],"content":["Digital asset bank Anchorage Digital is building out its borrowing and lending tools, and it sees its new ether-backed loans as the path to institutional growth.","The firm rolled out its latest lending product today in partnership with BankProv, which was founded in 1828 (known then as The Provident Bank). The tie-up will allow institutions that custody their ETH with Anchorage to put those assets to work. Anchorage will continue to hold the ETH as collateral while BankProv extends lines of credit denominated in US dollars and backed by the ETH.&nbsp;","The structure of the lending product isn't new — Anchorage already offers BTC-backed loans in a partnership with Silvergate digital asset bank. That partnership functions the same way: Anchorage does the collateral administration while Silvergate extends the line of credit in U.S. dollars.","But collateralizing in ETH opens new doors and the partnership with BankProv targets a different client base, according to Anchorage President Diogo Monica. In an <a href=\"https:\/\/www.theblockcrypto.com\/daily\/97714\/diogo-monica-anchorage-crypto-bank\" data-v-f87c67ca=\"\">interview<\/a> with The Block earlier this year, Monica said borrowing and lending is Anchorage's fastest-growing business line — and that it is planning to expand with partnerships with other banks.","The collaboration with BankProv is one of those expansions, and it will specifically targeting institutional clients.&nbsp;","Institutions have started to invest in Bitcoin, but have been slower to adopt ETH and decentralized finance (DeFi) projects. According to Monica, the 10th-oldest bank in the U.S. offering ETH-backed loans is a strong indication that the institutionalization of the space is underway.","\"Silvergate primarily has crypto clients,\" said Monica. \"BankProv has a larger set of traditional clients. So you can also see this as another step in crypto becoming mainstream.\"","As the dominance of bitcoin decreases, institutions will likely feel a need to offer credit with all types of collateral, he said.&nbsp;","\"Once people become comfortable with Bitcoin, then people become comfortable with Ethereum and then all of a sudden new assets will start to appear and institutions will be able to get comfortable with just a basket of assets,\" Monica said.&nbsp;","It will take time for institutions to get comfortable with newer assets, and those assets will have to meet liquidity and volatility requirements for risk management. Still, Monica said he envisions a future in which people will be able to put all types of crypto assets to work through lending, and borrowers will be able to use their assets in applications that exist outside the crypto world.","<b data-v-f87c67ca=\"\">\"<\/b>Maybe instead of buying your house with a mortgage, you will be able to possibly get a cheaper loan backing with crypto or partly with crypto or a down payment of crypto, whatever it is,\" he said.","<em data-v-f87c67ca=\"\">Editor's note: An earlier version of this article referred to Monica as CEO of Anchorage Digital. His title is President of Anchorage Digital.<\/em>"],"hashtag":["ETHEREUM","LENDING"]}