{"summary":"The bill, introduced by Sen. Jack Reed, D-R.I., would place liability on those who control DeFi projects if laws are broken. \nCrypto advocates criticized the bill on Wednesday, arguing that it could “ban DeFi development.” ","author":["Sarah Wynn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240587\/senate-bill-would-tighten-money-laundering-and-sanctions-rules-for-defi","publishDate":"2023-07-19T12:37:22","id":2378,"type":null,"title":"Senate bill would tighten money laundering and sanctions rules for DeFi","category":["Policy"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">A bipartisan group of senators introduced a bill to tighten existing rules aimed at combating money laundering and sanctions evasion by making specific how they apply to decentralized finance. <br data-v-f87c67ca=\"\">\n<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The Crypto-Asset National Security Enhancement and Enforcement Act, introduced on Tuesday, also aims to strengthen the Treasury Department's ability to enforce those rules with DeFi projects. <\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">“This legislation bolsters the Treasury Department’s tools to protect our national and economic security. Drug cartels, sex traffickers, and the like shouldn’t be able to use DeFi platforms to avoid justice – their victims deserve better,” said Sen. Jack Reed, D-R.I., who introduced the bill and is a member of the Senate Banking Committee, said in a statement.&nbsp;&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Sens Mark Warner, D-Va., Mitt Romney, R-Utah., and Mike Rounds, R-S.D., also cosponsored the bill.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The bill would place liability on those who control DeFi projects if laws are violated, similar to how existing traditional financial firms and even casinos face liability for failing to stop money laundering in their services. If no one controls the DeFi project, then “<\/span><span class=\"s2\" data-v-f87c67ca=\"\">anyone who invests more than $25 million in developing the project will be responsible.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The bill would also require crypto ATM operators to verify the identities of users. <br data-v-f87c67ca=\"\">\n<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Other bills have looked to <a href=\"https:\/\/www.theblock.co\/post\/194941\/warren-marshall-introduce-bill-to-tighten-money-laundering-rules-for-crypto\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">address<\/span><\/a> the use of digital assets in money laundering. Sens. Elizabeth Warren, D-Mass., and Roger Marshall, R-Kan., introduced a bill last year to tighten AML rules to digital assets, though it didn’t go further. Warren <a href=\"https:\/\/www.theblock.co\/post\/211783\/warren-pledges-to-reintroduce-crypto-anti-money-laundering-bill\" data-v-f87c67ca=\"\">pledged to reintroduce<\/a> the legislation for this Congress. <br data-v-f87c67ca=\"\">\n<\/span>","<strong data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">DeFi advocates push back<\/span><\/strong>","<span class=\"s1\" data-v-f87c67ca=\"\">The bill would “effectively ban DeFi development in the country,” argued Miller Whitehouse-Levine, CEO of the DeFi Education Fund, in a statement decrying the legislation. <\/span><span class=\"s2\" data-v-f87c67ca=\"\">“Unfortunately, this approach is not only a disproportionate response to the illicit use of DeFi but also risks undermining US law enforcement’s existing insight and reach into peer-to-peer crypto activity,” Whitehouse-Levine said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Yaya Fanusie, director of anti-money laundering and cyber at the Crypto Council for Innovation, an industry group, called the bill, “arbitrary and ill-defined,\" because it applies rules on traditional financial firms to anyone who controls a DeFi protocol or develops an application to use the protocol. <\/span>"],"hashtag":["SENATE BANKING COMMITTEE","SMART CONTRACTS"]}