{"summary":"Dutch cryptocurrency exchange Bitvavo can’t access 280 million euros held at Genesis Global Capital.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195902\/bitvavo-unable-to-access-280-million-euros-held-at-dcg","publishDate":"2022-12-16T18:56:09","id":2379,"type":null,"title":"Bitvavo unable to access 280 million euros held at Genesis Global Capital","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Dutch cryptocurrency exchange Bitvavo said it can’t access 280 million euros ($297 million) held with Digital Currency Group, but a spokesperson for DCG said the issues are with its subsidiary Genesis Global Capital.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Bitvavo, in a company <a href=\"https:\/\/blog.bitvavo.com\/response-bitvavo-to-situation-dcg\/\" data-v-f87c67ca=\"\">blog post,<\/a><\/span><span data-v-f87c67ca=\"\"> said DCG, is “experiencing liquidity problems” and has therefore “suspended repayments” until the issue is resolved. The Dutch said it had<\/span><span data-v-f87c67ca=\"\">&nbsp;been using DCG to “offer off-chain staking services to its clients,” but the company said the frozen funds would not impact its platform.<\/span>","A DCG spokesperson said Bitvavo's relationship was with Genesis Capital, not DCG, and it had reached out to the Dutch firm asking them to correct their post.&nbsp;","<span data-v-f87c67ca=\"\">DCG controls the beleaguered cryptocurrency lender Genesis Global Capital, which last month <\/span><span data-v-f87c67ca=\"\">suspended redemptions and new loan originations shortly after the collapse of FTX upended the crypto world.<\/span>","<span data-v-f87c67ca=\"\">Of the 1.6 billion euros Bitvavo possesses in “deposits and digital assets,” it said that 280 million euros had been placed with DCG. Regardless, Bitvavo said its services would not be interrupted and customers could continue to make withdrawals.<\/span>","<em data-v-f87c67ca=\"\">(Updates with response from DCG, which pointed out that Bitvavo's relationship is with Genesis Global Capital.)<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bitvavo","content":"PERSON"},{"type":"DCG","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Genesis Capital","content":"ORGANIZATION"},{"type":"280 million euros","content":"MONEY"},{"type":"Genesis Global Capital","content":"ORGANIZATION"},{"type":"$297 million","content":"MONEY"},{"type":"1.6 billion euros","content":"MONEY"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}