{"summary":"Former ConsenSys Ventures head Kavita Gupta just joined Dusk Network, a blockchain project that provides technology for companies to tokenize their assets\nGupta believes that security token offering (STOs) can bridge the gap in a startup’s fundraising lifecycle between raising large private rounds and initial public offerings (IPOs)\nGupta will serve as the chairwoman of the company’s non-executive board, while continuing to teach at Stanford University","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/38041\/former-consensys-ventures-head-joins-blockchain-project-to-revive-security-token-offering","publishDate":"2019-08-30T13:27:34","id":2379,"type":null,"title":"Former ConsenSys Ventures head joins blockchain project to revive security token offerings","category":["Security Token"],"content":["<span data-v-f87c67ca=\"\">Former ConsenSys Ventures head Kavita Gupta has joined a blockchain project looking to breathe new life into the lethargic security token market, betting its offering will provide an alternative to the initial public offering process.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Gupta will chair Dusk Network's non-executive board. The Amsterdam-based firm developed a permissionless blockchain for companies to tokenize their equity shares. The firm is also working with a regulated European stock exchange and has secured a partnership with \"one of the largest cryptocurrency exchanges\" to accelerate the adoption of security tokens, according to Dusk Network cofounder Mels Dees. However, Dees declined to disclose which exchanges it's working with.&nbsp;<\/span>","\"They [Dusk Network] are the closest and they are the most legitimized one in the space [of security tokens] that I know,\" said Gupta.&nbsp;","<span data-v-f87c67ca=\"\">Meanwhile, security token offerings (STO) have not been able to live up to <\/span><a href=\"https:\/\/finance.yahoo.com\/news\/theres-new-buzzword-crypto-sto-070042979.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">the hype<\/span><\/a><span data-v-f87c67ca=\"\"> as a regulator-friendly version of initial coin offerings (ICOs). In April, Harbor’s tokenized construction project <\/span><a href=\"https:\/\/www.theblockcrypto.com\/2019\/04\/10\/2018s-banner-security-token-offering-by-harbor-is-scrapped\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">that promised<\/span><\/a><span data-v-f87c67ca=\"\"> a mega dorm backed by tokenized securities fell through, leaving the market questioning the validity of STO projects. <\/span>However, Gupta thinks STOs, especially ones that open up startups' equity shares to the public market, are still promising.&nbsp;","<span data-v-f87c67ca=\"\">“We all have gone through the utility tokens and the whole ICO movement but we have learned our lessons. And our biggest lesson is you need to see the product, you need to believe in it you need to put your book out instead of just a white paper and an idea,” said Gupta. <\/span>","<span data-v-f87c67ca=\"\">Having spent time at McKinsey, HSBC, and the World Bank, Gupta is betting that STOs can address the existing gap she is seeing in capital markets, notably, the impediments that keep private companies from tapping into the public markets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">It's been well documented that companies have shied away from the public markets and IPOs, opting to stay private longer so founders can maintain more control over the companies. <\/span><span data-v-f87c67ca=\"\">STOs provide an alternative for these companies to raise funds from the public market, while allowing founders to retain control of the companies by selling fewer shares compared to a public listing.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“A lot of companies in Silicon Valley keep on pushing IPOs because the founders want to keep control. Using pre-IPO liquidity they would still be able to raise money without calling it a Series D or Series E… This middle point should be there,” said Gupta.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Gupta thought STOs serve as a \"reality check\" for many startups before they go for an IPO. These startups, usually blessed by the continuous private interest, sometimes fail to gauge the public interest of their companies accurately. With STOs, startups can publicly offer their equity shares as security tokens before going into IPOs. This allows them to receive pricing feedback from the public market early and prepare for the public listing.<\/span>","<span data-v-f87c67ca=\"\">“This is the best way for them [unicorns] to test the market on what is the price the market really is willing to offer them, instead of two or three IPO banks telling you what is your value in the market,” said Gupta.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“It is going to change how companies are deciding if they are doing IPOs. For a lot of companies they might not even go through IPOs,” she added.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In May, The Block <a href=\"https:\/\/www.theblockcrypto.com\/2019\/05\/06\/founding-partner-kavita-gupta-is-stepping-down-from-consensys-ventures\/\" data-v-f87c67ca=\"\">first reported<\/a> that Gupta left ConsenSys Ventures, founded and financed by Ethereum Foundation founder Joseph Lubin. At the time, ConsenSys announced that it merged its venture arm with the ConsenSys Labs incubator to consolidate its investment portfolio.&nbsp;<\/span>"],"hashtag":["SECURITY TOKENS"]}