{"summary":"Puma teamed up with Jay Z&#x27;s Roc Nation to launch blockchain-enabled shoes for super fans who want access to exclusive content.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239657\/puma-drops-130-crypto-sneakers-in-collaboration-with-jay-zs-roc-nation","publishDate":"2023-07-14T11:41:58","id":2384,"type":null,"title":"Puma drops $130 crypto sneakers in collaboration with Jay Z’s Roc Nation","category":["METAVERSE & NFT"],"content":["<span data-v-f87c67ca=\"\">Global shoe and apparel brand Puma and Roc Nation, the record label founded by Jay-Z have, have dropped a new series of sneakers which come with a “crypto<\/span>graphic identity” chip that enables owners to access exclusive content.","The release of three new pairs of sneakers, which cost $130 a piece, coincides with celebrations of Hip-Hop’s 50th anniversary, the companies said in a statement. The <span data-v-f87c67ca=\"\">blockchain-enabled Pumas come with an NFC-powered chip which, when scanned, unlocks “exclusive content, weekly mixtape drops, and unfettered access to life behind the scenes as a Roc Nation artist,” the statement also said.<\/span>","<span data-v-f87c67ca=\"\">“Evolution of the Mixtape” is the name of the promotion, which is considered \"the second iteration of the Mixtape Series,\" the companies said. The shoes can be purchased through Puma, Foot Locker, and Champs stores online and across North America.<\/span>","<span data-v-f87c67ca=\"\">This marks the latest attempt to marry the popularity of exclusive and original lines of sneakers with blockchain technology’s ability to tag and authenticate limited-edition merchandise. Both <a href=\"https:\/\/www.theblock.co\/post\/168705\/puma-launches-metaverse-black-station-to-show-off-its-new-sneaker-nft-collection\" data-v-f87c67ca=\"\">Puma<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/192634\/nike-rtfkt-unveils-web3-sneakers\" data-v-f87c67ca=\"\">Nike<\/a> have been actively experimenting with NFT shoes and physical products tied to digital assets.<\/span>","<span data-v-f87c67ca=\"\">Puma and Roc Nation partnered with tech company Legitimate on the new line of shoes. Founded in 2021, Legitimate helps create the “phygitals,” which are items meant to bridge the gap between “physical products and digital experiences” through its proprietary technology that includes an NFC tag, which can be read by electronic devices while embedded in products.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jay","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Roc Nation","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"North America","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Nike","content":"ORGANIZATION"},{"type":"Puma","content":"ORGANIZATION"},{"type":"$130","content":"MONEY"}],"hashtag":[],"authors":["RT Watson","The Block"]}