{"summary":"Circle CEO Jeremy Allaire said Yuan-backed stablecoins may offer a more immediate path for China&#x27;s currency internationalization efforts.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/238816\/china-stablecoin-cbdc-circle-allaire","publishDate":"2023-07-11T05:30:05","id":2385,"type":null,"title":"Stablecoins may be a better path than CBDC for China, Circle’s Allaire says: SCMP","category":["PEOPLE"],"content":["Circle CEO Jeremy Allaire said that Yuan-backed stablecoins may offer a more immediate path for China's currency globalization efforts rather than the <a href=\"https:\/\/www.theblock.co\/linked\/113470\/beijing-subway-full-integrate-digital-yuan-ecny\" data-v-f87c67ca=\"\">eCNY<\/a> central bank digital currency (CBDC).","“If eventually the Chinese government wants to see the RMB used more freely in trade and commerce around the world, it may be that stablecoins are the path to do that more than the central bank digital currency,” Allaire said in a recent <a href=\"https:\/\/www.scmp.com\/tech\/tech-trends\/article\/3227171\/head-crypto-firm-circle-accepts-ban-mainland-china-sees-role-yuan-backed-stablecoins?module=perpetual_scroll_0&amp;pgtype=article&amp;campaign=3227171\" data-v-f87c67ca=\"\">interview<\/a> with the South China Morning Post.","More specifically, Allaire said a stablecoin pegged to the offshore Yuan (CNH) could facilitate increased use of the currency in trade and commerce globally. However, the team behind private CNH and Hong Kong dollar stablecoins was detained in May, according to SCMP.","Acknowledging the unlikelihood of mainland China embracing the broader cryptocurrency industry, Allaire said he remains optimistic about web3 development in the Hong Kong Chinese special administrative region and its regulatory approach toward stablecoins.","“The reality is that every other major financial market in the world is also embracing digital assets, and the biggest financial institutions in the world are embracing digital assets. So for Hong Kong to be relevant, it has to,” Allaire said.","“I think there is Chinese government support for that,” he added. “That’s different than feeling like it says something about opening up the trading of crypto on the mainland. I don’t think there’s anything there.”","With concerns over the role of stablecoins once CBDCs are more widely available, Allaire said CBDCs are complementary and private stablecoins drive innovation.","“If central banks are going to upgrade their own systems to move away from legacy technology into more modern distributed ledger technology, that’s great,” he said. “There’s a whole bunch of things that are useful from that, but I view that as very different than the work that the private sector does to innovate on the public internet.”","The Hong Kong Monetary Authority (HKMA) plans to introduce stablecoin regulations by 2024 and the Securities and Futures Commission of Hong Kong is developing complementary regulations. The Hong Kong government also recently set up a <a href=\"https:\/\/www.theblock.co\/post\/237483\/hong-kong-government-sets-up-web3-task-force-to-help-build-a-thriving-ecosystem\" data-v-f87c67ca=\"\">web3 task force<\/a> to help Hong Kong’s desire to reestablish itself as a global hub for the crypto industry.","“We’re excited that this is a priority for the Hong Kong government and it seems like it’s a real priority for the HKMA,” Allaire said. “That’s tremendously positive and is really motivating for us to want to be able to grow our business here.”","Last month, Allaire <a href=\"https:\/\/www.theblock.co\/post\/236571\/circle-sets-sights-on-hong-kong-sees-enormous-demand-for-digital-dollars\" data-v-f87c67ca=\"\">said<\/a> he was paying close attention to regulatory developments in Hong Kong and saw “enormous demand for digital dollars” in the region.","Circle’s USDC is the second-largest U.S. dollar-pegged stablecoin behind Tether’s USDT, with a circulating supply of <a href=\"https:\/\/www.coinbase.com\/usdc\" data-v-f87c67ca=\"\">$21.5 billion<\/a>, according to CoinGecko data.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jeremy Allaire","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Hong Kong Monetary Authority (HKMA","content":"ORGANIZATION"},{"type":"Securities and Futures Commission","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Allaire","content":"PERSON"},{"type":"$21.5 billion","content":"MONEY"},{"type":"South China Morning Post","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"CNH","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"SCMP","content":"ORGANIZATION"},{"type":"HKMA","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["ASIAN PARLIAMENTS","USDC"],"authors":["James Hunt","The Block"]}