{"summary":"Digital asset exchange and brokerage platform Zodia Markets has received its registration as a virtual asset service provider by the Central Bank of Ireland.","author":["Brian McGleenon","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/259814\/zodia-markets-receives-virtual-asset-service-provider-registration-in-ireland","publishDate":"2023-10-27T12:19:34","id":2386,"type":null,"title":"Zodia Markets receives virtual asset service provider registration in Ireland","category":["Companies"],"content":["Standard Chartered-backed digital asset exchange and brokerage platform Zodia Markets has been registered as a virtual asset service provider (VASP) by the Central Bank of Ireland.","Zodia Markets Ireland Chief Executive Michael Walsh said that registration by Ireland's central bank will act as a \"launchpad\" for the company to enter the EU market.","This news follows the firm receiving crypto asset registration from the UK’s <a href=\"https:\/\/www.theblock.co\/post\/257721\/binance-to-temporarily-stop-accepting-new-uk-users-after-fca-restriction\" data-v-f87c67ca=\"\">Financial Conduct Authority<\/a> (FCA) in July 2022.","\"VASP registration is an exciting development for Zodia Markets, and we’re delighted to be part of the burgeoning Irish digital assets ecosystem. The registration will act as a launchpad for the business to enter the EU, a market where we see significant opportunity and demand for our offering, and it paves the way for future <a href=\"https:\/\/www.theblock.co\/post\/257707\/leading-the-european-crypto-charge-lcx-set-to-become-first-mica-ready-exchange-in-liechtenstein\" data-v-f87c67ca=\"\">MiCA<\/a> authorization when the regulations are implemented,\" Zodia Markets Ireland CEO Michael Walsh said.","In a <a href=\"https:\/\/zodiamarkets.com\/insights\/press-release\/zodia-markets-receives-vasp-registration-in-ireland\/\" data-v-f87c67ca=\"\">statement<\/a> released Friday Zodia Markets Ireland said the registration would enable the firm to provide OTC trading and exchange services to institutional clients in Ireland. \"Passporting is not available for VASP registrations, therefore we cannot solicit clients from other EU countries. However, when MiCA comes in this will be possible and we will take advantage of the harmonized regulatory regime,\" Zodia Markets Chief Compliance Officer Andrew Price told The Block.","The firm added that the approval highlights the firm's commitment to collaborate with European regulators and operate in compliance. \"The move precedes the implementation of the Markets in Cryptoassets Regulation (MiCA) in the EU, which is due to take effect towards the end of 2024 and will require the authorization and supervision of crypto asset service providers,\" a press release from Zodia Markets Ireland said.","Ireland is emerging as a favored destination for digital asset firms seeking domicile. Earlier this month crypto exchange <a href=\"https:\/\/www.theblock.co\/post\/259304\/coinbase-says-sec-is-out-of-bounds-in-latest-brief-of-ongoing-lawsuit\" data-v-f87c67ca=\"\">Coinbase<\/a> designated Ireland as its EU hub."],"hashtag":["ASSET MANAGERS","COINBASE","FCA"]}