{"summary":"Core Scientific owes about $1 billion to several creditors including MassMutual and BlockFi. It said that it won’t be able to make payments by the end of the month.\nBankruptcy is one option on the table as the miner struggles to improve liquidity.\nBlockFi said that it has not underwritten any new loans in the mining sector since the spring of 2022.","author":["Catarina Moura","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/180546\/massmutual-blockfi-are-among-bitcoin-miner-core-scientifics-biggest-creditors","publishDate":"2022-10-28T15:55:10","id":2389,"type":null,"title":"MassMutual, BlockFi are among bitcoin miner Core Scientific&#x27;s biggest creditors","category":["Companies"],"content":["MassMutual is among the creditors identified by bitcoin miner Core Scientific, which said this week <a href=\"https:\/\/www.theblock.co\/post\/180358\/core-scientific-to-run-out-of-cash-by-the-end-of-2022\" data-v-f87c67ca=\"\">it would not make payments due<\/a> starting in late October and may consider bankruptcy.","The miner owes about $1 billion to an array of companies including crypto lender BlockFi, investment banking firm B. Riley, crypto financial services firm NYDIG and Anchor Labs, the parent company of digital asset bank Anchorage Digital.","\"In the event of a bankruptcy proceeding or insolvency, or restructuring of our capital structure, holders of the company’s common stock could suffer a total loss of their investment,\" the company said in a U.S. Securities and Exchange Commission <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1839341\/000119312522270236\/d395956d8k.htm\" data-v-f87c67ca=\"\">filing<\/a>. Core Scientific acknowledged that it might be sued as a result of missed payments.","BlockFi Chief Risk Officer Yuri Mushkin told The Block that the firm has not underwritten a new loan in the mining sector since the spring of 2022, adding that mining-backed loans are still a minority portion of its larger lending portfolio.","\"BlockFi holds risk capital reserves to protect against potential loan defaults, which includes mining-equipment finance business,\" Mushkin said in a statement. \"Furthermore, our credit risk management team closely monitors the bitcoin mining sector and regularly speaks with the borrowers in the portfolio.\"","A large portion of Core Scientific's loans were taken out to finance hardware and infrastructure improvements, most starting in the second half of 2021, when bitcoin prices were on the rise (reaching a peak of nearly $70,000 in November) and miners were racing to grow their operations.","Most of the debt matures in 2025, as highlighted in this <a href=\"https:\/\/www.theblockresearch.com\/analysis-of-core-scientifics-potential-bankruptcy-180742?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">analysis by The Block Research<\/a>.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/btc-price\/embed\" title=\"BTC Price\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Core Scientific's woes reflect the same struggles others in the industry have dealt with in 2022: a spike in power costs, a decline in the value of bitcoin, and a corresponding rise increase in mining difficulty.","In June, several miners that traditionally held most of the bitcoin they mined began liquidating large portions of their holdings to pay down loans. Core Scientific, for instance, <a href=\"https:\/\/www.theblock.co\/post\/155853\/core-scientific-sold-7202-bitcoin-in-june-generating-167-million\" data-v-f87c67ca=\"\">sold 7,202 BTC<\/a>, which at the time represented about 90% of its holdings.","The largest loans and promissory notes taken out by the miner came from B. Riley, MassMutual Barings and BlockFi, to which it owed $75 million, $65.6 million and $60.7 million, respectively, as of June 30. Barings is an international investment management firm owned by parent Massachusetts Mutual Life Insurance Co., which is widely known as MassMutual.","The Block reached out to Core Scientific's list of creditors for comment. Trinity Capital said in a statement: \"This event is very current and fluid and we are working with the company to find a workable solution for all stakeholders.\" Anchorage and B. Riley declined to comment.","Core Scientific's stock price <a href=\"https:\/\/www.theblock.co\/post\/180586\/core-scientifics-stock-tanks-75-as-troubled-bitcoin-floats-bankruptcy\" data-v-f87c67ca=\"\">slumped almost 80% on the market<\/a> on Thursday, with its shares now trading below $0.20.","",""],"hashtag":[]}