{"summary":"Iron Finance—a DeFi stablecoin project—collapsed last week after a market event that was not unlike a bank run.\nBillionaire Mark Cuban was among the market participants to take a hit\nThe Block spoke with Cuban about his experience ","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/108991\/there-are-investments-and-there-are-flyers-mark-cuban-on-titans-collapse","publishDate":"2021-06-21T16:01:16","id":239,"type":null,"title":"&#x27;There are investments and there are flyers&#x27;: Mark Cuban on Titan&#x27;s collapse","category":["DeFi"],"content":["Even billionaires aren't immune to market plunges in the decentralized finance (DeFi) space.","Mark Cuban — the serial entrepreneur and owner of the Dallas Mavericks — made headlines last week for buying into Iron Finance, a fork of algorithmic stablecoin project Frax. The price of the TITAN token collapsed to nearly zero after soaring to $65.&nbsp;","\"I got hit like everyone else,\" Cuban, who could have played into the appreciation of Iron Finance's coin Titan, said in a tweet. Essentially what happened was a large-scale seller of TITAN kicked off a wider run of the token's underpinning network. As the large holder sold, new stablecoins were issued by the network that diluted the price of other market participant's TITAN holdings, thus perpetuating the fall.&nbsp;","\"We never thought it would happen, but it just did. We just experienced the world’s first large-scale crypto bank run,\" the project said in <a href=\"https:\/\/ironfinance.medium.com\/iron-finance-post-mortem-17-june-2021-6a4e9ccf23f5\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">a post-mortem<\/a>.&nbsp;","Cuban, who recently penned a blog post championing the DeFi market, still has conviction in the market. In the aftermath of Titan, Cuban made <a href=\"https:\/\/twitter.com\/TheStalwart\/status\/1405536487630798859?s=20\" data-v-f87c67ca=\"\">headlines<\/a> for calling for regulations on stable coins, arguing for \"regulation to define what a stablecoin is and what collateralization is acceptable.","In an interview with The Block, Cuban shared his thoughts about the Titan drawdown and DeFi. He declined to comment further on his remarks about stablecoin regulation.&nbsp;","<em data-v-f87c67ca=\"\">(Edited for clarity and length)<\/em>","<strong data-v-f87c67ca=\"\">Chaparro:<\/strong> What are the biggest strengths&nbsp;DeFi has over traditional finance?","<strong data-v-f87c67ca=\"\">Cuban:<\/strong> Lack of friction in transactions, permission-less and accessibility for everyone the ability for the community to drive activity (think enabling local loans) and better use of capital. Liquidity Providers, stakers, validators are unique to crypto and can allow projects to scale far more quickly and capital efficiently than traditional finance.&nbsp;","<strong data-v-f87c67ca=\"\">Chaparro:<\/strong> How did the TITAN rug pull impact your thoughts on the space?","<strong data-v-f87c67ca=\"\">Cuban:<\/strong> It didn’t. It was on me for not doing my homework. I generally knew what happened with each transaction, but the scale of the rewards should have been enough reason to project out all the possible outcomes.&nbsp;","A few hours with a spreadsheet and I would have been better informed of the risks.&nbsp; I still may have taken the risks, but they would have been clearer.","<strong data-v-f87c67ca=\"\">Chaparro<\/strong>:&nbsp;Who introduced you to the project?","<strong data-v-f87c67ca=\"\">Cuban:<\/strong> I saw it online somewhere.&nbsp;","<strong data-v-f87c67ca=\"\">Chaparro:<\/strong> What are your metrics for vetting projects? How are they different from the ways you vet companies and startups?","<strong data-v-f87c67ca=\"\">Cuban:<\/strong>&nbsp;There are investments and there are flyers where you know there is risk and but you think the upside makes it worth taking.&nbsp;","I thought I would let the Titan compound and not be greedy and in a few days withdraw all. But obviously I never got there. And this also shows the importance of a vibrant community. Maybe if the community was more active and bigger someone would have warned of the risks of the type of a bank run that crushed Iron Finance.&nbsp;","In addition, maybe there needs to be a community of auditors or test net simulation AI &nbsp;that runs through every possible scenario combination to prevent this from happening again."],"hashtag":[]}