{"summary":"Former SEC Chair Jay Clayton and current chair Gary Gensler met at DACOM to talk about the regulatory perimeter and crypto.\nCrypto’s distributed nature makes it challenging to regulate, but as areas of the industry become more consolidated, it may become less challenging.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/125961\/gensler-clayton-contend-that-crypto-regulatory-challenges-will-abate-as-the-industry-consolidates","publishDate":"2021-12-01T10:56:33","id":2390,"type":null,"title":"Gensler, Clayton contend that crypto regulatory challenges will abate as the industry consolidates","category":["Regulation"],"content":["Chair of the Securities and Exchange Commission Gary Gensler and former chair Jay Clayton both say they see a productive future for crypto, but only in an \"environment of trust.\" That path to regulation will become easier as the space centralizes and consolidates, according to the two chairs.","The two met for a fireside chat at Solidus Labs' and CryptoCompare's DACOM conference. During their time, Clayton pressed Gensler on <a href=\"https:\/\/www.theblockcrypto.com\/linked\/121930\/as-bitcoin-spot-etf-hopes-rise-sec-chair-gensler-critiques-lack-of-crypto-investor-protections\" data-v-f87c67ca=\"\">previous comments<\/a> comparing crypto to the Wild West. Gensler reiterated that he is considering the parallels between the Wild Cat banking era, in which many unregulated institutions issued their own forms of currency in the U.S. That would later give way to the centralization of the dollar and the central bank.","\"There's a lot of projects that have entrepreneurs raising money in the crypto markets and turning to gatekeepers, lawyers to track paperwork, saying, 'how do we skirt by the authorities?' and I don't think that's the right approach, but that's similar to the Wild West,\" said Gensler.","While crypto remains outside of the regulatory perimeter, Gensler said he's worried about a \"spill in aisle three\" — a significant financial stability event in the crypto space that could lose the public's trust in the technology.","\"Right now the public is not as protected as it could be, as it ought to be,\" he said.","That spill could come in the form of lending, stablecoins or a lack of sufficient information coming to investors either through fraud or well-meaning mistakes.","\"Technologies don't long exist outside of public policy norms,\" he said. \"People get hurt. It's far better inside the public policy framework.\"","With that in mind, the two broke down why neither of their regulatory regimes has successfully overseen the industry, and that comes down to the distributed nature of crypto. Though neither spoke directly on why their tenures haven't produced a spot bitcoin exchange-traded fund (ETF) approval.","Gensler's Commission recently <a href=\"https:\/\/www.theblockcrypto.com\/linked\/124192\/sec-rejects-vanecks-spot-bitcoin-etf\" data-v-f87c67ca=\"\">rejected<\/a> the first spot bitcoin ETF up for approval in this wave of applications, VanEck's offering. Since then, Grayscale, which also has an application to convert its GBTC to an ETF, has sent a <a href=\"https:\/\/www.theblockcrypto.com\/post\/125817\/grayscale-argues-the-secs-bitcoin-etf-treatment-could-violate-the-apa\" data-v-f87c67ca=\"\">letter<\/a> arguing the Commission's decision to approve ETFs holding bitcoin futures undercuts its rejections of spot products in a way that could put the SEC in violation of the Administrative Procedure Act. Clayton pointed to some of the challenges in regulating digital assets on the topic of bitcoin ETFs.","\"Here in digital assets, it's very dispersed globally, which makes a single regulatory net much more challenging,\" said Clayton. \"I think some in this industry thought they could throw a fastball by the regulators.\"","But that's changing, according to the chairs.","Digitization is driving some degree of centralization, according to Clayton, which will lower the barriers to regulating the space. The two pointed out that this is often how burgeoning industries move forward. Traditional markets eventually centralized around the New York Stock Exchange, and Gensler said he's looking to the way the early Internet's distributed nature centralized over time.&nbsp;","\"Just as we saw with the internet early days, the internet saw loads much competition in the 1990s, and then we see high concentration after that,\" said Gensler. \"And this was just the fact of the economics of networks. And that was: you can bring two sides of the market together, whether it's s related to online retail or to bring two sides of the market together on this one online trading of crypto assets.\"","As Clayton turned the conversation to how the agency can regulate the growing decentralized finance (DeFi) space, Gensler pointed out that even DeFi has points of decentralization where regulators should have oversight. Many DeFi tokens offer some kind of return, he said, meaning they could require SEC oversight.","For his part, said he's looking to the way previous commissions dealt with the digitization of other activities that fall under the agency's purview.","\"Similar activity should have similar regulation,\" said Gensler."],"hashtag":["GARY GENSLER","SEC"]}