{"summary":"DeFi lending platform Aave has launched its protocol for decentralized social media on Polygon, called Lens Protocol.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/147337\/aaves-backbone-for-decentralized-social-media-lens-protocol-goes-live-on-polygon","publishDate":"2022-05-18T09:00:26","id":2392,"type":null,"title":"Aave&#x27;s backbone for decentralized social media, Lens Protocol, goes live","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Lens Protocol, a network for building decentralized social media, has gone live on the Polygon blockchain. <\/span>","According to a media statement, more than 50 applications have debuted on Lens Protocol. These include Lenster, Lens Booster, SpamDAO, GoldenCircle, PeerStream, Swapify, Social Link and others.&nbsp;","<span data-v-f87c67ca=\"\">The developers of Aave, a popular lending protocol, first <a href=\"https:\/\/www.theblockcrypto.com\/linked\/133390\/aave-officially-debuts-protocol-for-decentralized-social-media-dubbed-lens\" data-v-f87c67ca=\"\">introduced<\/a> Lens in February 2022. Lens is a software stack that enables developers to create decentralized competitors to social media giants like Twitter and Facebook. The idea with Lens Protocol is to facilitate a platform that helps decentralize the ownership of content and user accounts using a blockchain network. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nInstead of traditional social media accounts that rely on email ids and a unique username, Lens Protocol makes use of crypto addresses and NFTs for authentication and monetization purposes. This set-up puts users, rather than a centralized company, in control of the content and personal data associated with accounts.<\/span>","<span data-v-f87c67ca=\"\">Centralized social media platforms are often criticized for terminating user accounts without offering an explanation. The Aave CEO himself, Stani Kulechov, faced such a<\/span> suspension recently. In April, Kulechov's account was <a href=\"https:\/\/www.theblockcrypto.com\/post\/143963\/aave-founder-stani-kulechov-twitter-account-suspended-joke\" data-v-f87c67ca=\"\">suspended<\/a> over a joke he posted about \"joining Twitter as interim CEO.\" After his account was restored, Kulechov <a href=\"https:\/\/www.theblockcrypto.com\/post\/144192\/aave-founder-stani-kulechov-returns-to-twitter-after-ban\" data-v-f87c67ca=\"\">told<\/a> The Block that these kinds of actions from social media giants had motivated Aave to working on Lens Protocol.","<span data-v-f87c67ca=\"\">“The social media experience has remained relatively unchanged for the last decade, and much of that is due to your content being solely owned by a company, which locks your social network within one platform,” Kulechov stated on today's launch.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\"> As such, Lens is trying to achieve censorship resistance for hundreds of social media apps and help them unlock new forms of content monetization with NFTs as well as other blockchain-based crypto assets.<\/span>","<span data-v-f87c67ca=\"\">“Building a Web3 social media platform on Lens Protocol has opened up a new realm of possibilities for our development team and users,” said yoginth.eth, the pseudonymous founder of Lenster, a social media app built using Lens Protocol. “With a user-first foundational architecture, Lens fundamentally changes the landscape of social media platforms and user experiences as we know them today.”<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Scalability is a big issue for decentralized social media since such products are both data-intensive and involve a high throughput of transactions. Blockchains usually struggle for both of these issues.<\/span><span data-v-f87c67ca=\"\"> Even though Polygon was designed for greater scalability, it has still <a href=\"https:\/\/cryptobriefing.com\/nft-gamers-are-clogging-up-polygon\/\" data-v-f87c67ca=\"\">faced congestion<\/a> in the past from games that have led to surge of activity on the network. <\/span>","<span data-v-f87c67ca=\"\">In response to the scalability matter, Kulechov said the protocol will explore other Layer 2 solutions, both on Polygon and Ethereum to meet scaling demands.<\/span>","<span data-v-f87c67ca=\"\">“Eventually many networks such as Polygon (and Ethereum) will scale over L2 networks by inheriting the security from the underlying network. That would be the path for Lens Protocol over the long term once there is sufficient protocol marketfit,” Kulechov told The Block in a statement.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"last decade","content":"DATE"},{"type":"February 2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Swapify","content":"LOCATION"},{"type":"April","content":"DATE"},{"type":"Kulechov","content":"ORGANIZATION"},{"type":"Lenster","content":"PERSON"},{"type":"Stani Kulechov","content":"PERSON"},{"type":"Kulechov","content":"PERSON"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}