{"summary":"Crypto derivatives exchange BitMEX announced an expansion of its partnership with the Italian soccer giant AC Milan. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240566\/bitmex-ac-milan-partnership","publishDate":"2023-07-19T11:26:24","id":2393,"type":null,"title":"BitMEX expands partnership with Italian soccer giant AC Milan","category":["DEALS"],"content":["Crypto derivatives exchange BitMEX is expanding its partnership with the Italian soccer giant AC Milan.&nbsp;","BitMEX will transition from a sleeve sponsor on the team’s playing kits to become AC Milan’s premium partner while continuing as its official cryptocurrency trading partner. The extended partnership aims to boost BitMEX’s brand presence by tapping into the club’s global fan base, according to a <a href=\"https:\/\/www.acmilan.com\/en\/news\/articles\/sponsor\/2023-07-19\/ac-milan-and-bitmex-together-in-the-sign-of-innovation-and-digitalisation\" data-v-f87c67ca=\"\">statement<\/a>. The value of the deal was not disclosed.","“We are thrilled to reinforce our partnership with AC Milan. Beyond the philanthropic projects we have worked on together, we both appreciate and applaud the spirit of competition and the sense of connection that comes from it,” BitMEX CEO and Group CFO Stephan Lutz said.&nbsp;","Lutz highlighted BitMEX’s new Guilds social trading feature as an example of the products aimed at the club’s fans. Guilds allows traders to team up and trade together to compete against other groups.&nbsp;","“We are happy to continue our journey alongside a partner such as BitMEX. We intend to take further steps forward in the path of digitalization, innovation and growth of the club and also support many charitable initiatives promoted by Fondazione Milan,\" added AC Milan Chief Revenue Officer Casper Stylsvig.","BitMEX and AC Milan’s collaboration dates back to 2021 when the crypto exchange scored the initial <a href=\"https:\/\/www.theblock.co\/linked\/114019\/bitmex-scores-multi-year-deal-with-ac-milan-to-put-logo-on-players-sleeves\" data-v-f87c67ca=\"\">multi-year sleeve deal<\/a>. The pair have worked on a range of initiatives since, from celebrating AC Milan’s first Italian Serie A title in 11 years to organizing various charitable events. While the duration of this extended deal was also not disclosed, BitMEX said it remains committed to organizing similar events in the years ahead.","Last month, crypto exchange <a href=\"https:\/\/www.theblock.co\/post\/237200\/okx-manchester-city\" data-v-f87c67ca=\"\">OKX<\/a> expanded a similar sponsorship deal with the treble-winning English soccer champions Manchester City.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Stephan Lutz","content":"PERSON"},{"type":"Fondazione Milan","content":"ORGANIZATION"},{"type":"Milan","content":"LOCATION"},{"type":"AC Milan","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"BitMEX","content":"PERSON"},{"type":"Group","content":"ORGANIZATION"},{"type":"AC Milan’s","content":"ORGANIZATION"},{"type":"AC Milan Chief Revenue Officer Casper Stylsvig","content":"ORGANIZATION"},{"type":"Manchester City","content":"LOCATION"}],"hashtag":["BITMEX"],"authors":["James Hunt","The Block"]}