{"summary":"The senators behind two competing amendments to the definition of broker in the infrastructure bill have reached a compromise.\nWith the support of the Treasury, the senators hope that the new amendment will be able to make it into the final bill, but the clock is ticking. ","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/113957\/senators-compromise-crypto-tax-infrastructure-bill","publishDate":"2021-08-09T12:48:20","id":2395,"type":null,"title":"Senators reveal final compromise for crypto language in infrastructure bill","category":["Regulation"],"content":["At a press conference in the Senate on Monday, Senators Pat Toomey and Cynthia Lummis revealed a new compromise on cryptocurrency tax provisions.","The compromise has managed to get almost all of the senators working on <a href=\"https:\/\/www.theblockcrypto.com\/post\/113774\/dueling-amendments-on-crypto-tax-reporting-become-key-battleground-over-senate-infrastructure-bill\" data-v-f87c67ca=\"\">two competing amendments<\/a> on board, with the lone holdout of Ron Wyden, who <a href=\"https:\/\/twitter.com\/RonWyden\/status\/1424731514147938304\" data-v-f87c67ca=\"\">apparently<\/a> wanted greater privacy protections. The proposed amendment also has the support of the Treasury Department.","\"We came together to provide greater clarity on who is a broker,\" Toomey said of the compromise.&nbsp;","The infrastructure bill, in an effort to pay for its own outlays, initially codified new requirements for certain cryptocurrency operators to report transactions to the Internal Revenue Service as brokers. The issue was that the original version was vague about who would be considered a broker. The definition included \"any person who (for consideration) is responsible for regularly providing any service effectuating transfers of digital assets on behalf of another person.\"","Toomey, Wyden, and Lummis had previously introduced an amendment, which the Senate did not add to the bill. The latest amendment differs from <a href=\"https:\/\/www.theblockcrypto.com\/linked\/113562\/us-senate-crypto-tax-amendment-congress\" data-v-f87c67ca=\"\">the earlier version<\/a> in one key way, removing the following exemption from classification as a broker:&nbsp;","The emergence of two competing amendments to the original language of the INVEST Act last week proved highly contentious and sparked a backlash from the crypto industry. The conflict delayed the bill's passage in the Senate, which some had been expecting Thursday night.","It has been a remarkable showing from the cryptocurrency industry and its growing voice in Washington, DC. \"Regardless of how this turns out,\" said Lummis, \"This has been a very positive exercise for people in the cryptocurrency and digital asset space.\"","The compromise, however, faces a tough road ahead. While Senate Majority Leader Chuck Schumer has said that he will not block unanimous consent on the amendment, unanimity among the Senate is hard to come by. Any senator will be able to block the amendment. The clock is already ticking on the massive infrastructure package, though Toomey said \"there's still time to adopt this amendment.\"&nbsp;&nbsp;","Despite their work on this compromise, both Toomey and Lummis said they did not plan to support the passage of the overall infrastructure bill.&nbsp;"],"hashtag":["CONGRESS","IRS"]}