{"summary":"RFK Jr outlined his planned polices that support bitcoin along with a light-touch regulatory environment for crypto","author":["Brian McGleenon","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236154\/rfk-jr-outlines-pro-bitcoin-stance-thats-light-on-crypto-regulations-ny-post","publishDate":"2023-06-23T07:56:45","id":2396,"type":null,"title":"RFK Jr outlines pro-bitcoin stance that&#x27;s light on crypto regulations: NY Post","category":["U.S. Policymaking"],"content":["U.S. presidential candidate Robert F. Kennedy Jr. outlined policies that support bitcoin and self-sovereignty.","Speaking Thursday to <a href=\"https:\/\/nypost.com\/2023\/06\/22\/robert-f-kennedy-jr-interview-why-im-not-an-anti-vaxxer\/\" data-v-f87c67ca=\"\">The New York Post<\/a>, Kennedy said he would introduce policies that \"support bitcoin and the freedom to transact and that allow individuals to manage their own bitcoin wallets, nodes, and passwords.\"","He added that he would endorse a light-touch regulatory environment in the U.S., with only \"the narrowest controls that are necessary to prevent money laundering.\"","Despite his support for decentralized digital currencies, <a href=\"https:\/\/www.kennedy24.com\/\" data-v-f87c67ca=\"\">Kennedy<\/a> expressed a staunch opposition to central bank digital currencies (CBDCs). He believes these pose a risk of oppressive control and are likely to be misused.","\"I oppose central bank digital currencies because they are instruments of control and oppression, and are certain to be abused,\" he asserted.","Kennedy's viewpoint reinforces the idea that digital assets will be a key battleground in the 2024 United States presidential election.","At Thursday's <a href=\"https:\/\/stateofcryptosummit.live.ft.com\/\" data-v-f87c67ca=\"\">State of Crypto Summit<\/a> in New York, Coinbase CEO <a href=\"https:\/\/www.theblock.co\/post\/230395\/brian-armstrong-compensation-weath-security-coinbase\" data-v-f87c67ca=\"\">Brian Armstrong<\/a> highlighted the importance of the upcoming presidential election for the future of the cryptocurrency market. He said: \"Frankly, the 2024 election is also a factor here, because it’s kind of politically unpopular to be anti-crypto right now.\"","Armstrong also addressed ongoing legal issues involving <a href=\"https:\/\/www.theblock.co\/post\/236029\/coinbase-ceo-sees-2024-election-playing-key-role-in-crypto-regulation\" data-v-f87c67ca=\"\">Coinbase<\/a> and its competitor, <a href=\"https:\/\/www.theblockresearch.com\/a-comprehensive-look-at-historical-legal-actions-against-binance-and-coinbase-235932\" data-v-f87c67ca=\"\">Binance<\/a>. While reminding attendees that Coinbase's interaction with the <a href=\"https:\/\/www.theblock.co\/post\/236128\/sec-postpones-30-million-blockfi-penalty-to-boost-creditor-repayments\" data-v-f87c67ca=\"\">SEC<\/a> is a \"civil matter\" regarding the definition of commodities and securities, he drew a contrast with other companies facing more serious allegations.","“The other issue we’re seeing is different. There are criminal matters. There are allegations of illegal trading, commingling of funds, executives and CEOs being named personally. None of that is really an issue at Coinbase,\" Armstrong stated."],"hashtag":["CONGRESS","CRYPTO"]}