{"summary":"Espresso has emerged from stealth mode to announce a new privacy-focused blockchain, backed by $32 million in fresh funding.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/136623\/stanford-researchers-raise-32-million-as-they-build-a-privacy-focused-blockchain","publishDate":"2022-03-07T18:03:43","id":2398,"type":null,"title":"Stanford researchers raise $32 million as they build a privacy-focused blockchain","category":["LAYER 1S"],"content":["Collaborators at Stanford University have raised $32 million in funding for Espresso, a new layer-one blockchain focused on privacy and decentralization.&nbsp;","\"This funding will provide the resources necessary to grow the team researching, building, and implementing the infrastructure and products that will make Web3 ready for broad adoption,\" says a <a href=\"https:\/\/www.espressosys.com\/blog\/introducing-espresso-systems\" data-v-f87c67ca=\"\">blog post<\/a> on Espresso's website. \"The funds will also go towards bringing these products to market through a range of channels: distribution of native end-user products, developer adoption, and partnerships with entrepreneurs, startups, and enterprises.\"","The company behind Espresso, called Espresso Systems, is led by four co-founders. The latest funding round was led by Greylock Partners and Electric Capital with participation from Sequoia Capital, Blockchain Capital, and Slow Ventures.&nbsp;","The developers behind Espresso contend that one factor hampering broader adoption is high transaction fees that fluctuate. “Soaring fees render many of today’s most popular decentralized applications inaccessible for large numbers of would-be consumers,” says the blog post.","Espresso aims to change that, by using zero-knowledge proofs, which allow a party to prove that a statement is true without showing the evidence behind it, said CEO Ben Fisch to <a href=\"https:\/\/techcrunch.com\/2022\/03\/07\/stanford-crypto-researchers-building-espresso-privacy-scalability-blockchain\/?tpcc=tcplustwitter\" data-v-f87c67ca=\"\">TechCrunch<\/a>. &nbsp;Espresso uses ZK-Rollups to achieve greater throughput by consolidating transactions into a single proof.&nbsp;","“If you use a zero-knowledge proof to prove the validity of a large number of transactions that never get sent to the consensus protocol, then while the consensus protocol can verify their validity, they’re not able to provide data to users that is needed for constructing future transactions,” Fisch said to TechCrunch. “We’re working on a way of integrating the roll-up carefully with consensus so that we still achieve higher throughput and thus lower fees, but without compromising so much on decentralization,” Fisch said.&nbsp;","Espresso's blockchain focuses on privacy using an open-sourced smart contract called Configurable Asset Privacy for Ethereum, or CAPE. CAPE allows digital asset creators to customize what information can be shown regarding ownership and movement of assets.","Digital assets on CAPE, like stablecoins and NFTs, can be customized to balance transparency with privacy by users. CAPE transactions appear anonymous and hide the asset being transacted, but the creator of an asset can “configure a viewing policy, which ensures that select parties can decrypt select information about transactions for that asset,” according to a <a href=\"https:\/\/www.espressosys.com\/blog\/introducing-espresso-systems\" data-v-f87c67ca=\"\">statement<\/a> on their website.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sequoia Capital","content":"ORGANIZATION"},{"type":"Fisch","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Ben Fisch","content":"PERSON"},{"type":"CAPE","content":"ORGANIZATION"},{"type":"Greylock Partners and Electric Capital","content":"ORGANIZATION"},{"type":"$32 million","content":"MONEY"},{"type":"Espresso Systems","content":"ORGANIZATION"},{"type":"Stanford University","content":"ORGANIZATION"},{"type":"Blockchain Capital","content":"ORGANIZATION"}],"hashtag":[],"authors":["Anushree Dave","The Block"]}