{"summary":"An early Ethereum adviser has filed a $9.6-billion lawsuit against the US government, alleging federal agents &quot;fabricated&quot; evidence that led to his arrest and a four-year legal battle.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287451\/former-ethereum-advisor-steven-nerayoff-sues-us-government-for-9-6-billion-over-fabricated-charges","publishDate":"2024-04-09T18:15:11","id":24,"type":null,"title":"Former Ethereum advisor Steven Nerayoff sues US government for $9.6 billion over &#x27;fabricated&#x27; charges","category":["LEGAL"],"content":["An early Ethereum network adviser is suing the U.S. government for $9.6 billion, alleging federal agents “maliciously” investigated and prosecuted him.","In a legal <a href=\"https:\/\/www.dropbox.com\/scl\/fi\/qpiwtd0fv1rfjfcwlus7j\/FTCA_Redacted.pdf?rlkey=i6pfvldndm5qjtr46gijdxojb&amp;dl=0\" data-v-f87c67ca=\"\">complaint<\/a> filed April 9, Steven Nerayoff's lawyers allege government agents fabricated federal charges against their client in 2019.","According to the lawsuit, as part of their “collective and concerted fishing expedition,” federal agents subpoenaed, surveilled and even arrested Nearyoff, despite knowing the charges against him were “factually and legally baseless.”","“Federal agents and officers… launched an unhinged and unlawful, four-year campaign against Mr. Nerayoff,” lawyers said in the complaint.","Nerayoff was <a href=\"https:\/\/www.theblock.co\/linked\/40211\/early-ethereum-advisor-steven-nerayoff-arrested-in-alleged-multi-million-dollar-cryptocurrency-extortion-scheme\" data-v-f87c67ca=\"\">arrested in 2019<\/a> for allegedly extorting 10,000 ether from a crypto startup. The legal battle that ensued lasted roughly four years, ending when the US government dismissed the lawsuit in May 2023.","Nerayoff's lawyers allege that federal agents’ actions have caused their client “significant damages and injuries.”&nbsp;","“As a direct and proximate result of the wrongful conduct of federal agents and\/or officers, Mr. Nerayoff’s well-being, personal life and career were irreparably harmed,” lawyers said in the lawsuit.&nbsp;","The $10 billion in damages represent losses Nerayoff incurred, due to the harm the legal battle did to his reputation. According to the lawsuit, all of Nerayoff's business partners abandoned him during the legal proceedings, which caused him to lose out on making multiple billions of dollars during a crypto market bull run, including “hundreds of millions of dollars from consulting contracts.”","Nerayoff is the founder of Alchemist, a blockchain consulting firm.","Nerayoff has repeatedly attacked Ethereum in the past, according to a <a href=\"https:\/\/cointelegraph.com\/news\/ex-ethereum-adviser-9-6-billion-lawsuit-us\" data-v-f87c67ca=\"\">Cointelegraph report<\/a>, making serious allegations against founders Vitalik Buterin, Joe Lubin, and the Ethereum Foundation.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"May 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Nerayoff","content":"PERSON"},{"type":"$10 billion","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"“hundreds of millions of dollars","content":"MONEY"},{"type":"Nerayoff","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Joe Lubin","content":"PERSON"},{"type":"$9.6 billion","content":"MONEY"},{"type":"April 9","content":"DATE"},{"type":"Nearyoff","content":"PERSON"},{"type":"Steven Nerayoff","content":"PERSON"},{"type":"multiple billions of dollars","content":"MONEY"}],"hashtag":["LAWSUITS"],"authors":["Elizabeth Napolitano","The Block"]}