{"summary":"Binance.US had previously said that freezing its clients&#x27; assets would be the &quot;death penalty.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235266\/binance-to-lose-access-to-binance-uss-cryptocurrency-under-proposed-sec-deal","publishDate":"2023-06-17T04:11:32","id":240,"type":null,"title":"Binance to lose access to Binance.US&#x27;s cryptocurrency under proposed SEC deal","category":["EXCHANGES"],"content":["Binance.US, the U.S. offshoot of cryptocurrency exchange Binance, and the Securities and Exchange Commission (SEC) have agreed on a plan that would restrict access of customer funds from Binance.","The proposed deal, first <a href=\"https:\/\/www.coindesk.com\/policy\/2023\/06\/17\/binance-sec-strike-deal-to-move-all-us-customer-funds-wallet-keys-back-onshore\/?utm_medium=social&amp;utm_source=onecryptofeed&amp;utm_campaign=headlines\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">reported by CoinDesk<\/a>, is pending approval from a federal judge.","According to the <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.dcd.256060\/gov.uscourts.dcd.256060.70.0.pdf\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">proposed agreement<\/a>, Binance.US will prevent any Binance Holdings officials from accessing private keys tied to client wallets as well as Binance.US’s cloud infrastructure. In the next few weeks, Binance.US expects to share information pertaining to the costs of these efforts.&nbsp;","The proposed agreement comes in response to the SEC’s motion to freeze all of Binance.US’s assets following its lawsuit against the exchange, which alleges the exchanges were improperly connected and violated securities laws. The SEC expressed concerns that Binance.US funds could be moved offshore and requested a temporary restraining order. For its part, Binance.US’s lawyers argued that freezing its assets would be too harsh, comparing it to a “death penalty.”","U.S. District Judge Amy Berman Jackson recommended the two parties reach an agreement rather than imposing a temporary restraining order given the complexity of the case and the two-week limit for further hearings.","The proposed agreement will require Binance.US to create new wallets that are inaccessible to Binance’s global employees, provide additional information to the SEC, and agree to an expedited discovery schedule. During this time, U.S. customers will still be allowed to withdraw funds.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Amy Berman Jackson","content":"PERSON"},{"type":"Binance","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Binance Holdings","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}