{"summary":"European crypto asset trading and investment group CoinShares disclosed a $30.3 million holding currently stuck on embattled cryptocurrency exchange FTX. \nThis is roughly equivalent to 11% of its net asset value, which was $279 million as of September. \nCEO Jean Marie Mognetti said that in spite of this, the financial health of the investment group is strong. ","author":["Tom Matsuda","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/185309\/coinshares-discloses-30-3-million-exposure-to-ftx-none-to-alameda","publishDate":"2022-11-10T09:44:20","id":2402,"type":null,"title":"CoinShares discloses $30.3 million exposure to FTX, none to Alameda","category":["Companies"],"content":["European crypto asset trading and investment group CoinShares disclosed a $30.3 million holding currently stuck on embattled cryptocurrency exchange FTX. This is roughly equivalent to 11% of its net asset value, which was $279 million (£240.6 million) as of September.&nbsp;","In a news release today, the company said it had no exposure to Alameda Research, the sister company of the exchange, and that it had been in the process of withdrawing funds from the exchange over the past week.","\"Thanks to our prudent approach to risk, we had materially reduced our exposure to FTX exchange in response to increased volatility and uncertainty, ahead of FTX’s decision to freeze further withdrawals,\" said CoinShare CEO Jean Marie Mognetti.&nbsp;","On Tuesday, FTX halted withdrawals amid a liquidity crisis. The same day, FTX said it had agreed to be acquired by rival Binance. Wednesday, after Binance reviewed FTX's financials, the acquisition <a href=\"https:\/\/www.theblock.co\/post\/184636\/binance-backs-out-of-ftx-acquisition-deal\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">fell through<\/a>. In events that followed, other companies have disclosed their exposures to the troubled exchange.&nbsp;","CoinShares said its XBT and CoinShare physical note-holders would remain unaffected in the event that its exposure was not recoverable. It holds 190 bitcoin, 1,000 ether, $25.9 million in a mixture of USD and USDC and $110,000 in other assets, according to the release.&nbsp;","Mognetti said that in spite of this, the financial health of the investment group is strong.&nbsp;"],"hashtag":["FTX"]}