{"summary":"The rebrand of derivatives exchange BitMEX continues with the addition of 14 new coins to its platform over the last four weeks.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176932\/bitmex-adds-14-tokens-as-it-moves-beyond-derivatives-trading","publishDate":"2022-10-13T08:32:44","id":2404,"type":null,"title":"BitMEX adds 14 tokens as it moves beyond derivatives trading","category":["EXCHANGES"],"content":["The rebrand of derivatives exchange BitMEX has continued with the addition of 14 new coins to its platform over the last four weeks. This comes as it pivots to compete with more traditional exchanges.","The new coins added since September are $USDC, $TRON, $SOL, $DAI, $FTM, $BUSD, $AAVE, $SHIB, $WTC, $CRO, $MANA, $FTT, $SAND and $OKB. It follows the company's first foray into non-crypto products in August, when it <a href=\"https:\/\/www.theblock.co\/post\/161920\/bitmex-launches-fx-perpetual-swap-contracts-for-institutional-and-retail-investors\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">launched<\/a> FX perpetual swap contracts, allowing users to trade more than 20 contracts tied to foreign currencies.","“As more investors and traders enter the space and strategies become increasingly mature, those of us who provide products and services to power that investment must be continually looking to adapt to emerging trends and needs,” said Alex Höptner, CEO of BitMEX, in a statement. &nbsp;","Höptner added that it was a strategic shift to move beyond derivatives and accommodate market demands.","“We are now focusing on our ‘beyond derivatives’ transformation strategy which includes a range of new products and updates which allow our users to do more with their crypto as we continue to facilitate the emergence of digital assets in the mainstream,” he said.","Höptner joined BitMEX as CEO in late 2020, months after the companies' founders, Arthur Hayes, Ben Delo and Samuel Reed, were charged with one count of violating the Bank Secrecy Act and a second charge of conspiring to do so.","All thee avoided jail time earlier this year after pleading guilty. Hayes was handed a <a href=\"https:\/\/www.theblock.co\/linked\/148053\/bitmex-arthur-hayes-doj-sentence\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">sentence<\/a> of six months of home detention as part of a two-year probationary period. Delo and Reed recieved 30 and 18 months probabtion, respectively.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$USDC","content":"MONEY"},{"type":"Hayes","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$TRON","content":"MONEY"},{"type":"$AAVE","content":"MONEY"},{"type":"$CRO","content":"MONEY"},{"type":"$SAND","content":"MONEY"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"Samuel Reed","content":"PERSON"},{"type":"$MANA","content":"MONEY"},{"type":"Ben Delo","content":"PERSON"},{"type":"$BUSD","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"$SHIB","content":"MONEY"},{"type":"$WTC","content":"MONEY"},{"type":"$FTT","content":"MONEY"},{"type":"$OKB","content":"MONEY"},{"type":"$SOL","content":"MONEY"},{"type":"FTM","content":"ORGANIZATION"},{"type":"$DAI","content":"MONEY"},{"type":"Alex Höptner","content":"PERSON"},{"type":"Reed","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":["BITMEX"],"authors":["Callan Quinn","The Block"]}