{"summary":"Huobi exchange’s sister firm plans to launch three funds that are 100% invested in crypto assets\nThe pure crypto funds come after it receives new regulatory clearance from Hong Kong regulators in addition to gaining a type 9 license last year","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/97074\/huobi-btc-eth-funds-hong-kong","publishDate":"2021-03-04T01:20:13","id":2405,"type":null,"title":"Huobi exchange&#x27;s sister firm to launch pure BTC, ETH funds in Hong Kong","category":["Bitcoin"],"content":["Huobi Technology Holdings, a Hong Kong-listed firm owned by Huobi exchange's CEO and chairman Li Lin, is set to launch three funds that are 100% invested in digital assets.","Huobi Tech said in an announcement shared with The Block on Thursday that its fully-owned subsidiary Huobi Asset Management has obtained additional regulatory clearing from the Hong Kong Securities and Futures Commission (SFC) to operate 100% digital asset funds.","With the regulatory approval, Huobi Asset Management plans to launch a BTC tracker fund, an ETH tracker fund and a multi-strategy digital asset fund that are all 100% invested in cryptocurrencies.","In addition, it's rolling out a multi-asset fund that splits 10% in digital assets and 90% in equity and fixed income. Huobi Tech said the funds' subscription accepts both fiat and cryptocurrencies.","The plan follows Huobi Tech's announcement last August that it received a type 9 (asset management) license from the SFC. However, a type 9 license itself does not automatically give the green light to operate funds that are 100% in digital assets. An asset manager would need to obtain additional approval under a type 9 regime if they want to distribute a 100% crypto fund.","In a $77 million deal in 2018, Li purchased over 70% of the stakes of Pantonics, an electronic component manufacturer listed in Hong Kong. The firm was subsequently rebranded to Huobi Technology Holdings in 2019 but Li has not yet restructured Huobi's exchange business into the Hong Kong shell.&nbsp;","Huobi Tech has not disclosed its envisioned size of the planned funds. \"The size of the funds is under discussion and depends on the development of distribution channels,\" said Mandy Liu, vice president of Huobi Tech's Investor Relations. \"We aim to become the leading virtual asset management company in Asia in the near future.\"","This is not the first time that a Hong Kong-regulated asset manager rolls out a pure crypto fund that offers a window to professional and institutional investors.&nbsp;","Venture Smart Asia, a Hong Kong-based wealth manager, <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2020-04-19\/hong-kong-s-first-approved-crypto-fund-is-targeting-100-million\" data-v-f87c67ca=\"\">launched<\/a> a BTC fund in Hong Kong in April last year via its blockchain investment arm Arrano Capital. The firm said at the time its target size in the first year was $100 million.&nbsp;","Meanwhile, the Hong Kong government is set to introduce a new bill to the city's legislative council this year that would put crypto exchanges in the jurisdiction under a new licensing regime.","The proposed license draft, which has completed a public consultation process, seeks to allow exchange to only target professional investors at initial stage. Industry experts told The Block previously that such an approach could <a href=\"https:\/\/www.theblockcrypto.com\/daily\/83987\/hong-kong-crypto-rules-exchange-impact\" data-v-f87c67ca=\"\">hamper trading volume<\/a> and drive away retail investors to unregulated trading venues.","It remains to be seen whether the content of the actual bill will be different to the proposed draft when it's introduced."],"hashtag":["BITCOIN"]}