{"summary":"The Merge has happened and Ethereum’s future roadmap is now focused on scaling the network.\nThe plan for Ethereum to achieve greater scalability is by using sharding and layer 2 networks for faster and cheaper transactions.","author":["Mike Truppa","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/170072\/beyond-the-merge-a-look-at-ethereums-plans-for-scaling-in-the-future","publishDate":"2022-09-15T11:16:38","id":2408,"type":null,"title":"Beyond The Merge: A look at Ethereum’s plans for scaling in the future","category":["The Merge"],"content":["The Merge took place on Sept. 15, signifying Ethereum’s <a href=\"https:\/\/www.theblock.co\/post\/169299\/ethereum-activates-the-merge-as-it-shifts-to-proof-of-stake\" data-v-f87c67ca=\"\">successful transition<\/a> from proof of work to proof of stake — reducing inflation and energy use in the process.","Over the next year, developers will focus on opening up withdrawals of staked assets, the final task in that multi-stage process.","But now that the move to proof of stake is largely complete, developers will increasingly turn to the other most pressing issue that affects the network. It's one that developers have grappled with since activity on the network picked up in 2017: scaling.","Ethereum development teams and startups have put forward a smorgasbord of approaches to tackling this thorny issue, at both the protocol level and through a lasagna-like system of layers. Many of these approaches are led by different teams and are, in some ways, competing with one other.","But they all share a goal: allowing millions of people to use Ethereum on a regular basis and make as many fast and cheap transactions as they want.","“Ethereum today can process about 15-20 transactions per second, this Ethereum, including the rollups and sharding, according to the math, could process 100,000 transactions per second,” Vitalik Buterin, co-founder of Ethereum, said during a presentation in July.","Here’s an in-depth look at the various ways Ethereum is planning to scale.","Ethereum has major scaling upgrades on the way, all of which are being developed in parallel to The Merge and will roll out at separate times. All of these changes will occur on Ethereum’s proof of stake base layer.","Buterin highlighted these developments at <a href=\"https:\/\/www.youtube.com\/watch?v=zBYhv6MOeEs\" data-v-f87c67ca=\"\">EthCC<\/a> in July where he broke down the various approaches as well as the benefits each adds to the network.","First up is <a href=\"https:\/\/notes.ethereum.org\/@vbuterin\/proto_danksharding_faq#Proto-Danksharding-FAQ\" data-v-f87c67ca=\"\">proto-danksharding<\/a>, a precursor to sharding, expected to launch six to twelve months after The Merge. It introduces data blobs, which increase the amount of data Ethereum blocks can hold. By increasing the amount of data each block can hold, proto-danksharding could make transaction costs on Ethereum layer 2 chains <a href=\"https:\/\/twitter.com\/protolambda\/status\/1495538286332624898?s=20&amp;t=mI-8tEnY2kO2v4OeJFPg6A\" data-v-f87c67ca=\"\">100x cheaper.<\/a>","Next in line is danksharding, which introduces sharding on Ethereum. Sharding has been in development since <a href=\"https:\/\/medium.com\/@socialmedia_63108\/vitalik-buterin-lays-roadmap-for-ethereum-visa-levels-quadratic-sharding-7478e769808f\" data-v-f87c67ca=\"\">Vitalik Buterin introduced it in 2017<\/a>. Its goal is to improve Ethereum’s scalability and make rollups even cheaper to use. Rollups are second layers that sit on top of Ethereum and process large numbers of transactions, bringing them in batches to the main blockchain.","Rollups use lots of data, which increases transaction costs. \"Rollups are data-hungry and the resources needed to run an Ethereum node increases over time as nodes need to download all the data posted by rollups,\" said The Block Research's Eden Au.","Danksharding takes the reduced transaction costs from proto-danksharding a step further and mitigates the need for nodes to download all the data by enabling them to take just a ‘sample’.&nbsp;","The third development introduces <a href=\"https:\/\/www.alchemy.com\/overviews\/proposer-builder-separation\" data-v-f87c67ca=\"\">proposer builder separation (PBS).<\/a> This concept separates the highly intensive work of block building from more passive block validation. Proposer builder separation will ensure an adequate amount of validators for decentralization and data availability sampling on the post-sharded Ethereum network.","The final developments are geared toward reducing the total history and storage requirements for validators. History and storage requirements make it expensive to run a validator and will become even more costly in a post-sharded Ethereum world.","These last developments will decrease the cost and barrier to entry to run a validator, allowing Ethereum to maintain decentralization.","Another significant development over the past year is the maturity of viable layer 2 solutions. Layer 2 protocols allow for much cheaper transactions while still receiving the security benefits of the Ethereum base layer.","The growing focus on layer 2 technology can be divided into four main categories: optimistic rollups, zero knowledge SNARKs, zero knowledge STARKs, and SNARK-based zkEVMs. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nOptimistic rollups use what are known as fraud proofs, which ‘optimistically’ expect all transactions to be valid.","Arbitrum, Optimism, and Metis are currently the most viable, adopted optimistic rollups.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/scaling-overview\/value-locked-of-ethereum-optimistic-rollups\/embed\" title=\"Value Locked in Ethereum Optimistic Rollups\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Then there are zero-knowledge proofs. SNARKs and STARKS both use cryptographic proofs that allow one to prove information without revealing it. The main difference between the two is that STARKs are quantum computing-resistant.","Protocols like StarkNet, zkSync, and Polygon’s suite of zero knowledge chains are the leading contenders in the zero knowledge sector."],"hashtag":["ETHEREUM","VITALIK BUTERIN"]}