{"summary":"Circle has hired Heath Tarbert, the former chairman of the United States Commodities Futures Trading Commission, as its new chief legal officer.","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/233752\/circle-clo-cftc","publishDate":"2023-06-08T07:56:32","id":241,"type":null,"title":"Former CFTC head joins Circle as chief legal officer","category":["Finance firms"],"content":["Circle — the company behind stablecoin USDC — has hired Heath Tarbert, the former chairman of the United States Commodities Futures Trading Commission, as its new chief legal officer, the company <a href=\"https:\/\/www.prnewswire.com\/news-releases\/circle-names-heath-tarbert-chief-legal-officer--head-of-corporate-affairs-301844608.html\" data-v-f87c67ca=\"\">announced<\/a> Thursday.&nbsp;","Tarbert, who left the CFTC after an 18-month tenure with the financial regulator, joined Circle from market-making firm Citadel Securities, where he also held the top legal role. According to a press release, Tarbert is replacing Flavia Naves, who left Circle earlier this year.","\"The opportunity to welcome Heath's expertise and leadership to our executive team is an extraordinary step in Circle's growth as a global company,\" commented Jeremy Allaire, Circle's co-founder and CEO. \"As we continue building a bridge between traditional finance and Web3, Heath's perspective, legal acumen and global regulatory experience will help us advance the utility value of USDC worldwide.\"","The hire comes as Circle ramps up its policy efforts in Washington to build support for the crypto industry among lawmakers. Recently, Allaire <a href=\"https:\/\/www.forbes.com\/sites\/ninabambysheva\/2023\/06\/07\/circle-begs-congress-please-regulate-us\/\" data-v-f87c67ca=\"\">appeared<\/a> on the cover of Forbes with the caption \"please regulate us.\"","Tarbert's move also comes at an increasingly difficult time for the cryptocurrency space, which is under pressure from a more hostile U.S. regulatory environment in the wake of the meltdown of crypto exchange FTX. Earlier this week, the Securities and Exchange Commission sued Binance and Coinbase. The latter exchange launched USDC with Circle in 2018."],"hashtag":["CRYPTO BANKS AND LENDERS","FINTECH","HIRING","USDC"]}