{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley. They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/20235\/business-chameleon-allegedly-made-false-and-misleading-statements","publishDate":"2019-04-19T18:30:44","id":2412,"type":null,"title":"Business chameleon allegedly made false and misleading statements","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]Arslani v. UMF Group, Inc., Root and John Doe, Case № 1:19-cv-0980 (DC Col. Filed April 16, 2019)<\/strong><\/em>","There has been a lot of interest in the blockchain space over the past couple of years. Some of that interest has been legitimate and truly focused on taking advantage of a new technology space. Some has been, to put it politely, questionable. The reality of course is that any “new thing,” draws the attention of people looking to turn a quick buck illegally. That is the main allegation of this newly filed lawsuit in Colorado, which somehow manages to allege a scheme involving crypto, medical marijuana, a stock-split, an attorney behaving badly, and a pump-and-dump scheme.","Plaintiff Arslani purchased common stock of UMF Group on the, allegedly, false and misleading statements made by Defendant Ross. Ross, which may be an alias and is thus also known as John Doe, is allegedly the sole corporate officer for UMF Group. In that role he was responsible for directing the activities of the company and issuing public statements about what was going on with said company.","From 1988–2011 the company was engaged in the oil and gas exploration business. Apparently, from 2011 until 2016 the business was defunct. Defendant Ross, who had never been mentioned in corporate filings for the company from 1988–2011, unexpectedly put the company in good standing with the Colorado Secretary of state on Oct. 26, 2016. Starting in early 2017 Ross started selling shares in UMF Group via the OTC Markets Group. Then, things got weird.","First, there was allegedly a questionable stock split whose goal was for Ross to gain more control of the company and dilute the control of legitimate shareholders. Then the first quarterly report of 2017 claimed that UMF Group was now “an innovative Medical Marijuana company, which aims to develop and approve proprietary extracts as pharmaceuticals.” This pivot from oil and gas was announced via a press release dated May 23, 2017. Then the Crypto Bull Run of 2017 happened, and things changed again.","On Nov. 30, 2017, UMF Group puts out a press release announcing they are pivoting from medical marijuana to… yep, crypto. Specifically, they claimed to acquire a company that would help them build a cryptocurrency wallet “CryptoSecure,” with the tagline “CyberSecurity and Cryptocurrency: Two Sides of the Same Coin.\"","On January of 2018, the plaintiff was contacted by an individual touting the ability to get in on the ground floor of UMF (this was allegedly part of a pump-and-dump scheme). In doing his due diligence, the plaintiff found old press releases and also letters that had been issued about the company by the other named defendant, Root.","Root as it turns out is a lawyer licensed in Arkansas. As Ross was allegedly leading the company and making public representations about company financials and what they were focused on, Root was preparing letters on behalf of Ross that were, allegedly, not completely truthful, but meant to function as disclosures to the OTC Markets group, which facilitated the trading of UMF stock. These attorney letters had to adhere to fairly strict standards of truthfulness, and the attorney issuing them had to be able to practice before the SEC. Allegedly, those standards were not met.","This case covers a lot of issues, and the attorney allegation is a bad one for any attorney. As a general matter, no surprise, you do not want to engage in potentially nefarious activity on behalf of your client. This is just the beginning of this case, and it will be very interesting to see it play out.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part I of this week's analysis, Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"April 16, 2019","content":"DATE"},{"type":"2016","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"UMF","content":"ORGANIZATION"},{"type":"2011","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"0980","content":"DATE"},{"type":"May 23, 2017","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"John Doe","content":"PERSON"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"Ross","content":"PERSON"},{"type":"UMF Group","content":"ORGANIZATION"},{"type":"January of 2018","content":"DATE"},{"type":"Colorado","content":"LOCATION"},{"type":"1988","content":"DATE"},{"type":"OTC Markets Group","content":"ORGANIZATION"},{"type":"Arkansas","content":"LOCATION"},{"type":"Arslani v. UMF Group, Inc.","content":"ORGANIZATION"},{"type":"Oct. 26, 2016","content":"DATE"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Nov. 30, 2017","content":"DATE"}],"hashtag":[],"authors":["Nelson Rosario","The Block"]}