{"summary":"Trident’s founders are former bankers who more recently spent time in senior roles at Coinbase and Matrixport. \nThe startup raised $8 million in a seed round led by White Star Capital and New Form. ","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/249375\/former-coinbase-execs-raise-8-million-for-fresh-take-on-crypto-lending","publishDate":"2023-09-06T19:01:02","id":2414,"type":null,"title":"Former Coinbase execs raise $8 million for fresh take on crypto lending","category":["Venture Capital"],"content":["Trident Digital Group, a newly launched startup founded by former Coinbase executives, raised $8 million for its “next generation” crypto lending business.","The launch comes after <a href=\"https:\/\/www.theblock.co\/post\/214880\/stop-swimming-naked-reboot-crypto-lending\" data-v-f87c67ca=\"\">a period of utter carnage<\/a> in crypto lending markets. At least half a dozen lenders and borrowers —&nbsp;ranging from the hedge fund Three Arrows Capital to lenders like BlockFi, Celsius Network and Voyager Digital —&nbsp;collapsed into bankruptcy last year.","Trident hopes to restore some of the liquidity that has drained out of the lending market, according to an announcement this morning.","To get started, it raised $8 million in a seed round co-led by White Star Capital and New Form, with CMT Digital, Joint Effects and Permit Ventures also participating.","“Counterparty risk, largely ignored in the last cycle, has become the key constraint preventing lenders from re-entering the market. Trident’s solution will offer proper risk management and strike a balance between security and capital efficiency,” said Anthony DeMartino, Trident’s CEO, in a statement.","DeMartino is a former banker with UBS, Barclays and HSBC who moved into crypto in 2021 when he joined Coinbase, the exchange operator, as head of Coinbase Risk Strategies focused on DeFi and derivatives trading. He then spent a year as CEO of Matrixport’s U.S. business before <a href=\"https:\/\/www.theblock.co\/post\/238566\/matrixport-appoints-fresh-ceo-for-us-business\" data-v-f87c67ca=\"\">stepping down in July<\/a>.","DeMartino’s colleagues at Trident have similar backgrounds. Toby Norfolk-Thompson, Trident’s chief commercial officer, worked with DeMartino at Coinbase as chief investment officer of Coinbase Risk Strategies and at Matrixport as chief investment officer in the U.S. and UK.","Trident will launch with a yield product that ties yields to the risk-free rate while ensuring treasuries physically back any deposits, according to today’s announcement. The startup hopes to win deposits from fintech firms, crypto native treasuries and venture capitalists."],"hashtag":[]}