{"summary":"Gauntlet advised the Aave community to freeze CRV tokens on version 2.\nThe recommendation was made in response to a large loan taken by an address tied to Curve Finance founder.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234648\/gauntlet-advises-aave-to-freeze-crv-tokens-deposited-by-wallet-tied-to-curve-finance-founder","publishDate":"2023-06-14T12:00:10","id":2415,"type":null,"title":"Gauntlet advises Aave community to freeze CRV tokens in response to loan by Curve Finance founder","category":["Crypto Ecosystems"],"content":["Gauntlet, a project specializing in DeFi risk management, <a href=\"https:\/\/governance.aave.com\/t\/gauntlet-recommendation-to-freeze-crv-and-set-crv-ltv-0-on-aave-v2\/13644\" data-v-f87c67ca=\"\">issued<\/a> guidance to the governing body of the lending platform, Aave. It proposed to \"freeze\" Curve DAO tokens on Aave v2 and adjusting the loan-to-value ratio for CRV to zero. The recommendation was made in response to a large CRV loan taken by a wallet address tied to Michael Egorov, the founder of Curve Finance.","Gauntlet serves as a contributor to Aave, focusing on strengthening the security of the platform.","Gauntlet said it examined the risk profile of the wallet in question, which relied on CRV tokens as collateral for its loan. The wallet address, said to be connected to Curve Finance founder Michael Egorov, <a href=\"https:\/\/debank.com\/profile\/0x7a16ff8270133f063aab6c9977183d9e72835428\" data-v-f87c67ca=\"\">borrowed<\/a> approximately $63 million in USDT against collateral of 288 million ($180 million) in CRV, per on-chain data. These 288 million CRV tokens account for more than 30% of the total circulating supply of CRV.","Gauntlet suggested that by freezing CRV on Aave v2, the project can incentivize the loan holder to either reduce borrowing or diversify collateral forms. The goal is prevent Aave from accruing bad debt due to the declining liquidity of CRV tokens on exchanges. Specifically, Gauntlet claimed the concern is over the decrease in the liquidity of the CRV token, which has gone down in the last few months.","Gauntlet <a href=\"https:\/\/twitter.com\/TheBlock__\/status\/1669011870156505099\/retweets\/with_comments\" data-v-f87c67ca=\"\">clarified<\/a> that it does not support restricting any specific address. Instead, a CRV freeze would encourage the migration of the aforementioned loan position to Aave version 3, which is designed for better risk management. “We propose freezing CRV on Aave V2 to encourage migration to V3, where risk parameters are better suited for this market,” Gauntlet said.","“Given the account is actively managed and frequently maintains its health, freezing CRV will incentivize the account to reduce its borrow or add other forms of collateral,” Gauntlet stated in its proposal.","Despite the loan account maintaining a <a href=\"https:\/\/debank.com\/profile\/0x7a16ff8270133f063aab6c9977183d9e72835428\" data-v-f87c67ca=\"\">health factor<\/a> of 1.6 for its loan, indicating no immediate bad debt risk to Aave. Nevertheless, Gauntlet stressed that if the address continues to use CRV as collateral, it could pose future risks, especially considering the recent reduction in CRV liquidity.&nbsp;","Michael Egorov, the founder of Curve Finance, spoke with The Block about the loan in question and what Gauntlet’s proposal entails. “The proposal seems to suggest changing the LTV to zero while maintaining the liquidation threshold at exactly the same level as before. This change would prevent any increase in the loan or the collateral, necessitating the use of Aave v3 (which is capped) if additional collateral is required,” Egorov explained. \"Regardless, it’s better to be a bit more careful with this position on Aave. Even if proposal gets rejected, it’s better for me to act as if it was executed,\" Egorov added.","Meanwhile, other contributors to Aave have commented that executing Gauntlet's proposal might not be beneficial for Aave and could potentially conflict with the ethos of decentralized finance.","Among them was Aave-Chan Initiative founder Marc Zeller, who <a href=\"https:\/\/governance.aave.com\/t\/gauntlet-recommendation-to-freeze-crv-and-set-crv-ltv-0-on-aave-v2\/13644\/9\" data-v-f87c67ca=\"\">said<\/a>, “Firstly, it’s important to remember the core ethos of DeFi, which is neutrality. The protocol should function effectively regardless of whether a pool has one large position or a thousand smaller ones with similar liquidation ranges.” He added, “Secondly, we need to be cautious about implementing ‘solutions’ that could potentially do more harm than good.”","<em data-v-f87c67ca=\"\">The headline and article were updated for clarification and to add comments from Michael Egorov.<\/em>"],"hashtag":["AAVE","ASSETS"]}