{"summary":"Christopher Waller, a governor at the Federal Reserve, said during a panel discussion on Friday that blockchain tech is &quot;totally overrated.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/139348\/fed-governor-christopher-waller-says-blockchain-is-totally-overrated","publishDate":"2022-03-25T16:59:24","id":2417,"type":null,"title":"Fed governor Christopher Waller says blockchain is &#x27;totally overrated&#x27;","category":["CENTRAL BANKS"],"content":["<span data-v-f87c67ca=\"\">Christopher Waller, a member of the Board of Governors of the Federal Reserve, said Friday that “blockchain is totally overrated” and compared certain research papers on central bank digital currencies (CBDC) to infomercials.<\/span>","<span data-v-f87c67ca=\"\">Waller <\/span><a href=\"https:\/\/www.youtube.com\/watch?v=WYBohARUSlQ\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">spoke during a panel<\/span><\/a><span data-v-f87c67ca=\"\"> on Friday centered around the discussion of whether central banks should issue digital currencies.<\/span>","<span data-v-f87c67ca=\"\">The Fed <\/span><a href=\"https:\/\/www.google.com\/search?q=cbdc+fed+site%3Atheblockcrypto.com&amp;rlz=1C5CHFA_enUS996&amp;sxsrf=APq-WBuqd8NDwGRvQMr7-NY1ts1M88zmAg%3A1648231434016&amp;ei=CgQ-YspF0KSm1A_566X4Bw&amp;ved=0ahUKEwjK8obJ7OH2AhVQkokEHfl1CX8Q4dUDCA4&amp;uact=5&amp;oq=cbdc+fed+site%3Atheblockcrypto.com&amp;gs_lcp=Cgdnd3Mtd2l6EANKBAhBGAFKBAhGGABQ1cQ5WMatOmCJrjpoCHAAeACAAXSIAZAHkgEEMTIuMZgBAKABAcABAQ&amp;sclient=gws-wiz\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">released a study in January<\/span><\/a><span data-v-f87c67ca=\"\"> analyzing that very same question and, in an executive order signed this month, president Joe Biden<\/span> <a href=\"https:\/\/www.theblockcrypto.com\/post\/136888\/bidens-executive-order-on-digital-assets-drops-in-four-hours-but-we-have-it-early?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">ordered federal agencies<\/span><\/a><span data-v-f87c67ca=\"\"> to study digital assets as well.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Waller argued that, historically, the Fed has taken a background role in private markets and said that when considering a shift in that position he would first have to ask “what market failure is there that would require us to move away from a 100-year tradition and adopt a retail CBDC?”<\/span>","<span data-v-f87c67ca=\"\">The Fed governor also said that he has seen research papers on CBDCs that read more like “infomercials,” in the sense that they go over all the “bells and whistles” a product has to offer and distract consumers from asking themselves if they actually need it.<\/span>","<span data-v-f87c67ca=\"\">Gary Gorton, a professor of finance at Yale and event participant, advocated for a more proactive approach to digital currencies.<\/span>","<span data-v-f87c67ca=\"\">Gorton pointed out that also from a historical perspective “every single country on earth” has given their sovereign power a monopoly over money creation for the sake of financial stability.<\/span>","<span data-v-f87c67ca=\"\">“We haven't had to think about that. Now we have stablecoins, which are competitors for government money,” he said.<\/span>","<span data-v-f87c67ca=\"\">Gorton argued that as the global supply chain increasingly adopts blockchain technology at a widespread level, it’s important to consider what the means of payment will look like.<\/span>","<span data-v-f87c67ca=\"\">“Right now that’s a bit of a stumbling block,” he said. “It could be CBDC, which I think would be the best thing because otherwise stablecoins are gonna take over and they’re gonna grow and then we’re gonna have a big problem.”<\/span>","<span data-v-f87c67ca=\"\">Gorton contended that, while we’re not gonna have a CBDC for five or 10 years, the Fed should be actively learning and is not doing that.<\/span>","<span data-v-f87c67ca=\"\">“I’m totally baffled by that statement,” Waller responded, adding the Fed is currently using a lot of resources to study and understand this space.<\/span>","<span data-v-f87c67ca=\"\">“If stablecoins, become much more widespread and they have much more uses then I think we have a problem. I think the Fed has a problem,” said Gorton. “We're not talking about some abstract thing here. We’re talking about the money market is already influenced by stablecoins.\"<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gorton","content":"PERSON"},{"type":"Gary Gorton","content":"PERSON"},{"type":"Board of Governors of the Federal Reserve","content":"ORGANIZATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Waller","content":"PERSON"},{"type":"Christopher Waller","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Joe Biden","content":"PERSON"},{"type":"Yale","content":"ORGANIZATION"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}