{"summary":"Tom Brady, Gisele Bündchen and other celebrities who promoted beleaguered crypto exchange FTX were hit with a class action lawsuit.\n\nThe suit alleges that FTX’s celebrity backers promoted unregistered securities.","author":["Stephanie Murray","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/187570\/class-action-filed-against-tom-brady-larry-david-and-others-who-endorsed-ftx","publishDate":"2022-11-16T09:45:25","id":2419,"type":null,"title":"Class action filed against Tom Brady, Larry David and others who endorsed FTX ","category":["Companies"],"content":["Celebrities who promoted troubled crypto exchange FTX are facing a class action lawsuit.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Tom Brady, Gisele Bundchen, Steph Curry and Larry David are among the stars named in the lawsuit, which was filed by attorneys David Boies and Adam Moskowitz in Florida. The Block first <a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/www.theblock.co\/post\/187230\/lawyer-who-beat-microsoft-repped-theranos-eyes-suit-against-ftxs-celeb-backers?utm_source=rss&amp;utm_medium=rss\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.theblock.co\/post\/187230\/lawyer-who-beat-microsoft-repped-theranos-eyes-suit-against-ftxs-celeb-backers?utm_source=rss&amp;utm_medium=rss\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">reported<\/a>&nbsp;that Boies was discussing a class action suit with clients on Tuesday.","The move comes days after FTX filed for bankruptcy protection in Delaware. Former CEO Sam Bankman-Fried, who stepped down from the company last week, is also named in the suit.","The lawsuit claims Brady, Bundchen and others “actively participated” in the “offer and sale of unregistered securities in the form of yield-bearing accounts.”","Boies and Moskowitz are leading a similar class action suit against the Dallas Mavericks basketball team and its owner, Mark Cuban, for promoting the now-bankrupt Voyager, a crypto lending firm."],"hashtag":["FTX"]}