{"summary":"Bitstamp is filling out its U.S. team, looking to U.S. exchanges for hires\nThe company just announced it’s hired former Gemini deputy compliance officer Caitlin Barnett as its U.S. chief compliance officer","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/30890\/bitstamp-snags-gemini-compliance-exec-as-it-expands-into-us","publishDate":"2019-07-11T12:57:58","id":242,"type":null,"title":"Bitstamp snags Gemini compliance exec as it expands into US","category":["Exchanges"],"content":["<span data-v-f87c67ca=\"\">Crypto exchange Bitstamp has plucked another exchange executive from one of its rivals as it expands into the U.S.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The firm has hired Caitlin Barnett, previously the Deputy Compliance Officer at Gemini, as its U.S. chief compliance officer, according to a statement from the company.<\/span>","<span data-v-f87c67ca=\"\">After receiving its BitLicense from the New York Department of Financial Services in April, Bitstamp has been building a stateside team. The certification is the gold standard of trading regulation in New York, allowing the company to offer bitcoin, litecoin, bitcoin cash, XRP and ether to New York residents.<\/span>","Bitstamp is entering the U.S. at the same time other foreign exchanges are expanding into the country, including Binance and Huobi. At last check, Bitstamp has a 5% market share among major exchange venues, as per The Block's calculations.&nbsp;","","Indeed, the company is hoping a U.S. outpost will grow its customer base. The new division is led by Hunter Merghart, who joined the firm from Coinbase as its head of U.S. operations.","To start, Bitstamp's US team is targeting institutional clients, such as family offices and hedge funds. To that end, it is looking to hire a client services representative, business development associate and a public relations manager, according to Merghart.","<span data-v-f87c67ca=\"\">As for Barnett, the Wall Street veteran developed an anti-money laundering\/Bank Secrecy Act compliance program while at Gemini. She also worked as an assistant vice president compliance officer at Commerzbank and assistant vice president and senior counsel at JPMorgan Chase. She holds a J.D. from Touro College Law Center.&nbsp;<\/span>"],"hashtag":["BITSTAMP","COINBASE","GEMINI"]}