{"summary":"Compound Labs has released code for a multi-chain lending protocol called Compound III. \nWhile the protocol hasn’t yet been launched, developers can integrate the code into existing platforms and offer suggestions for improvements.","author":["MK Manoylov","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/154864\/compound-labs-takes-one-step-closer-to-multi-chain-lending-through-newly-released-code","publishDate":"2022-06-29T11:58:59","id":2420,"type":null,"title":"Compound Labs gets closer to multi-chain lending via newly released code","category":["DeFi"],"content":["<span data-v-f87c67ca=\"\">Compound Labs, the team behind the decentralized finance (DeFi) lending protocol Compound, released code for a multi-chain lending protocol dubbed Compound III on Tuesday.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Compound III is intended to be a governable protocol that’s both affordable in capital and transaction fees. One way it’s doing this is by including a single borrowable base asset — with all other assets collateralized — to reduce risk and improve capital efficiency, Compound Labs’ vice president of engineering Jared Flatow <\/span><a href=\"https:\/\/www.comp.xyz\/t\/compound-iii\/3351\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">wrote<\/span><\/a><span data-v-f87c67ca=\"\"> in a Wednesday post.<\/span>","<span data-v-f87c67ca=\"\">While Compound has released the code to the multi-chain lending protocol, it hasn't released the actual protocol itself. Still, the released code marks a major step in making cross-chain decentralized lending a reality on Ethereum virtual machine-compatible (EVM) chains.<\/span>","<span data-v-f87c67ca=\"\">“Developers can begin planning integrations with Compound III, and auditing or suggesting improvements to the codebase,” wrote Flatow in the post.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Compound protocol currently has $3.5 billion in assets accruing interest over 18 markets, according to its website. <\/span>"],"hashtag":["LENDING"]}