{"summary":"ICBC appears to have quietly allowed public users to activate China&#x27;s central bank digital currency wallet inside its mobile app.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/104284\/china-digital-yuan-ecny-alipay-icbc","publishDate":"2021-05-10T09:59:07","id":2422,"type":null,"title":"China&#x27;s digital yuan inches closer to full rollout with AliPay, ICBC activations","category":["CHINA"],"content":["The Industrial and Commercial Bank of China (ICBC), one of the largest banks in the world by total assets, appears to have quietly allowed public users to activate China's central bank digital currency wallet inside its mobile app.","ICBC users from at least Chengdu, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/92339\/chengdu-digital-yuan-cbdc-test\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">one of the first cities<\/a> to begin testing the digital yuan, can now activate these wallets after signing in the bank's mobile app, The Block has learned.","While the feature, called \"Internal Test Wallet,\" had been searchable for months inside the ICBC app, it could not be activated except for white-listed users at least until April.","However, over the past weeks, it appears the function has quietly become available for activation by public users without an invitation in Chengdu. The other Chinese state-owned banking giants have not yet opened up similar features to the public. The Block has conducted a first-hand review of the user interface and experience.&nbsp;","<em data-v-f87c67ca=\"\">A screenshot of the activated app option. Watermarks were auto-generated.<\/em>","The ICBC's in-app wallet enables four major modules: deposit balances from linked bank accounts, withdraw balances to bank accounts, payment QR code and initiate peer-to-peer transactions. All four modules are fully functional, based on The Block's first-hand test.","ICBC's new wallet user interface also contains an educational video and an FAQ sub-page. The educational video highlighted the strategic purpose of the e-CNY is to \"proactively react to the shockwave brought by global private cryptocurrencies towards sovereign currencies\" and \"to maintain the order of the financial markets.\"","Meanwhile, Chinese business media CLS <a href=\"https:\/\/www.cls.cn\/detail\/742895\" data-v-f87c67ca=\"\">reported<\/a> on Monday that a digital yuan module has also become available for some AliPay users. Per the report, these users can now activate a digital yuan wallet from the Ant Group's mobile payment app and also send and receive transactions after topping up balances from linked bank accounts. But the function is only available for white-listed users.","These updates represent another sign of China inching closer to a full rollout of its long-anticipated central bank digital currency, dubbed as e-CNY, or also Digital Currency\/Electronic Payment (DC\/EP).&nbsp;","The new features also mean that Chinese users now have three methods to participate in the e-CNY test: a digital yuan <a href=\"https:\/\/www.theblockcrypto.com\/daily\/90503\/shanghai-test-digital-yuan-hardware\" data-v-f87c67ca=\"\">card-based hardware wallet<\/a>, a standalone e-CNY mobile app without log-in, and the in-app digital yuan wallet from ICBC or AliPay with log-in.","In previous city-wide tests, users either had to win a lottery or <a href=\"https:\/\/www.theblockcrypto.com\/post\/99318\/chinese-banks-digital-yuan-public-shanghai\" data-v-f87c67ca=\"\">apply to state-owned banks<\/a> to download a standalone mobile app called \"Digital Renminbi\" via an invitation link. Although they didn't need to log in to activate the wallet, users must choose one of the six state-owned banks to be their e-CNY issuer.&nbsp;","The CLS report also said that Ant Group's <a href=\"https:\/\/www.theblockcrypto.com\/linked\/95606\/tencent-ant-banks-webank-mybank-digital-yuan-pilot-report\" data-v-f87c67ca=\"\">Mybank<\/a> has now been added as the seventh e-CNY issuer while Tencent's WeBank has yet to be activated.","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Digital Currency\/Electronic Payment (DC","content":"ORGANIZATION"},{"type":"WeBank","content":"ORGANIZATION"},{"type":"Commercial Bank of China (ICBC","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Tencent","content":"ORGANIZATION"},{"type":"Chengdu","content":"LOCATION"},{"type":"CLS","content":"ORGANIZATION"},{"type":"ICBC","content":"ORGANIZATION"},{"type":"Ant Group","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"April","content":"DATE"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Wolfie Zhao","The Block"]}