{"summary":"Ethereum-based lending protocol Aave has raised $3 million in a sale of the protocol’s LEND token\nFramework Ventures and Three Arrows Capital participated in the token purchase \nAave plans to roll out a series of new initiatives, including a governance system, a new liquidity provider reward mechanism, and migrating LEND to AAVE","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/71559\/defi-lending-protocol-aave-raised-3-million-from-framework-ventures-and-three-arrows-capital","publishDate":"2020-07-15T11:00:11","id":2422,"type":null,"title":"DeFi lending protocol Aave raised $3 million from Framework Ventures and Three Arrows Capital","category":["Ethereum"],"content":["<span data-v-f87c67ca=\"\">Aave, an Ethereum-based lending protocol, has raised $3 million from Framework Ventures and Three Arrows Capital through a token sale, The Block has learned.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The two funds purchased around 30 million of Aave’s native token, LEND, at $0.10 apiece, which together are now worth around $7 million.&nbsp;<\/span><span data-v-f87c67ca=\"\">Separately, investment fund ParaFi also holds around $4.5 million worth of LEND, which they accumulated through market purchase and a token sale with the Aave team, according to ParaFi partner Santiago Roel Santos and Aave CEO Stani Kulechov.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We believe there will be a significant market shift of private borrow\/lend activity moving to decentralized money market protocols. Aave stands to significantly benefit from this underlying shift,” Framework Ventures partner Michael Anderson stated.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Indeed, the launch of lending protocol Compound’s governance token has triggered a wellspring of interest around DeFi applications. The total value locked on the protocol jumped from $90 million when the governance tokens were first distributed to $695 million as of the time of writing. Aave, which also offers lending products, has also seen growth in demand for both borrowing and lending.<\/span>","<span data-v-f87c67ca=\"\">Along with the new investment, Aave is also unveiling several new features the team is preparing to deploy. According to Kulechov, the team plans to test its governance smart contract within the next two weeks, which will allow users to participate in the protocol’s on-chain governance process and vote on proposals.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">LEND, which was first issued in 2017 via an initial coin offering, will also migrate to AAVE, along with a new reward system that will compensate liquidity providers and incentivize AAVE holders to stake their tokens for an insurance fund. The fund will be built on top of market-making protocol Balancer as an 80% AAVE\/20% ETH pool. Stakers will be able to receive rewards from both Aave and Balancer.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Additionally, the protocol also plans to deploy the new Credit Delegation functionality on the protocol, letting lenders and borrowers negotiate credit-based loans and execute via Aave’s platform.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Three Arrows and Framework will be substantial partners as they will increase our institutional exposure for liquidity and help us to expand Credit Delegation within the OTC lending and borrowing space. Previously 3AC\/Framework has been helping us with our Aavenomcis and they will both participate in the Aave governance after we move towards decentralization during the upcoming months,” said Kulechov.&nbsp;<\/span>"],"hashtag":["AAVE","ETHEREUM","LENDING"]}