{"summary":"The hacker who exploited Platypus only made off with a small portion of the initially stolen funds.\nBlockchain security firm BlockSec found a loophole in the attacker’s contract and called back $2.4 million into Platypus’ address with an upgrade proxy implementation.","author":["Jeremy Nation","Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/212966\/platypusdefi-salvages-2-4-million-in-hacked-funds-with-blocksecs-help","publishDate":"2023-02-17T15:13:15","id":2424,"type":null,"title":"Platypus salvages $2.4 million in hacked funds with BlockSec&#x27;s help","category":["Crypto Ecosystems"],"content":["After the Platypus protocol was hacked yesterday, at least $2.4 million in USDC stablecoin was returned to the exploited platform with help from blockchain security firm BlockSec.","<span data-v-f87c67ca=\"\">Of the almost $9.1 million in stolen funds from Platypus, it was <\/span><a href=\"https:\/\/twitter.com\/i\/web\/status\/1626427932314054656\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">revealed<\/span><\/a><span data-v-f87c67ca=\"\"> that the attacker could only cash out $270,000, according to MetaSleuth, a visualization tool from Blocksec.<\/span>","Some $8.5 million of stolen funds are frozen in the <a href=\"https:\/\/t.co\/ovF8pqVO4R\" data-v-f87c67ca=\"\">contract<\/a> they were transferred to, and another $380,000 from a second attempted exploit were <a href=\"https:\/\/snowtrace.io\/tx\/0x919266aa66d7c9a6af02dead5effc1cc68ab7b87890b52e5fc1e20a7041aa84d\" data-v-f87c67ca=\"\">accidentally<\/a> sent back to Aave, on-chain data show.","<span data-v-f87c67ca=\"\">Retrieving a portion of the stolen funds for Platypus revolved around BlockSec’s plan to take advantage of a loophole in the attacker’s contract.<\/span>","<span data-v-f87c67ca=\"\">“By leveraging this loophole, the project can transfer the funds from the attacker contract to the project's account,” Yajin Zhou, co-founder of BlockSec told The Block.<\/span>","<span data-v-f87c67ca=\"\">\"The project recovered $2 million using the proof of concept provided by us. This was to recover the funds in the attacker's contract,” according to Zhou, who added that some $8 million in assets were stranded since the attacker contract lacks a transfer function.<\/span>","<span data-v-f87c67ca=\"\">To get back the crypto, BlockSec used a callback function in the attacker’s contract.<\/span>","<span data-v-f87c67ca=\"\">\"The attack was launched through the flash loan callback interface in the attack contract. This callback function has no access control. And during this callback function, the attacker hardcoded the logic to approve USDC to the project’s contract (which is a proxy),” Zhou noted.<\/span>","<span data-v-f87c67ca=\"\">“So the project can first invoke the callback function in the attacker contract to approve USDC to the project’s contract. Then the project contract can withdraw the USDC from the attacker contract by upgrading the proxy to a new implementation,\" said Zhou.<\/span>","<em data-v-f87c67ca=\"\">Correction: Updated to correct Platypus' formal name.&nbsp;<\/em>"],"hashtag":["ASSETS","HACKS","USDC"]}