{"summary":"The Hong Kong Monetary Authority said the second phase will delve deeper into select cases from the first phase.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282439\/hong-kong-launches-new-round-of-e-hkd-pilot-to-study-cbdc-programmability-tokenization","publishDate":"2024-03-14T05:42:49","id":2425,"type":null,"title":"Hong Kong launches new round of e-HKD pilot to study CBDC programmability, tokenization","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Hong Kong launched today the second phase of its e-HKD pilot to study the programmability, tokenization and atomic settlement associated with the central bank digital currency (CBDC) in trial, as the region continues to explore the possibility of wider CBDC adoption.<\/span>","<span data-v-f87c67ca=\"\">The Hong Kong Monetary Authority, the de facto central bank, said in a statement that it plans to explore new use cases and delve into “select pilots” from the first phase — which concluded in October 2023.<\/span>","<span data-v-f87c67ca=\"\">The HKMA noted that the <\/span><a href=\"https:\/\/www.hkma.gov.hk\/media\/eng\/doc\/key-information\/press-release\/2023\/20231030e3a1.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">first phase<\/span><\/a><span data-v-f87c67ca=\"\"> of the e-HKD pilot had studied domestic retail use cases for programmable payments, settlement of tokenized assets and offline payments.<\/span>","<span data-v-f87c67ca=\"\">On the wholesale CBDC front, the HKMA said that the enhanced e-HKD sandbox will also be supported by <\/span><a href=\"https:\/\/www.hkma.gov.hk\/eng\/news-and-media\/press-releases\/2024\/03\/20240307-5\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Project Ensemble<\/span><\/a><span data-v-f87c67ca=\"\">, a new wCBDC project it launched earlier this month. The pilot plans to “accelerate the prototyping, development and testing of use cases by pilot participants, as well as facilitate the study of interoperability and interbank settlement between e-HKD and other forms of tokenized money,” the HKMA added.<\/span>","<span data-v-f87c67ca=\"\">The second phase of the e-HKD pilot is expected to last until mid-2025, according to the HKMA’s pilot <\/span><a href=\"https:\/\/www.hkma.gov.hk\/eng\/key-functions\/international-financial-centre\/fintech\/research-and-applications\/central-bank-digital-currency\/#pilot\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">page<\/span><\/a><span data-v-f87c67ca=\"\">. The government is accepting applications from organizations interested in participating in the second-phase pilot until May 17.<\/span>","<span data-v-f87c67ca=\"\">Many major financial institutions and payment firms — including Alipay, Bank of China, HSBC, Hang Seng Bank, China Construction Bank, Industrial and Commercial Bank of China, Mastercard, Visa, Boston Consulting Group and ZA Bank — participated in the first phase of the e-HKD pilot.<\/span>","<span data-v-f87c67ca=\"\">The HKMA started to research CBDCs in 2017 and began placing greater emphasis on studying a potential e-HKD in 2021 at both wholesale and retail levels, according to its website.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"HSBC","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"May 17","content":"DATE"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Hong Kong Monetary Authority","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Hang Seng Bank","content":"ORGANIZATION"},{"type":"Commercial Bank of China","content":"ORGANIZATION"},{"type":"October 2023","content":"DATE"},{"type":"Bank of China","content":"ORGANIZATION"},{"type":"China Construction Bank","content":"ORGANIZATION"},{"type":"ZA Bank","content":"ORGANIZATION"},{"type":"Project Ensemble","content":"ORGANIZATION"},{"type":"Boston Consulting Group","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"HKMA","content":"ORGANIZATION"}],"hashtag":["CBDCS"],"authors":["Timmy Shen","The Block"]}