{"summary":"Avalanche-based DeFi protocol Trader Joe has raised $5 million in a token sale from Three Arrows Capital and other investors.\nThe project’s co-founders are anonymous and they said it helps them to build fast. ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/116439\/avalanche-defi-protocol-trader-joe-funding-three-arrows-capital","publishDate":"2021-09-02T08:01:36","id":2427,"type":null,"title":"Avalanche-based DeFi protocol Trader Joe raises $5 million in token sale","category":["Venture Capital"],"content":["Trader Joe, a decentralized finance (DeFi) protocol built on the Avalanche blockchain, has raised $5 million in a token sale.","Lead investors in the round include DeFiance Capital, GBV Capital, and Mechanism Capital, according to a statement shared with The Block by Trader Joe on Thursday. Other backers include Three Arrows Capital, the Avalanche Foundation, Delphi Digital, <span data-v-f87c67ca=\"\">Coin98 Ventures, <\/span>Not3Lau Capital, and Aave founder Stani Kulechov.","With fresh capital at hand, <a href=\"https:\/\/www.traderjoexyz.com\/#\/trade\" data-v-f87c67ca=\"\">Trader Joe<\/a> plans to increase its current team of around 15 people to 20 in the near future, its anonymous co-founder \"0xMurloc\" told The Block. Another co-founder of the project is also anonymous who goes by \"Cryptofish.\"","When asked why they are anonymous, 0xMurloc said it allows them to build fast. \"Compared to typical tech startups, we don't need to spend time incorporating LLCs, etc.,\" they said. \"We disclose to our partners when necessary.\"","Trader Joe went live in July and is <a href=\"https:\/\/defillama.com\/chain\/Avalanche\" data-v-f87c67ca=\"\">already ranked second<\/a> in the Avalanche DeFi ecosystem in terms of total value locked or TVL after Benqi Finance, according to tracker DefiLlama.","The platform currently has a TVL of around $460 million. Its <a href=\"https:\/\/www.coingecko.com\/en\/coins\/joe\" data-v-f87c67ca=\"\">token, JOE, is live<\/a> and is currently trading at around $2, according to CoinGecko, putting it <a href=\"https:\/\/www.coingecko.com\/en\/categories\/avalanche-ecosystem\" data-v-f87c67ca=\"\">sixth<\/a> by market cap in the Avalanche ecosystem.&nbsp;","When asked what is Trader Joe's competitive edge, 0xMurloc said the platform offers \"the best user experience\" and \"widest selection\" of tokens to trade. Trader Joe currently offers a decentralized trading platform. 0xMurloc said a lending platform will also be launched \"soon.\"","Three Arrows Capital co-founder Kyle Davies confirmed the firm's investment in Trader Joe but declined to comment further.","Darryl Wang, portfolio manager at DeFiance Capital, which is a sub-fund of Three Arrows Capital, said the Trader Joe team is \"one of the top teams in the Avalanche ecosystem\" and that the project could become \"the dominant DeFi platform on Avalanche.\"","DeFi activity on blockchains beyond Ethereum, such as Solana and Avalanche, is increasing. Ethereum-based DeFi protocols currently have a total combined TVL of <a href=\"https:\/\/defipulse.com\/\" data-v-f87c67ca=\"\">over $93 billion<\/a>, according to DeFi Pulse. Solana-based projects have a total combined TVL of <a href=\"https:\/\/defillama.com\/chain\/Solana\" data-v-f87c67ca=\"\">over $3.5 billion<\/a>, and Avalanche-based projects have a total combined TVL of <a href=\"https:\/\/defillama.com\/chain\/Avalanche\" data-v-f87c67ca=\"\">over $2 billion<\/a>, according to DefiLlama.","\"There remains a lot of room for growth within the Avalanche ecosystem,\" said Andrew Kang, co-founder of Mechanism Capital. \"Mechanism is looking forward to supporting Trader Joe to take a position at the center of that ecosystem by becoming the premier financial services and trading venue.\"","Trader Joe plans to continue focusing on Avalanche, said Cryptofish, when asked if the project will support other blockchains in the future."],"hashtag":["AVALANCHE","THREE ARROWS CAPITAL"]}