{"summary":"DeFi protocol Compound recently closed a $25 million Series A\nThe funding round is backed by Andreessen Horowitz, Paradigm, Bain Capital Ventures, and Polychain Capital\nThe company said it doesn’t have a clear business model yet, although the staggering size of this Series A will sustain the company before it takes up significant market share","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/47158\/a16z-paradigm-back-compounds-25m-series-a-to-integrate-with-crypto-exchanges-and-brokers","publishDate":"2019-11-14T12:00:19","id":2428,"type":null,"title":"a16z, Paradigm back Compound&#x27;s $25M Series A to integrate with crypto exchanges and brokers","category":["DeFi"],"content":["Compound, the decentralized finance (DeFi) lending protocol, just raised a staggering $25 million Series A led by Andreessen Horowitz, with participation from Bain Capital Ventures, Polychain Capital, Paradigm, and others.&nbsp;","The San Francisco-based company was able to convince these top-tier investors that the future of DeFi may rely on integrating with existing crypto-trading infrastructure, Compound founder Robert Leshner told The Block.","Specifically, Compound is hoping to partner with companies such as exchanges, brokers and custodians to help expand their business lines into lending. Instead of developing a lending unit from scratch, these firms can use and improve on Compound's protocol to suit their own needs, According to Leshner.&nbsp;","The crypto trading market's appetite for lending is growing.&nbsp;Blockchain.com just <a href=\"https:\/\/www.theblockcrypto.com\/post\/47054\/as-credit-concerns-loom-in-crypto-blockchain-com-secretly-builds-multi-million-dollar-loan-desk\" data-v-f87c67ca=\"\">unveiled<\/a> its lending desk on Thursday, after operating in stealth for several months. The firm has already lent, traded or borrowed over $1.6 billion worth of cryptocurrency. Crypto prime broker Tagomi also <a href=\"https:\/\/www.theblockcrypto.com\/post\/39574\/crypto-broker-tagomi-launches-lending-and-borrowing-services-to-facilitate-short-selling\" data-v-f87c67ca=\"\">rolled out<\/a> its lending services recently in response to client demand.&nbsp;","Leshner said Compound has yet to figure out a viable business model. However, the handsome Series A funding will sustain the company before it achieves significant market share.&nbsp;","\"In some ways, I think of us similar to Google, which is nobody asks Google what its business model is because it developed [the business model] after it achieved significant market share,\" said Leshner.&nbsp;","Compound <a href=\"https:\/\/medium.com\/compound-finance\/compound-raises-8-2-million-to-create-money-markets-for-crypto-assets-6dfa593f8e5e\" data-v-f87c67ca=\"\">raised<\/a> an $8.2 million seed round in 2018 led by Andreessen Horowitz, Bain Capital Ventures, and Polychain Capital. Its protocol now <a href=\"https:\/\/compound.finance\/markets\" data-v-f87c67ca=\"\">has over $130 million<\/a> in total loan supply.&nbsp;"],"hashtag":[]}