{"summary":"Coinbase is facing an investigation into whether it illegally listed unregistered securities, according to Bloomberg.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/159593\/the-sec-is-investigating-coinbase-over-its-coin-listings-bloomberg","publishDate":"2022-07-25T22:42:01","id":2429,"type":null,"title":"The SEC is investigating Coinbase over its coin listings: Bloomberg","category":["EXCHANGES"],"content":["The US Securities and Exchange Commission&nbsp; (SEC) is investigating Coinbase for improperly allowing trading in several tokens that should have been registered as securities, according to a report from <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-07-26\/coinbase-faces-sec-investigation-over-cryptocurrency-listings?sref=PFCuwcPr&amp;utm_content=business&amp;utm_medium=social&amp;cmpid=socialflow-twitter-business&amp;utm_campaign=socialflow-organic&amp;utm_source=twitter\" data-v-f87c67ca=\"\">Bloomberg<\/a>.","Coinbase has been in the regulator's crosshairs after a former employee and two of his associates last week were <a href=\"https:\/\/www.theblock.co\/post\/158960\/former-coinbase-product-manager-arrested-on-insider-trading-charges\" data-v-f87c67ca=\"\">arrested<\/a> for alleged wire fraud. The SEC filed a parallel complaint alleging insider trading, over which it has purview if the alleged crime involves securities. But the SEC's enforcement investigation into Coinbase predates the agency's investigation that led to the insider trading charges, according to Bloomberg, which cites unnamed sources.&nbsp;","Coinbase declined to comment on the possible enforcement investigation.&nbsp;","The debate over which cryptocurrencies should be regulated as securities has been ongoing for years. As part of the insider trading case revealed last week, the SEC took a bold step by calling <a href=\"https:\/\/www.theblock.co\/post\/158973\/sec-lists-nine-crypto-tokens-as-securities-following-coinbase-insider-trading-charges\" data-v-f87c67ca=\"\">nine cryptocurrencies<\/a> — seven of which are currently listed by Coinbase — securities.&nbsp;","In a July 21 <a href=\"https:\/\/blog.coinbase.com\/coinbase-does-not-list-securities-end-of-story-e58dc873be79\" data-v-f87c67ca=\"\">blog post<\/a>, Coinbase was adamant that it does not list securities. \"Coinbase has a rigorous process to analyze and review each digital asset before making it available on our exchange — a process that the SEC itself has reviewed,\" Coinbase Chief Legal Officer Paul Grewal wrote in the post. \"But instead of having a dialogue with us about the seven assets on our platform, the SEC jumped directly to litigation.\"&nbsp;","\"This is the exact topic for which we recently submitted a petition for rulemaking to the SEC. In that petition, we highlight the need for clarity around regulation of crypto securities,\" a Coinbase spokesperson told The Block.&nbsp;&nbsp;","SEC Chair Gary Gensler has long <a href=\"https:\/\/www.theblock.co\/linked\/117651\/elizabeth-warren-and-gary-gensler-place-coinbase-in-oversight-crosshairs\" data-v-f87c67ca=\"\">argued<\/a> that many cryptocurrencies are in fact unregistered securities but has faced pushback from the industry and from fellow regulator, the Commodity Futures Trading Commission, which has <a href=\"https:\/\/www.theblock.co\/post\/159098\/cftc-commissioners-speak-up-after-sec-files-crypto-insider-trading-case\" data-v-f87c67ca=\"\">called for<\/a> more cooperation among agencies in regulating the crypto industry.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"July 21","content":"DATE"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"US Securities and Exchange Commission&nbsp; (SEC","content":"ORGANIZATION"},{"type":"Paul Grewal","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":["COINBASE"],"authors":["Madhu Unnikrishnan","The Block"]}