{"summary":"Trading activity across spot markets increased in June as institutional and regulatory actions brought more volatility to markets.","author":["Brian McGleenon","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237787\/crypto-exchange-spot-trading-volumes-rose-16-in-june-ccdata","publishDate":"2023-07-05T08:47:41","id":2431,"type":null,"title":"Crypto exchange spot trading volumes rose 16% in June: CCData","category":["Markets"],"content":["Spot trading volume on centralized exchanges increased by 16.4% in June, hitting $575 billion.","The increase marked the first rise in three months, according to Wednesday's <a href=\"https:\/\/ccdata.io\/reports\/exchange-review-june-2023?mc_cid=df63bd7caa&amp;mc_eid=7fb1e1418f\" data-v-f87c67ca=\"\">CCData's Monthly Exchange Review<\/a>. The combined trading volume of spots and derivatives on centralized exchanges rose 14.2% to $2.7 trillion in June. ","\"The increase in volatility following the SEC’s lawsuit against Binance.US and Coinbase, and the positive outlook in the market following the filing of spot Bitcoin ETFs by the likes of BlackRock and Fidelity, contributed to an increase in trading activity last month,\" the report stated.","For the fourth month in a row, Binance's spot trading market share dropped, hitting 41.6% in June, its lowest point since August 2022, the report claimed. Binance's derivatives market share also took a hit, falling to 56.8% in June, its lowest point since October 2022.","Although <a href=\"https:\/\/www.theblock.co\/post\/237759\/binance-to-suspend-transfers-of-several-tokens-tied-to-multichain-following-may-incident\" data-v-f87c67ca=\"\">Binance<\/a> still dominates as the leading platform for crypto derivatives trading, OKX observed its trading volumes rose by 44.9% to $416 billion in June, now holding 19.5% of the derivatives trading market — a record high not seen since April 2022.","In the U.S., Coinbase dominates, holding 61% of Bitcoin trading volumes. However, U.S. exchanges only account for 9.49% of total global BTC trading volumes, meaning <a href=\"https:\/\/www.theblock.co\/post\/237539\/coinbase-shares-surge-after-wide-range-of-etf-partnerships-revealed\" data-v-f87c67ca=\"\">Coinbase<\/a> contributes only 5.83% of global BTC trade volume.","In June, derivatives volume on the <a href=\"https:\/\/www.theblock.co\/post\/237552\/number-of-large-holders-in-cme-bitcoin-options-is-surging\" data-v-f87c67ca=\"\">CME<\/a> exchange increased, jumping 23.6% to $48.3 billion. BTC futures attracted major interest, with volumes surging 28.6% to $37.9 billion. ETH futures trade volume also rose 9.93% to $8.91 billion.","\"The increase in BTC futures volume over the last couple of months highlights the heightened trading activity by institutional entities as the markets speculate over the SEC’s decision on the multiple spot Bitcoin ETFs filings, \" the report added."],"hashtag":[]}