{"summary":"The Block is delighted to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley (@stephendpalley) and Nelson M.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/2330\/crypto-caselaw-minute-week-of-10-21-18","publishDate":"2018-10-28T10:05:38","id":2435,"type":null,"title":"Crypto Caselaw Minute (Week of 10.21.18)","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">The Block is delighted to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@NelsonMRosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full.<\/em>","Alibaba and the forty thieves, it ain’t over until cake’s been served, and bad things happen to you if you use the SEC logo on your token sale website. These topics (and more) in today’s Crypto Caselaw Minute. (As always, Palley summaries are “SDP” and Rosario summaries are “NMR”).","<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">These summaries are provided for educational purposes only. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. And we might change our minds. We contain multitudes.<\/em>","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\"><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Berk v. Coinbase, Inc.<\/em>, 18-cv-01364-VC (N.D. Cal., 10\/23\/2018)[SD<\/strong><strong data-v-f87c67ca=\"\">P]<\/strong>","This lawsuit arises out of the launch of Bitcoin Cash (“BCH”) by Coinbase on its GDAX trading platform in December 2017. BCH was created following a “hard fork” of Bitcoin earlier that year. In short, if you owned bitcoin at the time of the fork, you also owned BCH. Coinbase initially said it wouldn’t support BCH. It then changed its mind and listed it. This lawsuit — a putative class action — takes issue with the process by which Coinbase listed BCH, and accuses the exchange of tipping off insiders in advance, and given them an unfair advantage.","The Order here doesn’t get to the truth of Plaintiffs’ allegations — that is, whether or not anyone tipped off anyone else. Rather, the Court focuses on three legal issues in the context of initial motion practice.","First, Coinbase moved to compel arbitration of Plaintiffs claims, based on an arbitration clause in the Coinbase user agreement. Why did it do this? You can’t arbitrate a class action — by moving to arbitration, the risk of this lawsuit is mostly defanged. Businesses often prefer arbitration too because it’s private. Whether or not a defendant gets a fairer shake in arbitration as opposed to a judge or jury isn’t quite as clear, but it’s conventional defense counsel wisdom. In any event, the judge denied the motion to compel arbitration because the claims didn’t arise out of the contract but were focused instead on “assessing whether Coinbase might have engaged in market manipulation or unfair business practices [which] does not require reference to the underlying agreement or interpretation of the parties’ contractual relationship.” (internal quotation marks and citation omitted).","Second, Coinbase’s motion to dismiss was granted but with leave to amend the complaint in 21 days (except for a CEA claim, which I’ll discuss below). Basically, the Court says that the claims as pleaded are too vague. For example, a negligence claim against Coinbase doesn’t specify what duty exactly Coinbase had to the Plaintiff or (putative) class members. (NB — all class actions when filed are putative, or “supposed”; it’s not until a court certifies a class action that they become un-putative, and actual class actions). I’m personally skeptical of the negligence claims — you usually don’t find a duty in tort arising out of a purely contractual relationship unless there is some special relationship (doctor, lawyer, engineer etc.) But we’ll see what they come up with in three weeks, and there are other state law claims as well.","Third, the Court dismissed *with prejudice* a claim purporting to arise out of the Commodities Exchange Act (“CEA”). While a private right of action might exist under the CEA, it only arises if there’s a futures contract at issue. Here, there’s no futures contract. The Court says that claims of fraud\/manipulation related to spot market virtual currency trades under the CEA can only be asserted by the CFTC in an enforcement action and the Plaintiff here isn’t the CFTC.","Note — a dismissal without prejudice of the other claims means that this case isn’t over. In the Alibaba Coin case, which Nelson discusses today, the Plaintiffs’ claims were also dismissed at first&nbsp;… after refiling they won a Preliminary Injunction. So CB may have won a battle, but they lost a key motion along the way on arbitration, and the war isn’t over yet.","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\"><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">SEC v. Blockvest<\/em>, 2018 U.S. Dist. LEXIS 179424 (S.D. Cal., 18-cv-2287, 10\/5\/2018)[SDP]<\/strong>","We’ve talked some in prior posts about temporary restraining orders (“TRO”). They are a form of “injunctive” relief — the Court can order someone to stop doing something (selling illegal securities, spending money\/selling assets, using the SEC logo).","If a private litigant — e.g., you or me — does this, we almost always have to provide notice to the other side and (usually) post a bond, which acts as a security for payment of damages to the other side if the TRO shouldn’t have been entered, which does happen from time to time.","If you’re the SEC, you can sometimes get an order “ex parte”, or without notice to the other side, and can do so without posting a bond.","That’s what happened here.","According to the order, this “enforcement action is prompted by the Defendants’ offer and sale of alleged unregistered securities” known as BLVs, which were offered in an initial coin offering in exchange for Bitcoin and Ether. The SEC alleges that the offering violates the registration requirements of the Securities Act and also constitutes Securities Fraud under Securities Act and the Exchange Act.","First, as to the registration violations, Blockvest filed a reg D exemption form which allows an exemption from registration requirements for accredited investors if “the company takes reasonable steps to verify” that status. The SEC alleges that Blockvest took no such steps and, furthermore, its website claims that “it can offer securities to unaccredited investors all over the globe.”","The website also claims it is “Reg A+ compliant” and can offer securities to unaccredited investors “all over the globe”. The problem is that&nbsp;… it didn’t actually file a Reg A offering statement with the SEC. On this basis, the Court had that the SEC had demonstrated a prima facie violation of the Securities registration requirements (sections 5(a) and 5(c) to be specific.","Second, as to securities fraud violations, the court found “numerous material misrepresentations” including — and this is hard to believe, but they have screenshots of the website — use of the SEC and CFTC seals and the logos of companies like Deloitte and others, to (per the Court) “create a false appearance of legitimacy for the Blockvest ICO.” They even allegedly created a fake regulator, called the “BEC”, which “adopted the SEC seal”, mission statements, address and link to the SEC website.","Third, the Court agreed that the TRO should be entered without notice, noting that “Plaintiff’s counsel states that the Court should consider this ex parte TRO without prior notice to Defendants due to immediate and irreparable injury if Defendants are made aware of the TRO application. Because Defendants have violated and continue to violate the antifraud provisions of the federal securities laws, if they become aware of the ex parte application, they will likely continue their fraudulent conduct by dissipating funds or placing them beyond the reach of the Court. This concern is heightened because the case concerns digital assets which can be transferred or secreted instantly and are difficult to trace.”","Of all of the really bad ideas in the world of token sales and ICOs, one of the worst has to be launching a token sale in the US with the SEC and CFTC logos on your website. If there’s a Darwin Awards for token sales, this one might get a nomination.","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\"><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Alibaba Group Holdings v. AlibabaCoin Foundation<\/em>, 2018 U.S. Dist. LEXIS 180884 (S.D.N.Y., 18-cv-2897, 10\/22\/2018)[NMR]<\/strong>","As a general rule you want your business to have a unique name. There are lots of reasons for this. If that isn’t possible, you usually don’t want to name your business the same thing as another business, and certainly not one of the largest businesses on the planet. Massive multi-national corporations tend to notice those sorts of things, and that is what brings us to Alibaba v. AlibabaCoin.","This lawsuit is ultimately based on a claim brought under the Lanham Act, the federal law that covers trademarks, trademark infringement, false advertising, and the like. Alibaba Group (&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">i.e.<\/em>&nbsp;the world’s largest online and mobile commerce company based in Hangzhou, China) brought the suit against AlibabaCoin Foundation and others, which is a group based out of Dubai and Belarus alleging unlawful use of Alibaba’s trademarks and symbols to promote AlibabCoin. Now, the astute reader may be thinking, “why is this lawsuit being brought in a New York federal court?” Well, for the non-lawyers in the group allow me to introduce you to the only thing I liked about my civil procedure class: personal jurisdiction.","This particular opinion and order grants Alibaba Group a preliminary injunction against AlibabaCoin. Doesn’t a court need jurisdiction to do that? Yes. We’ve written before about when it is proper for a court to exercise jurisdiction over a defendant and as always it depends on the law and facts and circumstances. As a general rule, federal courts have limited jurisdiction meaning they can only here certain matters. Here, Alibaba has trademarks in the US and probably literally every other country on Earth, and so the&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">subject matter&nbsp;<\/em>of the case is well within the court’s purview, but the issue in this preliminary injunction order is whether it makes sense for a New York court to hear a case dealing with a Chinese company and a Dubai\/Belarus company. Turns out, yes, it does make sense in the court’s opinion.","To exercise personal jurisdiction a court has to see minimum contact with the forum they are in charge of, and for purposes of this case that minimum contact was one AlibabaCoin purchaser in New York state that engaged in three transactions. Now you may think this isn’t enough, but Alibaba also presented evidence that over 1,000 New York users visited AlibabaCoin’s website by mid-June 2018. In the court’s eyes, this “established a reasonable probability that the transactions at issue here are not isolated instances, ‘but rather a part of a larger business plan’ that involves the purposeful marketing and sale of AlibabaCoin to, among others, New York consumers.” [SDP notes that the Court initially dismissed the case with “leave to amend” and to allow the Plaintiff to properly allege personal jurisdiction, which they did — so it ain’t over until it’s over; cf.&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Berk&nbsp;<\/em>above]","AlibabaCoin put forward a somewhat fun, but fruitless, defense against this by arguing that the transactions did not occur in the US, because the ledger entries were made in Minsk, Belarus. The court was not impressed by this argument and likened it to arguing that an online purchase takes place at whatever remote server location that processes the purchaser’s bank activities, and not where the person clicking the button is actually clicking the button.","One more final point worth considering is that AlibabaCoin claims to have put in place measures to prevent US consumers from purchasing their crypto, and according to them this means personal jurisdiction is not valid, because there would be no irreparable harm involved since no one in the US will be buying. This argument did not fly, because as the court explains in a footnote “even if AlibabaCoin is not sold to United States consumers — a proposition that in any event contradicts the present record — those consumers’ exposure to online advertising likely to create brand confusion could affect their willingness to purchase from or invest in Alibaba, the party that claims injury.” Once again, unique names are good.","* Picture credit:&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/pixabay.com\/en\/camels-sunrise-travel-desert-sand-1149803\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\" data-href=\"https:\/\/pixabay.com\/en\/camels-sunrise-travel-desert-sand-1149803\/\" data-v-f87c67ca=\"\">https:\/\/pixabay.com\/en\/camels-sunrise-travel-desert-sand-1149803\/<\/a>; license (<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/pixabay.com\/en\/service\/terms\/#usage\" target=\"_blank\" rel=\"noopener nofollow noreferrer\" data-href=\"https:\/\/pixabay.com\/en\/service\/terms\/#usage\" data-v-f87c67ca=\"\">CC0 Creative Commons<\/a>)","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BCH","content":"ORGANIZATION"},{"type":"the Court","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"December 2017","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"AlibabaCoin","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Blockvest","content":"PERSON"},{"type":"SDP","content":"ORGANIZATION"},{"type":"Nelson","content":"ORGANIZATION"},{"type":"CEA","content":"ORGANIZATION"},{"type":"Alibaba Group (","content":"ORGANIZATION"},{"type":"Minsk","content":"LOCATION"},{"type":"Stephen Palley","content":"PERSON"},{"type":"AlibabaCoin Foundation","content":"ORGANIZATION"},{"type":"Berk v. Coinbase, Inc.","content":"ORGANIZATION"},{"type":"2018 U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Alibaba Group","content":"ORGANIZATION"},{"type":"S.D. Cal.","content":"LOCATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Belarus","content":"LOCATION"},{"type":"ICOs","content":"ORGANIZATION"},{"type":"Hangzhou","content":"LOCATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Palley","content":"PERSON"},{"type":"2897","content":"DATE"},{"type":"Blockvest ICO","content":"ORGANIZATION"},{"type":"Darwin Awards","content":"ORGANIZATION"},{"type":"Dubai","content":"LOCATION"},{"type":"Securities","content":"ORGANIZATION"},{"type":"N.D. Cal.","content":"LOCATION"},{"type":"BEC","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Rosario","content":"PERSON"},{"type":"Alibaba Coin","content":"ORGANIZATION"},{"type":"Earth","content":"LOCATION"},{"type":"Alibaba Group Holdings v. AlibabaCoin Foundation","content":"ORGANIZATION"},{"type":"mid-June 2018","content":"DATE"},{"type":"2287","content":"DATE"},{"type":"Alibaba","content":"ORGANIZATION"},{"type":"TRO","content":"ORGANIZATION"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"cf.&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Berk","content":"PERSON"},{"type":"Deloitte","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"Alibaba v. AlibabaCoin","content":"ORGANIZATION"}],"hashtag":["COINBASE"],"authors":["Contributor Network","The Block"]}