{"summary":"A total of 114,454 participants committed 10.18 million BNB ($2.4 billion) to participate in the Arkham public sale.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240207\/users-locked-2-4-billion-binance-arkham-token-public-sale","publishDate":"2023-07-18T05:59:02","id":2438,"type":null,"title":"Users locked $2.4 billion on Binance to participate in Arkham token public sale","category":["CRYPTO ECOSYSTEMS"],"content":["Crypto exchange Binance wrapped up the public sale of ARKM tokens for Arkham Intelligence, a provider of on-chain analytics. The public sale, hosted on Binance Launchpad, reached its hard cap of $2.5 million. Notably, the&nbsp;sale elicited a high level of interest from investors, resulting an oversubscription by 990 times, according to <a href=\"https:\/\/www.binance.com\/en\/support\/announcement\/binance-completes-the-arkham-subscription-launchpad-and-will-open-trading-for-arkm-bd7486abdcbc4099b7ce6fb484052e05\" data-v-f87c67ca=\"\">figures<\/a> released by Binance.","The total token supply for Arkham is 1 billion ARKM, of which 50 million were allocated to the Binance Launchpad, accounting for 5% of the total supply at a pre-determined sale price of $0.05.","Given it had a hard cap of $2.5 million, the sale used a subscription format, where Binance tracked users’ BNB balances over a six-day period starting from July 11. The final allocation of tokens for each user was determined based on their average BNB balance during this period.","A total of 114,454 participants committed 10.18 million BNB ($2.4 billion) during the subscription period.","The final conversion rate for the sale was 4.92 ARKM tokens per BNB. This meant that users who committed 50 BNB during the subscription were allotted 246 ARKM tokens to purchase (at the sale price of $0.05), <a href=\"https:\/\/www.binance.com\/en\/support\/announcement\/binance-completes-the-arkham-subscription-launchpad-and-will-open-trading-for-arkm-bd7486abdcbc4099b7ce6fb484052e05\" data-v-f87c67ca=\"\">according to<\/a> Binance.&nbsp;","Binance announced that it would commence trading of ARKM tokens on its platform at 8 a.m. ET today.","Meanwhile, ARKM tokens can also be <a href=\"https:\/\/etherscan.io\/address\/0x08c7676680f187a31241e83e6d44c03a98adab05\" data-v-f87c67ca=\"\">claimed<\/a> as an airdrop by early Arkham users, separate from the Binance launch. These were allocated to early Arkham users. At the time of writing, ARKM is trading at <a href=\"https:\/\/www.coingecko.com\/en\/coins\/arkham#markets\" data-v-f87c67ca=\"\">$0.65<\/a> on the Uniswap decentralized exchange, which is 13 times its public sale price.","Arkham Intelligence operates as a blockchain analytics platform, facilitating the anonymous exchange of data related to the owners of blockchain addresses. The token sale was preceded by Arkham’s plan to launch an on-chain intelligence exchange, enabling users to anonymously buy and sell data related to the owners of blockchain addresses.","The platform, named “Arkham Intel Exchange,” will serve as a decentralized protocol for the purchase and sale of data and wallet labels, according to its <a href=\"https:\/\/assets-global.website-files.com\/62879326fd745f7489b43224\/64abc4471879916bc4e2aeb0_Arkham_Whitepaper_FINAL.pdf\" data-v-f87c67ca=\"\">whitepaper<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Arkham Intel Exchange","content":"ORGANIZATION"},{"type":"July 11","content":"DATE"},{"type":"$2.5 million","content":"MONEY"},{"type":"1 billion","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Binance Launchpad","content":"LOCATION"},{"type":"$2.4 billion","content":"MONEY"},{"type":"Arkham Intelligence","content":"ORGANIZATION"},{"type":"Arkham","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"$0.65","content":"MONEY"},{"type":"$0.05","content":"MONEY"},{"type":"8 a.m. ET","content":"TIME"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}