{"summary":"“This is an important first step in crypto taking its rightful place at the adult’s table,” Bittrex&#x27;s Oliver Linch said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/261389\/uk-treasurys-crypto-asset-proposals-are-a-step-in-the-right-direction-bittrex-global-ceo-says","publishDate":"2023-11-03T10:15:59","id":2439,"type":null,"title":"UK Treasury&#x27;s crypto asset proposals are a &#x27;step in the right direction,&#x27; Bittrex Global CEO says","category":["REGULATION"],"content":["Bittrex Global CEO Oliver Linch said that while the crypto community may have its reservations, the UK Treasury's crypto asset regulation <a href=\"https:\/\/www.theblock.co\/post\/260020\/uk-treasury-releases-final-proposals-for-crypto-asset-regulation\" data-v-f87c67ca=\"\">proposals<\/a>, released earlier this week, are a step in the right direction, providing guidance the UK needs to become “a true hub for digital assets.”","Under the new proposals, the UK government aims to include various crypto asset activities within existing financial services laws, responding to the UK Treasury’s consultation on a regulatory regime for crypto assets.","“It’s the UK’s first significant move towards treating crypto as a viable, grown-up asset class in serving the needs of both institutional and retail investors, albeit one that has garnered a somewhat lukewarm response thus far,” Linch told The Block via email. “While the reception from within the crypto community has been muted, I think that’s unfair,” he added.","The Bittrex CEO is also a former Shearman &amp; Sterling solicitor with more than a decade of experience in deciphering and drafting regulatory policy — particularly in financial regulation.","Linch believes the UK’s proposed approach was realistically the most likely route, adding that there was a lot to be optimistic about. “People seem to be disappointed that the UK will not be adopting a big, showcase, stand-alone regulation like MiCA (in the EU), or the VARA Regulations (in Dubai), preferring instead to regulate crypto under existing markets legislation,” Linch said. “But there are many ways to skin a cat, and I’m more interested in substance than style.”","Linch welcomed the UK's apparent accelerated pace in implementing new rules, which promises to provide much-needed clarity and consumer protections. “Yes, these rules should have come before the recent changes to the Financial Promotions rules, but hopefully this is an indication that the government is now stepping up and providing that directional guidance that the UK needs if it is to become a true hub for digital assets,” he noted.","Incorporating crypto within existing regulatory frameworks could also inspire confidence among market participants, particularly large financial institutions, Linch added, suggesting that this familiarity could reduce the risk of legislative missteps and encourage institutional investment.","Finally, by including crypto in its general financial services legislative framework, “the UK government is signaling that it agrees with Bittrex Global’s view that the future of crypto is simply as another (albeit hugely important) part of the financial sector; this is an important first step in crypto taking its rightful place at the adult’s table,” Linch said.","The UK Treasury provided a detailed response to its consultation for crypto asset regulation, publishing its <a href=\"https:\/\/assets.publishing.service.gov.uk\/media\/653bd1a180884d0013f71cca\/Future_financial_services_regulatory_regime_for_cryptoassets_RESPONSE.pdf\" data-v-f87c67ca=\"\">final proposals<\/a> on Monday — informed by companies, experts and market events, \"including the failure of FTX.\"","The move would require firms engaging with UK retail consumers, regardless of their geographical location, to obtain authorization. The Financial Conduct Authority (FCA) would be responsible for authorizing these firms, which would also need to adhere to stringent requirements, including admission standards for crypto exchanges and mandatory disclosures for new asset listings.","The new proposals are in addition to the UK’s new <a href=\"https:\/\/www.theblock.co\/post\/233554\/fca-to-roll-out-stricter-rules-for-crypto-ads-including-referral-bonus-ban\" data-v-f87c67ca=\"\">crypto advertising rules<\/a>, regulated by the FCA, which came into effect on Oct. 8, and compliance requirements with the Financial Action Task Force's <a href=\"https:\/\/www.theblock.co\/post\/248638\/travel-rule-regulation-comes-into-force-in-the-uk-for-crypto-asset-firms\" data-v-f87c67ca=\"\">Travel Rule<\/a>, which began on Sept. 1.","Notably, the proposals left out regulations for decentralized finance (DeFi), with the UK Treasury acknowledging that it is too early and potentially ineffective to regulate DeFi at this stage.&nbsp;","“People love to whinge, but there is actually much to praise here,” Linch said. “Obviously, there is still detail to come, and a long way to go, but the UK has set out its stall.”","In June, UK Prime Minister Rishi Sunak expressed a desire to provide regulatory clarity regarding how crypto businesses should register and operate in the UK, <a href=\"https:\/\/www.theblock.co\/post\/234095\/a16z-uk-expansion\" data-v-f87c67ca=\"\">announcing<\/a> plans to turn the country into a web3 hub.","“There is much in the government’s response that suggests that this will be achieved in the UK, bringing the certainty that institutional investors and corporates will need to set up shop or relocate their operations, priming the UK to fulfill its ambition of becoming a much sought-after crypto hub,” Linch concluded.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"earlier this week","content":"DATE"},{"type":"FCA","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Sept. 1","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"Oct. 8","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Oliver Linch","content":"PERSON"},{"type":"UK","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Dubai","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"Linch","content":"PERSON"},{"type":"Rishi Sunak","content":"PERSON"},{"type":"UK Treasury","content":"ORGANIZATION"},{"type":"Financial Conduct Authority (FCA","content":"ORGANIZATION"},{"type":"Financial Action Task Force","content":"ORGANIZATION"},{"type":"Shearman &amp; Sterling","content":"ORGANIZATION"}],"hashtag":["FCA","UK PARLIAMENT"],"authors":["James Hunt","The Block"]}