{"summary":"The Global DeFi Coalition has put forward six proposals for regulating the DeFi sector.\nThe six trade bodies that make up the coalition represent more than 350 crypto firms globally.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/110506\/crypto-lobbyists-put-defi-proposals-to-fatf-in-open-letter","publishDate":"2021-07-05T12:20:26","id":244,"type":null,"title":"Crypto lobbyists put DeFi proposals to FATF in open letter","category":["DeFi"],"content":["A group of crypto lobby groups spread across the United Kingdom, Europe, the United States and Asia has called for “well-balanced” approaches to regulating the Decentralized Finance (DeFi) sector in an open letter to the Financial Action Task Force (FATF).","Addressing the FATF’s executive secretary David Lewis, the so-called “Global DeFi Coalition” has produced six guiding principles for governing DeFi organizations.","“It is crucial that the rapid growth of DeFi is well understood by authorities to adequately align their regulatory approaches to this space,” the group wrote in its letter.","They warn that a premature crackdown by regulators risks “stifling innovation and preventing new ideas from emerging” and have called for an open dialogue between industry and regulators through the medium of consultations and working groups.","“The letter aims to help authorities avoid potential pitfalls by providing regulatory recommendations by the industry,” the group added.","The coalition is comprised of ACCESS (Singapore), Bitcoin Association (Switzerland), Blockchain Association (U.S.), Blockchain for Europe (Europe), CryptoUK (U.K.), and the International Association for Trusted Blockchain Applications (INATBA). Together, these groups represent more than 350 companies.","The FATF <a href=\"https:\/\/www.theblockcrypto.com\/post\/109687\/fatf-defers-finalizing-its-crypto-guidance-until-october-industry-players-celebrate-short-term-win\" data-v-f87c67ca=\"\">recently revealed<\/a> that just 58 out of 128 reporting jurisdictions have adopted its standards for regulating crypto firms.&nbsp;","In its <a href=\"https:\/\/www.fatf-gafi.org\/publications\/fatfrecommendations\/documents\/second-12-month-review-virtual-assets-vasps.html\" data-v-f87c67ca=\"\">second 12-month review<\/a> of the progress made by national regulators, published July 5, the intergovernmental organization stated that “many jurisdictions have continued to make progress” implementing its revised standards — which make so-called Virtual Asset Services Providers (VASPs) subject to anti-money laundering (AML) and counter-terrorism financing (CTF) rules.","Of the 58 regulators that have adopted the standards, 52 are now regulating VASPs and six have banned such operators entirely. 70 jurisdictions are yet to act on the recommendations.","“These gaps in implementation mean that there is not yet a global regime to prevent the misuse of virtual assets and VASPs for money laundering or terrorist financing,” the FATF stated in a press release.","The FATF has, however, hailed progress in terms of introducing systems to help crypto firms implement its infamous ‘travel rule’ — which is technically still in draft form, with finalized guidance <a href=\"https:\/\/www.theblockcrypto.com\/post\/109687\/fatf-defers-finalizing-its-crypto-guidance-until-october-industry-players-celebrate-short-term-win\" data-v-f87c67ca=\"\">expected in October,<\/a> following a recent delay. The travel rule calls for VASPs to transmit originator and beneficiary information between one another for transactions of over $3,000.","<a href=\"https:\/\/www.theblockcrypto.com\/daily\/74889\/fatf-review-crypto-divide\" data-v-f87c67ca=\"\">The FATF’s 12-month review<\/a> of its guidance last year sparked concern in the DeFi industry by stating that jurisdictions uncomfortable with non-custodial wallets could ban exchanges that permit their use in peer-to-peer transactions. Why? Because as the Global DeFi Coalition points out in its letter, “DeFi protocols allow individuals to perform a variety of financial transactions electronically on a non-custodial basis without the participation of an intermediary.”","The coalition’s six proposals are outlined in full below."],"hashtag":[]}