{"summary":"More than 30 Ethereum projects have collaborated to launch MEV Blocker RPC, a tool designed to protect users from various MEV attacks.\nMEV Blocker RPC was jointly developed by CoW Swap along with two other firms operating in the MEV niche: Agnostic Relay and Beaver Build.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225023\/ethereum-projects-come-together-on-mev-blocker-rpc-launch-to-share-profits-with-users","publishDate":"2023-04-05T10:17:39","id":2440,"type":null,"title":"Ethereum projects come together on MEV Blocker RPC launch to share profits with users","category":["Crypto Ecosystems"],"content":["More than 30 Ethereum projects have collaborated to launch MEV Blocker RPC, a tool designed to protect users from various types of Maximal Extractable Value (MEV) attacks, including front-running and sandwich attacks.","The initiative brings together prominent names in the industry, such as CoW Swap, Beaver Build, Agnostic Relayer, EigenPhi, Builder0x69, ZeroMEV, Balancer, Gelato, Gnosis DAO, bloXroute, 1inch, Safe, Paraswap, and more.","Remote procedure call (RPC) services normally connect users to nodes that power a blockchain. But this MEV Blocker also offers the additional feature of protecting users from MEV.","The collaborative effort aims to address the growing problem of MEV in the Ethereum ecosystem, which puts users at risk of receiving unfavorable prices on trades, NFT purchases, ENS name registrations, and liquidity provisions due to MEV bot hijacking. Simply put, MEV creates more difficult economic conditions for on-chain users.&nbsp;","<span data-v-f87c67ca=\"\">MEV Blocker was jointly developed by decentralized exchange CoW Swap and two other firms operating in the MEV niche: Agnostic Relay and Beaver Build. <\/span>","<span data-v-f87c67ca=\"\">“At CoW Swap it’s our mission to put the user first, while CoW Swap offers the best protection for any on-chain swaps, there are also other transactions that suffer from MEV attacks. With MEVblocker we are offering a solution for everyone,” said Anna George, CEO of CoW Protocol.<\/span>","To better understand how MEV-Block works, it is important to define the exact nature of MEV.","MEV refers to the maximum potential value that can be extracted from a blockchain transaction, including arbitrage and front-running of user transactions. Usually, block builders on Ethereum capture the profits from MEV by determining the order of transactions and relaying it to Ethereum validators.","Searchers, a separate class of participants, support block builders in identifying opportunities for MEV from transactions. Together, these two groups create an order flow for transactions in bundles, which is then passed to validators using software called MEV-Boost to settle on the blockchain.","MEV Blocker RPC routes user transactions to a network of \"searchers\" instead of the public memory pool. These searchers bid for the right to backrun transactions while shielding users from front-running and sandwich attacks. The searchers create a backrun bundle, which is then merged with the original signature by the RPC and relayed to block builders and validators for execution on the network.","The tool submits bundles to all major block builders, such as Builder0x69, bloXroute, Blocknative, Flashbots, rsync builder, and Beaver Build. It provides searchers with a steady payment over time by offering access to a larger order flow.","MEV Blocker RPC returns at least 90% of the profits from winning bids to users and allocates 10% to validators as a reward. As a result, users are protected from malicious MEV attacks and may also profit from the arbitrage opportunities their transactions create – an advantage previously reserved for advanced Ethereum users.","MEV Blocker RPC is set to compete with existing RPC tools like Infura, Ankr, and Alchemy, as well as the in-development Flashbots' <a href=\"https:\/\/www.theblock.co\/post\/212491\/flashbots-introduces-mev-share-protocol\" data-v-f87c67ca=\"\">MEV share<\/a>, which also aims to protect users from MEV and share revenue with them."],"hashtag":["EXPLOITS"]}