{"summary":"BIT Digital&#x27;s Ha Duong explores how the theme of crypto scalability could evolve over the course of 2022 and beyond.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/133163\/outlook-2022-the-many-faces-of-crypto-scalability","publishDate":"2022-02-06T11:13:09","id":2443,"type":null,"title":"Outlook 2022: The many faces of crypto scalability","category":["OP-ED"],"content":["<i data-v-f87c67ca=\"\">Ha Duong is Principal at Ocean Investment and Director of Crypto Strategies at BIT Capital, based in Berlin. <\/i>","If 2020 was the year of DeFi and 2021 the year of NFTs, I believe 2022 will be the year that crypto scalability will show its many faces.","A lot of what has been happening over the past months has been driven by a debate about an increasing need for scalability in crypto networks. The near future will show alternative approaches to crypto scalability.","I also expect the design space of dApps to drastically expand once we have moved past the current evolution stage of crypto.","<b data-v-f87c67ca=\"\">From Ethereum killers to modular blockchains<\/b>","Since CryptoKitties first clogged the Ethereum network in 2017, many more situations have appeared that show how the current state of the main smart contract platform is not yet fit for mass adoption. The Scalability Trilemma shows how difficult it is to enhance scalability without compromising on other important dimensions such as decentralization &amp; security.","What is the crypto ecosystem actually trying to solve for?","In the most naive sense, developers and speculators are looking for solutions that provide the highest transaction throughput. One of the difficulties with scaling transaction throughput is that the demand for transactions is very volatile so the capacity needs to be able to scale up and down depending on network needs. Even the most optimized centralized networks show that sometimes a sudden spike in transaction demand can cause the whole network to stand still - as we have witnessed with exchange downtimes in crypto and with outages of major CDNs in the traditional tech world. The reason for that is that the physical world (chips for computing and short or long-term data storage) needs to supply what the digital world demands (as in fetching, sending, editing data) and the physical world will always move with slower speed - especially when global (physical) supply chains are already running at max capacity.","The interaction between physical and digital is quite relevant in the discussion of how crypto scalability will evolve in the future. Simply increasing block sizes for greater transaction throughput requires more powerful hardware to run full nodes and thus, will increase entry barriers, leading to less decentralization of the network. That tradeoff already led to a divide in the Bitcoin community which created Bitcoin Cash. Larger block sizes is not the only way in which that tradeoff can materialize. If a network requires transaction validators to perform more complex computations or handle more short-term data that will lead to a similar increased need for specialized hardware or a lot of RAM, thus excluding most long-tail users to validate transaction integrity in the network and leading to a more centralized network in the long run.","One key theme I expect to see more in 2022 is the greater adoption of modular architectures instead of monolithic blockchains. The first generation of smart contract platforms tried to do everything from data storage to full Turing-complete compute in one. In the future, we will see the stack broken down into data availability and consensus, block verification &amp; building, transaction sequencing &amp; block proposing, and general-purpose or application-specific compute.","","","<i data-v-f87c67ca=\"\">Transition from monolithic to modular architectures. Source: <\/i><a href=\"https:\/\/celestia.org\/\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Celestia<\/i><\/a>","Ethereum’s most promising scalability solutions all address some areas or combinations of the stack: Sharding addresses data availability, consensus and block building while Rollups allow transactions to be processed on layer 2 with security tied to layer 1 through validity or fraud proofs. Validiums and Volitions are other interesting approaches using validity proofs to follow and more platforms leveraging these technologies will likely reach mainnet in 2022.","With modular architectures maturing, I expect a decreasing demand for alternative monolithic layer 1 smart contract platforms in crypto in the future. For many existing or aspiring specialized smart contract platforms, the decision to bootstrap security from scratch and build a monolithic chain with known long-term scalability issues will be less attractive than running as a layer 2 on top of a secure data availability + settlement layer. Ethereum will benefit as current negative network effects due to network congestion will be turned to positive network effects again due to greater data availability and security in a data sharding + rollup-centric world.","&nbsp;","","","<i data-v-f87c67ca=\"\">Visualization of a Rollup contract. Source: <\/i><a href=\"https:\/\/vitalik.ca\/general\/2021\/01\/05\/rollup.html\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Vitalik Buterin<\/i><\/a>","At the same time, I expect to see some interesting new developments of even more modular approaches, e.g. through separate data availability &amp; consensus layers that do not perform any computations themselves. One key issue to watch out for is composability between the various modular building blocks and even though some initial solutions are already proposed, we will need to see at scale how the modular crypto world evolves.","No matter how attention will be channeled between Fat Protocols and thinner ones, in the end, developers of decentralized applications will benefit from greater flexibility.","<b data-v-f87c67ca=\"\">The widening design space for dApps post scalability<\/b>","Overall, I expect greater scalability and improved UX e.g. through abstraction of blockchain interactions to widen the design space for dApps in Web3. Many design choices in user interfaces but also in the nature of the dApps themselves are constrained in the current architectures of the platforms they are built on top of.","For example, we saw a rise in Automated Market Makers and Liquidity Pools as an alternative to Limit Order Book Exchanges in Defi. That is not because AMMs are generally more effective (you don’t see AMMs on Wall Street) but rather due to the fact that AMMs are an ideal solution for the computation-constrained environment of current Web3 development - the constant posting, editing and canceling of limit orders by millions of users would congest the network overall and consume lots of gas for each user individually. With more scalability, we may expect the return of the limit order book in DeFi.","That may again have effects on true Defi yields. With limit order books and less dependence on AMMs, there may be less need for liquidity mining programs and less need for cash or stablecoins in DeFi due to increased capital efficiency. The current Curve wars may end and capital may find its way to more productive uses again.","Thanks to increased scalability, DeFi may go beyond elementary financial primitives and compose complex use cases that can drive more real-world user demand e.g. building a full-fledged DeFi bank. One of the areas that are currently truly exciting is DeFi options where we see DeFi succeeding where CeFi has failed - providing robust options markets in crypto beyond bitcoin and ether options. However, there are no secondary markets for DeFi options for now and hence, the potential for market participants to hedge or express their views through options is still limited. If scalability enables feasible limit order book exchanges and decreases the minimum clip size of a trade (through lower transaction costs), a liquid DeFi options secondary market may become reality.","I have also spent some time looking at the crypto gaming space over the last few weeks. As a former passionate gamer, I sadly noticed that many current games are implemented to only involve a few very basic types of interactions which more or less look like DeFi yield farming in-game environment packaging. Besides the growing involvement of traditional game developers and more gaming talent flow, increased scalability will also enable truly long-term engaging crypto games and new NFT use cases in the future.","<b data-v-f87c67ca=\"\">Increased demand for tools and middleware in a multi-chain and multi-layer world<\/b>","A modular multi-chain and multi-layer crypto ecosystem will also require more tooling, infrastructure and middleware solutions than what is currently available. Existing or new crypto networks will carve out a position in the marketplace that focuses on this new paradigm.","Maybe, existing cloud storage protocols will expand their offering to evolve into a full data availability + consensus network. Potentially, other networks appear that focus on providing pure computation resources as a service focused on processing zero-knowledge proofs for zk-Rollups. Indexing protocols for querying network data out of different data layers and cross-chain &amp; cross-layer oracles or composability &amp; liquidity layers will continue evolving as well.","These are all only a few basic ideas that probably need much more time and thought but they show that the way various crypto protocols interact with each other is subject to change with a possible upcoming transition to a modular crypto world.","<b data-v-f87c67ca=\"\">Conclusion<\/b>","We’re still at the very beginning of being able to grasp what that all means. I’m curious to explore how tokenomics and value capture evolve in such a modular world and what other effects can be expected e.g. impacts on MEV and DeFi composability. The expansion of blockspace as a massive supply-side shock will have its effects on most crypto use cases and the investment cases behind them.","During this transition period, many opportunities for entrepreneurs, talent, investors and ecosystem participants of any type will arise. New protocols will emerge, old ones will pivot and some will become obsolete. With the open nature of crypto, there will always be a multitude of approaches and I’m excited to see all of them advancing and evolving throughout 2022 and beyond.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2017","content":"DATE"},{"type":"Scalability Trilemma","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Defi","content":"LOCATION"},{"type":"Duong","content":"ORGANIZATION"},{"type":"Berlin","content":"LOCATION"},{"type":"Celestia","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ocean Investment and Director of Crypto Strategies","content":"ORGANIZATION"},{"type":"RAM","content":"ORGANIZATION"},{"type":"BIT Capital","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Automated Market Makers","content":"ORGANIZATION"}],"hashtag":[],"authors":["Contributor Network","The Block"]}