{"summary":"Bitcoin led the way as crypto prices fell throughout the week, leading to a raft of futures traders with long positions being liquidated.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/227643\/bitcoin-price-crypto-long-liquidation","publishDate":"2023-04-24T05:30:41","id":2444,"type":null,"title":"Crypto traders liquidated to the tune of over $600 million as markets dip","category":["MARKETS"],"content":["Futures traders holding long positions suffered massive losses last week. Falling crypto prices led to $650 million in longs being liquidated since April 17.","Bitcoin, and the broader crypto market, fell consistently throughout the week after a sharp sell-off on Tuesday. As a result, long positions across derivatives exchanges saw the largest liquidations so far this year. The liquidations continued to cascade through to Sunday.&nbsp;","About $650 million in longs were liquidated, according to <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/futures\/long-liquidations\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">data<\/a> from The Block. Most of the volume was on Binance and OKX, with $234 million and $197 million in long liquidations since Monday.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/futures\/long-liquidations\/embed\" title=\"Long Liquidations\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Bitcoin was trading at around $27,300, down 9.2% over the past week, according to CoinGecko data. The broader crypto market fell in tandem with the leading cryptocurrency by market cap. Ether slipped 12.9%, Ripple's XRP was down 11.7%, and Polygon's MATIC plunged 17%. Nascent portfolio strategist Matt Klein <a href=\"https:\/\/www.theblock.co\/post\/227692\/bitcoin-price-ether-decline\" data-v-f87c67ca=\"\">said<\/a>&nbsp;the sell-side pressure was down to waning exuberance.","Crypto prices began to dip on Tuesday. The decline has been linked to a lack of liquidity and a large sell order on Binance by Noelle Acheson, the former head of market insights at Genesis Trading, who now writes the <a href=\"https:\/\/noelleacheson.substack.com\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Crypto is Macro Now newsletter<\/a> on Substack.&nbsp;&nbsp;","\"The correlation between bitcoin and ether returns has been falling since mid-to-late March, which may be relevant for quantitative strategies that rely on cross-hedging,\" Coinbase <a href=\"https:\/\/www.coinbase.com\/institutional\/research-insights\/research\/weekly-market-commentary\/lower-btc-vs-eth-correlation-april-21-2023\" data-v-f87c67ca=\"\">noted<\/a> Friday. Funds can also use ether to hedge against less liquid altcoins.&nbsp;","The exchange's research team compared the trend to a similar one in September, following The Merge — when Ethereum upgraded to become a proof-of-stake blockchain.&nbsp;","\"Following the Merge, a decrease in the observed correlation coefficient between ether and bitcoin returns (from 0.95 to 0.75) lasted for around 47 to 50 days. Comparatively, the current period of attenuation has lasted for around 30 days, and we think it could continue for another two weeks given that the initial phase of ETH withdrawals is still ongoing,\" the report read.","Bernstein analysts said the strong price action in bitcoin this year, up 67% year-to-date, seems to have \"limited broad investor conviction on the fundamentals behind the price action.\" Each new crypto cycle is driven by a \"fundamental innovation,\" they wrote in a note on Monday.","\"We believe the 2023 cycle (and onwards) will be about building scalable decentralised financial infrastructure, building a prototype of a new 'Wall Street' on the blockchain, and seeing the first wave of mainstream institutional participation,\" Bernstein argues, adding that the market still \"offers an attractive window to participate in this new cycle.\"","<span data-v-f87c67ca=\"\">Source: Bloomberg, Bernstein analysis<\/span>","The skeptics will argue this is \"all a giant circular loop driven by retail speculation,\" the bank's note read, adding that some speculation is \"bootstrapping real infrastructure creation.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"$27,300","content":"MONEY"},{"type":"9.2%","content":"PERCENT"},{"type":"12.9%","content":"PERCENT"},{"type":"Matt Klein","content":"PERSON"},{"type":"Crypto","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$197 million","content":"MONEY"},{"type":"67%","content":"PERCENT"},{"type":"Bernstein","content":"PERSON"},{"type":"11.7%","content":"PERCENT"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"17%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"$234 million","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"April 17","content":"DATE"},{"type":"September","content":"DATE"},{"type":"$650 million","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"Noelle Acheson","content":"PERSON"}],"hashtag":["BITCOIN","BNB","CARDANO","CRYPTO MOVERS","DOGECOIN","ETHEREUM","POLYGON","SHIBA INU","SOLANA","TETHER","USDC","XRP"],"authors":["Adam Morgan McCarthy","The Block"]}