{"summary":"Short seller Hindenburg Research has released a report on Jack Dorsey’s Block Inc., claiming the firm’s products facilitate crime rather than smoother technological advances.\nFormer employees estimate that between 40%-75% of accounts they reviewed were either fake, linked to fraud, or multiple accounts belonging to a single person.  \nShares in Block plunged 18% shortly after the open. \nBlock called the report ” factually inaccurate and misleading” and said it would work with the SEC and explore legal action.","author":["Adam Morgan McCarthy","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/222254\/block-hindenburg-short-seller-jack-dorsey","publishDate":"2023-03-23T10:52:00","id":2444,"type":null,"title":"Block shares tumble as short seller Hindenburg Research takes aim at payments firm","category":["Companies"],"content":["Short seller Hindenburg Research is short Jack Dorsey's Block Inc. in its first report since tackling India's Adani Group.&nbsp;","Block has \"systematically taken advantage of the demographics it claims to be helping,\" Hindenburg concluded after its two-year investigation. The payments company's success has nothing to do with disruptive innovation, rather the firm's willingness to \"facilitate fraud against consumers and the government, avoid regulation, dress up predatory loans and fees as revolutionary technology, and mislead investors with inflated metrics,\" it <a href=\"https:\/\/hindenburgresearch.com\/block\/\" data-v-f87c67ca=\"\">claimed<\/a>.&nbsp;","Block Inc. shares sunk shortly after the open and were trading at $62.57 by 1:50 p.m. EDT, down 13.9%.&nbsp;","The company called the report \"factually inaccurate and misleading\" and said it would explore legal action.","\"Hindenburg is known for these types of attacks, which are designed solely to allow short sellers to profit from a declined stock price,\" Block said in a <a href=\"https:\/\/investors.block.xyz\/news\/news-details\/2023\/Blocks-Response-to-Inaccurate-Short-Seller-Report\/default.aspx\" data-v-f87c67ca=\"\">statement<\/a>. \"We have reviewed the full report in the context of our own data and believe it’s designed to deceive and confuse investors.\"","The short seller said it interviewed \"dozens\" of former employees, partners and industry experts during its research. It conducted an extensive review of regulatory and litigation records, the Freedom of Information Act and public records requests.&nbsp;","Block's Cash App has been strongly linked to crime, according to the report. The mobile payment app is cited as the top app used in reported U.S. sex trafficking, Hindenburg said, referencing a November 2021 <a href=\"https:\/\/www.moneylaundering.com\/news\/amid-pandemic-human-traffickers-collecting-fees-through-mobile-platforms\/\" data-v-f87c67ca=\"\">report<\/a> from the non-profit organization Polaris.&nbsp;","It goes on to say that \"multiple Department of Justice complaints outline how Cash App has been used to facilitate sex trafficking, including sex trafficking of minors.\"","Hindenburg added, \"numerous Department of Justice indictments detail how Cash App is used by gangs, including the notorious Sinaloa cartel, to distribute drugs like fentanyl and methamphetamine.\"","The app was also associated with a Baltimore gang, which shared the name Cash App, in April 2021. Baltimore authorities charged the members of the gang with distributing fentanyl.","The research also claimed Block Inc. overstated its user numbers while understating the cost of customer acquisition.&nbsp;","\"Former employees estimated that 40%-75% of accounts they reviewed were fake, involved in fraud or were additional accounts tied to a single individual,\" Hindenburg note.","Dorsey's firm \"obfuscates how many individuals are on the Cash App platform by reporting misleading 'transacting active' metrics filled with fake and duplicate accounts,\" it added. The short seller called on the company to clarify how many unique users are on the app.&nbsp;","\"On a purely fundamental basis, even before factoring in the findings of our investigation, we see a downside of between 65% to 75% in Block shares,\" the short seller said.","Block Inc.'s revenue declined by 1% in 2022, while it reported a GAAP loss of just over $540 million.","In the fourth quarter of 2022, its bitcoin gross profit from its Cash App <a href=\"https:\/\/www.theblock.co\/post\/214804\/blocks-q4-cash-app-bitcoin-profit-drops-25\" data-v-f87c67ca=\"\">dropped<\/a> by one-quarter to $35 million. The total sale amount of bitcoin sold to customers, recognized as bitcoin revenue, was $1.83 billion, down 7% year-over-year.","Hindenburg Research recently took aim at India's Adani Group, wiping over $100 billion from the company's market cap. Adani Enterprises, the conglomerate's flagship firm, has plunged around 50% since the report.&nbsp;","<em data-v-f87c67ca=\"\">(Updates with response from company in fourth paragraph. With additional reporting assistance from Sam Venis.)<\/em>"],"hashtag":["ANALYST REPORTS","EQUITY MOVERS","PAYMENTS"]}