{"summary":"The Block Research team has grown to 32 analysts in 2021, representing a 300% growth from the previous year\nRead on to know what our analysts’ 2022 crypto predictions\nOne of the consensuses is that the Layer-2 ecosystem will experience a higher growth rate than Layer-1s \nThe majority agrees that ZK-rollups (ZKRs) will have more adoption than optimistic rollups (ORUs), with StarkNet spearheading it\nOur mining expert predicts that there will be over 30 publicly listed Bitcoin mining companies by the end of 2022 \nOur structured market experts foresee that we might witness the approval of futures-based ETH ETF but not spot-based BTC or ETH ETF in 2022 \nSome of the analysts think Ethereum 2.0 merge will happen by the end of 2022","author":["The Block","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/129091\/the-block-researchs-analysts-2022-predictions","publishDate":"2022-01-04T12:39:19","id":2445,"type":null,"title":"The Block Research’s Analysts: 2022 Predictions","category":["The Block"],"content":["<span data-v-f87c67ca=\"\">Arbitrum, Optimism, Starknet, and zkSync all release their tokens in H1 2022, and they will outperform similarly to Layer-1s (L1s) in 2021. Token incentives will cause the Layer-2 (L2) ecosystems to amass a large TVL, and cross-L2 liquidity bridges will make the disadvantages over more centralized L1s more manageable. Optimistic rollups will be adopted much faster initially due to EVM compatibility. Still, eventually, composable ZK-rollups spearheaded by Starkware will be the winner due to better optimization, but adoption will be slow due to a new programming language. StarkNet adoption will eventually follow a similar path as Solana's - a slow start but explosive growth after that.<\/span>","<span data-v-f87c67ca=\"\">The ETH 2.0 merge will finally happen in 2022, but it will only be towards the end of the year, not in Q1 2022, as initially anticipated. DeFi 2.0 trend doesn't sustain, but new, more creative token economics models will continue to develop. Some DeFi 1.0 tokens will have a comeback after they revamp their token economics, similarly to YFI. Cardano will continue to be underwhelming in terms of DeFi applications built on top of it, and hype won't be able to sustain the price.<\/span>","<span data-v-f87c67ca=\"\">Ethereum won't flip Bitcoin, Solana won't flip Ethereum. There won't be a prolonged bear market across the board, but some tokens will drop over 90%. Crypto as a whole will continue to become less correlated overall.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">NFTs will have another strong year, but it won't be as profile picture (PFP)-heavy as in 2021. OpenSea will lose a lot of market share as alternatives address its issues and have a community-oriented approach along with revenue-sharing tokens.<\/span>","<span data-v-f87c67ca=\"\">The U.S. Securities and Exchange Commission (SEC) will approve a futures-based Ethereum ETF but will not approve a spot-based BTC (or ETH) ETF. The SEC will also put pressure on lenient listing practices for U.S.-based exchanges like Coinbase.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">There will be new universal standards for all USD-backed stablecoins, but they won't be banned altogether. Likewise, large U.S.-based exchanges won't ban withdrawals to unverified external wallets, but the Treasury Department will continue being aggressive.<\/span>","<span data-v-f87c67ca=\"\">Dubai and the Bahamas will become the hub for headquarters of global exchanges.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">After an amazing year in terms of price action and economic activity, I expect 2022 to be the plateau year for L1 blockchains as the market begins to price in the amount of innovation on a chain against the amount of commoditized copycat forks.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">L1 blockchains that survive the innovation repricing are the ones that have truly unique products that leverage the advantages of their native chains instead of just offering cheaper transaction fees.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">2022 will also see a surge in the financialization of NFTs, with NFT lending protocols taking off.<\/span>","<span data-v-f87c67ca=\"\">The overall market structure continues to mature, with centralized exchanges (CEXs) of developing countries having a big year. Option volumes continue to grow as more banks incorporate crypto offerings into structured products.<\/span>","<span data-v-f87c67ca=\"\">In terms of regulation, the European Union (EU) makes big leaps forward towards a rather unexpectedly liberal regulatory framework for crypto. However, stablecoins continue to get scrutinized most heavily out of all of DeFi. Expect Tether's respective market share to drop below 40%.<\/span>","<span data-v-f87c67ca=\"\">An increasing number of non-crypto companies launch tokens in an effort to better monetize their userbases, interact with and reward their userbases more directly.<\/span>","<span data-v-f87c67ca=\"\">There will be a significant improvement in the UI\/UX of crypto wallets because of the transition to a multi-chain world. There will not be only one winner among web wallets and there will be new ways to generate revenue based not only on swap fees.<\/span>","<span data-v-f87c67ca=\"\">The availability of on-chain data will only worsen due to the abundance of spam transactions in cheap L1s. It is unlikely that The Graph will achieve adoption and stable support for all announced networks in a decentralized way.<\/span>","<span data-v-f87c67ca=\"\">'Security through obscurity' will continue to be the main reason for the small number of exploits on non-EVM chains. However, it will be long until attackers come in and successfully attack projects on WASM and other VM chains due to insufficient security experts.<\/span>","<span data-v-f87c67ca=\"\">A more significant number of blockchain node clients will appear, which, on the one hand, will make it easier to handle the loads, and on the other, it will more often lead to consensus forks. Go and Rust implementations will continue to be the most popular.<\/span>","<span data-v-f87c67ca=\"\">MEV extraction on Proof of Stake (PoS) blockchains will cease to be non-trivial, as happened with Ethereum last year. Despite this, the number of competitors will significantly decrease since running the nodes for data extraction will be expensive.<\/span>","<span data-v-f87c67ca=\"\">The current P2E and Metaverse games implementation will not achieve meaningful success, but new approaches will allow for a breakthrough in this direction. Ponzi mechanics aimed exclusively at making money instead of fun in games will be a thing of the past.<\/span>","<span data-v-f87c67ca=\"\">Many narratives like liquidity mining or prediction markets will disappear, as happened with gambling and decentralized computations in 2018. A possible market drop will somewhat dampen developers' interest in overhyped topics and allow them to return to creating truly innovative products on blockchains.<\/span>","<span data-v-f87c67ca=\"\">Ethereum will switch to PoS, but this milestone will not significantly impact the ETH price. Withdrawing staked ETH, in turn, could lead to a drop in price due to the desire of some stakers who did not use liquid staking solutions like Lido to take over 5x profit.<\/span>","<span data-v-f87c67ca=\"\">Protocol-owned liquidity will become a norm for bootstrapping liquidity.<\/span>","<span data-v-f87c67ca=\"\">Curve's vote locking mechanism will spread throughout the landscape of DeFi governance to realign interests amongst protocol users and token holders.<\/span>","<span data-v-f87c67ca=\"\">Nascent derivatives like power perpetuals and everlasting options will start gaining momentum, possibly driven by token incentives as they get repackaged into structured products.<\/span>","<span data-v-f87c67ca=\"\">Geo-blocking will become a norm for centrally hosted DeFi frontends, whereas an increasing number of protocols will develop (or incentivize third parties to develop) alternative frontends with decentralized hosting solutions.<\/span>","<span data-v-f87c67ca=\"\">Polkadot and Cosmos will have their own \"multi-chain season\" with increasing usage of XCM format and Cosmos IBC, respectively.<\/span>","<span data-v-f87c67ca=\"\">Despite the rise of ZK-rollups, optimistic rollups will gain meaningful and sticky volume after support from major CEXs. Arbitrum or Optimism (or both) will launch a token decentralizing the sequencer.<\/span>","<span data-v-f87c67ca=\"\">StarkNet will dominate the ZK-rollup space in almost every metric by a significant margin.<\/span>","<span data-v-f87c67ca=\"\">CryptoPunks will outperform BAYC in floor market capitalization.<\/span>","<span data-v-f87c67ca=\"\">ETH will not flip BTC in market capitalization, but the gap will be narrowed.<\/span>","<span data-v-f87c67ca=\"\">Multi-chain Layer-1s (e.g., ATOM, DOT) outperform monolithic Layer-1s (e.g., SOL, ADA).&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Ethereum merges to PoS in Q3 2022.<\/span>","<span data-v-f87c67ca=\"\">At least one Ethereum Layer-2 token reaches the top-10 by market capitalization.<\/span>","<span data-v-f87c67ca=\"\">SEC does not approve a spot Bitcoin ETF. Grayscale Bitcoin Trust (GBTC) trades between a 25% discount and 10% premium.<\/span>","<span data-v-f87c67ca=\"\">Traditional PE\/VC firms became far more active in crypto in 2021 as private investment increased to $25 billion from just $3 billion in 2020. Most allocated via equity financing deals for infrastructure, exchange, and services businesses – the strategy being to get directional exposure to the sector while minimizing specific asset risk and operational complexity. In 2022, expect some of these firms to hire, partner, or acquire capabilities to directly custody crypto, execute on-chain yield opportunities and participate in governance.<\/span>","<span data-v-f87c67ca=\"\">As crypto native investment firms continue to raise nine to ten-figure funds, expect token launch, unlock, and major exchange listing dumps to intensify following the shift in dominance to institutional capital. Successful new protocols will adapt by being more creative about airdrop and access qualifications, enforcing stricter lockups from early investors, and generally being more diligent around decentralization and distribution to earn community support.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Supercycle remains intact. Most attention through H1 2022 will be focused on Ethereum L2s, multi-chain L1s, and both existing DeFi protocols undergoing treasury restructurings along with net new protocols aiming to aggregate liquidity and votes. Infrastructure will be important, with bridging being an early example.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In H2 2022, expect significant prominence of Ethereum and record volumes during the transition to ETH 2.0 as institutions with Environmental, Social, and Governance (ESG) mandates like banks and sovereign wealth funds become suddenly able to publicly change their tune on the blockchain platform with the most liquid applications and thus crypto generally.<\/span>","<span data-v-f87c67ca=\"\">Bitcoin will outperform equities but be a laggard within crypto portfolios. A spot ETF will not be approved, but the infrastructure surrounding the OG orange coin will continue to develop, paving the way for its broader adoption within portfolios over the next 3-5 years.<\/span>","I think we are going to see more institutional involvement from TradFi and non-crypto native firms. With U.S. inflation at all-time highs of 6.8%, it does not remain viable to keep large Level I and\/or II securities on balance sheets that are generating negative yield. The first companies to implement DeFi and staking protocols will go down in history as adopters and champions of the future for how to properly optimize balance sheets. In 2021, we saw blue-chip household names like Visa buying NFTs and getting into digital assets. FinTech and payment services will also continue to shift towards digital asset adoption as on the retail side, digital assets lower the hurdle for access to lending, staking, payments, and traditional banking for the historically marginalized. While many institutions and TradFi participants remain skeptical, they can no longer ignore crypto as a legitimate asset class. In my opinion, many of them are neither bullish nor bearish, but simply want to adopt so as to \"not be left behind\" and for the inherent FX and inflation hedges. The largest hurdle to their entrance is driven by internal regulation, compliance and the necessary infrastructure they need to feel comfortable to either custody or hold on their own balance sheet.","<span data-v-f87c67ca=\"\">While interest in other L1 blockchains continues, we will see a strong narrative being formed around Ethereum's ability to scale with further developed optimistic rollups as well as the proliferation of ZK-rollups (predominantly Starkware &amp; zkSync).&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Ethereum will also see increased institutional inflows compared to Bitcoin, primarily led by the shifting ESG narrative with the transition to PoS.<\/span>","<span data-v-f87c67ca=\"\">NFTs continually realize a utility scope outside of digital art, seeing a number of use cases that converge on traditional capital market instruments such as collateralized lending. In addition, blockchain gaming begins to gain more feature parity with traditional gaming, aided by the off-loading of in-game transactions to generalizable ZK-rollup solutions.<\/span>","<span data-v-f87c67ca=\"\">The Merge is successful and Ethereum officially becomes a PoS chain. Modular blockchain plays and data availability innovations get more attention.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Ethereum’s L2 ecosystems start to take shape, new applications begin to launch natively on L2, and L2 protocol tokens (new and old) become a popular trade in 2022. Generalized ZK-rollups start to materialize, gaining some traction towards the end of the year into 2023.<\/span>","<span data-v-f87c67ca=\"\">DeFi 1.0 makes a comeback. Uniswap v3 does $1 trillion in quarterly volume. Structured products are a powerful narrative. Squeeth shakes up on-chain derivatives. Protocol-owned liquidity falls out of favor.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">New institutional players enter the stablecoin race. USDC supply flips USDT supply. Macro turbulence spills over into crypto as long-term rates rise. Regulatory concerns come back into focus in H2 2022. <\/span>","<span data-v-f87c67ca=\"\">L2s will begin to dominate the space once their token (meant to decentralize sequencing nodes) launches. ZK-rollups are likely to dominate over optimistic rollups from Q3 2022 onwards, considering the relative maturity of both technologies currently.<\/span>","<span data-v-f87c67ca=\"\">Polygon is likely to become one of the biggest L2 solutions with the launch of their ZK-rollup solutions.<\/span>","<span data-v-f87c67ca=\"\">Gaming NFTs will likely face the pump and dump cycles that plagued the initial coin offering (ICO) mania in 2017, and play-to-earn (P2E) will not be sustainable in the long run. Most sustainable games are only going to incorporate small amounts of earnings for players (e.g., Gods Unchained).<\/span>","<span data-v-f87c67ca=\"\">L1s will continue to outperform Bitcoin and Ethereum as more investors will look for higher risk-reward trades by building a position holding those tokens. Mid-cap L1 tokens with a useable interface will likely see the most price action.<\/span>","<span data-v-f87c67ca=\"\">OHM forks' tokens will become a medium for cross-bridge transfers of value<\/span>","<span data-v-f87c67ca=\"\">We will likely see a macro environment with tighter monetary and fiscal policy than 2020 and 2021, leading to rotation away from high-risk assets and tempered price action in crypto.<\/span>","<span data-v-f87c67ca=\"\">Regardless, institutions will continue to look for ways to participate in DeFi and crypto generally in search of higher yields. As a result, I expect more DeFi projects will release KYC-enabled and permissioned versions of their protocols to onboard institutional capital.<\/span>","<span data-v-f87c67ca=\"\">Although the Ethereum merge will happen, it won't significantly address scalability issues, which are likely to remain until the introduction of sharding. As such, L2s and alternative L1s will continue to gain market share led initially by EVM-compatible chains, side-chains, and optimistic rollups. ZK-rollups will likely gain more traction later in the year as the technology matures and developers get used to the idiosyncrasies of developing for those environments.<\/span>","<span data-v-f87c67ca=\"\">Interoperability will be a central narrative throughout the year, which will drive greater attention towards Cosmos and Polkadot. Therefore, cross-chain DeFi protocols will gain greater traction.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Increased commoditization of L1s and L2s will mean that winning protocols will be those that can truly differentiate in terms of user experience, fees and security.<\/span>","<span data-v-f87c67ca=\"\">The protocol audit and insurance sector will see significant growth due to the continued demand for protection against exploits.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The overall market will continue to leave behind uniform directional price movements.<\/span>","<span data-v-f87c67ca=\"\">L1 blockchain winners will emerge, leaving only a handful to survive and grow while the rest will plateau in price and development, similar to how many 2017 ICO coins have had no real movement despite the overall growth of the industry.<\/span>","<span data-v-f87c67ca=\"\">NFTs will continue to expand past the PFP mania, with gaming NFTs being the first clear step into new territory.<\/span>","<span data-v-f87c67ca=\"\">While gaming will be a leading trend for 2022, many developers will realize how different and challenging game design is (you can't just fork code and slap on a new website). As a result, projects who bandwagon into \"gaming\" will struggle to match expectations. Further, other projects will struggle because there is a big difference between a DeFi project with a game as a secondary component and a more traditional game with blockchain aspects built into it, for example, item ownership via NFTs or P2E aspects as core game mechanics.<\/span>","<span data-v-f87c67ca=\"\">Ethereum 2.0 update or the absence of it will be a big talking point within the crypto community which, if unsuccessful, could lead to other Layer-1s capitalizing on the investors' impatience for a more scalable and cheaper Ethereum chain. I predict that ETH 2.0 will be successfully released, gaining an even more significant crypto market share in 2022.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">NFT utility for gaming will continue to make huge strides as more popular legacy gaming development teams will partner with crypto developers to launch blockchain-based games. Solana could be positioned well for this market because of its scalability and cheap transaction costs (highly dependent on Ethereum 2.0 update status). Also, I expect an increased number of popular music artists exploring the possibility to utilize blockchain technology (labels released as NFTs or launch of fan tokens) for their benefit in the currently unfavorable legacy music industry conditions.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">NFTs will continue to integrate themselves with established institutions and we may see large tech companies like Meta, Apple, Amazon, or Google, begin integrating the \"metaverse\" with their AR\/VR hardware products. If this doesn't happen in 2022, it will only continue to develop into the future.<\/span>","<span data-v-f87c67ca=\"\">Other NFT use cases like gaming and music will become the focus of the broader NFT market as their use cases continue to develop and interest grows.<\/span>","<span data-v-f87c67ca=\"\">The ETH merge will happen, but it won't change current scalability issues as much as most believe it will. As L2 scaling solutions like zkSync, Loopring, and Starknet launch, it will draw attention away from Ethereum mainnet. However, a big barrier will continue to be the aspect of needing to move funds over. It is still to be seen if these L2 scaling solutions can directly integrate with Ethereum mainnet UI to provide a seamless experience.<\/span>","<span data-v-f87c67ca=\"\">ZK-rollups will beat out optimistic rollups.<\/span>","<span data-v-f87c67ca=\"\">I anticipate further virtual lands to increase in value on The Sandbox, Decentraland, Somnium Space, and Crypto Voxel throughout 2022. One of the reasons is that more independent builders will develop and host their content on their lands, resulting in more revenue generation for those builders and the protocols behind those metaverses.<\/span>","<span data-v-f87c67ca=\"\">Subsequently, there will be an emergence of 'middle-man' protocols that act as brokers and land appraisers between land sellers and buyers, owing to the high information asymmetry due to on-chain illiteracy.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The total market capitalization of cryptocurrencies will continue to increase, and numerous new sectors will emerge. However, it may not see the same kind of growth we saw in 2021. New investors may prefer passive investing through indices. Index Coop will maintain its market leadership position and may see its asset under management (AUM) grow to $1 billion by the end of 2022. Additionally, we will see many new indices, such as the Top-5 DAO index and Layer-2 index.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Apart from that, there is a strong public perception that cryptocurrency is environmentally harmful. Thus, there will be a shift in many projects towards greater carbon reduction through the use of PoS chains. New and existing projects will emphasize the ESG narrative, primarily to attract retailers and institutional adopters.<\/span>","<span data-v-f87c67ca=\"\">With inflation continuing to run rampant in the global economy partly due to the aggressive money printing that fuelled a huge bull run in the stock and cryptocurrency markets in 2021, I predict some kind of retracement and prolonged bear market going forward. During this bear market, institutional and retail investors will most likely move their money into stablecoins and invest in DeFi protocols in order to maximize returns.<\/span>","<span data-v-f87c67ca=\"\">NFT gaming communities become impatient with the development process. Gamers waiting for NFT gaming projects such as Star Atlas will grow tired with the length of the development process necessary to create the first-of-its-kind AAA-rated blockchain-based game.<\/span>","<span data-v-f87c67ca=\"\">KYC will be required on all major centralized exchanges that still allow unverified accounts, such as KuCoin.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A US-based spot Bitcoin ETF will not be approved in 2022. The SEC will delay decisions on spot Bitcoin ETF applications dragging out the approval process and ultimately rejecting all spot Bitcoin ETF applications in 2022.<\/span>","<span data-v-f87c67ca=\"\">ETH PoS merge will not happen in 2022. The development process usually takes longer than expected, which will push the ETH PoW to PoS merge until 2023.<\/span>","<span data-v-f87c67ca=\"\">A major exploit of at least $25m will occur on Solana in 2022. Solana has a reputation for the lack of exploits against projects built on the Solana blockchain. Unfortunately, in 2022 I believe this will change, and a major exploit of at least $25 million will occur in 2022<\/span>","<span data-v-f87c67ca=\"\">Interest in Web3 will keep increasing through 2022 and as a result, knowledge about the technologies involved (e.g., what is useful, what is not, and so forth) will grow as well. This means a greater percentage of people will be interested in crypto from a tech\/use standpoint and a smaller percentage of people from a gambling standpoint. But it will be a slow shift, and there will be a large percentage of the latter still, and, on the whole, more of both.<\/span>","<span data-v-f87c67ca=\"\">Valuations will start to reflect that new knowledge. For example, with less interest in meme coins and more interest in projects that are demonstrably useful and appear promising.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">People will start to see ETH as the token and currency of Web3, creating upward price pressure. But the structural shift in activity from Ethereum to L2s as well as sidechains will create downward price pressure on ETH.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">People will start to see more differences between tokens like ETH and BTC (and others), leading to less correlation in the crypto market as a whole and more sector rotation depending on social and economic conditions.<\/span>","<span data-v-f87c67ca=\"\">On Web3 infrastructure, more awareness of over-diversification and under-integration will generate interest in infrastructure projects enabling interoperability. Additionally, centralization chokepoints in Web3 will also generate interest in projects enabling decentralization.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The NFT narrative will extend strongly to the 2022 market. I expect a mature business model coming out from both the music and sports entertainment industry. I believe this may lead to another \"DeFi Summer boom\" of NFT and metaverse-related tokens that interconnect celebrities with fans.<\/span>","<span data-v-f87c67ca=\"\">There may be a specific, solid regulation attempt by governments to regulate the transactions between centralized exchanges to prevent money laundering, especially in East Asia.<\/span>","<span data-v-f87c67ca=\"\">L1 protocols that showed astronomical growth in 2021 would now have to undergo competition with the L2 protocols.<\/span>","<span data-v-f87c67ca=\"\">Polkadot and Cosmos will gain interest as their parachain ecosystem blooms.<\/span>","<span data-v-f87c67ca=\"\">The overall crypto market may suffer during Q1 2022 due to the rapid tapering and risk-averse attitude of investors. However, I think that the market will return to a bullish environment before Q3 2022 with the recovery of the macroeconomy and NFT technology overwhelming the narrative of the market.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Further growth of digital asset structured products as regulation continues to evolve, especially in the US. Potentially more leveraged and short ETFs on BTC futures. No spot BTC ETF in 2022.<\/span>","<span data-v-f87c67ca=\"\">There will be an ETH Futures ETF in 2022.<\/span>","<span data-v-f87c67ca=\"\">CME flips Binance in open-interest on BTC futures.<\/span>","<span data-v-f87c67ca=\"\">More complex structured products offered and growth of institutional participation in cryptocurrency markets will lead to increased activity in the options market.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Deribit is likely to launch options on more altcoins.<\/span>","<span data-v-f87c67ca=\"\">Protocols such as Polkadot that promote interoperability and utility will see an influx of L1s looking to build on their existing infrastructure and will be the primary mode wherein traditional financiers will be bridged to DeFi (e.g., Acala). The successful launch of Polkadot's parachains has shown significant enough, early-on, community interest and adoption within the project and will inspire Web3 projects to muster significant crowdsourcing funds. That being said, the idea of L0s will see more growth than L1s in 2022.<\/span>","<span data-v-f87c67ca=\"\">There will be a shift of focus in the NFT gaming realm to UX\/UI. If this parameter is met, there will be an influx of mainstream gamers looking for an amalgam of play-to-earn and play-for-fun experiences onto the metaverse. Such games will remove the many-times pricey barrier-to-entry associated with games that offer NFT characters; in-game NFT leasing structures will become more popular than gaming guilds amongst crypto newbies.<\/span>","<span data-v-f87c67ca=\"\">ZK-rollups will outperform optimistic rollups in 2022 following the anticipated zkEVM support from zkSync and Starkware's Cairo, making ZK-rollups easier to utilize and limiting the edge optimistic rollups had on the market. ZK-rollups are already offering lower fees and a wider selection of projects using them will propel them forward.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">ETH 2.0 will successfully launch phase 1 at some point during 2022, and it will reignite the discussion around the environmental impact of crypto. The conversation will continue to be centered around Bitcoin's Proof-of-Work (PoW), but nothing new will come out of it.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">NFTs will gain traction as new use cases emerge beyond the main art\/collectibles and gaming. In addition, mainstream interest will continue to grow as more celebrities and public figures buy NFTs and launch or collaborate on projects of their own.<\/span>","<span data-v-f87c67ca=\"\">L2s will launch tokens to increase adoption, exchanges will implement deposit\/withdrawals directly to L2s, and Ethereum base layer transactions will be rare for average users.<\/span>","<span data-v-f87c67ca=\"\">Overall, tokens will start decoupling, and crypto will see sector rotation similar to global equities.<\/span>","<span data-v-f87c67ca=\"\">Structured products will start gathering steam. As stablecoin yields led by protocol inflation reduce and the market matures further, call\/put selling strategies will get attention.<\/span>","<span data-v-f87c67ca=\"\">Ethereum will move to PoS towards the end of the year.<\/span>","<span data-v-f87c67ca=\"\">The P2E narrative will take a hit (building games will matter). Subsidizing players will not be enough to onboard and retain players.<\/span>","<span data-v-f87c67ca=\"\">NFTs will expand beyond jpegs, and established brands will use NFTs to maintain\/increase brand loyalty.<\/span>","<span data-v-f87c67ca=\"\">Web2 companies will try to launch Web3 products, and Web2 VCs\/investors will include crypto in their portfolios.<\/span>","<span data-v-f87c67ca=\"\">Despite its current market dominance, OpenSea will lose ground to newly arising competitors that take a more community-centric approach, which will enable them to chip away at OpenSea's market share.<\/span>","<span data-v-f87c67ca=\"\">The NFT market will resurge out of its lull, with monthly NFT trading volume surpassing its previous ATH in Q1 2022. In the process, capital will rotate back to \"blue chip\" NFT projects, such as Art Blocks or CryptoPunks. In addition, NFT trading activity will continue to proliferate across chains, bolstering the relative strength of burgeoning NFT ecosystems on other chains.<\/span>","<span data-v-f87c67ca=\"\">Notwithstanding their massive war chests, most blockchain gaming projects will underdeliver, shifting the narrative towards the notion that valuations have gotten ahead of fundamentals.<\/span>","<span data-v-f87c67ca=\"\">In the battle for L2 scaling solutions, ZK-rollups will win out over optimistic rollups and gain more momentum.<\/span>","<span data-v-f87c67ca=\"\">Bitcoin's hashrate reaches the 300 EH\/s level and over half of the Bitcoin network's hashing power will be located in North America.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">There will be over 30 publicly listed Bitcoin mining companies by the end of 2022 and their equity or debt fundraise activities will continue to set new records in order to have additional working capital to pay for miner pre-orders. The dilution of their circulating stocks will hence continue. Some of the mining companies that have adopted a \"hold\" strategy so far will start to sell some of their bitcoin holdings or at least pledge them as collateral to borrow debts.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">ETH2.0 will happen in 2022. Ethereum hashrate will continue setting new records after passing the 1 PH\/s threshold until a firm deadline for the proof-of-stake switch is decided. Before that actually happens, Ethereum will remain the top option for GPU mining. There will be a dump for graphic cards around the time of the switch on the secondhand market, but other proof-of-work coins could also see a big boost of hashrate. Ethash ASIC miners, on the other hand, will depreciate gradually and become obsolete unless the price of ETC surges in 2022 substantially to attract ETH ASIC miners.<\/span>","<span data-v-f87c67ca=\"\">Classic DeFi protocols will adopt the veToken model to attach greater use cases to their governance token. The basic premise is to lock the governance token to get advantages over people who don't lock up the token. This lock-up of tokens might cause these tokens to appreciate again after the relative DeFi bear market in the last few months. Projects like Convex have a chance to make use of this dynamic.<\/span>","<span data-v-f87c67ca=\"\">Infrastructure becomes increasingly important. While this includes a wide range of topics, I suspect the most active areas of development will be in inter-blockchain infrastructure and NFT-related infrastructure (e.g., marketplaces and intersection NFT &amp; DeFi).<\/span>","<span data-v-f87c67ca=\"\">Decentralized crypto indices (e.g., DPI, DATA, MVI, BED) will become increasingly popular and attract more retail investors.<\/span>","<span data-v-f87c67ca=\"\">Signal\/noise ratio of information, data, and projects keeps diminishing as blockchain technology grows more popular and becomes cheaper with increased UX.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Algorithmic stablecoins continue growing exponentially and close in on centralized stablecoins in total combined market capitalization, as regulatory scrutiny is higher than ever.<\/span>","<span data-v-f87c67ca=\"\">More institutions will add BTC to their balance sheet, and those that have already done so will increase their allocation.<\/span>","<span data-v-f87c67ca=\"\">AAA gaming studio will release a P2E game by the end of 2022, further accelerating the P2E adoption.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Polkadot and Cosmos will catch up to Solana and Avalanche. 2022 will be the year of Layer-0 interoperability chains.<\/span>","<span data-v-f87c67ca=\"\">Ethereum will not flip Bitcoin.<\/span>","<span data-v-f87c67ca=\"\">Ethereum L2s will release their tokens, resulting in L2s rivaling L1 chains in user activity.<\/span>","<span data-v-f87c67ca=\"\">More \"Web 2.0\" companies will flock to the metaverse following Meta's footsteps. NFTs will find a new utility\/use case, and Opensea will struggle to stay as the top NFT marketplace.<\/span>","<span data-v-f87c67ca=\"\">An Ethereum Futures ETF will follow the successful 2.0 Merge.<\/span>","<span data-v-f87c67ca=\"\">The overall crypto markets continue to decouple from BTC, with sectors having different periods of price appreciations and downturns. However, the probability of an extended market-wide bear market that isn't caused by broader economic conditions shrinks as consistent capital continues to flow in.<\/span>","<span data-v-f87c67ca=\"\">NFTs volumes continue to trend down overall, and the hype for \"metaverse\" projects turns out to be premature. However, a new use case for NFTs will become the dominant portion of the market, dethroning collectibles and gaming.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">UST becomes the second largest stablecoin, behind USDT. The total stablecoin market cap exceeds $500 billion.<\/span>","<span data-v-f87c67ca=\"\">There will be a single piece of government regulation that will act as a tipping point and cause renewed interest and a large inflow of capital into privacy projects.<\/span>","<span data-v-f87c67ca=\"\">Despite continued enthusiasm and investment in non-fungible tokens &amp; blockchain gaming throughout 1H 2022, a slow down in these verticals finally occurs due to the realization that mainstream adoption is not around the corner due to technical constraints.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Most of the first movers within NFTs\/Gaming will not end up as the \"winners,\" similar to how most ICO projects that raised massive amounts of money in 2017 dwindled to irrelevancy. Instead, over the next year or two, we will see the formation of foundational companies and projects within NFTs\/Gaming similar to how most major DeFi projects were from 2018-2020 after the ICO frenzy.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Regardless of how the price of Bitcoin, Ethereum, and other digital assets perform, venture funding in the sector will continue to flow in from traditional PE\/VC firms and crypto-native funds. The high frequency of new fund formations and increased interest from conventional firms has resulted in large amounts of capital still on the sidelines that will be deployed.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">At least one effective decentralized alternative to Opensea's NFT marketplace will arise in 2022 and garner sufficient volume on its platform. Of course, a decentralized NFT marketplace will take time to pick up volume and users, similar to how it took time for decentralized exchange like Uniswap to pick up traction and volume; however, usage will pick up once it does parabolically.<\/span>","Cross-chain bridges will continue to amass higher TVL as capital spreads to an increasing number of L1 and L2s. Bridge volumes will initially be fragmented across various bridges as users seek to move funds through the best liquidity sources, but volume will ultimately consolidate to a few bridges with the deepest cross-chain liquidity across the most popular chains. Alongside growing regulatory scrutiny and discussion, blockchains and applications with built-in privacy features will see increased usage and adoption. Protocols with a multi-chain focus like Cosmos and Polkadot will capture greater relative market share as the rollout of basic ecosystem infrastructure makes them more accessible to new and existing crypto users. Crypto becomes more mainstream than ever as NFTs see rapid adoption from the sports and entertainment industries. A crypto company buys the naming rights for an NFL stadium. NFT fractionalization will fade as a trend as no one wants to own a fraction of a rare NFT."],"hashtag":[]}