{"summary":"ETH 2.0 project lead Danny Ryan said that the network’s multi-client approach is one of the main factors behind Phase 0’s launch delays\nHowever, according to Ryan, having multiple clients is crucial for maintaining a high level of network security \nRight now, there are seven ETH 2.0  client implementations under development","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/65138\/eth-2-0s-multi-client-approach-is-contributing-to-delays-says-project-lead","publishDate":"2020-05-13T17:11:22","id":2446,"type":null,"title":"ETH 2.0&#x27;s &#x27;multi-client&#x27; approach is contributing to delays, says project lead","category":["Ethereum"],"content":["<span data-v-f87c67ca=\"\">Ethereum 2.0's multi-client paradigm – while crucial for security reasons – is one of the main reasons the launch process is taking so long, according to project lead Danny Ryan.<\/span>","<span data-v-f87c67ca=\"\">The ETH 2.0 team has repeatedly pushed back the launch schedule for Phase 0, the first step in the network's multi-stage rollout. While developers initially <\/span><a href=\"https:\/\/www.youtube.com\/watch?v=izspfej05lE&amp;\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">set<\/span><\/a><span data-v-f87c67ca=\"\"> the launch date for Jan. 13, they had to postpone at the last minute in order to change to the network's technical design. Since then, members of the team have given varying estimates.<\/span>","<span data-v-f87c67ca=\"\">In February, Ethereum co-founder Vitalik Buterin predicted that the launch would take place in the second quarter of this year. In March, Ethereum Foundation researcher Justin Drake said that the team's goal was to release Phase 0 before Ethereum’s 5th anniversary in July.<\/span>","<span data-v-f87c67ca=\"\">However, the amount of work still left to be done has raised doubts that the team will make that deadline. For one, the Ethereum Foundation has yet to put out an official test network, which the team has said will need to run smoothly for two months before it can release the mainnet.<\/span>","<span data-v-f87c67ca=\"\">Ryan, ETH 2.0's lead developer, said during CoinDesk's Consensus event on Wednesday that the project's multi-client model is also contributing to the launch delay.<\/span>","<span data-v-f87c67ca=\"\">There are currently seven ETH2.0 client implementations: the Ethereum Foundation's Trinity, Prysmatic Labs's Prysm, Sigma Prime's Lighthouse, Status's Nimbus, ChainSafe's Lodestar, PegaSys's Teku, and Nethermind's Cortex. Ryan called Lighthouse \"the most performant client to date\" in terms of speed and security. Meanwhile, Prysmatic Labs has opened the biggest single-client testnet, featuring over 400 nodes.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In order to build a foundation that every client can work from, the ETH 2.0 team has taken a \"specification-first\" approach, meaning that they will first complete the entire protocol design and then move on to the implementation process. This design philosophy is supposed to set the stage for what the developers call the \"multi-client paradigm.\" <\/span>","<span data-v-f87c67ca=\"\">Having multiple clients is crucial for maintaining a high level of network security, Ryan said. \"If there's a critical bug in a single client and it goes down, the network can continue moving forward because the majority of nodes may not be running on that client.\"<\/span>","<span data-v-f87c67ca=\"\">The history of the current Ethereum network backs up his assessment, according to Ryan. Both the Geth client and the Parity client have been compromised before, but the mainnet was able to stay up.<\/span>","<span data-v-f87c67ca=\"\">The flip side, however, is that it simply takes longer to finalize all the details.<\/span>","<span data-v-f87c67ca=\"\">\"The multi-client paradigm brings in the additional complexity to get things to the mainnet,\" he said. \"If we had one client, maybe we would be in mainnet already.\"<\/span>"],"hashtag":[]}