{"summary":"Wider markets are looking to May for the commencement of the Federal Reserve’s anticipated rate-cutting cycle, an analyst said. ","author":["Brian McGleenon","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275957\/crypto-markets-could-benefit-from-anticipated-fed-rate-cuts-in-may-analyst-says","publishDate":"2024-02-05T07:39:41","id":2452,"type":null,"title":"Crypto markets could benefit from anticipated Fed rate cuts in May, analyst says","category":["Markets"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.20%\n    <\/span><\/a> <!----><\/span><\/span> posted an uptick on Monday, taking the digital asset back above the $43,000 mark. The price move comes as markets anticipate the initiation of the U.S. central bank's rate-cutting cycle to begin at May's Federal Open Market Committee (FOMC) meeting.<\/span>","The world's largest cryptocurrency by market capitalization increased by over 0.5% in the past 24 hours to $43,100 at 7:30 a.m. ET, according to The Block's Price Page.","According to ETC Group Head of Research André Dragosch, market participants expect the Fed to commence its rate-cutting cycle in May, based on what is currently priced into <a href=\"https:\/\/www.cmegroup.com\/markets\/interest-rates\/stirs\/30-day-federal-fund.html\" data-v-f87c67ca=\"\">Fed funds futures<\/a>.","Fed funds futures contracts essentially represent the market's expectations for future interest rates. Investors can use these futures contracts to express opinions on the direction of interest rates and to manage interest rate risk in their portfolios.","Speaking to The Block, Dragosch added that the market has priced out the possibility of the commencement of a Fed rate cut in March. This aligns with Federal Reserve Chair Jerome Powell who ruled out an earlier rate cut in 2024, when interviewed on <a href=\"https:\/\/www.youtube.com\/watch?v=ImrKxlLJCEY\" data-v-f87c67ca=\"\">CBS' 60 Minutes<\/a> on Sunday.","Powell stated that a rate cut in March, as anticipated by Wall Street, is \"not likely\" to happen. “We’ve said that we want to be more confident that inflation is moving down to 2%,” Powell said in the interview. “I think it’s not likely that this committee will reach that level of confidence in time for the March meeting, which is in seven weeks.”","However, Dragosch said the prospect of higher for longer rates and the latest U.S. job numbers could \"counter-intuitively increase the probability of an earlier rate cut.\"","\"I think a reversal in monetary policy could be triggered by both an increase in systemic risks within the banking system and\/or a significant increase in the unemployment rate,\" Dragosch said.","\"The longer the Fed keeps rates at current levels, the more likely we will see a kind of 'accident' or credit event within the regional banking system especially among those institutions that have significant exposure to U.S. commercial real estate. I think the recent stress in bank stocks like New York Community Bank speaks volumes in this regard,\" he added.","Dragosch anticipates that <a href=\"https:\/\/www.theblock.co\/post\/275406\/bitcoin-trades-flat-as-federal-reserve-holds-rates-steady\" data-v-f87c67ca=\"\">bitcoin<\/a> and other cryptocurrencies may initially experience a sell-off in response to the potential delay in the rate cut until May.","\"This price move could come on declining global growth expectations amid a possible U.S. recession,\" he added.","However, the analyst said May's potential reversal in monetary policy, especially in combination with a weak U.S. dollar, \"should provide a significant tailwind as a second order effect.\"","Friday's U.S. employment situation summary revealed, on the surface, that the nation's economy is continuing to prove robust despite predictions of a looming recession. The stronger-than-expected jobs <a href=\"https:\/\/www.bls.gov\/news.release\/empsit.nr0.htm\" data-v-f87c67ca=\"\">report<\/a> showed the U.S. economy added 353,000 jobs, well above consensus expectations of 185,000.","However, Dragosch pointed out that a closer examination of Friday's headline job numbers indicates that certain indicators, such as the average hours worked, have continued to decline to levels typically associated with a recession.","\"Moreover, high-frequency indicators like Google search queries for 'filing for unemployment' in the U.S. are going parabolic which implies accelerating weakness in the U.S. labor market,\" Dragosch added."],"hashtag":["CRYPTO MOVERS","ECONOMIC INDICATORS","RATE DECISIONS","SPOT BITCOIN ETF"]}