{"summary":"Brokerage app company Robinhood is hiring sanctions investigators, with an eye for crypto experience from would-be candidates.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179277\/robinhood-seeks-sanctions-investigators-ahead-of-self-custody-crypto-wallet-launch","publishDate":"2022-10-23T13:10:17","id":2455,"type":null,"title":"Robinhood seeks sanctions investigators ahead of self-custody crypto wallet launch","category":["COMPANIES"],"content":["Brokerage app Robinhood is <a href=\"https:\/\/www.linkedin.com\/jobs\/collections\/recommended\/?currentJobId=3322992528\" data-v-f87c67ca=\"\">hiring<\/a> sanctions investigators for its finance crimes compliance unit.&nbsp;","The hires could be linked to compliance related to self-custody wallets, which the company is releasing officially in the coming months. Robinhood Wallet, a standalone app on the Apple Store in beta, allows users to trade and swap crypto without network fees.","The position requires two-plus years of experience working in financial crimes investigation, and one-plus years investigating cryptocurrency transactions. While not required, \"Chainalysis experience\" is welcome, per the post.","That Robinhood is looking to expand its compliance team with a focus on crypto is unsurprising, given its past challenges on this front. Earlier this year, Robinhood Crypto <a href=\"https:\/\/www.theblock.co\/post\/160891\/robinhoods-crypto-division-slapped-with-30-million-fine\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">was fined $30 million<\/a> by New York finance regulators.&nbsp;","The day-to-day responsibilities of the role include:","Robinhood <a href=\"https:\/\/www.theblock.co\/linked\/147333\/robinhood-launches-defi-wallet-to-rival-metamask\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">unveiled<\/a> plans for a web3-centric wallet earlier this year.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York","content":"LOCATION"},{"type":"Robinhood Crypto","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"$30 million","content":"MONEY"}],"hashtag":["HIRING","ROBINHOOD"],"authors":["Christiana Loureiro","The Block"]}