{"summary":"Today in crypto news: Sui enters the top 10 chains by TVL as OpenSea’s CEO hints that the company feels open-minded about an acquisition. Plus, developers bring Doom, Pokémon, and more to Farcaster’s new frames feature. \nHere’s all the news you may have missed from a quiet Saturday in the world of crypto. ","author":["Zack Abrams","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274746\/saturday-recap-suis-tvl-milestone-openseas-acquisition-plans-farcaster-frames-fun-and-more","publishDate":"2024-01-27T20:06:57","id":2456,"type":null,"title":"Saturday recap: Sui&#x27;s TVL milestone, OpenSea&#x27;s acquisition plans, Farcaster Frames fun, and more","category":["Crypto Ecosystems"],"content":["Even a slow Saturday in crypto has plenty to cover, including a new milestone for Sui, an oracle malfunction, and watching Tenet the way Christopher Nolan definitely didn't intend: frame-by-frame, within a Farcaster post. Here's all the news you may have missed from today in crypto.&nbsp;","OpenSea's CEO is open to seeing whether an acquisition makes sense for the company — including getting acquired itself — according to <a href=\"https:\/\/www.dlnews.com\/articles\/markets\/opensea-ceo-open-to-suitors-acquiring-nft-marketplace\/\" data-v-f87c67ca=\"\">DL News<\/a>, which spoke with the NFT marketplace's chief, Devin Pinzer. Pinzer told the publication that OpenSea has \"no plans to be acquired,\" but remains open towards taking the right partnership if it should come along.&nbsp;","Sui, a blockchain launched less than a year ago by former members of Facebook's Libra project, has entered the top 10 chains by TVL, according to <a href=\"https:\/\/x.com\/SuiNetwork\/status\/1751303522463932543?s=20\" data-v-f87c67ca=\"\">DefiLlama data<\/a>. The co-founders of Mysten Labs, Sui's developers, told The Block that their goal is to make sending money over the Internet as simple as <a href=\"https:\/\/www.theblock.co\/post\/267530\/former-facebook-devs-dream-of-sending-money-by-email-with-their-sui-blockchain\" data-v-f87c67ca=\"\">sending an email<\/a>.&nbsp;","Following <a href=\"https:\/\/x.com\/slurix_xyz\/status\/1751306933871706284?s=20\" data-v-f87c67ca=\"\">reports of an oracle malfunction<\/a> affecting Rollbit (RLB) trading on Solana-based futures exchange Drift Protocol, the protocol paused market maker activity on the RLB market.&nbsp;Drift's co-founder, Cindy Leow, <a href=\"https:\/\/x.com\/cindyleowtt\/status\/1751329041091879022?s=20\" data-v-f87c67ca=\"\">assured X users<\/a> that their funds are safe. \"Funds are SAFU. We are closely monitoring the isolated RLB markets for unusual activity. No users or markets are affected,\" Leow wrote.&nbsp;","Web3 social media service Farcaster launched Frames on Friday, a new feature that lets developers embed interactive experiences in the social networks posts, known as Casts. Developers got right to work creating Frames to <a href=\"https:\/\/x.com\/0xPrismatic\/status\/1751091717053530480?s=20\" data-v-f87c67ca=\"\">mint NFTs<\/a>, <a href=\"https:\/\/x.com\/davidvfurlong\/status\/1751253167935807733?s=20\" data-v-f87c67ca=\"\">play Doom<\/a>, and <a href=\"https:\/\/x.com\/nnnnicholas\/status\/1751276221999075397?s=20\" data-v-f87c67ca=\"\">watch Tenet<\/a> the way Christopher Nolan definitely didn't intend, all within a single cast.&nbsp;","On the final day of the first full week of Bitcoin ETF trading, the nine newborn ETFs saw a modest net inflow of $14.8 million when compared to the GBTC outflows, according to <a href=\"https:\/\/x.com\/BitMEXResearch\/status\/1751145871742324768?s=20\" data-v-f87c67ca=\"\">Bitmex Research<\/a>. Bitcoin's price gains recently pushed BlackRock's ETF over the <a href=\"https:\/\/www.theblock.co\/post\/274701\/bitcoins-price-gains-push-blackrocks-etf-above-2-billion-in-assets-under-management\" data-v-f87c67ca=\"\">$2 billion mark<\/a> of assets under management.&nbsp;"],"hashtag":[]}