{"summary":"EthSign is a decentralized application that’s using Web3 technology to record contracts on the Ethereum blockchain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/112449\/ethereum-based-project-ethsign-raises-seed-funding-to-put-signed-documents-on-the-blockchain","publishDate":"2021-07-26T21:00:02","id":2456,"type":null,"title":"EthSign raises seed funding to put signed documents on the blockchain","category":["THE BLOCK"],"content":["<span data-v-f87c67ca=\"\">Signing contracts is pretty unavoidable when it comes to employment, renting an apartment, and other day-to-day processes. But what if there was a way to sign documents on a platform like DocuSign, but in a fully decentralized way?&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Singapore-based startup <a href=\"https:\/\/ethsign.xyz\/\" data-v-f87c67ca=\"\">EthSign<\/a> is aiming to do just that.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The startup announced today that it raised $650,000 in a seed round in June led by early-stage venture capital firm Draper Associates, with backing from blockchain investors including Hashkey Capital and ImToken Ventures.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The EthSign team plans to use the new funding to grow its 10-person team by hiring more developers and legal consultants, as well as partner with other organizations in the marketplace.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The e-signing decentralized application is built with Web3 technology and uses decentralized identifiers (DIDs), storage, and smart contracts to provide the same functionality as a Web2 application, but on the Ethereum blockchain. According to co-founder Potter Li, over 200 contracts have been signed on the platform by more than 500 users. The team has deployed EthSign on Layer 2 solutions Polygon and Arbitrum and plans to deploy to additional L2s in the future.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">EthSign is not the only platform that is working to put contracts on the blockchain. <\/span><a href=\"http:\/\/www.opensig.net\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">OpenSig<\/span><\/a><span data-v-f87c67ca=\"\"> is another project that could enable users to sign electronic documents without using a third party. It uses the Bitcoin blockchain instead of Ethereum. However, it’s currently only in the proof-of-concept phase.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In addition to just virtually signing contracts on the blockchain, EthSign has also introduced the concept of self-executing “smart agreements.” The dapp rolled out the feature last month when it launched EthSign 3.0, a new version of the program with a revamped user interface.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For instance, if a company based in the United States hires engineers from outside the country, it can establish a smart agreement with the employees. With the help of a smart contract, the company can set trigger conditions, or the work the employee has to complete in order to trigger the smart contract, and escrow funds, or the compensation the employee will receive for completing said work. Once the employee completes the work, a Chainlink oracle will detect it and trigger the condition for the smart contract so the funds can be paid out automatically.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to EthSign co-founder Potter Li, this will make it easier for employees to get paid on time, as soon as they complete their assigned work.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“In the e-signing industry, what you sign is often very private and needs to be secured in good hands. Web2 companies cannot do this because they are constrained by their business model and are centralized,” Li told The Block. “On the blockchain, things are decentralized and secure because only the involved parties can see the documents. We, the platform, don’t have any control over the data.”<\/span>","<span data-v-f87c67ca=\"\">According to Li, EthSign maintains employer and employee privacy by storing all contracts in decentralized storage networks like Filecoin and IPFS. Only the parties involved in the contract have access to its actual contents. The Ethereum blockchain is used for knowing that a contract has been signed and for triggering payments via smart contracts.<br data-v-f87c67ca=\"\">\n<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Singapore","content":"LOCATION"},{"type":"EthSign","content":"ORGANIZATION"},{"type":"Draper Associates","content":"ORGANIZATION"},{"type":"Potter Li","content":"PERSON"},{"type":"$650,000","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"ImToken Ventures","content":"ORGANIZATION"},{"type":"Hashkey Capital","content":"ORGANIZATION"},{"type":"Chainlink oracle","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"}],"hashtag":["ETHEREUM"],"authors":["Saniya More","The Block"]}