{"summary":"The former FTX CEO has being paying with mackerel in prison — although as a crypto owner he should be used to dealing with not real money.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/264546\/sbf-paid-for-his-haircut-with-fish-in-prison","publishDate":"2023-11-23T15:43:30","id":2464,"type":null,"title":"From macro to mackerel: Sam Bankman-Fried paid for haircut with fish, says WSJ","category":["PEOPLE"],"content":["Sam Bankman-Fried, the disgraced founder of crypto exchange FTX and trading firm Alameda Research, has quickly adapted to the economic realities of prison life at New York's Metropolitan Detention Center, utilizing fish to pay for a haircut, the Wall Street Journal <a href=\"https:\/\/www.wsj.com\/finance\/currencies\/sam-bankman-frieds-life-behind-bars-crypto-tips-and-paying-with-fish-858097c6\" data-v-f87c67ca=\"\">reported<\/a>, citing people familiar with the matter.","Learning from inmates, including a former Honduran president and a Mexico top cop, the former Jane Street trader finds himself a long way from the $30 million <a href=\"https:\/\/www.theblock.co\/post\/189018\/ftx-bankman-frieds-parents-bought-bahamas-property-worth-121-million-reuters\" data-v-f87c67ca=\"\">Bahamas penthouse<\/a> crypto-billionaire lifestyle, swapping trading in high-value digital assets to become a mackerel trader — the go-to currency in federal prisons since a ban on cigarettes in 2004.","The trend of using food items like mackerel, known colloquially as “macks” among inmates, as currency in prisons highlights a system where stable, tangible commodities have replaced inaccessible traditional money.","Macks are not immune to the inflationary pressures of the outside world, however, nor prison demand, with a pouch of mackerel filets reportedly costing $1.30 through the Brooklyn jail’s commissary, up 30% from $1 in 2020.","Prison consultant Bill Baroni, who also spent time in jail, told the WSJ he paid four macks for his own haircut while inside. “The mack currency system is far more stable than crypto,” Baroni added.","While Bankman-Fried’s digital asset trading days are over, he has been seen offering crypto tips to prison guards, one source told the WSJ.","A Federal Bureau of Prisons spokesman told the WSJ it couldn’t comment on the conditions for any individual in its custody for privacy and security reasons.&nbsp;","“Sam’s doing the best he can under the circumstances,” Bankman-Fried’s spokesperson, Mark Botnick, told the WSJ.","Currently awaiting sentencing on charges including wire fraud and money laundering, Bankman-Fried was spotted with a <a href=\"https:\/\/www.theblock.co\/post\/254630\/inside-the-courtroom-sbfs-quiet-first-day-in-court\" data-v-f87c67ca=\"\">polished new haircut<\/a> in recent court appearances.","Bankman-Fried was <a href=\"https:\/\/www.theblock.co\/post\/261240\/sam-bankman-fried-convicted-on-all-counts-report\" data-v-f87c67ca=\"\">convicted<\/a> on Nov. 2 on all seven criminal counts of defrauding the customers, lenders and investors of FTX, the crypto exchange he led until its dramatic collapse a year ago, which saw customers lose billions in what prosecutors called \"one of the biggest financial frauds in U.S. history.\"","He faces up to 115 years in prison, with sentencing set for March 28. Yesterday, the U.S. Court of Appeals for the Second Circuit <a href=\"https:\/\/www.theblock.co\/post\/264375\/court-denies-sam-bankman-frieds-latest-request-for-release\" data-v-f87c67ca=\"\">denied<\/a> Bankman-Fried’s latest release attempt, meaning he will have to stay in jail as his lawyers try to appeal his case.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"WSJ","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"March 28","content":"DATE"},{"type":"$1.30","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Second Circuit","content":"ORGANIZATION"},{"type":"$1","content":"MONEY"},{"type":"30%","content":"PERCENT"},{"type":"New York","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Federal Bureau of Prisons","content":"ORGANIZATION"},{"type":"Sam’s","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"2004","content":"DATE"},{"type":"Mark Botnick","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Baroni","content":"PERSON"},{"type":"U.S. Court of Appeals","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Mexico","content":"LOCATION"},{"type":"$30 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Bahamas","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"Nov. 2","content":"DATE"},{"type":"Brooklyn","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"Bill Baroni","content":"PERSON"}],"hashtag":["COURT HEARINGS","FTX","SAM BANKMAN-FRIED"],"authors":["James Hunt","The Block"]}