{"summary":"NFT Worlds is embarking a new chapter with a new name and node sale that it hopes will entice users to join its community and earn rewards.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280211\/minecraft-based-crypto-project-nft-worlds-charts-comeback-with-node-sale-and-rebrand","publishDate":"2024-03-01T13:06:54","id":2465,"type":null,"title":"Minecraft-based crypto project NFT Worlds charts comeback with node sale and rebrand","category":["GAMING"],"content":["Minecraft's ban of non-fungible tokens decimated NFT Worlds, a project which relied on the Microsoft-owned game's implicit approval. Now, the team behind the project is hoping for a new beginning.&nbsp;","NFT Worlds, since rebranded as Hychain Games, the developer of the crypto video game Hytopia, is launching a node sale for Hychain, the game's Layer 2 blockchain. The company said Hychain is based on Arbitrum’s Orbit technology.","Free-to-play Hytopia, which looks to be heavily inspired by Minecraft, is slated to release an \"invite only\" beta version of the game by the end of the first quarter, according to a statement. Hytopia's beta has more than 1 million players pre-registered, the statement also said. \"Hytopia emerged from the vision of transforming the Minecraft experience with blockchain technology,\" Hychain Games said in its statement. \"Compared with Minecraft, Hytopia leverages web3 functionality to introduce player-driven economies and real ownership of in-game assets.\"","NFT Worlds had its world turned upside down in the summer of 2022 by Mojang Studios, the Swedish developer of Minecraft, when it <a href=\"https:\/\/www.theblock.co\/post\/159002\/nft-worlds-to-have-plan-of-action-by-end-of-week-following-minecraft-nft-ban\" data-v-f87c67ca=\"\">banned NFT integrations<\/a>. NFT Worlds had used Minecraft's source code as a basis for its NFT-powered metaverse. At one point, NFT Worlds' non-fungible tokens had generated tens of millions of dollars in transaction revenue, <a href=\"https:\/\/www.vice.com\/en\/article\/k7bw3m\/minecraft-nft-project-implodes-after-minecraft-bans-nfts\" data-v-f87c67ca=\"\">according to a report<\/a>.","<span data-v-f87c67ca=\"\">A look at Hytopia. Image: Hychain's website.<\/span>","Hytopia's developers are hoping that the Hychain node sale will serve \"as an invitation to the global gaming community to earn rewards for helping to ensure the operation and security of Hytopia's underlying network.\"","\"We're giving back to the community and incentivizing participation in network security,\" Hytopia and Hychain's pseudonymous co-founder ArkDev said in the statement. \"By decentralizing the operation of our network, we're handing over the keys to the community, empowering them to shape the future of gaming.\"","Hychain Games also said the node sale will unfurl in five phases with the first four phases \"exclusively accessible to whitelisted members.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"\" Hytopia","content":"LOCATION"},{"type":"Minecraft","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"end of the first quarter","content":"DATE"},{"type":"Minecraft","content":"LOCATION"},{"type":"Hychain Games","content":"PERSON"},{"type":"Hytopia","content":"LOCATION"},{"type":"Hychain","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Minecraft","content":"ORGANIZATION"},{"type":"summer of 2022","content":"DATE"},{"type":"tens of millions of dollars","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Arbitrum’s Orbit","content":"ORGANIZATION"},{"type":"\" Hychain Games","content":"ORGANIZATION"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"ArkDev","content":"PERSON"},{"type":"Mojang Studios","content":"ORGANIZATION"}],"hashtag":["GAME"],"authors":["RT Watson","The Block"]}