{"summary":"Since Sui’s Layer 1 blockchain launched its mainnet in early May, its native token has dropped from a high of $1.40 to approximately $0.48.\nPeople selling off “Community Reserve” tokens could be the reason for the significant and rapid decline.","author":["RT Watson","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246303\/suis-diving-price-likely-due-to-sell-off-of-community-tokens","publishDate":"2023-08-18T13:01:44","id":2467,"type":null,"title":"Sui&#x27;s diving price likely due to sell-off of &#x27;Community&#x27; tokens","category":["Layer 1s"],"content":["<span data-v-f87c67ca=\"\">Since launching on mainnet, the native token of Mysten Labs’ Sui blockchain has tanked by 66% in roughly three and half months.<\/span>","<span data-v-f87c67ca=\"\">When Sui’s Layer 1 blockchain <a href=\"https:\/\/www.theblock.co\/post\/229236\/mysten-labs-sui-mainnet\" data-v-f87c67ca=\"\">launched its mainnet<\/a> in early May, the price of its native token hit a high of $1.40. Since then, the price has dropped to about $0.48, according to CoinGecko data, causing the market cap to plummet from a high of about $740 million to as low as $343 million yesterday.<\/span>","<span data-v-f87c67ca=\"\">The reason for the rapid price deterioration, according to The Block Research’s Director Steven Zheng, could be attributed to sales by users allocated tokens from Sui’s supply of “Community Reserve” looking to cash in.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">“<\/span><span data-v-f87c67ca=\"\">The Community Reserve, managed by the Sui Foundation, owns more than half of all SUI tokens and they will be used across a variety of community programs,” <a href=\"https:\/\/blog.sui.io\/sui-token-allocation\/\" data-v-f87c67ca=\"\">according to the project<\/a>.<\/span>","<span data-v-f87c67ca=\"\">Those to receive the tokens included, according to Sui, “community-run validators” and \"developers, community ambassadors, and other participants who are building on Sui.\" The project also said it has \"has set aside a substantial amount of tokens to subsidize stake rewards in the network’s early innings.\"<\/span>","<span data-v-f87c67ca=\"\">While the lowered price might be attractive to retail investors hoping to buy Sui low and sell high, the dramatic decline of the asset's market cap could prove problematic come June 2024, when the project's founders and early investors are finally able to sell their tokens into the market, said Zheng.<\/span>","<span data-v-f87c67ca=\"\">Although he added that even if Sui's token loses the vast majority of its initial market cap, the project's founders and early investors could still easily net hundreds of millions of dollars.<\/span>","<span data-v-f87c67ca=\"\">Less than a year ago Mysten Labs, the creator of Sui, <a href=\"https:\/\/www.theblock.co\/post\/168532\/mysten-labs-sui-blockchain-fundraise-ftx-ventures\" data-v-f87c67ca=\"\">closed a $300 million fundraise<\/a> at a valuation that tops $2 billion. The round included FTX Ventures and a16z, although Mysten has since <a href=\"https:\/\/www.theblock.co\/post\/226502\/mysten-ftx\" data-v-f87c67ca=\"\">bought back<\/a> the FTX stake.<\/span>","<span data-v-f87c67ca=\"\">Mysten has been touted as one of the highest-profile new blockchain companies after being founded by five former Meta employees that worked on crypto initiatives for the tech giant like the Novi Financial wallet and Move, the coding language used by both Sui and Meta’s <\/span><a href=\"https:\/\/www.theblockcrypto.com\/news+\/114371\/future-of-diem-hangs-in-the-balance-as-novi-looks-for-an-alternative\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">ill-fated blockchain<\/span><\/a><span data-v-f87c67ca=\"\"> Diem.<\/span>&nbsp;"],"hashtag":[]}