{"summary":"A group of House and Senate Democratic lawmakers sent a letter to Texas’ power authority requesting more information into the state’s dealings with crypto mining.\nThe letter cites multiple studies and investigations showing what lawmakers contend are troubling effects of mining’s power usage.\nThe group also took issue with Texas’ use of subsidies for crypto miners.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176772\/congressional-lawmakers-pose-questions-on-crypto-mining-to-texas-power-authority","publishDate":"2022-10-12T16:13:28","id":2468,"type":null,"title":"Congressional lawmakers pose questions on crypto mining to Texas power authority","category":["Policy"],"content":["A group of Democratic lawmakers from the House of Representatives and Senate has <a href=\"https:\/\/www.warren.senate.gov\/imo\/media\/doc\/Letter%20to%20ERCOT%20re%20Cryptomining.pdf\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">sent a letter<\/a> to Texas' power authority requesting more insight into crypto mining operations.","Senators Elizabeth Warren (D-MA), Sheldon Whitehouse (D-RI) and Edward Markey (D-MA) joined forces with Congress members Al Green (D-TX), Katie Porter (D-CA), Jared Huffman (D-CA) and Rashida Tlaib (D-MI) to address their \"concerns about the states unreliable electricity market and the potential for mining to add to the stress on the state's power grid\" with ERCOT.","After significant discussion of data they say illustrates the risks of crypto mining, lawmakers included a series of questions for ERCOT, including what the annual electricity consumption and carbon expenditures are for Texan crypto mining, future plans of firms to scale in Texas, how the state plans to scale the grid in kind and what kind of estimates or modeling ERCOT uses to estimate the impact of crypto mining.","Texas has become a hub for miners in recent years, and lawmakers say they're worried that the Electric Reliability Council of Texas (ERCOT) is participating in the growth. Indeed, the lawmakers' letter to ERCOT cites comments from ERCOT interim CEO Brad Jones saying Texas is aiming to become the world's largest mining center.&nbsp;&nbsp;","The lawmakers cited a series of studies and investigations that they say show mining is increasing production and creating what they consider to be \"substantial amounts of carbon emissions and other adverse air quality impacts.\" In addition, they're taking issue with subsidies that ERCOT pays to miners for powering down during peak usage periods.","Those in favor of crypto mining contend that Texas' de-regulated energy system incentivizes miners to shut off during peak usage because the price reaches a level where it's not profitable to mine. Energy usage costs too much at those times to be offset by mined bitcoin. But lawmakers say the state has made a win-win for miners and undercut this argument by offering subsidies to miners who shut off during peak usage periods.&nbsp;","\"In simple terms, the Bitcoin miners make money from mining that produces major strains on the electric grid: and during peak demand when the profitability of continuing to mine decreases, they then collect subsidies in the form of demand response payments when they shut off their mining operations and do nothing,\" said the letter.","Lawmakers ask that ERCOT respond to their questions by the end of October."],"hashtag":["CONGRESS","MINING"]}