{"summary":"A guilty plea from Karl Sebastian Greenwood, co-founder of fraudulent OneCoin, is the latest turn in the multibillion-dollar fraud case.\nThe pyramid scheme resulted in more than $4 billion in losses for defrauded investors, according to officials.\nGreenwood’s accomplice and OneCoin co-founder, Ruja Ignatova, remains a fugitive at large.","author":["Jeremy Nation","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195825\/onecoin-co-founder-karl-sebastian-greenwood-pleads-guilty-doj","publishDate":"2022-12-16T13:53:06","id":2469,"type":null,"title":"OneCoin co-founder Karl Sebastian Greenwood pleads guilty: DOJ","category":["Legal"],"content":["<span data-v-f87c67ca=\"\">Karl Sebastian Greenwood pled guilty to wire fraud and money laundering connected to the fraudulent OneCoin scheme, the Department of Justice <a href=\"https:\/\/www.justice.gov\/usao-sdny\/pr\/co-founder-multi-billion-dollar-cryptocurrency-pyramid-scheme-onecoin-pleads-guilty\" data-v-f87c67ca=\"\">announced<\/a>.<\/span>","<span data-v-f87c67ca=\"\">Greenwood co-founded OneCoin along with so-called “Crypto Queen”-turned-fugitive Ruja Ignatova in 2014, after which the two perpetrated a multibillion-dollar global scam.<\/span>","<span data-v-f87c67ca=\"\">“Greenwood and his co-conspirators, including fugitive Ruja Ignatova, conned unsuspecting victims out of billions of dollars, claiming that OneCoin would be the ‘Bitcoin killer.’&nbsp; In fact, OneCoins were entirely worthless,” said U.S. Attorney Damian Williams.<\/span>","<span data-v-f87c67ca=\"\">Emails between Ignatova and Greenwood suggest a ploy to take advantage of investors. As they corresponded, the two plotted to simulate volatility and fix exchange prices. An estimate suggests victims invested over $4 billion in funds, according to the DOJ.<\/span>","<span data-v-f87c67ca=\"\">Ignatova, who remains on the Federal Bureau of Investigation’s <a href=\"https:\/\/www.fbi.gov\/wanted\/topten\/ruja-ignatova\" data-v-f87c67ca=\"\">top 10<\/a> most wanted list, is still at large.<\/span>"],"hashtag":["CRIME","LAWSUITS"]}