{"summary":"Nvidia confirmed that its second-quarter earnings missed its expectations.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/165613\/nvidia-misses-on-q2-earnings-as-gaming-revenue-plunges-33","publishDate":"2022-08-24T19:58:44","id":2472,"type":null,"title":"Nvidia misses on Q2 earnings as gaming revenue plunges 33%","category":["COMPANIES"],"content":["Nvidia confirmed that its second-quarter earnings missed its outlook, largely driven by a double-digit decline in gaming revenues.&nbsp;","“We are navigating our supply chain transitions in a challenging macro environment and we will get through this,” Nvidia CEO and founder Jensen Huang said in a statement regarding the computing hardware company's second-quarter earnings for the 2023 fiscal year.","Nvidia's gaming revenues were down 33% year-over-year, totaling $2.04 billion. That represents a 44% decline from the first quarter.","The company's gaming segment faced \"challenging market conditions\" in the second quarter, Nvidia Chief Financial Officer Colette Kress told investors on an earnings call today. While Nvidia had been expecting a decline in gaming revenue since May due to factors such as the war in Ukraine and COVID-19 lockdowns in China, Kress said the drop was \"sharper than anticipated\" and that \"macroeconomic headwinds across the world drove a sudden slowdown in consumer demand.\"&nbsp;","\"As noted last quarter, we had expected cryptocurrency mining to make a diminishing contribution to gaming demand; we are unable to accurately quantify the extent to which reduced crypto mining contributed to the decline in gaming demand,\" Kress said on the call.&nbsp;&nbsp;","Nvidia reported overall second-quarter revenues of $6.7 billion, up 3% from the same period a year earlier. Its net income was $656 million, down 72% year-over-year.&nbsp;","That $6.7 billion revenue figure matches the estimate Nvidia provided in a preliminary earnings <a href=\"https:\/\/nvidianews.nvidia.com\/news\/nvidia-announces-preliminary-financial-resultsfor-second-quarter-fiscal-2023\" data-v-f87c67ca=\"\">update<\/a> on August 8, when it warned the market that it was expecting a $1.4 billion revenue shortfall for the second quarter compared with its outlook of $8.1 billion.&nbsp;","Nvidia also saw a 4% decline in its second-quarter revenues for its professional visualization segment compared with the previous-year period. This segment includes Nvidia's metaverse projects, which include a partnership with Siemens aimed at developing an \"industrial metaverse\" for the manufacturing industry. The company also recently unveiled new technologies related to the metaverse, such as new services to help developers create avatars.","Nvidia also plans to announce \"breakthroughs\" in the metaverse and artificial intelligence at its GTC conference, scheduled for&nbsp; September 19-22, Huang said in a statement.&nbsp;","Nvidia is expecting revenue declines in the gaming and professional visualization segments to continue in the third quarter, and forecasts third-quarter company revenues to be within 2% of $5.9 billion.&nbsp;","\"Gaming and professional visualization revenue are expected to decline sequentially, as OEMs [original equipment manufacturers] and channel partners reduce inventory levels to align with current levels of demand and prepare for Nvidia's new product generation,\" the chip company said.&nbsp;","&nbsp;","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$5.9 billion","content":"MONEY"},{"type":"2%","content":"PERCENT"},{"type":"May","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"Jensen Huang","content":"PERSON"},{"type":"44%","content":"PERCENT"},{"type":"72%","content":"PERCENT"},{"type":"22","content":"DATE"},{"type":"quarter","content":"DATE"},{"type":"Siemens","content":"ORGANIZATION"},{"type":"Huang","content":"PERSON"},{"type":"Nvidia Chief Financial Officer Colette Kress","content":"ORGANIZATION"},{"type":"$2.04 billion","content":"MONEY"},{"type":"last quarter","content":"DATE"},{"type":"Kress","content":"PERSON"},{"type":"third quarter","content":"DATE"},{"type":"second quarter","content":"DATE"},{"type":"$656 million","content":"MONEY"},{"type":"August 8","content":"DATE"},{"type":"$1.4 billion","content":"MONEY"},{"type":"3%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"19","content":"DATE"},{"type":"$6.7 billion","content":"MONEY"},{"type":"Nvidia","content":"ORGANIZATION"},{"type":"33%","content":"PERCENT"},{"type":"first quarter","content":"DATE"},{"type":"$8.1 billion","content":"MONEY"},{"type":"GTC","content":"ORGANIZATION"},{"type":"September 19","content":"DATE"},{"type":"China","content":"LOCATION"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["EARNINGS"],"authors":["Kristin Majcher","The Block"]}