{"summary":"Solana&#x27;s premiere payment tool Solana Pay has integrated with one of the largest e-commerce platforms, Shopify.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246974\/solana-pay-integrates-with-shopify-for-digital-dollar-currency-payments","publishDate":"2023-08-23T10:04:02","id":2477,"type":null,"title":"Solana Pay integrates with Shopify for digital dollar currency payments","category":["LAYER 1S"],"content":["Solana's payment system Solana Pay has integrated with the e-commerce giant Shopify.&nbsp;","“Solana Pay on Shopify opens up millions of merchants to a more dynamic and efficient payment choice, while consumers get the convenience and increased utility of being able to pay for goods and services with digital dollar currencies from the vast network of merchants using Shopify,” Solana Foundation Head of Commerce Business Development Josh Fried said in a <a href=\"https:\/\/solana.com\/news\/solana-pay-shopify\" data-v-f87c67ca=\"\">statement<\/a>.","Solana Labs <a href=\"https:\/\/www.theblock.co\/post\/132644\/solana-pay-launch-payments-protocol-digital-commerce\" data-v-f87c67ca=\"\">launched<\/a> Solana Pay in February of 2022 as a way to allow merchants to accept cryptocurrency payments from customers. Solana Pay lets buyers and sellers interact directly with USD stablecoins compatible with Solana, and the platform eliminates bank fees, chargebacks and holding times.","Shopify has facilitated over $444 billion in economic activity and is available in 170 countries, according to the platform's website. The firm has made other moves into web3, such as allowing merchants to add NFT-based <a href=\"https:\/\/www.theblock.co\/linked\/153423\/shopify-allows-merchants-to-add-utility-to-nfts\" data-v-f87c67ca=\"\">loyalty<\/a> rewards and to sell NFTs <a href=\"https:\/\/www.theblock.co\/linked\/112539\/shopify-nft-e-commerce-customers\" data-v-f87c67ca=\"\">directly<\/a> to customers.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Solana Pay on Shopify","content":"ORGANIZATION"},{"type":"Solana Foundation Head of Commerce Business Development Josh Fried","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Solana Pay","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"February of 2022","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"$444 billion","content":"MONEY"}],"hashtag":["PAYMENTS","SOLANA"],"authors":["MK Manoylov","The Block"]}