{"summary":"The Bored Ape NFT, worth at least $190,000, was blocked on OpenSea after a court injunction in Singapore over a loan deal gone bad.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/147814\/opensea-disables-bored-ape-nft-amid-legal-case-in-singapore","publishDate":"2022-05-20T05:04:10","id":2479,"type":null,"title":"OpenSea disables Bored Ape NFT amid legal case in Singapore","category":["NFTS"],"content":["OpenSea has <a href=\"https:\/\/opensea.io\/assets\/ethereum\/0xbc4ca0eda7647a8ab7c2061c2e118a18a936f13d\/2162\" data-v-f87c67ca=\"\">disabled<\/a> trading for a Bored Ape Yacht Club (BAYC) non-fungible token on its platform amid an ongoing court <a href=\"https:\/\/www.judiciary.gov.sg\/hearing-list\/hearing-list-details\/ds-1-491764\" data-v-f87c67ca=\"\">case<\/a> in Singapore.","The item in question, BAYC #2162, is now marked with a “reported for suspicious activity” tag on OpenSea, the world's largest NFT marketplace. This tag prevents the current owner from being able to list the NFT for sale. Prospective buyers also cannot place offers for the item.<b data-v-f87c67ca=\"\"><\/b>","An individual called Rajesh Rajkumar was able to secure an injunction from the Singapore High Court blocking the sale after a loan agreement with pseudonymous NFT collector chefpierre.eth soured, according to a <a href=\"https:\/\/www.judiciary.gov.sg\/hearing-list\/hearing-list-details\/ds-1-491764\" data-v-f87c67ca=\"\">court filing<\/a> and a <a href=\"https:\/\/www.withersworldwide.com\/en-gb\/insight\/withers-obtains-asia-s-first-nft-freezing-injunction\" data-v-f87c67ca=\"\">statement<\/a> from Singaporean law firm Withers KhattarWong.","According to the law firm, both parties entered into an NFT loan agreement on March 19 with a subsequent refinancing deal a month later. This transaction was carried out on NFTfi, an <a href=\"https:\/\/www.theblockcrypto.com\/news+\/138014\/nft-finance-part-1-demand-is-exploding-for-loans-backed-by-nfts\" data-v-f87c67ca=\"\">NFT lending platform<\/a>.","Rajkumar used BAYC #2162 as collateral for the loan with both parties agreeing on an extension clause for the refinanced loan, according to the law firm’s statement. The plaintiff was unable to pay back the loan at the due date but still had the option to extend this date as previously agreed upon.","According to Withers, chefpierre did not abide by the extension agreement but foreclosed on the loan. This action released the NFT from the platform’s escrow to chefpierre’s wallet.","The BAYC floor <a href=\"https:\/\/opensea.io\/collection\/boredapeyachtclub\" data-v-f87c67ca=\"\">price<\/a>, the market value of the cheapest item in the collection, is currently at 96 ETH ($190,000).&nbsp;","\"While we don't offer details about enforcement actions on individual collections, I can share that our platform policies and Terms of Service explicitly prohibit the use of OpenSea to buy, sell or transfer stolen items, fraudulently obtained items, items taken without authorization and\/or any other illegally obtained items or launder money,\" a spokesperson for OpenSea told The Block.","Chefpierre hasn't responded to The Block’s request for comments as of the time of publishing.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Terms of Service","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"March 19","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Singapore High Court","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$190,000","content":"MONEY"},{"type":"Singapore","content":"LOCATION"},{"type":"2162","content":"DATE"},{"type":"Rajesh Rajkumar","content":"PERSON"},{"type":"Withers","content":"ORGANIZATION"},{"type":"Withers KhattarWong","content":"ORGANIZATION"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}