{"summary":"Republican senators have a bone to pick with the SEC Chair over inaccurate statements the agency made in its DEBT Box lawsuit.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276800\/republican-senators-tell-gensler-theyre-troubled-over-sec-inaccuracies-in-debt-box-case","publishDate":"2024-02-08T14:44:25","id":248,"type":null,"title":"Republican senators tell Gensler they&#x27;re troubled over SEC inaccuracies in DEBT Box case","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Republican senators have a bone to pick with Securities and Exchange Commission Chair Gary Gensler over inaccurate statements the agency made in its lawsuit against crypto startup DEBT Box.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Sens. Cynthia Lummis of Wyoming, Bill Hagerty of Tennessee, Katie Boyd Britt of Alabama, Thom Tillis of North Carolina and JD Vance of Ohio said the SEC's mission of protecting investors and maintaining fair markets was \"compromised\" by its handling of the case in a letter penned to Gensler on Wednesday.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"We are greatly concerned by the Commission’s conduct in this case,\" they said in the letter. \"It is unconscionable that any federal&nbsp; agency—especially one regularly involved in highly consequential legal procedures and one that, under your leadership, has often pursued its regulatory mission through enforcement actions&nbsp; rather than rulemakings—could operate in such an unethical and unprofessional manner.\"&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The SEC first sued <\/span><span class=\"s3\" data-v-f87c67ca=\"\">Digital Licensing Inc., doing business as DEBT Box, in July, for defrauding thousands of investors of at least $49 million by offering customers so-called \"node licenses\" to receive revenue from mining 11 tokens, though they were never mined.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">The agency later said in late <a href=\"https:\/\/www.theblock.co\/post\/269087\/sec-admits-it-made-inaccurate-statements-in-utah-crypto-case\" data-v-f87c67ca=\"\">December<\/a> that it made inaccurate statements and said it \"fell short\" of the expectations to be accurate and candid in the court. Utah U.S. District Court Judge Robert Shelby had criticized the agency's lawyers and ordered the SEC to explain \"false or misleading\" statements after it claimed the company was trying to move assets overseas in order to escape the regulator's jurisdiction.<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">The SEC told the court last week that it <a href=\"https:\/\/www.theblock.co\/post\/275276\/sec-plans-to-dismiss-case-against-debt-box-after-admitting-inaccurate-statements-were-made\" data-v-f87c67ca=\"\">planned<\/a> to dismiss the case against DEBT Box without prejudice, meaning the SEC can still refile its case.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">\"R<\/span><span class=\"s1\" data-v-f87c67ca=\"\">egardless of whether Commission staff deliberately misrepresented&nbsp; evidence or unknowingly presented false information, this case suggests other enforcement cases brought by the Commission may be deserving of scrutiny,\" the senators said in their letter. \"It is difficult to maintain confidence&nbsp; that other cases are not predicated upon dubious evidence, obfuscations, or outright&nbsp; misrepresentations.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC did not immediately respond to a request for comment.&nbsp;<\/span>","The American Securities Association, a trade group representing regional financial services firms, also criticized the SEC's handling of the case.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">“The SEC Director of Enforcement holds a position of trust and confidence, and the American people expect him to act with the highest ethical and moral conduct,\" said Chris Iacovella, CEO of ASA in a statement. \"Instead of upholding that standard, his division intentionally misled a federal court in pursuit of a political agenda against an industry the SEC doesn’t like.”<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Lawmakers, many Republicans, in Washington have been critical of Chair Gensler's approach to regulating crypto. Gensler has said many cryptocurrencies are securities and has brought charges against large crypto exchanges who he says need to register with the agency.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Sen. Hagerty, who signed this week's letter, has said that Gensler's \"posture\" is <a href=\"https:\/\/www.theblock.co\/post\/249781\/us-senator-hagerty-calls-for-incremental-approach-in-drafting-bills-to-regulate-crypto\" data-v-f87c67ca=\"\"><span class=\"s5\" data-v-f87c67ca=\"\">hurtful<\/span><\/a> to the industry. Others are working on bills to regulate the industry, including a bill focused on stablecoins. Top Democrat of the House Financial Services Committee Maxine Waters of California told <a href=\"https:\/\/subscriber.politicopro.com\/article\/2024\/02\/waters-lawmakers-very-very-close-on-stablecoin-deal-00140240\" data-v-f87c67ca=\"\"><span class=\"s5\" data-v-f87c67ca=\"\">Politico<\/span><\/a> on Wednesday that negotiators are \"very, very close\" to reaching agreement on that stablecoin bill after talks over the summer dissolved over <\/span><span class=\"s6\" data-v-f87c67ca=\"\">a <a href=\"https:\/\/www.theblock.co\/post\/241749\/us-stablecoin-talks-stall-as-senior-house-republican-blames-white-house\" data-v-f87c67ca=\"\"><span class=\"s7\" data-v-f87c67ca=\"\">provision<\/span><\/a> that allows state regulators to approve stablecoin issuances without Federal Reserve input.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Digital Licensing Inc.","content":"ORGANIZATION"},{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Robert Shelby","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Tennessee","content":"LOCATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Hagerty","content":"PERSON"},{"type":"House Financial Services Committee Maxine Waters of California","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Thom Tillis","content":"PERSON"},{"type":"Cynthia Lummis","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Commission","content":"ORGANIZATION"},{"type":"American Securities Association","content":"ORGANIZATION"},{"type":"Bill Hagerty","content":"PERSON"},{"type":"JD Vance of Ohio","content":"ORGANIZATION"},{"type":"$49 million","content":"MONEY"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Chris Iacovella","content":"PERSON"},{"type":"Wyoming","content":"LOCATION"},{"type":"ASA","content":"ORGANIZATION"},{"type":"Katie Boyd Britt","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"North Carolina","content":"LOCATION"},{"type":"Alabama","content":"LOCATION"},{"type":"Utah U.S. District Court","content":"ORGANIZATION"},{"type":"SEC Director of Enforcement","content":"ORGANIZATION"},{"type":"summer","content":"DATE"}],"hashtag":["SEC"],"authors":["Sarah Wynn","The Block"]}