{"summary":"CoinDCX has raised $3 million in Series A funding\nThe round was led by HDR Group, Polychain Capital and Bain Capital Ventures\nSumit Gupta, co-founder and CEO of CoinDCX, told The Block that the exchange plans to expand its services and double its team of 50","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/59657\/bitmex-operator-polychain-lead-3m-series-a-for-indian-crypto-exchange-coindcx","publishDate":"2020-03-23T21:00:27","id":2480,"type":null,"title":"BitMEX operator HDR, Polychain lead $3M Series A for Indian crypto exchange CoinDCX","category":["Investments"],"content":["Indian cryptocurrency exchange CoinDCX has raised $3 million in Series A funding.","The round was led by BitMEX operator HDR Group, Polychain Capital and Bain Capital Ventures, with participation from other undisclosed venture capitalists.","With the fresh capital in place, CoinDCX plans to expand its products and services and hire more staff. “With the crypto space in India developing at breakneck speed, we plan to build a new fiat onboarding solution, algorithm-based trading, crypto-to-crypto trading, and introduce new trading pairs,” CoinDCX co-founder and CEO, Sumit Gupta, told The Block.","To that end, the exchange also looks to double its headcount from the current 50 “in the next six months” across functions such as technology, growth, marketing, and support, Gupta told The Block.","The news comes weeks after the Supreme Court of India <a href=\"https:\/\/www.theblockcrypto.com\/post\/57708\/indias-supreme-court-strikes-down-rbis-banking-ban-against-crypto\" data-v-f87c67ca=\"\">lifted<\/a> the banking ban enacted by the Reserve Bank of India in 2018 for the crypto sector. Gupta declined to comment on when CoinDCX began raising for the Series A.","“The recent developments in the cryptocurrency regulatory landscape in India are very encouraging and are likely to accelerate adoption and innovation in this sector. We are excited to be investors in CoinDCX and believe that their talented team and technology will allow them to be the dominant cryptocurrency venue in the region,” said Arthur Hayes, co-founder and CEO of BitMEX and HDR Group.","Polychain Capital’s founder Olaf Carlson-Wee echoed, saying that the Supreme Court’s decision is “an encouraging sign for the broader cryptocurrency ecosystem in India, and we are confident that there is huge potential growth in this market.”","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">‘Exponential’ growth<\/strong><\/span>","Founded in 2018, Mumbai-based CoinDCX claims to have seen “exponential” growth in users since the lifting of the banking ban. “During the ban, CoinDCX had registered more than 35,000 users. Since the ban was lifted, sign-ups on the platform increased by 10x,” Gupta told The Block, adding that the exchange’s top five markets are Surat, Mumbai, Chennai, Bangalore, and Delhi.","Gupta declined to disclose growth in trading volumes but said the average daily trading volume has been around $10-15 million after the ban. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIn comparison, rival WazirX, which is <a href=\"https:\/\/www.theblockcrypto.com\/post\/47852\/binance-acquires-indian-crypto-exchange-wazirx-to-serve-over-1-billion-people-of-the-country\" data-v-f87c67ca=\"\">owned<\/a> by Binance, has seen average volumes of $2-3 million, founder and CEO Nischal Shetty told The Block.","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">$5 trillion economy?<\/strong><\/span>","Looking ahead, CoinDCX aims to grow users further and bring the total number of crypto users in India from the current 5 million to 50 million via its “TryCrypto” initiative. Earlier this month, CoinDCX <a href=\"https:\/\/www.theblockcrypto.com\/post\/58921\/binance-wazirx-launch-50m-token-fund-to-invest-in-indian-blockchain-startups\" data-v-f87c67ca=\"\">launched<\/a> the initiative to commit $1.3 million toward creating awareness and adoption of crypto within India.","As a result of this effort, CoinDCX also plans to contribute to India’s growth into a $5 trillion economy by 2025. “To achieve that target, India’s minimum annual growth rate will need to be greater than 10.8% every year. With India’s current GDP growth falling sharply from 8% last year to 5% in the second quarter of 2019, it is clear that our economy needs a strong boost to hit our target of being a $5 trillion economy. I believe India stands a chance to live up to this goal by embracing the next wave of crypto adoption,” Gupta told The Block.","“Our Series A round is a testament to how crypto can increase foreign investment in the Indian economy and highlights the potential that global players see in the Indian crypto space,” he added.","CoinDCX is also open to raising more funds in the near future. “We look at investments as a strategic tool to help us build better products for the future. Hence if we do receive interest in strategic partnerships, we will be happy to explore these opportunities,” Gupta told The Block.","It remains unclear how much in total CoinDCX has raised to date. Gupta declined to comment on it, as well as the exchange’s valuation. In March 2019, CoinDCX <a href=\"https:\/\/blog.coindcx.com\/coindcx-raises-an-undisclosed-amount-of-seed-funding-from-bain-capital-and-angel-investors\/\" data-v-f87c67ca=\"\">raised<\/a> an undisclosed amount in seed funding, also led by Bain Capital Ventures."],"hashtag":["BITMEX","SERIES A"]}