{"summary":"India&#x27;s Enforcement Directorate has frozen WazirX’s bank balances worth around $8 million. The agency has been investigating WazirX for its alleged role in money laundering.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/161727\/wazirx-bank-balances-frozen-ed-binance-crypto-exchange","publishDate":"2022-08-05T10:08:44","id":2481,"type":null,"title":"Binance-owned exchange WazirX&#x27;s bank balances frozen by Indian authorities","category":["EXCHANGES"],"content":["India's Enforcement Directorate (ED), a law enforcement agency that investigates financial crimes, has frozen bank balances worth 647 million rupees (around $8 million) belonging to WazirX, a local crypto exchange owned by Binance.","ED conducted searches on WazirX co-founder and CTO Sameer Mhatre as part of its money laundering probe against the exchange, according to a <a href=\"https:\/\/enforcementdirectorate.gov.in\/sites\/default\/files\/latestnews\/PR%20HYZO_Freezing%20of%20assets%20of%20WazirX%20Crypto%20Exchange.pdf\" data-v-f87c67ca=\"\">statement<\/a> on Friday.&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/108178\/india-law-enforcement-agency-ed-crypto-exchange-wazirx-fema\" data-v-f87c67ca=\"\">ED has been investigating WazirX<\/a> since last year for its alleged money laundering role linked to Chinese loan apps that were involved in digital lending in India.","Since 2019, most Chinese companies were <a href=\"https:\/\/timesofindia.indiatimes.com\/city\/hyderabad\/nix-licence-of-nbfcs-linked-to-chinese-loan-apps-ed-to-rbi\/articleshow\/93147002.cms\" data-v-f87c67ca=\"\">reportedly<\/a> entering India for lending business by establishing fintech apps, but as the Reserve Bank of India (RBI) was not giving them a non-banking financial company (NBFC) license, they were making agreements with local NBFCs.","As a result, ED has lately been investigating a number of Indian NBFC companies and their fintech partners \"for predatory lending practices in violation of the RBI guidelines and by using tele-callers who misuse personal data and use abusive language to extort high-interest rates from the loan takers,\" the agency said in Friday's announcement.","After the investigations began, many of these fintech apps shut down and diverted away \"huge profits\" through various routes, including crypto, according to ED.","\"ED found that large amount of funds were diverted by the fintech companies to purchase crypto assets and then launder them abroad,\" reads the announcement. \"These companies and the virtual assets are untraceable at the moment.\"","As part of its investigations, ED also issued summons to crypto exchanges and found out that \"maximum amount of funds were diverted to WazirX exchange and the crypto-assets so purchased have been diverted to unknown foreign wallets.\"","WazirX and Mhatre have been uncooperative in helping to trace those funds, according to ED. Mhatre has \"complete remote access to the database of WazirX, but despite that he is not providing the details of the transactions relating to the crypto assets, purchased from the proceeds of crime of Instant Loan APP fraud,\" ED said.","It went on to say that \"the lax KYC [know your customer] norms, loose regulatory control of transactions between WazirX and Binance, non-recording of transactions on blockchains to save costs and non recording of the KYC of the opposite wallets has ensured that WazirX is not able to give any account for the missing crypto assets.\"","WazirX has also made no efforts to trace crypto assets and Binance \"rarely responds to queries on <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"a4c8c1c3c5c8e4c6cdcac5cac7c18ac7cbc9\">[email&nbsp;protected]<\/a>,\" according to ED.","\"We have been fully cooperating with the Enforcement Directorate (ED) for several days and have responded to all their queries fully and transparently,\" WazirX said in a statement to The Block. \"We do not agree with the allegations in the ED press release. We are evaluating our further plan of action.\"","Binance did not respond to The Block's request for comment by press time.","<em data-v-f87c67ca=\"\">Updates with comment from WazirX.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"the Reserve Bank of India","content":"ORGANIZATION"},{"type":"NBFC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Enforcement Directorate (ED)","content":"ORGANIZATION"},{"type":"$8 million","content":"MONEY"},{"type":"fintech","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"NBFCs","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"tele","content":"ORGANIZATION"},{"type":"Enforcement Directorate (ED","content":"ORGANIZATION"},{"type":"India","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"CTO","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"},{"type":"RBI","content":"ORGANIZATION"}],"hashtag":["BINANCE"],"authors":["Yogita Khatri","The Block"]}