{"summary":"“There’s an irony in the midst of this — Satoshi Nakamoto said this was going to be a decentralized system and finance — this has led to centralization,” SEC Chair Gary Gensler said on CNBC.\nGensler also responded to comments from Sen. Elizabeth Warren, D-Mass., on Friday morning. ","author":["Sarah Wynn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/272413\/gensler-sees-bitcoin-etf-irony-in-light-of-satoshis-mission-says-he-respects-sen-warren-and-the-law","publishDate":"2024-01-12T12:11:45","id":2482,"type":null,"title":"Gensler sees bitcoin ETF irony in light of Satoshi&#x27;s mission, says he respects Sen. Warren and the law","category":["Policy"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The launch of spot bitcoin exchange-traded funds is ironic given that it goes against Satoshi Nakamoto's decentralization mission, Securities and Exchange Commission Chair Gary Gensler said in an interview with CNBC on Friday morning.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Nakamoto, the pseudonymous, still unknown creator of the cryptocurrency who wrote the infamous bitcoin <a href=\"https:\/\/bitcoin.org\/bitcoin.pdf,\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">whitepaper<\/span><\/a>, proposed a \"system for electronic transactions without relying on trust,\" in 2008.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"There's an irony in the midst of this — Satoshi Nakamoto said this was going to be a decentralized system and finance — this has led to centralization,\" Gensler said on <a href=\"https:\/\/www.cnbc.com\/video\/2024\/01\/12\/sec-chair-gensler-on-bitcoin-etf-approval-the-underlying-asset-is-highly-speculative-and-volatile.html?&amp;qsearchterm=gary%20gensler\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">CNBC<\/span><\/a>.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Gensler's comments come days after his agency <a href=\"https:\/\/www.theblock.co\/post\/271324\/the-sec-said-it-has-approved-proposals-for-spot-bitcoin-etfs-on-an-accelerated-basis\" data-v-f87c67ca=\"\">approved<\/a> a series of spot bitcoin ETFs, though the chair quickly <a href=\"https:\/\/www.theblock.co\/post\/271755\/gary-gensler-hasnt-changed-his-tone-on-crypto-even-with-sec-approval-of-spot-bitcoin-etfs\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">pointed<\/span><\/a> out that it did not mean the SEC approves or endorses bitcoin. Spot bitcoin ETFs began <a href=\"https:\/\/www.theblock.co\/post\/272331\/spot-bitcoin-etfs-clear-5-billion-of-cumulative-volume-as-second-day-of-trading-kicks-off\" data-v-f87c67ca=\"\">trading<\/a> on Thursday and have since cleared $6 billion of cumulative volume.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Gensler, who previously taught blockchain at the Massachusetts Institute of Technology, said there are innovations in the space around the ledger system.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"No doubt there are innovations within this field and those innovations, which I taught about at MIT around a ledger system, it's just an accounting system called the blockchain technology,\" Gensler said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Gensler was also asked on Friday about criticism from Sen. Elizabeth Warren, D-Mass., who voted to <a href=\"https:\/\/www.senate.gov\/legislative\/LIS\/roll_call_votes\/vote1171\/vote_117_1_00157.htm\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">nominate<\/span><\/a> him to SEC chair in 2021.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Warren slammed the SEC on Thursday in a post on X for approving spot bitcoin ETFs.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The @SECgov is wrong on the law and wrong on the policy with respect to the Bitcoin ETF decision,\" Warren said. \"If the SEC is going to let crypto burrow even deeper into our financial system, then it's more urgent than ever that crypto follow basic anti-money laundering rules.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Gensler said he has \"deep respect for those who may have been on the other side of this,\" while adding he also has that respect for the law.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Gensler was also asked about the potential for a spot Ethereum ETF down the road.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"I look at what we did this week as it's cabined to one non security commodity called bitcoin like we've had gold spot exchange traded products and silver exchange traded products in the past and approved in the past,\" Gensler said. \"This is cabined just to that one non-security commodity token.\"<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span><\/span>"],"hashtag":["SEC","SPOT BITCOIN ETF"]}