{"summary":"A new motion for sanctions in the Kleiman v. Wright case asks the Court to enter case-terminating sanctions for repeated lies, deceit and perjury\nIt’s a persuasive example, with examples of Craig Wright’s untruths\nThere’s a strong likelihood that the Court will enter severe sanctions against Wright, up to and including a case-terminating one.","author":["Stephen Palley","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/66237\/lies-damn-lies-and-perjury-new-motion-against-craig-wright-asks-for-case-terminating-sanctions","publishDate":"2020-05-22T16:58:12","id":2484,"type":null,"title":"Lies, damn lies and perjury: new motion against Craig Wright asks for case-terminating sanctions","category":["Legal"],"content":["<span data-v-f87c67ca=\"\">It’s hard to keep up with all of the ins and outs of the <em data-v-f87c67ca=\"\">Kleiman v. Wrigh<\/em>t lawsuit in Florida, a good deal of which has revolved around whether or not Craig Wright is a liar instead of the substantive merits of the case. There’s also a strong likelihood that the case will end up resolving based on the Court’s assessment of Wright’s conduct, as opposed to who is right or wrong.<\/span>","<span data-v-f87c67ca=\"\">As a reminder: Wright claims among other things that he is Satoshi Nakamoto, the anonymous inventor of bitcoin, that he has thousands of patents, holds multiple graduate degrees (including a law degree) and that he’s been 500 percent more productive than Thomas Edison. Two federal judges have said he’s got a problem with the truth. Now, in a<\/span><a href=\"https:\/\/www.courtlistener.com\/docket\/6309656\/512\/kleiman-v-wright\/\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">new motion for sanctions filed by the plaintiffs in the <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Kleiman v. Wright<\/span><\/i><span data-v-f87c67ca=\"\"> lawsuit<\/span><\/a><span data-v-f87c67ca=\"\"> pending in Florida federal court, the plaintiffs lay out a long list of alleged additional lies. And they say that the Court should enter case-terminating sanctions against Wright.<\/span>","<span data-v-f87c67ca=\"\">If you have been following this case you may recall that a prior order entering very close to case-ending sanctions was vacated for largely procedural reasons by the District Court, and Wright was left to pay Kleiman’s legal fees as a sanction. The second time is not likely to be a charm, however.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Here’s Plaintiffs’ argument, in a nutshell:<\/span>","<span data-v-f87c67ca=\"\">Examples of Wright’s untruths, which range from minor to major, are woven through the brief, painting a picture of a complex game of three-card litigation monte. For example (and there are many), on the minor side: Earlier this year, Wright submitted a document “ostensibly executed on February 15, 2011” which referenced a 2013 statute. He swore that he mined bitcoin into a Panama trust and then denied doing so while under oath in a deposition:<\/span>","","","<span data-v-f87c67ca=\"\">There are so many lies, forgeries and deceptions that the plaintiffs say that they can’t all fit in the motion.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Look, the law here is not that complicated and the deceit is convincingly laid out. Lying in court cases perverts the entire judicial process. Naturally, judges don’t like it. Most lawyers don’t either.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A federal court has the “inherent power” to impose sanctions on a litigant for bad faith conduct like this. Among these sanctions are case-ending ones, where judgment is entered against the defendant.&nbsp; Perjury or lying to a Court is a really good example of the kind of conduct that can cause a federal judge to strike your pleadings and default you. In fact, <a href=\"https:\/\/www.theblockresearch.com\/lies-damn-lies-and-the-blockvest-ico-litigation-64984\" data-v-f87c67ca=\"\">just last week I wrote about how this happened in the Blockvest ICO lawsuit<\/a> brought by the Securities Exchange Commission (SEC).<\/span>","<span data-v-f87c67ca=\"\">Here’s my prediction: Wright is going to respond to all of this with outraged protestations and maybe even his own cross-motion for sanctions. But it won’t work this time. The court is going to decide that the deceit has gone on too long. It may take a little bit of time, but this case is over. The only way for Wright to avoid this — especially after the way his lawyers pulled off an impressive Hail Mary in this case once already — was to play completely straight. The motion outlines all of the ways that Wright allegedly has not.<\/span>","<span data-v-f87c67ca=\"\">I personally think it’s incumbent on the court in this high profile case to show the world that truth matters and that lies won’t be tolerated. It should enter judgment against Wright and end this theater once and for all.&nbsp; Enough is enough.<\/span>"],"hashtag":[]}