{"summary":"Solana-based NFT marketplace Magic Eden has launched a ventures unit to invest in web3 gaming.\nTony Zhao, formerly of Tencent Games, will head Magic Ventures.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157056\/magic-eden-launches-ventures-unit-web3-gaming","publishDate":"2022-07-12T09:00:26","id":2486,"type":null,"title":"Magic Eden launches venture unit to invest in web3 gaming startups","category":["Web3"],"content":["<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Magic Eden, the largest non-fungible token (NFT) marketplace on the Solana blockchain, has launched an investment arm to back the web3 gaming sector.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Announcing the news in a statement on Tuesday, Magic Eden said the new unit, Magic Ventures, will invest in web3 game developers and infrastructure builders. The firm believes that gaming has the potential to bring millions of users to the blockchain.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"The world of gaming is a massive market that has just started to venture into the world of web3,\" Jack Lu, co-founder and CEO of Magic Eden, said in the statement. \"We intend to deepen our relationships with both gamers and game developers alike to champion the future of games on the blockchain.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The launch of Magic Ventures comes less than a month after Magic Eden&nbsp;<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.theblock.co\/post\/153214\/magic-eden-raises-series-b-funding-solana-nft-unicorn\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">raised<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\"> $130 million in a Series B funding round at a $1.6 billion valuation. It is unclear how much money Magic Eden intends to park for its ventures unit and whether it has already invested in some startups. Lu did not respond to requests for comment by press time.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Magic Eden is not new to gaming, having launched a hosting platform called Eden Games in March. Eden Games claims to have launched more than 50 games and seen over 300,000 users mint or trade gaming-related NFTs on its marketplace.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Given its focus on web3 gaming, Magic Eden has today also announced the appointment of Tony Zhao to head its venture unit. Zhao comes from Tencent Games, where he focused on investing in games, acquiring gaming studios and forming strategic partnerships across the Tencent Games portfolio.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Eden Games said it has recently finalized partnerships with various game developers, including Aurory, Genopets, Mini Royale: Nations and Sugar Realm. Zhao plans to increase such partnerships for Magic Eden.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Besides Zhao, Magic Eden has also announced appointments of Yoonsup Choi, Harrison Chang and Matt Biamonte. The trio, specialized in gaming and NFTs, will advise and support game developers in their go-to-market strategy.<\/span>"],"hashtag":["MAGIC EDEN","SOLANA"]}