{"summary":"Finoa, a Germany-based crypto custodian, raised $15 million in a strategic funding round co-led by Maven 11 Capital and Balderton Capital.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/271200\/crypto-custodian-finoa-funding-valuation","publishDate":"2024-01-09T10:05:07","id":2488,"type":null,"title":"Crypto custodian Finoa raises $15 million in strategic funding round at flat valuation of $100 million","category":["DEALS"],"content":["Finoa, a Germany-based crypto custodian and staking services provider focused on serving institutional clients, raised $15 million in a strategic funding round co-led by Maven 11 Capital and Balderton Capital.","Other investors in the round included Blue Bay Ventures, Signature Ventures, Coparion, and Venture Stars, Finoa said Tuesday. The equity round began in June last year and closed in December, Christopher May, co-founder and co-CEO of Finoa, told The Block in an interview.","Finoa was initially looking to raise $5 to $6 million in the round from existing investors but ended up raising more, given the interest from external investors as the firm recently returned to profitability, May said.","The strategic funding round comes nearly three years after Finoa <a href=\"https:\/\/www.theblock.co\/linked\/103236\/crypto-custodian-finoa-raises-22-million-series-a-funding\" data-v-f87c67ca=\"\">raised<\/a> $22 million in Series A funding in April 2021. Fiona did not go for a big Series B round, given challenging market conditions last year, and instead went for a smaller strategic round for growth, May said.","A source with knowledge of the matter said the round maintained a flat valuation of $100 million, mirroring Finoa's Series A valuation from 2021.","Founded in 2018, Finoa remained profitable until 2021 but faced losses in the following two years due to challenging market conditions and crypto collapses, May said. But given the recent market rebound and growth in its staking business, Finoa returned to profitability in the fourth quarter of 2023, May added.","Finoa's staking unit, Finoa Consensus Services, has gathered more than 500 million euros (nearly $547 million) in assets since launching in May 2022. May said the staking unit now forms almost 60% of Finoa's total revenue. The firm supports over ten blockchains for staking and is the third-largest validator for modular blockchain <a href=\"https:\/\/www.theblock.co\/post\/260167\/modular-network-celestia-goes-live-on-mainnet\" data-v-f87c67ca=\"\">Celestia<\/a>, according to Nodes.Guru <a href=\"https:\/\/celestia.explorers.guru\/validators\" data-v-f87c67ca=\"\">data<\/a>. Meanwhile, the firm's flagship custody business accounts for nearly 30% of its revenue, and the rest comes from brokerage and other services, May said.","Finoa recently also unveiled a new service that will provide its clients access to decentralized finance or DeFi applications via its custodial wallet infrastructure called FinoaConnect. That service is currently in beta, and once live, it is expected to bring more revenue to the company, May said.","Finoa's closest competitors include big firms Fireblocks and Anchorage, but its edge is that it is a qualified custodian in Europe with licenses from the German Federal Financial Supervisory Authority, May said.","There are currently about 50 people working for Finoa, and the firm doesn't have immediate plans for aggressive hiring, May said. He added that Finoa had to downsize its staff over the past two years due to market conditions, noting that the headcount was once over 100 in 2021.","As part of the strategic funding round, Maven 11 managing partner Balder Bomans has joined Finoa's board as an observer, May said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Venture Stars","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"Anchorage","content":"LOCATION"},{"type":"April 2021","content":"DATE"},{"type":"Finoa","content":"ORGANIZATION"},{"type":"Finoa Consensus Services","content":"ORGANIZATION"},{"type":"Christopher May","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Blue Bay Ventures","content":"ORGANIZATION"},{"type":"Fiona","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"60%","content":"PERCENT"},{"type":"30%","content":"PERCENT"},{"type":"Europe","content":"LOCATION"},{"type":"$5","content":"MONEY"},{"type":"$22 million","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"$547 million","content":"MONEY"},{"type":"German Federal Financial Supervisory Authority","content":"ORGANIZATION"},{"type":"Germany","content":"LOCATION"},{"type":"Coparion","content":"PERSON"},{"type":"$6 million","content":"MONEY"},{"type":"Signature Ventures","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"May 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"December","content":"DATE"},{"type":"Finoa","content":"PERSON"},{"type":"the fourth quarter of 2023","content":"DATE"},{"type":"Celestia","content":"LOCATION"},{"type":"Balderton Capital","content":"ORGANIZATION"},{"type":"Balder Bomans","content":"PERSON"},{"type":"$15 million","content":"MONEY"},{"type":"June last year","content":"DATE"}],"hashtag":["STAKING FIRMS","STRATEGIC INVESTMENTS","VALIDATORS","WALLETS"],"authors":["Yogita Khatri","The Block"]}