{"summary":"Meta adjusted its goal to reach 500,000 monthly active users for Horizon Worlds to 280,000 as current levels fall below 200,000.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/177471\/meta-falls-short-of-user-goal-for-horizon-worlds-wsj","publishDate":"2022-10-15T21:18:57","id":249,"type":null,"title":"Meta falls short of user goal for Horizon Worlds: WSJ","category":["METAVERSE & NFT"],"content":["<span data-v-f87c67ca=\"\">Meta dialed back its goal to reach 500,000 monthly active users to 280,000 as current levels dwindle below 200,000, the Wall Street journal reported.<\/span>","<span data-v-f87c67ca=\"\">Players said they had trouble finding worlds they liked, couldn’t find people to hang out with, and that avatars looked unrealistic, according to a survey.<\/span>","<span data-v-f87c67ca=\"\">Meta’s flagship virtual reality social media platform, Horizon Worlds, originally sought to reach 500,000 monthly active users by year end. However that figure is being revised to 280,000 as the company faces hurdles to grow its user base.<\/span>","<span data-v-f87c67ca=\"\">Internal memos and documents <a href=\"https:\/\/www.wsj.com\/articles\/meta-metaverse-horizon-worlds-zuckerberg-facebook-internal-documents-11665778961\" data-v-f87c67ca=\"\">obtained<\/a> by the Wall Street Journal (WSJ) indicate the current number of active users stands below 200,000. Since the spring, user activity has steadily declined, with many leaving the platform after a month of playing. The players who stay only visit 9% of available worlds, which may see as many as 50 visitors, while the majority of digital destinations remain ignored completely.<\/span>","<span data-v-f87c67ca=\"\">Meta’s Quest VR headsets, that players use to access Horizon, saw a decline in usage, according to sources who said that the $400 consoles exhibited a falling retention rate in the past 3 years.<\/span>","<span data-v-f87c67ca=\"\">Horizon is also far behind in terms of concurrent users compared with competitive platforms that offer virtual social experiences, such as VR Chat, launched in 2014, and Second Life, which launched in 2003, according to sources familiar with the matter.<\/span>","<span data-v-f87c67ca=\"\">In the past year, Meta shares are down over 60% as the company currently trades at $126.76. Since peaking in September 2021 the company is down over $700 billion in market value.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"2003","content":"DATE"},{"type":"$700 billion","content":"MONEY"},{"type":"9%","content":"PERCENT"},{"type":"Horizon Worlds","content":"LOCATION"},{"type":"$400","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$126.76","content":"MONEY"},{"type":"September 2021","content":"DATE"},{"type":"spring","content":"DATE"},{"type":"60%","content":"PERCENT"},{"type":"Second Life","content":"ORGANIZATION"}],"hashtag":[],"authors":["Jeremy Nation","The Block"]}