{"summary":"Bitcoin was trading around $24,600, down 0.8% in the past day.\nEther slipped 2% and altcoins dropped across the board. MATIC plunged 5%.","author":["Adam Morgan McCarthy","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/213549\/bitcoin-slips-as-altcoins-lead-drop-in-prices","publishDate":"2023-02-21T08:31:05","id":2491,"type":null,"title":"Bitcoin slips as altcoins lead drop in prices","category":["Markets"],"content":["Cryptocurrency prices dipped over the past 24 hours. Altcoins experienced a sharp sell-off, with Polygon's MATIC down about 5% as the project announced job jobs.&nbsp;","Bitcoin was trading at $24,600 by 8 a.m. EST, down 0.8%, according to TradingView data. The leading cryptocurrency by market cap is still up about 13% over the past week, <a href=\"https:\/\/www.theblock.co\/post\/212586\/bitcoin-reaches-25000-its-highest-price-since-june\" data-v-f87c67ca=\"\">reaching<\/a> its highest point since last June on Thursday.&nbsp;","Ether slipped 1.5% to $1,677, and Binance's BNB dropped 1.3% to $312. Altcoins were trading lower, with Polygon's MATIC down 5%, Cardano's ADA down 2.2%, and Solana's SOL falling 4.1%. Memecoins were also in the red. Dogecoin and shiba inu lost 1.3% and 2%, respectively.&nbsp;","Polygon Labs <a href=\"https:\/\/polygon.technology\/blog\/consolidating-teams-within-polygon-labs\" data-v-f87c67ca=\"\">announced<\/a> on Tuesday it has cut about 100 jobs, or 20% of its total staff.&nbsp;","Despite the price fall, most cryptocurrencies have been green over the past seven days. The latest rally in digital assets occurred alongside a drop in equities.","The correlation between bitcoin and equities has fallen from highs at the beginning of February, according to The Block's data. Bitcoin's correlation to the Nasdaq fell to 0.81 from 0.94.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/btc-pearson-correlation-30d\/embed\" title=\"BTC Pearson Correlation (30D)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Looking ahead this week, the U.S. Federal Reserve's meeting minutes loom large on the horizon.","\"The Fed minutes may have taken on extra significance, given recent CPI and NFP data, both of which were well above expectations,\" <a href=\"https:\/\/www.b2c2.com\/newspost\/cryptobits-crypto-continues-climb-despite-bearish-news\" data-v-f87c67ca=\"\">said<\/a> Adam Farthing of market maker B2C2, adding that \"signs of variance from the recent Fed meeting would indicate a higher likelihood of the Fed raising their forecast for peak rates.\""],"hashtag":["AVALANCHE","BINANCE","BITCOIN","BNB","CARDANO","COSMOS","DAI","DOGECOIN","ETHEREUM","POLYGON","SHIBA INU","SOLANA","TETHER","USDC","XRP"]}