{"summary":"The company will use the money to expand its institutional bitcoin mining colocation services.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/205272\/crypto-infrastructure-firm-blockstream-raises-125-million-to-expand-mining-services","publishDate":"2023-01-24T16:55:04","id":2494,"type":null,"title":"Crypto infrastructure firm Blockstream raises $125 million to expand mining services","category":["CRYPTO INFRASTRUCTURE"],"content":["Bitcoin miner and hosting provider Blockstream raised $125 million in a convertible note and secured loan financing round.","The company will use the money to expand its institutional bitcoin mining colocation services at a time when others in the industry are struggling to keep afloat due to a prolonged decline in mining economics.","\"Demand for Blockstream’s hosting services remains high due to the company’s strong track record and substantial scale, coupled with an industry-wide shortage of available power capacity,\" the company <a href=\"https:\/\/www.prweb.com\/releases\/2023\/1\/prweb19127332.htm\" data-v-f87c67ca=\"\">said in a statement<\/a>.","Blockstream currently has over 500 megawatts in its development pipeline. Its business also extends to hardware and Layer-2 technologies like Core Lightning.","The demise of large-scale centralized parties and protocols in the past year and \"resulting refocus on security and decentralization presents an opportunity for market participants to move to Bitcoin-based non-custodial architectures,\" CEO Adam Back said.&nbsp;","The company had already raised $210 million in a series B round in 2021. In December, Bloomberg <a href=\"https:\/\/www.theblock.co\/post\/192809\/blockstreams-unicorn-status-in-jeopardy-as-it-seeks-fresh-funding-bloomberg\" data-v-f87c67ca=\"\">reported<\/a> that it was looking for fresh funds&nbsp;at a significantly lower valuation than before.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$210 million","content":"MONEY"},{"type":"Adam Back","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$125 million","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":["MINING COMPANIES"],"authors":["Catarina Moura","The Block"]}