{"summary":"Crypto lender and trader Genesis has released its Q3 performance report.\nThe firm has posted strong growth across its businesses.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/83006\/crypto-lender-genesis-q3-performance-report","publishDate":"2020-10-30T09:00:33","id":2494,"type":null,"title":"Crypto lender Genesis issued $5.2 billion worth of new loans in Q3","category":["Cryptocurrency"],"content":["Crypto lending and trading firm Genesis continues to grow.","The firm issued $5.2 billion worth of new loans in the third quarter of 2020, more than double its previous record of $2.2 billion in Q2, according to a <a href=\"https:\/\/genesistrading.com\/wp-content\/uploads\/2020\/10\/Q3-Report_.pdf\" data-v-f87c67ca=\"\">report<\/a> shared with The Block on Friday.&nbsp;","Genesis began its lending business in March 2018 and since then has originated $13.6 billion worth of loans in total. The recent growth came through increased cash and altcoin loan issuance, said Genesis, along with a \"modest\" increase in the notional value of crypto loans outstanding.<br data-v-f87c67ca=\"\">\n","","Genesis further said that growth in banks' deposits is also helping it. \"Banks must make loans somewhere; prime brokerage clients are great places to deploy excess capital during a pandemic. These clients have historically worked closely with Genesis and are now lending both excess USD and BTC generated from the short CME basis trade back to Genesis, ultimately increasing our asset base as well,\" explained the firm.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Share of BTC declined&nbsp;<\/strong><\/span>","Altcoins and the U.S. dollar drove Genesis' loan portfolio in Q3, not bitcoin (BTC). The firm's BTC composition as a percentage of loans outstanding fell sharply in Q3 to 40.8% as compared to 51.2% in the previous quarter.","\"ETH, USD and Equivalents and 'other' altcoins drove the increase in book size in Q3,\" said Genesis. \"ETH loans outstanding jumped to 12.4% of the overall book, USD increased to 34.5%, and other altcoins jumped to almost 5.0%.\"","","","Genesis also facilitates spot and derivatives trading and these businesses also grew significantly in Q3. The firm recorded a $4.5 billion volume on the spot trading side, up 285% from the same quarter in 2019. On the derivative trading side, Genesis recorded $1 billion in total volume, up from $400 million in Q2 when it launched its derivatives trading business.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nWhile Genesis facilitates most customer trades via its over-the-counter (OTC) desk, the firm said it had seen consistent growth in electronic execution. In September, Genesis executed almost 30% of all spot trading volume through its new Prime smart-order routing engine, the firm said."],"hashtag":[]}