{"summary":"A Curve user has proposed that the platform should take legal action to protect its IP — even though it’s decentralized.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/108561\/the-first-dao-lawsuit-proposal-asks-if-curve-should-protect-its-ip","publishDate":"2021-06-16T11:32:41","id":2495,"type":null,"title":"The first DAO lawsuit? Proposal asks if Curve should protect its IP","category":["DEFI"],"content":["A <a href=\"https:\/\/gov.curve.fi\/t\/cip-xx-enforce-curves-ip-rights\/1890\/3\" data-v-f87c67ca=\"\">new proposal<\/a> on the Curve governance forum asks whether the decentralized finance (DeFi) project should try to enforce its intellectual property in court.","Not only does the proposal consider whether the IP should be enforced more broadly, but it considers a specific example of Saddle Finance, which the proposer claims has been accused of copying Curve’s code.","“I propose Curve engage competent counsel both in the USA and (to the extent Saddle or other infringers or their VC’s have identifiable assets abroad) other relevant jurisdictions,” the proposal states.&nbsp;","Curve is a decentralized exchange running on the Ethereum blockchain. The platform is managed by a core team but it has a decentralized autonomous organization (DAO) that is able to propose and vote for ways it should be changed, using Curve’s governance token CRV.","The key questions are whether Curve <i data-v-f87c67ca=\"\">can<\/i> enforce its IP — since the organization itself is largely decentralized — and also whether it should, something that would be new to the <a href=\"https:\/\/www.theblockresearch.com\/the-logbook-licensing-in-defi-58449\" data-v-f87c67ca=\"\">largely open-source<\/a> and unregulated DeFi industry.","As noted in the proposal, Curve’s code has a license that states, “no license, right of reproduction or distribution or other right with respect thereto is granted or implied.”","In January, some members of the Curve community alleged that Saddle Finance’s code was based on Curve’s. According to an audit by Quantstamp, Saddle Finance’s implementation of StableSwap was ported from Curve Finance’s contracts. And when asked the difference between Curve and Saddle, the official Curve Twitter account <a href=\"https:\/\/twitter.com\/CurveFinance\/status\/1351564385957924864\" data-v-f87c67ca=\"\">said<\/a>, “For now, seems like exactly the same math but with VCs. Will see how it plays out.”","The proposal argues that Curve’s governance forum should review proposals from law firms and put them to a vote. And if a lawsuit results in a proposal of a settlement, that would also go to a vote.","“This will also set an important precedent in DAO’s and DeFi that decentralization does not mean that VC’s get to steal from communities,” the proposal states.","The comments section shows a mixed reaction to the proposal.&nbsp;","Curve team member Julien Bouteloup argues that it’s a “very good proposal” that may have the result of disincentivizing other projects to impede on Curve’s IP.","Others were concerned, however, that this might bring regulatory scrutiny to the project and its token.&nbsp;","“It all makes a lot of sense, just afraid this would make CRV and veCRV a security and bring a lot of pain to everyone, more than non enforcing IP rights,” writes Daniele Sesta, a self-proclaimed “Chief Rug Puller” at Popsicle Finance.","An anonymous user writes that it could raise questions in court about Curve’s lack of a money transmitting license, while reiterating concerns over the tokens being deemed unregistered securities.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Curve Finance","content":"ORGANIZATION"},{"type":"Saddle Finance","content":"ORGANIZATION"},{"type":"CRV","content":"ORGANIZATION"},{"type":"Popsicle Finance","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"USA","content":"ORGANIZATION"},{"type":"Julien Bouteloup","content":"PERSON"},{"type":"Daniele Sesta","content":"PERSON"}],"hashtag":[],"authors":["Tim Copeland","The Block"]}