{"summary":"Manufacturing and operating Worldcoin orbs could become decentralized through an incentive structure similar to Bitcoin mining, its co-founder claimed.\nData security experts claim the decentralization and open-sourcing of orb design could see a proliferation of fake, data-stealing devices.","author":["Brian McGleenon","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241871\/worldcoins-plan-to-decentralize-orb-production-sparks-illicit-data-harvesting-concerns","publishDate":"2023-08-03T11:01:31","id":2497,"type":null,"title":"Worldcoin&#x27;s plan to decentralize orb production sparks illicit data harvesting concerns","category":["Companies"],"content":["Manufacturing and operating Worldcoin's iris-scanning orbs could become decentralized and incentivized in the way that Bitcoin mining is, its co-founder claimed. But experts see potential risks in passing off production to third-parties.&nbsp;","In an episode of <a href=\"https:\/\/youtu.be\/RrF2LbuSYoA\" data-v-f87c67ca=\"\">The Scoop<\/a> podcast, Alex Blania, co-founder of <a href=\"https:\/\/www.theblock.co\/post\/241081\/worldcoins-wld-token-surges-88-after-listing-on-multiple-exchanges\" data-v-f87c67ca=\"\">Worldcoin<\/a> and CEO of its lead developer&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/232172\/worldcoin-developer-announces-115-million-fundraise\" data-v-f87c67ca=\"\">Tools for Humanity (TfH)<\/a>, described how new incentives for&nbsp;orb-makers will be woven into Worldcoin's tokenomics.","However, the decentralization of manufacturing orbs, with design instructions open-sourced, could see the proliferation of illegitimate devices that siphon away biometric data without appropriate protections, a security expert told The Block.","Since some details of the design of the orbs created by TfH were&nbsp;<a href=\"https:\/\/worldcoin.org\/blog\/engineering\/opening-orb-look-inside-worldcoin-biometric-imaging-device\" data-v-f87c67ca=\"\">made public<\/a> earlier this year, independent entities can in theory build their own versions of the controversial devices and operate them to enlist sign-ups for the project.","\"This would be similar to bitcoin miners that mine to secure the network, where Worldcoin orb manufacturers will also earn Worldcoin with every orb they manufacture and operate,\" Blania said on the podcast.&nbsp;","He added that decentralizing orb manufacturing and operation will be a significant focus for the project over the coming year. A range of manufacturers could be involved in crafting the devices, from small companies to tech giants, he added.","\"As we work towards decentralization, we are incrementally open-sourcing the Orb. Ultimately, we plan to decentralize everything involving the Orb, enabling others to develop, manufacture, and operate similar devices to issue Proof-of-Personhood credentials in a privacy-preserving manner,\" Worldcoin stated in a previous GitHub <a href=\"https:\/\/github.com\/worldcoin\/orb-hardware\" data-v-f87c67ca=\"\">post<\/a>.","The orb created by TfH has an unusual origin story. Blania said on the podcast that Worldcoin, in its early days, \"hired this crazy designer who worked for Kanye [West]\" — and that it was he who came up with the orb's design.&nbsp;","Designing the orbs was tricky, Blania said, as they had to work in \"adversarial\" situations and there was no blueprint for creating such a device.&nbsp;But Worldcoin now has manufacturing lines in place and with a few month's notice could \"produce essentially a limitless amount of devices,\" he said. &nbsp;","In March, Worldcoin signed a deal with <a href=\"https:\/\/www.theblock.co\/post\/220402\/worldcoin-outsourcing-deal-jabil-iris-scanning-orbs\" data-v-f87c67ca=\"\">Florida-based manufacturer Jabil<\/a>&nbsp;to ramp up production of the orbs.","Worldcoin's token <a href=\"https:\/\/www.theblock.co\/post\/241074\/sam-altman-worldcoin-launches-token\" data-v-f87c67ca=\"\">launched<\/a> on Monday July 24, rising 88% to an all-time high of $3.30 on the day of launch. However, it has since fallen over 30% to $2.20, as of the time of writing, according to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/worldcoin\" data-v-f87c67ca=\"\">CoinGecko<\/a>. The company is currently scaling up its eyeball-scanning operations in 20 countries.&nbsp;","Worldcoin's iris-scanning registration method is already raising concerns about potential biometric data breaches among security professionals — who have homed in on the potential risks posed by counterfeit orbs.&nbsp;","Chief security officer and co-founder of Halborn Steven Walbroehl said fake orbs could be engineered to transfer unencrypted data into the hands of cybercriminals.","\"Because it is open-sourced, people could be mistakenly using what they think are real orbs, but in actual fact they are fake orbs that can snatch biometric data,\" he cautioned. He advocated for Worldcoin to employ independent third-party auditors to assess the hardware and software of orb rollouts, reinforcing trust and confidence in the their global proof of personhood effort."],"hashtag":["DECENTRALIZED INFRASTRUCTURE"]}