{"summary":"Sam Bankman-Fried said he was convinced the crypto exchange and sister trading firm Alameda Research could still be saved.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/260077\/inside-the-trial-days-before-the-collapse-sbf-says-he-thought-ftx-and-alameda-could-still-be-saved","publishDate":"2023-10-30T15:12:53","id":2498,"type":null,"title":"Inside the trial: Days before the collapse, SBF says he thought FTX and Alameda could still be saved","category":["COMPANIES"],"content":["Sam Bankman-Fried, the former CEO of the failed FTX crypto exchange, was back in a New York courtroom at his <a href=\"https:\/\/www.theblock.co\/tag\/sbf-trial\" data-v-f87c67ca=\"\">criminal trial<\/a> on Monday, where his lawyer, Mark Cohen, finished up the direct examination that started last week. Recounting the first week of November a year ago as users started to pull funds off the exchange, Bankman-Fried said he thought the company and sister trading firm Alameda Research could still be saved.","Recounting a now <a href=\"https:\/\/www.theblock.co\/post\/183680\/ftx-fine-bankman-fried-binance-work-together\" data-v-f87c67ca=\"\">infamous tweet<\/a> in which he said FTX assets were \"fine,\" Bankman-Fried recounted that he had meant there was no hole in terms of assets. He briefly mentioned that he had been in contact with Changpeng Zhao, the CEO of rival exchange Binance, which had signed a letter of intent to acquire FTX only to pull out of the deal a day later.","In October 2022, Bankman-Fried said he started compiling a list of all Alameda accounts at FTX and found that the overall net asset value was around $10 billion. Alameda's liabilities did not seem catastrophic to Bankman-Fried at that point, he said, adding that if they had been larger, he \"would call it a crisis.\"","Referring to a Nov. 2 story published by CoinDesk that triggered widespread worries about the company's balance sheet, he said he believed it had not included a full list of assets available to the firm. For example, it did not include FTX equity Bankman-Fried said he owned via an entity named Paper Bird. Also, by that time, Alameda had already hedged some of its position, and that was not reflected in the leaked document, he added.","The picture of the situation inside FTX Bankman-Fried painted throughout his testimony in many instances differed from that of his former subordinates at FTX. For one, Bankman-Fried insisted that he had been trying to prevent a liquidity crisis at Alameda far in advance, telling the former CEO, Caroline Ellison, to hedge the firm's trading positions since the summer 2022.","In June 2022, he recalled talking to Ellison at the luxury apartment they and other FTX executives shared in the Bahamas. According to Bankman-Fried, he told Ellison that if the market went down another 50%, Alameda might become insolvent. She agreed and started crying, he added, then offered to step down as a CEO, which Bankman-Fried neither approved nor disapproved, he told the court.","Later, in Signal messages, the two discussed the matter again and Ellison assured Bankman-Fried that Alameda did hedge its positions and \"gave a number,\" he said, adding that his \"instinct was it should have been twice as much.\"","However, those hedges did not turn out to be very helpful. Bankman-Fried said that while positions in bitcoin and some other coins had been hedged, ones in SOL and FTT were not. When they crashed in price in early November, Alameda had no safeguards in place.","In a cross-examination that began after the direct examination by his attorney, the U.S. assistant attorney Danielle Sassoon honed in on the multiple instances in which he had assured FTX users of the company's solvency. To many of the questions, Bankman-Fried said he did not remember saying such things, even as he was presented with multiple tweets, emails and interview fragments.","Bankman-Fried continued to testify in cross-examination on Monday afternoon.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ellison","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"summer 2022","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"October 2022","content":"DATE"},{"type":"November","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"Danielle Sassoon","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"afternoon","content":"TIME"},{"type":"June 2022","content":"DATE"},{"type":"first week of November","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$10 billion","content":"MONEY"},{"type":"Fried","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Alameda","content":"PERSON"},{"type":"Bahamas","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"Nov. 2","content":"DATE"},{"type":"Mark Cohen","content":"PERSON"}],"hashtag":["FTX","SBF TRIAL"],"authors":["Anna Baydakova","The Block"]}