{"summary":"A community-led foundation of Project Serum has raised $75 million in a token sale.\nTiger Global, Commonwealth Asset Management, and other investors were offered several tokens at a discount, including SOL and SRM.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/129536\/serum-crypto-100-million-token-sale-tiger-global-others","publishDate":"2022-01-07T08:00:07","id":2499,"type":null,"title":"Serum community foundation raises $100M from Tiger Global and others","category":["Venture Capital"],"content":["The Incentive Ecosystem Foundation, a community-led foundation of Project Serum, has raised $75 million in a new funding round. Serum is a Solana-based decentralized exchange and liquidity infrastructure platform.","Tiger Global, Commonwealth Asset Management, Tagus Capital, executives at Golden Tree Asset Management, and several other investors participated in the round.","This was a token funding round where investors were offered a bunch of different tokens at a discount to their market price, JHL, a contributor to Project Serum, told The Block. These tokens are Serum (SRM), Solana (SOL), Raydium (RAY), Bonfida (FIDA), Oxygen (OXY), Maps.me (MAPS), and Liquid Finance (LQID), said JHL.","All these tokens are part of the Solana and Serum ecosystems. They were offered at a 15% discount to their market price, said JHL.","Investors face a six-year lock-in period for the tokens — a one-year cliff and then five years of linear vesting daily — said JHL.","The round is still ongoing and the Incentive Ecosystem Foundation is looking to raise another $25 million, said JHL.","The foundation plans to grow the Serum ecosystem with fresh capital in place. Fifteen percent of the money, or $15 million, will be allocated for this purpose, said JHL.","Through this ecosystem fund, the foundation plans to support upcoming Serum projects across areas such as DeFi, NFT, and gaming. The foundation also plans to offer business development and marketing support to such projects.","The rest of the capital will be utilized toward growth initiatives for Project Serum, such as hosting hackathons and hiring, said JHL.","There are currently over 70 projects in the Serum ecosystem. The total value locked (TVL) of these projects is <a href=\"https:\/\/projectserum.vybenetwork.com\/#\/\" data-v-f87c67ca=\"\">nearly $2 billion<\/a>, according to tracker Vybe Network.","Project Serum has been aiming to attract more projects and users to its platform. In October, its community <a href=\"https:\/\/www.prnewswire.com\/news-releases\/project-serum-community-approves-launch-of-liquidity-mining-program-with-initial-allocation-of-100m-301410801.html\" data-v-f87c67ca=\"\">approved<\/a> the launch of a $100 million liquidity mining program. Liquidity mining is a process in which crypto holders lend assets to a decentralized exchange in return for rewards. This program is separate from the ecosystem fund, said JHL.","This is not the first time the Incentive Ecosystem Foundation has raised funds, but it hasn't disclosed funding amounts of its previous rounds.","The foundation's latest round is notable because investment giants such as Tiger Global backed it. As The Block <a href=\"https:\/\/www.theblockcrypto.com\/news+\/128652\/major-tech-funds-backing-could-signal-a-new-dawn-for-token-sales-but-should-crypto-rejoice\" data-v-f87c67ca=\"\">reported<\/a> recently, big venture capital firms are more frequently embracing token deals. Last month, Tiger Global also participated in Braintrust's $100 million token sale in its first-ever such deal.","<strong data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Update (Jan. 7, 9 am ET):<\/span><\/em><\/strong><em data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;After the publication of this story, the Incentive Ecosystem Foundation told The Block that it had raised $75 million, and $25 million is still to be raised.&nbsp;<\/span><\/em>","<b data-stringify-type=\"bold\" data-v-f87c67ca=\"\"><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">Update (Jan. 7, 1:35 pm ET):<\/i><\/b><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">&nbsp;After the publication of this story, the Incentive Ecosystem Foundation told The Block that it did not offer PYTH tokens to investors in the funding round.<\/i>"],"hashtag":["SOLANA","TIGER GLOBAL"]}