{"summary":"Grayscale is launching a “dynamic income fund” for investors with a net worth of over $2.2 million.\nThe fund will invest in proof-of-stake tokens.","author":["RT Watson","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285659\/grayscale-launching-proof-of-stake-investment-fund-for-millionaires","publishDate":"2024-03-29T10:57:31","id":25,"type":null,"title":"Grayscale launching proof-of-stake investment fund for millionaires","category":["Funds"],"content":["Grayscale announced it is launching a \"dynamic income fund\" that will focus on investing in proof-of-stake tokens, the firm said in a <a href=\"https:\/\/twitter.com\/grayscale\/status\/1773711823931654604?s=46&amp;t=yoL7WJcO9vZ3TjSE2j6FRQ\" data-v-f87c67ca=\"\">post to X<\/a> on Friday.","Grayscale said in a description that the fund, which has the ticker GDIF, is for accredited investors with a net worth of at least $2.2 million.","The firm also said GDIF will be Grayscale's<span class=\"css-1qaijid r-bcqeeo r-qvutc0 r-poiln3\" data-v-f87c67ca=\"\"> \"first actively managed investment product.\" Grayscale said the financial instrument will aim to \"optimize income in the form of staking rewards associated with proof-of-stake digital assets,\" according to its statement. The fund will manage the staking and unstaking of multiple tokens and pass on rewards to its investors.<\/span>","Grayscale's spot bitcoin ETF, which allows people to gain exposure to the cryptocurrency without having to purchase it themselves, was approved and is regulated by the Securities and Exchange Commission. Since it began trading in January, the ETF has shed billions of dollars and remains the largest in terms of assets under management, according to <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/bitcoin-etf\" data-v-f87c67ca=\"\">The Block Data Dashboard<\/a>. When ranked by trading volume, Grayscale is second only to BlackRock's spot bitcoin ETF.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/bitcoin-etf\/spot-bitcoin-etf-assets\/embed\" title=\"Spot Bitcoin ETF AUM\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","In its disclosures, Grayscale outlined how GDIF will function:&nbsp;\"Interests in GDIF have not been, and will not be, registered under the U.S. Securities Act of 1933 ... or any state or other securities laws,\" the firm said.","Grayscale's disclosures also stated that the fund \"will not be registered as an investment company under the U.S. Investment Company Act of 1940 ... and will not be required to adhere to certain restrictions and requirements under the Investment Company Act, and investors will not be afforded the protections of the Investment Company Act.\""],"hashtag":[]}