{"summary":"In the crypto world; a ‘fork’ is essentially a change in the protocol of a blockchain. Since cryptocurrencies run on decentralized networks, all parties need to use the same rules and work together correctly in order to preserve the history of the blockchain. If not, the result is two blockchains running at the same time … Continued","webName":"beincrypto.com","link":"https:\/\/beincrypto.com\/learn\/what-are-crypto-forks\/","publishDate":"2019-12-16T02:39:04","id":25,"type":null,"title":"What are Crypto Forks?","category":["Blockchain"],"content":["In the crypto world; a ‘fork’ is essentially a change in the protocol of a blockchain. Since cryptocurrencies run on decentralized networks, all parties need to use the same rules and work together correctly in order to preserve the history of the blockchain. If not, the result is two blockchains running at the same time on different parts of the network, also known as a chainsplit.","Soft forks are usually small tweaks that are optional and backwards compatible. i.e. the old rules aren’t obsolete, and it doesn’t require everyone to update because the previous blocks are still readable. Only one blockchain remains valid as people upgrade from the old version.","Hard forks happen when the changes made are not compatible with the previous versions; they are permanent and require all users to upgrade to the latest rules. If certain parties fail to upgrade, there will be a chainsplit creating two different blockchains running after the fork. At this point, either both will co-exist and operate independently, or one blockchain will become dominant.","Some hard forks are non-contentious, meaning that all parties agree on accepting the new set of rules.","Cloning is sometimes confused as a synonym of forking. However, cloning is when you copy the codebase of one currency and make small changes to it on an entirely new ledger.","Cloning is encouraged in code-sharing platforms such as <a href=\"https:\/\/github.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Github<\/a>; you can easily copy an existing <a href=\"https:\/\/beincrypto.com\/learn\/what-are-nodes\/\" target=\"_blank\" class=\"glossary-only-link\">node<\/a> software and add to it or adapt it. You can then run the new code and create an entirely new blockchain on a blank ledger. This often leads to innovative developments. For example, if you took Bitcoin Core, tweaked a few parameters and ran the code to create a new coin; you would say you’d forked Bitcoin’s code. This is how alternative coins (altcoins) are created.","For example, in 2011 Litecoin was created by ex-google engineer Charlie Lee. He used the original copy of Bitcoin code and changed a few parameters such as the <a href=\"https:\/\/beincrypto.com\/learn\/proof-of-work-explained\/\" target=\"_blank\" class=\"glossary-only-link\">proof-of-work<\/a> challenge and the speed of the block generation. This enabled him to improve the transaction speed and scalability of Bitcoin, creating a coin that you could use for every day, smaller transactions.","Forks have a considerable impact (both positive and negative) on the cryptocurrency ecosystem. Not only is this how cryptocurrencies are created and improved, forks can create drama, increase risks and fuel uncertainty within the community. As more people with different goals come into the cryptocurrency space, forks will continue to play a significant role in the overall growth and development of the entire cryptocurrency industry.","A crypto fork is a split or divergence in the blockchain network that results in two or more separate versions of the original cryptocurrency. It can occur in two forms: a hard fork, where the new version is incompatible with the old one, and a soft fork, where the new version remains compatible. Forks can happen due to technical upgrades, disagreements among community members, or to create a new cryptocurrency altogether.","In a hard fork, the blockchain splits into two separate chains, creating a new cryptocurrency with its own set of rules and features. Examples include the Bitcoin and Bitcoin Cash split. On the other hand, a soft fork introduces new rules that are backward-compatible, meaning the new version remains compatible with the old one. The original chain continues, but with updated rules enforced.","A crypto fork can have various impacts on the cryptocurrency ecosystem. It can lead to the creation of new tokens and potentially increase the overall value and diversity of the cryptocurrency market. Forks can also create uncertainty, as users and investors may need to choose between different versions or face challenges in adopting the changes. Additionally, forks can spark debates and disagreements within the community, highlighting different visions and goals for the cryptocurrency project.","Get guaranteed bonus up to $200 on Coinbase in 3 easy steps\n\n\t  ","Disclaimer","In line with the <a href=\"https:\/\/beincrypto.com\/trust-project\/\">Trust Project<\/a> guidelines, the educational content on this website is offered in good faith and for general information purposes only. BeInCrypto prioritizes providing high-quality information, taking the time to research and create informative content for readers. While partners may reward the company with commissions for placements in articles, these commissions do not influence the unbiased, honest, and helpful content creation process. Any action taken by the reader based on this information is strictly at their own risk. Please note that our <a href=\"https:\/\/beincrypto.com\/terms-and-conditions\/\">Terms and Conditions<\/a>, <a href=\"https:\/\/beincrypto.com\/privacy-policy\/\">Privacy Policy<\/a>, and <a href=\"https:\/\/beincrypto.com\/disclaimer\/\">Disclaimers<\/a> have been updated."],"entity":[{"type":"2011","content":"DATE"},{"type":"Charlie Lee","content":"PERSON"},{"type":"$200","content":"MONEY"},{"type":"Trust Project","content":"ORGANIZATION"},{"type":"Github","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":[],"authors":["Jessica Lloyd"]}