{"summary":"zkSync Era unveiled Boojum, a STARK-powered proof system capable of being run on consumer-grade GPU hardware.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239880\/zksync-launches-new-proof-system-called-boojum-for-era-mainnet","publishDate":"2023-07-17T03:23:47","id":250,"type":null,"title":"zkSync launches new proof system called Boojum for Era mainnet","category":["CRYPTO ECOSYSTEMS"],"content":["Matter Labs, the core developer of Ethereum Layer 2 zkSync Era, has <a href=\"https:\/\/twitter.com\/zksync\/status\/1680820952991408129\" data-v-f87c67ca=\"\">unveiled<\/a> Boojum, a STARK-powered proof system capable of being run on consumer-grade GPU hardware, promising superior performance.","The proof system is based on a new Rust-based cryptographic <a href=\"https:\/\/github.com\/matter-labs\/era-boojum\" data-v-f87c67ca=\"\">library<\/a> from zkSync that powers the prover’s upgraded Zero-Knowledge (ZK) circuits — vital components of zkSync Era and ZK Stack.","Until now, zkSync Era has relied on a proof system (prover) leveraging a type of zero-knowledge proof called SNARKs. This system helps its Layer 2 sequencer (off-chain transaction aggregator) process more than 100 transactions per second (TPS) currently. Boojum, which is based on STARKs, promises several times more throughput, according to the team.","In the context of Layer 2 solutions for blockchains, a prover is a component responsible for creating a proof of computation. This proof is then verified by the main blockchain (Layer 1) or other validators. The aim is to offload computational work from the main blockchain, thus enhancing scalability for apps.","\"The increased performance from Boojum means the system can prove transactions faster, and the reduced hardware requirements improve the network’s access to cheaper machines for increased horizontal scalability,\" Anthony Rose, SVP of technology at Matter Labs, told The Block.&nbsp;","A key highlight of Boojum is its ability to run on consumer-grade GPUs, requiring only 16 GB of GPU RAM. This feature promotes accessibility and inclusivity by enabling users with regular hardware to participate in the network.","The Boojum upgrade is currently live on the mainnet in an experimental phase. During the early phase, it’s generating and verifying ‘shadow proofs’ using real production data. This testing process will help zkSync Era fine-tune the system, identify any potential issues, and mitigate risks ahead of the full migration.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Matter Labs","content":"ORGANIZATION"},{"type":"Anthony Rose","content":"PERSON"},{"type":"SVP","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"GPU RAM","content":"ORGANIZATION"},{"type":"GPU","content":"ORGANIZATION"}],"hashtag":["ZKSYNC"],"authors":["Vishal Chawla","The Block"]}