{"summary":"In the past several weeks Wintermute, a market maker in crypto, has paid back hundreds of millions in obligations to various lenders.","author":["Anushree Dave","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156761\/wintermute-has-returned-hundreds-of-millions-in-obligations-to-lenders-wsj","publishDate":"2022-07-09T14:26:57","id":2500,"type":null,"title":"Wintermute has returned hundreds of millions in obligations to lenders: WSJ","category":["Companies"],"content":["Wintermute, a market maker in the crypto space, has paid back hundreds of millions to its lending counter-parties—a signal of the extent to which leverage is being sucked out of the crypto market. &nbsp;","In an interview with the Wall Street Journal, the firm's chief operating officer Marina Gurevich said the firm has paid \"hundreds of millions in obligations to various lenders over the past couple of weeks.\"","The interview was in reference to the collapse of crypto broker Voyager Digital, which filed for Chapter 11 bankruptcy on July 6, days after it halted trading, deposits and withdrawals.&nbsp;Gurevich added that Voyager has recalled most of its loans to Wintermute.&nbsp;Voyager lent $27.3 million to Wintermute at a rate of 4% to 13.5%, according to the Journal.&nbsp;","Voyager was known for delivering juicy yields on deposits. On the backend, the company lent out those deposits to large trading firms including market makers like Wintermute and Jump Trading. Since the meltdown of hedge fund Three Arrows Capital, lenders have grown more conservative, hiking the cost to borrow and calling back loans.&nbsp;","Wintermute CEO Evgency Gaevoy commented on this dynamic in a recent episode of The Scoop.&nbsp;","\"Everyone kind of assumed those guys just made billions over the years… but now it seems like we were just all horribly wrong,\" said Gaevoy in <a href=\"https:\/\/www.theblock.co\/post\/153713\/inside-cryptos-biggest-deleveraging-event-and-the-three-arrows-capital-fallout\" data-v-f87c67ca=\"\">the episode<\/a> of The Scoop.&nbsp;","“[Wintermute] basically got recalled pretty much on all open loans that we had with all the lenders,” Gaevoy added. \"Our balance sheet decreased more than half basically.\""],"hashtag":["WINTERMUTE"]}