{"summary":"Balancer V2 features an updated user interface. The team behind the iteration also claims it will reduce gas fees for its customers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/104472\/defi-balancer-labs-v2-protocol","publishDate":"2021-05-13T11:16:03","id":2501,"type":null,"title":"Balancer Labs rolls out version 2.0 of its automated market maker (AMM)","category":["DEFI"],"content":["Decentralized finance (DeFi) company Balancer Labs has launched Balancer V2, the second version of its automated market-making protocol.","Balancer V2, which has been in the works for over a year, features a new user interface, lower gas costs, and an updated community multisig, among other updates.","According to the Balancer Labs team, the platform's new branding on its website as well as its front-end interface is meant to be more \"welcoming\" and \"accessible to a broader audience as DeFi goes mainstream.\"","\"The vibrant geometrical shapes and gradients represent the flexibility of the Balancer Protocol and our use of math as a force for good. Handcrafted textures help keep things playful and cheerful,\" Balancer Labs CEO Fernando Martinelli told The Block. \"We decided to refresh the brand now to better reflect our values and customer promises of being flexible, efficient, and secure. A clean and simple user interface was one thing that was missing in earlier iterations of Balancer and this updated experience makes it much simpler for traders and LPs to use the platform.\"&nbsp;","In terms of backend operations, the team says trades will be routed through the most efficient protocol. They said Balancer v1 will provide the best price until enough liquidity has migrated to V2. At this point, the team says it expects trades to be routed through V2's Protocol Vault, lowering gas costs and improving prices for users. The team said it anticipates this liquidity migration to start in late May or early June and last for a couple of months.&nbsp;","According to Martinelli, one of the biggest challenges the team faced while developing Balancer V2 was making the decision to have a single vault hold all assets from all pools.&nbsp;","\"The single vault is one of the reasons why Balancer V2 offers lower gas costs and is easier to use, however, some may say there is more intrinsic risk to having funds in a single smart contract. Security is our number one priority, so we had many discussions on this point,\" Martinelli told The Block. \"Throughout the design process, we discussed every trade-off in-depth to ensure security at every step.\"","In late April, Balancer Labs announced it would offer \"ethical\" or white hat hackers over <a href=\"https:\/\/www.theblockcrypto.com\/linked\/102402\/balancer-labs-defi-eth-bug-bounty\" data-v-f87c67ca=\"\">$2 million<\/a> to report any bugs in version 2.0 of its platform. Martinelli said at this time, no bugs have been reported through the bug bounty program.&nbsp;","Over the next few weeks, the team behind the automated portfolio manager says it plans to share more updates on liquidity migration, BAL liquidity mining, and V2 governance.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Balancer Labs","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Martinelli","content":"PERSON"},{"type":"$2 million","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"BAL","content":"ORGANIZATION"},{"type":"Fernando Martinelli","content":"PERSON"}],"hashtag":[],"authors":["Saniya More","The Block"]}