{"summary":"Japanese mobile operator NTT Docomo will invest up to $4.1 billion aimed at developing web3 technology, the company said in its latest earnings. \nNTT Docomo also announced it will partner with Accenture to adopt web3 for social issues.","author":["Kristin Majcher","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/184305\/japanese-mobile-operator-ntt-docomo-plans-up-to-4-billion-web3-investments","publishDate":"2022-11-08T14:08:57","id":2501,"type":null,"title":"Japanese mobile operator NTT Docomo plans up to $4 billion web3 investments","category":["Crypto Infrastructure"],"content":["Japanese mobile operator NTT Docomo plans to invest up to ¥600 billion ($4.1 billion) over several years to focus on web3 technology, the company said in its second-quarter earnings report.","NTT Docomo expects to invest between ¥500-600 billion in web3 over a five-to-six year period, the earnings presentation shows &nbsp;for its 2022 fiscal year that ends March 31. The mobile provider disclosed that it also plans to form a web3-focused business in 2023. It listed four key functions related to web3 enablement: A blockchain wallet, crypto asset exchange, token issuance and security.&nbsp;","Financial publication Nikkei Asia <a href=\"https:\/\/asia.nikkei.com\/Business\/Technology\/NTT-Docomo-to-invest-4bn-in-Web3-using-mobile-infrastructure\" data-v-f87c67ca=\"\">first reported<\/a> NTT Docomo's plans to start this new web3-focused company, as well as the size of its planned investment. NTT Docomo will roll out web3 services after developing infrastructure that can support wallets and cryptocurrencies, the publication said.","NTT Docomo also plans to develop web3 technology with two other entities —&nbsp; professional services giant Accenture and multi-chain smart contract platform Astar. In doing so, the mobile provider aims to \"solicit the participation and collaboration from various industries [and] businesses through [a] DAO approach,\" the company said.","NTT Docomo also seeks to establish a \"global de facto standard originating from Japan\" for web3 according to the slide deck.&nbsp;","The mobile company said in a separate <a href=\"https:\/\/www.businesswire.com\/news\/home\/20221107005813\/en\/NTT-DOCOMO-and-Accenture-Collaborate-to-Accelerate-Adoption-of-Web3\" data-v-f87c67ca=\"\">announcement<\/a> that its partnership with Accenture will focus on adopting web3 technology for social issues. The companies will focus on three main areas: Developing case studies focused on environmental, social and governance (ESG) issues, providing web3 training courses and developing a \"secure technology platform\" for web3.","\"Docomo, in collaboration with Accenture, will revolutionize social infrastructure by utilizing blockchain and building a safe and secure Web3 environment,\" Docomo CEO Motoyuki Ii said in a statement. \"We will build an environment where the power of creators and developers can come together.\"","NTT Docomo is the biggest mobile operator in Japan, serving more than 84 million subscribers.&nbsp;"],"hashtag":["DATA PROVIDERS"]}