{"summary":"Decentralized exchange SushiSwap has proposed directing all of the fees paid to xSushi holders into its treasury wallet for a year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/192429\/sushiswap-proposes-to-direct-100-of-xsushi-revenue-to-treasury-wallet","publishDate":"2022-12-06T06:31:56","id":2502,"type":null,"title":"SushiSwap proposes to direct 100% of xSUSHI revenue to treasury wallet","category":["DEFI"],"content":["<span data-v-f87c67ca=\"\">Decentralized exchange SushiSwap is <\/span><a href=\"https:\/\/forum.sushi.com\/t\/reinstated-increase-kanpai-treasury-allocation-to-100\/11475\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">discussing<\/span><\/a><span data-v-f87c67ca=\"\"> a new proposal to direct all of the fees paid to xSushi holders into its treasury wallet for a year to provide financing for its operations.<\/span>","<span data-v-f87c67ca=\"\">The proposal comes at a time when SushiSwap, under new management, is <\/span><a href=\"https:\/\/www.theblock.co\/post\/179690\/sushiswaps-new-head-chef-describes-himself-as-a-wartime-ceo\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">attempting to turn around<\/span><\/a><span data-v-f87c67ca=\"\"> its declining fortunes. New Head Chef Jared Grey is trying to make the project profitable again and increase its runway — which he said has been reduced to just 1.5 years.<\/span>","\"After reviewing expenditures, it’s clear that a significant deficit in the Treasury threatens Sushi’s operational viability, requiring an immediate remedy,” Grey said.","<span data-v-f87c67ca=\"\">Grey argued that the team needs $5 million in order to sustain operations during the current bear market. He said SushiSwap needs “immediate action” to ensure adequate funding.<\/span>","<span data-v-f87c67ca=\"\">The idea is to take all of the funds generated by trading fees on the exchange. Those that stake the Sushi's governance token sushi receive a token called xSushi, which gives them a reward fee from all trades on the platform. <\/span><span data-v-f87c67ca=\"\">Currently, xSushi holders receive 0.05% of each swap, 10% of which is directed to the SushiSwap treasury wallet.<\/span>","<span data-v-f87c67ca=\"\">In the proposal, Grey recommended that SushiSwap should increase the treasury fee ratio from 10% to 100%, leaving no more token rewards for xSushi holders.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Matthew Lilley, core developer at SushiSwap, agreed with Grey’s proposal that this would be a temporary solution and said the current fee-sharing system will be restored after a year.<\/span>","<span data-v-f87c67ca=\"\">“The timeline is 12 months, if nothing has changed after 12 months it will default back to the original model. Hopefully it can be ended early if tokenomics revamp is concluded before,” Lilley<\/span><a href=\"https:\/\/twitter.com\/MatthewLilley\/status\/1600025600734818305\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">The proposal, if passed, could have far-reaching implications for investors. This reward fee paid to xSushi incentivizes community members to hold onto SUSHI tokens by providing an additional income on top of any appreciation in value they may experience.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">If the reward fee reserved for xSushi holders is taken away, it removes that revenue. The proposal has already sparked comments from community members, with some users expressing their anger at what they saw as an unjustifiable move.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Depriving xSushi holders of the fees they are entitled to is a breach of primary covenant before the community,” one community member <\/span><a href=\"https:\/\/forum.sushi.com\/t\/reinstated-increase-kanpai-treasury-allocation-to-100\/11475\/5\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">responded<\/span><\/a><span data-v-f87c67ca=\"\"> to the proposal.<\/span>","<span data-v-f87c67ca=\"\">Adam Cochran, partner at Cinneamhain Ventures weighed in on the matter, saying the team should justify its performance metrics before asking for a $5 million runway. He described the latest proposal as akin to a “rug,” a term used to describe a situation when a crypto project takes funds from its users.<\/span>","<span data-v-f87c67ca=\"\">“The team should probably defend a $5m runway with poor key performance indicators [KPIs] before rugging holders,” Cochran <\/span><a href=\"https:\/\/twitter.com\/adamscochran\/status\/1600026381223890949\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\">, referring to how the project’s actions may harm the interest of xSushi holders.<\/span>","<span data-v-f87c67ca=\"\">That being said, SushiSwap is hoping to turn its fortunes around with a planned proposal called <\/span><a href=\"https:\/\/www.theblock.co\/post\/178658\/sushiswap-weighs-new-dao-structure-that-uses-non-transferable-shares\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Meiji<\/span><\/a><span data-v-f87c67ca=\"\">, which sets out to create a new decentralized autonomous organization (DAO) that will be funded by protocol fees and governed with non-transferable voting shares.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In addition to this, the DAO has proposed introducing Curve-style Vote Escrow (VE) tokenomics. That system would incentivize token holders to lock their assets for an extended period of time, as they will receive rewards for doing so. The idea is that, with these two components in place, the new DAO can become self-sustaining and benefit from more stable capitalization over the long term.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Cochran","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"Adam Cochran","content":"PERSON"},{"type":"Grey","content":"PERSON"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"SushiSwap","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Jared Grey","content":"PERSON"},{"type":"Cinneamhain Ventures","content":"ORGANIZATION"},{"type":"0.05%","content":"PERCENT"},{"type":"Lilley","content":"PERSON"},{"type":"Matthew Lilley","content":"PERSON"},{"type":"Meiji","content":"ORGANIZATION"},{"type":"$5 million","content":"MONEY"},{"type":"$5m","content":"MONEY"}],"hashtag":["DEXS","STAKING"],"authors":["Vishal Chawla","The Block"]}