{"summary":"Parties met today for a second day hearing in Celsius’s Chapter 11 bankruptcy proceedings.\nCelsius received approval to sell bitcoin it’s mined in order to meet operational expenses. ","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/163956\/celsius-approved-to-access-mined-bitcoin-to-meet-operational-expenses","publishDate":"2022-08-16T20:46:18","id":2505,"type":null,"title":"Celsius approved to access mined bitcoin to meet operational expenses","category":["Legal"],"content":["A bankruptcy court judge approved Celsius's plans to sell bitcoin it's mined to fund its operations, despite considerable opposition from the US Trustee appointed to the case.","Parties in crypto lender Celsius's bankruptcy proceedings met again today to settle a number of matters related to the firm's operations as it faces a possible reorganization. Most of those motions were uncontested and swiftly granted by Judge Martin Glenn, chief judge of the US Bankruptcy Court for the Southern District of New York. This included the ability to pay certain critical vendors, taxes and fees, utilities related to business operations, insurance fees, and of course, legal counsel.&nbsp;","Some however, faced more scrutiny. The firm's Bitcoin Sale Motion faced significant pushback from the US Trustee, Shara Cornell. Before it was forced to enter Chapter 11 proceedings last month, the firm had plans to <a href=\"https:\/\/www.theblock.co\/post\/124968\/celsius-500-million-bitcoin-mining\" data-v-f87c67ca=\"\">expand<\/a> <a href=\"https:\/\/www.theblock.co\/post\/147079\/celsius-announces-plans-for-an-ipo-of-its-bitcoin-mining-subsidiary\" data-v-f87c67ca=\"\">further<\/a> into the mining sphere. The operation currently generates around 14.2 BTC a day, according to court filings.&nbsp;","Previously, it used mined bitcoin, which totaled 3,114BTC in 2021, to cover expenses. This included expenses related to its mining expansion, which has become a considerable cost and point of contention in the proceedings. During the proceedings' <a href=\"https:\/\/www.theblock.co\/post\/158339\/celsius-first-day-bankruptcy-proceedings-address-the-interim-before-a-reorganization\" data-v-f87c67ca=\"\">first day hearings<\/a> last month, multiple interim motions included provisions for costs related to a mining facility that remains under construction.","Celsius has previously pushed the <a href=\"https:\/\/www.theblock.co\/post\/157647\/celsius-bankruptcy-documents-claim-1-2-billion-balance-sheet-gap\" data-v-f87c67ca=\"\">idea<\/a> that its mining operations will pay off significant portions of its debts, including the $750 million inter-company loan the mining subsidiary took from Celsius. Those debts and expenses also appear to have grown in recent weeks, as a <a href=\"https:\/\/www.theblock.co\/post\/163687\/celsius-report-shows-2-8-billion-in-crypto-liabilities-dwindling-cash-flow\" data-v-f87c67ca=\"\">filing<\/a> ahead of the hearing showed the firm is on track to run out of cash by October, although counsel teased it had potential lenders that could help finance the firm past that point. The legal team did not identify those potential lenders.&nbsp;","Celsius entered Chapter 11 proceedings last month after halting withdrawals due to cascading market conditions and ensuing liquidity troubles. At that point, it ceased accessing the mined bitcoin, and today sought the ability to sell it to cover operational expenses, particularly those related to the expansion of the mining business.","An original draft of the motion drew concern from the creditor committee and US Trustee, since it was unclear whether Celsius intended to use this BTC for trading or lending activities to generate further profit, but a final draft assuaged these concerns.&nbsp;","Still, both Glenn and Cornell were skeptical of this plan, pointing to documentation that showed the mining business is on track to be cash flow negative for the time being. Attorneys at Kirkland &amp; Ellis argued that this is mainly due to the fact that center is still under construction.&nbsp;","Cornell continued to push back over transparency concerns – similar to concerns she raised during the first day proceedings. Cornell said her office still lacked sufficient information on the specifics of the mining costs, and she's found the situation so opaque that the US Trustee is considering appointing an examiner to Celsius for clarity on this and other issues.&nbsp;","Glenn ultimately granted the motion, allowing Celsius to monetize the mined bitcoin.&nbsp;","\"At the bottom, I think this is a business judgment decision,\" Glenn said.&nbsp;","However, he made it clear that it could ultimately prove to be a bad business judgment by Celsius. Ultimately, the firm is taking a risk on its mining business, one that could prove to have adverse effects if it doesn't become cash flow positive.","The court did kick one can down the road in the form of a motion to sell de minimis assets. In the lead up to the hearing, the US Trustee objected to the motion, saying it was unclear what Celsius was seeking to sell, swap or transfer. During today's hearing, Cornell said Celsius informed her team that it intended to sell stocks and equities, which she contends doesn't fit the scope of the motion. Celsius also hasn't yet clarified what positions it is holding and what it intends to sell off. Glenn said he wouldn't be resolving the matter today given that new information.","The parties will meet again on September 1, but before then, the <a href=\"https:\/\/www.theblock.co\/post\/162309\/celsius-creditor-committee-says-it-will-investigate-conduct-of-mashinsky-and-other-insiders\" data-v-f87c67ca=\"\">creditor committee<\/a> will meet by phone on August 19.&nbsp;"],"hashtag":[]}