{"summary":"Bankrupt lender Celsius said that it will temporarily store about 20,000 mining rigs retrieved from Core Scientific’s hosting facility while it looks for other opportunities.\nCore Scientific was allowed by a judge to turn off all of Celsius Mining’s machines.\nCelsius said the current turnaround in market trends “provided support for margin and cash flows.”","author":["Catarina Moura","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/205100\/celsius-to-store-20000-mining-machines-remains-optimistic-about-new-hosting-sites","publishDate":"2023-01-24T13:16:11","id":2506,"type":null,"title":"Celsius to store 20,000 mining machines, remains optimistic about new hosting sites","category":["Crypto Infrastructure"],"content":["The mining arm of bankrupt lending firm Celsius will temporarily store 20,000 rigs it's retrieving from Core Scientific and is optimistic about finding new hosting locations.","The company has already started the process of taking back 37,500 machines after a judge allowed Core Scientific to <a href=\"https:\/\/www.theblock.co\/post\/199050\/core-scientific-will-cut-power-to-37000-celsius-miners-bloomberg\" data-v-f87c67ca=\"\">turn them off<\/a> earlier this month. It expects to finish the process by mid-March, said Chris Ferraro, who is operating as chief restructuring officer and interim CEO.","\"There are options for hosting in the market that will allow us to continue mining with positive operating cash flows and significant upside,\" Ferraro said in the hearing.","Celsius had been in conflict with Core Scientific — which also filed for bankruptcy last month — over the terms of a hosting agreement, with the former <a href=\"http:\/\/filing a motion\" data-v-f87c67ca=\"\">filing a motion<\/a> to enforce an automatic stay in September. Core, however, <a href=\"https:\/\/www.theblock.co\/post\/176589\/core-scientific-wants-celsius-to-pay-its-mining-bills-amid-bankruptcy-process\" data-v-f87c67ca=\"\">claimed<\/a> that Celsius was \"using its Chapter 11 proceeding to withhold payment of certain charges.\"","Last month, Core Scientific got the green light from its bankruptcy judge to power off all of Celsius' machines. Celsius is also one of Core Scientific's note-holders.","The current environment has been disastrous for miners. Lower cryptocurrency prices and higher energy costs squeeze margins, and forced several companies to file for bankruptcy.","Ferraro said that Celsius' liquidity has improved with the recent rise in the price of bitcoin. There has also been a \"tremendous decline\" in energy costs after peaking in the fall. Bitcoin has recently been trading at around $23,000, the highest since last summer.","\"Given the favorable market trends in energy prices and the improving price of bitcoin, we believe that there are options for hosting in the market that will allow us to continue mining with positive operating cash flows and significant upside,\" Ferraro said. \"That's provided support for margin and cash flows.\"","The company is currently mining 7 to 8 BTC per day at a margin of&nbsp;25% to 30%,&nbsp;with 27,500 machines hashing.","Ferraro said that 2,150 rigs have been removed from Core Scientific's facilities, while an additional 3,750 will be picked up this week and 2,700 next week. The company will send 6,000 machines to a site in Texas, and 10,000 to bitcoin miner Mawson Infrastructure's site in Pennsylvania."],"hashtag":["MINING COMPANIES"]}