{"summary":"Liquid restaking protocol Kelp rolled out the KEP token, offering a tokenized version of EigenLayer reward points.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279807\/kelp-eigenlayer-points-kep","publishDate":"2024-02-29T08:00:38","id":2506,"type":null,"title":"Kelp tokenizes EigenLayer points, KEP trades at $21 million valuation","category":["CRYPTO ECOSYSTEMS"],"content":["Liquid restaking protocol Kelp has opened claims for the KEP token, allowing users to access a tokenized version of EigenLayer reward points.","Kelp, so far, has 156 million KEP tokens — of which 10 million of these tokens have been claimed by users, <a href=\"https:\/\/www.kelpdao.xyz\/claim-kep\/\" data-v-f87c67ca=\"\">Kelp data<\/a> shows. This gives these tokens a diluted market cap of $21 million at a price of <a href=\"https:\/\/www.coingecko.com\/en\/search_redirect?id=kelp-earned-points&amp;type=coin\" data-v-f87c67ca=\"\">$0.14 per token<\/a>.","This development occurs within the context of growing interest in liquid restaking, where the total value locked across leading platforms has surpassed <a href=\"https:\/\/www.theblock.co\/post\/278135\/liquid-restaking-protocols-tvl-3b#:~:text=The%20total%20value%20locked%20in%20liquid%20restaking%20tolens%20has%20surpassed,deposits%20over%20the%20last%20month.\" data-v-f87c67ca=\"\">$4 billion<\/a>. Kelp itself has secured total deposits of more than <a href=\"https:\/\/defillama.com\/protocol\/kelp-dao\" data-v-f87c67ca=\"\">$600 million<\/a>.","EigenLayer’s strategy involves <a href=\"https:\/\/www.theblock.co\/post\/273732\/eigenlayer-plans-shared-security-model-for-dapps\" data-v-f87c67ca=\"\">leveraging ETH’s economic security<\/a> by accepting native ETH — which can be directly restaked by Ethereum validators — and liquid staked ETH, or liquid staking protocols. This can then be used to secure other protocols, though this feature is yet to go live. This is referred to as restaking.","Meanwhile, the idea behind liquid restaking offered by Kelp (and others such as EtherFi and Renzo) is that it allows ETH holders — holding either native or sometimes LST tokens — to invest and restake on Eigen without losing access to the underlying capital. (Hence the term “liquid.”)","Users of EigenLayer earn points for their ether deposits, which are said to increase their odds of receiving a token from EigenLayer. Users of liquid restaking keep their capital liquid while also retaining their Eigen points.","Kelp has converted these points into a token, opening up its separate on-chain market and a brand new cryptocurrency niche. <a href=\"https:\/\/www.theblock.co\/post\/277823\/crypto-projects-115b-points\" data-v-f87c67ca=\"\">Other avenues for trading points<\/a> exist, like Whales Market and Pendle, but they have yet to convert points into tokens.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Eigen","content":"PERSON"},{"type":"Pendle","content":"PERSON"},{"type":"$0.14","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"$4 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$21 million","content":"MONEY"},{"type":"$600 million","content":"MONEY"}],"hashtag":["ASSETS","DERIVATIVES","PROTOCOLS","RESTAKING"],"authors":["Vishal Chawla","The Block"]}