{"summary":"After months of regulatory actions against exchanges operating in Canada, securities regulators have started greenlighting trading platforms.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/115804\/ontario-securities-regulator-bars-the-countrys-first-registered-crypto-platforms-from-trading-tether","publishDate":"2021-08-27T10:51:33","id":2508,"type":null,"title":"Ontario securities regulator bars the country&#x27;s first registered crypto platforms from trading Tether","category":["EXCHANGES"],"content":["The Ontario Securities Commission has barred a pair of trading platforms that offer crypto services from trading Tether, according to regulatory documents issued in recent weeks.","Both based in Toronto, <a href=\"https:\/\/www.osc.ca\/sites\/default\/files\/2021-06\/ord_20210622_wealthsimple.pdf\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Wealthsimple<\/a> and <a href=\"https:\/\/www.osc.ca\/sites\/default\/files\/2021-08\/ord_20210819_coinberry-limited.pdf\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Coinberry<\/a> are the first companies of their kind allowed into what the Canadian Securities Administrators term \"an interim, time-limited registration framework that would allow crypto asset platforms to operate within a regulated environment, with regulatory requirements tailored to the crypto asset platform's operations.\"","Yet those approvals appear to limit these platforms to a select number of approved cryptocurrencies, naming bitcoin, ether, bitcoin cash and litecoin in particular.","Tether is the sole digital asset named in an appendix marked \"Prohibited Crypto Assets.\"","\"The Filer will not trade Crypto Contracts based on crypto assets, digital or virtual currencies, and digital or virtual tokens listed in Appendix C to this Decision,\" both approval documents note.","<em data-v-f87c67ca=\"\">Screenshot from the Coinberry approval notice<\/em>","Neither document offers any specific rationale for why the platforms in question would be barred from trading Tether. Nonetheless, the OSC's filings include the disclaimer that its \"decision should not be viewed as precedent for other filers.\"","A representative for the OSC wrote to The Block that:","\"We do not currently plan to introduce new rules specifically applicable to platforms, as platforms are already subject to existing requirements under securities legislation in Canada. Rather, where appropriate, existing requirements of securities legislation may be tailored through terms and conditions on the registration or recognition of CTPs [cryptocurrency trading platforms] and through discretionary exemptive relief with appropriate conditions. \"","Christine Duhaime, a Canadian lawyer who specializes in financial technologies, told The Block that \"with respect to Tether and Bitfinex, the report by the New York AG likely did not provide comfort to the securities regulators and in the eyes of a government regulator, is likely going to be viewed as high-risk.\"","\"Until some digital currency companies tie themselves to a jurisdiction with transparency and where digital currency holders have rights they can exercise if things go awry, I suspect that they won’t be permitted to operate in mature regulatory jurisdictions,\" Duhaime continued.&nbsp;","Tether, which issues USDT, settled a lawsuit with the New York Attorney General in February, which barred the stablecoin operator from doing business in New York and required it to report greater details of its operations. Tether reportedly faces <a href=\"https:\/\/www.theblockcrypto.com\/linked\/112452\/us-officials-investigating-tether-executives-for-bank-fraud-report\" data-v-f87c67ca=\"\">continuing regulatory challenges<\/a> despite an <a href=\"https:\/\/www.theblockcrypto.com\/daily\/114954\/everything-you-need-to-know-about-the-stablecoin-wars\" data-v-f87c67ca=\"\">ongoing expansion of disclosures<\/a>.&nbsp;","As&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/post\/106206\/with-poloniex-action-canadas-securities-regulators-get-serious-about-crypto-exchange-oversight\" data-v-f87c67ca=\"\">The Block has reported previously<\/a>, Canada's securities regulators, specifically the Ontario Securities Commission, have been busily enforcing a new principle that exchanges holding crypto in custody are de facto offering securities, even if the cryptocurrencies involved are not themselves securities.","The \"crypto contracts,\" i.e. the agreement between platform and user, themselves require risk disclosures that fall more in line with securities trading.","Wealthsimple was the only crypto trading platform that the OSC identified as fully registered before it commenced scrutinizing exchanges more closely. And Coinberry was the only crypto exchange to report to the Ontario Securities Commission before an April deadline, after which the OSC began a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/106012\/ontario-regulator-accuses-poloniex-of-disregarding-securities-laws-in-enforcement-against-crypto-exchange\" data-v-f87c67ca=\"\">series of legal actions<\/a>&nbsp;to push other crypto exchanges out.&nbsp;","Wealthsimple is an online brokerage platform that allows users to get price exposure to crypto. Similar to Robinhood, users cannot withdraw crypto. Coinberry is more of a classic cryptocurrency exchange that does allow withdrawals.","As a representative for Coinberry phrased it to The Block, this makes the firm \"the first pure-play crypto trading platform in Canada to be fully registered.\" The firm did not respond to a question about the regulatory regime that awaits it after those two years.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"Crypto Contracts","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"New York Attorney General","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Coinberry","content":"ORGANIZATION"},{"type":"Canadian Securities Administrators","content":"ORGANIZATION"},{"type":"Coinberry","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"Toronto","content":"LOCATION"},{"type":"Duhaime","content":"PERSON"},{"type":"OSC","content":"ORGANIZATION"},{"type":"Christine Duhaime","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"Ontario Securities Commission","content":"ORGANIZATION"}],"hashtag":["TETHER"],"authors":["Kollen Post","The Block"]}