{"summary":"It is more appropriate to characterize bitcoin as a “risk” asset rather than a “safe” asset, say JPMorgan strategists.\nBitcoin’s price return to $40,000 looks difficult in the near future, according to the strategists.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/92357\/bitcoin-risk-rather-than-safe-asset-jpmorgan-strategists","publishDate":"2021-01-25T05:45:11","id":2509,"type":null,"title":"Bitcoin is a &#x27;risk&#x27; rather than &#x27;safe&#x27; asset, say JPMorgan strategists","category":["Bitcoin"],"content":["It is more appropriate to characterize bitcoin as a \"risk\" asset rather than a \"safe\" asset, according to JPMorgan strategists.","This is because of how bitcoin has behaved over the past year against equity, JPMorgan strategists led by Nikolaos Panigirtzoglou <a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2021\/01\/Flows-Liquidity_22Jan21.pdf\" data-v-f87c67ca=\"\">said in a note<\/a> published Friday. Since March 2020, the correlation between bitcoin and S&amp;P500 has increased, said the strategists.","Gold's correlation with S&amp;P500 has also been predominantly positive. Therefore, \"both bitcoin and gold could be more characterized as 'risk' rather than 'safe' assets,\" said the strategists, who believe investors prefer these assets because they are \"alternative\" options rather than safe or \"hedge\" assets.<br data-v-f87c67ca=\"\">\n","","While bitcoin is witnessing institutional and retail demand, its price return to $40,000 looks difficult in the near future, according to the strategists. This is because the pace of flows into the <a href=\"https:\/\/www.theblockcrypto.com\/data\/crypto-markets\/grayscale\" data-v-f87c67ca=\"\">Grayscale Bitcoin Trust (GBTC)<\/a> \"appears to have peaked\" based on four-week rolling averages.","\"At the moment, the institutional flow impulse behind the Grayscale Bitcoin Trust is not strong enough for bitcoin to break out above $40k as the 4-week pace of the flow into GBTC appears to have peaked,\" said the strategists. \"Thus the risk is that momentum traders will continue to unwind <a href=\"https:\/\/www.theblockcrypto.com\/data\/crypto-markets\/futures\" data-v-f87c67ca=\"\">bitcoin futures<\/a> positions.\"","<iframe title=\"GBTC Flows\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/grayscale\/gbtc-flows\/embed\" width=\"100%\" height=\"420\" frameborder=\"0\" data-v-f87c67ca=\"\"><\/iframe>","Earlier this month, the strategists <a href=\"https:\/\/www.theblockcrypto.com\/post\/90079\/bitcoin-btc-price-target-146000-jpmorgan\" data-v-f87c67ca=\"\">said Bitcoin's price could reach above $146,000 over the long term<\/a>, provided that bitcoin's volatility converges to that of gold. Reiterating that point in Friday's note, the strategists said that process is likely a multi-year process and depends on bitcoin ownership becoming more institutional and less retail over the coming years.","\"In all, while bitcoin is currently trading within our fair value range of between $11k and $35k (at current levels of bitcoin volatility), the apparent peaking of the flow pace into the Grayscale Bitcoin Trust and a mechanically decay of our momentum signal till the end of March, both imply that the near term balance of risks is still skewed to the downside,\" they added."],"hashtag":["BITCOIN","JPMORGAN"]}