{"summary":"The round included participation from Offchain Labs and Wormhole — as well as core contributors from Polygon, Scroll and Curve.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266047\/curvance-seed-round","publishDate":"2023-12-05T10:00:04","id":2510,"type":null,"title":"Curvance emerges from stealth with $3.6 million round for DeFi &#x27;everything app&#x27;","category":["DEALS"],"content":["DeFi platform Curvance has emerged from stealth to secure a $3.6 million seed funding round, with contributions from over 20 decentralized autonomous organizations and leading developers.","The round included investment from Arbitrum developer Offchain Labs, cross-chain messaging platform Wormhole and angel investors, including Polygon co-founder Sandeep Nailwal, according to a statement. Core contributors from crypto projects Scroll, Mantle, Eigenlayer, GMX, Curve Finance, Convex Finance, Balancer, Aura Finance and Pendle Finance — as well as DAOs, including Frax Finance — also participated in the round.","The Curvance team describes the project as a DeFi “everything app” for lending and borrowing, designed to help address fragmentation across chains and protocols, which can serve as a barrier to entry. Curvance currently supports Ethereum and Layer 2s such as Arbitrum, Optimism, Scroll, Base and Polygon zkEVM — tapping into liquidity across decentralized exchanges like Curve, Balancer, Velodrome, GMX and Pendle in an attempt to improve cross-chain capital efficiency.","“Curvance will give users of any blockchain an easy route to participate in Polygon DeFi, with the potential to make onboarding easier than ever,” Nailwal said in the statement.","Curvance plans to use the funds to expand operations, boost security audits and recruit top talent in the DeFi market. “With this funding round, Curvance will be able to expand on its value proposition of bringing forward a more approachable money market experience for both DeFi newcomers and experienced yield farmers and traders alike,” Curvance co-founder Chris Carapola said.","\"When we started looking for funding, we chose to talk to our partners first, instead of just going to venture capital firms,” Curvance co-founder Michael Butcher explained. “This way, we ended up with a group of investors who care about our long-term success,” adding he expected Curvance to launch on testnet soon.","Curvance is not the only project seeking to establish itself in the omni-chain money market sector. Radiant Capital, for example, built on top of LayerZero’s interoperability protocol, currently supports lending and borrowing across Ethereum, Arbitrum and BNB Chain following a <a href=\"https:\/\/www.theblock.co\/post\/240713\/binance-labs-10-million-cross-chain-defi-lender-radiant-capital\" data-v-f87c67ca=\"\">$10 million investment<\/a> from Binance Labs in July. However, it could be more challenging for either to compete if DeFi lending incumbents such as Aave and Compound also moved into the niche.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Velodrome","content":"LOCATION"},{"type":"Michael Butcher","content":"PERSON"},{"type":"Binance Labs","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Frax Finance","content":"ORGANIZATION"},{"type":"$3.6 million","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Pendle Finance","content":"ORGANIZATION"},{"type":"Convex Finance","content":"ORGANIZATION"},{"type":"Curve Finance","content":"ORGANIZATION"},{"type":"Aura Finance","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"Chris Carapola","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Nailwal","content":"ORGANIZATION"},{"type":"Eigenlayer","content":"PERSON"},{"type":"Sandeep Nailwal","content":"PERSON"},{"type":"Pendle","content":"PERSON"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Mantle","content":"PERSON"},{"type":"Polygon DeFi","content":"LOCATION"},{"type":"GMX","content":"ORGANIZATION"},{"type":"Balancer","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["LENDING","SEED &AMP; PRE-SEED"],"authors":["James Hunt","The Block"]}