{"summary":"Dashjr says inscriptions are exploiting a vulnerability to spam the Bitcoin blockchain, while the community insists they &quot;will never stop.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266298\/bitcoin-dev-luke-dashjr-calls-inscriptions-spam-community-members-push-back","publishDate":"2023-12-06T09:13:53","id":2512,"type":null,"title":"Bitcoin dev Luke Dashjr calls inscriptions &#x27;spam,&#x27; community members push back","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.71%\n    <\/span><\/a> <!----><\/span><\/span> developer and co-founder of the Ocean mining pool Luke Dashjr launched a tirade of criticism toward inscriptions like Ordinals and BRC-20 tokens, describing them as \"spam\" on the Bitcoin blockchain amid an ongoing debate surrounding network congestion issues and differing perspectives on how Bitcoin should be used.<\/span>","“Inscriptions are exploiting a vulnerability in Bitcoin Core to spam the blockchain. Bitcoin Core has, since 2013, allowed users to set a limit on the size of extra data in transactions they relay or mine. By obfuscating their data as program code, inscriptions bypass this limit, Dashjr <a href=\"https:\/\/twitter.com\/LukeDashjr\/status\/1732204937466032285?s=20\" data-v-f87c67ca=\"\">posted<\/a> on X.","“This bug was recently fixed in Bitcoin Knots v25.1,” Dashjr added. “Bitcoin Core is still vulnerable in the upcoming v26 release. I can only hope it will finally get fixed before v27 next year.”","Responding to a community member who asked, “So if this \"bug\/vulnerability\" is fixed, does it mean Ordinals and BRC-20 tokens would stop being a thing?” Dashjr replied, “Correct,” adding, “Ordinals never existed to begin with. It's all fraud,” though existing inscriptions would remain.","Bitcoin Knots is a derivative of Bitcoin Core, primarily maintained by Dashjr and used by a relatively small percentage of Bitcoin nodes — 147 (0.22%), <a href=\"https:\/\/luke.dashjr.org\/programs\/bitcoin\/files\/charts\/software.html\" data-v-f87c67ca=\"\">according<\/a> to Dashjr’s own website. Gaining consensus to make similar changes to Bitcoin Core — the most widely used software implementation of the Bitcoin protocol — used by 66,545 nodes (98.83%) in comparison, is a very different matter.","While Dashjr's remarks found <a href=\"https:\/\/x.com\/giacomozucco\/status\/1730221104847847825?s=20\" data-v-f87c67ca=\"\">support<\/a> from other Bitcoiners like educator Giacomo Zucco, many also disagreed.","In response to Dashjr’s post, Trevor Owens, General Partner at Bitcoin Frontier Fund <a href=\"https:\/\/x.com\/TO\/status\/1732223894449258760?s=20\" data-v-f87c67ca=\"\">said<\/a>, “Whether it gets added to Bitcoin Core v27 or not (hint: it won’t) the inscriptions will never stop. People will pay for them and miners will mine them. As long as the market demands it, there is nothing you can do to stop it. You will save yourself years of frustration and happiness by accepting this reality.” The same message was also <a href=\"https:\/\/x.com\/ordjingle\/status\/1732313252972138713?s=20\" data-v-f87c67ca=\"\">posted<\/a> by several other Ordinals community members.","“Luke has made some sporadic contributions to open source Bitcoin projects over the years, but he does not own the chain,” co-founder of the Bitcoin Ordinals project Taproot Wizards, Udi Wertheimer told The Block.","“He’s been rage-tweeting about Ordinals inscriptions since February and was unable to stop them. We expect the coping and seething to continue as Ordinals further strengthen their position as the main use case of the Bitcoin chain,\" Wertheimer added. “We’d like to use this opportunity to thank Luke for hosting our wizard JPEGs on his Bitcoin nodes forever.”","\"He’s not proposing a consensus rule change, he’s proposing that miners implement policy filters that don’t allow inscriptions to get into blocks,” fellow Taproot Wizards co-founder Eric Wall told The Block.","“If Luke had had his way, it means that it only requires one mining pool to include inscriptions into the chain. We already know one such pool that loves Ordinals — Luxor, who helped us mine the 4MB Taproot Wizard jpeg. If Luxor had a monopoly on mining inscriptions, it would be the most profitable pool by far, and even if you entertained Luke’s fantasy ideas, it would then be extremely centralizing for hashrate since most people would just mine with Luxor,” Wall added. “What Luke is proposing is completely antithetical to his goals.”","“Luke Dashjr is taking a moralistic position on Ordinals inscriptions while also building the mining method at Ocean with which to completely ignore the heavy data load inscription transactions. Solving money with math is a mission that few are taking seriously and Dashjr has the chops to implement a way to not clog bitcoin's blockchain. However, Dashjr's view isn't the network consensus and his efforts may be a drop in the bucket of inscriptions that fellow mining pools are willing to mine in pursuit of the greater profits that inscriptions have brought for bitcoin miners,\" Jesse Shrader, co-founder and CEO of Lightning Network data analytics provider Amboss, told The Block.","“Taking a moral stance on which transactions are good or bad to mine is largely in conflict with what Bitcoin has always been: a ruthlessly neutral protocol. Once you start making subjective decisions about what transactions are okay based on their content, protocol users may find themselves with reduced censorship resistance since we've moved a step away from fee-based transaction merit,” Shrader added.","“Luke is entitled to his opinions, but I suspect you'll find few folks who agree with classifying inscriptions as a vulnerability,” Casa CTO Jameson Lopp told The Block. “Classifying them as spam is subjective: it depends on if you believe that you should get to decide what use cases are an appropriate use of the Bitcoin protocol or if you believe that any valid transaction that pays a competitive fee should be allowed to purchase block space.”&nbsp;","Lopp added he expects economic rationality to prevail, <a href=\"https:\/\/twitter.com\/lopp\/status\/1732369194505715972\" data-v-f87c67ca=\"\">explaining<\/a> on X that miners are now mostly large enterprises with a duty to maximize profit for shareholders and so they will mine any valid transaction that pays the highest fee rates. On the developer side, Lopp previously <a href=\"https:\/\/x.com\/lopp\/status\/1620458497656897536?s=20\" data-v-f87c67ca=\"\">said<\/a>, “Banning arbitrary data is a rabbit hole you don't want to go down.”","Ocean mining pool raised a <a href=\"https:\/\/www.theblock.co\/post\/265120\/jack-dorsey-seed-round-decentralized-bitcoin-mining-pool-ocean\" data-v-f87c67ca=\"\">$6.2 million seed round<\/a> led by Block CEO Jack Dorsey last week to support its launch and other decentralized mining decentralization projects. Ocean also utilizes the “fixed” version of Bitcoin Knots to filter inscriptions transactions, it <a href=\"https:\/\/x.com\/ocean_mining\/status\/1732207450114162855?s=20\" data-v-f87c67ca=\"\">confirmed<\/a> on X. “Among other improvements, this upgrade fixes this long-standing vulnerability exploited by modern spammers. As a result, our blocks will now include many more real transactions and help to bring an end to the DoS attack being performed on the Bitcoin network,” it said.","After the raise, Wertheimer had previously <a href=\"https:\/\/x.com\/udiWertheimer\/status\/1730062734476108201?s=20\" data-v-f87c67ca=\"\">said<\/a> about the filtering, “[I] strongly doubt that it’s true (if it is, they'll go bankrupt quickly).”","When criticized over the perception that Ocean was effectively censoring transactions, Ocean's Global Head of Sales, the pseudonymous Bitcoin Mechanic <a href=\"https:\/\/x.com\/GrassFedBitcoin\/status\/1730088155271832029?s=20\" data-v-f87c67ca=\"\">said<\/a>, “It doesn't make sense to keep talking about censorship with people who don't understand what it is. We are going to filter out inscriptions spam. You're free to mine with other pools and to continue spreading FUD.”","Many other miners have been happy with the rise of inscriptions on Bitcoin, however, incentivized by the extra transaction fees they receive on top of Bitcoin block rewards. “Bitcoin works with the assumption that a majority of miners are honest, not malicious. Besides, spam-filtered blocks often have more fees anyway for some reason,” Dashjr <a href=\"https:\/\/x.com\/LukeDashjr\/status\/1732229419350053189?s=20\" data-v-f87c67ca=\"\">argued<\/a>.","Transactions on the Bitcoin network have surged at various points this year, coinciding with pick-ups in inscriptions-related activity, reaching an all-time high of 607,000 average daily transactions in November, according to The Block’s data dashboard.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/transactions-on-the-bitcoin-network-daily\/embed\" title=\"Transactions on the Bitcoin Network (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The share of Bitcoin miner revenue from transaction fees compared to the reward subsidy has risen as a result.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoin-miner-revenue-daily\/embed\" title=\"Bitcoin Miner Revenue (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The activity has also led to congestion, however, causing fees to rise or delays in processing transactions if other users are not willing to pay the higher fees. Over 275,000 transactions are awaiting confirmation on Bitcoin at present — more than five times higher than the allotted 300 MB memory usage. This means average fees are currently around $17 to get a transaction in the next block, rather than a $1 to $2 historical average, <a href=\"https:\/\/mempool.space\/\" data-v-f87c67ca=\"\">according<\/a> to Bitcoin explorer Mempool.","The rise in popularity of <a href=\"https:\/\/www.theblock.co\/post\/207086\/what-are-bitcoin-nfts-ordinals-and-how-do-they-work\" data-v-f87c67ca=\"\">Ordinals<\/a> on Bitcoin earlier this year fueled debate over whether or not inscriptions representing things like NFTs and BRC-20 tokens on Bitcoin should exist. Inscriptions rely on Bitcoin’s OP_RETURN function, used to store arbitrary data in the blockchain.","Some argue that these elements are unintended consequences of Bitcoin’s SegWit and Taproot upgrades, making inscriptions more economically feasible, and should be removed from Bitcoin. Others maintain that such unintended consequences are an integral part of any upgrade, and usage should continue as long as users comply with Bitcoin’s rules.","“I see this as a fundamental problem between two main perspectives of how Bitcoin should be used,” Lopp told The Block in July. “One of them is more subjective, saying we should only allow simple and pure financial transactions. Like Bitcoin is just money. The other one is that Bitcoin is a programmable monetary protocol and it should be open for people to use as long as they're operating within the rules” he explained.","BRC-20-style tokens have also been <a href=\"https:\/\/www.theblock.co\/post\/266272\/brc-20-style-tokens-are-spreading-to-chains-beyond-bitcoin-but-why?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">spreading to other chains<\/a>, including Ethereum, Solana, Near, Polygon, Celo and Fantom, also causing a spike in transactions.","Daily average transactions on the Near blockchain, for example, have surged to a new all-time high this month following the phenomenon, according to The Block’s data dashboard.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/non-evm-chains-stats\/transactions-on-near-daily-7dma\/embed\" title=\"Transactions on NEAR (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","A similar surge was also recently witnessed on <a href=\"https:\/\/www.theblock.co\/post\/263355\/minting-of-ordinals-like-tokens-causes-big-surge-in-polygon-transaction-fees\" data-v-f87c67ca=\"\">Polygon<\/a>, as The Block previously reported.","Eric Wall <a href=\"https:\/\/x.com\/ercwl\/status\/1732182391559483603?s=20\" data-v-f87c67ca=\"\">explained<\/a> on X why this was happening “Because burning gas\/wasting blockspace is one of the last distribution mechanisms that exists with open access to retail.”","Wall pointed out the challenges for retail investors in accessing low-cap cryptocurrencies, such as the illegality of ICOs, the difficulties in farming airdrops or investing in memecoins due to potential risks of market manipulation. Whereas \"inscription coins,\" a derivative of BRC-20 tokens, allow anyone to participate in the issuance of a specific ticker from day one, he said.","“Degeneracy finds a way,” Wall added.","<em data-v-f87c67ca=\"\">Updated with additional comments.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"General Partner","content":"ORGANIZATION"},{"type":"Dashjr","content":"ORGANIZATION"},{"type":"Polygon","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2013","content":"DATE"},{"type":"0.22%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$17","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"20","content":"DATE"},{"type":"$1","content":"MONEY"},{"type":"Bitcoin Frontier Fund","content":"ORGANIZATION"},{"type":"$2","content":"MONEY"},{"type":"November","content":"DATE"},{"type":"Lopp","content":"PERSON"},{"type":"Ocean","content":"ORGANIZATION"},{"type":"Eric Wall","content":"PERSON"},{"type":"Fantom","content":"PERSON"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"Shrader","content":"PERSON"},{"type":"Trevor Owens","content":"PERSON"},{"type":"Luke Dashjr","content":"PERSON"},{"type":"Luxor","content":"LOCATION"},{"type":"Casa CTO Jameson Lopp","content":"ORGANIZATION"},{"type":"Jesse Shrader","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Wertheimer","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"$6.2 million","content":"MONEY"},{"type":"Celo","content":"PERSON"},{"type":"98.83%","content":"PERCENT"},{"type":"Giacomo Zucco","content":"PERSON"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"Luke","content":"PERSON"},{"type":"ICOs","content":"ORGANIZATION"},{"type":"BRC","content":"ORGANIZATION"},{"type":"Dashjr","content":"PERSON"},{"type":"Udi Wertheimer","content":"PERSON"},{"type":"+0.71%","content":"PERCENT"},{"type":"Luke’s","content":"PERSON"},{"type":"Taproot Wizards","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"ups","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["BITCOIN","MINING COMPANIES"],"authors":["James Hunt","The Block"]}