{"summary":"Top digital tokens soar as spot bitcoin ETF&#x27;s first day of trading kicks off and the market swoons with expectation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/271942\/solana-eth-and-xrp-soar-as-spot-bitcoin-etfs-lift-entire-crypto-market","publishDate":"2024-01-11T10:19:32","id":2513,"type":null,"title":"Solana, ETH and XRP soar as spot bitcoin ETFs lift entire crypto market","category":["MARKETS"],"content":["With the highly-anticipated spot bitcoin ETFs finally trading, just about the entire crypto market is surging with many top tokens rising by more than 10%.","Some of the biggest digital tokens by market capitalization are soaring by double digits over the past 24 hours as crypto enthusiasts around the world cheer the Securities and Exchange Commission's decision to approve spot bitcoin ETFs yesterday. The agency <a href=\"https:\/\/www.theblock.co\/post\/271718\/spot-bitcoin-etfs-have-now-been-approved-what-comes-next\" data-v-f87c67ca=\"\">approved a total<\/a> of 11 that are trading on the NYSE, Nasdaq and Cboe exchanges.&nbsp;","Parallel to that, popular tokens are rising precipitously. Ether, the second largest digital currency by market capitalization, had risen by nearly 12% as of 10:05 a.m. ET. That comes amid <span data-v-03de5780=\"\" data-v-f87c67ca=\"\">Bloomberg Intelligence analyst Eric Balchunas <a href=\"https:\/\/www.theblock.co\/post\/271874\/ethereum-etf-approval-may-ether-price-surge\" data-v-f87c67ca=\"\">saying<\/a>&nbsp;that there is <\/span><span data-v-03de5780=\"\" data-v-f87c67ca=\"\">a 70% likelihood a spot Ethereum ETF will be approved in May.<\/span>","Other top tokens also jumped by more than 10%, with Solana up 14%, XRP up 11%, and both Cardano and Avalanche rising my more than 20%, according to The Block Price Page.","Cryptocurrency price action. Image: The Block Price Page.","XRP's rise may be buoyed by <a href=\"https:\/\/www.theblock.co\/post\/271645\/ripple-initiating-285-million-share-buyback-that-values-company-at-11-billion\" data-v-f87c67ca=\"\">news yesterday<\/a> that the crypto-payments firm Ripple Labs, which is known for using the digital token, announced it is planning to buy back $285 million worth of its shares from early investors, a move that will value the company at $11.3 billion.","\"It's a win, because the people want it,\" CNBC television analyst Jim Cramer said ahead of the ETFs beginning to trade on Thursday.","\"Everyone wanted this,\" he added, referencing his discussions with retail investors. \"People didn't want a situation where they had their money in some bank that just disappeared overnight.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"70%","content":"PERCENT"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"12%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Eric Balchunas","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Cardano","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"The Block Price Page","content":"ORGANIZATION"},{"type":"10:05 a.m. ET","content":"TIME"},{"type":"11%","content":"PERCENT"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"$11.3 billion","content":"MONEY"},{"type":"NYSE","content":"ORGANIZATION"},{"type":"Bloomberg Intelligence","content":"ORGANIZATION"},{"type":"14%","content":"PERCENT"},{"type":"Cboe","content":"ORGANIZATION"},{"type":"$285 million","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"Jim Cramer","content":"PERSON"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}