{"summary":"Traditional financial firms are exploring crypto more deeply, said Fireblocks’ Head of Web3, with some now running validators.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/183466\/fireblocks-head-of-web3-traditional-finance-is-diving-deeper-into-crypto","publishDate":"2022-11-05T15:29:21","id":2514,"type":null,"title":"Fireblocks Head of Web3: Traditional finance is diving deeper into crypto","category":["THE BLOCK"],"content":["Traditional financial firms are working their way further into crypto and deeper down the rabbit hole, according to Fireblocks Head of Web3 Omer Amsel.","Fireblocks provides self-custody solutions to more than 1,500 financial institutions and enables them to interact with blockchains and crypto services. These companies, especially the more traditional ones, start with custody services and slowly move into more crypto-native interactions, Amsel said in an interview at Breakpoint, Lisbon.","“We see more and more traditional finance exploring the way into crypto and maybe they're taking a more timid approach,” Amsel said. He pointed to BNY Mellon’s <a href=\"https:\/\/www.theblock.co\/post\/176268\/bny-mellon-launches-crypto-offering-backs-innovation-by-collaboration\" data-v-f87c67ca=\"\">recent launch<\/a> of a crypto custody service, which is using Fireblocks behind the scenes. “I think it's picking up. That's what I would say. I think it's a cumulative thing.”","Amsel gave a hypothetical example of a firm that might have started with crypto custody one or two years ago. He said these firms make this first step, see that it is okay and then start to explore the technology more.","“What I'm trying to say is you will see that the volume from those players just keep[s] increasing internally and as an industry and as a whole,\" Amsel said.","Some of these traditional finance firms and banks have started running their own blockchain validators — nodes that keep blockchains running —&nbsp;because their pre-existing infrastructure is suitable for doing so.","These banks have a lot of servers that are designed to have good uptime, meaning that they’re well suited for running validators, Amsel said. The companies are also able to use Fireblocks, while pointing the service to their own validators.","“We see that actually some of these more traditional institutions dedicate part of their IT to actually run nodes and validators themselves and then stake some of their own funds to their own validators,\" Amsel said. \"So I think that's very interesting. It's still niche in that sense, but we're seeing more and more of that.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Breakpoint","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Amsel","content":"PERSON"},{"type":"Lisbon","content":"LOCATION"},{"type":"BNY Mellon","content":"ORGANIZATION"},{"type":"Fireblocks Head of Web3 Omer Amsel","content":"ORGANIZATION"}],"hashtag":["BNY MELLON","STAKING","VALIDATORS"],"authors":["Tim Copeland","The Block"]}