{"summary":"Veil, a trading platform built on Augur&#x27;s decentralized prediction markets, has bought Texas-based Predictions.Global, the main web portal for reviewing","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/8556\/crypto-ma-heats-up-as-veil-acquires-an-augur-startup","publishDate":"2019-01-24T08:00:03","id":2515,"type":null,"title":"Veil fires up its M&amp;A activity as it acquires an Augur startup","category":["STARTUPS"],"content":["<a href=\"https:\/\/veil.co\/\" data-v-f87c67ca=\"\">Veil,&nbsp;<\/a>a trading platform built on Augur's decentralized prediction markets,&nbsp;has bought&nbsp;<a href=\"https:\/\/www.linkedin.com\/company\/predictions-global\/about\/\" data-v-f87c67ca=\"\">Texas-based Predictions.Global,<\/a>&nbsp;the main web portal for reviewing Augur's stakes and prices. The purchase&nbsp;took place \"a couple months ago,\" co-founder, Paul Fletcher-Hill told The Block<em data-v-f87c67ca=\"\">,<\/em> and the official announcement is expected later today.","Augur allows users&nbsp;to create and trade predictions on a variety of topics from sports, to elections, to crypto prices without the need for centralized market makers, but its&nbsp;interface can be confusing and time-consuming.&nbsp;Last year, Predictions.Global launched a user-friendly website allowing thousands of users to browse Augur's markets through a simple and easy shortcut. It has since become the&nbsp;primary site for accessing Augur's market data, although it does not itself facilitate trades.","Meanwhile, Veil launched its Augur-based trading platform earlier this month, offering a more streamlined interface which eliminates the need to download the Augur app and sync it to Ethereum’s network.&nbsp;Its goal is to make Augur mainstream,<a href=\"https:\/\/www.theblockcrypto.com\/2019\/01\/10\/veil-wants-to-make-decentralized-financial-products-frictionless-for-mainstream-users\/\" data-v-f87c67ca=\"\"> its founders recently told The Block.<\/a>","[related id=\"1\"]","By acquiring Predictions.Global, whose profile and brand is more established than Veil's, the platform wants to become \"the easiest way to discover Augur markets,\" as well as the easiest way to trade, Fletcher-Hill told The&nbsp;Block.&nbsp;He added that the Predictions.Global&nbsp;site&nbsp;would stay as it is for now, beyond \"adding links into Veil.\" He&nbsp;noted that Predictions.Global's&nbsp;cofounder&nbsp;Jorge Olivero&nbsp;would not be joining Veil while Ryan Berckmans&nbsp;would be contracted as a software advisor.","Veil did not disclose the price of the acquisition but said they were not currently pursuing any others. The company raised a fundraising round in the single-digit millions last year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Paul Fletcher","content":"PERSON"},{"type":"The&nbsp;Block","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Fletcher","content":"PERSON"},{"type":"Texas","content":"LOCATION"},{"type":"Jorge Olivero","content":"PERSON"},{"type":"Ryan Berckmans","content":"PERSON"}],"hashtag":[],"authors":["Isabel Woodford","The Block"]}