{"summary":"Payments giant PayPal and its social payments platform Venmo are set to offer crypto buying and selling to users, according to an announcement from the firms.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/81794\/paypal-to-enable-crypto-purchases-with-the-help-of-paxos","publishDate":"2020-10-21T07:42:35","id":2518,"type":null,"title":"PayPal to enable crypto purchases with the help of Paxos","category":["STARTUPS"],"content":["Payments giant PayPal and its social payments platform Venmo are set to offer crypto buying and selling, people familiar with the matter said.","Crypto will solely be offered on PayPal to start, with Venmo slated to follow in 2021, the people said. PayPal has obtained a conditional license from the New York Department of Financial Services (NYDFS), allowing the firm to offer crypto buying and selling. The news was first <a href=\"https:\/\/www.reuters.com\/article\/paypal-cryptocurrency\/paypal-to-allow-cryptocurrency-buying-selling-and-shopping-on-its-network-idINL1N2HB14U\" data-v-f87c67ca=\"\">reported<\/a> by Reuters.","A conditional license allows a new firm to be compliant through collaboration with an authorized licensee, with the expectation that the new firm will eventually seek its own. For its part, PayPal is collaborating with Paxos.&nbsp;&nbsp;","Paxos' <a href=\"https:\/\/www.theblockcrypto.com\/linked\/72177\/paypal-has-reportedly-partnered-with-paxos-to-launch-its-crypto-service\" data-v-f87c67ca=\"\">recently launched <\/a>API-based brokerage service Paxos Crypto Brokerage will handle the regulatory, technological and liquidity aspects of the crypto features. It touts those services for fintech firms, freeing clients up to focus solely on front-end experiences.&nbsp;","PayPal's president and chief executive Dan Schulman told Reuters in an interview that the goal is also to encourage global adoption of cryptocurrencies and prepares for potential offerings of central bank digital currencies in the future. “We are working with central banks and thinking of all forms of digital currencies and how PayPal can play a role,” he was quoted as saying.","In a <a href=\"https:\/\/newsroom.paypal-corp.com\/2020-10-21-PayPal-Launches-New-Service-Enabling-Users-to-Buy-Hold-and-Sell-Cryptocurrency\" data-v-f87c67ca=\"\">statement<\/a>, PayPal said that users will be able to spend crypto across its network of 26 million merchants beginning in 2021.&nbsp;","Rumblings of PayPal's crypto plans began in June, when a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/69201\/paypal-venmo-crypto-buy-sell-report\" data-v-f87c67ca=\"\">report<\/a> from <a href=\"https:\/\/www.coindesk.com\/paypal-venmo-to-roll-out-crypto-buying-and-selling\" data-v-f87c67ca=\"\">CoinDesk<\/a> indicated the firm and its subsidiary Venmo had plans to enable digital asset purchases. At that time, a PayPal representative said the firm \"does not comment on rumors or speculation.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"Dan Schulman","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Paxos Crypto Brokerage","content":"ORGANIZATION"},{"type":"fintech","content":"ORGANIZATION"}],"hashtag":[],"authors":["Aislinn Keely","Frank Chaparro","The Block"]}