{"summary":"Data from Chainalysis shows that pro-Russian military groups have received $2.2 million in crypto donations during the war in Ukraine. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/160198\/pro-russia-military-groups-in-ukraine-got-2-2-million-in-crypto-donations-chainalysis-says","publishDate":"2022-07-29T09:00:27","id":252,"type":null,"title":"Pro-Russia military groups in Ukraine got $2.2 million in crypto donations, Chainalysis says","category":["CRYPTOCURRENCY"],"content":["New data from crypto-analytics firm Chainalysis show that Russian paramilitary groups in Ukraine have received $2.2 million in crypto donations during the ongoing war.","Various pro-Russia militia and volunteer groups have taken to social media to crowdfund for military purchases and spread disinformation related to the war. Chainalysis has identified 54 organizations that have collectively received the donations, primarily in bitcoin and ether donations.&nbsp;","The data show $1.45 million in BTC, more than $590,000 in ETH, 206,822.70 USDT-TRX, $21,174.51 LTC and $2,363.62 in DOGE have reached pro-Russia social media accounts since Russia invaded Ukraine in February. The social media activity related to these accounts shows the funds are being used to equip paramilitary groups and spread propaganda. Chainalysis reports the accounts related to the militias post images of purchased equipment and relay how future donations will be deployed.&nbsp;","Half the identified accounts have publicly solicited support for militias in the Donbas region of Ukraine — a contested area that has been the subject of significant sanctions from the Office of Foreign Asset Control (OFAC).","In addition to paramilitary groups, a number of sanctioned entities have promoted donating crypto to pro-Russian forces, Chainalysis noted. Alexander Zhuchkovsky, sanctioned for his affiliation with designated terror group the Russian Imperial Movement (RIM), has publicized the ability to donate to the RIM. He's also posted about Project Terricon, which solicits crypto donation to support Donbas militia groups.","Terricon said it is using crypto in an attempt to avoid sanctions, and on-chain analytics show it is receiving 11% of its funds from mixers and sending 29% of its funds through a Moscow-based exchange known for crypto money laundering.&nbsp;","US officials have expressed <a href=\"https:\/\/www.theblock.co\/linked\/101780\/biden-crypto-sanctions-evasion-russia\" data-v-f87c67ca=\"\">significant concern<\/a> over the ability of Russian groups to leverage crypto to evade sanctions. Although the $2.2 million figure is significant and can be used for considerable amounts of supplies given the ruble exchange rate, it's still much smaller than the tens of millions donated to <a href=\"https:\/\/blog.chainalysis.com\/reports\/cryptocurrency-ukraine-russia-sanctions\/\" data-v-f87c67ca=\"\">Ukraine<\/a>. Additionally, Chainalysis highlighted that blockchain's transparency has made it possible to track these funds and identify these groups, while dealing in cash or other modes of transfer would be more challenging to trace.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Alexander Zhuchkovsky","content":"PERSON"},{"type":"$2.2 million","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"11%","content":"PERCENT"},{"type":"Chainalysis","content":"PERSON"},{"type":"29%","content":"PERCENT"},{"type":"$1.45 million","content":"MONEY"},{"type":"Moscow","content":"LOCATION"},{"type":"Russia","content":"LOCATION"},{"type":"Office of Foreign Asset Control (OFAC","content":"ORGANIZATION"},{"type":"$590,000","content":"MONEY"},{"type":"$21,174.51","content":"MONEY"},{"type":"LTC","content":"ORGANIZATION"},{"type":"$2,363.62","content":"MONEY"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["CRYPTO"],"authors":["Aislinn Keely","The Block"]}