{"summary":"The Ethereum community faces the possibility of a miner-led fork that will split the network as it transitions to proof-of-stake.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/160462\/as-the-ethereum-merge-approaches-a-key-miner-is-pushing-a-proof-of-work-fork","publishDate":"2022-08-01T07:29:11","id":2524,"type":null,"title":"As the Ethereum merge approaches, a key miner is pushing a proof-of-work fork","category":["TECHNOLOGY"],"content":["<span data-v-f87c67ca=\"\">The Merge — which is planned for the coming months — will transition Ethereum from proof-of-work (PoW) consensus to proof-of-stake (PoS). That will remove the need for transactions to be verified by miners, who have spent billions of dollars buying graphical processing unit (GPU) chips to mine new blocks.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As Ethereum inches closer to its switch to proof-of-stake consensus — the long-awaited shift known as \"The Merge\" — the community is facing the possibility of a miner-led fork that will split the network.<\/span>","<span data-v-f87c67ca=\"\">The idea has gained fresh impetus after Chandler Guo, an influential Chinese crypto miner and investor, <\/span><a href=\"https:\/\/twitter.com\/ChandlerGuo\/status\/1552382597086470146\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">declared<\/span><\/a><span data-v-f87c67ca=\"\"> on Twitter last week he would fork the Ethereum blockchain to what he called “ETH POW,” allowing miners to continue operations after the merge.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Guo was <a href=\"https:\/\/www.coindesk.com\/markets\/2016\/08\/19\/ethereum-classic-is-starting-to-mobilize\/\" data-v-f87c67ca=\"\">involved<\/a> in forking Ethereum in July 2016, which resulted in the formation of Ethereum Classic. Now Guo wants to repeat the feat by acquiring enough hash power — a measure of&nbsp; crypto mining output — and convincing other miners to join him.<\/span>","<span data-v-f87c67ca=\"\">“I fork Ethereum once, I will fork it again,” Guo wrote in a <\/span><a href=\"https:\/\/twitter.com\/ChandlerGuo\/status\/1552384442580312071\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">post<\/span><\/a><span data-v-f87c67ca=\"\"> last week.<\/span>","<span data-v-f87c67ca=\"\">If he's successful, the Ethereum network will split into two chains: the non-canonical PoW version operated by the miners and the default PoS chain run by Ethereum core developers and validators.<\/span>","<span data-v-f87c67ca=\"\">However, the forked PoW chain may lack critical assets like stablecoins needed to support functioning decentralized finance apps. This is likely to make the forked network less appealing to users, unless stablecoin firms decide to add support. In this regard, Paolo Ardoino, chief technology officer of the body behind the tether stablecoin, clarified in a <a href=\"https:\/\/twitter.com\/paoloardoino\/status\/1553702442348453894\" data-v-f87c67ca=\"\">Twitter post<\/a> on Sunday that his team would support the PoS version over the proposed PoW fork.<\/span>","<span data-v-f87c67ca=\"\">A fork is not the only option left for miners. There have also been talks about migration to Ethereum Classic, which will continue to use PoW consensus even after the main Ethereum network switches to PoS. AntPool, a pool operated by mining giant Bitmain, has<\/span> <a href=\"https:\/\/twitter.com\/AntPoolofficial\/status\/1552090925785968642\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">signaled<\/span><\/a><span data-v-f87c67ca=\"\"> support for Ethereum Classic and made a $10 million investment in its ecosystem.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Chandler Guo","content":"PERSON"},{"type":"July 2016","content":"DATE"},{"type":"GPU","content":"ORGANIZATION"},{"type":"Paolo Ardoino","content":"PERSON"},{"type":"$10 million","content":"MONEY"},{"type":"Ethereum Classic","content":"ORGANIZATION"}],"hashtag":["ETHEREUM","MINING"],"authors":["Vishal Chawla","The Block"]}