{"summary":"Aave version 2 and 3 markets have been unpaused and have resumed standard functions.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262757\/aave-v3-markets-resume-normal-operations-after-security-scare","publishDate":"2023-11-13T05:52:49","id":2527,"type":null,"title":"Aave lending markets resume normal operations after security scare","category":["Crypto Ecosystems"],"content":["<span data-v-f87c67ca=\"\">In the wake of a security vulnerability that surfaced earlier this month, <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Aave <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/72131\/aave-aave-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/AAVE.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">AAVE<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.91%\n    <\/span><\/a> <!----><\/span><\/span> version 2 and 3 markets have been unpaused and have resumed standard functions, marking recovery for the decentralized lending protocol. No funds have been impacted.<\/span>","The vulnerability that <a href=\"https:\/\/www.theblock.co\/post\/261552\/aave-pauses-v2-on-ethereum-freezes-certain-assets-on-v3-due-to-reported-issue\" data-v-f87c67ca=\"\">came to light on Nov. 4<\/a> impacted various lending markets across Aave V2 on Ethereum and Aave V3 on blockchains including Optimism, Arbitrum, Avalanche, and Polygon. The issue prompted immediate action from the Aave DAO. In response to the issue, the DAO temporarily disabled the stable rate borrowing feature, a move to prevent any potential exploitation.","Yesterday, Aave announced the restoration of v3 markets to full functionality. Users can once again engage in depositing, repaying, initiating and closing loan positions, with the protocol operating at its full capacity. “Affected Aave V3 markets have been unpaused by the Community Guardian following governance proposal execution. Thanks to the Aave DAO for their prompt action,” the project <a href=\"https:\/\/twitter.com\/aave\/status\/1723736103012704400\" data-v-f87c67ca=\"\">stated<\/a>.","Today, v2 markets were also reactivated, thereby bringing an end to the matter. “The Aave V2 markets are now fully reactivated. The vulnerability disclosure event is now ended. Everything has been fixed and no user funds have been lost,” <a href=\"https:\/\/twitter.com\/lemiscate\/status\/1724023846234104319\" data-v-f87c67ca=\"\">noted<\/a> Marc Zeller, Aave contributor and founder of Aave Chan.","Given that various third parties have forked Aave, the DAO has so far withheld specific details of the vulnerability to safeguard those protocols. Comprehensive information about the vulnerability will be disclosed by the DAO in due course.","<em data-v-f87c67ca=\"\">Updated with information that version 2 lending markets were also reactivated.<\/em>"],"hashtag":["AAVE","ASSETS","DAOS","DEXS","EXPLOITS","LENDING"]}