{"summary":"Circle, the company behind USDC, has announced it will allow other institutions to issue and redeem the dollar-pegged stablecoin\nUntil now, Coinbase and Circle have been the only platforms where users can redeem their USDC, having been the sole members of the CENTRE network\nThe move is a rarity among stablecoins, which usually only allow buying and selling on a native exchange, suggesting USDC is edging towards greater decentralisation","author":["Isabel Woodford","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/27061\/coinbase-and-circle-will-no-longer-be-the-only-platforms-to-issue-and-redeem-usdc-in-new-bid-to-boost-stablecoin-adoption-among-institutions","publishDate":"2019-06-13T09:00:22","id":2530,"type":null,"title":"Coinbase, Circle will no longer be the only platforms to issue and redeem USDC","category":["Exchanges"],"content":["Circle and Coinbase are looking to open up the network behind its stablecoin, a move that could possibly give a lift to the adoption of the dollar-pegged digital currency.","Users of the cryptocurrency will soon be able to issue and redeem USD Coin (USDC) on multiple platforms, Circle and Coinbase announced in a <a href=\"http:\/\/centre.io\/\" data-v-f87c67ca=\"\">joint press release<\/a> Thursday, hoping to broaden \"industry participation\" of their stablecoin. The move would allow institutions, namely other financial entities, to join CENTRE, the consortium that maintains and supports the USDC network. <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/circle-launches-it-stablecoin-for-trading\/\" data-v-f87c67ca=\"\">Launched by Circle last<\/a><a href=\"https:\/\/www.theblockcrypto.com\/tiny\/circle-launches-it-stablecoin-for-trading\/\" data-v-f87c67ca=\"\"> September, <\/a>USDC was introduced in an effort to “establish a standard for fiat on the internet,” and is now the second-largest stablecoin by market cap and a top 25 crypto asset. It surpassed $300 million in market cap <u data-v-f87c67ca=\"\"><a href=\"https:\/\/medium.com\/circle-blog\/usdc-ecosystem-spotlight-usdc-crosses-300-million-in-market-cap-and-has-support-from-nearly-100-7e7249d5e9c3?fbclid=IwAR23a050TL6y0iY2zEwNIp0X4ISPYBUZ0xAs0GbW-tAUh1slJ7VQsCg-JXE\" data-v-f87c67ca=\"\">in January.<\/a><\/u>","Still, adoption of the coin has been limited mostly to the traders, who use it as a bridge between their cryptocurrency and fiat positions.","","","Coinbase joined Circle and <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/coinbase-launches-usdc-stablecoin\/\" data-v-f87c67ca=\"\">became CENTRE's co-founding member<\/a> in October. That meant that while dozens of crypto exchanges could list USDC, until now, it could only be redeemed for physical dollars on the two founders' platforms. But that exclusivity is set to end, as swathes of regulated institutions can now apply to become eligible members of the CENTRE Network, which will allow them to issue and redeem <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/circle-launches-it-stablecoin-for-trading\/\" data-v-f87c67ca=\"\">the ERC-20 token.<\/a> No issuers have been announced.&nbsp;","<strong data-v-f87c67ca=\"\">New issuers<\/strong>","To become an issuer, members will need to \"agree to CENTRE’s operating rules and an issuer settlement and liability framework,\" according to Circle. They will also need to belong to a select group of institutions that are compliant, licensed, custodians, and technologically-advanced.","It is also worth noting issuers will have a degree of autonomy and will be able to decide their own fee structure for redeeming USDC. Bringing new issuers to the table could solve the headache some traders have faced of other stablecoin refusing to redeem their coins, insiders say.&nbsp;","Apart from issuance and redemption rights, members will also be expected to \"jointly contribute to the development of the technical standards and open source software\" that powers USDC. At a media dinner in New York Wednesday, Jeremy Allaire, CEO of Circle, hinted at USDC moving to other blockchains, such as EOS, in the future.&nbsp;","The CENTRE network also hinted at plans for a Facebook-esque GlobalCoin made up of multiple currencies, noting that \"a natural next step is to imagine a new global digital currency\" or basket token backed by a variety of stablecoins. It also noted that it would include bitcoin as a \"reserve currency asset.\""],"hashtag":["COINBASE","USDC"]}