{"summary":"In a rare move, SBF&#x27;s initial questioning happened out of earshot of the jury, as the judge weighs whether to let him blame his lawyers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/259719\/inside-the-trial-sam-bankman-fried-finally-testifies-sort-of","publishDate":"2023-10-26T20:25:29","id":2530,"type":null,"title":"Inside the Trial: Sam Bankman-Fried finally testifies — sort of","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Judge Lewis Kaplan, the 78-year-old overseeing Sam Bankman-Fried's trial on seven counts of fraud and conspiracy, has presided over many trials with high-profile defendants in his courtroom, including Donald Trump, Al-Qaeda operatives, and Prince Andrew.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Yet today, Kaplan admitted it's been \"quite a long time, if ever\" since he had taken the <a href=\"https:\/\/www.theblock.co\/post\/259641\/sam-bankman-fried-takes-witness-stand-without-jury-present-report\" data-v-f87c67ca=\"\">rare step<\/a> of allowing a witness to be questioned without the jury present. The unusual move came as a result of ongoing disagreements between the defense and the prosecution as to whether or not Bankman-Fried's interactions with lawyers are fair topics for the defense to cover in questioning.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On the stand, Bankman-Fried faced questions from his own attorney, Mark Cohen, as well as Assistant U.S. Attorney Danielle Sassoon, the lead prosecutor, regarding the role of FTX lawyers in supervising FTX's document retention policy, inter-company loans to executives, terms of service, and more.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried responded readily, yet often meandered through his answers in ways that, at times, frustrated Sassoon and Kaplan. Sassoon's cross-examination, meanwhile, led to several objections from Cohen, who complained her questions went beyond the scope of the specific topics at play.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried's testimony drew the largest crowd to the courthouse seen yet. Spotted amongst the crowd: Michael Lewis, author of a <\/span><a href=\"https:\/\/www.theblock.co\/post\/255259\/going-infinite-sbfs-hairbrained-schemes-in-new-michael-lewis-book\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">recent profile<\/span><\/a><span data-v-f87c67ca=\"\"> of Bankman-Fried, along with Ben McKenzie, the Hollywood actor turned crypto-skeptical author.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">During the direct examination by his lawyer, Bankman-Fried repeatedly invoked the role of FTX general counsel Daniel Friedberg in key business decisions. According to him, Friedberg was in charge of incorporating North Dimension, the Alameda subsidiary whose bank account had been used to accept FTX users' deposits for a time. He also prepared the application for North Dimension’s bank account.<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried denied specific knowledge of why North Dimension was created, and even the origin of its name, claiming all he did was sign some papers offered to him by the attorney: \"I had a lot of things that passed my desk each day to sign. I trusted that they were proper forms,\" he said.<\/span>","<span data-v-f87c67ca=\"\">When asked by Sassoon about particular points the prosecution uses as evidence of fraud, and whether or not he consulted FTX lawyers such as Friedberg and Can Sun when making decisions, Bankman-Fried gave a series of similarly noncommittal answers.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For example, Bankman-Fried admitted to reading some parts of the terms of service in-depth, while others he just skimmed. In addition, Bankman-Fried said he was aware Alameda had some privileges to prevent automatic liquidations, but denied knowing the exact mechanics. Bankman-Fried also described knowing that Friedberg's former employer had suffered some kind of scandal, but, again, he denied knowing the precise details.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Sassoon’s most explosive question — whether or not Bankman-Fried was aware that Friedberg \"used illegal narcotics with your employees\" — was thrown out by Kaplan&nbsp; after an objection by Cohen.<\/span>","<span data-v-f87c67ca=\"\">Throughout the questioning, Bankman-Fried fidgeted slightly in his seat, looked down while answering certain questions, and frequently gave detailed, if meandering, answers to simple questions. Put simply: if the past year has fundamentally changed Bankman-Fried, his behavior today didn't show it.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Following the examination from both sides, Kaplan allowed Cohen and prosecution attorney Nicolas Roos to argue their case for whether or not Bankman-Fried's interactions with lawyers should be discussed in front of the jury.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Yet Kaplan seemed unconvinced by the defense's intention to seemingly shift part of the blame on FTX attorneys. After noting that SBF had \"an interesting way of answering questions,\" the judge said that if someone robbed a bank and then wanted to buy a house with the stolen money, they cannot argue that a lawyer who structured the deal approved of money laundering.<\/span>","<span data-v-f87c67ca=\"\">Cohen responded that he and his colleagues were not trying to assert a formal advice-of-counsel defense; rather, they are just stating their client \"took comfort from those consultations\" with attorneys, and that the government is free to cross-examine Bankman-Fried on these matters.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"Our position is that the source of funds, the use of funds was not improper and our client did not believe it was improper or, at minimum, that it was inconclusive. It's not the same hypothetical situation,\" Cohen said.<\/span>","<span data-v-f87c67ca=\"\">Roos argued in return that just because lawyers like Friedberg carried out Bankman-Fried's orders, since they didn't have the full picture of FTX's finances, their work at FTX didn't absolve Bankman-Fried of his responsibility. \"This is sort of collateral involvement of lawyer[s] that doesn't go to the core defense, which is the use of funds and whether or not it was proper,\" Roos said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Kaplan declared that he will rule on the matter tomorrow, when court resumes.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Earlier in the day, the defense also called its first two witnesses: Krystal Rolle, a Bahamian lawyer whom Bankman-Fried retained in the midst of FTX's collapse, and Joseph Pimbley, an expert witness who analyzed FTX's database and codebase at the behest of the defense lawyers.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Rolle's testimony concerned Bankman-Fried's behavior following orders from the Security Commission of the Bahamas to liquidate FTX's assets. Pimbley, meanwhile, used internal data to show that Alameda never drew on its full $65 billion line of credit and that about three-quarters of FTX's users had margin trading enabled.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Far from rebutting the major points of the prosecution, the two witnesses seemed to merely set up topics that will likely be expanded upon through the defense's questioning of Bankman-Fried tomorrow — its third and final witness, according to Cohen. With cross-examination to follow, the trial is expected to conclude early next week.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Block will be back in the courtroom for the direct examination of Sam Bankman-Fried — this time, presumably, in front of the jury.<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Daniel Friedberg","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Kaplan","content":"PERSON"},{"type":"Krystal Rolle","content":"PERSON"},{"type":"$65 billion","content":"MONEY"},{"type":"North Dimension","content":"ORGANIZATION"},{"type":"Roos","content":"PERSON"},{"type":"Danielle Sassoon","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Andrew","content":"PERSON"},{"type":"Michael Lewis","content":"PERSON"},{"type":"SBF","content":"ORGANIZATION"},{"type":"Lewis Kaplan","content":"PERSON"},{"type":"Sassoon","content":"ORGANIZATION"},{"type":"Security Commission","content":"ORGANIZATION"},{"type":"Rolle","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Nicolas Roos","content":"PERSON"},{"type":"North Dimension","content":"LOCATION"},{"type":"Fried","content":"ORGANIZATION"},{"type":"Cohen","content":"PERSON"},{"type":"Friedberg","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Donald Trump","content":"PERSON"},{"type":"Bahamas","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"Ben McKenzie","content":"PERSON"},{"type":"Joseph Pimbley","content":"PERSON"},{"type":"Mark Cohen","content":"PERSON"}],"hashtag":["FTX","SAM BANKMAN-FRIED","SBF TRIAL"],"authors":["Zack Abrams","Anna Baydakova","The Block"]}