{"summary":"The Commission said a separate classification from other assets would allow for a more nuanced consideration of new, emergent and idiosyncratic property rights.\n\nIt also wants to clarify laws around ownership and control of digital assets, and around transfers and transactions.","author":["Callan Quinn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/160067\/digital-assets-are-distinct-category-of-property-says-law-commission-of-england-and-wales","publishDate":"2022-07-28T11:57:08","id":2531,"type":null,"title":"Digital assets are distinct category of property, says Law Commission of England and Wales","category":["Regulation"],"content":["New proposals from the Law Commission of England and Wales have suggested making digital assets a distinct class of personal property under the law.","The suggestions are part of <a href=\"https:\/\/s3-eu-west-2.amazonaws.com\/lawcom-prod-storage-11jsxou24uy7q\/uploads\/2022\/07\/Digital-Assets-Consultation-Paper-Law-Commission-1.pdf\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">proposals<\/a> published on Thursday in response to a government request that the Commission, which operates as an independent body, review current laws as they relate to digital assets.","Provisionally named “data objects,” the category would include tokens, non-fungible tokens (NFTs) and other digital assets. The Commission said a separate classification from other assets would allow for a more nuanced consideration of new, emergent and idiosyncratic property rights. This is due to digital assets not slotting neatly into the two existing categories of property that cover \"possessions\" (physical items) and \"actions\" (an enforcement right such as contractual obligations).","The Commission also gave its view on the legal value of distributed ledgers and on-chain ownership. It sees distributed ledgers as representing “a factual, as opposed to legal, account of the world,” arguing that on-chain ownership should not necessarily be regarded as a definitive record of legal ownership.","This could have implications for projects that use NFTs as proof of owning a physical item — the report gives the examples of diamonds or bottles of wine tied to NFTs — as, while holding a token would be evidential in the case of a legal dispute, it would not confer additional legal rights to a holder.","Countries around the world are currently struggling to work out where digital assets fit into current regulations, and how they should be catered for.&nbsp; Despite the lack of regulatory guidance currently available in the UK, the Commission believes that for the most part common law in England and Wales is “sufficiently flexible to accommodate digital assets.”","“But we also think that certain aspects of the law now need reform to ensure that digital assets benefit from consistent legal recognition and protection, in a way that acknowledges the nuanced features of those digital assets,” it said.","This assertion is in keeping with other crypto-related arguments by the Law Commission. Last year, it also said that existing laws in England and Wales can be <a href=\"https:\/\/www.theblock.co\/linked\/125506\/english-and-welsh-law-can-apply-to-smart-contracts-says-law-commission\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">applied to smart contracts<\/a>.&nbsp;&nbsp;"],"hashtag":[]}