{"summary":"Binance CEO Changpeng Zhao has addressed major USD Coin outflows.\nSome $1.6 billion has been withdrawn from Binance over the past 24 hours, on the Ethereum network alone.","author":["Adam James","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/194398\/binance-ceo-usdc-outflow","publishDate":"2022-12-13T04:03:33","id":2533,"type":null,"title":"Binance CEO addresses USDC outflows: &#x27;feel free to withdraw any other stablecoin&#x27;","category":["Exchanges"],"content":["Binance CEO Changpeng Zhao stepped in to reassure clients after the world's biggest crypto exchange experienced more than a billion dollars of outflows.","After acknowledging that Binance has seen an increase in USD Coin withdrawals, Zhao <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1602579499903852544?s=46&amp;t=nooo60_LT-p9x6emkZHVIQ\" data-v-f87c67ca=\"\">explained<\/a> that “to swap from PAX\/BUSD to USDC requires going through a bank in NY in USD” and that “the banks are not open for another few hours” — at which point Binance expects the situation to be “restored.”","Some $1.6 billion on Ethereum has been withdrawn from the exchange over the past 24 hours, <a href=\"https:\/\/twitter.com\/sandraaleow\/status\/1602558685326110720?s=46&amp;t=0mQeBYILYMvWuEZQSFNnxg\" data-v-f87c67ca=\"\">according to<\/a>&nbsp; Nansen researcher Sandra Leow.&nbsp;","With USDC liquidity proving to be an issue on Binance, Tron founder Justin Sun <a href=\"https:\/\/etherscan.io\/tx\/0xf013763e2e7da0b5ed548e4ed5f4a586a6b2edc63ae13d51ae7f4d13f913a84c\" data-v-f87c67ca=\"\">deposited<\/a> 100 million USDC to the exchange.","Seemingly dismissing concerns that customers may have any problems removing funds from the exchange, Zhao encouraged users to “feel free to withdraw any other stablecoin” — adding a folded hands emoji. Zhao also noted that no margin or leverage is involved in the stablecoin conversions."],"hashtag":["BINANCE","BUSD","USDC"]}