{"summary":"Bitcoin circulating supply held by long-term holders is at an all-time high, according to Glassnode data.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262167\/bitcoin-long-term-holder-supply-is-at-an-all-time-high","publishDate":"2023-11-08T09:59:52","id":2534,"type":null,"title":"Bitcoin long-term holder supply is at an all-time high","category":["MARKETS"],"content":["Bitcoin circulating supply held by long-term holders is at an all-time high, according to Glassnode data.","The circulating supply of bitcoin is historically tight, with coins held by long-term investors at an all-time high, according to Glassnode <a href=\"https:\/\/insights.glassnode.com\/the-week-onchain-week-45-2023\/?utm_campaign=woc_45__2023&amp;utm_medium=woc_newsletter&amp;utm_source=email\" data-v-f87c67ca=\"\">data<\/a>.","The data found that existing bitcoin investors are becoming increasingly unwilling to part with their holdings, with analysts at Glassnode observing \"impressive rates of accumulation taking place.\"","\"The bitcoin supply is quite tight with several measures of supply such as illiquid supply, coins HODLed, and long-term holder supply at historical highs,\" Glassnode analysts said in a note shared with The Block.","<span data-v-f87c67ca=\"\">Glassnode data on bitcoin supply last active metrics<\/span>","<span data-v-f87c67ca=\"\">In a Wednesday blog post entitled \"The Tightening of Supply,\" Glassnode data showed the proportion of circulating supply of bitcoin held for longer than one year is hovering around all-time-high levels. Analysis of the data found this long-term holder metric is at an elevated level for several <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.74%\n    <\/span><\/a> <!----><\/span> age bands.<\/span>","The data revealed that 68% of the circulating supply of <a href=\"https:\/\/www.theblock.co\/post\/261732\/bitcoin-holds-near-35000-as-analysts-anticipate-a-more-dovish-fed\" data-v-f87c67ca=\"\">bitcoin<\/a> has been held untouched for over one year. The bitcoin metric for coins held for over five years now sits at almost 30% of the total circulating amount.","\"The illiquid supply metric, which measures the amount of supply held in wallets with minimal history of spending is also at an all-time high of 15.4 million bitcoin,\" Glassnode analysts added.","The data showed that the monthly rate of change for <a href=\"https:\/\/www.theblock.co\/learn\/251470\/what-is-liquidity-and-why-does-it-matter\" data-v-f87c67ca=\"\">illiquid supply<\/a> is within a multi-year period of net gains, currently increasing at a rate of over 71,000 bitcoin per month.","The Glassnode report described that this increase in illiquid supply has moved in tandem with investors withdrawing their digital assets from exchanges. \"The data suggests investors are continuing to withdraw their coins into custody, with over 1.7 million bitcoin doing so since May 2021,\" Glassnode analysts said.","<span data-v-f87c67ca=\"\">Glassnode data on bitcoin illiquid supply<\/span>","According to Glassnode, \"a powerful divergence continues to form between long-term holder supply, and short-term holder supply, which is at effectively all-time lows.\"","The analysts added that the spending behavior of short-term bitcoin holders has changed following <a href=\"https:\/\/www.theblock.co\/post\/260486\/bitcoins-price-is-mostly-flat-as-fed-holds-rates-steady-solana-leads-altcoin-rally\" data-v-f87c67ca=\"\">BTC's rally<\/a> above the key $30,000 level. \"The recent rally suggests that a shift in market character has taken place now that the market has rallied above the key $30,000 level. Analysis of investor cost basis for various cohorts suggests that this $30,000 level is an important zone of interest for the bulls,\" the Glassnode analysis said.","The world's largest cryptocurrency by market capitalization increased by over 1.3% in the past 24 hours to $35,272 at 9:48 a.m. in New York, according to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/bitcoin\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">CoinGecko<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$35,272","content":"MONEY"},{"type":"May 2021","content":"DATE"},{"type":"$30,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"1.3%","content":"PERCENT"},{"type":"30%","content":"PERCENT"},{"type":"New York","content":"LOCATION"},{"type":"Glassnode","content":"LOCATION"},{"type":"68%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"9:48 a.m.","content":"TIME"},{"type":"Glassnode","content":"ORGANIZATION"},{"type":"+0.74%","content":"PERCENT"}],"hashtag":["CRYPTO MOVERS","ECONOMIC INDICATORS"],"authors":["Brian McGleenon","The Block"]}