{"summary":"Stronghold is poised to acquire a second power plant in Pennsylvania\nWith an 80 megawatts of generation capacity, the Panther Creek Plant will double Stronghold’s total capacity to 165 MW.","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/113332\/bitcoin-miner-stronghold-double-capacity-panther-acquisition","publishDate":"2021-08-03T10:00:21","id":2534,"type":null,"title":"Bitcoin miner Stronghold to double capacity via second plant acquisition","category":["Mining"],"content":["Pennsylvania-based bitcoin mining firm Stronghold Digital is poised to double its proprietary power capacity via an acquisition deal over a second power plant in the state.","The firm said in an announcement on Tuesday that it has signed a definitive agreement to purchase the Panther Creek Plant, which is located on a 33-acre site in Pennsylvania's Carbon County.&nbsp;","Stronghold already <a href=\"https:\/\/www.theblockcrypto.com\/linked\/112661\/bitcoin-mining-firm-stronghold-files-for-100-million-ipo\" data-v-f87c67ca=\"\">indicated the acquisition plan<\/a> in its $100 million initial public offering prospectus filed in the U.S. last month. But a new detail revealed on Tuesday is that the plant has a generation capacity of 80 megawatts. Pending regulatory approvals, the deal would double Stronghold's existing power capacity to 165 MW.&nbsp;","Stronghold raised over $105 million in equity through private offerings earlier this year in its bid to bring bitcoin mining into its process of using waste coal — an environmentally toxic byproduct of coal mining — to generate electricity.","Based on Stronghold's filing with the Securities and Exchange Commission, its current operational mining fleet consists of 1,840 units of both old and new mining models made by Bitmain and Canaan.","Per the breakdown, Stronghold has a hash rate of 85 PH\/s with a combined power consumption of 4,170 kilowatt-hour located in its existing Scrubgrass Plant.","At bitcoin's current mining difficulty, Stronghold is able to generate about 0.738 bitcoin every 24 hours in theory, while consuming around 100,000 kWh of energy. It touted an energy supply cost of $0.021 per kWh in its S-1 form, which would mean its bitcoin mining gross profit margin will be around 93% at bitcoin's current price of around $38,500.","Meanwhile, Stronghold has raised $74 million in two loans backed by WhiteHawk Capital Partners ($40 million) and an affiliate of <a href=\"https:\/\/www.theblockcrypto.com\/post\/109556\/nydig-expands-its-play-to-bridge-bitcoin-and-banking-with-new-partnerships\" data-v-f87c67ca=\"\">NYDIG<\/a> ($34 million) to scale up its mining fleet and facility infrastructure. Since April, it has preordered through brokers 27,300 mining machines made by Bitmain, Canaan and MicroBT with a combined hash rate of 2,600 PH\/s.","“Approximately 93% of these miners are scheduled to be delivered in 2021, with the first batch scheduled for delivery in August 2021, and the remaining 7% throughout 2022,\" Stronghold said.","The first 16,000 units will be housed in its data centers at the Scrubgrass Plant with the remaining ones to be deployed at the Panther Creek Plant and a third unnamed station which Stronghold has under contract for purchase.","With its pending $100 million IPO, Stronghold aims to preorder an additional 27,900 miners, which would boost its proprietary hash rate to 3,000 PH\/s by end of the year and 5,300 PH\/s by December 2022.&nbsp;"],"hashtag":[]}