{"summary":"A group of former founders and cryptographers have launched a research house focused on building the deep infrastructure of web3","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/154314\/cryptographers-launch-web3-research-house-for-zero-knowledge-systems","publishDate":"2022-06-28T07:00:03","id":2535,"type":null,"title":"Cryptographers launch web3 research house for zero-knowledge systems","category":["LAYER 2S AND SCALING"],"content":["A group of former founders and cryptographers launched a research house focused on building the deep infrastructure of web3.","UK-based Geometry will launch and support web3 projects using zero-knowledge systems and other applied mathematics in infrastructure, decentralised finance, virtual environments and other applications.","The 12-strong team of engineers, researchers and entrepreneurs have backgrounds in projects including Celo, Aztec, the Ethereum Foundation and Semaphore.","“The focus of Geometry is zero-knowledge research and engineering. We don’t do consultancy. But there's a small fund on back of this thing and we've made some investments in zero-knowledge infrastructure companies,” Thomas Walton-Pocock, formerly CEO and cofounder at Aztec Network, told The Block.","Prior to its official launch, Geometry led a $4 million seed investment round for Israel-based zero-knowledge semiconductor company Ingonyama. It was also a participant in the seed and Series A rounds for Ethereum layer-two network Scroll, and led the seed round for Soap Labs, which is aiming to bring cross-venue liquidity to the NFT market.","“We are also running a program for researchers in&nbsp;residence for&nbsp;highly ambitious people who want to come and spend time in a cryptography or deep mathematics rich setting. Typically they will be engineers&nbsp;- but by no means always&nbsp;-&nbsp;and want to build&nbsp;a&nbsp;company based off some corner of this industry,” Walton-Pocock said.","Developed in the 1980s, zero-knowledge proofs are a way of verifying information without being given access to the entire information set. It has been touted as a way of addressing scalability issues on blockchains.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Aztec Network","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Israel","content":"LOCATION"},{"type":"Thomas Walton","content":"PERSON"},{"type":"Pocock","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$4 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Walton","content":"PERSON"},{"type":"Geometry","content":"ORGANIZATION"},{"type":"1980s","content":"DATE"},{"type":"Ethereum Foundation","content":"ORGANIZATION"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}