{"summary":"The UK’s Financial Conduct Authority has been without a permanent chair since May.\nAlder has spent more than 10 years at the helm of Hong Kong’s financial regulator.\nThe former lawyer is expected to take up his role in January 2023.","author":["Adam Morgan McCarthy","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156535\/ashley-alder-appointed-new-chair-of-uks-financial-conduct-authority","publishDate":"2022-07-08T05:43:47","id":2536,"type":null,"title":"Ashley Alder appointed new chair of UK&#x27;s Financial Conduct Authority","category":["The Block"],"content":["Ashley Alder, CEO of Hong Kong’s financial regulator, will be the next chairman of the UK's Financial Conduct Authority (FCA), the Treasury <a href=\"https:\/\/www.gov.uk\/government\/news\/ashley-alder-appointed-as-chair-of-the-financial-conduct-authority\" data-v-f87c67ca=\"\">confirmed<\/a> on Friday.","Alder will assume the role in January 2023, succeeding Richard Lloyd, who has served as interim chair since Charles Randell left in May. The former lawyer brings a wealth of experience in financial regulation, having overseen Hong Kong's Securities and Futures Commission (FSC) since 2011.","The Block <a href=\"https:\/\/www.theblock.co\/post\/156322\/head-of-hong-kongs-financial-regulator-in-line-for-role-in-britain-sky-news\" data-v-f87c67ca=\"\">reported<\/a> on Thursday that Alder was a frontrunner for the role, following a report from Sky News.&nbsp; HM Treasury confirmed the story today.&nbsp;","Alder said it would be great privilege to chair the FCA, adding that he he values \"the opportunity to contribute to a crucial phase in the FCA’s history as it helps chart the UK’s post-Brexit future as a global financial centre which continues to support innovation and competition through its own world-leading regulatory standards.\"","The chair of the FCA plays a crucial role in the financial and economic regulation of Britain, monitoring the conduct of about 51,000 financial services firms and financial markets across the UK.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">Updates to remove reference to potential delay to confirmation in Adler's appointment.<\/i>"],"hashtag":["FCA"]}