{"summary":"Canaan’s Bitcoin mining revenues hit record highs in Q2 after selling more computing power compared to Q1, but losses mount.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/247962\/canaan-losses-q2-bitcoin-mining-revenues-record","publishDate":"2023-08-29T11:43:15","id":2537,"type":null,"title":"Canaan losses mount despite record Q2 Bitcoin mining revenues","category":["COMPANIES"],"content":["Canaan's Bitcoin mining revenues hit record highs in Q2 after selling more computing power compared to Q1, according to its unaudited second-quarter results.","The company&nbsp;<a href=\"https:\/\/investor.canaan-creative.com\/news-releases\/news-release-details\/canaan-inc-reports-unaudited-second-quarter-2023-financial\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">reported<\/a> 43.3% growth in Bitcoin mining revenues to $15.9 million in Q2 compared to Q1, up 105.1% on the same period last year, driven by bitcoin's price recovery and increased computing power and rewards. It sold 6.1 million Thash\/s worth of computing power, a 44.2% increase from last quarter and 11.7% higher than Q2, 2022.","Canaan's total revenues were up too, climbing 33.9% to $73.9 million compared to Q1, though this is down 70% from the $245.9 million generated in the same period last year.","\"Despite the relatively stagnant bitcoin price in the second quarter, our endeavor to drive sales across various fronts, including major clients, channels and retail, yielded encouraging results,\" Canaan Chairman and CEO Nangeng Zhang said. \"Our mining revenue further set a new historic high in the second quarter of 2023. Recently, we have expanded into new mining projects in Africa and South America.\"","However, the miner continues to struggle for profitability this year, with $30.6 million in second-quarter mining costs contributing to a total net loss of $110.7 million for the quarter. Net losses were up from $84.4 million in Q1, compared to a net profit of $90.1 million in the same period last year. This included inventory write-down and impairment of property and equipment.","\"Admittedly, we are still facing a market that has yet to recover with soft purchasing power on the demand front, generating continued pressure on our sales. Recently, we also encountered adverse impacts from regional regulatory changes and a particular partner's breach of agreement in respect of our mining operations,\" said Zhang.","Canaan said it held 1,125 bitcoin with a total carrying value of $28.8 million as of June 30. Its holdings consist of 747 bitcoin owned by the company and 378 bitcoin received from customer deposits. Canaan also noted an impairment on the cryptocurrency in the second quarter of $2.4 million, compared to $0 in Q1 and $4.5 million in the same period last year.","Canaan projected total revenues of approximately $30 million for Q3, citing the industry's challenging market conditions.","Earlier this month, Canaan <a href=\"https:\/\/www.theblock.co\/post\/245843\/canaan-gala-bitcoin-mining-product\" data-v-f87c67ca=\"\">revealed<\/a> it would debut a \"groundbreaking, industry-redefining product that will shape the future of Bitcoin mining\" on Sept. 12 at a gala celebrating its 10th anniversary.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$245.9 million","content":"MONEY"},{"type":"Nangeng Zhang","content":"PERSON"},{"type":"44.2%","content":"PERCENT"},{"type":"70%","content":"PERCENT"},{"type":"43.3%","content":"PERCENT"},{"type":"$30.6 million","content":"MONEY"},{"type":"33.9%","content":"PERCENT"},{"type":"105.1%","content":"PERCENT"},{"type":"$110.7 million","content":"MONEY"},{"type":"$73.9 million","content":"MONEY"},{"type":"$0","content":"MONEY"},{"type":"South America","content":"LOCATION"},{"type":"$28.8 million","content":"MONEY"},{"type":"$15.9 million","content":"MONEY"},{"type":"Sept. 12","content":"DATE"},{"type":"Zhang","content":"PERSON"},{"type":"last quarter","content":"DATE"},{"type":"second quarter","content":"DATE"},{"type":"$2.4 million","content":"MONEY"},{"type":"$90.1 million","content":"MONEY"},{"type":"June 30","content":"DATE"},{"type":"$84.4 million","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"second quarter of 2023","content":"DATE"},{"type":"$4.5 million","content":"MONEY"},{"type":"11.7%","content":"PERCENT"},{"type":"$30 million","content":"MONEY"},{"type":"Africa","content":"LOCATION"}],"hashtag":["BITCOIN","MINING","MINING COMPANIES"],"authors":["James Hunt","The Block"]}