{"summary":"The FATF shared the results of its most recent plenary meeting today.\nThis included an overview of its forthcoming 12-month review of the application of its crypto guidance.\nIt held off on finalizing that guidance until October, allowing more time for the industry to voice its concerns. ","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/109687\/fatf-defers-finalizing-its-crypto-guidance-until-october-industry-players-celebrate-short-term-win","publishDate":"2021-06-25T18:34:35","id":2540,"type":null,"title":"Stakeholders celebrate as FATF postpones finalizing its crypto guidance","category":["The Block"],"content":["The global anti-money laundering watchdog's latest review shows a majority of the jurisdictions under its purview have yet to implement its crypto guidance. But perhaps more importantly, that controversial guidance isn't final yet.","After the Financial Action Task Force's (FATF) issued guidance in 2019 that targeted crypto exchanges and money transmitters, or Virtual Asset Service Providers (VASPs) as it calls them, the Task Force committed to completing a review on the status of implementation every 12 months.","<a href=\"https:\/\/www.theblockcrypto.com\/daily\/74889\/fatf-review-crypto-divide\" data-v-f87c67ca=\"\">Last year's 12-month review<\/a> dropped a bombshell on decentralized finance (DeFi) by stating that jurisdictions uncomfortable with noncustodial wallets could ban exchanges that allow their use in peer-to-peer transactions.","Today the watchdog released an <a href=\"http:\/\/www.fatf-gafi.org\/publications\/fatfgeneral\/documents\/outcomes-fatf-plenary-june-2021.html\" data-v-f87c67ca=\"\">overview<\/a> of its second 12-month review, which will be released July 5, during a press conference Friday associated with its most recent plenary meeting. It also said it would delay finalizing its guidance until October. That has many in the industry breathing a sigh of relief — for now.","According to the FATF's statement on the review, 52 of the 128 reporting jurisdictions have responded to the guidance by creating rules surrounding VASPs and six have banned them altogether. Still, the majority has yet to respond.","FATF acknowledged the private sector's attempt to make progress on a solution. But it warned that illicit crypto activity will continue through \"jurisdictional arbitrage\" unless all jurisdictions implement its guidance.","\"These gaps in implementation also mean that we do not yet have global safeguards to prevent the misuse of VASPs for money laundering or terrorist financing,\" FATF said in the overview.","The full review will highlight these concerns, according to FATF. It will also come with potential actions to mitigate them, with \"emphasis on actions to help mitigate the risk of ransomware-related virtual asset use.\" <a href=\"https:\/\/www.theblockcrypto.com\/daily\/109700\/ransomware-attacks-crypto-analytics-firms-fundraising\" data-v-f87c67ca=\"\">Ransomware<\/a> has been a growing concern for regulators in the wake of the colonial pipeline hack earlier this year.&nbsp;&nbsp;","Reviews and overviews of reviews aside, though, some in the crypto industry are still worried about the actual recommendations in the 2019 guidance — which are technically still in draft form. During today's press conference, the FATF said it would hold off from finalizing the guidance for another few months.","The guidance centers on the so-called <a href=\"https:\/\/www.theblockcrypto.com\/post\/28521\/fatf-retains-travel-rule-in-new-guidance-compelling-exchanges-to-share-customer-data\" data-v-f87c67ca=\"\">\"travel rule\"<\/a> which calls for VASPs to transmit originator and beneficiary information between one another during transactions over $3,000. This set off a race to find a technical solution since currently there is no system in place for complying with such a rule.","So far, Coinbase has led the charge with a <a href=\"https:\/\/www.theblockcrypto.com\/daily\/82261\/us-crypto-exchanges-fatf-travel-rule\" data-v-f87c67ca=\"\">centralized solution<\/a> that includes some of the biggest U.S.-based exchanges. Others argue for a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/76754\/shyft-vasp-platform-task-force\" data-v-f87c67ca=\"\">decentralized approach<\/a> like <a href=\"https:\/\/www.theblockcrypto.com\/daily\/29958\/partnership-plans-to-solve-the-problems-of-fatfs-travel-rule-with-a-blockchain-and-encryption\" data-v-f87c67ca=\"\">Shyft Network<\/a> to keep the playing field level.","But despite the progress, the industry has yet to reach a consensus on the best way to comply with the travel rule, partially because they find it challenging to know what they're aiming at.","As it stands, the guidance could have drastic implications for DeFi and self-hosted wallets — depending on what FATF ends up <a href=\"https:\/\/www.theblockcrypto.com\/daily\/102712\/fatf-cryptocurrency-guidance-vasp-definition\" data-v-f87c67ca=\"\">defining as a VASP<\/a>. The term as it's currently defined could apply to a variety of entities, and crypto advocates are worried that if jurisdictions choose to take a strict reading of the guidance it could set the industry back and leave it marginalized.&nbsp;","For now, industry players are relieved. <a href=\"https:\/\/twitter.com\/jerrybrito\/status\/1408415421980626947?s=20\" data-v-f87c67ca=\"\">Jerry Brito<\/a>, director of crypto policy think tank Coin Center, called this a \"win\" for crypto. <a href=\"https:\/\/twitter.com\/jchervinsky\/status\/1408436325519405057?s=20\" data-v-f87c67ca=\"\">Jake Chervinsky<\/a>, DeFi chair of lobbying group the Blockchain Association, said pushing back the date was a \"good start\" to addressing concerns in the current draft."],"hashtag":[]}