{"summary":"Bitcoin was trading at $19,135 today, while ether was at $1,282.\nAltcoins suffered heavier losses throughout the week, with ADA and SOL losing about 13.1% and 7.9% respectively.\nU.S. inflation data came in hotter-than-expected on Thursday, with core inflation reaching a 40-year high. ","author":["Adam Morgan McCarthy","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/177498\/this-week-in-markets-bitcoin-and-ether-edge-lower-while-altcoins-suffer-heavy-losses","publishDate":"2022-10-16T11:39:10","id":2541,"type":null,"title":"This week in markets: Bitcoin and ether edge lower while altcoins suffer heavy losses","category":["Markets"],"content":["Bitcoin and ether edged lower this week after whipsawing on Thursday following the latest inflation figures out of the U.S.","Bitcoin was trading at $19,135 today, down 1.33% over the past week, while ether shed 2.15% in the same period to trade at $1,284, according to data via Coinbase.&nbsp;","","","Meanwhile, altcoins suffered heavier losses throughout the week, with ADA trading down more than 13% at $0.36 and SOL losing 7.89% to trade at $29.95.","U.S. <a href=\"https:\/\/www.theblock.co\/post\/176877\/u-s-inflation-comes-in-hot-up-0-4-month-on-month-and-8-2-year-on-year\" data-v-f87c67ca=\"\">inflation data<\/a> came in hotter-than-expected on Thursday as core inflation hit a 40-year high.&nbsp;","Inflation was up 0.4% month-on-month from August and the year-on-year reading was 8.2%, according to the latest CPI <a href=\"https:\/\/www.bls.gov\/cpi\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">data<\/a>. Meanwhile, core inflation came in at 6.6% year-on-year — the biggest increase since 1982.&nbsp;","Thursday's data suggests the Fed won't curb its interest rate hikes anytime soon, with the market now pricing in a 97% chance of a 75 basis points increase at the next meeting in November, <a href=\"https:\/\/www.cmegroup.com\/trading\/interest-rates\/countdown-to-fomc.html\" data-v-f87c67ca=\"\">according<\/a> to the CME's FedWatch tool.","While fear continues to mount, markets don't seem to be predicting a 100 basis point raise from the Fed just yet, Youwei Yang, chief economist at Bit Mining told The Block.","\"We probably won’t see anything like a disorderly dump of stocks, but rather some highly leveraged portfolios decreasing their risk exposures to avoid more extreme volatility. The market overall has been gradually dropping year to date, despite a few small rallies, and many contrarians have already called this the bottom,\" Yang said.","A 75 basis point rate hike would bring the target Fed Funds rate to 3.75-4%, from its current position of 3-3.25%, as seen above and according to data via the Bureau of Labor Statistics and the U.S. Federal Reserve.&nbsp;","The target rate is expected to climb well above 4% by the end of the year. JPMorgan's Marko Kolanovic said on Monday that the Fed policy rates may approach 5% next quarter.&nbsp;"],"hashtag":["BITCOIN","CARDANO","SOLANA"]}