{"summary":"The SEC has sued Richart Heart, the creator of Pulsechain, for allegedly selling unregistered securities.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242266\/sec-sues-richard-heart-of-hex-and-pulsechain-for-allegedly-selling-unregistered-securities","publishDate":"2023-07-31T10:30:31","id":2542,"type":null,"title":"SEC sues Richard Heart of Hex and Pulsechain for allegedly selling unregistered securities","category":["Legal"],"content":["The United States Securities and Exchange Commission has sued Richard Schueler — more widely known in the crypto industry as Richard Heart — for allegedly conducting a sale of unregistered securities.","Heart is the founder of Pulsechain, PulseX and the project Hex, both of which have been marred in controversy during their existences. He raised more than $1 billion by selling tokens for these projects, according to the SEC, which is the focus of the lawsuit.","\"<span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">Heart, Hex, PulseChain, and PulseX violated the federal securities laws through the <\/span><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">unregistered offer and sale of securities. Additionally, through the misappropriation of investor <\/span><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">assets, Heart and PulseChain defrauded their investors,\" the SEC said.<\/span>","The lawsuit aims at Heart's control of the project, his statements that it could potentially increase in value and the staking feature designed to get token holders to lock up their tokens in exchange for more tokens.","The SEC said Heart has previously made comments suggesting that Hex will increase in value, such as claiming it \"<span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">was built to be the highest appreciating asset that has ever existed in the <\/span><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">history of man.\"<\/span>","In the lawsuit, the SEC noted that the price of Hex is down 98.4% from its all-time high and the tokens for the other two projects are \"practically worthless.\"","The SEC also claims Heart defrauded investors by misappropriating at least $12 million of customer funds, using them for personal purchases of luxury items instead of developing the protocols. These included a McLaren sports car, a Ferrari and five watches."],"hashtag":["LAWSUITS","SEC"]}