{"summary":"A high demand for Arbitrum during its Odyssey campaign ended up spiking transaction fees on the Layer 2 network. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/154762\/arbitrum-fees-rose-higher-than-ethereum-mainnet-for-several-hours","publishDate":"2022-06-29T10:35:45","id":2543,"type":null,"title":"Arbitrum pauses Odyssey after gas fees spike","category":["LAYER 2S AND SCALING"],"content":["<span data-v-f87c67ca=\"\">Fees on Ethereum's Layer 2 scaling solution Arbitrum One rose to unusual levels for several hours on Wednesday.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The average transaction fees to perform a token swap on Arbitrum spiked to nearly $5, per on-chain data, many times more than normal. The higher-than-expected fees on Arbitrum were caused by increased user activity.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The heightened activity has, in part, resulted from an incentivized campaign called Arbitrum Odyssey, a 2-month promotional campaign. In this, Offchain Labs, Arbitrum's development firm, promised NFT rewards to users who interact with various Arbitrum-based DeFi protocols. Airdrop farmers — those who try to be qualified for future airdrops — are speculating that these NFTs will later give access to a token airdrop, but this is by no means guaranteed.<\/span>","<span data-v-f87c67ca=\"\">The Arbitrum team has now paused Odyssey to manage increased congestion and bring down the gas fees. In a Twitter post, the team said that Odyssey will remain halted until Arbitrum deploys Nitro, a new update that will increase its computational capacity. The fees on Arbitrum have since come back down and are now sitting at around the $2 mark at the time of this article.<\/span>","<span data-v-f87c67ca=\"\">Per its official blockchain explorer called Arbiscan, the Layer 2 network experienced a 45% increase in daily transactions in the last few weeks. The network also touched a record high of more than <a href=\"https:\/\/arbiscan.io\/chart\/tx\" data-v-f87c67ca=\"\">287,000 transactions<\/a> on Monday.<\/span>","<span data-v-f87c67ca=\"\">Arbitrum is a Layer 2 solution that leverages a technology called Optimistic Rollups. This results in an off-chain computation network that lets it achieve faster and cheaper transactions while still deriving security from the main Ethereum blockchain.<\/span>","<span data-v-f87c67ca=\"\">With over $2 billion in total value locked, Arbitrum leads the Layer 2 market ahead of others like Optimism, Boba and Metis, that all rely on the same scaling technology.&nbsp;<\/span>","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Correction: A previous version of this article stated that token swap fees on Arbitrum were higher than the Ethereum mainnet. In reality, there was a <a href=\"https:\/\/twitter.com\/dmihal\/status\/1542141999901540355\" data-v-f87c67ca=\"\">bug<\/a> in the <a href=\"https:\/\/forum.cryptostats.community\/t\/updated-adapter-arbitrum-transaction-fees-v0-1-4\/283\" data-v-f87c67ca=\"\">CryptoStats fee adapter<\/a> that reported incorrect data. The swap fees on Arbitrum never actually rose higher than Ethereum, <a href=\"https:\/\/twitter.com\/dmihal\/status\/1542796709037838336?s=21&amp;t=_qXZw4iYBVgFnln4N82K_Q\" data-v-f87c67ca=\"\">according to<\/a> David Mihal, a software engineer at CryptoStats.&nbsp;<\/span><\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Odyssey","content":"ORGANIZATION"},{"type":"Arbitrum deploys Nitro","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"45%","content":"PERCENT"},{"type":"$2 mark","content":"MONEY"},{"type":"$5","content":"MONEY"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"David Mihal","content":"PERSON"},{"type":"Arbitrum","content":"PERSON"},{"type":"Arbitrum","content":"ORGANIZATION"},{"type":"$2 billion","content":"MONEY"},{"type":"Offchain Labs","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ARBITRUM","ETHEREUM"],"authors":["Vishal Chawla","The Block"]}