{"summary":"EY has launched a crypto application that helps its U.S. users with tax filings\nThe app, called CryptoPrep, allows users to aggregate their crypto transactions and calculate capital gains or losses for tax purposes","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/68944\/ey-launches-crypto-app-that-helps-with-tax-filings","publishDate":"2020-06-19T05:45:10","id":2544,"type":null,"title":"EY launches crypto app that helps with tax filings","category":["Tax"],"content":["“Big Four” professional consulting firm Ernst &amp; Young (EY) has <a href=\"https:\/\/www.ey.com\/en_us\/news\/2020\/06\/ey-launches-first-of-its-kind-cryptocurrency-reporting-app\" data-v-f87c67ca=\"\">launched<\/a> a web-based cryptocurrency application that helps its U.S. users with tax filings.","Called <a href=\"https:\/\/cryptoprep.ey.com\/\" data-v-f87c67ca=\"\">CryptoPrep<\/a>, the app allows users to aggregate their crypto transactions and calculate capital gains or losses for Form 8949 of the Internal Revenue Service (IRS).","Users <a href=\"https:\/\/cryptoprep.ey.com\/faq\" data-v-f87c67ca=\"\">can provide<\/a> EY a CSV file containing crypto transactions, or manually enter their transaction history in the app. They can also provide “read-only” access to API (application programming interface) keys from their crypto exchanges.","EY said it does not store API keys. “We use your keys to pull your transaction history and then we delete them.” So, “we do not have access to your cryptocurrency, only a history of your transactions.”","The CryptoPrep app supports over 1,000 coins and “most popular exchanges.” EY did not specify those exchanges. The app also allows users to add transactions from unsupported exchanges by selecting the ”Other” tile from the ”Sync Exchange” view within the app.","Once users have completed inputting their crypto trading transactions, the app allows users to download a draft Form 8949 and a CSV file detailing their transactions. The service, of course, comes at a cost.","For up to 20 transactions, the cost is $49. For 21–100 transactions, the cost goes up to $99, and for 101–999 transactions, it goes up to $399. For transactions beyond that threshold, EY offers individually priced services.","“Our clients increasingly hold and trade crypto assets, creating the need for an innovative solution to address the evolving complexity around filing crypto taxes,” said Marna Ricker, vice-chair of tax services at EY Americas. She added that the CryptoPrep app is created by the EY Foundry, the company’s internal corporate venturing unit.","EY is not the only firm to help U.S. users file crypto taxes. Winklevoss Capital-backed TaxBit also allows users to prepare Form 8949. Other similar services include TokenTax and Koinly."],"hashtag":[]}