{"summary":"The legal team attempting to recoup funds from Three Arrows Capital have gotten the green light to issue subpoenas for discovery in the investigation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157141\/bankruptcy-court-judge-gives-green-light-to-serve-subpoenas-to-3ac-founders-for-discovery","publishDate":"2022-07-12T12:56:59","id":2544,"type":null,"title":"Bankruptcy court judge gives green light to serve subpoenas to 3AC founders for discovery","category":["LEGAL"],"content":["The legal team attempting to recoup funds from embattled fund Three Arrows Capital have gotten the green light to issue subpoenas to the founders and relevant firms for information in the investigation. A judge in the Southern District of New York has issued an order granting provisional relief.&nbsp;","Three Arrows Capital is facing <a href=\"https:\/\/www.theblock.co\/linked\/152092\/after-facing-hundreds-of-millions-of-dollars-in-liquidations-three-arrows-capitals-future-is-uncertain\" data-v-f87c67ca=\"\">insolvency<\/a> after being liquidated by its lenders. The fund sustained significant losses during the collapse of the Terra ecosystem and faced further turmoil during a wider industry selloff. In June, 3AC founders Su Zhu and Kyle Davies were reportedly figuring out how to repay their lenders and other counter-parties.","As the predicament worsened, it began insolvency proceedings in the <a href=\"https:\/\/www.theblock.co\/post\/154809\/three-arrows-capital-liquidation-teneo\" data-v-f87c67ca=\"\">British Virgin Islands<\/a>, where a court-appointed financial advisory firm Teneo to handle the liquidation. Those insolvency proceedings came with Chapter 15 bankruptcy proceedings in the Southern District of New York, which allows a foreign debtor to file for bankruptcy in the US.&nbsp;","Adam Goldberg from Latham &amp; Watkins represents Teneo's Russel Crumpler and Christopher Farmer of Teneo in their attempts to coordinate the liquidation in the British Virgin Islands with stateside proceedings. Farmer and Crumpler are senior managing directors at Teneo.&nbsp;","But amid these proceedings, the founders vanished. A month passed with no communication from the founders, and court documents in the Chapter 15 proceedings showed that Davies and Zhu had \"failed to cooperate\" during the process.","A hearing today sought an order granting provisional relief, which usually attempts to freeze the status quo of assets as proceedings move forward. Indeed, Goldberg said that Davies and Zhu haven't been located.&nbsp;","\"The founders' location continues to be unknown to the liquidators, and they have not offered any meaningful cooperation as of the time of this hearing. There have been communications between counsel purporting to represent the founders and the liquidators,\" he said.","Part of that communication is a list of certain assets from the founders which was provided only 24 hours before today's hearing. Goldberg said the list is not complete in the view of liquidators and does not contain bank account information.","\"This is by no means a sufficient form of cooperation. And I should note it came only after we filed this emergency motion before the court,\" he said.","Multiple failed attempts to reach Zhu and Davies led to today's hearing, in which liquidators sought a motion to obtain discovery or more information about the state of 3AC. And according to comments from Goldberg, firms entangled with 3AC's turmoil want to share what they have, but they need a legal impetus to provide the information due to regulations and requirements.&nbsp;","\"I should note, particularly on that last point, in recent days since the filing of the motion and as this case has gained more attention, we've actually received inquiries from certain institutions that are looking for a subpoena here that have confidentiality or other regulations that require them to be subject to legal process before they're able to turn over information,\" he said.","Judge Martin Glenn granted the provisional motion, allowing subpoenas to be sent to the founders and those with the knowledge that could be salient to the investigation. Additionally, Crumpler and Farmer will be entrusted with the administration of the realization of 3AC's affairs and assets in the US, meaning no one else will be able to transfer or dispose of 3AC's assets in the meantime.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Martin Glenn","content":"PERSON"},{"type":"Southern District of New York","content":"ORGANIZATION"},{"type":"Kyle Davies","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Latham &amp; Watkins","content":"ORGANIZATION"},{"type":"Russel Crumpler","content":"PERSON"},{"type":"Christopher Farmer","content":"PERSON"},{"type":"Crumpler","content":"PERSON"},{"type":"Teneo","content":"ORGANIZATION"},{"type":"Adam Goldberg","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"British Virgin Islands","content":"LOCATION"},{"type":"Davies","content":"PERSON"},{"type":"Goldberg","content":"PERSON"}],"hashtag":["THREE ARROWS CAPITAL"],"authors":["Aislinn Keely","The Block"]}