{"summary":"Masa Network raised $5.4 million in a seed funding round.\nThe funds will support the launch of the Masa subnet on Avalanche.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273984\/masa-network-seed-round","publishDate":"2024-01-23T08:00:03","id":2547,"type":null,"title":"Masa raises $5.4 million in seed round to build data network on Avalanche","category":["Deals"],"content":["Masa Network has raised $5.4 million in a seed funding round to build a decentralized network on Avalanche focused on users' personal data.","Leading the investment round was Anagram — a venture capital firm co-founded by Lily Liu of the Solana Foundation and Joe Eagan, formerly of Polychain.","The round also saw participation from notable investors like Avalanche Blizzard Fund, Digital Currency Group and GoldenTree, among others.","Masa aims to create a data platform, allowing users to contribute personal data and receive compensation in the form of Masa's native token. Developers will have access to this data for training AI models and creating applications in a manner that preserves user privacy.","This will be achieved through the use of advanced encryption technologies, including zero-knowledge proofs.","The recent seed funding follows Masa's $3.5 million <a href=\"https:\/\/www.businesswire.com\/news\/home\/20220504005342\/en\/Masa-Finance-Raises-3.5-Million-Pre-Seed-to-Build-the-World%E2%80%99s-First-Hybrid-Credit-Protocol-Decentralized-Credit-Bureau\" data-v-f87c67ca=\"\">pre-seed round<\/a> in 2022 — bringing the total capital raised to about $9 million.","The funds will be used for the launch of <a href=\"https:\/\/www.theblock.co\/post\/268051\/decentralized-google-launch-zk-powered-data-marketplace-avalanche\" data-v-f87c67ca=\"\">Masa's subnet<\/a> on Avalanche this year, the team said. The customizable blockchain will be designed to handle high volumes of zero-knowledge encrypted data."],"hashtag":["AVALANCHE","SEED &AMP; PRE-SEED"]}