{"summary":"Tharsis, the development firm behind Evmos, raised $27 million in a token sale.\nThe team hopes to deploy the newly raised capital toward ecosystem development.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/182223\/evmos-developers-raise-27-million-in-a-token-sale-led-by-polychain","publishDate":"2022-11-02T10:52:58","id":255,"type":null,"title":"Evmos developers raise $27 million in a token sale led by Polychain","category":["Venture Capital"],"content":["<span data-v-f87c67ca=\"\">Tharsis, the developers of<\/span><a href=\"https:\/\/www.theblock.co\/post\/143771\/evmos-launches-blockchain-to-bring-ethereum-virtual-machine-to-cosmos\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> Evmos blockchain<\/span><\/a><span data-v-f87c67ca=\"\">, raised $27 million at an undisclosed valuation in a token sale round led by Polychain Capital.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Companies like Galaxy Digital, Huobi and HashKey also participated.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The team hopes to deploy the newly raised capital toward accelerating the development of decentralized applications in the Evmos network ecosystem, Tharsis co-founder Federico Kunze Küllmer said in a statement.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“As we look ahead, we’re excited to be empowering dApp builders with the best place to launch their products by enabling native interoperability, aligning developer incentives with the use of their dApps,” Kunze Küllmer said.<\/span>","<span data-v-f87c67ca=\"\">Launched in April, Evmos aims to position itself as a leading Cosmos-based blockchain that offers compatibility with Ethereum via Ethereum Virtual Machine (EVM), a computing environment used by Ethereum developers. Tharsis hopes EVM will make Evmos more appealing to Ethereum developers.<\/span>","<span data-v-f87c67ca=\"\">Over the last few years, EVM has become the most widely adopted computing standard for developing smart contracts.&nbsp;<\/span>"],"hashtag":[]}