{"summary":"In a Discord update on Wednesday night, the team at NFT Worlds said it was looking at several options for how to continue the project.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/159002\/nft-worlds-to-have-plan-of-action-by-end-of-week-following-minecraft-nft-ban","publishDate":"2022-07-21T15:17:38","id":2550,"type":null,"title":"Minecraft-based project NFT Worlds to have &#x27;plan of action&#x27; by end of week","category":["GAMING AND METAVERSE"],"content":["Minecraft-based project NFT Worlds aims to reveal a plan of action in response to <a href=\"https:\/\/www.theblock.co\/post\/158759\/minecraft-developer-mojang-to-restrict-use-of-nfts-blockchain-tech-with-guideline-update?utm_source=rss&amp;utm_medium=rss\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Minecraft banning non-fungible token<\/a> (NFT) integrations by this weekend, the project's pseudonymous co-founder ArkDev <a href=\"https:\/\/twitter.com\/iamarkdev\/status\/1550152462165692416\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">said via Twitter<\/a> on Thursday.&nbsp;","The company uses Minecraft's source code as a basis for its NFT-powered metaverse. It said it had been “blindsided” by the announcement from Minecraft makers Mojang Studios — which Microsoft acquired in 2014.","In a blog published on Wednesday, Mojang Studios said NFT integrations were \"generally not something we will support or allow.” The post raised concerns that NFTs create a culture of unequal access.","In a Discord update on Wednesday night, the team at NFT Worlds said it was looking at several options for how to continue the project, including trying to get in touch with “the right decision makers within the Minecraft policy enforcement team” to understand the change and see if there are any possibilities for continuing operations using Minecraft.","It also laid out several options should this fail, including transitioning into their own Minecraft-like game engine and games platform, and collaborating with other projects.","The effects of the announcement are already hitting NFT Worlds, however. OpenSea data for July 21 shows the sale of 555 NFTs from the NFT Worlds collection compared with 16 the day before. The average price has dropped too, from 3.33ETH to 1.06ETH.","Mojang Studios is not alone in its dislike for blockchain technology among the gaming community. While some studios are dipping their toes into web3 — Epic Games Store is planning to <a href=\"https:\/\/www.theblock.co\/post\/150444\/epic-games-store-will-host-its-first-web3-game-this-year\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">host its first blockchain-based game<\/a> later this year, for instance — others have little interest in the technology or have even banned it outright. Steam prohibited crypto, NFT and blockchain games in mid-October last year.","Mojang's move has drawn some harsh criticism. In a <a href=\"https:\/\/twitter.com\/ysiu\/status\/1550068515188535296\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Twitter thread<\/a> on Thursday, Yat Siu, executive chairman of Animoca Brands —<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\"> the company behind metaverse project The Sandbox and which has no stake in NFT Worlds <\/span>— likened Microsoft and Minecraft to a “digital dictatorship.”&nbsp;","Siu colorfully accused the two of causing “pain and suffering to an innocent [and] blameless minority who was purged and cleansed without regard to their circumstances and without advance notice,” and said the companies had provided no proof that NFTs are harmful to their community.","“Blockchain and NFTs are not a threat to Minecraft or the gaming community, it is a threat to closed platforms\/monopolies who control every aspect of our digital lives and wish to continue extracting every ounce of value from our time and attention,” he said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"July 21","content":"DATE"},{"type":"Minecraft","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"weekend","content":"DATE"},{"type":"Yat Siu","content":"PERSON"},{"type":"Minecraft","content":"ORGANIZATION"},{"type":"night","content":"TIME"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"ArkDev","content":"PERSON"},{"type":"Mojang Studios","content":"ORGANIZATION"},{"type":"mid-October last year","content":"DATE"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}