{"summary":"OpenSea’s Pro non-fungible token (NFT) trading platform is finally live after a year of development. Is it too little, too late?","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/224875\/opensea-blur-nfts-pro","publishDate":"2023-04-04T15:42:21","id":2551,"type":null,"title":"NFT marketplace OpenSea aims to claw back Blur’s gains with &#x27;Pro&#x27; platform, but whales unlikely to go back","category":["METAVERSE & NFT"],"content":["OpenSea’s Pro non-fungible token (NFT) trading platform is finally live after several months of development. Is it too little, too late?","<span data-v-f87c67ca=\"\">The company that long held the title of the world’s biggest NFT marketplace will see if its new offering can help it regain its dominance — Upstart marketplace Blur recently overtook OpenSea as the leader in total volume as measured by U.S. dollars. Blur offered a tantalizing incentive program featuring low fees, airdrops and <a href=\"https:\/\/www.theblock.co\/post\/217458\/blur-captures-84-of-eth-based-nft-transactions-in-first-week-of-march\" data-v-f87c67ca=\"\">token incentives<\/a> in order to woo traders; the strategy quickly ate into OpenSea’s market share.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Still the leading marketplace by number of active traders, according to The Block research, OpenSea acquired <\/span><span data-v-f87c67ca=\"\">NFT aggregator service Gem <a href=\"https:\/\/www.theblock.co\/post\/143297\/opensea-acquires-nft-aggregator-gem\" data-v-f87c67ca=\"\">last April<\/a>. Gem allows traders to buy and sell NFTs across multiple marketplaces. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">OpenSea has integrated Gem into its Pro product. <\/span><span data-v-f87c67ca=\"\">“<\/span><span data-v-f87c67ca=\"\">Building on previous Gem designs, we’re excited to roll out a vastly improved suite of features that will allow collectors to discover the best deals and insights across 170 marketplaces and access sophisticated tools that meet their need for automation,” the company said in a statement. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">The Block research analyst Brad Kay isn't convinced OpenSea’s latest push will be enough to put a serious dent in Blur's gains. <\/span>","<span data-v-f87c67ca=\"\">“<\/span><span data-v-f87c67ca=\"\">The opportunity cost to switch to OpenSea is way too high,” said Kay, who added top traders, or whales, appear committed to Blur for now. “Seventy percent of the total Blur volume comes from the top 1% of users while OpenSea’s top 1% of users only account for 20% of the total volume.”<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">The Block research data.<\/em><\/span>","<span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\nOpenSea appears it may be taking a page from Blur’s playbook by offering a batch of incentives. First, the company said it will allow holders, during a “promotional period” to list NFTs on Pro without charging any fees. Additionally, OpenSea said it plans to give early adopters of Gem <\/span><span data-v-f87c67ca=\"\">an NFT reward. It also teased another potential reward for users who swap the regular trading platform for Pro. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">“W<\/span><span data-v-f87c67ca=\"\">e’re not forgetting about community rewards,” the company said. “We’re charting a different course by featuring NFTs as rewards.”<\/span>","<em data-v-f87c67ca=\"\">Disclaimer: Larry Cermak, CEO of The Block, is an angel investor in Blur.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Larry Cermak","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Kay","content":"PERSON"},{"type":"Brad Kay","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Seventy percent","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"OpenSea","content":"PERSON"},{"type":"1%","content":"PERCENT"},{"type":"last April","content":"DATE"}],"hashtag":[],"authors":["RT Watson","The Block"]}