{"summary":"House and Senate members sent a letter to the Department of Energy and Environmental Protection Agency asking regulators to demand that crypto miners report information about missions and energy use.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157860\/house-senate-democrats-push-regulators-to-demand-data-from-bitcoin-miners","publishDate":"2022-07-17T12:06:47","id":2555,"type":null,"title":"House, Senate Democrats push regulators to demand data from Bitcoin miners","category":["MINING"],"content":["A group of Congress members including US Sen. Elizabeth Warren and US Rep. Jared Huffman sent <a href=\"https:\/\/www.warren.senate.gov\/imo\/media\/doc\/2022.07.15%20Letter%20to%20EPA%20and%20DOE%20Re%20Cryptomining%20Environmental%20Impacts.pdf\" data-v-f87c67ca=\"\">a letter<\/a> to the Department of Energy (DOE) and Environmental Protection Agency (EPA) Friday asking regulators to require crypto miners to report information about emissions and energy use.","The legislators also <a href=\"https:\/\/www.warren.senate.gov\/imo\/media\/doc\/Seven%20Cryptominers%20Responses%20to%20Senator%20Warren.pdf\" data-v-f87c67ca=\"\">published written responses<\/a> from seven miners that they had reached out to requesting information about their energy use.","\"None of the companies provided full and complete information in response to our questions,\" the letter to regulators said. In it, legislators asked the EPA and the DOE to \"work together to require emissions and energy use reporting by cryptominers.\"","According to the information compiled by the lawmakers, those miners use a combined total of 1,045 megawatts and plan to increase the number by at least 2,399 megawatts \"in the next few years.\" Congress members called these results \"disturbing\" and stated that miners accounted for a large and \"rapidly growing\" amount of carbon emissions.","However, they also said that \"little is known about the full scope of cryptomining activity.\"&nbsp;","\"(It's) imperative that your agencies work together to address the lack of information about cryptomining’s energy use and environmental impacts, and use all available authorities at your disposal, such as Section 114 of the Clean Air Act,\" they wrote.","In the letter, Congress members asked regulators for clarification on whether they actually have the authority to require that type of disclosure from crypto miners.","The reach that regulators can have in such matters has been put into question recently, f<span data-contrast=\"auto\" data-v-f87c67ca=\"\">ollowing a Supreme Court decision at the end of June to limit the Environmental Protection Agency’s (EPA) authority to regulate greenhouse gas emissions from power plants.<\/span>","Huffman told The Block that nothing in the Supreme Court's decision touched on the agency's authority to investigate, under section 114 of the Clean Air Act. Therefore, he believes it would not impact the EPA's ability to act in this particular case.","\"I would hope that they would choose to go further than just an investigation,\" he said. \"I would hope that they would choose to try to set some standards and exercise their authority to address those impacts. The Supreme Court decision did not take away all their authority, but it constrained how they exercised in certain cases that have a broad national economic impact.\"","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Going forward, agencies might face resistance from the courts when using old laws to regulate new industries such as bitcoin mining or crypto in general.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:0,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">“It's going to put more on Congress's shoulders to regulate, to issue new statutory provisions,” Kevin Minoli, former counsel for the EPA and a laser at Alston &amp; Bird, told The Block.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Essentially<\/span><span data-contrast=\"auto\" data-v-f87c67ca=\"\">, the court found that under a heightened standard of review called the major questions doctrine there wasn't a clear statement of congressional authority in the Clean Air Act for the EPA to adopt the type of regulation in that case. <\/span><span data-contrast=\"auto\" data-v-f87c67ca=\"\">Typically, agencies have been subjected to the more permissive Chevron doctrine, which states that as long as regulations don’t conflict with the language of a statute, then agencies can fill in any gaps.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:0,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">It’s unlikely that this decision will have a significant and immediate impact on already existing regulations, Minoli argued. However, that’s not to say that people won’t try to challenge them using this case as support. <\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:0,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">“The question is when will the courts be able to apply that standard and when will they not,” Minoli said. “The court will look for is: ‘was there a clear expression of congressional authorization for the regulation that was adopted?’”<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:0,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">For example, regulations concerning taxes would likely be upheld, regardless of how old the statutes they rely on are.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:0,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">“It's not a new authority,” Minoli said. “T<\/span><span data-contrast=\"none\" data-v-f87c67ca=\"\">here's nothing different about what the government is doing except for applying the same thing, the same way to just a new company.\"<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Courts would likely apply a heightened review standard when agencies use a long-existing statute to address a new problem. <\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“It may be that if agencies are using or old statutes to try to address the new challenges of blockchain, that could be a scenario under which a court says ‘wait a minute, you've found authority in something that as long ago no one thought that authority existed,” he said said.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:0,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">On March 9, President Biden <a href=\"https:\/\/www.theblock.co\/linked\/137013\/white-house-releases-text-of-bidens-crypto-focused-executive-order\" data-v-f87c67ca=\"\">signed an executive order <\/a><\/span><span data-contrast=\"none\" data-v-f87c67ca=\"\">that included the EPA in the list of governmental agencies that were tasked with looking at the potential risks and benefits of crypto and coming up with a report within 180 days.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:0,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Specifically, it asked agencies to study the potential for crypto to “impede or advance efforts to tackle climate change at home and abroad.”<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:0,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">While this was only a first step, Minoli indicated that any regulatory framework that results from it down the line could possibly be subjected to the major question doctrine.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“If the EPA, under that executive order did the analysis and then wrote a regulation that found authority to regulate blockchain (under a) statute that's been in existence for 35 years the court may say ‘before we agree that the EPA has the broad authority to be the financial regulator of this currency, we're going to have expected Congress to give them that authority clearly.'\"<\/span>","In other words, the EPA could need Congress to enact new legislation for that specific purpose.","Still, Huffman argued that the decision would not have that much impact in the EPA's ability to regulate bitcoin mining.","\"It only involves the major questions doctrine when it is a regulation that has economy-wide impacts,\" he said. \"It's hard to imagine that some basic standards that might be applied to crypto mining would rise to the level of major questions.\"","Where it will have an impact, he said, is on the EPA and other agencies' power to pass regulations that address the climate crisis in broad sweeps.","\"The Supreme Court has said that if you want to try to reform an entire sector of the economy, you're going to need a specific directive from Congress,\" Huffman said. \"I think many of us have just wanted to make sure the EPA is looking into (bitcoin mining) and is doing the oversight and contemplating rules and standards that might be appropriate. And I think all of that continues to be available to the EPA right now, notwithstanding the Supreme Court decision.\"","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Following the executive order, over 20 House Democrats sent a letter to the EPA calling for increased oversight of proof-of-work mining in April.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:0,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">The group of legislators, led by Huffman, asked the agency to investigate possible negative consequences of this type of crypto mining, such as noise pollution, electronic waste from hardware replacement, greenhouse gas emissions and the reopening of former gas and coal plants to power mining operations.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:0,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The White House Office of Science and Technology Policy (OSTP) is also <a href=\"https:\/\/www.theblock.co\/linked\/149850\/white-house-office-report-on-crypto-mining-expected-in-august-bloomberg\" data-v-f87c67ca=\"\">expected to publish a report on cryptocurrency mining and its environmental impact in August<\/a>.","“It’s important, if this is going to be part of our financial system in any meaningful way, that it’s developed responsibly and minimizes total emissions,” Costa Samaras, principal assistant director for OSTP's energy division, <a href=\"https:\/\/news.bloomberglaw.com\/environment-and-energy\/hill-energy-briefing-crypto-miners-energy-use-draws-scrutiny\" data-v-f87c67ca=\"\">told Bloomberg Law<\/a>.","Assemblywoman Anna Kelles, who has been the sponsor and a strong supporter of a proof-of-work mining moratorium bill <a href=\"https:\/\/www.theblock.co\/post\/143658\/new-york-assembly-passes-two-year-crypto-mining-moratorium-bill\" data-v-f87c67ca=\"\">passed by the New York legislature<\/a> that would essentially target fossil-fuel power plants, said that the Supreme Court's decision could leave a lot of the regulatory process up the states.","\"With this EPA regulatory ability removed there are no guardrails on how large or how polluting any individual power plant can be if a state chooses not to set any parameters,\" Kelles told The Block over email.","Coinciding with the day that the decision came out, <a href=\"https:\/\/www.theblock.co\/post\/155188\/greenidges-permit-renewal-denied-by-new-york-regulators\" data-v-f87c67ca=\"\">New York regulators denied bitcoin miner Greenidge an air permit<\/a> for its natural gas plant. The Department of Environmental Conservation argued that Greenidge's application didn't comply with the greenhouse gas emissions limits set by the state's Climate Leadership and Community Protection Act.","New York Governor Kathy Hochul also recently commented on the decision while signing legislation regarding greenhouse gas emissions.","\"Here in New York we are not letting the Supreme Court block our goals or our bold ambition for our state,\" she said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Environmental Protection Agency (EPA","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Department of Energy (DOE","content":"ORGANIZATION"},{"type":"Huffman","content":"PERSON"},{"type":"Supreme Court","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Kevin Minoli","content":"PERSON"},{"type":"Alston &amp; Bird","content":"ORGANIZATION"},{"type":"March 9","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"April","content":"DATE"},{"type":"Climate Leadership and Community","content":"ORGANIZATION"},{"type":"Elizabeth Warren","content":"PERSON"},{"type":"Chevron","content":"ORGANIZATION"},{"type":"August","content":"DATE"},{"type":"Kathy Hochul","content":"PERSON"},{"type":"Jared Huffman","content":"PERSON"},{"type":"The Supreme Court","content":"ORGANIZATION"},{"type":"Greenidge","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Bloomberg Law","content":"ORGANIZATION"},{"type":"Anna Kelles","content":"PERSON"},{"type":"Environmental Protection Agency","content":"ORGANIZATION"},{"type":"OSTP","content":"ORGANIZATION"},{"type":"EPA","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"White House Office of Science and Technology Policy (OSTP)","content":"ORGANIZATION"},{"type":"Department of Environmental Conservation","content":"ORGANIZATION"},{"type":"Biden","content":"PERSON"},{"type":"Minoli","content":"PERSON"},{"type":"the Supreme Court","content":"ORGANIZATION"},{"type":"Costa Samaras","content":"PERSON"}],"hashtag":["CONGRESS"],"authors":["Catarina Moura","The Block"]}