{"summary":"Telegram is now telling US investors to leave its blockchain project TON by taking 72% refund amount \nThe company said it has taken the decision based on discussions with “relevant authorities and our lawyers”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/64023\/telegram-now-tells-us-investors-to-leave-its-blockchain-project-and-take-72-refund","publishDate":"2020-05-05T04:00:22","id":2556,"type":null,"title":"Telegram now tells US investors to leave its blockchain project and take 72% refund","category":["Layer 1s"],"content":["After delaying its blockchain project for one more year last week, Telegram is now telling U.S. investors to leave the project immediately by taking 72% refunds.","In a new letter to Telegram Open Network (TON) investors on Monday, the company said American investors can’t wait for another year and are not eligible for a 110% loan refund option in April 2021.","“Unfortunately, given your status as an investor from the United States and based on later discussions with the relevant authorities and our lawyers, we made the difficult decision not to use this option with you due to an uncertain regulatory attitude in the United States,” Telegram <a href=\"https:\/\/thebell.io\/durov-ne-razreshil-amerikanskim-investoram-zhdat-zapuska-ton-eshhe-god\/\" data-v-f87c67ca=\"\">said<\/a> in the letter, a copy of which is obtained by Russian news publication The Bell.","A source with knowledge of the matter independently confirmed to The Block that U.S. investors wouldn’t have the loan option.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Two choices&nbsp;<\/strong><\/span>","Last week, Telegram <a href=\"https:\/\/www.theblockcrypto.com\/post\/63524\/telegram-now-delays-launch-of-its-blockchain-by-one-more-year-ready-to-return-investor-money\" data-v-f87c67ca=\"\">offered<\/a> two choices to all investors: either take a 72% refund immediately or wait until April 2021 and get 110% by converting original investments into loans. Telegram planned to cover debt via equity sale.","It remains unclear how many non-American investors have agreed on the loan option.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThose who opted for this option also had a choice to receive gram tokens \"or potentially another cryptocurrency on the same terms as those in their original purchase agreements.”","However, the crypto option is also now reportedly gone. \"Unfortunately, based on more recent discussions with relevant authorities and our counsel, we have made the difficult decision not to pursue an option involving grams or another cryptocurrency due to its uncertain reception from the relevant regulators,” per a CoinDesk <a href=\"https:\/\/www.coindesk.com\/telegram-withdraws-offer-to-repay-investors-with-gram-tokens\" data-v-f87c67ca=\"\">report<\/a>.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Delays&nbsp;<\/strong><\/span>","Telegram was initially scheduled to launch its TON blockchain and gram tokens in October 2019, but it got delayed at the time to April 2020 since the U.S. Securities and Exchange Commission (SEC) sued Telegram for conducting an “illegal” sale of the tokens and for allegedly violating securities laws. Telegram raised $1.7 billion in 2018 by pre-selling its gram tokens.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nLast week, Telegram further delayed the launch of its blockchain project by one more year to April 2021, after a U.S. judge ruled that the company cannot go ahead with the project until its case with the SEC is resolved.&nbsp;"],"hashtag":["SEC"]}