{"summary":"Huobi’s version of wrapped bitcoin, HBTC, claims to offer transparency and the ability to verify its reserves.\nYet the exchange moved the collateral out of its official transparency wallets, making the token very opaque.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156559\/huobis-version-of-wrapped-bitcoin-has-a-transparency-problem","publishDate":"2022-07-14T04:20:03","id":2558,"type":null,"title":"Huobi’s version of wrapped bitcoin has a transparency problem","category":["Bitcoin"],"content":["<em data-v-f87c67ca=\"\">Update: Following the publication of this article, Huobi has updated its transparency page to include new addresses that contain the collateral for all of the wrapped tokens mentioned. These show that all of the tokens are fully collateralized.<\/em>","<em data-v-f87c67ca=\"\">\"<span lang=\"en-US\" data-v-f87c67ca=\"\">To enhance HBTC holders<\/span>’<span lang=\"en-US\" data-v-f87c67ca=\"\"> confidence, we have been gradually migrating HBTC assets to Huobi Trust Company Limited for digital asset custody,\" said a spokesperson for Huobi via email.<\/span><\/em>","Huobi’s version of wrapped bitcoin isn’t living up to the transparency that it promised. The $800 million of assets that are backing the crypto exchange’s token are supposed to be sitting in clearly market wallets; except they’re not.&nbsp;","Instead, the money appears to have been spread among other exchange wallets, also owned by Huobi. The problem here is not that the money is necessarily gone; it’s plausible that Huobi is using its exchange hot wallets to make it easier to process transactions. The issue is that market observers cannot see for themselves whether the token is still backed.&nbsp;","For all we know — from checking Huobi’s <a href=\"https:\/\/www.htokens.finance\/en-us\/assets\" data-v-f87c67ca=\"\">official transparency page<\/a> — the $800 million of outstanding Huobi Bitcoin (HBTC) is backed by less than $30,000.","The Block reached out to Huobi for comment but — after an initial response — the exchange stopped replying to follow up emails. The exchange did not provide any explanation for why the bitcoin was moved, nor would answer whether HBTC was still fully backed.","Huobi created HBTC in February 2020 as its proprietary form of wrapped bitcoin. Wrapping bitcoin is a process where you take bitcoin on the Bitcoin blockchain, lock it up in a wallet and issue a tokenized version of it on another chain, in this case on Ethereum.&nbsp;","At the time, Huobi <a href=\"https:\/\/support.hbfile.net\/hc\/en-us\/articles\/900000196603-Official-Launch-Of-Huobi-BTC-HBTC-On-Ethereum-Network\" data-v-f87c67ca=\"\">said<\/a> HBTC would be “transparent and verifiable,” enabling anyone to authenticate the assets on both the Bitcoin and Ethereum blockchains. &nbsp;","For a while, it seemed that this was the case. In early August 2021, the supply of HBTC was around 31,000 and Huobi’s two official wallets contained around 39,700 bitcoin.","Yet between August 20 and August 26 of last year, practically all of this collateral was moved out of both wallets. The funds were split into three sums and all were sent to <a href=\"https:\/\/explorer.btc.com\/btc\/address\/1NRXTibN25saCQ2o4kL1tJh4yFQskgHZoT\" data-v-f87c67ca=\"\">this wallet<\/a>. Each was then repeatedly shifted to new wallets, with small amounts siphoned off at each turn.&nbsp;","Huobi also created wrapped assets for six other cryptocurrencies: bitcoin cash (BCH), polkadot (DOT), tezos (XTZ), bitcoin satoshi’s vision (BSV), filecoin (FIL) and litecoin (LTC). Out of these, only Huobi’s version of BSV (HBSV) is fully backed by collateral in the official wallets. The transparency page shows no data for its version of filecoin at time of writing.","All the assets have a combined total supply worth $865 million but yet just $5.5 million in collateral in the official transparency wallets.","HBTC is failing to offer the transparency provided by Wrapped Bitcoin (WBTC), the most common form of wrapped bitcoin.&nbsp;","WBTC is run by a conglomerate of crypto businesses, including Compound and BitGo. The project’s website provides a list of 268 <a href=\"https:\/\/wbtc.network\/dashboard\/audit\" data-v-f87c67ca=\"\">bitcoin wallets<\/a> that contain its $4.8 billion of bitcoin — and these wallets do indeed contain that amount of the cryptocurrency. This enables those using the wrapped token to know that it’s fully backed.","Still, not all wrapped bitcoin projects offer this level of transparency. RenBTC, another version of wrapped bitcoin with a market cap of $100 million, initially used the crypto data service Chainlink to show its proof of reserves. But it now just has a statement on its <a href=\"https:\/\/mainnet.renproject.io\/\" data-v-f87c67ca=\"\">dashboard<\/a> that says how much it has in reserve — a sum equal to the amount issued on its network — and doesn't provide any links to where the money is kept.","What's complicated about the way renBTC looks after its collateral is that every time some of the collateral is redeemed, it sends that person those funds and sends the remaining assets to a new wallet. As a result, it can’t simply provide a list of wallets where the funds are stored, since it would have to be constantly updating the list.&nbsp;","This may shed some light on Huobi’s processes, as it also constantly spreads the funds to new addresses while siphoning off a little each time. Perhaps the exchange adopted this system but failed to implement a way to track the collateral, since it requires either using Chainlink or setting up an automated system.&nbsp;","Either way, Huobi is — for now at&nbsp;least — failing to offer the transparency it originally promised.&nbsp;"],"hashtag":["HTX"]}