{"summary":"A court is set to decide today whether to detain Wang Chenhuan, president of ACE Exchange, for alleged fraud and money laundering.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274214\/taiwan-ace-exchange-fraud","publishDate":"2024-01-24T02:34:15","id":2559,"type":null,"title":"Taiwan prosecutors seek detention of ACE Exchange president","category":["LEGAL"],"content":["<span data-v-f87c67ca=\"\">Taiwanese prosecutors today requested a Taipei court to detain Chenhuan Wang, president of ACE Exchange, on suspicion of money laundering and fraud after David Pan, the company’s founder, <\/span><a href=\"https:\/\/www.theblock.co\/post\/270429\/founder-of-major-taiwanese-crypto-exchange-ace-arrested-for-alleged-fraud-report\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">was detained earlier this month<\/span><\/a><span data-v-f87c67ca=\"\"> for allegedly orchestrating fraud.<\/span>","<span data-v-f87c67ca=\"\">The Taipei District Prosecutors Office told The Block that Wang, who’s also the partner in charge of law firm <\/span><a href=\"https:\/\/www.chienyeh.com.tw\/people-detail.php?id=3&amp;lang=en\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Chien Yeh law offices<\/span><\/a><span data-v-f87c67ca=\"\">, was summoned by prosecutors alongside four other suspects on Tuesday after the police raided multiple locations across Northern Taiwan.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Following the interrogation, the prosecutors filed a request with the court for the detention and restriction of visitation rights for Wang and the four other suspects, according to the prosecutor's office.<\/span>","<span data-v-f87c67ca=\"\">Earlier this month, Pan and a co-conspirator surnamed Lin were accused of collaborating for three years, using false advertisements on social media to lure investors into putting money into worthless cryptocurrencies, including MOCT. <\/span><span data-v-f87c67ca=\"\">The prosecutors said today that Wang was allegedly involved in the case, and a court is set to decide on his detention later today.<\/span>","<span data-v-f87c67ca=\"\">When the news of Pan’s arrest emerged earlier this month, ACE clarified in a <\/span><a href=\"https:\/\/helpcenter.ace.io\/hc\/zh-tw\/articles\/27214143164953--ACE%E7%8E%8B%E7%89%8C%E6%B3%95%E5%B9%A3%E5%8A%A0%E5%AF%86%E8%B2%A8%E5%B9%A3%E4%BA%A4%E6%98%93%E6%89%80%E8%81%B2%E6%98%8E%E7%A8%BF-\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">statement<\/span><\/a><span data-v-f87c67ca=\"\"> that Pan stopped participating in daily operations in 2022, and Wang took on the role of president in September 2023. Wang said at the time that he had made efforts to delist controversial coins after he joined the exchange, and a spokesperson of ACE previously told The Block that the company was assisting the investigation as a witness.<\/span>","<span data-v-f87c67ca=\"\">ACE said today in a <\/span><a href=\"https:\/\/ace.io\/news\/1428\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">statement<\/span><\/a><span data-v-f87c67ca=\"\"> that the trading and operational conditions of the company remain normal. \"We assure the security of user assets, and all services for deposit and withdrawal of cryptocurrencies and New Taiwan Dollar are functioning smoothly,\" the company added.<\/span>","<span data-v-f87c67ca=\"\">Established in 2018, ACE is one of the largest crypto exchanges in Taiwan, alongside BitoGroup and MaiCoin. ACE said its management team adheres to the rules of law and “will not tolerate any misconduct by anyone.”<\/span>","<span data-v-f87c67ca=\"\">ACE did not immediately respond to The Block’s request for further comment.<\/span>","<span data-v-f87c67ca=\"\">Chien Yeh Law Offices, where Wang serves as the partner in charge and head of the office, <\/span><a href=\"https:\/\/www.chienyeh.com.tw\/news-detail.php?id=183&amp;lang=tw\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\"> today that the ACE case was Wang’s “personal investment affair” and another lawyer is taking over Wang’s role as head of the office.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Northern Taiwan","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"Chien Yeh Law Offices","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Chenhuan Wang","content":"PERSON"},{"type":"David Pan","content":"PERSON"},{"type":"Pan’s","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Taiwan","content":"LOCATION"},{"type":"MaiCoin","content":"ORGANIZATION"},{"type":"Chien Yeh","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"ACE Exchange","content":"ORGANIZATION"},{"type":"September 2023","content":"DATE"},{"type":"New Taiwan","content":"LOCATION"},{"type":"Taipei","content":"LOCATION"},{"type":"Taipei District Prosecutors Office","content":"ORGANIZATION"}],"hashtag":["ANTI-MONEY LAUNDERING","CRIME"],"authors":["Timmy Shen","The Block"]}