{"summary":"dYdX’s perpetual contracts are now available for trading on Ethereum Layer-2 scaling solution StarkWare.\ndYdX said traders will benefit from zero gas costs and lower trading fees.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/95938\/dydx-perpetual-contracts-ethereum-layer-2-scaling-solution-starkware","publishDate":"2021-02-24T10:00:47","id":2565,"type":null,"title":"dYdX&#x27;s perpetual contracts are now available to trade via Ethereum scaling solution StarkWare","category":["DEX"],"content":["Decentralized derivatives exchange dYdX announced Wednesday that its perpetual contracts are now available for trading on Ethereum Layer-2 scaling solution StarkWare.","The Layer-2 solution is <a href=\"https:\/\/dydx.exchange\/blog\/alpha\" data-v-f87c67ca=\"\">currently available in closed alpha<\/a> with limited deposits. The full public launch is expected \"in a few weeks,\" said dYdX.","dYdX <a href=\"https:\/\/www.theblockcrypto.com\/linked\/75209\/dex-dydx-starkware-layer-2\" data-v-f87c67ca=\"\">first partnered with StarkWare last August<\/a> to bring Ethereum scaling for its flagship perpetual contracts offering. The goal was to increase transaction capacity, reduce trading fees for users, and improve other features.","Now that StarkWare's ZK Rollups-based scaling solution is live on dYdX, the exchange said its users can trade perpetual contracts with zero gas costs and lower trading fees.","The fees are maximum up to 0.150% of trading volumes, according to new <a href=\"https:\/\/help.dydx.exchange\/en\/articles\/4798040-perpetual-trade-fees\" data-v-f87c67ca=\"\">information available<\/a> on dYdX's website. These are in line with what centralized exchanges offer, said dYdX.","Besides lower fees, traders will also benefit from decreased minimum trade sizes, higher leverage of up to 25x, \"instant\" trade settlement, and faster price oracles, said dYdX. For the Alpha launch, dYdX is using Chainlink’s oracle network, and Chainlink has integrated with StarkWare.","Founded in 2017, a16z-backed dYdX is one of the largest decentralized exchanges in the market today. The exchange saw $932 million worth of margin\/spot volumes in January and a total of $1.5 billion (including derivatives volume).","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/dex-non-custodial\/dex-volume-monthly\/embed\" title=\"DEX Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","With the Layer-2 integration, dYdX has become the second major decentralized exchange to go live with an Ethereum scaling solution. Earlier this year, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/89907\/ethereum-layer-2-scaling-solution-optimism-preliminary-mainnet-january-15\" data-v-f87c67ca=\"\">Synthetix went live on Optimism's scaling solution<\/a> that uses optimistic rollups.","ZK and optimistic rollups are both Ethereum scaling solutions and have their pros and cons. ZK-Rollups use a cryptography technique called zero-knowledge proofs that runs computation off-chain and submits a validity proof to Ethereum. So, when a transaction takes place using ZK-Rollups, it goes through. With Optimistic Rollups, on the other hand, a transaction can be challenged, but the implementation of these rollups does not require code changes.","dYdX said it chose ZK-Rollups because StarkWare's solution was already in production when it partnered with the startup. Decentralized exchange DeversiFi, for instance, also uses StarkWare's scaling solution."],"hashtag":["ETHEREUM"]}