{"summary":"The price of one Bitcoin could exceed $1 million in the next decade, Ark said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/207571\/bitcoin-blockchains-wallets-and-smart-contracts-named-by-ark-as-2023-big-ideas","publishDate":"2023-02-01T11:07:02","id":2565,"type":null,"title":"Bitcoin, blockchains, wallets and smart contracts named by Ark as 2023 &#x27;big ideas&#x27;","category":["COMPANIES"],"content":["Bitcoin, digital wallets, public blockchains and smart contract networks accounted for four of the 14 \"big ideas\" for 2023 featured in a <a href=\"https:\/\/ark-invest.com\/big-ideas-2023\/\" data-v-f87c67ca=\"\">report<\/a> released on Jan. 31 by Ark Invest that also named themes including artificial intelligence, digital consumers, precision therapies and molecular diagnostics.&nbsp; &nbsp;","\"We do believe that most investors are short innovation in their portfolios,\" Ark founder and CEO Cathie Wood said in a <a href=\"https:\/\/twitter.com\/ARKInvest\/status\/1620783916826365952\" data-v-f87c67ca=\"\">video<\/a> posted on Twitter Wednesday. \"They think they might be exposed to innovation through growth indices, but they are not.\"","Bitcoin was the only cryptocurrency in the report to get its own section, with Ark saying that the long-term opportunity for the token is only strengthening. The price of one Bitcoin could exceed $1 million in the next decade, Ark said, noting institutional interest from BlackRock, BNY Mellon, Eaglebrook Advisors and Fidelity.","\"Despite a turbulent year, Bitcoin has not skipped a beat,\" Ark said. \"Contagion caused by centralized counterparties has elevated Bitcoin’s value propositions: decentralization, auditability, and transparency.\"&nbsp;","Ark also took an optimistic stance on public blockchains and smart contracts, which it said could see market values of $2o trillion and $5 trillion, respectively, during the next ten years.&nbsp;","\"As insolvencies mounted across crypto lending businesses like Celsius and Voyager, decentralized lending markets like Aave continued to operate as designed,\" Ark said. \"They processed deposits, withdrawals, originations, and liquidations without service interruption.\"","The report highlighted the number of transactions on Layer 2 networks Arbitrum and Optimism, which now match those on the base Ethereum layer. Smart contract networks could facilitate $450 billion in annual fees by 2030, Ark added.","Ark, meanwhile, expects the number of digital wallet users to increase by 8% yearly to reach 65% of the global population by 2030.","In a separate theme it called \"technological convergence,\" Ark said that cryptocurrency mining could support larger solar-battery installations, stating that \"incorporating bitcoin mining into solar storage systems can enhance the scaling and reliability of grids without increasing the levelized cost of electricity.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BlackRock","content":"ORGANIZATION"},{"type":"$5 trillion","content":"MONEY"},{"type":"8%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Eaglebrook Advisors","content":"ORGANIZATION"},{"type":"65%","content":"PERCENT"},{"type":"Jan. 31","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"BNY Mellon","content":"ORGANIZATION"},{"type":"Cathie Wood","content":"PERSON"},{"type":"$2o trillion","content":"MONEY"},{"type":"$1 million","content":"MONEY"},{"type":"$450 billion","content":"MONEY"},{"type":"2030","content":"DATE"},{"type":"Twitter Wednesday","content":"DATE"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["BITCOIN","ETHEREUM","MINING COMPANIES","SIDECHAINS","WALLET MAKERS"],"authors":["Nathan Crooks","The Block"]}