{"summary":"The FCA (equivalent to U.S. SEC) is not proposing to regulate what it calls ‘exchange tokens’, which include Bitcoin or Litecoin, or utility tokens in the majority of cases\nThe FCA does expect to regulate ‘security tokens’, by reference to existing capital markets legislation in England and Wales. In short, if a token looks like a security (e.g. it has share or debt like characteristics) it is likely to be caught and will be characterized as a ‘regulated activity’\nThe UK may end up enacting more stringent AML laws than the rest of Europe, which may drive firms to other jurisdictions with more light touch compliance regimes\nThe FCA has strongly hinted that it will ban the sale of crypto derivatives such as contracts for difference and futures to retail investors later this year","author":["Stephen D. Palley","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/21295\/crypto-and-law-a-view-from-the-other-side-of-the-atlantic","publishDate":"2019-05-01T15:57:12","id":2566,"type":null,"title":"Crypto and law – A view from the other side of the Atlantic","category":["Legal"],"content":["<em data-v-f87c67ca=\"\">The Block is delighted to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@stephendpalley<\/a>.) In the following interview, Palley dives into English law as it applies to cryptocurrencies and blockchain technology with Ed Chapman, an M&amp;A and transactional lawyer from the English firm of Royds Withy King. Palley asks the questions, to which Chapman replies.<\/em>","<strong data-v-f87c67ca=\"\">Introduction<\/strong>","We hear a lot about the application of U.S. securities (and other) laws to blockchain projects. I had the chance recently to spend the day with Ed Chapman, an M &amp; A and transactional lawyer from the English firm of Royds Withy King, who focuses his practice on crypto. I thought it would be interesting to get a solicitor’s view on the state of play in the U.K., and asked Ed over a cup of tea to give us a 1,000-foot view of English law and what to expect in the near future.&nbsp;","<strong data-v-f87c67ca=\"\">First, tell us a little bit about yourself.<\/strong>","I am a corporate lawyer at Royds Withy King based in Bath in the UK, specializing in M&amp;A and contractual matters in the technology and financial services sectors. I am currently on secondment at Anderson Kill (an Interleges network partner firm) in their New York office, and am working on a research project regarding use cases of blockchains and the regulatory landscape for cryptoassets.","<strong data-v-f87c67ca=\"\">How did you get into crypto \/ blockchain?<\/strong>","I was at a tech event in Bristol a couple of years ago and one of the presenters was Seamus Cushley, director of new ventures and blockchain at PwC in the UK. We started talking and, after explaining what I did for a living, he suggested that I retrain as distributed ledger technology would automate the majority of corporate transactions within the next 10 years. I researched the space and read a number of books and papers, including Satoshi Nakamoto’s original paper (<em data-v-f87c67ca=\"\">Bitcoin: a peer to peer electronic cash system)<\/em>, <em data-v-f87c67ca=\"\">Blockchain Revolution, The Bitcoin Standard <\/em>and<em data-v-f87c67ca=\"\"> Blockchain and the Law: The Rule of Code.<\/em> Distributed ledger technology has the potential to change both how our clients operate and how legal services are delivered. Code may not (yet) be law, but new use cases for blockchains are emerging on an almost daily basis and tokenization can revolutionize how shares are held and help bring corporate decision making into the 21<sup data-v-f87c67ca=\"\">st<\/sup> century.","<strong data-v-f87c67ca=\"\">Who are the main UK governmental bodies that regulate cryptoassets?<\/strong>","The three key regulatory authorities in the UK are:","The BoE, FCA and HMT together formed a Cryptoassets Taskforce early last year, and it issued its final report on distributed ledger technology in October 2018<a href=\"#_ftn1\" name=\"_ftnref1\" data-v-f87c67ca=\"\">[1]<\/a>. It concluded that ‘<em data-v-f87c67ca=\"\">while DLT is at an early stage of development, it has the potential to deliver significant benefits in financial services and other sectors in the future’.<\/em>","The FCA subsequently issued draft guidance on cryptoassets in January 2019, and their final policy statement should be released in the summer. Based on the draft the FCA is not proposing to regulate what it calls ‘exchange tokens’, which include Bitcoin or Litecoin, or utility tokens in the majority of cases.","However it does expect to regulate ‘security tokens’, by reference to existing capital markets legislation in England and Wales (in particular the Regulated Activities Order (contained in the Financial Services and Markets Act 2000). In short, if a token looks like a security (e.g. it has share or debt like characteristics) it is likely to be caught and will be characterized as a ‘regulated activity’. There is a general prohibition on carrying out regulated activities in England and Wales unless the relevant party is authorised by the FCA or is otherwise exempt (which includes law firms).","HM Revenue &amp; Customs (akin to the Internal Revenue Service in the US) have also stated that cryptoassets are liable to capital gains tax on disposal if a profit is made, and individuals will also be liable to pay income tax and national insurance on cryptoassets received from an employer as a non-cash payment or via mining.","<strong data-v-f87c67ca=\"\">Pros and cons of raising money via a token sale in the UK now \/ other considerations?<\/strong>","In light of the draft FCA guidance, a key question to be answered is whether a token is classed as a ‘security’. If it is not (and is instead seen as an ‘exchange’ or ‘utility’ token) then it is likely to fall outside the regulatory oversight of the FCA.","However, even if a token is not subject to FCA oversight, another key development that needs to be considered is the upcoming implementation of the EU 5<sup data-v-f87c67ca=\"\">th<\/sup> Anti-Money Laundering Directive (5MLD). 5MLD extends KYC \/ anti-money laundering (AML) checks to cryptoasset exchanges, which are defined as ‘providers engaged in exchange services between cryptoassets and fiat currencies’ (for example, Coinbase or Circle).","On April 15 HMT launched a consultation on the implementation of 5MLD<a href=\"#_ftn2\" name=\"_ftnref2\" data-v-f87c67ca=\"\">[2]<\/a>, and is seeking input on whether the scope of 5MLD should be extended so that customer due diligence (CDD) is needed for the following:","As it stands exchanges and token issuers have had little to no AML \/ CDD compliance requirements. Crypto to fiat exchanges will be required to comply with 5MLD, and it is possible that this regulatory burden may extend to token issuers. In such circumstances Identifying and verifying investors would become a key risk factor for issuers.","I expect 5MLD to be transposed into English and Welsh law regardless of the outcome of the ongoing Brexit negotiations, not least because the UK played a key role in its negotiation.","The UK may end up enacting more stringent AML laws than the rest of Europe, which may drive firms to other jurisdictions with more light touch compliance regimes. Another possibility is that a more robust regulatory regime may engender confidence in the UK as a place to deal with cryptoassets (as is the case with existing public offerings). Time will tell.","<strong data-v-f87c67ca=\"\">Where do you see the space evolving in the next 3-5 years?<\/strong>","Where there is regulation enforcement action, sanctions and litigation will follow. I expect the FCA to take the lead here and establishing its regulatory perimeter should lead to greater certainty and will hopefully maintain the UK’s position as one of the leading cryptoasset jurisdictions.","While the upcoming FCA guidance will help provide much needed clarity I expect litigation to follow around the classification of tokens as the market develops. In particular there is a grey area between utility tokens and security tokens and consumers may be prejudiced by a token not being classed as a security.","I see security token offerings (STOs) becoming part of the investment landscape and, in certain circumstances, they offer an innovative method of fundraising. It may also be seen as a badge of honor to launch a STO that is FCA compliant. However investors should carefully consider the viability of the company itself. A company with little underlying value or potential does not suddenly become a good prospect merely by pursuing a STO.","The FCA has also strongly hinted that it will ban the sale of crypto derivatives such as contracts for difference and futures to retail investors later this year, on the basis they carry a high risk of loss.","I also expect to see the continued development of permissioned enterprise blockchains, and anticipate such platforms will be integrated into existing architecture to the extent that end users are unaware they are interacting with a blockchain (much in the same way people use web browsers without any awareness or knowledge of HTML).","<a href=\"#_ftnref1\" name=\"_ftn1\" data-v-f87c67ca=\"\">[1]<\/a> <a href=\"https:\/\/www.gov.uk\/government\/publications\/cryptoassets-taskforce\" data-v-f87c67ca=\"\">https:\/\/www.gov.uk\/government\/publications\/cryptoassets-taskforce<\/a>","<a href=\"#_ftnref2\" name=\"_ftn2\" data-v-f87c67ca=\"\">[2]<\/a> <a href=\"https:\/\/www.gov.uk\/government\/consultations\/transposition-of-the-fifth-money-laundering-directive\" data-v-f87c67ca=\"\">https:\/\/www.gov.uk\/government\/consultations\/transposition-of-the-fifth-money-laundering-directive<\/a>"],"hashtag":["SECURITY TOKENS"]}