{"summary":"Paxos attempted to lay rest to claims it had been asked to withdraw its application for a national trust bank charter from the OCC.\nRumors had been circulating yesterday that the stablecoin issuer and others were facing a crypto banking crackdown. ","author":["Lucy Harley-McKeown","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210001\/paxos-attempts-to-quash-speculation-of-trouble-with-the-occ","publishDate":"2023-02-09T05:22:19","id":2569,"type":null,"title":"Paxos attempts to quash speculation of trouble with the OCC","category":["Companies"],"content":["Stablecoin issuer Paxos attempted to clear up rumors of trouble with the U.S. Office of the Comptroller of the Currency (OCC) late Wednesday, insisting its application for a national trust bank charter remains in progress.&nbsp;","\"To clarify speculation: Paxos has not been asked to withdraw its application for a national trust bank charter from the OCC, nor has it been denied the charter,\" the company <a href=\"https:\/\/twitter.com\/PaxosGlobal\/status\/1623457250823258112\" data-v-f87c67ca=\"\">wrote on Twitter<\/a>. \"Paxos continues to work constructively with the OCC.\"","Speculation had <a href=\"https:\/\/twitter.com\/leomschwartz\/status\/1623344461261438976\" data-v-f87c67ca=\"\">swirled<\/a> in the press and on <a href=\"https:\/\/twitter.com\/nic__carter\/status\/1622973966360133634\" data-v-f87c67ca=\"\">Twitter<\/a> earlier that day that Paxos and other crypto firms are staring down the barrel of a crypto banking crackdown. Fortune reported that the status of Protego's application is also uncertain.","The company received <a href=\"https:\/\/www.theblock.co\/post\/102711\/paxos-occ-national-trust-bitlicense-charter\" data-v-f87c67ca=\"\">conditional approval<\/a> from the OCC in April 2021, giving it the green light to split its operations between two entities: one regulated on a national level and one maintaining its current regulatory structure.","At the time, it was given 18 months to execute its business plan, however that deadline has passed. The nod meant&nbsp;freedom to custody dollars and crypto alike, offer its stablecoin services across the country and run an exchange on the national level if it so chooses.","The OCC did not immediately respond to a request for comment.&nbsp;"],"hashtag":["USDP"]}