{"summary":"The SEC sued Kraken parent firms, Payward and Payward Ventures, for allegedly operating as an unregistered online trading platform.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/263898\/sec-files-new-lawsuit-against-kraken-for-allegedly-operating-online-trading-platform-without-registering","publishDate":"2023-11-20T17:46:11","id":2569,"type":null,"title":"SEC files new lawsuit against Kraken for allegedly operating online trading platform without registering","category":["COMPANIES"],"content":["The U.S. Securities and Exchange Commission on Monday sued crypto exchange Kraken over alleged securities laws violations.&nbsp;","\"<span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">Without registering with the <\/span><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">SEC in any capacity, Kraken has simultaneously acted as a broker, dealer, exchange <\/span><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">and clearing agency with respect to these crypto asset securities. In doing so, Kraken <\/span><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">has created risk for investors and taken in billions of dollars in fees and trading <\/span><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">revenue from investors without adhering to or even recognizing the requirements of <\/span><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">the U.S. securities laws that are designed to protect investors,\" the SEC wrote in a court filing in the U.S. District Court for the Northern District of California.&nbsp;<\/span>","The suit further alleges that Kraken's business practices, internal controls and record keeping presented investors additional risks \"t<span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">hat would also be prohibited for <\/span><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">any properly registered securities intermediary.\"<\/span>","\"<span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">In failing to prevent known conflicts of interest and commingling its <\/span><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">investors’ assets with its own, Kraken demonstrates why registration and the investor <\/span><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">protections that come with regulatory oversight are critical to the soundness of the <\/span><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">United States capital markets,\" the SEC said.&nbsp;<\/span>","\"Kraken has at times held customer crypto assets valued at more than $33 billion, but it has commingled these crypto assets with its own, creating what its independent auditor had identified in its audit plan as \"a significant risk of loss\" to its customers. \"Similarly, Kraken has held at times more than $5 billion worth of its customers’ cash, and it also commingles some of its customers’ cash with some of its own,\" the SEC also said, alleging the exchange at times paid operational expenses directly from bank accounts that held customer cash.","The SEC said it's seeking a judgement permanently enjoining the defendants from violating securities laws and ordering the disgorgement of ill-gotten gains. It also wants to stop the exchange from acting as an unregistered exchange, broker, dealer or clearing agency.","Kraken did not immediately respond to a request for comment from The Block.&nbsp;","The SEC <a class=\"c-link\" href=\"https:\/\/www.sec.gov\/litigation\/litreleases\/lr-25637\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.sec.gov\/litigation\/litreleases\/lr-25637\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">sued<\/a> Kraken’s parent firms Payward Ventures and Payward Trading in February of this year for \"failing to register the offer and sale of their crypto asset staking-as-a-service program.\"","Kraken’s parent entities agreed to stop the crypto staking-as-a-service program and pay $30 million in “disgorgement, prejudgment interest and civil penalties.\"","\"When investors provide tokens to staking-as-a-service providers, they lose control of those tokens and take on risks associated with those platforms, with very little protection,\" the SEC added in the February suit. \"The complaint alleges that Kraken touts that its staking investment program offers an easy-to-use platform and benefits that derive from Kraken's efforts on behalf of investors, including Kraken's strategies to obtain regular investment returns and payouts.\"","(<em data-v-f87c67ca=\"\">Updates with details throughout.<\/em>)","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"billions of dollars","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$5 billion","content":"MONEY"},{"type":"the Northern District of California","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"$30 million","content":"MONEY"},{"type":"$33 billion","content":"MONEY"},{"type":"Payward Ventures","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Payward Trading","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"}],"hashtag":["KRAKEN","LAWSUITS","SEC"],"authors":["MK Manoylov","The Block"]}