{"summary":"The Bank of Lithuania is set to issue LBCOIN on July 23\nLBCOIN is a blockchain-based digital collector coin built on NEM blockchain\nTo be sure, it is not a central bank digital currency","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/71139\/lithuanias-central-bank-is-releasing-lbcoin-%E2%81%A0-its-blockchain-based-digital-collector-coin","publishDate":"2020-07-10T06:25:45","id":257,"type":null,"title":"Lithuania&#x27;s central bank is releasing LBCOIN ⁠— its blockchain-based digital collector coin","category":["Layer 1s"],"content":["The Bank of Lithuania, the country’s central bank, is set to issue LBCOIN ⁠— its blockchain-based digital collector coin — on July 23.","LBCOIN <a href=\"https:\/\/www.lb.lt\/en\/news\/final-step-before-lbcoin-purchase-launch-of-the-e-shop-registration-now-open\" data-v-f87c67ca=\"\">consists of<\/a> six digital tokens and one physical silver collector coin, meaning users who purchase LBCOIN would first receive a set of six digital tokens, which can then be exchanged for a physical silver collector coin.","Each digital token features one of 20 signatories of Lithuania's Act of Independence, and the physical silver collector coin resembles a credit card, with a denomination of €19.18 — the year when the Act was signed by 20 signatories (priests, presidents, diplomats, industrialists, academics and municipal servants).","The Bank of Lithuania will issue a total of 4,000 LBCOINs, i.e. 24,000 digital tokens and 4,000 physical collector coins. One <a href=\"https:\/\/lbcoin.lb.lt\/fizine-kolekcine-moneta\" data-v-f87c67ca=\"\">LBCOIN<\/a> is priced at 99 euros (~$110).<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","LBCOIN is built on the NEM public blockchain, and once purchased, it can be stored in a NEM wallet or a dedicated wallet on the LBCOIN’s online shop. LBCOIN can also be sent as a gift or swapped with other purchasers.&nbsp;","Notably, it is not a legal tender and is intended just for collection, <a href=\"https:\/\/lbcoin.lb.lt\/fk004\" data-v-f87c67ca=\"\">said<\/a> the central bank.&nbsp;","The whole LBCOIN project will <a href=\"https:\/\/lbcoin.lb.lt\/fk004\" data-v-f87c67ca=\"\">get closed<\/a> in the next 30 months, meaning no digital tokens will be issued and no physical silver coins can get redeemed thereafter.","“Therefore, by that time, collectors have to exchange their digital tokens into a physical collector coin, send them as a gift or transfer to the NEM public network, where they can be stored for an unlimited time,” said the central bank.","The project had been under development since 2018, with several external partners, including European tech firms iTree Lietuva, Super How, and UAB Cryptodus.","The Bank of Lithuania also operates a blockchain-based sandbox called <a href=\"https:\/\/www.lb.lt\/en\/lbchain\" data-v-f87c67ca=\"\">LBChain<\/a> to help fintech startups carry out blockchain research, develop their blockchain-based services, and test them in financial institutions."],"hashtag":[]}