{"summary":"Coinbase Custody and Bison Trails have partnered to let clients stake Polkadot’s DOT tokens\nBison Trails founder and CEO Joe Lallouz told The Block that integration with Coinbase Custody will make it “incredibly easy” for clients to participate in securing Polkadot and earn staking rewards","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/61756\/coinbase-custody-to-let-its-clients-stake-polkadots-dot-tokens-via-bison-trails","publishDate":"2020-04-14T09:00:30","id":2570,"type":null,"title":"Coinbase Custody to let its clients stake Polkadot’s DOT tokens via Bison Trails","category":["Custody"],"content":["Coinbase Custody and blockchain infrastructure provider Bison Trails have partnered to let clients stake Polkadot’s DOT tokens when the protocol launches.","Announcing the news on Tuesday, Bison Trails said Coinbase Custody clients would be able to delegate DOT tokens to its validators to earn staking rewards. Coinbase Custody <a href=\"https:\/\/www.theblockcrypto.com\/linked\/55393\/coinbase-custody-adds-support-for-polkadots-dot-token\" data-v-f87c67ca=\"\">added support<\/a> for DOT tokens in February.","An integration with Coinbase Custody will make it “incredibly easy” for clients to participate in securing Polkadot and earn staking rewards, Bison Trails founder and CEO Joe Lallouz told The Block.","“Mutual customers that run their own validator(s) through Bison Trails will see their Bison Trails infrastructure in Coinbase Custody’s product and will be able to delegate by selecting it from a drop-down within Coinbase Custody. And all other Coinbase Custody customers will see Bison Trails’ community nodes as options to delegate to,” Lallouz explained.","Coinbase Custody currently supports the staking of Tezos (XTZ) token and is the largest operator of a Tezos staking validator. It is staking over 65 million XTZ as of March 30, 2020, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/60916\/coinbase-custody-is-the-biggest-tezos-staking-service-despite-charging-higher-fees\" data-v-f87c67ca=\"\">as The Block reported<\/a> earlier this month.","“Staking is an increasingly important element of the crypto ecosystem. It provides Coinbase Custody clients, many of whom have obligations to their investors, with a crypto-native way to participate in network rewards while also contributing to the security and governance of the ecosystem,” said Sam McIngvale, CEO of Coinbase Custody. “Working with partners like Bison Trails allows us to offer our clients an easy way to participate in Proof of Stake networks like Polkadot (DOT) at launch.”","The Polkadot project, led by Ethereum co-founder Gavin Wood, is expected to launch sometime this year. The project has been into development for a couple of years, after raising $145 million via a token sale in October 2017. Last year, Polkadot <a href=\"https:\/\/www.theblockcrypto.com\/daily\/26540\/polkadots-sale-of-500000-tokens-closes-successfully-foundation-says-in-nod-of-confidence-to-1-2b-valuation\" data-v-f87c67ca=\"\">closed<\/a> another private sale of tokens, without disclosing the sale’s proceeds. It was seeking to raise $60 million.","While the specific dates of Polkadot’s launch remain unknown, earlier this week, Wood <a href=\"https:\/\/polkadot.network\/polkadot-launch-announcement-covid-19-considerations\/\" data-v-f87c67ca=\"\">said:<\/a> “We will continue to push forward with the immediate task of launching the decentralized Polkadot network” amid the coronavirus pandemic.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBison Trails said it will support more protocols \"in the near future.\""],"hashtag":["COINBASE","STAKING"]}