{"summary":"Anthony Albanese is joining a16z’s crypto venture in mid-November to lead regulatory outreach efforts.\nAlbanese, who oversaw regulation at the NYSE, will also advise a16z’s crypto portfolio projects on strategy.","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/82565\/nyses-regulation-chief-joins-a16z-to-advise-on-crypto","publishDate":"2020-10-28T09:18:58","id":2571,"type":null,"title":"NYSE&#x27;s regulation chief joins a16z to advise on crypto","category":["Capital Markets"],"content":["Anthony Albanese, the chief regulatory officer at the New York Stock Exchange, is joining Andreessen Horowitz's crypto venture.","In a blog post <a href=\"https:\/\/a16z.com\/2020\/10\/28\/anthony-albanese-from-the-nyse-to-crypto\/\" data-v-f87c67ca=\"\">published<\/a> on Wednesday, Katie Haun, a general partner at Andreessen Horowitz (a16z), said Albanese will lead regulatory outreach efforts at the crypto venture and advise its portfolio projects on issues such as strategy, hiring and more.","\"He’ll work alongside our fantastic crypto policy counsel, Jeff Amico, who recently joined us from Cravath Swaine &amp; Moore and served as general counsel at Airswap,\" Haun added in the post.","According to the <a href=\"https:\/\/www.wsj.com\/articles\/nyses-top-markets-cop-to-take-cryptocurrency-job-at-andreessen-horowitz-11603886426\" data-v-f87c67ca=\"\">Wall Street Journal<\/a>, Albanese will join a16z in mid-November as its new chief regulatory officer.","Albanese has been serving as the chief regulatory officer at the NYSE since 2016, working with regulatory bodies at state, federal and international levels.","Before joining the NYSE, he also worked at the New York State Department of Financial Services and practiced law for over a decade with a specialty in securities litigation.","\"Very few people can successfully transition from the government to an institution like the NYSE to the crypto sector,\" Haun wrote. \"You need someone with the gravitas to engage with regulators around the world but who can hang with crypto natives and dev teams developing the world’s next great technology.\"&nbsp;","Earlier this year, a16z <a href=\"https:\/\/www.theblockcrypto.com\/linked\/63555\/a16z-raises-515-million-for-its-second-crypto-fund\" data-v-f87c67ca=\"\">announced<\/a> its second crypto fund that was worth $515 million, which is co-led by Haun. The fund aims to invest in blockchain startups with a focus on payments, decentralized finance and Web3."],"hashtag":[]}