{"summary":"Bankruptcy documents reveal new details about the financial relationship between Three Arrows Capital (3AC) and Blockchain.com.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/158533\/3ac-borrowed-and-repaid-more-than-2-billion-from-blockchain-com-before-outstanding-debt","publishDate":"2022-07-19T17:32:25","id":2571,"type":null,"title":"3AC borrowed and repaid more than $2 billion from Blockchain.com before outstanding debt","category":["COMPANIES"],"content":["Three Arrows Capital (3AC) borrowed and repaid more than $2 billion from crypto services firm Blockchain.com over the span of almost four years before its bankruptcy, documents seen by The Block show.","The details appear in an affidavit submitted by Blockchain.com’s Chief Strategy Officer Charles McGarraugh. The affidavit is part of <a href=\"https:\/\/www.theblock.co\/post\/158169\/three-arrows-capital-3ac-creditors-list-3-5-billion-crypto-affidavits\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">a 1,157-page legal document<\/a> uploaded Monday by Teneo, the firm appointed last month by a court in the British Virgin Islands to oversee 3AC's liquidation. The document — which was separately obtained by The Block — was later removed from the 3AC creditors' site.","Blockchain.com’s CEO Peter Smith previously said in a shareholder letter that 3AC had borrowed and repaid more than $700 million in crypto over that four-year period, according to <a href=\"https:\/\/www.coindesk.com\/business\/2022\/07\/08\/crypto-exchange-blockchaincom-faces-250m-hit-on-loans-to-three-arrows-capital\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">a report from CoinDesk<\/a>. As it turns out, the $700 million describes the largest amount of loans 3AC had out at any single time, whereas the $2 billion in crypto and fiat currency reflects the total amount.","“Blockchain.com was right to be deeply concerned about Three Arrows Capital months ago,” a Blockchain.com spokesperson told The Block. \"Three Arrows Capital defrauded not only Blockchain.com, but the entire crypto industry. We intend to hold them accountable to the fullest extent of the law.”","The affidavit shows that Blockchain.com and 3AC signed a master loan agreement (MLA) effective June 13, 2019. Blockchain.com sent 3AC a demand notice for its outstanding loans on June 14, and 3AC defaulted on its payments after failing to meet a June 16 deadline.","Blockchain.com did not disclose the total amount 3AC still owes in the affidavit, but CoinDesk reported on July 8 that the company was facing losses of $270 million due to its 3AC lending. According to the affidavit, 3AC's debt is mainly made up of “open loans” that do not have a maturity date under the agreement.","In the affidavit, McGarraugh raised doubts about the accuracy of 3AC’s disclosed net asset value (NAV) prior to defaulting on its loan payments. According to the companies’ loan agreement, 3AC had to provide reports showing this metric each month.","The last NAV report 3AC provided to Blockchain.com was a supplemental statement on May 13 showing a NAV of $2.387 billion. The disclosure followed a May 12 call where a Blockchain.com representative \"expressed concern\" to 3AC founder Kyle Davies about the hedge fund’s Luna position, as the token collapsed that day.","“For the reasons set out below, I am now doubtful that this NAV statement was accurate,” McGarraugh wrote, documenting further communications between Blockchain.com and 3AC in the following weeks.","According to the affidavit, 3AC asked Blockchain.com to continue the open loans it had with the company, and \"refrain from calling them or demanding repayment.\" According to the information in the document, Davies told a representative that 3AC \"would boycott Blockchain.com’s business if Blockchain.com recalled any loans.\"","On May 21, McGarraugh had a call with Davies regarding 3AC's financial status. He said Davies told him the hedge fund had lost about $200 million on Luna, and that was already accounted for in the company's disclosed NAV.","“Relying on Mr. Davies’ representations on this call, I calculated that 3AC had only (1) USD $1.5 billion of directional exposure and (2) USD $2 billion borrowed, so that even in a highly adverse scenario, if the markets dropped 33% and all of their borrowing based trades went against them by 20%, they would still only experience roughly USD $900 million in losses,” the affidavit said. “Against a NAV of USD $2.3 billion, even if some of their NAV was illiquid, they should have had no trouble closing out and paying Blockchain.com and their other creditors on demand (since all our loans could be called on demand).”","McGarraugh also wrote in the affidavit that 3AC was required to notify Blockchain.com if its leverage exceeded 1.5x or had trading losses equal to or above 4% of its equity.","“I believe that 3AC has violated these covenants,” he wrote.","The affidavit mentions that while 3AC had made partial loan repayments to Blockchain.com, the unpaid amounts are \"substantial.\"","An inquiry to 3AC's legal team was not returned by press time.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$2.3 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"McGarraugh","content":"PERSON"},{"type":"4%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"British Virgin Islands","content":"LOCATION"},{"type":"$700 million","content":"MONEY"},{"type":"$200 million","content":"MONEY"},{"type":"May 21","content":"DATE"},{"type":"$2 billion","content":"MONEY"},{"type":"May 13","content":"DATE"},{"type":"$900 million","content":"MONEY"},{"type":"July 8","content":"DATE"},{"type":"Kyle Davies","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"MLA","content":"ORGANIZATION"},{"type":"NAV","content":"ORGANIZATION"},{"type":"Charles McGarraugh","content":"PERSON"},{"type":"33%","content":"PERCENT"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"June 13, 2019","content":"DATE"},{"type":"$1.5 billion","content":"MONEY"},{"type":"$2.387 billion","content":"MONEY"},{"type":"Luna","content":"ORGANIZATION"},{"type":"Teneo","content":"ORGANIZATION"},{"type":"Peter Smith","content":"PERSON"},{"type":"$270 million","content":"MONEY"},{"type":"June 14","content":"DATE"},{"type":"Davies","content":"PERSON"},{"type":"June 16","content":"DATE"},{"type":"May 12","content":"DATE"}],"hashtag":[],"authors":["Kristin Majcher","Ryan Weeks","The Block"]}