{"summary":"Compass Mining has launched a new service that lets retail miners mine bitcoin (BTC) within their own homes.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/118143\/compass-mining-launches-at-home-bitcoin-mining-service","publishDate":"2021-09-21T08:00:35","id":2572,"type":null,"title":"Compass Mining launches &#x27;at-home&#x27; bitcoin mining service","category":["MINING"],"content":["Compass Mining, a bitcoin mining hardware marketplace and hosting services provider, has launched a new service that lets retail miners mine bitcoin at their homes.","The service includes delivering bitcoin mining machines at customers' homes, helping connect those machines with the F2Pool mining pool, and providing any other support services, Compass Mining CEO Whitney Gibbs told The Block.","\"We've received a considerable amount of requests for bitcoin mining ASICs from people who want to start mining at home,\" said Gibbs. \"There is also an industry-wide rackspace shortage, so many people are choosing to figure out a home setup rather than waiting for capacity to be available in Q4 2021 or Q1 2022.\"","Compass Mining is offering <a href=\"https:\/\/compassmining.io\/hardware\" data-v-f87c67ca=\"\">three models<\/a> of new bitcoin machines for the at-home service. These include the Whatsminer M31S+ model with 78 TH\/s hashrate at $8,100, the Whatsminer M30S model with 88 TH\/s hashrate at $9,750, and the Antminer S19 model with 95 TH\/s hashrate at $10400. The delivery date is within two to three weeks of purchase.","Currently, the service is only available in the U.S.&nbsp; Gibbs said Compass Mining plans to expand it to Canada and Europe later this year.","When asked why one would purchase mining equipment from Compass rather than directly from their manufacturers Bitmain or MicroBT, Gibbs said the overall service and support are the main benefits. Compass also offers discounted pool fees, he said, adding that F2Pool usually charges 2.5% fees, but through Compass, the fees are lower at 1.2%.","Further, mining manufacturers often fulfill large orders, but through Compass, even a single machine can be purchased, said Gibbs.","When asked if bitcoin mining at home can be profitable in the current market, Gibbs said, \"economics certainly change, considering home miners are paying ~$0.105\/kWh, on average.\"","But it is \"certainly viable\" because mining is still in the midst of one of its most profitable periods and with the increased efficiency of new generation machines, he added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$8,100","content":"MONEY"},{"type":"Canada","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Whitney Gibbs","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Compass Mining","content":"ORGANIZATION"},{"type":"Gibbs","content":"PERSON"},{"type":"$10400","content":"MONEY"},{"type":"2.5%","content":"PERCENT"},{"type":"1.2%","content":"PERCENT"},{"type":"Europe","content":"LOCATION"},{"type":"$9,750","content":"MONEY"},{"type":"$0.105\/kWh","content":"MONEY"}],"hashtag":["BITCOIN"],"authors":["Yogita Khatri","The Block"]}