{"summary":"Starknet’s native token STRK is set to launch today and begin trading on centralized exchanges following the opening of airdrop claims.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278166\/starknet-token-strk","publishDate":"2024-02-20T06:19:37","id":2574,"type":null,"title":"Starknet token to begin trading on exchanges today","category":["CRYPTO ECOSYSTEMS"],"content":["Starknet’s native token STRK is set to begin trading on centralized exchanges later today following the opening of distribution claims for nearly 1.3 million wallets.","Trading will begin on centralized exchanges, including Binance, Bybit, Bitfinex and OKX, once liquidity requirements have been met. Binance <a href=\"https:\/\/www.binance.com\/en\/support\/announcement\/binance-will-list-starknet-strk-with-seed-tag-applied-cb15311b17c440d0b0cf077a9b9979a3\" data-v-f87c67ca=\"\">confirmed<\/a> it will open trading for select pairs at 8 a.m. ET.","Starknet is an Ethereum Layer-2 network that leverages a ZK-Rollup solution for scaling decentralized applications. The token will help decentralize and govern the network, according to the token <a href=\"https:\/\/www.theblock.co\/post\/277379\/starknet-strk-token-distribution-plan\" data-v-f87c67ca=\"\">provisions<\/a> plan by Starknet Foundation last week.","“The STRK token was born so that STARK-based scaling can happen in a more decentralized way. The token design helps Starknet to be run and managed by the community,” Diego Oliva, CEO of the Starknet Foundation, said at the time.","Trading will follow the opening of airdrop claims for Starknet’s token from 7 a.m. ET. The distribution involves 728 million STRK — or 7.28% of the 10 billion total supply. Some 1.297 million wallets are eligible, taken from a November snapshot looking at the volume of transactions and interactions on the network.","Early users of Starknet and StarkEx, Ethereum contributors — including members of the Protocol Guild, EIP authors and solo stakers — and open-source developers from outside web3 are all eligible to receive the STRK token. They have until June 20 to make a claim.","Although STRK tokens are not yet live, pre-launch pricing on the decentralized derivatives exchange <a href=\"https:\/\/app.aevo.xyz\/perpetual\/strk\" data-v-f87c67ca=\"\">Aevo<\/a> is currently trading at $2.09, giving it a fully diluted market cap of $20.9 billion.","The distribution plan, particularly the upcoming unlock event, has faced <a href=\"https:\/\/www.theblock.co\/post\/277491\/core-contributors-investors-to-unlock-1-3-billion-of-starknet-tokens-just-two-months-after-it-becomes-tradable\" data-v-f87c67ca=\"\">criticism<\/a> from detractors.","Starkware’s core contributors and investors are set to receive over 1.31 billion STRK, or 13.1% of the total supply, in a significant unlock occurring less than two months after the token’s launch, which was criticized.&nbsp;","“It’s predatory to unlock such a large portion of investor tokens in such a short amount of time after real launch by masking it with a fake token generation event 2 years ago,” the founder of Endless Clouds, known pseudonymously as Loopify, commented while speaking with The Block last week.","The inaugural token generation event (TGE) took place in November 2022. Upon its creation, the token was designated for governance purposes, yet it was restricted from being moved or traded. Despite the principal token generation event occurring in 2022, there was likely a widespread misassumption about the unlock schedule, resulting in criticism.","The token allocations for core contributors and investors were initially scheduled to be unlocked after a one-year cliff in November 2023, subsequent to the TGE in 2022.","This timeline was <a href=\"https:\/\/www.theblock.co\/post\/254142\/ethereum-starkware-token-unlocks-delay\" data-v-f87c67ca=\"\">extended by five months<\/a> to April 15 due to the token not being ready, resulting in a significantly reduced interval between when traders can purchase the tokens and when investors can sell their discounted tokens on the open market.","Another backlash arose as numerous Starknet users found themselves excluded from the provisions due to the requirement of holding 0.005 ETH at the time of the November snapshot. Despite the backlash, Starkware is adhering to its plan.","“The 1.3 million recipients will get tokens that are liquid upon receipt. Others who put effort and money into making Starknet possible will wait until April for the first third of their tokens unlocked, after which more will unlock monthly,” Starkware co-founder and CEO Eli Ben-Sasson said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"7 a.m. ET","content":"TIME"},{"type":"June 20","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Starkware","content":"ORGANIZATION"},{"type":"1.31 billion","content":"MONEY"},{"type":"Starknet Foundation","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Eli Ben","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"8 a.m. ET","content":"TIME"},{"type":"November 2022","content":"DATE"},{"type":"7.28%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"$20.9 billion","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"Diego Oliva","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"13.1%","content":"PERCENT"},{"type":"Protocol Guild","content":"ORGANIZATION"},{"type":"Sasson","content":"PERSON"},{"type":"Bybit","content":"LOCATION"},{"type":"Loopify","content":"LOCATION"},{"type":"April 15","content":"DATE"},{"type":"TGE","content":"ORGANIZATION"},{"type":"$2.09","content":"MONEY"}],"hashtag":["STARKNET"],"authors":["James Hunt","The Block"]}