{"summary":"Security researchers from Blockfence say they’ve uncovered a sophisticated scam responsible for a sum of $32 million stolen from over 42,000 victims. \nThe scammers create a token with misleading permissions, pump it with fake volume, rug the token once enough outside funds enter, then repeat the process. ","author":["Zack Abrams","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273676\/sophisticated-coin-scam-operation-has-stolen-32-million-since-april-blockfence","publishDate":"2024-01-21T20:43:11","id":2574,"type":null,"title":"Sophisticated coin scam operation has stolen $32 million since April: Blockfence","category":["Security"],"content":["A sophisticated, programmatic scam operation is behind more than 1,300 scam crypto tokens that have been created since April 2023, fleecing $32 million from over 42,000 victims, according to an analysis from security researchers at Blockfence.&nbsp;","The operation runs more or less automatically, creating a token that often resembles companies or projects that haven’t announced or launched a token yet. Then, fake volume is introduced to bait traders. If enough legitimate capital is drawn in, the scammers (assuming there are more than one) cash out the token, repeating the process over and over.&nbsp;","While the token’s contract seemingly passes several security measures, in reality the scam operators retain the ability to burn tokens holders at will, mint infinite tokens for the scammers (despite the tokens seemingly being locked), and fake the max supply of the token.","”It could be just one person organizing all of this because, as we have seen, many of the things seem to be done programmatically, like the creation of the token names seems to be lots of words mixed with AI. The deployment of the tokens…the creation of the liquidity pools, the locking of the LP tokens, the rug pull; most of them seem to be automatic,” said Pablo Sabbatella, one of the authors of the <a href=\"https:\/\/blockfence.io\/security\/32m-stolen-over-1300-fake-tokens-rugged\/\" data-v-f87c67ca=\"\">investigation<\/a>.","Sabbatella began looking into the scam after the scam operation launched a token named after his company, Blockfence, which was one of hundreds of scam coins created. However, the scammers seemingly limit their profit per token to 5-20 eth, helping them stay under the radar, according to Sabbatella.&nbsp;","“Now we are going to go a bit deeper in this operation and we are going to see what they’re doing on Binance Smart Chain, Arbitrum, and Base,” said Sabbatella.&nbsp;","How can crypto traders protect themselves for similar scams? Not trading sketchy tokens is the first step, says Sabbatella. “You already know you are exposing yourself to a high, high risk,” said Sabbatella. “I would never buy or invest in an asset I don’t understand.”","For traders willing to take the risk, though, Sabbatella advises using a variety of fraud detectors. “I recommend not just using one tool, but using two or three different tools and to get the results from all of them,” he said.&nbsp;"],"hashtag":["EXPLOITS"]}