{"summary":"Sources in Washington, D.C. say that the Celo Foundation’s seven-month experiment in government relations came to an abrupt end. ","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/180623\/celo-foundation-cuts-government-relations-team-amid-market-turmoil-exclusive","publishDate":"2022-10-27T15:55:04","id":2579,"type":null,"title":"Celo Foundation cuts government relations team amid market turmoil: Exclusive","category":["Policy"],"content":["The Celo Foundation has laid off its entire government relations team, The Block has learned.&nbsp;","According to four crypto industry sources in Washington, D.C., Celo axed its government relations and lobbying wing on Oct. 26.","Representatives for Celo confirmed that Chris Hayes, who had led the firm's government relations arm, no longer works for the firm but did not comment on broader layoffs.","\"Unfortunately, there are financial challenges in the industry and Celo has decided to pull back from their policy engagement,\" Hayes said in a text message.&nbsp;","The firm spent $106,000 on its lobbying program in the second quarter of this year, according to Senate <a href=\"https:\/\/lda.senate.gov\/filings\/public\/filing\/512a37e7-6436-4c4c-9958-02f5b96c461d\/print\/\" data-v-f87c67ca=\"\">disclosures<\/a>. The firm has yet to report its lobbying spending for the third quarter, although the reports were due last week. It did spend $50,000 on an outside lobbying contract with Cypress Advocacy.&nbsp;&nbsp;","The size of the team directly affected is unknown. Celo was involved in crypto policy in Europe but may have been working with outside contractors there.","Hayes spoke on Celo's behalf at Blockchain for Europe, a conference in Brussels this week, <a href=\"https:\/\/www.linkedin.com\/feed\/update\/urn:li:activity:6990980480825225216\/\" data-v-f87c67ca=\"\">according to his LinkedIn<\/a> account and was actually at the conference the day of the layoff. The <a href=\"https:\/\/www.theblock.co\/post\/144920\/crypto-stakeholders-dropped-more-than-4-million-on-dc-lobbying-in-q1-here-are-the-biggest-spenders\" data-v-f87c67ca=\"\">Celo Foundation hired Hayes<\/a> in March to set up the shop in Washington amid a broader government relations blitz from the crypto industry.&nbsp;","The tide of government relations and lobbying spending from the crypto industry, which surged during the fight over the infrastructure bill last year, appears to be receding more broadly.&nbsp;","<em data-v-f87c67ca=\"\">With additional reporting by Stephanie Murray<\/em>"],"hashtag":[]}