{"summary":"The Bank of Canada doesn’t see the need to issue digital currency right now, but it wants to be prepared\nThe central bank has identified two scenarios that could warrant the launch of its own retail digital currency","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/56987\/canadas-central-bank-issues-contingency-plan-for-retail-digital-currency","publishDate":"2020-02-26T04:20:39","id":2581,"type":null,"title":"Canada’s central bank issues contingency plan for retail digital currency","category":["Cryptocurrency"],"content":["The Bank of Canada has issued a contingency plan to prepare for scenarios that could warrant the launch of its own digital currency.","While the central bank does not see a “compelling” case to issue a Canadian digital dollar at this time, it <a href=\"https:\/\/www.bankofcanada.ca\/2020\/02\/contingency-planning-central-bank-digital-currency\/#8-Conclusion\" data-v-f87c67ca=\"\">wants to build<\/a> the capacity to launch retail, cash-like digital currency should the need for one ever arise.","“We need to move forward to work out what a potential CBDC [central bank digital currency] might look like and how it could be managed, if the decision were ever taken to issue one,” <a href=\"https:\/\/www.bankofcanada.ca\/wp-content\/uploads\/2020\/02\/remarks-250220.pdf\" data-v-f87c67ca=\"\">said<\/a> Timothy Lane, Deputy Governor of the Bank of Canada.","The central bank has identified two scenarios where it could decide to issue digital currency: firstly, if the use of physical cash is reduced or eliminated altogether, and second, if private cryptocurrencies were to make serious inroads.","“In both scenarios, there would be an argument for the Bank of Canada to step in,” said Lane. “The Bank would do this as a trusted public institution, creating an official digital currency that is designed with the interest of the public as its top priority, with no commercial motive.”","The second scenario, in particular, could pose an “unacceptable challenge” to Canada’s monetary sovereignty, said Lane, adding that one such threat is Facebook-led stablecoin project Libra.","“It’s tough to predict if Libra will ever live up to its promises or even come into existence. But it is a good example of a transformative technology that affects how the Bank needs to respond to the future of money,” said Lane.","Preparing in advance is, thus, “critical,” said the central bank, although it will take “several years” to build an actual prototype of digital currency.","For now, the Bank of Canada will consult with the “governments and key stakeholders in provinces and territories across Canada” to learn if they want a digital currency and how they want it, Lane said.","Overall, the central bank wants to undergo an extensive consultation process. Last month, the Bank of Canada also <a href=\"https:\/\/www.theblockcrypto.com\/post\/53545\/uks-central-bank-to-explore-digital-currency\" data-v-f87c67ca=\"\">formed a working group<\/a> with the central banks of England, Japan, the European Union, Sweden and Switzerland, as well as the Bank for International Settlements. “We will use this platform to share experiences as we assess potential cases for a CBDC in our home jurisdictions,” Lane concluded."],"hashtag":[]}