{"summary":"The luxury auction house Sotheby&#x27;s announced it will host the sale in late June with bidding starting at $1,000.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/108430\/sothebys-to-auction-the-world-wide-webs-original-code-as-an-nft","publishDate":"2021-06-15T08:43:01","id":2582,"type":null,"title":"Sotheby’s to auction the World Wide Web&#x27;s original code as an NFT","category":["NFTS"],"content":["<span data-v-f87c67ca=\"\">Sotheby’s is auctioning off a non-fungible token (NFT) of the original source code for the World Wide Web next month, the luxury auction house announced on Tuesday.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">NFTs are unique collectibles that represent digital files like audio, video and artifacts.<\/span> <span data-v-f87c67ca=\"\">The NFT for the code — which British computer scientist Sir Tim Berners-Lee developed in 1989 — will go on sale on June 23, with bidding starting at $1,000. This NFT is signed by Berners-Lee and contains his original time stamped files.<\/span>","<span data-v-f87c67ca=\"\">“Why an NFT? Well, it's a natural thing to do as when you're a computer scientist and when you write code and have been for many years. It feels right to digitally sign my autograph on a completely digital artefact,” he added.<\/span>","<span data-v-f87c67ca=\"\">The NFT has a few other elements: an animated visualization of the code, a letter Berners-Lee wrote about the code and his process of creating it, a digital “poster” of the entire code from the original files using Python, which also includes a graphic of his physical signature, and all of it is digitally signed.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The files referenced by the NFT contain about 9,555 lines of code, which include parts of the three languages and one protocol Berners-Lee invented: HTML (Hypertext Markup Language), HTTP (Hypertext Transfer Protocol), and URLs (Uniform Resource Identifiers).&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Three decades ago, I created something which, with the subsequent help of a huge number of collaborators across the world, has been a powerful tool for humanity,” said Berners-Lee in a statement. “NFTs, be they artworks or a digital artefact like this, are the latest playful creations in this realm, and the most appropriate means of ownership that exists. They are the ideal way to package the origins behind the web.”<\/span>","<span data-v-f87c67ca=\"\">All proceeds of the sale will go to initiatives that Berners-Lee and his wife support.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The sale marks Sotheby’s third auction involving NFTs. The auction house sold its <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/100683\/sothebys-nft-auction-pak-artist\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">first NFT<\/span><\/a><span data-v-f87c67ca=\"\"> by anonymous digital artist Pak in April, and its second NFT just last week, selling a rare CryptoPunk for nearly <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/108186\/rare-alien-cryptopunk-fetches-11-8-million-in-sothebys-auction\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$12 million<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<em data-v-f87c67ca=\"\">Image courtesy: Sotheby's<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lee","content":"PERSON"},{"type":"$12 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"1989","content":"DATE"},{"type":"$1,000","content":"MONEY"},{"type":"Three decades ago","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Tim Berners","content":"PERSON"},{"type":"Python","content":"PERSON"},{"type":"last week","content":"DATE"},{"type":"Berners","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"June 23","content":"DATE"}],"hashtag":[],"authors":["Saniya More","The Block"]}