{"summary":"City of Miami mayor Francis Suarez said that he&#x27;s still taking his paycheck in bitcoin despite the ongoing market volatility.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/190422\/miamis-mayor-says-hes-still-taking-paycheck-in-bitcoin","publishDate":"2022-11-29T11:28:10","id":2583,"type":null,"title":"Miami&#x27;s mayor says he&#x27;s still taking paycheck in bitcoin","category":["PEOPLE"],"content":["Miami Mayor Francis Suarez said that he's still taking his paycheck in bitcoin despite the ongoing market volatility.","\"I just bought some yesterday,\" he said at a press briefing after speaking at a conference.&nbsp;","Suarez, who leads the U.S. Conference of Mayors, first said just over a year ago that he’d become the first American politician to take his official salary in bitcoin, announcing the plan just days before the all-time high of $68,789. While the digital currency has declined about 76% since Suarez first announced the measure, he’s noted that his mayoral salary is not his only source of income as he also has jobs as a lawyer and with private equity.","Suarez, a Republican, has been one of the most vocal proponents of positioning Miami as a new center of tech, finance, and crypto, and he frequently refers to the city as the “capital of capital.” That enthusiasm has been criticized by some who have bemoaned rising housing prices and others who point to the volatility of digital asset price.","He struck an optimistic tone at a conference on Tuesday, telling a crowd that it was time to capture the moment and innovate in the wake of the high-profile collapse of the FTX crypto exchange.","\"Web3 and crypto is here to stay,\" he said to widespread applause at the MiamiWeb3 summit co-hosted by CTH Group and the City of Miami. \"Sometimes we just have to breathe, right? We have to remember that this technology is new. Not every iteration is going to succeed. Not every company is going to succeed.\"","Suarez called for proactive regulation that could protect people from fraudulent schemes but not hurt the development of the nascent industry.","\"If the leaders who now emerge from this winter come together and help lawmakers find the right regulatory benchmarks to make sure that this technology helps people, raises democratizing investment and wealth creation opportunities, and doesn't hurt people and rob them of their hard-earned savings,\" Suarez said, calling for a collaborative approach for regulation. \"There's a lot of learning that needs to happen.\"","The collapse of FTX has loomed large over the city, with many wondering how much of an impact it could have on the efforts to become a global leader in the sector. Miami-Dade County authorities were quick to say they would <a href=\"https:\/\/www.theblock.co\/post\/186209\/miami-to-yank-ftx-name-from-iconic-downtown-stadium\" data-v-f87c67ca=\"\">terminate<\/a> the business relationship with FTX and remove the company's name from the iconic downtown arena that's home to the NBA's Miami Heat.","Suarez said that the city had zero exposure to FTX and that its economy was sufficiently diversified to weather any downturn that might occur in a single industry.","The momentum doesn’t seem to have slowed, at least judging from the number of events being held in the city. Not even a week after FTX filed for bankruptcy protection, hundreds of developers, VC funders and CEOs descended across the city at two <a href=\"https:\/\/www.theblock.co\/post\/188282\/miamis-crypto-crowd-sees-silver-lining-around-dark-ftx-clouds\" data-v-f87c67ca=\"\">separate conferences<\/a> on. Nov. 17. And this week has been even busier, with multiple events hosted around the <a href=\"https:\/\/www.theblock.co\/post\/189245\/art-basel-doodleputt-pussy-riot-the-blocks-guide-for-the-crazy-web3-week-ahead-in-miami\" data-v-f87c67ca=\"\">Art Basel<\/a> art fair.&nbsp;","Julian Holguin, CEO of Doodles, an NFT company, said during a fireside chat with the mayor that his company was opening an office in the city, affirming Suarez's positioning of the city as the new major fintech hub.&nbsp;","\"My message is that it's still early. It's the second inning. Fintech is here to stay.\" Suarez said. \"Will they have ups and downs? Of course.\"","&nbsp;","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$68,789","content":"MONEY"},{"type":"Nov. 17","content":"DATE"},{"type":"NBA","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Miami","content":"LOCATION"},{"type":"76%","content":"PERCENT"},{"type":"Suarez","content":"PERSON"},{"type":"Dade County","content":"LOCATION"},{"type":"Basel","content":"LOCATION"},{"type":"U.S. Conference of Mayors","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Fintech","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Francis Suarez","content":"PERSON"},{"type":"CTH Group","content":"ORGANIZATION"},{"type":"this winter","content":"DATE"},{"type":"Julian Holguin","content":"PERSON"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}