{"summary":"AntPool said it will stop maintaining clients’ assets on Ethereum after the blockchain transitions to proof-of-stake. \nThe firm said it will cease maintenance of individual client assets mainly due to “risk of censorship.”\n","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/166115\/antpool-wont-maintain-client-assets-on-ethereum-after-the-merge-amid-risk-of-censorship","publishDate":"2022-08-27T10:26:34","id":2585,"type":null,"title":"AntPool won&#x27;t maintain client assets on Ethereum after The Merge amid &#x27;risk of censorship&#x27;","category":["Technology"],"content":["<span data-v-f87c67ca=\"\">AntPool, operated by mining giant Bitmain,<\/span><a href=\"https:\/\/www.antpool.com\/newsDetail\/395\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\"> that it will not maintain clients’ assets on Ethereum after the blockchain moves to proof-of-stake next month in The Merge. <\/span>","<span data-v-f87c67ca=\"\">The Merge will transition Ethereum from proof-of-work (PoW) consensus to proof-of-stake (PoS), which will remove the need for transactions to be verified by miners.&nbsp;<\/span>","AntPool is a mining pool on Ethereum where several users can plug in their computational resources and share processing power to mine rewards. Antpool pays users' mining rewards into their accounts.","<span data-v-f87c67ca=\"\">In a Saturday<\/span><a href=\"https:\/\/www.antpool.com\/newsDetail\/395\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">blog post<\/span><\/a><span data-v-f87c67ca=\"\">, the company said it won't be able to maintain clients’ assets on the Ethereum 2.0 network and revealed a plan to settle up with them before The Merge. <br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">After Ethereum's PoS upgrade, the firm will cease maintenance of individual client assets mainly because of the \"risk of censorship.\" This <\/span><span data-v-f87c67ca=\"\">stems from growing concerns that Ethereum validators may be coerced into engaging in censorship of transactions tied to US sanctions on Tornado Cash.<\/span>","<span data-v-f87c67ca=\"\">“As ETH2.0 (The Merge) comes along with the risk of censorship among different countries, ANTPOOL, for the sake of clients’ asset security, will not be able to maintain the user's ETH assets on the PoS chain,” it said.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">When Ethereum transitions to proof of stake, validators will be processing transactions on the network. However, validators are largely controlled by a few staking providers. For example, US-based providers including Lido Finance, Coinbase, Bitcoin Suisse, Kraken and staked.us control about<\/span><a href=\"https:\/\/dune.com\/hildobby\/ETH2-Deposits\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> 60%<\/span><\/a><span data-v-f87c67ca=\"\"> of the 416,000 validator nodes on the Ethereum network.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">If these staking providers agree to comply with the US sanctions, they can start filtering transactions associated with Tornado Cash on the base layer. Still, it remains to be seen if such censorship will happen as Ethereum transitions to PoS.<\/span>","<span data-v-f87c67ca=\"\">AntPool asked its clients to add their own private addresses to their accounts by September 3. The firm will then distribute the accumulated PoW mining payouts to the private addresses.<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, AntPool has also thrown its weight behind proof-of-work (PoW) blockchains, including Bitcoin and Ethereum Classic, which it says rely on “decentralized PoW consensus.” Earlier, AntPool had not only supported Ethereum Classic but also made a $10 million investment in its ecosystem. <\/span>"],"hashtag":["ETHEREUM"]}