{"summary":"A potential investor in troubled crypto exchange Zipmex has asked the company’s founder and group CEO to forfeit all his shares on closing of the investment, an email obtained by The Block shows.\nThe Block has also obtained separate correspondence in which Zipmex co-founder Akalarp Yimwilai offered to resign from his posts and forfeit all his shares on closing of an investment.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173338\/zipmex-potential-investor-asks-ceo-marcus-lim-to-forfeit-all-his-shares","publishDate":"2022-09-28T09:10:29","id":259,"type":null,"title":"Potential Zipmex investor asks CEO Marcus Lim to forfeit his shares","category":["Exchanges"],"content":["A potential investor in troubled South Asian crypto exchange Zipmex has asked the company's founder and group CEO Marcus Lim to forfeit all his shares, according to an email obtained by The Block.","The email sent Tuesday by Chalermchai Mahagitsiri via his representative asked Lim to forfeit 100% of his shares upon the closing of any potential investment. Last month, <a href=\"https:\/\/www.theblock.co\/post\/165937\/zipmex-in-advanced-rescue-talks-with-investment-firm-billionaires-son-source\" data-v-f87c67ca=\"\">The Block reported<\/a> that Mahagitsiri, son of Thai billionaire and coffee king Prayudh Mahagitsiri, is one of two parties in advanced investment talks with Zipmex.","\"We request the Zipmex Team to prepare a confirmation letter of your share forfeiture for you to sign and to take effect at closing,\" the email addressed to Lim reads. \"We look forward to moving on from this situation and receiving this confirmation letter.\"","Zipmex <a href=\"https:\/\/www.theblock.co\/post\/158672\/crypto-exchange-zipmex-halts-withdrawals-due-to-volatile-market-conditions\" data-v-f87c67ca=\"\">halted client withdrawals<\/a> in July due to its exposure to Babel Finance and Celsius, two beleaguered crypto lenders that froze customer funds in June. Zipmex has <a href=\"https:\/\/zipmex.com\/th\/en\/announcements\/official-statement-from-zipmex-210722\/\" data-v-f87c67ca=\"\">estimated<\/a> its total exposure to Babel and Celsius at $53 million and it is <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-07-25\/zipmex-aims-to-raise-at-least-50-million-to-mend-balance-sheet\" data-v-f87c67ca=\"\">reportedly<\/a> looking to raise about that much from investors.&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/163503\/zipmex-three-month-moratorium-extension\" data-v-f87c67ca=\"\">Zipmex has until Dec. 2<\/a> to sort out its financial problems, having received a three-month moratorium extension from the Singapore High Court in August.","“As my team and I continue to work towards bringing in new investments to make our customers whole, negotiations with various parties are entering a critical phase,\" Lim told The Block in emailed comments. \"As such, I am unable to comment on any details as there is a non-disclosure agreement (NDA) between parties and until they have been agreed upon by all stakeholders I cannot disclose more. I am however surprised any interaction (even if it occurred) was leaked given the NDA.”","Lim has also been a target of Zipmex's existing shareholders, who have been seeking his departure, according to a Bloomberg <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-08-15\/investors-in-crypto-exchange-zipmex-seek-ceo-lim-s-resignation\" data-v-f87c67ca=\"\">report<\/a> from last month. The report said at least one \"large\" Zipmex shareholder wrote to Lim asking him to resign, citing a loss of trust among partners and the firm's severe cash crunch.","A Zipmex spokesperson told The Block: “Zipmex is in talks with investors to raise capital as we have previously stated. Part of those conversations include discussion of structural changes to strengthen management.\"","It remains to be seen whether Lim agrees to forfeit his equity. Last month, he <a href=\"https:\/\/www.afr.com\/technology\/crypto-exchange-boss-refuses-to-resign-after-73m-loss-20220818-p5bb29\" data-v-f87c67ca=\"\">told<\/a> the Australian Financial Review he intends to stay on and work on a restructuring plan to make Zipmex's customers whole — unless the firm's new major shareholders tell him to resign.","\"This plan includes potentially bringing in new majority shareholders who may want a greater say in management decisions,\" Lim told the AFR at the time. \"Should this happen, my co-founder Akalarp [Yimwilai] and I have made it clear that we will fully cooperate with them and their wishes in the event they may be looking for a management change.\"","Indeed, The Block has also obtained a separate letter dated Aug. 14, in which Yimwilai, who is also the CEO of Zipmex's Thailand unit, offered to resign from his director and CEO posts and forfeit all his shares upon the closing of an investment or acquisition of Zipmex Asia. In that letter, written to Zipmex's board and shareholders, Yimwilai also expected Lim to \"make the same decisions.\"","Yimwilai did not respond to a request for comment by press time.","Zipmex Group operates five entities — Zipmex, Zipmex Asia, Zipmex Thailand, Zipmex Indonesia and Zipmex Australia — and all these entities sought creditor protection from the Singapore High Court.","<em data-v-f87c67ca=\"\">Update: Story updated to add comment from Zipmex.&nbsp;<\/em>"],"hashtag":[]}