{"summary":"Monday’s lawsuit marks the second time over the last few weeks that the SEC has been sued by the crypto industry.\nThe DeFi Education Fund and Beba are asking a Texas court to conclude that an airdrop of a $BEBA token is not a security and to hold the SEC to the Administrative Procedure Act. ","author":["Sarah Wynn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284508\/defi-education-fund-and-texas-apparel-company-beba-take-sec-to-court-over-regulating-by-enforcement-stance","publishDate":"2024-03-25T14:05:15","id":2592,"type":null,"title":"DeFi Education Fund and Texas apparel company Beba take SEC to court over &#x27;regulating by enforcement&#x27; stance","category":["Policy"],"content":["The DeFi Education Fund and apparel company Beba are suing the Securities and Exchange Commission, asking a Texas district court to declare that their $BEBA token airdrop is not a security and to enforce the Administrative Procedure Act on the SEC's rule-making process.","<span class=\"s1\" data-v-f87c67ca=\"\">In a complaint filed Monday in the U.S. District Court for the Western District of Texas, the two also asked the court to hold the SEC to the Administrative Procedure Act (APA). This law governs how federal agencies develop and issue rules.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The $BEBA token is an asset that can be redeemed for exclusive products from the Texas-based Beba's online store. The store plans to continue to distribute the token through an airdrop for free, according to the 61-page <a href=\"https:\/\/www.defieducationfund.org\/_files\/ugd\/84ba66_3f7a8f2ca6614d7381122cb1beeed4a8.pdf\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">complaint<\/span><\/a>.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">“The SEC’s unjust and ad-hoc enforcement campaign threatens businesses of all kinds, including companies like Beba who want to be able to use innovative technologies for legitimate business reasons,” said Miller Whitehouse-Levine, CEO of the DeFi Education Fund, in a <a href=\"https:\/\/www.businesswire.com\/news\/home\/20240324186160\/en\/Texas-Apparel-Company-and-Digital-Asset-Advocacy-Nonprofit-File-Suit-Against-the-SEC-for-Aggressive-and-Secretive-Enforcement-That-Threatens-Ability-to-Operate\" data-v-f87c67ca=\"\"><span class=\"s4\" data-v-f87c67ca=\"\">statement<\/span><\/a>. “Every single one of us in this industry, including the DeFi Education Fund, is harmed by their overreach. We are asking the court to put an end to the SEC’s arbitrary abuse of its authority.”<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC and the crypto industry have been at odds over how digital assets should be regulated. SEC Chair Gary Gensler has said most cryptocurrencies are securities and should be regulated similarly to other investments. The crypto industry says the agency has not issued rulemaking for crypto and has criticized the agency for taking a \"regulation by enforcement\" approach.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Monday's lawsuit marks the second time over the last few weeks that the crypto industry has sued the SEC. Digital asset company LEJILEX <a href=\"https:\/\/www.businesswire.com\/news\/home\/20240220458690\/en\/SEC%E2%80%99s-Unlawful-Targeting-of-Digital-Asset-Industry-Challenged-in-New-Lawsuit-From-Startup-LEJILEX-and-Crypto-Freedom-Alliance-of-Texas\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">sued<\/span><\/a> the SEC in February in a Texas court over the agency's \"unlawful targeting\" of the crypto industry. Last year, crypto exchange Coinbase also sued the SEC to <a href=\"https:\/\/www.theblock.co\/post\/281815\/coinbase-asks-appeals-court-to-direct-sec-to-begin-writing-rules-for-crypto\" data-v-f87c67ca=\"\">get<\/a> the agency to say yes or no to its rulemaking petition.&nbsp;<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">Beba's airdrops are not securities and BEBA tokens are not investment contracts, the DeFi Education Fund and Beba argue in the complaint. The SEC often invokes the Howey Test, based on a 1946 U.S. Supreme Court case frequently cited by the SEC, to determine if an asset qualifies as an investment contract and, therefore, a security.<\/span><span class=\"s3\" data-v-f87c67ca=\"\">&nbsp;The test says an asset has to have three components —&nbsp; an investment of money in a common enterprise with a reasonable expectation of profits to be derived from the efforts of others.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"But the BEBA token airdrops are free, there is no common enterprise between Beba and token recipients, and there is no reasonable expectation of profits based on the efforts of others,\" they said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Beba recently made its first airdrop and plans to do a second one. The BEBA token functions like airline miles, except it can also be freely traded. Token holders can also buy an exclusive line of duffel bags at a discounted price, they said in the complaint.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“Like any business owner, I’m always thinking about new and innovative ways to reach more customers, grow support for our products, and build more awareness of Beba’s mission,” said Nathan Hennigh, co-founder of Beba in a statement. “Unfortunately, my brother and I are operating in a state of constant uncertainty because of the SEC’s dangerous track record of haphazardly going after businesses that use digital assets just like our $BEBA token.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC also should have gotten input from the public when deciding that most digital assets are securities, the DeFi Education Fund and Beba said in the complaint.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The digital asset industry was forced to learn about this new policy through the SEC’s enforcement actions, which provided only nominal analysis concluding that transactions involving digital assets were securities transactions—or that the digital assets themselves were securities—and little explanation or legal analysis,\" they said. \"That behind closed-doors policymaking approach deprived the digital asset industry and the public of its right under the APA to receive notice of and provide comments on the SEC’s new policy.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC has 60 days to respond to the complaint. The agency did not immediately respond to the Block's request for comment.&nbsp;<\/span>"],"hashtag":["SEC"]}