{"summary":"At its core, Coinbase&#x27;s proposal looks a lot like an attempt to short-circuit the SEC&#x27;s authority in crypto.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/120674\/coinbase-unveils-lobbying-push-for-a-brand-new-us-regulator-focused-on-digital-assets","publishDate":"2021-10-14T14:06:31","id":2596,"type":null,"title":"Coinbase unveils lobbying push for a brand new US regulator focused on digital assets","category":["THE BLOCK"],"content":["Coinbase has put out a sweeping proposal for a new regulatory regime over digital assets in the United States.&nbsp;","Released on October 14, Coinbase's plan at its core proposes a drastic reconfiguration of U.S. financial regulation. Most notably, that includes establishing a brand new regulator with control over marketplaces for digital assets, which the firm has dubbed \"MDAs.\" The announcement says:&nbsp;","\"Ensuring consistent regulation and application of the laws requires a single regulator. Where new policy questions or challenges arise, the ability of a single dedicated regulatory body to respond in an efficient and timely manner benefits everyone.\"","“What we realized fundamentally is that there’s such differences in the technology underlying digital assets [...] It didn’t make sense to take a legacy regulator and somehow transform it,\" commented Coinbase Chief Policy Officer Faryar Shirzad during a press briefing with reporters.","Later in the day, Coinbase CEO Brian Armstrong penned an&nbsp;<a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/www.wsj.com\/articles\/new-approach-regulating-crypto-bitcoin-coinbase-armstrong-digital-asset-policy-proposal-11634226117\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.wsj.com\/articles\/new-approach-regulating-crypto-bitcoin-coinbase-armstrong-digital-asset-policy-proposal-11634226117\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">opinion piece<\/a>&nbsp;in the Wall Street Journal to accompany the announcement.","It's an ambitious proposal, and one that comes on the backdrop of major friction between <a href=\"https:\/\/www.theblockcrypto.com\/linked\/116888\/coinbase-sec-crypto-yield-product\" data-v-f87c67ca=\"\">Coinbase and the Securities and Exchange Commission<\/a>, particularly over its <a href=\"https:\/\/www.theblockcrypto.com\/post\/117140\/secs-handling-of-coinbase-lend-signals-sea-change-for-us-crypto-lending\" data-v-f87c67ca=\"\">\"Lend\" product offering<\/a>.","Since his confirmation in April, SEC Chairman Gary Gensler has worked to expand SEC jurisdiction over an ever-widening circle of crypto platforms, with <a href=\"https:\/\/www.theblockcrypto.com\/linked\/117651\/elizabeth-warren-and-gary-gensler-place-coinbase-in-oversight-crosshairs\" data-v-f87c67ca=\"\">Coinbase the most prominent example<\/a>.","When The Block asked Shirzad whether the SEC had seen this suggestion before, he said \"We look forward to briefing them on this.\"","Shirzad also said that cryptocurrencies Bitcoin and Ether would not fall into the purview of the proposed regulator. Those are the two cryptocurrencies that the SEC has already indicated it considers not to be securities.","In addition to this gap around Bitcoin and Ether, the proposal doesn't really address decentralized financial protocols. “If you have a truly truly decentralized entity or protocol, there’s nothing to regulate under our proposal,” said Shirzad.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"October 14","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Faryar Shirzad","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"Shirzad","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["BRIAN ARMSTRONG","COINBASE","GARY GENSLER","SEC"],"authors":["Kollen Post","The Block"]}