{"summary":"Payments giant PayPal aims to increase use of its USD-pegged stablecoin with a new international transfer service.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286513\/us-paypal-customers-will-be-able-to-use-stablecoin-for-international-payments","publishDate":"2024-04-04T10:38:17","id":2597,"type":null,"title":"US PayPal customers will be able to use stablecoin for international payments","category":["STABLECOINS"],"content":["Silicon Valley-based payments giant PayPal is again looking to expand the use of its PYUSD stablecoin.","The company announced that starting Thursday, U.S. clients will be able to send international money transfers using the company's PYUSD stablecoin. Through its cross-border payments service, Xoom, U.S. customers can now convert PYUSD to USD and then send money to \"recipients in approximately 160 countries\" without being charged transaction fees, PayPal said in a statement.","PayPal appears confident the market will embrace more cost-effective ways to send international money transfers. In its statement, it cited a World Bank report that said the \"global average cost of sending <span class=\"xn-money\" data-v-f87c67ca=\"\">$200<\/span> is just over 6%.\"","The fintech company is also simultaneously trying to increase the use of its stablecoin, <a href=\"https:\/\/www.theblock.co\/search?query=paypal%20stablecoin\" data-v-f87c67ca=\"\">launched last year<\/a>,&nbsp;while establishing itself as a trusted organization in digital assets. When it launched its stablecoin PayPal said the world is shifting towards greater use of cryptocurrencies.","\"Enabling U.S. users of Xoom the option to fund cross-border money transfers using PYUSD builds on our goal of driving mainstream adoption of cryptocurrencies,\" PayPal's Jose Fernandez da Ponte said in a statement. Da Ponte is PayPal's SVP of the blockchain, cryptocurrency, and digital currency group.","PayPal's announcement also comes as the stablecoin market may be heating up. Ripple <a href=\"https:\/\/www.theblock.co\/post\/286372\/ripple-to-launch-usd-stablecoin-cto-david-schwartz-hopes-will-rival-usdt-and-usdc\" data-v-f87c67ca=\"\">announced on Thursday<\/a> it was launching a stablecoin designed primarily for enterprise clients. In its statement, Ripple said the stablecoin market could rise to $2.8 trillion by 2028.&nbsp;","Currently, Tether's USDT and Circle's USDC stablecoins are the clear leaders in terms of supply, according to The Block Data Dashboard.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/stablecoins\/usd-pegged\/total-stablecoin-supply\/embed\" title=\"Total Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","&nbsp;","&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"6%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"SVP","content":"ORGANIZATION"},{"type":"2028","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Xoom","content":"LOCATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"Circle","content":"ORGANIZATION"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"$200","content":"MONEY"},{"type":"Jose Fernandez da Ponte","content":"PERSON"},{"type":"Ponte","content":"ORGANIZATION"},{"type":"The Block Data Dashboard","content":"ORGANIZATION"},{"type":"$2.8 trillion","content":"MONEY"}],"hashtag":[],"authors":["RT Watson","The Block"]}