{"summary":"Ant Financial, the fintech arm of Chinese tech giant Alibaba Group and the parent company of Alipay, has launched its consortium blockchain platform. Dubbed “OpenChain,” the platform is aimed at helping small and medium-sized enterprises (SMEs) deploy blockchain applications.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/62075\/chinese-tech-giant-alibabas-subsidiary-launches-consortium-blockchain-platform","publishDate":"2020-04-16T08:00:27","id":2599,"type":null,"title":"Ant Finantial launches consortium blockchain platform, &#x27;OpenChain&#x27;","category":["LAYER 1S"],"content":["Ant Financial, the fintech arm of Chinese tech giant Alibaba Group and the parent company of Alipay, has launched its consortium blockchain platform.","Dubbed “OpenChain,” the platform is aimed at helping small and medium-sized enterprises (SMEs) deploy blockchain applications “with higher efficiency and lower cost.”","“Through the launch of the OpenChain platform, we aim to help one million SMEs and developers innovate and explore more use cases in the next three years,” said Jin Ge, general manager of blockchain platforms at Ant Financial.","Consortium blockchain networks <a href=\"https:\/\/www.binance.vision\/blockchain\/private-public-and-consortium-blockchains-whats-the-difference\" data-v-f87c67ca=\"\">combine<\/a> elements of both public and private blockchains and are usually beneficial to organizations operating in the same industry.","Ant Financial’s OpenChain supports uses cases in industries such as supply chain finance, product provenance, digital invoices and charitable donations.","“These use cases require not only a trust mechanism among all parties, but also high-performance consensus algorithms that can complete authentication computation on the fly,” said Ant Financial.","OpenChain began its initial alpha testing in 2019 and since then WhiteMatrix, a provider of enterprise blockchain app development services, has been using the platform.","WhiteMatrix founder and CEO Wu Xiao said OpenChain’s transaction speed is “several times faster than public blockchain platforms like Ethereum” and its “cost per transaction is only one tenth of others.”","Major Chinese tech firms have been gearing to launch blockchain platforms. Earlier this year, Baidu <a href=\"https:\/\/www.theblockcrypto.com\/linked\/52145\/baidu-launches-public-beta-for-its-xuperchain-blockchain-project\" data-v-f87c67ca=\"\">launched<\/a> the public beta for its open-network blockchain \"Xuperchain.\" Tencent and JD have also published white papers on their proposed blockchain-as-a-service (BaaS) platforms.","Alibaba and Tencent groups, in particular, are the most active players in the blockchain space. Last year, Tencent and its affiliates <a href=\"https:\/\/www.theblockcrypto.com\/linked\/61547\/chinese-tech-giants-tencent-alibaba-filed-for-the-most-blockchain-patents-last-year?li_source=LI&amp;li_medium=right-column\" data-v-f87c67ca=\"\">filed<\/a> for 718 blockchain patents, while Alibaba Group filed 470.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Wu Xiao","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Alibaba Group","content":"ORGANIZATION"},{"type":"Jin Ge","content":"PERSON"},{"type":"Baidu","content":"LOCATION"},{"type":"Tencent","content":"ORGANIZATION"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Alipay","content":"LOCATION"},{"type":"2019","content":"DATE"},{"type":"Ant Financial","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}