{"summary":"Google recently opened up new functionality to search blockchain data on Bitcoin, Arbitrum, Avalanche, Optimism, Polygon and Fantom networks.","author":["Danny Park","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285530\/google-wallet-address-bitcoin-fantom-arbitrum","publishDate":"2024-03-28T22:13:36","id":26,"type":null,"title":"Google now allows wallet address searches for Bitcoin, Fantom, Arbitrum and others","category":["Companies"],"content":["<span data-v-f87c67ca=\"\">Google now allows users to search balances of wallets on Bitcoin, Arbitrum, Avalanche, Optimism, Polygon and Fantom blockchain. The search results when typing in wallet addresses display the remaining token balance in the wallet per network and the time the balance was last updated.<\/span>","<span data-v-f87c67ca=\"\">“Balances show only the native token for each network. Last updated timestamp shows balance as of last external transaction. Updates are not instantaneous,” Google noted in its search results.<\/span>","<span data-v-f87c67ca=\"\">Earlier this month, Google <\/span><a href=\"https:\/\/www.theblock.co\/post\/284091\/google-now-shows-ethereum-name-service-wallet-balances-in-search-results\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">started to show search results<\/span><\/a><span data-v-f87c67ca=\"\"> for wallet balances for users searching Ethereum Name Service (ENS) domains. ENS offers readable domain names for Ethereum wallet addresses, such as Ethereum creator Vitalik Buterin’s domain name, vitalik.eth.<\/span>","<span data-v-f87c67ca=\"\">These developments expanded upon Google’s initial support for Ethereum wallet balance searches that began last May, where it enabled users to search for a specific public address and view the wallet balance directly in the search results.<\/span>","<span data-v-f87c67ca=\"\">Google did not immediately respond to The Block’s request for further information.<\/span>"],"hashtag":["GOOGLE","WALLETS"]}