{"summary":"NIM Network is a blockchain aiming to optimize AI agent development for Web3 games that provides on-chain access to AI models for developers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286243\/research-unlock-leveraging-ai-in-games-on-nim-network","publishDate":"2024-04-03T09:03:09","id":26,"type":null,"title":"Research Unlock: Leveraging AI in games on NIM network","category":["METAVERSE & NFT"],"content":["<span data-v-f87c67ca=\"\">NIM network is an artificial intelligence (AI)-focused blockchain that aims to cultivate an ecosystem tailored for the rapid iteration and advancement of AI agents, primarily for Web3 games. Put simply, the NIM network provides a sandbox for the rapid deployment of AI agents for games. <\/span>","<span data-v-f87c67ca=\"\">These AI entities are adept at emulating the behaviors exhibited by real players, thereby enhancing the immersive quality of gameplay by serving as player-like non-playable characters (NPCs). In a typical digital game, this task is usually the responsibility of the game developers. With NIM, anyone can permissionlessly use, develop, or deploy AI agents that can later be used and improved on by other network participants in their applications. According to NIM’s roadmap, these AI agents will later also be capable of autonomously and transparently handling financial transactions on-chain, further expanding the platform's utility and potential.<\/span>","<span data-v-f87c67ca=\"\">NIM network will also offer new methods of incentivizing the way AI agents are developed and deployed on-chain. <\/span><span data-v-f87c67ca=\"\">For example, NIM will provide access to AI models to developers and offer users the opportunity to own these AI models. By owning a share of these AI agents, NIM token holders can share in revenue streams that are generated from AI model fees. On the other side of the equation, AI developers who deploy their agents on NIM can also be incentivized via token rewards.<\/span><span data-v-f87c67ca=\"\"> Additionally, NIM plans to incorporate a mechanism, that distributes network gas fees and token emissions pro-rata to top consumers of gas on NIM to incentivize participation and development.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The AI and gaming landscapes become more intersected, with AI's potential growing day after day. Since the introduction of AI into games in the late 1970s, such as in Space Invaders and Pac-Man, it grew to a level where we started to see AI agents <\/span><a href=\"https:\/\/openai.com\/research\/openai-five-defeats-dota-2-world-champions\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">outperforming<\/span><\/a><span data-v-f87c67ca=\"\"> international pro players in complex games like Dota 2.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Fast forward to today, we see AI being generically integrated into games as an agent. A good example of this is the <\/span><a href=\"https:\/\/deepmind.google\/discover\/blog\/sima-generalist-ai-agent-for-3d-virtual-environments\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Scalable, Instructable, Multiworld Agent (SIMA) project<\/span><\/a><span data-v-f87c67ca=\"\">, which has garnered substantial attention from prominent entities including Google's DeepMind. A defining characteristic of SIMA agents lies in their capacity to autonomously interpret and execute text-based instructions, endowing them with the versatility to navigate diverse virtual environments and undertake a multitude of tasks. Crucially, training such AI models is not only a key use case for game development, but it can also improve the performance of AI models in other fields.<\/span>","<span data-v-f87c67ca=\"\">The advancement of generic AI agent capabilities holds implications beyond the gaming sphere, manifesting in tangible benefits for real-world applications. Traditionally, the training of AI agents to simulate realistic human interactions necessitates considerable financial resources. By incentivizing players and developers to improve AI models’ responses through games, NIM can potentially accelerate the development of SIMAs and broaden the horizons for SIMAs as well. After all, the ability of SIMAs to optimally react in simulated but realistic environments could potentially spill over into other real-world sectors such as robotics and autonomous driving, where the AI agents are tasked with complex decision-making processes, such as managing traffic flow.<\/span>","<span data-v-f87c67ca=\"\">An overview of gaming and AI. Image: Google DeepMind.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">NIM provides an environment where SIMAs can be deployed on-chain, allowing users to permissionlessly adopt, evaluate, and modify them for specific use cases and environments. All pertinent model data is recorded on-chain and substantiated by corresponding proofs, creating a trustless ecosystem wherein users can collaboratively enhance their AI agents. This feature, termed provable computation, can enhance SIMA training by fostering collaboration. This ultimately benefits both game players who want to have realistic interactions with AI agents as well as AI developers who want to refine their AI models.<\/span>","<span data-v-f87c67ca=\"\">A considerable advantage of deploying such agents on-chain is that these AI agents can now transact and settle on behalf of their deployers in a transparent and publicly accountable manner. Considering the proliferation of Web3 games, each with its unique token economics, it becomes plausible for proficient players to derive income from game participation. However, the scalability of such a venture necessitates extensive AI-driven automation. The capability to publicly scrutinize an AI agent's behavior over time, facilitated by NIM's framework, presents yet another valuable feature for the agents' deployers. For instance, an AI agent behaving sub-optimally can be picked up by other network participants, prompting iterative optimization efforts. This may result in highly optimized AI agents that over time can better cater to the demands of professional players.<\/span>","<span data-v-f87c67ca=\"\">Although NIM’s technical documentation is not yet public, the team has provided The Block Research with insights on its current state of development.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">NIM network is leveraging Dymension’s modular framework to build its blockchain, which provides access to the Cosmos ecosystem from the get-go. Not only that, but Dymension chains are also EVM-compatible, which means that NIM is capable of supporting anything that a typical generic EVM chain can do.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The NIM network is optimized for the collaborative development and deployment of AI agents, due to its ability to support provable computations. Provable computation is a pivotal feature for developing and deploying AI agents collaboratively since training such an AI model is computationally intensive. It would be impractical to expect all of NIM’s users to be training advanced AI models from scratch on their own local devices. However, with provable computation, users are able to trustlessly bootstrap AI models with specific features and at a specific stage of development that have previously been deployed on-chain, and use it for their own purposes. The NIM development team is actively exploring various approaches for provable computation, ranging from trusted execution environments to optimistic verification.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The main approach, however, that the team has been focused on, is the use of validity proofs. Validity proofs can be leveraged in a myriad of situations, from scaling Layer 2s on Ethereum to conferring privacy. Additionally, validity proofs can also be used to attest a sequence of computations, thereby proving that the computation had indeed been performed and the result is as presented. NIM intends to leverage a relatively novel validity proof, <\/span><a href=\"https:\/\/eprint.iacr.org\/2022\/1608\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ligero<\/span><\/a><span data-v-f87c67ca=\"\">, for this approach.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Additionally, NIM plans to incorporate revenue sharing to NIM token stakers. This revenue would come from users who would pay for leveraging an AI platform to deploy an AI agent. Essentially, staking NIM tokens would represent partial ownership of the AI infrastructure built on NIM.<\/span>","<span data-v-f87c67ca=\"\">An imminent milestone for NIM is the launch of its mainnet in mid-April 2024, where NIM network will distribute its <\/span><a href=\"https:\/\/medium.com\/@NIM_Network\/nim-network-genesis-rolldrop-aa86af5f6134\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">genesis airdrop<\/span><\/a><span data-v-f87c67ca=\"\"> to a wide community, from Parallel gamers to Pudgy Penguin holders. Subsequently, NIM has planned a series of strategic partnerships with multiple Web3 games, such as Titans, an AI versus AI game. <\/span>","<span data-v-f87c67ca=\"\">The outlook for the NIM network appears to be full of possibilities but it remains to be seen if it can overcome the initial hurdle of garnering adoption. While the technology is promising, its success is highly dependent on the success of the games that it has partnered with. Additionally, there are other factors beyond NIM’s control, such as the sustainability of its token design and the emergence of potential competitors. More importantly, the technical capabilities that NIM promises to deliver will still take some time before they are production-ready.<\/span>","<span data-v-f87c67ca=\"\">However, with the renewed interest in Web3 games, as well as the run-up in prices of gaming tokens over the past few months, it would seem like NIM is currently well-positioned to capture the value that will come with a boom in the Web3 gaming industry. By providing a robust ecosystem tailored for the collaborative development and deployment of AI agents, coupled with the narrative for AI-driven gaming experience, NIM stands poised to deliver on its promises and potentially cement its position as a frontrunner in shaping the future of AI-driven gaming.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ligero","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"mid-April 2024","content":"DATE"},{"type":"SIMA","content":"ORGANIZATION"},{"type":"Google DeepMind","content":"ORGANIZATION"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Instructable","content":"LOCATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"1970s","content":"DATE"},{"type":"NIM","content":"ORGANIZATION"}],"hashtag":["GAME"],"authors":["Arnold Toh","The Block"]}