{"summary":"DeFi lending platform Maple Finance is expanding its range of permissioned lending pools.\nThis new pool will have a single borrower: Alameda Research.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/124694\/defi-goes-institutional-maple-finance-offers-syndicated-loans-to-alameda-research","publishDate":"2021-11-18T09:00:16","id":260,"type":null,"title":"DeFi platform Maple Finance offers syndicated loans to Alameda Research","category":["DeFi"],"content":["DeFi platform Maple Finance has created another permissioned lending pool, one designed to make it easier for institutional investors to lend money.","This particular lending pool has a single borrower: Alameda Research, which has committed to borrowing $25 million from the pool — with plans to increase that amount to $1 billion within a year. The pool will become visible today but won't begin operating until Friday.","Only certain accredited non-US institutions are allowed to lend funds within this pool. This will initially be CoinShares, Abra and Ascendex. These participants have to go through KYC and AML procedures prior to entering the pool.","A syndicated loan is one where a group of financial institutions lend money to a single borrower. This is a first for Maple Finance, which typically has multiple parties on each side of the borrowing and lending spectrum.","Maple Finance is what’s known as a permissioned DeFi platform.&nbsp;","The core idea is to take DeFi and its ability to let parties lend and borrow from each other, and introduce due diligence requirements. This strategy is designed to enable institutions that have high compliance requirements to participate.","“There is increasing institutional interest in participating in defi. They want to get a yield but don’t know how to do it in a compliant manner and don’t trust existing protocols out there for that,” said Maple Finance co-founder Sid Powell.","It has been working so far. The total liquidity in all of its pools has now broken past the $300 million mark. This, however, only represents a fraction of the permissionless DeFi lending market, where 32 platforms <a href=\"https:\/\/defipulse.com\/\" data-v-f87c67ca=\"\">look after $52 billion<\/a> in funds.","Maple Finance started with two borrowing and lending pools within which anyone can make a loan but only to a set of companies that have passed financial due diligence and KYC procedures. Typically, these loans are undercollateralized because they are lent to established market makers, such as Wintermute, Alameda Research and Amber Group. Borrowing rates are about 8-12% and 20% of the interest is taken in fees.&nbsp;","The two pools are identical but are each run by different pool delegates. These are entities that process the financial due diligence and whitelist borrowers. One pool is run by Orthogonal Trading and the other by Maven 11 Capital. These delegates receive half of the fees, with the remaining going to a staking reserve — funds that can be used in case a borrower defaults on a loan.","In November, Maple Finance launched its first permissioned pool, where both borrowers and lenders have to go through KYC procedures. This is&nbsp;in partnership with BlockTower Capital and Genesis Trading.","This new pool with Alameda takes this one step further by limiting the borrowing side to just one borrower, Alameda. Maple Finance claims this could lead to more competitive pricing and more volume.","“The crypto trading landscape has evolved very quickly over the past few years, and we expect it to continue to do so. The flexibility that comes from a decentralized, on-chain lending platform like this one helps Alameda adapt to that landscape, and we look forward to seeing it grow,” said Alameda Research’s co-CEO Sam Trabucco.","The platform continues to avoid the U.S. in its services. As Powell told The Block, “All of our borrowers are borrowing out of non-US entities. Predominantly U.K., Hong Kong, Singapore, BVI, Caymans.”","While permissioned DeFi lending is still in its infancy, competition is starting to heat up. DeFi lending protocol Aave, which looks after $14.5 billion in cryptocurrency, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/118822\/permissioned-defi-platform-aave-arc-gears-up-for-launch\" data-v-f87c67ca=\"\">is about to launch<\/a> its own permissioned lending platform, known as Aave Arc."],"hashtag":[]}