{"summary":"Brian Armstrong said staff at the securities regulator had asked it to halt trading of all tokens but bitcoin before suing the exchange last month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242115\/coinbase-ceo-says-sec-asked-it-to-delist-all-cryptocurrencies-except-bitcoin-financial-times","publishDate":"2023-07-31T01:31:02","id":260,"type":null,"title":"Coinbase CEO says SEC staff asked it to delist all cryptocurrencies except bitcoin: Financial Times","category":["EXCHANGES"],"content":["<span data-v-f87c67ca=\"\">Staff at the U.S. Securities and Exchange Commission asked Coinbase, the largest cryptocurrency exchange in the country, to halt trading in all cryptocurrencies except for bitcoin before it sued the company, Coinbase's CEO said.<\/span>","<span data-v-f87c67ca=\"\">Brian Armstrong, chief executive of Coinbase, made the comments in&nbsp;a Financial Times <a href=\"https:\/\/www.ft.com\/content\/1f873dd5-df8f-4cfc-bb21-ef83ed11fb4d\" data-v-f87c67ca=\"\">interview<\/a> published today — stating that the request came before the SEC took&nbsp;<\/span><a href=\"https:\/\/www.theblock.co\/post\/233270\/sec-sues-coinbase-binance\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">legal action<\/span><\/a><span data-v-f87c67ca=\"\"> against the company last month.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Coinbase — which offers over 200 tokens on its platform — was sued by the SEC early last month for allegedly violating securities laws and facilitating unregistered trading in 12 digital tokens that were deemed securities.<\/span>","<span data-v-f87c67ca=\"\">“They came back to us, and they said . . . we believe every asset other than bitcoin is a security,” Armstrong told the Financial Times. “And, we said, well how are you coming to that conclusion, because that’s not our interpretation of the law. And they said, we’re not going to explain it to you, you need to delist every asset other than bitcoin.”&nbsp;&nbsp;&nbsp;<\/span>","The SEC said it did not make formal requests for the exchange to delist crypto assets, according to the report.","A Coinbase spokesperson told The Block via email that the views shared in the Financial Times article may have represented the views of some staff at the time, but did not represent those of the SEC more broadly.","<span data-v-f87c67ca=\"\">In response to the SEC allegations, Coinbase last month <\/span><a href=\"https:\/\/www.theblock.co\/post\/237011\/coinbase-files-motion-to-dismiss-secs-suit-branding-it-an-extraordinary-abuse-of-process\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">filed<\/span><\/a><span data-v-f87c67ca=\"\"> a motion to dismiss the lawsuit, arguing that the agency <\/span><span data-v-f87c67ca=\"\">was applying securities laws to certain digital tokens in ways that significantly deviate from existing legal frameworks. Paul Grewal, Coinbase’s chief legal officer, <\/span><a href=\"https:\/\/twitter.com\/iampaulgrewal\/status\/1674271484263661569\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">tweeted<\/span><\/a><span data-v-f87c67ca=\"\"> that the SEC’s claims “go far beyond existing law.”<\/span>","<span data-v-f87c67ca=\"\">The SEC, however, said in a court filing earlier this month that Coinbase knew it violated securities laws.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">SEC lawyers <\/span><a href=\"https:\/\/www.theblock.co\/post\/238500\/coinbase-knew-it-violated-securities-law-sec-says\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">wrote<\/span><\/a><span data-v-f87c67ca=\"\"> to a federal judge in New York: “Coinbase, a multi-billion-dollar entity advised by sophisticated legal counsel, argues it was unaware that its conduct risked violating the federal securities laws, and suggests that by approving Coinbase’s registration statement in 2021 the SEC confirmed the legality of Coinbase’s underlying business activities — at that time and for all time.”<\/span>","<span data-v-f87c67ca=\"\">\"In other words, Coinbase adopted the very legal framework as a basis for making listing decisions that it now claims has no applicability to its activities,\" they added.<\/span>","<span data-v-f87c67ca=\"\">Last month, the SEC also <\/span><a href=\"https:\/\/www.theblock.co\/post\/233154\/sec-files-suit-against-binance\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">sued<\/span><\/a><span data-v-f87c67ca=\"\"> Binance, the world’s largest crypto exchange, and its founder Changpeng Zhao over several alleged violations of the country's securities laws.<\/span>","<em data-v-f87c67ca=\"\">Updated to show the comments were made by SEC staff and not reflective of the SEC's official position.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Armstrong","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Financial Times","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Paul Grewal","content":"PERSON"}],"hashtag":[],"authors":["Timmy Shen","The Block"]}