{"summary":"Authorities in Brazil and the U.S. have broken up a crypto fraud ring based in Curitiba, Brazil.\nThe operation allegedly is responsible for transactions totaling up to about $768 million, Brazil’s national police force reported. ","author":["Kristin Majcher","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175631\/u-s-brazil-authorities-break-up-768-million-alleged-crypto-crime-ring","publishDate":"2022-10-07T18:43:12","id":2600,"type":null,"title":"U.S., Brazil authorities break up $768 million alleged crypto crime ring","category":["Legal"],"content":["Authorities in the U.S. and Brazil have broken up a crypto fraud ring in Curitiba, Brazil allegedly responsible for moving up to 4 billion reais ($768 million) worth of transactions as it misled investors about crypto products that turned out to largely worthless.&nbsp;","\"The U.S. investigation revealed that the organization allegedly deceived investors in over a dozen countries by falsely claiming that they had developed fully functioning, cutting-edge cryptocurrency-related financial products,\" an Oct. 6 press release <a href=\"https:\/\/www.ice.gov\/news\/releases\/us-brazil-investigation-leads-disruption-transnational-cryptocurrency-fraud-ring\" data-v-f87c67ca=\"\">issued<\/a> by U.S. Immigration and Customs Enforcement (ICE) stated.&nbsp;\"In reality, the organization is suspected of advertising fraudulent partnerships and licenses that were used to dupe victims into investing millions into cryptocurrencies minted by the suspects. The cryptocurrencies eventually held little to no value.\"","The fraud ring is led by \"a 37-year old Brazilian national and former U.S. resident,\" the ICE statement said. Brazilian police have named Francisley Valdevino da Silva as being the alleged leader of the crime ring, local news outlets including G1 <a href=\"https:\/\/g1.globo.com\/pr\/parana\/noticia\/2022\/10\/06\/sheik-dos-bitcoins-quem-e-o-suspeito-de-liderar-fraudes-bilionarias-no-brasil-e-no-exterior.ghtml\" data-v-f87c67ca=\"\">reported<\/a>.&nbsp;","The investigation showed that the operation allegedly deceived \"thousands of victims\" through offering services that promised monthly returns of up to 20% of the amount they invested,&nbsp;Brazil's federal police said in its statement.","Brazil's federal police issued 20 search and seizure warrants as part of an investigation known as Operation Poyais, according to an Oct. 6 statement from the law enforcement organization. About 100 police officers took part in issuing these warrants and seizing property, along with employees of Brazil's Federal Reserve.&nbsp;","\"The violations include international money laundering, operating a criminal enterprise, fraud, and crimes against the national financial system,\" the ICE statement read.","Operation Poyais began in January 2022 when the fraud ring's leader moved from the U.S. to Brazil, ICE said in its statement. However, Brazil's police force noted that suspicions about the organization's involvement with financial crimes date back to 2016.","Cryptocurrency-related pyramid schemes have <a href=\"https:\/\/apnews.com\/article\/cryptocurrency-technology-business-brazil-bitcoin-2dc801e5e3aa477ce7983d84dc8a64bb\" data-v-f87c67ca=\"\">taken hold<\/a> in Brazil in the past few years. Police <a href=\"https:\/\/www.theblock.co\/linked\/115738\/brazils-federal-police-seizes-nearly-28-million-in-crypto\" data-v-f87c67ca=\"\">seized<\/a> nearly $28 million in crypto related to one of the most high-profile operations in&nbsp;August 2021."],"hashtag":["CRIME"]}