{"summary":"Blockchain assets, using bitcoin as a proxy, have already hit bottom, according to Pantera Capital CEO Dan Morehead.\nOsprey Fund’s CEO Greg King shared a similar sentiment, saying crypto is climbing a “wall of worry.”","author":["Adam Morgan McCarthy","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210237\/bitcoin-has-hit-bottom-at-least-thats-was-pantera-capital-and-osprey-funds-chiefs-say","publishDate":"2023-02-10T07:41:42","id":2601,"type":null,"title":"Bitcoin has hit bottom — at least that&#x27;s what Pantera Capital and Osprey Funds chiefs say","category":["Companies"],"content":["Crypto chiefs say bitcoin prices have hit bottom and are consolidating.&nbsp;","Bitcoin was trading around $21,760 at 7 a.m. EST, down about 4% over the past 24 hours, according to TradingView data. The leading cryptocurrency by market cap is up about 31% year-to-date.&nbsp;","\"Pantera has been through 10 years of bitcoin cycles, and I've traded through 35 years of similar cycles. I believe that blockchain assets have seen the lows and that we're in the next bull market cycle,\" <a href=\"https:\/\/panteracapital.com\/blockchain-letter\/the-seventh-bull-cycle\/#Bitcoin_Price\" data-v-f87c67ca=\"\">said<\/a> Pantera CEO Dan Morehead, adding: \"Regardless of what happens in the interest-rate-sensitive asset classes.\"","Morehead said this bear market was the only one to completely wipe out the previous bull market, giving back 136% of the last rally. \"I think we're done with that and beginning to grind higher,\" he said.","Osprey Funds Greg King <a href=\"https:\/\/www.bloomberg.com\/news\/videos\/2023-02-09\/bitcoin-has-hit-the-bottom-osprey-funds-ceo-video\" data-v-f87c67ca=\"\">shared<\/a> a similar sentiment on Bloomberg TV, noting that each down cycle is slightly less than the previous one — \"If that's the case this time, we've bottomed out.\"","King said prices wouldn't necessarily rise in a straight line from this point, as \"the optimism translates into finding the wall of worry.\" The Osprey Funds chief was referencing a theory in traditional financial markets that says when markets are trending higher (in the early stages of a bull cycle), they are climbing a \"wall of worry,\" or rising despite a lack of abundant positive sentiment.&nbsp;"],"hashtag":["ANALYST REPORTS","BITCOIN","EARNINGS","ECONOMIC INDICATORS","RATE DECISIONS"]}