{"summary":"Securities regulators in Texas and Alabama are reportedly expanding their investigations into troubled crypto firms Celsius and Voyager","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156741\/celsius-voyager-us-state-regulators-increasing-scrutiny-bloomberg","publishDate":"2022-07-09T07:04:23","id":2601,"type":null,"title":"US state regulators are increasing scrutiny into Celsius and Voyager: Bloomberg","category":["REGULATION"],"content":["Securities regulators in Texas and Alabama are expanding their investigations into troubled crypto lending firms Celsius and Voyager, according to a Bloomberg <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-07-08\/voyager-celsius-implosions-spur-expanded-texas-alabama-probes#xj4y7vzkg\" data-v-f87c67ca=\"\">report<\/a> on Friday.","The two states are said to be examining whether Voyager and Celsius fully disclosed information on their loans and the creditworthiness of borrowers.","Joe Rotunda, director of enforcement at the Texas State Securities Board, told Bloomberg that the regulator is finding a lot of firms may not have adequately disclosed what they were doing with investors' funds, including the amount of risk they were taking and the type of transactions they were conducting.","Amanda Senn, chief deputy director at the Alabama Securities Commission, told the outlet that the regulator was investigating these companies and \"trying to figure out what happened and why.\"","Senn added that the investigations were still in the initial stages, \"but we have a responsibility on behalf of our investors in our states.\"","Last September, both the Texas and Alabama regulators claimed that Celsius's interest-bearing crypto deposit offerings were unregistered securities.","Celsius and Voyager are both struggling financially, as The Block has previously reported:","<a href=\"https:\/\/www.theblock.co\/post\/155751\/celsius-repays-120-million-stablecoin-debt-to-maker-protocol\" data-v-f87c67ca=\"\">Celsius<\/a> halted withdrawals on June 12 and since then clients' funds have remained stuck. The firm has hired legal and financial advisers to explore possible restructuring options.","<a href=\"https:\/\/www.theblock.co\/post\/155990\/crypto-broker-voyager-digital-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">Voyager<\/a> filed for Chapter 11 bankruptcy protection earlier this week. Funds of Voyager's clients also remain stuck, since the firm halted withdrawals last week after its counterparty and troubled hedge fund Three Arrows Capital failed to repay a $650 million loan.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"earlier this week","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Texas State Securities Board","content":"ORGANIZATION"},{"type":"Amanda Senn","content":"PERSON"},{"type":"Alabama Securities Commission","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"Voyager","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Joe Rotunda","content":"PERSON"},{"type":"Alabama","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"last week","content":"DATE"},{"type":"$650 million","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"June 12","content":"DATE"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}