{"summary":"&quot;This is going to be a fund that Mysten will be friendly with, but it’s not a Mysten-only fund so to speak,&quot; said Evan Cheng, Mysten Labs CEO.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/214964\/mysten-labs-ceo-evan-cheng-wants-to-do-web3-venture-capital-better","publishDate":"2023-02-27T05:00:56","id":2602,"type":null,"title":"Mysten Labs CEO Evan Cheng wants to do web3 venture capital better","category":["DEALS"],"content":["Mysten Labs co-founder and CEO Evan Cheng <a href=\"https:\/\/www.theblock.co\/post\/215292\/inside-the-sui-ecosystem-with-mysten-labs-ceo-evan-cheng\" data-v-f87c67ca=\"\">confirmed<\/a> on The Scoop podcast that he is exploring a web3 venture fund.","\"I’ve been working with a couple of veteran investors that have an interest in doing something better,\" said Cheng on the podcast.","The Block <a href=\"https:\/\/www.theblock.co\/post\/210189\/mysten-labs-ceo-evan-cheng-web3-fund\" data-v-f87c67ca=\"\">previously reported<\/a> that Cheng was seeking to secure more than $100 million for a web3 fund. Sources told The Block that Cheng would continue to operate as the CEO of Mysten Labs and that he is currently in conversations with both potential general partners and limited partners for the new fund.","\"There are a lot of web3 funds but [investors] are looking for something that’s more not restricted to a particular ecosystem and that’s very aligned with LPs, and also have the support of people who really, really fundamentally understand web3 technology and products,\" said Cheng on the podcast.","Cheng is one of those web3 tech experts. Prior to joining Mysten, he <a href=\"https:\/\/www.theblock.co\/post\/168532\/mysten-labs-sui-blockchain-fundraise-ftx-ventures\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">spent<\/a>&nbsp;over a decade at Apple and worked as head of research and development at Meta’s crypto wallet Novi until September last year. All five of Mysten’s founders worked on Meta’s crypto initiatives.&nbsp;","Sui, Mysten Labs' Layer 1 blockchain, uses the Move programming language, which was developed at Meta. The blockchain has garnered significant interest from venture investors and raised a total of $336 million since late 2021, according to <a href=\"https:\/\/www.crunchbase.com\/organization\/mysten-labs\/investor_financials\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Crunchbase data<\/a>. Yet it still hasn't launched and&nbsp;<a href=\"https:\/\/sui.io\/resources-sui\/testnet-wave-2-is-now-live\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">remains<\/a>&nbsp;in a testnet phase.","Cheng is adamant that if his venture capital plans come to fruition, they will not take the form of an ecosystem fund focused exclusively on the Sui blockchain.","\"This is going to be a fund that Mysten will be friendly with, but it’s not a Mysten-only fund so to speak,\" said Cheng on the podcast.","\"From Mysten’s perspective, this is also better aligned with LPs, as opposed to an ecosystem fund which tend to ‘spray and pray,’ almost like a grant program for anybody who wants to build on the platform,\" he said. \"So that’s just a strategy we’re pursuing.\"","Sui is just one of several chains competing for market share in an already crowded landscape of established blockchains such as Ethereum, Solana and Avalanche. Many of which have ecosystem funds to support growth and activity on their blockchains.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/total-value-locked-tvl\/value-locked-by-blockchain\/embed\" title=\"Value Locked by Blockchain\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$336 million","content":"MONEY"},{"type":"Mysten","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"September last year","content":"DATE"},{"type":"Evan Cheng","content":"PERSON"},{"type":"Cheng","content":"ORGANIZATION"},{"type":"Mysten Labs","content":"ORGANIZATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Cheng","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Mysten","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["SEED &AMP; PRE-SEED","SERIES A","STARTUP ACCELERATORS"],"authors":["Kari McMahon","The Block"]}