{"summary":"Nicole Behnam received 250 Blocky Doge 3 NFTs and promptly sold 220 of them, obliterating the collection&#x27;s floor price.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/226152\/nicole-benham-dogecoin-nft-pump-dump","publishDate":"2023-04-13T11:19:17","id":2604,"type":null,"title":"Media personality, ex-journalist at heart of Dogecoin pump and dump","category":["METAVERSE & NFT"],"content":["Web3 influencer Nicole Behnam, a former journalist with bylines in the Los Angeles Business Journal and The Hollywood Reporter, was at the center of the latest NFT \"pump and dump.\"","Behnam spent the past few days discussing Dogecoin founder Billy Markus's latest project, Blocky Doge 3. The \"media personality\" could be found responding to tweets and joining Twitter Spaces promoting the collection with insights such as \"no roadmap or utility?\" followed by the \"eyes\" <a href=\"https:\/\/emojipedia.org\/eyes\/\" data-v-f87c67ca=\"\">emoji<\/a> and \"here's the alpha, the founder of Dogecoin is dropping a dog NFT collection pretty soon.\"","\"There's a lot to be excited about; that's all I'm saying,\" Behnam said, adding that she just wanted everyone in the NFT community to get in on it because she heard it was a free mint. Some tweets have since been deleted, although several Crypto Twitter sleuths have receipts.&nbsp;","<span data-v-f87c67ca=\"\">Nicole Behnam's response to Billy Markus announcing the Blocky Doge 3 collection, captured by @manamoonnft&nbsp;<\/span>","Markus <a href=\"https:\/\/twitter.com\/BillyM2k\/status\/1645849273362432001\" data-v-f87c67ca=\"\">pitched<\/a> the collection as having \"no roadmap, no utility, no anything, just ugly pixel art jpegs of degen dog avatars.\" The public mint went live at 3 p.m. EDT on April 11, with existing Blocky holders getting access an hour earlier.&nbsp;","Behnam received 250 Blocky Doge 3 NFTs into a wallet she controlled. She promptly sold 220 of these at the same price — obliterating the collection's floor price (the value of the cheapest NFTs in the collection). The floor price has fallen about 56% in ether terms, down to 0.0371 ETH from 0.0845 ETH on April 11. The profits from the sales were about 20 ether, worth around $38,000 at the time.&nbsp;","The influencer later <a href=\"https:\/\/twitter.com\/NicoleBehnam\/status\/1646243996740509698?s=20\" data-v-f87c67ca=\"\">apologized<\/a> on Twitter, sounding like someone admitting to a weekend of excessive spending in the process.&nbsp;","\"There were mistakes made in a wallet that I controlled,\" Behnam wrote, adding, \"This morning, that same wallet swept the Blocky Doge 3 floor. All the NFTs purchased will be transferred to the studio wallet.\"","Behnam signed off with, \"Listening, learning, moving forward.\" Skeptics <a href=\"https:\/\/twitter.com\/zachxbt\/status\/1646272745024438273?s=20\" data-v-f87c67ca=\"\">wondered<\/a>, was she really sorry, or just sorry she'd been caught?","The dogecoin founder later responded to a Twitter user pointing out that Behnam was behind the floor price dip. Markus thanked them for \"holding people accountable ad protecting people\" in the space before sharing a resolution.&nbsp;","The wallet which sold the 220 NFTs \"decided to sweep the floor with the earnings from the previous pre-mint dumping and donated all the purchases NFTs to the community wallet,\" he said. Sweeping the floor refers to someone buying all the NFTs in a collection at the floor price. Each of the other pre-mint wallets also donated the NFTs to the community, according to Markus.&nbsp;","<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">The community wallet is under Markus's control. He said he \"will be sending the bulk of the NFTs to those who run the discord community to do whatever the community wants with them (for example, airdropping NFTs to people that missed the mint, etc.\" This process would be done gradually to avoid a \"giant dump,\" he added.&nbsp;<\/span>","<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Markus said he hopes this plan \"lessens the negativity of everything that has happened,\" and he completely understands how people feel about the situation.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Billy Markus","content":"PERSON"},{"type":"This morning","content":"TIME"},{"type":"2023","content":"DATE"},{"type":"April 11","content":"DATE"},{"type":"Los Angeles","content":"LOCATION"},{"type":"Behnam","content":"PERSON"},{"type":"56%","content":"PERCENT"},{"type":"$38,000","content":"MONEY"},{"type":"Nicole Behnam","content":"PERSON"},{"type":"Markus","content":"PERSON"},{"type":"3 p.m. EDT","content":"TIME"}],"hashtag":["ELON MUSK","NFT ARTISTS","NFT INFRASTRUCTURE"],"authors":["Adam Morgan McCarthy","The Block"]}