{"summary":"Circle, Paxos and Tether are among the stablecoin issuers that say they are diversifying away from or have no exposure to Silicon Valley Bank.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/218862\/stablecoin-issuers-seek-to-diversify-banking-partners-in-the-wake-of-silicon-valley-banks-meltdown","publishDate":"2023-03-10T17:57:48","id":2605,"type":null,"title":"Stablecoin issuers seek to diversify banking partners in the wake of Silicon Valley Bank&#x27;s meltdown","category":["COMPANIES"],"content":["The failure of California-based Silicon Valley Bank today leaves the crypto market with one fewer lending partner, adding further pressure on stablecoin issuer Circle to beef up its portfolio of bank partners.&nbsp;","Silicon Valley Bank, which ranks many tech companies and startups among its clients, became the largest bank to fail since the 2008 financial crisis on Friday, and the FDIC seized control. Silicon Valley Bank's collapse came shortly after crypto-friendly Silvergate said it was liquidating.&nbsp;","That leaves Circle with two fewer banks to hold the cash tied to its USDC stablecoin. Circle is in the process of establishing new banking relationships, according to sources. The stablecoin issuer also banks with BNYMellon and Citizens Trust Bank.&nbsp;","\"Silicon Valley Bank is one of six banking partners Circle uses for managing the ~25%&nbsp;&nbsp;<wbr data-v-f87c67ca=\"\">portion of USDC reserves held in cash,\" Circle said in a <a href=\"http:\/\/Silicon Valley Bank is one of six banking partners Circle uses for managing the ~25%  portion of USDC reserves held in cash.  While we await clarity on how the FDIC receivership of SVB will impact its depositors, Circle &amp; USDC continue to operate normally.\" data-v-f87c67ca=\"\">tweet<\/a> late Friday. \"While we await clarity on how the FDIC receivership of SVB will impact its depositors, Circle &amp; USDC continue to operate normally.\"","Rival Tether, which said it was not exposed to Silicon Valley Bank,&nbsp; also is expanding its own banking relationships, adding to an existing \"resilient network of strong banks.\" These relationships have been \"in the works since a while, independently from recent events,\" CTO Paolo Ardoino said. Tether said that it did not have any exposure to Silicon Valley Bank.","Paxos, another stablecoin issuer, also noted that it did not have exposure to Silicon Valley Bank.","More established firms like Circle and Tether might be in a stronger banking position, even after the collapse Silvergate. Smaller crypto firms or companies looking to enter the industry may find it more difficult to find a bank to work with in this financial and regulatory environment.","<b data-stringify-type=\"bold\" data-v-f87c67ca=\"\">\"<\/b>There is nothing really stopping a bank from banking a crypto company but your bank regulator is going to come look at your books more frequently — let's say every six months instead of every 12, and that makes your life more difficult and drives up compliance costs,” said Meltem Demirors, CoinShares chief strategy officer. \"So unless a crypto firm is a really big revenue generator, the juice isn’t worth the squeeze for many banks.\"","<em data-v-f87c67ca=\"\">Update: Added tweet from Circle on its exposure to SVB.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Citizens Trust Bank","content":"ORGANIZATION"},{"type":"\" Circle","content":"ORGANIZATION"},{"type":"Circle &amp; USDC","content":"ORGANIZATION"},{"type":"2008","content":"DATE"},{"type":"Silvergate","content":"PERSON"},{"type":"Meltem Demirors","content":"PERSON"},{"type":"FDIC","content":"ORGANIZATION"},{"type":"California","content":"LOCATION"},{"type":"25%","content":"PERCENT"},{"type":"USDC","content":"ORGANIZATION"},{"type":"SVB","content":"ORGANIZATION"},{"type":"CTO Paolo Ardoino","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}