{"summary":"The company took issue with how the SEC repeated allegations in a press release announcing an emergency deal with Binance.US over treatment of customer assets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236556\/binance-takes-early-court-loss-as-request-for-sec-rebuke-fails","publishDate":"2023-06-26T18:14:24","id":2606,"type":null,"title":"Binance takes early court loss as request for SEC rebuke fails","category":["POLICY"],"content":["The federal judge presiding over the U.S. Securities and Exchange Commission’s case against Binance, Binance.US and their owner Changpeng ‘CZ’ Zhao denied a request from Binance’s lawyers to rebuke the regulator over language it used in a press release.","Specifically, Binance’s lawyers took issue with language used by the SEC to describe alleged commingling or diversion of customer assets from the trading platforms to investment vehicles that the agency says Zhao controls.","Judge Amy Berman Jackson of the District Court of the District of Columbia denied the motion on Monday, in an early court loss for the embattled international crypto giant.","“While all of the lawyers in this case should adhere to their ethical obligations at all times, it is not apparent that Court intervention to reiterate that point is needed at this time, or that it is necessary or appropriate for the Court to get involved in wordsmithing the parties' press releases,” Berman Jackson wrote in an order. “Nor is it clear that the agency's public relations efforts to date will materially affect proceedings in this case.”","Last week, lawyers for the company asked Berman Jackson to rebuke the SEC over its descriptions of alleged misuse of billions of dollars of customer assets outside of court on the grounds that the <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2023-110\" data-v-f87c67ca=\"\">press release<\/a> could prejudice a jury. The language in question was included in a release announcing the emergency agreement reached between the SEC and Binance.US, which goes by the corporate name BAM Trading, intended to keep customer assets safe while allowing the company to continue business operations.","“The SEC’s press release also appears to be designed to introduce unwarranted confusion into the marketplace, which could have the effect of harming BAM customers rather than protecting them,” Binance’s lawyers wrote to the court last week. “It also risks tainting the jury pool with misleading descriptions of the evidence concerning the defendants.”","The filing in question concerned a statement in the release from SEC Enforcement Director Gurbir Grewal, who said that the agreement restricting how Binance.US can move funds was necessary.","“Given that Changpeng Zhao and Binance have control of the platforms’ customers’ assets and have been able to commingle customer assets or divert customer assets as they please, as we have alleged, these prohibitions are essential to protecting investor assets,” he said. “Further, we ensured that U.S. customers will be able to withdraw their assets from the platform while we work to resolve the alleged underlying misconduct and hold Zhao and the Binance entities accountable for their alleged securities law violations.”","The SEC wants Berman Jackson to ultimately freeze assets for Binance.US, Binance and Zhao, as well as bar them from doing business in the U.S. But the June 17 agreement that the SEC issued a release about only concerns a temporary restraining order on Binance.US, which the SEC said was necessary because a 2022 internal report on the trading platform’s assets provided by a third party firm could not determine whether the U.S. affiliate of Binance held the assets it said it did, or if they were actually held overseas with its corporate parent.","Berman Jackson did not fully agree with the agency in that request, instead urging the markets regulator and Binance.US to reach an agreement on how to maintain safety of customer assets while allowing the company to continue \"an ordinary course of business.\"","The SEC also alleges that Binance and Binance.US <a href=\"https:\/\/www.theblock.co\/post\/233652\/sec-binance-and-us-affiliate-redirected-billions-in-customer-assets-to-zhaos-funds\" data-v-f87c67ca=\"\">redirected billions in customer funds to investment vehicles controlled by Zhao<\/a>, with most of the money being used to pay Paxos, the issuer of BUSD. The SEC also claims Zhao bought himself a yacht using commingled funds.","In addition to the 2022 audit, the agency outlined details of bank records it obtained, primarily from Silvergate and Signature Banks, which maintained networks for business-to-business transactions by crypto firms, to back up the allegations.","The allegations parallel similar accusations about fraud and misuse of customer funds in civil, criminal and <a href=\"https:\/\/www.theblock.co\/post\/236507\/latest-ftx-bankruptcy-report-provides-lurid-details-into-alleged-fraud\" data-v-f87c67ca=\"\">bankruptcy<\/a> cases involving FTX, Alameda Research, and Sam Bankman-Fried.","Berman Jackson set a Sept. 21 due date for Binance's pleadings in the civil case.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"billions of dollars","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Zhao","content":"ORGANIZATION"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Zhao","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Amy Berman Jackson","content":"PERSON"},{"type":"the District Court of the District of Columbia","content":"ORGANIZATION"},{"type":"Sept. 21","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Gurbir Grewal","content":"PERSON"},{"type":"Berman Jackson","content":"PERSON"},{"type":"BAM Trading","content":"ORGANIZATION"},{"type":"June 17","content":"DATE"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"U.S","content":"LOCATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BINANCE","COURT HEARINGS","SEC"],"authors":["Colin Wilhelm","The Block"]}