{"summary":"Ignite CEO Peng Zhong has announced that he has left the company, following Jae Kwon&#x27;s return to the fray.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/155484\/ignite-ceo-exits-company-following-jae-kwons-return-to-tendermint","publishDate":"2022-07-01T12:14:27","id":2607,"type":null,"title":"Ignite CEO exits company following Jae Kwon&#x27;s return to Tendermint","category":["PEOPLE"],"content":["Ignite CEO Peng Zhong has left the company, following Jae Kwon's return to the fray.","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Today is my last day at Ignite. Thank you for the camaraderie we shared as we built out this ecosystem. It's been an honor to be a part of this team and this community. I will miss you,\" <a href=\"https:\/\/mobile.twitter.com\/zcpeng\/status\/1542891986188902404\" data-v-f87c67ca=\"\">said<\/a> Zhong on Twitter.<\/span>","Ignite, one of the foremost companies in the Cosmos ecosystem, was previously called Tendermint. It was founded by Kwon in 2014, but he stepped down as CEO in 2020 to focus on another project called Virgo. When he left, Zhong stepped in to fill the vacancy.","Earlier this year, Kwon decided to return to Tendermint and use the entity and its name for a new project. As a result, Tendermint changed its name to Ignite and the whole company went through a rebranding.","At the time, Zhong said Ignite would be focused on encouraging an \"<span data-v-6ce9c252=\"\" data-v-f87c67ca=\"\">explosion of new products on Cosmos technology<\/span>.\"","Yet Zhong's sudden departure raises questions about the future of the Ignite. Its website has been updated to focus mostly on its blockchain development tool, Ignite CLI, while pages about its venture arm and its accelerator have disappeared.","Beyond this, its flagship product Emeris — a cross-chain DeFi protocol — has been put on hold. Its website says that it will be \"will be shutting down for a period of time.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"Zhong","content":"ORGANIZATION"},{"type":"Peng Zhong","content":"PERSON"},{"type":"Jae Kwon","content":"PERSON"},{"type":"Zhong","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Kwon","content":"PERSON"},{"type":"2020","content":"DATE"}],"hashtag":["COSMOS"],"authors":["Tim Copeland","The Block"]}