{"summary":"The People’s Bank of China is expanding the trial of its central bank digital currency to four new provinces including Guangdong, its most populous region. \nCentral bank digital currencies (CBDCs) are a kind of cryptocurrency issued and controlled by the central banking authority of a nation state.","author":["Tom Matsuda","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/171217\/china-expands-trial-of-its-e-cny-cbdc-to-four-new-provinces-scmp","publishDate":"2022-09-20T08:33:27","id":2608,"type":null,"title":"China expands trial of its e-CNY CBDC to four new provinces: SCMP","category":["China"],"content":["China will reportedly expand trials of the e-CNY to four new provinces including Guangdong, the most populous, as it seeks to boost the adoption of its central bank digital currency (CBDC).&nbsp;","Along with Guangdong, it will also be trialed in Jiangsu, Hebei and Sichuan provinces, according to a <a href=\"https:\/\/www.scmp.com\/tech\/article\/3193125\/china-digital-currency-beijing-expand-e-cny-trials-four-entire-provinces\" data-v-f87c67ca=\"\">report<\/a> in the South China Morning Post citing&nbsp;People’s Bank of China deputy governor Fan Yifei.&nbsp;","Fan described the program as “an important infrastructure in the digital era” yet did not give a specific timetable as to when the expansion will happen.","Previously, the central bank tested out the digital yuan in 2020 in the cities of Shenzhen, Suzhou, Xiongan and Chengdu.","Earlier this year, the app for the <a href=\"https:\/\/www.theblock.co\/linked\/129081\/chinas-digital-yuan-wallet-goes-live-on-app-stores-in-pilot-mode\" data-v-f87c67ca=\"\">digital yuan wallet<\/a> went live in the iOS and Android app stores in China. According to disclosures, there were <a href=\"https:\/\/www.scmp.com\/tech\/tech-trends\/article\/3163953\/chinas-digital-currency-e-cny-wallet-nearly-doubles-user-base-two?module=inline&amp;pgtype=article\" data-v-f87c67ca=\"\">261 million unique users of the wallet<\/a> even before it was released in app stores.&nbsp;It currently encourages tests by using consumer cash rewards and asking retailers to accept e-CNY payments.&nbsp;","While an official date of nationwide release is yet to be announced, China has seized an early&nbsp;lead in readying a CBDC for public use.","Some players in the U.S. government, however, view the digital yuan as a tool for surveillance that could also undermine the global dominance of the dollar.","In March, a <a href=\"https:\/\/www.theblock.co\/linked\/137248\/new-senate-bill-sounds-the-alarm-on-chinas-digital-yuan\" data-v-f87c67ca=\"\">new senate bill was signed<\/a> that aimed to hold China accountable on its use of the digital yuan, particularly how it might expand its network into the U.S.&nbsp;"],"hashtag":[]}