{"summary":"Bitcoin miner Hut 8 has appointed President and board member Asher Genoot as CEO, following the completion of its merger with US Bitcoin Corp.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276499\/bitcoin-miner-hut-8-appoints-asher-genoot-ceo","publishDate":"2024-02-07T10:19:21","id":2608,"type":null,"title":"Bitcoin miner Hut 8 appoints Asher Genoot as new CEO","category":["PEOPLE"],"content":["Bitcoin miner Hut 8 has appointed President and board member Asher Genoot as CEO. Genoot replaces Jaime Leverton, who departed the company immediately.","Genoot previously served as COO and then President of US Bitcoin Corp (USBTC), which completed a <a href=\"https:\/\/www.theblock.co\/post\/209265\/bitcoin-miners-hut-8-and-us-bitcoin-merge-to-form-new-us-based-entity\" data-v-f87c67ca=\"\">merger<\/a> of equals with Hut 8 in November. He became Hut 8 President in December.","Following the merger, Hut 8’s board of directors determined the time was right to set a new strategic direction, and a change in leadership of the Nasdaq-listed firm was appropriate, <a href=\"https:\/\/www.globenewswire.com\/news-release\/2024\/02\/07\/2825085\/0\/en\/Hut-8-Announces-Leadership-Transition.html\" data-v-f87c67ca=\"\">according<\/a> to a statement released today.","“Hut 8 is now at a pivotal inflection point, and we believe that Asher is uniquely qualified to accelerate our path to market leadership,” Hut 8 Chairman Bill Tai said.","“It has been a privilege to lead the Hut 8 team and to serve as CEO through such a critical time for Hut 8,” Leverton added. “I am grateful to the Board for the opportunity to lead such a talented, innovative team, and I am proud of the company we have built.”","Thanking Leverton for her leadership in building a strong foundation for the company, Genoot emphasized his commitment to ensuring a smooth transition. “I am focused on strengthening operations, driving profitable growth and creating lasting shareholder value,” he said.","Last week, Marathon Digital agreed to pay Hut 8 a <a href=\"https:\/\/www.theblock.co\/post\/275763\/marathon-hut-8-bitcoin-mining-sites\" data-v-f87c67ca=\"\">termination fee<\/a> of $13.5 million to take full operational control of two recently acquired Bitcoin mining sites in Granbury, Texas and Kearney, Nebraska. Hut 8 had inherited a service agreement for the facilities after merging with USBTC.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$13.5 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"COO","content":"ORGANIZATION"},{"type":"Granbury","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"US Bitcoin Corp","content":"ORGANIZATION"},{"type":"Nebraska","content":"LOCATION"},{"type":"Asher","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Bill Tai","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"Asher Genoot","content":"PERSON"},{"type":"Texas","content":"LOCATION"},{"type":"November","content":"DATE"},{"type":"Genoot","content":"PERSON"},{"type":"Kearney","content":"PERSON"},{"type":"Board","content":"ORGANIZATION"},{"type":"Jaime Leverton","content":"PERSON"},{"type":"Marathon Digital","content":"ORGANIZATION"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"Leverton","content":"PERSON"}],"hashtag":["BITCOIN","HIRING","MINING COMPANIES"],"authors":["James Hunt","The Block"]}