{"summary":"Blockchain analytics firm Elliptic has built a solution for banks to help them decide which crypto exchanges to do business with\nThe solution includes data and insights on 200 global crypto exchanges\nTom Robinson, co-founder and chief scientist at Elliptic, told The Block: “At the moment most banks cannot distinguish between compliant exchanges and those that pose money laundering or sanctions risks”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/50089\/elliptic-builds-a-solution-for-banks-to-help-them-decide-which-crypto-exchanges-to-do-business-with","publishDate":"2019-12-11T07:00:06","id":2613,"type":null,"title":"Elliptic builds a solution for banks to help them decide which crypto exchanges to do business with","category":["Exchanges"],"content":["Banks have since long been known to remain reluctant to provide services to cryptocurrency firms, including exchanges. Blockchain analytics firm Elliptic is hoping to improve the situation with its new solution.","Dubbed “Discovery,” Elliptic’s solution, purpose-built for banks, is a database of 200 global cryptocurrency exchanges, including information about their corporate entities, jurisdiction, regulatory status, and compliance policies. It also includes blockchain insights into the provenance of the cryptocurrencies they hold.","While Elliptic has already been providing services to banks, a separate solution was needed for them, Tom Robinson, co-founder and chief scientist at Elliptic, told The Block. “Crypto-related problems and risks that banks were encountering are fundamentally different from those faced by our other clients, and warranted their own solution.”","Robinson added that banks particularly wanted to know the risks and opportunities posed by crypto exchanges before providing banking services to them.","Indeed, <a href=\"https:\/\/www.theblockresearch.com\/research-a-comprehensive-list-of-crypto-friendly-banks-35988\" data-v-f87c67ca=\"\">The Block recently reported<\/a> that most banks hesitate to serve crypto businesses and those willing to offer services, want these businesses to mandatorily comply with robust compliance measures. At present, all crypto-serving banks based in the U.S. combined have less than $70 billion in total assets (which is less than 3% of JPMorgan Chase’s total assets).","“At the moment most banks cannot distinguish between compliant exchanges and those that pose money laundering or sanctions risks. Their reaction to this has been to simply cut off crypto businesses entirely,” Robinson told The Block, adding:","“Elliptic Discovery will allow them to instead take a risk-based approach, and use our insights and data to identify those crypto exchanges that they can safely do business with.\"","Robinson declined to share which or how many banks have already signed up for the Discovery solution.","<strong data-v-f87c67ca=\"\">Behind the scenes<\/strong>","The Discovery solution took about a year to develop, Robinson told The Block, adding that maintaining and broadening its scope will be an ongoing process.","Giving some behind-the-scenes work details, Robinson said Elliptic coordinated with a number of financial institutions, including its investors and current customers, to identify the risk indicators that could be used to give them the level of comfort they need to engage with a specific crypto exchange. “Once these were established, it was a case of compiling this data for over 200 global crypto exchanges, which took our team of data analysts several months,” Robinson added.","He declined to share which specific banks Elliptic worked with, but its current investors include Japan’s SBI and Spanish banking giant Santander’s venture unit. It is likely that Elliptic worked with the two banks. “The identities of our clients are confidential, although we hope to be able to share some information about this in the near future,” Robinson told The Block.","All in all, he hopes that the Discovery solution will bring positive outcomes, including improved access to banking for crypto firms such as exchanges.","Founded in 2013, Elliptic claims to track over 85% of all cryptocurrencies by market capitalization, via its transaction monitoring tools. Last month, the firm <a href=\"https:\/\/www.theblockcrypto.com\/post\/47675\/blockchain-analytics-firm-elliptic-finds-over-400m-xrp-tied-to-illegal-activities\" data-v-f87c67ca=\"\">added<\/a> support for XRP and found over $400 million worth of XRP transactions related to suspicious activities.","Elliptic is backed by notable investors, having <a href=\"https:\/\/www.theblockcrypto.com\/post\/38327\/blockchain-analytics-firm-elliptic-raises-23m-series-b-to-fund-asia-expansion\" data-v-f87c67ca=\"\">raised $35 million<\/a> in funding to date from Japanese financial services giant SBI Holdings, Santander Innoventures and Digital Currency Group, among others."],"hashtag":["TRADFI BANKS"]}