{"summary":"Fashion tech firm DressX raised a $15 million Series A led by Berlin-based crypto venture capital firm Greenfield.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/219565\/digital-fashion-firm-dressx-raises-15-million-in-series-a-funding","publishDate":"2023-03-14T10:00:33","id":2614,"type":null,"title":"Digital fashion firm DressX raises $15 million in Series A funding","category":["FASHION NFTS"],"content":["Will digital fashion ever be in vogue? That's what fashion tech firm DressX is betting on as it raises a $15 million Series A led by Berlin-based crypto venture capital firm Greenfield.","The round, which closed at the end of February, also featured participation from Slow Ventures, The Artemis Fund, Red Dao and Warner Music.&nbsp;","Co-founders Daria Shapovalova and Natalia Modenova declined to share the valuation in an interview with The Block but said it was an uplift from its previous $10 million valuation at seed.&nbsp;","At its founding in 2020, DressX looked at ways to incorporate on-chain fashion but decided it was far too early.&nbsp;","\"The concept of digital fashion was already ground-breaking and not easy for everyone,\" said Modenova. \"Adding another layer of difficulty and complexity here would definitely not help it take off.\"&nbsp;","In the meantime, it focused on off-chain digital fashion pieces that can be showcased on platforms like Roblox and Instagram. In the process, it racked up over 250,000 users on its app, where users can access a digital closet of bought items.&nbsp;","As the popularity of digital fashion picked up, DressX saw an audience emerge that understood web3 and began to dive deeper into NFTs, <a href=\"https:\/\/www.showstudio.com\/news\/dressx-finally-try-their-hand-at-the-world-of-nfts\" data-v-f87c67ca=\"\">launching<\/a> its marketplace in March last year and <a href=\"https:\/\/wwd.com\/fashion-news\/fashion-scoops\/dressx-digital-fashion-start-up-moves-into-nfts-with-crypto-com-partnership-1234903529\/\" data-v-f87c67ca=\"\">forging<\/a> a partnership with exchange Crypto.com — which <a href=\"https:\/\/twitter.com\/dressxcom\/status\/1493602699019010060\" data-v-f87c67ca=\"\">included<\/a> an NFT drop of the Super Bowl outfits designed by fashion label Dundas for singer Mary J. Blige.&nbsp;","NFTs sold on its marketplace can be worn digitally in augmented reality via the DressX app or used as skins in metaverse games Ready Player Me or Decentraland.&nbsp;","Despite the focus on web3, the founders admit that their off-chain items are primarily the firm's bread and butter, with its NFT fashion essentially locked toward those who know their way around a seed phrase and a MetaMask wallet.&nbsp;","Moreover, digital fashion — let alone NFT fashion — is still very nascent. The industry's size was <a href=\"https:\/\/www.marketwatch.com\/press-release\/digital-fashion-market-2023-market-size-increasing-demand-gross-margin-and-competitive-analysis-2023-2028-2023-02-02#:~:text=The%20global%20Digital%20Fashion%20market,USD%20195071.83%20million%20by%202028.\" data-v-f87c67ca=\"\">valued<\/a> at around $342 million last year, a small cut of the couture pie compared to the trillions that its physical counterpart is worth.&nbsp;","The funding will be used partly to improve the interoperability of its digital fashion assets and improve the performance of its app and NFT marketplace.&nbsp;","Last month, early stages deals such as FashionX's Series A showed an uptick since a sharp decline last October. The number of early-stage deals doubled from last month's eight to 15 in February, per The Block Research. Still, in terms of dollar amount, the average size of such deals declined.","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Warner Music","content":"ORGANIZATION"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Mary J. Blige","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"Modenova","content":"PERSON"},{"type":"Dundas","content":"PERSON"},{"type":"Berlin","content":"LOCATION"},{"type":"March last year","content":"DATE"},{"type":"$342 million","content":"MONEY"},{"type":"Roblox","content":"PERSON"},{"type":"Daria Shapovalova","content":"PERSON"},{"type":"Red Dao","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$15 million","content":"MONEY"},{"type":"Greenfield","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Natalia Modenova","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"$10 million","content":"MONEY"}],"hashtag":["SERIES A"],"authors":["Tom Matsuda","The Block"]}