{"summary":"Sequoia India-backed blockchain startup Band Protocol has released its mainnet and its first dApp\nThe dApp, BitSwing, allows users to trade bitcoin binary options \nBand Protocol co-founder and CEO, Soravis Srinawakoon, told The Block that binary option is “one of the simplest financial derivatives that most people can understand”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/41457\/sequoia-backed-startup-band-protocol-releases-its-first-dapp-bitswing-that-allows-users-to-trade-bitcoin-binary-options","publishDate":"2019-09-30T07:45:16","id":262,"type":null,"title":"Sequoia-backed startup Band Protocol releases its first dApp ‘BitSwing’ that allows users to trade bitcoin binary options","category":["DeFi"],"content":["Band Protocol, a blockchain startup backed by venture capital firm Sequoia India, has released its mainnet as well as its first decentralized application (dApp) called “BitSwing,” which allows users to trade bitcoin (BTC) binary options, a type of derivative product.","Revealing the news exclusively to The Block on Monday, Band Protocol said BitSwing users will be able to take a long or short position in the BTC\/USD market by predicting whether BTC’s price one minute later, will be higher or lower than the spot price.","“Binary option is one of the simplest financial derivatives that most people can understand,” Soravis Srinawakoon, co-founder and CEO of Band Protocol, told The Block, adding that when BitSwing was launched in testnet for one week, it saw over 40,000 transactions - “a significant adoption rate for dApps.”","To participate in the binary options trading, users will have to install Metamask or any similar Web3 wallet that operates on the ethereum-based Kovan testnet, Band Protocol said. Users will then be able to take a long or short position via ether (ETH), betting if BTC will go up or down from that initial position, determined by Band’s decentralized data oracle. “If you are correct, you double the amount of ETH you put in otherwise you lose your stake,” Srinawakoon told The Block.","Indeed, that’s how binary options work - more like a prediction, which can either be right or wrong, but nowhere in between.","Admitting that the one-minute window is “too short,” Srinawakoon said that the window will be expanded as well as more cryptocurrencies will be added to show the potential of decentralized finance or DeFi.","Band Protocol said the testnet launch of BitSwing helped it earn $12,000 worth of testnet ETH in data query fees in its first two weeks. \"If the trend continues, Band Protocol is expected to generate over $300,000 in value per annum for its ecosystem via BitSwing alone.\"","Srinawakoon told The Block that query fees are paid to data providers as an incentive to provide “accurate” data and are paid by dApps who query the data. He added that it is similar to how centralized applications pay for API (application programming interface) access to retrieve data from other websites. Band Protocol gets its price data from sources including CoinGecko, Binance and Upbit and others.","The launch of mainnet and BitSwing follows Band Protocol’s initial exchange offering <a href=\"https:\/\/medium.com\/bandprotocol\/band-protocol-binance-launchpad-summary-de2b8cb1e39a\" data-v-f87c67ca=\"\">(IEO) on Binance Launchpad<\/a> earlier this month via its native token BAND. The firm raised $5.85 million through the IEO, bringing its total funding to date to $10.85 million.","When asked why Band Protocol needs its own token, Srinawakoon told The Block that “similar to how BTC is needed to incentivize miners to act honestly, BAND tokens are used to incentivize data providers to provide accurate data and for token holders to vote for the most trusted data provider to ensure data integrity.”","He added that the firm will continue to work with Binance and other cryptocurrency exchanges to ensure “maximum liquidity for our tokens to the widest audience globally,\" concluding:","“We are fully decentralized so our revenue will come from our staked tokens. We will use most of our tokens to stake for data providers and earn part of query fees. This ensures our long term sustainability as we do not depend solely on the token’s volatile price.”"],"hashtag":[]}