{"summary":"In addition to exchange and wallet services, regional users can also access the firm&#x27;s peer-to-peer exchange OKX P2P. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276521\/okx-launches-exchange-services-and-crypto-wallet-in-argentina","publishDate":"2024-02-07T11:38:26","id":262,"type":null,"title":"OKX launches exchange services and crypto wallet in Argentina","category":["COMPANIES"],"content":["Crypto exchange OKX has launched its crypto exchange services and digital wallet platform in Argentina.&nbsp;","Users in Argentina can access OKX's non-custodial web3 wallet for DeFi activity, NFTs and dApp usage, according to <a href=\"https:\/\/www.prnewswire.com\/news-releases\/okx-expansion-crypto-exchange-and-web3-wallet-launch-in-argentina-302055536.html#:~:text=Argentinians%20can%20now%20also%20use,purchases%20from%20verified%20local%20users\" data-v-f87c67ca=\"\">statement<\/a>. Argentinian users can also access the firm's peer-to-peer trading platform, OKX P2P, which will let verified regional customers enact trades with Spanish-language support and local payment options.&nbsp;","\"We're pleased to officially launch our latest expansion of our world-class crypto exchange and web3 wallet in one of Latin America's most vibrant crypto markets,\" OKX President Hong Fang said in the statement. \"The immense promise of crypto and blockchain is expanding across Latin America, and Argentina represents a crucial launch pad for our regional growth strategy.\"","While the expansion in Argentina bolsters OKX's global reach, the firm faces potential trouble elsewhere in the world. The Block previously <a href=\"https:\/\/www.theblock.co\/amp\/post\/276404\/okx-south-korea-probe\" data-v-f87c67ca=\"\">reported<\/a> that South Korean authorities are investigating OKX for allegedly promoting its token trading platform Jumpstart without the right registration.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Argentina","content":"LOCATION"},{"type":"Hong Fang","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Latin America","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Crypto exchange OKX","content":"ORGANIZATION"}],"hashtag":["OKX"],"authors":["MK Manoylov","The Block"]}