{"summary":"The IRS is seeking customer records from Kraken as part of an investigation of crypto users that spans 2016 to 2020.\nA judge has said the request is too broad.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/100381\/irs-kraken-petition-court-john-doe-summons","publishDate":"2021-04-02T14:19:52","id":2620,"type":null,"title":"IRS must refile its petition to request information from Kraken","category":["Legal"],"content":["The Internal Revenue Service (IRS) is seeking customer records from another crypto exchange. After getting the green light to serve Circle a so-called John Doe summons <a href=\"https:\/\/www.theblockcrypto.com\/linked\/100275\/irs-serves-circle-request-customer-records\" data-v-f87c67ca=\"\">yesterday<\/a>, the Department of Justice has filed for the tax regulator to issue the same request to Kraken.","The Department of Justice's Tax Division filed the petition with the United States District Court for the Northern District of California this week. A John Doe summons requires a judge's approval because it allows the IRS to obtain information about taxpayers who have yet to be identified.&nbsp;","If approved, the IRS would serve the request to Payward Ventures Inc. and its affiliates, also known as Kraken, for information on users that have reached $20,000 in transactions. In an attached statement to the petition request, IRS agent Karen Cincotta said the request is part of an investigation to \"identify and correct federal income tax liability\" for crypto users from 2016 to 2020.&nbsp;","The court has already responded, saying the government's request is \"overbroad\" and that it will have to refile the request with a narrowed scope.","The IRS is seeking basic registration, identification and transaction information, which the court seems to find relevant. But the request also includes what the court deems \"broad categories of information,\" like \"complete user preferences,\" \"any other records of Know-Your-Customer due diligence\" and \"correspondence between Kraken and the User or any third party with access to the account pertaining to the account.\"","The IRS contends that these more broad categories of information may be relevant to identifying a user's account or multiple accounts. But Judge Jacqueline Scott Corley isn't convinced.","In a response to the IRS called an Order to Show Cause, the judge said that the IRS \"should first review basic user information and transaction histories before determining whether further subpoenas — either to the cryptocurrency exchange or to individual users — were necessary.\"&nbsp;","The IRS now has to file a \"narrowly tailored\" version of its request by April 14.&nbsp;","\"Any such response must specifically address why each category of information sought is narrowly tailored to the IRS's investigative needs, including whether requests for more invasive and all-encompassing categories of information could be deferred until after the IRS has reviewed basic account registration information and transaction histories,\" read the judge's order.&nbsp;","Coinbase fought a <a href=\"https:\/\/www.coindesk.com\/14000-coinbase-bitcoin-could-be-affected-irs-tax-summons\" data-v-f87c67ca=\"\">similar IRS request in 2016<\/a>, arguing the regulator took an overly broad stance. The IRS did narrow its summons over the course of the legal battle.&nbsp;","Since then, the IRS has taken a hard line against failure to report crypto holdings, asking taxpayers if they've conducted any taxable activity in crypto at the top of the<a href=\"https:\/\/www.theblockcrypto.com\/linked\/87559\/irs-form-1040-crypto-taxes\" data-v-f87c67ca=\"\"> 1040 form<\/a>. It also sent multiple rounds of <a href=\"https:\/\/www.theblockcrypto.com\/linked\/76021\/irs-letters-taxes-crypto-2020\" data-v-f87c67ca=\"\">letters<\/a> in 2020 reminding holders to report their crypto."],"hashtag":["IRS","KRAKEN"]}