{"summary":"The crypto charts look brutal, but traders don&#x27;t think that we&#x27;ve reached the point of full capitulation.  The price of bitcoin fell to $31,000 earlier","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/105759\/china-drags-down-crypto-market-heres-what-large-traders-are-saying","publishDate":"2021-05-23T19:30:53","id":2624,"type":null,"title":"China drags down crypto market: here’s what large traders are saying","category":["BITCOIN"],"content":["The crypto charts look brutal, but traders don't think that we've reached the point of full capitulation.&nbsp;","The price of bitcoin fell to $31,000 earlier Sunday after a volatile week that saw the price of the largest cryptocurrency whipsaw between $30,000 and $40,000. Elsewhere, cryptocurrencies ranging from ether to Solana to Cardano have clocked in double-digit losses. Liquidations across futures platforms currently stand at about $1.5 billion over the last 24 hours, according to ByBt.&nbsp;","","","As for what drove the market down this weekend, most traders chalked it up to low liquidity and fear around news out of <a href=\"https:\/\/www.theblockcrypto.com\/linked\/93831\/ey-blockchain-ethereum-opschain-china-in-china\" data-v-f87c67ca=\"\">China<\/a>. As per <a href=\"https:\/\/www.theblockcrypto.com\/post\/105708\/china-bitcoin-crackdown-usdt-otc\" data-v-f87c67ca=\"\">reporting<\/a> by The Block's Wolfie Zhao, China's State Council—the country's central governing body—published comments from a meeting of its Financial Stability Development Committee that referenced \"cracking down on bitcoin mining and trading activities\" as part of the committee's efforts of preventing financial risks.&nbsp;","Here's one trader on the state of the market today:","\"I tend to discount weekend moves - most MMs are either of screens or running with much tighter risk limits. Leverage has been flushed out but people are still scared to bid given the uncertainty around China news. Best case scenario fears are overblown and we see people buy over the next week.\"","Another trading firm executive agreed that low liquidity and China were to blame for Sunday's so-called bloodbath.&nbsp;","\"This seems like very low liquidity puke from china worries, not taking too much note of it until liquidity in markets return late Sunday\/Monday,\" he said.&nbsp;","On the positive side, one executive at a large over-the-counter trading desk reported \"tons of net spot buying,\" noting that most of the selling is likely mostly China-based. Another bright spot is the amount of funding that's been raised in recent months by venture firms like Framework Ventures and a16z, for instance.&nbsp;","There's also quite of bit of capital tied up in stablecoins—suggesting traders are waiting for things to settle before they deploy capital again, the person added. The total stablecoin supply is a bit shy of $100 billion.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-stablecoin-supply-daily\/embed\" title=\"Total Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","To be sure, the derivatives market offers one worrying sign, as noted by an aforementioned source.&nbsp;","\"If we continue to slide with higher liquidity I’d be a lot more worried,\" he said. \"On options front hedgers have been rolling down to high 20ks (25-28k) strikes front end) so its possible dealers v short gamma around there again (ie, a break of 30k results in aggressive covering).\"","He added he'd seen some serious large buyers in the mid-20s puts—suggesting some traders believe the price of bitcoin will drop precipitously.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"Financial Stability Development Committee","content":"ORGANIZATION"},{"type":"last 24 hours","content":"DATE"},{"type":"Wolfie Zhao","content":"PERSON"},{"type":"$30,000","content":"MONEY"},{"type":"Cardano","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"weekend","content":"DATE"},{"type":"next week","content":"DATE"},{"type":"$1.5 billion","content":"MONEY"},{"type":"earlier Sunday","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"State Council","content":"ORGANIZATION"},{"type":"$31,000","content":"MONEY"},{"type":"$100 billion","content":"MONEY"},{"type":"$40,000","content":"MONEY"},{"type":"Solana","content":"LOCATION"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}