{"summary":"The Sichuan government is initially targeting 26 mining farms that have been getting a supply of hydroelectricity from state-owned power plants and distributors.\nState-owned power entities have been ordered to expand their inspections on other mining facilities that are using privately supplied energy.","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/108916\/sichuan-orders-state-power-grid-to-cut-supply-for-26-bitcoin-mining-farms","publishDate":"2021-06-18T04:53:48","id":2624,"type":null,"title":"Sichuan orders state power grid to cut supply for 26 bitcoin mining farms","category":["China"],"content":["Sichuan, a major Chinese bitcoin mining hub, due to its abundant hydroelectricity, is the latest province that has issued an order to shut down local bitcoin miners.","The Sichuan Energy Bureau and the Sichuan Development and Reformation Commission jointly issued a document on Friday to their subordinate state-owned power generators and distributors.","Based on the document that is circulating on WeChat, seen and verified by The Block, the government agencies have outlined two main measures in regards to closing down local bitcoin miners. This will have been triggered by the <a href=\"https:\/\/www.theblockcrypto.com\/post\/105708\/china-bitcoin-crackdown-usdt-otc\" data-v-f87c67ca=\"\">high-level comment<\/a> on bitcoin mining brought up in the Chinese State Council's meeting last month.","The measures will directly impact the 26 mining entities that had tried to work with the government, those that had set up in specific industrial zones and registered with the government. It will also seek to crack down on smaller mining operations that get their electricity privately from smaller power plants — under the radar of the State Grid — but this may be less effective.","The first measure requires the subordinate state-owned power generators and distributors, such as the State Grid, to cut off their hydroelectricity supply to 26 entities that have so far been reported as bitcoin mining facilities, by June 20.","Earlier this month, the Sichuan Energy Bureau summoned a meeting with local state-owned power entities to understand how many mining facilities they have been supplying energy to and the impact on the local hydroelectricity economy if they are ordered to shut down.&nbsp;","Based on the list of the 26 entities enclosed at the end of the document, most of them had, in fact, been granted to operate at the Hydroelectricity Consumption Industrial Demonstration Zones in Sichuan in what was previously believed to be a compliant method.&nbsp;","As The Block <a href=\"https:\/\/www.theblockcrypto.com\/daily\/86520\/china-sichuan-hydropower-consumption-parks-bitcoin-mining\" data-v-f87c67ca=\"\">reported<\/a> last year, such industrial parks were set up by the Sichuan government in a bid to attract energy-intensive industries to help consume the excessive hydroelectricity in the region during the summer rainy season that would otherwise be wasted.","Since 2020, dozens of bitcoin mining facilities, including many of the entities on the government's document list, had been approved to reside in these industrial parks to enjoy stable supply from state-owned power grid.","In return, they went through an application process to be registered with the government as well as pay a premium fee to the local government and the State Grid. But perhaps it's because of this prior registration with the local government that they became the first victims of the crackdown.","There is still a significant number of operating bitcoin mining facilities in Sichuan and Yunnan that receive privately supplied energy from smaller power plants, in a way that's under the government's or state-owned power grid's radar. This so-called direct-supply model is a common and yet grey area practice since it bypasses the State Grid as a power distribution middleman.","It's also part of the reason that the Sichuan government set up the hydroelectricity consumption park to battle against these private energy deals between smaller power plants and bitcoin mining sites.","Hence the second measure is that the two provincial government agencies are requiring state-owned power entities as well as municipal and county level governments to expand inspections on their network and immediately cut supply to additional mining facilities if found. They must also compile further progress updates by June 25.","It remains to be seen to what extent subordinate state-owned power plants will inspect bitcoin mining farms using privately generated hydroelectricity. In the meantime, Bitcoin's hash rate has remained steady since Thursday."],"hashtag":["BITCOIN"]}