{"summary":"After the Banana Gun team saw the bug, it sold its treasury, sending the token to near zero price — promising a relaunch with an airdrop.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/250395\/hyped-telegram-bot-banana-guns-team-dumps-treasury-after-token-bug","publishDate":"2023-09-12T07:28:06","id":2629,"type":null,"title":"Hyped Telegram bot Banana Gun&#x27;s team dumps treasury after token bug","category":["CRYPTO ECOSYSTEMS"],"content":["A hyped-up launch for a Telegram bot token went belly up yesterday as the team dumped its treasury in response to a smart contract bug. The team has promised to relaunch with an airdrop for affected participants.","<span data-v-f87c67ca=\"\">The Telegram bot, called Banana Gun, offers the ability for users to snipe upcoming token launches. This involves bribing <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.34%\n    <\/span><\/a> <!----><\/span><\/span> validators to prioritize these sniping transactions over others.&nbsp;<\/span>","In the past three months, the bot gained <a href=\"https:\/\/twitter.com\/BananaGunBot\/status\/1698778667298472221\" data-v-f87c67ca=\"\">considerable traction<\/a> and generated revenues amounting to 500 ETH ($750,000), as <a href=\"https:\/\/twitter.com\/BananaGunBot\/status\/1698778675317969023\" data-v-f87c67ca=\"\">reported<\/a> by the team.","The idea behind the recent launch of the Banana token was to facilitate revenue sharing with holders. This revenue would be generated from the actual use of the bot and from taxes on token purchases and sales. The plan also included offering cashback to users who traded tokens using the bot, as well as implementing token burns to help offset potential increases in supply.","On September 8, the Banana Gun team sold 2 million tokens for 800 ETH ($1.2 million) in a presale at $0.65 per token. Around 800 wallets participated. During the presale, it failed to filter out whitelisted candidates from using multiple wallets to claim more than one allocation, but this was fixed retroactively.","The token launched on September 11. It initially shot up to a value of $7, before reaching a peak at $8, <a href=\"https:\/\/dexscreener.com\/ethereum\/0xCcF5CF1D039F1a7B66Be855B79B14A01D0a4dbd5\" data-v-f87c67ca=\"\">according to Dexscreener<\/a>.","However, this surge was short-lived, persisting for about an hour before the team <a href=\"https:\/\/twitter.com\/BananaGunBot\/status\/1701322684313817459\" data-v-f87c67ca=\"\">disclosed<\/a> a significant issue with the fee calculation in the token's smart contract. Due to this bug, the 4% transaction fee would not be redirected to the protocol’s treasury as intended, but would instead remain in the wallet of the user initiating the transaction, bypassing both the team and the Banana token holders.","This revelation prompted the team to make the drastic decision to sell the tokens from its treasury wallet to reclaim the liquidity and facilitate a new launch.","“First step is to sell the treasury wallet to drain the LP (which is locked) so we can reuse it for the new contract. Secondly, we will relaunch ASAP with an airdrop so everyone will be made whole,” the team said in its Telegram channel.","<span data-v-f87c67ca=\"\">The BANANA token crashed after the team dumped its treasury tokens. Image: Dexscreener.<\/span>","The majority of the project’s tokens, some 6.38 million tokens representing 63.8% of the token’s supply, were allocated to the project treasury.","For the launch, the project set aside 500,000 Banana tokens and $325,000 in wrapped ether (WETH) to provide adequate liquidity on decentralized exchanges.","In an attempt to recuperate the initially invested $325,000 in WETH liquidity, the team decided to sell its treasury tokens through decentralized exchanges. This action, led to a drastic drop in the token’s value, plummeting to a mere $0.025.","“Understand you guys are mad, it sucks. We had a great launch and this ruined it,” the team said on Telegram. “Just know we are here, we are going to figure it out and come back stronger.”","The team followed up by saying it is having its new token contract audited, adding that it will airdrop the new tokens to all previous holders who sold their tokens after the bug was disclosed. Any traders who bought more than they sold as the token’s price crashed will be refunded in ether, the team claimed.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"63.8%","content":"PERCENT"},{"type":"September 8","content":"DATE"},{"type":"LP","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"$325,000","content":"MONEY"},{"type":"$1.2 million","content":"MONEY"},{"type":"September 11","content":"DATE"},{"type":"+0.34%","content":"PERCENT"},{"type":"$0.65","content":"MONEY"},{"type":"$7","content":"MONEY"},{"type":"$8","content":"MONEY"},{"type":"Banana","content":"LOCATION"},{"type":"$0.025","content":"MONEY"},{"type":"Telegram bot","content":"ORGANIZATION"},{"type":"$750,000","content":"MONEY"}],"hashtag":["DEXS","UNISWAP"],"authors":["Tim Copeland","The Block"]}