{"summary":"A group of eight U.S. state attorneys general filed a joint amicus brief on Thursday, arguing that the SEC’s enforcement action against the cryptocurrency exchange Kraken exceeded its delegated powers.","author":["Timmy Shen","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280031\/eight-state-ags-in-us-challenge-secs-authority-in-kraken-lawsuit-with-joint-amicus-brief","publishDate":"2024-03-01T00:55:18","id":2631,"type":null,"title":"Eight state AGs in US challenge SEC&#x27;s authority in Kraken lawsuit with joint amicus brief","category":["Legal"],"content":["A group of attorneys general for eight U.S. states submitted a joint amicus brief on Thursday, arguing that the Securities and Exchange Commission’s <a href=\"https:\/\/www.theblock.co\/post\/263898\/sec-files-new-lawsuit-against-kraken-for-allegedly-operating-online-trading-platform-without-registering\" data-v-f87c67ca=\"\">lawsuit<\/a> against Kraken exceeds the regulator’s authority.","In the joint filing, the attorneys general of Montana, Arkansas, Iowa, Mississippi, Nebraska, Ohio, South Dakota, and Texas claimed that the amicus does not support either party but <span data-v-f87c67ca=\"\">it “opposes the SEC’s regulation of crypto assets absent an investment contract because Congress has not delegated this authority to the SEC.”<\/span>","The filing stated that the states have a strong interest in preventing the potential preemption of consumer protection and other state laws by the SEC’s attempt to regulate crypto assets as securities.","<span data-v-f87c67ca=\"\">“The SEC’s enforcement action exceeds its delegated powers,” the filing added. “The court should reject categorizing crypto assets as securities absent an investment contract. The SEC’s exercise of this undelegated authority puts state consumers at risk by preempting state statutes better tailored to the specific risks of non-securities products.”<\/span>","The amicus briefing follows Kraken’s <a href=\"https:\/\/www.theblock.co\/post\/278737\/kraken-dismiss-sec-lawsuit\" data-v-f87c67ca=\"\">motion last week to dismiss<\/a> the SEC’s lawsuit. Kraken stated in a blog post that the SEC’s claim was flawed, as the regulator argued that the crypto exchange operates an unlicensed platform for “investment contracts” without identifying any “contract” between Kraken users and token issuers.","In November, the SEC <a href=\"https:\/\/www.theblock.co\/post\/263898\/sec-files-new-lawsuit-against-kraken-for-allegedly-operating-online-trading-platform-without-registering\" data-v-f87c67ca=\"\">filed a lawsuit<\/a> against Kraken, accusing the crypto exchange of multiple charges, including operating without registration, failing to prevent known conflicts of interest, and commingling client funds."],"hashtag":["KRAKEN","LAWSUITS","SEC"]}