{"summary":"Elliptic says recent figures being used to portray the scale of crypto fundraising by terrorist groups are being misrepresented.\n“The unique traceability of these assets have meant that the amounts raised remain tiny compared to other funding sources,” Elliptic said.","author":["MK Manoylov","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/259527\/elliptic-says-scale-of-crypto-based-terrorism-funding-is-being-misrepresented","publishDate":"2023-10-25T16:28:59","id":2635,"type":null,"title":"Elliptic says scale of crypto-based terrorism funding is being misrepresented","category":["Companies"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Blockchain forensics firm Elliptic said Wednesday that recent figures being used to portray the scale of crypto fundraising by Hamas are being misrepresented, with little actual evidence that terrorist groups are using digital currencies with much success.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">While Hamas first solicited bitcoin donations in 2019, it stopped all public-facing crypto fundraising in April, citing \"concern about the safety of donors and to spare them any harm,\" Elliptic said in a blog <a href=\"https:\/\/www.elliptic.co\/blog\/setting-the-record-straight-on-crypto-crowdfunding-by-hamas\" data-v-f87c67ca=\"\">post<\/a>. Since the recent attacks in Israel on Oct. 7, the firm said only $21,000 in fresh crypto donations have arrived, with much of it already frozen.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The unique traceability of these assets have meant that the amounts raised remain tiny compared to other funding sources,\" Elliptic said. \"No public crypto fundraising campaign by a terrorist group has received significant levels of donations, relative to other funding sources.\"<\/span>","The possible use of crypto by terrorist organizations <a href=\"https:\/\/www.theblock.co\/post\/258183\/sen-elizabeth-warren-joins-more-than-100-lawmakers-to-ask-biden-about-plans-to-prevent-crypto-financed-terrorism\" data-v-f87c67ca=\"\">came into focus<\/a> earlier this month after a group of more than 100 U.S. lawmakers, including Sen. Elizabeth Warren, D-Mass., cited a <a href=\"https:\/\/www.wsj.com\/world\/middle-east\/militants-behind-israel-attack-raised-millions-in-crypto-b9134b7a?mod=e2tw\" data-v-f87c67ca=\"\">report<\/a> from the Wall Street Journal that said Hamas, along with other militant groups, raised millions worth of crypto ahead of the attacks in Israel.","\"There is no evidence to suggest that crypto fundraising has raised anything close to this amount, and data provided by Elliptic and others has been misinterpreted,\" <span class=\"s1\" data-v-f87c67ca=\"\">Elliptic said. \"We have spoken to representatives of the lead signatory, Senator Warren, as well as the authors of the Wall Street Journal article, to clarify this.\"<\/span>","Chainalysis, another crypto analytics firm, has <a href=\"https:\/\/www.theblock.co\/post\/258284\/chainalysis-says-some-reports-might-be-overestimating-cryptos-role-in-terrorist-financing\" data-v-f87c67ca=\"\">also argued<\/a> that reports about the supposed use of crypto by terrorist organizations might be overstating metrics and using \"flawed analyses.\"","\"Although terrorism financing is a very small portion of the already very small portion of cryptocurrency transaction volume that is illicit, some terrorist organizations raise, store, and transfer funds using cryptocurrency,\" it wrote in a&nbsp;<a href=\"https:\/\/www.chainalysis.com\/blog\/cryptocurrency-terrorism-financing-accuracy-check\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">blog<\/a>&nbsp;post. \"Terrorist organizations have historically used and will likely continue to use traditional, fiat-based methods such as financial institutions, hawalas, and shell companies as their primary financing vehicles.\"","<span class=\"s1\" data-v-f87c67ca=\"\">Adam Zarazinski, CEO of the crypto-focused data analytics firm Inca Digital, also <a href=\"https:\/\/democrats-financialservices.house.gov\/uploadedfiles\/hhrg-118-ba10-wstate-zarazinskia-20231025.pdf\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">testified<\/span><\/a> before the House Financial Services Committee stating that, \"while cryptocurrency can be employed in activities that challenge our security and values, it also holds the potential to democratize finance, spur economic growth, and foster financial inclusion globally.\"<\/span>"],"hashtag":[]}