{"summary":"The Ethereum blockchain is anticipated to move from proof-of-work (PoW) to proof-of-stake (PoS) on or around September 15, 2022. In a PoS system,","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/169682\/the-ethereum-merge-on-chain-indicators-to-watch","publishDate":"2022-09-14T08:49:11","id":2635,"type":null,"title":"The Ethereum Merge: On-chain Indicators to Watch","category":["SPONSORED"],"content":["<span data-contrast=\"auto\" data-v-f87c67ca=\"\">The Ethereum blockchain is anticipated to move from proof-of-work (PoW) to proof-of-stake (PoS) on or around September 15, 2022. In a PoS system, validators \"stake\" the native coin of the blockchain by transferring it to a smart contract, where it remains locked. A random validator is then picked to validate each new block and collect the accompanying reward. In the case of Ethereum, validators are required to stake 32 Ether, but consumers can earn staking rewards by joining a staking pool with less. Compared to the PoW consensus process, which requires miners to compete for new block validation by using a lot of energy and computer capacity, PoS is more environmentally friendly. On top of this, many believe the switch to PoS can reduce the risk of over-centralization by opening up the validator role to anyone with Ether to stake, as opposed to just those with expensive mining equipment.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Ethereum's Eth2 PoS blockchain has been functioning in a testing state known as the Beacon Chain since late 2020, but with the switch—known as \"The Merge”— Eth1 and Eth2 will be combined to create a single blockchain, with the former serving as the execution layer for transactions and the latter acting as the consensus layer for PoS consensus. Below, we'll explore the potential ramifications of The Merge, as well as the on-chain markers observers can use to monitor those impacts.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<b data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\">Increased Ethereum staking following The Merge<\/span><\/b><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">A primary question of interest is whether The Merge will spur more staking activity on the Ethereum blockchain.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Even before replacing Eth1, the Eth2 blockchain has become the biggest PoS blockchain by value, thanks to the users who have already staked more than $30 billion worth of Ether. Some have staked directly by setting up their own validator nodes, which requires specialized software and hardware in addition to 32 Ether. Others have staked by sending Ethereum to a staking pool — similar to a mining pool, staking pools allow several users to pool their resources, increase their chances of being selected to propose a new block, and share the rewards among themselves.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","","","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Staking could become an even more attractive proposition following The Merge for a few reasons. For one, users will likely become more comfortable staking once PoS is officially in place and PoW is left in the past. The switch to PoS will also make Ethereum more eco-friendly, which could make investors with sustainability commitments more comfortable with the asset. This especially applies to institutional investors, who we’ll cover more later.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">The Merge also paves the way for additional future enhancements to Ethereum. At this time, Ether that has been directly staked on Eth2 is locked in the contract and cannot be removed. With staking services that offer liquid, synthetic assets that represent customers' staked Ether (such synthetics, though, don't necessarily maintain a 1:1 peg with Ether), stakers can become more liquid. While The Merge won't instantly change this, the Shanghai upgrade—scheduled for six to twelve months after The Merge—will let users withdraw staked Ether at any time. This will increase stakers' liquidity and make staking more alluring as a whole. Following The Merge, sharding and other scalability enhancements aimed at reducing gas costs and speeding up transaction times are also in the works.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Taken together, these changes, starting with The Merge, should make Ether a more attractive asset to hold, and therefore to stake as well.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<b data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\">Institutional investors embracing Ethereum<\/span><\/b><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">With potential increased staking overall, will we see institutional investors begin or ramp up their Ethereum staking activity?<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">We've previously written on the increasing correlation between the values of cryptoassets, like Bitcoin, and those of tech stocks and other high-risk, high-reward assets. However, after The Merge, Ether's price may start to diverge from other cryptocurrencies since its staking rewards would resemble those of a bond or a commodity with a carry premium. Before taking into account the possibility that the price of Ether itself will rise, which would also increase returns in terms of fiat value (of course, Ether's price could also fall, which would hurt fiat returns), some predict that stakers can expect Ether yields of 10-15% annually from staking rewards and transaction fees distributed among validators. With those returns, institutional investors may find Ethereum staking to be a compelling alternative to bonds. For comparison, yields for one-year U.S. Treasury bonds sit at 3.5% as of September 2022, though that number has been rising over the past year.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">The data shows that the number of wallets staking $1 million or more worth of Ether — which we’ll refer to as institutional stakers — has been steadily increasing already.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","","","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">We’ll be closely monitoring the space to see if the number of institutional-sized stakers increases at a faster rate following The Merge, as this could be a good indicator that institutional investors do indeed see Ethereum staking as a good yield-generating strategy.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<b data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\">Ethereum miners will have to go somewhere, but Bitcoin probably isn’t an option<\/span><\/b><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Ethereum’s switch to PoS will also necessitate changes in mining activity. Right now, many miners and mining pools mine assets across several different blockchains, dynamically distributing their hashrate between blockchains based on market trends. Generally though, most mining focuses on Bitcoin and Ethereum.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","","","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">After The Merge, hashrate dedicated to Ethereum mining will either disappear or disperse to other blockchains. But don't anticipate that hashrate to migrate to Bitcoin. Why? Bitcoin cannot be mined with Ethereum mining technology. While the majority of Ethereum miners utilize GPUs (graphics processing units), Bitcoin miners employ ASICs&nbsp; (application-specific integrated circuits), which can perform much more computing intensive tasks. The Ethereum blockchain was built to be ASIC-resistant, meaning it requires a sort of hashing that cannot be carried out by ASICs, whereas GPUs are ill-equipped to successfully mine Bitcoin. As such, GPU miners will suffer greatly as a result of Ethereum's move to PoS. Currently, Ethereum accounts for 97% of all GPU mining activity, while the market capitalization of all other GPU-mineable currencies is roughly $4.1 billion, or barely 2% of Ethereum's. That is insufficient to sustain GPU mining.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">So, does this mean that millions of once-productive GPUs will be left without any viable options to continue making money in cryptocurrency? There are several services built on the Ethereum blockchain that tap into the power of distributed GPUs to accomplish specific computing tasks in a decentralized manner, with GPU owners receiving Ether or ERC-20 token rewards in return. Consider the two following examples:<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">The graph below shows the number of weekly Ethereum transactions sent from the LivePeer and Render smart contracts, some of which reflect rewards to GPU owners contributing to the services’ respective networks (note: the graph doesn’t include rewards paid out in each network’s native token).&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","","","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">While on-chain activity has declined recently, it’ll be interesting to see if these networks and similar ones experience an uptick in activity given a potential influx of GPU owners seeking yield opportunities following the Ethereum merge. Another possibility is that miners may end up selling their GPUs to businesses that provide non-crypto uses for GPUs, such as providing processing for data centers, gaming computers, and other heavy-duty machines.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<b data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\">The merge’s impact on crypto markets starts with on-chain data<\/span><\/b><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Overall, The Merge could have big implications for Ether’s price and overall attractiveness as an asset, which in turn impacts staking, mining, and institutional adoption of cryptocurrency. While it’s impossible to predict the exact market reactions or how pronounced they’ll be, the on-chain metrics we outline above can help you track them following The Merge.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<b data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\">How Chainalysis will support customers post-Merge<\/span><\/b><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">With The Merge, we’ll keep a close eye on potential cybercriminals that may seek to take advantage of confusion around The Merge. The Ethereum Foundation has posted warnings about scams that, for instance, ask users to send Ether to an address to “upgrade to Eth2.” If any such scams gain traction, we’ll be ready to provide the tools and services to support our law enforcement and private sector partners in tracking the activity of those responsible.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">There’s also the possibility that if enough miners don’t want to comply with Eth2’s PoS requirements, they could create a rival fork of the Ethereum blockchain that continues with PoW. While we don’t expect this to happen, <\/span><a href=\"https:\/\/www.chainalysis.com\/\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">Chainalysis<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\"> will monitor any emergent forks that gain traction and be ready to evaluate needs around support of the new fork.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Chainalysis <\/i><i data-v-f87c67ca=\"\">and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$4.1 billion","content":"MONEY"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"2%","content":"PERCENT"},{"type":"3.5%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"97%","content":"PERCENT"},{"type":"20","content":"DATE"},{"type":"GPU","content":"ORGANIZATION"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Ethereum's","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"15%","content":"PERCENT"},{"type":"September 2022","content":"DATE"},{"type":"late 2020","content":"DATE"},{"type":"Shanghai","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"September 15, 2022","content":"DATE"},{"type":"Ethereum","content":"LOCATION"},{"type":"$30 billion","content":"MONEY"}],"hashtag":[],"authors":["Sponsored","The Block"]}