{"summary":"Liquid staking protocol Ether.Fi raised a $5.3 million round led by North Island Ventures and Chapter One. \nThe round, which closed this month after beginning the raising process earlier this year, featured participation from 35 investors.\nOther participating investors include Node Capital, Arrington Capital, Maelstrom, Version One Ventures and Purpose Investments. ","author":["Tom Matsuda","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215620\/etherfi-raises-funding","publishDate":"2023-02-28T06:48:31","id":2636,"type":null,"title":"Ether.Fi raises $5.3 million in funding in a bid to help decentralize staking","category":["Deals"],"content":["Liquid staking protocol Ether.Fi raised a $5.3 million round led by North Island Ventures and Chapter One.&nbsp;","The round, which closed this month after beginning the raising process earlier this year, featured participation from a total of 35 investors, said founder Mike Silagadze in an interview with The Block. Other participating investors include Node Capital, Arrington Capital, Maelstrom, Version One Ventures and Purpose Investments.&nbsp;","Previously the co-founder of edtech Top Hat, Silagadze decided to trade in making courseware for crypto in 2021 to run an ether staking fund named Gadze Finance.&nbsp;","\"I'd actually been investing in and I guess you know, playing around with the crypto space since, since 2011, I mean literally before there were even any exchanges,\" he said in an interview with The Block.&nbsp;","His next venture Ether.Fi aims to build a decentralized non-custodial staking solution. The protocol allows stakers to retain control of their keys while delegating validator operation to a node operator, said the release announcing the funding round. Silagadze said that the majority of the current providers are custodial and centralized.&nbsp;","Ethereum stakers that use Ether.Fi are also granted an NFT representation of every validator generated. Those NFTs allow for the storage of metadata, which Ether.Fi hopes developers will use to build out further staking infrastructure.&nbsp;","The funding will be used to hire more engineers for the team and pursue further partnerships in addition to its current relationships with node operators such as Kiln and Finoa. The protocol is set to launch on March 4 at ETHDenver."],"hashtag":["STAKING"]}