{"summary":"Solend, a lending protocol on Solana, is scrambling to liquidate a large loan to prevent facing bad debt.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/184646\/solend-struggling-to-liquidate-sol-loan-due-to-congestion","publishDate":"2022-11-09T07:45:31","id":2640,"type":null,"title":"Solend struggling to liquidate SOL loan due to congestion","category":["LAYER 1S"],"content":["<span data-v-f87c67ca=\"\">A large lending position on Solana-based lending platform Solend is now underwater but infrastructure issues are preventing it from being properly liquidated. As a result, the protocol faces the risk of accruing bad debt.<\/span>","<span data-v-f87c67ca=\"\">The loan<\/span> <a href=\"https:\/\/solend.fi\/dashboard?wallet=3oSE9CtGMQeAdtkm2U3ENhEpkFMfvrckJMA8QwVsuRbE\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">resides<\/span><\/a><span data-v-f87c67ca=\"\"> in Solend's main lending pool. A sharp fall in the price of solana (SOL) — down about 50% in the last three days — has lowered the value of the collateral used for the loan. Under normal conditions, the loan would have been liquidated by other market participants. Yet the platform has faced oracle issues related to congestion on the network, frustrating these efforts.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">This loan belongs to a large user who holds the biggest position on the main pool. The user owes the protocol $29.7 million in USDC at the time of writing against $32.6 million in SOL collateral. The position is above Solend’s liquidation threshold of 85%, which is $27.6 million. The protocol has to sell nearly $2 million in SOL collateral to bring back the loan under the liquidation threshold.<\/span>","<span data-v-f87c67ca=\"\">While the protocol has been liquidating collateral from the position to protect its assets, it's struggling to finish due to Solana’s congestion issues. The lending platform itself displays a&nbsp;<a href=\"https:\/\/solend.fi\/dashboard\" data-v-f87c67ca=\"\">warning<\/a>: \"Solana is currently congested with oracle updates being intermittent, users might face issues withdrawing.\"<\/span>","<span data-v-f87c67ca=\"\">The project<\/span> <a href=\"https:\/\/twitter.com\/solendprotocol\/status\/1590199684659703808\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">clarified<\/span><\/a><span data-v-f87c67ca=\"\"> the owner of the large loan is being liquidated slowly despite the technical challenges.“Congestion issues on Solend have improved and partial liquidations of the whale account have been occurring with no major issues,” Solend tweeted.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$29.7 million","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"$32.6 million","content":"MONEY"},{"type":"SOL","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$2 million","content":"MONEY"},{"type":"Solend","content":"LOCATION"},{"type":"$27.6 million","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"Solana","content":"LOCATION"},{"type":"85%","content":"PERCENT"}],"hashtag":["CRYPTO"],"authors":["Vishal Chawla","The Block"]}