{"summary":"Kucoin’s Twitter handle was compromised for 45 minutes today — resulting in asset losses of 22,638 USDT.","author":["Adam James","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/227834\/kucoin-twitter-hack","publishDate":"2023-04-24T01:48:29","id":2645,"type":null,"title":"Kucoin Twitter account compromised, exchange promises reimbursements","category":["Security"],"content":["Crypto exchange Kucoin's Twitter handle was compromised for 45 minutes today — leading to asset losses for multiple users.","\"Kucoin will fully reimburse all verified asset losses caused by the social media breach and the fake activity,\" the exchange <a href=\"https:\/\/twitter.com\/kucoincom\/status\/1650336619730436099\" data-v-f87c67ca=\"\">tweeted<\/a> after regaining access to the Twitter account.","The exchange identified 22 transactions that interacted with the fraudulent tweets — resulting in a total loss of roughly 22,638 USDT. \"To prevent more users from being harmed, we are currently examining and blocking suspicious addresses,\" Kucoin <a href=\"https:\/\/twitter.com\/kucoincom\/status\/1650336624046411777\" data-v-f87c67ca=\"\">tweeted<\/a>.","Though Kucoin's Twitter account was compromised, it claims assets on the exchange remain secure. It also claims to be \"conducting a thorough investigation of the incident with Twitter to prevent similar occurrences in the future.\"","In other Kucoin news, New York State Attorney General Letitia James <a href=\"https:\/\/www.theblock.co\/post\/218600\/new-york-sues-kucoin-claims-ether-is-an-unregistered-security\" data-v-f87c67ca=\"\">sued<\/a> the exchange last month, claiming it is an unregistered commodities and securities broker or dealer.","The crypto exchange “offered, sold and purchased and effected transactions in cryptocurrencies that were commodities and securities within New York, without having been registered as a commodity broker-dealer and securities broker or dealer in New York,” James argues in the suit brought against the Seychelles-based firm Thursday.&nbsp;","Notably, the suit also listed ether as an unregistered security.","<em data-v-f87c67ca=\"\">This article has been updated with information about Kucoin being sued by New York State Attorney General Letitia James.<\/em>"],"hashtag":["EXPLOITS","HACKS"]}