{"summary":"In an industry ripe with insider trading, Binance is letting users bet on which tokens will come next to its futures platform.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281072\/binance-will-let-users-bet-on-futures-platform-token-listings","publishDate":"2024-03-07T05:34:14","id":2646,"type":null,"title":"Binance will let users bet on futures platform token listings","category":["COMPANIES"],"content":["Crypto exchange Binance introduced its Next platform, which allows users to speculate on which tokens will be the next to come to its futures exchange.","The exchange said that users could nominate tokens to be listed, according to an <a href=\"https:\/\/www.binance.com\/en\/support\/faq\/introducing-futures-next-predict-token-listings-and-earn-on-usd%E2%93%A2-m-futures-market-265b425e3a964f6bb585bd8520b91072\" data-v-f87c67ca=\"\">announcement<\/a> today. Once nominated, any trader can place bets on them. If successful, these users would earn rewards in the form of bonus vouchers for futures trading or trading fee rebates. Bets are rewarded with vouchers worth 1.2 times traders’ picks.","Traders can wager on potential token listings by purchasing a “pick” for 1 USDT. Traders may make predictions for up to three digital tokens, with a maximum of 100 picks at a time. If the token is not listed, the trader can retrieve their stablecoins.","The exchange clarified that this is not a voting platform to assist in choosing which tokens to list and said it would continue to use its current process.","\"Futures NEXT operates independently of Binance's listing process, focusing on rewarding accurate market predictions rather than influencing token listings,\" it said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BINANCE"],"authors":["Tim Copeland","The Block"]}