{"summary":"Alex Obadia leads Research and Platform efforts at Cambrial Capital, a fund of crypto funds based in London and Berlin. He also organizes the London DeFi","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/45750\/exploring-defi-trading-strategies-arbitrage-in-defi","publishDate":"2019-11-04T17:25:29","id":2648,"type":null,"title":"Exploring DeFi trading strategies: Arbitrage in DeFi","category":["DEFI"],"content":["<a href=\"https:\/\/twitter.com\/ObadiaAlex\" target=\"_blank\" rel=\"noopener noreferrer\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/twitter.com\/ObadiaAlex&amp;source=gmail&amp;ust=1573240693947000&amp;usg=AFQjCNHJ1T9TYh30gcIItMVUkq87XVtrPg\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Alex Obadia<\/i><\/a><i data-v-f87c67ca=\"\">&nbsp;leads Research and Platform efforts at&nbsp;<\/i><a href=\"https:\/\/cambrial.com\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/cambrial.com\/&amp;source=gmail&amp;ust=1573240693948000&amp;usg=AFQjCNEU9iRZ92DireFu3t847i8c2gTU2A\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Cambrial Capital<\/i><\/a><i data-v-f87c67ca=\"\">, a fund of crypto funds based in London and Berlin. He also organizes the London DeFi Summit and the monthly Zero Knowledge London meetups. This piece is purely for informational purposes; nothing in this post should be construed as investment advice.<\/i>","Decentralized Finance (DeFi) is a term created around a year ago to describe the movement of projects dedicated to building a new transparent, permissionless and programmable financial infrastructure. A year later, <a href=\"https:\/\/medium.com\/alethio\/the-defi-series-monitoring-activities-user-community-growth-f274946d0ac9\" data-v-f87c67ca=\"\">the movement has grown in size, followers and diversity<\/a> to be considered a promising short-term catalyst for the next wave of blockchain-based technology adoption. Although DeFi has grown, its markets remain inefficient and fragmented compared to their centralized counterparts.&nbsp;","Market fragmentation and inefficiencies are music to the ears of traders seeking alpha. This piece is a product of Cambrial’s research on the investability of these opportunities and the novel considerations they involve. As a fund of crypto funds, we’re interested in these opportunities as a potential source of durable, absolute, uncorrelated to traditional markets, attractive risk-adjusted returns. We believe those returns are subject to different risks than ‘traditional’ crypto trading returns and therefore can improve risk diversification within a portfolio of crypto trading strategies.","This post will examine arbitrage opportunities in DeFi splitting them into yield arbitrage and cross-exchange arbitrage. The aim is to provide 1) an understanding of some of the strategies being run on this new infrastructure including the risks they involve, 2) beginning of thoughts on the durability of these strategies and the (re)definition of arbitrage in DeFi. Some knowledge of DeFi is assumed and we recommend reading <a href=\"https:\/\/medium.com\/macro-narratives-in-blockchain\/the-next-fintech-global-open-finance-infrastructure-90ac093a411b\" data-v-f87c67ca=\"\">this introduction<\/a> to DeFi if you’re new to the subject.","Arbitrage (definition):<i data-v-f87c67ca=\"\">&nbsp;<\/i>","<i data-v-f87c67ca=\"\">The quasi-simultaneous purchase and sale of an asset, or similar assets, to profit from an imbalance in its price on different markets or in different forms. <\/i><a href=\"https:\/\/www.investopedia.com\/terms\/a\/arbitrage.asp.\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">(Source)<\/i><\/a>","The fragmentation and inefficiencies of DeFi markets mean that prices for the same financial instruments vary across different DeFi venues (fragmentation) and adjust differently to the same market movements (inefficiencies). In other words, these are fertile ground for arbitrage trades. We split DeFi arbitrage strategies in two categories: yield arbitrage and cross-exchange arbitrage.","Yield arbitrage strategies are executed between different lending products (i.e. interest rate arbitrage) or between staked assets. These strategies are profitable today as rates are significantly fragmented across the space and relatively non-competitive. Capacity (i.e. how much money can be put into these), although hard to estimate, is a function of traded volume and outstanding available tokens. Below are three examples of yield arbitrage trades, along with the risks involved with them, executed by our imaginary trader Bernie:","Eg1. Cross-asset single platform interest rate arbitrage","<i data-v-f87c67ca=\"\">⇒ On May 18th, our trader Bernie is using <\/i><a href=\"https:\/\/compound.finance\/\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Compound V2<\/i><\/a><i data-v-f87c67ca=\"\">, <\/i><i data-v-f87c67ca=\"\">a transparent, autonomous money market that allows users &amp; applications to frictionlessly earn interest or borrow Ethereum assets without relying on a counterparty.&nbsp;<\/i>","<i data-v-f87c67ca=\"\">⇒ He notices the borrowing APR of USDC (7.8% p.a.) is below the supply APR of DAI (14.5% p.a.).&nbsp;<\/i>","<i data-v-f87c67ca=\"\">⇒ Suppose Bernie is already in possession of DAI.&nbsp;<\/i>","<i data-v-f87c67ca=\"\">⇒ Bernie borrows USDC stablecoin against DAI collateral.&nbsp;<\/i>","<i data-v-f87c67ca=\"\">⇒ He then converts said USDC into DAI.<\/i>","<i data-v-f87c67ca=\"\">⇒ Finally, he lends his newly acquired DAI, making a 6.7% p.a. spread.&nbsp;<\/i>","<i data-v-f87c67ca=\"\">(Data source: <\/i><a href=\"https:\/\/loanscan.io\/\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Loanscan<\/i><\/a><i data-v-f87c67ca=\"\">)<\/i>","The main risk of this opportunity is its episodic nature and the potential for disadvantageous rate changes possible with variable interest rate debt products. Other risks include variable transaction costs (i.e. gas) that have to be included in the inequality (USDC borrowing APR &lt; DAI supply APR + transaction costs), the implicit market risk of the USDC\/DAI and DAI\/USD pairs (i.e. peg deviation risk) and systemic risk (i.e. failure of Compound smart contracts).","","","<em data-v-f87c67ca=\"\"><b data-v-f87c67ca=\"\">Chart:<\/b> Spread between DAI lending rate and USDC borrowing rate on Compound V2<\/em>","<b data-v-f87c67ca=\"\">Source:<\/b> <a href=\"https:\/\/info.binance.com\/en\/research\/marketresearch\/img\/issue19\/Binance-Research-Defi-2-Arbitrage-and-Carry-Trade-Strategies.pdf\" data-v-f87c67ca=\"\">Binance Research<\/a>, <a href=\"https:\/\/loanscan.io\/\" data-v-f87c67ca=\"\">Loanscan<\/a>","One can imagine other declinations of this strategy such as cross-asset cross-platform interest rate arbitrage (eg. between margin trading platform <a href=\"https:\/\/defitutorials.substack.com\/p\/margin-trading-using-dydx-exchange\" data-v-f87c67ca=\"\">DyDx<\/a> and Compound) and single-asset cross-platform interest rate arbitrage. Executing a trade across lending platforms invites new considerations such as the different rate change mechanisms. (i.e. Compound has linear borrow and superlinear supply rate curves while dYdX has a superlinear borrow <i data-v-f87c67ca=\"\">and<\/i> supply rate curve).&nbsp;","Eg2. BlockFi\/DyDx interest rate arbitrage<b data-v-f87c67ca=\"\">&nbsp;<\/b>","⇒ <a href=\"https:\/\/defitutorials.substack.com\/p\/margin-trading-using-dydx-exchange\" data-v-f87c67ca=\"\">DyDx <\/a>is an open trading platform for crypto assets where users can margin trade with up to 5x leverage, borrow and lend trustlessly. <a href=\"https:\/\/blockfi.com\/\" data-v-f87c67ca=\"\">BlockFi<\/a> is a custodial lending platform that allows users to borrow and lend large market-cap cryptoassets such as Bitcoin (BTC) or Ethereum (ETH).","<i data-v-f87c67ca=\"\">⇒ Again, suppose Bernie is already in possession of DAI or USDC.<\/i>","<i data-v-f87c67ca=\"\">⇒ Bernie borrows ETH on DyDx (at an initial rate of 0.99% p.a.) with DAI or USDC as collateral.&nbsp;<\/i>","<i data-v-f87c67ca=\"\">⇒ Bernie can then lend that ETH on BlockFi for 3.3% p.a.<\/i>","<i data-v-f87c67ca=\"\">(Source: <\/i><a href=\"https:\/\/info.binance.com\/en\/research\/marketresearch\/img\/issue19\/Binance-Research-Defi-2-Arbitrage-and-Carry-Trade-Strategies.pdf\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Binance research<\/i><\/a><i data-v-f87c67ca=\"\">)<\/i>","The risks to this opportunity are the variable rate change risk mentioned above (which have shown to change rather fast in the past for BlockFi), liquidation risk on DyDx (which includes basis risk\/social loss risk too and depends on price volatility of ETH), smart contract risk and loan matching delay on BlockFi’s side should you not find a borrower immediately.","Eg3. Staking yield arbitrage&nbsp;","⇒ Staking can enable token holders to generate yield on their tokens as a reward for contributing to the token’s network.","<i data-v-f87c67ca=\"\">⇒ Suppose Bernie’s token X is currently making 5% p.a. staked.&nbsp;<\/i>","<i data-v-f87c67ca=\"\">⇒ As Bernie currently doesn’t need to use his token X, he swaps it for another asset, say XTZ (Tezos), which has a higher yield of 7.1% at the moment.&nbsp;<\/i>","<i data-v-f87c67ca=\"\">⇒ When Bernie needs to use the X token he swaps his XTZ back to X, pocketing the extra 2.1% p.a. yield generated.<\/i>","<i data-v-f87c67ca=\"\">(Data source: <\/i><a href=\"https:\/\/staked.us\/yields\/\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Staked<\/i><\/a><i data-v-f87c67ca=\"\">)<\/i>","There are five key risks to this opportunity:&nbsp;","<i data-v-f87c67ca=\"\">1) Asset swapping can prove difficult depending on the liquidity profile of the asset X and where it is available. For long-tail low liquidity assets there is a risk of market impact and slippage dependent on the size of your position.<\/i>","<i data-v-f87c67ca=\"\">2) While an asset can be staked, it can sometimes have a lockup period which makes the succinct swapping hard although staking secondary markets are opening (e.g. <\/i><a href=\"https:\/\/vest.io\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Vest<\/i><\/a><i data-v-f87c67ca=\"\">),&nbsp;<\/i>","<i data-v-f87c67ca=\"\">3) Staking yield is token-denominated which means your staking reward is subject to the token’s network inflation rate and to the possibility of a depreciation in value in $ terms.<\/i>","<i data-v-f87c67ca=\"\">4) Similar to the previous risk, Bernie will be exposed to the X\/XTZ pair market risk before he swaps back to X. Bernie could hedge himself to be protected against that risk.<\/i>","<i data-v-f87c67ca=\"\">5) There are new risk dimensions to take into account such as smart-contract risk and slashing risk (i.e. improper staking will be punished by slashing a fraction of the amount staked).<\/i>","","","<em data-v-f87c67ca=\"\">Table of stakeable assets ranked by ‘share’. ‘Share’ represents the token-denominated yield left after accounting for the network’s inflation. (Source: <a href=\"https:\/\/beta.stakingrewards.com\/\" data-v-f87c67ca=\"\">https:\/\/beta.stakingrewards.com\/<\/a>)<\/em>","While the examples above seem to be easy to reproduce, we believe an edge in yield arbitrage will come from efficient allocation to the relevant protocols\/platforms and rigorous risk management practices. For interest rate arbitrage, lending rates change dynamically as users allocate funds to lending protocols. This means a large amount of capital (~$40k today) allocated at once will suffer from significant slippage costs. Proper order execution that keeps in mind the rate change mechanics of each of the lending platforms you’re interacting with and allocates efficiently dollar for dollar is required in order to be successful and we believe is a legitimate edge.&nbsp;","However, this edge doesn’t seem very durable as aggregation services like <a href=\"https:\/\/medium.com\/topo-finance\/introducing-topo-finance-a-defi-services-platform-8b76c0aef0f6\" data-v-f87c67ca=\"\">Topo Finance<\/a> are cropping up. These services offer users the best lending rates and borrowing rates in DeFi through their aggregation and optimisation of many available rates. While they are currently not offering cross-asset lending optimisation, the Topo Finance team has indicated this is on their roadmap. The question then becomes how long it will take for this edge to fade away.&nbsp;","The argument above points to a short timeline yet it’s worth remembering that a lot of institutional players will feel more comfortable investing in a fund that runs such a strategy rather than putting money in a retail focused product. The answer might therefore not be as binary as we’ve put it above but rather both might co-exist, at least for the medium term, catering to different pools of capital.&nbsp;","On the longer term, services like Topo Finance are chipping away at the arbitrage opportunity by effectively redistributing to the users value that yield arbitrageurs would usually capture while at the same time tightening the spreads between lending rates and the gaps between lending protocols. This is a major reason DeFi could be the catalyst to retail blockchain adoption as it offers a clear advantage over traditional financial infrastructure: public, machine-readable data combined with open endpoints, resulting in lower barriers to entry and, ultimately, <b data-v-f87c67ca=\"\">better value redistribution for the user<\/b>.&nbsp;","Moving on from yield arbitrage trading opportunities which have diffuse return distribution dynamics, we now focus on finite, scarce and winner-take-all arbitrage opportunities in decentralized finance. Of particular interest to this piece is cross-exchange arbitrage between <a href=\"https:\/\/docs.ethhub.io\/built-on-ethereum\/decentralized-exchanges\/what-are-decentralized-exchanges\/\" data-v-f87c67ca=\"\">decentralized exchanges<\/a> and the resulting gas bidding wars trading bots engage in. In cross-DEX arbitrage, traders will typically continuously scan decentralized exchanges order books to execute a series of trades sequentially between different trading venues with the goal to end up with more money than they started with. Below is an example of a triangular arbitrage trade between two decentralized exchanges <a href=\"https:\/\/eth2dai.com\/market\/WETH\/DAI\" data-v-f87c67ca=\"\">OasisDEX<\/a> (now Eth2DAI) and <a href=\"https:\/\/docs.ethhub.io\/built-on-ethereum\/decentralized-exchanges\/pool-based\/uniswap\/\" data-v-f87c67ca=\"\">Uniswap<\/a>, and the pairs DAI\/MKR, MKR\/WETH and WETH\/DAI which leads to a 1.6% profit.&nbsp;","","","<em data-v-f87c67ca=\"\"><a href=\"http:\/\/ethtx.info\/\" data-v-f87c67ca=\"\">http:\/\/ethtx.info, <\/a>Analysis for: 0xa595a252a5324d520d17de440e71ba23c622dbdaf8a5f6a3d88c866b0fbdf88c. Thanks to OasisDEX for developing this tool and to Bartek for sharing it in <a href=\"https:\/\/youtu.be\/mwkL7beq0m8\" data-v-f87c67ca=\"\">his excellent presentation<\/a> at DeFi Summit London.<\/em>","This is where it gets interesting! Although the above looks like any other triangular arbitrage trade there are two fundamentally new aspects of trading on this infrastructure absent from traditional cross-exchange arbitrage: atomic batch-based processing of transactions and priority gas auctions.","Since <a href=\"https:\/\/ethereum.github.io\/yellowpaper\/paper.pdf\" data-v-f87c67ca=\"\">Ethereum<\/a> is a smart contract system that is Turing-complete (i.e. allows encoding of arbitrary smart contract functionality) and smart contracts atomically-execute programs written in Turing complete scripting languages, one can ‘encode’ within a single transaction sent to a smart contract an arbitrary number of orders which will be atomically executed by miners.&nbsp;","These orders can be of arbitrary complexity and can have complex conditional preferences on trade execution. An example of a conditional preference is throwing an exception to the atomic batch execution if one order fails (i.e. everything gets cancelled, similar to traditional complex order types like ‘fill or kill’). Several people have caught onto this feature of Ethereum, including for a moment <a href=\"https:\/\/medium.com\/marbleorg\/introducing-marble-a-smart-contract-bank-c9c438a12890\" data-v-f87c67ca=\"\">Marble<\/a>, a service that offered flash lending for exchange arbitrage. “<i data-v-f87c67ca=\"\">A trader can borrow from the Marble [smart contract] bank, buy a token on a DEX, sell the token on another DEX for a higher price, repay the bank, and pocket the arbitrage profit all in a single atomic transaction.<\/i>”","","","<em data-v-f87c67ca=\"\"><a href=\"https:\/\/github.com\/marbleprotocol\/flash-lending\" data-v-f87c67ca=\"\">https:\/\/github.com\/marbleprotocol\/flash-lending<\/a> Marble’s Flash Lender basic architecture which can be used to execute arbitrage trades on decentralized exchanges.<\/em>","This is interesting as, traditionally, success of multi-legged arbitrage is measured probabilistically as there are chances individual legs fail (‘legging risk’). While the success of multi-legged arbitrage in DeFi is also measured probabilistically, this non-determinism now stems from the likeliness of being included in an Ethereum block (and it not being orphaned) rather than the success of an individual leg since these are executed atomically and fully cancelled should one not work.&nbsp;","You can now build arbitrarily complex orders all within a single Ethereum transaction which has no analogue in traditional markets. This has implications in the types of strategies one could run in this new world. In the old world, some complex multi-legged arbitrages strategies never see the light of day because they rely on many components, each with a risk of failure. Since these compound, win rates can collapse dramatically. How many discarded strategies will work on this new infrastructure and what will new complex systematic arbitrage strategies look like?","It's worth noting this property might not exist anymore as Ethereum upgrades to<a href=\"https:\/\/docs.ethhub.io\/ethereum-roadmap\/ethereum-2.0\/eth-2.0-phases\/\" data-v-f87c67ca=\"\"> Ethereum 2.0<\/a>. In short, the Ethereum 2.0 network will be broken into different parts (shards). In this sharded world, it is possible two DEXs you execute arbitrage strategies between are on two different shards, meaning also two different network states. While transactions within a shard could happen as before, transactions between shards can still happen but in an asynchronous fashion, using receipts. This worried entrepreneurs who depend on this feature for their service\/product during DevCon 5 and prompted Vitalik to write <a href=\"https:\/\/ethresear.ch\/t\/cross-shard-defi-composability\/6268\" data-v-f87c67ca=\"\">a post about it<\/a>.&nbsp;","Back to the current version of Ethereum, it seems like traders can now execute arbitrarily complex riskless multi-legged arbitrage without worrying about traditional exchange <a href=\"https:\/\/www.investopedia.com\/terms\/c\/counterpartyrisk.asp\" data-v-f87c67ca=\"\">counterparty credit risk<\/a> (as they’re operating on non-custodial venues) and legging risk (as they execute all their trade legs ‘at once’). However there are novel nuances and risks to take into consideration:&nbsp;","Even though the infrastructure is transparent and its information available for anyone to tinker with, these risks today are hard to quantify and therefore hard to price in trades. Many are hard at work on these issues, such as ConsenSys who have<a href=\"https:\/\/media.consensys.net\/introducing-the-defi-score-an-open-source-methodology-to-evaluate-code-and-financial-risk-in-defi-6c8616de791c\" data-v-f87c67ca=\"\"> recently released a risk-scoring system<\/a> and <a href=\"https:\/\/www.nexusmutual.io\/\" data-v-f87c67ca=\"\">Nexus Mutual<\/a> who have started evaluating smart contract cover in order to offer smart contract insurance (e.g. <a href=\"https:\/\/medium.com\/nexus-mutual\/understanding-risks-in-defi-1-uniswap-e5e790692635\" data-v-f87c67ca=\"\">insuring Uniswap<\/a>). In a world where smart contracts can be insured and risks of trading with them are better understood, does multi-legged arbitrage in DeFi become less risky than on centralized trading platforms?&nbsp;","Since arbitrage opportunities are scarce and offer winner take all returns, traders have to optimize their latency to compete effectively. In contrast to traditional finance where latency is about connectivity, computational speed optimization and special rights such as co-location, here, on Ethereum-based infrastructure, latency is related to gas spend and efficient blockchain networking monitoring.&nbsp;","As a reminder, <a href=\"https:\/\/medium.com\/@eric.conner\/understanding-ethereum-gas-blocks-and-the-fee-market-d5e268bf0a0e\" data-v-f87c67ca=\"\">Ethereum transactions consume <i data-v-f87c67ca=\"\">gas<\/i><\/a>, akin to a transaction fee, distributed to the miner executing the transaction. The more gas is spent, the higher the chances are of the transaction being selected from the mempool to be included in the next block and being confirmed. Think of the mempool like the waiting room for transactions before they are confirmed.&nbsp;","Practically, when a trading bot goes for an arbitrage opportunity this is what happens:&nbsp;","This game goes on until a bot ‘wins’ or the opportunity becomes unprofitable (i.e. gas spend &gt; total profit through arbing the spread) for one of the bots, and they cancel their bid entirely, paying only ‘cancellation gas fees’ which are significantly less than execution fees.&nbsp;","Interestingly, Phil Daian et.al in the paper <a href=\"https:\/\/arxiv.org\/abs\/1904.05234\" data-v-f87c67ca=\"\">Flash Boys 2.0: Frontrunning, Transaction Reordering, and Consensus Instability in Decentralized Exchanges<\/a> found bidding bots organically collaborate with each other to maximize their profits through ‘grim-trigger’ cooperative strategies (i.e. if a bot ‘misbehaves’, another in the auction will immediately raise its bid to the maximum amount thereby eliminating all profitability from the auction). The expected payoff from adhering to such cooperative strategy is larger than the expected payoff from deviating from it. The paper formally describes this strategy and goes on to prove there exists a cooperative Nash equilibrium for a 2-player auction where both players follow the grim-trigger cooperative strategy mentioned above!","<i data-v-f87c67ca=\"\">You can visualize real time auctions taking place on <\/i><a href=\"https:\/\/frontrun.me\/\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">frontrun.me<\/i><\/a>","","","<i data-v-f87c67ca=\"\">One example PGA that was observed over the Ethereum network. The top graph shows the gas bids of two observed bots over time, while the bottom table details the first and last two bids placed by each bot and the two mined bids (center),&nbsp;<\/i>","<i data-v-f87c67ca=\"\">Diagram taken from page 5 of <\/i><a href=\"https:\/\/arxiv.org\/abs\/1904.05234\" data-v-f87c67ca=\"\">Flash Boys 2.0: Frontrunning, Transaction Reordering, and Consensus Instability in Decentralized Exchanges<\/a><i data-v-f87c67ca=\"\">. Although the auction has ended after 4.94 seconds by a miner including it in the next Ethereum block, bots will only know it once the block is mined and the new Ethereum network state propagated. They therefore keep bidding.&nbsp;<\/i>","Optimising for gas spend is therefore the most obvious way to compete. To do so, traders trim down their execution logic (since expressing the same set of instructions using less computations results in lower gas spend for an equal outcome) and use tools such as the <a href=\"https:\/\/gastoken.io\/\" data-v-f87c67ca=\"\">GasToken<\/a> to essentially buy gas earlier on, when it is cheaper, and use it when it is more expensive to make the economics of their trade more profitable. A way to think of the GasToken is like setting up your electric boiler so it heats up water during non-peak hours so that you can then use it during peak hours.&nbsp;","","","<i data-v-f87c67ca=\"\">‘Deployed PGA measurement infrastructure architecture’, Diagram taken from page 6 of <\/i><a href=\"https:\/\/arxiv.org\/abs\/1904.05234\" data-v-f87c67ca=\"\">Flash Boys 2.0: Frontrunning, Transaction Reordering, and Consensus Instability in Decentralized Exchanges<\/a>","Aside from gas optimisations, other dimensions traders will compete on include infrastructure (running nodes with high uptime and more flexible actions, geographically distributed nodes to monitor Ethereum mempools) and data analysis capabilities which we believe are both sources of edge.&nbsp;","An example of an infrastructure architecture is shown above. It’s worth noting the cost of deploying such an infrastructure using for example AWS is in the low five-figures a month. The current size of the investment opportunity as outlined in Flashboys 2.0 therefore does not seem worth the infrastructure costs, especially given the uncertainty around the gossip topology of Eth2.0 which might render this infrastructure useless.&nbsp;","Additionally, beyond infrastructure there is the matter of efficient blockchain data analysis. While getting a global image of the mempool is no easy feat, picking a transaction sitting there, looking into the address that triggered it and its transaction history and simulating the transaction (and its sub-transactions) to verify it is a net profit for you is an arduous task. Add to that the time constraint of 10-20s block time for Ethereum (vs microseconds for traditional HFT) to participate in the PGA and you can understand how important efficient data processing and parsing becomes in these strategies. This is especially true as off-the-shelf monitoring tools currently don’t exist and therefore have to be developed in house. More generally there are no standards around data interpretation in DeFi even when it comes to simple data points like DEX volumes of the most traded pair, ETH\/DAI. <i data-v-f87c67ca=\"\">(Source: <\/i><a href=\"https:\/\/youtu.be\/mwkL7beq0m8\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Past, Present and Future of OasisDEX by Bartek Kiepuszweki (MakerDAO)<\/i><\/a><i data-v-f87c67ca=\"\">)<\/i>","To learn more about these auctions, I recommend reading the excellent paper Phil Daian et al. authored on the subject entitled <a href=\"https:\/\/arxiv.org\/abs\/1904.05234\" data-v-f87c67ca=\"\">Flash Boys 2.0: Frontrunning, Transaction Reordering, and Consensus Instability in Decentralized Exchanges<\/a> where the title of this section, Priority Gas Auctions (PGAs), originates. These PGAs are fascinating as they are changing the way arbitrage traders operate and sustain their advantage over other traders. This is interesting to us at Cambrial as we spend our time talking to managers and understanding their strategies’ edge. However, similar to the point in the previous section about the yield arbitrage opportunity disappearing, we believe cross-DEXs arbitrage strategies won’t remain for much longer primarily because many are working to stop them as they are bad for DeFi and Ethereum more broadly:&nbsp;","Congrats on making it this far! The TL;DR on part 1 and 2 above is that both yield arbitrage and cross-DEXs arbitrage strategies seem to be short-lived opportunities for traders.&nbsp; The former because the value it traditionally creates for traders is being redistributed to the users, the latter because it’s being stopped outright. The natural following question then becomes do arbitrageurs as we know them traditionally even have a place in this new world?","The answer is a resounding yes, at least for now, as there are financial protocols where arbitrageurs are needed to ensure the good functioning of the protocol. One example is the automated market maker Uniswap where constant arbitrage between Uniswap pair pools and other decentralized exchanges is required to keep the rate offered in lockstep with the market rate for the pair’s assets. However, the tide seems to be turning, not necessarily pointing to a disappearance of arbitrageurs rather a redefinition of what it means in DeFi.&nbsp;","One example of this redefinition is the recently announced <a href=\"https:\/\/balancer.finance\/whitepaper.html\" data-v-f87c67ca=\"\">Balancer<\/a>: “<i data-v-f87c67ca=\"\">Balancer turns the concept of an index fund on its head: instead of paying fees to portfolio managers to rebalance your portfolio, you collect fees from traders, who rebalance your portfolio by following arbitrage opportunities.<\/i>”","In other words, the value arbitrageurs usually capture for themselves is partly redistributed to the users who will now enjoy a unique index fund product. However while arbitrageurs are recognized as useful to the system, they are limited in their profit capabilities.","Another example is the asset-backed stablecoin <a href=\"https:\/\/docs.ethhub.io\/built-on-ethereum\/open-finance\/stablecoins\/dai\/\" data-v-f87c67ca=\"\">DAI<\/a>. DAI relies on arbitrageurs (Keepers) to liquidate CDPs when they fall below the required collateralization ratio. These liquidation opportunities are latency sensitive and Keepers engage in priority gas auctions with each other to fill them. DAI is set to switch to Multi-collateral DAI (MCD) from its current single collateral system (i.e. ETH). When MCD happens, liquidations for each collateral involved in MCD will switch to English auctions by default. This means competition between takers will be about their internal systems optimization rather than external latency games.&nbsp;","","","<a href=\"https:\/\/mkr.tools\/system\/bites\" target=\"_blank\" rel=\"noopener noreferrer\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/mkr.tools\/system\/bites&amp;source=gmail&amp;ust=1573061701447000&amp;usg=AFQjCNG9XjSNTYifm-GCobKzGXD8JVEK4Q\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">MKR.tools<\/i><\/a><i data-v-f87c67ca=\"\">&nbsp;3-months Maker CDP bites overview where every circle represents a CDP liquidated. At the centre is CDP 16619 of nearly $4M which was liquidated on September 24th when ETH suddenly dropped from $200 to $165. This resulted in about $120k in liquidation profits.<\/i>","Other DeFi protocols have also chosen to use auctions such as TokenSets rebalancings that use a Dutch auction and Gnosis’ decentralized exchange <a href=\"https:\/\/slow.trade\/#\/\" data-v-f87c67ca=\"\">DutchX<\/a>. Auctions contribute to a healthier DeFi ecosystem by shifting the competition to price (and a traders’ internal systems) rather than network latency which we’ve seen above causes a plethora of issues. This is ultimately fairer and allows for better price discovery. This again changes the definition of an arbitrageur as the individual with the best optimized internal systems to be able to fill opportunities which wouldn’t be profitable to others. We wonder here again how limited profit capabilities will be in such a system.&nbsp;","This leads us to question how much money can be made by developing a trading system in DeFi. This is a hard question to answer as the capacity and the profitability of these strategies is rather hard to estimate, especially considering what is mentioned above is simplistic and in reality multiple strategies are run in parallel, often with synergistic relationships. Nonetheless, this question is important to us as it dictates the fee structure a fund would explore in order to sustain their costs and whether the current opportunity is attractive enough to justify the necessary team and upfront investment in infrastructure to run it.","As an example of synergistic relationships between strategies, one could market make on the ETH\/DAI pair (the most liquid pair) on DEXs while also biting Maker CDPs opportunistically and arb’ing any peg deviation of DAI. That way, your DAI inventory is kept active, your market making infrastructure is also used for biting MakerCDPs + arb’ing any peg deviation and you already have enough supply to bite CDPs should a lot of liquidations become available after a sudden depreciation of the price of ETH.&nbsp;","DeFi markets are a small percentage of overall trading volume related to blockchain-based products. While they have a long way to go to grow that volume to meaningful numbers, we’ve seen some encouraging growth in this sector and are excited about the trading strategies its new features enable.&nbsp;","However, our excitement is balanced by our suspicion that the strategies described above are short lived opportunities for traders and imply more risks than first anticipated. This is especially true of strategies like cross-DEX arbitrage and liquidation premiums which are used as bootstrapping mechanisms by protocol builders but will become a pure drag when those networks reach a steady state. This invites the question whether these strategies warrant a trader’s interest and an investor’s work.","We built Cambrial on the premise that ‘crypto’ is a new asset class, and that similar to the rise of hedge funds in the late 90s, out of a new asset class are born new trading opportunities and strategies. This is right in our sweet spot and we’re looking forward to following, and investing in, these strategies as they evolve.","<b data-v-f87c67ca=\"\">Acknowledgements:&nbsp;<\/b>","Thanks to my colleagues&nbsp;<a href=\"https:\/\/twitter.com\/HaDuong_\" target=\"_blank\" rel=\"noopener noreferrer\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/twitter.com\/HaDuong_&amp;source=gmail&amp;ust=1573061701448000&amp;usg=AFQjCNHgeRCWWNdJflYcW5ZCnGzdERgn6w\" data-v-f87c67ca=\"\">Ha<\/a>,&nbsp;<a href=\"https:\/\/twitter.com\/dfauchier\" target=\"_blank\" rel=\"noopener noreferrer\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/twitter.com\/dfauchier&amp;source=gmail&amp;ust=1573061701448000&amp;usg=AFQjCNElQPdD4hJES_pnrQiOzDiZYAdYTA\" data-v-f87c67ca=\"\">David<\/a>&nbsp;and&nbsp;<a href=\"https:\/\/twitter.com\/EdwardMNelson\" target=\"_blank\" rel=\"noopener noreferrer\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/twitter.com\/EdwardMNelson&amp;source=gmail&amp;ust=1573061701448000&amp;usg=AFQjCNGGLaLYAjU5YqJ7FQnZcStVnsgwbw\" data-v-f87c67ca=\"\">Edwar<wbr data-v-f87c67ca=\"\">d<\/a>&nbsp;from Cambrial for their support throughout this research and for providing valuable feedback on this piece.","Thanks also to <a href=\"https:\/\/twitter.com\/TrentOfElmore\" data-v-f87c67ca=\"\">Trent Elmore<\/a>, <a href=\"https:\/\/twitter.com\/tomhschmidt\" data-v-f87c67ca=\"\">Tom Schmidt<\/a>, <a href=\"https:\/\/twitter.com\/teo_leibowitz\" data-v-f87c67ca=\"\">Matteo Leibowitz<\/a> and the BCA groupchat for stimulating conversations and feedback.","<a href=\"http:\/\/cambrial.com\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=http:\/\/cambrial.com\/&amp;source=gmail&amp;ust=1573061701448000&amp;usg=AFQjCNGC6-UebA-uOAcN3hu1ZW46TbjpMw\" data-v-f87c67ca=\"\">cambrial.com<\/a>","<a href=\"https:\/\/twitter.com\/cambrialcapital\" target=\"_blank\" rel=\"noopener noreferrer\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/twitter.com\/cambrialcapital&amp;source=gmail&amp;ust=1573061701448000&amp;usg=AFQjCNHfzHK2bDR_XM2MFoyaPTvaRLzRBw\" data-v-f87c67ca=\"\">twitter.com\/cambrialcapital<\/a>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"PGA","content":"ORGANIZATION"},{"type":"May 18th","content":"DATE"},{"type":"6.7%","content":"PERCENT"},{"type":"Alex Obadia","content":"PERSON"},{"type":"WETH\/DAI","content":"ORGANIZATION"},{"type":"7.8%","content":"PERCENT"},{"type":"14.5%","content":"PERCENT"},{"type":"Edwar","content":"PERSON"},{"type":"Bartek Kiepuszweki","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Bernie’s","content":"PERSON"},{"type":"1.6%","content":"PERCENT"},{"type":"Loanscan","content":"LOCATION"},{"type":"Trent Elmore","content":"PERSON"},{"type":"Matteo Leibowitz","content":"PERSON"},{"type":"$120k","content":"MONEY"},{"type":"$40k","content":"MONEY"},{"type":"BCA","content":"ORGANIZATION"},{"type":"Consensus Instability","content":"ORGANIZATION"},{"type":"Phil Daian","content":"PERSON"},{"type":"7.1%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"David","content":"PERSON"},{"type":"Cambrial Capital","content":"ORGANIZATION"},{"type":"Research","content":"ORGANIZATION"},{"type":"Binance Research","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Topo Finance","content":"ORGANIZATION"},{"type":"$4M","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"},{"type":"Tom Schmidt","content":"PERSON"},{"type":"MCD","content":"ORGANIZATION"},{"type":"DAI","content":"ORGANIZATION"},{"type":"2.1%","content":"PERCENT"},{"type":"Berlin","content":"LOCATION"},{"type":"X. Bernie","content":"PERSON"},{"type":"Bartek","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"London","content":"LOCATION"},{"type":"$165","content":"MONEY"},{"type":"$200","content":"MONEY"},{"type":"$ terms","content":"MONEY"},{"type":"AWS","content":"ORGANIZATION"},{"type":"DevCon","content":"ORGANIZATION"},{"type":"Cambrial","content":"LOCATION"},{"type":"Gnosis","content":"PERSON"},{"type":"5%","content":"PERCENT"},{"type":"0.99%","content":"PERCENT"},{"type":"today","content":"DATE"},{"type":"3.3%","content":"PERCENT"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Nash","content":"PERSON"},{"type":"DAI\/USD","content":"ORGANIZATION"},{"type":"MKR","content":"ORGANIZATION"},{"type":"Bernie","content":"PERSON"}],"hashtag":["STAKING"],"authors":["Contributor Network","The Block"]}