{"summary":"Libra is different than what was anticipated – the code is open-source, transactions will be pseudo-anonymous and even though it is a permissioned blockchain to start, it is set to transition to permissionless over time\nFacebook will play very little role in governance; it will be one of the 100 validating nodes and won’t have more than 1% of the voting power","author":["Larry Cermak","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/27849\/lets-stop-the-libra-fud","publishDate":"2019-06-18T06:36:19","id":2651,"type":null,"title":"Let&#x27;s stop the Libra FUD","category":["Facebook"],"content":["Facebook <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.theblockcrypto.com\/2019\/06\/18\/facebook-libra-cryptocurrency-calibra-launch\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.theblockcrypto.com\/2019\/06\/18\/facebook-libra-cryptocurrency-calibra-launch\/\" data-v-f87c67ca=\"\">announced<\/a> the launch of Libra just a couple of hours ago. And it’s very different from what was anticipated. The <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/github.com\/libra\/libra\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/github.com\/libra\/libra\" data-v-f87c67ca=\"\">code is open source<\/a>, transactions will be pseudo-anonymous and even though it is a permissioned blockchain to start, it is set to transition to permissionless over time. What’s most important, though, is that Facebook will have little role in governance. A new Facebook subsidiary, Calibra, will be one of the 100 validating nodes and won’t have more than 1% of the voting power.","So as long as you don't use Facebook’s custodial wallet, and instead use one of the non-custodial wallets that will inevitably be developed, Facebook won’t know who you are or who you are transacting with. And that’s very similar to how other public cryptocurrencies function.","If you do decide to use Facebook’s Calibra wallet then there are no guarantees. And I wouldn’t trust Facebook with my financial data. The statement on Calibra’s website reads:","<span data-v-f87c67ca=\"\"> “When you authorize a payment, we share data with third parties necessary to process that transaction. We also share Calibra customer data with managed vendors and service providers — including Facebook, Inc. — that support our business (e.g., to provide technical infrastructure or direct payment processing). In both cases, we share only the Calibra customer data that is necessary for completing the defined activity or service” <\/span>","But then again, no one is forcing you to use Facebook’s wallet — that’s the beauty of open source.&nbsp;","This is not to say that Libra will be censorship resistant — it is still a permissioned chain where everyone knows the identities of the validating nodes. Libra Association says that in the event of a legal judgment, “law enforcement would be able to work directly with nodes to screen out the bad address.” But the Association wouldn’t be able to force movement of the bad actor’s Libra.","All in all, Libra was a nice surprise. Its success is not guaranteed; not even close. But let’s stop the baseless FUD. Meanwhile, I look forward to following the new developments.&nbsp;"],"hashtag":[]}