{"summary":"The house was reportedly bought by the Guarding Against Pandemics nonprofit in April.\nThe nonprofit was founded by Sam Bankman-Fried’s brother.\nThe listing describes the house as “an entertainer’s dream home.”","author":["Sarah Wynn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/206831\/dream-home-near-us-capitol-linked-to-sam-bankman-fried-goes-up-for-sale","publishDate":"2023-01-30T14:57:00","id":2653,"type":null,"title":"`Dream home&#x27; near US Capitol linked to Sam Bankman-Fried goes up for sale","category":["Policy"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">A four-bedroom Victorian brownstone in Washington, D.C. linked to former FTX CEO Sam Bankman-Fried is up for sale for $3.3 million.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The home was bought in April for the same amount by Guarding Against Pandemics, a nonprofit group founded by Bankman-Fried's brother, Gabe, according to news reports. &nbsp;<\/span>","The 2017 home is located at 420 3rd St. NE and described as “an entertainer’s dream home,” It <a href=\"https:\/\/www.zillow.com\/homes\/420-3rd-St-NE-Washington,-DC-20002_rb\/247163873_zpid\/\" data-v-f87c67ca=\"\">includes<\/a> four gas fireplaces, an elevator, a built-in wine fridge and a wet\/dry bar. The residence is about a 15-minute walk from the U.S. Capitol.&nbsp;","<span class=\"s2\" data-v-f87c67ca=\"\">The crypto exchange FTX collapsed in November and filed for bankruptcy protection, with founder Sam Bankman-Fried facing criminal and civil charges involving wire fraud and campaign finance law violations. <\/span>Bankman-Fried has <a href=\"https:\/\/nypost.com\/2022\/11\/30\/sam-bankman-fried-claims-he-only-has-100000-left-in-his-bank-account\/\" data-v-f87c67ca=\"\">said<\/a> he has less than $100,000 in the bank.","<span class=\"s1\" data-v-f87c67ca=\"\">FTX sister trading firm Alameda Research donated more than $12 million to the pandemic prevention nonprofit, <a href=\"http:\/\/How former crypto king Sam Bankman-Fried and friends quietly donated to political groups and relatives\" data-v-f87c67ca=\"\">according<\/a> to CNBC. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/i>&nbsp;<\/span>"],"hashtag":[]}