{"summary":"The California Democrat sent a letter to Meta CEO Mark Zuckerberg and Chief Operating Officer Javier Olivan on Monday, expressing concern over five trademark applications tied to digital assets that the company has filed over the past year. \nRep. Waters has been critical of Meta’s foray into crypto, specifically its Libra stablecoin project","author":["Sarah Wynn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273875\/top-democrat-maxine-waters-asks-mark-zuckerberg-about-metas-digital-asset-plans","publishDate":"2024-01-22T17:53:40","id":2654,"type":null,"title":"Top Democrat Maxine Waters asks Mark Zuckerberg about Meta&#x27;s digital asset plans","category":["Companies"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Maxine Waters, the top Democrat on the House Financial Services Committee, said she wants answers amid concern that Meta Platforms, formerly Facebook, could be delving back into its digital asset plans.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The California Democrat sent a <a href=\"https:\/\/democrats-financialservices.house.gov\/uploadedfiles\/01.22.24_ltr_meta.tmapp.pdf\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">letter<\/span><\/a> to CEO Mark Zuckerberg and Chief Operating Officer Javier Olivan on Monday, expressing concern over five trademark applications tied to digital assets that the company has filed over the past year.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Those applications were for projects including an \"online social networking and dating\" service which allows for the exchange of digital currency, designing computer hardware and software related to blockchain, \"currency trading of cryptocurrencies and other forms of virtual currency,\" among others.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Waters has been critical of Meta's foray into crypto, specifically its Libra stablecoin project. Facebook said it planned to launch Libra, later known as Diem, in 2019, which quickly prompted concern among regulators and legislators who were hesitant about a stablecoin with ties to the social media company.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Before Diem's eventual shuttering, Waters said she and other lawmakers sent a letter to Meta in 2019 asking for a moratorium on continued work on Libra and Calibra, its proposed digital wallet, over privacy and national security concerns.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Staff from Meta also told the committee Democrats in October that there was \"no ongoing digital assets work at Meta,\" Waters said in her letter.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Meta staff stated that the company is not currently conducting, nor planning any work on blockchain-based products or stablecoins,\" Waters said. \"Additionally, Meta staff asserted that Meta is not working with any partners on integrating stablecoins or cryptocurrency into any payments or Metaverse products, and is not pursuing research and development in the space.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">However, Meta trademark applications suggest that Meta has not stopped the activity since it shut down Diem, Waters <a href=\"https:\/\/democrats-financialservices.house.gov\/uploadedfiles\/01.22.24_ltr_meta.tmapp.pdf\" data-v-f87c67ca=\"\">said<\/a>.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Waters asked the firm questions about projects it plans to pursue and whether it was \"planning to launch a payments platform that supports cryptocurrency.\" The congresswoman did not set a timeline for a response.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Meta did not immediately respond to a request for comment.&nbsp;<\/span>"],"hashtag":[]}