{"summary":"The Ethereum-focused software company raised funding at a valuation of $3.2 billion a little over two months ago.\nIts latest round is expected to close within weeks, according to people familiar with the matter.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/131445\/ethereum-developer-consensys-poised-to-double-its-valuation-in-pending-fundraise","publishDate":"2022-01-26T10:05:43","id":2655,"type":null,"title":"Ethereum developer ConsenSys poised to double its valuation in pending fundraise","category":["Ethereum"],"content":["ConsenSys, the Ethereum software company behind crypto wallet MetaMask, is poised to more than double its valuation with what will be a third fundraise in less than 12 months.","The firm has held talks with potential backers about investing at a valuation of roughly $6.5 billion, according to three people close to the discussions. Several sources said the company’s post-money valuation will be close to $7 billion.","A document obtained by The Block suggests that ConsenSys has settled on a pre-money valuation of $6.7 billion, and states that the round will consist of $300 million in primary fundraising — which appears to confirm a post-money valuation of $7 billion — and $200 million in secondary transactions. The same document suggests the cash will be used to drive growth and for acquisitions.&nbsp;","ConsenSys declined to comment when reached.","The company last raised funds in November 2021, when it announced <a href=\"https:\/\/www.theblockcrypto.com\/post\/124615\/consensys-raise\" data-v-f87c67ca=\"\">a $200 million round<\/a> at a valuation of $3.2 billion. New investors in that round included British hedge fund Marshall Wace, Daniel Loeb’s Third Point Ventures and HSBC.","In April 2021, ConsenSys <a href=\"https:\/\/www.theblockcrypto.com\/post\/101463\/consensys-closes-65-million-funding-round-backed-by-jpmorgan-mastercard-and-more\" data-v-f87c67ca=\"\">raised $65 million<\/a> from backers including UBS, Mastercard and JPMorgan.","ConsenSys has developed half a dozen core products, all aimed at widening access to the Ethereum ecosystem.&nbsp;Crypto wallet MetaMask and Infura, the developer platform, are its flagship tools.","When announcing its $200 million raise in November, the company said in <a href=\"https:\/\/consensys.net\/blog\/press-release\/metamask-surpasses-21-million-maus-as-consensys-raises-200-million-to-make-web3-universally-easy-to-use-access-and-build-on\/\" data-v-f87c67ca=\"\">a blog post<\/a> that Infura had increased its users from 100,000 to 350,000 in the previous year.&nbsp;At that time, MetaMask’s monthly user base numbered 21 million — up 38 times from 2020. The wallet also operates a service targeting institutional investors, giving them the means to interact with DeFi apps.","At the time of its last raise, ConsenSys said the $200 million would be used to rapidly expand both MetaMask and Infura, while also fuelling 400 new hires across the group.","“The paradigm shift to a world running on decentralized protocols is in full gear,” said ConsenSys’s founder and CEO Joseph Lubin in a statement.","<em data-v-f87c67ca=\"\">Update: Additional information about the size of ConsenSys’s fundraise, and how it plans to use the proceeds, was added to this article on January 27, 2022, at 11.40pm.&nbsp;<\/em>"],"hashtag":["ETHEREUM"]}