{"summary":"Exchanges would get a two-year grace period if the SEC determines a token they list is an unregistered security.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173866\/senate-bill-would-create-legal-grace-period-for-crypto-exchanges","publishDate":"2022-09-29T16:39:45","id":2657,"type":null,"title":"Senate bill would create legal grace period for crypto exchanges","category":["POLICY"],"content":["Sen. Bill Hagerty (R-Tenn.) has introduced a bill to create a safe harbor for cryptocurrency exchanges that might otherwise face legal action for listing unregistered securities.","According to text of the bill obtained by The Block, the legislation would allow for a two-year grace period from enforcement actions by the Securities and Exchange Commission against crypto exchanges that list tokens deemed by the commission to be unregistered securities. The grace period would begin when the commission makes a determination that a token is an unregistered security. Exchanges would also not be subject to legal action for failure to register as a broker-dealer or national securities exchange during the grace period.","The bill is expected to become public tonight.&nbsp;","If the bill were to become law, the SEC could still label tokens as unregistered securities through statements, enforcements, or rulemakings, though the Commodity Futures Trading Commission would have the right to object. The exchange could also still sue for an appeal of the decision in court, where a judge would determine the security definition.","CFTC Chair Rostin Benham has pushed for more direct authority over digital assets, while SEC Chair Gary Gensler <a href=\"https:\/\/www.theblock.co\/post\/170415\/gensler-multiple-crypto-regulators-could-undermine-securities-rules\" data-v-f87c67ca=\"\">wants to keep his agency<\/a> in point position on the asset class, continuing a longstanding argument by the SEC that most crypto tokens are securities offerings.","The SEC is <a href=\"https:\/\/www.theblock.co\/post\/159593\/the-sec-is-investigating-coinbase-over-its-coin-listings-bloomberg\" data-v-f87c67ca=\"\">currently investigating<\/a> Coinbase’s listing of nine tokens it believes to be unregistered securities.","Hagerty sits on the Senate Banking Committee, which holds jurisdiction over the SEC and legislation like the bill he introduced. However, the bill faces long odds to becoming law during this Congress, due to the limited amount of time left in session.","Under terms of the bill, exchanges listing tokens determined to be securities would have to register as broker-dealers or national securities exchanges. To prevent interruption of services, they would also be required to enter agreements with other broker-dealers or banks to maintain operations if the SEC labels a listed token as a security.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gary Gensler","content":"PERSON"},{"type":"Tenn.","content":"LOCATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Bill Hagerty","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Rostin Benham","content":"PERSON"},{"type":"Senate Banking Committee","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["COINBASE"],"authors":["Colin Wilhelm","Kollen Post","Stephanie Murray","The Block"]}