{"summary":"Investors are fleeing risk assets as long-term bond yields surge.\nBitcoin, hit by the collateral damage, has fallen 12.2% over the past week.","author":["Brian McGleenon","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246596\/bitcoin-dips-back-below-26000-as-investors-flee-risk-assets","publishDate":"2023-08-21T13:07:05","id":2658,"type":null,"title":"Bitcoin dips back below $26,000 as investors flee risk assets","category":["Markets"],"content":["Bitcoin dipped back below $26,000 on Monday as investors continued to flee risk assets amid an increase in long-term bond yields.","The price of the world's largest cryptocurrency by market capitalization fell to $25,900 at 12:00 p.m. ET, according to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/bitcoin\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">CoinGecko<\/a>. It's down 12.2% over the past week.&nbsp; &nbsp;","\"We are experiencing an outflow from risk assets, but not so critical at the moment as the market expects even higher yields for long-term bonds in the near future,\"&nbsp; YouHodler chief of markets Ruslan Lienkha told The Block.","The analyst added the process will intensify with time \"and put additional pressure on bitcoin despite some possible positive internal factors in the crypto market.\"","The <a href=\"https:\/\/www.theblock.co\/post\/216340\/u-s-treasury-convening-regular-biden-administration-discussions-on-cbdc\" data-v-f87c67ca=\"\">10-year U.S. Treasury yield<\/a> reached its highest level since 2007, rising above 4.3%. That's up from less than 0.6% in 2020.&nbsp;","Bitcoin has a propensity to march in lockstep with risk assets. Global stocks fell on Monday, as investors diverted capital from equities into surging bond yields.","Bulls have been beaten back by strong macroeconomic headwinds with persistent inflation, anticipation of more rate hikes from the Federal Reserve and anxiety over China’s economy all fatiguing investors’ risk appetite.&nbsp;","Traders are will be watching Jerome Powell's speech on monetary policy this Friday at the Jackson Hole Symposium in Wyoming. However, Lienkha doesn't think Powell's speech will spook the market in the same way as <a href=\"https:\/\/www.theblock.co\/post\/165927\/markets-whipsaw-following-jerome-powells-hawkish-speech-at-jackson-hole\" data-v-f87c67ca=\"\">last year's Jackson Hole announcement<\/a>.","\"It is supposed that the speech would be more neutral this time but still contain hawkish details,\" the analyst added.","Ruslan said there are a number of catalysts still to come into play that could buoy bitcoin's price over the comping months.","\"Bitcoin could benefit from the halving next year, broader adoption of crypto, the growing institutional interest and more jurisdictions with proper transparent regulation,\" he noted."],"hashtag":["CRYPTO MOVERS","EQUITY MOVERS","FEDERAL RESERVE","RATE DECISIONS"]}