{"summary":"In the latest edition of Jefferies’ Greed and Fear, Jefferies global head of equity strategy Chris Wood suggested investors should buy bitcoin ahead of the halving \nHe wrote that the halving “should increase upward price pressure assuming demand for Bitcoin continues to grow, as was the case after the previous halving in 2012 and 2015.”","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/63757\/buy-some-bitcoin-ahead-of-the-halving-says-jefferies-head-of-equity-strategy-in-new-note","publishDate":"2020-05-01T13:52:08","id":2660,"type":null,"title":"Buy some bitcoin ahead of the halving, says Jefferies&#x27; head of equity strategy in new note","category":["The Block"],"content":["Bitcoin's upcoming halving appears to be capturing the attention of some Wall Street analysts.","In an April 30 note, Jefferies' global head of equity strategy Chris Wood suggested that investors buy bitcoin ahead of the halving, <a href=\"https:\/\/www.theblockcrypto.com\/post\/61762\/the-bitcoin-halving-what-it-is-and-why-it-matters\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">the network event<\/a> that will see the per-block reward subsidy fall from 12.5 BTC to 6.25 BTC.&nbsp;","Wood – who authors the firm's famous weekly \"Greed and Fear\" memo – wrote that the halving \"should increase upward price pressure assuming demand for Bitcoin continues to grow, as was the case after the previous halving in 2012 and 2015.\"","The question of whether the halving will result in a surge in bitcoin's price has been the subject of fierce debate for much of the year, with some arguing that the supply cut is priced in. According to current estimates, the halving is expected to take place on May 12.","Bitcoin's price has seen significant action since a sharp fall in mid-March, with the cryptocurrency appreciating ~33% since the day the S&amp;P500 bottomed on March 23, according to data from The Block Research.&nbsp;","",""],"hashtag":[]}