{"summary":"Zipmex commissioned an independent legal review of its capital deployment procedures, and that review has found that no single individual had an “overriding influence” over its decisions.\nSome insiders had reportedly blamed Zipmex CEO Marcus Lim for the company’s exposure to Babel Finance worth $48 million. ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176935\/zipmex-review-appears-to-clear-ceo-over-babel-finance-investments-gone-sour","publishDate":"2022-10-13T11:02:40","id":2661,"type":null,"title":"Zipmex review appears to clear CEO over Babel Finance investments gone sour","category":["Exchanges"],"content":["An investigation of loans made by troubled South Asian crypto exchange Zipmex to Babel Finance found that no individual had an “overriding influence” over the company’s decisions, which may provide cover for embattled chief executive Marcus Lim after some investors called for his resignation.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nLaw firm Morgan Lewis Stamford conducted an independent review and found that Zipmex’s risk management and credit risk committees collectively made its capital deployment decisions, according to an internal email obtained by The Block. The committees included CEO Marcus Lim, co-founder of Zipmex's Thailand unit Akalarp Yimwilai, chief commercial officer and chief of staff Jonathan Low, CFO Nicolas Keravec and chief legal officer Pav Gill.","The Block has also obtained a Lim affidavit related to Zipmex’s restructuring filed today. The filing in the Singapore High Court notes that the review from Morgan Lewis Stamford – which is also handling Zipmex’s restructuring – didn’t find “evidence that at any material time, there had been a breach of any internal governance, risk and\/or compliance procedures.”","The legal review and affidavit come on the heels of news that Zipmex insiders had <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-08-15\/investors-in-crypto-exchange-zipmex-seek-ceo-lim-s-resignation?leadSource=uverify%20wall\" data-v-f87c67ca=\"\">reportedly<\/a>&nbsp;blamed Lim for the company's $48 million exposure to troubled lender Babel Finance and other potential losses and sought his resignation. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“While it is heartening to find that there was no wrongdoing by anyone from Zipmex, this has been a learning process for us, and we will come out stronger for it,” Lim told The Block.","When asked how Morgan Lewis Stamford review is independent since the law firm is also Zipmex's restructuring lawyer in Singapore, Lim told The Block in a separate message that it’s an \"independent of employee interest\" and presented its review to Zipmex.","Lim had also been a target of Zipmex's potential new shareholder who <a href=\"https:\/\/www.theblock.co\/post\/173338\/zipmex-potential-investor-asks-ceo-marcus-lim-to-forfeit-all-his-shares\" data-v-f87c67ca=\"\">asked<\/a> him to forfeit his shares. At the time, Lim said he and his team continue to work towards bringing in new investments to make customers whole and that negotiations with various parties were entering a critical phase.","The affidavit further shows that Babel Finance was Zipmex's deployment partner since November 2020. Zipmex had previously deployed loans to Babel on nearly 100 separate occasions and all loans were duly repaid with accrued interest, per the affidavit. Zipmex kept conducting ongoing due diligence on Babel, with the latest being in May 2022, according to the affidavit. Babel also repaid 2 million USDT to Zipmex in June 2022 due to its recovery efforts, per the email obtained by The Block.","Babel halted client withdrawals in June and decided to undergo restructuring in July. At that time, Zipmex understood that it would be difficult to recover funds from Babel and therefore decided to pursue another avenues, per the email and the affidavit.","Zipmex halted client withdrawals in July and has been looking to raise funds from investors since then. Zipmex has until Dec. 2 to sort out its financial problems, having received a three-month moratorium extension from the Singapore High Court in August.","Lim today said that Zipmex has been executing a recovery plan to ensure that its customers can withdraw their assets and will have updates on this in due course."],"hashtag":[]}