{"summary":"Figment Europe and Apex Group are set to launch Ethereum and Solana staking ETPs on the SIX Swiss Exchange next week via Issuance.Swiss AG.\nThe ETPs are designed to offer institutions convenient access to staking rewards through traditional brokers or banks.","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280859\/figment-apex-group-issuance-swiss-ethereum-solana-staking-etp","publishDate":"2024-03-07T02:05:07","id":2662,"type":null,"title":"Figment and Apex Group set to launch Ethereum and Solana staking ETPs","category":["Companies"],"content":["<span data-v-f87c67ca=\"\">Institutional staking services provider Figment Europe and Apex Group are set to launch <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +2.35%\n    <\/span><\/a> <!----><\/span><\/span> and <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Solana <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/33827\/solana-sol-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/solana.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">SOL<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.17%\n    <\/span><\/a> <!----><\/span><\/span> staking exchange-traded products on the SIX Swiss Exchange next week via Issuance.Swiss AG.<\/span>","Debuting on March 12 on one of the leading European exchanges, the Figment Ethereum Plus Staking Rewards (ETHF) and Figment Solana Plus Staking Rewards (SOLF) products are designed to offer institutions convenient access to staking rewards through traditional brokers or banks under a familiar ETP wrapper.","“We have worked hard to be in a position to support the launch of the first Ethereum and Solana staked ETPs by Issuance.Swiss AG on a regulated trading venue here in Switzerland,” Figment CEO Lorien Gabel said in a statement. “Our objective is now near complete and marks an important step towards the introduction of staking products in conventional ETP form for the still-nascent crypto market.”","Staking rewards on Ethereum and Solana are incentives received for locking up the respective cryptocurrencies to support the operation and security of the blockchain networks. Ethereum and Solana were prioritized for the ETPs due to strong demand from some of Figment’s largest customers, Figment CEO Lorien Gabel told The Block.","“Our goal is to be the go-to staking option for institutions managing crypto-assets, offering seamless access through custodians, exchanges and portfolio management systems,\" Gabel said. \"While we remain open to exploring other networks with our partners, our current focus is on optimizing the ETPs for ETH and SOL.”","“The popularity and interest in ETH and SOL has increased substantially over the past few months,” Figment Institutional Business Development Lead Josh Deems added. “However, it is still challenging for institutions to buy crypto and stake directly. The ETPs will contribute to an increased accessibility to staking rewards for a wide audience.”","The Ethereum and Solana staking ETPs aim to make it easier for institutions to access staking rewards from leading proof-of-stake assets. “With an ETP structure, the product benefits from full collateralization and over 50% staking utilization, returned to investors,” the Figment team explained. “This allows conservative institutions to safely hold this asset class via an ETP without directly funding Ethereum or Solana validators.”","Beyond providing exposure to the underlying crypto assets, the staking rewards generated via the ETPs include maximal extractable value. MEV refers to the maximum value that validators can extract in the block production process, in addition to the standard block reward and transaction fees, which can potentially be passed on to stakers. This is done by including, excluding or changing the order of transactions in a block.","Although similar staking ETPs are already available via asset managers such as CoinShares and 21Shares, Figment seeks to differentiate the offering by leveraging its prior expertise in developing staking infrastructure. Issuance.Swiss, a financial product issuance solution provided by Apex Fund Services, will handle the issuance of the ETPs.","The Figment ETPs both come with a management fee of 1.5%. This compares to a <a href=\"https:\/\/21shares.com\/product\/AETH\" data-v-f87c67ca=\"\">1.49%<\/a> fee for 21Shares’ ether product and <a href=\"https:\/\/21shares.com\/product\/ASOL\" data-v-f87c67ca=\"\">2.5%<\/a> for its solana ETP. CoinShares offers a reduced management fee of <a href=\"https:\/\/etp.coinshares.com\/physical\/ethereum\" data-v-f87c67ca=\"\">0%<\/a> for its products, though that is achieved by sharing the staking rewards.","“This product (issued by Issuance.Swiss) distinguishes itself from other staking ETP providers by prioritizing transparency and rewards performance,” Gabel told The Block. “The ETHF product tracks a unique total rewards benchmark developed by MarketVector, utilizing Figment's staking rewards rate. This benchmark, recognized as the first true total rewards index, ensures transparency by avoiding censorship of reward types like MEV.”","MarketVector and Figment <a href=\"https:\/\/www.theblock.co\/post\/241732\/marketvector-figment-introduce-first-staking-rewards-indexes\" data-v-f87c67ca=\"\">introduced<\/a> the index in July 2023, The Block previously reported.","“Figment's active involvement in staking the majority of ETH and SOL using its infrastructure reinforces its industry leadership in risk-adjusted rewards performance,” the Figment CEO added. \"As a result, the product anticipates offering a competitive rewards rate where 50% or more of the underlying asset will be staked and reinvested by the issuer back into the ETP.”","However, Gabel did not comment on the specific level of yields anticipated. 21Shares offers a staking yield of 1.23% for ether and 4.9% for solana, according to its website. CoinShares offers 1.25% and 3% for ether and solana, respectively. While the ETPs reduce complexity within a regulatory-compliant wrapper, the <a href=\"https:\/\/www.stakingrewards.com\/asset\/ethereum-2-0\" data-v-f87c67ca=\"\">ether<\/a> and <a href=\"https:\/\/www.stakingrewards.com\/asset\/solana\" data-v-f87c67ca=\"\">solana<\/a> staking yields on offer are significantly lower than via crypto-native solutions.","With U.S. spot bitcoin ETFs launching successfully in January, attention has turned toward the prospect of spot ether ETFs coming next. Big-name firms, including <a href=\"https:\/\/www.theblock.co\/post\/263299\/blackrock-ethereum-etf-sec\" data-v-f87c67ca=\"\">BlackRock<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/263626\/fidelity-files-for-spot-ethereum-etf-says-approval-would-be-major-win-for-us-investors\" data-v-f87c67ca=\"\">Fidelity<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/277223\/franklin-templeton-takes-initial-step-for-spot-ethereum-etf-with-new-sec-filing\" data-v-f87c67ca=\"\">Franklin Templeton<\/a> have applied for a spot ether ETF over the last few months. However, <a href=\"https:\/\/www.theblock.co\/post\/280434\/spot-ether-etf-approvals-remain-uncertain\" data-v-f87c67ca=\"\">opinions<\/a> on the prospect of approval from the Securities and Exchange Commission this year remain mixed.","“Without my SEC magic 8-ball it's hard to tell,” Gabel told The Block regarding the prospect. “Similar to the process leading to bitcoin's approval, the SEC's feedback will likely provide clarity on whether staking will be included in these products which is what we're focusing on.\"","While spot ether ETFs might be next, following a similar approval process to that of CME futures and futures ETFs prior to the approval of bitcoin spot ETFs in the U.S., the prospects of spot ETFs for solana or other crypto assets remain remote for now."],"hashtag":["ETHEREUM","SOLANA","STAKING FIRMS"]}