{"summary":"Tapiero’s 10T has filed with the SEC to create a third digital assets investment fund.\nThe vehicle, which like its predecessors will target mature crypto businesses, is raising $500 million. ","author":["Ryan Weeks","Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/126629\/dan-tapieros-10t-is-raising-500-million-for-a-third-digital-assets-fund","publishDate":"2021-12-07T12:29:37","id":2666,"type":null,"title":"Dan Tapiero’s 10T is raising $500 million for a third digital assets fund","category":["Investments"],"content":["10T, the crypto investment firm run by hedge fund veteran Dan Tapiero, is launching a third digital assets fund just two months on from closing its second.","The company is raising $500 million for the latest vehicle, which is named 10T DAE Fund 3.0, according to <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1896583\/000189658321000001\/xslFormDX01\/primary_doc.xml\" data-v-f87c67ca=\"\">a Form D regulatory filing<\/a> with the Securities and Exchange Commission published on December 6.","Like the first two vehicles, 10T’s third fund will target mid-to-late-stage digital assets firms. “They have to be making significant revenue already. We don’t invest in startups,” Tapiero said of the first two funds.&nbsp;","The third fund will invest in a fresh batch of those more mature cryptocurrency businesses.","Founded in 2020 as a vehicle offering traditional investors exposure to larger cryptocurrency firms, 10T currently has $770 million in assets under management, according to its website. Tapiero said that more than 90% of its first two funds have already been deployed.","The company’s past bets include the likes of Kraken, eToro, Ledger, Figure, Gemini, Bitfury and Huobi. In total, there are 14 companies in the 10T portfolio, of which 12 are valued at more than $1 billion — meaning they have achieved so-called ‘unicorn’ status.","10T closed its <a href=\"https:\/\/www.theblockcrypto.com\/post\/117505\/hedge-fund-vet-dan-tapiero-has-invested-more-than-650-million-into-cryptos-largest-companies\" data-v-f87c67ca=\"\">second $750 million fund<\/a> in September, having secured the backing of British billionaire Alan Howard and the Municipal Employees' Retirement System of Michigan (MERS), the state pension fund.","Howard, who, like Tapiero, earned acclaim as a macro investor across nearly two decades as CEO of Brevan Howard, has also <a href=\"https:\/\/www.theblockcrypto.com\/news+\/108122\/billionaire-alan-howard-crypto-investments\" data-v-f87c67ca=\"\">invested considerable amounts<\/a> of capital in crypto firms. Indeed, both Howard and Tapiero’s 10T have invested in Ledn, the Canadian crypto lender."],"hashtag":[]}