{"summary":"Crypto investors in the US led the way last year and took home nearly a third of the loot, according to the report.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/142795\/crypto-investors-made-163-billion-in-gains-in-2021-chainalysis","publishDate":"2022-04-21T05:53:13","id":2666,"type":null,"title":"Crypto investors made $163 billion in gains in 2021: Chainalysis","category":["BITCOIN"],"content":["Crypto investors took home about $162.7 billion in realized gains in 2021, according to a <a href=\"https:\/\/blog.chainalysis.com\/reports\/cryptocurrency-gains-by-country-2021\/\" data-v-f87c67ca=\"\">blog post<\/a> by blockchain analytics firm Chainalysis, showing it was a stellar year after $32.5 billion in 2020.","Out of this, US investors took the lion’s share of the profits, netting some $47 billion — around 29% of the total amount. These investors were followed by those in the UK, Germany, Japan and then China, which banned bitcoin mining and poured cold water on investing in crypto early in the year.","A big majority of the gains, 93%, was made in bitcoin and ether, according to the report. It noted that there were more gains in ether than bitcoin, but only by a few billion dollars.&nbsp;","“We believe this reflects increased demand for Ethereum as the result of DeFi’s rise in 2021, as most DeFi protocols are built on the Ethereum blockchain and use Ethereum as their primary currency,” the blog post said.","The report is only a rough estimate of how much crypto investors made during the year because it’s based on on-chain analysis of moving funds — as opposed to knowing each individual’s trading performance. Chainalysis said it tracks the difference between funds when they are deposited on exchanges and when they are withdrawn.&nbsp;","“It’s not perfect — ideally, we’d be able to calculate gains at the individual or wallet level rather than at the service level, but this methodology still gives us a reasonable estimate of total gains for cryptocurrency users in a given country,” Chainalysis acknowledged.","The report also noted that it’s hard to break down the on-chain data by country, since blockchain transactions do not inherently contain geographical information. The estimates are based on Chainalysis’s transaction data and web traffic information.","Chainalysis highlighted China's low growth rate, mostly caused by its crackdown on crypto. In contrast, it noted that the US saw a gain of 476% from the previous year.","This report only considers coins that chainalysis tracks and doesn’t address whether investors made other losses. Nor does it take into account taxes on the gains made.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"476%","content":"PERCENT"},{"type":"$47 billion","content":"MONEY"},{"type":"93%","content":"PERCENT"},{"type":"Japan","content":"LOCATION"},{"type":"Chainalysis","content":"PERSON"},{"type":"29%","content":"PERCENT"},{"type":"UK","content":"ORGANIZATION"},{"type":"few billion dollars","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"Germany","content":"LOCATION"},{"type":"$32.5 billion","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"China","content":"LOCATION"},{"type":"$162.7 billion","content":"MONEY"}],"hashtag":["BITCOIN","CRYPTO"],"authors":["Tim Copeland","The Block"]}