{"summary":"Mooar looks set to offer an alternative to the optional-royalty model which has become commonplace.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/180785\/stepn-founders-bright-idea-for-its-new-nft-marketplace-compulsory-royalties","publishDate":"2022-11-01T05:00:58","id":2667,"type":null,"title":"Stepn founders&#x27; bright idea for its new NFT marketplace: compulsory royalties","category":["GAMING AND METAVERSE"],"content":["<span data-v-f87c67ca=\"\">Stepn developer Find Satoshi Lab is bucking the trend set by other NFT marketplaces with its own multi-chain offering called Mooar — with a zero-fee, compulsory royalty structure.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Launched today, the venture is the third project in the FSL ecosystem after the move-to-earn darling Stepn and its decentralized exchange product, Dooar.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Mooar debuts with what the business calls a \"unique membership model,\" as it eschews platform fees in favor of an initial entry fee of $29.90 a month for unlimited NFT trades. For context, the fee is nearly double what you might currently pay for a standard Netflix subscription.<\/span>","<span data-v-f87c67ca=\"\">Royalties for creators will default to 2%, or within a 0.5% to 10% range, depending on what the creator chooses to set. It will initially launch on Ethereum and Solana.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Stepn’s move into the NFT marketplace business comes at a time when many other established players and new disruptors are shaking up revenue models — as a race to adopt the most competitive fee structures has emerged.<\/span>","","","The most prominent of these is X2Y2. In the last few months, it has taken around half of the share of marketplace volume on Ethereum — although it's not clear how much of this is wash trading, which is the practice of buying and selling the same NFT over and over to create a false impression of greater marketplace activity. By some <a href=\"https:\/\/twitter.com\/punk9059\/status\/1581136542726164480\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">calculations<\/a>&nbsp;X2Y2 and another marketplace, Sudoswap, have less than 20% of the market share when adjusted for wash trading.","<span data-v-f87c67ca=\"\">Earlier in October, <\/span>Solana’s largest NFT marketplace, Magic Eden, also <a href=\"https:\/\/www.theblock.co\/post\/177414\/solana-nft-platform-magic-eden-opts-for-optional-royalty-payments\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">announced<\/a> a switch to an optional royalty model. Meanwhile, <a href=\"https:\/\/www.theblock.co\/post\/180427\/looksrare-becomes-latest-nft-marketplace-to-nix-royalties-exclusive?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">LooksRare<\/a> moved to an optional model while allocating 0.5% of its trading fees to creators.","<span data-v-f87c67ca=\"\">The marketplace will enable community members to create and launch their own collections on Mooar’s launchpad, which is run like a community-driven hackathon. FSL hopes it will create a \"self-sustaining ecosystem.\" FSL said that profile picture collections will be among the first assets sold.<\/span>","<span data-v-f87c67ca=\"\">“We deeply empathise with builders in the space and we want to empower those creators,” said Shiti Manghani, COO of FSL in an interview with The Block. “We are fed up of centralized institutions and want to create a new paradigm. If we make systems that are biased against artists while championing decentralization, what’s the point?”<\/span>","<span data-v-f87c67ca=\"\">Mangani believes that, despite the race to 0% royalty structures in recent weeks, what attracts buyers and sellers to different NFT platforms “boils down to how people see value.”<\/span>","<span data-v-f87c67ca=\"\">“Long-term value will be built on platforms that reward creators,” she added.<\/span>","<span data-v-f87c67ca=\"\">As well as being a new venture for FSL, the move also looks set to attempt to revive the GMT token associated with Stepn, which will be used for governance on the marketplace, giving holders the right to vote on certain decisions, such as which projects are listed.<\/span>","<span data-v-f87c67ca=\"\">Stepn, which went to market in August 2021, has thus far struggled to find the right tokenomics balance for its users. Throughout the year, it has implemented ways to regulate the token supply such as through token buybacks and burns that reduced the amount of GMT, helping to make its gaming ecosystem more sustainable.<\/span>","<span data-v-f87c67ca=\"\">Stepn's GMT token was 86.9% below its all-time high of $4.114427 as of 8 a.m. EST on Oct. 31, according to<\/span> <a href=\"https:\/\/www.coinbase.com\/price\/stepn\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Coinbase data<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"86.9%","content":"PERCENT"},{"type":"$4.114427","content":"MONEY"},{"type":"Mooar","content":"ORGANIZATION"},{"type":"2%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"August 2021","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Netflix","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"0.5%","content":"PERCENT"},{"type":"Stepn","content":"PERSON"},{"type":"Satoshi Lab","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Oct. 31","content":"DATE"},{"type":"Shiti Manghani","content":"PERSON"},{"type":"$29.90","content":"MONEY"},{"type":"8 a.m. EST","content":"TIME"},{"type":"FSL","content":"ORGANIZATION"},{"type":"0%","content":"PERCENT"},{"type":"Solana","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Magic Eden","content":"ORGANIZATION"}],"hashtag":["MOVE2EARN"],"authors":["Lucy Harley-McKeown","The Block"]}