{"summary":"dYdX Chain has enabled trading rewards for users of its decentralized derivatives protocol following the launch of full trading on the new Cosmos-based Layer 1.\nA six-month incentive program has also been initiated, offering rewards worth $20 million in DYDX tokens.","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/264937\/dydx-starts-distributing-trading-rewards","publishDate":"2023-11-28T09:00:02","id":2667,"type":null,"title":"dYdX Chain starts paying trading rewards following governance vote","category":["DeFi"],"content":["<span data-v-f87c67ca=\"\">Cosmos-based Layer 1 dYdX Chain has begun distributing <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248448\/dydx-dydx-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/hjnIm9bV.jpg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">DYDX<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.69%\n    <\/span><\/a> <!----><\/span> rewards accrued from trading activities to users, following the commencement of full trading on the decentralized derivatives trading protocol, which was greenlit by a decisive <\/span><a href=\"https:\/\/www.mintscan.io\/dydx\/proposals\/2\" data-v-f87c67ca=\"\">governance vote<\/a>.","The beta mainnet of dYdX Chain was launched on November 14, initiating \"active trading\" across more than 33 markets with leverage of up to 20x. During the beta phase, although staking rewards were active, trading rewards were not being distributed, yet users were accruing 100% of the protocol’s trading fees. Following the conclusion of the governance vote earlier today, trading rewards are now fully enabled. Staking rewards for validators and stakers will continue to be paid in USDC and DYDX.","Since the launch of the beta stage two weeks ago, the protocol has seen over $1.86 million in total trades across roughly 14,000 transactions, as reported by the dYdX Operations subDAO, which manages the decentralized infrastructure of the dYdX Chain.","Initially, just four markets are available for full trading: BTC\/USD, ETH\/USD, SOL\/USD and LINK\/USD, with more markets to be added over the coming weeks, the dYdX Operations subDAO said.","The alpha mainnet for dYdX version 4, along with the debut of its Cosmos-based blockchain, was <a href=\"https:\/\/www.theblock.co\/post\/259658\/dydx-chain-officially-launches-on-mainnet-as-standalone-cosmos-layer-1\" data-v-f87c67ca=\"\">launched<\/a> on Oct. 26, signaling a notable transition for the leading decentralized derivatives platform to become a standalone Layer 1 on Cosmos after previously relying on Ethereum Layer 2 scaling solution StarkEx in version 3.","Users migrating from Ethereum to the dYdX Chain utilize the wethDYDX smart contract, a one-way bridge facilitating the exchange of ethDYDX tokens for wethDYDX on Ethereum and DYDX, the native token on the dYdX Chain. There are currently over 437 million ethDYDX bridged and 16.45 million DYDX staked to the dYdX Chain, <a href=\"https:\/\/x.com\/dydxfoundation\/status\/1729449381412106312?s=20\" data-v-f87c67ca=\"\">according<\/a> to the dYdX Foundation.","The dYdX community also <a href=\"https:\/\/snapshot.org\/#\/dydxgov.eth\/proposal\/0x6a6bfecb96304c6568affa4bbf07081a70c18fd56754ffb82ee53d61d3039416\" data-v-f87c67ca=\"\">approved<\/a> the introduction of a six-month incentive program today, proposed by Chaos Labs. The program earmarks $20 million in DYDX tokens to be distributed among early adopters of the dYdX Chain, aiming to boost adoption and trading volume.","The program is also designed to prevent abusive behaviors, such as wash trading, and each distribution of the DYDX rewards is subject to approval from the dYdX community.","The dYdX platform ranks as the most extensive decentralized derivatives trading platform in crypto, with a cumulative volume of over <a href=\"https:\/\/dydx.exchange\/blog\/1trillion-trading-volume\" data-v-f87c67ca=\"\">$1 trillion<\/a> since 2020.","<em data-v-f87c67ca=\"\">Updated throughout to reflect trading rewards are available to all users of the platform.<\/em>"],"hashtag":["COSMOS","DERIVATIVES","USDC"]}