{"summary":"The Association for Digital Assets Markets has lost its CEO and full-time staff.\nThe trade association’s board is trying to replace former CEO Michelle Bond, who was tightly associated with the leadership at now-bankrupt crypto exchange FTX. ","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/207833\/sam-bankman-frieds-favorite-lobby-group-is-on-life-support","publishDate":"2023-02-01T18:26:11","id":2668,"type":null,"title":"Sam Bankman-Fried&#x27;s favorite lobby group is on life support","category":["Policy"],"content":["The Association for Digital Assets Markets, a trade association for the crypto industry, has been without a CEO and head of policy since the start of the year, and is now rallying its founders in a bid to come back to political prominence.","A Jan. 2 email to members obtained by The Block confirms that CEO Michelle Bond and head of policy Robert Baldwin left the trade group, which is known as ADAM, around the new year. There are no other full-time staff. The board is now searching for a new CEO, the email said.","Baldwin, a former policy staffer at the U.S. Treasury Department, joined the Republican staff for the Senate Banking Committee as a national security advisor, according to his LinkedIn profile. It's unclear where Bond is now.&nbsp;","In the email, Brad Volpi, the board president and head of digital assets at Hudson River Trading, tells ADAM’s members: “We believe ADAM's role as an industry-led group, with the roster of high-quality organizations committed to good market structure and advocating for thoughtful regulation is paramount.”&nbsp;","In the meantime, Conaway Graves, a lobbying shop founded by Mike Conaway, the former congressman and chair of the House Agriculture Committee, has taken over day-to-day operations.","Baldwin and Volpi have not responded to requests for comment. Bond could not be reached. Scott Graves of Conaway Graves declined to comment on the record. &nbsp;","First launched in 2018, ADAM later hitched its wagon to FTX as the now-disgraced exchange was forging a path through Washington, D.C. The association formally <a href=\"https:\/\/www.prnewswire.com\/news-releases\/adam-board-and-membership-expand-as-digital-asset-market-integrity-standards-drive-conversations-in-washington-301485097.html\" data-v-f87c67ca=\"\">announced<\/a> both FTX and FTX.US as board members in February 2022. Bond appeared behind Bankman-Fried in a <a href=\"https:\/\/financialservices.house.gov\/calendar\/eventsingle.aspx?EventID=408206\" data-v-f87c67ca=\"\">hearing<\/a> before the House Financial Services Committee in December 2021, around the time the firm first hired serious policy muscle and began moving into lobbying spending.","As <a href=\"https:\/\/www.theblock.co\/post\/160714\/crypto-booster-michelle-bond-is-running-for-congress-with-help-from-her-ftx-exec-boyfriend\" data-v-f87c67ca=\"\">The Block previously reported<\/a>, Bond also dated FTX Digital Markets co-CEO Ryan Salame, who contributed heavily to her failed campaign for a congressional seat in New York. Bond took consulting fees of $200,000 a year from FTX Digital Markets in the two years leading up to that campaign, in addition to a total of $550,000 that she made as ADAM’s CEO, according to a candidate financial disclosure.&nbsp;&nbsp;","FTX.US’ general counsel, Ryne Miller, and head of policy, Mark Wetjen, were both on ADAM's board of directors up <a href=\"https:\/\/web.archive.org\/web\/20220928000054\/https:\/www.theadam.io\/about\/#bod\" data-v-f87c67ca=\"\">until<\/a> the firm’s collapse, at which point all reference to it and its employees were quietly&nbsp;<a href=\"https:\/\/web.archive.org\/web\/20220928000054\/https:\/www.theadam.io\/about\/\" data-v-f87c67ca=\"\">removed<\/a>. Jane Street, Sam Bankman-Fried’s employer before he founded Alameda Research, remains on the <a href=\"https:\/\/www.theadam.io\/members\" data-v-f87c67ca=\"\">public roster<\/a>. Other members include Jump Crypto, Fireblocks and Robinhood.","FTX.US was also a member of trade associations such as the Crypto Council for Innovation and the Chamber of Digital Commerce, which dropped the firm around the same time. However, sources in the crypto lobby say the firm did not enjoy the same pull at non-ADAM associations. Meanwhile, ADAM operated much more independently from other industry groups.&nbsp;","Between its FTX and FTX.US brands, Sam Bankman-Fried-controlled companies spent up to $330,000 per quarter on lobbying, both through an internal program and contracts with outside firms, including Conaway Graves, according to lobbying disclosures. All of those firms terminated their contracts around FTX's collapse and bankruptcy filing. That figure does not include membership fees or other costs related to trade associations like ADAM.&nbsp;","<i data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/i><span class=\"s2\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<em data-v-f87c67ca=\"\">Correction: Story updated to clarify relationship between Jump and FTX.&nbsp;<\/em>"],"hashtag":["FUNDRAISING"]}