{"summary":"The SEC wants to bulk up its enforcement and examinations division by adding over 50 new positions, according to its budget request. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284279\/sec-and-other-federal-agencies-seek-to-bulk-up-on-cryptocurrency-resources-in-2025-budget-requests","publishDate":"2024-03-22T15:56:43","id":267,"type":null,"title":"SEC and other federal agencies seek to bulk up on cryptocurrency resources in 2025 budget requests","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Securities and Exchange Commission wants to bulk up its enforcement and examinations division by adding over 50 new positions, according to its most recent budget request.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The agency said more funding is needed to address new technology such as artificial intelligence and a change in investor communications, including Reddit forums and celebrity influencers. Crypto is also a priority, according to the SEC's fiscal year 2025 <a href=\"https:\/\/www.sec.gov\/cj\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">budget request<\/span><\/a>.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Further, we’ve seen the Wild West of the crypto markets, rife with noncompliance, where investors have put hard-earned assets at risk in a highly speculative asset class. Such growth and rapid change also mean more possibility for wrongdoing,\" the SEC said in its request submitted last week. \"As the cop on the beat, we must be able to meet the match of bad actors. Thus, it makes sense for the SEC to keep pace with the expansion and increased complexity in the capital markets.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Budget requests are more of an annual appropriation process that is sent to lawmakers in the House and Senate appropriations committees to then draft legislation. Those bills are then voted on, which can be a lengthy process that can go right up until the deadline.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">This year, the SEC asked to add 23 positions in its examination division. The division conducts exams annually to inform rulemaking and root out misconduct. More resources will \"strengthen the division’s ability to address critical and evolving risks such as those associated with the resiliency of critical market infrastructure, cyber and information security, and crypto assets and emerging technologies,\" the SEC said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC also wants to add 33 new positions in its enforcement division, which has been busy this past year bringing cases against large crypto exchanges such as Coinbase, Binance and Kraken along with NFT projects.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The agency also requested one more position for its office of investor education.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"This position will focus primarily on handling questions and complaints related to fraud involving crypto asset securities,\" the SEC said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The Treasury Department's Office of Terrorism and Financial Intelligence asked for $230.5 million for fiscal year 2025, up 6.7 percent from FY 2024. One of its many objectives is to increase transparency to detect illicit financial activities.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Over the past year, this work has focused on better understanding and combating digital asset gaps in the U.S. and global financial system, as well as ransomware financing, Russia illicit financing, and money laundering from fentanyl and synthetic opioids among other important issues,\" Treasury said in its <a href=\"https:\/\/home.treasury.gov\/system\/files\/266\/FY-2025-Budget-in-Brief-Combined.pdf\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">budget request<\/span><\/a>.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Treasury also asked for an increase in spending for the Financial Stability Oversight Council, which is tasked with monitoring the stability of the financial system and <\/span><span class=\"s4\" data-v-f87c67ca=\"\">chaired by Treasury Secretary Janet Yellen.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">According to the request, the increase in funding will be used to address risks related to climate and digital assets, among other things.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The Commodity Futures Trading Commission asked for more resources in its Division of Clearing and Risk, which oversees derivatives clearing organizations and swaps clearing. The CFTC said in its <a href=\"https:\/\/www.cftc.gov\/sites\/default\/files\/CFTC%20FY%202025%20President's%20Budget_Final_for%20Posting.pdf\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">budget request<\/span><\/a> that the number of derivatives clearing organizations (DCOs) clearing products in digital assets has increased.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"All DCOs need to employ top-notch data breach security solutions,\" the CFTC said. \"However, those participating in the new digital innovation ecosystem are exposed to additional risks that must be assessed, mitigated, and monitored, then examined accordingly by the Division. Each new digital asset operates differently and with its own specialized set of threat vectors which each carry its own unique set of risks that need to be identified, assessed and then examined.\"<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2025","content":"DATE"},{"type":"Reddit","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"Janet Yellen","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"House","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"$230.5 million","content":"MONEY"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Russia","content":"LOCATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"\" Treasury","content":"ORGANIZATION"},{"type":"Treasury Department's Office of Terrorism and Financial Intelligence","content":"ORGANIZATION"},{"type":"fiscal year 2025","content":"DATE"},{"type":"6.7 percent","content":"PERCENT"},{"type":"Financial Stability Oversight Council","content":"ORGANIZATION"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":["CFTC","SEC"],"authors":["Sarah Wynn","The Block"]}