{"summary":"The Bitcoin network has adjusted its mining difficulty to accommodate the recent major drop in hash rate, and keep blocks producing on time.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/110425\/bitcoin-largest-difficulty-drop-ever","publishDate":"2021-07-03T02:38:09","id":2671,"type":null,"title":"Bitcoin network undergoes largest difficulty drop ever by nearly 28%","category":["BITCOIN"],"content":["The mining difficulty of the Bitcoin network has dropped by 27.9%, as the network adjusts to the massive drop in hash rate. This is the biggest decrease in mining difficulty since the network went live in 2009 — and ended up even higher than <a href=\"https:\/\/www.theblockcrypto.com\/post\/109752\/bitcoin-mining-difficulty-record-drop-china-miners\" data-v-f87c67ca=\"\">last week's estimates<\/a>.","","","The Bitcoin network updates its mining difficulty level every 2,016 blocks, which is roughly every two weeks. This is designed to make sure blocks are produced every ten minutes or so, despite a fluctuating hash rate.","And in this case, the hash rate has certainly been volatile. Since the previous adjustment on June 13, Bitcoin’s seven-day moving average hash rate has fallen from 136.47 EH\/s to 85 EH\/s — down 35%.","This was largely caused by a crackdown on bitcoin mining in China, which is causing the hash rate <a href=\"https:\/\/www.theblockcrypto.com\/daily\/110096\/kazakhstan-destination-chinese-bitcoin-miners\" data-v-f87c67ca=\"\">to migrate<\/a> as operations seek friendlier jurisdictions elsewhere.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoins-hash-rate-daily\/embed\" title=\"Bitcoin's Hash Rate (7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","This lower hash rate led to a slower rate of block production as the remaining hashing power was unable to keep up with the high difficulty level. For the last two weeks, blocks were produced nearly every 13.9 minutes on average, much higher than usual, based on The Block's calculation.","On July 1, it even took 129 minutes to produce a block, the longest time since 2011, although it’s worth noting that multiple factors come into play here, including the inherent variance in block times.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"27.9%","content":"PERCENT"},{"type":"35%","content":"PERCENT"},{"type":"2011","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"July 1","content":"DATE"},{"type":"2009","content":"DATE"},{"type":"June 13","content":"DATE"},{"type":"China","content":"LOCATION"}],"hashtag":["BITCOIN"],"authors":["Tim Copeland","The Block"]}