{"summary":"After a rocky first week, the price of Aptos (APT) is up more than 30% after a short squeeze caused a surge of liquidations.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179252\/aptos-surges-short-liquidations","publishDate":"2022-10-23T07:20:23","id":2673,"type":null,"title":"Aptos surges more than 30% following wave of short liquidations","category":["CRYPTOCURRENCY"],"content":["The price of Aptos (APT) has increased more than 30% over the past 24 hours, according to data from CoinGecko, after significant post-listing price drops occurred across major cryptocurrency exchanges — including Binance, FTX and OKX.","The Aptos price surge came after many short-hungry traders were liquidated — commonly known as a \"short squeeze.\" Funding rates for APT across many crypto exchanges were negative until price action to the upside caused a surge of liquidations, forcing shorts to close and increasing the crypto asset's price.","There is speculation that the negative funding was a result of widespread hedging after Aptos embarked into a less-than-receptive industry audience. Additionally, perpetual swaps going live on various exchanges immediately after spot trading <a href=\"https:\/\/www.theblock.co\/post\/177913\/aptos-perpetual-trading-to-go-live-on-binance-okx-within-an-hour-of-spot\" data-v-f87c67ca=\"\">increased<\/a> the ability of traders to gain short exposure to the trending asset.","Aptos liquidations experienced sharp increases as the price increased. Source: <a href=\"https:\/\/coinalyze.net\/snapshot\/WXMZQ58B\" data-v-f87c67ca=\"\">Coinalyze \/ TradingView<\/a>","Aptos — which originated from the Facebook blockchain project Libra — has been one of the hottest topics in the blockchain and cryptocurrency industry over the past week. Its mainnet went live on Oct. 17 and has been <a href=\"https:\/\/www.theblock.co\/post\/177817\/aptoss-layer-1-mainnet-launching-soon-date-not-finalized\" data-v-f87c67ca=\"\">viewed<\/a> as something of a Solana killer.","Many in the industry have shown skepticism toward the VC-funded project — particularly after its opaque tokenomics were <a href=\"https:\/\/www.theblock.co\/post\/177865\/aptos-releases-tokenomics-summary-one-day-before-trading-goes-live\" data-v-f87c67ca=\"\">explained<\/a> only one day before APT trading went live.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Aptos","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Coinalyze \/ TradingView","content":"ORGANIZATION"},{"type":"Oct. 17","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["APTOS"],"authors":["Adam James","The Block"]}