{"summary":"An acquisition of Zipmex by Coinbase had been discussed, but in March the pair settled instead on a strategic investment.\nZipmex is currently working on a Series B+ raise that could value it at $400 million.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/151004\/coinbase-to-make-strategic-investment-in-zipmex-following-acquisition-talks","publishDate":"2022-06-09T05:24:22","id":2674,"type":null,"title":"Coinbase to make strategic investment in Zipmex following acquisition talks","category":["Exchanges"],"content":["Coinbase has agreed to invest in Southeast Asian crypto exchange Zipmex as part of its latest fundraising round after deciding against a full acquisition.","A purchase of Zipmex by Coinbase had been discussed by the pair, but ultimately they settled instead on a strategic investment, according to people familiar with the matter. Coinbase signed a term sheet committing to that investment in March.","Zipmex has been courting investors in recent weeks as it attempts to raise around $40 million at a valuation of $400 million, according to one other person close to the talks. They added that Babel Finance may lead the round, but a spokesperson for Babel declined to comment.","A spokesperson for Zipmex said: “We are in process of raising Series B+ and are speaking to a range of investors. We have not finalized lead investors or valuation. We cannot comment on market speculation or rumors.”","Founded by CEO Marcus Lim in 2018, Zipmex has already hauled in some $52 million in Series B funding — spread across investments of <a href=\"https:\/\/www.businesstimes.com.sg\/garage\/zipmex-raises-us41m-from-b-capital-and-others-to-grow-digital-assets-platform\" data-v-f87c67ca=\"\">$41 million<\/a> and <a href=\"https:\/\/www.techinasia.com\/exclusive-zipmex-bags-additional-11m-series-money\" data-v-f87c67ca=\"\">$11 million<\/a> in September 2021 and March this year, respectively. Its existing investors include B Capital, TNB Aura, V Ventures, Bank of Ayudhya’s Krungsri Finnovate, Master Ad and MindWorks Capital. The proceeds of those rounds were earmarked for boosting Zipmex’s presence across Southeast Asia.","While legally headquartered in Singapore, Zipmex has deep roots in Thailand — where it has a digital assets exchange license issued by the Ministry of Finance, the local regulator. In December of last year, <a href=\"https:\/\/www.bangkokpost.com\/business\/2229747\/zipmex-mulling-asia-pacific-expansion\" data-v-f87c67ca=\"\">The Bangkok Post<\/a> reported that Zipmex accounted for roughly a quarter of the turnover of the digital assets market in Thailand.","The company also has offices in Singapore, Thailand, Australia and Indonesia.","After going public through a landmark direct listing on Nasdaq in April last year, Coinbase is currently in cash conservation mode. Last week, the US exchange operator said it would <a href=\"https:\/\/www.theblockcrypto.com\/linked\/149965\/coinbase-extends-hiring-freeze-will-rescind-some-accepted-offers\" data-v-f87c67ca=\"\">extend a hiring freeze<\/a> and rescind some job offers, in an effort to adjust to a tougher macro environment and volatile crypto markets.","A few weeks earlier, it had announced <a href=\"https:\/\/www.theblockcrypto.com\/linked\/147940\/coinbase-is-launching-an-initiative-to-slash-spending-and-grow-revenue-the-information\" data-v-f87c67ca=\"\">plans to slash spending<\/a> and boost revenue, after posting <a href=\"https:\/\/www.theblockcrypto.com\/post\/146161\/coinbase-q1-2022-earnings-revenue\" data-v-f87c67ca=\"\">a net loss of $430 million<\/a> in the first quarter of this year."],"hashtag":["COINBASE"]}