{"summary":"Italy’s securities regulator Consob says Binance is unauthorized to offer services in the country.\n“This has no direct impact on the services provided on Binance.com,” a Binance spokesperson told The Block.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/111482\/italy-binance-consob-warning","publishDate":"2021-07-15T06:59:34","id":2676,"type":null,"title":"Italy joins the list of global regulators warning against Binance","category":["The Block"],"content":["Italy's securities regulator Consob is the latest government agency to issue a warning against Binance, saying that the crypto exchange is unauthorized to operate in the country.","\"Consob warns savers that the companies of the 'Binance Group' are not authorized to provide investment services and activities in Italy, not even through the website www.binance.com,\" <a href=\"https:\/\/www.consob.it\/documents\/46180\/46181\/pr_20210715.pdf\/7f78ad2d-a146-4b17-abe8-92efac07f49e\" data-v-f87c67ca=\"\">said<\/a> the regulator on Thursday.","This is even though certain sections of Binance.com, including derivatives and stock tokens, are in Italian, said Consob. Binance.com has been available in Italian <a href=\"https:\/\/www.binance.com\/en\/support\/announcement\/360006973192\" data-v-f87c67ca=\"\">since 2018<\/a>.","“We are aware of the notice from CONSOB and can confirm that Binance.com does not operate out of Italy. This has no direct impact on the services provided on Binance.com,\" a Binance spokesperson told The Block when contacted.","“We take a collaborative approach in working with regulators and we take our compliance obligations very seriously. We are actively keeping abreast of changing policies, rules and laws in this new space.”","Consob's warning is similar to other regulators' notices and actions against Binance in recent weeks. It all started when the U.K.'s Financial Conduct Authority (FCA) <a href=\"https:\/\/www.theblockcrypto.com\/post\/109766\/uk-fca-bans-crypto-exchange-binance\" data-v-f87c67ca=\"\">banned<\/a> Binance Markets Limited (BML) — Binance's U.K. entity — saying that the firm is not authorized to operate in the country.","The notice also said that no other entity in the Binance Group was authorized to operate in the U.K. but since Binance's main exchange isn't based in the U.K., it <a href=\"https:\/\/www.theblockcrypto.com\/daily\/109841\/uk-fca-binance-ban-derivatives-spot-trading\" data-v-f87c67ca=\"\">likely falls outside<\/a> of the cryptoasset regime.","However, the FCA's warning appears to have already impacted Binance's business. The exchange is losing fiat onramps as several British banks, including Santander UK and Barclays, have <a href=\"https:\/\/www.theblockcrypto.com\/post\/110818\/santander-uk-block-payments-binance-crypto\" data-v-f87c67ca=\"\">moved to block<\/a> user payments to Binance.com.","Binance itself had to suspend customer deposits via the Single Euro Payments Area (SEPA) due to \"events beyond our control.\" The SEPA network allows customers to send euros across 36 countries.","Besides in Italy and the U.K., regulators of other countries, including the U.S., Japan, Thailand, Poland, and the Cayman Islands, have all either issued warnings or taken action against the exchange recently."],"hashtag":["BINANCE"]}