{"summary":"The highly volatile cryptocurrency market is fertile ground for speculative trading, and a company that tokenizes investment strategies wants to help","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/31354\/defi-startup-offers-etf-analog-allowing-investors-to-trade-on-trends","publishDate":"2019-07-15T14:59:14","id":2677,"type":null,"title":"DeFi startup offers ETF analog allowing investors to trade on trends","category":["DEFI"],"content":["<span data-v-f87c67ca=\"\">The highly volatile cryptocurrency market is <\/span><a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2019-05-31\/bitcoin-s-rally-masks-uncomfortable-fact-almost-nobody-uses-it?srnd=cryptocurrencies\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">fertile ground for speculative trading<\/span><\/a><span data-v-f87c67ca=\"\">, and a company that tokenizes investment strategies wants to help retail investors capture the upside and minimize the downside via a new token.&nbsp;<\/span>","Set Protocol, a San Francisco-based DeFi startup, announced today that it has launched tokens, or \"Sets,\" to represent a basket of cryptocurrencies that can automatically rebalance based on different technical indicators. This means investors without any sophisticated knowledge of various trading techniques can also trade based on market trends.&nbsp; &nbsp;","<strong data-v-f87c67ca=\"\">How it works<\/strong>","<span data-v-f87c67ca=\"\">The first trend trading “Set” that the company has made available is a basket consisting of 100% ETH or USDC. The Set follows the ETH 20-Day Simple Moving Average index and will automatically convert all ETH to USDC when the current ETH price stays below the index price for six hours and vice versa.<\/span>","<span data-v-f87c67ca=\"\">The company is betting that this new offering will appeal to amateur investors, who are usually deterred from trend trading due to the market expertise required to understand various technical indicators and trade accordingly. With Set Protocol’s offering, however, these investors are able to choose the “Set” they want and let the system buy and sells digital assets for them automatically.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“There's a number of people who actually pay attention to technical analysis, but they don't have the time, effort, knowledge, or discipline to actually implement these strategies well,” Set Protocol CEO Felix Feng told The Block. “So this is the first time we think that the amateur traders will actually be able to get exposure simply by getting a token.”&nbsp;<\/span>","<strong data-v-f87c67ca=\"\">Better performance<\/strong>","<span data-v-f87c67ca=\"\">According to Feng, trend trading is also a particularly effective strategy in the Wild West of the cryptocurrency market, which is riddled with speculative trading. Feng pointed out that compared to traditional assets like stocks and bonds, digital assets lack a clear valuation model and therefore leaves space for eye-catching price swings that in turn generate momentum for trend trading to profit.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“You don't have a valuation model for crypto yet, and that's why you have frequent mispricing and lots of volatility,” said Feng. “That's why, to an extent, momentum trading works.”&nbsp;<\/span>","In a test the company ran based on historical ETH price data, the 20-Day SMA tracking Set has consistently outperformed a 100% hold ETH strategy in the bear market of 2018.&nbsp;","","","<strong data-v-f87c67ca=\"\">More Sets<\/strong>","<span data-v-f87c67ca=\"\">Prior to the trend trading strategies, Set Protocol launched the tokenization of two other categories of investment strategies in April. Since then, <\/span><span data-v-f87c67ca=\"\">the company has grown from $70,000 in assets under management to around $450,000. <\/span>","<span data-v-f87c67ca=\"\">Looking ahead, the company plans to roll out more trading strategies and Sets that consist of different tokens. For one, it is looking to include ETH lending platform Compound’s tokens to give some Sets interest-yielding capacity.&nbsp;<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">“<\/span><\/i><span data-v-f87c67ca=\"\">I think the moving average strategy (based on technical indicators), if you can add interest tokens such as Compound’s cTokens or [Fulcrum's] iTokens into it, I think it will become extremely compelling,” said Feng.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"100%","content":"PERCENT"},{"type":"$70,000","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$450,000","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"April","content":"DATE"},{"type":"Feng","content":"ORGANIZATION"},{"type":"Felix Feng","content":"PERSON"}],"hashtag":["TOKENIZATION"],"authors":["The Block","The Block"]}