{"summary":"Crypto media company CoinDesk has laid off 45% of its editorial staff as its parent company DCG plans to bring on strategic investors. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244665\/coindesk-lays-off-45-of-editorial-staff-as-it-eyes-deal-to-sell-company","publishDate":"2023-08-14T09:42:05","id":2678,"type":null,"title":"CoinDesk lays off 45% of editorial staff as it eyes deal to sell company","category":["COMPANIES"],"content":["Crypto media company CoinDesk has laid off 45% of its editorial staff as its parent company Digital Currency Group plans to bring on strategic investors.&nbsp;","The company, which was founded in 2013, announced the layoffs internally on Monday, according to a memo reviewed by The Block. The firm is having an all-hands meeting at 4:00pm ET to discuss the layoffs.&nbsp;","\"The purpose of the meeting is to inform everyone that today several roles, predominantly in our media team, were impacted by a reduction in force,\" the message, penned by CoinDesk CEO Kevin Worth, reads. \"This is an incredibly difficult message to send to everyone over email and yet I also wanted everyone at CoinDesk to know as soon as possible what is happening today.\"","\"This was a required step to ensure a financially sound business moving forward and to set us on the path to close the deal to sell CoinDesk Inc,\" he added.","The media company is laying off 20 people, according to a source familiar with the situation, which represents 45% of its editorial team. This represents a 16% cut in workforce for the whole company, according to another source.","At the end of July, The Wall Street Journal <a href=\"https:\/\/www.wsj.com\/articles\/investor-group-nears-125-million-deal-for-coindesk-146a6faa\" data-v-f87c67ca=\"\">reported<\/a> that the firm was nearing a $125 million deal with a syndicate led by crypto investor Matthew Roszak of Tally Capital. As part of the deal, DCG would maintain a stake in the media property, which has business offerings in events, data, and indexes.&nbsp;","DCG <a href=\"https:\/\/www.axios.com\/2018\/08\/20\/coindesks-quietly-profitable-media-business-1534801642\" data-v-f87c67ca=\"\">purchased<\/a> the company for $500,000 in 2016.&nbsp;","As per DCG's <a href=\"https:\/\/www.theblock.co\/post\/242350\/dcg-says-its-close-to-reaching-agreement-on-genesis-chapter-11-appoints-new-cfo\" data-v-f87c67ca=\"\">second quarter investor letter<\/a> to shareholders, CoinDesk hired financial advisers to \"help bring on new institutional and strategic investors alongside DCG.\"","\"With positive momentum and feedback from the market, we have held discussions with numerous interested parties over the last few months and these processes are progressing,\" the letter added.&nbsp;","The firm added that CoinDesk clocked in a strong quarter \"driven by $15 million in revenues from the Consensus 2023 festival in April.\"&nbsp;","DCG, which operates a number of companies across the cryptocurrency landscape, is also in the process of looking for new investors for its crypto exchange Luno. The firm's subsidiary Genesis Capital was among the lenders hit hard during last year's credit crisis. In January, Genesis filed for Chapter 11 bankruptcy protection, listing over 100,000 creditors with liabilities in the range of $1.2 billion to $11 billion.&nbsp;","CoinDesk is a competitor news company to The Block.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DCG","content":"ORGANIZATION"},{"type":"2016","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Genesis Capital","content":"ORGANIZATION"},{"type":"45%","content":"PERCENT"},{"type":"July","content":"DATE"},{"type":"Matthew Roszak","content":"PERSON"},{"type":"$11 billion","content":"MONEY"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"CoinDesk Inc","content":"ORGANIZATION"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"$500,000","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"16%","content":"PERCENT"},{"type":"$15 million","content":"MONEY"},{"type":"$125 million","content":"MONEY"},{"type":"Kevin Worth","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"$1.2 billion","content":"MONEY"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}