{"summary":"ETHPoW has officially launched its mainnet.\nThe published details included information users need to interact with the chain, such as its mainnet RPC and block explorer URL.","author":["Mike Truppa","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/170463\/ethpow-goes-live-after-ethereums-proof-of-stake-merge","publishDate":"2022-09-15T12:53:51","id":2679,"type":null,"title":"ETHPoW goes live after Ethereum&#x27;s proof-of-stake Merge","category":["Ethereum"],"content":["ETHPoW — a continuation or \"fork\" of the proof-of-work Ethereum chain — has gone live with its mainnet.","The move follows Ethereum's long-in-the-making shift to proof-of-stake validation, a process dubbed The Merge. As previously reported, <a href=\"https:\/\/www.theblock.co\/post\/163229\/ethpow-team-says-its-miner-led-ethereum-fork-is-inevitable\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">ETHPoW<\/a> — which sparked controversy and discussion since its inception — was started by mine operator Chandler Guo.&nbsp;","The ETHPoW team <a href=\"https:\/\/twitter.com\/EthereumPoW\/status\/1570413723969552385\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">published<\/a> a list of resources earlier Thursday. The release included key technical requirements and details. Chiefly, the official RPC for users to add ETHPoW to their wallets and block explorer URL <a href=\"https:\/\/twitter.com\/EthereumPoW\/status\/1570413723969552385?s=20&amp;t=H6KedNY27ZpRipBODzRvpA\" data-v-f87c67ca=\"\">were also published.<\/a>","Within minutes of the links being released, ETHPoW’s website servers shut down due to heightened activity.","Some participants planned for the ETHPoW kick-off via <a href=\"https:\/\/www.theblock.co\/post\/168111\/crypto-lending-platforms-react-to-high-eth-borrowing-by-traders-ahead-of-the-merge\" data-v-f87c67ca=\"\">borrowing ETH<\/a>. Others took to social media to warn about interacting with the brand-new chain and raised concerns about potential <a href=\"https:\/\/decrypt.co\/108791\/ethereum-merge-almost-here-what-could-go-wrong\" data-v-f87c67ca=\"\">replay attacks<\/a> and possible volatility around the token's value.&nbsp;","A replay attack is when two chains – in this case, ETHPoW and ETH proof of stake – run the same chain ID that allows bad actors to submit transactions on both chains. This exposes users who interact with the new ETHPoW chain to the risk of having their proof-of-stake ETH stolen."],"hashtag":["AIRDROP","ETHEREUM"]}