{"summary":"The New York Digital Investment Group (NYDIG) has raised $190 million for one of its bitcoin funds\nThe group operates a total of three publicly-known funds ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/70113\/crypto-asset-manager-nydig-raises-190-million-for-bitcoin-fund","publishDate":"2020-07-01T05:15:25","id":268,"type":null,"title":"Crypto asset manager NYDIG raises $190 million for bitcoin fund","category":["Bitcoin"],"content":["The New York Digital Investment Group (NYDIG) has raised $190 million for one of its bitcoin funds, according to a Form D document submitted to the U.S. Securities and Exchange Commission (SEC) on Wednesday.","The fund, called NYDIG Institutional Bitcoin Fund LP, has grabbed the amount from 24 unnamed investors, <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1758651\/000175865120000001\/xslFormDX01\/primary_doc.xml\" data-v-f87c67ca=\"\">per the form<\/a>. The fund <a href=\"https:\/\/sec.report\/Document\/0001758651-18-000003\/\" data-v-f87c67ca=\"\">initially registered<\/a> with the SEC in 2018. At the time, it raised $31 million from 3 investors. Later, in 2019, it <a href=\"https:\/\/www.formds.com\/issuers\/nydig-institutional-digital-asset-fund-lp\" data-v-f87c67ca=\"\">raised<\/a> $54 million from 6 investors. Wednesday’s amount is a fresh investment from two dozen investors.","The fund’s investment strategy remains unclear. The Block has reached out to NYDIG for more details and will update this story should we hear back. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nNYDIG is a regulated entity that <a href=\"https:\/\/www.theblockcrypto.com\/linked\/3337\/new-york-issues-its-14th-bitlicense-to-new-york-digital-investment-group\" data-v-f87c67ca=\"\">received a BitLicense<\/a> in 2018 and a limited purpose trust charter from the New York Department of Financial Services in 2019.","NYDIG operates two more bitcoin funds - the NYDIG Bitcoin Strategy Fund and the NYDIG Bitcoin Yield Enhancement Fund.","The NYDIG Bitcoin Strategy Fund was <a href=\"https:\/\/www.theblockcrypto.com\/post\/49740\/15-billion-asset-manager-is-the-latest-to-receive-sec-approval-for-its-bitcoin-futures-fund\" data-v-f87c67ca=\"\">approved<\/a> by the SEC in December 2019 and is a portfolio fund in the Stone Ridge Trust VI. The fund invests in cash-settled bitcoin futures contracts offered by CME. In December, NYDIG aimed to raise $25 million through the fund. It is not clear whether the fund raised that amount or what is its current size.","The other fund, NYDIG Bitcoin Yield Enhancement Fund, was disclosed in May of this year and raised nearly $140 million.&nbsp;The growing assets under management (AUM) of NYDIG suggest that institutional investors are increasingly looking to get bitcoin exposure. In comparison, top crypto asset manager Grayscale has a total AUM of over $4 billion.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nA <a href=\"https:\/\/www.theblockcrypto.com\/post\/67763\/fidelity-nearly-80-of-institutional-investors-see-the-appeal-of-digital-assets\" data-v-f87c67ca=\"\">recent survey<\/a> by Fidelity Digital Assets found that nearly 80% of 800 institutional investors in the U.S. and Europe see the appeal of digital assets and more than a third of such investors have already invested in the market. More investors have also taken on exposure to derivatives, according to the survey. The percentage of U.S. investors with exposure to cryptocurrency futures increased from 9% in 2019 to 22% in 2020."],"hashtag":["BITCOIN"]}