{"summary":"Hecht will work with the firm’s Chief Compliance Officer Noah Perlman to ensure the firm mitigates financial crime risk. ","author":["MK Manoylov","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242995\/binance-promotes-kristen-hecht-to-deputy-chief-compliance-officer","publishDate":"2023-08-03T11:06:58","id":2681,"type":null,"title":"Binance promotes Kristen Hecht to Deputy Chief Compliance Officer","category":["Companies"],"content":["Kristen Hecht has stepped in as <a href=\"https:\/\/www.binance.us\/\" data-v-f87c67ca=\"\">Binance<\/a>'s Deputy Chief Compliance Officer.&nbsp;","The move comes nearly two months after the Securities and Exchange Commission <a href=\"https:\/\/www.theblock.co\/post\/233146\/us-sec-sues-binance-ceo-zhao-for-breaking-securities-rules\" data-v-f87c67ca=\"\">sued<\/a> Binance on June 5 for allegedly breaking U.S. securities regulations.","Hecht has been at Binance since January of this year as the firm's Global Head of Corporate Compliance. She'll now be working with Noah Perlman, Binance's Chief Compliance Officer, who has been tasked to make Binance's reputation and regulatory compliance \"<a href=\"https:\/\/www.theblock.co\/post\/230403\/binance-noah-perlman-chief-compliance-officer-beyond-reproach\" data-v-f87c67ca=\"\">beyond reproach<\/a>.\"&nbsp;","Additionally, Hecht will manage teams of money laundering reporting officers as the crypto exchange's Global Money Laundering Reporting Officer, ensuring the firm follows jurisdictional requirements and mitigates financial crime risk.&nbsp;&nbsp;","\"As an organization that is obsessed with its users and has come a long way toward building a best-in-class compliance program comparable to global financial institutions, I hope to raise further awareness with regulatory and industry partners about the crypto industry to build trust and collaborate in this fast-developing space,” Hecht said in a statement.","Before joining Binance, Hecht was the Chief Compliance Officer at Meta's <a href=\"https:\/\/www.theblock.co\/post\/155605\/meta-to-close-down-novi-crypto-payments-wallet-in-september\" data-v-f87c67ca=\"\">now-defunct<\/a> cryptocurrency wallet project <a href=\"https:\/\/www.theblock.co\/linked\/126941\/novi-whatsapp\" data-v-f87c67ca=\"\">Novi<\/a>."],"hashtag":["BINANCE"]}