{"summary":"Paxos has raised $142 million in a Series C funding round\nThe firm will use the fresh cash to expand its stablecoin offerings, white-label crypto brokerage services, and blockchain settlement \nInvestors include Declaration Partners, PayPal Ventures and Ken Moelis","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/88133\/142-million-series-c-paxos-crypto-stablecoins","publishDate":"2020-12-17T06:00:09","id":2682,"type":null,"title":"$142 million: Paxos inks Series C with backers Declaration Partners, PayPal, Ken Moelis and more","category":["Investments"],"content":["New York-based Paxos is ending 2020 with one of the crypto world's biggest funding rounds.","The firm's $142 million Series C funding round will underpin Paxos's plans to expand its business lines, which include stablecoins, cryptocurrency trading and blockchain-based settlement.&nbsp;","The fresh injection of capital brings several heavyweights onto Paxos' cap table: lead investor Declaration Partners, PayPal Ventures, RIT Capital Partners, and investment banking legend Ken Moelis.","The firm declined to share the valuation under which the funding round was conducted, but the new cash brings the total amount raised by the firm to more than $240 million. Data from The Block Research shows that the Paxos round is the tenth-largest fundraise among blockchain and crypto companies.","","","The funding round caps a busy year for Paxos, which drove headlines earlier this year via its partnership with payments giant PayPal. That partnership comes care of&nbsp;Paxos'&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/linked\/72177\/paypal-has-reportedly-partnered-with-paxos-to-launch-its-crypto-service\" data-v-f87c67ca=\"\">recently launched<\/a> API-based brokerage service, Paxos Crypto Brokerage, which handles the regulatory, technological and liquidity aspects of the crypto features. European fintech firm Revolut is also a customer.","A spokeswoman for Paxos said the pipeline of clients for its white-label services is strong, noting that some of the largest financial technology, banks, and brokerages are lined up to partner with the firm.&nbsp;","\"There are many firms that are considering us on the brokerage side — some of the largest ones in the world,\" chief executive officer Chad Cascarilla said during an episode of The Block Live.&nbsp;","\"But we also have firms that rely on us for our other products — Soc Gen, Credit Suisse, Instinet Nomura,\" he said, referring to the firm's blockchain <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2019-10-28\/paxos-gets-sec-nod-to-use-blockchain-to-settle-stock-trades\" data-v-f87c67ca=\"\">settlement platform<\/a>, which it announced at the end of 2019.&nbsp;","Already, the firm's new client relationships with PayPal and Revolut have been a boon for its exchange, itBit. Since the beginning the year, Paxos' exchange has clocked in $3 billion in trading volumes with nearly half of those volumes coming since PayPal began offering crypto in October.&nbsp;","","","Looking to the future, the firm plans to leverage its new capital to lure Wall Street to its settlement and crypto products.&nbsp;","To that end, Paxos plans to expand its headcount by more than 100 in 2021 and beef up its regulatory efforts by <a href=\"https:\/\/www.theblockcrypto.com\/linked\/87255\/paxos-application-bank-charter-us\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">seeking a national bank charter<\/a> from the Office of the Comptroller of the Currency to complement its New York trust charter.&nbsp;","A stronger regulatory position and strengthened balance sheet could make Paxos a more attractive partner. It's also a continuation of the firm's established affinity for being regulated.&nbsp;","\"You know, it's just, some of these things take time,\" Cascarilla said. \"We've been investing in this regulatory infrastructure now for seven years. We started in 2012.\"","\"We're excited to get it and that will definitely be able to allow us to offer a different product and service,\" he added."],"hashtag":[]}