{"summary":"The Bored Ape community has expressed its intention to stay within the Ethereum ecosystem, despite Yuga Labs’ wishes.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/151010\/yuga-labs-wants-apecoin-on-its-own-blockchain-apecoin-owners-think-otherwise","publishDate":"2022-06-09T06:09:36","id":2685,"type":null,"title":"Yuga Labs wants ApeCoin on its own blockchain. ApeCoin owners think otherwise","category":["GAMING AND METAVERSE"],"content":["The Bored Ape community has voted to keep building within the Ethereum ecosystem, rather than move the ApeCoin token its own blockchain as creator Yuga Labs had suggested.","According to a <a href=\"https:\/\/snapshot.org\/#\/apecoin.eth\/proposal\/0x367eecaffc20976a4f913154eceb61279793b06ac0ad93ab948d2d3b207ff860\" data-v-f87c67ca=\"\">snapshot vote<\/a> that ended today, the ApeCoin governance mechanism — known as the ApeCoin DAO — voted 53.6% in favor of staying within the Ethereum ecosystem. The vote was close, with 3.8 million APE voting for the proposal and 3.3 million APE voting against it.","“Migrating to a different chain is a costly, risky, and complex endeavor with many moving parts that may, if not thoughtfully considered, result in catastrophic loss, or at worst, abandonment by Yuga Labs,” said the <a href=\"https:\/\/forum.apecoin.com\/t\/aip-41-keep-apecoin-within-the-ethereum-ecosystem-process\/5664\" data-v-f87c67ca=\"\">proposal<\/a>.","Some large token holders that voted had a big impact. One investor who came out against the proposal did so with 1.2 million APE, representing 17% of the total vote. The top 13 voting holders controlled 56% of tokens in the poll.","The vote came about after Yuga Labs — creator of the popular Bored Ape Yacht Club collection of non-fungible tokens (NFTs) — kicked off discussion over the future of its native token ApeCoin, which is currently running on the Ethereum blockchain. After it sold parcels of land in its yet-to-be-built Otherside metaverse for $317 million in April, it blamed the Ethereum network for not being able to cope with demand.&nbsp;","“It seems abundantly clear that ApeCoin will need to migrate to its own chain in order to properly scale. We'd like to encourage the DAO to start thinking in this direction,” Yuga Labs <a href=\"https:\/\/twitter.com\/yugalabs\/status\/1520612362986078208\" data-v-f87c67ca=\"\">said<\/a> on Twitter at the time.","This led to a flurry of proposals from other blockchain projects that ApeCoin — and even the entire Otherside metaverse — should migrate to their ecosystems.&nbsp;","The first <a href=\"https:\/\/www.theblockcrypto.com\/post\/148591\/avalanche-proposes-to-apecoin-dao-about-creating-an-otherside-subnet\" data-v-f87c67ca=\"\">proposal<\/a> was by Ava Labs, the team behind Avalanche. It said Otherside and ApeCoin should be launched on an Avalanche subnet, a type of blockchain running on the Avalanche network. This would let it use its own token for transaction fees as well as control its level of decentralization and security.","The second <a href=\"https:\/\/www.theblockcrypto.com\/post\/149623\/immutable-proposes-the-otherside-metaverse-should-be-built-on-its-layer-2-network\" data-v-f87c67ca=\"\">proposal<\/a> was by Immutable X, an Ethereum-based platform that’s designed for creating and trading NFTs. It suggested that using its platform would provide for a faster and smoother experience, while remaining in the Ethereum ecosystem.","Neither of these proposals have gone to a vote as of yet. It’s also worth noting that ApeCoin DAO only has direct control over ApeCoin itself, while Yuga Labs remains in control of its other projects like Otherside — alongside partners like Animoca Brands. While the DAO may be able to influence Yuga Labs’ decision-making process, it isn’t able to force its hand.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Yuga Labs","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"56%","content":"PERCENT"},{"type":"$317 million","content":"MONEY"},{"type":"17%","content":"PERCENT"},{"type":"ApeCoin DAO","content":"ORGANIZATION"},{"type":"Ava Labs","content":"PERSON"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"53.6%","content":"PERCENT"},{"type":"DAO","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ETHEREUM","OTHERSIDE","YUGA LABS"],"authors":["Tim Copeland","The Block"]}