{"summary":"South Korean crypto exchange Upbit has suspended deposits and withdrawals for Curve Finance&#x27;s token, CRV.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242124\/upbit-crv-suspension-curve-finance-exploit","publishDate":"2023-07-31T02:36:34","id":2686,"type":null,"title":"Upbit suspends CRV deposits and withdrawals amid Curve Finance exploit","category":["SECURITY"],"content":["South Korean crypto exchange Upbit has suspended deposits and withdrawals for Curve Finance's token, CRV.","\"Today, certain vulnerabilities have been discovered in some of the stablecoin pools associated with Curve (CRV),\" the exchange's <a href=\"https:\/\/sg.upbit.com\/service_center\/notice?id=2745\" data-v-f87c67ca=\"\">announcement<\/a> reads. It added, \"As a result, CRV is currently experiencing significant volatility. We advise exercising caution when considering any investments related to CRV.\"","DeFi platform Curve Finance <a href=\"https:\/\/www.theblock.co\/post\/242066\/curve-finance-factory-pools-targeted-due-to-reentrancy-vulnerability\" data-v-f87c67ca=\"\">faced<\/a> a reentrancy vulnerability — a security flaw that allows for the potential draining of funds from uninterrupted contract calls — yesterday and into today.&nbsp;Significant outflows were linked to interactions exploiting the reentrancy vulnerability in specific Vyper compiler versions.","Additionally, millions of CRV tokens were <a href=\"https:\/\/www.theblock.co\/post\/242098\/millions-of-curve-dao-tokens-stolen-minutes-before-a-white-hat-rescue-mission\" data-v-f87c67ca=\"\">stolen<\/a> minutes before a white hat rescue mission to safeguard the funds.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Curve Finance","content":"ORGANIZATION"},{"type":"CRV","content":"ORGANIZATION"},{"type":"Today","content":"DATE"},{"type":"2023","content":"DATE"}],"hashtag":[],"authors":["Adam James","The Block"]}