{"summary":"The central bank of Brazil is set to roll out an instant, 24\/7 payments system enabled via QR (quick response) codes in November.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/56482\/brazils-central-bank-to-launch-instant-qr-code-enabled-payments-system-this-year","publishDate":"2020-02-20T06:30:58","id":2687,"type":null,"title":"Brazil&#x27;s central bank to launch instant, QR code-enabled payments system this year","category":["TECHNOLOGY"],"content":["The central bank of Brazil is set to roll out an instant, 24\/7 payments system enabled via QR (quick response) codes.","Announcing the news on Wednesday, the central bank <a href=\"https:\/\/www.bcb.gov.br\/en\/pressdetail\/2313\/nota\" data-v-f87c67ca=\"\">said<\/a> the system, named <a href=\"https:\/\/www.bcb.gov.br\/conteudo\/home-ptbr\/TextosApresentacoes\/Apresentacao_PIX.pdf\" data-v-f87c67ca=\"\">PIX<\/a>, will be operational in November this year. It will allow users to send and receive payments instantly via cell phone.","“PIX will make it faster and easier to carry out transactions, which will be performed with a QR Code or by entering simple information such as cell phone number, email or taxpayer identification,” said the central bank.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","Financial and payment institutions licensed by the central bank, having over 500,000 active customer accounts, will have to mandatorily participate in PIX, per the announcement. “These institutions must provide their customers with all the functionalities for initiating and receiving instant payments.”","Notably, PIX is the “centralized” settlement infrastructure and will be operated and managed by the central bank.","PIX is reportedly a response to cryptocurrencies. “If we think about what has happened in terms of the creation of bitcoins, cryptocurrencies and other encrypted assets, it [PIX] comes from the need to have an instrument with such characteristics,” Roberto Campos Neto, president of the Central Bank of Brazil, was <a href=\"https:\/\/livecoins.com.br\/resposta-ao-bitcoin-banco-central-lanca-pix\/\" data-v-f87c67ca=\"\">quoted<\/a> as saying in local crypto news site Livecoins on Wednesday.","The central bank of the U.S., the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/34824\/fed-to-develop-24-7-instant-payment-and-settlement-service\" data-v-f87c67ca=\"\">Federal Reserve<\/a>, is also developing a \"round-the-clock real-time\" payment and settlement service, with a hopeful launch date in 2023 or 2024.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<a href=\"https:\/\/www.theblockcrypto.com\/linked\/48438\/europe-aims-to-set-up-an-instant-payment-system-to-taper-off-us-players-dominance\" data-v-f87c67ca=\"\">The European Commission is also planning<\/a> to build an improved instant payment system by the end of 2021, to taper off U.S. payment giants’ dominance across the continent. Europe already has an instant payment system called TIPS (Target Instant Payment Settlement), but banks have reportedly been slow to join and it has not had a significant impact so far.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Brazil","content":"LOCATION"},{"type":"Roberto Campos Neto","content":"PERSON"},{"type":"European Commission","content":"ORGANIZATION"},{"type":"Central Bank of Brazil","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"PIX","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"November this year","content":"DATE"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}