{"summary":"Some of the major crypto miners put out a monthly report detailing the total number of bitcoin mined and hash rate increase, among other data.\nHere are some highlights from April.","author":["Catarina Moura","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/145625\/bitcoin-mining-production-roundup-april","publishDate":"2022-05-08T08:28:54","id":269,"type":null,"title":"Bitcoin mining production roundup: April","category":["Mining"],"content":["In this new monthly roundup, The Block collected information on the production, growth efforts and other activities of some of the world's publicly traded bitcoin miners.","<span data-v-f87c67ca=\"\">The company produced 268.8 bitcoin in April and grew its hash rate by 8%, from 2.0 EH\/s of bitcoin mining at the beginning of the month to 2.15 EH\/s by the end of the month.<\/span>","<span data-v-f87c67ca=\"\">It also produced 2,537 ETH, with that dedicated hash rate growing from 6.1 to 6.26 terahash per second (TH\/s) during April.<\/span>","<span data-v-f87c67ca=\"\">Hive is keeping in line with its HODL strategy as of May, owning 2,832 BTCand 15,914 ETH.<\/span>","<span data-v-f87c67ca=\"\">Hive said that it “continued its strong momentum in hashing power expansion” and was able to grow its hash rate through “ongoing optimizations and electrical upgrades.”<\/span>","<span data-v-f87c67ca=\"\">In April, Hut 8 produced 309 BTC — 15% of which was derived from Ethereum mining, for which gets paid in bitcoin.<\/span>","<span data-v-f87c67ca=\"\">“As unseasonable weather drove increased power demand from residents and businesses, we reduced our consumption to ensure a steady supply on the grid,” the company said in a statement, adding that it also limited consumption at its Drumheller facility due to an electricity price spike.<\/span>","<span data-v-f87c67ca=\"\">As of April 30, the firm held a total of 6,769 BTC as part of its strategy.<\/span>","<span data-v-f87c67ca=\"\">Hut 8 announced in April that by the end of the month it would <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/142522\/hut-8-reveals-plan-to-become-fully-focused-on-in-house-mining-after-deal-to-buy-asics\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">no longer host miners<\/span><\/a><span data-v-f87c67ca=\"\"> and become a fully self-mining company.<\/span>","In April, Core Scientific mined 1,121 BTC. By the end of the month, the company held around 9,618 BTC and had approximately 85,000 miners in operation for self-mining, representing a hash rate of about 8.9 EH\/s.","Additionally, Core Scientific operated 8.1 EH\/s for hosting customers.","\"We expanded both our self-mining and hosting businesses in the month of April,” Core Scientific said CEO, Mike Levitt","Argo mined 166 BTC in April, generating a revenue of $6.8 million, with a mining margin of 75%.","Last month, Argo also announced the promotion of Justin Nolan to Chief Growth Officer.","<span data-v-f87c67ca=\"\">During April, CleanSpark mined 313 BTC and converted a total of 285 BTC to fund its own growth and operation. As of April 30, it held 448 BTC.<\/span>","<span data-v-f87c67ca=\"\">CleanSpark’s total hash rate is 2.4 EH\/s, backed by a fleet of 24,000 “latest-generation” bitcoin miners.<\/span>","<span data-v-f87c67ca=\"\">The company brought in approximately $11.9 million from the sale of bitcoin in April, most of which was invested into its Norcross facility.<\/span>","<span data-v-f87c67ca=\"\">After surpassing 3 EH\/s in early April, the company reached 3.3 EH\/s by the end of the month, due to the start of operations at Leger, its ninth facility, located in Québec, Canada. This represents a 22% increase from 2.7 EH\/s at the end of March.<\/span>","<span data-v-f87c67ca=\"\">“We continue to be on track to complete the build-out of Leger in May, as well as the second phase of construction at The Bunker in June,” said Bitfarms CEO Emiliano Grodzki.<\/span>","<span data-v-f87c67ca=\"\">In total, Bitfarmed mined 405 BTC last month. As of April 30, it held 5,646 BTC, valued at around $217 million, per the company’s announcement.<\/span>","<span data-v-f87c67ca=\"\">The company also debuted a revamped miner management system that has been in the works for nine months, improving its capacity to manage and track miners.<\/span>","<span data-v-f87c67ca=\"\">Marathon saw a dip of 30% in bitcoin production in April compared to the previous month, due to \"maintenance issues\" that caused their facility in Montana to operate below normal levels.<\/span>","<span data-v-f87c67ca=\"\">Overall, the company said it's still on track to meet its previously announced goal of reaching 23.3 exahash per second (Hh\/s) in early 2023.<\/span>","<span data-v-f87c67ca=\"\">In April, 4,183 miners were installed — representing 0.4 EH\/s — at a facility in Texas run by Marathon's partner Compute North. They were supposed to be powered starting April 17, which would have brought the hash rate up by 11% but that was delayed until May due to a requirement from the energy provider.<\/span>","<span data-v-f87c67ca=\"\">On its Q1 earnings call Wednesday, Marathon also <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/145140\/mining-firm-marathon-reports-net-loss-of-13-million-and-a-big-boost-in-bitcoin-production-for-q1-2022\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">announced a net loss of $13 million<\/span><\/a><span data-v-f87c67ca=\"\">, despite hitting a “record” level of bitcoin production.<\/span>","<span data-v-f87c67ca=\"\">Iris Energy mined a total of 137 BTC in April, a 13% increase over the previous month.<\/span>","<span data-v-f87c67ca=\"\">The Australia-based company increased its average operating hash rate to 1.038 EH\/s. Monthly operating revenue also went up by 6% to $5.4 million.<\/span>","<span data-v-f87c67ca=\"\">It commission 0.3 EH\/s ahead of schedule at its facility in Mackenzie, Canada, with the goal of reaching 1.5 EH\/s (the equivalent of 50 megawatts) in an initial phase.<\/span>","<span data-v-f87c67ca=\"\">The company also broke ground in a new facility in Texas in April.<\/span>","<span data-v-f87c67ca=\"\">In April, Northern Data mined 324 BTC (a 13% month-over-month increase) and 4,583 ETH, a decrease of 9% justified by “​​planned maintenance for inventory.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As of Thursday, the company owned close to 1,390 ETH and 39,800 ETH, with a value of approximately €153 million.<\/span>","<span data-v-f87c67ca=\"\">By the end of April, the company had a fleet of 44,900 miners and a hash rate of 4.07 EH\/s. It plans to reach a total of 100,000 miners, equating to 9.3 EH\/s, by the end of the year.<\/span>","<span data-v-f87c67ca=\"\">GEM Mining produced 244.8 BTC during April, a 3.2% decrease from the previous month.<\/span>","<span data-v-f87c67ca=\"\">However, the company increased its hash rate from 1.85 EH\/s in March to 1.88 EH\/s in April. By the end of the month, it had a total of <\/span><span data-v-f87c67ca=\"\">19,175 miners.<\/span>","<span data-v-f87c67ca=\"\">The company also reported $10.15 million in revenue in April, a decrease of 4.3% compared to March.<\/span>","<span data-v-f87c67ca=\"\">GEM Mining’s CEO, John Warren, said April’s results were the second-best in the company’s history.<\/span>","<span data-v-f87c67ca=\"\">“We will continue to build on this success as we bring our additional 13,000 fully funded and hosted machines online by the end of 2022,” he said.&nbsp;<\/span>","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">This report has been updated with&nbsp;<\/i><span class=\"c-mrkdwn__highlight\" data-v-f87c67ca=\"\"><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">additional<\/i><\/span><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">&nbsp;information.<\/i>"],"hashtag":[]}