{"summary":"CertiK adds $60 million to its coffers amid an increase in crypto hacks.\nStill, a CertiK audit is not an “endorsement that a project is safe” from hacks, co-founder Ronghui Gu said.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/143006\/certik-raises-additional-60-million-from-softbank-and-tiger-global","publishDate":"2022-04-22T09:00:22","id":2691,"type":null,"title":"CertiK raises additional $60 million from SoftBank and Tiger Global","category":["Venture Capital"],"content":["Blockchain security firm CertiK raised an additional $60 million just two weeks after it announced an $88 million Series B3 round at a $2 billion company valuation.&nbsp;","The new round is an extension of the Series B3 round because there was demand from investors, CertiK co-founder Ronghui Gu told The Block. \"Series B3 is oversubscribed. Considering the enthusiasm of investors, we managed to facilitate this extension,\" he said.","SoftBank Vision Fund and CertiK's <a href=\"https:\/\/www.theblockcrypto.com\/post\/141019\/certik-raises-88-million-valuation-2-billion-goldman-sachs-others\" data-v-f87c67ca=\"\">existing investor<\/a> Tiger Global are the only two backers involved in the extension round, Gu said. It was SoftBank's first investment in a blockchain security firm, according to CertiK.","CertiK's valuation has doubled in just three months as an increase in crypto hacks has underlined the need for security.","So far this year, more than $1 billion in crypto has been lost amid major DeFi hacks, including the Ronin Network and Wormhole. Still, attacks have occurred even after projects have been audited by firms like CertiK.","Gu said that an audit by CertiK is not a \"certificate\" or an \"endorsement that a project is safe\" from hacks. It is just a report of vulnerability findings with recommendations.","\"CertiK or any other auditor provides audit scope around a particular contract, meaning the audit relates to a particular contract or version of code of a project,\" Gu said. \"Projects can fork their code, update their code or decline to remediate issues in their code after an audit is complete. This results in a persistent or new risk, which in some cases results in a hack.\"","CertiK plans to continue expanding its offerings and its team with the fresh capital. The current headcount of the firm is about 200 and it has various open positions, including in its engineering and business development functions.","&nbsp;The Series B3 extension round brings CertiK's total funding to date to more than $300 million.","CertiK isn't looking to raise more funds any time soon because it is a \"cash flow positive\" company, Gu said. Still, it could consider investments if a backer was strategically suited for CertiK, he added."],"hashtag":[]}