{"summary":"Binance co-founder and chief customer service officer Yi He has claimed that it is not in “a war” with FTX.\nYi He’s explanation comes after Binance CEO Changpeng Zhao publicly announced that it would be selling its holdings of FTX’s exchange token, FTT.","author":["Adam James","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/183690\/binance-war-ftx-yi-he","publishDate":"2022-11-07T09:23:51","id":2693,"type":null,"title":"Binance is not in &#x27;a war&#x27; with FTX, co-founder Yi He says","category":["Exchanges"],"content":["Yi He, the co-founder and chief customer service officer at crypto exchange Binance, has <a href=\"https:\/\/twitter.com\/heyibinance\/status\/1589614017743814656?s=46&amp;t=Ibsr4ujVOTKMhUY4qlKePg\" data-v-f87c67ca=\"\">claimed<\/a> that the company is not in \"a war\" with rival exchange FTX.","\"Recently, the Portfolio Management team at [Binance] Labs decided to sell FTT based on the risk-control metrics we monitored,\" Yi He tweeted, adding that the public announcement of such decision reflects that Binance Labs \"always respond to what our community asks in a transparent and direct way.\"","\"The point we’d like to stress is that the decision to hold or sell a token depends on one’s own risk appetite and judgement,\" she added. \"Our decision to sell FTT is a pure investment-related exit decision, which has nothing to do with “a war” and we have no intention to engage in drama.\"","The comments come after Binance CEO Changpeng \"CZ\" Zhao&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/183570\/binance-to-sell-ftx-token-holdings-alameda-ceo-says-leaked-balance-sheet-is-incomplete\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">announced<\/a> the exchange would start selling its holdings of FTX's FTT exchange token — which helped <a href=\"https:\/\/www.theblock.co\/post\/183639\/ftx-weekly-stablecoin-outflows-surge-as-binance-piles-on-the-pressure\" data-v-f87c67ca=\"\">spur<\/a> a surge of stablecoin outflows from CEO Sam Bankman-Fried's exchange while stoking widespread speculation about the health of both FTX and it's closely associated principle trading firm Alameda Research.","\"A competitor is trying to go after us with false rumors,\" Bankman-Fried <a href=\"https:\/\/twitter.com\/SBF_FTX\/status\/1589598284322328579\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">tweeted<\/a>. \"FTX is fine. Assets are fine. FTX has enough to cover all client holdings. We don't invest client assets (even in treasuries). We have been processing all withdrawals, and will continue to be.\""],"hashtag":["BINANCE","CZ","FTX"]}