{"summary":"WisdomTree met third-quarter estimates, reporting earnings per share of $0.06.\nThe asset manager’s crypto holdings fell to $178 million from $406 million at the beginning of the year. \nCEO Jono Steinberg said “blockchain-enabled funds and tokenized exposures are tomorrow’s best structure,” to access various asset classes.","author":["Adam Morgan McCarthy","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/180893\/wisdomtree-meets-estimates-reveals-declining-crypto-holdings-in-q3-earnings","publishDate":"2022-10-28T11:00:36","id":2695,"type":null,"title":"WisdomTree meets estimates, reveals declining crypto holdings in Q3 earnings","category":["Markets"],"content":["Asset manager WisdomTree met estimates as it reported $0.06 earnings per share for the third quarter, while revealing that its crypto holdings have fallen to less than $200 million.","WisdomTree's crypto assets under management fell from $265 million to $178 million during the third quarter. The fund's crypto holdings have now fallen 56% since January, from $406 million.","\"Our approach is to bring crypto mainstream,\" Jarret Lillien, the firm's COO and president said, apparently unperturbed by the decline.","The asset manager also plans to bring \"mainstream exposures, like fixed income, equities, and commodities, into the digital world through blockchain-enabled funds and tokenized exposures,\" Lillien said.","\"We’re building the foundation that will allow us to lead in the coming evolution of financial services and lay claim to the deepest exposures in the digital wrapper, positioning us, in an even larger opportunity, to expand into blockchain-enabled finance, where spending, saving and investing are merged.”","The fall in holdings tracks the decline in crypto prices and the global crypto market capitalization, which has fallen from $2.3 trillion in January to $1.02 trillion today.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/crypto-total-marketcap\/embed\" title=\"Crypto Total Marketcap\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>"],"hashtag":["EARNINGS"]}