{"summary":"Stone Ridge Asset Management is set to shutter its bitcoin fund from October, a little under 3 years after filing to launch the fund.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/169233\/multi-billion-dollar-asset-manager-stone-ridge-files-to-liquidate-bitcoin-strategy-fund","publishDate":"2022-09-12T10:59:50","id":2696,"type":null,"title":"Multi-billion dollar asset manager Stone Ridge files to liquidate bitcoin strategy fund","category":["BITCOIN"],"content":["Stone Ridge Asset Management LLC <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1559992\/000119312522242484\/0001193125-22-242484-index.html\" data-v-f87c67ca=\"\">filed<\/a> a liquidation and dissolution plan for its bitcoin strategy fund with the Securities and Exchange Commission (SEC) on Monday.","Per the filing, the liquidation of the fund is expected to take place on or about October 21 and as of the close of business on October 3, shares will not be available to purchase. The asset manager expects to operate the fund in accordance with its stated investment strategy up until this point.","\"The Adviser will reduce the Fund to cash in preparation for the Liquidation Date. Proceeds of the liquidation of the Fund are expected to be distributed to shareholders in cash,\" the filing said.&nbsp;\"The liquidation proceeds are expected to be distributed promptly following the Liquidation Date in full redemption of each shareholder’s shares of the Fund.\"","Asset manager Stone Ridge launched the fund in 2019, <a href=\"https:\/\/www.theblock.co\/linked\/41920\/a-new-bitcoin-futures-fund-has-been-filed-with-sec\" data-v-f87c67ca=\"\">filing<\/a> a prospectus with the SEC for the bitcoin futures fund referred to as the \"NYDIG Bitcoin Strategy Fund\" in October of that year. Stone Ridge received <a href=\"https:\/\/www.theblock.co\/post\/49740\/15-billion-asset-manager-is-the-latest-to-receive-sec-approval-for-its-bitcoin-futures-fund\" data-v-f87c67ca=\"\">approval<\/a> in December 2019.","At the time, the firm said the fund would only buy cash-settled bitcoin futures traded on exchanges registered with the U.S. Commodity Futures Trading Commission (CFTC), and not in physically-settled bitcoin futures. The fund did not plan to invest in bitcoin or other cryptocurrencies directly.","Stone Ridge Asset Management LLC is part of the Stone Ridge Holdings Group, a multi-billion dollar asset management business that also owns the <a href=\"https:\/\/www.theblock.co\/linked\/127450\/nydig-announces-1-billion-funding-round-valuing-company-at-7-billion\" data-v-f87c67ca=\"\">NYDIG<\/a>, a subsidiary focused on digital currency investment valued at over $7 billion last December.&nbsp;","Stone Ridge did not respond to a request for comment at the time of press.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Stone Ridge Asset Management LLC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"October 3","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Stone Ridge","content":"ORGANIZATION"},{"type":"October 21","content":"DATE"},{"type":"U.S. Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"December 2019","content":"DATE"},{"type":"$7 billion","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Stone Ridge Holdings Group","content":"ORGANIZATION"}],"hashtag":["ASSET MANAGERS","BITCOIN"],"authors":["Adam Morgan McCarthy","The Block"]}