{"summary":"Binance and HTC today announced a crypto smartphone that supports Binance Chain\nThe smartphone is a special edition of HTC’s EXODUS 1, which can run a full bitcoin node and has a built-in crypto wallet\nThe new phones will be on sale soon at $599","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/46651\/615-am-est-tuesday-binance-and-htc-to-launch-crypto-smartphones-that-supports-binance-chain","publishDate":"2019-11-12T06:14:18","id":2696,"type":null,"title":"Binance and HTC to launch crypto smartphones that support Binance Chain","category":["Bitcoin"],"content":["Binance and Taiwanese electronics giant HTC announced on Tuesday a crypto smartphone that is \"optimized for operating with Binance,\" according to HTC decentralized chief officer Phil Chen.","The partnership between HTC and the cryptocurrency exchange signals Binance's entrance into the crypto smartphone race, as Binance sees them playing ”a key role in the crypto industry,\" said Binance CEO Changpeng (CZ) Zhao.&nbsp;","\"The implications are profound and far-reaching. The most innovative smartphone makers are racing to adopt crypto. We are delighted to support and work with HTC EXODUS to make sure its users can access the Binance chain and DEX to help people access crypto and exchange anywhere,\" said Zhao.&nbsp;","The new smartphone is a special edition of HTC's EXODUS 1, the firm's latest crypto phone that has a built-in hardware wallet to hold certain cryptocurrencies and the capability to run a complete bitcoin node. According to a statement, the Binance edition of EXODUS 1 will natively support Binance Chain, the exchange's own blockchain, although it cannot operate as a node. Users will also be able to access Binance's decentralized exchange within the hardware wallets on their phones.&nbsp;","The phones will be on sale \"very soon\" at a price of $599, and a limited number of customers will also receive BNB airdrops, per the statement.&nbsp;","The crypto smartphone space is occupied by both smartphone manufacturing titans such as Samsung and crypto-native firms like Huobi. Huobi announced in September a partnership with a blockchain project to issue blockchain smartphones that offer similar features such as hardware wallets as EXODUS 1. Samsung also has a blockchain wallet app and builds its flagship Galaxy series with blockchain support. Meanwhile, China's state-owned telecommunications conglomerate, China Telecom, has also issued a white paper on blockchain smartphones earlier this year.&nbsp;"],"hashtag":["BINANCE","BNB"]}