{"summary":"Blockchain security firm CertiK has raised $24 million in new funding from Tiger Global and GL Ventures.\nCertiK plans to triple its current headcount of 100 and strengthen its security infrastructure, said COO Daryl Hok.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/114769\/blockchain-security-firm-certik-raises-24-million-series-b","publishDate":"2021-08-17T08:00:15","id":2697,"type":null,"title":"Blockchain security firm CertiK raises another $24 million","category":["Venture Capital"],"content":["Just one month after closing its Series B funding round, blockchain security firm CertiK has raised another $24 million in a Series B+ funding round. The new round was co-led by Tiger Global and GL Ventures. There were no other investors in this round, CertiK COO Daryl Hok told The Block.","When asked why CertiK raised funds again so soon, Hok said the firm's growth continues to accelerate month over month, and when the two investors approached it, it decided to raise more funds to strengthen its position in the market.","\"This additional capital will allow us to provide our security benefits to the blockchain space in lockstep with the hyper-growth that the space has been experiencing,\" said Hok.","Tiger Global partner Pengfei Wang said for decentralized finance (DeFi) innovations to be fully trusted, security must be the focal point. \"We're proud to support CertiK in raising the standards of security with the rollout of Skynet Premium. The product pioneers a novel and critical sector of the market: antivirus for blockchain,\" said Wang.","CertiK's Skynet Premium is a smart contracts auditing and monitoring platform that provides real-time alerts against vulnerabilities. The tool produces security scores, which indicate the risk potential for hacks and code malfunctions in a DeFi project.","Skynet's alerts and security scores are publicly available for free, but its paid version provides more detailed information on DeFi projects. CertiK says it has served over 1,300 enterprise clients to date and has detected over 23,000 vulnerabilities in blockchain codes, protecting over $90 billion worth of crypto.","With fresh capital at hand, CertiK plans to further enhance its security infrastructure and expand its global team. Last month, Hok <a href=\"https:\/\/www.theblockcrypto.com\/post\/111240\/blockchain-audit-certik-37-million-series-b-coatue-shunwei\" data-v-f87c67ca=\"\">said<\/a> CertiK will double its current headcount is 100, but now the firm plans to triple its team size. \"We have reevaluated our hiring plan to be more aligned with our growth potential, so we're looking to add even more talent in the upcoming months,\" said Hok.","The Series B+ funding round brings CertiK's total funding to date to $72 million. Hok declined to comment on the firm's valuation but said CertiK, which achieved profitability last year, could raise more funds in the future if an opportunity arises."],"hashtag":["SERIES B","TIGER GLOBAL"]}