{"summary":"Avalanche’s new investors bought into the network through a private token sale.\nThe funds will be used to further boost DeFi activity on the platform, following the launch of a major incentive program in August.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/117895\/polychain-three-arrows-capital-lead-230-million-avalanche","publishDate":"2021-09-16T10:00:38","id":270,"type":null,"title":"Polychain and 3AC lead $230 million investment in Avalanche","category":["Layer 1s"],"content":["Avalanche, the proof-of-stake blockchain promising the industry’s fastest smart contracts, has raised $230 million in a token sale to institutional investors.","Polychain and Three Arrows Capital led the round alongside R\/Crypto Fund, Dragonfly, CMS Holdings, Collab+Currency, Lvna Capital and a group of unnamed angel investors and family offices, according to a press release.&nbsp;","The capital injection will be used to further support efforts to boost decentralized finance (DeFi) activity on the platform, as well as to support new enterprise tools. Part of the funds will be used to facilitate grants, token purchases and other forms of investment for projects seeking to build on Avalanche.","“This will go to fostering the growth of the DeFi ecosystem, NFTs, collectibles, and also some new innovative systems that are coming out on top of this,” said Emin Gün Sirer, director at the Avalanche Foundation. He declined to share more detail on those systems, other than that hinting that they would represent “new asset types.”","Avalanche already rolled out <a href=\"https:\/\/www.theblockcrypto.com\/post\/114782\/avalanche-launches-180-million-defi-incentive-scheme-aave-curve\" data-v-f87c67ca=\"\">a $180 million liquidity mining incentive scheme<\/a> in an effort to lure DeFi developers in August — a move that preceded similar steps by rival blockchains, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/117308\/algorand-sets-up-330-million-fund-thats-focused-on-defi\" data-v-f87c67ca=\"\">such as Algorand<\/a>.","Launched in September 2020, Avalanche currently supports more than 225 projects, including well-known DeFi organizations like Tether, SushiSwap, Chainlink, Circle and The Graph.","Investors in the $230 million round — which Avalanche described as a “private sale of tokens” — purchased AVAX, Avalanche’s native token, instead of equity.","Those tokens give investors the right to participate in governance voting, thereby influencing the development of the platform. They also gain financial exposure to the price of AVAX, which has hit all-time highs in September, <a href=\"https:\/\/coinmarketcap.com\/currencies\/avalanche\/\" data-v-f87c67ca=\"\">according to CoinMarketCap<\/a>.","Gün Sirer said the platform’s new investors “know what to do with their coins in the DeFi ecosystem.”","“Buying tokens especially with a lock up represents a bet on the growth of that ecosystem and mass. And whether or not that bet pans out depends on a lot of actors, but it represents a belief in the growth of the ecosystem overall — whereas equity is a bet on a single entity,” he added. &nbsp;"],"hashtag":["AVALANCHE","THREE ARROWS CAPITAL"]}