{"summary":"The New York Fed is expected to announce a regulated liability network proof-of-concept early next week.\nCiti, Bank of America, BNY Mellon, HSBC, Mastercard and Swift are all participating.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/185783\/new-york-fed-several-big-banks-testing-regulated-liability-network","publishDate":"2022-11-11T16:03:39","id":2701,"type":null,"title":"New York Fed, several big banks testing &#x27;regulated liability network&#x27;","category":["Central Banks"],"content":["The Federal Reserve Bank of New York is poised to unveil a proof-of-concept for “regulated liability networks” — an experiment around tracking and transmitting tokenized debt issued by an array of regulated financial institutions.","Major lenders Citi, Bank of America, BNY Mellon and HSBC, alongside payments specialists Mastercard and Swift, are involved in the test, which will be announced early next week, according to four people familiar with the matter. A white paper expounding the benefits of RLN also will be published, the sources added.","In the race to establish new digital forms of money, RLN represent a potential alternative to unregulated tokens, like bitcoin, but also to the central bank digital currencies that many of the world’s central banks are exploring. The premise is that central bank money, commercial bank money and electronic money — issued by regulated non-bank payment firms — could all exist on the same distributed ledger.","The pending RLN announcement comes on the heels of a recently unveiled <a href=\"https:\/\/www.theblock.co\/post\/183076\/new-york-fed-completes-experiment-using-on-chain-digital-dollar\" data-v-f87c67ca=\"\">digital dollar pilot<\/a> aimed at using interoperable blockchains for near-instant cross-border payments and clearing. And on Nov. 10, the New York Fed <a href=\"https:\/\/www.newyorkfed.org\/newsevents\/news\/financial-services-and-infrastructure\/2022\/20221110\" data-v-f87c67ca=\"\">announced<\/a> a joint experiment with the Monetary Authority of Singapore, the city-state's financial regulator, to test how wholesale CBDCs could streamline cross-border payments involving multiple currencies.","The news comes as chaos reigns supreme in unregulated crypto markets, following the stunning collapse of Sam Bankman-Fried’s exchange FTX.","Tony McLaughlin, an executive at Citi focused on emerging payments and business development, is a leader in the field of RLNs. In <a href=\"https:\/\/www.citibank.com\/tts\/insights\/articles\/article191.html\" data-v-f87c67ca=\"\">a recent blog post<\/a> on Citi’s website, he wrote, “It may be possible for central banks and regulators to create a new direction for the regulated sector through a slight pivot in existing CBDC projects and the nascent tokenization of commercial bank money. They may adopt a broader view of the task at hand — not the tokenization of central bank liabilities, but the tokenization of all regulated liabilities on a common platform.”","McLaughlin, who did not respond to a request for comment from The Block, wrote in the blog post that safe digital money needs to be regulated; redeemable at par value on demand; denominated in national currency units; and “an unambiguous legal claim on the regulated issuer.” He suggested that other regulated assets — such as bonds, equities and trade instruments — could also exist on a RLN.","One person familiar with the New York Fed’s plans, who asked not to be named, said, “RLN is one approach to build upon an existing system rather than risk being replaced wholly by alternative systems.”","A spokesperson for the New York Fed declined to comment, as did a spokesperson for Citi. HSBC, Bank of America, BNY Mellon, Mastercard and Swift did not respond to requests for comment.&nbsp;","&nbsp;","<em data-v-f87c67ca=\"\">With additional reporting from Colin Wilhelm.&nbsp;<\/em>"],"hashtag":["FEDERAL RESERVE"]}