{"summary":"F2Pool has published a review of a sample unit of a new Ethash ASIC miner that shows a performance boost\nThe test reveals the miner is more than three times as powerful as top-of-the-line Ethash equipment available on the market\nBut several key questions still loom for upstart manufacturer Linzhi","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/88622\/questions-new-ethash-asic-ethereum","publishDate":"2020-12-21T11:22:07","id":2702,"type":null,"title":"Questions loom for a new Ethash ASIC miner after F2Pool publishes test results","category":["Ethereum"],"content":["F2Pool has published a test review of a new ASIC miner based on the Ethash algorithm that shows a significant performance boost.","In a WeChat <a href=\"https:\/\/mp.weixin.qq.com\/s\/thavuNxIVssp35h5jQUBHg\" data-v-f87c67ca=\"\">blog post<\/a> and <a href=\"https:\/\/www.youtube.com\/watch?v=_ylsW0wjssI&amp;feature=youtu.be&amp;ab_channel=f2pool\" data-v-f87c67ca=\"\">video<\/a> on Saturday, the crypto mining pool detailed the unboxing and test results of a new Ethash ASIC miner called Phoenix made by the upstart Shenzhen-based manufacturer Linzhi. The hardware is said to be more than three times as powerful as the most top-of-the-line equipment available on the market at this time.","However, key questions loom ahead as to when the firm can make scalable, public preorders available to buyers at a time when Ethereum mining is about to hit a notable benchmark.","F2Pool's review shows that the sample unit of Linzhi's Phoenix, which they received and tested, delivered 2,733 megahashes per second (MH\/s) of computing power with an electricity consumption rate of around 3000 watts per hour.","A10 Pro, another Ethash ASIC miner from Wuhan-based InnoSilicon, considered to be the most efficient equipment on the market, delivers 700 MH\/s in hashing power with an electricity consumption rate of 1300 watts per hour. The price of a December batch of A10 Pro units can cost above 40,000 yuan, or $6,150.","While the test showed a major performance leap, Linzhi – which was founded by Chen Min, a former CTO of Canaan – has yet to lay out crucial details such as the price and a scalable production timeline. On the other hand, the use of decentralized memory inside its ASIC design — while capable of delivering a higher computing efficiency — may also be less cost-effective.","Werner Almesberger, an admin of Linzhi's official Telegram channel, said the firm had recently delivered some sample units for evaluation and added: \"We don't have mass production yet, and our sales logistics are already overloaded with processing the few units we're sending out now.\"","F2Pool said the result of the test unit was higher than Linzhi's advertised 2,600 MH\/s in performance. It remains to be seen if the machines, at a scalable delivery level, can stably maintain such performance results.","Following F2Pool's post, some members inside Linzhi's Telegram group began asking if the sales offer they see from various sources are legitimate. A Linzhi representative responded: \"If we're selling them publicly, that's news to me.\"","F2Pool's review also said the Phoenix ASIC miner has a random-access memory of 4.4 GB, which means, with this specification, the Phoenix model can participate in Ethereum mining for about another year from now. InnoSilicon's A10 Pro, on the other hand, possesses memory capacity up to 6GB.","Apart from the hashing power, the memory size is another critical criteria for a piece of equipment — whether a graphic card or an ASIC chip — can mine on the Ethash algorithm.","Unlike bitcoin mining, which solely relies on a machine's hashing power, the Ethash algorithm also requires a miner to interact with the so-called Directed Acyclic Graph (DAG) files on an Ethash blockchain in order to contribute hash rate.","For instance, the size of the DAG files on Ethereum increases every 30,000 blocks and is now at 3.984 GB. Based on Ethereum mining pool Sparkpool's estimation, the DAG file size is expected to exceed 4GB on December 30, after which equipment with less than 4GB memory won't be able to mine on Ethereum regardless of their computing power.&nbsp;","As Linzhi has yet to reveal a public launch timeline for its Phoenix model, one that has been <a href=\"https:\/\/www.coindesk.com\/powerful-new-ethereum-miner-reaches-final-stage-before-mass-production\" data-v-f87c67ca=\"\">in the works<\/a> for more than two years, it remains to be seen how the firm plans to boost the memory size of the equipment to achieve a longer service period."],"hashtag":["ETHEREUM"]}