{"summary":"NYX Professional Makeup, a beauty brand owned by the L&#x27;Oréal Group, created a DAO for the beauty community earlier this year. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/216038\/for-daos-loreal-nyx","publishDate":"2023-03-02T08:00:40","id":2703,"type":null,"title":"Is the online beauty community ready for DAOs? L’Oréal’s NYX thinks so","category":["PEOPLE"],"content":["NYX Professional Makeup thinks the online beauty community is ready for disruption. The L’Oréal brand’s solution? DAOs.","The subsidiary of the beauty behemoth has been looking at the web3 space for the past two years and believes that consumers are already moving “pretty organically” from online to on-chain.&nbsp;","That belief informed NYX’s decision to launch GORJS earlier this year, a DAO that looks to fund 3D digital art based on the beauty sector. NYX claims that it’s the first such DAO to have this focus.","“The best part of [web3] is that there is a community,” said NYX global president Yann Joffredo in an interview with The Block. “DAOs are actually a community of people that share values that have the same vision or philosophy.”","From Porsche to Paramount to even Donald Trump — brands dipping their toes into web3 technologies is hardly new.","“There were a lot of initiatives and a lot of them were buzzworthy,” Joffredo said about fashion brands launching NFT collections. “How does that carry over time? A lot of brands haven’t thought through the utility of those NFTs so far.”","But creating a DAO, a decentralized structure that gives native token holders the ability to vote on proposals and what projects it chooses to fund, is arguably more of a long-term play than a non-fungible fizzle.","It requires the careful fostering of a passionate online community, navigating a <a href=\"https:\/\/www.theblock.co\/post\/214307\/discord-scam-sees-the-block-come-knocking\" data-v-f87c67ca=\"\">sometimes-chaotic<\/a> Discord channel (the de facto social media platform for DAOs) and the technical know-how to decentralize decision making.","GORJS does have some help in that department — it operates alongside an advisory board that includes The Sandbox’s Sebastien Borget and Ready Player Me CEO Timmu Tõke.","The DAO issued 1,000 NFT passes to fund the DAO’s treasury, which will be used to finance projects created by the first team of artists funded by the project. &nbsp;","Holders of the cheekily named \"FKWME PASS\" are also entitled to governance tokens, which allow them to vote on future projects that GORJS will house. Airdrops and early access to GORJS-participating creators’ NFT projects are also part of the package.","“Let’s make it clear, NYX is not in it for the money, at least for now,” said Joffredo, noting that any revenue earned with the sales of the NFT passes flowed back into the GORJS treasury.","Instead, it taps into the brand’s broader focus on community. Founded in 1999, NYX initially was used by up-and-coming makeup artists unable to afford high-end brands.","It’s since relied upon a combination of <a href=\"https:\/\/www.glossy.co\/beauty\/how-nyx-used-tiktok-to-boost-brand-awareness-by-42\/\" data-v-f87c67ca=\"\">influencer marketing<\/a> and a focus on inclusive marketing to appeal to different diverse communities, with a focus on groups ignored by the traditional beauty industry.","Now, it’s hoping that DAOs are the next step in that. In a first for a L’Oréal-owned company, NYX established an entire department for web3 and the GORJS DAO.","The question is, after the year that crypto had last year, do consumers even want web3?","Joffredo stumbled slightly in his answer but was adamant that consumers, either through gaming or loyalty programs, are likely encountering web3 without knowing it.","There is also some data to back up the idea that NYX’s bet on DAOs isn’t misguided.","Last year, unlike NFT trading volumes or metaverse land price sales, the assets under the management of DAOs <a href=\"https:\/\/www.theblock.pro\/research\/the-state-of-web3-economies-204499\" data-v-f87c67ca=\"\">held<\/a> steady at around $12 billion, with monthly member counts growing threefold to 6 million by November.","That’s even as the industry encountered a myriad of troublesome times with major firms declaring bankruptcies and crypto prices fluctuating amid a turbulent macroeconomic environment.","Joffredo recognizes the firm has a lot to learn. The brand president, who has yet to download crypto’s favorite messaging app, Telegram, admitted that some of the daily goings on in the DAO were “exciting but very time-consuming.”","Likely used to the laser-fast pace of crypto, some members are even questioning the speed at which GORJS is operating, he said.","“We’re learning as we speak,” he said. “To be fair, we’re not a web3-based company but we’re very well supported by the community but also the initial advisory team.”","Aside from contending with the enthusiasm of its members, Joffredo is looking ahead to the unveiling of its first project.","On April 20, it will give an OpenSea debut to its first batch of digital art produced by NFT creators the organization has funded, titled the \"GORJS Genesis Collection.\" Royalties for both primary and secondary sales will be split between the artists and the DAO's treasury, so that it can fund future projects.&nbsp;","While initial artists were handpicked for their web3 prowess, the NYX president seemed most excited at the prospect of bridging the world of real-life beauty creators with NFT artists.","Joffredo said that the next step for the DAO is to provide technology to help NFT creators leverage the expertise of real-life beauty creators to improve their skin textures or the effect of makeup in their 3D digital creations.","Those digital art creators could then onboard those more familiar with concealer than crypto into the world of NFT art.","“We’re really here to support NFT creators and to seed a new generation of creators because that’s what the brand stands for,” he said.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Porsche","content":"ORGANIZATION"},{"type":"Yann Joffredo","content":"PERSON"},{"type":"NYX","content":"ORGANIZATION"},{"type":"Timmu Tõke","content":"PERSON"},{"type":"GORJS DAO","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Joffredo","content":"PERSON"},{"type":"April 20","content":"DATE"},{"type":"1999","content":"DATE"},{"type":"November","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Telegram","content":"LOCATION"},{"type":"Donald Trump","content":"PERSON"},{"type":"$12 billion","content":"MONEY"},{"type":"Sebastien Borget","content":"PERSON"},{"type":"DAO","content":"ORGANIZATION"}],"hashtag":["DAOS"],"authors":["Tom Matsuda","The Block"]}