{"summary":"At least 10 investors in Telegram’s blockchain project are said to be ready to get their funds back\nTelegram has been fighting a legal battle with the Securities and Exchange Commission since October\nEarlier this week, a federal judge in New York issued a preliminary injunction ruling, finding that distribution of gram tokens would violate U.S. securities laws.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/59978\/telegram-token-investors-are-now-ready-to-take-refund-offer-report","publishDate":"2020-03-26T08:15:09","id":2705,"type":null,"title":"Telegram token investors are now ready to take refund offer - report","category":["Projects"],"content":["Some investors in Telegram’s blockchain project, the Telegram Open Network (TON), are reportedly ready to get&nbsp;their money back.","“What I see now among various investors is that many, at least 10 investors with whom I spoke, are inclined to take away 72% of the invested funds,” Yakov Barinsky, head of Russian crypto investment firm Hash CIB, <a href=\"https:\/\/tass.ru\/ekonomika\/8079529\" data-v-f87c67ca=\"\">told<\/a> local news agency TASS, in a report published on Monday.","“Considering what is happening in the financial markets, this offer now looks like much better than in October,” said Barinsky.","In October, TON investors <a href=\"https:\/\/www.theblockcrypto.com\/linked\/44439\/telegram-investors-agree-on-postponement-of-ton-blockchain-launch-not-to-demand-money-back\" data-v-f87c67ca=\"\">were given an option<\/a> to get around 77% of their money back. But at the time, they did not demand refunds and agreed to postpone the launch of TON to April 30, 2020.","From October to April, Pavel Durov, founder of Telegram, reportedly told investors that only 72% of the investment amount would be refunded and the rest 5% was spent in the development process over the months.","Telegram has been fighting a legal battle with the Securities and Exchange Commission (SEC) since October. The SEC sued Telegram for conducting an “illegal” sale of “digital-asset securities called Grams.”","Earlier this week, a federal judge in New York issued a <a href=\"https:\/\/www.theblockcrypto.com\/post\/59831\/court-in-telegram-case-blocks-gram-token-issuance-says-token-distribution-likely-violates-securities-law\" data-v-f87c67ca=\"\">preliminary injunction<\/a> ruling, finding that distribution of gram tokens would violate U.S. securities laws.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nWhile a preliminary injunction is not a final order, it suggests that a court is likely to ultimately enter a permanent injunction as well, as Stephen Palley wrote for The Block at the time. He said Telegram would likely take an appeal of this order to the second circuit, but it may not succeed.","Barinsky told TASS that the team of Durov could now register a transaction, recognizing that gram is a security. \"To conduct an IPO, but in this case, the launch of the project will be postponed for another period, companies usually prepare for this for at least a year,\" he said, adding that it was \"practically impossible\" to do this before April 30, 2020.","\"For this scenario, it will also be necessary to conduct another consultation with investors and again ask for a delay in launching the project,\" Barinsky said.","Another potential option could be the removal of American investors from the project, according to Barinsky, but \"this may be followed by lawsuits from other investors.\""],"hashtag":["SEC","TOKENS"]}