{"summary":"Starbucks fell short of selling out of its latest NFT collection on Polygon, dubbed &quot;The Starbucks First Store Collection.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/227573\/starbucks-nft-first-store-collection-fails","publishDate":"2023-04-21T09:35:36","id":2706,"type":null,"title":"Starbucks fails to sell out NFT collection celebrating original Seattle store","category":["METAVERSE & NFT"],"content":["Starbucks failed to sell out its latest NFT collection, which was modeled on the first coffeehouse it opened in Seattle 52 years ago.&nbsp;","Out of the 5,000 NFTs in the <a href=\"https:\/\/www.niftygateway.com\/collections\/starbucks-odyssey-the-first-store\" data-v-f87c67ca=\"\">Starbucks First Store Collection<\/a> that were on offer for $100 each this week, only 4,579 sold, according to data from Starbucks' NFT marketplace partner Nifty Gateway. The performance is starkly different from the coffee giant's previous <a href=\"https:\/\/www.niftygateway.com\/collections\/starbucks-odyssey-siren-collection\" data-v-f87c67ca=\"\">Siren collection<\/a>, which paid homage to the company's logo and reportedly sold out in under 20 minutes.","It is unclear what particularly led to the disappointing results, but NFT activity has generally declined over the past few months. NFT trading volume across blockchains has dropped lately, <a href=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/nft-overview\/nft-trade-volume-by-chain\" data-v-f87c67ca=\"\">according to The Block's Data Dashboard<\/a>.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/nft-overview\/nft-trade-volume-by-chain\/embed\" title=\"NFT Trade Volume by Chain\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Floor prices — the lowest likely purchase price — of blue-chip NFT collections, have also plunged recently. The <a href=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/art-collectibles\/floor-price-of-art-and-collectibles-nfts\" data-v-f87c67ca=\"\">floor price of Bored Ape Yacht Club (BAYC)<\/a>, for instance, has fallen below 50 ETH for the first time since last November, according to The Block's Data Dashboard. Floor prices of CryptoPunks and Mutant Ape Yacht Club (MAYC) have also declined.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/art-collectibles\/floor-price-of-art-and-collectibles-nfts\/embed\" title=\"Floor Price of Popular NFTs\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The First Store collection was <a href=\"https:\/\/www.theblock.co\/post\/226809\/starbucks-polygon-new-nft-collection\" data-v-f87c67ca=\"\">Starbucks' second paid collection<\/a>. Minted on the Polygon blockchain, it features art that recalls the company's first location, which opened in 1971 in Seattle's Pike Place Market. The collection opened for sale on Wednesday and closed on Thursday. There was a limit of one NFT per person.","Armani Ferrante, co-founder of web3 developer Coral, told The Scoop podcast this week he has <a href=\"https:\/\/www.theblock.co\/post\/227285\/coral-ftx-fallout\" data-v-f87c67ca=\"\">doubts about traditional companies succeeding with NFTs<\/a>.","“It's very unlikely that they'll find something that sticks because they're pattern-matching things that already exist and putting it onto a blockchain rather than like recreating totally new things that have never been done before from scratch,” Ferrante said. “It's not really something that you can just impose on a preexisting institution, it's all about culture, right?”","While the world's largest coffeehouse chain could not sell all 5,000 First Store NFTs, the pieces are doing better in the secondary market. The current floor price of the NFT stands at around $150, <a href=\"https:\/\/odysseymarket.niftygateway.com\/marketplace\/publisher\/starbucks-odyssey?sortBy=recent\" data-v-f87c67ca=\"\">according to Nifty Gateway data<\/a>.","The current floor price of the Siren NFTs is also sharply higher at $450, up from its minting price of $100. Meanwhile, the floor prices of Starbucks' Journey Stamps, which were offered for free as rewards, are also trading higher in the range of $40-$1,300 each.","\"We've been thrilled with the Starbucks Odyssey community's reception to our Siren and First Store collections,\" a spokesperson for Starbucks said. \"As Odyssey continues in beta, we continue to gather feedback from members to shape the future of the experience and build the best and most engaging platform we can.\"","<em data-v-f87c67ca=\"\">Update: story updated to add comment from Starbucks.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Pike Place Market","content":"ORGANIZATION"},{"type":"1971","content":"DATE"},{"type":"$40","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Mutant Ape Yacht Club","content":"ORGANIZATION"},{"type":"First Store","content":"ORGANIZATION"},{"type":"Starbucks First Store Collection","content":"ORGANIZATION"},{"type":"Armani Ferrante","content":"PERSON"},{"type":"$1,300","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"Nifty Gateway","content":"ORGANIZATION"},{"type":"Starbucks Odyssey","content":"ORGANIZATION"},{"type":"Ferrante","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"$450","content":"MONEY"},{"type":"$100","content":"MONEY"},{"type":"Starbucks","content":"ORGANIZATION"},{"type":"Seattle","content":"LOCATION"},{"type":"last November","content":"DATE"},{"type":"$150","content":"MONEY"}],"hashtag":["NIFTY GATEWAY"],"authors":["Yogita Khatri","The Block"]}