{"summary":"Gnosis, a ConsenSys spin-off, has launched a new decentralized exchange (DEX) Gnosis Protocol\nThe new DEX differentiates itself by providing liquidity and best execution to all trading pairs\nPreviously in private beta, the protocol has already processed over $2 million worth of volume","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/61622\/consensys-spin-off-gnosis-launches-decentralized-exchange-with-focus-on-best-price-execution","publishDate":"2020-04-15T10:16:37","id":271,"type":null,"title":"Gnosis launches decentralized exchange; focus on best-price execution","category":["DeFi"],"content":["<span data-v-f87c67ca=\"\">A new decentralized exchange, Gnosis Protocol, launched today, allowing users to trade any token with limited slippage.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The new protocol is the latest initiative from Gnosis, a decentralized finance (DeFi) startup that spun out from <a href=\"https:\/\/www.theblockcrypto.com\/linked\/4665\/consensys-confirms-that-it-is-laying-off-13-of-its-staff\" data-v-f87c67ca=\"\">ConsenSys<\/a> in 2017 after a $12.5 million token sale.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Having already <a href=\"https:\/\/www.duneanalytics.com\/gnosisprotocol\" data-v-f87c67ca=\"\">processed<\/a> over $2 million in trading volume during its private beta, Gnosis Protocol is purposefully designed to enable minimal slippage, even for assets that typically see low trading volumes.<\/span>","<span data-v-f87c67ca=\"\">Specifically, a user first places an order on the exchange for any token pair and defines a limit price according to which the order can be executed. The system will then pack all orders into batches and call for other users, named solvers, to find the most optimal path to settling these batched orders together. Whoever comes up with the best solution pockets 50% of the trading fees that traders pay upfront to have their trades settled.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Each batched auction lasts five minutes, and orders that are not settled in the previous batch are passed to the next one. This means that traders need to wait for at least five minutes for their trades to settle and do not have any guarantee of when the settlement will occur. As such, Gnosis does not plan on winning the market by providing faster settlement experience: rather, it aims to appeal to larger traders and compete with other DEXs on price.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"It's probably only interesting if you trade a larger amounts because the thing we want to compete on is price. If you trade a small amount then. even if we could be slightly better in price, the kind of extra effort of the five-minute delay is probably not worth it,\" Gnosis co-founder and CEO Martin Köppelmann told The Block.<\/span>","<span data-v-f87c67ca=\"\">Because of the batched execution design, Gnosis can also implement so-called ring trades. While traditionally exchanges match one buyer with one seller for a successful trade, in a ring trade, more than two people with more than two assets can be matched together and their trades can be settled simultaneously.&nbsp;<\/span>","","","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Source: Gnosis Protocol<\/em><\/span>","<span data-v-f87c67ca=\"\">This means that no matter how illiquid a trading pair is, solvers on the Gnosis Protocol may be able to find buyers or sellers interested in one of the two assets in the trading pair and match all of their orders together.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Köppelmann believes that Gnosis' batch auction solution provides an \"efficient mechanism\" that can be integrated with other DeFi protocols – especially those that perform liquidation auctions.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"Ideally we would want to be integrated into some protocols that need liquidations…We have these kinds of offerings so that every token can be traded against any other token. And that is something that sometimes could be very useful for a protocol like Compound. Because you have different tokens that you can use as collateral and then different tokens you're lending. So you might trade some tokens against another where usually maybe a direct market would not exist. But because the ring trade, we enable that,\" said <\/span><span data-v-f87c67ca=\"\">Köppelmann.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The user interface of Gnosis is currently managed by dxDAO, a community-owned organization that runs Gnosis' first DEX, DutchX. However, the <\/span><span data-v-f87c67ca=\"\">smart contract part of the new DEX cannot be updated, <\/span><span data-v-f87c67ca=\"\">according to <\/span><span data-v-f87c67ca=\"\">Köppelmann.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"The upcoming Gnosis Protocol is fully decentralized. There no admin key or overwrite whatsoever. We don't have it, and dxDAO doesn't have it,\" said Köppelmann.<\/span>"],"hashtag":[]}