{"summary":"Bitcoin mining difficulty fell by 2.14%. The network&#x27;s hash rate went down by about 2.04%.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173475\/bitcoin-mining-difficulty-falls-2-14-after-four-consecutive-increases","publishDate":"2022-09-28T12:53:15","id":2711,"type":null,"title":"Bitcoin mining difficulty falls 2.14% after four consecutive increases","category":["BITCOIN"],"content":["Bitcoin mining difficulty fell by 2.14% on Tuesday following four consecutive jumps — one of them <a href=\"https:\/\/www.theblock.co\/post\/166757\/bitcoin-mining-difficulty-jumps-9-26-in-the-largest-increase-since-january\" data-v-f87c67ca=\"\">as high as 9.26%<\/a> in August.","The change is reflected in data published by BTC.com, which tracks network mining difficulty and posts an update as adjustments take place roughly every two weeks.","The network's hash rate has also fallen 2.04% since Sept. 13, the date of the last update, according to data compiled by The Block Research.","\"Decreasing mining economics are leading to high-cost and low-efficiency miners shutting off,\" Ethan Vera, COO of bitcoin infrastructure company Luxor Technologies, told The Block. \"Hashrate will likely only grow as a function of increasing machine efficiency for the remainder of the year. As Bitmain S19 XPs get delivered to mining farms they will replace lower-efficiency machines, increasing network hashrate.\"","Parallel to this, as some miners liquidate hardware amid the bear market, those machines are coming offline and being sent to new locations, according to Vera. \"This is a temporary disruption of network hashrate, as these machines find a new home.\"","One bitcoin miner that has made headlines for <a href=\"https:\/\/www.theblock.co\/post\/168193\/bitcoin-miner-cleanspark-bought-10000-asics-at-a-significantly-discounted-price\" data-v-f87c67ca=\"\">acquiring machines<\/a> and facilities from other operators in the past few months is CleanSpark. Earlier this month, CleanSpark <a href=\"https:\/\/www.theblock.co\/post\/168711\/bitcoin-miner-cleanspark-announces-second-acquisition-in-a-month\" data-v-f87c67ca=\"\">bought its second facility in Georgia<\/a> from a competitor in the span of 30 days, agreeing to provide that company with up to 30 megawatts of temporary hosting while it transfers miners to another location.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoins-hash-rate-daily\/embed\" title=\"Bitcoin's Hash Rate (EH\/s, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Mining difficulty refers to the complexity of the process behind mining, during which miners are repeatedly trying to find a hash below a set level. Miners that \"discover\" this hash win the reward for the next transaction block. The difficulty adjusts every 2,016 blocks or roughly every two weeks.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2.04%","content":"PERCENT"},{"type":"2.14%","content":"PERCENT"},{"type":"Luxor Technologies","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Ethan Vera","content":"PERSON"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Sept. 13","content":"DATE"},{"type":"9.26%","content":"PERCENT"},{"type":"Georgia","content":"LOCATION"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}