{"summary":"Sens. Kirsten Gillibrand, D-N.Y., and Cynthia Lummis, R-Wyo., say parts of their signature crypto regulation bill could pass in the next six months.\nA piece of the bill that would give the Commodities Futures Trading Commission control over digital asset commodities like bitcoin could be the first component of the bill to move, they said.","author":["Stephanie Murray","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/177371\/pieces-of-crypto-bill-could-pass-in-six-months-authors-lummis-and-gillibrand-say","publishDate":"2022-10-14T18:32:03","id":2718,"type":null,"title":"Pieces of crypto bill could pass in six months, authors Lummis and Gillibrand say","category":["Policy"],"content":["Components of a sweeping crypto regulation bill authored by Sens. Kirsten Gillibrand and Cynthia Lummis could land on President Joe Biden’s desk for a signature in the next six months, the senators said on Friday.","“I think six months from now we actually will see at least part of it on the president’s desk,” Lummis said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Lummis and Gillibrand released their highly anticipated digital assets legislation in June. The bill is bipartisan — Lummis is a Republican from Wyoming and Gillibrand is a New York Democrat.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","A section of the bill that would give the Commodities Futures Trading Commission authority over digital assets that are considered commodities is “ready” to move forward, Gillibrand said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Lummis agreed with Gillibrand’s assessment and said a portion of the bill that deals with stablecoins would be likely to “go next” in Congress. The pair spoke in a pre-recorded session that aired at a financial conference hosted by Georgetown University's McDonough School of Business in Washington, D.C.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The timeline for the digital assets bill is ambitious. Lawmakers are busy campaigning in their districts ahead of the November midterm elections. Just a few weeks later, a new Congress will begin in January. And another bipartisan bill to give the CFTC broader power over digital commodities, drafted by Senate Agriculture Chair Debbie Stabenow, D-Mich., and the top Republican on the committee, Sen. John Boozman, R-Ark., could see a <a href=\"https:\/\/www.google.com\/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=2ahUKEwj7oYXA4eD6AhV5jokEHUb_DusQFnoECAcQAQ&amp;url=https%3A%2F%2Fwww.theblock.co%2Fpost%2F170481%2Fbill-broadening-cftcs-crypto-power-could-get-vote-soon-author-says&amp;usg=AOvVaw39eZtIn4I_J_hTT91f_auu\" data-v-f87c67ca=\"\">committee vote<\/a> in what remains of this Congress.&nbsp;","Gillibrand added that she expects a regulatory framework for digital assets would pass the Senate with broad bipartisan support.","“Sixty, seventy percent will ultimately support regulatory framework. I don’t think there’s a great deal of opposition,” Gillibrand said. “It's not ideological, it's just an unregulated industry that is growing in our country.”"],"hashtag":["CFTC"]}