{"summary":"The European Commission announced that the European Union’s member states must prepare to halt crypto mining “in case there is a need for load shedding in","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/177966\/eu-commission-warns-crypto-mining-may-be-halted-in-energy-emergency","publishDate":"2022-10-18T11:30:58","id":2718,"type":null,"title":"EU Commission warns crypto mining may be halted in energy emergency","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">The European Commission announced that the European Union’s member states must prepare to halt crypto mining “in case there is a need for load shedding in the electricity systems”, according to an <a href=\"https:\/\/ec.europa.eu\/commission\/presscorner\/detail\/en\/ip_22_6228\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">action plan on digitalizing the EU's energy system<\/a> released on Tuesday.<\/span>","<span data-v-f87c67ca=\"\">With the war in Ukraine adding stress to energy supplies in Europe, the commission wants countries to prepare to lower the electricity consumption of crypto miners, with the possibility that mining operations could be ordered to completely halt in areas where electrical grids are forced to load shed.&nbsp;<\/span>","In the longer term, the commission also wants EU members to look into ending current tax breaks and subsidies for proof-of-work miners.&nbsp;","<span data-v-f87c67ca=\"\">The European Commission also announced its proposal to introduce a rating system for cryptocurrencies according to environmental impact within the European Union. The taxonomy system is part of the EU’s green deal; an effort by policy leaders to meet high-bar climate goals. In the plan issued today,<\/span><span data-v-f87c67ca=\"\">&nbsp;EU leaders pointed to The Merge of Ethereum moving from proof-of-work to proof-of-stake as an example of the changes it hopes to see in blockchain ecosystem energy consumption. <\/span><span data-v-f87c67ca=\"\">The commission says will collaborate internationally with different standardization bodies to develop the energy-efficiency label. <\/span>","<span data-v-f87c67ca=\"\">If approved, the scheme is set to roll out in 2025.<\/span>","<span data-v-f87c67ca=\"\">The rating scheme came together as a compromise on proof-of-work consensus mechanism between policymakers during debate over the Markets in Crypto-Assets legislation in March.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2025","content":"DATE"},{"type":"March","content":"DATE"},{"type":"European Union","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"European Commission","content":"ORGANIZATION"},{"type":"Crypto","content":"LOCATION"},{"type":"Ukraine","content":"LOCATION"},{"type":"Europe","content":"LOCATION"}],"hashtag":[],"authors":["Inbar Preiss","The Block"]}