{"summary":"Voyager will begin processing cash withdrawals on August 11 after winning Court approval to release the cash from its MCB account.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/161784\/voyager-to-begin-processing-cash-withdrawals-next-week","publishDate":"2022-08-05T13:48:26","id":2719,"type":null,"title":"Voyager to begin processing cash withdrawals next week","category":["LEGAL"],"content":["Voyager will begin processing cash withdrawals next week, according to a new announcement from the lender.","Voyager's account was frozen as part of its Chapter 11 bankruptcy proceedings, but yesterday a judge <a href=\"https:\/\/www.theblock.co\/post\/161661\/voyager-approved-to-return-270-million-in-cash-deposits-to-customers\" data-v-f87c67ca=\"\">approved<\/a>&nbsp; the firm's proposal to restore access.&nbsp;","Voyager has been <a href=\"https:\/\/www.theblock.co\/post\/157946\/voyager-asks-bankruptcy-court-to-honor-withdrawals\" data-v-f87c67ca=\"\">advocating<\/a> to honor cash withdrawals from its Metropolitan Commercial Bank (MCB) account as part of its Chapter 11 bankruptcy proceedings, which began soon after it <a href=\"https:\/\/www.theblock.co\/post\/155528\/voyager-digital-suspends-withdrawals-deposits-and-trading\" data-v-f87c67ca=\"\">halted<\/a> all withdrawals. MCB held $270 million in custody for Voyager customers.&nbsp;","Voyager <a href=\"https:\/\/www.investvoyager.com\/blog\/update-on-cash-access-and-reorganization\/\" data-v-f87c67ca=\"\">announced<\/a> today it will begin honoring cash withdrawals only on Thursday, August 11. Those with cash in their accounts will be able to withdraw up to $100,000 each 24 hours and should receive the funds within 5-10 days of their request, according to Voyager. Directions will be sent to those with cash balances.&nbsp;","\"Requests will be processed as quickly as possible but will require some manual review, including fraud reviews and account reconciliation, and timing will depend, in part, upon the individual banks to which customers transfer their cash,\" said Voyager in a statement.","Voyager last month <a href=\"https:\/\/www.theblock.co\/post\/155990\/crypto-broker-voyager-digital-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">entered<\/a> Chapter 11 bankruptcy protection, which allows insolvent firms to continue operations as they reorganize to pay creditors. The ability to honor cash withdrawals is a step forward, though more than $1 billion in crypto remains on the platform and in limbo. The federal bankruptcy court has approved a set of bidding procedures, which will lay out how other firms may place bids on the assets for the purpose of reorganization.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$100,000","content":"MONEY"},{"type":"10 days","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$270 million","content":"MONEY"},{"type":"August 11","content":"DATE"},{"type":"MCB","content":"ORGANIZATION"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}