{"summary":"Slingshot Finance has raised $15 million in a Series A funding round.\nThe project plans to expand its team, launch mobile applications and support more blockchains.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/127009\/defi-trading-platform-slingshot-raises-15-million-in-series-a-led-by-ribbit-capital","publishDate":"2021-12-09T11:15:01","id":2719,"type":null,"title":"DeFi trading platform Slingshot raises $15 million in Series A funding","category":["Venture Capital"],"content":["The team behind Slingshot Finance (formerly DEX.AG), a decentralized trading platform, has raised $15 million in a Series A funding round.","Ribbit Capital led the round, with K5 Global, Shrug Capital, The Chainsmokers, Jason Derulo (American singer), Guillaume Pousaz (Checkout.com founder), and Austin Rief (Morning Brew CEO) also participating.","Existing investors Framework Ventures and Electric Capital also joined the Series A round.","With fresh capital at hand, the Slingshot Finance team plans to at least double its current headcount of 18, launch mobile applications of its platform, and support more blockchains, CEO Clinton Bembry told The Block.","Slingshot currently supports Polygon and Arbitrum for token swaps. Bembry said next up is Optimism, but the platform will also explore Layer 1 blockchains, including Solana, Avalanche, and Binance Smart Chain.","As for mobile applications, Bembry said the launch should happen in the first half of next year. Slingshot currently has a web-based trading interface.","The platform was launched in May and claims to have seen more than 100,000 traders visit the platform, with a total trading volume exceeding $1 billion to date.","Besides a trading platform, Slingshot will also offer an <a href=\"https:\/\/twitter.com\/SlingshotCrypto\/status\/1465377158595956743\" data-v-f87c67ca=\"\">NFT marketplace<\/a> called Slingshot 2099 starting next month, said Bembry.","The Series A round was an equity round, Bembry said, adding that there were no new board seats offered during this round.","The round brings Slingshot's total funding to date to $18.1 million. Last year, the project raised $3.1 million in a seed funding round. Slingshot could raise more funds in the future, said Bembry."],"hashtag":[]}