{"summary":"Take-Two, through its mobile gaming subsidiary Zynga, has developed its first blockchain-based game “Sugartown” and the title’s NFTs have generated more than $5 million in trading volume, according to OpenSea data.","author":["RT Watson","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/254575\/grand-theft-auto-devs-first-crypto-game-sees-5-million-in-nft-trading","publishDate":"2023-10-03T15:57:26","id":272,"type":null,"title":"&#x27;Grand Theft Auto&#x27; dev&#x27;s first crypto game sees $5 million in NFT trading","category":["Gaming"],"content":["Billing it as the first instance of a major mobile game developer building a crypto game from the ground up, Take-Two subsidiary Zynga announced its new Ethereum-based title \"Sugartown\" in August.&nbsp;","In roughly three weeks, thousands of the game's access tokens, called Oras, have generated more than 3,000 ether (about $5 million) in trading volume, according to <a href=\"https:\/\/opensea.io\/collection\/sugartownoras?search[sortAscending]=true&amp;search[sortBy]=UNIT_PRICE&amp;search[toggles][0]=BUY_NOW\" data-v-f87c67ca=\"\">OpenSea data<\/a>. That yield comes as the NFT market continues to face a steep decline in volume and active traders.","The floor price for Oras is currently sitting at about $430, also according to OpenSea.","Take-Two, developer of the well-known \"Grand Theft Auto\" franchise, acquired Zynga last year. Zynga is the publisher of the wildly popular FarmVille game. In August, the two companies <a href=\"https:\/\/www.theblock.co\/post\/244783\/grand-theft-auto-dev-take-twos-first-crypto-game-launching-on-ethereum\" data-v-f87c67ca=\"\">announced<\/a> \"Sugartown\" as their first foray into web3 gaming.&nbsp;","While at the time the companies said they would drop 10,000 tokens as part of their initial offering, only 6,000 NFTs were released last month, according to OpenSea data. The NFTs dropped on Sept. 13 according to a post on X.","Players will use Oras, an Ethereum (or ERC-721) token, to access “Sugartown” and “earn energy,” which allows gamers to earn “an in-game currency,\" the companies said at the time."],"hashtag":[]}