{"summary":"Pudgy Penguins CEO Luca Netz said a story from last November saying his collection was raising up to $10 million was “all wrong information.”\nNew capital to be used to help monetize brand’s IP including merchandising.","author":["RT Watson","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229943\/pudgy-penguins-secures-9-million","publishDate":"2023-05-09T10:38:11","id":2720,"type":null,"title":"Pudgy Penguins secures $9 million months after CEO denied raising funds","category":["Metaverse &amp; NFT"],"content":["<span data-v-f87c67ca=\"\">Roughly six months after Pudgy Penguins CEO denied the NFT collection was seeking to raise <\/span><span data-v-f87c67ca=\"\">up to $10 million, it has announced securing <\/span><span data-v-f87c67ca=\"\">$9 million in the completion of its seed round.<\/span>","<span data-v-f87c67ca=\"\">The round was led by 1kx, “an early-stage investment firm that specializes in ecosystem growth,” the collection said in a statement.&nbsp; Big Brain Holdings, Kronos Research, the founders of LayerZero Labs, Old Fashion Research, and CRIT Ventures also participated, according to the statement.<\/span>","<a href=\"https:\/\/www.theblock.co\/post\/182494\/pudgy-penguins-seeks-10-million-seed-round\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Last November<\/span><\/a><span data-v-f87c67ca=\"\">, <\/span><span data-v-f87c67ca=\"\">Pudgy Penguins CEO Luca Netz said The Block’s story that his collection sought to raise up to $10 million was “all wrong information,” and warned he would publicly brand any story on the subject “fake news.”<\/span>","<span data-v-f87c67ca=\"\">The collection launched in 2021 and Netz acquired it the next year. Last week, it <a href=\"https:\/\/twitter.com\/pudgypenguins\/status\/1654569304145240065\" data-v-f87c67ca=\"\">said Hollywood talent agency WME<\/a> will represent the collection as it pursues \"relationships in film, TV, and gaming.\"<\/span>","<span data-v-f87c67ca=\"\">In its funding statement, Pudgy Penguins said it would use the fresh capital to help monetize its brand's intellectual property through, in part, merchandising.<\/span>"],"hashtag":[]}