{"summary":"The team behind Bloqboard and LoanScan is launching Linen, a banking services app with decentralized finance integrations\nLinen hopes to make it easier for non-crypto native people to get exposure to cryptocurrency\nThe company also recently closed a funding round, adding Wyre and Hashkey to a list of investors that includes Polychain and Coinbase","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/40378\/team-behind-loanscan-and-bloqboard-launches-banking-service-app-with-a-defi-back-end","publishDate":"2019-09-20T17:05:11","id":2723,"type":null,"title":"Team behind LoanScan and Bloqboard launches banking service app with a DeFi back-end","category":["DeFi"],"content":["<span data-v-f87c67ca=\"\">The team behind Bloqboard, a cryptocurrency lending bulletin board, and LoanScan, a cryptocurrency data provider, is launching a new app called Linen to draw in non-crypto native users. Linen is aimed at lowering the barriers for crypto exposure<strong data-v-f87c67ca=\"\">&nbsp;<\/strong>by cutting out the need for multiple dApps in the lending process.<\/span>","<span data-v-f87c67ca=\"\">Vitaly Bahachuk launched <\/span><span data-v-f87c67ca=\"\">Bloqboard early on in the Ethereum space. As a whole, however, people weren’t entirely sure what to do with its initial product, leading his team to focus on a particular subset of the product, a bulletin board which gives users direct access to the services provided by lending protocol built on Ethereum, such as MakerDAO and Compound. Now, Bahachuk and his team are widening that subset with Linen, abstracting some of the trickier parts of decentralized finance (DeFi) and presenting customers with a more user-friendly interface.<\/span>","<span data-v-f87c67ca=\"\">Linen will focus on functionality. It’s a fintech app that enables traditional banking procedures like direct deposit, savings, debit card capabilities, and money transfer, with the added benefit of earning variable interest through Ethereum-based lending protocols like Compound, which, at the time of this writing, offers a <a href=\"https:\/\/compound.finance\/markets\" data-v-f87c67ca=\"\">5.68% APR<\/a> to USDC lenders. <\/span><span data-v-f87c67ca=\"\">In this way, Linen purports to marry traditional finance with DeFi capabilities for non-crypto native users, marketing towards those who have perhaps utilized high-yield savings accounts in the traditional finance world.<\/span>","\"To our members, the experience will be no any different than transferring money from their BoA account to Wealthfront or Betterment,\" Bahachuk tells The Block.","<span data-v-f87c67ca=\"\">Overall, Bahachuk said the crypto native community is well-served. It’s about introducing a wider audience to DeFi. However, this poses the problem of balancing transparency with accessibility. To meet its ethos, Linen needs to help users understand what they’re investing in, why it has such a high interest rate compared to traditional markets and what the risks are, all without scaring them off. To that end, Bahachuk said transparency comes first.<\/span>","<span data-v-f87c67ca=\"\">“We tell our user exactly what is actually happening,” he said. “So we actually disclose that these are margin loans backed by cryptocurrency investments and nothing’s insured. We’re very transparent about it.”<\/span>","<span data-v-f87c67ca=\"\">The way users will get comfortable, according to Bahachuk, is by actually using it. The high-interest account isn’t meant for large investments, and there are even caps on how much a user can invest to minimize overall risk. Additionally, they’re targeting those with some knowledge of financial mechanisms, someone who understands margin lending or day trading and presenting them with the opportunity to dip their toes in the crypto world.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Ultimately, it’s about putting the benefits of the traditional financial system and the so-called “parallel” DeFi system in the same pocket, according to Balachuk. The size of yields is less important than what they represent – an opportunity for uncorrelated yields, which have grown more attractive in recent months as the U.S. Federal Reserve slashes interest rates.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Still, Linen won’t serve everyone. The app won’t be available to New Yorkers since its transfer agent, Wyre, doesn’t have a BitLicense, the gold standard for money transfer compliance in the state. Wherever Wyre isn’t welcome, Linen won’t be either.<\/span>","<span data-v-f87c67ca=\"\">Linen has also recently closed a fundraising round for an undisclosed amount, garnering partners to further the company’s latest efforts, adding Wyre to its investor list alongside Coinbase, Polychain, and Hashkey, a digital asset investment group. Hashkey's investment, according to Bahachuk, was strategic.<\/span>","<span data-v-f87c67ca=\"\">“We would like to keep our door open to Asia, and Hashkey is one of the lead investors in that part of the world,” said Bahachuk.<\/span>","At launch, Linen will support USDC, with planned support for Dai."],"hashtag":["DAI","USDC"]}