{"summary":"Ribbit Capital, which is an investor in companies like Coinbase and Robinhood, has filed a $350 million IPO for its special purpose acquisition company (SPAC).\nThe SPAC, Ribbit LEAP, plans to list on the New York Stock Exchange.\nJPMorgan Chase is the sole bookrunner for the IPO.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/76064\/ribbit-capital-files-350-million-ipo-spac","publishDate":"2020-08-26T03:35:10","id":2726,"type":null,"title":"Crypto-friendly Ribbit Capital files $350 million IPO for its SPAC","category":["Capital Markets"],"content":["Venture capital firm Ribbit Capital, which is an investor in companies like Coinbase, Chainalysis and Robinhood, has filed a $350 million IPO for its special purpose acquisition company (SPAC).","The SPAC, Ribbit LEAP, is a newly formed \"blank check\" company to merge with or acquire an existing company, according to a <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1818346\/000104746920004705\/a2242311zs-1.htm\" data-v-f87c67ca=\"\">prospectus filed<\/a> with the U.S. Securities and Exchange Commission on Tuesday. Ribbit LEAP said it is yet to select a business combination partner.","SPACs, also known as blank check companies, raise money via IPOs to acquire companies and take them public, usually within a two-year period. SPAC offerings have been trendy in recent years, having raised more than $32 billion so far this year, compared to $13.6 billion last year, according to <a href=\"https:\/\/www.spacresearch.com\/?gclid=EAIaIQobChMIrufBgqKy6wIVmo3ICh09cArwEAAYAiAAEgL05_D_BwE\" data-v-f87c67ca=\"\">SPAC Research<\/a>.","It is not clear whether Ribbit LEAP will acquire crypto firms, but it is targeting a company \"focused on the intersection of financial services and technology,\" or fintech. The IPO filing comes at a time when crypto giants Coinbase and BlockFi are planning to go public.","Ribbit LEAP would offer 35 million units for $10 apiece in the IPO to raise $350 million. Each unit consists of one share and one-fifth of a warrant, exercisable at $11.50.","JPMorgan Chase is the sole bookrunner for the IPO, having the option to issue 15% more shares to bring the total targeted capital at $402.5 million. Ribbit LEAP said it plans to list its shares on the New York Stock Exchange (NYSE), and is yet to select a ticker symbol.","Ribbit is a fintech-focused venture capital firm. It counts notable firms in its portfolio, including Brex, CreditKarma, CRB Group (Cross River Bank), Figure Technologies, Revolut and Upgrade, among others. Founded in 2012 by Meyer \"Micky\" Malka, Ribbit Capital has built a portfolio of more than 75 private and public companies.","Ribbit Capital is also a founding member of the Libra Association. Earlier this year, Sigal Mandelkar, a former U.S. Undersecretary of the Treasury, joined Ribbit Capital as an advisor.&nbsp;&nbsp;"],"hashtag":["IPOS","SPACS"]}