{"summary":"The Budverse x FIFAWorldCup Live Scoreboard NFT Collection allows buyers to mint a scoreboard that will track the progress of their chosen country throughout the competition.\nHolders will also be able to claim other swag and prizes.\nThe FIFA World Cup kicks off on Nov. 20. ","author":["Callan Quinn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/177197\/budweiser-turns-scoreboards-into-nfts-for-fifa-world-cup","publishDate":"2022-10-14T06:46:07","id":273,"type":null,"title":"Budweiser turns scoreboards into NFTs for FIFA World Cup","category":["NFTs"],"content":["Beer giant Budweiser’s latest NFT collection will feature live scoreboards for the upcoming FIFA World Cup in Qatar.","Minting 10 a.m. ET today, the Budverse x FIFAWorldCup Live Scoreboard NFT Collection allows buyers to select the country they wish to follow and mint a scoreboard that will track its progress throughout the competition.","Minters can also claim a World Cup starter kit, access a holders-only Discord and mini-game, as well as win a trip to the FIFA world cup finals in Doha.","The company has ramped up its web3 offerings over the past year. Budweiser has 12 other NFT collections listed on OpenSea, 11 belonging to its Royalty series of collaborations with up-and-coming musicians, as well as its first collection, Budverse Cans Heritage Edition.&nbsp;","The company launched the latter as its first NFT collection last November. With a current floor price of 0.34 ETH, this latest mint is providing some extra utility for holders of the collection: They will be able to claim a free scoreboard NFT.&nbsp;","Budweiser isn't the only beverage that has gotten into NFTs. <a href=\"https:\/\/www.theblock.co\/linked\/127033\/pepsi-is-going-to-launch-a-generative-nft-collection-next-week\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Pepsi<\/a> released its Mic Drop NFTs in December. Bud Light, which like Budweiser is owned by Anheuser-Busch, <a href=\"https:\/\/www.theblock.co\/post\/131863\/beer-giant-anheuser-busch-launches-nft-project-for-bud-light\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">launched<\/a> its first collection in January.","The FIFA World Cup kicks off in Qatar's capital Doha on Nov. 20."],"hashtag":[]}