{"summary":"A summary of the week’s top crypto news in Asia by Global Coin Research","author":["Contributor Network","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/34990\/global-coin-research-trade-war-fears-ignite-china-accelerates-cbdc-efforts","publishDate":"2019-08-06T18:34:16","id":2732,"type":null,"title":"Global Coin Research: Trade war fears ignite, China accelerates CBDC efforts","category":["Asia"],"content":["<em class=\"ga\" data-v-f87c67ca=\"\">The following weekly newsletter is republished with permission from Global Coin Research, a global research firm with a focus on Asia blockchain and related technologies. You can find more resources on Asia Cryptocurrency and Blockchain at GlobalCoinResearch.com and on Twitter at @globalcoinrsrch<\/em>","<strong class=\"fi gf\" data-v-f87c67ca=\"\"><em class=\"fu\" data-v-f87c67ca=\"\">Global Coin Research Newsletters&nbsp;<\/em><\/strong><a class=\"bc cg gg gh gi gj\" href=\"https:\/\/globalcoinresearch.com\/2019\/07\/17\/global-coin-research-is-now-available-in-chinese\/?source=post_page---------------------------\" data-v-f87c67ca=\"\"><strong class=\"fi gf\" data-v-f87c67ca=\"\"><em class=\"fu\" data-v-f87c67ca=\"\">in Chinese<\/em><\/strong><\/a>","The Chinese renminbi depreciated to as much as Rmb7 per dollar on Monday—its lowest level since the 2008 global financial crisis—in what is widely believed to be a state-sanctioned response to Trumpian tariff threats.","And following Trump’s announcement last week that the U.S. would put a new 10% tariff on $300 billion worth of imports from China, Beijing confirmed it would suspend U.S. agricultural product purchases.","<a class=\"bn cx hc hd he hf\" href=\"http:\/\/www.pbc.gov.cn\/goutongjiaoliu\/113456\/113469\/3869683\/index.html\" data-v-f87c67ca=\"\">In a statement<\/a>, the China Central Bank (PBoC) explained the currency movement, blaming trade protectionism and tariffs on Chinese goods for the currency’s weakening, without specifically mentioning the U.S., but adding that it “has the experience, confidence and capacity to keep the renminbi exchange rate fundamentally stable at a reasonable and balanced level.” It also assured its citizens that “the stability of the RMB is relatively strong, China is expected to become a hub designated for global capital.”","Markets around the world dropped immediately on Monday upon the announcement. In crypto, we are seeing ongoing arbitrage opportunities in China and Korea at the moment. On the ground, from Chinese social media and within the GCR network, many have touted Bitcoin as the go-to hedge in response to the currency wars. However this conflict evolves, it’s not something we’d like to see, but China’s decision will certainly bring attention to Bitcoin around the world, and we expect Chinese citizens to accelerate their crypto adoption."],"hashtag":[]}