{"summary":"BlockFi seeks to reopen withdrawals for users who have crypto locked in wallet accounts as well as to update its UI to accurately reflect transactions and assets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/196489\/blockfi-seeks-reopen-withdrawals","publishDate":"2022-12-20T06:08:36","id":2732,"type":null,"title":"BlockFi seeks to reopen withdrawals for certain users","category":["COMPANIES"],"content":["Bankrupt crypto lender BlockFi is seeking to reopen withdrawals for users who have crypto locked in wallet accounts.","The lender filed a motion on Dec. 19 with the U.S. Bankruptcy Court in the District of New Jersey. The motion seeks to authorize the debtors to honor withdrawals from wallet accounts, update the user interface to reflect transactions and conduct ordinary course reconciliation of accounts.","\"The BlockFi Wallet Terms of Service are clear,\" said BlockFi in the filing. \"They provide that 'title to the cryptocurrency held in your BlockFi Wallet shall at all times remain with you and shall not transfer to BlockFi.' The Debtors have no legal or equitable interest in cryptocurrency that was present in the Wallet Accounts as of Platform Pause, and clients should be able to withdraw such assets from the platform if they choose.\"","A hearing on the matter is scheduled for Jan. 9 at 10 a.m. ET.","A separate hearing will take place on Jan 13. regarding wallet accounts held by BlockFi International Ltd., a subsidiary that runs its non-U.S. operations based out of Bermuda.","BlockFi clients were also contacted on Dec. 19 regarding the firm's intentions to reopen withdrawals for wallet users, according to reports from users on Twitter.","Source: Twitter","BlockFi, which <a href=\"https:\/\/www.theblock.co\/post\/155516\/blockfi-strikes-680-million-credit-deal-with-ftx-us-outlines-acquisition-path\" data-v-f87c67ca=\"\">brokered<\/a> a $680 million deal with now collapsed crypto exchange FTX.US , paused withdrawals as concerns surrounding FTX's financial health escalated. On Nov. 28, the lender <a href=\"https:\/\/www.theblock.co\/post\/188915\/crypto-firm-blockfi-files-for-bankruptcy\" data-v-f87c67ca=\"\">filed<\/a> for Chapter 11 bankruptcy protection.","BlockFi claimed more than 100,000 creditors as well as between $1 billion and $10 billion in both assets and liabilities, according to the firm's <a href=\"https:\/\/www.theblock.co\/post\/188915\/crypto-firm-blockfi-files-for-bankruptcy\" data-v-f87c67ca=\"\">bankruptcy petition<\/a>. At the time, the firm <a href=\"https:\/\/www.theblock.co\/post\/188915\/crypto-firm-blockfi-files-for-bankruptcy\" data-v-f87c67ca=\"\">said<\/a> it had $257 million in cash on hand, which is expected to provide sufficient liquidity during the restructuring process.","Bankrupt crypto lender Celsius also <a href=\"https:\/\/www.theblock.co\/post\/167214\/celsius-seeks-to-reopen-withdrawals-for-certain-customers\" data-v-f87c67ca=\"\">made<\/a> a similar motion in its restructuring process. On Dec. 8, the lender <a href=\"https:\/\/twitter.com\/CelsiusNetwork\/status\/1600822398239940608\" data-v-f87c67ca=\"\">provided a status update<\/a> on the motion and said the court had authorized Celsius to return “pure custody accounts,\" which were never in Celsius's earn or borrow programs.","The court also approved withdrawals from “transferred”custody accounts with assets below $7,575 and granted the firm authority to return digital assets that are not supported on the platform.","<em data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"Nov. 28","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$680 million","content":"MONEY"},{"type":"Dec. 19","content":"DATE"},{"type":"Bermuda","content":"LOCATION"},{"type":"$10 billion","content":"MONEY"},{"type":"Jan. 9","content":"DATE"},{"type":"10 a.m. ET","content":"TIME"},{"type":"FTX","content":"ORGANIZATION"},{"type":"The BlockFi Wallet Terms of Service","content":"ORGANIZATION"},{"type":"$257 million","content":"MONEY"},{"type":"Jan 13","content":"DATE"},{"type":"Dec. 8","content":"DATE"},{"type":"$7,575","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"December 2022","content":"DATE"},{"type":"District of New Jersey","content":"LOCATION"},{"type":"Michael McCaffrey","content":"PERSON"},{"type":"BlockFi International Ltd.","content":"ORGANIZATION"}],"hashtag":["BANKRUPTCY FILINGS","BLOCKFI","CRYPTO BANKS AND LENDERS"],"authors":["Kari McMahon","The Block"]}