{"summary":"A group of Swiss crypto firms has come together to launch “tzBTC”\nIt is a 1:1 bitcoin-backed token on the Tezos blockchain\nLucas Betschart, president of Bitcoin Association Switzerland, told The Block: “Our goal with tzTBC is to make bitcoin even more accessible and flexible.”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/61256\/a-new-bitcoin-backed-token-tzbtc-launches-on-the-tezos-blockchain","publishDate":"2020-04-08T09:06:21","id":2734,"type":null,"title":"A new bitcoin-backed token ‘tzBTC’ launches on the Tezos blockchain","category":["Bitcoin"],"content":["A group of Switzerland-based crypto firms has come together to launch “tzBTC” - a 1:1 bitcoin-backed token on the Tezos blockchain.","The news was announced on Wednesday by the Bitcoin Association Switzerland, which monitors the tzBTC system. It said tzBTC gives holders the ability to interact with Tezos smart contracts while pegging to the value of bitcoin.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe tzBTC <a href=\"https:\/\/tzbtc.io\/\" data-v-f87c67ca=\"\">system<\/a> has two parties - “Keyholders” and “Gatekeepers.” Keyholders are custodians and include four little-known firms - token issuer Swiss Crypto Tokens, Blockchain services firm Inacta, custody infrastructure firm Taurus and crypto legal services firm LEXR.","Gatekeepers, on the other hand, accept bitcoin from users and allocate tzBTC in return. These include crypto financial services firm Bitcoin Suisse, crypto bank Sygnum, crypto market maker Woorton, crypto exchange Bity and Taurus.","“Our goal with tzTBC is to make bitcoin even more accessible and flexible, strengthening its position as the leading currency,” Lucas Betschart, president of Bitcoin Association Switzerland, told The Block.","The Association said the only difference between bitcoin and tzBTC is that the latter can interact with functionalities of the Tezos blockchain and, therefore, can be deployed in Tezos-based decentralized applications.","\"Taking the largest cryptocurrency and connecting it to the Tezos blockchain is like bringing the railroad to the gold mine - it allows for transportability and opens up possibilities for use,\" Armin Schmid, CEO of Swiss Crypto Tokens, told The Block. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"We believe very much in the benefits of decentralization and it's great to be a part of this decentralized community effort to connect the bitcoin ecosystem with the growing Tezos community and all the possibilities of the Tezos blockchain,\" Schmid added.&nbsp;","A representative of the Tezos Foundation said tzBTC does not have specific decentralized finance (DeFi) integrations yet, as it just launched, \"but the institutional support in the DeFi community is incredibly strong.\""],"hashtag":[]}