{"summary":"Gauntlet.Network&#x27;s Tarun Chitra revisits his 2020 predictions and looks ahead to what the next year means for the market.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/89983\/the-unreasonable-effectiveness-of-inefficient-markets-in-crypto","publishDate":"2021-01-04T14:33:48","id":2738,"type":null,"title":"The Unreasonable Effectiveness of Inefficient Markets in Crypto","category":["OP-ED"],"content":["<em data-v-f87c67ca=\"\">Tarun Chitra is the founder and CEO of <a href=\"https:\/\/gauntlet.network\/about\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Gauntlet.Network<\/a>.<\/em>","While 2020 was a challenging year for most parts of the world economy, crypto somehow struck a different path. The past year has seen dramatic growth, generational change, and elderly institutional players enter crypto. There were halvenings, a mini-ICO boom, a deluge of institutional funds, and most importantly, a sense that censorship-resistant digital money is necessary as monetary policies existentially flail into hyperinflation like the spike protein of the SARS-CoV-2 virus.","But amidst the platitudes and self-flattery from industry titans, there is still a sense that cryptocurrencies and associated technologies are still nascent and, dare I use the cliché, “early.” One thing that practitioners and traders will invariably tell you is that the crypto markets are still inefficient relative to their centralized counterparts. Despite all of the hype around crypto, did anything actually change efficiency-wise in 2020?","In this post, we’ll look at what has happened to improve market efficiency within the last year and speculate on the future. Even as crypto markets mature, I argue that it is the presence of inefficiencies that make the crypto finance ouroboros thrive.","To look to the future, we first need to look at where we were in 2019. Last year, <a href=\"https:\/\/www.theblockcrypto.com\/post\/51618\/sci-finance-crypto-trading-in-the-next-decade\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">I wrote a pre-2020 tome for The Block<\/a> that contained a set of predictions about efficiency improvements in crypto finance between 2020 and 2030. Many of these predictions were about improvements to centralized exchange efficiency and increased usage of DeFi. The sheer volatility of 2020 and the debasement of the U.S. dollar led to many of these improvements (to crypto trading technologies) coming into production at warp speed.","One of the biggest market incentive innovations of 2019 was the exchange token — FTX’s FTT and Binance’s BNB. The prior piece argued that these tokens provided market makers improved capital efficiency because they let them continuously hedge their fee rebate risk. These innovations let the market growth on centralized exchanges avoid some of the pitfalls of the 2017 boom and ensured that Bitcoin was able to bounce back from the March 12 (Black Thursday) lows. These pitfalls, such as fragmented liquidity and highly unsynchronized prices across exchanges, were fixed by a combination of improved technology and more sophisticated market makers. In late 2019, I argued that BitMEX would not be able to compete with younger exchanges due to their philosophical aversion to tokens.","This year, we saw many of these predictions come true, albeit in unexpected ways. Surprisingly, the market efficiency soup du jour was the decentralized finance (DeFi) governance token. Governance tokens allow holders to vote on changes to a DeFi protocol. For financial instruments, these changes include updates to parameters like interest rates or margin requirements. New issuances of these tokens helped spur on a novel growth hack known as yield farming.","Unlike an <a href=\"https:\/\/www.theblockcrypto.com\/post\/22041\/former-fbi-analyst-alleges-fraud-breach-of-contract-and-rico\" data-v-f87c67ca=\"\">ICO<\/a>, where a participant places one token in order to purchase another, yield farming involves earning a DeFi governance token for providing liquidity or usage of a protocol. This way, a user is only given token rewards for protocol usage. As an example, suppose that one contributed 10% of the liquidity in a peer-to-pool lending protocol like Aave or Compound. This user would get paid a fraction of the protocol’s governance token as a function of usage — this user would get 10% of the incentive rewards issued per block. In many ways, this is an evolution from Web 2.0 growth hacks that paid users in cash to use products, as these protocols effectively pay for usage using an equity-like instrument.","By giving users governance tokens, DeFi protocols were able to simultaneously subsidize protocol usage while increasing token distribution. Unlike participants in ICOs and airdrops, yield farmers have to take risk with the capital they provide to protocols to earn governance tokens. For instance, if a yield farming protocol had Uniswap-like impermanent loss, then the farmer could lose more (in total value) than they gain from the governance tokens issued. Moreover, users do not immediately receive their incentives upfront — instead, they must lock up their capital for an extended period of time to maximize their reward. These tenets of farming ensure that users are better incentivized as longer-term holders of these tokens and are more likely to be committed to managing and maintaining these protocols. <a href=\"https:\/\/www.theblockresearch.com\/defi-governance-games-compound-and-its-governor-alpha-88681\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">As recent research from The Block shows<\/a>, Compound Finance’s governance token (which was the genesis of the yield farming craze) is actively used to improve the protocol.","Just like their predecessors, the exchange token, DeFi governance tokens provide a capital efficiency improvement over ‘traditional’ incentive mechanisms. Firstly, users of the protocol receive rewards in a continuous, streaming manner, provided that they participate in the protocol. This allows them to actively reinvest their rewards and use them in protocol governance. Moreover, these tokens are extremely useful for bootstrapping a network and encouraging users to test out all functionality within a protocol. <a href=\"https:\/\/insights.deribit.com\/market-research\/why-i-have-changed-my-mind-on-tokens\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Even those who deride 2017’s token madness<\/a> view this current rollout as a more efficient and fair way to use tokens to conjure up a real community. A chart that illustrates this is the growth in active liquidity providers on Uniswap:","","","<b data-v-f87c67ca=\"\">Vampiric Governance<\/b>","But why do these assets contribute to inefficiencies? One of the beautiful facts about cryptocurrencies and smart contracts is that their open-source nature enables fast clones and copies. The SushiSwap incident of Fall 2020 shows that cloning an existing protocol with product-market fit and adding a new token incentive can competitively drive liquidity away from the original protocol. It is natural in this space for liquidity to fragment — for every new farm that is created, liquidity ends up fragmenting between the original protocol and the derivative protocol. This fragmentation naturally leads to an abundance of arbitrage opportunities, which brings in new participants and capital to the market. While an epiphenomenon, this positive feedback loop is spurred on by inefficiencies. <a href=\"https:\/\/arxiv.org\/abs\/2012.08040\" data-v-f87c67ca=\"\">Recent academic work<\/a> by Guillermo Angeris, Alexander Evans, and myself quantifies this effect for Uniswap-like products.","<b data-v-f87c67ca=\"\">Inefficiency <\/b>","At this point, you might be wondering if this “inefficiency brings new market participants which brings more inefficiency” thesis only applies to DeFi. Thanks<span class=\"citation\" data-v-f87c67ca=\"\">1<\/span> to the ever-increasing number of stablecoins and centralized exchanges’ dependence on these assets, this is far from true. In fact, the inefficiencies in the stablecoin market helped exaggerate some of the large price swings in March 2020.","At this time, when market participants were aggressively rebalancing their crypto portfolios into stablecoins, exchanges and OTC desks didn’t have enough supply. At the same time, counterparties like Circle and Bitfinex were having trouble meeting stablecoin issuance demand, leading to a non-trivial amount of instability. This instability propagated wildly throughout the ecosystem, especially as Bitcoin sharply dipped below $4,000. Had there been ample stablecoin liquidity, it is far less likely that the flash crash that occurred on March 12 would have happened. There was an observable price spread of 15-20% between Bitcoin-denominated exchanges (e.g. BitMEX) and stablecoin-dominant exchanges.","A combination of these centralized and decentralized inefficiencies helped crypto launch its own <a href=\"https:\/\/en.wikipedia.org\/wiki\/Operation_Warp_Speed\" data-v-f87c67ca=\"\">Operation Warp Speed<\/a> in Spring 2020. It was at this time that traditional market veterans, dismayed at everything from the Fed’s propping up of Bond ETFs to the inability for the US government to stop printing dollars began looking to crypto. Paul Tudor Jones even explicitly stated that he was moving into cryptocurrencies as an inflation hedge <i data-v-f87c67ca=\"\">and<\/i> because the <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2020-05-07\/paul-tudor-jones-buys-bitcoin-says-he-s-reminded-of-gold-in-70s\" data-v-f87c67ca=\"\">crypto markets are still teeming with inefficiencies<\/a>.","This insight from famous money managers led to a torrent of interest from institutions hoping to capture value from some of these inefficiencies. It is this ever-increasing set of inefficiencies that captures the hearts and minds of tomorrow’s crypto traders and users. The irony of being a part of an industry that grows due to a combination of technological innovation and increases in inefficiency is certainly not lost on most market participants. Having the ability to easily fork and copy ideas naturally leads to fragmentation and waste, yet there is somehow always a stream of new ideas in this space.","<b data-v-f87c67ca=\"\">Conclusions<\/b>","Given this framing of how inefficiencies influence the growth of the cryptocurrency space, it is natural to try to predict what is in store for 2021.","In my 2020 predictions, I completely whiffed on Bitcoin-related predictions, while making proper premonitions with regards to DeFi. I ascribe my Bitcoin failures to the “Honeybadger effect of inefficiency”: the Bitcoin market, the most efficient within cryptocurrencies, has little need or ability to create arbitrage games or fragmented liquidity. The best attempt at this, the Lightning Network, has had a modicum of success in spite of the fact that the hodl meme is antithetical to Bitcoin payments. On the other hand, wrapped BTC (and hopefully, trustless cross-chain BTC) naturally creates arbitrage games and fragmentation, which, when combined with yield farming, fueled its amazing growth in usage on Ethereum.","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span class=\"citation\" data-v-f87c67ca=\"\">1&nbsp;<\/span>The growth in the number of stablecoin stems from increased global demand for non-bank-issued dollars, regulatory differences, and new decentralized mechanisms for algorithmic stablecoins. <\/span><\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Fed","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"2019","content":"DATE"},{"type":"Compound Finance","content":"ORGANIZATION"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"2030","content":"DATE"},{"type":"Paul Tudor Jones","content":"PERSON"},{"type":"Alexander Evans","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"Guillermo Angeris","content":"PERSON"},{"type":"Spring 2020","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"March 12","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"March 2020","content":"DATE"},{"type":"Binance’s BNB","content":"ORGANIZATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"March 12 (Black Thursday","content":"DATE"},{"type":"ICOs","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"$4,000","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"Tarun Chitra","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["CRYPTO"],"authors":["Tarun Chitra","The Block"]}