{"summary":"The Securities and Exchange Commission (SEC) said it anticipates needing four months to potentially respond to Coinbase&#x27;s request for rulemaking.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234521\/sec-wants-four-months-to-respond-to-coinbases-request-for-rulemaking","publishDate":"2023-06-13T18:40:05","id":2740,"type":null,"title":"SEC wants four months to potentially respond to Coinbase&#x27;s request for rulemaking","category":["COMPANIES"],"content":["The US Securities and Exchange Commission (SEC) said it anticipates it will take 120 days to potentially respond to Coinbase's request for rulemaking on digital asset trading.&nbsp;","The agency said it has not decided whether it will respond to the exchange's request and downplayed its demand for a faster response, claiming it might be due to the \"weakness\" of its claim. In a document filed in the United States Court of Appeals for the Third Circuit, it maintained that the petition should be denied.","\"There is no merit to Coinbase's extraordinary request for a writ of mandamus to compel the Commission to act on Coinbase's wide-ranging rulemaking petition within seven days,\" the agency wrote.","\"The Commission has not decided what action to take on that petition in whole or in part--which is entirely reasonable given the breadth of the rulemaking petition and the fact that it was filed just months ago and supplemented by Coinbase recently.\"","In the meantime, the SEC said Coinbase is \"bound by existing law.\"","Coinbase's request for clearer rulemaking seeks to \"replace existing, applicable requirements,\" according to the agency. The request by the exchange precedes the agency's lawsuit against the firm, which was filed last week and alleged the firm traded unregistered securities. On June 6, the agency was asked by courts to clarify its position on Coinbase's petition within seven days.","Coinbase's Chief Legal Officer Paul Grewal <a href=\"https:\/\/twitter.com\/iampaulgrewal\/status\/1668742688689070083\" data-v-f87c67ca=\"\">criticized<\/a> the response on Twitter, claiming it was fallacious and ignored statements made by SEC Chairman Gary Gensler.","In April, Coinbase <a href=\"https:\/\/www.theblock.co\/post\/230935\/the-sec-calls-coinbases-suit-over-digital-asset-rules-petition-baseless\" data-v-f87c67ca=\"\">sued the SEC<\/a> to get a response to its request for rulemaking that it made in 2022. As for the SEC, it has argued that digital asset rules exist. As previously reported, the agency has told the industry that there are rules and laws governing it, but just doesn’t like them.","<em data-v-f87c67ca=\"\">Updated with further context throughout.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Commission","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"June 6","content":"DATE"},{"type":"Twitter","content":"DATE"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"US Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Third Circuit","content":"ORGANIZATION"},{"type":"United States Court of Appeals","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Paul Grewal","content":"PERSON"}],"hashtag":["COINBASE"],"authors":["Tim Copeland","Frank Chaparro","The Block"]}