{"summary":"Asian blockchain security startup CoolBitX has raised $16.75 million in Series B funding\nThe startup wants to help crypto exchanges comply with FATF’s ‘travel rule’ via its solution Sygna Bridge\nCoolBitX CEO Michael Ou told The Block that he is “confident” the solution will be well-received by crypto exchanges around the world","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/56853\/coolbitx-raises-16-75m-series-b-to-help-crypto-exchanges-comply-with-fatfs-travel-rule","publishDate":"2020-02-24T20:00:25","id":2740,"type":null,"title":"CoolBitX raises for Series B; help exchanges comply with FATF&#x27;s &#x27;travel rule&#x27;","category":["Investments"],"content":["Asian blockchain security startup CoolBitX has raised $16.75 million in a Series B funding round from notable investors.","The round was led by Japanese financial services giant SBI Holdings, with participation from Monex Group, Korean crypto exchange BitSonic and Taiwanese government's National Development Fund.","With the fresh capital in place, Taiwan-based CoolBitX plans to market its compliance solution Sygna Bridge beyond the Asia-Pacific region. The solution helps crypto exchanges comply with the Financial Action Task Force's (FATF's) \"<a href=\"https:\/\/www.theblockcrypto.com\/post\/28521\/fatf-retains-travel-rule-in-new-guidance-compelling-exchanges-to-share-customer-data\" data-v-f87c67ca=\"\">travel rule<\/a>.\"","<strong data-v-f87c67ca=\"\">Travel rule implementation<\/strong>","The clock to comply with the FATF's travel rule is ticking fast as the June deadline approaches. The rule <a href=\"https:\/\/www.theblockcrypto.com\/linked\/55347\/swiss-regulator-finma-wants-to-bring-stricter-aml-rules-for-crypto-transactions\" data-v-f87c67ca=\"\">requires<\/a> crypto exchanges to share sender (originator) and receiver (beneficiary) information for transactions of above $1,000 -- to help law enforcement agencies track suspicious transactions.","CoolBitX's Sygna Bridge, <a href=\"https:\/\/www.sygna.io\/\" data-v-f87c67ca=\"\">launched<\/a> last October, allows crypto exchanges to share and transmit required compliance data via an application program interface (API). \"When the transaction of data takes place, the originator and beneficiary parties can then privately and securely exchange the required information during an off-chain compliance check. The data exchanged is encrypted, and private information such as personally identifiable information (PII) can only be decrypted by the beneficiary crypto exchanges with its private key. This prevents the PII from being sent to unsecure or poorly-managed exchanges,\" CoolBitX CEO, Michael Ou, told The Block, adding:","\"We have already cemented our market dominance in Asia with more than 11 crypto exchanges signing Memorandums of Understandings (MOUs) to test or implement Sygna Bridge within their infrastructure and we are confident the solution will be well-received by other virtual asset service providers (VASPs) around the world.\"","Some of the exchanges that currently use Sygna Bridge are SBI VC Trade, Coincheck, BitPoint and BitSonic, among others. Big-name exchanges such as Coinbase and Binance aren't on the list yet. Ou told The Block that he is \"confident\" that Sygna Bridge will be adopted by more exchanges \"in the upcoming months.\"","<strong data-v-f87c67ca=\"\">Japan expansion<\/strong>","Japan is clearly the largest market for CoolBitX right now, given the customers and investors in the country. To serve them better, CoolBitX is planning to open a separate entity there. \"Having a local presence in Japan will allow us to witness up close what full crypto compliance looks like,\" Ou told The Block, adding that specific details about the entity will be revealed at a later date.","CoolBitX is not the only crypto firm offering a FATF-complaint solution. Blockchain firms Shyft Network and CipherTrace also provide similar solutions. Shyft Network, however, did not provide details on which crypto exchanges currently use its solution. A spokesperson of the firm told The Block that a partnership with \"one of the largest exchanges in the world\" will be announced this week. While a spokesperson for CipherTrace said since the firm's FATF-complaint solution TRISA is open-source, it \"may be deployed without the team's knowledge.\"","On a competitive edge, Ou told The Block that Sygna Bridge is a live product with proven abilities. It has \"no performance issues,\" he claimed.","Founded in 2014, CoolBitX team also offers a Bluetooth-enabled crypto hardware wallet called CoolWallet S. Ou told The Block that the firm has seen a 200% year-on-year growth in wallet sales from 2018 to 2019, and will now place its focus on the U.S., Taiwan, Japan, Canada and the U.K. markets for expansion. He declined to share revenue details.","Today's Series B brings CoolBitX's total funding to date to $30.25 million. The firm has previously raised $13 million for <a href=\"https:\/\/e27.co\/taiwanese-mobile-wallet-startup-coolbitx-receives-us13m-sbi-holdings-others-20180914\/\" data-v-f87c67ca=\"\">Series A<\/a> and $500,000 in a <a href=\"https:\/\/www.crunchbase.com\/organization\/coolbitx-technology#section-recent-news-activity\" data-v-f87c67ca=\"\">seed funding<\/a> round."],"hashtag":["SERIES B"]}