{"summary":"Ethereum’s Dencun upgrade will introduce proto-danksharding to make Layer 2 solutions like zkSync cheaper to use.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275767\/zksync-eyes-lower-fees-bigger-batches-after-ethereums-dencun-upgrade","publishDate":"2024-02-09T06:01:49","id":2741,"type":null,"title":"zkSync eyes lower fees, &#x27;bigger batches’ after Ethereum&#x27;s Dencun upgrade","category":["CRYPTO ECOSYSTEMS"],"content":["The upcoming Duncan upgrade on Ethereum, <a href=\"https:\/\/www.theblock.co\/post\/276747\/dencun-upgrade-expected-on-march-13-to-bring-blobs-to-ethereum-mainnet?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">expected<\/a> in mid-March, will introduce what's known as \"proto-danksharding.\"","This upgrade is drawing attention from Ethereum enthusiasts for its potential to enhance Layer 2 solutions such as zkSync, Optimism, Arbitrum, and others, marking Duncan as a crucial development for their future.","Proto-danksharing (or EIP-4844) aims to incorporate off-chain ‘data blobs’, enabling the inclusion of more data in Ethereum transactions without affecting block processing times. This is being touted as key for the scalability of Layer 2s on the network, offering them the capability to utilize increased data capacity.","Consequently, a major decrease in transaction costs on Ethereum Layer 2s is anticipated. “The overwhelming difference that users will notice with the EIP-4844 upgrade is that the transaction fees will be substantially reduced,” Anthony Rose, head of engineering at Matter Labs — the core contributor to zkSync — told The Block.","zkSync, which functions as a Layer 2 network atop the Ethereum mainnet, aggregates hundreds to thousands of transactions into batches, which are then verified on the mainnet. However, this verification incurs fees, which are passed on to users.","At the time of writing, transaction fees on zkSync are averaging about $0.20. The component that EIP-4844 will affect — related to data costs — is roughly $0.08–$0.10 per transaction. The team predicts that this data-related component could potentially reduce nearly ten-fold after Duncan, which may bring down the average fee (per transaction) to under $0.10.","Matter Labs has implemented code enhancements to zkSync in the past year, in line with EIP-4844, targeting performance and improving the capability to batch transactions and verify them.","“We’re working on a number of improvements to the protocol that, combined with the changes specific to EIP-4844, will have a big impact on the performance of zkSync,” Rose said.","Among them is the roll-out of <a href=\"https:\/\/www.theblock.co\/post\/239880\/zksync-launches-new-proof-system-called-boojum-for-era-mainnet\" data-v-f87c67ca=\"\">Boojum<\/a>, a STARK-based proof system designed to enable the network to compress and publish a lot more data to the mainnet within its batches.","Boojum was instrumental in the amount of data zkSync aggregates to Ethereum per Layer 2 batch, and now the cost efficiency that Duncan would bring would make it more cost-efficient.","“With the Boojum upgrade, we included some changes to the way we publish data to L1 (partly to prepare for EIP-4844), but this also allowed us to introduce better data compression, and simultaneously, we increased the L2 batch sizes,” Rose explained.","“Our batches will be bigger, and the transactions will get cheaper,” he added.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Boojum","content":"LOCATION"},{"type":"Anthony Rose","content":"PERSON"},{"type":"4844","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Proto","content":"PERSON"},{"type":"Arbitrum","content":"LOCATION"},{"type":"$0.20","content":"MONEY"},{"type":"Duncan","content":"PERSON"},{"type":"$0.10","content":"MONEY"},{"type":"Rose","content":"PERSON"},{"type":"$0.08–$0.10","content":"MONEY"}],"hashtag":["ZKSYNC"],"authors":["Vishal Chawla","The Block"]}