{"summary":"Singapore’s financial regulator has proposed to allow listing and trading of crypto derivatives on approved exchanges \nThe proposal has been put in place due to interest from institutional investors \nThe regulator seeks public comments on the proposal by Dec. 20","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/47706\/singapores-financial-regulator-proposes-to-allow-trading-of-crypto-derivatives-on-approved-exchanges-due-to-institutional-interest","publishDate":"2019-11-20T05:45:29","id":2744,"type":null,"title":"Singapore’s financial regulator proposes to allow trading of crypto derivatives on approved exchanges due to institutional interest","category":["Asia"],"content":["The Monetary Authority of Singapore (MAS), the country’s de facto central bank and financial regulator, has just proposed to allow the listing and trading of cryptocurrency derivatives on approved local exchanges.","Under the proposal, trading of derivatives tied to cryptocurrencies such as bitcoin (BTC) and ether (ETH) will be subject to the Securities and Futures Act of Singapore, the MAS <a href=\"https:\/\/www.mas.gov.sg\/news\/media-releases\/2019\/mas-consults-on-proposed-changes-to-regulate-payment-token-derivatives-traded-on-approved-exchanges\" data-v-f87c67ca=\"\">said<\/a> in a statement Wednesday.","The plan has been put forth in response to interest from institutional investors such as hedge funds and asset managers, the MAS said. Singapore currently has four approved exchanges - Asia Pacific Exchange, ICE Futures Singapore, Singapore Exchange Derivatives Trading and Singapore Exchange Securities Trading Limited, according to the MAS.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“A well-regulated market for derivatives – particularly one anchored by institutional investors with sophisticated risk management and investment strategies – can serve as a more reliable reference of value for the underlying asset,” the regulator said in a <a href=\"https:\/\/www.mas.gov.sg\/-\/media\/MAS\/News-and-Publications\/Consultation-Papers\/2019-Payment-Token-Derivatives\/Consultation-Paper-on-Proposed-Regulatory-Approach-for-Derivatives-Contracts-on-Payment-Tokens.pdf?la=en&amp;hash=17EDEB7F20EB609AEE2D81C3C64DC609A9E3B775\" data-v-f87c67ca=\"\">consultation paper<\/a> on the proposal.","Notably, the MAS classifies bitcoin and ether as “payment tokens.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">Singapore looking to join the global race<\/strong>","Crypto derivatives are already popular in the U.S.&nbsp; Derivatives exchange giant <a href=\"https:\/\/www.theblockcrypto.com\/tag\/cme-group\" data-v-f87c67ca=\"\">CME Group<\/a> has been offering bitcoin futures since 2017. It has<a href=\"https:\/\/www.theblockcrypto.com\/linked\/40440\/cme-group-to-launch-bitcoin-options-in-q1-2020\" data-v-f87c67ca=\"\"> traded<\/a> nearly 7,000 futures contracts (equivalent to about 35,000 bitcoin), on average each day. CME has also been preparing to launch bitcoin options in January.","Another U.S. venue, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/46975\/bakkt-now-plans-to-offer-cash-settled-bitcoin-futures-looking-to-beat-rival-cme-group\" data-v-f87c67ca=\"\">Bakkt<\/a>, a subsidiary of Intercontinental Exchange (ICE), also provides physically-settled bitcoin futures contracts and is planning to offer a cash-settled version of the product due to customer demand. Like CME, Bakkt is also planning to launch its options contracts soon via ICE Futures Singapore.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe MAS said it considers crypto derivatives “not suitable” for retail investors. “Retail investors are advised to exercise extreme caution when trading in payment tokens and their derivatives; they could lose the whole amount put in and more,” said the regulator.","The U.K.’s financial regulator has similar thinking. The country’s Financial Conduct Authority recently <a href=\"https:\/\/www.theblockcrypto.com\/linked\/30017\/uks-financial-watchdog-proposes-to-ban-crypto-derivatives-for-retail-investors\" data-v-f87c67ca=\"\">proposed<\/a> to ban the sale of cryptocurrency derivatives to retail investors.","The MAS seeks public comments on its proposal by Dec. 20."],"hashtag":[]}