{"summary":"Tokyo-based tech investor SoftBank Group is considering launching a new startup investment fund, according to a report on Wednesday from the Wall Street Journal citing people familiar with discussions at the company.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/169932\/tech-investor-softbank-considering-a-third-startup-investment-fund-wsj","publishDate":"2022-09-14T08:15:28","id":2745,"type":null,"title":"Tech investor SoftBank considering a third startup investment fund: WSJ","category":["VENTURE CAPITAL"],"content":["Tech investor SoftBank Group is considering the creation of yet another Vision Fund despite the decidedly mixed results of the first two, according to a report from the <a href=\"https:\/\/www.wsj.com\/articles\/softbank-considers-launching-a-third-vision-fund-11663154600\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Wall Street Journal<\/a> citing people familiar with discussions at the company.","This would be the third Vision Fund created by the company over the last few years. SoftBank is also considering putting additional money into one of the existing funds in lieu of starting a new one, the WSJ said.&nbsp;&nbsp;","The first $100 billion Vision Fund was launched in 2017, with $60 billion in investment coming from Saudi Arabian and Emirati wealth funds.","Among its highest profile investments were WeWork and the Chinese ride-hailing app Didi. The former failed spectacularly in its initial public offering of company stock in 2019, resulting in the resignation of company co-founder Adam Neumann.","Didi is also struggling due to intense scrutiny from Chinese regulators over the last year. In July, it was fined $1.2 billion following a year-long probe into how it handles data protection.","Vision Fund 2, launched in 2019, has been hit hard by the downturn in tech valuations and is down 19% from its original $49 billion invested.","A decision about the launch of the third fund is expected in the coming months.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Adam Neumann","content":"PERSON"},{"type":"2017","content":"DATE"},{"type":"WSJ","content":"ORGANIZATION"},{"type":"$49 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"SoftBank","content":"ORGANIZATION"},{"type":"Saudi Arabian","content":"LOCATION"},{"type":"July","content":"DATE"},{"type":"Didi","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"19%","content":"PERCENT"},{"type":"$100 billion","content":"MONEY"},{"type":"$60 billion","content":"MONEY"},{"type":"SoftBank Group","content":"ORGANIZATION"},{"type":"$1.2 billion","content":"MONEY"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}