{"summary":"Paxos doesn&#x27;t think stablecoin Binance USD (BUSD) should be considered a security. The company confirmed it got an SEC Wells notice regarding its issuance of BUSD.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/211242\/paxos-categorically-disagrees-with-sec-in-calling-busd-a-security","publishDate":"2023-02-13T16:33:35","id":2746,"type":null,"title":"Paxos &#x27;categorically disagrees&#x27; with SEC in calling BUSD a security","category":["STABLECOINS"],"content":["Paxos said it \"categorically disagrees\" with the U.S. Securities and Exchange Commission in calling Binance USD (BUSD) a security.","The stablecoin issuer said it got an SEC Wells notice pertaining to BUSD after the regulator alleged Paxos <a href=\"https:\/\/www.theblock.co\/post\/210919\/sec-to-sue-paxos-for-listing-binance-usd-stablecoin-wsj\" data-v-f87c67ca=\"\">listed the stablecoin as an unregistered security<\/a>.","\"We will engage with the SEC staff on this issue and are prepared to vigorously litigate if necessary,\" the company said in an emailed statement to The Block. \"To be clear, there are unequivocally no other allegations against Paxos.\"","Paxos will <a href=\"http:\/\/r-issue-binance-usd-stablecoin\" data-v-f87c67ca=\"\">stop issuing BUSD<\/a> following&nbsp;an order from the New York Department of Financial Services.","\"Paxos has always prioritized the safety of its customers’ assets,\" the company said. \"BUSD issued by Paxos is always backed 1:1 with US dollar-denominated reserves, fully segregated and held in bankruptcy remote accounts.\"","Paxo will stop issuing new BUSD stablecoins starting Feb. 21, but will allow for BUSD redemptions through at least February 2024, the company <a href=\"https:\/\/paxos.com\/2023\/02\/13\/paxos-will-halt-minting-new-busd-tokens\/\" data-v-f87c67ca=\"\">said<\/a>.","\"BUSD is a stablecoin wholly owned and managed by Paxos. As a result, BUSD market cap will only decrease over time,\" a Binance spokesperson <a href=\"https:\/\/www.theblock.co\/post\/210932\/paxos-will-no-longer-issue-binance-usd-stablecoin\" data-v-f87c67ca=\"\">told The Block<\/a> earlier. \"Paxos will continue to service the product, manage redemptions, and will follow-up with additional information as required.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"Feb. 21","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"February 2024","content":"DATE"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["BUSD"],"authors":["Catarina Moura","The Block"]}