{"summary":"Bitpanda Pro is planning to begin offering derivative products to sophisticated traders.\nThe Austrian startup wants to hire a new head of trading to help build the new desk.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/124891\/bitpanda-crypto-derivatives","publishDate":"2021-11-19T10:03:46","id":2746,"type":null,"title":"Austria’s Bitpanda plans to launch crypto derivatives","category":["Institutional Investors"],"content":["Bitpanda, the Austrian fintech unicorn, is setting up a new crypto derivatives trading desk.","The crypto firm is <a href=\"https:\/\/boards.eu.greenhouse.io\/bitpanda\/jobs\/4004401101\" data-v-f87c67ca=\"\">currently trying to hire<\/a> a head of trading for its “Bitpanda Pro” product, which caters to experienced traders and institutions. The role entails setting up a new trading function, first focusing on a spot OTC desk but later expanding into derivative products.","Derivatives, such as futures and options, allow traders to make bets on and hedge the performance of underlying assets, in this case cryptocurrencies.","Former JPMorgan executive Joshua Barraclough, who was <a href=\"https:\/\/www.theblockcrypto.com\/linked\/122230\/bitpanda-hires-jpmorgan-fintech-executive\" data-v-f87c67ca=\"\">hired to lead Bitpanda Pro<\/a> in late October, told The Block that the company is hiring a team of experienced institutional salespeople to bulk up the outfit’s presence in Europe.","“We have a lot of exciting new features and products lined up,” he said. “As a specialized and professional exchange, Bitpanda Pro’s goal is to offer highly complex financial instruments.”","Bitpanda has never offered derivative products before, according to a spokesperson. The plan is to offer derivatives exclusively to Bitpanda Pro customers.&nbsp;","Prior to joining Bitpanda, Barraclough was co-head of digital innovation at JPMorgan, responsible for creating new businesses and products. Before that, he served as the bank’s global head of fintech.","“Bitpanda Pro has not had the same exposure as Bitpanda has, and my job is to change this and really transform our exchange and institutional offering into the number one exchange in Europe,” he said. “Some of my first initiatives are to shore-up our liquidity and pricing and we have launched a market maker equity incentive program that will make our traded pairs the most attractive in the EU.”","Bitpanda <a href=\"https:\/\/www.theblockcrypto.com\/post\/114660\/crypto-bitpanda-263-million-series-c\" data-v-f87c67ca=\"\">raised $263 million<\/a> at a valuation of $4.1 billion in a Series C round led by Peter Thiel’s Valar Ventures in August."],"hashtag":[]}