{"summary":"Crypto bank Anchorage Digital will let institutional clients that hold ERC-20 tokens in custody vote on governance proposals.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231088\/crypto-bank-anchorage-digital-brings-snapshot-voting-to-institutional-clients","publishDate":"2023-05-16T17:15:46","id":2749,"type":null,"title":"Crypto bank Anchorage Digital brings Snapshot votes to institutional clients","category":["COMPANIES"],"content":["<a href=\"https:\/\/www.theblock.co\/post\/219907\/crypto-bank-anchorage-digital-cuts-20-of-staff-amid-regulatory-uncertainty-market-volatility\" data-v-f87c67ca=\"\">Anchorage Digital<\/a>, a crypto platform that has a federally chartered bank in the U.S., is adding support for Snapshot voting in a move that will let its institutional clients participate in governance decisions using tokens held in custody.&nbsp;","Snapshot is a <a href=\"https:\/\/snapshot.org\/#\/\" data-v-f87c67ca=\"\">tool used by protocols<\/a> and decentralized autonomous organizations in the Ethereum ecosystem that allows for off-chain voting that doesn't require gas fees. Anchorage said the token-gated participation venues, or Spaces, make it possible for holders to vote on proposals for free.","\"For institutional clients, being able to participate in Snapshot voting through Anchorage Digital affords the ability to help shape the future of token projects by participating in guiding them to the best governance decisions,\" the company <a href=\"https:\/\/www.anchorage.com\/insights\/announcing-snapshot-voting-with-anchorage-digital\" data-v-f87c67ca=\"\">said in a blog post<\/a>.&nbsp;","\"Protocol clients can be confident that token holders custodying with Anchorage Digital will have participation capabilities from day one,\" the bank continued.&nbsp;","The crypto bank said it currently supports over 60 ERC-20 tokens and plans to enable support \"for all applicable future ERC-20 tokens.\" It noted that there were over 1,600 \"Spaces\" where at least one proposal had been made and highlighted use by&nbsp;BitDAO, Lido and Aave.","\"All voting occurs from within Anchorage Digital Bank’s qualified custody with no movement of funds,\" the company said. \"Moreover, our bank charter explicitly allows us to facilitate governance participation.\"","Anchorage Digital <a href=\"https:\/\/www.theblock.co\/post\/127579\/crypto-bank-anchorage-series-d-funding-kkr-goldman-sachs-others\" data-v-f87c67ca=\"\">raised $350 million in a 2021 Series D funding round<\/a> that was led by KKR at a valuation of $3 billion. Other investors in the company include Andreessen Horowitz, Singaporean sovereign wealth fund GIC, Goldman Sachs and Visa.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Anchorage Digital","content":"ORGANIZATION"},{"type":"$350 million","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"$3 billion","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"20","content":"DATE"},{"type":"Lido","content":"LOCATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"KKR","content":"ORGANIZATION"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"GIC","content":"ORGANIZATION"},{"type":"Anchorage Digital Bank","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["AAVE"],"authors":["Nathan Crooks","The Block"]}