{"summary":"KB Kookmin, the largest bank in South Korea, is set to launch crypto custody service\nThe bank has filed a trademark application for “KBDAC” – KB Digital Asset Custody\nThe move indicates the service could begin soon","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/60127\/south-koreas-biggest-bank-is-set-to-launch-crypto-custody-service","publishDate":"2020-03-27T04:56:23","id":2754,"type":null,"title":"South Korea&#x27;s biggest bank is set to launch crypto custody service","category":["Custody"],"content":["KB Kookmin, the largest bank in South Korea, is set to launch crypto custody service for assets such as bitcoin (BTC) and ether (ETH).","The bank has filed a trademark application for \"KBDAC\" - KB Digital Asset Custody - with the Korean Intellectual Property Office, local news outlet Digital Today <a href=\"http:\/\/www.digitaltoday.co.kr\/news\/articleView.html?idxno=228117\" data-v-f87c67ca=\"\">reported<\/a> on Friday.","The application, filed on January 31, reportedly indicates that the bank could launch the service soon. A trademark application, in general, means that an entity has begun branding products and services and that much of the development work has been completed, per the report.","A KB Kookmin Bank official told Digital Today that KBDAC is related to what the bank decided to do with blockchain startup Atomrigs Lab in June 2019, but declined to comment on the specific launch date.","In June 2019, KB <a href=\"https:\/\/finance.yahoo.com\/news\/korea-biggest-bank-preparing-custody-113103942.html\" data-v-f87c67ca=\"\">partnered<\/a> with Atomrigs Lab to develop a crypto custody service. Atomrigs Lab builds a product that secures cryptocurrencies using multi-party computation (MPC) cryptography technology.","This technology <a href=\"https:\/\/www.theblockcrypto.com\/daily\/41356\/firms-reconsider-custodian-partnerships-as-tech-debate-over-how-to-secure-digital-assets-escalates\" data-v-f87c67ca=\"\">generates<\/a> random key shares instead of a fixed private key. These key shares are stored and computed separately to derive an output that can authorize a transaction collectively.","Beyond crypto custody offering, KB could also offer other services related to digital assets such as trading, investment advisory, and asset management, per Friday's report.","The bank's entry into the crypto space can reportedly be a catalyst to change South Korea's entire financial sector. It could also see top rival banks Shinhan, Hana and Woori getting into the industry, per the report.","Just earlier this month, South Korean lawmakers <a href=\"https:\/\/finance.yahoo.com\/news\/south-korean-lawmakers-greenlight-strict-213000663.html\" data-v-f87c67ca=\"\">voted<\/a> to place stricter anti-money-laundering (AML) rules for crypto firms, via an amendment to Korea's existing Financial Information Act. The act requires all crypto firms to register with regulators in the country."],"hashtag":["TRADFI BANKS"]}