{"summary":"Crypto exchange Zebpay has confirmed to The Block that it underwent an inspection by the Indian government last year\nThe case is now closed and the exchange paid a “small” penalty, Vikram Rangala, chief marketing officer of Zebpay, told The Block","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/59092\/indian-governments-inspection-into-zebpay-the-exchange-says-the-case-is-closed-and-it-paid-a-small-penalty","publishDate":"2020-03-18T10:15:23","id":2755,"type":null,"title":"Zebpay underwent inspection; Exchange paid a “small” penalty","category":["Exchanges"],"content":["Crypto exchange Zebpay has confirmed to The Block that it underwent an inspection by the Indian government, adding that the matter is now closed.","Earlier this week, the Press Trust of India reported that ZEB IT Services Pvt Ltd, aka Zebpay, was <a href=\"https:\/\/www.business-standard.com\/article\/pti-stories\/mca-conducts-inspection-on-one-bitcoin-company-120031601007_1.html\" data-v-f87c67ca=\"\">inspected<\/a> by the country's Ministry of Corporate Affairs and was found to have \"violations.\"","\"... based on the findings, prosecutions have been filed for violations under various provisions of the Companies Act and the same also have been concluded on payment of penalty on the compounding application(s) filed by the company,\" Anurag Singh Thakur, India's Minister of State for Finance and Corporate Affairs, was quoted as saying in the report.","Zebpay chief marketing officer Vikram Rangala told The Block that the inspection was conducted in early 2019 and the case was closed last September. \"The violation was actually just an accounting error, which was corrected and a small fine was paid,\" he said.&nbsp;","\"The error came partly because the regulations for recording and reporting crypto transactions were not yet created or clear,\" Rangala added.","He declined to disclose the penalty amount because Zebpay is complying with the government's decision of not making the details of the penalty public.","\"To be fair, there was no prosecution. I think the word was used casually or perhaps translated inaccurately. ZEB IT wasn't accused of deliberately doing anything unethical or illegal. And as we've said, we're 100% in favor of being properly regulated,\" Rangala told The Block.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nA request for comment to the state minister was not returned by press time.","Ddeepak Kapoor, founder of think tank BEGIN India, which works with the Indian government and investigative agencies to fight crypto crimes, told The Block that the ministry took a clear stand in the Zebpay case, which is a welcome development.","\"It would be more appreciable and in broader interest, if such ambiguities in tax computation for crypto and blockchain businesses are removed. A clear policy will ease the pain for the government and businesses alike,\" said Kapoor.","Rangala further told The Block that ZEB IT has gone under liquidation as part of new management and that Zebpay now operates under Awlencan Innovations India.","He stressed that there have been no further inquiries into ZEB IT or any other company associated with Zebpay.","Zebpay relaunched in India this January under a new leadership team. The exchange closed down in September 2018, a few months after the Reserve Bank of India's (RBI's) banking ban went into effect. Earlier this month, the Supreme Court of India <a href=\"https:\/\/www.theblockcrypto.com\/post\/57708\/indias-supreme-court-strikes-down-rbis-banking-ban-against-crypto\" data-v-f87c67ca=\"\">lifted<\/a> the ban."],"hashtag":[]}