{"summary":"Polygon launched its zkEVM&#x27;s second testnet, saying it&#x27;s the final step before mainnet launch.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/197324\/polygons-zkevm-launched-its-second-testnet-the-last-step-before-mainnet-goes-live","publishDate":"2022-12-21T19:14:36","id":2757,"type":null,"title":"Polygon’s zkEVM launched its second testnet, the last step before mainnet goes live","category":["LAYER 1S"],"content":["Ethereum scaling platform Polygon launched its second public testnet, moving the platform to its final stage before mainnet launch.","The <a href=\"https:\/\/polygon.technology\/blog\/final-approach-last-testnet-for-an-upgraded-polygon-zkevm\" data-v-f87c67ca=\"\">testnet<\/a> will trial a new upgrade called recursion, which it claims could result in exponentially scaling Ethereum. Polygon did not disclose a designated timeline for the mainnet launch.","Polygon claims it is the first zkEVM, a new scaling technology using zero-knowledge proofs, to reach public testnet with open-source code for its proving system, a critical component of running the zkEVM. While Polygon claims it is open source, it has received criticism from other zkEVM platforms for its use of the term in the past.","ZkEVMs are a new Ethereum scaling technology that have gained traction this past year. While not yet proven, they could vastly improve Ethereum’s transaction costs and speeds — and eventually enable on-chain privacy — all while making it easier for developers to build applications. This could open the door for a host of new on-chain applications, bridging the gap between off-chain data and real-world assets into crypto.","Last month, another zkEVM platform zkSync, raised <a href=\"http:\/\/kSync,\" data-v-f87c67ca=\"\">$200 million<\/a> in a Series C funding round.","Polygon is known for its proof-of-stake Layer 1 chain, which has become one of the most active by <a href=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/evm-chains-stats\" data-v-f87c67ca=\"\">transaction count.<\/a> But over the past couple years, Polygon has made several <a href=\"https:\/\/www.theblock.co\/post\/114479\/polygon-hermez-merger-matic-hez-tokens-ethereum-projects\" data-v-f87c67ca=\"\">acquisitions<\/a> and in-house developments in zero-knowledge, a relatively new technology that could improve scalability and privacy on-chain — and what Vitalik Buterin said is viable to use for Ethereum’s long-term <a href=\"https:\/\/vitalik.ca\/general\/2021\/12\/06\/endgame.html\" data-v-f87c67ca=\"\">endgame.<\/a>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"$200 million","content":"MONEY"},{"type":"Vitalik Buterin","content":"PERSON"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}