{"summary":"Cryptocurrency lending firm Celsius has partnered with security firm Fireblocks to secure its lending activities\n Celsius uses hot and cold wallets solutions from BitGo and Prime Trust. Now all tokens in the hot wallets will be secured by Fireblocks and Celsius is currently using solutions from all three companies\nCelsius CEO Alex Mashinsky told The Block that BitGo was also considering offering lending services ","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/47365\/celsius-opts-for-fireblocks-hot-wallet-solution-to-streamline-its-300m-lending-assets","publishDate":"2019-11-19T07:59:48","id":2757,"type":null,"title":"Celsius opts for Fireblocks&#x27; hot wallet solution to streamline its $400M lending assets","category":["Lending"],"content":["<span data-v-f87c67ca=\"\">As competition in the market for crypto storage heats up, cryptocurrency lending firm Celsius is moving some of its activities to a new provider.<\/span>","<span data-v-f87c67ca=\"\">Announced Tuesday, Celsius said Fidelity-backed Fireblocks would help it secure over $400 million assets across 49,000 active retail and institutional wallets. Fireblocks’ hot wallet solutions will enable Celsius to securely lend out users’ deposits and generate interest revenue, according to the firm. <\/span>","<span data-v-f87c67ca=\"\"><a href=\"https:\/\/www.theblockcrypto.com\/linked\/1259\/celsius-heats-up-with-interest-paying-crypto-accounts\" data-v-f87c67ca=\"\">Celsius<\/a>, a London-based firm, offers up to 10% in yields on cryptocurrency interest accounts.&nbsp; To generate interest, <\/span>the lending company constructs \"a very complicated algorithm\" that requires tokens to constantly move out of cold storage into hot storage.&nbsp; &nbsp;","<span data-v-f87c67ca=\"\">“They [Celsius] have a very complicated algorithm [to generate interests from deposits]... essentially, it’s not like the coins [Celsius hold] are stationary,” Fireblocks CEO Michael Shaulov told The Block, adding: “Some of the [assets] that are static are in cold storage. All the stuff that is hot, they either have shifted to us, or in the process of shifting to us.”&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Shaulov, funds stored with Fireblocks will also be insured in case of a security breach, although he declined to disclose specific details of the firm's insurance policy were not disclosed.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Prior to the partnership with Fireblocks, Celsius used cryptocurrency custodians Prime Trust and BitGo for both hot and cold storage. It will continue to leverage the two firms for their deposits while using Fireblocks to secure \"hot wallet transactions,\" said a Celsius spokesperson. <\/span>","<span data-v-f87c67ca=\"\">According to Celsius CEO Alex Mashinsky, the firm collected over $475 million in total deposits and collateral, all of which are stored with BitGo. However, the existing two custodians could not completely address the lending firm’s need to constantly move cryptocurrencies for its institutional borrowers, said Mashinsky, hence its addition of Fireblocks. <\/span>","<span data-v-f87c67ca=\"\">Indeed, the trade-off between ease of use and security has long hungover the market for digital currencies. To<\/span><span data-v-f87c67ca=\"\"> be sure, BitGo is working on ways to allow its clients to move coin securely within its own systems. It <a href=\"https:\/\/www.coindesk.com\/genesis-trading-bitgo-team-up-ease-crypto-trading-institutions\" data-v-f87c67ca=\"\">partnered with Genesis Global Trading<\/a> to allow clients to directly trade with the OTC desk whilst keeping their coins in cold storage.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, the cryptocurrency custody market is also heating up with Bakkt launching<\/span><span data-v-f87c67ca=\"\">&nbsp;its custody arm to institutions and cryptocurrency wallet provider Curv <\/span><a href=\"https:\/\/medium.com\/@vo1tdigitalcustodian\/vo1t-announces-strategic-partnership-with-curv-to-offer-insured-hybrid-wallet-9d58a0ced9cd\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">partner<\/span><\/a><span data-v-f87c67ca=\"\"><a href=\"https:\/\/medium.com\/@vo1tdigitalcustodian\/vo1t-announces-strategic-partnership-with-curv-to-offer-insured-hybrid-wallet-9d58a0ced9cd\" data-v-f87c67ca=\"\">ing<\/a> with London-based Vo1t to dominate the European market. The intensified competition has forced custody firms to differentiate themselves by offering various additional services such as staking rewards, lending, and brokerage. They've also been forced to lower pricing. Bakkt, for instance, is offering near zero-fee custody for its initial clients, which includes Tagomi and Pantera Capital. Still, given that many firms — including Celsius — are opting to leverage several providers, there might be enough business to go around.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Given our diverse set of services, the engineering and operations team required a solution that could be customized to fit all of our use cases, and Fireblocks was able to deliver that for us,” said <\/span>CTO of Celsius CTO Nuke Goldstein.","<em data-v-f87c67ca=\"\">Note: a previous version of this story stated that Celsius will use \"Fireblocks for assets held in hot storage,\" the article has since been updated to reflect that Celsius will use Fireblocks for \"hot wallet transactions,\" while also using Prime Trust and BitGo for their hot and cold wallet solutions.&nbsp;&nbsp;<\/em>"],"hashtag":[]}