{"summary":"Heather Morgan, a.k.a. &quot;Razzlekhan,&quot; has asked the court to clarify pre-trial conditions to allow her to access her crypto wallets to assess her tax burdens.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/169465\/razzlekhan-asks-judge-to-access-crypto-wallet-for-tax-purposes","publishDate":"2022-09-12T19:06:20","id":2758,"type":null,"title":"&#x27;Razzlekhan&#x27; asks judge to access crypto wallet for tax purposes","category":["LEGAL"],"content":["Heather Morgan, one half of the couple accused of laundering $4.5 billion in stolen bitcoin, has asked a judge for permission to access her cryptocurrency wallets in order to calculate her and her husband's tax liabilities.&nbsp;","Morgan's lawyer, Eugene Gorokhov, filed to seek clarification from the court to clarify whether Morgan could access her wallets without violating pretrial conditions.&nbsp;","\"To determine her tax liability, Ms. Morgan must access specific cryptocurrency wallets in order to calculate income from the sales of cryptocurrency assets,\" the filing, dated Sept. 12, reads. \"Undersigned counsel has discussed this issue with the government and the government understands Ms. Morgan’s need to access this information.\"","The government has no objection to the request, according to the filing.","U.S. authorities <a href=\"https:\/\/www.theblock.co\/linked\/133499\/us-government-seizes-3-6-billion-in-bitcoin-tied-to-2016-hack-of-crypto-exchange-bitfinex\" data-v-f87c67ca=\"\">arrested<\/a> Morgan along with her husband and co-defendant Ilya Lichtenstein in February of this year over allegations that the couple allegedly laundered billions in bitcoin from crypto exchange Bitfinex. They are prohibited from engaging in cryptocurrency transactions as they await trial.","If found guilty by trial, the pair faces up to 25 years for charges including conspiracy to commit money laundering and conspiracy to defraud the United States. After their initial hearings earlier this year, the couple were released on a collective $8 million bail and sought a stay in the proceedings to discuss <a href=\"https:\/\/www.cnbc.com\/2022\/03\/21\/accused-bitcoin-launderer-heather-morgan-in-plea-talks.html\" data-v-f87c67ca=\"\">possible plea deals<\/a> with prosecutors.","Since then, Morgan has received <a href=\"https:\/\/www.theblock.co\/post\/157968\/woman-charged-in-4-5-billion-bitfinex-case-cleared-to-seek-new-job-bloomberg\" data-v-f87c67ca=\"\">permission<\/a> to seek employment. She also recently <a href=\"https:\/\/www.theblock.co\/post\/165356\/heather-morgan-from-bitfinex-money-laundering-scandal-breaks-6-month-social-media-silence\" data-v-f87c67ca=\"\">broke a six-month silence<\/a> when she took to Twitter to state&nbsp;that any crypto or non-fungible token project with her likeness is a scam that she does not endorse.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$4.5 billion","content":"MONEY"},{"type":"Morgan","content":"PERSON"},{"type":"Heather Morgan","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Eugene Gorokhov","content":"PERSON"},{"type":"Sept. 12","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"$8 million","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"Morgan","content":"ORGANIZATION"},{"type":"Ilya Lichtenstein","content":"PERSON"}],"hashtag":["CRIME"],"authors":["Aislinn Keely","The Block"]}