{"summary":"Ethereum scaling solution Metis has integrated with crypto payment gateway Banxa, enabling Metis users to access Banxa’s fiat-to-crypto on-and-off ramp.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/208024\/metis-aims-to-simplify-crypto-adoption-with-banxa-integration","publishDate":"2023-02-02T09:00:44","id":2759,"type":null,"title":"Metis aims to simplify crypto adoption with Banxa integration","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Layer 2 Ethereum scaling solution Metis has integrated with crypto payment gateway Banxa, enabling Metis users to access Banxa’s fiat-to-crypto on-and-off ramp and supported cryptocurrencies, including ether, wBTC, aave, link and dai.<\/span>","<span data-v-f87c67ca=\"\">A <\/span><a href=\"https:\/\/www.fool.com\/the-ascent\/research\/study-americans-cryptocurrency\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">survey<\/span><\/a><span data-v-f87c67ca=\"\"> by The Ascent in June last year found more than 46.5 million Americans planned to purchase cryptocurrency over the subsequent 12 months. Yet, <\/span><a href=\"https:\/\/explodingtopics.com\/blog\/blockchain-stats\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">24%<\/span><\/a><span data-v-f87c67ca=\"\"> of Americans claim not to understand crypto or digital wallets, and another 17% said they had not invested in digital assets as they were unsure how.<\/span>","<span data-v-f87c67ca=\"\">Metis’s integration with Banxa aims to simplify that crypto onboarding process, particularly into Layer 2, reducing complexity for users in an attempt to make cryptocurrency more user-friendly and easily accessible for the next wave of adopters.<\/span>","<span data-v-f87c67ca=\"\">“We are always striving to propel the industry forward and accelerate the adoption of digital assets and blockchain technology,” said Metis CEO and co-founder Elena Sinelnikova in a statement. “In many ways, adoption begins with simplification of the technology and education around the potential that web3 represents,” she added.<\/span>","<span data-v-f87c67ca=\"\">As the world's first listed cryptocurrency payment gateway provider, Banxa uses a global network of local payment solutions paired with the necessary crypto licenses to facilitate low-fee, frictionless access to the crypto market in a compliant way.<\/span>","<span data-v-f87c67ca=\"\">“Metis represents one of the most popular Layer 2 solutions, and we feel strongly that, together, we can accelerate DeFi’s mass adoption,” said Banxa CCO Josh D’Ambrosio.<\/span>","<span data-v-f87c67ca=\"\">It’s the second integration for Metis in two weeks, having <\/span><a href=\"https:\/\/www.theblock.co\/post\/203693\/stargate-integrates-with-metis-in-first-blockchain-expansion-since-launch\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">partnered<\/span><\/a><span data-v-f87c67ca=\"\"> with cross-chain bridge protocol Stargate on Jan. 19, aiming to help Metis users leverage the benefits of DeFi across multiple chains.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Banxa","content":"ORGANIZATION"},{"type":"17%","content":"PERCENT"},{"type":"24%","content":"PERCENT"},{"type":"Banxa CCO Josh D’Ambrosio","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Metis","content":"ORGANIZATION"},{"type":"Jan. 19","content":"DATE"},{"type":"June last year","content":"DATE"},{"type":"Elena Sinelnikova","content":"PERSON"}],"hashtag":["CROSS-CHAIN SWAPS","FINTECH","PAYMENTS","WALLET MAKERS","WALLETS"],"authors":["James Hunt","The Block"]}