{"summary":"Coinbase’s CEO Brian Armstrong blog post sent shockwaves throughout the tech community\nHere’s how it could impact its upcoming IPO","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/79127\/a-blog-post-by-coinbases-ceo-has-raised-a-fury-will-it-affect-a-potential-ipo","publishDate":"2020-09-29T18:27:10","id":2759,"type":null,"title":"Will Brian Armstrong&#x27;s controversial blog post affect an IPO?- The Block","category":["The Block"],"content":["Coinbase chief executive Brian Armstrong's doctrine on corporate activism may have ruffled feathers but it likely won't impede the firm's public market debut, according to several professionals in the initial public offering market.&nbsp;","In a blog post <a href=\"https:\/\/blog.coinbase.com\/coinbase-is-a-mission-focused-company-af882df8804\" data-v-f87c67ca=\"\">released<\/a> Sunday, Armstrong explained his view that activism and politics should be kept out of the halls of the San Francisco-based exchange operator. Armstrong expressed his desire for Coinbase to be \"laser focused\" on its mission to build an open financial system while focusing \"minimally\" on \"broader societal issues\" and political causes.","Armstrong's message was met with a cacophony of both support and opposition from the crypto world and beyond. Some praised the former Airbnb executive for attempting to cultivate an ideologically inclusive environment. Others argued that the tone of the piece was cold and out of touch.","The reactions of two former employees illustrate the dichotomy. Dan Romero, an early employee and former lead of the exchange's institutional business, said it was \"inspiring\" to see the firm \"resolutely\" pursue its mission. Meanwhile, Reuben Bramanathan, a former product manager, said that a narrow company focus shouldn't preclude Coinbase from \"acknowledging the injustice and inequality that affects many current and future Coinbase users.\"","In any event, several former employees and executives in the digital asset market questioned whether the controversial blog post would have an impact on the company's upcoming public offering.","Reuters <a href=\"https:\/\/www.reuters.com\/article\/us-coinbase-ipo-exclusive\/exclusive-crypto-exchange-coinbase-readies-landmark-stock-market-listing-sources-say-idUSKBN24A21W\" data-v-f87c67ca=\"\">reported<\/a> in July that the firm has been lining up bankers and advisors to list its shares on a U.S. stock exchange. Meanwhile, sources close to the company say it is leaning towards a direct listing, which means it most likely opt for a listing on the New York Stock Exchange.","A direct listing is a twist on the IPO process which allows a firm to bypass some of the complexities of a traditional listing — such as a prolonged roadshow. Typically, such a deal works for a company that already has a well-known brand and doesn't need the help of investment bankers to pitch them to Wall Street investors. It should be noted that NYSE is also an investor in Coinbase.","Regardless of whether Coinbase opts for a traditional IPO or direct listing, will the blowback from the blog post be big enough to make the IPO journey significantly more difficult?","\"I think it depends a lot on whether it keeps blowing up or the dust settles and people move on,\" said Casper Johansen, founder of crypto advisory firm The Spartan Group. He added: \"I don’t think it’s something a potential institutional investor would go out of their way to point out or not take the roadshow meeting.\"&nbsp;","Another former investment banker, who spoke under the condition of anonymity given the controversial nature of the topic, agreed that the dust-up over the blog post wouldn't be something that would be on an investors radar.&nbsp;","\"How big of an issue does something like this become? I'd be sensitive if I were to be quoted, but it's probably not that big of a deal,\" the former bulge bracket investment banker said. \"If it were a question or concern around their financials, material weakness in the internal controls, or related to the adequate disclosure of legal risk and liability, then red flags would raise.\"","Still, it could mean Coinbase might miss out on at least one big opportunity as a public company: the market for so-called Environmental, Social, and Governance (ESG) investments. This month ESG-tied funds, which are comprised of companies that take sustainability and social activism into account as well as profits, <a href=\"https:\/\/www.cnbc.com\/2020\/09\/02\/esg-index-funds-hit-250-billion-as-us-investor-role-in-boom-grows.html\" data-v-f87c67ca=\"\">hit more than $250 billion<\/a> as the Covid-19 pandemic continues to grip markets.","As for the listing process, several insiders say that ESG considerations have recently become a more important consideration during the roadshow process. Indeed, some investors may view Coinbase's decision not to act as an agent for change as malpractice, one insider said. The person added that it will likely become a hot topic during an IPO roadshow — especially among larger investment firms.","BlackRock CEO Larry Fink recently <a href=\"https:\/\/www.cnbc.com\/2020\/01\/14\/blackrocks-larry-fink-says-sustainability-is-the-top-investor-issue.html\" data-v-f87c67ca=\"\">said<\/a> that sustainability, for instance, is a \"top issue\" for investors and that it would be a critical consideration for the firm's investment decisions.&nbsp;","In a <a href=\"https:\/\/www.forbes.com\/sites\/peterhorst\/2018\/01\/16\/blackrock-ceo-tells-companies-to-contribute-to-society-heres-where-to-start\/#fdcd458971d6\" data-v-f87c67ca=\"\">2018<\/a> open letter, the executive called on companies to focus less on short-term profits and asked CEOs to address the problems facing society.&nbsp;\"Society is increasingly turning to the private sector and asking that companies respond to broader societal challenges,\" Fink wrote.","Coinbase declined to comment.&nbsp;"],"hashtag":["BRIAN ARMSTRONG","COINBASE"]}