{"summary":"The Nomura-backed Komainu will help police forces store confiscated cryptocurrency\nSeizures of crypto in the UK have been increasing after a sustained effort to improve the police’s capabilities\nThe National Crime Agency has been recruiting investigators with crypto expertise","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/92190\/british-police-komainu-crime-crypto","publishDate":"2021-01-23T07:39:52","id":2760,"type":null,"title":"British police team up with Komainu to custody confiscated crypto","category":["Bitcoin"],"content":["A custody firm established by Nomura, CoinShares and Ledger has won a bid to safeguard cryptocurrency confiscated by British police.","The Derbyshire Constabulary, on behalf of the National Police Chiefs’ Council Cybercrime Programme, has partnered with Komainu – the crypto custodian which <a href=\"https:\/\/www.fnlondon.com\/articles\/nomura-wins-jersey-licence-for-crypto-custody-business-20191122\" data-v-f87c67ca=\"\">won a licence<\/a> from Jersey regulators in November 2019.","Komainu will store confiscated digital assets on behalf of the police while crimes are being investigated.","The first police seizure of cryptocurrency in the United Kingdom <a href=\"https:\/\/www.bbc.co.uk\/news\/uk-england-surrey-44896665\" data-v-f87c67ca=\"\">came in July 2018,<\/a> when more than £1.2 million in bitcoin was confiscated from a senior member of an organized crime gang.","Phil Ariss leads the Cybercrime Programme’s efforts to increase awareness of cryptocurrencies and how they are used by criminals within the police force, in addition to driving improvements in the police’s operational capabilities — through the use of tools like Komainu.","Over the past few years, the Cybercrime Programme has been training officers in crypto investigations, while giving them the skills and tools necessary to seize ill-gotten digital assets. Ariss himself was involved in <a href=\"https:\/\/www.bbc.co.uk\/news\/uk-england-leicestershire-52981336\" data-v-f87c67ca=\"\">the seizure of more £300,000<\/a> from a drug dealer in Leicestershire in June 2020.","An increase in such seizures led to a rise in demand for secure options to store the confiscated crypto.","“Virtual assets and cryptocurrency feature heavily in a significant proportion of cybercrime in the UK,” Ariss told The Block.","“The fact that we require a bespoke solution suggests that we’re talking about significant sums of money.”","He added that, up to this point, “a range of different options” have been utilized by the police to store confiscated cryptocurrency. Concern over the security of this arrangement is what led the Cybercrime Programme to seek a more uniform solution.","Komainu’s successful bid for the procurement contract was supported by CoinShares, a digital assets specialist with around $3 billion in assets under management, and Gentium, a British law enforcement consultancy focused on cybercrime.","Jean-Marie Mognetti, chief executive of CoinShares and a director at Komainu, told The Block that Komainu will handle secure storage for the police while CoinShares will help convert seized funds into fiat currency in the event of a successful prosecution.","It is not exactly the role Komainu, which targets institutional investors, was set up for — but Mognetti says the firm is well-suited to the job. &nbsp;","“Komainu is built by institutions for institutions. Komainu is powered by trust, technology and transparency,” he said.","“When you’ve built an institutional product, national bodies and supranational bodies feel that you’re ticking the box for them as well.”","The collaboration may be part of what appears to be a wider attempt by UK authorities to up their game when it comes to tackling criminality involving crypto.","The National Crime Agency (NCA) recently advertised a job opening for a Financial Investigator (Criminal &amp; Civil). The job ad stated that the NCA has a number of roles open in Cyber Crime Financial Investigations, and that candidates should have “experience of conducting financial investigations into cyber dependent and enabled crime and the criminal abuse of crypto currencies”.","The NCA did not respond to requests for comment in time for publication."],"hashtag":[]}