{"summary":"The Block&#x27;s Frank Chaparro chats with Adam Carson, Operating Partner &amp; Crypto Investing Lead at Point72 Ventures.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/126134\/point72-ventures-crypto-lead-adam-carson-says-the-firm-is-gearing-up-to-do-token-deals","publishDate":"2021-12-03T10:28:06","id":2763,"type":null,"title":"Point72 Venture&#x27;s crypto lead Adam Carson says the firm is gearing up to do token deals","category":["FINTECH"],"content":["<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Episode <strong data-v-f87c67ca=\"\">80&nbsp;<\/strong>of Season 3 of The Scoop was recorded remotely with The Block’s Frank Chaparro and Adam Carson, Operating Partner &amp; Crypto Investment Lead at Point72 Ventures.<\/em><\/span>","<i data-v-f87c67ca=\"\">Listen below, and subscribe to The Scoop on&nbsp;<\/i><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Apple<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Spotify<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5tZWdhcGhvbmUuZm0vdGhlYmxvY2stdGhlc2Nvb3A?sa=X&amp;ved=0CAMQ4aUDahcKEwionbSO9fbxAhUAAAAAHQAAAAAQAg\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Google Podcasts<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Stitcher<\/i><\/a><i data-v-f87c67ca=\"\">&nbsp;or wherever you listen to podcasts. Email feedback and revision requests to <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"31415e555250424571455954535d5e525a52434841455e1f525e5c\">[email&nbsp;protected]<\/a>.<\/i>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">This episode is brought to you by our sponsors <a href=\"http:\/\/Bakkt.com\" data-v-f87c67ca=\"\">Bakkt<\/a>,&nbsp;<a href=\"http:\/\/kraken.com\/scoop\" data-v-f87c67ca=\"\">Kraken<\/a>&nbsp;and&nbsp;<a href=\"http:\/\/www.kava.io\" data-v-f87c67ca=\"\">Kava<\/a><\/strong><\/span>","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bakkt® unlocks the $1.2+ trillion of digital assets that is currently held in cryptocurrencies, rewards and loyalty points, gaming assets and merchant stored value. We began in 2018 with the vision to bring trust and transparency to digital assets. Through the Bakkt Warehouse and Bakkt Bitcoin Futures and Options contracts, we serve institutional clients in an end-to-end regulated market with true price transparency. For consumers, Bakkt aggregates digital assets to enable instant liquidity and to empower users to trade, transfer and pay however they want. Visit <a href=\"http:\/\/Bakkt.com\" data-v-f87c67ca=\"\">Bakkt.com<\/a> for more information<\/span><\/em><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">About Kraken<br data-v-f87c67ca=\"\">\n<\/strong><em data-v-f87c67ca=\"\">Whether you’re an experienced crypto trader or just starting out, Kraken has the tools to help you achieve financial freedom. With 50+ cryptocurrencies to choose from, industry-leading security and a wide variety of features to suit any investing strategy, Kraken puts the power in your hands to buy, sell and trade digital assets. Visit&nbsp;<\/em><a href=\"http:\/\/kraken.com\/scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Kraken.com<\/em><\/a><em data-v-f87c67ca=\"\">&nbsp;to get started today.<\/em><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">About Kava<br data-v-f87c67ca=\"\">\n<\/strong><\/span><em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">For over four years, Kava Labs has contributed to building a portfolio of decentralized products and services that allow users to gain access to all of the benefits of DeFi.&nbsp;Kava connects the world’s largest cryptocurrencies, ecosystems, and financial applications on one of DeFi’s most trusted, scalable, and secure earning platforms. Kava lets you mint stablecoins, lend, borrow, earn and swap safely and efficiently across the world’s biggest crypto assets with a simple and intuitive user experience and the full confidence of institutional-grade security and quality. With a proven track record of delivering successful projects safely, the Kava Platform is DeFi’s most trusted, scalable, and secure institutional-grade cross-chain engine.<\/span><br data-v-f87c67ca=\"\">\n<iframe loading=\"lazy\" frameborder=\"0\" height=\"200\" src=\"https:\/\/playlist.megaphone.fm?e=BLOCK7481733106\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe><br data-v-f87c67ca=\"\">\n<\/span><\/em>","<span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\nOn this episode of The Scoop, Adam Carson, Operating Partner &amp; Crypto Investment Lead at Point72 Ventures, joined host Frank Chaparro for the company's first public interview to discuss its investment strategy as well as Carson’s perspectives on the convergence of fintech, Web3 and the metaverse.<\/span>","Point72 Ventures, an offshoot of billionaire investor Steven Cohen’s Point72 Asset Management Group, was launched in 2016 to initially focus on fintech investing but is increasingly ramping up its focus on the crypto space. Since The Block first reported in May that Steven Cohen was poised to make a big move into the market, the Mets owner has made several bets through various entities.&nbsp;","In the interview, Carson said that the firm could invest in 5-10 crypto firms next year and might even make some token investments.&nbsp;","\"<span data-v-f87c67ca=\"\">I hope that we will sort of evolve into doing more token investing,\" Carson said. \"It's actually something that I'm thinking about and planning for right now is proposing, like how we can do token investing because right now we don't have the infrastructure set up to be able to do that.\"<\/span>","<strong data-v-f87c67ca=\"\">On-ramp investments<\/strong>","<span data-v-f87c67ca=\"\">For now, the firm is looking to invest in infrastructure \"picks and shovels\" companies that will help onboard incumbent institutions who can then in turn create on-ramps for future consumers to enter the crypto space, according to Carson.<\/span>","<span data-v-f87c67ca=\"\">To date, Point72 Ventures has only publicly announced four crypto company investments:<\/span><span data-v-f87c67ca=\"\"> Messari, Zero Hash, 24 Exchange, and Massive. However, Carson announced on The Scoop that Point72 Ventures is soon to publicize its investment into a fifth company, which he mentioned was an established DeFi operation.<\/span>","<strong data-v-f87c67ca=\"\">When tokens?<\/strong>","It's not clear exactly when Point72 will begin making token venture bets, but Carson said that the firm will have to rethink its existing investing approach to make such a move.","\"It's a different world and it's totally new and it's also exciting,\" he said, noting that such deals can close in a matter of days versus months, which is more typical in equity deals.","\"There's different operational and technology needs,\" he said. \"You need to be able to custody these coins. You need to be able to move these coins.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2016","content":"DATE"},{"type":"Bakkt Warehouse","content":"ORGANIZATION"},{"type":"$1.2+ trillion","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Point72 Ventures","content":"ORGANIZATION"},{"type":"Adam Carson","content":"PERSON"},{"type":"Google","content":"ORGANIZATION"},{"type":"The Scoop","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"10","content":"DATE"},{"type":"Point72 Asset Management Group","content":"ORGANIZATION"},{"type":"Steven Cohen","content":"PERSON"},{"type":"Kava Labs","content":"ORGANIZATION"},{"type":"Spotify","content":"LOCATION"},{"type":"Operating Partner &amp; Crypto Investment Lead","content":"ORGANIZATION"},{"type":"Carson","content":"PERSON"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Carson","content":"ORGANIZATION"},{"type":"Frank Chaparro","content":"PERSON"}],"hashtag":["FINTECH"],"authors":["Frank Chaparro","The Block"]}