{"summary":"Twitter enabled bitcoin tipping for iOS users today as part of its “turning fans into funds” strategy.\nThe platform is focused on becoming a hub for creators.\nTwitter also plans to roll out an NFT authentication feature, though it’s early days for this particular product.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/118450\/twitter-rolls-out-bitcoin-tipping-for-ios-users-via-lightning-looks-to-nfts-for-the-future","publishDate":"2021-09-23T13:02:37","id":2764,"type":null,"title":"Twitter rolls out bitcoin tipping for iOS users via Lightning, looks to NFTs for the future","category":["Bitcoin"],"content":["After rumors swirled earlier this month, social media platform Twitter has officially rolled out its tips function worldwide — with a bitcoin integration included via the Lightning network.","Clicking on the feature enables users to tip creators through third-party services like CashApp, which is operated by Square, a payments company founded by Jack Dorsey. But in an effort to make monetization accessible in places that may not have easy access to fiat, users can also tip in bitcoin.","The bitcoin component will utilize the Lightning Network, a layer-two solution that product manager Esther Crawford said the team selected for its lower transaction fees. Users can add their bitcoin lightning wallet or their bitcoin address to enable the sending and receiving of tips in bitcoin. For now, the integration is only rolled out to iOS users, but Android is soon to come, promised Crawford.","At the start of this month, mobile developer Alessandro Paluzzi <a href=\"https:\/\/www.theblockcrypto.com\/post\/116320\/twitter-appears-to-be-adding-the-ability-to-tip-using-bitcoin\" data-v-f87c67ca=\"\">leaked<\/a> an image of a reverse-engineering of Twitter's product that showed the beta for Lightning integration with Tips. In an explanation of his findings, he said the integration would use the Lightning-focused app Strike. A Twitter representative confirmed to The Block that the integration uses Strike.","The Twitter product team is still exploring ways to enable payouts across the world in various countries, but using bitcoin to tip mitigates that, according to Crawford.&nbsp;","\"We want everyone to have access to pathways to get paid digital currency that encourage more people to participate in the economy and help people send each other money across borders and with as little friction as possible help us get there,\" said Crawford at a press briefing on Thursday.","At the time, Twitter didn't formally confirm Paluzzi's findings, but product developer Kayvon Beykpour quote tweeted the findings with the lightning and \"soon\" arrow emojis. Beykpour was also in attendance at today's press briefing and said Twitter's focus is on turning \"fans into funds\" in the future. These features are specifically focused on building Twitter out as a platform that empowers creators.","Paluzzi also previously posted <a href=\"https:\/\/www.theblockcrypto.com\/linked\/116499\/twitter-seems-to-be-testing-the-ability-to-display-bitcoin-and-ethereum-addresses-on-profiles\" data-v-f87c67ca=\"\">screenshots<\/a> that displayed interfaces allowing users to add their Ethereum addresses to their profiles. Today's roll-out only includes a Lightning\/Strike integration. No mention of Ethereum was made during the briefing, but a Twitter spokesperson later confirmed the team is exploring the integration of other digital assets with Tips and there's \"more to come\" in the future. Crawford also said Twitter is continuing to explore crypto integrations across its products.&nbsp;","\"There's a lot of internal enthusiasm and dialog around how can we integrate crypto throughout these different monetization features,\" said Crawford during the briefing. \"There are other potential options that we don't have in place today, but we're really open to exploring it.\"","Twitter is also exploring blockchain-based tools outside the scope of monetization.","Crawford shared that the team is also in the early stages of exploring non-fungible token (NFT) authentication. Users would directly connect their crypto wallets to their accounts to prove ownership of an art piece. This would convey authenticity, and the integration would likely contain some sort of provenance explanation as well, according to Crawford.","To be clear, Twitter is in the early stages of its NFT project. The visuals of the authentication — such as whether a badge may pop up on an owner's profile or their NFT avatar contains a different shape — have yet to be determined.","\"We're interested in basically making it somehow visually clear that this is an authenticated avatar and then give you some interesting info and insight about the provenance of that NFT, so that's kind of where we're at today,\" said Crawford.","Other non-crypto features, like real-time filters to keep conversations respectful and user-moderated communities are also soon to roll out, according to the product team.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to subscribe to The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/t.me\/the_block_crypto\" target=\"_blank\" rel=\"noopener noreferrer\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Telegram<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>"],"hashtag":["BITCOIN","TWITTER"]}