{"summary":"Paradigm has launched a new service that gives users more flexibility in how they can trade with counter-parties\nThe launch comes amid an increase in activity in the crypto derivatives market","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/63922\/crypto-messaging-paradigm-holy-grail","publishDate":"2020-05-04T18:16:21","id":2765,"type":null,"title":"Crypto messaging platform Paradigm says it&#x27;s launched a &#x27;holy grail&#x27; service for derivatives traders","category":["Markets"],"content":["Trading messaging platform Paradigm is launching a new function for derivatives trades that aims to be a \"holy grail\" for the burgeoning corner of the market.&nbsp;","Paradigm allows cryptocurrency traders to negotiate with counter-parties and then automatically execute trades to be settled on partner derivatives exchanges. Those negotiations can be conducted manually or via automated requests for quotes (RFQs), which are electronic messages sent between counter-parties that outline the terms of a trade.&nbsp;","Now, users of the platform will have more flexibility in how they can construct an RFQ. Previously, traders would have to negotiate a futures and options trade separately, but the new service, dubbed RFQ Builder, will allow traders to configure trades to include options and futures in one trade.&nbsp;","Options contracts give traders the ability to purchase or sell an underlying asset at a particular price and agreed upon time period in the future. In certain cases, traders will execute an options trade alongside a futures trade to limit or hedge the \"delta\" risk associated with the options trade, Wall Street parlance for an&nbsp;option's risk tied to a change in the price of the underlying asset.","The ability to separate the \"delta\" risk from \"vega\" risk – changes in a contract's implied volatility or the volatility of the underpinning asset – \"is really valuable for an asset class famous for its volatility,\" Rich Rosenblum, co-founder of GSR, said.","\"Delta-neutral execution is the holy grail for options traders,\" Paradigm CEO Anand Gomes said of the new functionality.&nbsp;","For the most part, conducting such a trade has been cumbersome in the crypto market, requiring traders to operate across several platforms. In some cases, some firms have built these capabilities internally, according to Rosenblum. Still, as the trading executive noted, such a function open to the entire ecosystem is an important feature in a market known for its volatility. Here's Rosenblum:","\"It's like when you go to get groceries at the store. The delta hedge part (the futures) is like the bag the groceries come in. We have been going to the store and having to bring our own bags to put the food in, and pack them ourselves. Having the futures be included into the process gives the traders better service, since they're starting to bag it up nicely together.\"","Launched in 2019, Paradigm's platform is linked up to Deribit and has facilitated $940 million in trades to date. The firm also recently connected to CME Group, enabling traders to negotiate bitcoin futures and options trades to settle on the Chicago trading giant's exchange. At one point, 54% of Deribit's volumes have been negotiated through Paradigm, according to the company.&nbsp;In total, Paradigm has more than 250 clients.&nbsp;","Meanwhile, bitcoin futures and options markets are making a comeback. Open interest in Deribit's bitcoin options product increased from a recent trough around $350 million to $670 million on Sunday.","","","CME Group has seen open interest in its bitcoin futures product increase to $339 million, representing a complete rebound from the retreat in open interest since mid-March, in dollar terms.&nbsp;","","","On a contract basis, open interest saw steady growth from 4,270 contracts on April 1 to more than 7,670 contracts on May 1, according to data provided by the exchange.&nbsp;"],"hashtag":["DERIVATIVES","PARADIGM"]}