{"summary":"Bullish is preparing to go public at a $9 billion valuation.\nBut unlike other crypto exchange unicorns, it has yet to release a product.\nBullish chief product officer Ian Smith walked The Block through the exchange platform ahead of its test-phase launch.","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/112630\/an-inside-look-at-bullish-the-billion-dollar-crypto-exchange-thats-just-begun-its-test-pilot","publishDate":"2021-07-27T12:59:30","id":2766,"type":null,"title":"An insider look at crypto exchange Bullish&#x27;s platform","category":["Capital Markets"],"content":["Bullish, the Block.One-backed cryptocurrency exchange, has been making a flurry of headlines, joining the long list of crypto firms <a href=\"https:\/\/www.cnbc.com\/2021\/07\/09\/ex-nyse-president-tom-farleys-spac-to-merge-with-bullish-to-bring-planned-crypto-exchange-public.html\" data-v-f87c67ca=\"\">preparing<\/a> a SPAC deal to go public, <a href=\"https:\/\/www.coindesk.com\/softbank-to-invest-75m-in-peter-thiel-backed-crypto-exchange-bullish\" data-v-f87c67ca=\"\">raising<\/a> millions in the private markets, and onboarding former New York Stock Exchange president Thomas Farley as its CEO.&nbsp;","The firm has been able to do all of this without having a live product. But Bullish isn't just a white paper and a dream: the firm is entering a public test phase of its exchange. And over the course of the next seven weeks will take in feedback and then gear up for a more public launch.&nbsp;","Ahead of its test phase launch, The Block got an inside look at Bullish's exchange product. Here's what it looks like under the hood:","The front-end of the exchange platform looks similar to most on the market, a sleek view at the market for a given asset — showing the trades printing on the right side and the depth of the order book on the bottom. The charting capabilities are powered by TradingView.&nbsp;","Cost to trade is zero basis points for liquidity takers and 10 basis points for liquidity providers, according to Ian Smith, Bullish's chief product officer.","","","Bullish offers a twist on the traditional exchange model by leveraging both centralized liquidity providers and its own internal automated market-makers (AMM) to enhance liquidity on the platform.","This is the key feature that makes the offering unique relative to its soon-to-be competitors. The idea behind the structure is to ensure liquidity even during shaky periods when market-makers might pull bids and make it more difficult to trade.","<strong data-v-f87c67ca=\"\">AMMs<\/strong>","The exchange is leveraging its own internal AMMs versus platforms run by a third party, which would already have ample liquidity. Bullish's internal AMM will need to somehow incentivize users to provide that liquidity, which is easier said than done.&nbsp;","Bullish Earn — which allows users to stake their assets across various pools for a yield — is another feature. Indeed, it is those staked assets that will provide liquidity for Bullish's AMMs. It's not exactly clear what those yields will be, but the firm will leverage its own treasury of crypto \"to further strengthen the product offering of the platform,\" according to a media release.","In order to withdrawal staked assets, clients have to wait an entire week while the platform manages the withdrawal.&nbsp;","","","A user can view the totality of their crypto trading picture on Bullish via a portfolio overview page, which includes views of the growth of their portfolio, the balance of their spot and margin accounts amount the amount of assets they have staked in its liquidity pools.&nbsp;","","","The pilot launch is slated to last until September 13, according to a blog post. The exchange is expected to fully launch to the public in 2021.","<strong data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Listen to our full episode of The Scoop with incoming Bullish CEO Tom Farley, <a href=\"https:\/\/cms.megaphone.fm\/channel\/theblock-thescoop?selected=BLOCK5453416318\" data-v-f87c67ca=\"\">here<\/a>.&nbsp;<\/em><\/strong>","<iframe frameborder=\"0\" height=\"200\" src=\"https:\/\/playlist.megaphone.fm?e=BLOCK5453416318\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>"],"hashtag":[]}