{"summary":"As reported by The Block, crypto trading desks and exchanges saw heightened volume on Thursday. Things were no different in the derivatives space.\nFTX said that it suffered from a database overload.","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/58583\/bitcoin-options-volume-surged-during-thursdays-price-slide","publishDate":"2020-03-12T17:50:15","id":2767,"type":null,"title":"Bitcoin options volume surged during Thursday&#x27;s price slide","category":["Markets"],"content":["\"All BTC safe haven storylines have been proven inaccurate.\"&nbsp;","So says Marius Jansen, COO of crypto derivatives exchange Deribit. In a text to The Block, Jansen wrote that \"[w]e have clearly seen the risk-off impact on BTC and the rest of the market as all assets have been massively sold.\"","His comments came amid a significant fall in the price of digital assets, including bitcoin, which <a href=\"https:\/\/www.theblockcrypto.com\/post\/58521\/bitcoin-plunges-to-near-6000-levels-hits-new-low-since-may-2019\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">fell below<\/a> $6,000 Thursday. At press time, the price of bitcoin is hovering around $5,690, a decline of more than 27%, according to data from <a href=\"https:\/\/www.coinbase.com\/price\/bitcoin\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Coinbase<\/a>.","Global equities markets fell broadly as well, with the NYSE hitting its circuit breaker for the second time of the week – less than 10 minutes after the market open.","As reported by The Block, <a href=\"https:\/\/www.theblockcrypto.com\/post\/58540\/crypto-otc-desk-bitcoin-price-plunge-markets-coronavirus\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">crypto trading desks<\/a> and <a href=\"https:\/\/www.theblockresearch.com\/a-view-of-exchange-volume-activity-during-thursday-mornings-bitcoin-sell-off-58598\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">exchanges<\/a> saw heightened volume on Thursday. Things were no different in the derivatives space.&nbsp;According to Skew, Thursday saw a significant uptick in bitcoin options volume, with the vast majority of it occurring on Deribit.","","","Jansen told The Block that Deribit saw around 35,000 bitcoin options contracts trade hands during the 24 hours. In total, over $1.6 billion has been traded on the exchange during the same period of time, he explained.","\"BTC perpetual is trading at a discount to spot and the basis has come off as well. March futures are in backwardation on most markets. This bearish trend is amplified by significant liquidations on all derivatives markets including Deribit,\" said Jansen.&nbsp;","Crypto derivatives exchange BitMEX's <a href=\"https:\/\/www.bitmex.com\/app\/index\/.BVOL24H\" data-v-f87c67ca=\"\">bitcoin volatility index<\/a>, which benchmarks the price movement of bitcoin, spiked from around 4 to above 18 at press time.","","","Total hourly liquidation volumes of BitMEX's famed bitcoin perpetual swaps at once hit a whopping $501 million, with its three-day average being $11 million.&nbsp;","","","The market turbulence also applied significant pressure on exchange infrastructure, according to market participants. High-frequency trader Mike van Rossum told The Block that almost all major exchanges, including FTX, Huobi, BitMEX, Deribit all have technical issues such as order book lags.&nbsp;","\"During this time, one of FTX’s databases got overloaded. This caused significant orderbook lag, and we had to ratelimit\/throttle orders to keep it functioning,\" FTX CEO Sam Bankman-Fried stated in a <a href=\"https:\/\/twitter.com\/SBF_Alameda\/status\/1238158656861925376?s=20\" data-v-f87c67ca=\"\">tweet<\/a>.&nbsp;","\"All in all, it was very messy everywhere,\" van Rossum said.&nbsp;"],"hashtag":["BITMEX","DERIVATIVES"]}