{"summary":"South Korea&#x27;s Shinhan Bank completed a feasibility test for stablecoin remittance payments using Hedera&#x27;s distributed ledger technology.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240219\/south-koreas-shinhan-bank-tests-stablecoin-payments-on-hedera-network","publishDate":"2023-07-18T06:15:58","id":2768,"type":null,"title":"South Korea&#x27;s Shinhan Bank tests stablecoin payments on Hedera network","category":["CRYPTO ECOSYSTEMS"],"content":["South Korea's Shinhan Bank completed a feasibility test for stablecoin remittance payments using Hedera's distributed ledger technology.","The project's goal was to rectify cross-border payments problems arising from high fees, lengthy settlements times, and the absence of tracking features. The <a href=\"https:\/\/hedera.com\/blog\/shinhan-bank-scb-techx-successfully-pilot-stablecoin-remittances-on-the-hedera-network\" data-v-f87c67ca=\"\">pilot<\/a> also involved SCB TechX, Siam Commercial Bank's technology innovation business unit, amongst other other financial institutions.","“Stablecoins offer a low-cost, fast, and reliable way to transfer value across borders, which can help to increase financial inclusion and improve access to financial services for individuals and businesses in underserved communities,” said Byunghee Kim, who leads blockchain at Shinhan Bank.","The stablecoin remittance pilot is compatible with the <a href=\"https:\/\/www.theblock.co\/post\/239960\/neon-labs-releases-evm-to-bring-support-for-ethereum-apps-on-solana\" data-v-f87c67ca=\"\">Ethereum Virtual Machine<\/a> (EVM), as it uses <a href=\"https:\/\/www.theblockresearch.com\/layer-by-layer-hedera-sees-modest-growth-after-introducing-evm-support-197126\" data-v-f87c67ca=\"\">Hedera’s<\/a> smart contract capabilities. According to <a href=\"https:\/\/hedera.com\/blog\/shinhan-bank-scb-techx-successfully-pilot-stablecoin-remittances-on-the-hedera-network\" data-v-f87c67ca=\"\">Hedera<\/a>, EVM-based stablecoin issuers will be able to participate in future pilots using the same tested framework.","“With this next phase, we are pleased to have demonstrated how the use of Hedera’s EVM-compatible technology helps eliminate intermediaries, reduce costs, and speed up the remittance process,\" Byunghee Kim added.","The average cost of remittances is 6% according to the <a href=\"https:\/\/remittanceprices.worldbank.org\/#:~:text=Globally%2C%20sending%20remittances%20costs%20an,2023%20report%20for%20further%20details.\" data-v-f87c67ca=\"\">World Bank<\/a>. Cross-border transfers between countries with limited liquidity and network connections often incur high intermediary fees. These transactions can also take three to seven days to process, with no transaction visibility for customers.&nbsp;","Shinhan Bank claims its stablecoin solution offers individuals and organizations the ability to send and receive funds denominated in a local stablecoin at significantly lower fees than the traditional remittance process. \"The successful completion marks an important step forward in our efforts to make cross-border payments faster, cheaper, and more accessible to people around the world,\" <span class=\"xn-person\" data-v-f87c67ca=\"\">Byunghee Kim<\/span> added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"6%","content":"PERCENT"},{"type":"South Korea","content":"LOCATION"},{"type":"Shinhan Bank","content":"ORGANIZATION"},{"type":"Ethereum Virtual Machine<\/a> (EVM","content":"ORGANIZATION"},{"type":"Siam Commercial Bank","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SCB","content":"ORGANIZATION"},{"type":"Hedera","content":"ORGANIZATION"},{"type":"Byunghee Kim","content":"PERSON"},{"type":"Hedera","content":"LOCATION"},{"type":"World Bank","content":"ORGANIZATION"}],"hashtag":[],"authors":["Brian McGleenon","The Block"]}