{"summary":"European fintech unicorn Revolut has partnered with Paxos Crypto Brokerage to offer crypto trading services in the U.S.\nRevolut’s move might set the foundation for other fintech firms to dive into the nascent market","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/71636\/revolut-teams-up-with-paxos-to-launch-crypto-service-in-the-us-and-it-points-to-broader-trends-in-the-fintech-space","publishDate":"2020-07-15T06:00:32","id":2769,"type":null,"title":"Revolut teams up with Paxos to launch crypto service in the US, and it points to broader trends in the fintech space","category":["Cryptocurrency"],"content":["Count this as the latest sign that fintech companies see cryptocurrency as a promising way to expand their business.","European fintech unicorn Revolut announced Wednesday that it is set to enter the U.S. market, offering crypto trading services in the country via a platform that also spans stock trading and checking account services in Europe. But unlike rivals like Bitstamp and eToro, which recently ventured into the U.S., Revolut is partnering up with Paxos in a move that might set the foundation for other fintech firms to dive into the market.","As part of the U.S. launch, New York-based Paxos will serve as the backbone of Revolut's crypto trading offering. While Revolut will handle the front-end experience for clients, Paxos Crypto Brokerage will manage the underlying regulatory and technical complexity, as noted in a press release. As such, Revolut will have access to the full range of jurisdictions that Paxos is able to serve via its New York trust license. On the liquidity front, Revolut won't have to worry about setting up relationships with market makers or exchanges to source cryptocurrency for its retail clients.&nbsp;","Revolut — which counts its active crypto clientele in Europe above 1 million — is the first client of Paxos' new offering. The launch of crypto services has historically been a boon for fintech companies, in terms of both growth and valuations, as indicated by Zabo in its recent <a href=\"https:\/\/cdn.zabo.com\/reports\/Fintech_Adoption_of_Crypto_Zabo_July2020.pdf\" data-v-f87c67ca=\"\">research report<\/a>. Following the launch of crypto services by Robinhood in the U.S. and Revolut in Europe, the respective valuations of both companies soared, per the report. However, it's worth noting that such relationships might not be causal — early fintech companies expand their product suite and then grow further.","Soon after its 2018 rollout, Robinhood <a href=\"https:\/\/www.businessinsider.com\/over-1-million-people-have-signed-up-for-robinhood-crypto-2018-1\" data-v-f87c67ca=\"\">said<\/a> that more than 1 million customers signed up for Robinhood Crypto within the first week of its launch. Square also reported success with the launch of bitcoin buys and sells on its Cash App, powering more than $300 million in bitcoin sales in the first quarter of 2020.","","","<span data-v-f87c67ca=\"\">Source: <a href=\"https:\/\/cdn.zabo.com\/reports\/Fintech_Adoption_of_Crypto_Zabo_July2020.pdf\" data-v-f87c67ca=\"\">Zabo<\/a><\/span>","\"You look at the crazy success of Robinhood and you think, why haven't more folks done it,\" said Alex Treece, co-founder of Zabo. \"There are operational and regulatory barriers, but in many cases, it comes down to mindset. People are hanging on to old narratives about crypto and bitcoin and that mindset penetrates to the upper echelons of those organizations.\"","Paxos co-founder and CEO Chad Cascarilla told The Block in an interview that a wide range of clients are interested in leveraging the firm's infrastructure to launch crypto services, adding that the ease would make it a no-brainer for a firm looking to expand its client base.&nbsp;","\"Blockchain is open to anyone so anyone can interact with it and build on it, but you can get up and running very easily in a low touch, lightweight way,\" he said of the new offering.&nbsp;","The company said it is prepared to scale its own internal exchange itBit to reliably serve clients — ranging from banks to fintechs–with their own client-bases topping the tens of millions and the hundreds of millions.&nbsp;","From the perspective of a fintech client, Revolut head of crypto Ed Cooper told The Block in an interview that Paxos' business model makes a lot of sense given the demand for crypto services.&nbsp;","\"When there is a gold rush, sell spades,\" he said. Cooper said Revolut plans to differentiate by allowing U.S. users to invest in crypto via its spare change round-up service.","Still, not everyone is on the bitcoin train, at least for now. While companies like PayPal are reportedly eying the market, others like Public, the newbie stock trading venue, and Acorns, the popular investing app, are staying away from diving into crypto in the near term.&nbsp;","",""],"hashtag":["FINTECH"]}