{"summary":"Coinbase is set to store more corporate and customer USDC balances on Base, the Ethereum layer 2 it incubated.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284966\/coinbase-usdc-balances-base-tvl-1b-usd","publishDate":"2024-03-27T04:07:27","id":277,"type":null,"title":"Coinbase tp store more USDC balances on Base as TVL tops $1 billion","category":["LAYER 2S AND SCALING"],"content":["Coinbase plans to store more corporate and customer USDC balances on Base, the Ethereum Layer 2 it incubated, which is built on the open-source OP Stack.","\"This enables us to manage and secure customer funds with lower fees and faster settlement times, with no impact to the Coinbase user experience,\" Max Branzburg, Coinbase VP and Head of Consumer Products <a href=\"https:\/\/twitter.com\/maxbranzburg\/status\/1772716138499039612\" data-v-f87c67ca=\"\">shared<\/a> on X.","\"We are excited to continue to move our business onchain and hope other companies will follow our lead,\" he added.","The move has largely been seen as a positive one, with Base contributor Jesse Pollak <a href=\"https:\/\/twitter.com\/jessepollak\/status\/1772716596240208118\" data-v-f87c67ca=\"\">responding<\/a> that it is \"based\" and that they're \"excited to keep supporting Coinbase moving onchain.\"","Base itself has seen <a href=\"https:\/\/www.theblock.co\/post\/284601\/aerodrome-base-tvl\" data-v-f87c67ca=\"\">a surge in total value locked<\/a>. User deposits have topped $1 billion, per <a href=\"https:\/\/defillama.com\/chain\/Base\" data-v-f87c67ca=\"\">data<\/a> from Defi Llama. The L2's TVL is now more than double what it was at the start of the month, when $470 million was recorded onchain.","As The Block reported yesterday, decentralized exchange <a href=\"https:\/\/www.theblock.co\/post\/284601\/aerodrome-base-tvl\" data-v-f87c67ca=\"\">Aerodrome<\/a> accounts for the lion's share of Base's TVL after surging since early February.","Transaction counts on Base have surged more significantly than on other optimistic rollups, although Arbitrum has also experienced a significant surge. Meanwhile, OP Mainnet’s daily transaction count has seen a more muted increase.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/optimistic-rollups\/transaction-count-daily-7dma\/embed\" title=\"Transaction Count on Optimistic Rollups (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Max Branzburg","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Defi Llama","content":"LOCATION"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Coinbase VP","content":"ORGANIZATION"},{"type":"Jesse Pollak","content":"PERSON"},{"type":"OP Mainnet","content":"ORGANIZATION"},{"type":"$470 million","content":"MONEY"},{"type":"Arbitrum","content":"PERSON"}],"hashtag":[],"authors":["Adam James","The Block"]}