{"summary":"Coinbase has said that it prevented little over 1,100 customers from sending 30.4 bitcoin to Twitter hackers last week \nAt least five crypto platforms, including Binance, Coinbase and BitPay, are said to have interacted with hackers’ addresses \nA Binance spokesperson told The Block: “A small amount of BTC (equivalent to about $10) was sent to a Binance core wallet address”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/72200\/coinbase-says-it-prevented-over-1000-customers-from-sending-280000-worth-of-bitcoin-to-twitter-hackers","publishDate":"2020-07-20T08:50:37","id":2770,"type":null,"title":"Report: Coinbase prevented customers from sending ~$280k of bitcoin to hackers","category":["Bitcoin"],"content":["Crypto exchange Coinbase has said that it prevented little over 1,100 customers from sending bitcoin to Twitter hackers who <a href=\"https:\/\/www.theblockcrypto.com\/post\/71906\/twitter-account-hacks-timeline\" data-v-f87c67ca=\"\">hijacked<\/a> high-profile accounts to advertise a bitcoin scam last week.","If Coinbase didn't take the step, these customers would have collectively sent 30.4 bitcoin (currently worth about $278,000) to hackers, the exchange's chief information security officer, Philip Martin, <a href=\"https:\/\/www.forbes.com\/sites\/billybambrough\/2020\/07\/19\/exclusive-twitter-hackers-could-have-stolen-a-whole-lot-more\/#79d87f8f2f84\" data-v-f87c67ca=\"\">told<\/a> Forbes. Notably, this amount is more than twice the <a href=\"https:\/\/www.elliptic.co\/our-thinking\/insights-from-elliptic-twitterhack-and-bitcoin-money-laundering\" data-v-f87c67ca=\"\">actual amount<\/a> ($121,000) that hackers collected via victims. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nDespite Coinbase's action, its 14 customers still fell prey to the scam and sent around $3,000 worth of bitcoin to hackers before the exchange blacklisted their addresses, said Martin.","Gemini, Kraken, and Binance users also tried sending bitcoins to the addresses, but not as much as Coinbase's customers, per the report. All these exchanges moved to block the addresses as soon as the scam came to light.","The wide-spread attack took place on Wednesday on Twitter, which saw <a href=\"https:\/\/www.theblockcrypto.com\/linked\/72122\/twitter-says-130-accounts-were-targeted-in-wednesdays-attack\" data-v-f87c67ca=\"\">130 accounts<\/a> under its control, including those owned by major figures like Barack Obama, Bill Gates and Elon Musk.","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Following the bitcoin<\/strong><\/span>","According to blockchain analytics firms, some of the stolen bitcoin has moved to some exchanges and bitcoin mixers like Wasabi Wallet.","\"We can see very small amounts going to known, regulated crypto exchanges,\" <a href=\"https:\/\/blockchaingroup.io\/twitter-hack-update-over-13000-moving-to-known-exchanges\/\" data-v-f87c67ca=\"\">Elliptic<\/a>'s co-founder and chief scientist Tom Robinson told The Block. He declined to disclose the names of the exchanges for confidentiality reasons. Robinson further said that 2.89 bitcoin, or 22% of the total amount, was also sent to <a href=\"https:\/\/www.theblockcrypto.com\/linked\/72067\/elliptic-twitter-hack-bitcoin-tracing\" data-v-f87c67ca=\"\">Wasabi Wallet<\/a> for mixing purposes.","Another blockchain analytics firm Whitestream told The Block that one of the hackers' addresses has interacted with at least three crypto platforms. \"We can see that one address was interacted with addresses that related to several digital currency payment processors --CoinPayments, Coinbase, and BitPay,\" Itsik Levy, co-founder and CEO of Whitestream told The Block.","Indeed, a BitPay spokesperson confirmed to The Block: \"BitPay confirms a purchase occurred at one of its merchants in the amount of $25 in May 2020 from one of the Twitter hacker’s addresses. As part of BitPay’s standard process and procedure, available details are being shared with appropriate parties including law enforcement.\"","CoinPayments declined to comment to The Block, while Coinbase did not return requests for comment.","<a href=\"https:\/\/blockchaingroup.io\/twitter-hack-update-over-13000-moving-to-known-exchanges\/\" data-v-f87c67ca=\"\">Blockchain Intelligence Group<\/a>, on the other hand, said some of the stolen bitcoin also got sent to Binance.","Indeed, a Binance spokesperson confirmed to The Block that \"a small amount of BTC (equivalent to about $10) was sent to a Binance core wallet address. It seems they [hackers] made the move to confuse blockchain researchers.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAccording to The Block Research, Kraken and Binance-acquired Indian crypto exchange WazirX also received some portion of the stolen bitcoin."],"hashtag":["BINANCE","BITCOIN","COINBASE","HACKS","TWITTER"]}