{"summary":"The SEC urged a federal judge to reject Coinbase&#x27;s bid to dismiss the lawsuit, saying there were &quot;fatal flaws in its legal arguments.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/254709\/coinbase-cries-foul-seeks-to-blame-sec","publishDate":"2023-10-04T07:38:44","id":2772,"type":null,"title":"&#x27;Coinbase cries foul and seeks to blame the SEC,&#x27; regulator pushes back","category":["REGULATION"],"content":["In the ongoing legal tussle between the U.S. Securities and Exchange Commission and crypto exchange Coinbase over alleged securities law violations, the SEC urged a federal judge to reject Coinbase's bid to dismiss the suit, saying there were \"fatal flaws in its legal arguments.\"","“Coinbase cries foul and seeks to blame the SEC for its current legal predicament,” the SEC wrote in a court <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.nysd.599908\/gov.uscourts.nysd.599908.69.0.pdf\" data-v-f87c67ca=\"\">filing<\/a> yesterday. “It contends the SEC blessed Coinbase’s violative conduct when Coinbase went public, and that the SEC in any case lacks authority to regulate securities transactions that involve crypto assets.”","The <a href=\"https:\/\/www.theblock.co\/post\/235463\/former-sec-advisor-legal-doctrine-could-end-genslers-crypto-crackdown\" data-v-f87c67ca=\"\">major questions doctrine<\/a> — a principle that suggests courts believe Congress doesn't hand over major political or economic matters to executive agencies for decision-making, which Coinbase argues applies to the case — does not require a different result either, the securities regulator argued.","Central to the legal battle is interpreting the Howey test, a key precedent in securities law. Coinbase holds a narrower view, suggesting that crypto trades on its platform don't qualify as investment contracts as there’s no contract. The SEC argues for a broader, more flexible interpretation, believing the Howey test should encompass a wide range of securities, including certain crypto assets.","\"No court ever has held a formal contract is a prerequisite,\" the SEC stated in Tuesday’s filing. \"This lawsuit cannot really come as a surprise to Coinbase. It has known all along that a crypto asset bought and sold on its trading platform is a security if it meets the Howey test.\"","Coinbase's Chief Legal Officer Paul Grewal <a href=\"https:\/\/x.com\/iampaulgrewal\/status\/1709317024516817068?s=20\" data-v-f87c67ca=\"\">responded<\/a> on X (formerly Twitter), saying it was more of the “same old, same old” from the SEC. “The assets we list on our platform are not securities and are not within the SEC’s jurisdiction. Court decisions over the past several months have made that plain,” he wrote. “The SEC’s arguments today would mean that everything from Pokemon cards to stamps to Swiftie bracelets are also securities,” Grewal added.","Coinbase asked the judge to <a href=\"https:\/\/www.theblock.co\/post\/243262\/coinbase-cites-ripple-case-in-motion-to-dismiss-sec-lawsuit\" data-v-f87c67ca=\"\">dismiss the case<\/a> in August, citing <a href=\"https:\/\/www.theblock.co\/post\/235926\/sec-lawsuit-over-whether-xrp-is-a-security-will-go-to-trial\" data-v-f87c67ca=\"\">Ripple’s partial victory<\/a> over the agency — ruling that XRP sales to retail investors did not break securities laws. The SEC’s effort to classify “a simple asset sale as a security is an unprecedented stretch,” and the judge’s decision in the Ripple case bolsters that argument, Coinbase said at the time.","Grewal said Coinbase would file its reply on Oct. 24.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Grewal","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Howey","content":"PERSON"},{"type":"Oct. 24","content":"DATE"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"XRP","content":"ORGANIZATION"},{"type":"Paul Grewal","content":"PERSON"},{"type":"August","content":"DATE"}],"hashtag":["COINBASE","LAWSUITS","SEC"],"authors":["James Hunt","The Block"]}