{"summary":"The Wave Field Community scammers defrauded approximately $30 million\nScam victims protest in front of China mainland R&D facility connected to TRON; police are called on scene\nTRON issues response addressing the accusations regarding its inaction to stop The Wave Field Community scam","author":["Carol Gaszcz","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/30380\/tron-responds-to-accusations-of-inaction-following-wave-field-community-scam","publishDate":"2019-07-08T13:12:24","id":2772,"type":null,"title":"TRON responds to accusations of inaction following Wave Field Community scam","category":["Asia"],"content":["TRON has issued <a href=\"https:\/\/medium.com\/@Tronfoundation\/the-wave-field-community-scam-and-our-response-55631a6b2df1\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a response<\/a> to the earlier protests that took place in front of Raybo, a Beijing-based research and development centre associated with the company.","The protesters, who are victims of the Wave Field Community scam, have accused the company of not doing enough to protect them from copy-cat scammers. Following the appearance of what seemed to be police officers at Raybo's offices, some speculated the company was raided by the law enforcement officials. However, according to the statement, Raybo itself called for police intervention in order to assure the safety of its employees.&nbsp;","According to the official statement, although TRON officials offer their sympathy to the victims, they are against “acts of violence” caused by events “not in its direct control.”","The Wave Field Super Community scam was set up in January 2019. It gained popularity because it referenced the Chinese version of TRON’s name—“Wave Field.” The victims were promised high returns on investment, and due to the MLM model, the fraudulent business quickly gained traction.","By the time the Ponzi scheme closed at the end of June, it managed to defraud <a href=\"https:\/\/www.hecaijing.com\/article\/show\/15622079876531529.html\" data-v-f87c67ca=\"\">almost $30 million<\/a> (200 million CNY) from investors. The money has been transferred out of the company’s account, leaving victims without a dime. The scammers are said to be on the run.&nbsp;","The Wave Field Super Community victims say TRON CEO Justin Sun should have denounced the fraudsters himself instead of sitting idle. Sun has recently issued a reminder that TRON would <a href=\"https:\/\/twitter.com\/justinsuntron\/status\/1147051946311766016\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">never ask investors to send it money<\/a>.&nbsp;","In the statement, TRON also reminded investors that it has issued warnings against potential pyramid schemes and scams that offer investors quick gains. It also states it had previously warned investors about these schemes.","“In regards to reports of TRON’s inaction specifically regarding the Wave Field Super Community scam, in January after learning of the Wave Field Super Community and that it had been attracting investors in the name of TRON, TRON warned investors on its WeChat messaging group, Wei Bo official channels — Wei Bo and Dou Yin, etc. — to beware of potentially fraudulent schemes. The company posts similar warnings in its English-language territories and has a Community team that operates across the globe to answer investor questions and listen to problems.”","What's more, ever since TRON learned of the existence of the Wave Field Super Community, Raybo’s officials have been seeking a cease-and-desist order against the company so that it would not be able to use any name relating to TRON. TRON has also reported the company to the authorities."],"hashtag":[]}