{"summary":"A bug in the OpenSea marketplace led to at least 42 NFTs getting sent to a burn address.\nThis means they can no longer be moved and are effectively destroyed.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/116924\/opensea-bug-destroys-100000-worth-of-nfts-including-historical-ens-name","publishDate":"2021-09-08T06:58:13","id":2773,"type":null,"title":"OpenSea bug destroys $100,000 worth of NFTs, including historical ENS name","category":["NFTs"],"content":["A bug in the NFT marketplace OpenSea has accidentally destroyed at least 42 NFTs, worth a minimum of $100,000.","The issue was first raised by the lead developer of the Ethereum Name Service (ENS), Nick Johnson, who pointed out that when he transferred an ENS name — which come in the form of NFTs —&nbsp;it went to a burn address. This means it was accidentally sent to an address that nobody controls and can no longer be moved again.","The ENS is a service that lets you associate blockchain addresses with domain names. It’s designed to make it easier to send transactions to human-readable names rather than complicated blockchain addresses.","Regarding the ENS name that was burned, Johnson stated that it was the first ENS name ever registered. The name was rilxxlir.eth, a palindrome, and while Johnson registered it with personal funds it was held by an ENS account. In order to move the ENS name so it was under his own account, he went to OpenSea to transfer it. This was when it was mistakenly sent to the burn address.","“A frantic call to OpenSea later, it transpires I was the first and apparently only victim of a bug introduced to their transfer page in the past 24 hours, which affected all ERC721 transfers to ENS names. Ownership of rilxxlir.eth is now permanently burned,” he <a href=\"https:\/\/twitter.com\/nicksdjohnson\/status\/1435381882334564353\" data-v-f87c67ca=\"\">tweeted<\/a>.","Since Johnson remains the controller of the ENS name, he is still able to modify it — in terms of the blockchain addresses that the ENS name is linked to. He's just unable to move the name itself.","Johnson then received further reports from other people who were similarly affected, and put together a list of 32 <a href=\"https:\/\/gist.github.com\/Arachnid\/4b76be3eb4b2b2b3d2c9f775ee541f17\" data-v-f87c67ca=\"\">affected transactions<\/a> involving 42 NFTs. The majority of NFTs were on the ERC-721 standard but a few used ERC-1155. He checked the floor prices of each of the NFTs (the lowest price available on the market) and totalled them up to reach $100,000.","Johnson claimed that OpenSea has now fixed the bug. OpenSea has not replied to request for comment from The Block.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to subscribe to The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/t.me\/the_block_crypto\" target=\"_blank\" rel=\"noopener noreferrer\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Telegram<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>"],"hashtag":["ETHEREUM","OPENSEA"]}