{"summary":"Digital artist Pak has launched an NFT burning platform called burn.art and a token dubbed ASH.\n“In some future NFT collections by Pak, they will choose to accept only ASH as a medium of exchange,” a Pak spokesperson told The Block.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/101419\/pak-nft-burning-platform-burn-art-token-ash","publishDate":"2021-04-12T16:00:12","id":2775,"type":null,"title":"Digital artist Pak launches NFT burning platform and token","category":["NFTs"],"content":["Digital artist Pak has launched a non-fungible token (NFT) burning platform called burn.art and a token dubbed ASH.","Sharing the news exclusively with The Block, a spokesperson for Pak and Sotheby's told The Block that <a href=\"https:\/\/twitter.com\/muratpak\/status\/1381701267773341698?s=20\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">burn.art<\/a> allows any NFT owner to burn their NFTs and obtain ASH in return. \"Burning\" refers to the process of permanently removing a crypto token from circulation, or, in this case, the NFT connected to a particular piece of digital art or media.&nbsp;","In a sense, the Pak-led project seems to be both a performance piece as well as an effort to create an art-specific digital currency. Perhaps reflecting this positioning, NFT owners willing to destroy their NFTs for ASH will be asked by burn.art: \"Which do they value more, the artwork or the token?\"","When asked why anyone would burn their NFTs, the spokesperson told The Block: \"In some future NFT collections by Pak, they will choose to accept only ASH as a medium of exchange. As a permissionless currency, ASH can take on a life of its own.\"","Any artist, auction house, or artist collective can also decide in the future if they wish to accept ASH as currency, the spokesperson added.","ASH is an ERC-20 standard token on the Ethereum network, the spokesperson said, adding that at the moment, burning NFTs on burn.art is the only method of earning ASH.","The conversion rate between an NFT and ASH will be determined by a bonding curve that balances price against available supply, though the ratio's specifics are not clear as of press time. \"The more NFTs that are burned, the fewer ASH each one will yield,\" said the spokesperson. Owners of Pak's NFTs, however, will yield \"more ASH than non-Pak NFTs,\" the spokesperson added.","<a href=\"https:\/\/www.theblockcrypto.com\/linked\/100683\/sothebys-nft-auction-pak-artist\" data-v-f87c67ca=\"\">Pak is currently selling \"The Fungible Collection\" NFTs<\/a> in collaboration with auction house Sotheby's, exclusively on Gemini's Nifty Gateway. The sale started Monday and ends on April 14.","The launch of burn.art comes just after the first Open Edition sale of The Fungible Collection. The <a href=\"https:\/\/niftygateway.com\/collections\/paksothebysauction\" data-v-f87c67ca=\"\">edition saw 19,880 units of \"Cubes\" sold<\/a>, each worth $500, making the total $9.94 million. The sale was open for 15 minutes.","Participants in The Fungible Collection sale will be able to burn their NFTs on burn.art after they are minted, i.e. after April 14, the spokesperson told The Block.","<em data-v-f87c67ca=\"\">Update: This story has been updated with the final number of \"Cubes\" sold and the total dollar amount in The Fungible Collection's Open Edition Sale.<\/em>"],"hashtag":["NIFTY GATEWAY"]}