{"summary":"Ukraine’s Ministry of Energy is considering building a bitcoin mining center to utilize the country’s nuclear power.\nThe center could reportedly be as big as two to three gigawatts.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/93572\/ukraine-considers-bitcoin-mining-center-nuclear-power","publishDate":"2021-02-03T04:30:31","id":2777,"type":null,"title":"Ukraine considers building a bitcoin mining center based on nuclear power","category":["Bitcoin"],"content":["Ukraine's Ministry of Energy is considering building a bitcoin mining center to utilize the country's excess nuclear power.","Officials of the ministry <a href=\"http:\/\/mpe.kmu.gov.ua\/minugol\/control\/publish\/article?art_id=245509904\" data-v-f87c67ca=\"\">held a discussion last week<\/a> with Yevhen Vladimirov — Ukraine's deputy energy minister for digital development, Energoatom — the country's state-owned nuclear energy company, and Hotmine — Ukraine's bitcoin mining machines manufacturer to move the proposal forward.","Vladimirov said the crypto mining center would help use Ukraine's nuclear power, increase Energoatom's profits, and help grow the government's tax kitty.","\"The idea of ​​creating a data center based on a nuclear power plant, of course, deserves attention because the Ukrainian UES [unified energy system] has unused base capacity,\" said Vladimirov. \"The constant load on nuclear power units could bring additional profit to the state-owned Energoatom and enable businesses to operate, which will also pay taxes to the domestic budget.\"","It is not clear what size the data center would be if the proposal is finalized, but <a href=\"https:\/\/www.datacenterdynamics.com\/en\/news\/ukraine-plans-huge-cryptocurrency-mining-data-centers-next-nuclear-power-plants\/\" data-v-f87c67ca=\"\">according to a report from Data Center Dynamics,<\/a> it could be between 250 and 500 megawatts, and it can also go up to 2-3 gigawatts. For context, some biggest Chinese bitcoin mining farms had about 3 gigawatts of hydropower electricity during the rainy season last year.","To move Ukraine's proposal forward, certain issues need to be ironed out first, according to Vladimirov. These include regulatory, legal, research, and calculations of required electricity, among other factors.","Hotmine is \"convinced\" that Ukraine can become one of the world's leaders in crypto mining with its affordable nuclear power generation.","For the next steps, Hotmine, Energoatom, and the Ministry of Energy will consider signing a memorandum, which will define specific measures to establish a crypto mining center.","<a href=\"https:\/\/www.theblockcrypto.com\/post\/64189\/ukraines-nuclear-power-plants-may-start-mining-cryptocurrencies\" data-v-f87c67ca=\"\">The official discussion follows a proposal from last May<\/a> when Ukraine's acting energy minister Olha Buslavets advised Energoatom to consider using excess electricity for mining cryptocurrencies.","Ukraine has recently been active in the crypto space. Last month, the country's Ministry of Digital Transformation <a href=\"https:\/\/www.theblockcrypto.com\/linked\/89987\/cbdc-ukraine-stellar-memorandum\" data-v-f87c67ca=\"\">partnered with the Stellar Development Foundation<\/a> to develop the virtual assets ecosystem and a central bank digital currency of Ukraine. Last year, the ministry <a href=\"https:\/\/www.theblockcrypto.com\/post\/64189\/ukraines-nuclear-power-plants-may-start-mining-cryptocurrencies\" data-v-f87c67ca=\"\">said<\/a> it wouldn't regulate the crypto mining industry because it is already self-governed by blockchain consensus rules."],"hashtag":["BITCOIN"]}