{"summary":"Ripple has reported its lowest ever XRP sales in Q1 of 2020\nThe firm’s XRP sales declined by 87% in the quarter as compared to Q4 2019 \nThe sharp decline is the result of a continued pause in XRP sales to crypto exchanges","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/63692\/ripple-posts-its-lowest-ever-xrp-sales-in-q1-2020","publishDate":"2020-05-01T03:50:17","id":2778,"type":null,"title":"Ripple posts its lowest ever XRP sales in Q1 2020","category":["Ripple"],"content":["Ripple has reported an 87% drop in sales of XRP during the first quarter of 2020, as compared to the previous quarter.","The blockchain payments firm sold a total of $1.75 million worth of XRP in Q1, as compared to $13.08 million in Q4 of 2019, according to an <a href=\"https:\/\/ripple.com\/xrp\/q1-2020-xrp-markets-report\/\" data-v-f87c67ca=\"\">announcement<\/a> on Thursday.","The sharp decline is the result of a drop in direct institutional sales, as well as a continued pause in Ripple’s programmatic sales, i.e. XRP sales to cryptocurrency exchanges.","Ripple said it solely focused on the over-the-counter (OTC) channel for XRP sales “in strategic regions including EMEA [Europe, the Middle East and Africa] and Asia.\"","","","<span data-v-f87c67ca=\"\">Source: Ripple<\/span>","Ripple’s XRP sales have continued to fall since Q3 2019 when it paused programmatic sales. In Q4 2019, the total XRP sales <a href=\"https:\/\/www.theblockcrypto.com\/post\/53835\/ripples-xrp-sales-declined-by-80-in-q4\" data-v-f87c67ca=\"\">declined<\/a> by 80%.","Until Q2 2019, programmatic sales accounted for the majority of Ripple's sales volumes. But the firm decided to part away with these sales because of reports of inflated volumes.","“Ripple continues to evaluate its benchmarks given challenges, such as fake volume, that continue to persist in the industry,” the firm said earlier this year.","<strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Lowest ever XRP sales<br data-v-f87c67ca=\"\">\n<\/span><\/strong>Ripple’s Q1 2020 sales are the lowest ever since it started announcing these numbers in Q4 of 2016, according to The Block's research.","","","While the XRP sales declined sharply, the price of XRP fell slightly by around 9% during the first quarter to $0.1763, as compared to $0.1928 in the previous quarter.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","Global trading volumes of XRP, on the other hand, increased by 72% in Q1 2020 to $29.68 billion as compared to $17.24 billion in Q4 2019.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","\"Customers continue to see the value of XRP through significant cost-savings by eliminating the need to pre-fund international accounts. From Q4 2019 to Q1 2020, RippleNet’s On-Demand Liquidity (ODL) service tripled in transaction volume, and the dollar value transacted increased by more than 294%,\" said Ripple. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe ODL solution leverages XRP to settle cross-border payments.&nbsp;"],"hashtag":["XRP"]}