{"summary":"Vauld says it complied with a summons by Indian regulators and is disappointed by the asset freeze imposed on the crypto lender.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/163386\/vauld-says-it-disagrees-with-asset-freeze-order-by-indian-authorities","publishDate":"2022-08-13T06:19:51","id":2779,"type":null,"title":"Vauld says it disagrees with asset freeze order by Indian authorities","category":["LEGAL"],"content":["Embattled Asian crypto lender Vauld says it “respectfully disagrees” with the recent freezing of some of its assets by Indian authorities, the company said in a news <a href=\"https:\/\/www.vauld.com\/blog\/press-release-13-08-2022\/\" data-v-f87c67ca=\"\">release<\/a> on Saturday.","India’s Enforcement Directorate (ED) froze 3.7 billion rupees ($46 million) of the company’s assets, <a href=\"https:\/\/www.theblock.co\/post\/163329\/indian-authorities-freeze-46-million-worth-of-vaulds-assets\" data-v-f87c67ca=\"\">as previously reported by The Block<\/a>. The financial crimes investigator said the asset freeze was in connection with a money laundering case.","Vauld’s statement said that the crypto lender had received and obeyed the ED summons to provide certain documents to investigators. It added that the freeze order was in connection with an account belonging to a former customer of the platform that had since been deactivated. Vauld also said that it follows strict customer identification protocols and expressed disappointment at the enforcement action.","“We are seeking legal advice on our best course of action in order to protect the interests of the company, its customers, and all the stakeholders. We have fully cooperated with the Enforcement Directorate and will continue to extend our cooperation to ensure we continue to remain a safe place for customers to transact and own cryptocurrencies,” today’s announcement said.","Vauld is one of the many crypto lenders currently facing a liquidity crisis. The company ceased customer withdrawals in July and <a href=\"https:\/\/www.theblock.co\/post\/158647\/crypto-lender-vauld-owes-363-million-to-retail-investors-after-halting-withdrawals\" data-v-f87c67ca=\"\">owes $402 million to its creditors<\/a>. The crypto lender has received a <a href=\"https:\/\/www.theblock.co\/post\/160510\/vauld-gets-three-month-moratorium-extension-to-continue-exploring-options\" data-v-f87c67ca=\"\">three-month moratorium<\/a> from a Singapore High Court as it seeks a path forward to resolve its financial problems.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Vauld","content":"ORGANIZATION"},{"type":"India’s Enforcement Directorate (ED","content":"ORGANIZATION"},{"type":"Singapore High Court","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$46 million","content":"MONEY"},{"type":"3.7 billion rupees","content":"MONEY"},{"type":"Enforcement Directorate","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"$402 million","content":"MONEY"},{"type":"Saturday","content":"DATE"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}