{"summary":"The creators of Lens Protocol have introduced a beta version of Bonsai, a blockchain scaling solution for decentralized social media.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228380\/lens-protocol-bonsai-scaling-solution","publishDate":"2023-04-26T13:00:33","id":2780,"type":null,"title":"Lens Protocol rolls out Bonsai blockchain to scale social media","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">The creators of Lens Protocol have introduced a beta version of Momoka (previously Bonsai), a blockchain scaling solution, as the blockchain-based social media project gears up to handle an increased volume of transactions for users of Lens-based decentralized apps.<\/span>","<span data-v-f87c67ca=\"\">Aave Companies, the development firm responsible for Lens Protocol, announced that Momoka was specifically engineered to facilitate the scaling of decentralized social media applications, enabling the processing of numerous transactions with minimal associated costs.<\/span>","<span data-v-f87c67ca=\"\">Scalability is a significant issue for decentralized social media, as such products are both data-intensive and involve a high throughput of transactions. Blockchains typically struggle with both of these issues. <a href=\"https:\/\/www.lens.xyz\/\" data-v-f87c67ca=\"\">The team<\/a> built Momoka in response.<\/span>","<span data-v-f87c67ca=\"\">\"To be competitive with web2, decentralized social platforms must scale. With the ability to support mass consumer adoption, we'll see continued web3 innovation — new, exciting and compelling features and business models that will spur web3 adoption,\" said Stani Kulechov, CEO of Aave and founder of Lens Protocol. \"Bonsai (Momoka) provides hyperscalability that supports blockchain's core values and guarantees, delivering secure, fast and cost-effective scalability.\"<\/span>","<span data-v-f87c67ca=\"\">Lens Protocol<\/span><span data-v-f87c67ca=\"\">&nbsp;is a social graph that offers a software stack to build <a href=\"https:\/\/www.theblock.co\/post\/147337\/aaves-backbone-for-decentralized-social-media-lens-protocol-goes-live-on-polygon\" data-v-f87c67ca=\"\">decentralized competitors to social media giants<\/a> like Twitter and Facebook. <a href=\"https:\/\/www.theblock.co\/linked\/133390\/aave-officially-debuts-protocol-for-decentralized-social-media-dubbed-lens\" data-v-f87c67ca=\"\">Launched on Polygon<\/a> in May 2022, there are over 110,000 social media profiles and hundreds of applications on Lens.<\/span>","<span data-v-f87c67ca=\"\">Lens Protocol aims to achieve censorship resistance for social media apps and help them unlock new forms of<\/span><a href=\"https:\/\/www.theblock.co\/post\/147337\/aaves-backbone-for-decentralized-social-media-lens-protocol-goes-live-on-polygon\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">content monetization<\/span><\/a><span data-v-f87c67ca=\"\"> with NFTs, as well as other crypto assets. These include apps such as Lenster, Lens Booster, Phaver, Lenstube, LensPort, Memester and others.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">To help such apps scale to a large number of users, Momoka will optimize cost and scalability by storing transactions off-chain data availability layer in such a way as they remain accessible and verifiable. This way it can potentially avoid the limitations of block space on Ethereum and other blockchains, Aave Companies explained.<\/span>","<span data-v-f87c67ca=\"\">&nbsp;Momoka will process most transactions off-chain, relying on its data-availability layer. Additionally, it will have a verifier component to help validate user transactions on-chain. Data availability is essential for scaling solutions like Momoka because it ensures that off-chain data remains accessible and verifiable when needed for on-chain settlement, dispute resolution or audits.<\/span>","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Update:<\/strong> Lens Protocol has <a href=\"https:\/\/www.theblock.co\/post\/228787\/lens-protocol-renames-scaling-solution-bonsai\" data-v-f87c67ca=\"\">renamed<\/a> the Bonsai scaling solution to Momoka.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Phaver","content":"LOCATION"},{"type":"LensPort","content":"LOCATION"},{"type":"Momoka","content":"ORGANIZATION"},{"type":"May 2022","content":"DATE"},{"type":"Lenstube","content":"LOCATION"},{"type":"Momoka","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Momoka","content":"PERSON"},{"type":"Aave Companies","content":"ORGANIZATION"},{"type":"Lenster","content":"LOCATION"},{"type":"Stani Kulechov","content":"PERSON"}],"hashtag":["DECENTRALIZED INFRASTRUCTURE","DECENTRALIZED SOCIAL MEDIA","LENS","POLYGON"],"authors":["Vishal Chawla","The Block"]}