{"summary":"BlockFi filed for bankruptcy protection this week.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/190660\/blockfi-has-355-million-in-digital-assets-frozen-on-ftx","publishDate":"2022-11-29T13:01:31","id":2786,"type":null,"title":"BlockFi has $355 million in digital assets ‘frozen’ on FTX ","category":["LEGAL"],"content":["Troubled crypto lender BlockFi has $355 million in digital assets frozen on FTX’s platform, the company said in court.","BlockFi attorney Joshua Sussberg also shared new details about how closely intertwined BlockFi’s finances were with FTX and the company's sister trading firm, Alameda Research.","“In addition to the loan arrangement, and the $275 million that was drawn, BlockFi acted as a lender to Alameda, which is an FTX trading subsidiary, and they also had crypto on the FTX platform,” Sussberg said in court. “Specifically, BlockFi had $671 million in outstanding loans that are defaulted to Alameda and $355 million in digital assets that, unfortunately, are now frozen on the FTX platform.”","BlockFi filed for bankruptcy protection this week, becoming the latest firm to face financial turmoil after the collapse of one of the world’s largest crypto exchanges.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","FTX, once valued at $32 billion, filed for bankruptcy protection in Delaware earlier this month. The firm had given BlockFi a $275 million loan earlier this year, and was listed as BlockFi’s second-largest creditor in bankruptcy filings.","BlockFi also has a considerable amount of cash stuck on FTX, a lawyer for the firm said in a New Jersey courtroom. BlockFi has $355 million in digital assets that are “frozen” on the platform, according to Sussberg.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","In a letter sent to BlockFi customers, the company noted that the court “approved multiple motions that will<br data-v-f87c67ca=\"\">\nenable BlockFi to continue core operations during this process, including granting us the authority to pay our critical vendors and&nbsp; employee wages.”","As recently happened in the FTX bankruptcy case, the presiding judge agreed to keep BlockFi's creditors anonymous on a temporary basis. The recent disclosure of customer asset claims in the bankruptcy of digital asset lending company Celsius caused a brief uproar among members of the privacy-conscious crypto community, though identifying who is owed what in court is a standard bankruptcy proceeding.","The U.S. government has argued that non-individual creditors should be publicly identified in the FTX case, and another hearing on the matter, which could be a guiding post with what happens in BlockFi's proceedings, will take place in mid-December.BlockFi also plans to ask the court for approval to restore customer withdrawals, and said it plans to work with an unsecured creditors committee that will be formed “over the next few weeks.”","<em data-v-f87c67ca=\"\">Update: This story has been updated with additional information about BlockFi's finances and relationship with Alameda Research.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$275 million","content":"MONEY"},{"type":"$32 billion","content":"MONEY"},{"type":"mid-December","content":"DATE"},{"type":"$671 million","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Delaware","content":"LOCATION"},{"type":"earlier this month","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"New Jersey","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Sussberg","content":"PERSON"},{"type":"$355 million","content":"MONEY"},{"type":"Sussberg","content":"ORGANIZATION"},{"type":"Joshua Sussberg","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"}],"hashtag":[],"authors":["Stephanie Murray","Kristin Majcher","The Block"]}