{"summary":"Share trading apps in Europe and the United Kingdom are poised to launch Coinbase shares ahead of the crypto exchange’s direct listing on Nasdaq later today.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/101586\/europe-neobrokers-coinbase-trading-frenzy","publishDate":"2021-04-14T09:12:40","id":2788,"type":null,"title":"Europe’s neobrokers poised to offer trading for Coinbase shares","category":["INVESTMENTS"],"content":["Trading apps in Europe and the United Kingdom are poised to launch <a href=\"https:\/\/www.theblockcrypto.com\/post\/35381\/fed-court-says-coinbase-can-be-held-negligent-for-allowing-dysfunctional-market-and-why-this-matters\" data-v-f87c67ca=\"\">Coinbase<\/a> shares in anticipation of the crypto exchange’s direct on Nasdaq listing later today.","Representatives of London-based digital bank Revolut and neobroker Freetrade told The Block that trading in <a href=\"https:\/\/www.theblockcrypto.com\/post\/3851\/coinbases-chief-policy-officer-is-leaving-and-fannie-maes-former-general-counsel-is-taking-his-place\" data-v-f87c67ca=\"\">Coinbase<\/a> shares will be available for retail investors as soon as the company is listed. Nextmarkets, a Cologne-based neobroker, will also begin offering the stock.","“Coinbase has managed to build a product that is easy to use and properly regulated at the same time. Compliance is a crucial argument in today’s crypto world, especially for institutional investors,” said Manuel Heyden, co-founder and CEO of Nextmarkets.","Heyden said the “crypto hype” has helped Nextmarkets to run profitably during the last few quarters. The platform’s customers will be able to trade <a href=\"https:\/\/www.theblockcrypto.com\/post\/54511\/coinbase-custody-and-bison-trails-join-proof-of-stake-alliance-seeking-to-bring-tax-clarity\" data-v-f87c67ca=\"\">Coinbase<\/a> both physically, as a share via the stock exchange, as well as with leverage, he added.","Surging crypto prices coupled with slicker access to stock markets powered by apps like Robinhood may represent a perfect storm for the <a href=\"https:\/\/www.theblockcrypto.com\/post\/49099\/zerion-raises-2m-from-investors-including-placeholder-to-build-coinbase-for-defi\" data-v-f87c67ca=\"\">Coinbase<\/a> listing.","Lior Messika, founder of the investment firm Eden Block, said the listing represents a “broader, bolder adoption” of crypto. “For the first time in capital markets history, investors will have the ability to gain exposure into a growing ecosystem, not just a collection of assets,” he added.","Enhanced access to the stock market has also given retail investors – when marshaled by online communities – unprecedented power to influence share prices, as seen when the subreddit Wall Street Bets <a href=\"https:\/\/www.ft.com\/video\/3c1fa744-9de0-4398-a6cc-16e430d8a8dd\" data-v-f87c67ca=\"\">sent GameStop shares skyrocketing<\/a> earlier this year.","But Max Rothery, VP of community at finance information app Finimize, thinks that’s a good thing.","“In order to make informed investment decisions, you have to learn by doing. Giving retail investors the opportunity to participate in these zeitgeist moments can be a great learning experience,” he remarked, going on to say:","“From what we’re seeing retail investors are expecting volatility, but believe in the long-term prospects of Coinbase. As long as people don’t take undue risk, we fully support retail investors becoming shareholders in companies they believe in.”","<a href=\"https:\/\/www.theblockcrypto.com\/post\/62362\/coinbase-taps-barclays-executive-to-lead-institutional-business\" data-v-f87c67ca=\"\">Coinbase<\/a> Global Inc. will begin trading under ticker COIN later today. The shares were assigned a reference price of $250 on April 13, implying <a href=\"https:\/\/www.theblockcrypto.com\/linked\/101538\/nasdaq-sets-initial-reference-price-for-coinbases-stock-at-250\" data-v-f87c67ca=\"\">a valuation of roughly $63.7 billion<\/a>. But investors will have to wait until trading begins to get a better sense of the company’s true valuation. <a href=\"https:\/\/www.theblockcrypto.com\/post\/65227\/most-bitcoin-investors-on-coinbase-end-up-buying-altcoins-during-bull-runs-says-the-exchange\" data-v-f87c67ca=\"\">Coinbase<\/a> shares changed hands at a valuation of roughly $90 billion <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2021-03-08\/coinbase-is-said-to-be-valued-at-90-billion-in-private-auction\" data-v-f87c67ca=\"\">during a private auction<\/a> in early March.","In the United States, Robinhood is also set to offer trading in the stock, according to a person close to the company.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Coinbase<\/a> Global Inc.","content":"ORGANIZATION"},{"type":"Max Rothery","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"$90 billion","content":"MONEY"},{"type":"April 13","content":"DATE"},{"type":"Europe","content":"LOCATION"},{"type":"Manuel Heyden","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Eden Block","content":"ORGANIZATION"},{"type":"Lior Messika","content":"PERSON"},{"type":"$63.7 billion","content":"MONEY"},{"type":"Cologne","content":"LOCATION"},{"type":"London","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"United Kingdom","content":"LOCATION"},{"type":"$250","content":"MONEY"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"GameStop","content":"ORGANIZATION"}],"hashtag":["COINBASE"],"authors":["Ryan Weeks","The Block"]}