{"summary":"Cryptocurrency exchanges Coinbase, Kraken, Poloniex and Bittrex have developed a system to rate which cryptocurrencies are likely to be securities\nThe newly formed Crypto Ratings Council will publish online ratings of cryptocurrencies on a scale of 1 to 5 (5=security)\nXRP has a score of 4, while EOS, Stellar and Tezos scored 3.75. Bitcoin, Litecoin, Monero and Dai scored a perfect 1","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/41437\/coinbase-kraken-and-others-develop-a-system-to-rate-cryptos-to-determine-if-they-are-securities","publishDate":"2019-09-30T06:45:37","id":2789,"type":null,"title":"Coinbase, Kraken and others develop a system to rate cryptocurrencies","category":["Exchanges"],"content":["Cryptocurrency exchange operators, including Coinbase, Kraken, Circle (operator of Poloniex) and Bittrex, have developed a system to rate which cryptocurrencies are likely to be securities.","According to a press release shared by Coinbase with The Block on Monday, the system will help the operators to decide which cryptocurrencies to list and not to list for trading on their exchanges.&nbsp;","Via the newly formed <a href=\"https:\/\/www.cryptoratingcouncil.com\/\" data-v-f87c67ca=\"\">Crypto Ratings Council<\/a>, the operators will publish online ratings of cryptocurrencies on a scale of 1 to 5, with the highest value signifying that a token is a security, per the press release. Issuers of tokens won’t have upfront input in the ratings, although they can provide information to “dispute a score their token received,” per the WSJ <a href=\"https:\/\/www.wsj.com\/articles\/cryptocurrency-exchanges-including-coinbase-to-rate-digital-assets-11569835801?mod=rsswn\" data-v-f87c67ca=\"\">report<\/a> today.","Bitcoin (BTC) is scored as a 1 by the council, indicating that it has a very low likelihood of being a security. \"Any asset rating published by the Council is the result of a factual analysis performed by outside legal experts in conjunction with technical experts at member firms,\" said Coinbase in the release. Other members of the council include trading and custody firms such as Anchorage, DRW Holdings' Cumberland unit, Genesis Global Trading and Grayscale Investments. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nInterestingly, XRP has a score of 4, while EOS, Stellar and Tezos scored 3.75. Bitcoin, Litecoin, Monero and Dai scored a perfect 1. Below are the ratings of all the cryptocurrencies currently reviewed by the council or CRC. <br data-v-f87c67ca=\"\">\n","","“It’s our hope the SEC [the U.S. Securities and Exchange Commission] will view this as a positive step,” Mary Beth Buchanan, Kraken’s general counsel, was quoted as saying in the WSJ report. It “does show the SEC what each exchange is doing to come to a decision.”","The<a href=\"https:\/\/www.theblockcrypto.com\/tag\/sec\" data-v-f87c67ca=\"\"> SEC<\/a> has, on several occasions, charged token issuers for allegedly violating securities laws, including Kik Interactive and ICOBox. SEC Chairman Jay Clayton recently <a href=\"https:\/\/www.theblockcrypto.com\/daily\/41185\/despite-industry-confusion-around-ico-compliance-sec-maintains-federal-securities-laws-are-crypto-suited?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=default\" data-v-f87c67ca=\"\">said<\/a> that any selling of securities must play by SEC rules. “If you have an ICO [initial coin offering] or a stock, and you want to sell it in a private placement, follow the private placement rules. If you want to do any IPO with a token, come see us.”"],"hashtag":["COINBASE","KRAKEN"]}