{"summary":"Yuga Labs released its litepaper for the Otherside, a &#x27;starter guide&#x27; to its &#x27;world-building metaverse platform.&#x27;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157995\/yuga-labs-champions-openness-collaborative-development-in-otherside-litepaper","publishDate":"2022-07-17T05:39:22","id":279,"type":null,"title":"Yuga Labs champions openness, collaborative development in Otherside litepaper","category":["GAMING AND METAVERSE"],"content":["&nbsp;Non-fungible token (NFT) heavyweight Yuga Labs set out its vision for the Otherside on Saturday in a document that speaks to the direction and ethos of what will become the company's \"world-building metaverse platform.\"","\"This document serves as a starter guide for the Otherside. It covers foundational principles of the platform, capabilities of its developers, and possibilities for community co-creation,\" Yuga Labs <a href=\"https:\/\/twitter.com\/OthersideMeta\/status\/1548357412406472708\" data-v-f87c67ca=\"\">wrote on Twitter<\/a>.","<a href=\"https:\/\/otherside.xyz\/litepaper\" data-v-f87c67ca=\"\">The document<\/a> came in conjunction with Yuga Labs' tech demo, which drew thousands of Otherdeed NFT holders to try out the game before its official release.&nbsp;","Otherdeed NFTs were released in May, selling out the available 55,000 lots within <a href=\"https:\/\/www.theblock.co\/linked\/144549\/otherside-land-nfts-sell-out-in-hours-as-yuga-labs-rakes-in-317-million\" data-v-f87c67ca=\"\">three hours<\/a>. The event brought in $317 million for Yuga and was so popular it crashed the Ethereum blockchain, sending transaction fees skyrocketing. These NFTs entitle the holder to a plot of land in the game and a creature called a Koda, which lives on the land.&nbsp;","Since then, Yuga Labs has been <a href=\"https:\/\/www.theblock.co\/post\/157741\/how-online-gaming-firm-improbable-is-helping-yuga-labs-build-its-metaverse\" data-v-f87c67ca=\"\">working with UK-based game developers Improbable<\/a> on creating the online space. Yuga's litepaper asks users to consider the document as a \"stepping stone\" in its development.&nbsp;","\"It will eventually be replaced by a Codex that will continually evolve with Voyager input to share the most up-to-date information, announcements, and decisions that shape Otherside,\" it reads. \"Voyagers\" are Otherside land holders and game testers.","The game will be run from Improbable's M² (MSquared) network, which is designed to help companies create better metaverse experiences. M² supports more than 10,000 live participants with customizable avatars and advanced immersive audio, in real time, in the same space. Otherside will be one of the founding interoperable spaces on the M² network.","Yuga said that the game will include an 11-part storyline \"surrounding a mysterious Obelisk that has appeared in the Otherside universe.\"","It stresses that much of what happens in the Otherside will be user-generated, adding: \"Voyagers will play a large role in shaping the core capabilities of the platform through exclusive events, playtesting opportunities, and as co-developers of our Otherside Development Kits (ODKs).\"","It also says it will \"incentivize\" community members. Whether this will mean carrying out airdrops, a method Yuga Labs <a href=\"https:\/\/www.theblock.co\/post\/153349\/how-bored-apes-became-the-foundation-for-a-metaverse\" data-v-f87c67ca=\"\">pioneered with its Bored Ape Yacht Club collection<\/a>, remains to be seen.&nbsp;","On interoperability, a buzzword commonly used in the NFT landscape to signal genuine ownership or portability of a digital item, Yuga says that it will give users a chance to bring NFTs from other collections into its metaverse.&nbsp;","It added that the development of the platform will take an \"open, transparent, and iterative approach,\" which will allow it to course correct and change direction.&nbsp;","\"The sort of experiences we’re building have never been done before in the digital space,\" it said. \"To ensure the best possible outcome, we will frequently playtest at huge scale with Voyagers, trying out new systems, content and mechanics, and pushing Otherside’s technology to its limits together.\"","<em data-v-f87c67ca=\"\">Read more: <a href=\"https:\/\/www.theblock.co\/post\/157741\/how-online-gaming-firm-improbable-is-helping-yuga-labs-build-its-metaverse\" data-v-f87c67ca=\"\">How online gaming firm Improbable is helping Yuga Labs build its metaverse<\/a><\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Koda","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Yuga Labs","content":"ORGANIZATION"},{"type":"Yuga","content":"PERSON"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"$317 million","content":"MONEY"},{"type":"Saturday","content":"DATE"},{"type":"Otherdeed NFT","content":"ORGANIZATION"},{"type":"Voyagers","content":"ORGANIZATION"}],"hashtag":["OTHERSIDE"],"authors":["Lucy Harley-McKeown","The Block"]}