{"summary":"U.S. Treasury Secretary Janet Yellen compared FTX’s collapse to a catalyst for the 2008 global financial crisis. ","author":["Colin Wilhelm","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/191036\/ftxs-collapse-is-a-lehman-moment-for-crypto-yellen","publishDate":"2022-11-30T13:32:55","id":279,"type":null,"title":"FTX&#x27;s collapse is &#x27;a Lehman moment&#x27; for crypto: Yellen","category":["Policy"],"content":["Treasury Secretary Janet Yellen called FTX’s collapse “a Lehman moment” for the digital asset industry.","“It’s a Lehman moment within crypto, and crypto is big enough that you’ve had substantial harm of investors, and particularly people who aren’t very well-informed about the risks that they’re undertaking, and that’s a very bad thing,” Yellen <a href=\"https:\/\/www.nytimes.com\/live\/2022\/11\/30\/business\/dealbook-summit-conference\/yellen-calls-for-more-regulation-of-cryptocurrencies-after-lehman-moment?smid=url-share\" data-v-f87c67ca=\"\">said<\/a> at the New York Times’ Dealbook Summit, referencing the collapse of the Lehman Brothers bank that accelerated the 2008 global financial crisis.","“This is an industry that really needs to have adequate regulation and it doesn’t,” Yellen said. “We have consistently urged that regulatory gaps be closed and I think this experience with his firm, or set of firms, just couldn’t provide a better illustration,” she added, referring to Sam Bankman-Fried and FTX, Alameda Research and their myriad of affiliated companies. &nbsp;","Earlier this fall, the Treasury Department and the Financial Stability Oversight Council — a super committee of regulators that Yellen chairs — both recommended continued enforcement of current financial laws governing digital assets prior to the FTX collapse. That failure has only increased legal and regulatory scrutiny over the sector. The FSOC also recommended that Congress pass <a href=\"https:\/\/www.theblock.co\/post\/174527\/senior-u-s-regulators-propose-new-legislation-increased-rules-around-digital-assets\" data-v-f87c67ca=\"\">multiple new laws<\/a> to address potential gaps in regulation of crypto companies, including “regulatory arbitrage,” where firms like FTX position themselves outside traditional regulatory lanes.","Yellen echoed previous statements from banking regulators in highlighting the lack of exposure that digital assets have to the banking industry. She saw that as a positive.","“The good piece of an explosion like we saw is that it hasn’t spilled over to the banking sector; banking regulators have been very careful,” she said."],"hashtag":["CONGRESS","TREASURY DEPARTMENT"]}