{"summary":"Former chairman of the CFTC Christopher Giancarlo sat down with The Block\nHe addressed his new role at the Chamber of Digital Commerce and why he feels it’s a player in advancing policy talks\nIf 2017 was the year of crypto recognition, 2019 is the starting point of policy responses, according to Giancarlo","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/42698\/former-cftc-chair-and-crypto-dad-says-2019-is-the-year-to-get-serious-about-crypto-policy","publishDate":"2019-10-09T18:31:01","id":2792,"type":null,"title":"Former CFTC chair and &#x27;Crypto Dad&#x27; says 2019 is the year to get serious about crypto policy","category":["Regulation"],"content":["Former CFTC Chairman Christopher \"Crypto Dad\" Giancarlo left his role at the regulator this summer, but now he's stepping even further into the crypto world.","Now as a board member for the Chamber of Digital Commerce, Giancarlo is using his expertise to further policy talks across the board, not just on a CFTC\/SEC level. Giancarlo sat down with The Block to talk transitions in the regulatory space, as well as his own transition in the industry.","<b data-v-f87c67ca=\"\">The Block: <\/b><span data-v-f87c67ca=\"\">At the time of your departure from the CFTC how do you feel attitudes toward crypto have shifted from the time you took the position as chairman?<\/span>","<b data-v-f87c67ca=\"\">Giancarlo: <\/b><span data-v-f87c67ca=\"\">I think quite dramatically, one of my perspectives on the CFTC at the time I took the helm, it was inordinately backward-looking, perhaps justifiably, but inordinately. So much of its energy and attention was on completing Dodd-Frank reforms to derivative markets. And in Dodd-Frank, there's no mention about anything technological including crypto assets or blockchain, and the agency's attention was primarily drawn to that. To its credit, the agency had developed an informal working group under Jeff Bandman that was looking at emerging crypto assets, primarily bitcoin. It was that effort that I accelerated with the formation of Lab CFTC.<br data-v-f87c67ca=\"\">\n<\/span>","<b data-v-f87c67ca=\"\">The Block: <\/b><span data-v-f87c67ca=\"\">How are you looking at the EOS and Sia settlements with the SEC? Can you provide any insight into what might have gone on there?<\/span>","<b data-v-f87c67ca=\"\">Giancarlo: <\/b><span data-v-f87c67ca=\"\">One of the things I want to avoid doing is commenting on activities by the agency. I'm not the type, and don't want to be seen as the type of former chairman who is looking over the shoulder of the incoming team and commenting on them. What I would say is that it generally shows a continuing focus and attention in this space by the agencies.<\/span>","<b data-v-f87c67ca=\"\">The Block: <\/b><span data-v-f87c67ca=\"\">How have you seen the attitudes of regulatory bodies shift in recent years? What is the current attitude characterized by?<\/span>","<b data-v-f87c67ca=\"\">Giancarlo: <\/b><span data-v-f87c67ca=\"\">2017 I think was the year that regulators really woke up to the accelerating pace of crypto assets because of the bitcoin bubble. I would say 2019 is the year in which there's a growing recognition that regulators and policy makers need to do more than just be aware of these, but may actually need to look at some policy responses. And I think the thing driving that in 2019 is a combination of Libra and the prospects for central bank digital currencies.<br data-v-f87c67ca=\"\">\n<\/span>","<b data-v-f87c67ca=\"\">The Block: <\/b><span data-v-f87c67ca=\"\">Looking at recent developments, we saw Regulation A+ emerge as a possibly compliant way forward for some companies. What is your take on that innovation, and what other innovations can we perhaps expect to see?<\/span>","<b data-v-f87c67ca=\"\">Giancarlo: <\/b><span data-v-f87c67ca=\"\">I think that it shows that the SEC under Jay Clayton is moving beyond just getting smarter and more aware, but actually thinking about some of the policy responses.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">The Block: <\/b><span data-v-f87c67ca=\"\">I understand you’ve said you’re not interested in looking over new leadership’s shoulder, but members of the SEC have said they feel federal securities laws adequately tackle digital assets because they are technology agnostic. Do you see the legislation as operating fully for the digital assets space?<\/span>","<b data-v-f87c67ca=\"\">Giancarlo: <\/b><span data-v-f87c67ca=\"\">I would go further afield than just SEC\/CFTC specific. I do think the time has come for thoughtful consideration of a digital dollar. I think that the dollar's status as the world's primary reserve currency should be enhanced with a digital component and done in a way that doesn't have to disintermediate the traditional banking system but can be done so traditional finance financial intermediaries can play a role in a digital component to the dollar. I don't see the Federal Reserve becoming a deposit-taking institution, but where banks would continue to do that, but would use a uniform set of technology protocols in order to provide access to a digital dollar format. <br data-v-f87c67ca=\"\">\n<\/span>","<b data-v-f87c67ca=\"\">The Block: <\/b><span data-v-f87c67ca=\"\">Looking into some of your ventures now, I understand you've joined the Chamber of Digital Commerce.<\/span>","<b data-v-f87c67ca=\"\">Giancarlo: <\/b><span data-v-f87c67ca=\"\">Yes. I've been very impressed with their work over the past several years in serving as a sort of a go-between. There's this FinTech phase of innovation and policymakers helping to both translate the technology into concepts and things that policymakers can understand and interact with and giving policy makers a similar ability to interact with the innovators. And so I think with the chamber, almost uniquely, I think provides a very good interface between the world of Washington and the world of financial innovation. <br data-v-f87c67ca=\"\">\n<\/span>","<b data-v-f87c67ca=\"\">The Block: <\/b><span data-v-f87c67ca=\"\">I remember I read somewhere when you joined that you were looking to streamline and modernize the regulatory landscape. Which areas are you specifically immediately looking to streamline and modernize in your role on the board?<\/span>","<b data-v-f87c67ca=\"\">Giancarlo: <\/b><span data-v-f87c67ca=\"\">As a former chairman, I will leave the new leadership to focus on CFTC-related matters, and I have every confidence in the leadership of the SEC to do that. But there's a need for policy makers and innovators to come together to lay down a policy framework upon which these innovations can move forward with greater regulatory and legal certainty. A good example, although not a perfect analogy, is the period during the Clinton Administration when a Republican Congress and the Democratic administration came together to develop the foundation for the first phase of the internet revolution, the digitalization of information.<\/span>","<span data-v-f87c67ca=\"\">It's a do-no-harm approach that allowed for very rapid innovation and global leadership. The reason why it's not a perfect precedent is because digitization of information is a process that certainly falls into a regulatory light zone because of the First Amendment restrictions on regulation of speech. When it comes to financial areas, that's always been a regulatory heavy zone. Some of the same precedents don't apply, but what I think should apply is that same commonality of purpose between policy makers and innovators to want to create a regulatory and policy foundation upon which innovation can proceed in a way that is, intelligent, that's thoughtful, aware of policy concerns, whether it be about privacy, whether it be about appropriate anonymity, whether it'd be about regulatory transparency,or for oversight where we can make sure that the right policy imperatives are brought to bear and yet a framework that can bring certainty to innovators so that they can move forward with innovation, and knowing the consequences of decisions they make.<\/span>","<span data-v-f87c67ca=\"\">So what I hope to do in my post-CFTC life is be an advocate for sound policy development. Not CFTC or SEC specific, but across the board where I can use skills I have as a communicator and an advocate for innovation in a well-regulated environment, and with relationships I build, hopefully help communicate that message for the need for sound policy here in the U.S. So that once again the U.S. can emerge as a leader in this new phase of the digitization of our modern world, digitization of finance in this case.<\/span>","<b data-v-f87c67ca=\"\">The Block: <\/b><span data-v-f87c67ca=\"\">You’ve been affectionately dubbed \"Crypto Dad\" by the industry. How do you feel that title came about and where did this generosity towards digital assets stem from, especially in a regulatory environment some consider hostile towards the digital asset world?<\/span>","<b data-v-f87c67ca=\"\">Giancarlo: <\/b><span data-v-f87c67ca=\"\">So the title came about out of that February, 2018 hearing that chair Clayton and I did before the Senate Banking Committee. We had been asked to testify on Bitcoin and crypto assets. We’d prepared a lengthy written testimony to Congress, and the night before, I was preparing my oral remarks and I looked at this 60-plus page, 100-footnote document and said, you know, I cannot summarize that in five minutes. I went in the next morning and when I was asked to speak in my opening address, I actually put the paper down and said, look, you've got my written submission. What I want to do is speak to you for a moment not as a chairman of a regulatory agency, but as a father, as a dad. I explained that I had just come back from our annual family ski trip with my children and my nieces and nephews and at the dinner table every night all they wanted to talk about was Bitcoin.<\/span>","<span data-v-f87c67ca=\"\">My children grew up in a financial family. I've worked on Wall Street for my career and I've tried to interest my kids in the stock market since they were young, and they had no interest in it and suddenly they're very, very interested in Bitcoin. And some of my nieces, in fact, one of my nieces was a bitcoin holder. I said to Congress, I noticed some of your heads are nodding, some of you probably have the same conversations. I said, it strikes me that we owe it to this generation to treat their interest in this new asset class not with derision and disdain, but with respect. If nothing else, we owe it to them to get the policy right so that they're not prey to fraud and misappropriation, but more that they can build a framework upon which they can build this new structure.<\/span>","<span data-v-f87c67ca=\"\">And it was from that my Twitter account exploded and I was dubbed Crypto Dad. It's something that was unexpected, delightful at the same time, but more importantly, I think it showed that I stumbled onto something. We have a generation that came of age in a financial crisis when all of the traditional institutions that were supposed to provide stability and certainty seem to have fumbled, and in some cases failed. I think there is a generational interest here that is not going away, is not worthy of being dismissed, but should be taken seriously. I take it seriously, and I must say that, in the early days of the internet, and I'm old enough to have been around them, the same people dismissing crypto assets now were dismissing the internet as good-for-nothing other than access to pornography. It was dismissed as a fad that would fade. Well in fact you can't even hail a taxi today without using an internet app. Our whole world has been dramatically changed in many cases for the better by the internet. What I called it, the digitalization of information, well now we're on the digitalization of assets, the digital tokenization of a value, and it’s as fundamental a change as the early internet was. <br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">I think for the adults in the room the choice is to put down solid policy frameworks upon which this new phase of digitalization can be built or to do nothing and see jurisdictions that put down solid policy foundations become the leaders in innovation. I don't want to see the U.S. left behind. I want to see the U.S. do what it's traditionally done in the face of technological revolution. And that is take a leadership role. I think that's achievable if we put down the right policy prescriptions, and that's why I'm pleased to join the Chamber of Digital Commerce, because it advocates for solid policy foundations and does a great job of putting the right experts forward and engaging the right communications with policy makers to maximize the opportunities. So if Crypto Dad can answer that effort, then I'm delighted to do so.<\/span>"],"hashtag":["CFTC","SEC"]}