{"summary":"Bitcoin miner Bitfarms paid down part of a $100 million loan with the sale of 3,000 bitcoin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/153294\/bitfarms-gives-up-3000-btc-to-pay-down-100-million-loan-from-galaxy-digital","publishDate":"2022-06-21T14:15:28","id":2793,"type":null,"title":"Bitfarms gives up 3,000 BTC to pay down $100 million loan from Galaxy Digital","category":["MINING"],"content":["<span data-v-f87c67ca=\"\">Bitcoin miner Bitfarms paid down a $100 million bitcoin-backed loan with the sale of 3,000 BTC in the last week while securing an additional $37 million facility collateralized by mining machines.<\/span>","<span data-v-f87c67ca=\"\">The company initially said that it lowered the loan by $34 million to $66 million via the sale of 1,500 of its bitcoin holdings. Then it added an additional 1,500 — bringing the total owed down to $38 million, according to a statement on Tuesday.<\/span>","<span data-v-f87c67ca=\"\">It's unclear exactly how this deal was structured. Bitfarms declined The Block's request for comment.<\/span>","<span data-v-f87c67ca=\"\">Bitfarms' move to sell some of its daily production, even though bitcoin prices have fallen in recent days, is a decisive pivot away from its previous strategy of holding onto its mined bitcoins. In 2021, the company mined a total of 3,453 BTC. At the time of publication, Bitcoin's price was around $21,500.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“In consideration of extreme volatility in the markets, we have continued to take action to enhance liquidity and to de-leverage and strengthen our balance sheet, said chief financial officer Jeff Lucas. “While we remain bullish on long-term BTC price appreciation, this strategic change enables us to focus on our top priorities of maintaining our world-class mining operations and continuing to grow our business in anticipation of improved mining economics.”<\/span>","<span data-v-f87c67ca=\"\">According to Lucas, the company believes that this strategy is the best and least expensive method in the current market environment.<\/span>","<span data-v-f87c67ca=\"\">“In addition to lowering our interest expense, this $34 million reduction in borrowing gives us the ability to utilize more of our BTC holdings strategy as it frees up BTC that would otherwise be used to collateralize this credit facility,” said CFO Jeff Lucas.<\/span>","<span data-v-f87c67ca=\"\">The loan was secured with crypto-focused trading and investment firm Galaxy and collateralized at 143% of the amount borrowed. Per the loan agreement, Bitfarms is required to contribute additional collateral anytime the value of the collateral falls below 133%.<\/span>","<span data-v-f87c67ca=\"\">\"A substantial decrease in Bitcoin price may result in the Company being unable to meet the minimum Bitcoin collateral requirements, which could result in the disposition of the Company's Bitcoin pledged as collateral by the Facility Lender, or repayment of the facility in fiat currency on demand,\" the company stated in a recent report.<\/span>","On May 31, Bitfarms reported that it owned 6,075 BTC. Their holdings now stand at 3,349 BTC, taking into account the full 3,000 BTC sold and the added June production at an average of 14 BTC per day.","With the current Bitcoin price of around $21,500, those holdings could be worth roughly $72 million, which is above the 143% of the remaining $38 million borrowed (about $54.34 million).","Bitfarm's stock was up by 6.90% on the Toronto Stock Exchange and 8.20% on Nasdaq at the time of publication.","<span data-v-f87c67ca=\"\">Bitfarms also closed a deal with NYDIG for a $37 million loan collateralized by mining machines at some of the company's facilities, at a 12% interest rate. There's a possibility of additional financing in July and October.<\/span>","<span data-v-f87c67ca=\"\">Lucas said the company was now \"better positioned\" to take advantage of possible acquisitions or expansion opportunities resulting from current market conditions.<\/span>","<span data-v-f87c67ca=\"\">Just last week, rival CleanSpark announced that it had secured the <a href=\"https:\/\/www.theblock.co\/post\/152216\/capitalizing-on-buyers-market-cleanspark-acquires-1800-bitcoin-miners\" data-v-f87c67ca=\"\">acquisition of 1,800 bitcoin miners<\/a>, in a deal that benefited from \"the unique circumstances that current market conditions have created,\" per CEO Zach Bradford.<\/span>","<span data-v-f87c67ca=\"\">“We have proactively taken non-dilutive strategic actions to increase our financial liquidity and flexibility during this period of macroeconomic crypto challenges,” Lucas also said.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$72 million","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Toronto Stock Exchange","content":"ORGANIZATION"},{"type":"6.90%","content":"PERCENT"},{"type":"12%","content":"PERCENT"},{"type":"July","content":"DATE"},{"type":"$21,500","content":"MONEY"},{"type":"$38 million","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"Zach Bradford","content":"PERSON"},{"type":"Jeff Lucas","content":"PERSON"},{"type":"Lucas","content":"PERSON"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"$34 million","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"$66 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Bitfarms","content":"PERSON"},{"type":"$37 million","content":"MONEY"},{"type":"143%","content":"PERCENT"},{"type":"133%","content":"PERCENT"},{"type":"June","content":"DATE"},{"type":"last week","content":"DATE"},{"type":"8.20%","content":"PERCENT"},{"type":"May 31","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Company","content":"ORGANIZATION"},{"type":"$54.34 million","content":"MONEY"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}