{"summary":"Blockchain.com’s crypto exchange, The Pit, has added support for GBP, with UK Faster Payments Scheme\nIt will allow users to buy bitcoin and ether in “less than five minutes”\nThe Pit has joined the likes of Coinbase and CEX.IO with connectivity to FPS","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/51072\/as-brexit-looms-blockchain-coms-crypto-exchange-adds-support-for-gbp-with-uk-faster-payments-scheme","publishDate":"2019-12-19T05:00:04","id":2795,"type":null,"title":"As Brexit looms, Blockchain.com’s crypto exchange adds support for GBP, with UK Faster Payments Scheme","category":["Exchanges"],"content":["Blockchain.com’s recently launched cryptocurrency exchange, The Pit, has become one of the few exchanges to enable the U.K. Faster Payments Scheme (FPS).","The effort will allow users to instantly deposit and withdraw British pounds (GBP) at the exchange, and to buy cryptocurrencies in “less than five minutes,” said Blockchain.com. At present, two cryptocurrencies are supported - bitcoin (BTC) and ether (ETH) - and the exchange plans to add more in the future.","FPS is a U.K. <a href=\"https:\/\/en.wikipedia.org\/wiki\/Faster_Payments_Service\" data-v-f87c67ca=\"\">banking initiative<\/a> that reduces payment times between different banks' customer accounts from 3 working days to a few seconds. Currently, only a small set of cryptocurrency exchanges have enabled the scheme, such as <a href=\"https:\/\/support.coinbase.com\/customer\/en\/portal\/articles\/2949612-payment-methods-for-uk-customers\" data-v-f87c67ca=\"\">Coinbase<\/a>, <a href=\"https:\/\/cex.io\/fasterpayments\/\" data-v-f87c67ca=\"\">CEX.IO<\/a> and <a href=\"https:\/\/www.fintech.finance\/01-news\/coinfloor-launches-uk-faster-payments-deposit-and-withdrawal-services\/\" data-v-f87c67ca=\"\">Coinfloor<\/a>.","Coinbase temporarily disabled FPS in August as its banking partner Barclays <a href=\"https:\/\/www.theblockcrypto.com\/linked\/35904\/barclays-cancels-banking-deal-with-coinbase-report\" data-v-f87c67ca=\"\">cut ties<\/a> with it, and the move reportedly inconvenienced the exchange's UK users as it slowed deposits and withdrawals in GBP. The scheme was later restored when the exchange found a new partner in U.K. upstart ClearBank.","Blockchain.com said it has added support for GBP and FPS because UK users are one of its largest segments and it has seen “record” numbers of first-time deposits from these users as Brexit looms. Brexit is moving ahead after U.K.’s Prime Minister Boris Johnson vowed to pull the country from the bloc on Jan. 31.","“It’s imperative for us to provide the British people...new options to insulate their financial futures from the political scuffles that have destabilized the country’s economy,” said Peter Smith, co-founder and CEO of Blockchain.com.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe firm declined to share a specific number of users in the U.K. but said users from the country are a \"top 5 segment\" across its know-your-customer (KYC)-enabled services. It also declined to share banking partners for FPS.&nbsp;","Blockchain.com <a href=\"https:\/\/www.theblockcrypto.com\/2019\/07\/30\/wallet-provider-blockchain-rolls-out-crypto-exchange-claiming-to-be-one-of-the-fastest-in-the-market\/\" data-v-f87c67ca=\"\">launched<\/a> The PIT exchange in July, claiming to be one of the “fastest” in the world. The exchange complements Blockchain.com’s wallet business, which claims to have 44 million users. It also <a href=\"https:\/\/www.theblockcrypto.com\/post\/47054\/as-credit-concerns-loom-in-crypto-blockchain-com-secretly-builds-multi-million-dollar-loan-desk\" data-v-f87c67ca=\"\">operates<\/a> a lending desk, having transacted over $1.6 billion worth of cryptocurrency.","Founded in 2011, Blockchain.com is backed by notable investors including Digital Currency Group, Lakestar and Google Ventures, among others. The firm raised a $40 million Series B in 2017, and $30.5 million in Series A funding back in 2014."],"hashtag":["COINBASE"]}