{"summary":"Binance Asia Services is acquiring an 18% stake in Hg Exchange.\nHg is a Singapore-based licensed private securities exchange.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/126761\/binance-to-acquire-18-stake-singapore-hg-exchange","publishDate":"2021-12-08T06:10:05","id":2800,"type":null,"title":"Binance to acquire 18% stake in Singapore-based Hg Exchange","category":["Exchanges"],"content":["Binance Asia Services, the Singapore entity of Binance, announced on Wednesday that it is acquiring an 18% stake in Hg Exchange, a Singapore-based private securities exchange.","It is not clear how much Binance Asia is investing in Hg to acquire the stake. A Binance spokesperson declined to comment to The Block when reached. The deal is subject to regulatory approvals, and an expected closing timeline is unknown.","Hg Exchange (HGX) is a private securities exchange built on the Zilliqa blockchain, which facilitates trading in tokenized shares of private companies. HGX is also working on listing alternative digital assets, including wine, art, and real estate, said Binance.","\"Crypto and traditional financial offerings continue to converge. Through this investment, we seek to work with HGX in enhancing offerings of products and services supported by blockchain technology,\" said Binance Singapore CEO Richard Teng.","Teng was chairman of HGX before <a href=\"https:\/\/www.theblockcrypto.com\/linked\/115302\/binance-singapore-ceo-sgx-regulatory-officer\" data-v-f87c67ca=\"\">joining<\/a> Binance Singapore in August of this year, according to an <a href=\"https:\/\/web.archive.org\/web\/20210627080539\/https:\/\/hg.exchange\/about-us\/\" data-v-f87c67ca=\"\">archived version<\/a> of HGX's website.","HGX is <a href=\"https:\/\/eservices.mas.gov.sg\/fid\/institution\/detail\/232832-HGX-PTE-LTD\" data-v-f87c67ca=\"\">licensed and regulated<\/a> by the Monetary Authority of Singapore. The firm has a recognized market operator (RMO) license from the authority. An RMO license <a href=\"https:\/\/www.mas.gov.sg\/~\/media\/MAS\/Regulations%20and%20Financial%20Stability\/Regulations%20Guidance%20and%20Licensing\/Securities%20Futures%20and%20Fund%20Management\/Regulations%20Guidance%20and%20Licensing\/Guidelines\/A%20Guide%20to%20Digital%20Token%20Offerings%20%2014%20Nov%202017.pdf\" data-v-f87c67ca=\"\">allows<\/a> a firm to provide trading in digital tokens or securities.","HGX was founded in 2019 by three Singapore-based financial institutions: PhillipCapital, PrimePartners, and Fundnel.","Binance's purchase of a stake in HGX comes amid <a href=\"https:\/\/www.businesstimes.com.sg\/garage\/binances-singapore-crypto-hub-plans-in-regulatory-limbo-0\" data-v-f87c67ca=\"\">reports<\/a> that the crypto exchange might withdraw its Singapore application while searching for a global headquarters elsewhere. The Binance spokesperson declined to comment on these reports, saying that the exchange does not comment on rumors or speculation.","Binance Asia is currently awaiting approval from the Monetary Authority of Singapore to provide crypto services in the country. The firm, which operates the binance.sg exchange, is currently exempted from holding a license under Singapore's Payment Services Act as its license application is being reviewed."],"hashtag":["BINANCE"]}