{"summary":"Today’s topics include Ethena&#x27;s transparency around its risks, $2 billion of government bitcoin, the Wormhole airdrop and a new crypto fund.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286664\/the-pulse-unlike-luna-at-least-ethena-is-willing-to-discuss-its-risks","publishDate":"2024-04-06T08:08:02","id":2802,"type":null,"title":"The Pulse: Unlike Luna, at least Ethena is willing to discuss its risks","category":["CRYPTO ECOSYSTEMS"],"content":["It was when attending a weekly London meetup I used to organize that I first heard people passionate about Luna and UST. The coin just kept going up, they said, and UST was being used by citizens in South Korea to pay for groceries, they claimed.&nbsp;","At the time, I was skeptical, to say the least. A stablecoin backed by another token that could go to zero at any point seemed insecure at best. One of my biggest journalistic regrets was that I didn’t look into it more deeply and write up a detailed consideration of its risks. Yet even if I had, any article would have been rubbished by the self-proclaimed Lunatics that was the cult formed around Do Kwon.","“Anon, you could listen to CT influensooors about UST depegging for the 69th time. Or you could remember they’re all now poor, and go for a run instead,” Kwon <a href=\"https:\/\/twitter.com\/stablekwon\/status\/1523075465384136704\" data-v-f87c67ca=\"\">posted on X<\/a> prior to the stablecoin’s collapse — as one of many arrogant posts about the project’s standing that he would <a href=\"https:\/\/unchainedcrypto.com\/do-kwon-of-terra-it-was-never-really-about-money-or-fame-or-success-ep-408\/\" data-v-f87c67ca=\"\">later regret<\/a>.","<span data-v-f87c67ca=\"\">Since Luna and UST collapsed, taking with it up to $40 billion of value, many people have been skeptical about projects that even vaguely resemble such a stablecoin. So, unsurprisingly, when a sort-of-stablecoin project called <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethena <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/286071\/ethena-ena-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><!----> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ENA<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.71%\n    <\/span><\/a> <!----><\/span><\/span> started gaining momentum, the comparison was made.<\/span>","Ethena is a complicated beast. On the face of it, it looks like a stablecoin with a high yield, as UST offered. But in reality, it is more of a combination of a structured product and a stablecoin, potentially split by whether the token is staked, as noted by <a href=\"https:\/\/www.theblock.pro\/research\/ethena-scaling-crypto-backed-stablecoins-with-native-yield-280201\" data-v-f87c67ca=\"\">The Block Research<\/a>.","When I spoke to Ethena’s founder, Guy Young, who goes by the pseudonym Leptokurtic, in February, he said his worst-case scenario for the project was counterparty risk. This is the possibility that funds stored with institutional grade custodians like Fireblocks and Copper could be lost for some reason. “I think the worst thing that could happen is if one of those institutional custodians has a large problem and actually fundamentally loses the assets,” he said at the time, showing a willingness to discuss what could go wrong.","Alongside this, Ethena is far more transparent and open about its potential risks. For instance, on its <a href=\"https:\/\/ethena.notion.site\/Ethena-FAQs-3ccc1437e13343f8b74c0d005e4f5128\" data-v-f87c67ca=\"\">FAQ page<\/a>, it details seven risks the project faces, from funding rates to exchange failure and even regulatory issues (which, given that the project offers yield on the back of efforts by a few third parties, seems worth acknowledging). It examines each issue in detail and says how it monitors certain risks.","So, while the question of Ethena’s risk profile is very complex and the subject of much debate on X, what stands out to me is that, at least this time around, the risks are being discussed in an open and transparent way — without skeptical articles <a href=\"https:\/\/twitter.com\/seltzergenius\/status\/1516067136854241281\" data-v-f87c67ca=\"\">facing criticism<\/a> for pointing out potential flaws. And this, you could argue, is progress.","<i data-v-f87c67ca=\"\">Now, onto a selection of stories that caught my attention this week.<\/i>","A couple of large crypto news sites reported that the DOJ sent 30,000 BTC to Coinbase last week. Only that number wasn’t exactly right.","As The Block <a href=\"https:\/\/twitter.com\/theblockupdates\/status\/1775188343522767188\" data-v-f87c67ca=\"\">covered in real-time<\/a>, the DOJ wallet sent a test transaction of 0.0001 BTC to a wallet labeled as belonging to Coinbase Prime on Arkham. The rest of the funds were sent to a change address, meaning they effectively stayed put in all likelihood. Soon after, <a href=\"https:\/\/twitter.com\/theblockupdates\/status\/1775211441995333640\" data-v-f87c67ca=\"\">2,000 BTC was sent<\/a> to the same Coinbase wallet with the remaining funds sent to a change address.","While the Bitcoin blockchain is a bit complex to follow, this broadly means that 2,000 BTC <a href=\"https:\/\/www.theblock.co\/post\/286097\/wallet-containing-2-billion-of-doj-seized-bitcoin-appears-to-send-test-transaction-to-coinbase-prime-arkham-data\" data-v-f87c67ca=\"\">went to Coinbase<\/a>, and the rest most likely stayed in the same wallet (although using a different public key).&nbsp;","It is a bit confusing, but it seems important to note as this marks the difference between the government selling $132 million of bitcoin — and $2 billion.","Cross-chain protocol Wormhole <a href=\"https:\/\/www.theblock.co\/post\/286411\/wormhole-airdrop-hacker\" data-v-f87c67ca=\"\">initially allocated tokens<\/a> to the entity that was behind its $323 million hack in 2022.","Around four addresses associated with the hack were allocated over 31,600 W tokens, worth around $38,000.","While the tokens were initially allocated to these addresses, they have now been removed from the allocation, according to a source familiar with the situation.","Brevan Howard Digital, the crypto arm of the global asset management giant, and Galaxy Digital, the crypto firm founded by billionaire Mike Novogratz, have both invested in crypto accelerator Alliance's third fund, Yogita Khatri writes in <a href=\"https:\/\/www.theblock.co\/post\/286532\/brevan-howard-digital-galaxy-crypto-alliance-100-million-fund\" data-v-f87c67ca=\"\">her latest scoop<\/a>.","The Alliance Fund III had its first close in February, getting commitments from<a href=\"https:\/\/www.theblock.co\/post\/146212\/alan-howard-crypto-interview\" data-v-f87c67ca=\"\"> Brevan Howard Digital<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/285269\/galaxy-locked-sol-sale-ftx-estate\" data-v-f87c67ca=\"\">Galaxy Digital<\/a> worth $20 million. Each firm has already invested $10 million in the fund.","Fund III is looking to raise an additional $80 million by July, capping it at $100 million. It is expected to invest $500,000 per startup.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"Brevan Howard Digital","content":"ORGANIZATION"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"Ethena","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Alliance Fund III","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"-0.71%","content":"PERCENT"},{"type":"London","content":"LOCATION"},{"type":"Mike Novogratz","content":"PERSON"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"$38,000","content":"MONEY"},{"type":"$323 million","content":"MONEY"},{"type":"Coinbase Prime on Arkham","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"},{"type":"$2 billion","content":"MONEY"},{"type":"Howard Digital","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"$80 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"February","content":"DATE"},{"type":"$500,000","content":"MONEY"},{"type":"$132 million","content":"MONEY"},{"type":"$20 million","content":"MONEY"},{"type":"Ethena <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/286071\/ethena-ena-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><!----> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ENA","content":"ORGANIZATION"},{"type":"UST","content":"ORGANIZATION"},{"type":"Yogita Khatri","content":"PERSON"}],"hashtag":["ASSETS"],"authors":["Tim Copeland","The Block"]}