{"summary":"Fed chair Jerome Powell has acknowledged that a central bank digital currency (CBDC) might improve the payment system in the U.S.\nA CBDC could help with faster and cheaper payment transactions, said Powell, adding that it could also help modernize payment infrastructure and reach consumers traditionally underserved by financial institutions.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/81652\/fed-chair-powell-cbdc-improvements","publishDate":"2020-10-19T15:49:45","id":2804,"type":null,"title":"Fed chair Powell: A central bank digital currency could improve the payment system in the U.S.","category":["Central Banks"],"content":["Jerome Powell, the chairman of the U.S. Federal Reserve, has acknowledged that a central bank digital currency (CBDC) could lead to improvements in the broader payment system in the U.S.","During a <a href=\"https:\/\/www.youtube.com\/watch?v=k4DnFel1sHA\" data-v-f87c67ca=\"\">panel discussion<\/a> on cross-border payments hosted by the International Monetary Fund (IMF) on Monday, Powell said that \"there are a number of ways a CBDC might improve the payment system, and it is this area that motivates our interest.\"","A CBDC could help facilitate faster and cheaper payment transactions, said Powell, adding that such a currency could also help modernize payment infrastructure and reach consumers traditionally underserved by financial institutions.","Powell reiterated that the Fed hasn't made a decision to issue a digital currency as \"there's a great deal of work yet to be done as well as extensive public consultation to be had with all stakeholders before making such a decision.\"","Powell said about 80% of <a href=\"https:\/\/www.theblockcrypto.com\/post\/75022\/a-global-look-at-central-bank-digital-currencies-full-research-report\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">central banks worldwide are exploring CBDC concepts<\/a>, but suggested that the Fed is in no rush to issue one of its own.","\"I think it's more important for the United States to get it right than it is to be first,\" said Powell. \"Getting it right means that we not only look at the potential benefits of a CBDC but also the potential risks and also recognize the important trade-offs that have to be thought through carefully.\"","Powell highlighted three risks or challenges for CBDCs:","\"They're not simple questions, and the answers will have to be comprehensively understood,\" said Powell.","He also acknowledged that the Fed would need to work collaboratively with the private sector on improving payments and CBDCs. \"The private sector is likely to be able to contribute through technological innovation. The public sector brings a perspective that seeks broad public benefits,\" said Powell.","The Fed recently partnered with other central banks and the Bank for International Settlements for researching CBDCs, and Powell said the collaboration has been \"very productive.\"","Powell also mentioned the Federal Reserve Bank of Boston's <a href=\"https:\/\/www.theblockcrypto.com\/linked\/74868\/boston-fed-mit-cbdc-research\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">partnership<\/a> with the Massachusetts Institute of Technology (MIT) about \"developing a hypothetical central bank digital currency.\"","Powell said any potential CBDC would serve as a complement to and not a replacement for cash, citing that the U.S. continues to see \"strong demand\" for cash."],"hashtag":["CBDCS","JEROME POWELL"]}