{"summary":"Indian cryptocurrency exchange Koinex is closing its operations today, citing lack of banking support and regulatory uncertainty\nKoinex is just the latest crypto exchange to shut shop in the country, followed by Coindelta, Coinome and Zebpay ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/29198\/one-of-the-largest-indian-crypto-exchanges-is-shutting-down-amidst-regulatory-uncertainty","publishDate":"2019-06-27T02:25:32","id":2809,"type":null,"title":"Koinex is shutting down amidst regulatory uncertainty","category":["Exchanges"],"content":["Indian cryptocurrency exchange Koinex has announced that it is closing its operations today, citing lack of banking support and regulatory uncertainty in the country.","“The last 14 months have been tough to operate a digital assets trading business in India, on account of the closure of bank accounts holding user deposits,” wrote Rahul Raj, co-founder of Koinex, in a Medium <a href=\"https:\/\/medium.com\/koinex-crunch\/koinex-shutdown-announcement-termination-of-exchange-services-bea4a472ea79\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">blog post<\/span><\/a> on Thursday.","The exchange faced denials in payment services from payment gateways and banks, as well as faced blockage of transactions for the trading of cryptocurrencies, per the post.&nbsp;","Last year in April, the Reserve Bank of India (RBI), the country’s central bank, <a href=\"https:\/\/www.rbi.org.in\/Scripts\/BS_PressReleaseDisplay.aspx?prid=43574\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">barred<\/span><\/a> banks from serving cryptocurrency exchanges and firms. Since then, several exchanges have filed legal petitions to reverse the RBI ban, but the matter is still pending in the supreme court of India. The next hearing is scheduled in July.","“Multiple delays by the government agencies in clarifying the regulatory framework for cryptocurrencies despite our pending writ petition in the Supreme Court of India, coupled with regular disruption in our operations, the final decision has been taken,” wrote Raj.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nEarlier this month, there were reports that the Indian government has <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/indias-draft-bill-proposes-a-10-year-jail-sentence-for-using-cryptocurrencies\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">proposed<\/span><\/a> a draft bill banning cryptocurrency trading as well as suggesting a 10-year jail sentence for using cryptocurrencies.","These reports have created “enough FUD [fear, uncertainty and doubt]” in the Indian cryptocurrency trading community to result in a “sharp decline” in trading volumes, wrote Raj.","As a result, Koinex is permanently disabling cryptocurrency trading on all its platforms, effective 2.00 PM IST on June 27. “The digital assets wallets will continue to be functional, and users will be required to withdraw all funds from the platform before 9.00 PM IST on July 15,” per the post.","Koinex indeed has had a hit on its trading volumes. The exchange claims to have recorded $265 million in trading volume in December 2017 when bitcoin soared at all-time high levels of $20,000, per the post. However, it has not attracted as much volume lately. In the last 6 months combined, Koinex had less than $25 million in traded volume.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","Koinex is just the latest cryptocurrency exchange to shut shop in India. <a href=\"https:\/\/medium.com\/coindelta\/important-announcement-termination-of-services-6cd6849d7b7c\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Coindelta<\/span><\/a><span data-v-f87c67ca=\"\">, <\/span><a href=\"https:\/\/twitter.com\/CoinomeOfficial\/status\/1126393700697788416\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Coinome and<\/span><\/a><span data-v-f87c67ca=\"\">&nbsp;<\/span><a href=\"https:\/\/www.theblockcrypto.com\/tiny\/indian-cryptocurrency-exchange-stops-trading\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Zebpay<\/span><\/a> have all closed in recent months over regulatory uncertainty.&nbsp;"],"hashtag":[]}