{"summary":"The floor price of bored ape NFTs has risen above that of CryptoPunks for the first time.\nThere appear to be multiple factors at play for the flip.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/128338\/bored-ape-yacht-club-nft-flip-cryptopunks-floor-price","publishDate":"2021-12-22T10:33:58","id":281,"type":null,"title":"Bored Ape Yacht Club NFTs flip CryptoPunks in terms of floor price","category":["NFTs"],"content":["The floor price of Bored Ape Yacht Club (BAYC) NFTs has flipped that of Larva Labs' CryptoPunks for the first time. The floor price is the lowest price at which a type of NFT is currently available for sale.","The current floor price of a BAYC NFT is <a href=\"https:\/\/opensea.io\/collection\/boredapeyachtclub?search[sortAscending]=true&amp;search[sortBy]=PRICE&amp;search[toggles][0]=BUY_NOW\" data-v-f87c67ca=\"\">53.9 ETH ($215,350),<\/a>&nbsp;whereas the floor price of a CryptoPunk NFT is <a href=\"https:\/\/www.larvalabs.com\/cryptopunks\" data-v-f87c67ca=\"\">52.69 ETH ($210,515)<\/a>.","","","The flip is significant because BAYC NFTs are much newer to the market than CryptoPunks — seen as the OG NFT. The former NFTs were launched in April of this year and the latter in 2017.","Both BAYC NFTs and CryptoPunks are a collection of 10,000 unique digital collectibles on the Ethereum blockchain. CryptoPunks were created by two Canadian software developers Matt Hall and John Watkinson whereas BAYC NFTs were created by a team of four pseudonymous developers: Gargamel, Gordon Goner, Emperor Tomato Ketchup, and No Sass.","The rarer an NFT, the higher price it generally fetches. For instance, BAYC #8817, the third-rarest gold fur ape, was sold for a record $3.4 million at a Sotheby's auction at the time.","From the CryptoPunks collection, CryptoPunk #7523, one of 9 Alien punks, was sold for a record $11.8 million at the auction house Sotheby's. On Larva Labs' native marketplace, the highest sale price to date has been for CryptoPunk #4156 for $10.26 million (barring those <a href=\"https:\/\/www.theblockcrypto.com\/post\/122516\/how-a-cunning-trick-made-it-look-like-a-cryptopunk-sold-for-532-million\" data-v-f87c67ca=\"\">pesky flash loan sales<\/a>).","Over the last few months, the floor price of CryptoPunks has fallen steadily, whereas that of BAYC NFTs has increased. There appear to be multiple factors at play.","\"BAYC NFTs have generous IP rights compared to CryptoPunks,\" Bobby Ong, co-founder of CoinGecko and an NFT expert, told The Block. \"Some people are not happy that Larva Labs is not assigning more rights.\"","Put simply, CyptoPunk NFT owners do not get rights to use their NFTs for any commercial purpose, whereas BAYC NFT owners get IP rights. Bored Ape owners are using these IP rights to <a href=\"https:\/\/www.theblockcrypto.com\/linked\/127304\/bored-ape-yacht-club-game-slated-to-launch-in-q2-via-animoca-brands-partnership\" data-v-f87c67ca=\"\">build a blockchain-based game<\/a> in partnership with Animoca Brands.","Another recent boost has been their adoption by celebrities such as Jimmy Fallon, Steph Curry, and Post Malone. Ong said BAYC has a concierge team onboarding celebrities to own apes versus Larva Labs, which is not doing much in that regard. Just yesterday, Snoop Dogg <a href=\"https:\/\/twitter.com\/SnoopDogg\/status\/1473367017172393987?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet\" data-v-f87c67ca=\"\">bought a Bored Ape<\/a>, plus two mutant apes and a Bored Ape Kennel Cub (two of its offshoot projects) <a href=\"https:\/\/www.theblockcrypto.com\/post\/125483\/moonpay-concierge-celebrities-nft\" data-v-f87c67ca=\"\">through MoonPay<\/a>.","The BAYC team is also expected to release its <a href=\"https:\/\/www.theblockcrypto.com\/linked\/119966\/bored-ape-yacht-club-plans-to-launch-its-own-token-in-q1-of-2022\" data-v-f87c67ca=\"\">native token<\/a> next year, which also appears to be a driving factor for apes' higher floor price, said Ong."],"hashtag":["CRYPTOPUNKS"]}