{"summary":"Music streaming, an industry projected to generate $30 billion in revenue by 2030, is coming to Cosmos — a new &quot;internet&quot; of blockchains. Playlist, a","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/16082\/a-popular-social-music-streaming-app-picks-cosmos-to-build-a-hybrid-decentralized-ecosystem","publishDate":"2019-03-15T17:34:38","id":2811,"type":null,"title":"A popular social music streaming app picks Cosmos to build a hybrid decentralized ecosystem","category":["STARTUPS"],"content":["Music streaming, an industry projected to generate $30 billion in revenue by <a href=\"https:\/\/www.axios.com\/music-streaming-revenue-projected-to-grow-six-fold-by-2030-1513305191-18caff3f-4971-4029-932b-e67fcc9af3ce.html\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">2030<\/a>, is coming to Cosmos&nbsp;— a new \"internet\" of blockchains.","<a href=\"https:\/\/www.playlist.com\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Playlist<\/a>, a social music streaming application, is building the first large-scale hybrid dApp that aims to leverage Cosmos to extend engagement across its music ecosystem. According to its website, Playlist offers streaming access to 45 million songs without a subscription and counts more than 400,000 downloads on iOS.","The app has raised $5 million according to Playlist,&nbsp;and counts Eric Meltzer of Primitive,&nbsp;<span data-v-f87c67ca=\"\">Amino Capital advised by Zaki Manian, head of Tendermint Labs,<\/span> and most recently Spencer Noon of DTC Capital as investors.","“We’re excited to be investors and future validators in Playlist’s decentralized music ecosystem. The team has designed a compelling token economy that unlocks value for rights-holders and fans without sacrificing any part of the user experience in the Playlist app,\" said Noon.","\"It’s a cool model because it’s an application that will look and feel like a regular app, but in the background leverage Cosmos. It’s a formula for mass adoption.\"","<span data-v-f87c67ca=\"\">In a conversation with The Block, DTC Capital said it believes the token model in place is cutting edge, with Playlist now looking for strategic stakers, or participants with generalized mining experience.&nbsp;<\/span><span data-v-f87c67ca=\"\">Playlist also plans to offer a private strategic sale for stakers in anticipation of launching its network on Cosmos<\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">.<\/span><\/i>","\"Cosmos' design is an interesting one. When you deploy a smart contract to a general purpose blockchain there are things you can't customize. Cosmos flips that on its head with dapp-specific blockchains, although it does come with the downside that you have to find your own validators. I think the future will probably feature both models depending on the needs of dapps, so Cosmos' launch for me is a pretty epic moment for crypto,\" Noon said.","<span data-v-f87c67ca=\"\">Playlist Founders Karen Katz and Steve Petersen are Stanford engineers and serial entrepreneurs with 2 IPOs, a $300 million exit, 36 patents, and over 10 years experience each in digital music. The two are excited to work with Cosmos to further user engagement between artists and fans.<\/span>","<span data-v-f87c67ca=\"\">In a press release sent to The Block, Playlist CEO Katz said “Cosmos’ scalable platform and SDK are accelerating our extension onto the blockchain. Given Playlist is generating 10X the user engagement of other streaming services, we require very high transactions per second. Cosmos is clearly the best technology for enabling the next generation of transactions within our growing community of artists, curators, influencers and fans.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Zaki Manian","content":"PERSON"},{"type":"Founders Karen Katz","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Eric Meltzer","content":"PERSON"},{"type":"DTC Capital","content":"ORGANIZATION"},{"type":"Spencer Noon of DTC Capital","content":"ORGANIZATION"},{"type":"SDK","content":"ORGANIZATION"},{"type":"Katz","content":"PERSON"},{"type":"Stanford","content":"ORGANIZATION"},{"type":"2030","content":"DATE"},{"type":"$300 million","content":"MONEY"},{"type":"Amino Capital","content":"ORGANIZATION"},{"type":"Steve Petersen","content":"PERSON"},{"type":"$5 million","content":"MONEY"},{"type":"$30 billion","content":"MONEY"}],"hashtag":["COSMOS"],"authors":["The Block","The Block"]}