{"summary":"The Taproot\/Schnorr proposal has been officially published as Bitcoin Improvement Proposals (BIPs) 340, 341, 342.\nNext steps include a pull request for the project’s reference implementation.","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/53958\/taproot-schnorr-bitcoin-bip-development","publishDate":"2020-01-24T13:44:59","id":2811,"type":null,"title":"The Taproot\/Schnorr published Bitcoin Improvement Proposals (BIPs)","category":["Technology"],"content":["<span data-v-f87c67ca=\"\">The Taproot\/Schnorr proposal has been published as a series if Bitcoin Improvement Proposals (BIPs) – a symbolic milestone for the long-anticipated technological change.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Taproot was first <\/span><a href=\"https:\/\/lists.linuxfoundation.org\/pipermail\/bitcoin-dev\/2018-January\/015614.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">introduced<\/span><\/a><span data-v-f87c67ca=\"\"> by Bitcoin Core developer Greg Maxwell in Jan. 2018 and formalized by another Bitcoin Core developer, Pieter Wuille, in May as a soft fork bundled with Schnorr.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As The Block <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/52408\/bitcoins-taproot-schnorr-upgrade-proposal-is-nearly-ready-as-it-moves-through-developer-feedback-phase\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">previously reported<\/span><\/a><span data-v-f87c67ca=\"\">, the proposed soft fork is expected to bring a much-needed privacy feature to the protocol by making all transactions – be it a simple payment between two parties, the opening or closing of a Lightning channel, or a sophisticated smart contract – look the same to outside observers.<\/span>","<span data-v-f87c67ca=\"\">The project recently finished its developer feedback phase. On Jan. 16, Wuille <a href=\"https:\/\/github.com\/bitcoin\/bips\/pull\/876\" data-v-f87c67ca=\"\">opened<\/a> a Pull Request for the Taproot\/Schnorr BIPS, describing the census rules and basic wallet operation for the proposal. <\/span>","<span data-v-f87c67ca=\"\">On Thursday, Wuille put out the <\/span><span data-v-f87c67ca=\"\"><a href=\"https:\/\/twitter.com\/pwuille\/status\/1220502956023283718?s=20\" data-v-f87c67ca=\"\">latest update<\/a>, announcing that the proposed soft fork is now published as <\/span><a href=\"https:\/\/github.com\/bitcoin\/bips\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">BIPs<\/span><\/a><span data-v-f87c67ca=\"\"> 340, 341, and 342.<\/span>","<span data-v-f87c67ca=\"\">The BIPs themselves do not signify final approval, he emphasized, but merely show that authors of the project are now in general agreement with the community regarding the proposal’s language.<\/span>","<span data-v-f87c67ca=\"\">“Note that the assignment of BIP numbers is not any kind of stamp of approval; it just means the process was followed (which includes some amount of public discussion),” Wuille said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“<\/span><span data-v-f87c67ca=\"\">In this case I believe we (the authors) waited to request numbers until the proposal and writeups were fairly mature,” he added. “Barring significant issues found in review (which remains welcome of course), I do not think we intend to make semantical changes anymore.”<\/span>","The next steps are protocol implementation and network activation.&nbsp;","<span data-v-f87c67ca=\"\">Now that there are BIP numbers to refer to, Wuille is expected to soon open a Pull Request for the project’s reference implementation, as he previously <a href=\"https:\/\/github.com\/bitcoin\/bips\/pull\/876\" data-v-f87c67ca=\"\">signaled,<\/a> which will likely bring another round of review.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“If all goes well, and it's clear that Taproot as proposed is what the ecosystem is willing to adopt, it will be merged, and discussion will start about how to activate it on the network,” he previously told The Block. “If that too goes well, a release with the activation will be published, and if\/when the conditions to activate it are met, we'll be live.”<\/span>","<span data-v-f87c67ca=\"\">Wuille made clear that the exact timeline of the soft fork’s launch is now in the hands of the ecosystem.<\/span>","<span data-v-f87c67ca=\"\">“The later steps in this process are more up to the ecosystem than up to me or the other contributors,” he said.&nbsp;<\/span>"],"hashtag":[]}