{"summary":"The supply of the stablecoin Tether (USDT) has been flat since the beginning of June.\nTether CTO Paolo Ardoino told The Block that the demand for USDT has been impacted due to a “significant decrease” in open interest for bitcoin futures.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/109035\/tether-usdt-stablecoin-supply-flat-june-why","publishDate":"2021-06-19T09:15:07","id":2812,"type":null,"title":"Tether&#x27;s supply hasn&#x27;t grown since the start of June. Here&#x27;s why","category":["Tether"],"content":["The supply of the stablecoin Tether (USDT) has been flat since the beginning of this month, according to <a href=\"http:\/\/www.theblockcrypto.com\/data\/decentralized-finance\/stablecoins\/total-stablecoin-supply-daily\" data-v-f87c67ca=\"\">The Block's Data Dashboard<\/a>.","From June 1 to June 17, USDT's supply has remained at $64.25 billion. No growth in USDT suggests that there is currently no demand for the stablecoin in the market and there is no new money flowing in.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-stablecoin-supply-daily\/embed\" title=\"Total Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Tether CTO Paolo Ardoino told The Block that USDT's demand has been impacted because of a \"significant decrease\" in open interest for bitcoin futures in recent weeks. USDT is the \"dominant stablecoin\" on most crypto derivatives exchanges, he said.","Indeed, there has been a <a href=\"https:\/\/www.theblockcrypto.com\/data\/crypto-markets\/futures\/aggregated-open-interest-of-bitcoin-futures-daily\" data-v-f87c67ca=\"\">notable drop<\/a> in the aggregate open interest of bitcoin futures since mid-May. From a peak of over $20 billion in May, the amount of open interest has declined to around $13 billion as of June 18. Open interest is the value of outstanding derivative contracts that are yet to be settled. Increasing open interest means that new money is flowing into the market and vice versa.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/futures\/aggregated-open-interest-of-bitcoin-futures-daily\/embed\" title=\"Aggregated Open Interest of Bitcoin Futures\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The recent bearish trend of the crypto market appears to be the main reason for the lower amount of open interest in the bitcoin futures market. Bitcoin has fallen from highs of $64,000 in mid-April to lows of around $36,000 currently.","Ardoino told The Block that stablecoins are issued pursuant to market conditions, and therefore the supply of them ebbs and flows.","Indeed, not only USDT but the supplies of other stablecoins have also been leveling off in June, as can be seen from the first chart above.","USDT continues to have the largest stablecoin market share, at over 60%, although its share has been declining since late last year while USDC's share has been increasing. The total supply of dollar-pegged stablecoins rose <a href=\"https:\/\/www.theblockcrypto.com\/post\/106082\/total-stablecoin-supply-100-billion-mark\" data-v-f87c67ca=\"\">past the $100 billion mark<\/a> for the first time last month. The current total supply of stablecoins stands at nearly $106 billion.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/share-of-total-stablecoin-supply\/embed\" title=\"Share of Total Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Compared to fiat money, stablecoins allow crypto market participants to move faster between crypto exchanges as fiat money transfers can take days. Also, not all exchanges support fiat on-ramps, leaving stablecoins and other cryptocurrencies as the only ways to trade across all exchanges."],"hashtag":["BITCOIN","TETHER"]}