{"summary":"Andreessen Horowitz has officially launched its new crypto fund, called Crypto Fund III.\nThe fund has more than $2.2 billion to invest.\nThe firm is also expanding its crypto unit with several key hires.","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/109408\/a16z-third-crypto-venture-fund","publishDate":"2021-06-24T08:00:55","id":2813,"type":null,"title":"Andreessen Horowitz launches $2.2 billion &#x27;Crypto Fund III&#x27;","category":["Capital Markets"],"content":["It's official. Andreessen Horowitz — the prominent venture capital fund led by Ben Horowitz and Marc Andreessen — announced Thursday the close of its third crypto venture fund, a $2.2 billion fund that the firm says is the largest of its kind.","The new \"Crypto Fund III\" will be co-led by Chris Dixon and Katie Haun.&nbsp;","\"The largest crypto fund ever raised to date, Crypto Fund III is a validating moment for the ecosystem and another sign that crypto becoming an ever more mainstream part of our financial infrastructure,\" the firm said in a press release.&nbsp;","Rumors of Andreessen Horowitz (also known as a16z) raising a mega-fund have appeared in various reports in recent months. The Financial Times reported in April that the California-based investment firm would be raising $1 billion for a crypto fund. In late May, tech blogger Eric Newcomer wrote that the firm was raising $2 billion.&nbsp;","A source familiar with the raise now told The Block that interest came mostly from limited partners in the firm's previous crypto funds, which have seen large returns. a16z netted more than $440 million from selling Coinbase stock soon after the exchange made its public markets debut on Nasdaq, according to CoinDesk. &nbsp;","a16z's mandate in crypto has been broad, ranging from decentralized finance (DeFi) to bitcoin applications to so-called Web 3, or a decentralized version of the internet. The firm's portfolio includes Dapper Labs, Celo, Uniswap, and Near.&nbsp;","","","<em data-v-f87c67ca=\"\">a16z's portfolio as of February 2021*<\/em>","\"This fund allows us to find the next generation of visionary crypto founders, and invest in the <a href=\"https:\/\/a16z.com\/2020\/04\/30\/crypto-fund-ii\/\" data-v-f87c67ca=\"\">most exciting areas of crypto,<\/a>\" Dixon and Haun wrote in a blog post. \"We invest in all stages, from early seed-stage projects to fully developed later-stage networks.\"","In addition to securing more than $2 billion to invest in crypto, a16z's crypto business has been hiring aggressively. It has made a number of key hires including Anthony Albanese, who joined the firm last year from the New York Stock Exchange. Albanese is now being promoted to chief operating officer of a16z crypto.","The firm also hired Bill Hinman, a former director at the Securities and Exchange Commission, who once said ether (ETH) is not a security, and Rachael Horowitz, a veteran Silicon Vally communications strategist who previously was the top communicator at Coinbase, also recently joined. Horowitz has also held positions at Twitter, Google, and Facebook.&nbsp;","Additional new hires include policymaker Tomicah Tilleman, who is joining the firm as global head of policy after serving as a senior advisor to President Joe Biden.&nbsp;","\"As with any new computing movement, crypto has endured a variety of challenges and misconceptions,\" Dixon and Haun said. \"That’s why we are also bringing together heavy-hitters across several functions to help translate “crypto” to the mainstream.\"","The announcement of Crypto Fund III follows a flurry of recent activity in crypto venture investing. Despite the slump in coin prices, investors have been raising large sums of cash to pour into new crypto startups.&nbsp;","Framework Ventures recently announced a $100 million new fund to invest in DeFi. Blockchain Capital, meanwhile, recently announced <a href=\"https:\/\/www.theblockcrypto.com\/linked\/109266\/300-million-blockchain-capital-raises-new-fund-with-backing-from-paypal-and-visa\" data-v-f87c67ca=\"\">a new $300 million fund<\/a> with backing from tech giants PayPal and Visa.&nbsp;","Data from The Block shows investors poured more than $8.8 billion into startups during 2021, compared with 3.07 billion in all of 2020.&nbsp;","",""],"hashtag":[]}