{"summary":"UMA’s new synthetic token uses a novel price feed mechanism\nThe token, which tracks the ETH\/BTC price ratio, is available on Uniswap until August 1st.","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/66041\/umas-new-eth-btc-synthetic-token-is-its-first-one-with-a-priceless-design","publishDate":"2020-05-21T12:02:43","id":2815,"type":null,"title":"UMA’s new ETH\/BTC synthetic token is its first one with a &#x27;priceless&#x27; design","category":["DeFi"],"content":["<span data-v-f87c67ca=\"\">A new synthetic token designed to track the ETH\/BTC price ratio in a way that minimizes the need for an oracle has launched on Ethereum.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The so-called ETHBTC token is the first to utilize the “priceless” synthetic token infrastructure developed by Universal Market Access (UMA). UMA is a financial contract platform that aims to build the necessary infrastructure to support the creation of Ethereum-based financial contracts that are less reliant on oracles. It features two main components — a synthetic token issuance platform and a more decentralized price feed mechanism.<\/span>","<span data-v-f87c67ca=\"\">Synthetic tokens are assets backed by collateral whose value changes with the fluctuations of its given reference index. In this case, the ETHBTC token is collateralized with the stablecoin DAI, and its value moves along with the ETHBTC index.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The new token is “priceless” in the sense that it does not require on-chain price feed for every transaction. Conventionally, synthetic tokens rely on oracles to track the value of the collateral and monitor whether the smart contract is fully collateralized. However, this approach is widely criticized for being a centralized one because it adds a potential single point of failure.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A priceless synthetic token takes a different approach. Rather than depending on on-chain price feed at all times, the network lets anyone liquidate a position they determine is undercollateralized, based on their own off-chain data reflecting the token’s index reference. If no one liquidates a position, the system assumes that it is properly collateralized. An oracle does not enter the process unless a specific liquidation is disputed.<\/span>","<span data-v-f87c67ca=\"\"> The UMA team has tried to set it up so these disputes don't occur frequently: a liquidator and disputer are required to make a deposit before resolution, and the losing party forfeits the money.<\/span>","<span data-v-f87c67ca=\"\">The new token is now available for trading on Uniswap and is currently worth about 0.02 DAI. The smart contract will expire on August 1, 2020. Until then, the price at which the token trades will increase if ETH performs better than BTC, decrease if BTC performs better than ETH and stay flat if ETH and BTC move in tandem.<\/span>"],"hashtag":[]}