{"summary":"There will only ever be 21 million bitcoin. Even though it&#x27;s volatile, this hard cap on supply creates an incentive to hold bitcoin to accumulate and build wealth in fiat terms.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/194693\/bitcoin-as-collateral","publishDate":"2023-02-07T08:50:00","id":2821,"type":null,"title":"Bitcoin as Collateral","category":["SPONSORED"],"content":["There will only ever be 21 million bitcoin. Even though it's volatile, this hard cap on supply creates an incentive to hold bitcoin to accumulate and build wealth in fiat terms.","However, despite becoming increasingly recognized as a medium of exchange, it can be difficult to use bitcoin as direct payment. The infrastructure necessary to transact in bitcoin isn’t widely acceptable yet and there may be tax implications from selling your bitcoin or using it to pay for any goods or services.&nbsp; In other words, a bitcoiner would have no choice but to sell their bitcoin to pay for these expenses, incurring potential taxes, and foregoing the potential future appreciation of their bitcoin.","We founded Ledn to provide a new alternative - borrowing dollars using your bitcoin as collateral. Borrowing against your bitcoin does not have the same tax implications as selling it in most jurisdictions, and you continue to own the collateral, which can continue appreciating. We believe it’s the most pristine collateral that has ever existed due to three of its attributes.","<strong data-v-f87c67ca=\"\">Accessibility<\/strong>","Inflation makes it difficult for someone to save enough fiat money to purchase an asset that appreciates over time, like real estate. In economies with unstable monetary policies and authoritarian regimes, the problem gets even worse. But bitcoin can be bought in fractions - so, regardless of your paycheque, you can buy a few dollars or a few thousand dollars worth at a time, and build your wealth incrementally. And bitcoin is available for sale worldwide.","<strong data-v-f87c67ca=\"\">Fungibility<\/strong>","A Bitcoin in Mexico is worth just as many dollars as a bitcoin in the U.S. or Canada. Because we lend against the value of the bitcoin collateral, and not against a person’s credit, we can treat every borrower the same. That means, the same interest rates, quality of service, and terms across the board, regardless of whether you are in Mexico, or Canada.","<strong data-v-f87c67ca=\"\">Liquidity<\/strong>","In the event that a borrower defaults on their loan, bitcoin can be sold 24 hours a day, 365 days a year.&nbsp; There’s no tedious asset-selling process like with other forms of collateral. Since inception, we have processed over $500 Million in bitcoin-backed loans to thousands of clients, and never had a loan loss.","There are also risks to borrowing against your bitcoin, and it's important for borrowers to plan accordingly. Given bitcoin’s volatility, borrowers can be required to post additional collateral if bitcoin price drops - and lenders have the right to sell the client’s bitcoin collateral if additional collateral is not received in time. We understand this, and are constantly working on options to make bitcoin-backed loans safer. One example is our Auto-Top-up feature, whereby clients can opt-in and authorize Ledn to move assets from the client’s Bitcoin Savings account to top up a loan when required.","We believe that borrowing against your bitcoin will be cheaper, faster, and more equitable than borrowing against your house.","Mauricio Di Bartolomeo","Co-founder &amp; CSO of Ledn","For more of Mauricio’s weekly commentary, please check out <a href=\"https:\/\/blog.ledn.io\/en\" data-v-f87c67ca=\"\">blog.ledn.io\/en<\/a>","<em data-v-f87c67ca=\"\">This post is commissioned by Ledn and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ledn","content":"PERSON"},{"type":"Canada","content":"LOCATION"},{"type":"Mauricio’s","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"$500 Million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Mexico","content":"LOCATION"},{"type":"Mauricio Di Bartolomeo","content":"ORGANIZATION"},{"type":"&amp; CSO","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}