{"summary":"Bitcoin mining pool BTC.com, operated by Jihan Wu’s BitDeer Technologies, is getting acquired by Chinese sports-lottery company 500.com.\nThe deal is subject to certain closing conditions. The first closing is expected to occur by April 15, 2021.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/94973\/bitcoin-mining-pool-btc-com-getting-acquired-500-com","publishDate":"2021-02-16T07:05:14","id":2821,"type":null,"title":"Bitcoin mining pool BTC.com is getting acquired by NYSE-listed 500.com","category":["Mining"],"content":["Bitcoin mining pool BTC.com, operated by Jihan Wu's BitDeer Technologies, is getting acquired by Chinese sports-lottery company 500.com.","NYSE-listed 500.com <a href=\"https:\/\/ir.500.com\/2021-02-16-500-com-Limited-Announces-Acquisition-of-BTC-com-Businesses\" data-v-f87c67ca=\"\">announced<\/a> the news on Tuesday, saying that it has entered into a share exchange agreement with Blockchain Alliance Technologies, the parent company of BitDeer, for the deal.","As part of the deal, which is subject to certain closing conditions, 500.com will issue a total of 44.35 million shares of a par value of $0.00005 to Blockchain Alliance at the first closing, which is expected to occur by April 15, 2021.","The exact number of share issuance will depend on BTC.com's profit or loss situation for the current year-end. If it records a net operating profit of a minimum of $20 million, 500.com will issue a maximum of 22.18 million additional shares.","If BTC.com records net operating loss in the year, then 500.com will be entitled to repurchase certain shares held by Blockchain Alliance at par value. \"Assuming such net operating loss is no less than US$10 million, a maximum of 4,435,344 Class A Ordinary Shares shall be subject to such repurchase arrangement,\" said 500.com, which <a href=\"https:\/\/www.prnewswire.com\/news-releases\/500com-limited-entered-into-two-agreements-to-acquire-bitcoin-mining-machines-301219861.html\" data-v-f87c67ca=\"\">recently entered the bitcoin mining space<\/a>.","BitDeer's biggest beneficiary owner is Wu, the company's chairman and former chairman of Bitmain. BTC.com was being operated by BitDeer and Bitmain before <a href=\"https:\/\/www.theblockcrypto.com\/post\/92580\/jihan-wu-letter-officially-step-down-bitmain\" data-v-f87c67ca=\"\">Wu stepped down<\/a> from the Bitmain position last month.","By selling the BTC.com business, Bitmain appears to have a better chance of succeeding at IPO since it won't have cryptocurrencies on its balance sheet. (Bitmain has been trying to go public since 2018).","BTC.com is currently the <a href=\"https:\/\/btc.com\/stats\/pool?pool_mode=week\" data-v-f87c67ca=\"\">fifth-largest<\/a> bitcoin mining pool, based on a 7-day moving average (7DMA) hashrate share, at 14.35 exahash per second (EH\/s). Besides bitcoin, the mining pool also supports ether, bitcoin cash, and litecoin cryptocurrencies.","<iframe title=\"Bitcoin's Hash Rate by Pool\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoins-hash-rate-by-pool\/embed\" width=\"100%\" height=\"420\" frameborder=\"0\" data-v-f87c67ca=\"\"><\/iframe>","The news appears to be a positive development for 500.com, whose <a href=\"https:\/\/finance.yahoo.com\/quote\/wbai?ltr=1\" data-v-f87c67ca=\"\">shares are trading up by over 15%<\/a> at $35.50 in pre-market hours.&nbsp;","Meanwhile, the crypto mining pool space has started to witness mergers and acquisitions in recent weeks. Earlier this month, Chinese bitcoin mining pool <a href=\"https:\/\/www.theblockcrypto.com\/linked\/93875\/bitcoin-mining-pool-poolin-acquires-hashrate-novablock\" data-v-f87c67ca=\"\">Poolin acquired<\/a> the hashrate of rival North America-based NovaBlock to expand in the continent."],"hashtag":["BITCOIN"]}