{"summary":"Crypto brokerage Voyager has added support for 3 stablecoins, including Tether \nThe firm will also offer interest rates on these stablecoins beginning next month\nSteve Ehrlich, CEO of Voyager, told The Block that the firm will announce interest rates “within the next 2 weeks.”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/53092\/commission-free-crypto-broker-voyager-to-offer-interest-on-stablecoins-including-tether","publishDate":"2020-01-15T08:55:58","id":2822,"type":null,"title":"Commission-free crypto broker Voyager to offer interest on stablecoins, including Tether","category":["Stablecoins"],"content":["Cryptocurrency brokerage Voyager Digital has today added support for three stablecoins on its platform - Tether (USDT), USD Coin (USDC), and True USD (TUSD).","The addition brings the total number of supported coins on Voyager to 33, Steve Ehrlich, CEO of Voyager, told The Block, adding: “We are looking to expand as we investigate adding a few other coins over the near future.”","Canada-listed Voyager also plans to offer interest on the stablecoins from next month. Ehrlich told The Block that the firm will announce interest rates “within the next 2 weeks.”","“The value proposition for customers is the ability to trade quickly and earn interest without having to move coins between wallets,” said Ehrlich.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nVoyager currently <a href=\"https:\/\/picante.today\/technology\/2019\/10\/23\/99118\/voyager-digital-launches-new-bitcoin-interest-program\/\" data-v-f87c67ca=\"\">offers<\/a> a 3% interest on bitcoin (BTC) and 5% on ETHOS coin held via its commission-free trading apps.&nbsp;","The CEO declined to share trading volume figures and the number of users Voyager is currently serving, but said: “We see growth month over month since we went live with our IOS app in July and Android in Beta in November. We anticipate Android being fully live by the end of Quarter 1.”","Looking ahead in 2020, Voyager plans to expand its business “both organically and through strategic acquisitions,” and add more features on its platform, including margin and shorting capabilities, Ehrlich told The Block.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"With the addition of our Broker\/Dealer license, Voyager will explore opportunities using that license to enable customers to quickly trade between digital currencies and the equity, option and futures markets, as well as adoption of security tokens,\" he added.","Last October, Voyager <a href=\"https:\/\/www.businesswire.com\/news\/home\/20191001006241\/en\/Voyager-Closes-Acquisition-Ethos-Assets\" data-v-f87c67ca=\"\">acquired<\/a> crypto startup Ethos Assets for a purchase price of its 7,250,000 shares (currently worth about $2 million)."],"hashtag":[]}