{"summary":"Ripple CEO Brad Garlinghouse has said: “We would not be profitable or cash flow positive [without selling XRP].”\nInterestingly, Ripple also incentivizes its client MoneyGram in XRP \nThe Ripple-MoneyGram agreement is scheduled to expire on July 1, 2023","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/57429\/ripple-would-not-be-profitable-without-selling-xrp-says-ceo-garlinghouse","publishDate":"2020-03-02T03:16:14","id":2824,"type":null,"title":"Ripple would not be profitable without selling XRP, says CEO","category":["Ripple"],"content":["Ripple CEO Brad Garlinghouse has indicated that XRP sales form a significant chunk of the company's profitability.","\"We would not be profitable or cash flow positive [without selling XRP],\" Garlinghouse was quoted as saying in a Financial Times <a href=\"https:\/\/ftalphaville.ft.com\/2020\/02\/26\/1582730287000\/The-art-of-redefining-success--MoneyGram-and-Ripple-edition\/\" data-v-f87c67ca=\"\">report<\/a> published Friday.","\"Well XRP is one source. I don't know how to answer that because if you took away our software revenues, that would make us less profitable. If you took away all our XRP, that makes us less profitable. So I don't think about it as one thing,\" Garlinghouse added.","Reacting to the report, crypto trader and analyst Luke Martin <a href=\"https:\/\/twitter.com\/VentureCoinist\/status\/1234215167505948680\" data-v-f87c67ca=\"\">tweeted<\/a> today that Ripple \"stays alive\" by \"dumping\" XRP on the public.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nNotably, Ripple’s total sales of XRP <a href=\"https:\/\/www.theblockcrypto.com\/post\/53835\/ripples-xrp-sales-declined-by-80-in-q4\" data-v-f87c67ca=\"\">declined<\/a> by 80% in Q4. The sharp decline was the result of a drop in direct institutional sales, as well as a pause in Ripple’s programmatic sales, i.e. XRP sales to cryptocurrency exchanges.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Incentivizing clients in XRP?&nbsp;&nbsp;<\/strong><\/span>","Interestingly, Garlinghouse also revealed that companies that use Ripple's solutions are incentivized depending upon \"the shape and size and type and how high a priority\" they are.","Indeed, last week Ripple client MoneyGram <a href=\"https:\/\/www.theblockcrypto.com\/linked\/56948\/ripple-paid-moneygram-11-3-million-in-2019-remittance-firms-ceo-says-trading-volume-continues-to-grow\" data-v-f87c67ca=\"\">disclosed<\/a> that it received $11.3 million from the blockchain payments firm during Q3 and Q4 of 2019. Notably, that amount was paid in XRP, MoneyGram noted in a <a href=\"http:\/\/ir.moneygram.com\/static-files\/0471da4a-0549-419b-a89a-57455b5e8209\" data-v-f87c67ca=\"\">Form 10-K document filed<\/a> Friday.","\"The Company is compensated by Ripple in XRP for developing and bringing liquidity to foreign exchange markets, facilitated by the ODL [Ripple's On-Demand Liquidity] platform, and providing a reliable level of foreign exchange trading activity. We refer to this compensation as market development fees.\"","MoneyGram further noted that it accounts for the XRP received as \"an indefinite-lived intangible asset, which is measured based on the fair market value of the XRP.\"","\"Any future liquidation of such indefinite-lived intangible assets will result in capital gains or losses and will be recorded in 'Occupancy, equipment and supplies' in the Consolidated Statement of Operations,\" MoneyGram added.","The firm further said that it expects the Ripple partnership will help it reduce working capital needs and generate additional earnings and cash flows.","Ripple's agreement with MoneyGram is scheduled to expire on July 1, 2023, per the 10-K filing."],"hashtag":["XRP"]}