{"summary":"Crypto exchange Bithumb has denied media reports which claimed that the exchange’s Shanghai operations have been affected after the city government’s inspection notice\nA Bithumb spokesperson told The Block that the exchange has one team based in Shanghai and “the projects are continuing steadily without pause”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/47896\/bithumb-denies-reports-of-shanghai-operations-being-hit-after-the-city-governments-notice","publishDate":"2019-11-21T04:35:18","id":2825,"type":null,"title":"Bithumb denies reports of Shanghai operations being hit after the city government’s notice","category":["Exchanges"],"content":["South Korean cryptocurrency exchange Bithumb has denied media reports claiming the exchange’s Shanghai operations are hit after the city government’s inspection notice.","“We have one of our blockchain technology research and development teams based in Shanghai and the projects are continuing steadily without pause,” a Bithumb spokesperson told The Block.","Yesterday, the Chinese news outlet ifeng.com, citing another outlet Blocklike, <a href=\"https:\/\/www.weibo.com\/6880773215\/Ih4N5BU8z?type=comment#_rnd1574324600317\" data-v-f87c67ca=\"\">reported<\/a> that Bithumb has sent its Shanghai employees on a \"long vacation\" without disclosing the date of return to work after the Shanghai government's recent notice.","Last week, the Shanghai headquarters of the People's Bank of China (PBoC) and the Shanghai Municipal Financial Regulatory Bureau, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/47273\/report-chinas-central-bank-orders-probe-of-cryptocurrency-activities-in-shanghai\" data-v-f87c67ca=\"\">ordered<\/a> the district administrative offices in Shanghai to investigate cryptocurrency-related activities in the city and complete the inspection by Nov. 22. Once investigated, these firms are to be reported to the PBoC and the financial regulatory bureau and will also be required to shut down their businesses, per the order.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">Another one?<\/strong><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIfeng.com’s report further said that Bithumb’s “official website shows that domestic IP access has been banned” in China.","“These reports are untrue,” the <a href=\"https:\/\/www.theblockcrypto.com\/tag\/bithumb\" data-v-f87c67ca=\"\">Bithumb<\/a> spokesperson further told The Block, adding that the exchange is focused on bringing out its <a href=\"https:\/\/www.businesswire.com\/news\/home\/20191111005703\/en\/Highly-Anticipated-%E2%80%9CBithumb-Coin%E2%80%9D-Officially-Announced-Bithumb\" data-v-f87c67ca=\"\">recently announced<\/a> native blockchain network, Bithumb Chain.","“Bithumb Global attempts to bring all crypto communities together on one simple and decentralized platform. Unity is the key to the development and prosperity of the industry,” Javier Sim, co-founder and managing director of Bithumb Global, told The Block.","The Bithumb Chain network is currently under development and is <a href=\"https:\/\/www.coindesk.com\/bithumb-wants-user-created-dexs-with-its-new-blockchain-ecosystem\" data-v-f87c67ca=\"\">expected to launch<\/a> in the first quarter of 2020. “Bithumb Chain powers the products, services, and infrastructure within the Bithumb Family ecosystem which helps capture value from both upstream and downstream of the trading business,” Sim told The Block.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nRecently, there were also <a href=\"https:\/\/www.theblockcrypto.com\/linked\/41419\/bithumbs-acquisition-deal-worth-over-300m-with-bk-global-could-fall-apart-reports\" data-v-f87c67ca=\"\">reports<\/a> that Bithumb’s sale of a controlling stake for ~$333 million is at risk of falling apart. In October 2018, Bithumb’s parent company BTC Korea Holdings had agreed to sell a 50% stake in the exchange to BK Global Consortium, a blockchain investment firm founded by BK Global, a plastic surgery medical group in Singapore. The deal was expected to close in February of this year, but BK Global has reportedly only paid a down payment of $100 million to BTC Korea Holdings.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe Bithumb spokesperson today declined to comment on this report.&nbsp;"],"hashtag":[]}