{"summary":"Andrew Yang, one of the candidates looking to take on U.S. President Donald Trump in the 2020 presidential election, has detailed his plan to bring in","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/47382\/2020-us-presidential-hopeful-andrew-yang-details-his-plan-to-regulate-crypto-at-a-national-level","publishDate":"2019-11-18T03:00:23","id":2826,"type":null,"title":"2020 US presidential hopeful Andrew Yang details his plan to regulate crypto at a national level","category":["CRYPTOCURRENCY"],"content":["Andrew Yang, one of the candidates looking to take on U.S. President Donald Trump in the 2020 presidential election, has detailed his plan to bring in cryptocurrency regulations in the country.","In a blog post <a href=\"https:\/\/www.yang2020.com\/blog\/regulating-technology-firms-in-the-21st-century\/\" data-v-f87c67ca=\"\">published<\/a> late last week, Yang said cryptocurrencies are seeing levels of fraud because of the lack of regulation and the U.S. needs to catch up ahead of big tech companies and other countries in the space.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBig tech companies have \"amassed too much power, largely profiting from our personal data, and unaccountable responsibility—we have reached a point where the government needs to step in,\" said Yang.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">National framework?&nbsp;<\/strong>","Currently, there is no national framework for regulating cryptocurrencies, said Yang, adding that different departments of the federal government consider digital assets as property, commodities, or securities. Yang called New York’s <a href=\"https:\/\/www.theblockcrypto.com\/tag\/bitlicense\" data-v-f87c67ca=\"\">BitLicense<\/a>, for instance, as “onerous” regulation and that navigating different regulations has had a “chilling” effect on the U.S. digital asset market.","He, therefore, plans to set up a Department of Technology and revive the Office of Technology Assessment, an office of the U.S. Congress which<a href=\"https:\/\/ota.fas.org\/otareports\/year\/1995a\/\" data-v-f87c67ca=\"\"> dissolved<\/a> in 1995.&nbsp; \"This Department, based in Silicon Valley and initially focused on Artificial Intelligence, will be led by a Secretary of Technology who will spearhead public-private partnerships to tackle emerging threats and maximize the benefit of technological innovation to society,\" said Yang.&nbsp;","Specifically, to provide clarity on cryptocurrency regulations, Yang plans to define what a token is, and when it is a security; define which federal agencies have regulatory power over crypto; provide for consumer protections; and clarify the tax implications of owning, selling, and trading cryptocurrencies.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">A \"21st century approach\"<\/strong><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nYang further said that the U.S. Congress members currently lack a basic understanding of blockchain, cryptocurrencies and other technologies, as revealed by recent hearings with tech CEOs like Facebook's <a href=\"https:\/\/www.theblockcrypto.com\/tag\/bitlicense\" data-v-f87c67ca=\"\">Mark Zuckerberg<\/a>.&nbsp; \"It’s embarrassing to see the ignorance some members of Congress display when talking about technology, and anyone who watched Congress question Mark Zuckerberg is well aware of this,\" he said.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe presidential candidate, therefore, plans to adopt \"a 21st century approach\" to regulation that increases \"the knowledge and capacity of government while using new metrics to determine competitiveness and quickly identifies emerging tech in need of regulation.\"","Yang also plans to regulate the use of data and privacy by establishing data as a property right. “The associated rights will enable individuals to retain ownership and share in the economic value generated by their data,” he said.","This is not the first time Yang has <a href=\"https:\/\/www.yang2020.com\/policies\/digital-asset-regulation\/\" data-v-f87c67ca=\"\">called<\/a> for clear regulations in the crypto space. In April, he released a specific position on cryptocurrency policy. More recently, Yang <a href=\"https:\/\/www.theblockcrypto.com\/linked\/37238\/2020-presidential-candidate-andrew-yang-is-in-favor-of-blockchain-voting\" data-v-f87c67ca=\"\">said<\/a> he wants to modernize voting via blockchain technology. Supporters of Yang also launched a super PAC (political action committee) to accept<a href=\"https:\/\/www.theblockcrypto.com\/tiny\/andrew-yang-super-pac-to-exclusively-accept-bitcoin-donations-for-the-first-21-days\/\" data-v-f87c67ca=\"\"> bitcoin donations.<\/a>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"1995","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Yang","content":"PERSON"},{"type":"Artificial Intelligence","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Andrew Yang","content":"PERSON"},{"type":"Mark Zuckerberg","content":"PERSON"},{"type":"Yang","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"U.S. Congress","content":"ORGANIZATION"},{"type":"Donald Trump","content":"PERSON"},{"type":"This Department","content":"ORGANIZATION"},{"type":"Office of Technology Assessment","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"April","content":"DATE"},{"type":"Department of Technology","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}