{"summary":"Binance Angels recovered the equivalent of 98,000 USDC on behalf of a user who transferred their funds to the wrong network address. Learn about the BNB Pioneer Program, an initiative designed to help users recover funds in emergency cases like Damien’s, and the different scenarios in which users are eligible to recover lost funds. \n\nLearn more about the Binance Angels, the passionate volunteers within our community, and how you can become one yourself.You’ve heard about these stories on the internet—a mistake that all crypto users fear and dread—sending funds to the wrong network address.\n\nA user from our French community named Damien recently made this mistake, sending 98,000 in USDC to the incorrect address, which resulted in the funds being lost forever. Typically, these funds are lost forever in the blockchain, but thanks to the help of the French community and the Binance Angels, Damien was, fortunately, able to recover all his funds. Let’s take a look at this rescue operation, which may be, knock on wood, helpful to you one day (we hope not, but hey…)","author":["Sponsored","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/120252\/case-solved-how-binance-angels-recovered-98000-in-crypto-on-behalf-of-a-binance-user","publishDate":"2021-10-13T08:57:31","id":2827,"type":null,"title":"Case Solved: How Binance Angels Recovered $98,000 in Crypto On Behalf of a Binance User","category":["The Block"],"content":["","","<span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">On May 19th, after a productive day of yield farming, Damien transferred his funds, totaling 98,000 in USDC, from his Metamask wallet to his Binance wallet.&nbsp;<\/span>","<span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">During this transfer, Damien made a common mistake. While trying to swap his USDC to USDT, Damien inadvertently sent his transaction to the wrong address. Within a few seconds of making the transaction on Metamask, he realised his inadvertent mistake: the last address he copied and pasted for the transfer was not the address of his Binance.com wallet, but that of the USDC smart contract.<\/span>","<span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">We can all empathize with Damien's distress when he saw his funds disappear from the result of one simple mistake. In the world of blockchain, there are varying chances of recovering lost funds depending on the type of wrong network transfer. Make sure you’re prepared for all scenarios and read our guide for <\/span><a class=\"css-wze8kf\" href=\"https:\/\/academy.binance.com\/en\/articles\/how-to-recover-crypto-transferred-to-the-wrong-network-on-binance\" data-bn-type=\"link\" data-v-f87c67ca=\"\"><span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">recovering lost funds from wrong network transfers<\/span><\/a><span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">.<\/span>","<span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">Finally, after much research, Damien ended up sharing his story on Binance’s French-speaking Telegram community, which is composed of over 23,000 people and moderated by Binance Angels.&nbsp;<\/span>","<span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">After explaining the story to community moderators, comprised of the Binance Angels, Damien was informed that his funds could be recovered if it met the criteria of the <\/span><a class=\"css-wze8kf\" href=\"https:\/\/www.binance.com\/en\/support\/announcement\/7bcf4da5671d44a0a5118c2277773bb4\" data-bn-type=\"link\" data-v-f87c67ca=\"\"><span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">BNB Pioneer Burn Program<\/span><\/a><span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">, a new initiative which aims to help restore funds incurred due to accepted cases of user error on&nbsp; Binance Smart Chain. Under the BNB Pioneer Burn Program, Binance will cover the losses of eligible users and count the lost tokens against Binance’s quarterly burns.&nbsp;<\/span>","<span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">The Angels helped pull a successful recovery effort <\/span><span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">and fortunately for the user, his case met all the criteria for the <\/span><a class=\"css-wze8kf\" href=\"https:\/\/www.binance.com\/en\/support\/announcement\/7bcf4da5671d44a0a5118c2277773bb4\" data-bn-type=\"link\" data-v-f87c67ca=\"\"><span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">Pioneer Burn Program<\/span><\/a><span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">. In just 24 hours after his mishap, Damien received the entire lost sum back from Binance.&nbsp;<\/span>","<span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">At Binance, protecting our users is one of our top priorities and we understand that user error can affect anyone, even long-time crypto enthusiasts. The Pioneer Burn Program is just one of many initiatives as part of our efforts to develop a safe and responsible crypto ecosystem and community. Read below to see the cases where Binance’s BNB Pioneer Burn can help you recover lost funds on the Binance Smart Chain.<\/span>","<span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">Read the <\/span><a class=\"css-wze8kf\" href=\"https:\/\/www.binance.com\/en\/support\/announcement\/7bcf4da5671d44a0a5118c2277773bb4\" data-bn-type=\"link\" data-v-f87c67ca=\"\"><span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">full announcement<\/span><\/a><span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\"> for more details about the BNB Pioneer Burn.<\/span>","<span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">We are fortunate to have a fast-growing and passionate community of French-speaking users and Binance Angels mobilising to help first-time and experienced blockchain users alike. Our Binance Angels are community volunteers who wish to share their knowledge of the world of cryptocurrencies, especially within the Binance ecosystem. In addition to helping new users, managing online and offline communities and translating content, Binance Angels will also help users, like Damien, in emergency cases.&nbsp;<\/span>","<span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">Whether you’re a crypto enthusiast, a first-time or long-time supporter, you can all contribute something to the ecosystem! All you have to do is sign up for the<\/span><a class=\"css-wze8kf\" href=\"https:\/\/jobs.lever.co\/binance\/cd108578-1fc7-4a29-a8a8-49dcd179007c\" data-bn-type=\"link\" data-v-f87c67ca=\"\"> <span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">Binance Angel volunteer program.&nbsp;<\/span><\/a>","<span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">As an Angel, you’ll get exclusive invites to Binance events, either as a VIP guest or organiser, and meet and work alongside the Binance team, attending behind-the-scenes meetings and providing feedback and suggestions on new features. Most importantly, we’ll reward your hard work with limited-edition swag, gifts and prizes exclusive to Binance Angels. Beyond the perks and the cool people you meet, our Angel program is also a good way to learn and improve in many different areas through the many roles you can take on.<\/span>","<span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">The volunteers who participate in this program are essential to helping us run our different social channels. Since every individual is unique, we'll help place you into a team that suits your skills best. At the moment we need passionate Angels to help new and old Binance users with their questions and concerns, provide our team with feedback and suggestions to help us grow, help foster our online and offline communities and translate and proofread content. Although each role has a different set of responsibilities, every Angel in our program has <\/span><span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">learned how to understand the needs of the community and make an impact in the blockchain industry.<\/span> <a class=\"css-wze8kf\" href=\"https:\/\/jobs.lever.co\/binance\/cd108578-1fc7-4a29-a8a8-49dcd179007c\" data-bn-type=\"link\" data-v-f87c67ca=\"\"><span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">Become a Binance Angel today!<\/span><\/a>","<span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">Follow Binance on<\/span><a class=\"css-wze8kf\" href=\"https:\/\/twitter.com\/binance\" data-bn-type=\"link\" data-v-f87c67ca=\"\"> <span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">Twitter<\/span><\/a> <span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">or<\/span><a class=\"css-wze8kf\" href=\"https:\/\/www.facebook.com\/binance\" data-bn-type=\"link\" data-v-f87c67ca=\"\"> <span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">Facebook<\/span><\/a> <span class=\"css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">for more information.<\/span>"],"hashtag":[]}