{"summary":"Both crypto exchanges said today that they’ll list the BRC-20 token on their platforms when liquidity requirements are met.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262136\/kucoin-and-gate-exchanges-to-list-brc-20-memecoin-sats","publishDate":"2023-11-08T06:01:29","id":2827,"type":null,"title":"KuCoin and Gate exchanges to list BRC-20 memecoin Sats","category":["EXCHANGES"],"content":["Crypto exchanges Gate and KuCoin are planning to list Sats — a memecoin based on the Ordinals <a href=\"https:\/\/www.theblock.co\/post\/229757\/bitcoin-based-brc-20-tokens-combined-market-value-eclipses-900-million\" data-v-f87c67ca=\"\">BRC-20 token standard<\/a> — on their platforms soon.","Gate <a href=\"https:\/\/twitter.com\/gate_io\/status\/1722188470108537181\" data-v-f87c67ca=\"\">opened<\/a> deposits for Sats at 4 a.m. EST earlier today. Meanwhile, KuCoin said will enable deposits, with trading estimated to start at 5 a.m. EST on Nov. 9, provided the token deposits meet the liquidity requirement, per its <a href=\"https:\/\/www.kucoin.com\/announcement\/en-sats-sats-gets-listed-on-kucoin\" data-v-f87c67ca=\"\">announcement<\/a>. The trading pair SATS\/USDT will be available on KuCoin, the exchange added.","Sats is a memecoin created on Bitcoin through the Ordinals protocol, named after ‘satoshis,’ the smallest unit of Bitcoin. The token is currently trading at <a href=\"https:\/\/www.coingecko.com\/en\/coins\/sats-ordinals\" data-v-f87c67ca=\"\">$0.00000012<\/a> with a diluted market capitalization of $270 million. Unisat data <a href=\"https:\/\/unisat.io\/brc20\/sats\" data-v-f87c67ca=\"\">indicates<\/a> that Sats is held in 39,000 user wallets on the Bitcoin network.","These planned listings of Sats come just a day after Binance <a href=\"https:\/\/www.binance.com\/en\/support\/announcement\/binance-will-list-ordi-ordi-with-seed-tag-applied-4bd64404aa384fe5a00e0f9b131035db\" data-v-f87c67ca=\"\">announced<\/a> it would list Ordi, another popular BRC-20 memecoin for trading.","Memecoins constitute the majority of tokens created using the Ordinals protocol, and are designated as BRC-20 tokens. This term is named in analogy to the ERC-20 token standard on the Ethereum blockchain, although their mechanisms differ.","Introduced by developer Casey Rodarmor in early 2023, the Ordinals protocol allows developers to assign a distinct identity or file onto every satoshi within the Bitcoin network, a process called inscription. This mechanism set the stage for the development of both fungible (interchangeable) tokens, like BRC-20 tokens, and non-fungible tokens (NFTs), which frequently showcase digital art.","While the Ordinals core team devised a method for generating NFTs on Bitcoin, another pseudonymous developer named Domo introduced an experimental token standard built upon the Ordinals protocol called BRC-20 in March. This enabled users to issue fungible tokens like ordi and others with the help of incsribing specific files to satoshis.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ordinals <a href=\"https:\/\/www.theblock.co\/post\/229757\/bitcoin-based-brc-20-tokens-combined-market-value-eclipses-900-million\" data-v-f87c67ca=\"\">BRC","content":"ORGANIZATION"},{"type":"KuCoin","content":"PERSON"},{"type":"$0.00000012","content":"MONEY"},{"type":"USDT","content":"ORGANIZATION"},{"type":"earlier today","content":"DATE"},{"type":"Casey Rodarmor","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"20","content":"DATE"},{"type":"Nov. 9","content":"DATE"},{"type":"March","content":"DATE"},{"type":"BRC","content":"ORGANIZATION"},{"type":"4 a.m. EST","content":"TIME"},{"type":"$270 million","content":"MONEY"},{"type":"5 a.m. EST","content":"TIME"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BITCOIN"],"authors":["Timmy Shen","The Block"]}