{"summary":"Jae Kwon, co-founder of Cosmos, is initiating a fork of the Cosmos Hub after a proposal was passed to place a 10% cap on Atom’s inflation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/264717\/cosmos-founder-to-airdrop-forked-atom1-tokens-to-voters-against-reducing-hub-inflation","publishDate":"2023-11-27T04:48:22","id":2828,"type":null,"title":"Cosmos founder to fork Hub and airdrop ATOM1 tokens","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Cosmos co-founder Jae Kwon is forking the <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Cosmos Hub <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248377\/cosmos-hub-atom-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/cosmos_hub.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ATOM<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.0026%\n    <\/span><\/a> <!----><\/span><\/span>, the central chain of the Cosmos network, after the community approved proposal 848. The proposal sets the maximum inflation of the Hub’s native token, Atom, at 10%.<\/span>","The fork will result in a new network, AtomOne, with the associated token, ATOM1. The launch plans include rewarding the genesis supply to existing ATOM holders, with more rewards to those who opposed the proposal 848. Meanwhile those who voted yes to the proposal will be “slashed” and they may receive fewer tokens.","Roughly 10% will be pre-mined for various purposes, as stated in a <a href=\"https:\/\/github.com\/atomone-hub\/genesis\" data-v-f87c67ca=\"\">document<\/a> by Kwon. The Interchain Foundation will not be included in the airdrop.","The controversial proposal to limit Atom’s inflation rate <a href=\"https:\/\/www.theblock.co\/post\/264683\/cosmos-community-approves-capping-atom-inflation-rate-at-10?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">passed<\/a> narrowly yesterday with 41.1% support against 38.5% opposition, in the most popular vote in the Cosmos ecosystem’s history. Advocates argued that Atom’s inflation was higher than necessary for maintaining security and that validators could remain profitable with a 10% inflation rate.","Kwon, who developed the Cosmos network’s Tendermint consensus algorithm and co-founded the Hub, voiced opposition to this decision due to his concerns about the change's impact on network security. Unwilling to accept the vote’s outcome, he is now determined to split the Cosmos Hub despite many community members <a href=\"https:\/\/twitter.com\/cosmonaut_joon\/status\/1728585409461199289\" data-v-f87c67ca=\"\">requesting<\/a> him not to do so. The Hub serves as the central blockchain of the Cosmos ecosystem, with Atom being integral for staking, governance, and transaction fees.","The forked network will use the same underlying software of the existing Cosmos Hub, known as Gaia, with the chain ID “cosmoshub4,” maintaining key features such as IBC and <a href=\"https:\/\/www.theblock.co\/post\/219219\/cosmos-hub-releases-replicated-security\" data-v-f87c67ca=\"\">interchain security<\/a>. It will preserve the original maximum inflation rate of 20% to reward validators and stakers adequately. Additionally, Kwon has proposed a separate fee token, Photon (phATOM1), to operate in conjunction with ATOM1.&nbsp;","Kwon said the new token aims to replace the original design of the Hub with changed governance mechanisms, such as altering the quorum threshold for passing governance decisions from less than 50% on the Hub to two-thirds on the new network. Overall the forked Hub would have a simplistic design, focusing on security.","This fork will be separate from Kwon’s other Layer 1 blockchain project in development named Gno.Land.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gaia","content":"LOCATION"},{"type":"Cosmos Hub <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248377\/cosmos-hub-atom-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/cosmos_hub.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ATOM","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Jae Kwon","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"38.5%","content":"PERCENT"},{"type":"10%","content":"PERCENT"},{"type":"Kwon","content":"PERSON"},{"type":"20%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"IBC","content":"ORGANIZATION"},{"type":"Interchain Foundation","content":"ORGANIZATION"},{"type":"+0.0026%","content":"PERCENT"},{"type":"Cosmos","content":"LOCATION"},{"type":"Cosmos Hub","content":"ORGANIZATION"},{"type":"41.1%","content":"PERCENT"}],"hashtag":["COSMOS","DAOS","GOVERNANCE VOTES"],"authors":["Vishal Chawla","The Block"]}