{"summary":"An “Initial Litigation Offering” is looking to fund a case against a California county by offering a tokenized stake in any resulting recovery. \nLaw firm Roche Freedman LLP and investment platform Republic are behind the new initiative, which they say will help the public access litigation finance — a traditionally private area of investment.","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/122044\/first-tokenized-lawsuit-fund-goes-live-on-republic-will-distribute-on-avalanche","publishDate":"2021-10-26T13:58:51","id":2831,"type":null,"title":"First tokenized lawsuit fund goes live on Republic, will distribute on Avalanche","category":["The Block"],"content":["A law firm and a major investment platform are selling tokenized stake in a California suit.&nbsp;","The \"initial litigation offering,\" or ILO takes its inspiration from initial coin offerings, but instead opens up retail investment in litigation finance, a primarily private field that <a href=\"https:\/\/www.zionmarketresearch.com\/report\/litigation-funding-investment-market\" data-v-f87c67ca=\"\">some expect<\/a> to reach $20 billion in revenue in a matter of years.&nbsp;","<a href=\"https:\/\/www.bakersfield.com\/news\/federal-lawsuit-says-kcso-destroyed-researchers-hemp-without-warning-or-adequate-testing\/article_a40c70a4-7e7a-11ea-9ddb-6340e36e1d84.html\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">The case<\/a> is Apothio, LLC v. Kern County, California. The plaintiff says that Kern County's Sheriff Department destroyed Apothio's crop land in 2019, with officials alleging that the Apothio's hemp crop had exceeded its legal THC limits. The suit seeks up to $1 billion in damages.&nbsp;","The ILO, which begins its <a href=\"https:\/\/republic.co\/apothio\" data-v-f87c67ca=\"\">sale today<\/a>, seeks $5 million in investment from retail users on Republic's platform, which is known for <a href=\"https:\/\/www.theblockcrypto.com\/post\/119748\/republic-is-offering-security-nfts\" data-v-f87c67ca=\"\">tokenizing previously inaccessible investments<\/a> for such users. Users will have to create Avalanche wallets to receive the tokens, which Ava Labs is helping to program.&nbsp;","The Block initially reported on Ava Labs' work to <a href=\"https:\/\/www.theblockcrypto.com\/post\/87491\/litigation-financing-investment-token-avalanche\" data-v-f87c67ca=\"\">tokenize litigation finance<\/a> in December, before any lawsuit was looking for such a means of financing.&nbsp;","Meanwhile, the market for ICOs, particularly for retail investors in the U.S., has effectively died out in the past two years due to a more assertive Securities and Exchange Commission. A core of many of Republic's offerings involves exemption from full SEC registration. This ILO is operating under the crowdfunding exemption, which allows public investment up to a fairly low funding threshold.&nbsp;","In addition to Republic, this ILO is an initiative of Roche Freedman, a law firm known for representing the estate of Dave Kleiman in the case against Craig Wright, as well as a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/103137\/class-actions-against-binance-tron-and-others-stumble-after-bibox-court-victory\" data-v-f87c67ca=\"\">host of class-action suits<\/a> against token issuers. Founder and partner Kyle Roche told The Block that he was confident in the future of ILOs for funding legal affairs because they fit within the SEC's crowdfunding so well.","“It’s maybe not enough for every company looking to raise capital, but a $5 million cap is perfect for this,” said Roche.","If the court dismisses the lawsuit, investors get 80% of their money back. Beyond that point, they either lose their investment if the plaintiffs lose the case, or they get between 2x and 3.5x returns, depending on the timeline of a settlement or judgment. The tokens themselves are not governance tokens and do not give any rights to investors over decisions in the case.&nbsp;"],"hashtag":[]}