{"summary":"“Crypto Stripe” Wyre releases new widget to enable Apple Pay, Google Pay for crypto purchases\nIt could serve as a much needed on-ramp for the crypto world","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/43362\/crypto-stripe-releases-widget-that-will-let-you-on-ramp-into-crypto-with-apple-pay","publishDate":"2019-10-15T11:02:19","id":2832,"type":null,"title":"&quot;Crypto Stripe&quot; releases widget that will let you on-ramp into crypto with Apple Pay","category":["Bitcoin"],"content":["\"One of the goals is to get everyone from zero to crypto kitties in under 20 seconds.\"","That's one of the underpinning principles guiding Michael Dunworth, the chief executive of cryptocurrency firm Wyre. The San Francisco-based firm is active in many different corners of the digital asset world, launching in 2016 as a cross-border payments play. It's dabbled in over-the-counter trading. And some market observers have likened them to Stripe — the financial technology unicorn that sits between merchants and consumers as a payments processor.&nbsp;","But, for Australian-native Dunworth, building out new crypto on-ramps to make the emerging market more approachable \"for grandma\" is underpinning everything the firm does. As part of the effort, the company <a href=\"https:\/\/blog.sendwyre.com\/wyre-onramps-solved-b5ea0bdae361\" data-v-f87c67ca=\"\">has announced<\/a> exclusively to The Block the release of a new widget that will allow folks to buy crypto with Apple Pay or Google Pay— making on-ramps into crypto as simple as sending an iMessage.&nbsp;","","","&nbsp;","I say almost because there are a few more steps than Apple Pay fiat.&nbsp;","The way it works is a bit more simpler than opening up a crypto wallet or an account on an exchange and funding it through a direct bank deposit. A user needs to log in via their iPhone — or desktop browser of choice if using Google Pay — enter the amount of crypto she wants to buy, type in an address to sent to, and then use the mobile payment option of choice. In total, it takes about 1 minute.&nbsp;","Wyre told The Block that fees to use widget to fund transactions would mirror card transaction fees or, 2.9% + 30 cents out of the gate. The company intends to lower them to 1% towards the end of the year.","Speed and ease of use aren't what is meaningful from an adoption standpoint, according to market commentators.&nbsp;","One former payment analyst noted that the widget provides an on-ramp for the millions of people who have hardware mobile payment capabilities. Apple Pay, which launched in 2014, has been growing at a fast clip, according to chief executive officer Tim Cook, who said during the firm's Q3 earnings call that its service was outpacing the growth of PayPal.&nbsp;","\"Based on June quarter performance, Apple Pay is now adding more new users than PayPal and monthly transaction volume is growing four times as fast,\" he said.&nbsp;","Indeed, Apple said in its earnings report that Apple Pay is completing more than 1 billion transactions per month. As per Apple gawker 9to5mac, that figure is double the number of transactions the firm said it executed during the same quarter last year. In total, 43% of iPhone users have enabled the service, according to Digital Transactions.&nbsp;","Dunworth says the firm worked with a number of payment processors in getting the app off the ground, and is focused on iterating the offering to match what's comfortable for users in different regions across the globe."],"hashtag":["DAI","PAYMENTS"]}