{"summary":"Framework Ventures has invested $400,000 into Futureswap, a decentralized futures exchange, and $500,000 into Common Labs, the developer of proof-of-stake blockchain Edgeware\nThe firm was an early investor and one of the largest holders of Chainlink’s and Synthetix’ tokens\nAccording to the firm’s co-founder Michael Anderson, the DeFi space’s current deficiencies lie in many projects’ lack of sound token economic model and governance model.","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/58234\/defi-focused-venture-firm-framework-ventures-invests-900000-in-common-labs-and-futureswap","publishDate":"2020-03-10T09:08:49","id":2834,"type":null,"title":"Framework Ventures invests $900,000 in Common Labs and Futureswap","category":["DeFi"],"content":["<span data-v-f87c67ca=\"\">Framework Ventures, an SF-based venture firm focused on decentralized finance (DeFi), has announced its $900,000 investment in Commonwealth Labs and FutureSwap.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Framework Ventures co-founder Michael Anderson, the startup venture firm is an early investor of Chainlink and Synthetix and one of the largest holders of their tokens. Both Anderson and the other co-founder, Vance Spencer, were angel investors in Chainlink – when the project first launched in 2017. In Oct. 2019, Framework Ventures led <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/44994\/defi-project-synthetix-raises-3-8m-from-framework-ventures\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Synthetix’ $3.8M funding round<\/span><\/a><span data-v-f87c67ca=\"\"> and purchased 5 million Synth (SNX) tokens from the Synthetix Foundation’s treasury.<\/span>","<span data-v-f87c67ca=\"\">In a new round of investments, Framework Ventures is putting $400,000 into <\/span><a href=\"https:\/\/futureswap.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Futureswap<\/span><\/a><span data-v-f87c67ca=\"\">, a decentralized futures exchange, and $500,000 into Common Labs, the developer of proof-of-stake blockchain <\/span><a href=\"https:\/\/edgewa.re\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Edgeware<\/span><\/a><span data-v-f87c67ca=\"\">. In addition, the firm has locked 20,000 ETH in Edgeware’s lockdrop to help advance the network’s distribution.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Anderson told The Block that Framework Ventures takes a different approach than most venture capital firms and support the networks’ development beyond the simple purchase of coins. According to him, traditionally, venture capitalists would buy and hold these assets, hedge funds would trade the tokens to make a return, and other companies would build applications on top of the protocols.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Our perspective is that the way the best way to proliferate these networks is actually to do all three of those things,” he said. “We have a venture-style investment thesis in the assets that we back. We help the market add liquidity and help bootstrap a network by providing a validator network. And we will also build things on top of the networks to enhance distribution for the protocols.”<\/span>","<span data-v-f87c67ca=\"\">Framework Ventures recently helped Futureswap structure their token economics, Anderson said, and is planning on providing liquidity to the network in the low-single-digit millions range once the project launches.<\/span>","<span data-v-f87c67ca=\"\">With Common Labs, Framework Ventures is operating some of the first validator nodes on the Edgeware network. The firm is also running for council – similar to running for a seat on a DAO. In addition, it is helping the Common Labs team think through strategic decisions of what application categories to go after. The firm also has plans to build products and features on top of the Edgeware blockchain.<\/span>","<span data-v-f87c67ca=\"\">“There's a huge amount of value for someone like Framework to actually step in and help just because as infant blockchains they don't really have everything that you would expect from something like Ethereum or Tezos,” he said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Anderson believes that the DeFi space’s current deficiencies lie in many projects’ lack of sound token economic model and governance model.<\/span>","<span data-v-f87c67ca=\"\">“DeFi is something that has a huge opportunity of displacing centralized finance,” he said. “To do so, you really need to build a token economic model and a governance model that can displace BitMEX, Binance, or major lending platforms.”<\/span>","<span data-v-f87c67ca=\"\">Looking forward, Anderson said Framework Ventures will focus on projects working on derivatives and lending and borrowing. Stablecoins will also be a category of focus for the firm.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“A stablecoin is perfect for building consumer applications on top of,” he said. “Once you have a distributed stablecoin, that becomes the payment mechanism for things like commerce, games, or content, as opposed to using Eth or Bitcoin payment mechanism.”<\/span>"],"hashtag":[]}