{"summary":"Flamingo, a NGD (Neo Global Development) incubated, full-stack DeFi protocol, is set to undergo its first major upgrade with newly designed mechanisms for cross-chain interoperability, yield boosting, as well as on-chain derivatives.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/93350\/next-on-flamingo-the-blueprint-of-defi-interoperability","publishDate":"2021-02-03T10:48:31","id":2834,"type":null,"title":"Next on Flamingo: The Blueprint of DeFi Interoperability","category":["SPONSORED"],"content":["Flamingo, a NGD (Neo Global Development) incubated, full-stack DeFi protocol, is set to undergo its first major upgrade with newly designed mechanisms for cross-chain interoperability, yield boosting, as well as on-chain derivatives.","Flamingo (and Flamincome) first major upgrades are set to go live along with FIP#2. The upgrades contain 3 major new features: yToken and xToken from Flamincome side, and Perp from Flamingo side.","Initially designed to reduce opportunity costs for cross-chain users, Flamincome enabled Ethereum users to yield farm via Flamingo while enjoying a return rate equivalent to yearn finance. With this unique “dual mining” model, Flamincome had the chance to experiment on translating cross-chain gateway into an asset management product.","The upgraded version of Flamincome will split yield farming and cross-chain functionalities by introducing two key asset types—yToken and xToken. Miners and cross-chain users will enter through y and x channels respectively; xToken holders enjoy an instant and bi-directional atomic cross-chain solution but is not entitled for yield distribution on Flamincome, and yToken holders are entitled for all yields generated from the strategy pool, making yToken the only interest and liquidation-risk-free leverage asset. xToken can become the standardized ETH asset cross chain channel for any target chain due to its strong value-anchoring nature.","<strong data-v-f87c67ca=\"\">yToken<\/strong><strong data-v-f87c67ca=\"\">：leveraged yielding asset<\/strong>","The upgraded Flamincome platform can be treated as the leveraged Yearn. Underlying assets for xToken generation will be pooled together with underlying assets of yToken and put into the strategy contract. Leveraged by xToken, yToken holders are guaranteed with higher APYs than any other existing Yearn-like protocol.","Every yToken represents (x+y)\/y farming productivity, resulting in multiplied mining productivity. The degree of leverage will be determined automatically by the demand of cross-chain users.","<strong data-v-f87c67ca=\"\">xToken: pegged cross-chain asset<\/strong>","The upgraded Flamincome will offer users with a real-time atomic asset cross-chain experience by using the xToken as a cross-chain channel the cross-chain contract. Users do not need to interact with the xToken directly as the minting and burning of xToken will be automatically executed by the cross-chain contract. With xToken, cross-chain transactions will be streamlined for an optimized user experience with a low-cost, instant, and atomic manner to maintain a strong price peg between xToken and its underlying assets.","<strong data-v-f87c67ca=\"\">Perp：vAMM-based perpetual for any asset<\/strong>","Flamingo is also set to launch Perp, the perpetual contract trading for virtually any asset, as an indispensable module within Flamingo, the full-stack DeFi protocol cluster on Neo. Perp enables DeFi users to long or short any financial asset without acctually holding it, as long as it has a commonly accepted price. Based on vAMMs (Virtual Automated Market Maker), users can execute transactions without counterparties. Users can also use Perp as an innovative and powerful tool for risk-hedging of virtually any asset.","<strong data-v-f87c67ca=\"\">DeFi beyond Ethereum<\/strong>","The cross-chain functionality on Flamingo is not only about staking and releasing of assets between blockchains, but more importantly, is about coupling products across various blockchains to optimize capital efficiency as well as user returns.","<strong data-v-f87c67ca=\"\">&nbsp;<\/strong>","&nbsp;"],"entity":[{"type":"Flamincome","content":"PERSON"},{"type":"NGD (Neo Global Development","content":"ORGANIZATION"},{"type":"Flamingo","content":"ORGANIZATION"},{"type":"Flamingo","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}