{"summary":"Crypto exchange Binance has added one more channel to its fiat gateway \nThe exchange has partnered with payments processor Koinal, giving users an additional avenue to pay for crypto with debit and credit cards\nThe Koinal integration brings the total number of Binance’s fiat gateway channels to four ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/41011\/binance-adds-one-more-channel-to-its-fiat-gateway-allowing-users-to-pay-for-crypto-with-debit-and-credit-cards","publishDate":"2019-09-25T07:00:05","id":2837,"type":null,"title":"Binance adds one more channel to its fiat gateway, allowing users to pay for crypto with debit and credit cards","category":["Exchanges"],"content":["Cryptocurrency exchange Binance has just added one more channel to its fiat gateway, giving users more options to pay for cryptocurrencies.","The exchange announced Wednesday that it has partnered with London-based payments processor Koinal for the new channel. It will allow Binance users to buy five cryptocurrencies - bitcoin (BTC), bitcoin cash (BCH), ether (ETH), litecoin (LTC) and XRP - with Visa and MasterCard debit and credit cards, as well as via wire bank transfers.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“Koinal offers very competitive fees. It charges a 2.5% processing fee,” a Binance spokesperson told The Block, on choosing Koinal over other payments processing firms.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"The Koinal integration allows users to purchase cryptocurrencies with any local currency via debit or credit cards at low fees. The portal is powered by Koinal and hosted on Binance.com, where users can easily make purchases and check their deposit history after logging into Binance,\" the spokesperson added.","Binance CEO Changpeng Zhao “CZ” said in the announcement that the move is aimed at “bringing crypto further mainstream,” adding that the exchange “will continue to build fiat-to-crypto gateways in our effort to increase accessibility and adoption of crypto.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe spokesperson told The Block that the exchange plans to \"continue evaluating more quality fiat-crypto channels to increase the world's accessibility to crypto.\"","Today’s integration with Koinal brings the total number of such partnerships by Binance at four. Previously, the exchange has <a href=\"https:\/\/www.binance.com\/en\/buy-sell-crypto\" data-v-f87c67ca=\"\">partnered<\/a> with <a href=\"https:\/\/www.theblockcrypto.com\/post\/9662\/binance-opens-the-fiat-floodgates-accepting-credit-card-payments-for-crypto\" data-v-f87c67ca=\"\">Simplex,<\/a> Paxos and TrustToken for its fiat gateway channels.","Simplex is an Israel-based payments processing firm, and allows users to buy BTC, BCH, ETH, LTC, XRP and Binance’s native coin BNB, with Visa and MasterCard debit and credit cards. Simplex <a href=\"https:\/\/www.binance.com\/en\/support\/articles\/360022498052\" data-v-f87c67ca=\"\">charges<\/a> a fee of 3.5% per transaction or $10, whichever is higher.","Paxos and TrustToken channels, on the other hand, support only bank transfers. The former allows purchasing Binance USD (BUSD) and Paxos Standard (PAX) stablecoins, while the latter allows purchasing only TrueUSD (TUSD). <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBUSD is Binance's native stablecoin, which is pegged 1:1 to the U.S. dollar. It was <a href=\"https:\/\/www.theblockcrypto.com\/post\/38607\/binance-launching-its-own-usd-pegged-stablecoin-busd-with-paxos-as-custodian\" data-v-f87c67ca=\"\">launched<\/a> earlier this month and is approved by the New York State Department of Financial Services (NYDFS).","<em data-v-f87c67ca=\"\">This story has been updated to include comments from a Binance spokesperson.&nbsp;<\/em>"],"hashtag":["BINANCE","BNB","XRP"]}