{"summary":"The Solana network clock has lost its sync with real-world time and is now running about half an hour behind.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/149112\/solanas-blockchain-clock-loses-track-of-time-now-running-30-minutes-behind","publishDate":"2022-05-27T08:44:46","id":2837,"type":null,"title":"Solana&#x27;s blockchain clock loses track of time, now running 30 minutes behind","category":["CRYPTOCURRENCY"],"content":["Solana’s (SOL) blockchain clock is currently adrift of real-world time by about 30 minutes due to longer than ideal slot times on the network, the project <a href=\"https:\/\/status.solana.com\/\" data-v-f87c67ca=\"\">reported<\/a> via its status page on Thursday.","According to the notice posted at 3:34 UTC, the issue does not have any impact on network performance. Transactions on the network will, however, show timestamps that are different from “wall-clock time,” as the statement put it.","This time disparity is one of the effects of the current slower slot times on Solana. Slot time refers to the time interval within which a validator can submit a block to the network.","Solana’s ideal slot time is 400 milliseconds (ms) but this value has almost doubled to about 746ms, according to <a href=\"https:\/\/explorer.solana.com\/\" data-v-f87c67ca=\"\">data<\/a> from the Solana blockchain explorer dashboard.","While Solana is a proof-of-stake blockchain, the network also uses proof-of-history (PoH) as a consensus algorithm. PoH takes care of Solana’s timekeeping by enabling each node on the network to maintain an accurate record of time.","Solana uses clusters, a collection of validators that are responsible for processing transactions on its blockchain. PoH allows for decentralized timekeeping across all the nodes in a cluster.","When slot times become significantly longer than 400ms, the cluster’s clock begins to drift, that is to say, it loses synchronicity with real-world time.","Apart from on-chain timekeeping being out of sync with real-world time, the slow slot time issue could also have some economic consequences related to annualized staking rewards.","When slot times are slower, epochs become longer since there must be 432,000 slots in every epoch. At the ideal 400ms slot time, there are 182 epochs per year with each epoch lasting between two and three days. Slower slot times, therefore, mean fewer epochs.","Solana’s staking rewards are paid on each epoch. As such, fewer epochs will mean a reduction in the earnings collected by delegators and validators on the network.","This reduction in staking yield is also in addition to the fact that SOL, like other coins, has declined significantly since the start of the year.","Solana is no stranger to these <a href=\"https:\/\/www.theblockcrypto.com\/post\/131278\/traders-are-complaining-about-solanas-performance-raising-questions-about-its-status-as-a-wall-street-darling\" data-v-f87c67ca=\"\">operational and performance issues<\/a>. The network has <a href=\"https:\/\/www.theblockcrypto.com\/linked\/144639\/solana-restarted-after-seven-hour-outage-caused-by-surge-of-transactions\" data-v-f87c67ca=\"\">suffered outages<\/a> on different occasions with the blockchain not processing transactions for several hours at a time.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Solana","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"}],"hashtag":["SOLANA"],"authors":["Osato Avan-Nomayo","The Block"]}