{"summary":"Multicoin Capital is leading a $20 million Series A in blockchain startup Solana, with the participation of BlockTower Capital, Passport Capital, Foundation Capital, Slow Ventures, and others\nThe startup is developing a scalable blockchain that relies on a unique technique that can prove the order of transactions mathematically ","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/33888\/multicoin-capital-leads-18m-investment-in-a-blockchain-that-produces-several-blocks-at-once","publishDate":"2019-07-30T07:40:29","id":284,"type":null,"title":"Multicoin Capital leads $20M investment in a blockchain that timestamps transactions mathematically","category":["Layer 1s"],"content":["<span data-v-f87c67ca=\"\">Throw a stone at any blockchain conference and there's a 50\/50 shot you will hit someone who is developing a new blockchain. Even with this level of saturation, VCs’ appetite for more blockchain projects remains insatiable.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Multicoin Capital, BlockTower Capital, Passport Capital, Distributed Global, Foundation Capital, Slow Ventures and others are throwing $20 million into blockchain project, Solana, which claims to process 50,000 transactions per second (TPS), according to an announcement on Tuesday.<\/span>","<span data-v-f87c67ca=\"\">The San Francisco-based startup prides itself on being a scalable, layer 1 blockchain that does not involve the security risk usually associated with sharding, a technique projects such as Ethereum and Telegram Open Network are exploring to scale their blockchains.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“What stands out about us is that we are not sharding,” said Solana CEO Anatoly Yakovenko. “Every other project that is working on scaling is working on sharding, and sharding sacrifices security. There is no other way around it.”&nbsp;&nbsp;<\/span>","Indeed, Ronghui Gu, a computer science professor at Columbia University and the founder of another blockchain project named CertiK, agrees that Solana's approach can eliminate 1% shard attack. However, he also points out that \"I don't think Solana’s approach of using block history as a time source has an inherent impact on security. The trade-off here is mostly on its assumption of attack frequencies and patterns. In some cases, it could face serious resource contention and congestions.\"","<span data-v-f87c67ca=\"\">Solana proposes a solution called “the Proof of History.” Through the so-called Verifiable Delay Function, the Solana network can provide proofs of time-lapse between two transactions and guarantee mathematically that the timestamp on each transaction is true. This way, the network reduces the time spent on preventing people from producing the same block due to not being able to verify the timestamp on each block, according to Yakovenko.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">By the Holy Grail of the scalability trilemma, if a blockchain is both scalable and secure, it may sacrifice decentralization, meaning the network may be susceptible to censorship. Generally speaking, the more nodes a network has, the more censorship-resistant it is. Currently, Solana is running a permissionless testnet configured to support 200 nodes, which the startup said is on par with other proof-of-stake networks looking into scaling.<\/span>","<span data-v-f87c67ca=\"\">“We’ve been communicating the number 200 publicly based on comparisons to other current proof of stake networks. We looked at the Tezos, Cosmos, and Algorand networks, which are currently in the 100-200 validators range,” said Yakovenko. “The Solana network will not specify a limit of nodes. It can grow to support as many nodes as is economically rational.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Prior to the Series A, Solana raised more than $5 million from two seed rounds backed by 500 Startups and Proof of Capital’s Chris McCann, among others. With the newly raised capital, the company is looking to ramp up its engineering team in preparation for the launch of its mainnet in October.&nbsp;<\/span>"],"hashtag":[]}