{"summary":"H.M. Revenue &amp; Customs (HMRC), the British tax authority, has confirmed to The Block that it has sought customer information from Coinbase UK and other crypto platforms searching for tax evaders.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/79722\/uk-hmrc-coinbase-tax-data-customers","publishDate":"2020-10-02T12:13:51","id":2840,"type":null,"title":"Tax authority HMRC confirms data collection from Coinbase, exchange says less than 3% of U.K. customers impacted","category":["CRYPTOCURRENCY"],"content":["H.M. Revenue &amp; Customs (HMRC), the British tax authority, has confirmed to The Block that it has sought customer information from Coinbase U.K. and other crypto platforms searching for tax evaders.","“We want to help people get their tax affairs right and believe that taxpayers want to get it right,” an HMRC spokesperson told The Block. “HMRC regularly gathers data from a range of information sources using powers provided by Parliament. Data collected by HMRC is used to improve the integrity of the tax system and to identify those that have failed to declare their gains.”","A spokesperson of Coinbase also confirmed the development, telling The Block that HMRC contacted the exchange in September 2019 requesting information about U.K. customers.","“These requests are commonplace for financial services companies. Through a series of constructive conversations with HMRC, we agreed upon on a more limited and focused disclosure, eventually narrowing it down to customers with a U.K. address who received more than £5,000 worth of crypto assets in their Coinbase account during the tax year of 2019\/20,” said the spokesperson.","They went on to say that the development would affect less than 3% of Coinbase’s customers in the U.K.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">'Reduced scope'<\/strong><\/span>","Earlier today, Coinbase sent an email to select U.K. users, a copy of which was reviewed by The Block, saying that it would share their account information with HMRC.","“The original notice that we received from HMRC required Coinbase to provide certain records from 2017-2019 relating to all customers of our U.K. business,” the email reads. “Based on further discussions with HMRC, a revised notice with reduced scope was issued that now requires the disclosure of customers with a U.K. address who received more than £5,000 worth of crypto assets on the Coinbase platform during the course of the 2019\/2020 tax year. This includes both purchases or receipts of crypto to your Coinbase account.”","HMRC contacted Coinbase last year as well, along with eToro U.K. and CEX.IO, asking them to send over information on U.K. residents who had moved money on their platforms.","This time, eToro U.K. hasn’t received any HMRC requests, an eToro spokesperson told The Block when reached. CEX.IO did not respond to The Block’s queries by press time.","The Block also reached out to Bitstamp, which declined to comment on the matter. Kraken and Luno also did not respond to The Block’s queries by press time.","HMRC’s move is similar to its U.S. counterpart, the Internal Revenue Service (IRS), and other regulators. In August, the IRS <a href=\"https:\/\/www.theblockcrypto.com\/linked\/76021\/irs-letters-taxes-crypto-2020\" data-v-f87c67ca=\"\">sent a new batch of letters<\/a> to suspected crypto holders about whether they correctly reported their transactions.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2017","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"3%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Luno","content":"PERSON"},{"type":"the IRS","content":"ORGANIZATION"},{"type":"U.K.","content":"LOCATION"},{"type":"2019","content":"DATE"},{"type":"September 2019","content":"DATE"},{"type":"H.M. Revenue &amp; Customs","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Bitstamp","content":"LOCATION"},{"type":"Coinbase U.K.","content":"LOCATION"},{"type":"Internal Revenue Service (IRS","content":"ORGANIZATION"},{"type":"Parliament","content":"ORGANIZATION"},{"type":"HMRC","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":["COINBASE","HMRC"],"authors":["Yogita Khatri","The Block"]}