{"summary":"The financial regulators published a consultation paper, hoping to gain more powers to regulate issuers of ‘fiat-referenced stablecoins.’","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/269292\/hong-kong-proposes-licenses-should-be-required-for-stablecoin-issuers","publishDate":"2023-12-27T05:28:28","id":2841,"type":null,"title":"Hong Kong proposes licenses should be required for stablecoin issuers","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">Hong Kong has proposed that stablecoin issuers should be required to obtain a license in the city as part of its legislative proposal to oversee the industry.<\/span>","<span data-v-f87c67ca=\"\">In a <\/span><a href=\"https:\/\/www.info.gov.hk\/gia\/general\/202312\/27\/P2023122700279.htm?fontSize=1\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">consultation paper<\/span><\/a><span data-v-f87c67ca=\"\"> jointly published today by the Hong Kong Monetary Authority — the city’s de facto central bank — and the Financial Services and the Treasury Bureau, the authorities said that a stablecoin issuer would be required to obtain a license from the HKMA “if it issues a stablecoin that references the value of one or more fiat currencies in Hong Kong.”<\/span>","<span data-v-f87c67ca=\"\">Under the proposed regime, such a licensee must be locally incorporated with its management presence and needs to put in place an effective stabilization mechanism, “such as maintaining a pool of high-quality and highly-liquid reserve assets with proper custody arrangement,” the HKMA said.<\/span>","<span data-v-f87c67ca=\"\">“Only stablecoins issued by licensed issuers could be offered to retail investors,” the regulator added.<\/span>","<span data-v-f87c67ca=\"\">The HKMA said it published the latest consultation paper after it “took into account” the feedback collected from the public for a relevant <\/span><a href=\"https:\/\/www.hkma.gov.hk\/eng\/news-and-media\/press-releases\/2022\/01\/20220112-3\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">discussion paper<\/span><\/a><span data-v-f87c67ca=\"\"> it released in January 2022. <\/span><span data-v-f87c67ca=\"\">It also plans to roll out a “sandbox” for those interested in issuing stablecoins in Hong Kong, with details to be announced soon.<\/span>","<span data-v-f87c67ca=\"\">The authorities will collect public feedback on the legislative proposal until Feb. 29, 2024.<\/span>","<span data-v-f87c67ca=\"\">The legislation proposal also suggested that the authorities should be granted “necessary powers” to “adjust the parameters of in-scope stablecoins and activities.”<\/span>","<span data-v-f87c67ca=\"\">Considering the potential impact of a default or failure of a fiat-referenced stablecoin issuer on the financial system, “it is proposed that the [HKMA] be empowered to intervene in the operations of a licensee where the circumstances so warrant,” the document said.<\/span>","<span data-v-f87c67ca=\"\">Johnny Ng, a Hong Kong lawmaker, expressed concerns in a <\/span><a href=\"https:\/\/twitter.com\/Johnny_nkc\/status\/1739915243160289562\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">post<\/span><\/a><span data-v-f87c67ca=\"\"> on X, saying that the regulators should consider the fact that some major global stablecoins are already circulating in the market.<\/span>","<span data-v-f87c67ca=\"\">“If these global stablecoin companies do not apply [for a license] in Hong Kong within the specified period, relevant regulatory authorities should consider how such international stablecoins could be traded on licensed exchanges in Hong Kong,” Ng said. “Otherwise, it may affect the overall operations and trading volume of crypto transactions, leading to unintended consequences in the market.”<\/span>","<span data-v-f87c67ca=\"\">Unlike its neighboring Chinese mainland’s broader crackdown on cryptocurrency trading and mining, Hong Kong has rolled out the welcome mat for crypto firms this year — even going so far <\/span><a href=\"https:\/\/www.theblock.co\/post\/228743\/hong-kong-crypto-bank-accounts\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">as encouraging banks to work with them<\/span><\/a><span data-v-f87c67ca=\"\">. <\/span><span data-v-f87c67ca=\"\">In June, Hong Kong officially started its crypto licensing regime for virtual asset trading platforms, allowing licensed exchanges to offer retail trading services.<\/span>","<span data-v-f87c67ca=\"\">Last week, the HKMA and the Securities and Futures Commission said in a joint circular that they’re <\/span><a href=\"https:\/\/www.theblock.co\/post\/268981\/hong-kong-says-its-ready-to-accept-spot-crypto-etf-applications\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">prepared to start accepting applications<\/span><\/a><span data-v-f87c67ca=\"\"> for spot crypto exchange-traded funds (ETFs). Some industry leaders have said that Hong Kong <\/span><a href=\"https:\/\/www.theblock.co\/post\/268582\/industry-leaders-see-hong-kong-as-next-bitcoin-etf-hub-amid-us-approval-anticipation\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">could be one of the earliest front-runners<\/span><\/a><span data-v-f87c67ca=\"\"> in Asia to allow spot bitcoin ETFs <\/span><a href=\"https:\/\/www.theblock.co\/post\/267720\/gensler-says-secs-new-look-at-spot-bitcoin-etf-applications-has-involved-recent-court-rulings\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">if the U.S. approves such ETFs<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Feb. 29, 2024","content":"DATE"},{"type":"fiat","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Securities and Futures Commission","content":"ORGANIZATION"},{"type":"Hong Kong Monetary Authority","content":"ORGANIZATION"},{"type":"January 2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Johnny Ng","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Asia","content":"LOCATION"},{"type":"Financial Services","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Treasury Bureau","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"HKMA","content":"ORGANIZATION"}],"hashtag":["ASIAN PARLIAMENTS","ASIAN REGULATION","CRYPTO"],"authors":["Timmy Shen","The Block"]}