{"summary":"Kavita Gupta has left her role as head of ConsenSys Ventures, taking up an advisory position as well as teaching at Stanford\nShe has been with the firm since its inception in 2017\nThe VC firm launched with $50 million of ConsnSys founder Joe Lubin’s funds, but reportedly ran into resource issues","author":["Isabel Woodford","Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/22221\/founding-partner-kavita-gupta-is-stepping-down-from-consensys-ventures","publishDate":"2019-05-06T15:39:29","id":2842,"type":null,"title":"Founding Partner, Kavita Gupta, Steps down from ConsenSys Ventures","category":["Startups"],"content":["<span data-v-f87c67ca=\"\"><a href=\"https:\/\/www.theblockcrypto.com\/2019\/01\/07\/hiking-trips-plan-bs-and-finding-the-human-behind-the-tech-how-consensys-ventures-chief-seeks-out-her-next-success-​\/\" data-v-f87c67ca=\"\">Kavita Gupta<\/a>, head of ConsenSys Ventures, is stepping down, she has told The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Gupta was hired to lead ConsenSys Ventures when it <a href=\"https:\/\/cointelegraph.com\/news\/ethereum-cofounder-launches-venture-capital-arm-with-50-mln-investment\" data-v-f87c67ca=\"\">launched in <\/a>September 2017 in San Francisco, overseeing a $50 million budget financed by Joseph Lubin, the co-founder of the Ethereum Foundation and ConsenSys. <\/span><span data-v-f87c67ca=\"\">With notable investments including crypto lending startup Blockfi and blockchain infrastructure company StarkWare, Gupta steered ConsenSys' VC arm into what is now one of the most esteemed venture firms in the blockchain ecosystem. In total, Gupta <a href=\"https:\/\/www.theblockcrypto.com\/2019\/05\/06\/mapping-out-consensys-ventures-portfolio\/\" data-v-f87c67ca=\"\">led investments<\/a> and mentoring of 40 startups in more than 11 subcategories, from crypto trading platforms to gaming studio [see full list <a href=\"https:\/\/www.theblockcrypto.com\/2019\/05\/06\/mapping-out-consensys-ventures-portfolio\/\" data-v-f87c67ca=\"\">here<\/a>].&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In an interview with <a href=\"https:\/\/www.theblockcrypto.com\/2019\/01\/07\/hiking-trips-plan-bs-and-finding-the-human-behind-the-tech-how-consensys-ventures-chief-seeks-out-her-next-success-​\/\" data-v-f87c67ca=\"\">The Block in January<\/a>, Gupta sidestepped the question of how long she expected her tenure to last. Nonetheless, <\/span> sources say that she has known she was leaving since November. Gupta's departure coincides with parent company ConsenSys' plan to<a href=\"https:\/\/www.theblockcrypto.com\/tiny\/consensys-looks-to-raise-200m-generated-21m-in-revenue-in-2018\/\" data-v-f87c67ca=\"\"> raise a $200 million round<\/a> to finance its operation. It endured a difficult period after the 2018 price slide, <span data-v-f87c67ca=\"\"><a href=\"https:\/\/cointelegraph.com\/news\/consensys-exec-layoffs-did-not-exceed-10-percent-mainly-affect-support-staff\" data-v-f87c67ca=\"\">laying off<\/a> around 13% of its employees by the end of 2018 and generating only $21 million in revenue in the same year. Meanwhile, the<\/span> firm also decided to integrate ConsenSys Ventures with ConsenSys Labs incubator under one investment arm, <a href=\"https:\/\/content.consensys.net\/wp-content\/uploads\/2019050_-ConsenSys-investment-press-release.pdf\" data-v-f87c67ca=\"\">announced today<\/a> in a press release.","Gupta has previously worked at McKinsey and HSBC, as well as on the trading floor at the World Bank. She told The Block she will now be moving into an advisory role, but is transitioning to teach at Stanford University for two years.","\"I will remain at ConsenSys as an advisor to various projects and will continue to help existing portfolio companies at Ventures and Tachyon to help them scale to the next level,\" she said. \"I’m also making myself available to brainstorm great ideas with anyone in the mesh [and] will be open to connecting them to others in her network. I truly believe in the mission and vision of Joe [Lubin] and will always be open to help expand that.\""],"hashtag":[]}