{"summary":"Hong Kong-based DeFi protocol Linear Finance reported an attack on Thursday that drained liquidity of its Linear USD token. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/252408\/linear-finance-reports-attack-that-drained-linear-usd-liquidity-on-pancakeswap-and-ascendex","publishDate":"2023-09-21T13:18:17","id":2846,"type":null,"title":"DeFi protocol Linear Finance reports attack that drained ℓUSD liquidity","category":["POLICY"],"content":["Hong Kong-based DeFi protocol <a href=\"https:\/\/www.theblock.co\/post\/77236\/defi-linear-finance-raises-1-8-million-synthetic-asset-exchange\" data-v-f87c67ca=\"\">Linear Finance<\/a> reported an attack on Thursday that drained liquidity of its <a href=\"https:\/\/linear.finance\/defi\/Linear_Whitepaper_EN.pdf\" data-v-f87c67ca=\"\">Linear USD<\/a> token.&nbsp;","\"The Linear Finance protocol was subject to an attack that resulted in the draining of all ℓUSD liquidity on both PancakeSwap and Ascendex, resulting in the price of ℓUSD going to zero,\" Linear Finance wrote in a <a href=\"https:\/\/medium.com\/linear-finance\/%E2%84%93usd-exploit-283f2d32a2f3\" data-v-f87c67ca=\"\">blog post<\/a>.&nbsp;","\"The attacker was able to mint an unlimited supply of ℓAAVE and subsequently traded the liquid asset to ℓUSD on the Linear Exchange, prior to selling it on PancakeSwap and Ascendex.\"","Following the attack, the protocol paused contracts that enable token minting, burning or exchanging, disabled the ℓUSD Linear bridge contract, began tracking the attacker and shared the wallets associated with the exploit with major exchanges and authorities.&nbsp;","Linear Finance is attempting to rectify the situation and un-do the damage for its users, it added.&nbsp;","Linear Finance did not immediately respond to a request for comment from The Block.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Linear Finance","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Linear Exchange","content":"ORGANIZATION"}],"hashtag":["CRIME"],"authors":["MK Manoylov","The Block"]}