{"summary":"Bybit, one of the largest crypto futures exchanges, has entered the crypto spot trading market.\nBybit will also launch options trading “later this year,” CEO Ben Zhou told The Block.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/111453\/crypto-derivatives-exchange-bybit-spot-trading-xrp","publishDate":"2021-07-15T02:05:08","id":2847,"type":null,"title":"Crypto derivatives exchange Bybit launches spot trading","category":["Exchanges"],"content":["Bybit, one of the largest crypto derivatives exchanges based in Singapore, has expanded into the crypto spot trading market.","Announcing the news on Thursday, Bybit said spot trading in bitcoin (BTC), ether (ETH), XRP, and EOS is now available to users against the Tether (USDT) stablecoin. More trading pairs will follow shortly, it said.","Bybit says it won't charge any maker fees for spot trading, which are levied for providing liquidity to the market in the form of buy or sell limit orders. Binance, the world's largest crypto exchange, for instance, <a href=\"https:\/\/www.binance.com\/en\/fee\/schedule\" data-v-f87c67ca=\"\">charges<\/a> 0.1000% maker fees for trading a volume worth less than 50 bitcoin.","Bybit's zero maker fees is a \"life-long\" feature and not a limited-time offer, the exchange's founder and CEO Ben Zhou told The Block. Bybit's taker fees are 0.1% of trading volume, he said. Taker fees are usually higher than maker fees <span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">as taker orders are matched immediately against an order already on the order book, which removes<\/span><strong data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;<\/span><\/strong><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">liquidity​.<\/span>","Bybit was founded in 2018 and is currently the second-largest bitcoin futures exchange in terms of open interest and trading volumes, <a href=\"https:\/\/www.theblockcrypto.com\/data\/crypto-markets\/futures\" data-v-f87c67ca=\"\">according to The Block's Data Dashboard<\/a>. When asked why launch spot trading now, Zhou said it will allow the exchange to serve more customers.","\"Now that we are comfortably at the top of the derivatives-only lane, and managed to stay operational throughout the bull run as virtually all our peers experienced overload and downtime, we feel it is time that we brought the same level of reliability Bybit has embodied in derivatives to spot,\" said Zhou.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/futures\/volume-of-bitcoin-futures-monthly\/embed\" title=\"Volume of Bitcoin Futures\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Bybit will also launch options trading \"later this year,\" Zhou told The Block.","When asked how Bybit will ensure the liquidity of the spot trading offering, Zhou said there is an incentive program in place for market makers and currently \"all\" market makers are already plugged into the exchange's testing environment.","Like Bybit's derivatives offering, spot trading won't be available to residents of the U.S., mainland China, Singapore, Quebec (Canada), Iran, Syria, North Korea, and <a href=\"https:\/\/help.bybit.com\/hc\/en-us\/articles\/360039750013-Service-Restricted-Countries\" data-v-f87c67ca=\"\">other restricted jurisdictions<\/a>.","Earlier this year, Bybit <a href=\"https:\/\/www.theblockcrypto.com\/linked\/97527\/uk-fca-warning-bybit-before-crypto-derivatives-exchange-announced-ceasing-services-in-country\" data-v-f87c67ca=\"\">ceased<\/a> its services in the U.K. following a warning from the country's Financial Conduct Authority. Last month, the Ontario Securities Commission <a href=\"https:\/\/www.theblockcrypto.com\/linked\/109165\/canadian-securities-regulator-adds-bybit-to-purge-of-unregistered-crypto-exchanges\" data-v-f87c67ca=\"\">began<\/a> proceedings against Bybit, accusing the exchange of operating an unregistered crypto trading platform in Ontario, Canada."],"hashtag":["XRP"]}