{"summary":"The integration will allow Indian users to purchase cryptocurrency directly within the MetaMask wallet app through Onramp.money&#x27;s API","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210067\/metamask-adds-onramp-money-to-streamline-crypto-purchases-in-india","publishDate":"2023-02-09T06:31:45","id":2850,"type":null,"title":"MetaMask adds Onramp.money to streamline crypto purchases in India","category":["COMPANIES"],"content":["MetaMask has integrated with Onramp.money, an Indian provider of crypto-to-fiat on-ramp services.","The integration will allow Indian users to purchase cryptocurrency directly within the <a href=\"https:\/\/www.theblock.co\/post\/208058\/metamask-rolls-out-updates-to-privacy-settings-for-new-and-existing-users\" data-v-f87c67ca=\"\">MetaMask<\/a> wallet app through Onramp.money's API, which supports local payment methods such as UPI and IMPS.","\"We are excited to partner with Onramp.money to bring instant transaction services to our users in India,\" said Lorenzo Santos, product manager at MetaMask. \"We believe this will help drive the adoption of blockchain technology in India.\"","Despite a challenging regulatory environment for cryptocurrency assets in India, with a <a href=\"https:\/\/www.theblock.co\/post\/132552\/india-crypto-tax-30-budget-cbdc-blockchain\" data-v-f87c67ca=\"\">30% tax<\/a> on crypto gains and a 1% tax deducted at source, this integration will make it easier for Indian users to acquire assets on the Ethereum, Polygon, and BNB Chain and use them within decentralized applications. The lack of regulatory clarity from the government and the difficulty of finding banking channels for on-ramping remain challenges in the crypto market in India.","In the recent budget speech for the 2023-24 financial year given by Nirmala Sitharaman, the Indian Finance Minister did not mention any reforms or policies for cryptocurrency assets. Nevertheless, both Sitharaman and other government officials have <a href=\"https:\/\/economictimes.indiatimes.com\/news\/economy\/policy\/india-aims-at-developing-tech-driven-regulatory-framework-for-cryptocurrency-fm-nirmala-sitharaman\/articleshow\/94891216.cms\" data-v-f87c67ca=\"\">emphasized<\/a> the requirement for a uniform approach to regulating cryptocurrency, in accordance with worldwide policies, in order to provide clear guidelines for crypto users in the country.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BNB","content":"ORGANIZATION"},{"type":"UPI","content":"ORGANIZATION"},{"type":"Polygon","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"India","content":"LOCATION"},{"type":"1%","content":"PERCENT"},{"type":"MetaMask","content":"ORGANIZATION"},{"type":"Lorenzo Santos","content":"PERSON"},{"type":"Nirmala Sitharaman","content":"PERSON"},{"type":"30%","content":"PERCENT"}],"hashtag":["WALLETS"],"authors":["Vishal Chawla","The Block"]}