{"summary":"The options product is expected to launch mid-2021.\nThe company has also launched a suite of lending products in recent weeks.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/98441\/crypto-market-maker-b2c2-options-lending-products","publishDate":"2021-03-16T09:01:16","id":2851,"type":null,"title":"Crypto market maker B2C2 launches options and lending products","category":["Capital Markets"],"content":["London-based crypto market maker B2C2 is making a push into options trading and lending following its <a href=\"https:\/\/www.reuters.com\/article\/b2c2-m-a-sbi-holdings-idUSKBN28P1SY\" data-v-f87c67ca=\"\">acquisition<\/a> by SBI Financial Services, the Japanese finance group.","The options desk is not expected to begin trading until mid-2021. B2C2 currently offers cash trading against a range of cryptocurrencies, as well as contracts for difference, but said in a press release that heightened client demand for “more sophisticated hedging instruments” drove its decision to branch out.","The company has hired Brad Nagela to lead the new business. Nagela has spent time in senior FX roles at Citi, Bank of America and Societe Generale — as well as at BlueCrest Capital Management, the hedge fund. He is based in Chicago.","Most recently, he worked for Powerblockcoin, where he built a risk management system for crypto options, futures, swaps and spot trading.","Having already established itself as a major liquidity provider in spot crypto markets, and with the balance sheet and credentials of SBI behind it, B2C2 is hoping to grow the options team quickly.","“We think we’re going to be a position right away to provide liquidity to some of the larger institutions,” said Nagela, in an interview with The Block.","In Europe, Johannes Woolard, who has spent eight years as CTO of FX market maker Lucid Markets, has also joined B2C2 to run the options business out of the region.","A key building block for the options offering is B2C2’s new lending platform, which quietly went live earlier this year.","Last month, the company launched term deposits which allow institutional clients to earn yield on their crypto holdings. More recently, B2C2 rolled out a secured lending product through which clients can borrow money collateralized 100% by cryptocurrency. Both products are run electronically.","The firm enters a crowded market, with incumbents like Genesis Capital <a href=\"https:\/\/www.theblockcrypto.com\/post\/92569\/genesis-global-trading-q4-crypto-loans-trades\" data-v-f87c67ca=\"\">having originated<\/a> billions of dollars worth of loans. Stateside, there's also BlockFi—which recently <a href=\"https:\/\/www.theblockcrypto.com\/post\/97974\/blockfi-confirms-series-d-3-billion-valuation\" data-v-f87c67ca=\"\">announced<\/a> a blockbuster Series D—and Mike Novogratz's Galaxy Digital. B2C2's move into lending reflects the <a href=\"https:\/\/www.theblockcrypto.com\/post\/98336\/falconx-fundraise-hedge-funds-bitcoin\" data-v-f87c67ca=\"\">broader growth<\/a> in the industry's growing credit market, which many firms view as a lucrative new revenue stream.&nbsp;","“We’re essentially going to try to build something that looks like the full suite of products that corporate and institutions have at investment banks,” said Nagela. “And we’re going to be able to leverage SBI’s client base so that, day one, we have a ton of clients that have cryptocurrency holdings.”"],"hashtag":["LENDING"]}