{"summary":"Visa has bought CryptoPunk 7610 as it enters into the world of NFT commerce.\n“NFTs are an intersection of culture and commerce,” Visa’s head of crypto Cuy Sheffield told The Block.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/115333\/visa-buys-cryptopunk-first-steps-nft-commerce","publishDate":"2021-08-23T06:23:01","id":2853,"type":null,"title":"Visa buys a CryptoPunk as it takes first steps into &#x27;NFT commerce&#x27;","category":["NFTs"],"content":["Payments technology company Visa announced Monday that it has bought a CryptoPunk as it enters into the world of non-fungible token (NFT) commerce.","Visa bought <a href=\"https:\/\/www.larvalabs.com\/cryptopunks\/details\/7610\" data-v-f87c67ca=\"\">CryptoPunk 7610<\/a>, one of 3,840 female punks, for around $150,000 last week. CryptoPunks are considered the original NFTs, launched in 2017 by Larva Labs. These are a collection of 10,000 pixel art images of misfits and eccentrics. Each CryptoPunk has its own personality and unique combination of features.","\"We felt that CryptoPunks would be a great addition to our collection of artifacts that can chart and celebrate the past, present, and future of commerce,\" Visa's head of crypto, Cuy Sheffield, told The Block in an interview.","Visa owns several vintage pieces related to commerce as part of its art collection, including early paper credit cards and knuckle busters, a device merchants used to record credit card transactions before the advent of electronic point-of-sale terminals, said Sheffield.","When asked why Visa added a CryptoPunk to the collection, Sheffield said CryptoPunks \"pioneered the NFT technology and wave of NFT commerce,\" so Visa wanted to own a punk. He said the decision was less about the individual punk but more about CryptoPunks in general, given that it is a historical NFT project.","Visa worked with Anchorage Digital to buy the CryptoPunk, meaning Anchorage facilitated the transaction and is custodying the NFT for Visa, said Sheffield. \"We purchased it from Anchorage using fiat,\" he said. Visa first partnered with Anchorage earlier this year to settle payments in the USDC stablecoin on Ethereum.","Visa believes NFTs will play an important role in the future of commerce.","NFTs can help individual content creators and small and medium-sized businesses in new ways, said Sheffield. \"NFTs are an intersection of culture and commerce,\" he added.","Sheffield compared NFTs with the early days of e-commerce, saying that e-commerce made it possible for a small business to sell online and reach customers worldwide. But they still have to produce and ship physical goods, which can have high upfront costs. So NFTs allow a small business to harness a public blockchain to create digital goods, which can be delivered instantly to a crypto wallet anywhere in the world, said Sheffield. \"We can envision a future where a crypto address becomes as important as your mailing address,\" he said.","Visa is seeing \"pretty significant\" interest from merchants, brands, and content platforms that are looking to participate in the NFT space. \"So now we're committing to starting to help clients navigate ways that they can participate in the NFT commerce ecosystem,\" said Sheffield.","Visa has also published a <a href=\"https:\/\/usa.visa.com\/content\/dam\/VCOM\/regional\/na\/us\/Solutions\/documents\/visa-nft-whitepaper.pdf\" data-v-f87c67ca=\"\">whitepaper on NFTs<\/a> to help businesses understand how they can integrate NFTs into their platforms and how Visa can help.","As Visa's core role, the company wants to help consumers purchase NFTs, and merchants accept payment for NFTs as easily as they do for traditional goods and e-commerce, said Sheffield.","Visa is currently \"actively engaging\" with a number of its clients, helping them understand ways to participate in the NFT ecosystem, said Sheffield, declining to provide specific names.","Visa set up its internal crypto team in 2019 and has taken several initiatives in the space since then. Visa recently became the first major payments network to use a stablecoin to settle a transaction. It has also set its sights on facilitating central bank digital currency or <a href=\"https:\/\/www.theblockcrypto.com\/daily\/102347\/visa-merchants-cbdc-central-bank-digital-currency\" data-v-f87c67ca=\"\">CBDC payments<\/a>, as The Block reported recently.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to subscribe to The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/t.me\/the_block_crypto\" target=\"_blank\" rel=\"noopener noreferrer\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Telegram<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>"],"hashtag":["CRYPTOPUNKS"]}