{"summary":"P2P bitcoin trading platform Paxful has added over 800,000 wallets in the past 12 months \nThe majority of the growth has come from African countries – Nigeria, Ghana and Kenya \nArtur Schaback, co-founder and COO of Paxful, told The Block that the three countries are “restricted by traditional financing,” hence the growth ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/44475\/p2p-bitcoin-trading-platform-paxful-adds-800k-wallets-in-the-past-12-months-driven-by-growth-in-africa","publishDate":"2019-10-24T09:00:30","id":2854,"type":null,"title":"P2P bitcoin trading platform Paxful adds 800K wallets in the past 12 months, driven by growth in Africa","category":["Bitcoin"],"content":["Peer-to-peer (P2P) bitcoin exchange Paxful has seen increased volumes from users in Nigeria, Ghana, Kenya, U.S. and India in the past 12 months. Terming it a “major growth milestone,” Paxful said it added over 800,000 wallets during the period and now services a total of 3 million wallets.","“We’ve seen 15 million trades across the platform during the past year, a 65% increase versus the previous time period,” Paxful announced Thursday, adding that Kenya and India, in particular, have shown continued volume growth in recent weeks.","Overall, Nigeria, Ghana and Kenya are Paxful’s “big markets,” because users in these African countries are “restricted by traditional financing,” Paxful co-founder and COO, Artur Schaback, told The Block.","Earlier today, cryptocurrency exchange <a href=\"https:\/\/www.theblockcrypto.com\/linked\/44466\/binances-direct-fiat-to-crypto-trading-facility-goes-live-starting-with-nigerian-naira-pairs\" data-v-f87c67ca=\"\">Binance also listed<\/a> the first direct fiat-to-cryptocurrency trading pairs, starting with Nigerian naira (NGN). A Binance spokesperson told The Block that Nigeria is \"absolutely a promising market with great potential\" with a population of nearly 200 million people.","As for Paxful, the U.S. and India are also top markets, Schaback told The Block, adding that the average transaction size on the platform is “at a little over US$100.”","Paxful credited the volume and wallets growth to its “continued efforts in building a community” that focuses on education about P2P finance.","Paxful rival LocalBitcoins recently<a href=\"https:\/\/localbitcoins.com\/blog\/id-verification-update\/\" data-v-f87c67ca=\"\"> strengthened<\/a> its KYC processes. For instance, someone who trades on its platform for up to 1,000 euros (~$1,110) in a year, will have to provide their full name, country of residence, email address and phone number. For a higher amount of trades, they have to provide additional information.","When asked if these measures by LocalBitcoins helped Paxful with its volumes, Schaback told The Block: “We aren’t aware of whether this is directly related. However, we also take compliance and security very seriously,” adding:","“Paxful requires users around the world who reach an equivalent of $1,500 in trade volume or wallet activity to verify their accounts through ID verification. In addition, users who reach $10,000 in trade volume or wallet activity must provide ID verification as well as address verification.”","Paxful currently only supports bitcoin on its platform and wants to remain as a bitcoin-only platform, Schaback told The Block, adding: “We believe that there should only be one cryptocurrency to make the financial revolution happen.”","Paxful is “completely bootstrapped” and “profitable since its inception,” Schaback told The Block but declined to disclose the firm’s revenues and valuation. The current headcount of Paxful is 200 and it is “continuously hiring for new talents.”"],"hashtag":[]}