{"summary":"Next week, the Bellatrix upgrade is scheduled to take place, maneuvering Ethereum one step closer to The Merge.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/167697\/the-week-aheads-three-biggest-cryptocurrency-stories-2","publishDate":"2022-09-04T05:51:12","id":2855,"type":null,"title":"The week ahead&#x27;s three biggest cryptocurrency stories","category":["CRYPTOCURRENCY"],"content":["The crypto community may still be reeling from the after-effects of the market downturn, but technologically speaking there's a lot to look for. Next week will see the first major part of The Merge take place — setting the stage for the main upgrade later this month.","On a separate note, more than one airdrop is in the cards.","Ethereum’s move to proof of stake takes center stage this week as the first part of the two-part upgrade is set to take place. Bellatrix, set for Sept. 6, will prepare the Ethereum blockchain for the The Merge. Ethereum node runners have been asked to update their clients in preparation for Bellatrix and to ensure a smooth transition.&nbsp;","If all goes successfully, it will keep the upgrade on track to happen just over a week later. The Merge will take place when the network’s hash rate reaches a certain level, which is roughly estimated for Sept. 15.","1inch <a href=\"https:\/\/www.theblock.co\/post\/167032\/1inch-announces-300000-op-token-airdrop-for-users-on-optimism\" data-v-f87c67ca=\"\">announced<\/a> last week that it intends to do a retrospective airdrop of 300,000 OP tokens to 1inch wallet users on the Optimism network — an Ethereum Layer 2 scaling solution. The tokens will be distributed equally among all wallets that have made swaps via the 1inch wallet on the Optimism network up until Sept. 1. The airdrop will take place very soon, the team said.","At the same time, Sudoswap said it intends to <a href=\"https:\/\/www.theblock.co\/post\/167366\/nft-marketplace-sudoswap-unveils-governance-token-and-retroactive-airdrop\" data-v-f87c67ca=\"\">introduce<\/a> a governance token for its NFT platform. The token will be airdropped to those who lock the crypto token XMON, 0xmon NFT holders, liquidity providers, team members and the project’s treasury. The total supply of SUDO tokens will be 60 million. It is unclear when this airdrop will take place.","The deadline looms for agency responses to President Joe Biden's executive order on cryptocurrency. Per the<a href=\"https:\/\/www.theblock.co\/linked\/137013\/white-house-releases-text-of-bidens-crypto-focused-executive-order\" data-v-f87c67ca=\"\"> March 9 order<\/a>, seven reports from agencies are due to the White House after 120 days, putting their deadline at Sept. 5, the day after Labor Day, Kollen Post <a href=\"https:\/\/www.theblock.co\/post\/166075\/most-of-the-responses-to-joe-bidens-crypto-executive-order-are-due-next-week\" data-v-f87c67ca=\"\">writes<\/a>.&nbsp;","Some responses have already been submitted. These include the<a href=\"https:\/\/www.theblock.co\/linked\/150524\/us-department-of-justice-calls-for-more-international-cooperation-coordination-on-crypto-law-enforcement\" data-v-f87c67ca=\"\"> Department of Justice<\/a> and<a href=\"https:\/\/www.theblock.co\/post\/156435\/treasury-sends-biden-framework-for-international-work-on-crypto-over-the-next-year\" data-v-f87c67ca=\"\"> the Treasury<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sudoswap","content":"PERSON"},{"type":"Kollen Post","content":"ORGANIZATION"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"SUDO","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Sept. 1","content":"DATE"},{"type":"White House","content":"ORGANIZATION"},{"type":"Bellatrix","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Sept. 15","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"March 9","content":"DATE"},{"type":"Sept. 6","content":"DATE"},{"type":"Joe Biden","content":"PERSON"},{"type":"Sept. 5","content":"DATE"},{"type":"Labor Day","content":"DATE"}],"hashtag":["ETHEREUM","OPTIMISM"],"authors":["Tim Copeland","The Block"]}