{"summary":"Co-founder of Celo, and CTO of cLabs, Marek Olszewski explained Celo’s “coming home moment” in an interview with The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/263003\/clabs-cto-marek-olszewski-on-why-celo-wants-to-come-home-to-ethereum","publishDate":"2023-11-14T12:12:05","id":2857,"type":null,"title":"cLabs CTO Marek Olszewski on why Celo wants to &#x27;come home&#x27; to Ethereum","category":["LAYER 2S AND SCALING"],"content":["<span data-v-f87c67ca=\"\">Marek Olszewski, co-founder of <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Celo <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248491\/celo-celo-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/InjXBNx9_400x400.jpg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">CELO<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -2.47%\n    <\/span><\/a> <!----><\/span><\/span> and CTO of cLabs, said that the development of Layer 2 solutions has enabled Celo's plan to integrate back into the Ethereum ecosystem.<\/span>","Born from the vision of building an easy-to-use mobile wallet on Ethereum, Celo evolved into its own EVM-compatible and scalability-focused Layer 1 blockchain in 2020. “At the time, Ethereum's scalability plans were evolving and the fastest way to build a scalable EVM chain that developers were demanding was to launch as a Layer 1,” Olszewski said. However, with Ethereum's scalability roadmap via rollups now in place, Olszewski sees it as an opportune moment for Celo to \"come home\" and continue its mission as part of a larger Ethereum scaling initiative.","“We saw this as a coming home moment, something the Celo community has been thinking about for a while that hadn’t been possible until recent Layer 2 research developments such as EigenDA — the Ethereum aligned data availability protocol — making it possible for Celo to maintain its low gas fees as a Layer 2,” Olszewski added.","cLabs, the a16z-backed core developer behind the Celo blockchain, <a href=\"https:\/\/www.theblock.co\/post\/239838\/a16z-backed-clabs-submits-plan-for-celo-to-transition-into-ethereum-layer-2\" data-v-f87c67ca=\"\">proposed<\/a> migrating its network from an independent Layer 1 to a Layer 2 built on Ethereum in July, leveraging Optimism's OP Stack. <a href=\"https:\/\/www.theblock.co\/post\/252306\/polygon-celo-proposal\" data-v-f87c67ca=\"\">Polygon Labs<\/a> later proposed Celo could migrate to an Ethereum Layer 2 via the Polygon CDK in September, when zkSync developer <a href=\"https:\/\/forum.celo.org\/t\/matter-labs-proposal-for-celo-to-join-zk-nation-and-become-an-eth-l2-using-zk-stack\/6629\" data-v-f87c67ca=\"\">Matter Labs<\/a> also proposed Celo became an Ethereum Layer 2 using its ZK Stack.","“While cLabs’ initial proposal sought to leverage OP Stack, the community has not yet decided on which stack to move forward with. In addition to OP Stack, the community is researching and evaluating a number of proposals that have been put forward by various projects, including Polygon Labs and Matter Labs,” Olszewski said. “cLabs aims to provide as much information as possible to help the community come to a decision soon. To do so, we’re publishing a framework in the coming weeks to help make the most technically sound choice without compromising our community and ecosystem’s needs.”","As part of the “Celo 2.0” roadmap, cLabs plans to upgrade Celo to a highly scalable validium-based zk-EVM, Olszewski explained. But it also wants to maintain some unique feature set such as the ability to pay for transaction fees with ERC-20 tokens — made possible following advancements in next-generation zk-SNARK proving systems.","Celo is not the only one considering a transition to become an Ethereum Layer 2, with several blockchain projects, including <a href=\"https:\/\/www.theblock.co\/post\/251566\/canto-to-migrate-into-a-zk-powered-layer-2-on-ethereum\" data-v-f87c67ca=\"\">Canto<\/a>, <a href=\"https:\/\/polygon.technology\/blog\/introducing-immutable-zkevm-powered-by-polygon-the-home-of-gaming-in-web3-in-partnership-with-immutable\" data-v-f87c67ca=\"\">Immutable<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/250505\/astar-network-zkevm-ethereum-layer-2-polygon\" data-v-f87c67ca=\"\">Astar<\/a>, collaborating with Polygon Labs for their migration plans and exemplifying a growing trend in the space.","“For most EVM-compatible chains, it's increasingly hard to justify a standalone positioning in a market where the Ethereum scaling roadmap is proving itself,” Olszewski argued.","“Part of this is because developers are interested in building on Ethereum, and in the absence of scaling limits that previously sent them to other EVM-compatible Layer 1s, that means building on Layer 2s,” he said. “We've seen some chains flirt with the idea of transitioning to a Layer 2 without truly committing to it. I think that will change as more projects get the courage to fully take the leap.”","Influenced by Celo’s mobile wallet origins, a mobile-first approach is core to the project — something it sees as vital in achieving mass adoption of blockchain technology.","“An estimated 6.9 billion people, or 86% of the world's population, own a smartphone, while access to desktop computers is far less widespread,” Olszewski said. “Mobile phones allow everyday people to leapfrog technology — which is why making web3 more universally accessible to a mainstream audience requires building mobile-first experiences.”","“When we successfully transition to a Layer 2, our mobile-first approach, which we have implemented since genesis, will further help onboard users with access and efficiency in mind,” he added.","Celo also aligns itself with the Regenerative Finance (ReFi) ecosystem — aiming to further sustainable and inclusive financial practices, with Olszewski describing Celo as the “home of ReFi.”","The Celo co-founder said its “Ultragreen Money'' initiative demonstrated Celo's commitment to sustainability. This initiative builds on Ethereum’s fee-burning mechanism to make the CELO token deflationary and send 20% of transaction fees to a new Carbon Offset Fund.","The ReFi ecosystem supports various projects, ranging from Universal Basic Income (UBI) distribution protocols like GoodDollar to environmental recovery efforts like Plastiks and accessible, low-cost financial tools such as MiniPay’s ultralight stablecoin wallet, built by Opera in collaboration with the Celo Foundation, Olszewski added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"86%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"Celo","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"20","content":"DATE"},{"type":"Celo Foundation","content":"ORGANIZATION"},{"type":"Polygon CDK","content":"ORGANIZATION"},{"type":"Regenerative Finance","content":"ORGANIZATION"},{"type":"Matter Labs","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Polygon Labs","content":"ORGANIZATION"},{"type":"CTO","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Marek Olszewski","content":"PERSON"},{"type":"Olszewski","content":"PERSON"},{"type":"OP Stack","content":"ORGANIZATION"},{"type":"-2.47%","content":"PERCENT"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ETHEREUM"],"authors":["James Hunt","The Block"]}