{"summary":"Ledger Vault provides the same level of security as the Ledger Nano S (the most secure hardware wallet on the market), but at a much greater scale. Ledger Vault to secure some of the largest companies’ funds, including Bitstamp, Crypto.com, Voyager, and Uphold.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/45706\/ledger-vault-is-transforming-cryptocurrency-custody-for-institutions","publishDate":"2019-11-06T00:00:59","id":2858,"type":null,"title":"Ledger Vault is transforming cryptocurrency custody for institutions","category":["STARTUPS"],"content":["<span data-v-f87c67ca=\"\">Proper custody of digital assets isn’t as easy as locking up gold or paper currency in a bank vault. Since cryptocurrencies like bitcoin and ETH exist completely digitally on a blockchain, and are by nature maintained in a decentralized environment, they present an enticing target for hackers. Further, dealing with public and private keys on such a large scale isn’t easy for institutions. Secure storage of large amounts of digital assets is complex, and institutions need safe, comprehensive and integrated storage solutions.<\/span>","<span data-v-f87c67ca=\"\">Industry reports have shown that some $1.7 billion in cryptocurrency was stolen last year, and over $4 billion in 2019 so far. The threat landscape faced by investors is similar to those facing security professionals in all tech spaces and will only become broader as the industry grows. From social engineering to traditional cyberattack methods like site clones, phishing and SMS hacks, to basic hardware tampering, there are many entry points in this new frontier.<\/span>","<span data-v-f87c67ca=\"\">Today, most custodial services providers and exchanges rely on cold storage for over 90% of assets secured on their client’s behalf. The remaining share of total assets is trusted to a hot wallet in order to cater to immediate liquidity needs. Such solutions cannot be implemented at a large scale: it is therefore time to combine easy accessibility with security.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Digital asset custody must evolve from cold storage focused solutions to incorporate stronger governance frameworks to ensure the security of the coins while in storage and in transit. Security and technology have made giant leaps in the past couple of years, and solutions like <\/span><a href=\"http:\/\/bit.ly\/2NLI6Qm\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ledger Vault<\/span><\/a><span data-v-f87c67ca=\"\"> allows financial institutions to protect their cryptocurrencies while ensuring the highest level of asset fluidity. This is the Ledger Vault promise: a unique combination of hardware and software allowing secure storage of critical information, while connected and easily accessible.&nbsp;&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Securing crypto assets has never been more critical<\/b>","<span data-v-f87c67ca=\"\">Ledger Vault’s multi-authorization feature allows for seamless transfer of funds, all without the need of multi-signature participants being in the same location.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Two key components are at the core of Ledger Vault’s DNA: a flexible operating system designed to be maintained within secure hardware, and the secure hardware’s design and manufacturing capabilities.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Ledger Vault provides the same level of security as the Ledger Nano S (the most secure hardware wallet on the market), but at a much greater scale. There is no denying that the digital asset world is one that is constantly under attack. We spend significant time and effort to assess the security of our technology along with our industry’s. As hackers become more sophisticated, there is no question that our industry will be forced to adapt and innovate, which is exactly where our work leads us.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Designing security is serious hard work and that’s what we do at <\/span><a href=\"http:\/\/bit.ly\/2NLI6Qm\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ledger Vault<\/span><\/a><span data-v-f87c67ca=\"\">. Those working in this field spend a lot of time and resources creating secure solutions. We consistently seek to publish findings and vulnerabilities to raise awareness about the security of our industry, and also to lay the groundwork for other security researchers. Our intention is that this work will lead to additional research and improve the overall security of the industry.<\/span>","<b data-v-f87c67ca=\"\">Gone are the days of sacrificing convenience for security<\/b>","<span data-v-f87c67ca=\"\">Large Crypto-firms and Crypto-active financial institutions are facing important operational risks due to the absence of solutions and services for secure storage and transfer of crypto assets at scale. As for the regulatory landscape, the protection of the investors through secure storage is a constant preoccupation.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">To avoid getting stuck when the market moves, solutions like Ledger Vault allow you to manage your digital assets anytime, anywhere, all while maintaining Ledger’s standard of security excellence.<\/span>","<span data-v-f87c67ca=\"\">As an institution, you can scale your business operations seamlessly, segregating or commingling you &amp; your customers’ funds as you see fit. With support for over 1,100 coins and tokens through our unified security model, Ledger Vault has you covered in your efforts to keep your operations efficient and clean. We published the <\/span><a href=\"http:\/\/bit.ly\/32e1XNn\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">vault solution<\/span><\/a><span data-v-f87c67ca=\"\"> overview recently that explains in great length how the Vault platform works.<\/span>","","","<span data-v-f87c67ca=\"\">Some of the largest firms in the industry have turned to Ledger Vault to secure their funds, including Bitstamp, Crypto.com, Voyager, and Uphold. These firms leverage the platform to safeguard their assets, as it provides the same level of security as cold wallets, with the ability to transact in a matter of seconds.<\/span>","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Ledger Vault","content":"ORGANIZATION"},{"type":"$4 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Vault","content":"LOCATION"},{"type":"$1.7 billion","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"Crypto","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}