{"summary":"CME Group bitcoin futures topped a record number of large open interest holders this week at 66, according to CFTC data\nCFTC reported that long open interest from hedge-funds trading bitcoin futures have hit an 8-month high, north of $150 million as of Tuesday May 5th\nIn the month of April, CME bitcoin futures recorded the largest monthly average number of “other” large open interest traders since the product launched","author":["Ryan Todd","Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/64619\/key-metric-cme-bitcoin-futures-open-interest","publishDate":"2020-05-10T11:31:11","id":2859,"type":null,"title":"A key metric for CME&#x27;s bitcoin futures market hit an all-time high this week","category":["The Block"],"content":["If Paul Tudor Jones ultimately dives into the bitcoin futures market, he won't be the only large investor trading there.","The famed macro investor made headlines last week after <a href=\"https:\/\/www.theblockcrypto.com\/post\/64398\/paul-tudor-jones-says-he-is-buying-bitcoin-as-a-hedge-against-central-bank-money-printing\" data-v-f87c67ca=\"\">an investor letter he penned<\/a>, supporting bitcoin as an inflationary hedge, made the rounds. The note also said Jones' fund could allocate to bitcoin futures.","The news coincided with a surge in trading activity in CME's bitcoin futures contract, fueling speculation that Jones' fund might have already put on the position. While it's not clear if that's the case or not, data from the derivatives giant indicates that large traders have poured into the contract at historic levels.&nbsp;","The total number of \"large open interest\" holders – traders with a futures position exceeding 25 bitcoin (~$217,000) – hit a fresh all-time high this week of 66 traders, according to the latest CFTC Commitment of Traders (COT) report.&nbsp;","","","<strong data-v-f87c67ca=\"\">Here comes the funds<\/strong>","Indeed, CME's bitcoin futures have been on a bit of a hot streak, by some measure. The firm saw&nbsp;567 new accounts begin trading CME's bitcoin futures in the first quarter, more than double the number of new accounts that started trading in Q4 of 2019. Meanwhile, open interest in the contract has increased to $368 million as of Friday's trade.&nbsp;","In addition to <a href=\"https:\/\/www.theblockcrypto.com\/post\/64398\/paul-tudor-jones-says-he-is-buying-bitcoin-as-a-hedge-against-central-bank-money-printing\" data-v-f87c67ca=\"\">Jones issuing a strong case for buying bitcoin,<\/a> Renaissance Technologies – a $75 billion hedge fund best known for pioneering quantitative-based investing – said in a March 30 dated&nbsp;<a href=\"https:\/\/www.sec.gov\/fast-answers\/answersformadvhtm.html\" data-v-f87c67ca=\"\">Form ADV<\/a> that its Medallion Funds are now \"permitted to enter into bitcoin futures transactions.\" The firm said it would limit its trading activities to contracts traded on the CME.&nbsp;","Indeed, long open interest from hedge funds has surged to a 10-month high, according to data compiled by The Block. Open interest from reported hedge funds with a long view hit $150 million on May 5.&nbsp;","","","Still, nearly 50% of the growth in open interest comes from other trades and smaller non-reportable accounts, suggesting it's not just funds that are pouring into the product.","Elsewhere, sources at investment banks tell The Block they've seen an increase in interest in bitcoin among wealthy clients and institutions. A source at Morgan Stanley said the bank has seen multiple fresh inbounds from new types of clients requesting structured product pricing and access to futures (Morgan Stanley clears bitcoin futures traders for select clients).","At Citigroup, private bankers tell The Block that more customers are asking if they offer custody or have been calling to place an order in their brokerage account. Citigroup clients can't purchase bitcoin directly through the bank.&nbsp;","In an <a href=\"https:\/\/www.theblockcrypto.com\/post\/64586\/it-opens-up-a-new-universe-mike-novogratz-on-the-significance-of-paul-tudor-jones-bullish-bitcoin-take\" data-v-f87c67ca=\"\">episode of The Scoop<\/a>, former macro investor and founder of crypto merchant bank Galaxy Digital Mike Novogratz spoke about this dynamic, telling The Block:"],"hashtag":["CFTC","HEDGE FUNDS"]}