{"summary":"Alex de Vries, a blockchain specialist at PwC and founder of Digiconomist, has said that 98% of bitcoin mining machines will fail to produce a block during their average lifetime of 1.5 years\nde Vries told The Block: “One could classify regular proof-of-work as proof-of-useless-work.”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/57452\/98-of-bitcoin-mining-machines-will-never-produce-a-block-says-pwc-analyst","publishDate":"2020-03-02T09:15:19","id":2860,"type":null,"title":"98% of bitcoin mining machines will never produce a block, says PwC analyst","category":["Mining"],"content":["Alex de Vries, a blockchain specialist at \"Big Four\" consultancy firm PwC and founder of crypto analytics site Digiconomist, has said that 98% of bitcoin mining machines will fail to produce a block of transactions during their average lifetime of 1.5 years.","Around 4 million machines are currently active and nearly 75,000 blocks are produced every 1.5 years – meaning less than 2% machines are able to produce a block to verify bitcoin transactions, de Vries <a href=\"https:\/\/twitter.com\/DigiEconomist\/status\/1234249797508509702?s=20\" data-v-f87c67ca=\"\">tweeted<\/a> Monday. The remaining 98% of machines never produce any blocks, he contended.","\"The lifetime of course varies, but if you look historically, you do see bitcoin mining devices follow Koomey's law (doubling of computational power every 1.5 years),\" de Vries told The Block. \"If you look at Bitmain IPO data you see they sold well over 4 million of Antminer S9 family devices over the past years (see Carbon Footprint of Bitcoin report, <a href=\"https:\/\/www.researchgate.net\/publication\/333733035_The_Carbon_Footprint_of_Bitcoin\" data-v-f87c67ca=\"\">published<\/a> last year), so that's a very plausible number.\"","Even if you take four years as an average lifetime of bitcoin mining machines, the number is not any better at around 200,000 blocks on 4 million devices, de Vries told The Block.","When asked about mining pools – which essentially serve to amass hash power, and distribute block rewards among those who contribute to the pool – de Vris was equally dismissive.","\"Yes they bundle and distribute the work, but that doesn’t change that at the end of the line the 'winning' number is only found once every 10 minutes by a single one of those devices,\" he told The Block. \"Pooling is just a specific strategy to perform the random number generation; doesn't alter the substance.\"","Energy consumption by bitcoin mining machines is also a cause of concern, according to de Vries. The carbon footprint of a single transaction is equal to spending 52,043 hours watching YouTube, he <a href=\"https:\/\/www.telegraph.co.uk\/science\/2020\/03\/01\/bitcoin-using-electricity-per-transaction-british-household\/\" data-v-f87c67ca=\"\">told<\/a> The Telegraph U.K. in a report published Sunday.","\"It's a serious problem in terms of economic sustainability,\" de Vries The Block, adding: \"One could classify regular proof-of-work as proof-of-useless-work.\"","Is a proof-of-stake system a solution? Not necessarily, he said.","\"There's little doubt that such a system would reduce bitcoin's energy need by around 99.9% (and e-waste would be even more negligible). I don't necessarily see this as the ultimate solution, but a step in getting the right mindset with regard to creating something truly sustainable,\" de Vries concluded."],"hashtag":[]}