{"summary":"A deputy minister from the tax office in South Korea said that the National Assembly should discuss abolishing the tax on crypto asset gains.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273280\/south-korea-weighs-crypto-tax-abolition-amid-new-income-tax-regime","publishDate":"2024-01-18T02:43:59","id":2860,"type":null,"title":"South Korea weighs crypto tax abolition amid new income tax regime","category":["ASIA"],"content":["<span data-v-f87c67ca=\"\">In a policy briefing earlier this week, Jeong Jung-hoon, deputy minister of the tax and customs office for South Korea’s Ministry of Economy and Finance, said that the National Assembly, the country’s legislative body, should discuss whether to include crypto asset gains as part of a planned abolition of income tax for financial investments.<\/span>","<span data-v-f87c67ca=\"\">Jeong’s comment came in response to a public query as to whether tax on crypto should be scrapped alongside that on financial investments, local media ZDNet <\/span><a href=\"https:\/\/zdnet.co.kr\/view\/?no=20240117172138\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reported<\/span><\/a><span data-v-f87c67ca=\"\"> Wednesday.<\/span>","<span data-v-f87c67ca=\"\">The administration under President Yoon Suk-yeol intends to rescind the taxation on financial investments, such as stocks and funds, in an aim to support wealth accumulation and financial planning of its citizens.<\/span>","<span data-v-f87c67ca=\"\">The country’s crypto tax regime is set to take effect on Jan. 1, 2025. Taxpayers with over 2.5 million Korean won ($1,865) in crypto asset gains will be subject to a 22% levy. The tax regime on financial investment income is scheduled to commence on the same day.<\/span>","<span data-v-f87c67ca=\"\">Jeong said that the South Korean government plans to submit an amendment to its income tax law regarding financial investment taxation in late January or early February, according to the local media report.<\/span>","<span data-v-f87c67ca=\"\">The national election for the National Assembly is scheduled for April 10, potentially giving the current legislative body a limited timeframe to process proposed amendments.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"earlier this week","content":"DATE"},{"type":"$1,865","content":"MONEY"},{"type":"South Korea","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"February","content":"DATE"},{"type":"April 10","content":"DATE"},{"type":"ZDNet","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"22%","content":"PERCENT"},{"type":"Jeong Jung","content":"PERSON"},{"type":"’s Ministry of Economy and Finance","content":"ORGANIZATION"},{"type":"Jan. 1, 2025","content":"DATE"},{"type":"National Assembly","content":"ORGANIZATION"},{"type":"Yoon Suk","content":"PERSON"},{"type":"Wednesday","content":"DATE"}],"hashtag":["ASIAN PARLIAMENTS","ASIAN REGULATION","CRYPTO"],"authors":["Danny Park","The Block"]}