{"summary":"FTX is slowing down on the listing of new futures because there isn’t a clear demand for futures tied to less-liquid coins\nThe company’s CEO, Sam Bankman-Fried, sees options as a less crowded space that offers considerable potential for innovation.","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/54383\/crypto-derivatives-exchange-ftx-wont-list-new-futures-if-they-arent-sufficiently-liquid-says-ceo","publishDate":"2020-01-29T17:45:48","id":2861,"type":null,"title":"Crypto derivatives exchange FTX won&#x27;t list new futures if they aren&#x27;t sufficiently liquid, says CEO","category":["Exchanges"],"content":["<span data-v-f87c67ca=\"\">Cryptocurrency derivatives exchange FTX is slowing down on its efforts to list new futures and will focus instead on other products like options, according to CEO Sam Bankman-Fried.<\/span>","<span data-v-f87c67ca=\"\">Launched in May 2019, FTX offerers trading for futures tied to more than 25 cryptocurrencies including BTC, ETH, USDT, and PAXG. On Jan. 13, following the lead of firms like Bakkt and OKEx, FTX launched cash-settled bitcoin options. At the time, Bankman-Fried tweeted that the new product hit <\/span><a href=\"https:\/\/twitter.com\/SBF_Alameda\/status\/1216226588854870016?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$1 million<\/span><\/a><span data-v-f87c67ca=\"\"> in volume within the first two hours of the launch and traded around <\/span><a href=\"https:\/\/twitter.com\/SBF_Alameda\/status\/1216433384685072384?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">2,000 contracts<\/span><\/a><span data-v-f87c67ca=\"\"> within 12 hours.<\/span>","<span data-v-f87c67ca=\"\">The crypto derivatives market has been <\/span><a href=\"https:\/\/www.theblockcrypto.com\/daily\/12340\/the-derivatives-market-is-heating-up-in-crypto-and-binance-might-be-the-next-firm-to-jump-in\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">heating up<\/span><\/a>.&nbsp;<span data-v-f87c67ca=\"\">Binance – which itself offers futures in BTC, ETH, and BCH – spent “tens of millions” last month to acquire an equity stake in FTX, The Block previously <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/51206\/binance-invests-tens-of-millions-in-alameda-research-backed-crypto-derivatives-platform-ftx\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reported<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","&nbsp;","","","<span data-v-f87c67ca=\"\">Bankman-Fried told The Block during the latest <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/54170\/uncovering-the-key-differences-between-crypto-derivatives-markets-in-north-america-and-asia-with-ftx-alameda-research-ceo-sam-bankman-fried\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">episode<\/span><\/a><span data-v-f87c67ca=\"\"> of The Scoop podcast that FTX move is a result of the firm already including all of the fairly liquid coins through its service.<\/span>","<span data-v-f87c67ca=\"\">“We’re constantly getting requests to list more futures...but we slowed that down a lot,” he said. “Part of the reason is that there’s an infinite list of coins. We’ve already listed all the top ones, and for other coins that we list futures one, there’s a question of if there’s actually a lot of demand to trade those futures.”<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried said adding products that are not sufficiently liquid will hurt user confidence in the exchange.<\/span>","<span data-v-f87c67ca=\"\">“If you don’t have an extremely liquid market, a lot of users will feel pretty unhappy about that,” he said. “From that perspective, we’re pretty nervous about doing things that increase the odds of there being no liquidity in a market for a while.”<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried sees options as one of the alternative focus for the exchange. Even though futures trading still offers the largest liquidity in the crypto space, he said, the options market has considerable potential given that it is a less crowded space.<\/span>","<span data-v-f87c67ca=\"\">“I do think that to a decent extent futures are way higher in volume now, <\/span><span data-v-f87c67ca=\"\">and I'm not expecting options to overtake that anytime soon, which is why we launched futures first, and it took us nine months or so to head into options,” he said. \"But there are way fewer serious competitors in the options space...And I think there's a lot of innovation left to be done on options.\"<\/span>","<strong data-v-f87c67ca=\"\">New volatility products<\/strong>","According to Bankman-Fried, FTX is also working on other derivatives and tokenized products, including a volatility index (VIX) aimed at tracking bitcoin's price swings.","On Wall Street, the CBOE Volatility Index, developed by the Chicago Board Options Exchange, allows market participants to hedge a portfolio and generate returns from relative pricing differences.","In Jan. 2019, cryptocurrency firm LedgerX <a href=\"https:\/\/www.theblockcrypto.com\/daily\/7364\/ledgerx-rolls-out-lxvx-a-volatility-index-for-bitcoin-price-swings\" data-v-f87c67ca=\"\">launched<\/a> the LedgerX Volatility Index (LXVX). The product draws data from the firm's options marketplace and shows traders how much bitcoin can move to the upside or downside over the next month.","\"It will be a lot more about building up different types of products and a lot less about building out the number of coins we have futures on,\" <span data-v-f87c67ca=\"\">Bankman-Fried<\/span> said.","<i data-v-f87c67ca=\"\">Listen to Sam Bankman-Fried's recent&nbsp;appearance on The Block's podcast The Scoop:<\/i>","<iframe src=\"https:\/\/playlist.megaphone.fm?e=BLOCK2299537334\" width=\"100%\" height=\"200\" frameborder=\"0\" scrolling=\"no\" data-mce-fragment=\"1\" data-v-f87c67ca=\"\"><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><\/iframe>","<em data-v-f87c67ca=\"\">Reporting contributed by Frank Chaparro.<\/em>"],"hashtag":["FTX","SAM BANKMAN-FRIED"]}