{"summary":"Fractal acts as a marketplace for gaming companies to drop new products to fans. It also serves as a secondary market for gaming NFTs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/151223\/fractal-set-to-launch-blockchain-gaming-wallet-for-non-crypto-native-users","publishDate":"2022-06-10T12:00:52","id":2861,"type":null,"title":"Fractal set to launch blockchain gaming wallet for non crypto native users","category":["WALLETS"],"content":["Fractal, a gaming focused NFT platform, is launching a digital crypto wallet for web3 gamers to make the sign-up process seamless for those unfamiliar with crypto.&nbsp;","Fractal acts as a marketplace for gaming companies to drop new products to fans, and also serves as a secondary market where gamers can sell NFTs to each other.","A digital wallet, which is used to store and retrieve crypto, is where NFTs purchased on Fractal are currently stored.&nbsp;","\"There's actually not a lot of people who've ever touched a blockchain game. There's around 1.4 million wallets and 3 billion game players out there in the world,\" said Justin Kan, co-founder of Fractal, in an interview with The Block. Kan previously co-founded Twitch, a popular streaming platform for gamers.","\"In order to get [blockchain games] to be much more mainstream, we are going to have to improve the usability side,\" said Kan. \"So we've created a non-custodial wallet... you can log into a game using just Google, and it creates a crypto wallet for you.\"&nbsp;","For gamers who're unfamiliar with how crypto wallets work, downloading a chrome extension or plugin and figuring out how it works can be a barrier to entry into the blockchain gaming space. Fractal's new product allows users to start playing a blockchain game in seconds, by creating a Fractal wallet using their existing Google accounts.&nbsp;","Fractal <a href=\"https:\/\/fractal.medium.com\/introducing-fractal-98a8162a0a6f\" data-v-f87c67ca=\"\">launched<\/a> in December 2021, when gaming NFT trade volume was $49 million based on data complied by The Block.","As of June 5, that number sits at around $3.3 million after the <a href=\"https:\/\/www.theblockcrypto.com\/news+\/146915\/the-decline-of-axie-infinity\" data-v-f87c67ca=\"\">decline of popular play-to-earn game Axie Infinity<\/a>.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/gaming\/gaming-nft-trade-volume\/embed\" title=\"Gaming NFT Trade Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"December 2021","content":"DATE"},{"type":"$3.3 million","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Justin Kan","content":"PERSON"},{"type":"$49 million","content":"MONEY"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"3 billion","content":"MONEY"},{"type":"June 5","content":"DATE"}],"hashtag":[],"authors":["Anushree Dave","The Block"]}