{"summary":"A common email phishing attack is being used to trick crypto investors — with devastating results.\nJust today, one such scam likely resulted in the theft of $60 million in ETH.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/122557\/email-scams-are-catching-crypto-investors-offguard-and-stealing-millions","publishDate":"2021-10-29T14:29:14","id":2862,"type":null,"title":"Email scams are catching crypto investors offguard and stealing millions","category":["Hacks"],"content":["A recent wave of email scams is catching crypto investors off-guard and stealing millions of dollars in cryptocurrency.","Friday morning, it appeared that one such email scam was behind the <a href=\"https:\/\/www.theblockcrypto.com\/post\/122529\/crypto-fork-uses-dog-meme-to-raise-60-million-then-the-money-goes-missing\" data-v-f87c67ca=\"\">theft of some $60 million<\/a> in ETH from a dog-themed crypto project during its token sale.","One of the persons behind the project shared a screenshot of an email they received containing an attachment. The email looked like it was from a prominent crypto investor but it wasn't their real email address. It contained a PDF file that was presented as an investment deck, which may have contained malware. This malware may have managed to access the crypto wallets controlling the funds before sending them to another address.","Since then, the project says it has gotten in touch with Chainalysis to monitor the movement of the seemingly stolen funds and it has let professional security researchers look at the PDF.","This project wasn't the only target, however.","VC firms County Capital and Sneaky Ventures both <a href=\"https:\/\/twitter.com\/County_Cap\/status\/1454079020698644480\" data-v-f87c67ca=\"\">shared<\/a> <a href=\"https:\/\/twitter.com\/SneakyVentures\/status\/1454082276120305669\" data-v-f87c67ca=\"\">tweets<\/a> showing that they, too, received the same phishing email. The one sent to County Capital was also sent to VC firm Sino Global Capital, the screenshots show.","The individuals behind the attack <a href=\"https:\/\/twitter.com\/mgnr_io\/status\/1454102614459748359\" data-v-f87c67ca=\"\">posted a message<\/a> on the Ethereum blockchain, which said that they were inspired by a similar phishing attack.","This was the attack against trading firm mgnr that happened earlier this month. In this attack, an email was <a href=\"https:\/\/twitter.com\/mgnr_io\/status\/1448489258029703168\" data-v-f87c67ca=\"\">made to look like<\/a> a VC investor had shared a Google Docs file with them.","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">The intrusion was probably used to implant a key logger and steal credentials to a password manager where we had (stupidly) shared a [private key] as temporary hot wallet between a few team members<\/span>,\" the firm <a href=\"https:\/\/twitter.com\/mgnr_io\/status\/1448489260332425217\" data-v-f87c67ca=\"\">said<\/a>. Mgnr added that they were aware of two other crypto firms receiving similar phishing emails with documents pretending to be from the same VC firm.","A pseudonymous crypto investor by the name of mewn — part of investing group eGirl Capital — pointed out that these attacks are targeting specific crypto individuals with specialized knowledge of crypto news.","\"T<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">his to me is like a big red alert to everyone in the space to be very careful<\/span>,\" they <a href=\"https:\/\/twitter.com\/mewn21\/status\/1454084727065956357\" data-v-f87c67ca=\"\">tweeted<\/a>.","The individuals behind today's hack said, in a message on the blockchain, that they were not the same people that phished mgnr. But they added that they were inspired by it.","In order to understand how a phishing attack like this works and how it can be so successful, The Block spoke with <span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Oren Falkowitz, founder of Area 1 Security and former analyst at the NSA. <\/span>","Falkowitz explained that, typically, these emails would be made to look authentic, such as coming from a trusted entity or person. In the cases mentioned above, the emails appeared to look like they were from notable crypto investors.","On how they lead to the damage, Falkowitz said that the links within the emails might not be what they seem. While the document might appear to be a PDF file — by having \".PDF\" at the end of the filename — it may actually be a very different type of file. What it could be is an executable file that contains a series of instructions for the computer to perform a task. This is similar to downloading and installing software.","Once installed, it may be a piece of code that takes instructions from another computer, such as downloading further malicious software. Through this, the code could get access to a keylogger or other services that could observe activity on the computer.","Once the attacker is able to obtain this kind of access, it becomes much easier for them to intercept any kind of private blockchain data in order to get access to the victim's cryptocurrency holdings.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>"],"hashtag":[]}