{"summary":"StarkNet has been rolling out in stages but it’s now fully deployed — with plans to be handed over to its community this Summer.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/135161\/ethereum-scaling-solution-starknet-completes-launch-with-goal-to-move-to-community-control","publishDate":"2022-02-23T09:30:52","id":2862,"type":null,"title":"Ethereum scaling solution StarkNet has now fully launched","category":["ETHEREUM"],"content":["Ethereum scaling solution StarkNet is now raring to go, having slowly rolled out over the last few months.&nbsp;","StarkNet is a permissionless version of the StarkEx platform that currently supports crypto projects DeversiFi, Immutable and dYdX. As a result, anyone can build on StarkNet, which will eventually be run by its community. Both platforms are currently being built by StarkWare.","StarkNet first went live on mainnet on November 29 with limited functionality. Over the last few months, more features have been added. With today’s launch of the latest version of the software, it's now ready to be used for making transactions and building applications.&nbsp;","Over the next few months, the focus will be on scaling out StarkNet, making it support a higher number of transactions per second (TPS). While it will be cheap to use, the network will be a little slow to start with. At present, its speed is similar to Ethereum’s 7 TPS or so – but the plan is to reach 70 or even 700 TPS eventually.","In the second half of the year, the project aims to decentralize itself and hand over governance to its community. Typically projects that have done this have issued tokens (<a href=\"https:\/\/www.theblockcrypto.com\/news+\/124393\/the-delicate-balance-of-getting-a-big-crypto-airdrop-right\" data-v-f87c67ca=\"\">usually airdropped<\/a> to their early supporters) that are used for voting on upgrades — as the Ethereum Name Service did in November. When asked if the project will issue a token, StarkWare declined to comment.","StarkNet uses ZK-rollups to support a large number of transactions at low cost.&nbsp;","On Ethereum, you have to pay more depending on how complex a transaction is. Making a lot of transactions requires a lot of processing and is very expensive. ZK-rollups do a lot of this computational work off-chain and then submit smaller transactions that effectively summarize them (and prove that they all happened).&nbsp;","An entity on the network – known as the sequencer – batches up a large number of transactions. Then the so-called prover generates a cryptographic proof of these transactions. This proof is then relayed to the network and submitted to the Ethereum blockchain.","As a result, fees are much lower and they’re shared among the thousands of transactions being processed each time. This reduces the cost by an order of magnitude.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 29","content":"DATE"},{"type":"StarkWare","content":"ORGANIZATION"},{"type":"Ethereum Name Service","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"second half of the year","content":"DATE"},{"type":"November","content":"DATE"}],"hashtag":["ETHEREUM","STARKNET"],"authors":["Tim Copeland","The Block"]}