{"summary":"Institutional cryptocurrency adoption is continuing to happen. It’s a slow process that mostly so far has happened in the form of fund investment\nA number of endowments and a couple of pension funds have put decent-sized checks into crypto focused funds, who are currently deploying that money into a mix of venture-style bets and buying liquid cryptocurrencies\nProject highlights: Decred lightning network goes live on testnet, Grin’s UTXO set shrank by 15% last week, Loom’s Plasmachain Universal Transaction Signing allows users to seamlessly interact with L1\/L2 transactions without having to really know or care which they are doing, and Decentraland releases cute Avatars","author":["Eric Meltzer","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/21694\/the-slow-but-steady-process-of-institutional-adoption","publishDate":"2019-05-01T17:03:53","id":2863,"type":null,"title":"Proof of Work: the slow but steady process of institutional adoption","category":["Bitcoin"],"content":["<em data-v-f87c67ca=\"\"><span class=\"m_598410373434580277gmail-m_3192124162771684581gmail-il\" data-v-f87c67ca=\"\">The following newsletter is republished with permission from Eric Meltzer of Primitive Ventures, a global venture investment firm with a focus on blockchain and related technologies. You can follow Eric on Twitter at <a href=\"https:\/\/twitter.com\/wheatpond?lang=en\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@wheatpond<\/a> and subscribe <a href=\"https:\/\/proofofwork.news\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">here to Proof of Work<\/a>.&nbsp;<\/span><\/em>","Hi from LA!","I’ve been at a small conference for institutional investors and crypto people to get to know each other better. The simple takeaway so far has been that institutional adoption is continuing to happen. It’s a slow process that mostly so far has happened in the form of fund investment—a bunch of endowments and a couple of pension funds have put decent-sized checks into crypto focused funds, who are currently deploying that money into a mix of venture-style bets and buying liquid cryptocurrencies. If you hold BTC, this seems like a good reason (among many) to just keep holding it—my sense is that there’s a lot of interest from large institutions, but that they are still somewhat hampered by a lack of regulated custodians, easy tie-ins to the tooling they are used to, etc.","Highlights: Decred lightning network goes live on testnet, Grin’s UTXO set&nbsp;<em data-v-f87c67ca=\"\">shrank<\/em>&nbsp;by 15% last week, Loom’s Plasmachain Universal Transaction Signing allows users to seamlessly interact with L1\/L2 txs without having to really know or care which they are doing, and Decentraland releases cute Avatars.","No update from: Kadena, Spacemesh, Zeppelin, Theta.","<strong data-v-f87c67ca=\"\">Jimmy on Bitcoin<\/strong>","<strong data-v-f87c67ca=\"\"><a href=\"https:\/\/bitcoinops.org\/en\/newsletters\/\" data-v-f87c67ca=\"\">Optech<\/a>&nbsp;on Bitcoin [ed: sign up for their newsletter too! it’s great!]<\/strong>","<strong data-v-f87c67ca=\"\">James from Summa<\/strong>","<em data-v-f87c67ca=\"\">Summa builds tools to exchange crypto in a convenient and trustless fashion.<\/em>","<strong data-v-f87c67ca=\"\">JZ from Decred<\/strong>","<em data-v-f87c67ca=\"\">Decred&nbsp;is an autonomous digital currency with a hybrid consensus system. It is built to be a self-ruling currency where everyone can vote on the rules and project-level decision making proportionately to their stake.<\/em>","<strong data-v-f87c67ca=\"\">Johnny from Stellar<\/strong>","<em data-v-f87c67ca=\"\">Stellar is an open network for sending and exchanging value of any kind. Its global network enables digitization of assets - from carbon credits to currencies - and enables movement around the internet with ease.<\/em>","<strong data-v-f87c67ca=\"\">Izaak from Coda<\/strong>","<em data-v-f87c67ca=\"\">Coda is the first cryptocurrency protocol with a constant-sized blockchain. Coda compresses the entire blockchain into a tiny snapshot the size of a few tweets using recursive zk-SNARKs.<\/em>","<strong data-v-f87c67ca=\"\">Paige &amp; Zooko from Zcash<\/strong>","<em data-v-f87c67ca=\"\">Zcash is a&nbsp;digital currency utilizing zk-SNARKs to enable its privacy-protecting properties.<\/em>","<strong data-v-f87c67ca=\"\">Mitchell from Monero<\/strong>","<em data-v-f87c67ca=\"\">Monero is a open-source, privacy-focused cryptocurrency using the ASIC-resistant CryptoNote PoW algorithm. It enforces all privacy features at the protocol level to ensure that all transactions create a single fungible anonymity pool.<\/em>","<strong data-v-f87c67ca=\"\">Daniel from Grin<\/strong>","<em data-v-f87c67ca=\"\">Grin is a community-driven implementation of the Mimblewimble protocol that aims to be privacy preserving, scalable, fair, and minimal.<\/em>","<strong data-v-f87c67ca=\"\">Beni from Beam<\/strong>","<em data-v-f87c67ca=\"\">Beam is a confidential and scalable cryptocurrency based on Mimblewimble.<\/em>","<strong data-v-f87c67ca=\"\">Arnaud from AZTEC Protocol<\/strong>","<em data-v-f87c67ca=\"\">AZTEC Protocol is an efficient zero-knowledge protocol built on top of Ethereum, making plug-and-play value transmission and asset governance privacy tools for developers and companies.&nbsp;<\/em>","<strong data-v-f87c67ca=\"\">Evan from&nbsp;<a href=\"https:\/\/weekinethereumnews.com\/\" data-v-f87c67ca=\"\">Ethereum<\/a><\/strong>","<em data-v-f87c67ca=\"\">Ethereum&nbsp;is a decentralized platform for applications that aims to resist fraud, censorship or third-party interference.<\/em>","<strong data-v-f87c67ca=\"\">Erik from NEAR<\/strong>","<em data-v-f87c67ca=\"\">NEAR is a sharded proof-of-stake blockchain.<\/em>","<strong data-v-f87c67ca=\"\">AJ from Tezos<\/strong>","<em data-v-f87c67ca=\"\">Tezos is a self-amending blockchain that features formally verified smart contracts, on-chain governance, and a proof-of-stake consensus algorithm which enables all token holders to participate in the network.&nbsp;<\/em>","<strong data-v-f87c67ca=\"\">Topper from Quorum Control<\/strong>","<em data-v-f87c67ca=\"\">Tupelo is a permissionless proof of stake DLT platform purpose-built to model individual objects that enables flexible public or private data models.<\/em>","<strong data-v-f87c67ca=\"\">Michael from Loom<\/strong>","<em data-v-f87c67ca=\"\">Loom Network is a platform for building highly scalable DPoS sidechains to Ethereum, with a focus on large-scale games and social apps.<\/em>","<strong data-v-f87c67ca=\"\">Zaki from Cosmos<\/strong>","<em data-v-f87c67ca=\"\">The&nbsp;Cosmos&nbsp;Network is a decentralized network of independent, scalable, and interoperable blockchains.<\/em>","<strong data-v-f87c67ca=\"\">Kate and Dean from Agoric<\/strong>","<em data-v-f87c67ca=\"\">Founded by pioneers in secure development and distributed systems, Agoric uses a secure subset of JavaScript to enable object capabilities and smart contracts.<\/em>","<strong data-v-f87c67ca=\"\">Antonio from dYdX<\/strong>","<em data-v-f87c67ca=\"\">dYdX is a decentralized exchange for margin trading, borrowing, lending, and eventually derivatives. dYdX allows traders to trustlessly short and get leverage on crypto assets.<\/em>","<strong data-v-f87c67ca=\"\">Brendan from Dharma<\/strong>","<em data-v-f87c67ca=\"\">Dharma is the easiest place to borrow and lend cryptocurrencies. It enables non-custodial peer-to-peer lending through smart contracts on Ethereum.<\/em>","<strong data-v-f87c67ca=\"\">Coulter from MakerDAO<\/strong>","<em data-v-f87c67ca=\"\">Maker is comprised of a decentralized stablecoin, collateral loans, and community governance.<\/em>","<strong data-v-f87c67ca=\"\">Lazar from MARKET Protocol<\/strong>","<em data-v-f87c67ca=\"\">MARKET Protocol is a framework for creating tokens that track prices of traditional or digital assets.<\/em>","<strong data-v-f87c67ca=\"\">Tieshun from Namebase<\/strong>","<em data-v-f87c67ca=\"\">Namebase is the easiest way to buy, sell, and use Handshake.<\/em>","<strong data-v-f87c67ca=\"\">Paul from Veil<\/strong>","<em data-v-f87c67ca=\"\">Veil&nbsp;is a peer-to-peer prediction market and derivatives platform built on top of&nbsp;Augur,&nbsp;0x, and&nbsp;Ethereum.<\/em>","<strong data-v-f87c67ca=\"\">Rahul from 0x<\/strong>","<em data-v-f87c67ca=\"\">0x<\/em>&nbsp;is an open protocol that enables the peer-to-peer exchange of assets on the Ethereum blockchain.","<strong data-v-f87c67ca=\"\">Tony from Liquidity.Network<\/strong>","<em data-v-f87c67ca=\"\">Liquidity Network is a transfer and swap platform for any token<\/em>","<strong data-v-f87c67ca=\"\">Dong Mo from Celer<\/strong>","<em data-v-f87c67ca=\"\">Celer Network is a layer-2 scaling platform that enables fast, easy and secure off-chain transactions for not only payment transactions, but also generalized off-chain smart contracts.<\/em>","<strong data-v-f87c67ca=\"\">Alexandra from Parity Technologies<\/strong>","<em data-v-f87c67ca=\"\">Parity&nbsp;Technologies builds core blockchain infrastructure, from&nbsp;Parity Ethereum, an Ethereum client, to Polkadot, an interoperable blockchain network.<\/em>","<strong data-v-f87c67ca=\"\">Doug from Livepeer<\/strong>","<em data-v-f87c67ca=\"\">Livepeer is a decentralized video infrastructure network, dramatically reducing prices for developers and businesses building video streaming applications at scale.&nbsp;<\/em>","<strong data-v-f87c67ca=\"\">Ryan from FOAM<\/strong>","<em data-v-f87c67ca=\"\">FOAM&nbsp;is building spatial applications and proof of location that bring geospatial data to blockchains and empower a consensus driven map of the world.<\/em>","<strong data-v-f87c67ca=\"\">David from Sia<\/strong>","<em data-v-f87c67ca=\"\">Sia is a decentralized cloud storage platform leveraging blockchain technology to create a data storage marketplace that is more robust and more affordable than traditional cloud storage providers.<\/em>","<strong data-v-f87c67ca=\"\">Ari from Decentraland<\/strong>","<em data-v-f87c67ca=\"\">Decentraland is a virtual world where you can build and explore 3D creations, play games and socialize.<\/em>","<strong data-v-f87c67ca=\"\">Bowen from Hydro\/DDEX.io<\/strong>","<em data-v-f87c67ca=\"\">Hydro&nbsp;Protocol is an open source framework for building Decentralized Exchanges. DDEX&nbsp;is the first decentralized exchange for Ethereum and ERC-20 tokens built on the&nbsp;Hydro Protocol.<\/em>"],"hashtag":[]}