{"summary":"The objective behind Pessimism is to detect security threats and vulnerabilities in OP Stack-based networks.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/252120\/base-introduces-security-monitoring-system-named-pessimism","publishDate":"2023-09-20T12:05:25","id":2864,"type":null,"title":"Base introduces security monitoring system named Pessimism","category":["CRYPTO ECOSYSTEMS"],"content":["Coinbase’s Base Layer 2 network has introduced Pessimism, an open-source monitoring system designed to enhance security oversight across networks in the Optimism ecosystem. Pessimism seeks to identify protocol threats and security vulnerabilities specific to networks created with the OP Stack and other EVM-compatible chains.","The <a href=\"https:\/\/base-org.github.io\/pessimism\/heuristics\" data-v-f87c67ca=\"\">Pessimism<\/a> system comprises three primary <a href=\"https:\/\/base.mirror.xyz\/qQAChAdkfZDG_8Ik7FgrMIpjE-si3TdF1E5W6c8ruFQ?ref=ethdaily.io\" data-v-f87c67ca=\"\">subsystems<\/a>: ETL (extract, transform, load) subsystem, Risk Engine, and Alerting. Together, these systems can parse, analyze, and flag potential security concerns. Coinbase has expressed its intention to expand Pessimism’s capabilities to bridge monitoring, emphasizing features like withdrawal safety and the detection of potential security issues.","Users and developers have been invited to suggest features or raise issues on Pessimism’s GitHub <a href=\"https:\/\/github.com\/base-org\/pessimism\/issues\" data-v-f87c67ca=\"\">page<\/a>.","This announcement follows Coinbase’s statement last month, where it <a href=\"https:\/\/www.theblock.co\/post\/247268\/coinbase-base-optimism\" data-v-f87c67ca=\"\">shared<\/a> plans to fully decentralize Base in the future. The aim is to attain network decentralization by introducing fault proofs and leverage diverse client software to maintain network censorship resistance.","Base’s public launch went live in early August, and within a span of just over a month, it has become the third-largest Layer 2 ecosystem on Ethereum after Arbitrum and Optimism, with a total value locked at over <a href=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/scaling-overview\" data-v-f87c67ca=\"\">$400 million<\/a>.","<span data-v-f87c67ca=\"\">The value locked on Base has grown quickly. Image: The Block's Data Dashboard.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$400 million","content":"MONEY"},{"type":"Arbitrum","content":"PERSON"},{"type":"August","content":"DATE"}],"hashtag":["BASE"],"authors":["Vishal Chawla","The Block"]}