{"summary":"Web3 MMORPG game Worldwide Webb raised a $10 million Series A with investment firm Pantera Capital as its only investor. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/214369\/worldwide-webb-pantera-funding","publishDate":"2023-02-23T09:00:17","id":2866,"type":null,"title":"Web3 game Worldwide Webb raises $10 million from Pantera Capital","category":["GAMING"],"content":["Crypto investment firm Pantera Capital invested $10 million in Worldwide Webb, a web3 massively multiplayer online role-playing game (MMORPG), for its Series A round.&nbsp;","Previously bootstrapped, the project began raising funding in the second quarter of last year and closed the deal by the end of December, said founder and CEO Thomas Webb in an interview with The Block.&nbsp;","Partly inspired by virtual worlds such as Runescape and World of Warcraft, players can participate in quests, raids and interact with a virtual economy in an in-browser game. Users can also purchase virtual land and in-game apartments on-chain.&nbsp;","\"What I think is so powerful about Worldwide Webb is that you can just dive straight into the game with your wallet — you don't have to download anything,\" said Webb.&nbsp;","In the next few weeks, the project will also release an upcoming game, titled Blockbusterz, where users holding NFTs from different collections such as CryptoPunks, BAYC or Doodles can face off against each other in battles tournaments — Webb is personally vouching for CryptoPunks to win out.&nbsp;","Webb made his name as a multimedia artist producing artwork that relies on social media APIs and other real-time data sources. As an artist, he's worked with Hello Kitty creator Sanrio, fashion brand Valentino and luxury car maker Mercedes Benz.&nbsp;","Webb is hoping to use those connections he's made to create bespoke gaming experiences in Worldwide Webb that offer an alternative to the simple branded NFT drop, which has <a href=\"https:\/\/adage.com\/article\/digital-marketing-ad-tech-news\/porsches-failed-nft-drop-lesson-brands-web3\/2465986\" data-v-f87c67ca=\"\">varying degrees of success<\/a>.&nbsp;","\"People aren't just buying into the brand with an NFT but they're actually engaging in a branded game which is an experience within Worldwide Webb that they can earn a [branded] NFT from,\" he explained. \"It's less about trying to create things for people and more about creating and rewarding loyalty.\"","Aside from involving brands in Worldwide Webb, the funding will also be funneled into expanding its team and integrating other chains in addition to Ethereum. Webb said that it's also in the early stages of creating its own standard for ERC-1155 and 721 token standards that it hopes can help solve the issue of who is entitled to royalties of NFT secondary sales.&nbsp;","Worldwide Webb's backing follows a flurry of funding for projects in the NFTs and gaming subsector — the most <a href=\"https:\/\/www.theblock.pro\/research\/january-blockchain-funding-recap-209442\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">popular subsector<\/a>&nbsp;in terms of percentage of total funding since August 2021, according to The Block Research. Last month, crypto gaming platform Oh Baby Games&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/206950\/oh-baby-games-comes-out-of-stealth-announcing-6-million-funding-round\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">raised<\/a>&nbsp;a $6 million seed round as it emerged from stealth. In the same month, Neopets Meta, the web3 version of the popular virtual pet game, also&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/203724\/neopets-meta-raises-4m-in-funding-from-polygon-ventures-blizzard-avalanche\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">raised<\/a>&nbsp;a $4 million round.","<span data-v-f87c67ca=\"\">Breakdown of blockchain venture spend from The Block Research<\/span>","Still, January saw the number of deals in the subsector <a href=\"https:\/\/www.theblock.pro\/research\/january-blockchain-funding-recap-209442\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">decline<\/a> from 40% of total deals in December to 26% but as The Block Research's John Dantoni points out, it's still premature to suggest that it's lost its appeal to crypto investors, citing previous lulls that led the way to pickups in funding.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"second quarter of last year","content":"DATE"},{"type":"Sanrio","content":"ORGANIZATION"},{"type":"Valentino","content":"PERSON"},{"type":"Worldwide Webb","content":"LOCATION"},{"type":"August 2021","content":"DATE"},{"type":"John Dantoni","content":"PERSON"},{"type":"Neopets Meta","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Thomas Webb","content":"PERSON"},{"type":"$6 million","content":"MONEY"},{"type":"$10 million","content":"MONEY"},{"type":"Hello Kitty","content":"PERSON"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"$4 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"1155","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Warcraft","content":"LOCATION"},{"type":"December","content":"DATE"},{"type":"26%","content":"PERCENT"},{"type":"Mercedes Benz","content":"ORGANIZATION"},{"type":"Webb","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["SERIES A"],"authors":["Tom Matsuda","The Block"]}