{"summary":"Yuga Labs released its litepaper for the Otherside, a “starter guide” to its “world-building metaverse platform,” which is in development with software company Improbable. \nThe document champions open development, user-generated content and interoperability in its online world. ","author":["Lucy Harley-McKeown","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157995\/yuga-labs-champions-openness-collaborative-development-in-otherside-litepaper","publishDate":"2022-07-17T05:39:22","id":287,"type":null,"title":"Yuga Labs champions openness, collaborative development in Otherside litepaper","category":["Gaming and Metaverse"],"content":["&nbsp;Non-fungible token (NFT) heavyweight Yuga Labs set out its vision for the Otherside on Saturday in a document that speaks to the direction and ethos of what will become the company's \"world-building metaverse platform.\"","\"This document serves as a starter guide for the Otherside. It covers foundational principles of the platform, capabilities of its developers, and possibilities for community co-creation,\" Yuga Labs <a href=\"https:\/\/twitter.com\/OthersideMeta\/status\/1548357412406472708\" data-v-f87c67ca=\"\">wrote on Twitter<\/a>.","<a href=\"https:\/\/otherside.xyz\/litepaper\" data-v-f87c67ca=\"\">The document<\/a> came in conjunction with Yuga Labs' tech demo, which drew thousands of Otherdeed NFT holders to try out the game before its official release.&nbsp;","Otherdeed NFTs were released in May, selling out the available 55,000 lots within <a href=\"https:\/\/www.theblock.co\/linked\/144549\/otherside-land-nfts-sell-out-in-hours-as-yuga-labs-rakes-in-317-million\" data-v-f87c67ca=\"\">three hours<\/a>. The event brought in $317 million for Yuga and was so popular it crashed the Ethereum blockchain, sending transaction fees skyrocketing. These NFTs entitle the holder to a plot of land in the game and a creature called a Koda, which lives on the land.&nbsp;","Since then, Yuga Labs has been <a href=\"https:\/\/www.theblock.co\/post\/157741\/how-online-gaming-firm-improbable-is-helping-yuga-labs-build-its-metaverse\" data-v-f87c67ca=\"\">working with UK-based game developers Improbable<\/a> on creating the online space. Yuga's litepaper asks users to consider the document as a \"stepping stone\" in its development.&nbsp;"],"hashtag":["OTHERSIDE"]}