{"summary":"Binance has officially denied media reports which claimed that it is acquiring bankrupt Union Bank AG based in Europe\nBinance CFO, Wei Zhou, told The Block: “The reports that Binance is investing into Liechtenstein Union Bank or has applied with the Financial Market Authority to become a shareholder of the Bank are inaccurate”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/49515\/binance-denies-it-is-acquiring-bankrupt-union-bank-ag-based-in-europe","publishDate":"2019-12-06T08:15:06","id":2870,"type":null,"title":"Binance denies it is acquiring bankrupt Union Bank AG based in Europe","category":["Exchanges"],"content":["Cryptocurrency exchange Binance has officially denied media reports, which claimed that it could acquire bankrupt Union Bank AG based in Liechtenstein, Europe.","“The reports that Binance is investing into Liechtenstein Union Bank or has applied with the Financial Market Authority to become a shareholder of the Bank are inaccurate,” Binance CFO, Wei Zhou, told The Block.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nEarlier today, Zurich-based financial news outlet Inside Paradeplatz <a href=\"https:\/\/insideparadeplatz.ch\/2019\/12\/06\/svp-anwalt-kuoni-dealt-mit-china-crypto-boerse\/\" data-v-f87c67ca=\"\">reported<\/a> that <a href=\"https:\/\/markets.businessinsider.com\/news\/stocks\/union-bank-ag-to-be-the-first-fully-regulated-bank-ever-to-issue-its-own-security-tokens-closely-followed-by-a-fiat-backed-union-bank-payment-coin-1027467018\" data-v-f87c67ca=\"\">Union Bank AG<\/a> has held a meeting with “representatives of Binance” and the Financial Market Authority (FMA) of Liechtenstein, which is likely to accept the deal between Binance and the bank. The report cited a letter dated Nov. 19, sent by Wolfram Kuoni, a commercial lawyer based in Zurich, to the \"shareholders\" of Union Bank AG.","“The FMA is likely to accept Binance as shareholder,\" read the letter. \"However, given that (Union Bank) as of now in default of the (FMA) order regarding own funds, FMA has made it clear that Binance must file to application for approval as shareholder and pay in amount of CHF 15 million [$15.17 million] to escrow account for a later capital increase by the end of November,\" the letter continued.","It also said that if the deal doesn’t go through, the FMA may withdraw Union Bank AG's license, forcing it to go for liquidation.","Notably, Zhou further told The Block that Binance \"would be open to exploring a partnership with Union Bank and its new investors. Binance is committed to adding safe and reliable fiat channels to drive crypto adoption around the world.”","The Block has reached out to Union Bank AG and Kuoni and will update this story if we hear back.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nJust earlier this week, Binance <a href=\"https:\/\/www.theblockcrypto.com\/post\/49010\/binance-acquires-chinese-blockchain-data-startup-dappreview-for-undisclosed-sum\" data-v-f87c67ca=\"\">acquired<\/a> Beijing-based blockchain data startup DappReview for an undisclosed sum. This was the exchange's fourth publicly announced acquisition. Last month, Binance <a href=\"https:\/\/www.theblockcrypto.com\/post\/47852\/binance-acquires-indian-crypto-exchange-wazirx-to-serve-over-1-billion-people-of-the-country\" data-v-f87c67ca=\"\">acquired<\/a> Indian cryptocurrency exchange WazirX, reportedly in a $5-$10 million price range. In September, it <a href=\"https:\/\/www.theblockcrypto.com\/post\/38204\/binance-acquires-cryptocurrency-trading-platform\" data-v-f87c67ca=\"\">bought out<\/a> little-known Seychelles-based derivatives platform JEX and rebranded it to Binance JEX to offer cryptocurrency futures, options, and perpetual contracts. Last year in July, Binance also <a href=\"https:\/\/techcrunch.com\/2018\/07\/31\/crypto-exchange-binance-buys-trust-wallet-in-first-acquisition-deal\/\" data-v-f87c67ca=\"\">snapped up<\/a> U.S.-based mobile wallet company Trust Wallet as its first acquisition ever.&nbsp;"],"hashtag":["BINANCE"]}