{"summary":"Banking giant JPMorgan believes that more payment companies will allow their clients to purchase bitcoin (BTC) via their apps, similar to Square&#x27;s Cash App.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/80838\/jpmorgan-payment-companies-bitcoin-square-cash-app","publishDate":"2020-10-14T05:20:36","id":2870,"type":null,"title":"JPMorgan believes more payment companies will enable bitcoin purchases similar to Square&#x27;s Cash App","category":["BITCOIN"],"content":["Banking giant JPMorgan believes that more payment companies will allow their clients to purchase bitcoin (BTC) via their apps, similar to Square's Cash App.","In a research note on Tuesday, JPMorgan strategists led by Nikolaos Panigirtzoglou wrote that Square's Cash App, which added bitcoin trading in 2018, surpassed the Grayscale Bitcoin Trust as a vehicle for bitcoin purchases by US millennials in Q2. Given the app's popularity, JPMorgan strategists believe \"other payments companies to follow in facilitating client bitcoin investments or risk being left behind.\"","Indeed, payment giants <a href=\"https:\/\/www.theblockcrypto.com\/linked\/69201\/paypal-venmo-crypto-buy-sell-report\" data-v-f87c67ca=\"\">PayPal and Venmo are said to<\/a> be in the works to offer crypto buying and selling services to their millions of users. PayPal has separately <a href=\"https:\/\/www.theblockcrypto.com\/post\/71483\/paypal-reveals-that-it-is-developing-crypto-capabilities\" data-v-f87c67ca=\"\">revealed<\/a> that it is developing crypto capabilities.","Square's Cash App facilitated $858 million worth of bitcoin purchases in Q2, while Grayscale's Bitcoin Trust facilitated $750 million worth of bitcoin buys in the same quarter. \"We believe that millennials, or the younger cohorts of the US retail investors universe, have been using the Cash App as an alternative vehicle to the Grayscale Bitcoin Trust to add to their bitcoin holdings,\" said JPMorgan strategists.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nWhile Square is yet to reveal numbers for Q3, analysts said assuming similar demand of $700 million in the Grayscale Bitcoin Trust implies that U.S. millennials purchased around $1400 million worth of bitcoin in the quarter. ","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">'Strong vote of confidence'<\/strong><\/span>","JPMorgan strategists also view <a href=\"https:\/\/www.theblockcrypto.com\/post\/80175\/jack-dorsey-square-purchases-50-million-worth-of-bitcoin\" data-v-f87c67ca=\"\">Square's recent $50 million worth of bitcoin<\/a> purchase as a \"strong vote of confidence\" for the future of the cryptocurrency. While the payment company's bitcoin investment is smaller than <a href=\"https:\/\/www.theblockcrypto.com\/linked\/77796\/microstrategy-buys-more-bitcoin\" data-v-f87c67ca=\"\">MicroStrategy's $425 million bet<\/a>, it is \"likely the beginning,\" according to strategists.","Square and MicroStrategy's moves signal the emergence of corporates as a source of bitcoin demand, said analysts, adding that the demand\/ supply (mining) balance for bitcoin improved to more than $925 million in Q3 versus $544 million in Q2.","Bitcoin derivatives, i.e., futures and options, are also seeing increased retail and institutional demand, according to strategists. They said the open interest in CME's bitcoin futures and BitMEX's bitcoin perpetual swap contracts \"increased sharply until mid-August before the September correction saw a retrenchment.\"","Bitcoin options have also seen a significant increase in open interest, said analysts, adding that it remains \"heavily skewed\" towards Deribit than CME Group. \"As we believe institutional clients would likely prefer to trade options contracts on a well-established and regulated exchange like CME, this suggests that Bitcoin options activity remains more retail-driven,\" said analysts.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Square","content":"ORGANIZATION"},{"type":"Grayscale Bitcoin Trust","content":"ORGANIZATION"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"$1400 million","content":"MONEY"},{"type":"CME Group","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"$925 million","content":"MONEY"},{"type":"$750 million","content":"MONEY"},{"type":"$425 million","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"$858 million","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"Square's Cash App","content":"ORGANIZATION"},{"type":"$700 million","content":"MONEY"},{"type":"$544 million","content":"MONEY"},{"type":"Nikolaos Panigirtzoglou","content":"PERSON"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"CME","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":["BITCOIN","JPMORGAN"],"authors":["Yogita Khatri","The Block"]}