{"summary":"The UK’s ad watchdog warned Arsenal Football Club not to trivialize investment in cryptoassets and banned two of the club’s ads promoting Socios fan tokens.\nRecent moves to rule against fan token advertising in the UK comes as part of a wider crackdown by the advertising regulator. ","author":["Lucy Harley-McKeown","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/128283\/uk-watchdog-bans-arsenal-football-club-fan-token-ads","publishDate":"2021-12-22T02:51:00","id":2871,"type":null,"title":"UK&#x27;s ad watchdog rules against Arsenal Football Club&#x27;s fan token promotion","category":["Cryptocurrency"],"content":["Arsenal Football Club has been reprimanded by the UK's advertising regulator over a Facebook post and content on its website that promoted fan tokens.","The Advertising Standards Authority (ASA) banned the content <span data-v-f87c67ca=\"\">for taking advantage of consumers’ inexperience in cryptoassets. The posts also misled consumers by not making it clear that fan tokens were a cryptoasset that had to be bought using another cryptocurrency, the regulator said.&nbsp;<\/span>","Arsenal had partnered with Socios, which uses blockchain technology to provide fan tokens, collectibles and other digital assets to sports organizations. The club's fan token, $AFC, can only be purchased on the Socios app using the cryptocurrency Chiliz ($CHZ), which was also invented by Socios.&nbsp;","Arsenal argued the promotion of the tokens was \"<span data-v-f87c67ca=\"\">designed to raise awareness of [...] the opportunity to interact with the Club such as the right to vote on official Club decisions.\"<\/span>","<span data-v-f87c67ca=\"\">The soccer club added that fan tokens were not promoted as financial products or an investment vehicle and it did not encourage the trading of fan tokens.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">It also said it believed Socios was well-known in the footballing community as a cryptocurrency platform because it sponsored and partnered with a number of European soccer clubs.<\/span>","Nevertheless, the ASA ruled the ads must not appear again in the form they were complained about. The club was also warned not to t<span data-v-f87c67ca=\"\">rivialize investment in cryptoassets.&nbsp;<\/span>","Data on <a href=\"https:\/\/coinmarketcap.com\/currencies\/arsenal-fan-token\/\" data-v-f87c67ca=\"\">CoinMarketCap<\/a> shows that since $AFC began trading in October, its price has more than halved from around $6.55. It had reached lows of around $2.76 by mid-December.&nbsp;","The recent moves to rule against fan token advertising in the UK comes as part of a wider crackdown. <a href=\"https:\/\/www.theblockcrypto.com\/linked\/127591\/uk-watchdog-bans-seven-crypto-ads-in-ongoing-crackdown\" data-v-f87c67ca=\"\">Earlier in December<\/a>, the ASA also published a volley of rulings against cryptocurrency advertising on London's transport network, calling crypto assets a \"red alert priority\".&nbsp;","The seven companies whose ads were deemed to have broken the Advertising Standards Authority's (ASA) rules included trading platforms eToro and Coinburp; exchanges EXMO, Luno, Kraken and Coinbase; as well as a promotion from pizza chain Papa John's.&nbsp;"],"hashtag":[]}