{"summary":"A survey of 800 institutions found nearly 80% of institutional investors see the appeal of digital assets\nMore than a third of such investors have already invested in the market\nThe survey found derivatives exposure has also increased substantially compared to 2019","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/67763\/fidelity-nearly-80-of-institutional-investors-see-the-appeal-of-digital-assets","publishDate":"2020-06-09T10:52:34","id":2872,"type":null,"title":"Fidelity: Nearly 80% of institutional investors see the appeal of digital assets","category":["The Block"],"content":["The overwhelming majority of investors are interested in digital assets, a survey conducted by asset-management giant Fidelity has found.&nbsp;","The survey, covering nearly 800 investors in the U.S. and Europe, found that nearly 80% of institutional investors found something appealing about the nascent asset-class. It also found that more than a third of such investors have already directly or indirectly invested in the market.&nbsp;","Fidelity conducted the survey from November 2019 to early March 2020, ending just before the COVID-19 economic and health crisis gripped global markets. Tom Jessop, president of Fidelity Digital Assets, said the survey also predated the release of an investor letter by famed hedge funder Paul Tudor Jones, which outlined a thesis for investing in bitcoin as an inflationary hedge.&nbsp;","\"[It] confirmed what a lot of macro investors were thinking,\" Jessop said.&nbsp;","Unconventional monetary policy by central banks aiming to stimulate the economy has forced investors to find new ways to preserve their wealth, pushing them into digital assets, Fidelity Digital Assets director of research Ria Bhutoria said during a conference call Tuesday. According to Bhutoria, investors found digital assets' uncorrelated nature and high potential upside as particularly appealing.","Compared to 2019, the portion of U.S. investors who hold digital assets increased from 22% in 2019 to 27% this year. Still, there are a number of obstacles institutions face in investing in the market, including price volatility, the lack of fundamentals to gauge appropriate value and market manipulation.&nbsp;","Bhutoria said the current macro-driven interest in bitcoin could be short-lived unless service providers offer the necessary tools to overcome those barriers. Crypto native firms like BitGo and Genesis Global Trading recently announced new prime services to help investors navigate the market. For its part, Fidelity Digital Assets offers execution and custody services for professional investors.&nbsp;","More investors have also taken on exposure to derivatives, according to the survey. The percentage of U.S. investors with exposure to cryptocurrency futures increased from 9% in 2019 to 22% in 2020.&nbsp;","","","CME Group's bitcoin future product has seen impressive growth over the last year with open-interest soaring above $500 million in early May. CME is perhaps the best gauge for institutional activity in the bitcoin derivatives market, given that traditional hedge funds already actively trade on its markets.&nbsp;","",""],"hashtag":[]}