{"summary":"Crypto exchange FTX has listed futures contracts of Coinbase ahead of its IPO.\nThe pre-IPO contracts allow traders to speculate on at what price Coinbase will list on a stock exchange.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/88851\/ftx-lists-coinbase-pre-ipo-futures-contracts","publishDate":"2020-12-22T03:50:12","id":2873,"type":null,"title":"FTX lists Coinbase pre-IPO futures contracts","category":["Exchanges"],"content":["Crypto exchange FTX has listed futures contracts of Coinbase ahead of its initial public offering (IPO).","The <a href=\"https:\/\/ftx.com\/trade\/CBSE\/USD\" data-v-f87c67ca=\"\">CBSE pre-IPO contracts<\/a> allow traders to speculate on at what price Coinbase will list on a stock exchange. In other words, the contracts track the market capitalization of Coinbase.","At the time of writing, <a href=\"https:\/\/ftx.com\/trade\/CBSE\/USD\" data-v-f87c67ca=\"\">the contracts<\/a> imply the market capitalization of Coinbase at about $58 billion (the current contract price of around $233 multiplied by the maximum market capitalization of the contracts, i.e., $250 million).","The<a href=\"https:\/\/ftx.com\/equities_terms\/KID_CBSE.pdf\" data-v-f87c67ca=\"\"> contracts expire<\/a> at the end of Coinbase's first trading day at a stock exchange, or on June 1, 2022. If the listing does not occur by the date, the contracts will automatically become fractional tokenized stocks.","The contracts also support margin trading, with up to 5x leverage. Within a few hours of listing today, the contracts have seen a trading volume of about $2.1 million, as of this writing.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThat's a \"pretty healthy volume so far,\" FTX CEO Sam Bankman-Fried told The Block. He said the Coinbase contracts were one of the most asked products.&nbsp;","The brokerage services provider for the contracts is FTX partner CM-Equity AG that is based in Germany.","The Coinbase pre-IPO contracts are the <a href=\"https:\/\/www.theblockcrypto.com\/daily\/87645\/ftx-futures-ipo-robinhood-coinbase\" data-v-f87c67ca=\"\">second such product by FTX after Airbnb<\/a>. Bankman-Fried told The Block last week that the exchange could list Coinbase and Robinhood pre-IPO contracts.","The Coinbase contracts have now arrived as the exchange <a href=\"https:\/\/www.theblockcrypto.com\/linked\/88293\/coinbase-s-1-potential-ipo-filing\" data-v-f87c67ca=\"\">filed a confidential S-1 form<\/a> with the U.S. Securities and Exchange Commission on Thursday.","It should be noted that, like other products of FTX, its pre-IPO contracts are not available to U.S. residents."],"hashtag":["COINBASE","FTX"]}