{"summary":"OKX announced Friday that institutional trade volume exceeds $3 billion on its Liquid Marketplace.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237191\/institutional-trade-volume-exceeds-3-billion-on-okxs-liquid-marketplace","publishDate":"2023-06-30T05:50:30","id":2873,"type":null,"title":"Institutional trade volume exceeds $3 billion on OKX&#x27;s Liquid Marketplace","category":["EXCHANGES"],"content":["Trade volume on OKX's Liquid Marketplace, a network for professional and <a href=\"https:\/\/www.theblock.co\/post\/236835\/ledger-launches-custodial-trading-network-for-institutions\" data-v-f87c67ca=\"\">institutional traders,<\/a>&nbsp;has t0pped $3 billion.","The second-largest crypto exchange by 24-hour trading volume announced the milestone on Friday. \"The Liquid Marketplace, an on-demand liquidity network for institutional traders, exceeded USD$3 billion in trading volume,\" OKX said in a <a href=\"https:\/\/www.globenewswire.com\/en\/news-release\/2023\/06\/30\/2697553\/0\/en\/Flash-News-OKX-Liquid-Marketplace-Exceeds-Over-USD-3-Billion-in-Institutional-Trading-Volume.html\" data-v-f87c67ca=\"\">statement<\/a>.","The Liquid Marketplace allows professional and institutional traders to send requests for quotes (RFQs) to market makers for large digital asset transactions. The execution of the order is done discreetly and does not significantly impact the market price on settlement.","The exchange is expanding its offering for institutional customers. It recently struck a partnership with regulated digital asset custody service provider <a href=\"https:\/\/www.theblock.co\/post\/200765\/former-komainu-president-orser-named-ceo-of-dubais-crypto-regulator\" data-v-f87c67ca=\"\">Komainu<\/a>.","It also added 'Nitro Spreads' to Liquid Marketplace — which already offered&nbsp;OTC, futures spreads and options liquidity. Nitro Spreads is a trading tool that executes both legs of a trade simultaneously via a central order book, thereby mitigating leg risk between markets. The company added that Nitro Spreads automate this kind of trade into one-click. Traders can apply this feature across any combination of spot, perpetual and futures contracts listed on the exchange.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"OKX","content":"ORGANIZATION"},{"type":"$3 billion","content":"MONEY"},{"type":"Nitro Spreads","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"3 billion","content":"MONEY"}],"hashtag":["CRYPTO","OKX"],"authors":["Brian McGleenon","The Block"]}