{"summary":"Tetragon Financial Group, the lead investor of Ripple&#x27;s $200 million Series C, has sued the company after a recent complaint by the U.S. Securities and Exchange Commission (SEC).","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/90135\/ripple-series-c-lead-investor-tetragon-sues-the-company","publishDate":"2021-01-05T13:21:59","id":2875,"type":null,"title":"Ripple’s Series C lead investor Tetragon sues company in wake of SEC charges","category":["RIPPLE"],"content":["Ripple is facing yet another lawsuit, this time from one of its investors.","Tetragon Financial Group, <a href=\"https:\/\/www.theblockcrypto.com\/post\/51237\/ripple-raises-200m-series-c-to-boost-xrp-adoption\" data-v-f87c67ca=\"\">the lead investor of Ripple's $200 million Series C<\/a>, has sued the company after a recent complaint by the U.S. Securities and Exchange Commission (SEC), according to a report by <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2021-01-05\/ripple-investor-sues-to-force-stock-redemption-after-sec-claim\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Bloomberg<\/a>.","Tetragon filed its complaint on Monday in Delaware Chancery Court, seeking to \"enforce its contractual right to require Ripple to redeem\" Series C preferred stock, per the report.","Tetragon also wants to block Ripple from using any cash or other liquid assets until the payment is made. The company has asked the court for a temporary restraining order, a preliminary injunction, and an expedited trial.","Following the publication of this report, Ripple addressed the legal filing in a statement posted to its website, <a href=\"https:\/\/ripple.com\/ripple-press\/ripples-statement-on-yesterdays-tetragon-filing\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">stating<\/a>:","“In Ripple’s Series C investment agreement, there is a provision that if XRP is deemed to be a security on a go forward basis, then Tetragon has the option of having Ripple redeem their Ripple equity. Since there has been no such determination, this lawsuit has no merit. We are disappointed that Tetragon is seeking to unfairly take advantage of the lack of regulatory clarity here in the U.S. The courts will provide this clarity and we are very confident in our position.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Delaware Chancery Court","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Tetragon","content":"ORGANIZATION"},{"type":"Tetragon","content":"PERSON"},{"type":"$200 million","content":"MONEY"},{"type":"U.S","content":"LOCATION"},{"type":"Tetragon Financial Group","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}