{"summary":"WisdomTree Investments, with over $60 billion in client assets, has launched a bitcoin exchange-traded product \nThe ETP is listed on Swiss stock exchange SIX \nAlexis Marinof, head of Europe at WisdomTree, said “digital assets, like Bitcoin, are not a passing trend and can play a role in portfolios”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/49050\/another-bitcoin-exchange-traded-product-gets-launched-this-time-by-traditional-asset-manager-wisdomtree","publishDate":"2019-12-03T07:10:15","id":2876,"type":null,"title":"Another bitcoin exchange-traded product gets launched, this time by traditional asset manager WisdomTree","category":["Bitcoin"],"content":["Traditional asset management firm WisdomTree Investments, with over $60 billion in client assets, has ventured into the cryptocurrency space with the launch of a bitcoin exchange-traded product (ETP).<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAnnouncing the news on Tuesday, New York-headquartered WisdomTree, with units in Europe and Canada, <a href=\"https:\/\/www.wisdomtree.eu\/en-ch\/-\/media\/eu-media-files\/uncategorized\/wisdomtree-bitcoin-launch-final.pdf\" data-v-f87c67ca=\"\">said<\/a> the physically-backed bitcoin ETP will allow investors to gain access to the world’s largest cryptocurrency without the need to hold it directly. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe ETP is<a href=\"https:\/\/www.six-group.com\/exchanges\/exchange_traded_products\/trading\/newlistings\/2019\/details_en.html?id=GB00BJYDH287USD4\" data-v-f87c67ca=\"\"> listed<\/a> on Switzerland’s primary stock exchange SIX and has a management fee of 0.95%. “We have seen enough to believe that digital assets, like Bitcoin, are not a passing trend and can play a role in portfolios,” said Alexis Marinof, head of Europe at NASDAQ-listed WisdomTree.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nRafi Aviav, head of product development, capital markets and technology at WisdomTree, added: “Cryptocurrencies are potentially the next asset class to benefit from increased interest when they become accessible in an ETP structure. We have developed a solution which addresses the difficulties investors face in accessing digital assets and are bridging the gap between the underlying decentralized online blockchain technology and traditional investment structures.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nCustodian and market maker for the ETP is Swissquote and Flow Traders, respectively. Several cryptocurrency ETPs have recently been listed on SIX. The exchange, in a separate statement, <a href=\"https:\/\/www.six-group.com\/en\/home\/media\/releases\/2019\/20191203-wisdom-tree-etp.html\" data-v-f87c67ca=\"\">said<\/a> that WisdomTree increases the number of ETP issuers at SIX to four and the number of tradable ETPs to 19, of which more than 50% have a cryptocurrency as underlying.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“All ETPs and Structured Products with a crypto currency underlying combined, the number of available products amounts to 76. Since the start of the year, CHF 502 million [~$508 million] have been traded in these products, an increase of 14% compared to the whole previous year,” SIX added.&nbsp;&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nFintech firm Amun AG, for instance, has a total of <a href=\"https:\/\/www.theblockcrypto.com\/linked\/41884\/swiss-six-exchange-lists-bitcoin-and-ether-exchange-traded-product\" data-v-f87c67ca=\"\">nine<\/a> cryptocurrency ETP products listed on the SIX exchange, including an XRP-based ETP, a BTC-based ETP, a bitcoin cash (BCH)-based ETP and an ETH-based ETP, among others. Most recently, Amun <a href=\"https:\/\/www.theblockcrypto.com\/post\/47081\/swiss-stock-exchange-six-lists-first-income-generating-crypto-product-tied-to-tezos-token\" data-v-f87c67ca=\"\">listed<\/a> an income-generating ETP tied to tezos (XTZ) token on SIX.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nJust last week, Canadian asset manager 3iQ also<a href=\"https:\/\/www.theblockcrypto.com\/linked\/48675\/canadian-asset-manager-set-to-offer-trading-of-bitcoin-fund-in-coming-months\" data-v-f87c67ca=\"\"> filed<\/a> a prospectus for a regulated fund tied to bitcoin. It could list on the Toronto Stock Exchange and start trading by end of this year. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nOther players offering cryptocurrency investment products include CoinShares' XBT Provider and Digital Currency Group’s Grayscale. The latter remains the market leader - it saw inflows rise by 200% in Q3 at $254.9 million. A market observer recently <a href=\"https:\/\/www.theblockcrypto.com\/daily\/43598\/grayscale-sees-inflows-up-by-200-in-q3-but-where-are-its-competitors\" data-v-f87c67ca=\"\">told<\/a> The Block that Grayscale's availability on the public market holds strong appeal to both institutional and retail investors and some of Grayscale's offerings are traded at very high premiums on the secondary market."],"hashtag":[]}