{"summary":"Delegate Cash enables safer on-chain NFT and token interactions, and people are starting to use it.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/207581\/delegate-cash-hits-400-million-milestone-as-lesser-known-project-finds-real-adoption","publishDate":"2023-02-02T08:02:08","id":2876,"type":null,"title":"Delegate Cash hits $400 million milestone as lesser-known project finds real adoption","category":["CRYPTO ECOSYSTEMS"],"content":["Delegate Cash is one of the most rapidly growing protocols in crypto you’ve probably never heard of.","The concept is simple: imagine you’ve got an expensive NFT in a wallet, and you want to enter a token-gated community chat that’s only accessible with that NFT. Rather than continuously sign in to the community with that wallet — and risk losing the NFT — you can delegate such rights to a separate wallet. Then you can sign away to your heart’s delight and never risk losing your holdings.&nbsp;","It’s an idea that’s so mind-numbingly obvious when you have NFT holders losing Bored Apes worth hundreds of thousands of dollars <a href=\"https:\/\/www.theblock.co\/post\/143328\/bored-ape-instagram-account-hacked-nfts-worth-2-8-million-stolen\" data-v-f87c67ca=\"\">left<\/a>, <a href=\"https:\/\/www.theblock.co\/linked\/140102\/bored-ape-yacht-club-confirms-its-discord-was-hacked\" data-v-f87c67ca=\"\">right<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/132567\/nft-collector-loses-2-7-million-in-bored-ape-nfts-and-derivatives\" data-v-f87c67ca=\"\">center<\/a>. And yet, even though this technology has been around for a while, nobody has really been taking advantage of it.","Enter <a href=\"https:\/\/delegate.cash\/\" data-v-f87c67ca=\"\">Delegate Cash<\/a>. The three-person team took the basic idea of being able to delegate a token, wallet or smart contract to another wallet and created a simple implementation to carry this out in practice. The protocol is simply a registrar stored on the blockchain that any project can check to see if any rights have been delegated.&nbsp;","So far, projects adopting it include NFT lending platform Arcade, NFT collective Art Blocks and Bored Ape creators Yuga Labs. And it’s been so successful that 4,300 wallets are using it to store more than $400 million worth of NFTs.&nbsp;","“It’s just been a whirlwind. I don’t think it’s really sunk in,” said Delegate Cash COO Munam Wasi. “$400 million in basically four months. It’s just such an outstandingly crazy growth rate and statistic.”","The key thing about Delegate Cash is that you can only transfer the ability for the delegated wallet to do certain actions, like sign into token-gated communities. What you can’t do is delegate the right to transfer the actual NFT. This means that crypto users are able to interact with crypto applications without the risk of losing their tokens.","“It’s extremely powerful. It gives people confidence to do on-chain interactions again,” said the pseudonymous Delegate Cash CEO Foobar. He said the huge problem with crypto is that people new to the industry get hacked while experienced users avoid interacting on-chain as much as possible, slowing down adoption. He added that until this is solved, the fear will outweigh the fun.","Right now, there are few risks of using Delegate Cash. The biggest risk is that a user unwittingly uses the wrong website when setting up their delegation. At this moment, they are using their main wallet and are at risk of losing tokens if they make a mistake. But once they have delegated their tokens, then they are largely safe.&nbsp;","Currently Delegate Cash is on 12 EVM-compatible blockchains, including Ethereum, Polygon and Optimism. Since the project is simply an on-chain registry, it requires projects to adopt it for the delegation to actually work. But it’s already seeing a lot of interest from wallet companies, DeFi protocols, infrastructure projects and governance projects, the team said. Beyond this, some creators are even looking at native blockchain integration.","The team is helping to work toward a delegate registration standard (see <a href=\"https:\/\/eips.ethereum.org\/EIPS\/eip-5639\" data-v-f87c67ca=\"\">more here<\/a>) that would standardize this type of tooling.&nbsp;","Collab Land, a popular token gating system on Ethereum, also is planning to add support for Delegate Cash, according to Wasi and which Collab Land confirmed to The Block. This would bring this delegation ability to a lot of crypto-focused Discord servers for their corresponding NFTs.","The launch of Yuga Labs’s game Dookey Dash has resulted in further adoption of Delegate Cash among holders of its Sewer Passes. Anyone who holds a Sewer Pass NFT in their wallet can access the game by signing a message with that wallet.&nbsp;","Some players wanted to use their NFTs to let other people play the game without actually handing them the NFTs, which are each worth thousands of dollars.&nbsp;","&nbsp;“That’s actually been the biggest use case for Delegate Cash lately,” said Foobar. “You have whales with 20, 30 or 40 Sewer Passes and they want to give them out to different friends. So they’ll do token-by-token delegation to gamers, friends, family and so on and play on a separate Sewer Pass, which is super powerful.”","One NFT collector called TropoFarmer <a href=\"https:\/\/twitter.com\/tropoFarmer\/status\/1617598151011237890\" data-v-f87c67ca=\"\">experimented<\/a> with this idea on Twitter to his 171,000 followers. He delegated his pass to an external wallet and publicly shared the private key for that wallet. Anyone who imports that private key can then use the pass to play the game, although only one person is able to do so at any one time.","\"My goal was to offer anyone the ability to try Dookey Dash without paying a cent and without putting my or their assets at risk,\" TropoFarmer told The Block. \"It's been awesome.\"","Delegate Cash also supports delegation for a fixed period of time. Anyone who delegates a token or wallet can set a deadline for when the delegation should stop working.","Wasi said that he had spoken to parents who wanted to let their kids play the game but didn’t want to hand over full control to their MetaMask accounts. “That I think is the real magic here,” he said.","The team sees Delegate Cash as an open-source public good with no plans to directly monetize it. But it does see opportunities in building applications on top of the protocol that have use cases and can be monetized.","The Delegate Cash team on Jan. 30 released its first application, called <a href=\"https:\/\/twitter.com\/0xfoobar\/status\/1620464673970868225\" data-v-f87c67ca=\"\">Liquid Delegate<\/a>. This takes advantage of the underlying registry to let people lend their NFTs (in a similar, but more streamlined, way to what NFT holders were doing with their Sewer Passes).","How this works is that you move the asset you are delegating into an escrow account. The protocol then generates a Liquid Delegate NFT and makes sure that the delegation is to whoever owns that NFT. The NFT can then be traded, allowing people to trade whatever rights are being delegated from the original token.","One example of this is for crypto gaming projects. They might have a hundred of their own tokens in the project’s treasury, which are stored for value but then can’t be used to play the game. The project could choose to rent out these assets — by turning them into Liquid Delegate NFTs —&nbsp;to other players and create additional income while holding onto the underlying assets long term.&nbsp;","Another example is for airdrop rights. Let’s say you have a wallet that has interacted with a project that is expected to have an airdrop in the near future. You could delegate the rights to receiving tokens from that project as a Liquid Delegate NFT. So anyone who holds the NFT would receive the airdrop itself. This could create an active marketplace for trading airdrops before they happen. It's worth noting that this only works if the project doing the airdrop has integrated Delegate Cash.","Here, the team noted, there are slightly more attack surfaces. If the escrow is coded improperly, theoretically something could go wrong there, Foobar said. But he argued there’s less risk than traditional NFT lending and renting markets, where you can get liquidated if the collateral drops too low. “The person who buys your liquid NFT has no ability to take [the underlying NFT] whatsoever,” he said.","There are a few caveats too, Foobar cautioned. These include certain airdrops and NFT staking solutions like Moonbird Nesting, where NFTs have to stay in the same wallet. He also said there might be issues with Bored Ape staking for ApeCoin. But that said, he added that it “does unlock a ton of unused capabilities.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Wasi","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Sewer Pass NFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$400 million","content":"MONEY"},{"type":"Yuga Labs","content":"ORGANIZATION"},{"type":"Foobar","content":"PERSON"},{"type":"Collab Land","content":"ORGANIZATION"},{"type":"Jan. 30","content":"DATE"},{"type":"Moonbird Nesting","content":"ORGANIZATION"},{"type":"Delegate Cash COO Munam Wasi","content":"ORGANIZATION"}],"hashtag":["ASSETS","BAYC","ETHEREUM","EXPLOITS","GAMING DAOS","HACKS","SMART CONTRACTS","STAKING","TRADING CARD GAMES","WALLET MAKERS"],"authors":["Tim Copeland","The Block"]}