{"summary":"The “Squid Game” token’s price rose astronomically over the last few days — since users were unable to sell it.\nThe developers have now dumped all of their tokens on the market, taking $11.9 million.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/122795\/unofficial-squid-game-token-crashes-99-as-devs-dump-for-12-million","publishDate":"2021-11-01T10:43:43","id":2881,"type":null,"title":"Unofficial Squid Game token crashes 99% as devs dump for $12 million","category":["Cryptocurrency"],"content":["The price of Squid Game token crashed to near-zero today as the developers behind the project sold their tokens on the market for 22,328 BNB ($11.9 million).","The price of the token fell from $2,856 to $0.00079 instantly as 70 million tokens were dumped on the market.","But it wasn’t just a surprise drop. It appears to be a highly engineered scam.&nbsp;","The project had a number of red flags that initially drew a healthy dose of skepticism.","The project itself was themed after the hit Netflix show Squid Game, but with no apparent official approval or connection — despite a claim on its website that it was partnered with Netflix.","It also claimed to have further partnerships including NFT marketplace OpenSea, crypto tracking sites CoinMarketCap and CoinGecko, and Microsoft. Plus a partnership with Binance Smart Chain (BSC), a decentralized blockchain (while the token did indeed run on BSC, that’s hardly a partnership).","The biggest concern about the project, however, was that some users reported they couldn’t sell their tokens after buying them. According to <a href=\"https:\/\/www.news18.com\/news\/business\/squid-game-crypto-token-surges-2400-in-24-hours-should-you-buy-it-4378613.html\" data-v-f87c67ca=\"\">reports<\/a> at the time, the project claimed it had “anti-dumping technology” to prevent sales if certain conditions were met —&nbsp;but this was still a major red flag.&nbsp;","It appears that there was a lock-up function in the smart contract that was designed to prevent sales, according to The Block Research’s Jae Oh Song. This meant that when money flowed into the market on the decentralized exchange PancakeSwap, it was locked up. It’s unclear what percentage of users were able to sell their tokens at any point.&nbsp;","Since there was little to no selling pressure, the price of the token rose astronomically. This was bolstered by mainstream news articles that highlighted the skyrocketing price but contained few warnings of the apparent risks.","The token was only available through one liquidity pool: between Binance Smart Chain’s native token BNB and the SQUID token. This meant that all of the money getting spent on the SQUID tokens was together in one pool.&nbsp;","Once there was enough money in the pot for the taking, it seems the developers behind the project, who held a large number of tokens in <a href=\"https:\/\/bscscan.com\/address\/0x71D934Aa2119CA3995F702f075d540f7A6b0f728\" data-v-f87c67ca=\"\">one wallet<\/a>, decided to dump them on the market. Since their tokens were unlocked, they were able to sell on PancakeSwap and take nearly all of the liquidity.","Since the dump, it appears that the developers have unlocked everyone else's tokens, so they can sell whatever's left against the remaining liquidity.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>"],"hashtag":["CRYPTO"]}