{"summary":"Filecoin Foundation will deploy IPFS aboard a Lockheed Martin spacecraft this year to test decentralized storage in space.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/202745\/filecoin-foundation-set-to-test-ipfs-based-communication-in-space","publishDate":"2023-01-17T07:59:51","id":2882,"type":null,"title":"Filecoin Foundation set to test IPFS-based communication in space","category":["CRYPTO ECOSYSTEMS"],"content":["Filecoin Foundation, the governance entity that controls the Filecoin network, is moving forward with its plan to launch a decentralized file system in space this year, the foundation announced on Tuesday.","Filecoin Foundation will deploy the <a href=\"https:\/\/www.theblock.co\/post\/63189\/ipfs-network-upgrade-data-fetching\" data-v-f87c67ca=\"\">interplanetary file system (IPFS)<\/a> in space aboard a Lockheed Martin satellite, the announcement stated. This follows on from an earlier partnership between Filecoin and the U.S. aerospace tech firm to <a href=\"https:\/\/www.theblock.co\/linked\/148279\/filecoin-foundation-and-lockheed-martin-partner-to-bring-decentralized-storage-to-space\" data-v-f87c67ca=\"\">design a decentralized file storage system<\/a> for the space industry.","“With IPFS, data doesn't need to go back and forth from Earth with every click,” said Filecoin Foundation President Marta Belcher in the announcement.\"","The first launch will be a demonstration of the technology. Lockheed Martin’s spacecraft will perform the test once it is in orbit. This test will be used to evaluate use cases for decentralized storage in space. A particular focus will be on the viability of space-to-ground communication using IPFS.","IPFS is a peer-to-peer file storage and sharing system. The protocol uses unique identifiers for each piece of content. Nodes connect to their peers and can share these identifiers among themselves. Filecoin itself, a <a href=\"https:\/\/www.theblock.co\/post\/180450\/filecoin-releases-new-content-delivery-network-called-saturn\" data-v-f87c67ca=\"\">decentralized storage network<\/a>, uses IPFS for its protocol.","IPFS differs from the centralized data storage of the internet. Instead of referencing content by unique identifies, it references content by its location on a server. IPFS data retrieval involves connecting to the closest node on the network that has the unique identifier of the required content. ","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Earth","content":"LOCATION"},{"type":"Lockheed Martin","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Filecoin Foundation","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Marta Belcher","content":"PERSON"},{"type":"Filecoin","content":"PERSON"},{"type":"Lockheed Martin’s","content":"ORGANIZATION"}],"hashtag":["DEVELOPER TOOLS"],"authors":["Osato Avan-Nomayo","The Block"]}