{"summary":"Binance has partnered with Yahoo! Japan subsidiary and local crypto exchange TaoTao\nThe trio will operate a licensed crypto exchange in the country\nThe news follows Binance’s move to gradually stop serving Japanese residents on its main platform","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/53343\/binance-ties-up-with-yahoo-japan-subsidiary-to-operate-a-separate-exchange-in-the-country","publishDate":"2020-01-17T04:56:05","id":2884,"type":null,"title":"Binance ties up with Yahoo! Japan subsidiary to operate a separate exchange in the country","category":["Exchanges"],"content":["Cryptocurrency exchange Binance has partnered with Z Corporation, a wholly-owned subsidiary of Yahoo! Japan, to set up a separate platform in the country.","TaoTao, a Japanese licensed crypto exchange and a portfolio company of Z Corporation, is also joining the initiative, Binance <a href=\"https:\/\/www.binance.com\/en\/blog\/421499824684900362\/Z-Corporation-a-subsidiary-of-Yahoo-Japan-and-TaoTao-begin-negotiations-with-Binance-for-strategic-partnerships-in-the-Japanese-market-\" data-v-f87c67ca=\"\">announced<\/a> Friday. Z Corporation reportedly also has a 40% <a href=\"https:\/\/www.reuters.com\/article\/uk-crypto-currencies-yahoo-japan-test\/yahoo-japan-to-buy-minority-stake-in-cryptocurrency-exchange-idUSKBN1HK0O3\" data-v-f87c67ca=\"\">stake<\/a> in crypto exchange BitARG Exchange Tokyo.","As part of the partnership, the trio will operate a licensed crypto exchange in Japan. Z Corporation and TaoTao will collaborate with the country's financial regulator, the Financial Service Agency (FSA), to ensure compliance.","It is mandatory for crypto exchanges operating in Japan to be licensed by the FSA since they are regulated by the country’s Payment Services Act.","Just earlier this week, Binance <a href=\"https:\/\/www.theblockcrypto.com\/post\/53229\/binance-may-block-japanese-users-from-trading-on-its-platform\" data-v-f87c67ca=\"\">said<\/a> it will implement a “gradual restriction of trading functions” for Japanese residents “at a later date,” indicating that it will operate a separate exchange in the country.","Today’s news confirms the development. Binance’s Japan move strikes a resemblance to its U.S. initiative. Last year, the exchange first stopped serving U.S. residents, and then came back a few months later with a new exchange dedicated to the U.S. market, Binance.US.","For the U.S. launch, Binance partnered with a little-known Californian-registered firm BAM Trading Services.","Binance hasn’t yet provided timeline details for its Japan launch. The exchange has reportedly also set up a separate entity, Binance LTD, in South Korea."],"hashtag":["BINANCE"]}