{"summary":"Fidelity, Deloitte, Amazon, and 20 other firms are backing a new blockchain accelerator program \nThe program is set up by IDEO CoLab Ventures, a venture arm from design firm IDEO","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/30813\/fidelity-deloitte-amazon-support-new-blockchain-accelerator","publishDate":"2019-07-11T11:05:01","id":2886,"type":null,"title":"Fidelity, Deloitte, Amazon support new blockchain accelerator","category":["Layer 1s"],"content":["Fidelity, Deloitte, Amazon, and 20 other firms are backing a new blockchain accelerator program to mentor budding entrepreneurs in the space.","The program, dubbed “Startup Studio,” is set up by IDEO CoLab Ventures, a venture arm from design firm IDEO, and aims to help blockchain startups with product design, user testing, hiring, finance, law and engineering, through one-day workshops.","Amazon, for instance, will provide resources on how to build and deploy services on top of its Amazon Web Service (AWS) infrastructure, Ian Lee, managing director of IDEO CoLab Ventures told The Block.","Deloitte, on the other hand, will offer workshops on the journey and lifecycle for blockchain firms from an accounting, tax, and structuring perspective, while Fidelity's Center for Applied Technology will help them explore, accelerate, test, as well as partner on \"compelling new opportunities\" in the financial services space, Lee said.","Katie Chase, head of strategy for Fidelity Center for Applied Technology told The Block, \"The work we are doing to foster more usable blockchain solutions by mentoring and supporting start-ups is incredibly important and we are thrilled to see how they will shape the future of the space,” ","Each partner will take \"active\" roles and share the costs for running these workshops, including IDEO CoLab, said Lee. Ethereum Foundation, Stellar Foundation, Coinbase-backed NEAR Protocol and Messari are some of the program's other partners, and IDEO CoLab said it is expecting more firms to join in the future.","Participating startups can choose to go to a specific workshop at \"no cost,\" Lee said.","Some startups, including decentralized exchange protocol 0x, crypto lender Dharma and crypto derivatives exchange dYdX have already attended the program, IDEO CoLab said, adding: \"We've helped them validate\/invalidate new product concepts, design product UX\/UI, and find their first launch customers.\"","IDEO CoLab has been <a href=\"https:\/\/medium.com\/ideo-colab\/how-and-why-we-built-an-internet-connected-solar-panel-727d720d3803\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">active<\/span><\/a> in the blockchain space since as early as 2015, and has recently worked with Augur, a decentralized platform for creating predictions markets, as well as privacy-centric cryptocurrency startups Zcash and Grin, among others.&nbsp;","Back in February, IDEO CoLab also <a href=\"https:\/\/medium.com\/ideo-colab\/introducing-ideo-colabs-distributed-web-investing-program-9b044344fc8f\" data-v-f87c67ca=\"\">invested<\/a> in six blockchain startups, including Messari. Lee told The Block that its current portfolio includes nine companies and that the firm will invest in around 12 blockchain startups a year.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe firm believes that the blockchain industry has now reached the point where \"human-centered design and collaboration are needed to realize its full potential\" and mass adoption.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBlockchain accelerator programs are on the rise. The Block recently<a href=\"https:\/\/www.theblockcrypto.com\/2019\/05\/13\/a-major-incubator-is-setting-its-sights-on-being-the-y-combinator-of-crypto-or-better\/\" data-v-f87c67ca=\"\"> reported<\/a>&nbsp;that Creative Destruction Labs in Canada is working with 25 blockchain startups, offering them $100,000 in funding and tailored mentoring from notable firms."],"hashtag":[]}