{"summary":"Tezos cofounders Kathleen and Arthur Breitman are both defendants in the ongoing Tezos litigation in California federal court\nThey argue that “marital communications privilege” allows them to withhold from production written communications from them regarding the Tezos “fundraiser”\nThe privilege provides broad protection from disclosure of marital communications, but the parties disagree as to whether it applies to purely business related communications","author":["Stephen D. Palley","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/30999\/tezos-founders-claim-marital-privilege-to-keep-emails-between-them-confidential","publishDate":"2019-07-12T13:30:02","id":2889,"type":null,"title":"Tezos founders claim &#x27;marital privilege&#x27; to keep emails between them confidential","category":["Legal"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","If you are a fan of the murder mystery or police procedural genres you have heard the term “marital privilege” before. The plot device works like this — husband is charged with a crime, allegedly confesses to wife, who refuses to testify against husband based on marital privilege. The basic idea is that one spouse can’t be required to testify against another because as a matter of public policy we believe that marriage is important and we don’t want to discourage spousal communication. In addition to the testimonial privilege, which my hypothetical addressed, the marital privilege can also extend to discovery of communication between spouses — conversations, text messages, emojis etc. This marital communications privilege is what’s currently at issue in the Tezos class action litigation.","As a part of the discovery process in this case, Plaintiffs sent the defendants a series of document requests. You’ll recall that Kathleen and Arthur Breitman are both defendants in this case and also (as the last name suggests) happen to be married and also happen to be the founders of defendant Dynamic Ledger Services (DLS) and, respectively Chief Executive Officer and Chief Technology Officer. In responding to Plaintiffs’ document requests they refused to produce certain documents on the basis of marital communications privilege, which are listed on a privilege log attached to this particular court filing. The documents include subjects such as communications regarding website content, press inquiries, third party inquiries regarding “fundraiser” and a variety of other communications regarding the business of DLS and Tezos.","Plaintiff took issue with these objections. Defendants stood by them. This joint filing articulates each side's position about the dispute to the Court.","Plaintiffs argue that the communications are “purely business communications between business partners that would have occurred” even if they weren’t married, so the privilege doesn’t apply. Also, they aren’t confidential communications, Plaintiff argues, because the emails at issue are between “work emails” used by the Breitmans that are owned, controlled and possessed by DLS. Alternatively, Plaintiffs argue that the Court should review the communications at issue “in camera” to “determine whether such communications were truly induced by the marital relationship or simply business communications between business partners.”","Defendants argue in response that they had “no reason to believe their emails were not confidential. DLS has no policy banning them from using work email for personal use, and does not give any third parties access to their email accounts.” They also argue that there is no “business communications” exception to the marital privilege in the 9th circuit and that “It would be destructive to marital relationships if spouses were forced to disclose such private, confidential communications merely because those communications relate to business matters.” Furthermore, they say that they are not using the privilege to hide business agreements with others or “conceal facts about their property or business transactions.”","Of course I don’t know how the Court will rule here. On the one hand, there are sound policy reasons for protecting marital communications, which the Breitmans’ lawyers have aptly briefed. On the other hand, highly relevant business communications in which there is no expectation of privacy may be difficult for the court to agree to withhold. While Defendants object to an in camera review, I’d be surprised if the Court didn’t at the very least give the documents a read and make a decision about how relevant they are before ruling. If produced, expect to see them treated as confidential and subject to a protective order that restricts their public production.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part I of this week's analysis, Crypto Caselaw Minute, is above.<\/em>"],"hashtag":[]}