{"summary":"Regulators in Nigeria are considering licensing digital exchanges and tokens backed by assets such as equity, debt and property — but has no plans to permit crypto trading.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228899\/nigeria-crypto-rules-asset-backed-tokens","publishDate":"2023-05-01T04:43:06","id":2889,"type":null,"title":"Nigeria may allow asset-backed tokens but not crypto: Bloomberg","category":["POLICY"],"content":["Regulators in Nigeria are considering licensing digital exchanges that deal in tokens backed by assets such as equity, debt and property — but has no plans to permit crypto trading, according to a report by Bloomberg.","Abdulkadir Abbas, head of securities and investment services at The Securities and Exchange Commission in Nigeria, told Bloomberg of the plan, adding, “We always like to start, as a regulator, with a very simple clear proposal before we go into the complex ones.”","The SEC in Nigeria has <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-05-01\/nigeria-s-sec-plans-to-allow-asset-backed-tokens-but-not-crypto?utm_content=crypto&amp;utm_campaign=socialflow-organic&amp;utm_medium=social&amp;utm_source=twitter\" data-v-f87c67ca=\"\">already begun processing applications<\/a> for digital exchanges, according to the report. Nigeria’s central bank has for some time restricted crypto trading in the country. In February 2021, it <a href=\"https:\/\/www.theblock.co\/post\/93975\/nigeria-central-bank-crypto-exchanges-warning\" data-v-f87c67ca=\"\">urged banks<\/a> to close accounts tied to crypto activities.","Nigeria’s SEC will work to register fintech firms as digital sub-brokers, crowdfunding intermediaries, robo-advisors, fund managers and tokenized coin issuers, according to today’s report. Such firms will spend a year in “regulatory incubation,” during which time they’ll be closely monitored by the SEC.","But no regime will be established for handing out licenses to crypto exchanges until standards can be agreed with the central bank.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Abdulkadir Abbas","content":"PERSON"},{"type":"February 2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Nigeria","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"The Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}