{"summary":"The market capitalization of Ampleforth’s AMPL token has declined by over 60% in the last three days.\nAMPL is a price-elastic token, meaning its supply adjusts in response to demand, and thus, affects its market cap.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/73394\/ampleforths-ampl-token-market-cap-declines","publishDate":"2020-07-30T05:00:07","id":2893,"type":null,"title":"The market cap of Ampleforth&#x27;s AMPL token has tanked by over 60%","category":["Cryptocurrency"],"content":["The market capitalization of AMPL, the native token of Ampleforth protocol, has declined by over 60% in the last three days.","From about $719 million on Monday, the AMPL market cap <a href=\"https:\/\/www.coingecko.com\/en\/coins\/ampleforth\" data-v-f87c67ca=\"\">went down<\/a> to as low as $262 million today before recovering slightly to $323.8 million at the time of writing. AMPL is a <a href=\"https:\/\/www.theblockresearch.com\/whats-the-value-of-ampleforths-supply-elastic-cryptocurrency-72136\" data-v-f87c67ca=\"\">price-elastic token<\/a>, meaning its supply adjusts in response to demand, and thus, affects its market cap.","When the price of 1 AMPL is above $1, the token's supply is increased until the desired price equilibrium of $1 is reached. If the price of AMPL goes below $1, the supply is decreased until the price parity has been restored.","The price of AMPL token has <a href=\"https:\/\/www.coingecko.com\/en\/coins\/ampleforth\" data-v-f87c67ca=\"\">gone down<\/a> by about 50% in the last 24 hours to currently trade at around $0.86. This resulted in deflated supply and affected AMPL's market cap sharply, as can be seen from the chart below.&nbsp;<br data-v-f87c67ca=\"\">\n","","Overall, the design of Ampleforth isn't exactly intuitive, as The Block Research’s Mika Honkasalo <a href=\"https:\/\/www.theblockresearch.com\/whats-the-value-of-ampleforths-supply-elastic-cryptocurrency-72136\" data-v-f87c67ca=\"\">noted in his recent column<\/a>. Investing in AMPL can be a “double-edged sword,” according to Honkasalo, because, in the case of sell-offs, investors can lose both — AMPL tokens as well as the value of those tokens.","Ampleforth is backed by several notable investors, including Pantera Capital, Arrington XRP Capital, Slow Ventures, and Coinbase CEO Brian Armstrong. Ampleforth has <a href=\"https:\/\/www.crunchbase.com\/organization\/fragments-a7cb\/company_financials\" data-v-f87c67ca=\"\">raised<\/a> $9.8 million in two venture capital funding rounds, according to Crunchbase. Last year, Ampleforth also held an initial exchange offering (IEO) via Bitfinex — the exchange’s first-ever IEO candidate. The protocol ended up <a href=\"https:\/\/medium.com\/bitfinex\/tokinex-reveals-first-ieo-ampleforth-43cd4dddaf80\" data-v-f87c67ca=\"\">raising<\/a> $5 million in just 11 seconds via the IEO, which was the hard cap for the fundraise."],"hashtag":[]}