{"summary":"Former OKEx COO Andy Cheung’s crypto derivatives exchange ACDX is launching next month\nThe exchange would offer structured products that can be customized\nCheung told The Block that he aims to make ACDX a top ten derivatives exchange next year","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/70390\/former-okex-execs-crypto-derivatives-exchange-acdx-is-launching-next-month","publishDate":"2020-07-03T07:20:08","id":2895,"type":null,"title":"Former OKEx exec&#x27;s crypto derivatives exchange, ACDX, set to launch","category":["Cryptocurrency"],"content":["A new crypto derivatives exchange, ACDX, is launching next month in beta mode.","Founded by former OKEx COO Andy Cheung, ACDX has been under development since February of this year. The Hong Kong-based exchange aims to fix two “major” issues of crypto derivative exchanges — lack of product innovation and lack of transparency, Cheung told The Block.","“Four years ago, BitMEX introduced bitcoin perpetual swap, and it still remains to be the most popular derivatives product because there are almost no new competitive products innovated since then,” said Cheung. To that end, ACDX plans to offer structured products that can be customized to meet each trader’s needs and risk appetite.","The first such product ACDX would launch is dynamic leveraged contracts. Traders would be able to buy and sell the bull or bear dynamic leveraged contracts depending on their views on the market. The contracts would offer a “clear liquidation level,” meaning traders would know at what price they will be liquidated, said Cheung. “It doesn’t require complex calculations to understand risks when trading.”","Looking ahead, ACDX plans to offer more structured products, including futures spread contracts and Hong Kong index contracts, as well as offer support for multi-collateral for its contracts, i.e. bitcoin, ether, stablecoins, and decentralized finance (DeFi) tokens.","On the transparency front, Cheung said ACDX aims to set “new standards for the industry” by providing full contracts specifications, clear market rules, and easy to understand cost of trading.","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Governance token&nbsp;<\/strong><\/span>","To bridge the centralized and decentralized exchange experience, ACDX would launch with its native “governance token” ACXT.","Cheung said liquidity providers would be rewarded with the token for placing orders (order makers), while takers won’t be given any rewards. Token holders will also get to vote on several matters, such as token burn rate, fees, listings, and hard forks, said Cheung.","There will be a total token supply of 50 million. Around 20% of that will be sold in “multiple sales this year” — through which the exchange plans to raise around $8-10 million, Cheung told The Block. Around 30% of the supply will be reserved for liquidity providers, while the remaining 50% will be reserved for developing ACDX and other general corporate purposes.","Cheung acknowledged that the token model “can still be far from an ideal model,” but he believes that it can be improved to “more viable models in the future.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Top ten?<br data-v-f87c67ca=\"\">\n<\/strong><\/span>","Cheung said he aims to make ACDX a top ten derivatives exchange next year by attracting more traditional players in the crypto space — both retail and institutional.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nACDX was set up with a capital of $4 million, which was contributed by co-founders themselves, said Cheung. The exchange is now looking to close $5 million Series pre-A equity round “very soon.” While for Series A in the future, ACDX plans to raise another ~$28 million.","There are around 25 people working for ACDX currently, and the exchange looks to hire more staff in marketing and business development functions in preparation for the launch of the exchange.&nbsp;","It remains to be seen how ACDX fares at a time when the overall crypto derivatives market is <a href=\"https:\/\/www.theblockcrypto.com\/linked\/67497\/bitcoin-derivatives-market-is-growing-faster-than-spot-market-suggesting-rising-institutionalization-in-the-space\" data-v-f87c67ca=\"\">growing at a faster rate<\/a> than the spot market. Several new crypto derivatives exchanges are set to launch in the coming months, including <a href=\"https:\/\/www.theblockcrypto.com\/post\/70248\/polychain-dex-market-crowd\" data-v-f87c67ca=\"\">DerivaDEX<\/a> and <a href=\"https:\/\/www.theblockcrypto.com\/daily\/62241\/polychain-alpha5-derivatives-exotics-bitcoin-mining\" data-v-f87c67ca=\"\">Alpha5<\/a>."],"hashtag":[]}