{"summary":"A wallet linked to Justin Sun acquired 5 million CRV tokens for $2 million from Curve’s Michael Egorov in a likely OTC deal.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242455\/justin-sun-buys-2-9-million-crv-tokens-in-an-otc-deal-announces-partnership-with-curve","publishDate":"2023-08-01T06:16:00","id":2895,"type":null,"title":"Justin Sun buys 5 million CRV from Michael Egorov and partners with Curve","category":["CRYPTO ECOSYSTEMS"],"content":["A wallet tagged as belonging to Justin Sun, the founder of the blockchain network Tron, acquired 5 million CRV tokens (valued at around $2.9 million) from Curve founder Michael Egorov for $2 million in what appears to be an OTC (over-the-counter) deal, security firm PeckShield first <a href=\"https:\/\/twitter.com\/PeckShieldAlert\/status\/1686292872583360512\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">noted<\/a>. Analysts at Lookonchain also <a href=\"https:\/\/twitter.com\/lookonchain\/status\/1686291199517437953\" data-v-f87c67ca=\"\">confirmed<\/a> the finding.","While the exact nature and intent of these transactions remain under speculation, on-chain data hints at a possible off-platform deal with Egorov to purchase CRV tokens at a rate lower than the market price, specifically at $0.40 each.","Sun has also <a href=\"https:\/\/twitter.com\/justinsuntron\/status\/1686308662363697152?s=21\" data-v-f87c67ca=\"\">announced<\/a> a partnership between Tron and Curve, seemingly confirming the connection. In a statement, Sun stated, “Excited to assist Curve! As steadfast partners, we remain committed to providing support whenever needed. Our joint efforts will introduce an stUSDT pool on Curve, amplifying user benefits. Together, we aim to empower the community and forge a decentralized finance.\"","Notably, stUSDT is described as the “first real-world asset protocol on the Tron Network.”&nbsp;","This comes amid turbulence in the CRV market. It's value hit the $0.50 mark earlier today, a low point since November of the prior year, before rebounding to $0.59. At the same time, open interest in CRV-linked perpetual futures grew to over <a href=\"https:\/\/coinalyze.net\/curve-dao-token\/open-interest\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">$124 million<\/a>, according to Coinalyze data. Data on&nbsp;<a href=\"https:\/\/coinalyze.net\/curve-dao-token\/funding-rate\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">negative funding rates<\/a>, also tracked by Coinalyze, suggests traders could be shorting CRV in anticipation of further price dips.","In response, Michael Egorov, the founder of Curve, tried to stabilize his personal large DeFi position that's at risk if the CRV price were to drop heavily. Amid sharp volatility, Egorov made several key <a href=\"https:\/\/debank.com\/profile\/0x7a16ff8270133f063aab6c9977183d9e72835428\/history?token=\" data-v-f87c67ca=\"\">transfers<\/a>. He repaid a noteworthy 5.13 million FRAX stablecoin loan and reclaimed 12.5 million CRV tokens as collateral. Observers also highlighted on-chain data showing that Egorov moved 12.5 million CRV from Fraxlend to a fresh wallet.","Before this action, Egorov had received USDT stablecoin from anonymous wallets, fueling <a href=\"https:\/\/twitter.com\/etheraltog\/status\/1686262939236364288?s=20\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">speculation<\/a>&nbsp;from crypto commentators about potential OTC deals or transactions off the main platform.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Egorov","content":"PERSON"},{"type":"CRV","content":"ORGANIZATION"},{"type":"earlier today","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Justin Sun","content":"PERSON"},{"type":"$2 million","content":"MONEY"},{"type":"$0.40","content":"MONEY"},{"type":"Tron Network","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"$2.9 million","content":"MONEY"},{"type":"Michael Egorov","content":"PERSON"},{"type":"$0.59","content":"MONEY"},{"type":"Coinalyze","content":"ORGANIZATION"},{"type":"$0.50 mark","content":"MONEY"},{"type":"$124 million","content":"MONEY"},{"type":"Lookonchain","content":"LOCATION"}],"hashtag":["ASSETS"],"authors":["Vishal Chawla","The Block"]}