{"summary":"Video game company Atari now allows holders of its NFT collection to print framed prints and posters through a new collaboration with Pixels.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/192803\/atari-pixels-print-nft-artwork","publishDate":"2022-12-07T04:35:57","id":2896,"type":null,"title":"Atari collaborating with Pixels for print-on-demand NFT artwork","category":["NFT COLLECTIONS"],"content":["Video game company Atari now allows holders of its NFT collection, Atari NFT, to print framed prints and posters through a new collaboration with print-on-demand company Pixels.","Atari NFT holders may connect their Ethereum wallets to AtariPrints.com to create physical versions of their NFTs, which are available in five different sizes.","\"There's no easier way to transform your NFT business into a physical art business,\" noted Sean Broihier, CEO of Fine Art America, in <a href=\"https:\/\/www.globenewswire.com\/news-release\/2022\/12\/06\/2568419\/0\/en\/Atari-Partners-With-Pixels-com-to-Transform-Atari-NFTs-Into-Physical-Works-of-Art.html\" data-v-f87c67ca=\"\">a press release<\/a>, adding: \"We're very excited to partner with Atari to show the NFT community what's possible when you allow NFT holders to transform digital assets into physical products.\"","\"With the recent rise in popularity of NFTs, it was a natural fit to expand our printing capabilities to the NFT community,\" added Sean Broihier, CEO of Pixels.&nbsp;","The Atari NFT collection — dubbed 50 Years of Atari — was launched in September to celebrate the company's 50th anniversary and pay homage to the old-school Atari 2600 console. It consists of 2,600 items. Its floor price is currently 0.068 ETH ($83.37) on NFT marketplace OpenSea.","Atari has long been a proponent of the web3 space. In September 2021, Atari's Head of Blockchain Manfred Mantschev told The Block it hopes to <a href=\"https:\/\/www.theblock.co\/post\/120929\/atari-wants-to-be-a-real-estate-whale-in-the-metaverse\" data-v-f87c67ca=\"\">capitalize<\/a> off of the \"land\" it owns in virtual worlds built by Decentraland and The Sandbox.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Atari","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Sean Broihier","content":"PERSON"},{"type":"Atari NFT","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"September 2021","content":"DATE"},{"type":"Blockchain Manfred Mantschev","content":"PERSON"},{"type":"$83.37","content":"MONEY"},{"type":"America","content":"LOCATION"},{"type":"Decentraland","content":"LOCATION"}],"hashtag":[],"authors":["Adam James","The Block"]}