{"summary":"Binance&#x27;s Layer 1 blockchain is planning to scale capacity for decentralized apps by using sidechains.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/139409\/bnb-chain-to-launch-application-specific-sidechains-to-reduce-network-strain","publishDate":"2022-03-28T05:32:37","id":2897,"type":null,"title":"BNB Chain to launch application-specific sidechains to reduce network strain","category":["CRYPTO ECOSYSTEMS"],"content":["<strong data-v-f87c67ca=\"\">Quick Take<\/strong>","<span data-v-f87c67ca=\"\">BNB Chain, a Layer 1 blockchain founded by crypto exchange Binance, plans to introduce sidechains to cut the cost and increase the speed of transactions for resource intense applications such as gaming.&nbsp;<\/span>","The BNB Chain Application Sidechain (BAS) will let developers port data and assets from BNB Chain, reducing strain on the network’s limited transactional resources, a B<span data-v-f87c67ca=\"\">inance spokesperson told The Block in a statement, without specifying when the sidechains will launch. <\/span><span data-v-f87c67ca=\"\">These sidechains will also be application-specific, meaning individual sidechains will focus on specific use cases. <\/span>","“The BAS is an infrastructure introduced to help developers and node operators build and run their own blockchain as their internal value system for a massive number of users while still maintaining a close connection with BNB Chain,”&nbsp; the spokesperson said.","<span data-v-f87c67ca=\"\">In February 2022, when BNB Chain <a href=\"https:\/\/www.theblockcrypto.com\/linked\/134257\/binance-renames-bsc-bnb-blockchain-token\" data-v-f87c67ca=\"\">rebranded<\/a> to its current name, the team said it planned to embrace large-scale applications in areas like GameFi, SocialFi and the Metaverse. Sidechains may be instrumental in achieving that goal.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/evm-chains-stats\/daily-new-unique-addresses-for-evm-chains\/embed\" title=\"Daily New Unique Addresses for EVM-Chains\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe> <\/span>","<span data-v-f87c67ca=\"\">Besides hosting BNB Chain-compatible dApps, BAS will also have the freedom to operate independently. So teams could pick their validator set for security needs rather than relying on the mainnet protocol. Finally, any development team will be able to deploy their own BAS on the network, the spokesperson added.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A good comparison to BAS is Ronin, a sidechain on Ethereum dedicated solely to Axie Infinity’s play-to-earn game. Other Layer 1 blockchains like <a href=\"https:\/\/www.theblockresearch.com\/mapping-out-the-polkadot-ecosystem-125017\" data-v-f87c67ca=\"\">Polkadot<\/a>, Avalanche and Cosmos also have application-specific chains for their ecosystem, but those may not necessarily be considered sidechains. A few t<\/span><span data-v-f87c67ca=\"\">eams working on on BNB Chain, <\/span><span data-v-f87c67ca=\"\">will soon come out with technical details on the very first BAS testnet that will focus on GameFi.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BNB","content":"ORGANIZATION"},{"type":"February 2022","content":"DATE"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"Ronin","content":"LOCATION"},{"type":"2023","content":"DATE"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}