{"summary":"An auction of MKR tokens intended to cover roughly $4.5 million in undercollateralized debt in the MakerDAO system began yesterday, and the Maker Foundation appears to be taking part.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/59421\/maker-foundation-mkr-debt-auctions-winning-bidding","publishDate":"2020-03-20T14:28:20","id":2898,"type":null,"title":"The Maker Foundation appears to be winning MKR auctions meant to cover a debt shortfall. The group says it&#x27;s helping bidders to participate","category":["DEFI"],"content":["On-chain data shows that the Maker Foundation has been participating in a series of auctions intended to cover $4 million in undercollateralized system debt created last week – and thus far, it appears to have won them all.","<a href=\"https:\/\/www.theblockcrypto.com\/post\/58606\/in-a-first-makerdao-protocol-to-auction-mkr-tokens-to-cover-4m-bad-debt\" data-v-f87c67ca=\"\">The MKR auction was triggered<\/a> when roughly $4.5 million undercollateralized debt was created after certain liquidators were able to win collateral liquidation auctions with 0 DAI, the Maker system’s stablecoin.","In the MakerDAO system, borrowers mint DAI, which has a soft peg to the dollar, by depositing ETH, BAT&nbsp; or USDC as collateral. However, because of a steep drop in the price of ether, a significant number of loans fell below their required 150% collateralization threshold.","The auction process includes minting and selling MKR – the MakerDAO protocol’s governance token – in exchange for DAI, with the raised funds being used to cover the debt. Each auction participant commits to putting up 50,000 DAI, with the chance to win up to 250 MKR if successful.","Since the auction process began on Thursday at around 10:30 am EST, 33 auctions have been concluded. Based on the data, the Foundation appears to have won every one of them, according to an analysis conducted by The Block.","When reached for comment, The Maker Foundation denied that it has been purchasing MKR tokens in these auctions. Instead, the foundation \"has offered limited technical assistance to some bidders on a first come, first serve basis to facilitate their timely and effective participation in the auctions,\" the Maker Foundation told The Block in an email.&nbsp;","\"Note, however, that this assistance in no way provides informational or any other advantage to those bidders, including capital,\" the Foundation said.","According to the Foundation, this move is in a similar vein as the <a href=\"https:\/\/www.youtube.com\/watch?v=N03Aw8lzJFE&amp;feature=youtu.be&amp;t=716\" data-v-f87c67ca=\"\">release<\/a> of the Auction UI a few days ago, which helps those without the necessary technical skills to participate in the auctions.&nbsp;","However, the Foundation's trading desk seems to receive all winning MKR, at least for now. All of the completed auctions were won by three addresses. These addresses, in turn, have sent their winning MKR back to the Maker Foundation’s <a href=\"https:\/\/etherscan.io\/address\/0x447a9652221f46471a2323b98b73911cda58fd8a#tokentxns\" data-v-f87c67ca=\"\">trading desk address<\/a>. The trading desk address was directly funded by <a href=\"https:\/\/etherscan.io\/address\/0x2cccc4b4708b318a6290511aac75d6c3dbe0cf9f#tokentxns\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">one of the multi-sig addresses<\/a> controlled by the Foundation.","In total, those addresses spent 1,650,000 DAI in exchange for 6,226.41 MKR, at an average price of 265 DAI per MKR. As a point of reference, the MKR is trading at 269.9 DAI on decentralized exchange Uniswap at press time.","As The Block’s research analyst Matteo Leibowitz noted, although Maker is thus far the sole winner of all bids, it has not have engaged in so-called wash bidding, where people continuously submit higher bids to artificially spike up the price.","“If you filter all auction bids by winning addresses, we see no overlap in bids\/auction among 3 addresses,” he said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Matteo Leibowitz","content":"PERSON"},{"type":"Foundation","content":"ORGANIZATION"},{"type":"150%","content":"PERCENT"},{"type":"MKR","content":"ORGANIZATION"},{"type":"$4 million","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Maker Foundation","content":"ORGANIZATION"},{"type":"$4.5 million","content":"MONEY"},{"type":"The Maker Foundation","content":"ORGANIZATION"}],"hashtag":["DAI"],"authors":["Celia Wan","The Block"]}