{"summary":"Along with Bitcoin miners, Ethereum miners have also been significantly impacted by China’s recent mining shutdown orders.\nBoth the hash rate of Chinese mining pools and the Ethereum network itself have seen a sharp decline over the past few weeks.\nShutdown orders and the broader market’s pullback have cooled down the prices of graphic unit processors.","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/109629\/ethereum-hash-rate-sink-china-mining-shutdown","publishDate":"2021-06-25T07:40:04","id":2899,"type":null,"title":"Ethereum&#x27;s hash rate sinks 20% after China&#x27;s mining shutdown orders","category":["Ethereum"],"content":["Bitcoin miners in China are not the only ones being affected by the country's high-level crackdown comment last month on bitcoin trading and mining activities.","The total hash rate securing Ethereum, the second-largest blockchain network by market capitalization, has also seen a sharp decline over the past month, with a steeper drop particularly in the past two weeks.","Data from <a href=\"https:\/\/cn.etherscan.com\/chart\/hashrate\" data-v-f87c67ca=\"\">Etherscan.io<\/a> shows that the network's hash rate was on an upward trend before reaching a recent top of around 643 terahashes per second (TH\/s) on May 20.","That was the time when the Chinese State Council, the country's central government, released a memo from a meeting where top officials made comments about cracking down specifically on \"<a href=\"https:\/\/www.theblockcrypto.com\/post\/105814\/china-bitcoin-miners-brace-regulatory-uncertainty\" data-v-f87c67ca=\"\">bitcoin trading and mining activities<\/a>.\"","The comment initially sparked a cloud of uncertainty among Chinese miners who didn't know when the regulatory hammer would drop.","For two weeks after May 20, Ethereum's network hash rate remained relatively steady at the 600 TH\/s level. But it began to experience a sharper decline after June 9, when <a href=\"https:\/\/www.theblockcrypto.com\/post\/107707\/xinjiang-bitcoin-miner-shut-crackdown-china\" data-v-f87c67ca=\"\">the Xinjiang government<\/a> issued an order to officials in the Zhundong economic development zone to cut energy supplies to \"virtual currency mining farms.\"&nbsp;","The Sichuan government followed Xinjiang's lead and <a href=\"https:\/\/www.theblockcrypto.com\/post\/108916\/sichuan-orders-state-power-grid-to-cut-supply-for-26-bitcoin-mining-farms\" data-v-f87c67ca=\"\">issued a similar order on June 18<\/a>. This led to the majority of the mining farms in the top two mining regions to suspend their operations.","Ethereum's network hash rate has now dropped below the 500 TH\/s level, which translates to a 20% decline.","In comparison, Bitcoin's total hash rate has dropped below 100 exahashes per second, down <a href=\"https:\/\/www.theblockcrypto.com\/post\/109315\/bitcoin-hashrate-declines-50-percent-china-mining-crackdown\" data-v-f87c67ca=\"\">nearly 50%<\/a> from its recent all-time-high.","Meanwhile, the hashing power connected to Hangzhou-based Sparkpool — once the biggest Ethereum mining pool by real-time hash rate — has declined from <a href=\"https:\/\/twitter.com\/wsfoxley\/status\/1407410159429685249?s=12\" data-v-f87c67ca=\"\">around 150 TH\/s a little over a week ago<\/a> to right now 85 TH\/s.&nbsp;","Further, Poolin, a major bitcoin mining pool based in China that also offers Ethereum mining, has <a href=\"https:\/\/www.theblockcrypto.com\/linked\/109600\/poolin-halt-btc-eth-hash-rate-token-china-crackdown\" data-v-f87c67ca=\"\">halted mining payouts<\/a> to users who have staked its bitcoin or Ethereum hash rate tokens. The firm said its proprietary Bitcoin and Ethereum mining operations in China have been crippled by the government's recent shutdown orders.","The pullback of the crypto market in recent weeks together with the shutdown orders in China affecting both bitcoin and Ethereum miners have also led to the cool down of the secondhand market of the graphic unit processors.","Data from Chinese mobile app Manmanbuy, which tracks historic prices of various electronic gadgets, shows that different models of GPUs have seen a price drop by between 20% to 50% over the past month."],"hashtag":["BITCOIN","ETHEREUM"]}