{"summary":"Interoperability platform Wormhole will allow users to claim the token airdrop today at 7:30 a.m. ET.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286189\/wormhole-to-begin-airdrop-claims-of-over-670-million-tokens-today","publishDate":"2024-04-03T04:00:40","id":29,"type":null,"title":"Wormhole to begin airdrop claims of over 670 million tokens today","category":["CRYPTO ECOSYSTEMS"],"content":["Interoperability platform Wormhole will allow users to claim the token airdrop today at 7:30 a.m. ET.","Nearly 400,000 wallets will be eligible to claim a total of 678,823,000 Wormhole tokens, accounting for 6.78% of the total 10 billion supply.","This is based on a February 6 snapshot of users across the project’s Portal bridge and ecosystem apps across 30 Wormhole-connected blockchains.","Of the airdrop allocation, 117 million tokens will go to holders of Wormhole Discord members, certain Monad community members, Pyth stakers, and holders of NFT collections including Bad Kids, DeGods, Mad Lads, and y00ts that were also registered on the project’s Discord.","The token is a native ERC20 token and a native Solana SPL token, estimated to have an initial circulating supply of 1.8 billion.&nbsp;","Following the airdrop claims, the token is expected to list on exchanges (both centralized and decentralized). Binance will <a href=\"https:\/\/twitter.com\/binance\/status\/1775112840073891866\" data-v-f87c67ca=\"\">list<\/a> the token for trading at 8 p.m. ET, pairing it against bitcoin and stablecoins. Solana-based decentralized exchanges will also have the token available for swaps right after the airdrop claims begin.","The token is currently trading at <a href=\"https:\/\/app.hyperliquid.xyz\/trade\" data-v-f87c67ca=\"\">over $1.5<\/a> on pre-launch markets such as HyperLiquid and Aevo, giving it a fully diluted valuation of $15 billion.","Wormhole is a communication protocol allowing users to move tokens and data across chains. It recently embraced the integration of zero-knowledge proofs into the platform, developing “light client” implementations for secure transfers across different chains using ZKPs. The goal is to create secure “corridors” between blockchains for messaging.","Wormhole’s plan is to create secure communication channels across major blockchains, including Ethereum, Near, Solana, Aptos, Sui, and Cosmos, addressing scaling concerns related to proof generation and verification in the light clients <a href=\"https:\/\/www.theblock.co\/post\/278338\/wormhole-amd-fpga-scaling\" data-v-f87c67ca=\"\">through AMD chips<\/a>.","The project is also working on <a href=\"https:\/\/www.theblock.co\/post\/240888\/wormhole-cosmos-appchain-gateway\" data-v-f87c67ca=\"\">Gateway<\/a>, an application-specific blockchain within the Cosmos ecosystem. Wormhole <a href=\"https:\/\/www.theblock.co\/post\/265184\/cross-chain-protocol-wormhole-closes-225-million-funding-round-at-2-5-billion-valuation\" data-v-f87c67ca=\"\">closed a $225 million<\/a> funding round last year, giving it a $2.5 billion valuation.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1.5","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Sui","content":"PERSON"},{"type":"6.78%","content":"PERCENT"},{"type":"Aptos","content":"LOCATION"},{"type":"AMD","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"8 p.m. ET","content":"TIME"},{"type":"$225 million","content":"MONEY"},{"type":"February 6","content":"DATE"},{"type":"$15 billion","content":"MONEY"},{"type":"$2.5 billion","content":"MONEY"},{"type":"7:30 a.m. ET","content":"TIME"},{"type":"Solana","content":"PERSON"},{"type":"Pyth stakers","content":"PERSON"},{"type":"Solana","content":"LOCATION"}],"hashtag":["AIRDROP","ASSETS","CROSS-CHAIN SWAPS","PROTOCOLS","SMART CONTRACTS","TOKENS"],"authors":["Vishal Chawla","The Block"]}