{"summary":"Compound is an open-source money market protocol\nThe startup has announced a distributed price feed for users to contribute and leverage pricing data in a distributed manner","author":["Steven Zheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/36460\/compound-launches-an-open-oracle-system-for-decentralized-pricing-data","publishDate":"2019-08-19T11:00:14","id":2900,"type":null,"title":"Compound launches an open oracle system for decentralized pricing data","category":["DeFi"],"content":["Compound, the open-source money market protocol, is trying to make DeFi projects more decentralized by setting an open standard for price oracles. The San Francisco-based startup <a href=\"https:\/\/medium.com\/compound-finance\/announcing-compound-open-oracle-development-cff36f06aad3\" data-v-f87c67ca=\"\">announced<\/a> on Monday the release of the “Open Oracle System,” a community project that enables developers to contribute and leverage pricing data from a distributed price feed. A price oracle is an entity that provides real-world data to a decentralized network, such as pricing data from a centralized exchange for a decentralized lending platform.","According to Compound, its protocol, like many other DeFi protocols, rely on price feeds that are typically maintained by a centralized group of people or an entity. In Compound’s case, its price feed oracles are maintained and selected by its team. In MakerDAO’s case, the price feed oracles are maintained by a set of <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/developer.makerdao.com\/feeds\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/developer.makerdao.com\/feeds\/\" data-v-f87c67ca=\"\">anonymous reporters<\/a>. This results in single points of failure for these projects.","“We believe that innovation in DeFi will accelerate dramatically when everyone has access to better, easier, more consistent prices, which will benefit the Compound protocol and Ethereum cooperatively.” Robert Leshner, founder of Compound, tells The Block. “It’s also necessary for Compound to become fully decentralized.”","Open Oracle System works as follows:","<span data-v-f87c67ca=\"\">A mockup interface of the Open Oracle System<\/span>","According to Leshner, “The Open Oracle project is really about transparency. Making it clear exactly who is attesting to a fact by storing that data under Reporter’s public key gives transparency.” While the project is intended for anyone to contribute prices to, the initial batch of reporters will be Compound, DeFi projects, exchanges, OTC desks, and application developers.","A prototype of the project is <a href=\"https:\/\/rinkeby.etherscan.io\/address\/0x64316d763d3925d12678778b0586a01318b44eab\" data-v-f87c67ca=\"\">running<\/a> on the Ethereum Rinkeby testnet. The prototype publishes data from three reporters: Coinbase Pro, Kraken, and Binance."],"hashtag":[]}