{"summary":"The crypto exchange has laid off 25% of its staff globally just days after abandoning plans to acquire a German bank.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/140412\/bitmex-lays-off-75-employees-after-bank-acquisition-collapses","publishDate":"2022-04-04T06:01:22","id":2900,"type":null,"title":"BitMEX lays off 75 employees after bank acquisition collapses","category":["EXCHANGES"],"content":["Crypto exchange BitMEX has laid off about a quarter of its staff globally just days after abandoning plans to acquire a German bank.","The company — which is owned by 100x Group — currently employs roughly 300 people, meaning the cuts will affect around 75 employees, according to people familiar with the matter. Staff were informed about the move last week.","“BitMEX is making changes to our workforce in order to streamline for the next phase of our business. Our top priority is to make sure all employees who will be impacted have the support they require,” said a BitMEX spokesperson.","“Each of them have been instrumental in the remarkable journey BitMEX has taken from its roots as a small startup to one of the top crypto exchanges in the world. The BitMEX platform will continue to operate as normal, and we will not be commenting further at this time.”","The news comes just weeks after BitMEX’s co-founders <a href=\"https:\/\/www.theblockcrypto.com\/linked\/135406\/bitmex-co-founders-hayes-delo-plead-doj\" data-v-f87c67ca=\"\">Arthur Hayes<\/a>, Ben Delo and <a href=\"https:\/\/www.theblockcrypto.com\/linked\/137020\/bitmex-co-founder-samuel-reed-pleads-guilty-to-bank-secrecy-act-violation\" data-v-f87c67ca=\"\">Samuel Reed<\/a> pleaded guilty to violating the US Bank Secrecy Act and agreed to pay criminal fines of $10 million each. In October 2020, the trio were hit with charges that they had illegally operated a crypto derivatives platform and violated anti-money laundering rules in the US.","A year later, BitMEX <a href=\"https:\/\/www.theblockcrypto.com\/linked\/114110\/bitmex-cftc-fincen-settlement-derivatives\" data-v-f87c67ca=\"\">paid $100 million<\/a> to settle charges brought by the Commodity Futures Trading Commission and Department of Treasury’s Financial Crimes Enforcement Network.","One person with knowledge of the changes taking place at BitMEX said that former CEO Hayes, who <a href=\"https:\/\/news.bitcoin.com\/bitmex-ceo-hayes-steps-down-following-u-s-criminal-charges\/\" data-v-f87c67ca=\"\">stepped down<\/a> in October 2020, had a hand in the cuts. “Arthur is taking a more active role in the company to effectively throw out what they have been planning and scale back everything,” the source said, referring to the firm's recent push into services outside its bread and butter derivatives business.","Current CEO Alexander Höptner joined the firm in late 2020 to help BitMEX pursue a&nbsp;“wider vision of shaping the evolution of digital financial service,” as noted in a blog post announcing his appointment at the time.&nbsp;","BitMEX’s spokesperson said the latest changes at the company “were implemented with the support of all our founders.”","“There is no change to the group's management structure, which continues to be led by Alexander Höptner as CEO and his experienced executive team,” they said.","Last week, BitMEX confirmed that its planned acquisition of 268-year-old German bank Bankhaus von der Heydt — which it announced in January — <a href=\"https:\/\/www.theblockcrypto.com\/linked\/140000\/bitmexs-planned-acquisition-of-bankhaus-von-der-heydt-falls-through\" data-v-f87c67ca=\"\">had been abandoned<\/a> after both parties mutually agreed to call off the deal.","Höptner had <a href=\"https:\/\/www.theblockcrypto.com\/news+\/132328\/why-bitmex-is-betting-its-future-relevance-on-a-268-year-old-german-bank\" data-v-f87c67ca=\"\">told The Block in January<\/a> that the acquisition could prove an “an extreme accelerator” in BitMEX’s efforts to reestablish itself as a top ten crypto exchange by volume.","BitMEX has been pursuing a “beyond derivatives” strategy since April last year, with plans to expand its services to include spot trading, brokerage, custody, information products and an educational hub — while not losing its focus on derivatives. Höptner saw the Bankhaus von der Heydt deal as a way to deliver on that plan while incorporating appropriate onboarding, know your customer and anti-money laundering checks.","The <a href=\"https:\/\/blog.bitmex.com\/bitmex-hires-marc-robinson-as-head-of-custody\/\" data-v-f87c67ca=\"\">appointment of banking veteran Marc Robinson<\/a> as global head of custody in June 2021 was touted as another “important step” in helping BitMEX expand beyond derivatives. But Robinson has now left the company, according to a person familiar with the matter, who added that his departure preceded the job cuts.","Robinson and Hayes were contacted for comment but did not respond by press time.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"US Bank","content":"ORGANIZATION"},{"type":"June 2021","content":"DATE"},{"type":"Hayes","content":"PERSON"},{"type":"April last year","content":"DATE"},{"type":"Marc Robinson","content":"PERSON"},{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bankhaus von der Heydt","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"Samuel Reed","content":"PERSON"},{"type":"Arthur","content":"PERSON"},{"type":"October 2020","content":"DATE"},{"type":"Robinson","content":"PERSON"},{"type":"Ben Delo","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"Commodity Futures Trading Commission and Department of Treasury’s Financial Crimes Enforcement Network","content":"ORGANIZATION"},{"type":"Alexander Höptner","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"$10 million","content":"MONEY"}],"hashtag":["BITMEX","DERIVATIVES","LAYOFFS"],"authors":["Ryan Weeks","Frank Chaparro","The Block"]}