{"summary":"Crypto analytics firm Chainalysis said it’s parting ways with about 150 employees and plans to focus on government contracting.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/254051\/chainalysis-lays-off-15-of-staff-plans-to-focus-on-public-sector","publishDate":"2023-10-02T22:49:35","id":2904,"type":null,"title":"Chainalysis lays off 15% of staff, plans to focus on public sector","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Crypto analytics firm Chainalysis is laying off about 150 employees, or about 15% of its staff.<\/span>","<span data-v-f87c67ca=\"\">In a Monday internal email to staff, its CEO Michael Gronager said the firm has to retreat from the commercial market and focus on government contracting, which seems more stable, according to a Forbes <\/span><a href=\"https:\/\/www.forbes.com\/sites\/stevenehrlich\/2023\/10\/02\/chainalysis-idling-150-employees-as-chill-of-crypto-winter-persists\/?sh=1c1d02df6bc8\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">report<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">Madeleine Kennedy, Chainalysis’s vice president of communications, confirmed the layoffs in an email to The Block.<\/span>","<span data-v-f87c67ca=\"\">\"This week we announced that we made the difficult decision to part ways with 15% of Chainalysis employees,\" Kennedy said. \"While Chainalysis continues to be well positioned for long-term success as a consistently top-performing software company, we are very focused on growing efficiently and, due to market conditions, believe it necessary to reduce our expenses at this time. We remain committed to our mission to build trust in blockchains among government agencies, financial institutions, and cryptocurrency businesses.\"<\/span>","<span data-v-f87c67ca=\"\">The latest round of cuts comes after Chainalysis&nbsp;<\/span><a href=\"https:\/\/www.coindesk.com\/business\/2023\/02\/02\/blockchain-analytics-firm-chainalysis-to-cut-jobs-in-reorganization\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">let go about 5% of its staff<\/span><\/a><span data-v-f87c67ca=\"\"> in February.<\/span>","<span data-v-f87c67ca=\"\">The firm is looking to shift its focus more to the public sector, which accounts for 70% of its revenue, according to the Forbes report, and hopes to work increasingly closely with governments.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Monday","content":"DATE"},{"type":"70%","content":"PERCENT"},{"type":"Madeleine Kennedy","content":"PERSON"},{"type":"Kennedy","content":"PERSON"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"February","content":"DATE"},{"type":"Michael Gronager","content":"PERSON"}],"hashtag":["HIRING"],"authors":["Timmy Shen","The Block"]}