{"summary":"Major figures in Russia’s tech industry and political opposition are criticizing a new proposal to ban crypto mining and trading in the country.\nBoth for the good of the country’s economic future and the practicality of implementation, they say, such a ban shouldn’t happen.","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/131275\/russian-crypto-ban-proposal-draws-denunciations-from-telegrams-durov-and-navalnys-chief-of-staff","publishDate":"2022-01-23T10:58:30","id":2905,"type":null,"title":"Russian crypto ban proposal draws denunciations from Telegram&#x27;s Durov and Navalny&#x27;s chief of staff","category":["Hacks"],"content":["Opposition forces in Russia are not pleased with a recent proposal to ban cryptocurrency mining and trading in the country.&nbsp;","In two separate (and lengthy) Telegram posts from January 20 and 22, <a href=\"https:\/\/t.me\/leonid_volkov\/2987\" data-v-f87c67ca=\"\">Leonid Volkov<\/a> and <a href=\"https:\/\/t.me\/durov_russia\/38\" data-v-f87c67ca=\"\">Pavel Durov<\/a> denounced <a href=\"https:\/\/www.theblockcrypto.com\/linked\/130980\/russias-central-bank-calls-for-blanket-crypto-ban\" data-v-f87c67ca=\"\">the Central Bank of Russia's proposal<\/a>.&nbsp;","Durov will be familiar to The Block's readers as the co-founder (alongside his brother Nikolai) of encrypted messaging app Telegram, whose ill-fated venture into launching its own cryptocurrency was shut down by US authorities.","Volkov is the right-hand man of leading Russian oppositionist Aleksei Navalny, currently in jail for his political activities. During Navalny's incarceration, Volkov has largely served as the mouthpiece for the opposition movement. Just last week, Russian authorities <a href=\"https:\/\/www.fedsfm.ru\/documents\/terrorists-catalog-portal-add\" data-v-f87c67ca=\"\">added<\/a> him and colleague Ivan Zhdanov on their register of extremists and terrorists, which bars them from much of public life as well as holding bank accounts.&nbsp;","Warning of an exodus of tech workers from Russia, Durov said: \"Such a ban will inevitably stall development of blockchain technology as a whole.\"","Durov continued:","Volkov, meanwhile, suggested that the move to attack crypto was a counterbalance to Russian security forces' incursion into <a href=\"https:\/\/www.theblockcrypto.com\/post\/129312\/bitcoin-mining-pool-hashrates-fall-amid-kazakhstan-internet-shutdown\" data-v-f87c67ca=\"\">Kazakhstan to help the Tokaev administration<\/a> quell civil unrest, as well as make up for lost bribe money that he says police and the regime often receive from the <a href=\"https:\/\/www.theblockcrypto.com\/news+\/111271\/why-is-the-worlds-largest-darknet-market-so-hard-to-kill\" data-v-f87c67ca=\"\">drug trade at the border<\/a>. Technologically, Volkov is skeptical.","\"'Banning cryptocurrency' is the same as banning a transfer from one person to another — which is to say, impossible,\" wrote Volkov, arguing that a blanket ban would just complicate transactions and send them through foreign jurisdictions. \"This is Luddism, a fight against technology and technological progress. Luddism is doomed.\"","He further took the opportunity to plug the <a href=\"https:\/\/www.blockchain.com\/btc\/address\/3QzYvaRFY6bakFBW4YBRrzmwzTnfZcaA6E\" data-v-f87c67ca=\"\">Bitcoin address through which Navalny's<\/a> team has been taking donations since 2016 — over 666 BTC in total receipts as of press time, with a fairly notable increase in incoming transactions in the past month.&nbsp;&nbsp;"],"hashtag":[]}