{"summary":"Oscar-winner Gwyneth Paltrow was reported to have invested in NFT platform Wild. Now that&#x27;s in dispute.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229470\/gwyneth-paltrow-hollywoods-latest-trend-advising-celebrities-to-get-the-heck-out-of-crypto","publishDate":"2023-05-04T19:50:10","id":2906,"type":null,"title":"Oscar-winning actress latest Hollywood star to give NFTs the cold shoulder","category":["METAVERSE & NFT"],"content":["Two months ago, a little-known NFT startup geared toward helping up-and-coming artists introduced itself to the world. Dubbed Wild, it sported a bevy of business luminaries as backers like founders Reid Hoffman of LinkedIn and Kevin Lin of Twitch.","But leading the headlines at the time, both in The Block's reporting and elsewhere, was actress Gwyneth Paltrow. The Oscar winner and founder of the multimillion-dollar Goop wellness brand empire was reported at the time to have invested in Wild. Now that's in dispute.","Nearly two months later, a representative of Paltrow’s said over the weekend that it was “completely false” that she invested in Wild, while a spokesperson for Wild later said in a statement that the “initial reporting is correct.”","Paltrow’s team seemingly distancing her from a crypto-related project after the fact — <a href=\"https:\/\/mirror.xyz\/0xebF6e559f393f10Ab5b41A593de96d02e3c4fda6\/3wPwVqocPiKWkSiToR7WZJ5OWq4MZvdjzko1PsnsB1g\" data-v-f87c67ca=\"\">Wild used her name online<\/a> as far back as March when The Block and others initially reported the actress’s&nbsp; involvement — is just the latest example in an ongoing parade of once-eager celebrities turning their back on the digital assets industry.","“We’ve obviously seen the implosion of crypto,” said Les Borsai, a veteran of the music industry who co-founded Wave Digital Assets. “We’ve seen the SEC go after celebrities. There’s concern. So it’s not the usual greed mechanism kicking in to say ‘I can go do a crypto thing, or a web3 thing, without consequence.’ Their representation is not stupid.”","Last year “Tonight Show” host Jimmy Fallon stopped using a Bored Ape NFT as his avatar on Twitter and the market began to sour. Actor <a href=\"https:\/\/decrypt.co\/124936\/matt-damon-did-crypto-com-ad-due-down-year-clean-water-foundation\" data-v-f87c67ca=\"\">Matt Damon said he took money to do a Crypto.com advertisement<\/a> because he needed money for his nonprofit that helps people access clean water and sanitation. Shaquille O’Neal said he was \"<a href=\"https:\/\/www.theblock.co\/post\/226496\/shaquille-oneal-crypto-ftx-lawsuit\" data-v-f87c67ca=\"\">just a paid spokesperson<\/a>\" for FTX – and is facing a class-action suit – for his decision to promote the now disgraced crypto trading platform.","Although it comes weeks after the news of Paltrow’s now disputed investment was made public, Paltrow’s team was stern in their denial, repeating it three times by email.","“We were alerted to the story on Gwyneth Paltrow backing web3 art platform Wild,” Goop EVP Noora Raj Brown said in her first email denying her boss’s involvement, sent last Saturday. “This story is completely false and Gwyneth is not an investor in the platform.”&nbsp;","The Block corrected its early March story based upon Brown’s email, stripping it of any mention of Paltrow. At the original time of publishing, Wild founder and Chief Executive J. Douglass Kobs told The Block in a written interview that Paltrow had invested in the web3 company alongside Matrix Partners, LinkedIn's Hoffman and Twitch's Lin.","In the March story about Wild, Kobs said that he and Paltrow became friends after meeting at a leadership summit in 2021, adding that she's an \"early adopter\" of web3 and NFTs. The crypto news outlet Decrypt also <a href=\"https:\/\/decrypt.co\/123687\/experiential-nft-art-platform-wild-reveals-latest-artists-in-residence\" data-v-f87c67ca=\"\">reported the news<\/a> of Paltrow's involvement, as did CoinDesk. Evidence of Paltrow’s disputed involvement also exists elsewhere online, including a <a href=\"https:\/\/opensea.io\/collection\/wildxyz-raises-7m-seed-round-led-by-matrix-partner\" data-v-f87c67ca=\"\">link to Wild's original announcement accessible<\/a> from OpenSea, a premiere NFT marketplace.","It is not unheard of for projects to announce a slate of backers only to have some publicly refute any such involvement. Just this week, <a href=\"https:\/\/www.theblock.co\/post\/229036\/temasek-denies-investing-array-crypto\" data-v-f87c67ca=\"\">Singapore’s state-owned investment fund Temasek<\/a> issued a statement denying it had invested in a crypto startup named Array. Last month, no less than four<a href=\"https:\/\/www.theblock.co\/post\/227651\/drw-3ac-investment-vc-venture-capital-opnx\" data-v-f87c67ca=\"\"> supposed backers of the fledgling OPNX exchange<\/a> said they weren’t investors after the startup had claimed they were.","Celebrity advisors have for months been trying to help their clients avoid getting mixed up in an industry still going through serious growing pains and intense regulatory and political scrutiny.","Months ago, ​one top Hollywood agent told The Block his firm was spending a significant amount of time advising clients against promoting crypto-related projects. “You don’t want to go and do something that is going to jeopardize your credibility in the space,” they said <a href=\"https:\/\/www.theblock.co\/post\/180530\/roblox-hollywoods-metaverse-safe-space-as-stars-retreat-from-crypto-winter\" data-v-f87c67ca=\"\">at the time<\/a>.","The current trend of fewer celebrity endorsements of crypto projects is also being driven by companies having less money to spend on marketing, said Anthony Georgiades, co-founder of Pastel Network, an NFT-focused blockchain.","Speaking from personal experience, Georgiades said he had multiple discussions with celebrities enthusiastic about working on a NFT project only to have them later retract “any interest in getting involved” when they felt they were not being properly compensated. Even if he didn’t take the news well, he understands their perspective. “Why even risk it? There’s too much scrutiny, too much uncertainty,” he said.","Borsai, who is passionate about creating a new paradigm with web3 that will redefine the rights celebrities and influencers possess in terms of monetizing the content they create and their reach, said he dreams of a world where the crypto endorsements of the past are not repeated.&nbsp; &nbsp;","“I don’t believe we should live in a culture where we pay Kim Kardashian $2 million dollars to speak about something she doesn’t understand,” said Borsai. “That’s why she got in trouble with the SEC. I would never use anyone like Kim Kardashian.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nKardashian was paid $250,000 to promote EthereumMax on Instagram and then the SEC penalized her, forcing her to pay $1.26 million, the regulatory agency <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2022-183\" data-v-f87c67ca=\"\">said last year.<\/a>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Les Borsai","content":"PERSON"},{"type":"Matrix Partners","content":"ORGANIZATION"},{"type":"Nearly two months later","content":"DATE"},{"type":"weekend","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Gwyneth Paltrow","content":"LOCATION"},{"type":"Hoffman","content":"PERSON"},{"type":"Twitch","content":"ORGANIZATION"},{"type":"Bored Ape NFT","content":"ORGANIZATION"},{"type":"$2 million dollars","content":"MONEY"},{"type":"Paltrow","content":"LOCATION"},{"type":"Brown","content":"PERSON"},{"type":"Jimmy Fallon","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Kevin Lin","content":"PERSON"},{"type":"Reid Hoffman","content":"PERSON"},{"type":"Kim Kardashian","content":"PERSON"},{"type":"Noora Raj Brown","content":"PERSON"},{"type":"$1.26 million","content":"MONEY"},{"type":"Kobs","content":"PERSON"},{"type":"J. Douglass Kobs","content":"PERSON"},{"type":"$250,000","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"Anthony Georgiades","content":"PERSON"},{"type":"Pastel Network","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Temasek","content":"ORGANIZATION"},{"type":"Matt Damon","content":"PERSON"},{"type":"last Saturday","content":"DATE"},{"type":"Borsai","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"last year","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"Georgiades","content":"PERSON"}],"hashtag":[],"authors":["RT Watson","The Block"]}