{"summary":"Authorities in China are said to be investigating blockchain-based fitness app Qubu for alleged illegal fundraising practices\nQubu promised returns of up to 36.8% via its virtual currency “candies”\nThe app claimed to have 95 million registered users","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/50959\/chinese-authorities-investigating-blockchain-based-fitness-app-qubu-for-alleged-illegal-fundraising","publishDate":"2019-12-18T04:20:21","id":2911,"type":null,"title":"Chinese authorities investigating blockchain-based fitness app Qubu","category":["China"],"content":["Local authorities in China's Hunan province are reportedly investigating blockchain-based fitness app Qubu for alleged illegal fundraising practices and financial fraud.","Nikkei Asian Review-affiliate KrASIA <a href=\"https:\/\/asia.nikkei.com\/Business\/China-tech\/Qubu-fitness-app-scandal-throws-light-on-China-s-blockchain-scams\" data-v-f87c67ca=\"\">reported<\/a> the news Wednesday, saying that Qubu rode the trend of blockchain in China and promised its users some \"candies\" - Qubu's virtual currency - in exchange for a task of walking 4,000 steps a day for 45 days.","Qubu's candies were reportedly marketed as an investment instrument with a return of up to 36.8% in over 60 days. The app claimed to have 95 million registered users (nearly one in 10 mobile users in China) and charged new users 1 yuan ($0.14) to sign up as a member, per the report.&nbsp;","Qubu's app also reportedly had a facility where candies could be exchanged for cash and anyone could buy candies from other users using cash. Qubu said it had issued 1 billion candies.&nbsp;One user, who spoke with KrASIA, spent 15,000 yuan ($2,150) in Qubu as an investment as he believed that blockchain-based assets would make him a good return. That turns out to have been a gross miscalculation, he told the news outlet.&nbsp;","Though Qubu claimed to operate on a blockchain platform, industry observers told the news outlet that it had little to do with the technology.&nbsp;","Indeed, one of China's most high-profile news programs, \"Focus Report,\" recently <a href=\"https:\/\/www.theblockcrypto.com\/linked\/47449\/chinese-state-media-over-32000-companies-in-china-claim-to-use-blockchain-but-less-than-10-actually-do\" data-v-f87c67ca=\"\">reported<\/a> that there are 32,000 alleged blockchain companies in China but only less than 10 percent of them actually use the technology.","Further, data by China’s National Internet Emergency Center, revealed that there are over 755 tokens on the market that are not backed by real initiatives or have hit zero after inception. The center also identified 102 coins that allegedly swindled consumers with Ponzi schemes.&nbsp;","Chinese companies seem to be rushing over blockchain ever since the country's president Xi Jinping publicly <a href=\"https:\/\/www.theblockcrypto.com\/post\/44646\/xi-jinping-says-to-let-china-take-the-leading-position-in-blockchain\" data-v-f87c67ca=\"\">said<\/a> that China should commit to accelerating the development and application of blockchain technology.","Focus Report program, however, said that regulations need to be strengthened and \"the public need to keep their eyes wide open for fraudulent activities.”"],"hashtag":[]}