{"summary":"Can JPEGs be securities? FTX certainly thinks so.\nFTX.US president Brett Harrison explains that tokens that offer royalties start to look like securities.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/120016\/why-ftxs-upcoming-marketplace-is-avoiding-nfts-that-offer-royalties","publishDate":"2021-10-11T05:16:05","id":2913,"type":null,"title":"Why FTX’s upcoming marketplace is avoiding NFTs that offer royalties","category":["NFTs"],"content":["As it gears up to launch its Solana-focused NFT marketplace, crypto exchange FTX has announced it will steer clear of projects that offer royalties.","A newly published <a href=\"https:\/\/help.ftx.us\/hc\/en-us\/articles\/4410399400215-Solana-NFT-FAQ\" data-v-f87c67ca=\"\">FAQ<\/a> states, “we will reject any NFT from a collection\/project that distributes or advertises the distribution of royalties to NFT holders.”","Royalties are a relatively new concept when it comes to NFTs. With an overabundance of projects out there, many are looking to add value to their token holders and experimenting with how they can do so. One way is to give back a portion of the fees generated when NFTs are bought and sold on marketplaces to token holders — known as royalties. The idea is that this should incentivize buyers to hold for the long term. But marketplaces are concerned that this could make the JPEGs fall foul of U.S. securities laws.","FTX.US president Brett Harrison said, “We will list NFT projects that pay royalties to the artists\/creators, but we can’t list those projects which distribute the royalties from collection sales to NFT holders. A token which guarantees you a percentage income stream from the sales of a pool of assets starts to look like a security.”","Ethereum-focused NFT marketplace OpenSea has similar concerns. Its <a href=\"https:\/\/opensea.io\/tos\" data-v-f87c67ca=\"\">terms and conditions<\/a> identify a range of types of NFTs that might be unsuitable for its platform, including those that can be redeemable for financial instruments and ones that “entitle owners to financial rewards.”&nbsp;","Last week, these concerns led OpenSea to stop the buying and selling of the Turtle DAO NFT collection — which awards tokens to NFT holders — although it didn’t state which specific term the project violated."],"hashtag":[]}