{"summary":"Thailand has come up with new crypto taxation policies, waiving tax payments for companies that offer investment tokens.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/217673\/thailand-waives-crypto-tax-for-investment-tokens-reuters","publishDate":"2023-03-07T06:30:58","id":2914,"type":null,"title":"Thailand waives crypto tax for investment tokens: Reuters","category":["POLICY"],"content":["Thailand’s cabinet has approved tax waivers for crypto companies that offer investment tokens in the country, according to a statement by Finance Minister Arkhom Termpittayapaisith on Tuesday.","This tax <a href=\"https:\/\/www.reuters.com\/technology\/thailand-offers-tax-breaks-companies-issuing-investment-tokens-2023-03-07\/\" data-v-f87c67ca=\"\">waiver<\/a> will be applicable for both primary and secondary offerings on these investment tokens. Arkhom stated that such companies will have to register their token offerings to benefit from the tax waiver. <a href=\"https:\/\/www.theblock.co\/linked\/138910\/thailand-bans-use-of-crypto-for-payments-but-not-trading-and-investing\" data-v-f87c67ca=\"\">Investment tokens are legal in Thailand<\/a> despite the government banning the use of cryptocurrencies for payments in March 2022.","Thailand’s new crypto tax policy also extends to investors. Those who invest in these token sales will also be exempted from paying value-added tax. This is the crypto-related value-added tax exemption. Last year, Thailand’s government <a href=\"https:\/\/www.theblock.co\/post\/148950\/thailand-excludes-crypto-transfers-from-vat-payments-until-2024\" data-v-f87c67ca=\"\">waived VAT for crypto transfers<\/a> until 2024.","Arkhom stated that that tax waiver could see the government forgo revenue of up to 35 billion baht ($1 billion) in the next two years. This is based on an estimated 128 billion baht revenue ($3.7 billion) from investment token offerings during the period.","Utility tokens are, however, not covered in this crypto tax exemption policy. This position is due to the fact that their use depends on the promotional activity of their issuers, the finance minister stated.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Thailand","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"$3.7 billion","content":"MONEY"},{"type":"128 billion baht","content":"MONEY"},{"type":"Finance Minister Arkhom Termpittayapaisith","content":"ORGANIZATION"},{"type":"35 billion baht","content":"MONEY"},{"type":"March 2022","content":"DATE"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}