{"summary":"StakeHound lodged a lawsuit in Tel Aviv District Court against crypto startup Fireblocks this week.\nThe complaint alleges that negligence on the part of Fireblocks contributed to the loss of private keys for more than $75 million worth of ETH.\nFireblocks contends it was never in charge of the keys, given the nature of its services.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/109277\/staking-company-serves-fireblocks-with-a-lawsuit-over-private-keys-to-over-75-million-in-eth","publishDate":"2021-06-23T10:55:22","id":2915,"type":null,"title":"Staking company serves Fireblocks with a lawsuit over private keys to over $75 million in ETH","category":["Legal"],"content":["StakeHound, a firm that enables staking, is suing custody service Fireblocks for allegedly contributing to the loss of private keys that accessed about $75 million worth of crypto.&nbsp;","StakeHound filed the lawsuit against the Israeli-based <a href=\"https:\/\/www.theblockcrypto.com\/linked\/98734\/fireblocks-series-c-coatue-ribbit-bny-mellon\" data-v-f87c67ca=\"\">Fireblocks<\/a> in the Tel Aviv District Court. The firm claims Fireblocks' negligence led to the loss of the keys. According to the court documents reported by <a href=\"https:\/\/www.calcalistech.com\/ctech\/articles\/0,7340,L-3910671,00.html\" data-v-f87c67ca=\"\">Calcalist<\/a>, a Fireblocks employee failed to backup the keys, which were subsequently \"deleted,\" leaving StakeHound unable to access 38,178 ETH, or more than $76 million. Those court documents also claim that the employee was working in \"an unsuitable work environment,\" according to Calcalist.","StakeHound contracted Coincover's service as well in holding the keys, but in order for the keys to be verified, Fireblocks had to also retain a copy. In a <a href=\"https:\/\/stakehound.com\/blog-post\/fireblocks-eth-2-key-management-incident\/\" data-v-f87c67ca=\"\">blog post<\/a>, Stakehound wrote:","But Fireblocks contends that it was never in charge of the keys.&nbsp;","In a blog <a href=\"https:\/\/www.fireblocks.com\/blog\/stakehound-eth-2-0-event\/\" data-v-f87c67ca=\"\">post<\/a> published Tuesday, Fireblocks said its research team filled a request to create a set of \"BLS key shares\" related to StakeHound's ETH 2.0 <a href=\"https:\/\/www.theblockcrypto.com\/linked\/91264\/fireblocks-launches-staking-services-eth2-polkadot-tezos\" data-v-f87c67ca=\"\">staking<\/a> project, which were managed outside the Fireblocks platform and not part of its usual wallet procedures.","This project wasn't a usual service, it was a one-off request in which Fireblocks lent StakeHound resources to help build its open-source library.&nbsp;","Fireblocks said those using its wallet structure aren't at risk for losing their keys because of the firm's multiple backup procedures — procedures that weren't included in the services StakeHound contracted, according to Fireblocks.","According to Fireblocks, StakeHound generated its own keys and stored them outside the Fireblocks platform. Fireblocks agreed to temporarily store the BLS keyshares, but because it doesn't support BLS with its platform, Fireblocks said the same backup procedures that are normally found on Fireblocks didn't apply. The keys remained in temporary storage, and a few months later temporary storage failed.","In the lead-up to the failure of the temporary storage, Fireblocks alleges that StakeHound also failed to store backups with a third-party service provider despite urging the firm to do so multiple times. It also communicated that StakeHound was required to perform a backup within 14 days of the key generation. StakeHound has not said whether it followed these directions.","Fireblocks is still trying to recover the lost ETH, according to its blog post.&nbsp;"],"hashtag":[]}