{"summary":"Nelson Minier, Head of OTC Sales &amp; Trading at Kraken, joins The Scoop to discuss his time in trading that&#x27;s spanned firms such as JP Morgan, Credit Suisse, Bear Stearns and his time with expirence with Kraken, one of the oldest crypto currency exchanges in the market.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/36493\/nelson-minier-kraken","publishDate":"2019-08-20T16:00:38","id":2916,"type":null,"title":"Nelson Minier, Kraken&#x27;s Head of OTC Sales &amp; Trading stops by The Scoop","category":["PODCASTS"],"content":["<em data-v-f87c67ca=\"\">The following transcript is taken from episode seventeen of The Scoop, The Block’s first podcast. Listen below and subscribe to The Scoop on <a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/a-conversation-with-mike-bodson-ceo-of-dtcc\/id1460134454?i=1000436159223\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Apple<\/a>,&nbsp;<a href=\"https:\/\/open.spotify.com\/episode\/5vfblGUoYHykwZjYJJ9eQv\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Spotify<\/a>,&nbsp;<a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Google Play<\/a>,&nbsp;<a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Stitcher<\/a>, or wherever you listen to podcasts. Email feedback to&nbsp;<a href=\"\/cdn-cgi\/l\/email-protection#97e7f8f3f4f6e4e3d7e3fff2f5fbf8f4fcf4e5eee7e3f8b9f4f8fa\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"bcccd3d8dfddcfc8fcc8d4d9ded0d3dfd7dfcec5ccc8d392dfd3d1\">[email&nbsp;protected]<\/span><\/a>. This transcript has been edited for clarity and length.<\/em>","<em data-v-f87c67ca=\"\"><a href=\"https:\/\/www.theblockcrypto.com\/tiny\/kraken-expands-leadership-team-with-5-new-hires\/\" data-v-f87c67ca=\"\">Nelson Minier<\/a> has a long and storied history before joining cryptocurrency exchange Kraken's OTC desk. The 20 year veteran of Wall Street joined The Scoop to talk about his time in trading that's spanned firms such as JP Morgan, Credit Suisse and Bear Stearns (one of the most notable casualties of the financial crisis). Based in San Francisco, Kraken is one of the oldest crypto currency exchanges in the market, it's also one of the best known but the company has been expanding recently into new lines of businesses including futures and over the counter trading. Kraken's OTC business was built up by Minier and it counts a number of high net worth individuals and asset managers among it's clients. On this episode of The Scoop, Minier, who was once the worlds largest Venezuelan bond trader shared his stories about being a trader during the financial crisis, how he built up Kraken's OTC business and straddling the line between the worlds of traditional and emerging financial services. <\/em>","<iframe src=\"https:\/\/playlist.megaphone.fm?e=BLOCK2109783265\" width=\"100%\" height=\"200\" frameborder=\"0\" scrolling=\"no\" data-v-f87c67ca=\"\"><\/iframe>","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Ladies and gentlemen thank you so much for tuning into The Scoop. We have a really interesting\/special episode, the head of OTC at Kraken, Nelson Minier is joining myself and my wonderful colleague Matteo Leibowitz for conversation about all things trading OTC in crypto. It's funny Nelson, this is the first time we met in person but about a year and a half ago when I was at Business Insider I wrote a story titled: \"A Veteran Wall Streeter Has Left Credit Suisse For A Crypto Trading Desk\" and that story was about you. It's been, so that was April 10th, you had been talking with Kraken for several months before and here we are, July almost August 2019. The team's at 19 people you said, you consider yourselves to be one of the largest operators in the space for sure. Tell us about that journey.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> You know it feels like an eternity ago now that you mention it but it really wasn't that long ago.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> We both maybe picked on a few pounds.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> Yeah exactly. And you know we when I first walked in at OTC there was only a couple of us trading and you know Jesse wanted to do a 24\/7 trading operation. And at the time this seemed pretty daunting you know it's not easy I ran 24 hour desks before being in emerging markets as I was in the past. Most of those things where there's effects or bonds or whatever run 24\/7. But at a traditional bank you have all the infrastructure, they are already set. So you're just kind of plugging in, this was a little different in the sense that an exchange runs 24\/7. But you know it's those are bits and now you need people, people there to pick up the phone, people there to answer messages, people there to do trades on sometimes very liquid products. So it was pretty daunting. But with a lot of hard work, meeting a lot of great people, the space itself is attractive and consequently we were able to attract some pretty good talent. Traders that are much better than I could ever trade.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Walk us through what a crypto exchange OTC desk looks like relative to... You have big players out there like DRW who are sometimes taking principal positions on a trade.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> So do we. We're only allowed to take principal positions, we trade the firm's money. So if you come to us and want to sell a thousand bitcoins we take it down as our risk. It's not like we have the other side of the trade. It's our risk if it falls and drops a thousand points then we shed a lot of tears. But it's our risk. What does a trading desk look like? Typically a global desk, they trade in three zones. You trade you know the U.S. zone you trade the Asian time zone and then you trade the European time zone and we are set up very similar to that. We have traders in San Fran, Vegas, New York and then in Asia we have traders in Tokyo, Taiwan, Singapore, Hong Kong and in European time zone we basically just cover it through London but those guys are on a plane all the time. We have one guy today in Spain, another one in Dubai trying to make connections and relationships.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> And the point is you'll have a large trader, either a whale of sorts, a wealthy person, an institution who will come to you because they want to break up their trade over a certain amount or over a certain timeframe to avoid the slippage that comes with trading on exchange.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> Exactly. That's well said. Pretty much you have institutions high net worth individuals. OG's in the space we do particularly well with the OG's. And they come to us because they want to trade and they want to do it efficiently. They want white glove service. They know they're doing pretty big size and they want to make sure that they're talking to somebody and feel more comfortable talking to somebody that's going to be moving that much money and sending them a wire or receiving coins like, hey did you get my coins? Yeah I got em' man, they're right here. Or did you send that wire when it was supposed to get there? Can you call the bank? Make sure the wire is going to get here because you know it's a daunting experience sometimes to wait for money to kind of show up. When you don't have necessarily that third party there in the middle particularly when you send in coins.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz<\/span><\/strong> Taking it back just a step. So you started your career at Bear Stearns I think.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> That's right. That's right. I actually started my career at Boeing and went over to finance after seeing how my friends had done working in finance. I'm like wow, they always used to tell me that you should think about trading. Wall Street is seven miles away from where I grew up. It's like a different world and I always was interested in in cars growing up and things of that nature, working with my hands and consequently became a mechanical engineer and went down the engineering path. It is something that I kind of love to do... Yeah a little bit but was it fruitful? I thought I was doing pretty well but then some of my buddies that I went to school with, undergrad with worked on Wall Street doing pretty well telling me that I should think about trading and then all of a sudden they went from studio apartments uptown to lofts downtown I'm like Jesus, man I used to help you with your homework like why is it that you're making 10x what I'm making? I started to make the switch and Bear was a great place, many of us that worked at Bear are still missing it because it was a great place to start your career or end your career because it's very entrepreneurial. It was in there, you rolled up your sleeves, you got in there like I walked in and said listen I'll come in here and work for free I don't care. And they said oh yeah you sure you wanna work for free? Come on down and then all of a sudden six months later they see how you work, they see you're pretty sharp and before you know it you're trading. I was very lucky because I was at the advent of the credit default swap market. It was just starting, the late 90's and that was, it feels to me very much like how this space feels today. The infrastructure is still being built. The infrastructure was being built up and you saw the potential, right? The same thing with the credit default swap. Like wow, then you're trading one or two trades a day and then six months later you're doing literally hundreds of trades a day and with all different new counter parties, everybody is getting involved. Then it just becomes a a frenzy of financial innovation and this pretty much feels like those days now.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Your journey back when you first started at Kraken must have been very similar, right? Only dealing with a few counterparties, only making a few trades a day.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> Yeah but the difference was, the way I approached it was different because I had a lot of help through switching from engineering to finance. Here was like, the last thing you know... The crypto space is changing a little bit now but a few years ago if you were from Wall Street, you're a pariah. Nobody wanted to deal with you. I felt that way when I went to an interview in San Francisco. Jesse was great but I felt that tension amongst others I got here because I'm not a Wall Street jerk and I see and I showed up in a blazer everybody's in there with T-shirts and stuff like that, I looked totally different. Looked out of shape, if you pointed me out there's a hundred people in the office, which is the Wall Street guy? That jerk right there. You would've guessed it 100% of the time that it was me. But it develops, we talked, we learned, they learned how much I love crypto and how I felt about it. Then things started to change and it was more me trying to get in this business from a different aspect. To answer your question me trying to jump in and get involved in a space that may not want me to get involved. But I think Jesse saw opportunity in the sense that hey these guys working on Wall Street for what they'd been doing, it worked for 100 years. There are some similarities to what we do, everything we do we don't like but everything they do they don't like but there are certain things that they do when it comes to sales and trading, there's a reason why you use certain languages. There's a reason why you settle trades the way you do. There's a reason why you send confirmations and haven't accepted them the way they are. So I think I brought a lot of that stuff with me. A lot of systematic processes that I think bode well for what we were doing here because of that experience I brought with me and I think it fit very well.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz<\/span><\/strong> So I have two questions. First one is I would love to hear more about what exactly it was that attracted you to the cryptocurrency world. And then secondly, there's a range of OTC desks within this industry, what is it exactly that drew you to Kraken? Two great questions.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> First thing was volatility and price action. I'm not going to be one of these guys that said I looked at the white paper, I have the white paper in my house, like I stare at it all the time and I can read it a hundred times -- I'm not gonna get this revelation from it. Maybe I'm not smart enough. I saw the price action like, what the hell is this bitcoin thing like why is it going up 10% at a time? And me being a merging markets trader I love volatility.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Is that what you were doing at Credit Suisse at the time?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> Yes. I was running the emerging market bond trading.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Maybe it was a little too boring.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> No I mean I traded in Venezuela so it was never boring.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> That must have prepared you perfectly.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> Yeah well never boring trading from Venezuela but we love volatility, as a trader that's what you kind of look for. And years before I had one kid come on the desk that... We're getting a lot of pressure to hire kids from colleges at the time because we had just come off the financial crisis and the hiring on Wall Street kind of stopped and in all that schools were saying hey guys just because things are down now you've got to keep hiring these kids don't come to us later and want us to send you kids when things got a little shaky you guys gave up on us like we got to hire these kids, these these kids they're great kids they got to go somewhere. So consequently got this big influx of kids coming in spending the summer with us. And I was having trouble keeping them busy. I mean most these kids got 50 IQ points more than I do how do I keep them busy. And one of them says Hey Nelson do you mind if I look at bitcoin and I say yeah go ahead man. I was grasping at straws with it. After looking at it and he spent a lot of time on it and going through it he came to the same conclusion that I thought that I did which I was pretty proud about because the kid... I don't know what he's doing now, is probably building rockets but I said to him I don't think government's going to let this exist. He came to the same conclusion and he said you know what, it was built with an intention but I still think they can stop it and we came to the same conclusion. Of course, I don't know it was trading at 30 bucks 40 bucks then and I lost track of it and then it came up again into like to late 2015 and that's when I started looking at again. So the volatility, the price action, the ability to make money from that type of volatility and price action was what initially attracted me. It's the fact that you can emancipate your wealth your time your hard work from the state and from banks. But that wasn't it, for me it was the chance to make money. But then I started to learn and I think bitcoin for me has been the great educator. Like I spent over 20 years on Wall Street, Austrian economics I had heard about it but did I know it? Did I really know what the essence of it was? No. Scarcity did I understand scarcity? And what it means? No. Monetary policy, I traded bonds like I know monetary policy, I know that the government prints money but you know for me gold was the hedge, right? And you know hasn't performed very well. So what do you do? Buy property in New York City, do those things. So I understood some aspects of it but Bitcoin takes things to a different level. I went down the real rabbit hole after trying to make money from it, buying some, understanding it, taking a beating, buying it at 800 watching it drop down to 400 and then back up. But to answer your first question it was definitely the price action, the volatility that got me in but it wasn't long after that I started reading more about it and understanding it.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz<\/span><\/strong> Second question.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Well that's a long that's a long gap right. It sounds like you kind of discovered it around 2012-ish.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> Yeah 2013-ish around there and then it took a couple of years for me to get back and then I started seeing it show up on Bloomberg and I'm like whoa here's this bitcoin thing again. And guess what? The governments haven't taken it down. Like let me start looking into it and that's when I started reading some more and really understanding and then I became the freak on the floor talking about bitcoin all the time trying to get everybody involved in it and didn't.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Did Kraken approach you or did you approach them?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> No no no I approached them. I approached them, I started doing some legwork I really...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> And you said let me build this desk out, or...?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> Yeah I met some people that were already on the desk and they saw the enthusiasm that I had, coming off a Wall Street, you see this guy that starts talking about bitcoin and understands it. Talks about it, gets it like knows what a block is you know? So I think that kind of sold it, this is serious and wait a minute he's got a lot of experience doing exactly what we need to do which is run 24 hour trading operations and that's what I did for 20 years. So that kind of matched. And before long you know I was sitting and sitting on the outside I've always been a fan of Kraken and I felt like it's a company that has the ethos of the space behind it and that attracted me to it.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So really it's really interesting I think from a PR or marketing perspective, the exchange that gets or has gotten the most attention for institutional ambitions has been Coinbase. And we've seen Coinbase shut down their Chicago operation that was building up the low latency high frequency trading matching engine. They have seen a flurry of exits on the institutional side now especially when we think about sales and trading Christine Sandler, Tim Plakas and a few others and I doubt their OTC operation is larger than a handful of people. Kraken on the other hand hasn't gotten that same attention but you have 18 folks in London and you said before we turned the mics on you're doing more trades you think than even some of the more established OTC do. How have you guys been doing that? And what were the steps to get here?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> Yeah obviously the exchange has a lot to do with it. Obviously we have a relationship with the exchange. We have the same name on the roof and we leverage off the exchange a lot. But I think just as important has been the fact that Kraken has been around for the longest and a lot of the oh jeez in the space, a lot of the influencers in the space use us and they've been around for a long time, have coins they want to take profits, buy more, whatever and through word of mouth that kind of helps helped us a lot. And we've taken a step further, I think we're the first guys to actually have salespeople so we have some salespeople going out there beating the drum and getting it in. Also we kind of tapped into the account management aspect of Kraken where they have account managers that take care of some of the bigger clients that say hey listen you know if you need help like this, this fits perfectly for OTC why don't you talk to those guys. We're proud of our desk. They do a good job. You go to them they'll take care of you. So that's been a big influx of business for us.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> What do you think volumes are on a given day?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> We don't disclose the volumes exactly but put it like this, at the beginning of 2018 We've 20x'd the number of trades we do on a monthly basis from that point.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz<\/span><\/strong> Do you think it's more volume than Spot?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> No. No there was rumors back in the day that you saw more routing on OTC desk than Spot, occasionally that happens but it's very rare. It used to happen in the past because you would have guys with you know a hundred thousand Ether trying to move them and...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz<\/span><\/strong> So just for context in 2018 Kraken did $85 billion dollars worth of volume?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> Yep. So that was on the exchange. This is substantially less than that. Yes.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz<\/span><\/strong> As far as products that you guys are actually trading, do you mainly see demand for bitcoin and Ether or do you see some...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> Yeah those are the two big ones. Those are the two big ones but what's great about being able to see that... So if you want to trade some GRIN like GRIN is not an easy thing to trade. It's not like you going to send that to an address. It's gonna be a lot of handholding going through there. So consequently we're experts of that and we will have clients come in and want to trade with us because of that, we can hold their hands to the process and make sure that they get the GRIN that they want or sell the GRIN that they want. So there's certain parts of that but no doubt bitcoin and ether are the big the whales out of our desk.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz<\/span><\/strong> What would you say that the top five assets are?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> The typical top five that you see on coin market cap. It's gonna be you know bitcoin Ether, bitcoin cash, Monero, Tether trades a lot. So that's probably the top five.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz<\/span><\/strong> Interesting. And you mentioned when you're starting off at Bear Stearns that was just around the time that you were seeing CDS's emerge as tradable products. What kind of interest do you have as far as trading new types of crypto specific derivatives?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> II think that's where the future of our market is. I mean the trend showing if the trend continues the way it is now you see how Bitcoin dominance is increasing so it looks like we're going to have 6-10 assets that stick around. What do we do with those assets? Should we be doing more vol trades which are options. Also I think that there's a big opportunity for us to tokenize assets like why aren't we trading bitcoin? Which many people believe is a better version of gold. Including myself. Why are we not trading it versus gold? Why are we not trading it versus Silver? And why didn't you do it in a tokenized method? There are a lot of precious metals out there that people don't have access to. Why don't we tokenize them so we give people access to access to them? And then you can trade versus other assets within our space. I think that's where the development and I think the growth of our business is going.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> What kind of trends are you seeing just generally across the OTC landscape? Some of these folks are probably your counter parties. A lot of them are moving electronic. A lot of them are firing or maybe not firing but at least restructuring assets. The relationship guys are either no longer necessary or serve a purpose. Do you see Kraken electronifying? Maybe a little bit less of the over the phone type of stuff.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> Well that's what Wall Street has been going through for a while now right. Wall Street is shrinking. Why is it shrinking? Because of technology and I think that it would be prudent for us to try to grab that and use technology. I mean we are a technology company. So use that technology to better the services we provide to clients. We're embracing it and we'll see more electronic, like we might have electronic fees right to clients that they want to do OTC and things of that nature. Where I see it, I see us continuing to leverage off our technology to provide better services to clients. You have to embrace that or you're going to lose the battle.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz<\/span><\/strong> What kind of fee compression are you seeing in the OTC space as well?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> Oh it's collapsed fees have collapsed. I mean that's why our volumes are keeping us alive pretty much but fears of collapse in the sense that clients demand much tighter bit offer now versus even when I first started and that was just a year and a half ago. But we adapt, now volumes have increased, so volumes have picked up and even moreso than the actual fee compression because the space is growing and more people are getting involved and more people are trading it.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> That's a lot of what's behind why some of these desks are struggling. Is there any benefit to a large client trading or trying to make a trade via an OTC desk that's connected to an exchange versus something like a DRW or someone else? What's the value prop?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> The value properties, you're going to get efficient more efficient pricing. Why would there be more efficient pricing? Sometimes we have the opposite side of an axe ready to go. We'll call you when you ask us to but when you say, hey listen if it gets to ten grand give me some. I want to sell some. We hold your hand through the process, make sure you get your coins. Things are a little quicker a lot more professional than just doing it through an app.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> What's the benefit of going through... Maybe it's kind of the same but I'm just wondering -- having the exchange connected to it?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> Exchange connect is not going to change the way you operate as an OTC desk. We just happen to be part of Kraken but that's not going to change how you operate. Most OTC desk are set up, they are connected to all the exchanges in the world and that's why they can price so well.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> You guys are just connected...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> No, we're connected everywhere.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> And so you'll execute a client's trade across multiple different venues?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> 100%.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz<\/span><\/strong> And will you will you try and purposely direct as much volume as possible to Kraken?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> Yeah I mean obviously there's a home team right. We're gonna do as much as we can to do that if we're going to leave orders we're gonna leave them on Kraken. So if I get lifted on a thousand coins and I need to buy them maybe I'll buy 500 back and then the other 500 I leave on the order book and hopefully I get in on them. I mean obviously all those trades are gonna go to Kraken.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Are your counterparties expecting any sort of best execution? Like when you think about...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> Yeah I mean our counterparties are tough. They know what they expect they see the price of bitcoin is everywhere so they expect good pricing on it. A lot of them are reasonable. They appreciate the services you provide them. They know that you're gonna take care of them. And that's where you kind of make your money and also we take risk. I mean we take risk on every trade. We price according to where we think the market's going. If we feel good about the market and you're coming in to hit us we probably give you a very good bit because we think the market's going higher.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz<\/span><\/strong> Where is the market going?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> Bitcoin makes liars of all of us at some point especially the price. And you know I think the best case scenario for me is I don't see demand for this asset going down but I do know that supply is going to cut in half sometime late May 2020. Another thing that I know about bitcoin is the higher prices is the best marketing tool we have. So I feel like we ended the bear market. Thirty one hundred thirty two hundred. It was amazing how we went through six thousand because we were you know between six thousand sixty four hundred we were literally there for months and many of us thought we were gonna take a breather there. We blew right through that which for me confirmed that thirty two hundred was where the [...] says the howlers of last resorts were. Where like guys like me are like to hell with it man I'm going down with the ship. It goes lower than this there's no way I'm selling the coin and I think that a lot of us felt that way a lot of howlers felt that way and that was kind of the bottom and breaking through six thousand the way we did just confirmed there was a bull market and there's more money coming into this asset class.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> I'm sorry to interrupt but as a result quickly has that changed what your counterparties look like?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> Yeah they've been changing. They've been changing not as fast as I thought. We hired someone to cover institutional sales for us and they had a hard time. This guy was connected like a freight train and he couldn't get people to come in and buy. And one of the things I now notice slowly but surely coming around. As you start to see strong hedge funds mainly hedge funds because those guys have different mandates.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Like $10 to $20 billion, $5 billion?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> Some bigger.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So there's a plus 20 billion dollar hedge fund who's talking to your salespeople?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> I don't want to get into it because if you were to narrow it down there's not many $20 billion hedgefunds out there.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> The point you're making is that there are now let's just say plus $1 billion to save...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> There are some when we first started when I hired this individual to go knock on doors he isn't you know he left with his knuckles bleeding, wasn't getting any trades and now its changing. Now that's changing and now it's changing slowly. It's slower than I would want to believe. I mean here's an asset, ridiculous historic returns uncorrelated to anything else. Liquid and you know the most scarce thing besides the time. You know is the holy grail portfolio of management. These guys should be killing themselves to put this in their portfolios nut the problem is that they have constituents that they have to pander to which is the investors and people still think that this is a joke and it's going to zero. So if your portfolio managers spent 20 years studying for your CFA getting your MBA doing all this stuff to get to the job. Well you're finally a portfolio manager. You got the sweet gig. The last thing you're going to do is put this fake internet money thing that might go to zero and lose your job. Because that's what'll happen if this thing goes to zero and you have it on there you become the laughing stock and you ruin the reputation of this white shoe money manager that's been around forever and invest in this crazy internet money you create. You know people are not going to jeopardize that unless they have a lot of conviction.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Does the fact that I think Kraken has a great amount of respect from and to your point earlier the OG cryptocurrency community -- the sort of more rogue personalities if you will. Not necessarily the best relationships with people like the you know New York Department of Financial Services. Is that something that's a concern or makes things... While it helps with those OG relationships as you said, does it maybe make it more difficult for for either you or the folks on the sell side to engage with?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> Yeah I mean there's a lot of firms here in New York but most of them are domiciled. There are companies that domicile outside of things so we can trade with them. But does it make things difficult? I mean you know we have to embrace regulation and you know and a very progressive state like Wyoming.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> I think we're going to end up the being the the home of many crypto industries because of that. And places like New York are going to suffer from it. And I think we're starting to see that already.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So you can't engage directly with non...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> If you're New Yorker, I can't trade with you.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Bad news for you Teo.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz<\/span><\/strong> You mentioned the the bitcoin halvening. It's kind of bullish.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> Yeah a lot of other things that are bullish but that's the most bullish of them all right.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz<\/span><\/strong> And not that I necessarily agree but what does that mean?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> You don't think it's bullish? Supplies getting cut in half. You don't think that's bullish?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz<\/span><\/strong> I don't think it's particularly positive for network security to have minor revenue cut in half but that's besides the point. So my question was you know what does that mean for OTC activity?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> You know recently there was I think we crossed a billion dollars in fees over the lifetime of the thing. Right. And when we we get a lot more transactions so be a lot more fees.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz<\/span><\/strong> Not if everyone's holding.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> We're going to be using it more right. If everybody's got it. The more people that have it the more people are going to be using it. If you don't have it you can't use it.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz<\/span><\/strong> That's very true.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> That's a different discussion.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz<\/span><\/strong> But what do you think the implications are for OTC activity with supplies I mean halvening.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> Our flows have a very high correlation to the amount of trades that are being done in general both Bitcoin and exchanges you go look at it. High volume on exchanges means high volume in OTC. Sometimes we might have different volumes because we might have a new coin that comes up. We might have some activity with different coin and then you'll see spikes in our volume versus maybe the exchange won't have as much. Those anomalies. But there's a very high correlation obviously between the the exchange volume and our volume. So having a bet you think's going to bring more volume is going to bring more attention. It's going to bring more interest. There might be some profit taking whatever I think is going to bring a lot of volume I mean it is going to be interesting time to to value Bitcoin around that period of time.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> How are you preparing for that and is the team you've talked about this 20x growth. Are you looking to add more more folks to the team or expand into new services?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> Another great question. The team we have we're pretty happy with. I think we have enough. I think we do a good job of covering 24\/7. I mean you still get your issues like you know I had to step in on Father's Day to work you know because the guys had kids so I'd jump in and help out you know and Fourth of July was an issue for us. Right. We're not overly staffed I want to say but we're staffed right and what we're focusing on is more efficiency and getting ourselves out there in a more public way. That's why I'm sitting here with you guys and a lot of my traders out there visiting clients and going to conferences rubbing elbows and getting our name out there. Something that we've kind of been hesitant to do for a while and now we're kind of embracing it much more.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz<\/span><\/strong> This next question isn't exactly related to the OTC guys but I think you might have some very interesting insight. So we're starting to see derivative volume outpace spot volume. I'm thinking particularly about bit mags and perpetual swaps. Also CME futures. Kraken is used as as one of the reference rates for big banks and in the past couple of weeks especially we've seen some interesting activity on these reference exchanges. I'm thinking Bitstamp and also Kraken as well. So how does being part of that reference rate change the dynamic and Kraken? Is that something you guys are hyper aware of or?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> Zero. I don't think of that reference rate at all where you know our volumes are real. Our trades are real. You know we we don't even think about it you know as the market is where the market is when I want to know where the market is. I look at the Kraken spot rate I believe it. There's a lot of shorts are, on BitMax I have you know I might look at a chart just to see where people position but I'm not looking at price levels or anything like that to try to push them over on there and we don't, we don't do that.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz<\/span><\/strong> I mean from what kind of indicators do you use?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> We use a lot of the ones we've talked about already which is like you know long shorts on some of these. Also we like to use volume a lot like I think you know green. Large green candles mean a lot to us. And I think volume says the most about our market right now. When people care at a certain level like you know why what did I mention six thousand before. Six thousand a lot of bitcoin traded. And you know when, when we were growing up I said thirteen thousand two hundred was kind of a cap for us. You know only gods and liar's pick tops and bottoms. So that's why they treated the 13-6 13-8. But I was proud about my 13-2 because it immediately collapsed after that and there was a lot of volume there. So right now I think volume is the big thing because it shows where people been you know where coins changed hands and where people care if you were bought at thirteen thousand two hundred and you saw collapse to three thousand and you're praying for it to get back to thirteen to two hundred yes they out of this mess that you got yourself into. You know you do that. And that's why they're big levels. So for me volumes are the most interesting thing right now when looking at points of access, points of ownership like when you bought your coins like you know unless you've been in this space for a long time and you'd kind of you know work in the industry and you get paid in Bitcoin and stuff like that you pretty much know where you bought your bitcoin. And so psychologically I think there's a lot to do with those levels and also their psychological levels like 10,000 today. We just broke 10000 again.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> I'd like to hear a little bit more as we as we wrap up about your Wall Street experience. Yours is a is a long time when you harken back and think about your career and being in the position you are now. What are some of the you know Wall Street isn't short of it's interesting stories, just so you can pick up a Michael Lewis book. What are some of the stories you think about from your career that kind of still inform what you do today?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> There are a lot of stories a lot of stories and I really you know although then my career wasn't as fun at the beginning a career. Wall Street is not the Wall Street it was 20 years ago in no shape or form. And I really at the end of my Wall Street career at the end I was like one I was so anxious to get out and do something new like Bitcoin. The other was I was like I've had enough of this. Like it's time to move on it has been very and was very good to me I made friends that last lifetimes I have experiences that last lifetimes.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So in the beginning what was you know.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> Yeah but to answer your question obviously you had things like September 11 it wasn't a fun time to be on Wall Street like you know I have stories about that day it was horrible so those those are imprinted on me. But it's the people themselves that that I find I found most fascinating. I mentioned something earlier about you know a quote like only gods and liars pick tops and bottoms and you know that was something that, I was maybe on the desk three weeks before somebody told me that Iike kid if you're going to spend your day or your day trying to pick the top and the bottom of every trade now you're gonna be in for a hard hard hard career on Wall Street because it isn't going to happen. And that was a quote. So he was a character he was a guy that was on and he was in the pit and he worked his way up and he was on 40 years and some of the lessons that I learned from him and the things that he said you know still resonate today. And so as much as the stories that you can talk about I have much more memories about the people and the things that they said and the situations that they were in that that I recollect a lot. And it was a fun interesting time especially in the late 90s when you you know you had the Asia crisis the you know the peso crisis you had you had a lot of a lot of things long term capital blowing up. It was a lot it was an interesting time to be on Wall Street. I remember the people more than anything else.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz<\/span><\/strong> Outside of cryptocurrency which other markets do you keep an eye on?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> I follow Venezuela a lot. I traded for good a decade I was the #1 Venezuela trader in the world. So I tried a lot of Venezuelan bonds and I used to go down at least twice a year down there and I'm Latin, know the culture. So I used to spend a lot of time in Venezuela. And it's sad to see what was once the richest country in Latin America become the poorest. And you know there's a lot of correlation's there between Bitcoin and Bolívar as being thrown in the street as wastepaper and what the government has done there to inflate the currency and devalue the currency there and how a rich country with the largest oil reserves in the world is become the poorest in Latin America. And their GDP is dropped by you know dropped 60% in a decade. And it's sad and sad to see what's going on there. So I follow Venezuela. I follow BRL a lot. The rial and the local or local equities there. I also I like weed stocks. I think some of them are going you know I'm pretty optimistic. Yeah I think some of them are going to move not all of them. There's some scams out there just like there are in our space but there's some some weed stocks that I follow pretty pretty actively that I got a. What are we.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> I got wrecked on a weed stock. I'm down like 50 percent. Hey this is not investment.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> Those are things that I follow quite actively and I've obviously I follow interest rates just because I was a bond trader for that long. You have no choice but to follow.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> That's interesting. Well Nelson thank you so much.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> Yeah it was great being here.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> We appreciate you coming on the show and you'll have to come back again.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Nelson Minier<\/span><\/strong> I would love to it was a fun conversation. Hopefully I represented and I'd love to be back","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York City","content":"LOCATION"},{"type":"$10","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"Nelson Minier<\/span><\/strong> Bitcoin","content":"PERSON"},{"type":"Taiwan","content":"LOCATION"},{"type":"Matteo Leibowitz","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"Monero","content":"PERSON"},{"type":"Fourth of July","content":"DATE"},{"type":"Spotify","content":"LOCATION"},{"type":"Nelson Minier<\/span><\/strong> Yep","content":"ORGANIZATION"},{"type":"Nelson Minier<\/span><\/strong> Exactly","content":"ORGANIZATION"},{"type":"Nelson Minier<\/span><\/strong> Exchange","content":"ORGANIZATION"},{"type":"Chicago","content":"LOCATION"},{"type":"Michael Lewis","content":"PERSON"},{"type":"50 percent","content":"PERCENT"},{"type":"Chaparro","content":"PERSON"},{"type":"Nelson Minier","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"Leibowitz","content":"PERSON"},{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Latin America","content":"LOCATION"},{"type":"Kraken","content":"PERSON"},{"type":"Father's Day","content":"DATE"},{"type":"Nelson Minier<\/span><\/strong> First","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"10","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Veteran Wall Streeter Has Left Credit Suisse For A Crypto Trading Desk\"","content":"ORGANIZATION"},{"type":"San Fran","content":"LOCATION"},{"type":"Matteo Leibowitz<\/span><\/strong> Interesting","content":"ORGANIZATION"},{"type":"Boeing","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"Matteo Leibowitz<\/span><\/strong> Second","content":"ORGANIZATION"},{"type":"Nelson","content":"PERSON"},{"type":"San Francisco","content":"LOCATION"},{"type":"Christine Sandler","content":"PERSON"},{"type":"a billion dollars","content":"MONEY"},{"type":"2015","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2012","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"Nelson Minier<\/span><\/strong> Zero","content":"ORGANIZATION"},{"type":"2013","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"$5 billion","content":"MONEY"},{"type":"OG's","content":"ORGANIZATION"},{"type":"Minier","content":"PERSON"},{"type":"Jesse","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"60%","content":"PERCENT"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Nelson Minier<\/span><\/strong> Those","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"Dubai","content":"LOCATION"},{"type":"$20 billion","content":"MONEY"},{"type":"8","content":"DATE"},{"type":"JP Morgan","content":"ORGANIZATION"},{"type":"Spain","content":"LOCATION"},{"type":"London","content":"LOCATION"},{"type":"2","content":"DATE"},{"type":"July almost August 2019","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"$85 billion dollars","content":"MONEY"},{"type":"Credit Suisse","content":"ORGANIZATION"},{"type":"Nelson Minier<\/span><\/strong> You","content":"ORGANIZATION"},{"type":"Venezuela","content":"LOCATION"},{"type":"Tokyo","content":"LOCATION"},{"type":"May 2020","content":"DATE"},{"type":"Nelson Minier<\/span><\/strong> No","content":"ORGANIZATION"},{"type":"New Yorker","content":"LOCATION"},{"type":"6 13","content":"DATE"},{"type":"Wyoming","content":"LOCATION"},{"type":"April 10th","content":"DATE"},{"type":"Nelson Minier<\/span><\/strong> Another","content":"ORGANIZATION"},{"type":"20 billion dollar","content":"MONEY"},{"type":"Vegas","content":"LOCATION"},{"type":"Nelson Minier","content":"ORGANIZATION"},{"type":"September 11","content":"DATE"},{"type":"OTC","content":"ORGANIZATION"},{"type":"Frank Chaparro<\/span><\/strong> Maybe","content":"PERSON"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Tim Plakas","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Chaparro<\/span><\/strong> Well","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["CRYPTO","KRAKEN"],"authors":["Frank Chaparro","Matteo Leibowitz","The Block"]}