{"summary":"Publicly-traded Marathon Patent Group has bought bitcoin worth about $150 million.\nMarathon CEO Merrick Okamoto told The Block that the purchase was made from the company’s cash reserves. ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/92378\/nasdaq-marathon-patent-group-buys-bitcoin-btc-treasury-reserves","publishDate":"2021-01-25T08:00:19","id":2917,"type":null,"title":"Nasdaq-listed Marathon Patent Group buys $150 million worth of bitcoin as part of the company&#x27;s treasury reserves","category":["Bitcoin"],"content":["Nasdaq-listed Marathon Patent Group announced Monday that it has purchased around 4,813 bitcoin for about $150 million.","The investment is part of the company's treasury funds, Marathon CEO Merrick Okamoto told The Block. This is the first time the company, which is involved in bitcoin mining, has bought bitcoin from the market.","\"By leveraging our cash on hand to invest in bitcoin now, we have transformed our potential to be a pure-play investment into a reality,\" said Okamoto. \"We also believe that holding part of our treasury reserves in bitcoin will be a better long-term strategy than holding U.S. dollars, similar to other forward-thinking companies like <a href=\"https:\/\/www.theblockcrypto.com\/linked\/92111\/microstrategy-buys-additional-bitcoin-10-million-btc\" data-v-f87c67ca=\"\">MicroStrategy<\/a>.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nTo be sure, <a href=\"https:\/\/www.theblockcrypto.com\/post\/89771\/crypto-stocks-soar-amid-bitcoin-rally\" data-v-f87c67ca=\"\">Marathon's stock rallied 892% last year <\/a>and MicroStrategy's stock gained 166%, as compared to bitcoin's gain of about 300% during the year.&nbsp;","Earlier this month, Marathon <a href=\"https:\/\/www.marathonpg.com\/news\/press-releases\/detail\/1222\/marathon-patent-group-announces-closing-of-250-0-million\" data-v-f87c67ca=\"\">raised<\/a> $250 million in an equity round. When asked whether those funds were utilized to buy the bitcoin, Okamoto told The Block that the company had $425 million in cash before this raise, which was utilized to buy the bitcoin.","Crypto financial services firm NYDIG helped execute the transaction. The purchase was completed on January 21, NYDIG told The Block, adding that the purchase amount per bitcoin was around $31,135.","The order was completed \"in only a few hours\" from idea to execution, said NYDIG.&nbsp;","Last month, the firm also assisted insurance giant <a href=\"https:\/\/www.theblockcrypto.com\/linked\/87378\/massmutual-bitcoin-insurance-purchase\" data-v-f87c67ca=\"\">MassMutual<\/a> to buy bitcoin worth $100 million, and MassMutual at the time acquired a $5 million minority equity stake in NYDIG.","As for Marathon Patent Group, the company has been mining bitcoin since late 2017.&nbsp; Today, it has 2,560 bitcoin miners in production, currently producing around 1.5 to 2 bitcoin per day, Okamoto told The Block.","To expand its operations, Marathon <a href=\"https:\/\/www.marathonpg.com\/news\/press-releases\/detail\/1218\/marathon-patent-group-purchases-70000-s-19-asic-miners\" data-v-f87c67ca=\"\">recently ordered<\/a> 100,500 units of advanced S19 miners from Bitmain for about $270 million. \"These units will be shipped beginning this week,\" Okamoto told The Block. \"When fully deployed and installed, the company's total hashrate capability will exceed 10.34 exahash [from the current about 256 petahash], which we believe could make Marathon the largest bitcoin miner in the world.\"","In terms of bitcoins, the upgraded hashrate would help Marathon produce around 55-60 bitcoin per day, said Okamoto.","Marathon <a href=\"https:\/\/content.equisolve.net\/_db97122d0fd5db8b96a33cfab78d3537\/marathonpg\/db\/184\/3127\/pdf\/MARA+IR+Presentation+-+January+2021.pdf\" data-v-f87c67ca=\"\">believes<\/a> that it is \"uniquely positioned for long-term success\" since it recently <a href=\"https:\/\/www.marathonpg.com\/news\/press-releases\/detail\/1211\/marathon-patent-group-announces-joint-venture-with-beowulf\" data-v-f87c67ca=\"\">formed a joint venture<\/a> with Beowulf Energy to get cheap electricity for its bitcoin mining facilities.","\"Most bitcoin miners use a hosting model for their operations. [...] The typical cost for this hosting arrangement is in the $0.05 to $0.06 Per kWh range,\" Okamoto told The Block. The partnership with Beowulf, on the other hand, will help Marathon lower the cost to $0.028 per kWh, said Okamoto, adding that it will also lower the cost to mine each bitcoin from over $7,700 to approximately $4,400.","The price of one bitcoin is currently trading at around $33,500, according to <a href=\"https:\/\/www.theblockcrypto.com\/data\/crypto-markets\/prices\" data-v-f87c67ca=\"\">The Block's data dashboard<\/a>. When asked if Marathon will further invest in bitcoin, Okamoto said, \"to be determined.\"","<iframe title=\"BTC Price\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/btc-price\/embed\" width=\"100%\" height=\"420\" frameborder=\"0\" data-v-f87c67ca=\"\"><\/iframe>"],"hashtag":["BITCOIN"]}