{"summary":"Deutsche Bank believes bitcoin is highly volatile to be a “reliable” store of value\nBitcoin payments also still represent a “tiny” fraction of global payments, according to the bank","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/54060\/deutsche-bank-says-bitcoin-is-too-volatile-to-be-a-reliable-store-of-value","publishDate":"2020-01-27T08:55:15","id":2918,"type":null,"title":"Deutsche Bank says bitcoin is ‘too volatile’ to be a ‘reliable’ store of value","category":["Bitcoin"],"content":["Bitcoin’s price fluctuations do not make it a “reliable” store of value, according to new research from financial services giant <a href=\"https:\/\/www.theblockcrypto.com\/linked\/30302\/deutsche-bank-to-slash-18000-jobs-as-part-of-restructuring-plan\" data-v-f87c67ca=\"\">Deutsche Bank<\/a>.","In the first part of its 3-series “The Future of Payments” reports, published last week, Germany-headquartered Deutsche Bank <a href=\"https:\/\/www.dbresearch.com\/PROD\/RPS_EN-PROD\/PROD0000000000504353\/The_Future_of_Payments_-_Part_I__Cash%3A_the_Dinosau.PDF\" data-v-f87c67ca=\"\">said<\/a> while cryptocurrencies have “passed the tipping point needed to become fashionable,” they are still in the “early adoption stage.”","Particularly for bitcoin, the world’s largest cryptocurrency, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/90900\/crosstower-citadel-deutsche-vet-hire\" data-v-f87c67ca=\"\">the bank<\/a> said it is “too volatile” to be a “reliable” store of value. It referenced bitcoin’s sharp price fluctuations during 2017-2018.","","","Bitcoin payments also still represent a “tiny” fraction of global payments, according to Deutsche Bank, although it said such payments have taken off.","","","<span data-v-f87c67ca=\"\">Source: Deutsche Bank<\/span><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nOverall, the bank believes that cryptocurrencies have the potential to \"revolutionize\" payments. “Looking ahead, it may not be surprising if a new and mainstream cryptocurrency were to unexpectedly emerge,” it added.","In the second part of the series, also published last week, Deutsche Bank <a href=\"https:\/\/www.dbresearch.com\/PROD\/RPS_EN-PROD\/PROD0000000000504508\/The_Future_of_Payments_-_Part_II__Moving_to_Digita.pdf\" data-v-f87c67ca=\"\">said<\/a> cash would be around for “decades to come.” The third part - “<a href=\"https:\/\/www.dbresearch.com\/PROD\/RPS_EN-PROD\/PROD0000000000504589\/The_Future_of_Payments_-_Part_III__Digital_Currenc.PDF\" data-v-f87c67ca=\"\">Digital Currencies: the Ultimate Hard Power Tool<\/a>” - published Monday, states that \"a new digital currency could become mainstream within the next two years.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"Still in their infancy, digital currencies have the potential to radically change payments, banking, central banking, and the balance of economic power,\" said the bank.","Just last month, Deutsche Bank <a href=\"https:\/\/www.theblockcrypto.com\/post\/49621\/deutsche-bank-says-crypto-could-replace-cash-by-2030-as-fiat-system-looks-fragile\" data-v-f87c67ca=\"\">said<\/a> crypto has the potential to replace cash in the next decade, as the current fiat system looks “fragile.” It added at the time that crypto needs to become legal in the eyes of governments and regulators to become widespread."],"hashtag":["CRYPTO"]}