{"summary":"They used to be called Ethereum Killers. Now they are called L1s. Either way, Ethereum is finally getting a run for its money.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/128603\/in-2021-l1-blockchains-took-the-spotlight-thanks-to-defi","publishDate":"2021-12-28T10:20:11","id":2919,"type":null,"title":"In 2021, &#x27;L1&#x27; blockchains took the spotlight — thanks to DeFi","category":["DEFI"],"content":["“Ethereum killers.” That used to be the fashionable term for blockchain networks vying to become legitimate competitors to the most popular smart contract platform.","Talk of potential Ethereum killers dates back several years. But it wasn’t until 2021 that legitimate alternatives to Ethereum finally took the spotlight, and by then they had a new name: L1s","L1 stands for layer-1. Back when the original supposed Ethereum killers— a loosely-defined class headlined by EOS and Cardano — arrived on the scene, “layer-2” blockchain scaling technologies were still mostly speculative, so there wasn’t really any need for the term layer-1. In the subsequent years, the rise of layer-2 inspired new nomenclature for the base layer blockchain.","Then, last year, several upstart L1s finally started living up to the label and gave Ethereum a real run for its money.","The catalyst for change was an explosion in demand for DeFi services. In 2021, Ethereum, the network where DeFi was born, saw total locked value (TVL) in its DeFi protocols rise from $16.1 billion at the beginning of the year to $101.4 billion as of November 30, <a href=\"https:\/\/www.theblockresearch.com\/layer-by-layer-2021-review-part-1-126725\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">according to The Block Research<\/span><\/a>.&nbsp;","But while Ethereum essentially had a monopoly on DeFi at the start of year, by the end of last month its share of Defi TVL had fallen to 63%. One reason is that Ethereum’s transaction fees jumped to record highs during the first half of the year, and DeFi enthusiasts began looking for cheaper alternatives.&nbsp;","Binance Smart Chain (BSC) was the first L1 to benefit. DeFi traders began to flock to the platform in February, and by May it boasted 26% of DeFi TVL. BSC's usage stats fell dramatically amid a broader market slump and a series of expensive exploits before bouncing back in the fall and winter. Today, BSC-based DEX PankcakeSwap is one of the most popular DEXs across all blockchain networks.","Once BSC got traction, other networks followed its example and established native DEXs and lending protocols similar to the popular Ethereum-based ones. And to entice developers and users to move to their chains, some L1 projects <a href=\"https:\/\/www.theblockcrypto.com\/news+\/118150\/ethereum-challengers-are-dangling-token-rewards-to-attract-big-name-defi-projects-and-its-working\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">began paying them<\/span><\/a>.&nbsp;","The Avalanche Foundation set the tone by distributing $180 million worth of AVAX tokens to providers of liquidity for Avalanche-based DeFi protocols. At least eight other projects have since launched similar incentive programs designed to draw developers.","These incentive programs have paid off. The chart below illustrates the growth of TVL across the major L1s since July. The metric is normalized for token price so as to account for USD gains thanks to token price increases and to paint a more accurate picture of the amount of capital that has flowed into each system.&nbsp;","","","<em data-v-f87c67ca=\"\">Read The Block Research's full 2022 Digital Asset Outlook Report <a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2021\/12\/The-Block-Research-2022-Digital-Asset-Outlook.v2.pdf\" data-v-f87c67ca=\"\">here<\/a>.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"EOS","content":"ORGANIZATION"},{"type":"TVL","content":"ORGANIZATION"},{"type":"fall","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"Cardano","content":"PERSON"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"July","content":"DATE"},{"type":"USD","content":"ORGANIZATION"},{"type":"63%","content":"PERCENT"},{"type":"AVAX","content":"ORGANIZATION"},{"type":"Block Research","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"November 30","content":"DATE"},{"type":"26%","content":"PERCENT"},{"type":"1","content":"DATE"},{"type":"$101.4 billion","content":"MONEY"},{"type":"last month","content":"DATE"},{"type":"$180 million","content":"MONEY"},{"type":"$16.1 billion","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["AVALANCHE"],"authors":["Mike Orcutt","The Block"]}