{"summary":"A Securities and Exchange Commission complaint alleges digital asset exchange Bittrex knew it was listing unregistered securities and in other violations of securities laws, but cared little for how that might affect its customers. \nBittrex said last month that it was leaving the U.S. ","author":["Colin Wilhelm","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/226735\/sec-charges-bittrex","publishDate":"2023-04-17T16:29:14","id":292,"type":null,"title":"Bittrex internal communications detail &#x27;problematic statement cleanup&#x27;","category":["Policy"],"content":["<span data-v-f87c67ca=\"\">Despite publicly crying “regulatory uncertainty,” Bittrex’s co-founder and employees knew they were breaking securities laws. That's what the <a href=\"https:\/\/www.theblock.co\/post\/226648\/sec-lawsuit-bittrex-crypto\" data-v-f87c67ca=\"\">Securities and Exchange Commission alleges<\/a> in a complaint made against the company Monday, and they have messages they say prove it.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The complaint cites internal messages detailing the delisting of tokens and removal of marketing statements, \"scrubbing\" in the company's parlance, in an effort to cover up that Bittrex helped sell tokens they knew could qualify as security investments under U.S. law.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The SEC quotes an unnamed employee telling one of Bittrex’s three founders, “I hate people bitching that we don’t email them about market removals.” The SEC says the founder, who also remains unnamed, remarked that his preferred response to those customers was “go f*** yourself” and to tell them to “track your own damn investment or get a broker to do it for you.”&nbsp;<\/span>","<a href=\"https:\/\/www.sec.gov\/litigation\/complaints\/2023\/comp-pr2023-78.pdf\" data-v-f87c67ca=\"\">The Bittrex complaint<\/a> is the latest in a string of regulatory actions that have used internal communications from the companies themselves to help build cases. Most recently, the <a href=\"https:\/\/www.theblock.co\/post\/223015\/cftc-sues-binance\" data-v-f87c67ca=\"\">Commodity Futures Trading Commission's suit against Binance<\/a> was riddled with company emails, Slack messages and even text conversations between Chief Executive Changpeng Zhao and other employees.&nbsp; &nbsp;","<span data-v-f87c67ca=\"\">During the 2017 initial coin offering bubble, Bittrex co-founder Bill Shihara allegedly advised different projects to scrub investment-related phrases from their marketing materials after sales were made, according to Monday's complaint. The move was an effort to make more assets available on the platform and to avoid regulatory scrutiny, according to the SEC.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Congratz on the crowdsale,” write Shihara in an email to the developer team behind the TKN coin in May 2017, which was included in the SEC filing. Shihara then asked them if they had removed “investment related terms” from their documents.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bittrex went on to list several tokens it knew might be securities, the complaint alleges, including several projects that the SEC took action against.<\/span>","Shihara and other Bittrex employees also allegedly combed through whitepapers, marketing materials and social media posts and urged issuers to remove \"problematic statements.\" They even had a \"cheat sheet\" to use as a guide when reviewing materials.&nbsp;","<span data-v-f87c67ca=\"\">At the root of the SEC’s complaint is that the alleged failure to follow securities laws hurt investors because Bittrex did not follow established rules and laws governing exchanges. The agency also alleges that Bittrex is still operating in the U.S. now, with plans to formally wrap operations at the end of April.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Bittrex’s terms of service, as quoted in the SEC complaint, the company has “no obligation” to separate customer fiat deposits or digital assets and that Bittrex could send whatever fiat currency it wanted to if or when a customer requested to withdraw from their account. That echoes FTX’s alleged similar lack of segregation of customer deposits from other pools of funds.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">SEC Chair Gary Gensler has cited the trouble customers have in collecting their money from bankrupt digital asset firms as an ongoing concern for the agency. <\/span>","<span data-v-f87c67ca=\"\">As regulators have alleged with FTX and Binance, the SEC argues in its that there may be less distinction between the U.S. and international branches than advertised.<\/span>","<span data-v-f87c67ca=\"\">\"Bittrex personnel provide services to Bittrex Global from [Washington state], including maintaining technology shared by Bittrex and Bittrex Global,\" the SEC said in its complaint.<\/span>","In a statement, Bittrex Global denied operating in the U.S., saying the company is distinct from Bittrex and, \"has never held itself out as doing business in the U.S. or with U.S. persons, and has taken pains to disclose to U.S. persons that they are not permitted to use its exchange.\"","In October Bittrex agreed to pay $53 million in fines to two separate enforcement entities within the U.S. Treasury Department charged with combating money laundering and enforcing sanctions laws.&nbsp;","<span data-v-f87c67ca=\"\">Bittrex said last month that it would stop operating in the U.S., citing the regulatory environment as the main reason.&nbsp; <\/span><span data-v-f87c67ca=\"\">According to <\/span><a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/usd-support-exchange-volume-market-share\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">analysis<\/span><\/a><span data-v-f87c67ca=\"\"> by The Block, the firm’s market share of U.S. dollar crypto trading, a metric that largely captures U.S. market share, fell from approximately 23% of total volume in 2018 to under 1% in 2021.&nbsp;<\/span>","<em data-v-f87c67ca=\"\">CORRECTION: Attribution of statement made by Bittrex Global.&nbsp;<\/em>","<em data-v-f87c67ca=\"\">UPDATE: To reflect the SEC's allegations about coordination between Bittrex and Bittrex Global, despite their being advertised as separate companies.&nbsp;<\/em>"],"hashtag":["ANTI-MONEY LAUNDERING","FTX","GARY GENSLER","SANCTIONS","SEC","TREASURY DEPARTMENT"]}