{"summary":"Meta announced earlier this week that a select group of Horizon creators will be able to sell items and experiences on the gaming platform.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/142001\/meta-begins-to-allow-sale-of-digital-goods-on-horizon-taking-nearly-half-in-transaction-fees","publishDate":"2022-04-14T17:01:18","id":2921,"type":null,"title":"Meta begins to allow sale of digital goods on Horizon, taking nearly half in transaction fees","category":["STARTUPS"],"content":["Meta is beginning to allow creators to sell virtual experiences and digital items on its free virtual reality game Horizon Worlds, the company <a href=\"https:\/\/about.fb.com\/news\/2022\/04\/testing-creator-monetization-horizon-worlds\/\" data-v-f87c67ca=\"\">announced<\/a> earlier this week.","But the reaction from creators and people within the NFT community has largely been negative since the announcement.","What appeared to be a step in the right direction to empower users to build their own worlds and make money from such efforts was met with backlash because of the sizable cut the company will take from creators.","Meta will take almost half of each transaction, a Meta spokesperson <a href=\"https:\/\/www.cnbc.com\/2022\/04\/13\/meta-plans-to-take-a-nearly-50percent-cut-on-nft-sales-in-its-metaverse.html\" data-v-f87c67ca=\"\">confirmed<\/a> to CNBC. The 47.5% cut from each transaction will include a hardware platform fee of 30% for sales through the Meta Quest Store. Horizon Worlds will charge another 17.5% fee on top of that. &nbsp;","“The future of work is giving Meta 47.5% of your salary, apparently,” <a href=\"https:\/\/twitter.com\/punk6529\/status\/1514018050462429187\" data-v-f87c67ca=\"\">tweeted punk 6529<\/a>, an NFT art collector and commentator.","The feature will initially only be available to a handful of creators to sell merchandise and experiences. “For example, someone could make and sell attachable accessories for a fashion world or offer paid access to a new part of a world,” said a <a href=\"https:\/\/about.fb.com\/news\/2022\/04\/testing-creator-monetization-horizon-worlds\/\" data-v-f87c67ca=\"\">statement<\/a> from the company.","Others commented that the high fee won’t deter people from trying it out but might prompt other companies to follow the lead. Currently, other NFT marketplaces like OpenSea and LooksRare, take a small percentage of each transaction, at just 2.5% and 2%, respectively.","The news comes months after Zuckerberg had highlighted how the company would focus on making the metaverse more accessible to creators by criticizing the 30% fee that Apple charges developers on transactions.&nbsp;","“Imagine selling a nft and meta taking a 47.5% fee THEN to rub salt in the wound having to pay tax on top of the profits,” <a href=\"https:\/\/twitter.com\/shrimpyuk\/status\/1514171664942182404\" data-v-f87c67ca=\"\">tweeted<\/a> one NFT creator, highlighting that creators will be left with little after the sales.&nbsp;","“We think it’s a pretty competitive rate in the market,” Vivek Sharma, Meta’s VP of Horizon, told <a href=\"https:\/\/www.theverge.com\/2022\/4\/11\/23020684\/meta-horizon-worlds-test-creators-sell-virtual-items-monetization\" data-v-f87c67ca=\"\">The Verge<\/a>. “We believe in the other platforms being able to have their share.”&nbsp;","According to a February <a href=\"https:\/\/twitter.com\/HorizonWorlds\/status\/1494007916990373895?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1494007916990373895%7Ctwgr%5E%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fwww.theverge.com%2F2022%2F2%2F17%2F22939297%2Fmeta-social-vr-platform-horizon-300000-users\" data-v-f87c67ca=\"\">tweet<\/a> from the company, the platform had 10,000 worlds in the process of being created. And as of February, the company had 300,000 users, <a href=\"https:\/\/www.theverge.com\/2022\/2\/17\/22939297\/meta-social-vr-platform-horizon-300000-users\" data-v-f87c67ca=\"\">according to<\/a> The Verge.","It's unclear if Meta will budge from the high transaction fees in light of the public response.","\"We’ve structured our fees to put more money per transaction in the pockets of world creators than many of the other products in this space,\" said a representative from Meta in an email to The Block. \"But we’re also just getting started, and we expect to learn a lot about how our creator ecosystem will develop best as Horizon Worlds grows.\"","The company is already working on its next move. Meta will be bringing Horizon Worlds to mobile phones later this year and is discussing the possibility of bringing it to gaming consoles, Sharma said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"17.5%","content":"PERCENT"},{"type":"Sharma","content":"PERSON"},{"type":"Vivek Sharma","content":"PERSON"},{"type":"Horizon Worlds","content":"LOCATION"},{"type":"2%","content":"PERCENT"},{"type":"Zuckerberg","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Meta","content":"ORGANIZATION"},{"type":"2.5%","content":"PERCENT"},{"type":"February","content":"DATE"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"47.5%","content":"PERCENT"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Meta Quest Store","content":"ORGANIZATION"},{"type":"VP of Horizon","content":"ORGANIZATION"}],"hashtag":[],"authors":["Anushree Dave","The Block"]}