{"summary":"Both the Treasury and the FCA have come under pressure over the handling of the registration process for crypto firms.\nThe longest an applicant has been made to wait for an answer from the regulator is 527 days, the Treasury revealed today.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/108979\/uk-treasury-fca-cryptoasset-register-resources","publishDate":"2021-06-18T12:09:59","id":2922,"type":null,"title":"UK regulator commits more resources to assessing crypto firms","category":["Regulation"],"content":["John Glen, economic secretary to the Treasury and City minister, has said that the Financial Conduct Authority (FCA) has “increased considerably” the resources it has allocated to assessing applications to the cryptoasset register.","The register — announced after the FCA took over as the anti-money laundering and counter terrorist financing supervisor for crypto startups in early 2020 — has become a logjam for startups in the United Kingdom’s crypto sector.","Firms were originally told they had until January 10, 2021, to get registered or cease trading, before the FCA <a href=\"https:\/\/www.fca.org.uk\/news\/press-releases\/fca-establishes-temporary-registration-regime-cryptoasset-businesses\" data-v-f87c67ca=\"\">extended its deadline<\/a> to July 9 after receiving an overwhelming number of applications. On June 3, the regulator <a href=\"https:\/\/www.theblockcrypto.com\/post\/107057\/uk-fca-new-registration-deadline-crypto-march-2022\" data-v-f87c67ca=\"\">kicked the deadline back once again<\/a> — all the way to March 31 next year.","Philip Davies, Conservative member of Parliament (MP) for Shipley, West Yorkshire, put pressure on H.M. Treasury in late May by addressing <a href=\"https:\/\/www.theblockcrypto.com\/post\/105944\/politician-answers-sunak-delays-fca-crypto-register\" data-v-f87c67ca=\"\">a series of written questions over the delays<\/a> to U.K. chancellor Rishi Sunak. Glen <a href=\"https:\/\/www.theblockcrypto.com\/post\/106452\/city-minister-john-glen-crypto-aml-standards\" data-v-f87c67ca=\"\">hit back<\/a> on May 28, stating that a “significant number of firms have failed to implement appropriately robust AML control frameworks, and to employ fit and proper personnel.”","Apparently dissatisfied with that response, Davies — who has a reputation for frustrating legislation in parliament with drawn-out objections — put yet more questions to the chancellor, enquiring as to the “appropriateness” of the FCA retaining its role as supervisor of the crypto sector.","In <a href=\"https:\/\/questions-statements.parliament.uk\/written-questions\/detail\/2021-06-10\/13890\" data-v-f87c67ca=\"\">a response<\/a> published June 18, Glen stressed the need to “balance the potential risk to consumers with the ambition to foster competition and innovation in the sector,” but also conceded that the regulator is beefing up its crypto capabilities.","“The government believes that the FCA’s expertise in the regulation of financial products, its membership of the Cryptoasset Taskforce, and its experience as anti-money laundering supervisor for other asset-based financial services firms makes it the right supervisor for the cryptoasset sector,” he said. “As a result of the longer than anticipated time being taken to process applications, I can confirm that the FCA has increased considerably the resources allocated to assessing applications.”","Glen’s response also included fresh information on the length of the waiting times faced by the U.K.’s crypto startups.","The mean length of time firms have waited for the green light is 248 days (and counting, presumably). The median wait is 252 days. The longest an applicant has been made to wait for an answer from the regulator — in other words, had its application under review — is 527 days.","In the meantime, the <a href=\"https:\/\/register.fca.org.uk\/s\/search?predefined=CA\" data-v-f87c67ca=\"\">crypto register<\/a> has only five fully registered entities."],"hashtag":["FCA"]}