{"summary":"Wormhole Foundation has introduced Gateway, an application-specific blockchain within the Cosmos ecosystem.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240888\/wormhole-cosmos-appchain-gateway","publishDate":"2023-07-21T06:13:52","id":2923,"type":null,"title":"Wormhole unveils a Cosmos appchain called Gateway","category":["CRYPTO ECOSYSTEMS"],"content":["Blockchain interoperability project Wormhole has announced the release of the Wormhole Gateway, an application-specific blockchain (appchain) developed within the Cosmos ecosystem. The blockchain aims to connect multiple Cosmos chains and applications through a single cross-chain liquidity router.","The initial phase of the Gateway will link 23 Cosmos-based chains, including prominent chains like <a href=\"https:\/\/www.theblock.co\/post\/193252\/cosmos-largest-dex-osmosis-launches-a-stableswap-exclusive\" data-v-f87c67ca=\"\">Osmosis<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/143771\/evmos-launches-blockchain-to-bring-ethereum-virtual-machine-to-cosmos\" data-v-f87c67ca=\"\">Evmos<\/a>, Neutron and Sei. Plans are already underway to integrate more chains, all of which will utilize the Cosmos' native messaging protocol, the inter-blockchain communication protocol (IBC). With this, Gateway would serve as a competitor to interoperability protocols like Axelar that already connect Cosmos-based chains.","According to the Wormhole Foundation, the Gateway network will serve as a verification layer for Wormhole messages, offering an added layer of verification alongside Wormhole’s existing ‘Guardian’ consensus mechanism.","“Gateway acts as a sovereign verification layer for Wormhole messages, adding a second means of protection to Wormhole’s own Guardian consensus mechanism on a verifiably transparent public ledger,” the foundation highlighted in a statement.","Gateway is not the first product from the Wormhole team. The Wormhole bridge, a prior decentralized protocol it launched, is known for its capacity to connect multiple blockchains, enabling both token and data transfers across Layer 1 chains outside the Cosmos ecosystem. Gateway, the team’s foray into Cosmos, represents a significant advancement from the bridge’s original design.","In that framework, when an Ethereum token is moved to Solana, it is typically “wrapped” as a representation on the destination chain. For example, an Ethereum token transferred to Solana would appear on Solana as a wrapped version of the original token. In February 2022, a hacker exploited the Wormhole bridge with Solana, spoofing specific security signatures on the bridge and minting 120,000 wETH valued at <a href=\"https:\/\/www.theblock.co\/post\/132909\/wormhole-replenishes-its-blockchain-bridge-after-325-million-exploit\" data-v-f87c67ca=\"\">$325 million<\/a>. The hacker then exchanged the fraudulently minted wETH for genuine ETH on the Ethereum network, depleting all assets held by Wormhole.","Jump Crypto, a trading and venture capital firm that incubated Wormhole, stepped in by replenishing the stolen 120,000 ETH from its reserves to support the bridge. The team later successfully retrieved the funds from Oasis, a decentralized finance protocol where the hacker had deposited the proceeds from the hack.","For security enhancements on Gateway, the foundation introduced the “Governor,” a software module integrated into the network for \"limiting cross-chain contagion during hacks,\" it <a href=\"https:\/\/wormhole.com\/wormhole-gateway-the-gateway-to-the-cosmos-ecosystem\/\" data-v-f87c67ca=\"\">noted<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$325 million","content":"MONEY"},{"type":"Wormhole Foundation","content":"ORGANIZATION"},{"type":"February 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Evmos","content":"LOCATION"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"IBC","content":"ORGANIZATION"}],"hashtag":["COSMOS"],"authors":["Vishal Chawla","The Block"]}