{"summary":"Cryptocurrency asset manager Grayscale filed on Tuesday with the SEC to register its bitcoin trust fund (GBTC) with the regulator\nIf approved, the trust will be the first in crypto to be an SEC reporting company; it will also have a familiar structure to investors more comfortable trading exchange-traded funds\nThe firm hopes that a registered status will help GBTC tap into the pool of institutional investors that prefer to invest in registered products ","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/47476\/grayscale-makes-bet-that-more-government-oversight-will-lure-billions-to-its-crypto-fund","publishDate":"2019-11-19T08:59:55","id":2924,"type":null,"title":"Grayscale is making its bitcoin fund more compliant, and it could lure billions of institutional dollars","category":["Regulation"],"content":["Crypto asset manager Grayscale is hoping a bit more government oversight will make its popular bitcoin trust more appealing to institutional clients.&nbsp;","<span data-v-f87c67ca=\"\">The New York-based firm said Tuesday that it has&nbsp;<\/span><span data-v-f87c67ca=\"\">voluntarily filed with the Securities and Exchange Commission to register its bitcoin trust fund (GBTC). Previously, GBTC was first offered in 2013 as a private placement exempt from SEC registration, then approved by the Financial Industry Regulatory Authority (FINRA) in 2015 to be traded publicly.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Submitted on Tuesday, Grayscale’s SEC filing of Form 10 seeks to register GBTC as an SEC reporting company, which is a first in the cryptocurrency space, per a company statement. Under the new status, the bitcoin trust will be required to file audited financial statements and current reports to announce major updates, in addition to the quarterly and annual reports Grayscale currently publishes for GBTC.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Grayscale managing director Michael Sonnenshein stressed that the filing should not be regarded as a move to turn GBTC into an exchange-traded fund (ETF). However, GBTC under the SEC oversight will have “a familiar structure to investors because they are modeled after popular investment products,” per the statement. The registered GBTC will disclose more information to investors and have better access to liquidity.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Currently, investors who purchase GBTC via private placement have to wait 12 months before reselling it on the secondary market. If the filing is passed, the wait time will be halved to six months, giving investors earlier access to the public market.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Grayscale is hoping that the registered status will help GBTC tap into a pool of institutions that prefer to invest in SEC-registered products.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“While this filing should not be considered as an ETF filing, we do think given the demand we are seeing for GBTC, that by hopefully becoming an SEC reporting company, we are giving investors the level of disclosure and risks and reporting they not only want — but deserve —and this [Grayscale's filing] is a step in that direction,” said Sonnenshein to The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Arguably the most successful cryptocurrency trust product, GBTC, saw a <a href=\"https:\/\/grayscale.co\/insights\/grayscale-q3-2019-digital-asset-investment-report\/\" data-v-f87c67ca=\"\">total cumulative inflow<\/a> of $304.4 million for the 12 months ending in September, reaching its monthly all-time-high in July with $171.7 million. However, there are some that <\/span><a href=\"https:\/\/www.theblockcrypto.com\/daily\/43598\/preview\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">wonder<\/span><\/a> whether<span data-v-f87c67ca=\"\"> GBTC and other bitcoin investment products could lose traction if a bitcoin ETF is approved by the SEC.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In 2017, Grayscale filed for a bitcoin ETF, only to <\/span><a href=\"https:\/\/www.reuters.com\/article\/us-bitcoin-etp\/backers-withdraw-two-proposals-to-list-u-s-bitcoin-funds-idUSKCN1C30CK?feedType=RSS&amp;feedName=technologyNews&amp;.it\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">withdraw<\/span><\/a><span data-v-f87c67ca=\"\"> later that year after the SEC denied the Winklevoss Brothers’ bitcoin ETF. Other asset managers such as VanEck and Bitwise have had similar luck with their bitcoin ETF applications, although the SEC recently decided to revisit its rejection to Bitwise, opening up the possibility for an ETF approval. Meanwhile, Sonnenshein remains optimistic about the regulator's attitude towards cryptocurrencies.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Our regulators are not only open to the asset class, but they are also very willing to engage with established players like us,\" said Sonnenshein. \"The various filings are moving the industry forward and providing access to the best products in the investment community.”<\/span>"],"hashtag":["SEC"]}