{"summary":"When the internet began to explode as a consumer and business phenomenon, ironically one of the sectors caught most off guard were the very universities","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/554\/blockchain-goes-to-school-becomes-the-popular-kid","publishDate":"2018-09-18T16:33:58","id":2924,"type":null,"title":"College phenom: Blockchain has become the new big thing on campus and beyond","category":["LAYER 1S"],"content":["When the internet began to explode as a consumer and business phenomenon, ironically one of the sectors caught most off guard were the very universities that birthed the global network. In a span of just a couple of years, the primarily academic network was being used for all sorts of communication, commerce, et al. and colleges scrambled to keep up. Curriculum development followed and the next generation of coders, businesspeople, and -- really -- all students could learn about internet tech and how it would change not just their professions but also the world.","As blockchain and cryptocurrency gain popularity and business uses begin to become real, universities are trying to get ahead of the curve this time with classroom offerings that recognize the inherently multi-disciplinary nature of the technology.&nbsp;<em data-v-f87c67ca=\"\">Wired<\/em> <a href=\"https:\/\/www.wired.com\/story\/latest-course-catalog-trend-blockchain-101\/\" data-v-f87c67ca=\"\">took a deep look at how some schools are embracing blockchain<\/a>&nbsp;and one observation crystallized this notion well: \"Blockchain as a technology requires that you understand a bunch of other things first: cryptography, distributed systems, operating systems,”said Andrew Myers, a computer science professor at Cornell University.","Of course, that's just the&nbsp;<em data-v-f87c67ca=\"\">technical<\/em> side of blockchain, which most longer-term users won't much care about. Myers noted that even on the tech side, there are many prerequisites it helps to have to properly learn blockchain -- and he didn't even mention the idea that having a grounding in the fundamentals of traditional, accounting-style ledgers would also be rather useful. Myers further mused that, \"You need textbooks, and a lot of that knowledge just hasn’t been distilled into a form that lets you really teach a good undergraduate-level course yet.”","Still, there are places to get started. Stanford's blockchain course includes <a href=\"https:\/\/d28rh4a8wq0iu5.cloudfront.net\/bitcointech\/readings\/princeton_bitcoin_book.pdf?a=1\" data-v-f87c67ca=\"\">a link to a Princeton text on the topic<\/a>. The rather ponderously titled, \"Bitcoin and Cryptocurrency Technologies\" is, admittedly, dated from February 2016. And the book isn't an especially broad introduction to blockchain. But as&nbsp;<em data-v-f87c67ca=\"\">Wired&nbsp;<\/em>explains, where there's a will there's a way.","At UC-Berkeley, students took it upon themselves to teach other students the basics. “I think a lot of colleges are falling behind the times and are not really preparing people for these new labor markets,” Anthony DiPrinzio, an economics major, told <em data-v-f87c67ca=\"\">Wired<\/em>. “Whatever your major is, you’re stuck in that silo and you’re just learning this one specific area, with teaching methods that are often outdated.”","He helps run the club \"Blockchain at Berkeley.\" The club teaches two classes on campus and has an online offering too. So far, more than 13,000 have enrolled. The club maintains a public-facing Slack group which has a whopping 2,000 members. This makes Blockchain at Berkeley's effort something of a decentralized approach to education, which aligns nicely with the crypto ethos about doing the same for money.","And, indeed, like a widely used blockchain itself, learning about the technology is spreading everywhere. <a href=\"https:\/\/blog.coinbase.com\/the-rise-of-crypto-in-higher-education-81b648c2466f\" data-v-f87c67ca=\"\">Coinbase recently found in an survey<\/a> that 42% of the world's top 50 universities have a blockchain course offering of some type. Stanford and Cornell lead the pack with 10 and 9 classes, respectively. But there's much work to do. Of all the courses, 81% are in the math and science side, mostly the core technology and understand how it fits into programming frameworks. In the meantime 15% of classes come from the finance and business realm and just 4% are in the social sciences.","It is, however, interesting that 47% of students in the social sciences expressed a desire to learn about blockchain and crypto. While part of that was fed by last year's bull market in nearly al tokens, the survey itself was conducted while the bear was in full growl.&nbsp;","Of course, with interest in the general population also running high, courses aren't limited to traditional campus learning. The Berkeley offering mentioned above is hardly alone when it comes to online learning. MIT offers a 6-week class which includes a certification from its prestigious Sloan School of Management. That targets professionals in all fields and is very much a \"basics for professionals\" course. Online-education firm Udacity offers a \"nanodegree\" in blockchain for software pros that takes 10 hours a week over six months.&nbsp;","It's clear that the proliferation of online education options along with a much savvier technology and business climate at universities has helped push these offerings. And while some are immature, especially in a fast-changing space, there is a real sense that this time is different. Even with the disappointment around crypto token prices, the desire to understand and deploy the underlying technologies is cutting across learning disciplines, stages of professional development, and national borders.","At&nbsp;<em data-v-f87c67ca=\"\">The Block<\/em>, our mission is \"Crypto Simplified\" so we have an especially strong interest in what's happening in education around these technologies. While the above is just a snapshot, look for us to dive deeper into where and how you can learn more in the coming months. We may even be enrolled in the same class you are.","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Andrew Myers","content":"PERSON"},{"type":"81%","content":"PERCENT"},{"type":"Anthony DiPrinzio","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"42%","content":"PERCENT"},{"type":"UC","content":"ORGANIZATION"},{"type":"Sloan School of Management","content":"ORGANIZATION"},{"type":"Cornell University","content":"ORGANIZATION"},{"type":"Cryptocurrency Technologies","content":"ORGANIZATION"},{"type":"February 2016","content":"DATE"},{"type":"47%","content":"PERCENT"},{"type":"Cornell","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"Berkeley","content":"LOCATION"},{"type":"Udacity","content":"ORGANIZATION"},{"type":"Princeton","content":"LOCATION"}],"hashtag":[],"authors":["Mark Rogowsky","The Block"]}