{"summary":"A New Hampshire district court has ruled against decentralized publishing platform LBRY in a legal battle with the SEC. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/183770\/sec-wins-suit-against-lbry-in-major-blow-to-crypto-token-issuance","publishDate":"2022-11-07T12:39:53","id":2926,"type":null,"title":"SEC wins suit against LBRY in major blow to crypto token issuance","category":["POLICY"],"content":["The Securities and Exchange Commission has prevailed in a courtroom battle with decentralized publishing platform LBRY after arguing that its token was subject to regulatory oversight.","The court found that LBRY's LBC token was an investment contract, even though the project did not sell it via an initial coin offering, or ICO. The project began in 2016 with the stated aim of decentralizing publishing.","\"LBRY is mistaken about both the facts and the law,\" the New Hampshire District Court said in <a href=\"https:\/\/odysee.com\/@lbry:3f\/secvslbrysummaryjudgementruling:a\" data-v-f87c67ca=\"\">the decision<\/a>. Judge Paul Barbadoro granted the SEC's motion for summary judgment, sealing the fate of a case&nbsp;<a href=\"https:\/\/www.theblock.co\/linked\/99773\/sec-lawsuit-lbry-credits-securities\" data-v-f87c67ca=\"\">that begin last March<\/a>.&nbsp;","The decision is a major blow to crypto issuers, many of whom have argued that the SEC is pursuing a course of \"regulation by enforcement.\" Like LBRY, many defenders of token issuance claim that the commission has not given enough warning to crypto firms of how it will apply its oversight. It's a defense that SEC Chair Gary Gensler has <a href=\"https:\/\/www.theblock.co\/post\/182003\/gensler-flexes-crypto-enforcement-record-in-speech\" data-v-f87c67ca=\"\">criticized very publicly<\/a> in recent months while commending the SEC's application of existing laws and, particularly, the Howey Test, which refers to a U.S. Supreme Court case revolving around whether a transaction may qualify as an investment contract.","\"What the evidence in the record discloses is that LBRY promoted LBC as an investment that would grow in value over time through the company’s development of the LBRY Network,\" the court said. Referring to the Howey Test decision, the court said that \"the SEC has based its claim on a straightforward application of a venerable Supreme Court precedent that has been applied by hundreds of federal courts across the country over more than 70 years. While this may be the first time it has been used against an issuer of digital tokens that did not conduct an ICO, LBRY is in no position to claim that it did not receive fair notice that its conduct was unlawful.\"","LBRY&nbsp;<a href=\"https:\/\/twitter.com\/LBRYcom\/status\/1589645453091827712\" data-v-f87c67ca=\"\">tweeted<\/a>: \"We lost. Sorry everyone,\" in response to the decision. Despite <a href=\"https:\/\/coinmarketcap.com\/currencies\/library-credits\/\" data-v-f87c67ca=\"\">brief spikes<\/a> alongside bull markets in 2017 and 2021, the token has languished, as has the project as a whole.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2016","content":"DATE"},{"type":"LBRY Network","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"U.S. Supreme Court","content":"ORGANIZATION"},{"type":"Paul Barbadoro","content":"PERSON"},{"type":"Supreme Court","content":"ORGANIZATION"},{"type":"Howey Test","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Gary Gensler","content":"PERSON"},{"type":"ICO","content":"ORGANIZATION"},{"type":"New Hampshire District Court","content":"ORGANIZATION"}],"hashtag":["GARY GENSLER","SEC"],"authors":["Kollen Post","The Block"]}