{"summary":"Bitcoin IRA™ has launched a new crypto account, offering $100 million worth of annual insurance coverage from custodian BitGo Trust\nThe move aims to boost mainstream adoption of digital assets\nBitcoin IRA is also reducing its wallet holding fees by 30% ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/28767\/bitcoin-ira-launches-crypto-retirement-accounts-insured-for-100m-courtesy-of-bitgo","publishDate":"2019-06-25T05:01:19","id":2926,"type":null,"title":"Bitcoin IRA launches crypto retirement accounts insured for $100m, courtesy of BitGo","category":["Startups"],"content":["Bitcoin IRA, a company that specialises in offering crypto for individual retirement accounts (IRAs), has struck a partnership with custodian BitGo Trust that will offer clients the optionality to have their accounts insured by the custodian firm.&nbsp;","The move will see each new Bitcoin IRA account covered by default against theft or loss of cryptographic keys, the two firms announced on Tuesday. There are no additional charges to use BitGo Trust as a cold-wallet custodian and to have the $100 million insurance policy, Bitcoin IRA told The Block.","The firm told The Block it hopes the move will trigger mainstream adoption of digital assets and its services, highlighting that the new account meets clients' expectations of having something akin to Federal Deposit Insurance Corporation insurance. But unlike FDIC insurance, BitGo's insurance is limited to $100 million annually for all of Bitcoin IRA's accounts. Therefore if one single Bitcoin IRA account blows through the $100 million insurance, that is all that would be covered.&nbsp;","<span data-v-f87c67ca=\"\">Since 2016, Bitcoin IRA has reportedly processed over $350 million in digital asset transactions for self-directed retirement accounts. The firm says it caters for around 4500 retail clients who wish to make digital assets part of their tax-free retirement investment strategy, offering 9 different cryptocurrencies. Custody-giant BitGo meanwhile only currently targets institutional investors, meaning the partnership now gives the business line a significant amount of new retail exposure.&nbsp;<\/span>","<strong data-v-f87c67ca=\"\">Lower costs, less risk<\/strong>","When asked if consumers' assets were not protected previously, Bitcoin IRA said that it has always offered a $1 million insurance policy covering consumers \"on the transactional side from any internal cases of fraud or theft.\" It added that Kingdom Trust also provided additional insurance for digital assets in their custody, \"though their policy limit is not known by us.\"","In Tuesday's announcement, Bitcoin IRA further said that it was reducing its wallet holding fees by 30% to .0005 points per month and reducing client transaction fees. It is also waiving the first year's account fee ($240) \"for a limited time\" for the new account service.","\"We have tiered pricing based on a client's usage and investment amount,\" the firm told The Block. \"For example, if a client purchases multiple coins at once or invests over $25,000 then they'll have better fees. The wallet holding fee is a small annual fee based on the amount of cryptocurrency in their wallet.\"","As a result, Bitcoin IRA say they are now offering an all-round improved service.","\"<span data-v-f87c67ca=\"\">Our partnership with BitGo Trust provides our clients with faster account funding, lower fees, as well as significantly increased insurance protections,\" said Chris Kline, COO at Bitcoin IRA.&nbsp;<\/span>","<em data-v-f87c67ca=\"\">Isabel Woodford contributed to this report<\/em>"],"hashtag":[]}