{"summary":"Hosting provider Applied Blockchain will provide bitcoin miner Marathon an additional 70 megawatts, bringing total to 276 megawatts.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/171024\/applied-blockchain-extends-marathon-contract-by-70-megawatts-as-it-breaks-ground-in-north-dakota","publishDate":"2022-09-19T12:22:30","id":2927,"type":null,"title":"Applied Blockchain extends Marathon contract by 70 megawatts as it breaks ground in North Dakota","category":["MINING"],"content":["Applied Blockchain will host an additional 70 megawatts worth of bitcoin miners for Marathon, extending the deal from the <a href=\"https:\/\/www.theblock.co\/post\/158342\/bitcoin-miner-marathon-secures-new-200-megawatt-hosting-deal\" data-v-f87c67ca=\"\">previously announced 200 megawatts<\/a>.","The company also announced Monday the groundbreaking of its 180-megawatt facility in North Dakota. It expects to begin operating in the first half of 2023.","The company closed a five-year power deal with a local utility partner in September. Available transmission capacity and excess wind generation were key to the choice of location, the company said.","In total, Applied Blockchain now has 500 megawatts of contracted hosting.","This will be the company's second facility in that state, adding to a 100-megawatt site that opened earlier this year. It is also building a \"next-generation datacenter\" 200-megawatt site in Texas, which is currently ahead of schedule.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Monday","content":"DATE"},{"type":"North Dakota","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Marathon","content":"ORGANIZATION"},{"type":"the first half of 2023","content":"DATE"},{"type":"Applied Blockchain","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"Blockchain","content":"PERSON"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}