{"summary":"TrueLayer is continuing its push into digital assets via the partnership and hinted at its interest in developing a GBP-backed stablecoin. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/187783\/fintech-firm-truelayer-to-power-coinbase-payments-eyes-stablecoins","publishDate":"2022-11-17T05:33:35","id":293,"type":null,"title":"Fintech firm TrueLayer to power Coinbase payments, eyes stablecoins","category":["FINANCE FIRMS"],"content":["Fintech unicorn TrueLayer is partnering with Coinbase to enable UK users to top up their accounts via their mobile banking app. This is part of a broader push into digital assets as the open-banking company eyes adding a stablecoin product to its crypto-focused offering.&nbsp;","Open banking is seen as a challenger to established card-based payment systems through its ability to facilitate account-to-account transactions. For crypto, its use-case has so far been used primarily to enable easy payments from fiat to digital currency.","Through this partnership with Coinbase, UK users will be able to link their bank accounts directly to Coinbase, authenticate via a banking app and then confirm payment. This will be rolled out progressively across Europe in the coming months.&nbsp;","\"It's cost-effective for merchants. Any company that deals with processing crypto assets pays a big premium to card networks,\" said founder Francesco Simoneschi in an interview with The Block, adding: \"Open banking removes that fee structure for merchants.\"&nbsp;","Simoneschi also said that transaction fees from the consumer side are a fifth of what the cost is for transacting via Apple Pay or card payments depending on the amount.&nbsp;","This partnership, however, comes at a time when there's heavy scrutiny of centralized exchanges amid FTX's ongoing troubles after filing for Chapter 11 bankruptcy protection on Friday. He admitted that TrueLayer had discussions with FTX at one point but said it's not currently an active customer.","\"We try to do our own diligence as best as we can,\" he said, \"but I think there are some limits for every operator in this market to make those sorts of assessments\"&nbsp;","He said they were attracted to Coinbase for its reputation as a publically traded company.&nbsp;","Simoneschi said that TrueLayer is powering ahead with its crypto products despite a current slump in the market spurred by the collapses of Terra, Three Arrows Capital and FTX.","TrueLayer itself has also suffered amid current market conditions, <a href=\"https:\/\/www.theblock.co\/post\/170687\/fintech-unicorn-truelayer-announces-plans-to-cut-headcount-by-10\" data-v-f87c67ca=\"\">cutting<\/a> 10% of its workforce in September. Simoneschi said that the company doesn't currently need to raise and has a runway for the next several years.&nbsp;","Along with the Coinbase partnership, the company <a href=\"https:\/\/truelayer.com\/blog\/crypto-exchanges-looking-to-open-banking\/\" data-v-f87c67ca=\"\">said<\/a> in January that it's been working with Ziglu and Luno.&nbsp;","A year ago, the company designated crypto as a key area of focus — with a dedicated team focusing on bridging the gap between traditional finance and DeFi.","Simoneschi sees the lack of prevalence of a British pound-denominated stablecoin as a problem the company would like to set out and solve.&nbsp;He hinted that TrueLayer is interested in developing a GBP stablecoin, saying that other regions apart from the U.S. should have the option of diversifying their currency.&nbsp;","\"[As a payments company], this is an obvious place for us to go... we are well plugged into the crypto ecosystem and we've been upgrading our company to have close coordination with regulators and be transparent,\" he said, stressing the importance of working with regulators. \"Those are the basic elements that you need to put into developing stablecoins representing any asset but specifically the British pound.\"&nbsp;","In terms of how this might function within an open banking product, Simoneschi said it isn't hard to imagine a product that moves fiat money into a stablecoin on a crypto wallet that can then be used to make purchases.&nbsp;","Other companies are looking at developing British Pound-backed stablecoins. In June, USDT issuer Tether <a href=\"https:\/\/www.theblock.co\/post\/153447\/tether-british-pound-stablecoin-gbpt\" data-v-f87c67ca=\"\">unveiled<\/a> its British pound-pegged stablecoin GBPT. Payments company Circle is also <a href=\"https:\/\/www.cityam.com\/blackrock-leads-400m-funding-round-in-stablecoin-issuer-circle\/\" data-v-f87c67ca=\"\">rumored<\/a> to be developing a similar stablecoin offering.&nbsp;","Any stablecoin denominated in non-USD assets faces an uphill battle for adoption. According to <a href=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/share-of-fiat-backed-stablecoin-supply-in-usd-by-currency\" data-v-f87c67ca=\"\">The Block Research<\/a>, close to 100% of stablecoins on the Ethereum blockchain are pegged to the U.S. dollar.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/share-of-fiat-backed-stablecoin-supply-in-usd-by-currency\/embed\" title=\"Share of Fiat Stablecoin Supply (in USD) by Currency\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USDT","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Simoneschi","content":"PERSON"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"January","content":"DATE"},{"type":"Ziglu","content":"PERSON"},{"type":"Europe","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"TrueLayer","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"June","content":"DATE"},{"type":"September","content":"DATE"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Terra","content":"ORGANIZATION"},{"type":"Francesco Simoneschi","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Fintech unicorn TrueLayer","content":"ORGANIZATION"}],"hashtag":["COINBASE","CRYPTO BANKS AND LENDERS","FINTECH","PAYMENTS","TRADFI BANKS"],"authors":["Tom Matsuda","The Block"]}