{"summary":"China’s ride-sharing giant Didi has partnered with the People’s Bank of China’s (PBOC’s) Digital Currency Research Institute \nDidi said China’s digital currency “will become a key infrastructure of the digital economy”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/70723\/chinas-ride-sharing-giant-didi-to-trial-central-bank-digital-currency","publishDate":"2020-07-08T04:30:22","id":2930,"type":null,"title":"Ride-Sharing Didi set to test China&#x27;s Central Bank Digital Currency","category":["China"],"content":["China's ride-sharing giant Didi Chuxing is set to trial the country's central bank digital currency (CBDC).","Announcing the news on Wednesday, <a href=\"https:\/\/www.didiglobal.com\/news\/newsDetail?id=935&amp;type=news\" data-v-f87c67ca=\"\">Didi said<\/a> it had signed an agreement with the People's Bank of China's (PBOC's) Digital Currency Research Institute to test digital yuan, officially known as Digital Currency Electronic Payment (DCEP).","\"DCEP will become a key infrastructure of the digital economy,\" said Didi, adding that it will work with the central bank to \"promote the integration of the digital economy with the real economy.\"","While specific details of the trial are not yet clear, it could be one of the first real-world applications of DCEP given Didi's massive user base. SoftBank and Apple-backed Didi serves <a href=\"https:\/\/expandedramblings.com\/index.php\/didi-chuxing-facts-statistics\/\" data-v-f87c67ca=\"\">over 550 million users.<\/a> Didi <a href=\"https:\/\/www.cnbc.com\/2016\/08\/01\/chinas-didi-chuxing-to-acquire-ubers-chinese-operations-wsj.html\" data-v-f87c67ca=\"\">acquired<\/a> Uber's China business in 2016.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nLocal news outlet Caixin, citing \"an Agricultural Bank insider” <a href=\"http:\/\/finance.caixin.com\/2020-07-08\/101577067.html\" data-v-f87c67ca=\"\">reported today<\/a> that Didi had reached out to the bank last year for a digital currency trail in the Xiong'an New Area city.","Notably, Didi already supports Alipay and WeChat Pay on its platform, and the digital currency appears to be a good trial addition.","The PBOC <a href=\"https:\/\/www.theblockcrypto.com\/post\/61819\/chinese-state-owned-bank-releases-test-app-for-central-banks-digital-currency\" data-v-f87c67ca=\"\">began testing<\/a> digital currency, which has been under development since 2014, a few months ago. The central bank had partnered with seven state-owned companies, including four commercial banks and three telecom giants, to test the digital yuan.","<a href=\"https:\/\/www.theblockcrypto.com\/post\/62800\/starbucks-mcdonalds-could-trial-chinas-central-bank-digital-currency-report\" data-v-f87c67ca=\"\">Restaurant giants<\/a> Starbucks, McDonald's, and Subway were also reportedly looking to trial the digital currency. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nPer the Caixin report, more companies, including TikTok owner ByteDance, Chinese group buying website Meituan-Dianping, and video-sharing website Bilibili, have also partnered or are looking into collaboration opportunities with state-owned banks that are trialing the digital yuan — the Industrial and Commercial Bank of China, the Agricultural Bank of China, the Bank of China and the China Construction Bank.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nChinese tech giant Huawei has reportedly provided technical support for the digital currency project, and the Postal Savings Bank and Bank of Communications have also either participated or are trying to participate in trials, per the Caixin report. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nEarlier this year, Hong Kong-based top AI startup SenseTime also <a href=\"https:\/\/www.theblockcrypto.com\/linked\/63222\/top-ai-startup-sensetime-inks-deal-with-chinas-digital-currency-research-institute\" data-v-f87c67ca=\"\">partnered<\/a> with the PBOC's digital currency research institute. While several details of the digital yuan have emerged in recent months, its official launch date still remains unknown."],"hashtag":["CBDCS"]}