{"summary":"Mastercard has filed for 15 metaverse and crypto trademarks, on a 1b basis. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/141469\/mastercard-files-for-more-than-a-dozen-metaverse-and-crypto-trademarks","publishDate":"2022-04-11T16:21:39","id":2931,"type":null,"title":"Mastercard files for more than a dozen metaverse and crypto trademarks","category":["FINTECH"],"content":["A major financial services firm has thrown its hat into the crypto trademark ring, with new filings related to NFTs, virtual worlds and more.","The 15 filings by Mastercard, with an April 7 status date, include NFT backed multimedia, marketplaces for digital goods, and payment transaction processing and e-commerce software business transactions in the metaverse.","The applications are filed on a 1b basis, meaning there’s an intent to use them in the future, though when the company plans to use them and how is unclear. Unlike 1a applications, which are for “actual use,” 1b filings don’t require evidence to the government that the trademark is already being used. Instead, a company must show “bonafide intent” to use the trademark at a future date.","Payments giants like Mastercard and others are no strangers to the crypto industry. Visa, for example, has been moving into the ecosystem for some time, adding <a href=\"https:\/\/www.theblockcrypto.com\/post\/110119\/visa-makes-five-strategic-crypto-hires-and-placements\" data-v-f87c67ca=\"\">crypto staff<\/a> to the team and purchasing a CryptoPunk last summer.","Last month, American Express filed for similar trademarks as Mastercard for “downloadable computer software for facilitating the transfer of a virtual payment card to an electronic mobile wallet,” among other areas.&nbsp;","Though there’s no universal definition for the term ‘metaverse’, the term appeared in the American Express application when describing the “transaction authentication services, routing, authorization and settlement services, and fraud detection and control services in the metaverse and other virtual worlds.\"&nbsp;","For the Mastercard application, the term metaverse appears when describing “financial sponsorship of cultural events, charitable events, concerts, sporting events, travel experiences, fine dining events, festivals and awards shows in the metaverse and other virtual worlds.”","This trademark isn’t Mastercard’s first move into the blockchain and crypto space. Earlier this year, Mastercard <a href=\"https:\/\/www.theblockcrypto.com\/linked\/130596\/coinbase-mastercard-partnership-nft-cards\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">inked a dea<\/a>l with Coinbase to support its NFT marketplace.&nbsp;","Last year, the company launched the Start Path Crypto program to support startups that use blockchain technology to solve “real-world problems.” But the move highlights a <a href=\"https:\/\/www.theblockcrypto.com\/news+\/138312\/why-brands-are-racing-to-get-trademarks-that-extend-to-the-digital-world\" data-v-f87c67ca=\"\">l<\/a><a href=\"https:\/\/www.theblockcrypto.com\/news+\/138312\/why-brands-are-racing-to-get-trademarks-that-extend-to-the-digital-world\" data-v-f87c67ca=\"\">arger trend<\/a> among companies.&nbsp;While there were around 13 metaverse trademark applications in February 2021, that number jumped to 257 by February 2022.&nbsp;","<em data-v-f87c67ca=\"\">Hat tip Michael Kondoudis<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"February 2022","content":"DATE"},{"type":"February 2021","content":"DATE"},{"type":"Michael Kondoudis","content":"PERSON"},{"type":"American Express","content":"ORGANIZATION"},{"type":"dea","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"last summer","content":"DATE"},{"type":"April 7","content":"DATE"}],"hashtag":[],"authors":["Anushree Dave","The Block"]}