{"summary":"A16z and Coinbase intend to challenge FinCEN’s proposed crypto wallet rules in court should it become law.\nA16z’s Kathryn Haun, a former federal prosecutor, says the proposed rules are ill-advised and will have “many foreseeable and unintended negative consequences.”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/90091\/a16z-coinbase-intend-challenge-fincen-proposed-crypto-wallet-rules-court-should-become-law","publishDate":"2021-01-05T08:20:31","id":2931,"type":null,"title":"A16z, Coinbase intend to challenge FinCEN&#x27;s proposed crypto wallet rules in court should it become law","category":["Regulation"],"content":["Venture capital firm a16z and exchange operator Coinbase intend to challenge Financial Crimes Enforcement Network's (FinCEN's) proposed crypto wallet rules in court should it become law.","The intention was revealed by <a href=\"https:\/\/twitter.com\/katie_haun\/status\/1346245037030404096\" data-v-f87c67ca=\"\">a16z's Kathryn Haun<\/a> and <a href=\"https:\/\/twitter.com\/brian_armstrong\/status\/1346354549175554048\" data-v-f87c67ca=\"\">Coinbase's Brian Armstrong<\/a> in tweets on Monday, who said the proposed rules are ill-advised and shouldn't go forward.","FinCEN, a&nbsp;bureau of the U.S. Treasury Department, <a href=\"https:\/\/www.theblockcrypto.com\/post\/90021\/fincen-crypto-wallet-rule-deadline-feature\" data-v-f87c67ca=\"\">seeks to heighten<\/a> identification requirements for crypto transactions. The proposed rules would subject all wallets, including self-hosted or non-custodial wallets, to know-your-customer (KYC) and reporting requirements for transactions above $3,000. Exchanges would also need to submit and store records involving transactions worth more than $10,000 in a given reporting period.","\"The new rule, ostensibly aimed at fighting financial crime, would require various cryptocurrency entities to collect and report detailed personal identifiable information of their customers' counterparties, a standard applied to no other sector of the financial industry today,\" <a href=\"https:\/\/a16z.com\/2021\/01\/04\/why-a16z-opposes-secretary-mnuchins-fincen-midnight-crypto-rulemaking\/\" data-v-f87c67ca=\"\">said<\/a> Haun, a general partner at a16z and a former federal prosecutor. \"Such an ill-advised regulation will have many foreseeable and unintended negative consequences.\"","Haun said the proposed rules are \"arbitrary and capricious,\" as well as procedurally and substantively defective. \"FinCEN should reconsider &amp; instead engage in meaningful consultation with the crypto industry to assist in fighting financial crime,\" she said. \"As proposed the rule is more likely to hinder the prosecution of financial crime by driving it offshore &amp; making it harder to trace.\"","\"If this ill-advised rule goes forward, a16z intends to join others in challenging it in court but urges the agency to do its job &amp; evaluate the legality in 1st instance, not leave it to a court to address myriad legal deficiencies,\" said Haun.","Coinbase's Armstrong <a href=\"https:\/\/twitter.com\/brian_armstrong\/status\/1346354549175554048\" data-v-f87c67ca=\"\">said<\/a> the exchange operator \"intends to join A16Z in challenging this in court, if it goes through.\"","Several industry players<a href=\"https:\/\/www.theblockcrypto.com\/post\/90021\/fincen-crypto-wallet-rule-deadline-feature\" data-v-f87c67ca=\"\"> have shown disappointment and have urged <\/a>FinCEN to reconsider the proposed rules. They have also asked the bureau to extend the abnormally short comment period of 15 days that ended on January 4 to standard 60 days. The deadline has apparently moved by three days to <a href=\"https:\/\/beta.regulations.gov\/document\/FINCEN_FRDOC_0001-0121\" data-v-f87c67ca=\"\">January 7<\/a> as of this writing."],"hashtag":["COINBASE"]}