{"summary":"Router Protocol - an infrastructure layer enabling communication between blockchains, today announced that it has integrated Avalanche network’s C-Chain to its cross-chain messaging protocol.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/136243\/router-protocol-integrates-avalanche-to-its-cross-chain-messaging-protocol","publishDate":"2022-03-04T09:00:25","id":2933,"type":null,"title":"Router Protocol Integrates Avalanche to its Cross-Chain Messaging Protocol","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">Router Protocol - <\/span><span data-v-f87c67ca=\"\">an infrastructure layer enabling communication between blockchains,<\/span><span data-v-f87c67ca=\"\"> today announced that it has integrated Avalanche network’s C-Chain to its cross-chain messaging protocol. Users now have the ability to utilize the true potential of the Avalanche network by performing cross-chain transfers and swaps between Polygon, Binance Smart Chain (BSC), and Avalanche C-chain.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Avalanche’s integration marks a significant step forward for Router and advances our mission of achieving a multi-blockchain future,” said Ramani Ramachandran, co-founder and chief executive of Router Protocol.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“As blockchain ecosystems continue to grow, they are becoming increasingly siloed and unconnected from each other, preventing the industry from reaching its full potential.<\/span><span data-v-f87c67ca=\"\">”<\/span>","<b data-v-f87c67ca=\"\">What’s currently available on the Router?<\/b> <span data-v-f87c67ca=\"\">&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The news comes following Router’s mainnet launch on Polygon and Binance Smart Chain (BSC) in January after raising $4.1 million from leading investors including Coinbase Ventures, Alameda Research, QCP, Polygon, and Wintermute.<\/span>","<b data-v-f87c67ca=\"\">More EVM chains:<\/b><span data-v-f87c67ca=\"\"> Router Protocol is going to cover almost all major EVM chains.<\/span>","<b data-v-f87c67ca=\"\">Cross Chain Explorer:<\/b><span data-v-f87c67ca=\"\"> An explorer to see exactly how cross-chain transfers and swaps happen on different chains. This will give users more transparency and make debugging easier.<\/span>","<b data-v-f87c67ca=\"\">Incentivized staking &amp; liquidity mining programs<\/b><span data-v-f87c67ca=\"\">: Router will create various staking and liquidity mining programs for rewarding those who provide liquidity to Router bridge.<\/span>","<b data-v-f87c67ca=\"\">Router Software Developer Kit (SDK)<\/b><span data-v-f87c67ca=\"\">: Currently scheduled for May 2022, the SDK will include tools for developers to utilize Router’s&nbsp; cross-chain messaging system to build cross-chain dapps. Instead of dApps that function on multiple chains separately, developers will be able to build dApps that use multiple chains in tandem.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Non-EVM chain:<\/b><span data-v-f87c67ca=\"\"> Router will introduce its first non-EVM chain in the second quarter of 2022.<\/span>","<b data-v-f87c67ca=\"\">Router V2 Prototype:<\/b><span data-v-f87c67ca=\"\"> A prototype of the Router blockchain designed as a cross-chain first blockchain with a focus on enabling messaging across chains.<\/span>","<b data-v-f87c67ca=\"\">More Validators:<\/b><span data-v-f87c67ca=\"\"> Router Protocol will onboard new validators and then transition to a model where anyone can become a validator.<\/span>","<span data-v-f87c67ca=\"\">For more information about Router Protocol and its mission to revolutionize cross-chain interoperability visit <\/span><a href=\"http:\/\/www.routerprotocol.com\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">www.routerprotocol.com.<\/span><\/a>","<b data-v-f87c67ca=\"\">About Router Protocol<\/b>","<span data-v-f87c67ca=\"\">Router Protocol is building a suite of cross-chain liquidity infra primitives that aims to seamlessly provide bridging infrastructure between current and emerging Layer 1 and Layer 2 blockchain solutions.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"May 2022","content":"DATE"},{"type":"Polygon","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"second quarter of 2022","content":"DATE"},{"type":"Wintermute","content":"ORGANIZATION"},{"type":"SDK","content":"ORGANIZATION"},{"type":"Ramani Ramachandran","content":"PERSON"},{"type":"Binance Smart Chain","content":"ORGANIZATION"},{"type":"Router Protocol","content":"ORGANIZATION"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"$4.1 million","content":"MONEY"},{"type":"Alameda Research","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}