{"summary":"Spencer Dinwiddie of the National Basketball Association has hired broker-dealer Tritaurian Capital for his forthcoming token offering, after a failed launch in January.\nInterestingly, the names of the token offering and the issuance entity have also been changed.\nAn industry insider told The Block that the NBA didn’t allow any fan-related perks for the new offering and that it will likely just be a simple bond offering.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/57582\/nbas-spencer-dinwiddie-appoints-new-broker-dealer-for-his-upcoming-token-offering-after-a-failed-launch-in-january","publishDate":"2020-03-03T10:55:31","id":2934,"type":null,"title":"NBA’s Spencer Dinwiddie appoints new broker-dealer for his upcoming token offering, after a failed launch in January","category":["Projects"],"content":["Athlete Spencer Dinwiddie of the National Basketball Association (NBA) has hired broker-dealer Tritaurian Capital for his upcoming token offering.&nbsp;&nbsp;","Dinwiddie sent an email to potential investors on Tuesday, a copy of which is obtained by The Block, saying that Tritaurian is “best-suited” to help bring the upcoming securities offering to accredited investors.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"Tritaurian is a registered broker-dealer that has worked closely with regulators over the past several years to understand their perspective on blockchain and cryptocurrency,\" reads the email.&nbsp;","Notably, North Capital Private Securities (NCPS) <a href=\"https:\/\/www.prnewswire.com\/news-releases\/spencer-dinwiddie-announces-dream-fan-shares-platform-for-investing-in-athletes-300926182.html\" data-v-f87c67ca=\"\">was initially<\/a> a broker-dealer for the offering. It remains unclear whether NCPS is still involved in the project or is no longer associated. The Block has contacted Dinwiddie’s team and will update this story should we hear back.","Interestingly, the names of the token offering and the issuance entity have also been changed - from SD8 and SD8 LLC - to SD26 and SD26 LLC, respectively. Dinwiddie <a href=\"https:\/\/www.reuters.com\/article\/us-basketball-nba-number-changes\/dinwiddie-ross-change-numbers-due-to-kobes-death-idUSKBN1ZS017\" data-v-f87c67ca=\"\">switched<\/a> from number 8 to 26 last month to honor the late Kobe Bryant.&nbsp;","SD26 LLC is still being formalized, per the email. Dinwiddie is the founder and sole member of SD26 LLC and DREAM Fan Shares LLC, an investment platform that was initially announced in September 2019, per the email.&nbsp;","Details of the SD26 offering are not yet available. “Concrete” information will be revealed in the “near future,” according to the email.&nbsp;","Tritaurian, for now, is asking interested investors to fill out a questionnaire, which includes details such as name, email and country of residence, as well as “Are you willing to sign an NDA prior to reviewing offering materials?”","It is not clear what terms the NDA includes. The Block has reached out to Tritaurian for further information and will update this story if we hear back.&nbsp;","Dinwiddie was initially looking to launch his <a href=\"https:\/\/www.theblockcrypto.com\/linked\/52682\/nbas-spencer-dinwiddie-set-to-roll-out-tokenized-investment-platform-next-monday\" data-v-f87c67ca=\"\">tokenized bond offering<\/a> on January 13. He wanted to sell 90 units of SD8 tokens. The scheme would have allowed him to instantly collect up to $13.5 million off of his $34 million guaranteed three-year contract. Token holders would have then received monthly payments in the next three years with a 4.95% base interest rate. But the NBA was not thrilled with Dinwiddie’s proposal, claiming that the tokenization platform would constitute a breach of the NBA players’ collective-bargaining agreement.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe SD8 offering did not take place at the time. An industry insider told The Block at the time that Dinwiddie had run into issues with the NBA and was forced to change the offering. The insider today told The Block that the NBA didn’t allow any fan-related perks for the new offering and that it will likely just be a simple bond offering.","It remains to be seen what the SD26 offering entails and how the NBA reacts when further details are announced."],"hashtag":[]}