{"summary":"The Bank of England is yet to draw any concrete conclusions on digital currency issuance, despite ramping up its exploratory efforts.\nIn its latest paper, the central bank mooted bank-like rules for stablecoins.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/107434\/uk-central-bank-digital-money-tread-carefully","publishDate":"2021-06-07T11:00:55","id":2935,"type":null,"title":"Bank of England continues to &#x27;tread carefully&#x27; with latest digital money treatise","category":["Central Banks"],"content":["Experts say the United Kingdom’s central bank is proceeding with caution as it continues to explore the potential ramifications of new forms of digital currency.","“The Bank of England is taking pains to tread carefully. But the more energy the Bank spends on this question, the more likely it is that we will see some form of a digital pound made reality,” said Richard Hay, U.K. head of fintech at Linklaters, the law firm.","Monday morning, the Bank of England published an <a href=\"https:\/\/www.bankofengland.co.uk\/paper\/2021\/new-forms-of-digital-money\" data-v-f87c67ca=\"\">in-depth discussion paper<\/a> encompassing topics ranging from the prospect of Central Bank Digital Currency (CBDC) to stablecoins. The paper poses a series of questions about the role and potential impact of such currencies, with readers invited to respond by September 7.","Sarah Coles, an analyst at the investment platform Hargreaves Lansdown, said the Bank is in “no hurry” to move into digital currencies, because “it needs to be sure that creating its own digital currency wouldn’t do more harm than good.”","Etay Katz, a partner at the law firm Ashurst, agreed that “it is right that there is a careful reflection before adding money substitutes or digital money schemes to the mainstream,” but warned that hesitation “will increase the risk of less thought through schemes gaining prominence with potential systemic perils.”","<strong data-v-f87c67ca=\"\">Further exploration<\/strong>","Within the paper, the Bank said it would <a href=\"https:\/\/markets.businessinsider.com\/currencies\/news\/britcoin-cbdc-digital-pound-under-exploration-bank-of-england-says-2021-6-1030499080\" data-v-f87c67ca=\"\">deepen its exploration<\/a> into whether to issue a digital version of the pound – a so-called Britcoin.","“A CBDC could play an important role in sustaining, and potentially expanding, retail access to central bank money,” the Bank stated in the paper. But a final decision remains some way off, it stressed, despite its recent efforts to <a href=\"https:\/\/www.theblockcrypto.com\/linked\/103424\/bank-of-england-hiring-cbdc-team\" data-v-f87c67ca=\"\">beef up<\/a> its CBDC expertise.","Another key takeaway from the paper was the action on stablecoins mooted by the Bank. The Bank acknowledged the potential for stablecoins – a form of digital currency pegged to the value of fiat currencies – “to become widely used as a means of retail payment.”","But it also stated that stablecoin payments should be regulated in <a href=\"https:\/\/www.reuters.com\/business\/finance\/boe-says-stablecoin-payments-need-same-regulation-banks-2021-06-07\/\" data-v-f87c67ca=\"\">the same way as bank payments<\/a> if that potential is realised.","“Further work will be required to consider the resolution arrangements for systemic stablecoins. And further work will also be needed on any changes to Financial Services Compensation Scheme protection, in discussion with other authorities and as part of any wider regulatory review,” the Bank stated."],"hashtag":[]}