{"summary":"Two law firms have filed a letter requesting to replace Roche Freedman as lead counsel in the Tether class action.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168170\/law-firms-seek-to-replace-roche-freedman-as-lead-counsel-in-tether-case","publishDate":"2022-09-06T17:33:30","id":2935,"type":null,"title":"Law firms seek to replace Roche Freedman as lead counsel in Tether case","category":["LEGAL"],"content":["Law firms Kirby McInerney and Radice are requesting that they replace embattled firm Roche Freedman as lead counsel in the Tether class action after a scandal involving Roche Freedman's founding partner engulfed the firm.","Kirby McInerney and Radice Law Firm represent plaintiffs Eric Young, Adam Kurtz and David Crystal, passive members of the class bringing the case. They claim Roche Freedman's continued status on the case \"will likely continue to be detrimental to Kirby-Radice Plaintiffs and the putative class.\" To mitigate those concerns, the firms sent a letter to the judge asking to replace Roche Freedman.","\"Unless Roche Freedman is removed as interim co-lead counsel, the inquiry into the adequacy of lead counsel’s representation in this and other litigations will prejudice the rights of the putative class,\"&nbsp; the letter said. \"To avoid a sideshow about the adequacy of counsel or the motives and use of litigation and discovery, a new leadership structure is necessary.\"","That new leadership structure would be Kirby and Radice, according to the letter, saying their appointment \"would provide guardrails against additional fallout from the recent disclosures relating to Roche Freedman and ensure that the putative class has adequate representation going forward.\"","Roche Freedman first brought the case to the U.S. District Court for the Southern District of New York in 2019, alleging Tether colluded with several other exchanges named in the complaint to manipulate crypto markets, harming traders. Scandal rocked the case in recent weeks when videos circulated of Kyle Roche, founding partner and lead on a number of the firm's class action cases, discussing his relationship to Avalanche blockchain developer Ava Labs. A blog post publishing the videos alleged Roche lodged cases on behalf of the firm, a claim <a href=\"https:\/\/medium.com\/@kyleroche\/my-response-b691563c255b\" data-v-f87c67ca=\"\">both<\/a> <a href=\"https:\/\/el33th4x0r.medium.com\/my-statement-about-the-crypto-leaks-lies-ef2005da752\" data-v-f87c67ca=\"\">parties<\/a> have vehemently denied.","In recent days, Kyle Roche began withdrawing from a number of the firm's class actions, and the firm says it has removed him from its class action group. Still, defendants in the Tether class action have <a href=\"https:\/\/www.theblock.co\/post\/167615\/poloniex-and-bittrex-join-tether-in-asking-court-to-terminate-roche-freedman-from-class-action?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">argued<\/a> that's not enough and called for the removal of the firm from the case.&nbsp;","Roche Freedman lodged a separate response today to the defendants' calls for its removal.&nbsp;&nbsp;","\"To be clear, while Mr. Roche’s statements were improper, defendants have failed to show<br data-v-f87c67ca=\"\">\nany evidence that the firm’s attorneys remaining on the case have done anything questionable,\" said the response. \"On this record, the reasonable inference is that defendants’ continued pursuit of disqualification is because they stand to benefit from it.\"","It has yet to formally respond to Kirby McInerney and Radice's letter.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Adam Kurtz","content":"PERSON"},{"type":"Roche Freedman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Kyle Roche","content":"PERSON"},{"type":"Radice Plaintiffs","content":"ORGANIZATION"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Radice","content":"ORGANIZATION"},{"type":"Eric Young","content":"PERSON"},{"type":"Kirby McInerney","content":"PERSON"},{"type":"David Crystal","content":"PERSON"},{"type":"Kirby","content":"PERSON"},{"type":"the Southern District of New York","content":"ORGANIZATION"},{"type":"Roche","content":"PERSON"}],"hashtag":["TETHER"],"authors":["Aislinn Keely","The Block"]}