{"summary":"The Arbitrum Foundation announced the integration of Celestia, the first modular data availability network, into its Orbit software stack.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/259460\/arbitrum-to-integrate-its-orbit-stack-with-celestia-for-data-availability","publishDate":"2023-10-25T12:30:03","id":2936,"type":null,"title":"Arbitrum to integrate its Orbit stack with Celestia for data availability","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">The <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Arbitrum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248386\/arbitrum-arb-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/photo_2023-03-29_21.47.00.jpeg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ARB<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -2.18%\n    <\/span><\/a> <!----><\/span><\/span> Foundation announced that Celestia is the first <\/span><span data-v-f87c67ca=\"\">modular<\/span> data availability network to be integrated into Arbitrum’s software stacks known as Orbit and Nitro.","The integration, to be finalized after Celestia's mainnet launch, will give developers the option to publish data to Celestia in addition to the existing Arbitrum One and Nova blockchains.","The move implies that Celestia's data availability proofs are slated to be incorporated into Arbitrum's current Layer 2 ecosystem, a leading Layer 2 scaling solution on Ethereum by total value locked that functions as a rollup solution designed to enhance the throughput and efficiency of Ethereum-based applications.","The integration with <a href=\"https:\/\/www.theblock.co\/post\/177841\/celestia-labs-hits-unicorn-status-in-latest-bet-on-modular-blockchains\" data-v-f87c67ca=\"\">Celestia<\/a>, a modular consensus and data network, aims to diversify developer tooling when it comes to reducing data costs for apps.","Recently, Celestia Labs introduced <a href=\"http:\/\/blog.celestia.org\/introducing-blobstream\/\" data-v-f87c67ca=\"\">Blobstream<\/a>, which has the ability to \"stream\" or expand Celestia's data availability layer to Ethereum, helping deliver the data throughput required for a large number of rollups without sacrificing security for end-users.","Data availability pertains to the capability of every network member to retrieve and confirm off-chain stored data in a secure manner. This becomes crucial as Layer 2 technologies often depend on rollups, or groups of transactions executed off-chain and then collectively uploaded to the mainnet as a single entry. For these rollups to be authenticated, it's essential that all participants in the network can reach the base transaction data.","The Arbitrum Foundation also indicated that Celestia's Blobstream will be deployed into Arbitrum-based Layer 2s for via the <a href=\"https:\/\/www.theblock.co\/post\/235980\/offchain-labs-unveils-tool-to-build-layer-3-orbit-chains-on-arbitrum\" data-v-f87c67ca=\"\">Orbit software stac<\/a>k.","\"We are delighted to welcome Celestia to the Arbitrum ecosystem and to make its technology available for Orbit chains,\" said Elias Abi Daoud, community lead at the Arbitrum Foundation. \"Given the permissionless nature of the Orbit tech stack, we are eager to see the expanding range of supported data availability options beyond Ethereum, and we anticipate the growth of a diverse network of developers leveraging this technology.\"","The integration of Celestia also marks the first external contribution to the Arbitrum Orbit protocol layer. Celestia is approaching the launch of its mainnet in the coming weeks. Furthermore, the Celestia Foundation recently announced an <a href=\"https:\/\/www.theblock.co\/post\/253024\/celestia-is-airdropping-60-million-tokens-in-bid-to-build-its-network\" data-v-f87c67ca=\"\">airdrop<\/a> of 60 million of its native token, named Tia, to 7,579 developers and over half a million on-chain addresses on Ethereum rollups, Cosmos Hub and Osmosis.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Celestia","content":"ORGANIZATION"},{"type":"Blobstream","content":"PERSON"},{"type":"Celestia Labs","content":"ORGANIZATION"},{"type":"Celestia","content":"LOCATION"},{"type":"Arbitrum Foundation","content":"ORGANIZATION"},{"type":"Cosmos Hub","content":"ORGANIZATION"},{"type":"Nitro","content":"ORGANIZATION"},{"type":"Elias Abi Daoud","content":"PERSON"},{"type":"-2.18%","content":"PERCENT"},{"type":"Arbitrum","content":"PERSON"},{"type":"Celestia Foundation","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["MODULAR"],"authors":["Vishal Chawla","The Block"]}