{"summary":"The Switzerland-headquartered crypto bank is expected to be licensed in Hong Kong to deal in securities, including crypto-related products, the company said today.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/247818\/crypto-bank-seba-obtains-approval-in-principle-in-hong-kong","publishDate":"2023-08-29T21:01:02","id":2938,"type":null,"title":"Crypto bank SEBA obtains approval-in-principle in Hong Kong for crypto-related services","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">SEBA Bank, a Switzerland-based cryptocurrency bank, has received an approval-in-principle from Hong Kong’s securities regulator, as the crypto-native bank continues to expand its presence in Asia.<\/span>","<span data-v-f87c67ca=\"\">SEBA said today in a statement shared with The Block that it has obtained the AIP for its license application that would allow it to deal in securities, including crypto-related products such as over-the-counter derivatives and structured products.<\/span>","<span data-v-f87c67ca=\"\">The crypto bank will also be able to advise on securities and virtual assets, and offer asset management for discretionary accounts in both traditional securities and virtual assets.<\/span>","<span data-v-f87c67ca=\"\">Amy Yu, SEBA’s chief executive officer for APAC, told The Block that the company sees enormous potential in Hong Kong and Singapore with strong demand from crypto firms for fully-fledged banking services.<\/span>","<span data-v-f87c67ca=\"\">“We see no issues in obtaining [a full official approval] by the end of this year,” said Yu, who joined SEBA in February 2023.<\/span>","<span data-v-f87c67ca=\"\">“By the time I started, it was very clear that Hong Kong regulators were super gung-ho. They want to make a big push, facilitate as much as they could, and welcome these businesses back into the jurisdiction,” she added.<\/span>","<span data-v-f87c67ca=\"\">In November last year, SEBA Bank <\/span><a href=\"https:\/\/www.theblock.co\/post\/190860\/crypto-bank-seba-opens-office-in-hong-kong-as-the-city-aims-to-reclaim-crypto-hub-status\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">expanded<\/span><\/a><span data-v-f87c67ca=\"\"> into Hong Kong with a new office just a month after Hong Kong authorities released a series of <\/span><a href=\"https:\/\/www.info.gov.hk\/gia\/general\/202210\/31\/P2022103000454.htm?fontSize=1\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">policy statements<\/span><\/a><span data-v-f87c67ca=\"\"> on cryptocurrencies, suggesting it would reopen to firms focused on digital assets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In December, Hong Kong’s Legislative Council <\/span><a href=\"https:\/\/www.theblock.co\/post\/193209\/hong-kong-amendment-vasp-licensing-regime\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">passed<\/span><\/a><span data-v-f87c67ca=\"\"> an amendment introducing a full licensing regime for crypto platforms to offer retail trading services.<\/span>","<span data-v-f87c67ca=\"\">SEBA’s Hong Kong subsidiary currently works primarily with its Zug-based parent company to offer services. “We work very closely with our Zug parent because [on the] initial stages right at license grant, the Hong Kong subsidiary is going to operate more like a like an introducing broker to start,” Yu said.<\/span>","<span data-v-f87c67ca=\"\">“We do have a lot of clients in Asia that are very interested in the banking piece of our offering,” Yu continued, adding that the company’s plan is to work more and more autonomy into the Asia businesses as much as possible. “This, I see, is going to be really important for localization and providing a better product to the Hong Kong market.”<\/span>","<a href=\"https:\/\/www.theblock.co\/linked\/50255\/crypto-bank-seba-expands-to-9-new-markets-including-singapore-and-hong-kong\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Hong Kong and Singapore markets<\/span><\/a><span data-v-f87c67ca=\"\"> are top priorities for SEBA in Asia, according to Yu.<\/span>","<span data-v-f87c67ca=\"\">“After Hong Kong, we'll continue exploring licensing processes in other jurisdictions such as Singapore, which has always been the plan to look at Hong Kong and Singapore first,” Yu said.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"AIP","content":"ORGANIZATION"},{"type":"SEBA","content":"ORGANIZATION"},{"type":"Switzerland","content":"LOCATION"},{"type":"Zug","content":"LOCATION"},{"type":"Amy Yu","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"APAC","content":"ORGANIZATION"},{"type":"February 2023","content":"DATE"},{"type":"December","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"November last year","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"SEBA Bank","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"}],"hashtag":["ASIAN REGULATION"],"authors":["Timmy Shen","The Block"]}