{"summary":"Whether you go by ‘football’ or ‘soccer’, there’s no doubt that we’ve all been captivated by the beautiful game on show in Qatar. For one month, the best","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195411\/how-security-tokens-can-spark-fan-owned-football-clubs","publishDate":"2022-12-15T10:17:22","id":2939,"type":null,"title":"How Security Tokens Can Spark Fan-Owned Football Clubs","category":["SPONSORED"],"content":["<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Whether you go by ‘football’ or ‘soccer’, there’s no doubt that we’ve all been captivated by the beautiful game on show in Qatar. For one month, the best players in the world are putting their club rivalries aside to push for national glory and win the Fifa World Cup.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Yet, despite the lack of game time, there is no shortage of drama, and big business, in club football at the moment. Specifically, news that Manchester United and Liverpool are up for sale has made waves amongst Premier League supporters, and beyond.&nbsp;&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Both clubs will have no shortage of suitors. But what if, instead of ownership being placed entirely in the hands of new billionaire owners, the fans got a piece of their beloved clubs?&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">For many Liverpool and Man United fans, football is less a game than it is a religion, complete with rituals, idols, and sacred chants. Come rain or shine, they’ll turn up to Anfield or Old Trafford to cheer their team to glory.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Many would likely relish the opportunity to own a piece of what could possibly be called the most important institution in their life. Not only would they have the potential to gain from the upside of their club's financial success, but also they would have a rare opportunity to put their money where their passions are by investing in something they believe in.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<b data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\">You’re a Real Shareholder Now: The Advantage of Security Tokens<\/span><\/b><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">A regulated security token offering is a unique way clubs could make their dreams a reality, giving fans an opportunity to own a piece of their club and giving clubs a superior tool for engaging fans.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Fan-owned sports teams are nothing new. A chief example is the Green Bay Packers, the American football team that has been a fan-owned organization for its entire life. Winners of four Super Bowls, the Packers, are owned by half a million fans and maintain a non-profit structure. However, being a stockholder of the Green Bay Packers is vastly different from being a shareholder of Apple or any other publicly traded company. For one, there is no readily available secondary market for Packers’ shares. Shareholders are not eligible to earn dividends from the club. Stockholders do have voting rights, can attend the annual shareholder meeting, and buy exclusive merchandise, but that is it as far as their privileges go.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<b data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\">Fan Engagement is Already A Multibillion Dollar Industry<\/span><\/b><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">While the Packers have been a fan-owned club for over a century, the last decade has seen an incredible surge in fan engagement across the world of sports. Thanks to the proliferation of mobile devices, social media, VR, blockchain, and other breakthrough technologies, clubs have a wealth of opportunities at their disposal to engage with fans. According to Research on <\/span><a href=\"https:\/\/www.researchandmarkets.com\/reports\/5317968\/sports-technology-market-forecasts-from-2021-to?utm_source=GNOM&amp;utm_medium=PressRelease&amp;utm_code=tt6g3b&amp;utm_campaign=1535415+-+%2458%2b+Billion+Worldwide+Sports+Technology+Industry+to+2026+-+by+Type%2c+Sport+and+Geography&amp;utm_exec=jamu273prd\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">Markets.com<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\">, the sports technology industry is projected to reach $59 billion by 2026, the bulk of which is dedicated to enhancing fan engagement.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Fan engagement efforts have already made their way to the blockchain. In a <\/span><a href=\"https:\/\/www.hypesportsinnovation.com\/about-us\/\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">research<\/span><\/a><a href=\"https:\/\/www.hypesportsinnovation.com\/about-us\/\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\"> report<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\"> put out by Hype Sports Innovation, a sports tech ecosystem, one of the most critical pain points facing sports brands is how to capitalize on Web3 technologies like blockchain to engage their audience. Many sports clubs have turned to fan tokens as an answer.&nbsp; Arsenal Football Club, for example, released a fan token in August 2021, the market capitalization of which is close to $7 million today. Classified by the club as a ‘utility token,’ the AFC token gives holders the right to vote in polls and enjoy both digital and real-life perks reserved for holders only.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">While fan tokens are useful tools for engaging a club’s supporters, they stop short of offering anything close to real ownership such as the opportunity to receive dividends. That’s where a security token comes in.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<b data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\">Security Tokens Combine The Best of Both Fan Tokens and Equities<\/span><\/b><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">A security token is a novel financial instrument combining the advantages of both blockchain and traditional finance. It offers all the protections given to holders of regular stock, such as dividends and voting rights, that are not legally available to cryptocurrency holders. Blockchain-based transparency and programmability open new avenues for fan engagement through security tokens, such as holders-only zones and airdropped digital collectibles. While launching a security token has tremendous advantages, there is also a challenge in finding providers that have both the licenses and the technology to enable secondary market trading of the token. Companies like <\/span><a href=\"https:\/\/www.inx.co\/raise\/?utm_source=Theblock&amp;utm_medium=article&amp;utm_campaign=How+Security+Tokens+Can+Spark+Fan-Owned+Football+Clubs\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">INX<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\">, which offer both primary issuance services as well as an end-to-end regulated platform for secondary market trading, could be crucial to the successful launch of tokenized fan ownership of sports clubs.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Fan tokens shine at creating an engaged, enthusiastic fan base and ordinary stock could optimize financial equity in a club. A security token represents a beautiful marriage between the two and could spell the future of club sports.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<em data-v-f87c67ca=\"\">This post is commissioned by INX and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2026","content":"DATE"},{"type":"Multibillion Dollar Industry","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Liverpool","content":"ORGANIZATION"},{"type":"Man United","content":"ORGANIZATION"},{"type":"August 2021","content":"DATE"},{"type":"$7 million","content":"MONEY"},{"type":"Packers","content":"ORGANIZATION"},{"type":"Arsenal Football Club","content":"ORGANIZATION"},{"type":"Manchester United","content":"ORGANIZATION"},{"type":"Fifa","content":"ORGANIZATION"},{"type":"Anfield","content":"ORGANIZATION"},{"type":"INX","content":"ORGANIZATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Green Bay Packers","content":"ORGANIZATION"},{"type":"$59 billion","content":"MONEY"},{"type":"Hype Sports Innovation","content":"ORGANIZATION"},{"type":"Fan Tokens and Equities","content":"ORGANIZATION"},{"type":"Qatar","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}