{"summary":"The Securities Commission of Malaysia has ordered Binance to disable its website and mobile apps in the country.\nA Binance spokesperson told The Block: “We are aware of the notice from SC and can confirm that Binance.com does not operate out of Malaysia.”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/113076\/malaysia-binance-disable-crypto-exchange-website-mobile-apps","publishDate":"2021-07-30T07:55:10","id":2941,"type":null,"title":"Malaysian regulator orders Binance to disable its website and mobile apps","category":["Exchanges"],"content":["The Securities Commission (SC) of Malaysia has ordered crypto exchange Binance to disable its website and mobile apps in the country.","Announcing an enforcement action on Friday, <a href=\"https:\/\/www.sc.com.my\/resources\/media\/media-release\/sc-takes-enforcement-actions-on-binance-for-illegally-operating-in-malaysia\" data-v-f87c67ca=\"\">the SC said<\/a> Binance is operating illegally in Malaysia despite being included in an investor alert list in July 2020. The SC has, therefore, issued a public reprimand against Binance Holdings Limited, its CEO Changpeng \"CZ\" Zhao, and three other entities — \"Binance Digital Limited (Registered in the UK), Binance UAB (Registered in Lithuania), and Binance Asia Services Pte Ltd (Registered in Singapore).\"","All the four entities have been ordered by the SC to disable the Binance website —&nbsp;www.binance.com&nbsp;— and its mobile applications in Malaysia within 14 business days from July 26. The regulator said Zhao has been specifically ordered to ensure that the directive is carried out.","When reached for comment, a Binance spokesperson told The Block: \"We are aware of the notice from SC and can confirm that&nbsp;Binance.com&nbsp;does not operate out of Malaysia.\"","It is unclear whether that comment means Binance.com will continue to be accessible in Malaysia despite the SC's order. The spokesperson declined to comment further.","Binance issued a similar comment when the U.K.’s Financial Conduct Authority (FCA) <a href=\"https:\/\/www.theblockcrypto.com\/post\/109766\/uk-fca-bans-crypto-exchange-binance\" data-v-f87c67ca=\"\">ordered<\/a> Binance Markets Limited (BML) — Binance's UK entity — to stop undertaking any regulated activity in the country last month. The FCA's order, however, did not impact&nbsp;Binance.com's offerings because BML does not operate the website. The FCA only has jurisdiction over BML and not any of the other Binance entities, <a href=\"https:\/\/www.theblockcrypto.com\/daily\/109841\/uk-fca-binance-ban-derivatives-spot-trading\" data-v-f87c67ca=\"\">as The Block reported at the time<\/a>.","The Malaysian regulator has also ordered the four Binance entities and Zhao to immediately cease all media and marketing activities to Malaysian investors and also immediately restrict Malaysian investors from accessing Binance’s Telegram group.","\"Investors are advised to stop dealing with and investing through illegal DAX [Digital Asset Exchange]. Those who currently have accounts with Binance are strongly urged to immediately cease trading through its platforms and to withdraw all their investments immediately,\" said the regulator.","Malaysia <a href=\"https:\/\/www.theblockcrypto.com\/post\/111482\/italy-binance-consob-warning\" data-v-f87c67ca=\"\">joins the list<\/a> of global regulators that have recently issued warnings or taken actions against Binance, including those from the U.S., the U.K., Italy, Japan, Thailand, Poland, and the Cayman Islands.","Amid regulatory crackdowns, Binance recently <a href=\"https:\/\/www.theblockcrypto.com\/post\/111661\/binance-ceases-stock-tokens-trading\" data-v-f87c67ca=\"\">ceased<\/a> its stock tokens trading offering. Earlier today, the exchange also <a href=\"https:\/\/www.theblockcrypto.com\/post\/113068\/binance-crypto-derivatives-trading-europe-shut-down\" data-v-f87c67ca=\"\">shut down<\/a> its crypto derivatives trading offering in three European countries — Germany, Italy, and the Netherlands. Binance further said that it has plans to wind down the offering across the European region in the future."],"hashtag":["BINANCE"]}