{"summary":"After some accusations on Sunday, the Waves community are reckoning with a controversial proposal and an unpegged stablecoin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/140475\/drama-erupts-around-the-waves-blockchain-project-and-trading-firm-alameda","publishDate":"2022-04-04T12:26:37","id":2950,"type":null,"title":"Drama erupts around the Waves blockchain project and trading firm Alameda","category":["LAYER 1S"],"content":["Over the weekend, a spat broke out between Sasha Ivanov, founder of the Waves blockchain, and trading firm Alameda Research.&nbsp;","Ivanov is alleging underhand dealings, while Alameda seems to imply that it’s simply been taking advantage of high funding rates to make some money. But irrespective of what actually happened, the dispute has led to a controversial proposal within the Waves blockchain community —&nbsp;one designed to hurt Alameda but that could also have a big impact on anyone who trades the project’s native token.","At the same time, a stablecoin that’s supposed to be pegged to the WAVES token has lost its peg — provoking further concerns that things are amiss in the Waves community.","The outcry began when Ivanov accused Alameda of manipulating the price of WAVES.","Ivanov claimed that Alameda borrowed funds on Vires Finance protocol to short WAVES and further accused the firm of trying to campaign against the token in order to encourage other traders to sell it, boosting the supposed short position.","The proof? Ivanov <a href=\"https:\/\/twitter.com\/sasha35625\/status\/1510589978073604103\" data-v-f87c67ca=\"\">claimed<\/a> he found an <a href=\"https:\/\/wavesexplorer.com\/address\/3PHkZUJpS3AfmnXBNLCBmpqL25GJZb1hGiE\/tx\" data-v-f87c67ca=\"\">address<\/a> on the Waves blockchain he linked to Alameda that had borrowed over $30 million in WAVES. He reckoned the funds were being used to short the token.","FTX CEO Sam Bankman-Fried —&nbsp;who founded Alameda in 2017 and was its CEO until October 2021 — <a href=\"https:\/\/twitter.com\/SBF_FTX\/status\/1510685533705547783\" data-v-f87c67ca=\"\">denied the accusations<\/a>, calling them a conspiracy theory.","We have reached out to Waves and Alameda and will update this article should we hear back.","While Alameda didn’t particularly weigh into the discussion, it did reveal one clue that may explain what was going on.","“People should really look at funding rates for WAVES right now,” tweeted Alameda co-CEO Sam Trabucco.","Funding rates are the amount of money that’s paid out to traders who are taking long or short positions using what's called a \"perpetual\" or perp. This is a crypto derivatives product that trades the value of certain underlying cryptocurrencies without an expiry date. FTX offers perpetual trading of various cryptocurrencies including WAVES. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIn perp trading, if majority of participants are going long, then they pay a small amount of their open trades to those who are going short. When it happens, funding rates can climb and provide a potential source of money for those shorting the token. This mechanism is used to keep the price of the perpetual token in line with the spot price.","In this specific case, the funding rates were negative. So it’s possible that Alameda had taken a long position in order to take advantage of the high negative rates. Yet a common strategy here is to hedge that position by selling the token on the spot market. If Alameda was doing that, it would have enabled them to collect the yield from the funding rates, while minimizing risk.","“So if you long perp, short spot, you collect the yield\/funding,” explained Larry Cermak, VP of research at The Block.","Regardless of what was going on, a <a href=\"https:\/\/forum.vires.finance\/t\/set-waves-usdn-eurn-liquidation-threshold-to-1-max-borrow-apr-for-all-assets-to-400\/128\" data-v-f87c67ca=\"\">new proposal<\/a> has been made in the Waves community —&nbsp;supported by Ivanov — that takes aim at Alameda.","The proposal asks for the community to vote on a liquidation rate of 0.1% for all those who borrowed WAVES and USDN — an algorithmic stablecoin known as Neutrino USD that’s backed by the WAVES token — on Vires Finance, the largest lending protocol on the Waves blockchain. This would target Alameda’s funds, according to Ivanov’s investigation.","If it passes, it’s likely that Alameda would have to buy 650,000 WAVES ($30 million) to maintain its position, per estimates by The Block Research.","In Ivanov's eyes, the proposal is enough to liquidate everyone shorting WAVES. The very small liquidation rate of 0.1% will force short-sellers to unwind their trades. With the proposed threshold, anyone that has taken a loan on Vires will have their positions closed immediately as soon as the price of WAVES moves slightly.","“Let's protect the waves ecosystem from greed,” Ivanov <a href=\"https:\/\/twitter.com\/sasha35625\/status\/1510617725705629698\" data-v-f87c67ca=\"\">commented<\/a> on the proposal, referring to Alameda’s alleged short trade on WAVES.","But soon the proposal became the subject of criticism — mostly from the blockchain’s own users. From the community forum, many <a href=\"https:\/\/forum.vires.finance\/t\/set-waves-usdn-eurn-liquidation-threshold-to-1-max-borrow-apr-for-all-assets-to-400\/128\" data-v-f87c67ca=\"\">pointed out<\/a> that, if passed, the proposal will be detrimental for users of Vires Finance who will face the brunt of liquidations.","“This is a terrible proposal. Just because we don’t like that a party took a big short position doesn’t mean we should change the protocol to target them back,” <a href=\"https:\/\/forum.vires.finance\/t\/set-waves-usdn-eurn-liquidation-threshold-to-1-max-borrow-apr-for-all-assets-to-400\/128\/6\" data-v-f87c67ca=\"\">said<\/a> one community member.","“This proposal goes against the ethos of DeFi, is incredibly petty and is detrimental to the long term credible neutrality of Vires,” <a href=\"https:\/\/forum.vires.finance\/t\/set-waves-usdn-eurn-liquidation-threshold-to-1-max-borrow-apr-for-all-assets-to-400\/128\/8\" data-v-f87c67ca=\"\">said<\/a> another.","<a href=\"https:\/\/vires.finance\/governance\/vote\/HuYgPQV5s5L8KoWnTAUZ43YjuBJ28nUsypnv9s6LdExF\" data-v-f87c67ca=\"\">Voting<\/a> on the proposal begins on April 5 and will last five days.","To make matters worse, the USDN token has lost its peg to the US dollar.&nbsp;","USDN started losing its dollar peg around 5.30 PM UTC on April 3, before crashing substantially on April 4, just before noon UTC time. At its lowest point, it fell to just 82 cents.","Part of the reason behind this appears to be a change made two weeks ago that means only traders who have large staked positions of NSBT — Neutrino's governance token — can make direct swaps between WAVES and USDN. This means that only a few entities are able to swap large amounts of tokens between them directly, without using liquidity on exchanges.","The other key element appears to be uncertainty over the recent proposal that has divided the Waves community.&nbsp;","When asked why the token has lost its peg on Twitter, Ivanov replied, “Bad [fear, uncertainty and doubt]. someone will make a lot of money off of it. and it's not us, of course.”","In the meantime, the stablecoin has recovered somewhat — up to $0.87 — but it’s not out of the woods yet.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2017","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"weekend","content":"DATE"},{"type":"0.1%","content":"PERCENT"},{"type":"October 2021","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"82 cents","content":"MONEY"},{"type":"April 3","content":"DATE"},{"type":"April 4","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"April 5","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"USDN","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$30 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Vires","content":"LOCATION"},{"type":"Sasha Ivanov","content":"PERSON"},{"type":"Alameda","content":"LOCATION"},{"type":"NSBT — Neutrino","content":"ORGANIZATION"},{"type":"Alameda","content":"PERSON"},{"type":"Larry Cermak","content":"PERSON"},{"type":"Ivanov","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"$0.87","content":"MONEY"},{"type":"Neutrino USD","content":"ORGANIZATION"},{"type":"Vires Finance","content":"ORGANIZATION"},{"type":"Sam Trabucco","content":"PERSON"}],"hashtag":[],"authors":["Vishal Chawla","Tim Copeland","The Block"]}