{"summary":"Seashell has emerged from stealth to offer up to 10% interest rates to users.\nSeashell founder Daryl Hok told The Block that the firm will use DeFi protocols and off-chain lending to generate high yields.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/130164\/seashell-investment-app-crypto-defi-seed-funding-mark-cuban","publishDate":"2022-01-13T09:15:00","id":2952,"type":null,"title":"Mark Cuban and Robinhood&#x27;s CEO join Seashell&#x27;s $6 million raise","category":["Venture Capital"],"content":["Seashell, a startup building an investment app to offer high yields, has raised $6 million in a seed funding round.","Khosla Ventures and Kindred Ventures co-led the round, with Coinbase Ventures, Solana Ventures, and the Avalanche Foundation (through its <a href=\"https:\/\/www.theblockcrypto.com\/linked\/122729\/avalanche-launches-fresh-200-million-incentive-fund\" data-v-f87c67ca=\"\">Blizzard Fund<\/a>) also participating.","Individual investors, including billionaire <a href=\"https:\/\/www.theblockcrypto.com\/post\/108313\/mark-cuban-defi-could-be-the-next-great-growth-engine-for-the-us\" data-v-f87c67ca=\"\">Mark Cuban<\/a>, Robinhood CEO Vlad Tenev, former CFTC chairman Christopher Giancarlo, entrepreneur Elad Gil, Terraform Labs founder Do Kwon, and Polygon co-founder Sandeep Nailwal also backed the round.","Seashell has emerged from stealth with its seed funding announcement. With fresh capital in hand, the firm plans to launch its investment app in the first half of this year, its founder and CEO, Daryl Hok, told The Block. Hok was a chief operating officer at blockchain audit firm CertiK until last August and now remains its advisor.","Hok said he founded Seashell to provide the easiest on-ramp for users to generate high yields, especially when inflation is rising and bank interest rates are below 1%. The US consumer price inflation hit 7% last month, the highest since 1982.","Seashell promises to offer up to 10% yields. All users have to do is connect their bank accounts and transfer money to the Seashell app, said Hok.","Hok said users' fiat money will be converted into stablecoins via \"a licensed custodian,\" and those stablecoins will then be deposited into <a href=\"https:\/\/www.theblockcrypto.com\/category\/defi\" data-v-f87c67ca=\"\">decentralized finance (DeFi)<\/a> protocols to generate high yields.","\"We're building a multichain solution to be able to deposit stablecoins into the high yielding yet trustworthy protocols,\" said Hok. \"The intention is to diversify among various high yielding protocols across major blockchains.\"","Seashell will also explore off-chain lending to generate high yields, said Hok, meaning it will lend money to market makers in the crypto space.","While Seashell aims to offer higher yields than bank deposits, any money parked with the firm will not be protected by the Federal Deposit Insurance Corporation.","Hok declined to share which custodian Seashell will partner with to convert users' fiat money into stablecoins because business terms are still being negotiated. But he said the partner would have appropriate licenses to conduct business across all 50 US states.","Seashell will initially operate in the US, but it is also exploring international options, said Hok.","There are currently more than 15 people working for Seashell, and Hok expects the team size to double or triple this year. To that end, Hok said more funds could be raised as soon as during the first half of this year."],"hashtag":[]}