{"summary":"If a snapshot poll passes, Uniswap will deploy on the Ethereum scaling solution Arbitrum.\nThe poll is overwhelmingly in favor of the deployment and the Uniswap team has already started preparing for it.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/106277\/uniswap-likely-to-expand-to-ethereum-scaling-solution-arbitrum","publishDate":"2021-05-27T10:14:17","id":2954,"type":null,"title":"Uniswap likely to expand to Ethereum scaling solution Arbitrum","category":["DEX"],"content":["The team behind the decentralized exchange (DEX) Uniswap is preparing to deploy the exchange on the upcoming <a href=\"https:\/\/www.theblockcrypto.com\/daily\/50449\/a-look-at-the-geographical-distribution-of-bitcoin-and-ethereum-listening-nodes\" data-v-f87c67ca=\"\">Ethereum<\/a> scaling solution Arbitrum. The deployment will go ahead as long as a <a href=\"https:\/\/snapshot.org\/#\/uniswap\/proposal\/Qmehop1NNWP9VEf7tGLEAYRphVsXtdxkL7oKEhaXL2Xao6\" data-v-f87c67ca=\"\">snapshot vote<\/a> passes, one that is showing overwhelming support in favor of the expansion.","Uniswap is the biggest DEX on <a href=\"https:\/\/www.theblockcrypto.com\/linked\/1430\/forbes-to-publish-stories-on-the-ethereum-blockchain\" data-v-f87c67ca=\"\">Ethereum<\/a> and the second biggest across all blockchains, according to <a href=\"https:\/\/www.theblockcrypto.com\/data\/decentralized-finance\/dex-non-custodial\" data-v-f87c67ca=\"\">The Block’s Data Dashboard<\/a>. But since it runs on <a href=\"https:\/\/www.theblockcrypto.com\/linked\/2942\/bbva-syndicates-a-150-million-loan-on-ethereum-blockchain\" data-v-f87c67ca=\"\">Ethereum<\/a>, it is often plagued by high transaction fees for swapping tokens. Right now a swap will set you back about $13, but these costs have skyrocketed to up to $200 at times.","Enter Arbitrum, a second layer scaling solution that’s built on top of <a href=\"https:\/\/www.theblockcrypto.com\/linked\/2172\/ethereum-co-founders-bold-bet-on-better-blockchains-nearly-ready-to-bust-out\" data-v-f87c67ca=\"\">Ethereum<\/a> and promises to handle many more transactions with much cheaper fees. It uses optimistic rollups, a technology <a href=\"https:\/\/vitalik.ca\/general\/2021\/01\/05\/rollup.html\" data-v-f87c67ca=\"\">praised<\/a> by Ethereum co-founder Vitalik Buterin, in order to scale. It works by processing transactions on a sidechain and then regularly settling them in batches to the main <a href=\"https:\/\/www.theblockcrypto.com\/daily\/61031\/ethereums-next-decade-vitalik-buterin-discusses-the-high-priority-work-to-come-for-eth-1-x-and-2-0-teams\" data-v-f87c67ca=\"\">Ethereum<\/a> blockchain.","Arbitrum is set to launch this Friday, with help from blockchain developer platform Alchemy, which plans to help more developers integrate the scaling solution into their applications. So far, more than 150 projects have requested early access to the scaling solution, according to <a href=\"https:\/\/www.coindesk.com\/ethereum-scaler-arbitrum-is-launching-friday-with-developer-support-from-alchemy\" data-v-f87c67ca=\"\">CoinDesk<\/a>.&nbsp;","Voting for the deployment is taking place through an off-chain snapshot poll that ends Friday. Anyone can vote on the poll with tokens they have delegated to themselves, or tokens that have been delegated to them. Voting is done through signing a message in MetaMask rather than making an on-chain transaction. So far, 41.43 million UNI tokens have been used to vote in favor of the proposal, with just 204 UNI tokens voting against.","“Assuming the snapshot passes we intend to support the community by deploying the v3 smart contracts to Arbitrum! We have already begun work on interface support and planning the deployment,” <a href=\"https:\/\/twitter.com\/haydenzadams\/status\/1397675095708086273\" data-v-f87c67ca=\"\">tweeted<\/a> Uniswap founder Hayden Adams.","If Uniswap deploys on Arbitrum, it will provide a way for DEX users to swap <a href=\"https:\/\/www.theblockcrypto.com\/daily\/7591\/ethereum-cofounder-joe-lubin-joins-board-of-crypto-exchange-erisx\" data-v-f87c67ca=\"\">Ethereum<\/a>-based tokens at a much lower cost. This will help <a href=\"https:\/\/www.theblockcrypto.com\/linked\/11559\/enterprise-ethereum-alliance-announces-token-task-force\" data-v-f87c67ca=\"\">Ethereum<\/a> stay competitive against high-throughput blockchains, such as Binance Smart Chain, which have seen volumes increase in recent months, as well as sidechains like Polygon.","Uniswap was <a href=\"https:\/\/www.theblockcrypto.com\/post\/99100\/uniswap-v3-capital-efficiency-details-dex-ethereum\" data-v-f87c67ca=\"\">expected to launch<\/a> this month on Optimism, a rival scaling solution that also uses optimistic rollups but with <a href=\"https:\/\/threadreaderapp.com\/thread\/1395812308451004419.html\" data-v-f87c67ca=\"\">a few differences<\/a> in technical implementation. In March, however, Optimism <a href=\"https:\/\/www.theblockcrypto.com\/post\/99511\/ethereum-scaling-solution-optimism-delays-mainnet-launch-estimates-july\" data-v-f87c67ca=\"\">delayed<\/a> its mainnet launch until July. So, since Arbitrum is launching so much earlier, Uniswap's deployment there will help it maintain market share. The exchange plans to <a href=\"https:\/\/twitter.com\/haydenzadams\/status\/1397675096601419778\" data-v-f87c67ca=\"\">later deploy<\/a> on Optimism when it's live.","Uniswap has an on-chain governance system that lets token holders decide how the protocol is developed. This upgrade, however, looks set to pass without a formal governance vote — something that came <a href=\"https:\/\/twitter.com\/iamDCinvestor\/status\/1397677118587379715\" data-v-f87c67ca=\"\">as a surprise<\/a> to some in the community.","The Uniswap team explained that upgrades happen in <a href=\"https:\/\/twitter.com\/haydenzadams\/status\/1397680766390353920\" data-v-f87c67ca=\"\">one of two ways<\/a>. Either the on-chain governance system proposes and votes for a change to the protocol, or the team deploys the upgrade with sufficient support from the community. In theory, the team <a href=\"https:\/\/twitter.com\/teo_leibowitz\/status\/1397682194290728960\" data-v-f87c67ca=\"\">could also deploy<\/a> anyway, according to the license, if it thought it was in the best interests of the community. These options are shown in the diagram below.","","","Adams said that this specific proposal “had overwhelmingly massive support. We decided to deploy ourselves. As the Licensor we don't need a license.” That’s in contrast to when an on-chain governance vote happens, which <a href=\"https:\/\/twitter.com\/haydenzadams\/status\/1397696385713983489\" data-v-f87c67ca=\"\">enables the community<\/a> to grant additional uses of the core code, rather than the core team."],"hashtag":["ETHEREUM","OPTIMISM","UNISWAP"]}