{"summary":"The new designation flies in the face of multiple lawsuits saying that OFAC cannot legally sanction the decentralized mixer.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/184320\/new-treasury-sanctions-link-tornado-cash-to-north-koreas-nuclear-weapons-program","publishDate":"2022-11-08T15:00:56","id":2957,"type":null,"title":"New Treasury sanctions link Tornado Cash to North Korea&#x27;s nuclear weapons program","category":["POLICY"],"content":["Despite industry pushback, the U.S. Treasury is not giving an inch in the fight over its sanctions on Tornado Cash.&nbsp;","The Treasury's Office of Foreign Asset Control has in fact added a designation to the Ethereum-based crypto mixer. In addition to the original August sanctions under an executive order on cybercrime, OFAC is now designating Tornado Cash under an order on North Korea's nuclear proliferation.&nbsp;","\"<span class=\"fontstyle0\" data-v-f87c67ca=\"\">This action is part of the United States’ ongoing efforts to limit the DPRK’s ability to advance its unlawful weapons of mass destruction (WMD) and ballistic missile programs,<\/span>\" the announcement said, noting that the re-designation \"includes <span class=\"fontstyle0\" data-v-f87c67ca=\"\">an additional basis for the designation of Tornado Cash regarding its support for DPRK activities.<\/span>\"","The announcement effectively entrenches OFAC's treatment of Tornado Cash as a threat to national security.&nbsp;","The double designation also flies in the face of <a href=\"https:\/\/www.theblock.co\/post\/168502\/backed-by-coinbase-employees-sue-treasury-to-roll-back-tornado-cash-sanctions\" data-v-f87c67ca=\"\">multiple lawsuits<\/a> from the crypto industry and advocates aiming to roll back the original sanctions. Those suits argue that Tornado Cash, as a decentralized smart contract, cannot be an \"entity\" as the terms of OFAC's sanctioning authority lay out. OFAC \"exceeded their statutory authority because Tornado Cash is used to complete functions that do not include 'any property in which any foreign country or a national thereof has any interest,'\" the <a href=\"https:\/\/www.theblock.co\/post\/176701\/coin-center-sues-treasury-over-tornado-cash-sanctions\" data-v-f87c67ca=\"\">nonprofit Coin Center argued<\/a> in their case.&nbsp;","A new FAQ from OFAC addresses this argument quite directly. \"OFAC designated the entity known as Tornado Cash, which is a 'partnership, association, joint venture, corporation, group, subgroup, or other organization' that may be designated pursuant to IEEPA,\" the office wrote in its latest guidance.&nbsp;","\"Nothing they've announced changes our strategy in this lawsuit,\" said Peter van Valkenburgh, Coin Center's director of research, in a <a href=\"https:\/\/twitter.com\/valkenburgh\/status\/1590091036441051137?s=46&amp;t=ngD5iOg11g2bik30TC26Cg\" data-v-f87c67ca=\"\">tweet<\/a> following the announcement. \"These developments underscore the arbitrary and capricious nature of Treasury's actions and their continued misunderstanding of the technology.\"","In March of this year, an exploit saw bad actors get away with almost $600 million from Ronin, an Ethereum sidechain that Axie Infinity ran on. OFAC <a href=\"https:\/\/www.theblock.co\/linked\/141985\/us-government-connects-north-korean-hacking-group-with-last-months-600-million-ronin-exploit\" data-v-f87c67ca=\"\">linked the hack to North Korea<\/a> only weeks later.&nbsp;","<em data-v-f87c67ca=\"\">Updated 6:00 PM EST: This story has been updated to include a statement from Coin Center's Peter van Valkenburgh on their case against OFAC's original sanctions on Tornado Cash.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Axie Infinity","content":"ORGANIZATION"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"DPRK","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"North Korea","content":"LOCATION"},{"type":"Coin Center","content":"ORGANIZATION"},{"type":"$600 million","content":"MONEY"},{"type":"Peter van Valkenburgh","content":"PERSON"},{"type":"Ronin","content":"LOCATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"March of this year","content":"DATE"},{"type":"OFAC","content":"ORGANIZATION"},{"type":"Treasury's Office of Foreign Asset Control","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"August","content":"DATE"}],"hashtag":["ANTI-MONEY LAUNDERING","SANCTIONS"],"authors":["Kollen Post","The Block"]}