{"summary":"Binance has signed an agreement with the Dubai World Trade Centre authority.\nThe exchange will help the authority to develop crypto regulations.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/128253\/binance-dubai-world-trade-centre-crypto-regulatory-framework","publishDate":"2021-12-21T09:07:54","id":2958,"type":null,"title":"Binance to help Dubai WTC establish a crypto regulatory framework","category":["Exchanges"],"content":["Crypto exchange Binance announced Tuesday that it has signed a memorandum of understanding with the Dubai World Trade Centre authority to help it establish a crypto regulatory framework.","Binance said it will share its experience in collaborating with global regulators with the authority to aid the development of \"progressive\" crypto regulations.","\"The goal is to assist crypto exchanges, businesses that offer blockchain and Distributed Ledger Technology (DLT) services, and a wide range of digital currencies and assets to become licensed in Dubai,\" said Binance.","The Dubai Media Office <a href=\"https:\/\/twitter.com\/DXBMediaOffice\/status\/1472894544203206659\" data-v-f87c67ca=\"\">announced<\/a> yesterday that the Dubai World Trade Centre is set to become a crypto regulator in the United Arab Emirates (UAE). The centre will set up crypto regulations to deal with anti-money laundering standards and track cross-border transactions.","Binance's partnership with the centre comes amid reports that the exchange is planning to set up headquarters in the UAE. Binance has <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2021-12-16\/binance-in-talks-with-dubai-abu-dhabi-on-headquarters-plan\" data-v-f87c67ca=\"\">reportedly<\/a> been in talks with officials from special economic zones Abu Dhabi Global Market (ADGM), Dubai International Financial Centre (DIFC), and Dubai Multi Commodities Centre in that regard.","The exchange has also hired former senior officials at the economic zones — <a href=\"https:\/\/www.linkedin.com\/in\/mark-mcginness-418837144\/\" data-v-f87c67ca=\"\">Mark McGinness<\/a> from Dubai Financial Services Authority, which regulates DIFC, and <a href=\"https:\/\/www.linkedin.com\/in\/matt-gamble-78534016\/\" data-v-f87c67ca=\"\">Matt Gamble<\/a> from ADGM — in recent months.","Binance CEO Changpeng \"CZ\" Zhao also recently bought his <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2021-11-19\/binance-chief-zhao-buys-his-first-home-in-pro-crypto-dubai\" data-v-f87c67ca=\"\">first home in Dubai<\/a>. \"The government there is very progressive, and it's a very good business environment,\" Zhao said in a media interview.","Zhao has hinted at various locations for Binance's headquarters in recent months, including <a href=\"https:\/\/www.theblockcrypto.com\/linked\/124039\/binance-france\" data-v-f87c67ca=\"\">France and Ireland<\/a>.","Founded in China in 2017, Binance is the largest crypto exchange in the world, without a head office. Instead, the exchange has incorporated firms in several locations worldwide, making it difficult for regulators to establish jurisdictions over the company.","Binance has faced probes and consumer warnings in several countries, including the U.S., U.K., Japan, Singapore, Germany, and Italy."],"hashtag":["BINANCE"]}