{"summary":"FalconX, the crypto prime broker, resumed its use of Silvergate’s payment network after pressing pause on the partnership last week.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/188972\/falconx-resumes-use-of-silvergates-payment-network","publishDate":"2022-11-21T21:47:07","id":2958,"type":null,"title":"FalconX resumes use of Silvergate’s payment network","category":["CRYPTO INFRASTRUCTURE"],"content":["FalconX, the crypto prime broker, resumed use of Silvergate’s payment network after pressing pause on the partnership last week.","“Due to the heightened risk environment and Silvergate’s wire payment network outage (Finastra outage update), FalconX updated fiat transfer instructions for clients and paused settlements to\/from our Silvergate account,” a FalconX spokesperson told The Block.","“This aligns with our standard process to pause and reassess operations in these scenarios. We completed this process and are reopening settlement to\/from our Silvergate account.”","On Nov. 18, FalconX told clients it had <a href=\"https:\/\/www.theblock.co\/post\/188373\/crypto-prime-broker-falconx-will-no-longer-use-silvergates-sen-network\" data-v-f87c67ca=\"\">stopped using<\/a> Silvergate Exchange Network (SEN) until further notice, citing “an abundance of caution” due to turbulent crypto market conditions.","Silvergate shares plunged in the aftermath of the news. The company disclosed exposure to collapsed crypto exchange FTX, in the form of deposits, earlier in the month. Silvergate’s CEO Alan Lane clarified, however, that the company had “no outstanding loans to, nor investments, in FTX, and FTX is not a custodian for Silvergate's bitcoin-collateralized SEN Leverage loans.”","SEN, a key driver of the bank’s growth, allows its clients to make payments in U.S. dollars and euros 24 hours a day.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nov. 18","content":"DATE"},{"type":"Silvergate","content":"ORGANIZATION"},{"type":"Alan Lane","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["PAYMENTS","TRADFI BANKS"],"authors":["Ryan Weeks","The Block"]}