{"summary":"The New York Attorney General has filed documents alleging Bitfinex and Tether have ties to New York State\nFilings include evidence showing Bitfinex continued to serve New York traders, four years after they claimed to have stopped","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/30429\/latest-filings-from-nyoag-allege-bitfinex-and-tether-continued-some-new-york-operations-as-late-as-january-2019","publishDate":"2019-07-08T22:10:50","id":2959,"type":null,"title":"Latest filings from NYOAG allege Bitfinex and Tether continued New York operations as late as January 2019","category":["Exchanges"],"content":["New court filings from the New York Attorney General’s Office (NYOAG) allege iFinex, parent company of Bitfinex and Tether, falls under its jurisdiction due to extensive New York dealings, including allegedly allowing New York users despite the explicit ban. Bitfinex previously argued it does not do business with New York customers and as a result should not be required to comply with the NYOAG’s investigative demands.","The NYOAG first filed this action in April, alleging in part that the exchange covered up an $850 million loss by co-mingling funds from its sister company Tether and had failed to comply with pre-suit document and information demands under New York’s Martin Act.","Since then, the NYOAG has been embroiled in a legal battle with the exchange. The outcome of the current dispute hinges on whether Bitfinex and Tether have operations in New York. If the Court concludes there are no ties, and no previous ties over what the court deems a reasonable amount of time, the investigative demands would be thrown out.","The filings allege Bitfinex and Tether have multiple ties to the state, mainly by indicating Bitfinex provided services to New York residents after they said they would cease serving New York traders in 2015. The NYOAG offered IP logs of New York users as evidence.","\"The OAG has obtained additional evidence that the Bitfinex trading platform has been available to New York-based traders as late as 2019,\" the filings read in part. The office also offered to show the Court sensitive documents about its investigation in private so as not to prejudice ongoing investigative efforts, citing a 1976 case involving an investigation undertaken by the New York State Organized Crime Task Force as precedent.","They elaborate that Bitfinex respondents communicated with New York-based traders about their activity on the platform and placement of funds with Crypto Capital as late as January 2019.","In addition to this, other exchanges in the state trade with Tether, including those with BitLicenses, the state’s gold standard of regulation from the New York Department of Financial Services. The OAG pointed to Poloniex and Bittrex as exchanges utilizing the iFinex coin. Bitfinex, on the other hand, <a href=\"https:\/\/support.bitfinex.com\/hc\/en-us\/articles\/213919649-What-is-the-BitLicense-\" data-v-f87c67ca=\"\">never acquired a BitLicense<\/a>.","\"Tethers are traded on the virtual currency trading platform Bittrex, which was open to New York traders until April 2019, when its operator was directed to cease operations in New York by the New York Department of Financial Services,\" the filing states.","Bitfinex claimed its first victory against the NYOAG when Hon. Joel M. Cohen of the New York Supreme Court granted a motion for a partial stay of document demands, limiting the scope of documents the NYOAG could pursue, last month. The exchange argued it could not be investigated with the powers of the Martin Act, which empowers the NYOAG in anti-fraud investigations since the exchange does not conduct business in the state. Bitfinex said at the time of the decision that it felt encouraged."],"hashtag":[]}