{"summary":"Some Democrats bucked their committee leadership to voice support for the bill, which would still be subject to change during and after Wednesday&#x27;s committee debate.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241508\/democrats-oppose-crypto-market-overhaul-but-stablecoin-deal-possible","publishDate":"2023-07-26T11:57:01","id":2959,"type":null,"title":"Landmark crypto market overhaul bill advances past first committee","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">Senior members of the House of Representatives suggested that a deal to create a comprehensive framework in the U.S. around stablecoins could be close.&nbsp;<\/span>","And late on Wednesday the House Financial Services Committee advanced legislation to significantly alter the U.S. regulatory approach to crypto markets by a bipartisan vote, 35-15. The bill drew staunch opposition from several senior Democrats on the panel, but Republicans were joined by six Democrats report the bill out favorably, a procedural step towards consideration before while House of Representatives.&nbsp;","The House Agriculture Committee, which also has jurisdiction over the proposal, will hold a similar debate and amendment process over its portions of the legislation on Thursday. The Financial Services Committee will debate the stablecoin legislation, which it has sole jurisdiction over, on Thursday as well.","Democrats who supported the legislation successfully made small tweaks in the committee process, while amendments offered by those opposed to the underlying bill were defeated.","Despite entreaties over the last several months from House Republicans, most Democrats on the committee found arguments for the markets bill unconvincing.","<span data-v-f87c67ca=\"\">“I am disappointed that Republicans have made the decision to move forward with a massive market structure bill to rewrite our nation’s investor protection acts,” said Rep. Maxine Waters, the top Democrat on the House Financial Services Committee that debated the bill on Wednesday.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Waters and House Financial Services Committee Chair Patrick McHenry, R-N.C., were optimistic that ongoing last-minute negotiations could yield more agreement on stablecoins legislation paired with the market bill and due up for a similar committee vote on Thursday.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“There is goodwill and much hard work by the Republican staff on the Financial Services Committee, and the Democrat staff on the Financial Services Committee, in coordination with Treasury conversations,” said McHenry.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Democratic opposition complicates a path for the market bill to become law this Congress, as Democrats narrowly control the Senate. President Joe Biden is less likely to sign a bill into law if most members of his party oppose it.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Waters notably said that SEC Chair Gary Gensler should have more input in the legislation, due to his current role and previous position as Commodity Futures Trading Commission chair. She wants SEC staff to provide more technical input to the complex bill.<\/span>","<span data-v-f87c67ca=\"\">House Republican members and staff of the committee say they wanted more “<\/span><a href=\"https:\/\/www.theblock.co\/post\/240548\/republicans-want-productive-engagement-from-gensler-on-crypto-bills\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">productive engagement” from Gensler<\/span><\/a><span data-v-f87c67ca=\"\"> as well, but did not receive a full response when they <\/span><a href=\"https:\/\/www.theblock.co\/post\/240688\/sec-said-to-be-slow-walking-assistance-requested-for-us-crypto-market-bill\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">asked for technical assistance weeks ago<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","Several Democrats also invoked Sam Bankman-Fried, his push last year to shift more crypto regulation to the CFTC, and the collapse of FTX in opposing the bill.&nbsp;","<span data-v-f87c67ca=\"\">Six Democrats bucked Waters to support the bill though, a number Republicans and industry bill supporters will try to grow during tomorrow's Agriculture Committee markup and a likely floor vote to build momentum for the bill in the Senate, where a Democratic majority and several outspoken crypto skeptics await. <br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">“I am confident that this legislation, while not perfect, makes the status quo better,” said Rep. Jim Himes, D-Conn. Himes cited the lack of clarity over whether regulators have a consistent view of ether, the second-largest cryptocurrency by market capitalization, and the recent split decision in the Securities and Exchange Commission’s case against Ripple over XRP as cause for the bill. “I’m a deep skeptic of this industry but we deserve better than the status quo,” continued Himes.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Himes added that House Financial Services Committee Chair Patrick McHenry, R-N.C., agreed to every change to the bill that the Connecticut Democrat requested.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In a last-minute bid to gain more Democratic votes on the crypto market bill, House Republicans added $120 million in funding to the Commodity Futures Trading Commission for additional resources to oversee spot markets for digital assets, like bitcoin, that would fall under the commodities regulator’s jurisdiction if the bill were to become law, though the funding in the bill is redirected from the SEC in order to keep the bill deficit-neutral, which some Democrats objected to.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In an exchange with Himes, McHenry casually offered to raise the funding level to $150 million over three years, though that change was not formally made in the committee debate. In theory, the bill would shift more responsibility over digital asset markets to the CFTC, not only because the agency would be given more authority over spot markets for digital assets like bitcoin that are already treated as commodities, but regulators would also be directed to provide clear thresholds for when a network token could be considered decentralized enough to move from being treated as a security to a commodity, with lighter disclosure requirements.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The market structure bill went through an unusual cooperative drafting process between the House Financial Services and Agriculture Committees due to each committee holding jurisdiction over one of the agencies and asset classes involved.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Rep. David Scott, D-Ga., who sits on the Financial Services Committee but is the top Democrat on the House Agriculture Committee, previewed how a similar debate and vote is likely to proceed in that committee tomorrow.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“This is not just a bad bill, it’s a cruel bill, it’s a deceptive bill,” said Scott.&nbsp;<\/span>","But despite criticism from Scott and other Democrats, the bill still advanced past the committee on Wednesday evening. Another bill to exempt developers and blockchain-related service providers from the broker definition included in 2021's bipartisan infrastructure law also advanced out of the committee during the same session, but on a party-line vote.","<span data-v-f87c67ca=\"\">The House Agriculture Committee will vote on the market bill on Thursday, while the Financial Services Committee is expected to debate and vote on stablecoins legislation at approximately the same time. <br data-v-f87c67ca=\"\">\n<\/span>","<em data-v-f87c67ca=\"\">UPDATE: With committee vote results, next steps, and additional details from Wednesday's committee session. <\/em>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Maxine Waters","content":"PERSON"},{"type":"House Financial Services and Agriculture Committees","content":"ORGANIZATION"},{"type":"Financial Services Committee","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"House of Representatives","content":"ORGANIZATION"},{"type":"Scott","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"House Financial Services Committee Chair Patrick McHenry","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"Joe Biden","content":"PERSON"},{"type":"Ga.","content":"LOCATION"},{"type":"Agriculture Committee","content":"ORGANIZATION"},{"type":"Connecticut","content":"LOCATION"},{"type":"the Financial Services Committee","content":"ORGANIZATION"},{"type":"David Scott","content":"PERSON"},{"type":"Conn","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"House Agriculture Committee","content":"ORGANIZATION"},{"type":"Himes","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"15","content":"DATE"},{"type":"evening","content":"TIME"},{"type":"House","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"$120 million","content":"MONEY"},{"type":"Jim Himes","content":"PERSON"},{"type":"$150 million","content":"MONEY"},{"type":"McHenry","content":"PERSON"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":["CFTC","CONGRESS","FTX","GARY GENSLER","HOUSE AGRICULTURE COMMITTEE","HOUSE FINANCIAL SERVICES COMMITTEE","MAXINE WATERS","PATRICK MCHENRY","SAM BANKMAN-FRIED","SEC","TREASURY DEPARTMENT"],"authors":["Colin Wilhelm","The Block"]}