{"summary":"Crypto exchange FTX’s US platform has gone live\nFTX CEO Sam Bankman-Fried told The Block that the new exchange has “tons of liquidity” to offer, among other features \nFTX.US would directly compete with exchanges such as Binance.US, Coinbase and Kraken ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/66157\/ftx-us-goes-live-ceo-says-the-crypto-exchange-has-tons-of-liquidity-to-offer","publishDate":"2020-05-22T07:00:17","id":2960,"type":null,"title":"FTX.US goes live, CEO says the crypto exchange has &#x27;tons of liquidity&#x27; to offer","category":["Exchanges"],"content":["Crypto exchange FTX has launched a new trading platform for U.S. users, almost a month after first revealing the news.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nFTX.US <a href=\"https:\/\/help.ftx.us\/hc\/en-us\/sections\/360007423873-About-Us\" data-v-f87c67ca=\"\">offers<\/a> spot trading in six coins - bitcoin (BTC), ether (ETH), bitcoin cash (BCH), litecoin (LTC), Paxos gold (PAXG) token and Tether (USDT) stablecoin.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe new platform has “a lot to offer,” including 10 times leverage, “tons of liquidity,” and competitive fees, FTX founder and CEO Sam Bankman-Fried told The Block.","\"We have a history of providing market-leading liquidity--from some of the industry's top market makers to the most liquid futures order books. Because of this FTX.US has had industry-leading order-books from day one,\" according to <a href=\"https:\/\/help.ftx.us\/hc\/en-us\/sections\/360007423873-About-Us\" data-v-f87c67ca=\"\">information<\/a> on the FTX.US website.","It is worth noting that FTX.US has<a href=\"https:\/\/twitter.com\/SBF_Alameda\/status\/1263699826534825984\" data-v-f87c67ca=\"\"> separate order books<\/a> from the main FTX exchange. Market makers for both the exchanges are overlapping, though the U.S. platform can have local market makers as well, Bankman-Fried told The Block.","Looking ahead, FTX.US plans to launch more features. These include support for more coins, mobile apps (scheduled to launch in the coming week), and an over-the-counter (OTC) trading support, which is expected to be integrated in the near future, Sam Bankman-Fried told The Block.","“I think U.S. crypto customers have been under-served for a while, and I'm excited to try to push the industry forward,” he added.","FTX is known to <a href=\"https:\/\/www.theblockcrypto.com\/daily\/56519\/crypto-derivatives-exchange-ftx-15-million-1-billion\" data-v-f87c67ca=\"\">grow faster<\/a> and grab the market share of leading exchanges, such as BitMEX, in the derivatives market. It remains to be seen whether FTX.US follows similar traction against rivals such as Binance.US, Coinbase, Kraken, and Gemini, among others.","FTX.US serves almost all states, <a href=\"https:\/\/help.ftx.us\/hc\/en-us\/articles\/360043578573-Terms-of-Service\" data-v-f87c67ca=\"\">excluding<\/a> New York and Washington. Binance.US, on the other hand, has over 10 <a href=\"https:\/\/www.binance.us\/en\/terms-of-use\" data-v-f87c67ca=\"\">restricted states<\/a>, even after nine months of its launch.&nbsp;","In separate news, FTX has also <a href=\"https:\/\/blog.coinbase.com\/coinbase-custody-international-selected-by-ftx-to-be-primary-custodian-48d76de5dce3\" data-v-f87c67ca=\"\">selected<\/a> Coinbase Custody International as its primary custodian partner. It means Coinbase Custody will be storing FTX’s native token FTT.","As a result, “large” FTT transfers on the blockchain are to be observed over the coming days. Bankman-Fried told The Block that the transfer value will “likely be in 8 figures.”"],"hashtag":["FTX","SAM BANKMAN-FRIED"]}