{"summary":"Cboe announced a partnership with CoinRoutes that would give the firm exclusive rights over its RealPrice benchmark\nThe deal could lead to the creation of indexes next year\nThe data’s elements could lay the foundation for an ETF","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/87936\/cboe-data-deal-crypto-market-products","publishDate":"2020-12-15T16:00:19","id":2963,"type":null,"title":"Cboe&#x27;s latest data deal lays the foundation for a wide range of new crypto market products","category":["Startups"],"content":["Derivatives exchange operator Cboe Global Markets is preparing to launch crypto indexes after inking a partnership with trading software firm CoinRoutes.&nbsp;","The partnership provides Cboe with exclusive rights over the CoinRoutes RealPrice Best-Bid-Offer (BBO), which offers real-time crypto price data aggregated across several trading venues.&nbsp;Cboe plans to use the data to launch indexes tied to the digital asset market at the beginning of 2021, according to Catherine Clay, its senior vice president and head of information solutions.","Cboe would be the latest firm to announce interest in launching crypto data products. S&amp;P Global recently announced <a href=\"https:\/\/www.theblockcrypto.com\/linked\/86498\/sp-dow-jones-indices-lukka\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a deal with crypto data services provider Lukka<\/a> on its own indexes, which are set to launch next year.&nbsp;","Indeed, the entrance of traditional financial services firms could help mature digital asset market data, which is known for its fragmentation and dislocations. Clay said CoinRoutes data is unique in the market given it is used to execute trades at what could be argued is the best possible price.&nbsp;","\"It is a hard-to-replicate data set,\" she said. \"It is an executive data point versus a theoretical data point — exactly the type of transparent and action data that informs trading decisions in different asset classes.\"","As for the roadmap, Clay said that the data would initially be used by clients to aid in portfolio development and other pre-trade processes. In the future, Cboe could see those indexes utilized for various types of trading or structured products.&nbsp;","\"I do see this as a very large revenue opportunity for us, but equally as important it helps bring more participants into the digital asset ecosystem,\" she said. \"That raises the level of legitimacy and comfort in this space.\"","To be sure, this wouldn't be Cboe's first attempt at taking a crack at crypto. <a href=\"https:\/\/www.theblockcrypto.com\/linked\/15937\/cboe-halts-bitcoin-futures-considering-conceding-market-to-cme\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Cboe stopped listing bitcoin futures in March 2019<\/a> after it failed to compete head-to-head with crosstown rival CME Group. Attempts to launch several bitcoin exchange-traded products were stymied by opposition within the U.S. Securities and Exchange Commission.&nbsp;","Cboe's partnership with CoinRoutes could possibly open the door to such a product in the future, according to CoinRoutes CEO Dave Weisberger.&nbsp;","He said the data address a number of concerns previously outlined by the agency, including a level of transparency that \"wouldn't be unparalleled and should be a game-changer for regulators.\"","\"First, RealPrice is much less susceptible to manipulation than Bitcoin indexes. That is due to the fact that weighting is not arbitrary, but rather based on the actual executable order book,\" Weisberger said.&nbsp;Previous ETF proposals were based on indexes that were not usable for execution purposes.","\"Second, with access to all of our cross-market data, Cboe would be able to flag strange divergences in price across markets,\" he continued, referring to the SEC's concerns about market manipulation that could impact trading in a product available to retail clients.&nbsp;","Still, it wouldn't address several other issues regulators have expressed about a bitcoin ETF, including custody concerns and exchange breaches.&nbsp;"],"hashtag":[]}