{"summary":"Although they didn’t materially increase their hash rate last month, five North American firms mined nearly 60% more bitcoin in July.\nThey largely owe that to China, whose policy maneuver led to the shutdown of their Chinese rivals.","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/113861\/american-public-bitcoin-miner-btc-july-china","publishDate":"2021-08-10T21:53:26","id":2966,"type":null,"title":"Five North American firms mined 58% more bitcoin in July thanks to China","category":["Mining"],"content":["Five publicly listed North American bitcoin mining firms have churned out a total of 1,802 bitcoin in July – on average 58% more than what they did in June.","Marathon Digital, Riot Blockchain, Argo Blockchain, Bitfarm and Hut8 have all been through a significantly productive month in July even though they did not materially increase their hashing power, according to each miner's July production updates released until Tuesday.","That was largely due to the fact that the bitcoin network witnessed the <a href=\"https:\/\/www.theblockcrypto.com\/post\/110425\/bitcoin-largest-difficulty-drop-ever\" data-v-f87c67ca=\"\">biggest<\/a> bitcoin mining difficulty drop ever last month after China issued shutdown orders to local bitcoin mining operations in June. As a result, the market shares of both non-Chinese bitcoin <a href=\"https:\/\/www.theblockcrypto.com\/daily\/113852\/bitcoin-mining-pool-market-share\" data-v-f87c67ca=\"\">mining pools<\/a> and mining operations outside China have increased significantly.","Although it's expected that every bitcoin mining operation outside China that was not disrupted would enjoy a <a href=\"https:\/\/www.theblockcrypto.com\/post\/110062\/bitcoins-hash-rate-has-fallen-50-from-its-peak-in-may\" data-v-f87c67ca=\"\">bigger share<\/a> of bitcoin mining's daily cake, the updates from the five publicly-listed firms offer a look into how much exactly they have benefitted from the shutdown of their Chinese rivals.","The table below breaks down their monthly mined bitcoin based on financial disclosures and their month-over-month growth.","Nasdaq-listed Marathon and Riot Blockchain have recorded a growth of over 50% among the five even though they barely expanded their mining fleet in July compared to the operations in June.","As of July 30, Marathon had about 19,000 units of the newest generation of bitcoin ASIC miners – the same with what it had as of June 30. Riot also said that due to its infrastructure upgrade, the installation of its recently received hardware has extended into August.","\"Due predominantly to favorable changes in the global hash rate, July proved to be an immensely productive month for our mining operations,” Marathon's CEO Fred Thiel said in a statement.&nbsp;","In a similar note, Peter Wall, CEO of London-listed Argo, attributed the July growth to his firm being \"able to capitalize on the reduction in global hash rate and mining difficulty.\" Argo's mining fleet is based in its facilities in Canada and it's applying to be listed on Nasdaq as well.","Canada-listed Bitfarm, on the other hand, noted that the recent macroeconomic events in China have positioned itself to \"accumulate more bitcoin on its balance sheet than previously anticipated.\"&nbsp;","But not every U.S.-listed bitcoin mining firm has made the most out of China's policy change.","<a href=\"https:\/\/www.theblockcrypto.com\/post\/109190\/bit-mining-bitcoin-miners-kazakhstan\" data-v-f87c67ca=\"\">BIT Mining<\/a>, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/111462\/bit-digital-14500-bitcoin-miners-us-china-crackdown\" data-v-f87c67ca=\"\">BIT Digital<\/a> and <a href=\"https:\/\/www.theblockcrypto.com\/linked\/113492\/bitcoin-miner-the9-kazakhstan\" data-v-f87c67ca=\"\">The9 City<\/a>, which previously had mining operations inside China, have been materially affected and are on track of shipping out the machines to regions like Kazahkstan, Russia, and the U.S."],"hashtag":[]}