{"summary":"Yoni Assia has been in the bitcoin world since 2012 and his firm eToro has offered a platform for crypto trading for several years but if you&#x27;re a listener in the U.S. you might not have ever heard of his firm which actually has a $1 billion-plus evaluation. In this episode of The Scoop, Yoni outlined his vision for eToro in the U.S., how the firm has traditionally expanded globally and the plan for its new cryptocurrency exchange eToroX.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/34412\/yoni-assia-etoro","publishDate":"2019-08-01T16:00:51","id":2967,"type":null,"title":"A Conversation with Yoni Assia, CEO of eToro","category":["PODCASTS"],"content":["<em data-v-f87c67ca=\"\">The following transcript is taken from The Scoop, The Block's podcast. Listen below and subscribe to The Scoop on <a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Apple<\/a>, <a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Spotify<\/a>, <a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Google Play<\/a>, <a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\">Stitcher<\/a>, or wherever you listen to podcasts. Email feedback to <a href=\"\/cdn-cgi\/l\/email-protection#53233c373032202713273b36313f3c303830212a23273c7d303c3e\" data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"c2b2ada6a1a3b1b682b6aaa7a0aeada1a9a1b0bbb2b6adeca1adaf\">[email&nbsp;protected]<\/span><\/a>.<\/em>","<a href=\"https:\/\/twitter.com\/yoniassia?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\" data-v-f87c67ca=\"\">Yoni Assia's<\/a> Toro has offered a platform for crypto trading for several years but if you're a listener in the U.S. you might not have ever heard of his firm which actually has a $1 billion plus evaluation. The Israeli based company which is popular across Europe has just expanded into the U.S. and it's preparing to go head to head with the likes of Robinhood and Coinbase. Yoni is hoping big marketing dollars and the social network elements of eToro's platform will help it out compete U.S. giants. In this episode of The Scoop Yoni outlined his vision for eToro in the U.S., how the firm has traditionally expanded globally and the plan for it's new cryptocurrency exchange eToroX.","<iframe src=\"https:\/\/playlist.megaphone.fm?e=BLOCK1677071772\" width=\"100%\" height=\"200\" frameborder=\"0\" scrolling=\"no\" data-v-f87c67ca=\"\"><\/iframe>","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Ladies and gentlemen thank you so much for tuning into The Scoop. We are joined by a very special guest, all the way in from Israel. It's Yoni, I'm going to say the last name, hopefully correct: Assia","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> That's close enough. That's close enough.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> He's the CEO of eToro. You might not have heard of it. If you're a US based listener but eToro is a massive multimillion person exchange now, broker for crypto currencies and other equities that's based out of Israel and has a large presence in the United Kingdom. We're excited to have him on because they recently have expanded into the US. We're going to talk a little bit about that, we're going to talk a little bit about how their platform is actually different from those like Robinhood and Coinbase as a kind of playing into a social element engaging their users in different ways outside of just strictly trading. Yonni thanks so much for joining us and Ryan as always thank you for joining us -- my co-host. You look beautiful today.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Thanks Frank.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> Thank you very much and thank you for having me. And thank you for coming with a tie. Thank you for coming with a tie for this special podcast.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> He wakes up in a tie.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Exactly, I wake up in this, I roll out of bed. I came out the womb in a tie.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> So I'll start by by briefly just presenting eToro. So we started eToro in 2007 with the vision of opening the global markets for everyone to trade and invest in a simple and transparent way. I started trading when I was actually 13 and since then have been super passionate about capital markets so I love capital markets. I love sort of trading in stocks, I love how I could be a kid in high school trading in the markets putting in an order and seeing that order is suddenly sort of hitting the Nasdaq and everybody's sort of connected all around the world. And what we've built in eToro today's considered the largest social trading network in the world, we have over 11 million users from more than one hundred and forty different countries who trade stocks, commodities, indices, currencies and cryptocurrencies within a social network which basically means every person who funds an account, regulated a brokerage account with eToro automatically publishes their trading activity and their month to month performance and asset allocation with everybody in the network. So when you join eToro you can actually see hundreds of thousands of active traders, their performance and we invented basically a patented technology called copy trading which enables you as a user to copy the top traders on the platform so you see someone who generated 30% gains every year for the past four years you basically select a thousand dollars and copy him that copies his entire portfolio to your portfolio and every time he trades it trades automatically in your account at the same time in the same price. So that's very quickly eToro today we've been very active in Europe which is our biggest market Europe and the UK -- now you need to separate between those and we started expanding more and more into Asia. We have offices, there's about 750 people in the company, offices in Shanghai, Hong Kong, Australia, UK...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> And it's a billion dollar plus valued company.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> Yes.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Yeah. Congratulations.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> Thank you very much.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So tell us a little bit about the expansion in the US, What does that look like? Is it going to be the same type of offering as what folks are used to in Israel or the UK? Or will there be some modifications?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> So we launched here in the US about three months ago. We're seeing a significant growth here in the US so we're super excited about it. Our offices are here in Hoboken New Jersey. We're currently open in 42 states offering crypto trading in 14 of the top cryptocurrencies within the same social network. So when you open any eToro account here in the US first you receive a hundred thousand virtual dollars to basically demo the platform -- that's the same for people all around the world. You can trade those 14 cryptocurrencies and then you can also invest in our copy portfolios, so other than being able to copy other people you can also invest in our copy portfolios, again here in the US it's still crypto only. We plan to launch stock trading also at the beginning of next year. Basically expanding the offerings so you can trade both stocks and crypto assets on the same platform, the same as you can do with eToro overseas. And that's about it.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> I mean you're entering a market that's, 2 very flooded marketplaces: cryptocurrency exchanges being one and fintech brokers being another with Robinhood clearly leading the pack. We saw this morning or maybe last night Business Insider reported that Swell went out of business. There's Wealthfront there's Betterment. Every other day there's a new offering that's launch or expanding...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> I think in general when you think about sort of the space on a macro level. It's still exploding. We started in 2007. Most people told me first of all you can't launch a financial services company out of Israel. Second, that targeting an audience of millennials doesn't make sense because they don't have money. But if you look at today's analysis I just saw this from CB Insights so I might be misquoting but I think they're talking about Millennials growing from a 2 trillion dollar sort of wealth to about 25 trillion dollars in wealth in 2030. There is a lot of research showing that older generations will be passing about one trillion dollars a year to millennials for the next 30 years. So the opportunity is massive and the opportunity is very simple. There is a generational transformation of wealth moving from our parents and our grandparents to our generation. And if you would look or examine how our parents and grandparents are managing their financials you would basically say, that's not how I'm going to do it. Now crypto is an interesting part of it because crypto in our view is a generational asset class but if you think about the Wealthfronts robo-advisors of the world they're not into crypto, right? So that's something completely separate so there is one generational transformation of wealth which is product and technology driven. We will manage our financials, our wealth in a very different way than our parents did and we're looking for how are we going to do that? And if you are a customer of one of the large banks you'd figure out quite quickly they're not going to provide you the products that meet your user expectations. The second part is the crypto revolution and there is just a great correlation of that same target audience who are interested in investing in generational crypto assets or assets and doing that with a different user experience, so the user experience in eToro is mobile first, has social elements into it, everything is real time. My father's view of a product or user experience is getting a PDF once a month.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So that's interesting. Well well clearly I think the point you're making is, to be successful with this younger demographic as a broker or even more broadly as a wealth management or trading platform or tool you need to have crypto there because it's something that's so different and so attractive to that demographic. If you look at someone like Robinhood then how do you view your firm's value prop up against theirs? Because what's interesting to me is you guys are coming at it from a, how do we make this more like Facebook meets trading or a social network meets trading whereas their approach is how can I make trading more like shopping on Amazon? Which is something [...] has said to me directly. Do you see that difference or is it something else?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> I think first of all you know we started building sort of our audience overseas. So eToro was a multi-asset trading platform where we can trade stocks from 15 different exchanges as well as currencies, commodities, indices and crypto assets within the crypto part of our offering. We have the trading platform which enables you to sort of fit on-ramp and off-ramp and trade crypto assets. We also have the wallet which enables you to basically transfer the assets from our trading platform into wallet which enables you to send and receive assets so some of the brokers in the space enable you to trade crypto assets but you don't necessarily own them. Our wallet is a multi blockchain on-chain multi-asset wallet. So it is on-chain, you can actually see the keys, you can actually see the assets that you own on the wallet on blockchain explorers and you can send\/receive to anyone you want -- it's a multi-sig wallet. Then we also launched earlier this year eToroX which is our crypto asset exchange. That's something more similar to other cryptocurrency exchanges where you can actually deposit in crypto and withdraw in crypto. We're just now adding fiat as well into that. And what's quite unique there is we launched a set of twelve stable coins so we actually launched an eToroX, EuroX, PoundX, GenX, RubleX, GoldX, SIlverX and we're creating those markets so only on eToroX can you trade Bitcoin to gold, bitcoin to Silver, bitcoin to euro, dollar, pound etc. So again that's coming from our background within the financial services industry which is quite deep and connecting to sort of the biggest banks in the world from a liquidity point of view and connecting to our expertise within the crypto industry.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So a wide range of products which folks can trade being one of those value props and it is pretty striking that the number of stable coins that are supported on the platform. Let's focus in a little bit on eToroX, the new exchange that's launched. Where before were you routing orders to as a broker?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> We're connected so that was also a big part of sort of the reasoning of the exchange. So we're connected to 15 of the largest OTC as well as exchanges in the world and what we've built in eToro is what you call an order book aggregator. So we're connected to 15 different exchanges. We take all of their order books and we create our own liquidity order book. So potentially if you hit on eToro let's say one million dollars of bitcoin you're gonna get the price from us. So you're going to get exactly the price quoted right now on the screen from us on the platform.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Aggregated across 15 exchanges.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> And what we'll do in the backend, we have an order book that's aggregated across 15 exchanges and then it will go with those million dollars and basically split them -- 50K to that exchange 50 to that exchange 50 to that exchange 100 to that exchange based basically on what's called best bid [...] aggregation.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Do you layer over the fee on top of that?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> Yeah.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So it's included in when I [...] to make a bid?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> So there are no fees in eToro whatsoever, there's only a spread and that spread basically bakes in the costs that we incur to trade in the market. So to actually trade large quantities of crypto only eToro we are probably one of the cheapest places in the world to do that unless you're super sophisticated and have your own aggregated order book across 15 exchanges. We haven't launched that in the US but in Europe we provide people to deposit funds via credit cards and debit cards and we don't charge anything for that which means we're by far for an instant gratification purchase of bitcoin which we see quite a lot, we're by far the cheapest way to buy bitcoin in the world. So what we did with eToroX, we took that feed of the exchanges that we had, we basically embedded that into the product. So we created an exchange of our own which then we're connecting to all of the other exchanges and sort of feeding into the exchange. So despite the fact that it's relatively a very new launch, if you go and look at the order books on eToro we are gonna see five million dollars.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Is it a virtual order book or is there a matching engine?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> There is a matching engine and real orders that basically, both, us as a market maker as well as other market makers are basically placing orders to basically set the books.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Does this engine work the same for the equity side of the business? and how does that differ?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> So from a forward looking point of view our vision is all assets are gonna get tokenized so we are great believers in the tokenization of assets. And again we're connected to 15 at least liquidity providers in the non-crypto world to trade things like currencies and commodities and indices and swaps and equities across multiple exchanges. That world is completely broken like severely broken, we just had to move a book of like 50 million stocks from one place to another. It took us three weeks to figure out what's going on there like you're waiting to see something on the screen calling people over the phone. I was surprised that we weren't asked to fax stuff. So our view is ownership is going to become digital and native on the blockchain, financial institutions are gonna work on blockchain -- it's not clear yet which blockchain. But from a paradigm point of view we believe that if we start building it eventually our technology sort of will be ready for that evolution. And again we talked about a generational transformation of wealth from a user point of view. We talked about crypto assets as a generational asset class. And then there is another thing which is the transformation of technology of moving one hundred and forty trillion dollars which is a fucking big number into the blockchain and I believe and maybe I am optimistic. So it's not 10 years maybe it's 20 years, everything is going to be based on something like blockchain public ledgers that when I transfer something, my trade execution, my settlement and my clearing are all into one because the way it works today is the same way that happened when my grandfather built his [...] in the 60s, daily reconciliation.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> And so you plan to prepare for that and build the infrastructure?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> Our view is, we'll tokenize as many assets as possible and it's by the way mostly around sort of reg tech, regulation, how you structure it. But our view is we offer today commodities, currencies, ETF's, stocks but that's only on eToro. We're gonna tokenize within the process of the next couple years, we're going to tokenize all of those assets, we're gonna add them to eToroX so you'll be able on eToroX to trade stocks, commodities, indices et cetera and the liquidity generating pricing in eToro will be based only eToroX tokenized assets exchange.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Is that the benefit of having your own internal order book?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> Yea","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Okay that's pretty interesting.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> It's creating pricing formation transparency that's at a much higher level than sort of traditional brokerages and also enables us to access a new type of audience which is more of the professional crypto traders and professional traders which we've seen a lot of them come to eToro but the focus on eToro has always been simplicity. So the values of eToro as a company are around simplicity, innovation and sort of ease of use and then that's sometime in conflict to sort of more professional traders who want sort of the tick by tick data, the API's, co-location services, order book matching, to be efficient, arbitrage etc.. We've built basically a venue to more of the crypto hardcore traders.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> So I guess to that point there's been lots of stories about Robinhood with their payment order flow, selling that data to like the Virtu's of the world and [...] Securities those types of shops. Do you guys partake in that as well have interest in doing that?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> So we are basically a clearing broker in equities in Europe which basically means we don't need to necessarily engage in that. The structure of capital markets is very different across different regulations, here in the US we probably, we won't start as a clearing broker we will probably clear through a partner here in the US because that's how the market is structured here. And again we're regulated soon in the US in equities, now in the US as a money transitional license, in Europe as a broker dealer and as a market maker, in the UK as a broker dealer, in Australia as a broker dealer, in South Africa as a broker dealer so in that structure you'll learn a lot about how complex is sort of the regulatory environment when you're trying to build something really global. Most of the US firms are only US firms even the biggest brokerages that you know of the big four here E-trade Schwab etc. are very very US focused. When you go across the world and think about it we have the platform in 24 different languages from the European languages like German, Spanish, Italian, Polish... To Thai, Vietnamese, Chinese, Philippine. When we go into each of those markets and you look at the competitive landscape we're always competing with local players like the entire capital markets is extremely local which is very different than the crypto market. The crypto market in theory is a global one. But how many fiat on-ramps possibilities are there really in the US? I don't know are there more than a dozen here in the US?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Less I would say.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> What does the structure look like? Let's think about the UK for a moment. When you, when I make a trade I buy a Facebook stock, that trade you then route directly to New York or Nasdaq.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> Generally yes.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> As opposed to sending it over to a Jumper or [...] who then internalizes it and then [...] on your behalf which they will then pay a fee for.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> We can go into orders of execution here for like 2-3 hours if you want.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Well let's just to for like a few minutes. So there will be a difference between how you guys operate here in the US? Which means something different for the business model right?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> Yeah. The model in Asia, Australia, Europe and the US in each is a bit different. So our platform which is actually quite unique if you think about sort of the 1.0 Evolution of online brokerages they tried to sort of expand over seas but what they did is in every region they came they sort of built the stack from zero. This was pre-cloud, pre-sort of understanding that people are looking at the same things. So if you look at the local stock market in Germany, Comdirect is one of the largest brokers but it really focuses on your account that is in euro and you trade German stocks and they've built the stack really good to do that, to connect to the German market. And then if you look at their ability to trade US stocks it becomes more expensive and usually the rails are different. And I'm not sure whether you know these local brokerages...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> They trade as ADR?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> Not ADR. Here in the US there are ADR's. When we do stock trading across 15 exchanges around the world we settle on the local exchange, local currency for each exchange so when you buy Hong Kong stock it's Hong Kong stocks, when you buy Netherlands or Dutch or British stocks and this will be pound, this will be euro, this will be Hong Kong dollar, because we also have the experience from the currency markets so we provide 24 5 streaming quotes in all of the different fiat currencies as well. So it's easy for us to sort of calculate everything on the fly but generally what we have is a cloud platform and then for each regulated entity we'll optimize the settings based on the customers from that regulation. Here in the US clients can only register through our US platform which is based in the US, regulated in the US and therefore only offers US non-securities but eventually also it was securities through then a FINRA regulated brokerage. If you are in Asia you'd set up an account with our Australian business which works in a bit of a different way. If you're in the UK you'd open in the UK business, if you're in Europe you'd open in the European business. And again our view is to sort of build this structure of regulated entities where we're allowed to sell securities which is also quite interesting because that separates us quite significantly from people in the crypto industry. We understand securities, securities regulations and allowed to sell securities in most places where we operate. So that enables us also to sort of see the crypto industry maturing a bit from a regulatory point of view into a place sort of understanding what really are the requirements in order to run a regulated financial institution.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> That's interesting. I think we have a great foundation or a foundation of understanding on exactly what you guys do which you know I've learned a lot just in having this conversation. Let's take a look now at you guys trying to take on Coinbase, Gemini here in the United States with your with your crypto exchange and broker offering. We talked before,ed we went on before we turn on the mics about how marketing is going to play a big role in that and how you guys have had a lot of success in marketing here in the States and in New York specifically. We've seen Gemini pour millions and millions of dollars probably into this Taxicab campaign and throwing you know the regulated crypto exchange on billboards all over the place and if you look at their market share of the past year -- nothing.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Gemini dollar volume is still down.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Yeah went from $100 million market cap to about $9 million market cap. But you think that you've untapped the secret and it has fueled the success of eToro's marketing. Tell me a little bit more about the strategy","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> So our view, first of all the most important part in the business is product market fit so we have about 200 people in our product R&amp;D that constantly optimize the user experience and the way we iterate -- very similar to a lot of sort of Silicon Valley companies -- we look at the user experience from a data point of view. So we look at customers as they come into a lending page in how their lifecycle is within the platform and then constantly sort of launch new features and optimize for higher engagement, high retention within the platform. We use the same mythology when we're thinking about marketing so we think about the web as an extension of our product -- if you came into eToro's website once we'd constantly sort of re-market for you what we think is relevant for you and we'll gradually learn what's interesting for you and the way...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> What's an example of that?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> Yes I'll give you just a quick example. We'll show you four different ads, one talking about stocks, one talking about crypto, one talking about FX markets and one talking about commodities. Then you go and click the one talking about stocks, then we'll start showing you different ads around our copy portfolios, maybe around tech, around cannabis stocks, around renewable energy stocks and gradually from you engaging with us we'll learn what's interesting for you. Our view there is that the days of somebody picking up the phone and calling a customer telling him: that's interesting, that's what's happening in the market -- those days are done simply because the prices, we offer commission free trading in Europe. Right. So there's zero commission on trading stocks on eToro. We can't hire people who will call you over the phone because we don't have revenues to support that. We need to automate everything and our view is that basically, smart content over the web is that way to engage people with the markets. Again our mission is to get people engaged with the capital markets to get people to fall in love in capital markets like I fell in love in capital markets when I was young. What we've done is we've built a huge expertise in data science where we spend over $100 million a year on basically generating content that's relevant to the audience, again 24 different languages. We do that quite interestingly around IPOs for example, we'll create videos in multiple languages around a specific IPO then we'll go and present that video or advertise that video of us explaining a prospectus of a company on basically YouTube and Facebook and Twitter. Again this is not investment advice. This is general information provided to customers who we know are interested basically in the markets.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Why now for the US? I mean you said you're founded in 2007, when you see the deals Robinhood last week, raising another $300 million, having a $7 million post evaluation+ -- are you salivating over that?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> He sees bitFlyer coming and he sees Binance coming in, all the exchanges, foreign exchanges are gonna be in the market.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> I think maybe we've waited a bit too long. We actually have grown by something like 600% over last two and a half years since the crypto rally. We've had huge growth for the business which also means from a capital point of view it's much easier for us to expand into the US the way I think you need to expand in the US. The US market is a market where you need to be very much ready to do big investments in the market to perfect both the user experience as well as everything around it. If you want to succeed historically I always said that I want to be in a position where we could spend a lot of money to be able to succeed in the US. And I think we're there now.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Mhm. Well it's exciting. I think you guys are hiring a ton of folks in the marketing and com side, you have some stuff under your belt or sleeve?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> Well you know we're expanding the business team here in the US. We love people who are passionate about crypto and passionate about the markets. Our office is here in Hoboken. I think we're hiring like at least five people in the marketing and I think we'll be hiring more in sort of account success and customer success positions. So very happy to see talented passionate people around both crypto and the markets.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> What will the marketing strategy be there?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> I think it's around... Getting on the best podcasts in crypto?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> Of course. And overpay. It's going to be very similar to what we've done around the world. So we're happy to engage both offline and online with customers. So we'll do events and meet ups to meet the crypto community. We're going to build our brand here in the US until you won't need to say maybe eToro, maybe you've haven't heard about us. We're gonna scale our business, around Europe for example if you ask people in Europe like top of mind cryptocurrency platform in most countries they'd say eToro rather than Coinbase. Maybe it's time to do that in the US as well.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> What about Bitstamp. Do you think that Bitstamp comes to mind as well?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> First of all I love let's call it competition. I love Bitstamp. I am in touch with a lot of the crypto CEOs in the industry. As I mentioned before this market is...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Have any called you up giving you advice about launching an exchange? What what to do? What not to do? Kind of like how the president of the United States, he always writes a letter to the next president saying this is what I expect.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> I think generally the crypto industry is is relatively small. Like everybody knows each other which is great. I'm very much supportive also of lake Love wot War. So very supportive of other blockchains we're supportive of other platforms, we're supportive. Generally I think again if you look at the market and say this entire market is going to do at least 10x within the next five years whether, by the way it's fintech brokerage wealth management or crypto both are probably going to do that in the next five years. Then there's land grab for everyone.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So what's interesting about you guys is you're expanding more to let's say capital markets. You're looking at potentially figuring out how to tokenize stocks and other securities. You have built out an exchange whereas we've seen Robinhood and others get more so into banking and offering a more broad array of banking services, they had the botched high yield savings account, which they relaunched as cash yield account. Do you see your eToro going into those services like banking?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> We actually just recently launched interest rate on account balances for our customers in Europe. We are in the works of exploring\/adding a current account debit cards for our clients. Generally what we were seeing again across the industry we've seen a process of sort of unbundling the banks each coming a bit from a different position whether it's capital markets, whether it's lending, whether it's the current account debit card. Product companies, fintech entrepreneurs each of us sort of in their own segment said OK, customers expect something different. Let's build them a great product. Then suddenly you find yourself with millions of customers. And then we're now seeing what what we internally call but also some other research. It's sort of the rebundling and rebundling is in our view, blockchain is the infrastructure for that rebundling and tokenization of assets is going to be a significant part of that rebundling which would eventually offer great things like investing in private equities and real estate and art and not only in the traditional capital markets but we definitely see with billions of dollars moving in and out in eToro on a yearly basis with customers you know sending overseas funds in and out from eToro. We definitely see an opportunity of creating sort of a better user experience also for that payment part of the business as well as you know last year we did almost a trillion dollars in volume. So. So just sort of flowing that volume into tokenized assets and building an exchange that has a trillion dollars in volume of tokenized assets. That's sort of the capital market. So yes capital markets is our biggest passion but around that there are surrounding services that we're very happy to work with partners or build our own again in order to eventually improve the user experience, improve conversion, lower friction of users.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Where's the revenues? What's the moneymaker here?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> Volume, very similar to to exchanges where transaction based volume, when the trillion dollars, think about us doing several pips.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> I thought you guys didn't take fees for...?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> So we don't take ticket fees. We calculate basically the spread as our revenues and then we deduct out of that whatever costs for us to sort of place the order in the market.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Mhm. And that's been growing?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> Yes. 600% over the last three years.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> What do you think is the main driving force behind that? Is it that you guys are at the forefront of crypto or is it that you have the social element or is it?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> I think again the we've been able to build, that resonated very well in Europe and Asia, is a very simple user experience to go into the markets whether it's stocks or crypto. And what we've seen by the way both significantly scale over the last two three years but a lot of the peak was the crypto rally of 2017. So we were the first regulated broker in the world to offer bitcoin trading but back in 2014. And that's because I'm a Bitcoin sort of zealot.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> How do you get to that point?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> So funny enough I started griping about crypto currencies in 2008 on my blog about a cryptocurrency called the good dollar which now is actually a project but back then it was more of a fiction. I just actually found something interesting around I, I sent it to you and I don't know if you had the chance of reading it. I actually wrote this fiction blog post called Internet revolution about a fake Facebook group launching a virtual currency called the good dollar. And that sort of catches on fire and 500 million people move all of their savings into crypto and then Facebook coming to Congress and saying listen we can't control it anymore because it's decentralized, that was November 2010 before I think right about the time I learned about bitcoin. So I was super passionate about sort of crypto and decentralization from the first minute I saw it and even a bit before I saw it. And then when we started dealing with 2010 I had to, let's call it debate with some of our investors that we need to go into crypto and we need to buy crypto.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> What did that debate look like? How did you convince them that this was the right decision to make?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> It convinced them that they should not necessarily micromanage decisions in the company. Back in 2010. When I talked about crypto to people that was really deaf ear all around like that was like don't go into that rabbit hole you're a bit crazy. But by the way internally as well. Like remember we're in the business of capital markets. We understand very well anti money laundering rules et cetera. For a lot of people there was really that like 2010 to 2014 was the scary area of crypto for a lot of people and very very skeptic. Then Mt. Gox happened which basically most people who were skeptical before now had the chance to say hey I'm right it's died and then 2017 brought like changed everything and brought it really to the spotlight. But we wrote in 2012 we had a group called Colored Coins. I wrote the original white paper of Colored Coins with italic. So when you click on the Ethereum white paper the first link there is to a document that actually out of my GMail and this was like a lot of oh jeez back then we're very excited about tokenization on Bitcoin. Then at some point back then by the way I was a bitcoin maximalist. There were other chains and already and then Vitale wanted to launch his own blockchain rather than keep on working on the project and I was like like a you know Bitcoin maximalist saying why do you need another blockchain. There is no reason to do another blockchain. But but I think that talked to me about not being a maximalist but tokenization is something we would definitely see happening. There's still a big question of how it's happening on which blockchain it's happening but I think the ICOs in 2017 plus China -- those are the key drivers of sort of non-linear growth that we've seen and prices in 2017 that led to some crazy things happening in eToro back then. So we had I think in one day we opened something like 20,000 funded accounts in 2017 which is an insane number. I think about like 50 people just going through KYC of people like we do KYC checks for every single person going utility bills in the sort of documents and verifying that's real people that was insane with 50 to 10,0000 registrations in a single day in the peak. So a lot of fun like we tested the scale of the platform at some point. If I remember correctly I won't name names all of the exchanges were down, you couldn't open an account a new account in any exchange that supported fiat other than eToro that was exciting times. Hope they'll come back soon.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> I want to talk about the copy trader product.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> We have a very specific question.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Well I guess also just like Roadmaps, realistically would you want to bring that to the US?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> It's coming to the US, it's coming to the US very soon. And what I'm saying to people who are listening you should open an account now in eToro. Start trading and generate basically data.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Virtual?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> I can also, no only with real money because you need your track record right. So if you want to get copies copied you need to have a track record and to generate a track record you need to open an account. And guys if you think you're not only about the talk but also about the walk I'm inviting you guys to open accounts as well and see whether you can trade crypto.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Doesn't sound like a good idea for me.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> I'm kind of interested.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Just don't open up an account in another exchange and short those you're copycatting","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> One last question like Do you worry about that? A massive account frontrunnng...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> So what we're doing as a regulated activity like suspicious activity reporting et cetera but generally actually the eco system really does not in incentivize you to do that because you have one public profile. So if you screw that public profile nobody will ever copy you again and to be copied you need to go through a process to join our popular investor program and get opt-in where we actually do KYC so we know who is the customer, we know who you are so it's like the worst possible... You really need to be an idiot to try and defraud on a social network where everybody's seeing you with your real name and your real picture.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> That's the feature I wish we had in the last bull market all these like bags that people had that weren't promoting it, like we didn't know what they had.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Yoni Assia<\/span><\/strong> But you're gonna have it in this bull market. We specifically asked like... although jeez wait with a bull run. Wait for us to launch. Copy trader here in the US and then we'll start and just to clarify this was a joke.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong>Thank you Yoni. It's a pleasure. Thank you very much.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Amazon","content":"LOCATION"},{"type":"Ryan Todd<\/span><\/strong> Less","content":"PERSON"},{"type":"$100 million","content":"MONEY"},{"type":"Ryan Todd<\/span><\/strong> Okay","content":"PERSON"},{"type":"Ryan Todd<\/span><\/strong> That","content":"PERSON"},{"type":"South Africa","content":"LOCATION"},{"type":"30%","content":"PERCENT"},{"type":"New York","content":"LOCATION"},{"type":"Spotify","content":"LOCATION"},{"type":"one million dollars","content":"MONEY"},{"type":"2030","content":"DATE"},{"type":"Vitale","content":"PERSON"},{"type":"euro","content":"ORGANIZATION"},{"type":"Chaparro","content":"PERSON"},{"type":"United Kingdom","content":"LOCATION"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"Yoni Assia<\/span><\/strong> Volume","content":"PERSON"},{"type":"Yoni Assia<\/span><\/strong> Yea","content":"PERSON"},{"type":"last night","content":"TIME"},{"type":"Yoni Assia<\/span><\/strong> Yeah","content":"PERSON"},{"type":"Ryan Todd","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"600%","content":"PERCENT"},{"type":"Colored Coins","content":"ORGANIZATION"},{"type":"Virtu","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Comdirect","content":"ORGANIZATION"},{"type":"Philippine","content":"LOCATION"},{"type":"$300 million","content":"MONEY"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"Ryan Todd<\/span><\/strong> Why","content":"PERSON"},{"type":"five million dollars","content":"MONEY"},{"type":"Ryan Todd<\/span><\/strong> Virtual","content":"PERSON"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"2014","content":"DATE"},{"type":"last two three years","content":"DATE"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"Yoni Assia<\/span><\/strong> Well","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"2010","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"2012","content":"DATE"},{"type":"a trillion dollars","content":"MONEY"},{"type":"Google","content":"ORGANIZATION"},{"type":"Hoboken New Jersey","content":"LOCATION"},{"type":"Frank Chaparro<\/span><\/strong> Mhm","content":"ORGANIZATION"},{"type":"Hoboken","content":"LOCATION"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Asia","content":"LOCATION"},{"type":"Schwab","content":"PERSON"},{"type":"Ryan Todd<\/span><\/strong> Gemini","content":"PERSON"},{"type":"Europe","content":"LOCATION"},{"type":"one trillion dollars","content":"MONEY"},{"type":"Ryan Todd<\/span><\/strong> Well","content":"PERSON"},{"type":"Israel","content":"LOCATION"},{"type":"Assia<\/span><\/strong> Not ADR","content":"ORGANIZATION"},{"type":"Australia","content":"LOCATION"},{"type":"Germany","content":"LOCATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"3","content":"DATE"},{"type":"FINRA","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"2 trillion dollar","content":"MONEY"},{"type":"Shanghai","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"Chaparro<\/span><\/strong>Thank","content":"PERSON"},{"type":"Todd<\/span><\/strong> Thanks Frank","content":"ORGANIZATION"},{"type":"Ryan Todd<\/span><\/strong> Does","content":"PERSON"},{"type":"Assia","content":"LOCATION"},{"type":"Yoni Assia<\/span><\/strong> First","content":"PERSON"},{"type":"trillion dollars","content":"MONEY"},{"type":"forty trillion dollars","content":"MONEY"},{"type":"today","content":"DATE"},{"type":"$7 million","content":"MONEY"},{"type":"Congress","content":"ORGANIZATION"},{"type":"ADR","content":"ORGANIZATION"},{"type":"Yoni Assia<\/span><\/strong> Thank","content":"PERSON"},{"type":"2007","content":"DATE"},{"type":"2008","content":"DATE"},{"type":"Yoni Assia","content":"PERSON"},{"type":"$9 million","content":"MONEY"},{"type":"25 trillion dollars","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Yoni","content":"PERSON"},{"type":"November 2010","content":"DATE"},{"type":"China","content":"LOCATION"},{"type":"API","content":"ORGANIZATION"}],"hashtag":["CRYPTO"],"authors":["Frank Chaparro","Ryan Todd","The Block"]}