{"summary":"A fintech fund managed by Lombard Odier Investment Managers, the asset management arm of the Swiss private bank, is investing in digital asset companies.\nThe public markets investor is looking for “picks and shovels” investment opportunities in the market.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/81459\/a-224-year-old-swiss-banks-new-250-million-fintech-fund-is-focused-on-tokenization","publishDate":"2020-10-16T14:00:33","id":2967,"type":null,"title":"Lombard Odier&#x27;s asset management arm is betting on &#x27;tokenization&#x27;","category":["Payments and Banking"],"content":["<span data-v-f87c67ca=\"\">A recently launched fintech investment fund managed by Lombard Odier Investment Managers, the asset management arm of the Swiss private bank founded in 1796, is seeking out companies focused on \"tokenization.\"<\/span>","<span data-v-f87c67ca=\"\">The fund manager launched its new fintech strategy in May, and has since amassed $250 million in assets despite challenging market conditions.<\/span>","<span data-v-f87c67ca=\"\">Jeroen van Oerle, global fintech equities portfolio manager for the fund, told the Block that his team is taking a “picks and shovel approach” to investing in the field of digital assets, with a particular focus on companies involved in the process of tokenization, which involves linking real assets to distributed ledgers. Proponents of tokenization believe it can bring greater efficiency and liquidity to markets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">So far, this approach has led the group to investments in a consultancy and software company, whose names van Oerle would not disclose.<\/span>","<span data-v-f87c67ca=\"\">As a public markets investor, the Lombard Odier fintech fund targets revenue-generating firms with a market capitalization of at least $500 million. According to van Oerle, there is a shortage of publicly-traded companies that are focused purely on tokenization.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The fund's investment criteria limits its universe of digital asset companies. But its mandate extends beyond tokenization. Van Oerle's definition of fintech is “all the technology that either enhances existing financial services or enables the creation of new ones.” That includes companies in payments, cyber-security, personal finance and software.<\/span>","<span data-v-f87c67ca=\"\">As for digital assets, van Oerle thinks the fund will be in a position to move beyond its “picks and shovels” tactics within the next five years. Then it will start picking winners, he said.<\/span>","<span data-v-f87c67ca=\"\">“A couple of years ago, every meeting started with ‘imagine a world’, right? Now, I think we have moved from that stage to a proof of concept stage, which has happened for the last three years. And we’re now again moving to the first signs of early implementation phase,” he said.<\/span>","<span data-v-f87c67ca=\"\">“Within the next five years we will for sure see who is going to benefit from these kinds of new assets that come to market and my prediction would be that these are mostly companies that we do not know today — which are not publicly known but which can grow pretty fast once there’s traction in this field of innovation.” <\/span>"],"hashtag":["FINTECH","TOKENIZATION"]}