{"summary":"German insurance giant Allianz is set to launch a blockchain-based token for payments, similar to JPM Coin\nThe token will be pegged 1:1 to the U.S. dollar, which is in “advanced stages” of development ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/35389\/insurance-giant-allianz-creating-a-jpm-coin-like-payment-token-the-project-is-in-advanced-stages","publishDate":"2019-08-09T13:29:01","id":2968,"type":null,"title":"Insurance giant Allianz creating a JPM Coin-like payment token; the project is in ‘advanced stages’","category":["Startups"],"content":["Germany’s biggest insurance company, Allianz, has been developing a blockchain-based digital token for payments, similar to investment banking giant JPMorgan’s JPM Coin.","A representative of Allianz told The Block on Friday that the token aims to simplify and accelerate cross-border insurance payments for its corporate customers across 200 countries and territories. The firm, however, stressed that it is&nbsp;“not a cryptocurrency,” referring to an earlier report by Forbes.","“A project team is in the advanced stages of development for a token-based electronic payment system to allow for frictionless, transparent and instantaneous money transfers for a range of different types of payments,” the representative said.","The token will be pegged 1:1 to the U.S. dollar (USD), according to the firm, similar to <a href=\"https:\/\/www.theblockcrypto.com\/2019\/02\/14\/jp-morgan-launches-its-own-cryptocurrency-the-first-for-a-major-us-bank\/\" data-v-f87c67ca=\"\">JPM Coin<\/a> that is equivalent to one USD and is also built for “instantaneous” transfer of payments between the bank’s institutional clients.&nbsp;The basic “core” infrastructure has already been built and tested by its business insurance unit Allianz Global Corporate &amp; Specialty (AGCS), according to the insurer. The next step for the project will be a transfer trial.&nbsp;","Allianz joins a growing number of big-name companies who are exploring blockchain technology for quicker payments. <a href=\"https:\/\/www.theblockcrypto.com\/2019\/02\/18\/wall-street-analysts-throw-cold-water-on-jpmorgans-cryptocurrency\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Signature Bank<\/span><\/a>, for instance, has built a blockchain-based payments platform called Signet and has on-boarded over 100 clients who are using it to send millions of dollars a day.","<a href=\"https:\/\/www.theblockcrypto.com\/2019\/07\/09\/goldman-sachs-set-to-go-further-than-ever-before-with-new-digital-asset-project\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Goldman Sachs<\/span><\/a> is also considering launching something akin to JPMCoin. As The Block previously reported, the investment bank is looking to go “further than ever before” with digital assets and blockchain with <a href=\"https:\/\/www.theblockcrypto.com\/2019\/07\/09\/goldman-sachs-set-to-go-further-than-ever-before-with-new-digital-asset-project\/\" data-v-f87c67ca=\"\">a new hire<\/a>.&nbsp;","Earlier this month, retail giant <a href=\"https:\/\/www.theblockcrypto.com\/2019\/08\/02\/walmart-could-be-looking-to-rival-facebooks-libra-with-a-usd-pegged-stablecoin-issuance-a-patent-filing-shows\/\" data-v-f87c67ca=\"\">Walmart<\/a> filed a patent filing that hints at possible plans to issue a&nbsp;USD-pegged stablecoin to provide an alternative choice for low-income households that find banking prohibitively costly. Social media behemoth <a href=\"https:\/\/www.theblockcrypto.com\/2019\/06\/18\/facebook-libra-cryptocurrency-calibra-launch\/\" data-v-f87c67ca=\"\">Facebook<\/a> is also planning to launch cryptocurrency Libra, with similar ambitions. Libra, however, has <a href=\"https:\/\/www.theblockcrypto.com\/2019\/08\/01\/libra-is-washingtons-crypto-wake-up-call-a-look-back-at-a-fireworks-filled-july-in-digital-asset-policy\/\" data-v-f87c67ca=\"\">faced<\/a>&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/2019\/07\/16\/facebook-is-dangerous-senators-grill-facebooks-david-marcus-over-libra-in-2-hour-hearing\/\" data-v-f87c67ca=\"\">scrutiny<\/a> from central banks and politicians around the world over Facebook's well-known privacy issues."],"hashtag":["GOLDMAN SACHS","JPMORGAN"]}