{"summary":"StoAmigo previously brought a case against Vanbex and the pair behind it, Cheng and Hobbs, in California, but they were dismissed due to lack of personal jurisdiction\nNow, StoAmigo is bringing another case against Cheng and Hobbs in Nevada, alleging fraudulent inducement and negligent misrepresentation.\nThere are likely sufficient contacts in Nevada for the case to proceed, unlike in California","author":["Nelson Rosario","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/25359\/vanbex-team-faces-another-suit-for-alleged-fraudulent-inducement-and-negligent-misrepresentation","publishDate":"2019-06-02T08:56:11","id":297,"type":null,"title":"Vanbex team faces another suit for alleged fraudulent inducement and negligent misrepresentation","category":["Legal"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1] StoAmigo International, LLC v. Cheng and Hobbs, Case №2:19-cv-00900 (D. Nev. filed May 28, 2019)[NMR]<\/strong><\/em><br data-v-f87c67ca=\"\">\nLong time readers of the Crypto Caselaw Minute may recognize the StoAmigo name. That’s because we covered their pending lawsuit in the Central District of California back in January. Wait, this case is in Nevada and doesn’t involve Vanbex, and in the case in California Cheng and Hobbs were dismissed from the case. Well, you know what they say. “If at first you don’t succeed (first you don’t succeed), Dust yourself off, and try again...” (RIP Aaliyah)","A brief refresher is in order, as this newly filed suit in Nevada is basically the same suit that was filed in California. StoAmigo is not a typical blockchain company. As I put it in January,","“No, in this suit the plaintiff is actually an established company that already had users, and revenue, and was a real-life company! They just happened to want to get in on the blockchain train with a new product\/service line. That’s when they met the team at the Vanbex Group, and well, here we are.”","Who is the team at Vanbex? Cheng and Hobbs. They are now being sued again this time in Nevada for the same things that they were sued for in California. Fraudulent inducement, and negligent misrepresentation to the tune of at least $80,000 paid to Vanbex to help promote a token sale. They were being sued in California, because there was a clause in the services agreement they signed that said the agreement would be governed by the laws of California. This is known as a forum-selection clause.","After the case was filed in California, Cheng, Hobbs, and Vanbex moved to dismiss the case for lack of personal jurisdiction. As the plaintiff notes in this lawsuit “all three defendants asserted that the forum-selection clause in the Services Agreement was not enforceable as to them.” On May 20 the judge in the California case denied the motion to dismiss with respect to Vanbex and granted it with respect to Cheng and Hobbs. Eight days later this lawsuit is filed. The plaintiff’s counsel in this case argues that “Cheng and Hobbs have therefore waived any right they may have had to enforce the forum-selection clause of the Services Agreement for lawsuits brought by Plaintiff against them.” The plaintiff has a pretty strong point here.","The question moving forward will be are there enough minimum contacts with Nevada for the case to be proper here. Given that StoAmigo’s principal of business was in Nevada, and much of the business relationship was conducted via people and things located in Nevada, there probably is sufficient minimum contacts. It looks like Cheng and Hobbs may have to finally start defending against the specific allegations related to the ICO.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part III of this week's analysis, Crypto Caselaw Minute, is above.<\/em>"],"hashtag":[]}