{"summary":"During the crypto market crash in 2018, the network value of almost all tokens dropped significantly. The exceptions are a few stablecoins that grew a lot in market cap: USDC ($0 to $239M+), TUSD ($0 to $205M+), PAX ( $0 to $113M+), GUSD ($0 to $72M+), DAI ($0 to $92M+). Collectively these stablecoins have about $717M+ in market cap. On the other hand, the market cap of leading stablecoin USDT dropped from $2.8B to $2.0B, losing about $800M in market cap. What a coincidence!","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/15519\/price-war-a-new-type-of-attack-on-stablecoins","publishDate":"2019-03-12T15:54:56","id":2970,"type":null,"title":"Price War: A new type of attack on stablecoins","category":["DEFI"],"content":["<em data-v-f87c67ca=\"\"><a href=\"https:\/\/www.linkedin.com\/in\/hhe09\/\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/www.linkedin.com\/in\/hhe09\/&amp;source=gmail&amp;ust=1552511449354000&amp;usg=AFQjCNGZB61XRg5HT2Io_DvxEA0mfb8paA\" data-v-f87c67ca=\"\">Henry He<\/a>&nbsp;is the co-founder and CEO at&nbsp;<a href=\"https:\/\/www.sesameopen.network\/\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/www.sesameopen.network\/&amp;source=gmail&amp;ust=1552511449354000&amp;usg=AFQjCNGcj6w-BT2TJESfecqcu5w6GwGarg\" data-v-f87c67ca=\"\">SesameOpen<\/a>. An ex-Googler, Wharton MBA, and alumnus of Nortel Networks with eight patents, he is an expert in security and IP routing, and a frequent author and speaker on token economics. Follow Henry on Twitter @hhe08<\/em>","<span data-v-f87c67ca=\"\">During the crypto market crash in 2018, the network value of almost all tokens dropped significantly. The exceptions are a few stablecoins that grew a lot in market cap: <\/span><a href=\"https:\/\/coinmarketcap.com\/currencies\/usd-coin\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">USDC<\/span><\/a><span data-v-f87c67ca=\"\"> ($0 to $239M+), <\/span><a href=\"https:\/\/coinmarketcap.com\/currencies\/trueusd\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">TUSD<\/span><\/a><span data-v-f87c67ca=\"\"> ($0 to $205M+), <\/span><a href=\"https:\/\/coinmarketcap.com\/currencies\/paxos-standard-token\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">PAX<\/span><\/a><span data-v-f87c67ca=\"\"> ( $0 to $113M+), <\/span><a href=\"https:\/\/coinmarketcap.com\/currencies\/gemini-dollar\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">GUSD<\/span><\/a><span data-v-f87c67ca=\"\"> ($0 to $72M+), <\/span><a href=\"https:\/\/coinmarketcap.com\/currencies\/dai\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">DAI<\/span><\/a><span data-v-f87c67ca=\"\"> ($0 to $92M+). Collectively these stablecoins have about $717M+ in market cap. On the other hand, the market cap of leading stablecoin <\/span><a href=\"https:\/\/coinmarketcap.com\/currencies\/tether\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">USDT<\/span><\/a><span data-v-f87c67ca=\"\"> dropped from $2.8B to $2.0B, losing about $800M in market cap. What a coincidence! It seems the new stablecoins' gain is at the expense of leading stablecoin Tether which was <\/span><a href=\"https:\/\/medium.com\/sesameopen\/attacking-stablecoins-why-and-how-can-a-project-defend-bff58fc55f74\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">attacked in October 2018<\/span><\/a><span data-v-f87c67ca=\"\">. (Note: The market cap data is from CoinMarketCap as of March 11, 2019 and is approximate.)<\/span>","","","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Source: coinmetrics.io<\/em><\/span>","<span data-v-f87c67ca=\"\">Competition among these stablecoins will be fierce and projects have incentives to attack other projects to gain market share. Some attacks are legal business practices such as the speculative attack Soros used to attack the British pound. The same method was also used to <\/span><a href=\"https:\/\/medium.com\/sesameopen\/attacking-stablecoins-why-and-how-can-a-project-defend-bff58fc55f74\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">attack Tether in October 2018<\/span><\/a><span data-v-f87c67ca=\"\">. In this article, I am demonstrating a hypothetical attack using a common legal business practice — a “price war.\"<\/span>","<span data-v-f87c67ca=\"\">Different stablecoins use different business models and these differences open up new types of attacks which have not been discussed and of course have not happened yet. For our purposes here, I will only use USDC and DAI as examples.<\/span>","<span data-v-f87c67ca=\"\">USDC, as a fiat-backed stablecoin, uses fiat as collateral which is held at off-chain external entities (banks) which can be seized by centralized authorities such as governments. Given that USDC is issued by centralized exchanges (Coinbase, Circle) which receive meaningful utility value from USDC such as 24\/7 exchange deposits, interest on fiat deposits, and <\/span><a href=\"https:\/\/medium.com\/r\/?url=https%3A%2F%2Fsupport.usdc.circle.com%2Fhc%2Fen-us%2Farticles%2F360015471331-Circle-USDC-Fee-Schedule\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">no fee<\/span><\/a><span data-v-f87c67ca=\"\"> to use. This advantage can be used to attack other stablecoins that charge user-imposed fees.<\/span>","<span data-v-f87c67ca=\"\">DAI, as a crypto-backed stablecoin, uses crypto assets as collateral which is held on-chain, can not be seized by centralized authorities and is censorship resistant. Since crypto assets are volatile, it introduces another token, Maker (<\/span><a href=\"https:\/\/medium.com\/r\/?url=https%3A%2F%2Fcoinmarketcap.com%2Fcurrencies%2Fmaker%2F\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">MKR<\/span><\/a><span data-v-f87c67ca=\"\">), as a form of insurance, to maintain the peg on top of adopting an over-collateralized strategy. To accrue value for MKR, DAI charges a “<\/span><a href=\"https:\/\/medium.com\/r\/?url=https%3A%2F%2Fgithub.com%2Fmakerdao%2Ffaq-test%2Fblob%2Fmaster%2Fstability-fee.md\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">stability fee<\/span><\/a><span data-v-f87c67ca=\"\">”. Effectively, it adds a cost for users to borrow DAI against their crypto assets as collateral. This opens up a possible attack vector since logical and reasonable users will choose another service with lower fees to borrow stablecoins using the same crypto assets.<\/span>","<span data-v-f87c67ca=\"\">Adoption is critical for a stablecoin project to succeed and projects are using all kinds of marketing tactics to gain adoption, such as <\/span><a href=\"https:\/\/medium.com\/r\/?url=https%3A%2F%2Fwww.theblockcrypto.com%2F2019%2F01%2F04%2Fgemini-gave-trading-firms-a-stablecoin-discount-and-it-caused-big-headaches-for-one-of-its-rivals%2F\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">rebates<\/span><\/a><span data-v-f87c67ca=\"\"> and strategic partnerships. With the business model advantage of not charging user-imposed fees, USDC can create a new go-to-market channel to drive its adoption by attacking DAI using a price war on DAI’s stability fee.<\/span>","<span data-v-f87c67ca=\"\">The value proposition of the DAI\/MakerDAO platform is to enable users to borrow DAI using their crypto assets as collateral. In most cases, users buy more crypto assets with their DAI, effectively creating a leverage position using the DAI\/MakerDAO platform. USDC can also tap this use case as a new channel to drive its distribution with a straightforward approach. Basically, it can set up the same lending service as MakerDAO with the same open trustless setting (or just copy the related open-source code). The key difference here is that USDC will charge a lower fee than DAI’s stability fee. It can even afford not to charge a fee at all. In that event, assuming users are rational and logical, they will use USDC’s lending service to borrow stablecoins and create a leverage position for their crypto assets. This is the simple execution of the price war attack.<\/span>","<span data-v-f87c67ca=\"\">DAI has no option but to compete. Otherwise, under the assumption that CDP users do not care about the permissionless nature of MakerDAO, no DAI will be minted and it will lose its market share. To compete, DAI needs to lower its stability fee. Since USDC can charge no fee, the endgame is that DAI will need to lower its stability fee all the way to zero to be competitive. DAI unfortunately cannot afford zero stability fee since its design requires a fee to maintain the peg and generate returns for project investors. Eventually DAI will lose in this price war. By launching a price war, USDC kills two birds with one stone — not only creating a new marketing channel to drive its adoption, but crashing a competitor at the same time.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">In fact, USDC is highly incentivized to execute this hypothetical attack. This is because the marketing cost to use other methods, such as rebates, to drive the same amount of adoption, plus the cost to crash a competitor, will likely be much higher than simply copying open source code, launching a lending service, and implementing risk management. By launching a lending service, USDC does face a new risk that MakerDAO is facing: that volatility of the underlying collateral can lead to the under-collateralization of loans. However, USDC has the resources to manage the risk to be lower than MakerDAO. This is done by maintaining the same collateral ratio and selecting only the crypto assets MakerDAO selects, but providing higher collateral liquidity and faster asset price data feed owing to its connection with big centralized exchanges. In fact, USDC could be more aggressive by lowering the collateral ratio as another method to attack DAI. (Ignoring the legal or policy risk such as KYC\/AML here.)<\/span>","<span data-v-f87c67ca=\"\">Censorship-resistant stablecoins like DAI serve an important role in powering trustless applications such as decentralized exchanges, decentralized financial products and dapps. These applications use smart contracts to automatically execute stablecoin transfers in a trustless environment, and obviously stablecoins that can be frozen will cause problems.<\/span>","<span data-v-f87c67ca=\"\">Hence it is reasonable to assume there will be a market segment for DAI as a censorship-resistant stablecoin. The demand may be small in the beginning but will grow along with trustless applications. When facing a price war from USDC, one strategy DAI could use is not lowering, or maybe even increasing its stability fee to win the censorship-resistant stablecoin market segment.<\/span>","<span data-v-f87c67ca=\"\">The challenge is whether DAI can continue to grow in supply to meet increasing demand. Users who borrow stablecoins using their crypto assets don’t really care whether the stablecoins are censorship-resistant since they don’t hold the stablecoins they borrow. By having a higher user-imposed fee, DAI may not grow to meet the demand. If they do not have enough supply, will these trustless application take the risk to adopt USDC even though it is not censorship-resistant? I think it is very likely and a very interesting market dynamic to watch carefully.<\/span>","<span data-v-f87c67ca=\"\">The price war between the USDC and the DAI is a price war between a centralized solution and a decentralized solution. If we expand our thinking beyond the stablecoin, will there be more price wars between centralized and decentralized businesses? The latter in theory provide better economic value than the former by removing middleman fees and incentivizing communities as token holders to evangelize their businesses by creating network effects. Will decentralized businesses have the upper hand? I don’t have good answers to those questions and I don’t think the community as a whole has answers either. I hope this article can serve as a starting point for the community to discuss and observe.<\/span>","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Acknowledgement: This article was inspired by a brief discussion in a telegram group with <\/span><a href=\"https:\/\/medium.com\/r\/?url=https%3A%2F%2Fwww.linkedin.com%2Fin%2Frune-christensen-5b5220ab%2F\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Rune Christensen<\/span><\/a><span data-v-f87c67ca=\"\">, <\/span><a href=\"https:\/\/medium.com\/@hasufly\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Hasu<\/span><\/a><span data-v-f87c67ca=\"\">, and <\/span><a href=\"https:\/\/medium.com\/@suzhu\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Su Zhu<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span><\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$2.0","content":"MONEY"},{"type":"Soros","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"$2.8","content":"MONEY"},{"type":"DAI","content":"ORGANIZATION"},{"type":"$205M","content":"MONEY"},{"type":"Su Zhu","content":"ORGANIZATION"},{"type":"SesameOpen","content":"ORGANIZATION"},{"type":"$0","content":"MONEY"},{"type":"$239M","content":"MONEY"},{"type":"AML","content":"ORGANIZATION"},{"type":"$717M","content":"MONEY"},{"type":"USDT","content":"ORGANIZATION"},{"type":"$800M","content":"MONEY"},{"type":"$92M","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"October 2018","content":"DATE"},{"type":"March 11, 2019","content":"DATE"},{"type":"$113M","content":"MONEY"},{"type":"Rune Christensen","content":"PERSON"},{"type":"Nortel Networks","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"MKR","content":"ORGANIZATION"},{"type":"Hasu","content":"PERSON"},{"type":"$72M","content":"MONEY"},{"type":"Wharton MBA","content":"ORGANIZATION"}],"hashtag":["DAI","USDC"],"authors":["Contributor Network","The Block"]}