{"summary":"Crypto and equities market maker Jump Trading is backing FTX’s new DEX Serum.\nAnnouncing the news exclusively on The Scoop, The Block’s podcast, FTX’s Sam Bankman-Fried said Jump has invested in Serum and will provide liquidity for the DEX.","author":["Yogita Khatri","Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/76826\/veteran-market-maker-jump-trading-forays-into-defi-to-provide-liquidity-for-ftxs-solana-based-dex","publishDate":"2020-09-03T09:00:55","id":2974,"type":null,"title":"Veteran market maker Jump Trading forays into DeFi — to provide liquidity for FTX’s Solana-based DEX","category":["DEX"],"content":["Jump Trading, one of Chicago's storied high-frequency trading shops, is backing FTX's decentralized exchange Serum.&nbsp;","Announcing the news exclusively on <a href=\"https:\/\/open.spotify.com\/episode\/6v4PZq6xA49MwPniQQsh6P\" data-v-f87c67ca=\"\">The Scoop<\/a>, The Block's podcast, FTX's Sam Bankman-Fried said the high-speed trader and market maker would provide liquidity for the DEX. Jump has also invested a “significant” sum in Serum.","\"As soon as you start thinking bigger, you need to throw a lot more at it,\" said Bankman-Fried. \"And so we're really excited to be working with them [Jump] as you know [they're] kind of key sources [of] liquidity.\"","Jump is a veteran in the market making and high-speed trading space across assets, having been in operation since 1999. It is also known for being <a href=\"https:\/\/www.jumptrading.com\" data-v-f87c67ca=\"\">highly secretive<\/a> with scant information about its business available on its website. Active in the crypto market, the firm provides liquidity across exchanges and <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2019-05-29\/robinhood-s-free-crypto-trades-powered-by-chicago-s-jump-trading\" data-v-f87c67ca=\"\">powered<\/a> the crypto unit of Robinhood when it launched in 2018. Its sister company <a href=\"https:\/\/jumpcap.com\/portfolio\" data-v-f87c67ca=\"\">Jump Capital<\/a> is an active investor in the crypto market, having previously backed firms like BitGo, Bitnomial, Bitso, and Curv.","A source familiar with Jump's business said the company has continued to dive deeper into crypto and is starting to look at bigger deals.&nbsp;","Bankman-Fried said Jump’s investment and partnership are a “huge display of confidence in what Serum is trying to achieve.” Indeed, Serum is Jump's first foray into the DeFi space.","The DEX is built on Solana and <a href=\"https:\/\/www.theblockcrypto.com\/linked\/76409\/ftx-serum-dex-august\" data-v-f87c67ca=\"\">went live<\/a> last week, after<a href=\"https:\/\/www.theblockcrypto.com\/daily\/72924\/ftx-dex-serum-solana-blockchain\" data-v-f87c67ca=\"\"> first revealing its plans to The Block exclusively<\/a> in July. Serum currently has markets for BTC, ETH, and Serum’s native tokens SRM and MSRM, with trading pairs against USDT and USDC for each.","Jump’s investment in Serum comes at a time when the decentralized finance (DeFi) space is continuing to make waves in the crypto market. Bankman-Fried said DeFi is poised for “incredible growth” in the future.","“We believe that the trading processes pioneered in the sector will have implications far beyond what we now call ‘DeFi.’ Our intention is to build the infrastructure that can help achieve that opportunity,” said Bankman-Fried, without disclosing specific details.","<strong data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Full episode of The Scoop:<\/em><\/strong>","<iframe src=\"https:\/\/playlist.megaphone.fm?e=BLOCK6066214068\" width=\"100%\" height=\"200\" frameborder=\"0\" scrolling=\"no\" data-v-f87c67ca=\"\"><\/iframe>"],"hashtag":["FTX","SOLANA"]}