{"summary":"Cristiano Ronaldo’s soccer club Juventus now has its own crypto token $JUV\nFans can buy $JUV via Socios.com’s app and get the right to vote on certain club decisions\nAlexandre Dreyfus, founder and CEO of Socios.com, told The Block: “99.9% of sports fans are not in the city\/country of the team they are supporting. We created these fungible fans tokens to allow fans to have an influence over some fan-based initiatives”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/49038\/ronaldos-soccer-club-juventus-now-has-a-token-that-gives-its-over-400m-fans-voting-power","publishDate":"2019-12-03T05:20:13","id":2975,"type":null,"title":"Ronaldo’s soccer club Juventus now has a token that gives its over 400M fans voting power","category":["Cryptocurrency"],"content":["Italy’s Juventus Football Club, which boasts Cristiano Ronaldo as a team member, now has its own crypto token that gives voting power to its over 400 million fans.","Juventus has partnered with sports-focused blockchain startup Socios.com for the token $JUV, according to an announcement shared with The Block on Tuesday. Juventus’ fans can buy these tokens via Socios’ app and get the right to vote on certain club decisions and earn rewards.","“99.9% of sports fans are not in the city\/country of the team they are supporting. We created these fungible fans tokens to allow fans to have an influence over some fan-based initiatives,” Alexandre Dreyfus, founder and CEO of Socios.com, told The Block.","For instance, fans can cast their votes on the first poll to help decide which song should replace Chelsea Dagger, which is currently played every time Juventus scores a goal at the Allianz Stadium. Fans have four options to choose from: Blink 182 - All The Small Things; Blur - Song 2; House of Pain - Jump Around; and P.O.D - Boom, for the new song to be played next year.","Only those fans who have $JUV tokens are eligible to vote. $JUV is currently priced at around €2 (~$2.2) apiece. A limited number of these tokens are also available for free via Socios app’s Augmented Reality feature, Token Hunt, per the announcement.","\"We are proud to be the first Club to be activated by Socios.com on its platform, inaugurating a new way to interact with our fans around the world,” said Giorgio Ricci, chief revenue officer of Juventus.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">Plans ahead<\/strong>","Looking ahead, Socios is planning to tokenize more football clubs around the world. It has already lined up six deals for Q1 2020. These include Paris Saint-Germain (PSG) and Atlético de Madrid (tokens for which will be launched in late January); West Ham United, Galatasaray and A.S. Roma (in February) and esports provider OG (in March), per the announcement.","Socios further said that “dozens” of clubs are ready to join the platform as well, the details of which will be announced before the end of this year.","“In Q1 of 2020, we will also be launching trading pairs ($JUV\/\/Chiliz ($CHZ), $PSG\/$CHZ, etc.), allowing fans to acquire\/trade tokens. Tokens are indivisible,” Dreyfus told The Block.&nbsp; $CHZ is Socios’ native token and is currently <a href=\"https:\/\/www.binance.com\/en\/trade\/CHZ_BTC\" data-v-f87c67ca=\"\">listed<\/a> on cryptocurrency exchange Binance - priced at $0.011 apiece.&nbsp;"],"hashtag":[]}