{"summary":"Bitfinex’s parent company iFinex Inc. filed an application for discovery in the US District Court for the Central District of Southern California on October 18, 2019\nBitfinex states that the requested discovery is tied to the company’s effort to recover $880 million of funds that were entrusted by Bitfinex to Global Trade Solutions AG, also known as Crypto Capital\nBitfinex has been unable to access the $880 million in funds from Crypto Capital since at least December 2018, as the payment processor claims that its bank accounts in Poland, Portugal, the UK and the U.S. have been seized or frozen by government agencies","author":["The Block","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/43903\/bitfinex-files-discovery-application-in-attempt-to-regain-access-to-880-million-from-crypto-capital-others","publishDate":"2019-10-20T23:01:39","id":2977,"type":null,"title":"Bitfinex files discovery application in attempt to regain access to $880 million from Crypto Capital, others","category":["Startups"],"content":["Cryptocurrency exchange Bitfinex's parent company iFinex Inc. filed an application for discovery in the US District Court for the Central District of Southern California on October 18, 2019 related to $880 million in allegedly inaccessible funds tied to the cryptocurrency exchange's payment processing relationship with Crypto Capital and other entities.","Bitfinex requests a subpoena to take a deposition from Rondell \"Rhon\" Clyde Monroe and require the production of documents by Monroe, a Vice President of TCA Investment Bancorp and Trust Company (TCA Bancorp.) The application by iFinex, a British Virgin Islands corporation, is made under <a href=\"https:\/\/www.law.cornell.edu\/uscode\/text\/28\/1782\" data-v-f87c67ca=\"\">28 U.S.C. ยง1782(a)<\/a>, a federal law that can be used to allow discovery tools in U.S. courts to aid with non U.S. litigation. Thus, the application, if approved, would allow for a deposition and document production in foreign cases described therein. Bitfinex CFO Giancarlo Devasini filed a supporting declaration along with the application.","Bitfinex states that the requested discovery is tied to the company's effort to recover $880 million of funds that were entrusted by Bitfinex to Global Trade Solutions AG, also known as Crypto Capital. Bitfinex states that Crypto Capital had provided payment processor services to the cryptocurrency exchange since 2014, but primarily during the period from 2017-18 when Bitfinex had lost its banking relationships with banks in Taiwan, allegedly under pressure from U.S. banks.","Bitfinex further alleges that it has been unable to access the $880 million in funds from Crypto Capital since at least December 2018, as the payment processor claims that its bank accounts in Poland, Portugal, the UK and the U.S. have been seized or frozen by government agencies. Bitfinex has already or plans to initiate legal proceedings in all of these countries in an attempt to recover the funds.","Bitfinex alleges that Crypto Capital used one or more accounts at TCA Bancorp to facilitate the transfer of the exchange's funds. Bitfinex believes that Monroe has information and documents that will help to prove this relationship and substantiate Bitfinex's claims to hundreds of millions of dollars.","According to Bitfinex, Monroe and TCA Bancorp are in possession of $306 million of Bitfinex funds via a UK entity, G.T.S. Resources Limited (aka Spiral Global Development Limited), which is wholly owned by Reginald Fowler. Bitfinex alleges that it was unaware of Crypto Capital's relationship with Fowler until December 2018. Fowler is currently the subject of a <a href=\"https:\/\/www.theblockcrypto.com\/post\/21797\/us-government-requests-detention-for-defendant-at-center-of-bitfinex-imbroglio-describes-master-us-workbook\" data-v-f87c67ca=\"\">fraud investigation<\/a> by the U.S. Attorney's Office. Crypto Capital allegedly represents that a further $355 million in Bitfinex funds are held in accounts at Bank Spoldzielczy in Poland and $218 million is being held at 3 banks in Portugal. The sum of these three amounts is $880 million.","As part of the discovery application, Bitfinex requests information on alleged ownership and account usage by Crypto Capital at a number of U.S. banks, including HSBC, Citibank, Bank of America, Sun Trust, TD Bank, US Bank, Wells Fargo and more. This information is meant to establish a link between Bitfinex and the funds being held in Poland, Portugal and the UK.","The court filings can be viewed in their entirety below:","<a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2019\/10\/iFinex-Discover-Application-10.18.19.pdf\" data-v-f87c67ca=\"\">iFinex Discovery Application 10.18.19<\/a>","<a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2019\/10\/Bitfinex-CFO-Giancarlo-Devasini-Declaration.pdf\" data-v-f87c67ca=\"\">Bitfinex CFO Giancarlo Devasini Declaration<\/a>"],"hashtag":[]}