{"summary":"According to a recent study by the European Parliament Research Service, E.U. regulators should expand the scope of both cryptocurrency’s definition and the list of crypto-related entities subject to laws \nResearchers also found it problematic that financial institutions are allowed to engage with crypto assets and believe investors should get clearer instructions regarding crypto-assets’ high-risk nature. ","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/61568\/europe-should-move-to-cover-regulatory-blind-spots-for-crypto-assets-eu-parliament-report","publishDate":"2020-04-10T16:27:06","id":2979,"type":null,"title":"Europe should move to cover regulatory &#x27;blind spots&#x27; for crypto assets: EU Parliament report","category":["Regulation"],"content":["<span data-v-f87c67ca=\"\">The European Parliament’s in-house think tank is recommending the E.U. broaden the definition of cryptocurrency and expand the list of crypto-related entities subject to regulations.<\/span>","<span data-v-f87c67ca=\"\">In May 2018, the E.U adopted the <a href=\"https:\/\/www.theblockcrypto.com\/daily\/51782\/amld5-fills-regulatory-void-for-crypto-firms-but-state-by-state-rules-pose-challenges\" data-v-f87c67ca=\"\">Fifth Anti-Money Laundering Directive (AMLD5)<\/a>. It proposed a stringent regulatory framework requiring crypto exchanges and custodial service providers to register with regulators and demonstrate compliance with know-your-customer (KYC) and anti-money laundering (AML) rules.<\/span>","<span data-v-f87c67ca=\"\">However, in a new <a href=\"https:\/\/www.europarl.europa.eu\/RegData\/etudes\/STUD\/2020\/648779\/IPOL_STU(2020)648779_EN.pdf\" data-v-f87c67ca=\"\">study<\/a> published by the European Parliament Research Service, researchers argued that the AMLD5 framework is now outdated when compared to higher international standards such as that of the Financial Action Task Force (FATF).<\/span>","<span data-v-f87c67ca=\"\">“To bring the European AML\/CFT framework up to speed with the current reality in the crypto-space, the EU could consider<\/span> <span data-v-f87c67ca=\"\">a number of regulatory actions,” the report said.<\/span>","<span data-v-f87c67ca=\"\">The first recommendation concerns the expansion of the AML\/CFT framework's regulatory scope. For one, researchers observed a “massive growth” in the number of platform tokens and proposed the inclusion of private tokens as a subcategory of cryptocurrency.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Moreover, some crypto-related entities – include exchanges facilitating crypto-to-crypto transactions, financial institutions participating in cryptocurrency offerings and centralized trading platforms – are not covered by the current framework and should be targeted for AML purposes.<\/span>","<span data-v-f87c67ca=\"\">Cryptocurrency miners also need to be further scrutinized, the report said.<\/span>","<span data-v-f87c67ca=\"\">“Nowadays, coins have emerged that do not always require big energy-consuming server farms to mine, but that can be mined running a few hardware rigs at home,” the report said. “As it stands, such rigs can be set up by anyone, also by criminal actors.”<\/span>","<span data-v-f87c67ca=\"\">“Newly mined coins are by definition “clean”, so if someone (e.g., a bank) is willing to convert them into fiat currency or other crypto-assets, the resulting funds are also clean,” the report continued. “A first regulatory step could be to try to map the use of this technique and subsequently, if it effectively proves an important blind spot, to consider appropriate counter measures.”<\/span>","<span data-v-f87c67ca=\"\">Interestingly, researchers asserted that coin developers and non-custodial wallet providers should not be subject to AML procedures because they are merely providing the technological infrastructure.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Cryptocurrencies are subject to price volatility, the report said, and have not proven to be resilient to market fluctuations. Additionally, they do not easily fit into existing financial laws and therefore represent even greater risks to investors.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As a result, researchers found it problematic that financial institutions are allowed to engage with crypto assets under current regulations.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“At present, EU financial laws do not prohibit financial institutions from holding or gaining exposure to crypto-assets or from offering services relating to crypto-assets,” the report said. “If financial institutions decide to acquire them and take them on their balance sheets or engage in activities that involve them, they could face enormous losses.”<\/span>","<span data-v-f87c67ca=\"\">&nbsp;“As part of a conservative prudential treatment, for now, the best way forward to deal with the uncertainty surrounding crypto-assets, is probably to deduct them from a financial institution’s own funds,” the report added.<\/span>","<span data-v-f87c67ca=\"\">Moreover, researchers believe that E.U. regulators should more clearly label unregulated cryptocurrencies as high-risk assets.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Crypto-assets that do not qualify as MiFID II financial instruments, nor EMD2 electronic money, and hence, escape all EU financial regulation, the EU should, at the very least, put appropriate risk disclosure requirements in place, so that investors and\/or consumers can be made aware of the potential risks prior to committing funds to these crypto-assets,” said the report.<\/span>"],"hashtag":["EUROPEAN PARLIAMENT"]}