{"summary":"Traders can now access BitMEX’s cryptocurrency derivatives data via Refinitiv’s Eikon Terminal, a spin-off of Reuters similar to the Bloomberg Terminal \nThe integration of BitMEX’s data to Eikon is facilitated by CryptoCompare, which has a longstanding partnership with Reuters\nAs the Eikon Terminal is widely used in the traditional financial industry, this new collaboration aims to lure institutional investors into the new asset class","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/26635\/a-bloomberg-rival-is-giving-its-users-access-to-bitmexs-derivatives-data","publishDate":"2019-06-10T16:51:31","id":2981,"type":null,"title":"A Bloomberg rival is giving its users access to BitMEX&#x27;s derivatives data","category":["Institutional Investors"],"content":["<span data-v-f87c67ca=\"\">Cryptocurrency derivatives shop BitMEX is looking to tap into a pool of institutional investors via the rival of the ubiquitous Bloomberg Terminal.<\/span>","The Eikon Terminal, a spin-off of Thomson Reuters and Bloomberg's main rival<span data-v-f87c67ca=\"\">, now supplies traders with cryptocurrency futures data from BitMEX. The collaboration between the terminal and the crypto derivatives shop is facilitated by crypto market data firm CryptoCompare, which has a long-term partnership with Reuters, according to CryptoCompare CEO Charles Hayter. <\/span>","<span data-v-f87c67ca=\"\">BitMEX's dataset will be delivered to the terminal via CryptoCompare’s existing contribution channel with Eikon. CryptoCompare will manage the exchange’s relationship with the data vendor and integrate its data to the terminal, according to Hayter.&nbsp;<\/span>","\"CryptoCompare contributions conduit can deliver it [BitMEX's data] to Refinitiv\/Eikon seamlessly, thanks to our longstanding partnership - sparing BitMEX a costly, time-consuming integration and onboarding process with Refinitiv,\" said Hayter.&nbsp;","<strong data-v-f87c67ca=\"\">Luring institutional investors<\/strong>","<span data-v-f87c67ca=\"\">BitMEX is hoping that the partnership can lure institutional investors into the new asset class and gain the exchange some traction from the traditional financial industry. <\/span>","<span data-v-f87c67ca=\"\">As one of the most popular derivatives marketplaces that traded an <\/span><span data-v-f87c67ca=\"\">average daily volume of <\/span><a href=\"https:\/\/www.cryptocompare.com\/media\/35650606\/cryptocompare_exchange_review_2019_04.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$1.14 billion in April<\/span><\/a><span data-v-f87c67ca=\"\">, BitMEX <a href=\"https:\/\/blog.bitmex.com\/bitmex-technology-scaling-part-2-the-road-to-100x\/\" data-v-f87c67ca=\"\">prioritizes its API offering<\/a> that allows tech-savvy traders to stream live trading feeds. <\/span>The data that BitMEX provides via<span data-v-f87c67ca=\"\"> the Eikon Terminal will essentially be the same as that through its API, although the partnership with Eikon is also tasked with the ambition to ease institutional traders into the cryptocurrency market via the data platform they are used to. <\/span>","<span data-v-f87c67ca=\"\">“This is just a step in the evolution of crypto to help it mature and reach its next phase, where people become comfortable with it and understand it and get used to it,” said Hayter. <\/span>","<span data-v-f87c67ca=\"\">Meanwhile, the Eikon Terminal is counting on BitMEX’s dominance in the bitcoin futures market to furnish its platform with a wealth of cryptocurrency derivatives data that can meet the demand from institutional traders for more information on the cryptocurrency market, according to a statement.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Prior to the partnership with BitMEX, the Eikon Terminal already sourced cryptocurrency data such as trading pair prices from CryptoCompare and other exchanges, according to Hayter. However, in terms of providing data on specific cryptocurrency products, Hayter thought the platform<\/span><span data-v-f87c67ca=\"\"> \"is not holistic as of yet.\"<\/span>","<strong data-v-f87c67ca=\"\">What about Bloomberg?<\/strong>","<span data-v-f87c67ca=\"\">Elsewhere, Bloomberg is also gathering its own data for its cryptocurrency investors. To start, it lists CryptoCompare’s cryptocurrency indices on its terminal as well, according to Hayter. Last June, the Bloomberg Terminal also added<\/span><a href=\"https:\/\/www.coindesk.com\/bloomberg-terminal-adds-huobis-cryptocurrency-market-index\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> Huobi's price index<\/span><\/a> to its platform, which tracks the performance of <span data-v-f87c67ca=\"\">the top 10 cryptocurrencies traded on Huobi Pro. However, Hayter said that compared to Bloomberg, “Reuters has a much more definitive offering.” &nbsp;<\/span>","Hayter pointed out that the granularity of the data that CryptoCompare deliver to Reuters' terminal, including data from BitMEX, enables the terminal to provide more information on the cryptocurrency market than the Bloomberg terminal.&nbsp;","It is unclear if BitMEX <span data-v-f87c67ca=\"\">will form additional partnerships with Bloomberg or other data vendors to increase public exposure for its trading platform. However, as Hayter noted, delivering trading data to as many platforms as possible may turn out to be beneficial to cryptocurrency exchanges. <\/span>","<span data-v-f87c67ca=\"\">“I suggest that any exchange should get its data on as many places as possible,” said Hayter. “It is a sensible strategy as it allows more people to be aware of the exchange, be aware of the price activities, and it’s an advertising mechanism for the exchange to gain volume.” <\/span>"],"hashtag":["BITMEX"]}