{"summary":"The treasury management platform will helm the ENS DAO endowment fund as the project looks to navigate the current bear market.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189492\/ens-dao-votes-for-karpatkey-to-manage-its-endowment-fund","publishDate":"2022-11-23T08:44:02","id":2986,"type":null,"title":"ENS DAO votes for Karpatkey to manage its endowment fund","category":["CRYPTO ECOSYSTEMS"],"content":["ENS DAO, the decentralized community for the Ethereum Name Service project, has voted to select the treasury management platform Karpatkey DAO to manage its endowment fund.","The vote, which began on Nov. 18, ended on Nov. 23, according to <a href=\"https:\/\/snapshot.org\/#\/ens.eth\/proposal\/0x1ab7ef84f6e904582d5b5b921944b5b1a8e36dbff1f1248fde87fef02b046816\" data-v-f87c67ca=\"\">details<\/a> from Snapshot. Karpatkey was among four other choices that included DeFi management protocols Avantgarde and Llama, as well as an option for none of the above. The vote was via ranked choice, which meant voters had to rank the options in their order of preference. Karpatkey emerged as the most popular option, securing over 57% of the votes cast.","There was some drama near the end of the vote as Coinbase and Ethereum wallet platform Rainbow voted for none of the above as their preferred option. The vote cast by both parties temporarily swung the polls in favor of their preferred option. Defending its choice, Coinbase <a href=\"https:\/\/discuss.ens.domains\/t\/social-ep2-2-5-selection-of-an-ens-endowment-fund-manager\/15188\/97\" data-v-f87c67ca=\"\">posted<\/a> on the ENS DAO forum that the risk and reward didn’t seem reasonable. “We’d prefer to wait for the treasury management space to mature further,” Coinbase added.","Following the conclusion of the vote, the ENS meta-governance stewards will work with Karpatkey to develop an initial treasury allocation. Karpatkey’s original bid to the DAO called for a $52 million endowment fund. The treasury management outfit promised to grow the fund to $69 million.","The endowment fund will come from the ENS DAO <a href=\"https:\/\/deepdao.io\/organization\/228c8be1-9d1e-440c-8afb-a40d6ee480f2\/organization_data\/finance\" data-v-f87c67ca=\"\">treasury<\/a>, which is currently worth $926 million. ENS, the project’s native token, forms the bulk of this sum as the treasury holds $880 million worth of ENS. The ENS treasury also holds $43 million in ether and $2.4 million in USDC.","The endowment fund is part of the DAO’s treasury management efforts. Treasury management has become <a href=\"https:\/\/www.theblockcrypto.com\/news+\/163745\/daos-wrestle-with-how-to-winterize-their-war-chests\" data-v-f87c67ca=\"\">a major concern for DAOs<\/a> amid the current market decline. The ENS endowment fund is supposed to enable the project to meet its financial obligations even if the current bear market decline continues.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nov. 18","content":"DATE"},{"type":"$2.4 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$43 million","content":"MONEY"},{"type":"Karpatkey","content":"PERSON"},{"type":"$926 million","content":"MONEY"},{"type":"$69 million","content":"MONEY"},{"type":"$880 million","content":"MONEY"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"$52 million","content":"MONEY"},{"type":"Ethereum Name Service","content":"ORGANIZATION"},{"type":"57%","content":"PERCENT"},{"type":"USDC","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Nov. 23","content":"DATE"},{"type":"Llama","content":"LOCATION"}],"hashtag":["DAOS","GOVERNANCE VOTES"],"authors":["Osato Avan-Nomayo","The Block"]}