{"summary":"Binance veteran Xin Jiang said the primary and secondary markets have bottomed out, making it the best time to invest in web3.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/249175\/memefi-twitterfi-telegramfi-next-cycle-binance-veteran-vc-says","publishDate":"2023-09-05T09:50:17","id":2987,"type":null,"title":"MemeFi, TwitterFi and TelegramFi to lead next web3 cycle: ex-Binance VC","category":["WEB3"],"content":["Xin Jiang, founding partner at venture capital firm Old Fashion Research, thinks that primary and secondary markets have bottomed out, making it the \"<a href=\"https:\/\/www.noweb3.ai\/p\/what-kind-of-dapp-do-we-need?utm_source=profile&amp;amp;utm_medium=reader2\" data-v-f87c67ca=\"\">best time to invest in web3<\/a>.\" Projects like memecoins, Friend.tech and Unibots are where it's at.","One thing Xin Jiang says crypto doesn't need is more infrastructure projects.","\"If you are a rational and neutral investor, please admit, we don't need more infra projects,\" Xin Jiang said in a blog post. \"Current infra can sustain us to the next bull run or maybe even the next bull, if there is one.\"","With Solana, Ethereum Layer 2 rollups and incoming zkEVMs, scalability isn't an issue, and neither is decentralization. What's missing are the \"killer apps\" for this cycle, Xin Jiang added.","Old Fashion Research — whose name was taken from the classic drink — was founded in late 2021 by Ling Zhang, former VP of Strategic Investments and M&amp;A at Binance, Wayne Fu, former Head of Corporate Development, and Xin Jiang, who was a former Investment Director and Head of Launchpad at Binance Labs.&nbsp;","In May 2022, <a href=\"https:\/\/www.theblock.co\/linked\/148890\/100-million-fund-founded-by-ex-binance-execs-comes-out-of-stealth\" data-v-f87c67ca=\"\">OFR revealed a $100 million fund<\/a> focused on blockchain investments after coming out of stealth. Its investment portfolio includes Nansen, Mexc Global, Pudgy Penguins, WOO Network, Sei, Boba Network, Lookonchain and Genopets.","Xin Jiang argues that memecoins, Friend.tech and Unibots are examples of the new DeFi for the next cycle, successfully leveraging social media and messaging platforms like the social network formerly known as Twitter and Telegram.","Memecoins like <a href=\"https:\/\/www.theblock.co\/post\/244646\/harrypotterobamasonic10inu-leads-latest-memecoin-rally-surging-30\" data-v-f87c67ca=\"\">HarryPotterObamaSonic10Inu<\/a> have fostered a unique \"degen\" culture, according to Xin Jiang — offering a more equitable token mechanism compared to the VC-backed tokens that often come with inflated billion-dollar valuations and \"over-hyped strategies\" that are susceptible to being \"dumped.\"","\"In my opinion, memecoins have become another cultural phenomenon that has gained traction in the crypto world, following the popularity of NFT PFPs,\" Xin Jiang added.","When it comes to Friend.tech, while most see it as a social platform, Xin Jiang argued it is more like a financial product built on top of X's (formerly Twitter) user network. It's not about creating a new social paradigm but about monetizing an existing network, essentially pre-tokenizing X before any official token launch, the OFR partner said.","<a href=\"https:\/\/www.theblock.co\/post\/246423\/friend-tech-fees\" data-v-f87c67ca=\"\">Friend.tech's 24-hour fees climbed to $1.4 million<\/a> on Aug. 21, ranking third after Ethereum and Lido. However, user activity has declined over 95% in terms of daily transactions since this peak, according to The Block's data dashboard. It remains to be seen if these numbers can pick back up again going into the next cycle.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/social-decentralized-finance\/friend-tech-daily-transactions\/embed\" title=\"friend.tech Transactions\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Similarly, Unibots taps into Telegram's vast user base, popular among the crypto community, introducing features tailored for meme traders, such as limit orders and copy trades.","\"While many teams are touting their 'intent-centric' concept, Unibots has already put the concept into daily use millions of times,\" Xin Jiang said, adding that \"their token design is carefully crafted with a fair launch model that maximizes community interest and aligns token value directly with revenue.\"","<span data-v-f87c67ca=\"\">However, in July, the rising interest in trading bots on Telegram like <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Unibot <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248535\/unibot-unibot-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/logonoline_28129.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">UNIBOT<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -9.16%\n    <\/span><\/a> <!----><\/span><\/span>, as well as Swipe, WagieBot and Bolt sparked <\/span><a href=\"https:\/\/www.theblock.co\/post\/241386\/telegram-crypto-trading-bots-spark-fears-over-security-vulnerabilities\" data-v-f87c67ca=\"\">concerns about their security<\/a> over the handling of users' private keys.","For a dapp to achieve widespread adoption, it should encompass product, subculture creativity and tokenomics elements, Xin Jiang said.","\"Memecoins have sparked a subculture craze and feature a well-designed token mechanism, but currently lack an available product. Friend.tech has a strong approach to product launches and a well-designed token system for bootstrapping. However, it doesn't embody any specific subculture. Unibots has successfully launched a great product, and the token model aligns well with it. However, the project has yet to establish its own distinctive subculture,\" the OFR partner added.","\"MemeFi,\" \"TwitterFi\" and \"TelegramFi\" dapps that can combine all three of these elements are the most likely to succeed in the next cycle, Xin Jiang,\" continued.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Wayne Fu","content":"PERSON"},{"type":"WOO Network","content":"ORGANIZATION"},{"type":"Binance Labs","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"Xin Jiang","content":"PERSON"},{"type":"VP of Strategic Investments","content":"ORGANIZATION"},{"type":"OFR","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ling Zhang","content":"PERSON"},{"type":"Nansen","content":"ORGANIZATION"},{"type":"Boba Network","content":"ORGANIZATION"},{"type":"Lookonchain","content":"PERSON"},{"type":"Binance","content":"LOCATION"},{"type":"May 2022","content":"DATE"},{"type":"Pudgy Penguins","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Head of Corporate Development","content":"ORGANIZATION"},{"type":"Aug. 21","content":"DATE"},{"type":"95%","content":"PERCENT"},{"type":"Lido","content":"LOCATION"},{"type":"-9.16%","content":"PERCENT"},{"type":"Jiang","content":"PERSON"},{"type":"$1.4 million","content":"MONEY"},{"type":"Old Fashion Research","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Head of Launchpad","content":"ORGANIZATION"}],"hashtag":["INVESTMENT FIRMS"],"authors":["James Hunt","The Block"]}