{"summary":"Uncollateralized lender Maple Finance has updated its protocol to a second version aimed at opening up the lending platform to a wider range of institutional borrowers, including those from outside the crypto industry. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/194907\/maple-finance-releases-version-2-0-after-36-million-default-on-platform","publishDate":"2022-12-14T10:52:05","id":2990,"type":null,"title":"Maple Finance releases version 2.0 after $36 million default on platform","category":["DEFI"],"content":["Uncollateralized lender Maple Finance has updated its protocol to a second version aimed at opening up the lending platform to a wider range of institutional borrowers, including those from outside the crypto industry.&nbsp;","With the new update, called Maple 2.0, the team hopes to reduce the risks associated with its services that arise from sector concentration. Currently, most of the lending activity on Maple involves crypto firms and market makers in the digital assets space, which Maple said exposed the protocol to contagion risk from the fallout related to the collapse of the FTX exchange.&nbsp;","Maple Finance is a decentralized protocol that enables verified firms to access loans without collateral. The company's operations differ from normal crypto lending protocols like Aave, where each loan is secured with excess collateral. In addition, Maple does not take the credit risk by itself, as it only provides the lending infrastructure while other eligible firms called “Maple delegates'' offer lending pools.&nbsp;","Anyone can add funds to Maple’s pools and earn interest, and it's up to the delegates to check the creditworthiness of a borrower. Last week, a delegate called M11<a href=\"https:\/\/www.theblock.co\/post\/192097\/maple-finance-default-orthogonal-trading\" data-v-f87c67ca=\"\"> suffered a $36 million default<\/a> from crypto firm Orthogonal Trading, which had borrowed from an M11-run pool on Maple. Orthogonal claimed its funds became tied up on the bankrupt exchange FTX.&nbsp;","The Orthogonal default has drawn skepticism from crypto industry players about the viability of uncollateralized lending. Maple’s chief, however, says that uncollateralized lending is a necessity to bring players from multi-trillion dollar capital markets to the blockchain.","“Maple is set up to target institutional borrowers and institutional lenders,\" Maple CEO and co-founder Sidney Powell said. \"I know that uncollateralized lending is not vogue in the decentralized finance space. But it is the way that most business finance works, you know, Apple doesn't go and put down a bunch of collateral in order to borrow from a bank.”","Rather than pivoting away from such lending practices, Powell said Maple would focus on better managing risk for its delegates, which serves as the main factor for its latest update. The platform is also seeking to attract more delegates with diversified sector expertise.&nbsp;","After the new update, the firm said its delegates — who double as underwriters – will adopt better risk parameters as well as the ability to verify on-chain capital.","“Maple 2.0 is a complete overhaul of our smart contract infrastructure, as well as a new web app and experience for interacting with those smart contracts,” Powell said. The update has also introduced multiple technical improvements that were previously not present.","For example, Maple has introduced a new and more immediate default process. If a borrower fails to uphold the terms of agreement, a pool delegate will be able to declare an early default which immediately makes the loan payable. If no payment is made within the grace period, the delegate can liquidate the loan and all lenders in that pool will realize losses right away while recovery efforts are pursued.","Another improvement is that Maple will let lenders deposit and request withdrawals from the platform at any time without waiting for the existing 30-day capital lock-up period to lapse.&nbsp;","Outside of crypto, Maple team sees an opportunity to lend to fintech firms seeking debt financing for the first time. The company said it's receiving attention from large banking players and other financial institutions that are interested in borrowing from the platform but did not reveal specific names.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sidney Powell","content":"PERSON"},{"type":"Maple","content":"ORGANIZATION"},{"type":"Orthogonal Trading","content":"ORGANIZATION"},{"type":"Maple Finance","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Powell","content":"PERSON"},{"type":"fintech","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$36 million","content":"MONEY"}],"hashtag":["LENDING"],"authors":["Vishal Chawla","The Block"]}