{"summary":"Grayscale on Tuesday announced inflows for the third quarter of 2019 marked a number of records\nIn Q3, inflows, over the past year, hit over 400M\nGrayscale’s managing director Michael Sonnenshein says the firm counts a number of hedge funds with several of billions of dollars as clients ","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/43226\/grayscale-sees-over-400m-of-inflows-in-q3-driven-by-billion-dollar-hedge-funds","publishDate":"2019-10-15T09:00:43","id":2992,"type":null,"title":"Grayscale sees record Q3, hitting more than $400M in inflows over the past year","category":["Institutional Investors"],"content":["The institutions are here.&nbsp;","That's the underpinning thesis of a new report highlighting asset manager Grayscale's inflows during the third quarter of 2019, according to managing director Michael Sonnenshein.&nbsp;","\"I actually think that we had a day where we raise over $75 million in a single day — which was the largest inflow we ever had in a single day,\" Sonnenshein said during an upcoming episode of The Scoop.&nbsp;","That's larger than the size of Grayscale when Sonnenshein joined the firm from JPMorgan in 2014.&nbsp;","As per the report, inflow momentum reached its highest level in Q3, bringing in a record $254.9M under Grayscale's management in a single quarter. As such, inflows over the past year hit a record $412.M. In total, the firm manages over $2 billion on behalf of institutional investors, wealthy individuals, and hedge funds.","","","<span data-v-f87c67ca=\"\">Source: Grayscale Q3 2019 Digital Asset Investment Report<\/span>","Strikingly, a significant portion of inflows poured into Grayscale's alternative cryptocurrencies funds compared to previous quarters, the report shows. In total, the assets managed in the funds, excluding its flagship GBTC product, grew by $107M in Q3. Grayscale operates a total of 10 funds tied to the cryptocurrency market, including ones tied to ZCash, Ethereum Classic, and its <a href=\"https:\/\/www.theblockcrypto.com\/linked\/43232\/grayscale-gets-finra-approval-for-digital-large-cap-fund\" data-v-f87c67ca=\"\">Grayscale Digital Large Cap Fund<\/a>, which Monday received clearance from FINRA to trade openly in the over-the-counter market.&nbsp;","","","<span data-v-f87c67ca=\"\">Source: Grayscale Q3 2019 Digital Asset Investment Report<\/span>","<br data-v-f87c67ca=\"\">\nSonnenshein attributed recent asset growth to the firm's May launch of its #DropGold campaign, which called on U.S. investors to ditch the precious metal and join the bitcoin movement. Despite the team's small size, Sonnenshein noted Grayscale's boots-on-the-ground approach to sales as being a key part of its strategy.","<b data-v-f87c67ca=\"\"><\/b>\"Our team is out on the road quite a bit with investors and will descend on a city — call it Chicago or we were just in Vancouver a couple of days ago,\" he said. \"What's been interesting to see is that even though we only give ourselves two or three days in a given place we're actually so busy we're either have to divide and conquer as a team to make sure we see everyone or in a lot of instances we're actually turning down meetings and having to schedule follow up calls or emails because we just don't have enough time while we're in a given place to kind of see everyone.\"","<strong data-v-f87c67ca=\"\">Billion-dollar funds<\/strong>","As for the client make-up, Sonnenshein said that much of the growth is being driven by traditional funds and investors, despite the widespread notion in the market that such firms are still sitting on the sidelines.&nbsp;","\"Most of our institutional investors are actually not crypto hedge funds,\" he said. \"It really runs the gamut — we have tons of global macros funds who maybe look at digital assets as a way to be short fiat money or thinking about all the economic and political turmoil going on globally.\"&nbsp;","Sonnenshein says the fund's structure as securities make them a more palatable avenue to invest in the crypto market compared to opening up an account on Coinbase and investing directly. Still, investing with Grayscale comes with its own drawbacks. For instance, in many instances the price of the fund does not always perfectly correlate with the underlying crypto — the result of an imbalance between supply and demand, Sonnenshein says.&nbsp;","That's not keeping funds managing as much as $10 billion away. Sonnenshein says Grayscale counts funds in the $10 to $15 billion range as clients. Such funds only make up approximately 8.5% of the more than 10,000 total hedge funds in existence, as per data from <a href=\"https:\/\/www.eurekahedge.com\/Products\/Billion-Dollar-Hedge-Fund-Database\" data-v-f87c67ca=\"\">Eureka Hedge<\/a>.&nbsp;"],"hashtag":[]}