{"summary":"A judge has certified a class-action suit in federal court in Connecticut, in a case alleging securities fraud by GAW Miners and other defendants\nThis may be the first class certification in a case involving cryptocurrency\nThis follows an earlier SEC enforcement action and wire fraud plea by Garza in 2017","author":["Stephen D. Palley","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/29333\/gaw-miners-crypto-class-action-certified-3-years-after-filing-suit","publishDate":"2019-06-28T13:55:45","id":2996,"type":null,"title":"GAW Miners crypto class-action certified 3 years after filing suit","category":["Legal"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1] <\/strong><\/em><strong class=\"iy jp\" data-v-f87c67ca=\"\"><em class=\"jk\" data-v-f87c67ca=\"\">Audet v. Fraser<\/em>, 2019 U.S.Dist. LEXIS 04195 (D.Conn., 3:16-cv-0940, 6\/21\/19) [SDP]<\/strong>","As we’ve pointed out many times, just because you file a class-action lawsuit doesn’t mean that it’s actually a class action. All class actions are “putative”, a fancy way of saying so-called, unless and until a judge decides to certify it. That just happened in the long running GAW Miners litigation pending in federal court in Connecticut, in what may be the first class certification in a case involving cryptocurrency.","The case in a nutshell involves “Plaintiffs … who invested in products that ostensibly allowed them to share in the profits generated by ‘mining” … digital currency. They are suing two companies who sold them these products and an individual who allegedly controlled these companies” claiming a variety of fraud claims, in violation of federal and state securities laws and common law.","Plaintiffs initially sued Homero Joshua Garza, Stuart Fraser, GAW Miners LLC and ZenMiner LLC. The companies did not answer the Complaint and Plaintiffs took a judgment against them. The Court says that Fraser says Garza was dismissed after he agreed to cooperate with plaintiffs. It also says that Fraser is the only remaining active defendant.","According to the opinion, Garza met Fraser in 2003. Fraser was vice-chair of the investment bank Cantor Fitzgerald and invested in a number of Garza’s business ventures. In 2014, Garza incorporated GAW Miners and served as its CEO. Fraser invested in GAW and “served as ‘the Board’”. Garza a few months later incorporated ZenMiner, which was controlled by Garza and Fraser. (One assumes that Fraser remains a viable defendant from the plaintiffs’ persepective because as the vice-chair of an investment bank they imagine he has resources to pay a judgment).","GAW was formed to buy mining equipment from overseas and resell it to customers. In 2014 it “began selling Hardware-Hosted Mining.” Customers who bought this “were told that GAW Miners would host computer hardware in its own datacenter, but allow customers and access and control their equipment” using remote access software. They then began offering “Cloud-Hosting Mining”, a similar concept. Customers were told they could end hosted service any time they wanted and get their equipment mailed to them. Plaintiffs say that in reality this was all a bunch of b.s. and defendants didn’t actually have enough equipment to return to them and in fact that this was really a Ponzi scheme, where money from new customers was used to pay returns to existing customers.","In response to customers complaining they couldn’t see an increase in mining pool power, the defendants “offered customers the ability to convert their Cloud-hosted machines into another product … called Hashlets.” These were supposed to represent “a right to profit from a slice of the computing power owned by the Companies” with no right to physical equipment. When hashlets didn’t generate sufficient revenue, GAW said it was going to launch a new type of cryptocurrency called Paycoin and develop a marketplace for it called Paybase. There’s more complication described in the opinion but the bottom line is that if all of this sounds like three card monte to you you won’t be surprised that the SEC and DOJ thought so too. Garza and GAW Miners were sued by the SEC for securities fraud and he pleaded guilty to wire fraud on July 20, 2017.","With that background in mind, on to this opinion, which grants class action status to the complaint, defining the class as “All persons or entities who, between August 1, 2014 and January 19, 2015, (1) purchased Hashlets, Hashpoints, HashStakers, or Paycoin; or (2) acquired Hashlets, Hashpoints, Hashstakers or Paycoin by converting upgrading, or exchanging other products sold by the Company.”","The Court goes through a lengthy analysis of the procedural requirements for the procedural requirements of a class action — commonality, adequacy, typicality, numerosity, predominance and superiority, for you civil procedure buffs.","While the burden of proof for each element is on the plaintiff the court notes that where there is a doubt about certifying a securities fraud class actio, “the court should err in favor of allowing the class to go forward.” While we don’t predict the future here at crypto caselaw minute, I for one would not be surprised if this opinion and that particular citation were referenced in other crypto\/ICO securities class action opinions in the future.","Also of note if you are following other crypto class actions — including ones where people have made money — the Court says the class needn’t exclude people who broke even or profited. “A plaintiff suffers an injury in a securities fraud case when she changes her position — such as by buying or selling — as a result of a material misrepresentation.”","Class certification is a big hurdle of course, but this case is certainly not over yet. Note that this case was filed three years ago on June 16, 2016. These things take a LONG time to resolve. We will keep you updated as the case progresses.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part I of this week's analysis, Crypto Caselaw Minute, is above.<\/em>"],"hashtag":["SEC"]}