{"summary":"Tool for Humanity&#x27;s World App, a Worldcoin-compatible wallet, has amassed more than 10 million total users since it roll out last year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287876\/worldcoin-compatible-wallet-surpasses-10-million-users","publishDate":"2024-04-11T13:18:11","id":3,"type":null,"title":"Worldcoin-compatible wallet surpasses 10 million users","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Tools for Humanity’s <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Worldcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248504\/worldcoin-wld-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/worldcoin.jpeg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">WLD<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -2.075%\n    <\/span><\/a> <!----><\/span><\/span>-compatible wallet has acquired more than 10 million users.&nbsp;<\/span>","The World App wallet boasts users in more than 160 countries, including 2 million daily active users, its maker Tools for Humanity (TFH) <a href=\"https:\/\/worldcoin.org\/blog\/announcements\/tfh-world-app-passes-10-million-users\" data-v-f87c67ca=\"\">said<\/a> Thursday in a statement. The uptick in users dovetails with the rollout of new data management tools for users of Worldcoin, the iris-enabled biometric cryptocurrency project founded by OpenAI CEO Sam Altman.","\"We’re of course thrilled about the milestone, but even more so about the real world impact it represents,” TFH Product Head Tiago Sada said Thursday in a statement.&nbsp;","The wallet has averaged 7.1 transactions per second, meaning its transaction speed is roughly on par with that of the most popular self-custodial wallets, TFH said.&nbsp;","The World App debuted in May 2023 and amassed roughly 4 million downloads by November of that year. According to the TFH's data, since its inception, the World App has processed more than 70 million total wallet transactions.","The wallet's growth comes as Worldcoin debuted on Thursday two new privacy-focused features: A mechanism to revoke permissions for World IDs via permanent iris code deletion and in-person age verification checks at each humanness verification location.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"May 2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"TFH","content":"ORGANIZATION"},{"type":"Worldcoin","content":"LOCATION"},{"type":"Sam Altman","content":"PERSON"},{"type":"Tiago Sada","content":"PERSON"},{"type":"-2.075%","content":"PERCENT"},{"type":"November","content":"DATE"}],"hashtag":[],"authors":["Elizabeth Napolitano","The Block"]}