{"summary":"Glif has launched its points program before its token launch.\nThe Filecoin liquid leasing protocol will distribute 75 million points in the program.\nA source told The Block that Glif plans to convert points to its native token in a 1:1 ratio.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285488\/filecoin-protocol-glif-75-million-points-token","publishDate":"2024-03-28T15:00:04","id":30,"type":null,"title":"Filecoin protocol Glif set to distribute 75 million points ahead of token launch","category":["DeFi"],"content":["<span data-v-f87c67ca=\"\">Glif, a <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Filecoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248380\/filecoin-fil-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/filecoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">FIL<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.39%\n    <\/span><\/a> <!----><\/span><\/span> liquid leasing platform and the largest protocol in the Filecoin ecosystem, has launched its points program ahead of the token launch.&nbsp;<\/span>","Points are the first step towards decentralizing protocol decision-making, Glif said Thursday. Both parties in the Glif system — Filecoin storage providers (SPs) and liquidity providers (LPs) — are eligible to earn points, Glif said, adding that points are rewarded to both historical and future SPs and LPs.","As a liquid leasing protocol, <a href=\"https:\/\/www.theblock.co\/post\/276219\/filecoin-protocol-glif-funding-reward-points-token\" data-v-f87c67ca=\"\">Glif<\/a> allows <a href=\"https:\/\/www.theblock.co\/price\/248380\/filecoin-fil-usd\" data-v-f87c67ca=\"\">Filecoin (FIL)<\/a> token holders to deposit FIL to a liquidity pool and, in return, receive iFIL, Glif's native liquid leasing token. SPs rent deposited FIL and pay rental fees back to LPs and to the protocol. LPs earn their proportionate rental fees after depositing FIL.","With over $372 million in total value locked, Glif is currently the largest protocol in the Filecoin ecosystem, according to Filfox <a href=\"https:\/\/filfox.info\/en\/fevm\/navigation\" data-v-f87c67ca=\"\">data<\/a>.","Glif's points program comes two days before its first anniversary. The protocol has allocated 75 million points for historical (50 million) and future (25 million) SPs and LPs, with each party getting a 50% share of the total points.","The start date for historical points distribution is Mar. 30, 2023, when the protocol launched. The start date for future points is Mar. 28 and runs until Sept. 26, and the points distribution frequency is once every two weeks.","Glif plans to convert its points to its upcoming native token in a 1:1 ratio, a source with direct knowledge of the matter told The Block. The source said the token launch is expected sometime this summer. The Block recently reported that Glif plans to launch a \"governance token\" that would work similarly to other \"vote escrowed\" governance token models like veCRV.","Glif also plans to launch a quest program, a gamified experience that will provide users with new ways to earn more points, according to the source.","Points are becoming increasingly popular among crypto projects to reward loyal users. As The Block <a href=\"https:\/\/www.theblock.co\/post\/274587\/crypto-projects-40-billion-points?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">reported<\/a> recently, crypto projects have given out over 40 billion reward points so far."],"hashtag":["AIRDROP","PROTOCOLS","STAKING FIRMS","TOKENS"]}