{"summary":"According to a poll, 21% of people not currently owning crypto said they will be more likely to invest if a spot bitcoin ETF gets approved.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/270171\/non-crypto-owners-more-likely-to-invest-if-spot-bitcoin-etf-gets-approved-poll-shows","publishDate":"2024-01-03T12:31:04","id":3001,"type":null,"title":"Non-crypto owners more likely to invest if spot bitcoin ETF gets approved, poll shows","category":["CAPITAL MARKETS"],"content":["Crypto adoption is growing among Americans and the expectations of a spot bitcoin ETF approval could play a significant role, a new report by the cybersecurity research team Security.org shows.","According to a poll of 1,500 Americans, 40% of them currently own crypto, which is 10% more than last year's poll showed, Security.org <a href=\"https:\/\/www.security.org\/digital-security\/cryptocurrency-annual-consumer-report\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">said<\/a>. Of those not currently in crypto, 15 percent said they intended to purchase some this year, and 21% said they will be more likely to invest if the spot bitcoin ETF gets approved.","According to the poll, 46% of respondents said they believed bitcoin ETF approvals in 2024 will positively impact the blockchain industry.","There are currently 13 active spot bitcoin ETF applications on the U.S. Securities and Exchange Commission's table, and the decision deadline for the earliest one is Jan. 15. Among the contenders are giants like BlackRock, Fidelity, Franklin Templeton and others. The bitcoin price has been on the rise for the past two months as the potential approval is looming.","Among the current crypto owners, 63% hope to obtain more cryptocurrency over the next year, mostly in bitcoin, ether, dogecoin and cardano,&nbsp; according to Security.org.","Crypto owners are traditionally young and mostly male, the poll showed, although the amount of women buying crypto increased over the past year, Security.org said. \"This rise could result from the increasing visibility of women covering blockchain developments in the news and investing in cryptocurrency and blockchain companies,\" the report said, mentioning the Unchained Podcast host Laura Shin, Ark Invest founder and CEO Cathie Wood, crypto-friendly Senator Cynthia Lummis (R-WY) and SEC commissioner Hester Pierce as examples.","Blockchain intel firm Chainalysis earlier <a href=\"https:\/\/www.chainalysis.com\/blog\/north-america-cryptocurrency-adoption\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">said<\/a> that North America is the largest crypto market in the world and that it contributed to the 24.4% of global transaction activity.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Laura Shin","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"North America","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"21%","content":"PERCENT"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"63%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"Cathie Wood","content":"PERSON"},{"type":"Jan. 15","content":"DATE"},{"type":"15 percent","content":"PERCENT"},{"type":"46%","content":"PERCENT"},{"type":"24.4%","content":"PERCENT"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Cynthia Lummis","content":"PERSON"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"Hester Pierce","content":"PERSON"}],"hashtag":["SEC"],"authors":["Anna Baydakova","The Block"]}