{"summary":"Former FTX Head of Institutional Sales Zane Tackett says he once stumbled across millions in unclaimed airdrops.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/255037\/former-ftx-executive-once-found-millions-of-dollars-of-airdrops-that-the-exchange-didnt-know-about","publishDate":"2023-10-05T12:02:26","id":3002,"type":null,"title":"Former FTX exec once found airdrops worth millions it didn&#x27;t know about","category":["COMPANIES"],"content":["Zane Tackett, former head of institutional sales at FTX, once found millions of dollars worth of airdrops that the exchange had no idea about.&nbsp;","<a href=\"https:\/\/youtu.be\/1Z9heVKU9sg?si=wyamLyh-ZRjrofDk&amp;t=1044\" data-v-f87c67ca=\"\">On The Scoop podcast<\/a>, Tackett expressed his lack of surprise that so much has been recovered during FTX’s bankruptcy proceedings so far. He said the exchange was a sloppy place with bad accounting. “I remember one time I found millions of dollars worth of airdrops that they had gotten that they didn't know about,” he said.&nbsp;","“I don't think it's that impressive that they did it,” he added. “I think if you two handed this to any crypto firm, like if Binance bought them, they would have found all those assets in like two days and already had it back to the users.”","<iframe frameborder=\"0\" height=\"315\" src=\"\/\/www.youtube.com\/embed\/1Z9heVKU9sg?si=DLle1fzoU5YtLCx4\" title=\"YouTube video player\" width=\"560\" data-v-f87c67ca=\"\"><\/iframe>","Tackett added that he was surprised the liquidators hadn’t got more of the hacked funds back or worked out who did it. He said that if he had to guess who hacked the exchange, he would say a higher up former FTX or Alameda employee.&nbsp;","“And when I talked to Sam about it after — or like when everything was blowing up — he seemed so nonchalant, like, ‘Oh yeah, it was the battle between FTX.US and FTX.com to get assets like it's not lost’. So, I mean, I think he has some information on what happened to it, but I don’t know,” he said.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"Sam","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Zane Tackett","content":"PERSON"},{"type":"millions of dollars","content":"MONEY"},{"type":"Tackett","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FTX","SBF TRIAL"],"authors":["Tim Copeland","The Block"]}