{"summary":"Co-founder Rory Felton says the team learned its lesson and will prioritize protecting ownership rights now that the platform is live.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/162799\/after-a-rocky-beta-launch-music-nft-platform-hitpiece-is-prioritizing-ownership-rights","publishDate":"2022-08-10T15:53:48","id":3004,"type":null,"title":"Music NFT platform HitPiece officially launches after rocky beta ","category":["METAVERSE & NFT"],"content":["<span data-contrast=\"auto\" data-v-f87c67ca=\"\">HitPiece, the music non-fungible token (NFT) platform perhaps best known for the controversy it generated when it launched in beta back in February, is now officially live. And according to co-founder Rory Felton, the updated version will aim to avoid the same copyright issues that the beta version faced.<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">HitPiece's beta launch caused a stir among musical recording artists who <a href=\"https:\/\/www.theblock.co\/post\/132866\/music-nft-marketplace-hitpiece-slammed-for-selling-music-assets-without-artist-permission\" data-v-f87c67ca=\"\">claimed<\/a> that their work appeared on the platform without their knowledge or permission. <\/span><span data-contrast=\"auto\" data-v-f87c67ca=\"\">HitPiece eventually decided to take down its beta web page.<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Felton told The Block that it learned from the community feedback and made improvements to the platform, which the firm wants to become the go-to place for music NFTs.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">According to Felton, there was no music on the HitPiece beta platform at all, and that the startup would never sell music without the proper commercial rights. It was intended to be a private experience built on a private blockchain, he said. Nothing was decentralized or could be sold on a third-party marketplace.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Nonetheless, artists saw their work on HitPiece and claimed it had been minted as NFTs <a href=\"https:\/\/www.theblock.co\/post\/132866\/music-nft-marketplace-hitpiece-slammed-for-selling-music-assets-without-artist-permission\" data-v-f87c67ca=\"\">without their permission<\/a>. The Recording Industry Association of America even sent a <a href=\"https:\/\/www.theblock.co\/linked\/133364\/music-nft-platform-hitpiece-receives-demand-letter-from-recording-industry-association\" data-v-f87c67ca=\"\">demand letter<\/a> insisting HitPiece cease and desists its NFT sales.&nbsp;","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">“Clearly, based on the feedback that we got in early February, we realized we made some errors.” Felton said. “We failed to put the proper guardrails in place around the product to ensure that only artists and rights owners could mint NFTs containing their creative assets. So we took that beta down and rebuilt a product that we think makes sense for the marketplace and for artists.”<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Five months later, as it launches to the general public, HitPiece is prioritizing ownership rights and benefiting the artists who use the platform. <\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Felton said the partnership with Audible Magic, which the firm announced on Wednesday, reflects that emphasis. <\/span><span data-contrast=\"auto\" data-v-f87c67ca=\"\">“We partnered with [Audible Magic] because we think it's important that only owners and rights holders mint NFT containing that music.”&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Audible Magic contains over 100 million songs from over 400,000 record labels, as of 2021. Artists and rights holders will need to register on HitPiece, verify their identity and then have their uploaded content checked against Audible Magic’s database to ensure that no copyright rules will be broken by minting an NFT.<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">HitPiece will also cover the transaction fees and minting costs for artists who use the platform. The platform might not cover gas and mint fees forever, however, according to Felton.<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Felton, a longtime music lover, co-founded HitPiece in 2020 with Jeff Burn<\/span><span data-contrast=\"auto\" data-v-f87c67ca=\"\">ingham, an early investor in Spotify. “It became clear to me that there were opportunities for music artists who take advantage of the space to generate new revenue streams and connect with their fans in new ways in the metaverse,” said Felton.<\/span>","\"In music, Web3 has significant potential to be a catalyst for increasing artistic integrity, control and engagement for any musician, no matter their reach,” musician ATL Jacob in a statement associated with the platform's launch. ATL Jacob, who has reached first place on Billboard's Hot 100 Producers chart, is one of the \"dozens\" of artists already using the platform, according to HitPiece.","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">“My dream is that every music artist onboards into web3 at some point,” Felton said. <\/span><span data-contrast=\"auto\" data-v-f87c67ca=\"\">“I think some will be faster and some will be slower into this space, but I think it's here and I think that kind of like an ostrich putting their head in the sand to ignore it.”<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Felton","content":"PERSON"},{"type":"Felton","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"HitPiece","content":"ORGANIZATION"},{"type":"Audible Magic","content":"ORGANIZATION"},{"type":"Jacob","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Recording Industry Association of America","content":"ORGANIZATION"},{"type":"Spotify","content":"LOCATION"},{"type":"Rory Felton","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Jeff Burn<\/span><span data-contrast=\"auto\" data-v-f87c67ca=\"\">ingham","content":"PERSON"},{"type":"2020","content":"DATE"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}