{"summary":"Loans are increasingly being made with NFTs as collateral.\nThe largest ever NFT-collateralized loan was made last week.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/123165\/someone-took-out-a-1-4-million-loan-with-an-nft-as-collateral","publishDate":"2021-11-03T13:37:07","id":3005,"type":null,"title":"Someone took out a $1.4 million loan with an NFT as collateral","category":["NFTs"],"content":["A loan has been issued for $1.4 million using the crypto platform NFTfi. The terms of the deal are 30 days at 9.69% APR.","And the collateral? Well, it’s an NFT.","As The Block has <a href=\"https:\/\/www.theblockcrypto.com\/post\/120020\/defi-meets-nfts-how-a-lender-received-a-340000-nft-after-a-loan-wasnt-repaid\" data-v-f87c67ca=\"\">reported recently<\/a>, NFTs are starting to be used as collateral when taking out loans. It works like any other kind of collateralized loan. If you don’t repay the loan, the other party takes your collateral, in this case the NFT.","It’s a set-up that worked well for one lender. They lent out 3.5 ETH (worth $7,350 at the time) and when it wasn’t repaid, they received the collateral, an \"Elevated Deconstructions\" NFT, worth $340,000.","These NFT-backed loans have been increasing in frequency over the past few months, as more users have become more comfortable with the concept. There have been five new loans so far today, according to the tracker bot in the project’s Discord channel, as well as a bunch of new offers for loans and several loans being repaid.","The $1.4 million loan was the biggest NFT-collateralized loan yet, according to NFTfi. It began on October 28 and the NFT was Autoglyph #488. It's a type 10 Autoglyph, which is the rarest type.","Autoglyphs are a generative art collection where the algorithm for creating the art is stored on the Ethereum blockchain —&nbsp;meaning the token and the art are much more closely connected than is the case for most NFTs. The current floor price for an Autoglyph is 299 ETH ($1.3 million).","The loan was provided by MetaStreet DAO. Its stated objective is to provide funding to those who want to access capital and are willing to put up NFTs as collateral. The loan was paid to a pseudonymous crypto user called KrypToniK in the stablecoin DAI."],"hashtag":["CRYPTO"]}