{"summary":"US regulator, the CFTC, is probing whether BitMEX, a major crypto exchange, broke rules by allowing Americans to trade on its platform\nSeychelles-based BitMEX was forced to close its platform to North Americans in 2018\nThe exchange recently came under attack from crypto-critic, Nouriel Roubini","author":["Yogita Khatri","Isabel Woodford","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/32660\/cftc-to-investigate-whether-bitmex-broke-us-trading-law-report","publishDate":"2019-07-19T05:09:11","id":3006,"type":null,"title":"CFTC investigating crypto derivatives exchange BitMEX over US trading breach - Report","category":["Bitcoin"],"content":["The U.S. Commodity Futures Trading Commission (CFTC) is reportedly probing crypto derivatives exchange BitMEX to determine whether it broke rules by allowing U.S traders onto its platform.","According to a Bloomberg&nbsp;<a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2019-07-19\/u-s-regulator-probing-crypto-exchange-bitmex-over-client-trades\" data-v-f87c67ca=\"\">report <\/a>on Friday, citing anonymous sources, the probe would be “months-long” to investigate the issue as Seychelles-based BitMEX is not registered with the CFTC.&nbsp;","In 2018, BitMEX, the <a href=\"https:\/\/www.theblockcrypto.com\/2019\/05\/24\/the-perpetual-overload-problem-bitmex-is-taking-a-major-step-to-upgrade-its-platform\/\" data-v-f87c67ca=\"\">largest<\/a> margin trading platform for Bitcoin, <a href=\"https:\/\/www.theblockcrypto.com\/2019\/01\/14\/one-of-the-largest-crypto-exchanges-is-shutting-down-u-s-and-canadian-accounts-at-a-clip-says-report\/\" data-v-f87c67ca=\"\">was forced to close North American users’ accounts&nbsp;<\/a>following a letter from Canadian regulators informing the company it was in breach as an unlicensed entity.","US regulators have been clamping down on crypto trading firms in recent months. For instance, U.S.-based <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/bittrex-set-to-block-us-residents-from-32-crypto-assets\/\" data-v-f87c67ca=\"\">Bittrex <\/a>and&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/tiny\/poloniex-continues-to-advocate-for-better-crypto-regulation-as-it-goes-on-a-delisting-spree-in-the-us\/\" data-v-f87c67ca=\"\">Poloniex <\/a>delisted tens of tokens earlier this year over concerns they could be deemed securities by the SEC. Binance also <a href=\"https:\/\/www.theblockcrypto.com\/2019\/06\/14\/us-customers-to-be-blocked-from-trading-on-binance-com\/\" data-v-f87c67ca=\"\">announced it was withdrawing<\/a> from the US last month, although it is planning to open a regulated fiat-to-crypto exchange for <a href=\"https:\/\/www.theblockcrypto.com\/2019\/06\/14\/estranged-lovers-why-binance-is-finally-willing-to-walk-the-u-s-regulatory-tightrope\/\" data-v-f87c67ca=\"\">American users<\/a> on a separate platform.&nbsp;Perhaps most notably, at the start of July, the New York Attorney General <a href=\"https:\/\/www.theblockcrypto.com\/2019\/07\/08\/latest-filings-from-nyoag-allege-bitfinex-and-tether-continued-some-new-york-operations-as-late-as-january-2019\/\" data-v-f87c67ca=\"\">alleged <\/a>crypto exchange Bitfinex and affiliated firm Tether had operated in the state as recently as January 2019.","Nonetheless, Bloomberg's report concerning BitMEX this morning highlighted that \"regulator's investigations often don't lead to allegations of misconduct.\" Still, in March, bitcoin derivatives platform 1Broker <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/1broker-settles-suit-with-sec-ctfc\/\" data-v-f87c67ca=\"\">settled a lawsuit<\/a> with the CFTC&nbsp;for selling security-based swaps to U.S. investors.","BitMEX also returned to limelight earlier this month when it came under fire from <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/dr-doom-nouriel-roubini-accuses-cryptocurrency-exchanges-of-systematic-illegality-points-to-bitmex\/\" data-v-f87c67ca=\"\">Nouriel Roubini.<\/a> The crypto-skeptic pointed to the exchange as an example of a firm that is \"openly involved in systematic illegality.\" He cited <a href=\"https:\/\/medium.com\/swlh\/a-storm-is-brewing-over-the-largest-bitcoin-exchange-f956324b449f\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">research<\/a> that estimates liquidations of customer savings comprise as much as half of BitMEX’s revenue, and that according to his sources inside the company, terrorists and criminals from Russia and Iran purportedly use BitMEX services for money laundering “on a massive scale.\"","For its part, BitMEX CEO Arthur Hayes told&nbsp;<a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2019-07-17\/nouriel-roubini-ramps-up-campaign-against-crypto-exchange-bitmex\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Bloomberg<\/a>, “BitMEX provides safe, fast, professional and liquid ways for those who see the potential of crypto and to trade and hedge cryptocurrency risk. We continue to monitor all legal and regulatory developments around the world and will comply with all applicable laws and regulations; we reject any allegations of criminality, manipulation or unfair treatment of our customers, who are at the center of everything we do.”","BitMEX was co-founded in 2014 by Hayes along with Samuel Reed and thirty-five-year-old British national<a href=\"https:\/\/www.theblockcrypto.com\/tiny\/bitmex-co-founder-signs-the-giving-pledge\/\" data-v-f87c67ca=\"\"> Ben Delo<\/a>. The exchange is widely used in Asia and reports overseeing as much as $10 billion in trading a day. Its main office is in Hong Kong but it also has a base in San Francisco.","The probe is ongoing and the CFTC has declined to comment. A BitMEX spokeswoman told Bloomberg that the exchange does not comment on media reports about investigations by government agencies.","<em data-v-f87c67ca=\"\">This is a developing story....<\/em>"],"hashtag":["BINANCE","BITMEX","CFTC"]}