{"summary":"The team behind tBTC has initiated a 10-day emergency pause for new deposits after identifying a smart contract bug that disrupted the protocol’s redemption feature\nThe team can only initiate the emergency pause once, meaning that they will not be able to push pause again if another security issue arises in the future.","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/65941\/tbtc-post-mortem-describes-how-a-missed-smart-contract-bug-forced-the-developers-to-press-the-emergency-pause-button","publishDate":"2020-05-20T14:00:30","id":3009,"type":null,"title":"tBTC post-mortem describes how a missed smart contract bug forced the developers to press the emergency pause button ","category":["Cryptocurrency"],"content":["<span data-v-f87c67ca=\"\">The team behind tBTC – a newly launched Ethereum-based token backed 1:1 by bitcoin – has published a post-mortem report detailing a smart contract bug that led the developer team to initiate a system-wide emergency pause on Monday.<\/span>","<span data-v-f87c67ca=\"\">The ERC-20 token has its supply pegged to bitcoin’s supply. Users wishing to spend their bitcoin on Ethereum can use the tBTC DApp to deposit their bitcoin into the system and get a minted tBTC token in their Ethereum wallet. They can also use the DApp to redeem their bitcoin.<\/span>","<span data-v-f87c67ca=\"\">The team takes pride in the protocol’s permissionless redemption mechanism, which is not a feature in similar projects like WBTC. But now due to a previously undetected bug in the redemption codes, the developers have been forced to stop all new deposits for 10 days, a period which began on Monday at 5:45 UTC.<\/span>","<span data-v-f87c67ca=\"\">The bug concerns “signer bonds.” Essentially, when a user asks the system to mint a tBTC token, three randomly selected signers will take collective control of a bitcoin wallet holding the user’s bitcoin deposits. Later, if the user wants to exit to the bitcoin chain, the signers will have to authorize the transaction to redeem the bitcoin, sending it back to the user’s own address.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">To participate in a tBTC minting process, a signer needs to put down an ETH bond worth 1.5 times the value of the bitcoin deposit in question. The protocol’s smart contract will hold that bond until the bitcoin deposit is successfully redeemed by the user. This mechanism is meant to ensure that the signer does not try to run off with the bitcoin deposit. In fact, if a redemption fails, the system can seize the signer’s bond after six hours.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On May 18, an operator controlling three signers flagged to the tBTC team that they were unable to complete the redemption process. After investigating the issue, the team determined that something was wrong with the particular bitcoin address used for the redemption, and that the system was unable to prove that the bitcoin deposit had been sent to the correct address. As a result, the signer’s bond was at risk of being automatically seized.<\/span>","<span data-v-f87c67ca=\"\">“After confirming the issue and confirming that it was not fixable outside the contracts, the decision was made to trigger the single-use 10-day emergency pause available in the tBTC system contract,” said the <a href=\"https:\/\/blog.keep.network\/details-of-the-tbtc-deposit-pause-on-may-18-2020-38d7dd555663\" data-v-f87c67ca=\"\">post-mortem report<\/a>.<\/span>","<span data-v-f87c67ca=\"\">The emergency pause mechanism prevents new deposits from entering into the system. At the same time, the team took down the DApp to ensure that existing deposits would not accidentally trigger the redemption bug. Now they have collected 99.83% of all tBTC supply in a single wallet they control, and plan to use the tokens to redeem open deposits and return signer bonds. No user funds have been lost, they say.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In the spirit of decentralization, tBTC’s <\/span><a href=\"https:\/\/tbtc.network\/developers\/tbtc-security-model\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">security model<\/span><\/a><span data-v-f87c67ca=\"\"> only allows the team to use their privilege key to initiate a deposit pause once. The system is scheduled to go live again on May 28th. But after that, if another security issue arises, the developers will not be able to push pause again.<\/span>","<span data-v-f87c67ca=\"\">“We can't stop people from using the thing after, that's why communicating our findings is particularly important,” project lead Matt Luongo <\/span><a href=\"https:\/\/twitter.com\/mhluongo\/status\/1262355438747746305?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\"> on Twitter.<\/span>"],"hashtag":[]}