{"summary":"BCB Group is paying an undisclosed sum to take over 100% of the Hamburg-based bank. \nIn time, the deal will allow the crypto payments outfit to bring banking services in-house. ","author":["Lucy Harley-McKeown","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/127429\/bcb-group-swoops-for-germanys-sutor-bank","publishDate":"2021-12-15T04:00:07","id":3010,"type":null,"title":"BCB Group swoops for Germany&#x27;s Sutor Bank","category":["Fintech"],"content":["BCB Group is set to take over Hamberg-based Sutor Bank, in a move that will give the crypto payments provider banking capabilities.&nbsp;","The group did not disclose terms of the deal but said it would include a \"significant capital injection\" to take over 100% of the bank after BaFin — Germany's financial regulator — has given its approval.","Sutor, which is a private bank, will become part of the international BCB Group, which already includes regulated companies in Switzerland and the United Kingdom.","The group currently provides business accounts, payment services and crypto trading for some of the industry's biggest players, including Bitstamp, Coinbase, Galaxy and Kraken.&nbsp;","\"In order to offer more clients world class service as a banking partner, and to sustain our growth trajectory, we need a bank in the group that is digitally innovative, that is highly reliable in the execution of regulated processes, and which offers more direct access to important payment rails,\" said Oliver von Landsberg, founder and CEO of BCB Group.","BCB's central product is BLINC, a liquidity network through which digital asset industry players, exchanges, traders and investors can transfer money in real time. The group currently outsources the banking services required for this business to various partner banks. In the future, a large part of this business will be handled by Sutor Bank.","The move will also allow Sutor Bank to expand its own crypto banking platform internationally. The platform currently supports crypto firms and companies that want to integrate crypto asset trading into their offerings with services for which a banking licence is required.","\"We are glad to have found an investor in BCB with whom we can continue our growth-oriented fintech and crypto strategy,\" said Robert Freitag, Sutor Bank's managing director.","Sutor Bank will continue to operate in its current form. BCB intends to continue all business areas despite its focus on the digital assets industry.&nbsp;"],"hashtag":["FINTECH"]}