{"summary":"Bitcoin miner Core Scientific wants &quot;payment of any outstanding amounts owed&quot; by Celsius Mining, amid bankruptcy proceedings.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176589\/core-scientific-wants-celsius-to-pay-its-mining-bills-amid-bankruptcy-process","publishDate":"2022-10-12T12:34:06","id":3011,"type":null,"title":"Core Scientific wants Celsius to pay its mining bills amid bankruptcy process","category":["COMPANIES"],"content":["Core Scientific is prepared to fight Celsius Mining's <a href=\"https:\/\/www.theblock.co\/post\/174044\/celsius-mining-claims-hosting-provider-core-scientific-violated-bankruptcy-terms\" data-v-f87c67ca=\"\">claims that the hosting provider violated bankruptcy terms<\/a> and breached their hosting agreement by failing to deploy mining machines on time and unjustly trying to pass on power charges.","The company is \"seeking resolution from the bankruptcy court\" and \"payment of any outstanding amounts owed under the Agreement (...) as soon as practical,\" it said in a <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1839341\/000119312522260968\/d409553d424b3.htm\" data-v-f87c67ca=\"\">document<\/a> filed with the U.S. Securities and Exchange Commission on Wednesday.","Celsius owes Core Scientific approximately $5.4 million, the company has claimed in <a href=\"https:\/\/cases.stretto.com\/public\/x191\/11749\/PLEADINGS\/1174909292280000000013.pdf\" data-v-f87c67ca=\"\">documents<\/a> filed with the U.S. Bankruptcy Court for the Southern District of New York.","Core Scientific has retained legal advisors and will \"vigorously defend its interests\" with respect to the case and \"current difficult market conditions,\" it said in the filing.","\"Celsius is also using its chapter 11 proceeding to withhold payment of certain charges billed to Celsius pursuant to the Agreement,\" the firm said. \"An adverse or untimely ruling by the bankruptcy court that provides Celsius the benefits of the Company’s hosting services without Celsius fully paying the costs of such services would have a material effect on the Company’s business, financial condition, results of operations and cash flows.\"","Meanwhile, Core Scientific has asked the court to \"discuss an appropriate schedule for an evidentiary hearing,\" which is currently set for Oct. 20, as well as other deadlines, as stated in a <a href=\"https:\/\/cases.stretto.com\/public\/x191\/11749\/PLEADINGS\/1174910102280000000001.pdf\" data-v-f87c67ca=\"\">letter<\/a> sent Sunday to the U.S. Bankruptcy Court for the Southern District of New York.","The company intends to file a motion for affirmative relief against Celsius Mining, seeking one or more of the following: \"[R]elief from the automatic stay to allow it to terminate the Agreement, (...) compelling the Debtors to assume or reject the Agreement in short order; and (...) compelling immediate payment of Core Scientific’s administrative expense claims arising from its performance under the Agreement.\"","\"The false allegations the Debtors make in the Contempt Motion are harmful to Core Scientific, and the breach of contract allegations, premised on the incorrect notion that Core Scientific must subsidize the Debtors’ money-losing mining business to the tune of millions of dollars a month, immediately threatens the viability of Core Scientific’s business,\" the company also said.","In its own letter the following day, Celsius Mining argued that \"that Core Scientific’s request for a status conference is moot pending the parties’ efforts to resolve interim scheduling dates among themselves.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"Sunday","content":"DATE"},{"type":"Oct. 20","content":"DATE"},{"type":"Southern District of New York","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Celsius Mining","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"millions of dollars","content":"MONEY"},{"type":"$5.4 million","content":"MONEY"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Core Scientific","content":"ORGANIZATION"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}