{"summary":"The 7-day rolling average of bitcoin’s hash rate has dropped by over 10% since last week.\nThe drop comes amid Chinese miners are migrating from hydro to fossil fuel power stations.","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/82404\/bitcoin-hashrate-miners-migrate","publishDate":"2020-10-27T10:41:52","id":3012,"type":null,"title":"Bitcoin mining capacity drops 10% due to the change in season","category":["Mining"],"content":["Bitcoin's 7-day rolling average hash rate has dropped by over 10% since earlier this month — in large part thanks to the change in season.","The average total computing power competing to mine Bitcoin was around 142 exahashes per second (EH\/s) for the first two weeks of October, according to <a href=\"https:\/\/btc.com\/stats\/diff\" data-v-f87c67ca=\"\">data<\/a> from BTC.com. But since October 18, the 7-day rolling average of Bitcoin's hash rate has declined by 11% to the current 126 EH\/s. Meanwhile, Bitcoin's price rose above $13,000 during the same period.","<iframe title=\"Bitcoin's Hash Rate\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoins-hash-rate-daily\/embed\" width=\"100%\" height=\"420\" frameborder=\"0\" data-v-f87c67ca=\"\"><\/iframe>","One major reason behind the recent drop in computing power is the season change in China, home to more than 70% of the network's mine operators.&nbsp;","\"The [summer] hydro season has ended and now starts a month-long flat water season,\" Kevin Pan, co-founder of PoolIn, said in a <a href=\"https:\/\/weibo.com\/1620403294\/JqWYzisKZ?from=page_1005051620403294_profile&amp;wvr=6&amp;mod=weibotime&amp;type=comment#_rnd1603782404805\" data-v-f87c67ca=\"\">Weibo post<\/a> on Monday. \"A grand migration has now begun with miners looking for fuel-based power plants before the winter dry season arrives.\"","The computing power connected to major China-based bitcoin mining pools, including PoolIn, F2Pool, BTC.com and AntPool, each dropped by nearly 20% in 24 hours since Sunday, Pan's Weibo post further shows.","China's rainy summer season typically lasts from June to October, which provides excess resources for hydropower plants, especially in the country's southwestern Sichuan, Yunnan and Guizhou provinces. That excess energy results in cheap electricity prices during the summer that are attractive for bitcoin mining operations.","But as the winter dry season approaches, some operators of mining facilities in these areas will face higher electricity rates and more unstable electricity supplies compared with the rainy summer.&nbsp;","As such, many miner operators have already unplugged their equipment from hydropower stations and transferred them to fossil fuel power plants, which are scattered across China's vast Northern territories including Xinjiang and Inner Mongolia.","PoolIn's data <a href=\"https:\/\/www.poolin.com\/\" data-v-f87c67ca=\"\">estimates<\/a> that as a result of the recent hash rate decline, Bitcoin's next mining difficulty adjustment, which happens in about 5 days, will be a 10% decrease.&nbsp;","While the migration process usually takes about a month, the situation this year with the COVID-19 pandemic may make that less predictable. For instance, a new coronavirus outbreak was <a href=\"https:\/\/www.theguardian.com\/world\/2020\/oct\/26\/china-new-coronavirus-outbreak-detected-in-xinjiang-city-of-kashgar\" data-v-f87c67ca=\"\">detected<\/a> in the city of Kashgar in Xinjiang over the weekend, resulting in communities lockdown, which could affect the logistics services that are transferring equipment to the area.","\"The Kashgar [COVID-19] new outbreak happened just about the time of the hydro-to-fossil transition period. A lot of miners are still on the road,\" Mao Shixing, a co-founder of F2Pool, <a href=\"https:\/\/weibo.com\/1829463527\/JqWzLfeu9?from=page_1005051829463527_profile&amp;wvr=6&amp;mod=weibotime\" data-v-f87c67ca=\"\">said<\/a> in a social media post."],"hashtag":[]}