{"summary":"Ethereum Layer 2 Scroll appears to have launched its zkEVM on mainnet with $500,000 bridged so far, according to on-chain data.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/256095\/layer-2-zkevm-scroll-appears-to-have-gone-live-on-mainnet-500000-bridged-so-far","publishDate":"2023-10-12T05:31:07","id":3015,"type":null,"title":"Ethereum Layer 2 Scroll appears to have gone live on mainnet","category":["LAYER 2S AND SCALING"],"content":["Ethereum Layer 2 network Scroll appears to have launched its zkEVM live on mainnet, with funds already being bridged to the platform, according to <a href=\"https:\/\/etherscan.io\/txs?a=0xf8b1378579659d8f7ee5f3c929c2f3e332e41fd6&amp;p=18\" data-v-f87c67ca=\"\">on-chain data<\/a>.","Over <a href=\"https:\/\/dune.com\/angry\/scroll-mainnet-dashboard-and-wallet-rank\" data-v-f87c67ca=\"\">330 ETH<\/a> ($515,000) has been bridged so far, according to a Dune Analytics dashboard, encompassing more than 850 transactions and nearly 500 unique users. Bridge deployment appears to have begun on Oct. 8, according to blockchain explorer Etherscan.&nbsp;","There has been no official announcement from the Scroll team as yet. However, users are already able to add the mainnet to their web3 wallets like MetaMask and transfer funds from other Ethereum-based networks to the zkEVM via <a href=\"https:\/\/x.com\/Axel_bitblaze69\/status\/1712195974905614458?s=20\" data-v-f87c67ca=\"\">third-party bridges<\/a> such as Owlto Finance. The minimum bridge amount is reportedly 0.0035 ETH (around $5).","Some dapps also appear to have begun integrating with the Scroll mainnet, enabling users to play around with the new network further. DefiLlama is already tracking four DEXs on the Scroll zkEVM and is reporting a total value locked on Scroll applications of more than <a href=\"https:\/\/defillama.com\/chain\/Scroll\" data-v-f87c67ca=\"\">$150,000<\/a> so far.","There is also no confirmation if or when a Scroll token will be launched and distributed.","The Scroll zkEVM mainnet follows a testing phase for the network, including its <a href=\"https:\/\/www.theblock.co\/post\/215343\/scrolls-zk-evm-layer-2-goes-live-on-ethereums-goerli-testnet\" data-v-f87c67ca=\"\">launch on the Ethereum Goerli testnet<\/a> in February. Prior to that, Scroll was available for testing via the project’s own clone of Ethereum.","Scroll has been developing its network for two years, with 60 team members working alongside a broader network of external contributors.","zkEVMs are Layer 2 networks built on Ethereum using zero-knowledge proofs for scalability. Being Ethereum Virtual Machine-compatible, these networks can support Ethereum applications while also running at scale.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$5","content":"MONEY"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"$150,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Owlto Finance","content":"ORGANIZATION"},{"type":"Oct. 8","content":"DATE"},{"type":"$515,000","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ETHEREUM","SCROLL"],"authors":["James Hunt","The Block"]}