{"summary":"Popular crypto debit cards issuer Wirecard is unable to locate $2 billion worth of cash\nWirecard said “spurious” cash balances may have been provided by a third party “in order to deceive the auditor”\nCrypto.com’s CEO Kris Marszalek suggested that the news doesn’t affect them","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/68783\/popular-crypto-debit-cards-issuer-wirecard-is-unable-to-locate-2-billion-worth-of-cash","publishDate":"2020-06-18T06:55:10","id":3015,"type":null,"title":"Popular crypto debit card issuer Wirecard is unable to locate $2 billion worth of cash","category":["Cryptocurrency"],"content":["Wirecard AG, a German payment processor and an issuer of Crypto.com and TenX debit cards, is in trouble.","The company’s auditor EY is <a href=\"https:\/\/ir.wirecard.com\/websites\/wirecard\/English\/5110\/news-detail.html?newsID=1984117&amp;fromID=5000\" data-v-f87c67ca=\"\">unable to find<\/a> evidence for 1.9 billion euros (over $2 billion) worth of cash balances on Wirecard’s trust accounts. Wirecard said “spurious” balances may have been provided by a third party “in order to deceive the auditor”.","“There are indications that spurious balance confirmations had been provided from the side of the trustee respectively of the trustee's account holding banks to the auditor in order to deceive the auditor and create a wrong perception of the existence of such cash balances or the holding of the accounts for to the benefit of Wirecard group companies,” said the company, adding:","“The Wirecard management board is working intensively together with the auditor towards a clarification of the situation.”","As a result of the issue, Wirecard has delayed publishing its annual and consolidated financial statements for 2019 for the <a href=\"https:\/\/www.ft.com\/content\/1e753e2b-f576-4f32-aa19-d240be26e773\" data-v-f87c67ca=\"\">third time<\/a>. The company said: “If certified annual and consolidated financial statements cannot be made available until June 19, 2020, loans made to Wirecard AG amounting to approximately EUR 2 billion can be terminated.”","Shares of the company fell by more than 50% within minutes after the announcement. It is currently trading at around 54 euros (~$60) apiece.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Crypto connection?&nbsp;<\/strong><\/span><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nWirecard's subsidiary Wirecard Card Solutions issues <a href=\"https:\/\/blog.crypto.com\/crypto-com-may-2020-updates\/\" data-v-f87c67ca=\"\">Crypto.com's MCO Visa Card<\/a> and <a href=\"https:\/\/tenx.tech\/card\" data-v-f87c67ca=\"\">TenX's Visa Debit Card<\/a>.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nKris Marszalek, CEO of Crypto.com, <a href=\"https:\/\/twitter.com\/Kris_HK\/status\/1273565698036396033?s=20\" data-v-f87c67ca=\"\">said<\/a> debit cards issued by Wirecard for the firm are \"fully prefunded,\" meaning clients' fiat funds are held by an electronic money institution (EMI) regulated by the U.K. Financial Conduct Authority (FCA) in segregated client accounts. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"The funds are held at another bank (not Wirecard) as required by the FCA. To further clarify, Wirecard does not have custody of any crypto held by Crypto.com,\" Marszalek added.&nbsp;"],"hashtag":[]}