{"summary":"The NFTs will use the Ordinal Theory protocol.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215504\/yuga-labs-drops-bitcoin-based-nft-collection-twelvefold","publishDate":"2023-02-27T18:00:58","id":3016,"type":null,"title":"Yuga Labs drops bitcoin-based NFT collection TwelveFold","category":["WEB3"],"content":["Yuga Labs, the creator of the Bored Ape Yacht Club, announced the release of a new bitcoin-based NFT collection called TwelveFold.","The collection will consist of 300 generative art pieces inscribed onto satoshis on the Bitcoin blockchain.","Inscriptions, also known as digital artifacts, are created when a file, such as an art image like those created for TwelveFold, is written (or inscribed into) units of Bitcoin called satoshis, the smallest individually identifiable units of Bitcoin.","The process is made possible through the <a href=\"https:\/\/docs.ordinals.com\/overview.html\" data-v-f87c67ca=\"\">Ordinal Theory protocol<\/a>, with such NFTs simply donning the name \"ordinals.\"","<a href=\"https:\/\/www.theblock.co\/post\/207086\/what-are-bitcoin-nfts-ordinals-and-how-do-they-work\" data-v-f87c67ca=\"\">Ordinals<\/a> have gained popularity as upgrades to the Bitcoin blockchain made it cheaper to store data in single transactions.","In January, for example, someone <a href=\"https:\/\/twitter.com\/notsofast\/status\/1620148789645570050\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">minted a copy<\/a> of the 100 Ether Rocks — one of the oldest Ethereum NFT projects — on Bitcoin for about $2 per rock.","Unlike Ethereum, where many NFTs can be minted in one go, each ordinal NFT has to be minted individually in its own transaction for its own fee. As a result, buyers of TwelveFold will need an empty Bitcoin address to receive the art.","\"Wallets do not currently support the transfer of individual satoshis,\" Yuga Labs told The Block, meaning that users risk transferring their inscribed satoshi's if their digital artifacts are stored together with other bitcoin holdings.","Each of the art pieces, generated by Yuga Labs using 3D modeling technology among other techniques, will be available to purchase in an auction held later this week.&nbsp;","All bids will be made in bitcoin.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ethereum NFT","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Yuga Labs","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"$2","content":"MONEY"}],"hashtag":["NFT ARTISTS","NFT INFRASTRUCTURE","YUGA LABS"],"authors":["Sam Venis","The Block"]}