{"summary":"Ramp addes Pix integration, the popular digital payments platform used by more than 70% of Brazilian citizens.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/250547\/buying-crypto-in-brazil-gets-easier-with-pix-payment-integration","publishDate":"2023-09-14T08:01:05","id":3019,"type":null,"title":"Buying crypto in Brazil gets easier with Pix payment integration","category":["COMPANIES"],"content":["From the sandy beaches of Rio de Janeiro to fancy eateries of São Paulo, the digital payment platform <a href=\"https:\/\/www.theblock.co\/post\/222412\/coinbase-regulation-brazil-us\" data-v-f87c67ca=\"\">Pix<\/a> has quickly become ubiquitous, often more commonly accepted that credit and debit cards.","Now crypto payments firm Ramp has added a Pix integration aimed at making it easier for both consumers wanting to purchase crypto and web3 companies looking to access the Brazilian market, South America's largest economy with a population of more than 200 million people.","\"<span data-v-f87c67ca=\"\">Ramp now offers a faster, cheaper, and more convenient payment option for all Brazilian residents looking to purchase crypto, while enabling its partners to tap into the domestic Brazilian market and benefit from the country's most widely used payment method,\" Ramp said in a statement, adding that Pix is used by more than 70% of the nation's citizens.<\/span>","Brazil's central bank launched Pix in 2021.","Ramp's Pix integration comes on the heels of the firm forming a local entity in Brazil in July.","<span data-v-f87c67ca=\"\">\"Now people in Brazil can become part of the Web3 economy in seconds, compared to hours before,\" <\/span><span data-v-f87c67ca=\"\">Szymon Sypniewicz, Ramp's CEO said in a statement. \"<\/span><span data-v-f87c67ca=\"\">Following the recent launch of BRL card payments and the establishing of our local Brazilian entity, this move builds on our mission to make crypto available everywhere.\"<\/span>","Ramp <a href=\"https:\/\/www.theblock.co\/post\/184635\/crypto-payments-firm-ramp-raises-70-million-in-more-than-50-up-round\" data-v-f87c67ca=\"\">raised<\/a> $70 million in Series B funding late last year, sending its valuation to at least $450 million.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"70%","content":"PERCENT"},{"type":"$450 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"Szymon Sypniewicz","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Brazil","content":"LOCATION"},{"type":"São Paulo","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"$70 million","content":"MONEY"},{"type":"Rio de Janeiro","content":"ORGANIZATION"},{"type":"South America","content":"LOCATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}