{"summary":"The European Parliament is in the process of drafting an own-initiative report on how to regulate NFTs, to probe the European Commission to come up with bespoke legislation.\nWe can expect to see the report drafted in approximately six months.","author":["Inbar Preiss","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/180000\/nfts-need-custom-regime-eu-parliaments-draftsperson-upcoming-report","publishDate":"2022-10-26T10:20:47","id":302,"type":null,"title":"NFTs need a &#x27;custom regime,&#x27; says EU Parliament&#x27;s draftsperson on upcoming report","category":["Policy"],"content":["As the EU’s comprehensive Markets in Crypto-Assets regulation toes the legislative finish line, the EU is turning its gaze to other parts of the blockchain industry — specifically, nonfungible tokens. \"NFTs deserve a custom regime,\" MEP Eva Kaili, draftsperson on an upcoming report on how to regulate NFTs, said at a Brussels event.","“DeFi has remained out of scope — and NFTs, too. I think we are at the level where we can address that,” Kaili stated, adding that the European Parliament needs to “rethink a regulatory approach on activity-based regulation rather than an entity-based one.\"","The European Parliament is in the process of setting up a report, headed by Kaili, which will nudge the Commission to start a legislative process for supervising NFTs. The Parliament has no power to propose new bills, but with a so-called ‘own-initiative' report, the Parliament can indicate to the Commission that it should cover a certain topic. It could take six months before a concrete report is drafted, the policymaker says.","Kaili — who previously led the 2016 Blockchain Resolution in parliament and the more-recent DLT Pilot Regime, <a href=\"https:\/\/www.theblock.co\/post\/173191\/eu-securities-regulator-clears-next-step-for-tokenized-trading-pilot-program\" data-v-f87c67ca=\"\">anticipated<\/a> to kick off in 2023 — wants to make sure Europe is “a player in the global development of this technology.”","NFTs are relevant to an array of sectors, according to Kaili, listing their applications to gaming, art ownership, membership verification, helping remove fraud from the music industry, helping ensure artists' rights, the purchase of real estate on the metaverse, storing medical records, protection of IP rights and addressing fake news.","“My expectations are very high,” EU Finance Commissioner Peter Kerstens said of the report in the Brussels event. “If there is a strong political indication or wish for an initiative, that may move the Commission into presenting it,\" they noted, adding that \"if we don't act on it, we'll have a lot of explaining to do.”","The NFT report reacts to an article in the MiCA regulation, which calls for exploring a bespoke regime on NFTs. The Parliament’s Committee on Industry, Research and Energy picked up this initiative.","The timeline for the report is not yet defined. However, there are some things that could slow the process down. The Parliament is still discussing the practicalities, such as how many other committees will file an opinion and contribute to the report.&nbsp;","The NFT report may also face delay due to the 2024 elections in the European institutions. As early as mid-2023, proposals could be tabled ahead of the changing mandates, only to be picked up after the new roles commence by the end of 2024."],"hashtag":["EUROPEAN PARLIAMENT"]}