{"summary":"Point72 Ventures has made its first crypto venture investment.\nThe company is leading crypto research firm Messari’s $21 million funding round.","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/113564\/steve-cohens-point72-makes-first-crypto-venture-investment-leads-messaris-21m-raise","publishDate":"2021-08-05T10:02:06","id":3020,"type":null,"title":"Steve Cohen&#x27;s Point72 makes first crypto venture investment, leads Messari&#x27;s $21M raise","category":["Startups"],"content":["Point72 Ventures, the venture arm of the hedge fund with $22.1 billion under management, is making one of its biggest steps into the crypto market, investing in crypto data startup Messari's Series A funding round.&nbsp;","Led by DCG and CoinDesk alum Ryan Selkis, Messari operates in the crowded market for crypto data and research. As part of the raise, the firm has raised $21 million at a post-money valuation close to $100 million, according to a source familiar with the deal.","Other investors include Alameda Capital, Nascent and CMS Holdings.&nbsp;","As for Point72, the deal marks a significant moment for the firm, which has made headlines in recent months for its journey into crypto. As The Block first <a href=\"https:\/\/www.theblockcrypto.com\/post\/104522\/steve-cohen-point72-crypto-market\" data-v-f87c67ca=\"\">reported<\/a> in May, Point72 has been plotting its entrance into the crypto market for some time, exploring opportunities across its venture fund and hedge fund.&nbsp;","A spokeswoman for the firm said that Point72 is still in the early stages of outlining its exact crypto investing strategy. In a podcast, CEO Steven Cohen divulged a bit more of his thinking on the market, saying that he's been \"fully converted' on crypto, but that doesn't \"care about bitcoin,\" specifically.\"&nbsp;","\"The way those markets are developing could be a real interesting adjacency from what we are doing at Point72,\" he said. \"I'm not missing this.\"","The <a href=\"https:\/\/www.youtube.com\/watch?v=csWWlz-oWis&amp;t=498s\" data-v-f87c67ca=\"\">YouTube video<\/a> in which Cohen made these comments has since been removed.&nbsp;","As for the logic behind investing in Messari, Adam Carson, an operating partner at Point72 Ventures, said that Messari offers \"crypto research and analysis tools\" that \"more advanced investors need.\"","Carson is joining Messari's board along with Jeff Clavier, a former Thomson Reuters exec who participated in Messari's seed round in 2019.","Selkis plans to put the fresh capital to work quickly with the ambitious goal of bringing on more than 1,000 analysts.&nbsp;","\"We're going to be aggressively expanding our Analyst Hub (goal is still to onboard 1000 analysts), and build governance and community management tools for DAOs,\" he said in a message to The Block, referring to its research marketplace of freelance contributors.&nbsp;"],"hashtag":[]}