{"summary":"Startup zCloak Network, which provides zero-knowledge proofs for public blockchains, raised $5.8 million in a pre-Series A round.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/152423\/zero-knowledge-proof-startup-zcloak-network-raises-5-8-million","publishDate":"2022-06-17T02:00:06","id":3020,"type":null,"title":"Zero-knowledge proof startup zCloak Network raises $5.8 million","category":["PRIVACY"],"content":["With the new funds, zCloak Network plans to expand its partnerships with identity data attestors, web3 applications and blockchain networks.&nbsp;","Startup zCloak Network, which provides zero-knowledge proofs for public blockchains, raised $5.8 million in a pre-Series A round.","While there was no lead investor, Coinbase Ventures was a major participant, according to a news release.&nbsp;","Participating investors included Bixin Ventures, Matrixport Ventures, DFG, Sancus Ventures, KuCoin Ventures, Sanctor Capital, Hash Global and Jump Capital among others.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\"> The valuation was not disclosed.&nbsp;<\/span>","The startup sees itself as a zero-knowledge proof-as-a-service company for public blockchains. Zero-knowledge proofs are a cryptographic method of authentication where one party can prove the truth of specific information to another party without disclosing additional information.","“Verifiable computation in user device will be a defining feature of Web 3.0. In contrast to the current paradigm of big data and cloud computing, zCloak enables users to perform computation and analysis of their data in their own device, not in centralized servers,” CEO Xiao Zhang said in the statement.&nbsp;","With the zCloak product, users can prove that their identity has certain attributes without sharing private data for use in DeFi, identity and biometric applications. These proofs are made available in major public blockchains via its oracle service.&nbsp;","With the new funds, the company plans to expand its partnerships with identity data attestors, web3 applications and blockchain networks.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sancus Ventures","content":"ORGANIZATION"},{"type":"Bixin Ventures","content":"ORGANIZATION"},{"type":"Matrixport Ventures","content":"ORGANIZATION"},{"type":"KuCoin Ventures","content":"ORGANIZATION"},{"type":"DFG","content":"ORGANIZATION"},{"type":"Sanctor Capital","content":"ORGANIZATION"},{"type":"Xiao Zhang","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"$5.8 million","content":"MONEY"}],"hashtag":[],"authors":["Tom Matsuda","The Block"]}