{"summary":"Singapore-based crypto derivatives exchange Phemex has raised $3.5 million in Series A, led by NGC Ventures\nThe exchange looks to expand into Russia, South Korea and Japan\nPhemex co-founder Jack Tao told The Block that today’s Series A brings the exchange’s valuation to $50 million","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/58507\/crypto-derivatives-exchange-phemex-raises-3-5m-in-series-a-led-by-ngc-ventures","publishDate":"2020-03-12T04:45:09","id":3021,"type":null,"title":"Crypto derivatives exchange Phemex raises $3.5M in Series A led by NGC Ventures","category":["Investments"],"content":["Singapore-based crypto derivatives exchange Phemex has raised $3.5 million in Series A funding.","The round was led by NGC Ventures, with participation from \"a number of Morgan Stanley executives and a leading team of quants.\"","Notably, Phemex is <a href=\"https:\/\/www.theblockcrypto.com\/post\/49213\/ex-morgan-stanley-execs-launch-crypto-derivatives-exchange-phemex-claiming-it-to-be-on-par-with-nasdaq\" data-v-f87c67ca=\"\">founded by<\/a> eight former employees of Morgan Stanley, who primarily worked as core developers. Phemex co-founder Jack Tao spent 11 years at Morgan Stanley as the global development leader of e-trading benchmark execution strategies.","Today's round brings Phemex's total funding to date to $5 million and valuation to $50 million, Tao told The Block.","With the fresh capital in place, Phemex looks to expand into Russia, South Korea and Japan, and grow its team.&nbsp;","\"We chose the three countries for expansion because there are lots of active traders in these regions, based on our market research,\" Tao told The Block.","On the hiring front, Tao said the exchange is looking to add ten more people to its current headcount of 40, spread across development, marketing, and customer service functions.","Phemex is also scheduled to launch a new product in the coming week, which \"bridges traditional commodities with the world of crypto,\" Tao told The Block.","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Rapid growth?<\/strong><\/span>","Launched last November, Phemex claims to have 105,000 registered users. That appears to be sharp growth from 2,000 users <a href=\"https:\/\/www.theblockcrypto.com\/post\/54159\/new-singapore-law-requires-crypto-firms-to-be-licensed-in-the-country\" data-v-f87c67ca=\"\">it had<\/a> at launch.","The majority of these users are from the U.K., Germany, and Russia, Tao told The Block, adding that 10,000 are \"very active retail clients.\"","Looking ahead, Tao expects to have 1 million registered users by the end of this year.","Notably, Phemex is currently unregulated. But it has applied for a license from the Monetary Authority of Singapore, Tao told The Block. Singapore <a href=\"https:\/\/www.theblockcrypto.com\/post\/54159\/new-singapore-law-requires-crypto-firms-to-be-licensed-in-the-country\" data-v-f87c67ca=\"\">passed<\/a> a new law earlier this year, which requires all crypto businesses operating in the country to be registered by the authority.","At launch, Phemex was also looking to collaborate with crypto bank SEBA for custody of clients' assets. Tao today told The Block that the matter is \"still in the discussion stage.\"","Looking forward, Phemex could raise more funds from \"strategic investors who can bring in additional valuable resources,\" said Tao."],"hashtag":[]}