{"summary":"Polkadot-based decentralized insurance project Tidal Finance has raised $1.8 million in a private token sale.\nWith fresh capital at hand, Tidal looks to launch its protocol in mid-April, co-founder and CEO Chad Liu told The Block.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/96766\/polkadot-decentralized-insurance-tidal-finance-raises-1-8-million-token-sale","publishDate":"2021-03-02T03:30:14","id":3025,"type":null,"title":"Polkadot-based decentralized insurance protocol Tidal Finance raises $1.8 million in a token sale","category":["DeFi"],"content":["Tidal Finance, the yet-to-launch Polkadot-based decentralized insurance protocol, has raised $1.8 million in a private token sale round.","The round was backed by Hypersphere Ventures, the venture firm co-founded by Polkadot co-founder Robert Habermeier, as well as Spartan Capital, Kenetic Capital, and QCP Capital.","With fresh capital at hand, Tidal looks to launch its protocol in mid-April, co-founder and CEO Chad Liu told The Block. Tidal has been under development since last September and will launch the testnet in about two weeks, said Liu.","When launched publicly, Tidal will help users buy and sell insurance against decentralized finance (DeFi) protocols. The buying part is self-explanatory. As for sellers, they will have to provide liquidity for DeFi protocols they want to back and get Tidal (TIL) tokens in return.","Tidal will charge a \"small percentage of transaction fee\" from cover sellers, said Liu, commenting on the protocol's business model.","Nexus Mutual and Cover Protocol are two existing Ethereum-based DeFi insurance protocols. When asked what Tidal's competitive edge is, Liu said it is designed to increase capital efficiency at reduced risks.","\"Tidal combines different protocols into coverage pools to allow liquidity providers (LPs) to stake their capital to provide coverage on multiple protocols at the same time. These pools are assembled to offer LPs the ability to leverage their capital while mitigating the risks. Risks are reduced by combining protocols with low correlation and by limiting the duration of each coverage cycle,\" Liu told The Block. \"This approach gives our LPs the ability to generate above-average returns while offering coverage seekers highly competitive pricing.\"&nbsp;","Tidal said it has partnered with over 20 DeFi protocols to bring coverage for its users. Some of these protocols include bZx, Reef Finance, Equilibrium, StakeDAO, and others.","Tidal also plans to launch an insurance product for different proof-of-stake protocols, including Ethereum 2.0 or Eth2. That will allow validators of these protocols to buy insurance against slashing risks.","The private token sale round brings Tidal's total funding to date to $3.8 million. Last December, the project raised $2 million in a token seed round.","Looking ahead, Tidal plans to raise more money via a public token sale, Liu told The Block."],"hashtag":[]}