{"summary":"Securities and Exchange Commission chairman Gary Gensler testified before the Senate Banking Committee today, answering a range of questions about the role of the SEC in crypto markets.\nSpeaking to The Block after the hearing, Gensler indicated that crypto lending and even staking platforms were likely to fall under the scope of U.S. securities laws.","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/117675\/crypto-lending-staking-custody-gensler-sec","publishDate":"2021-09-14T16:27:43","id":3026,"type":null,"title":"Custodial crypto lending and staking products &#x27;take on all the indicia&#x27; of securities, Gensler tells The Block","category":["Regulation"],"content":["Securities and Exchange Commission chairman Gary Gensler indicated Tuesday that crypto lending and staking platforms that hold custody of user funds could fall under U.S. securities laws and, as a result, his agency's oversight.","<span data-v-f87c67ca=\"\">Following a hearing before the Senate Banking Committee, Gensler told The Block that Congress in its 1933 Securities Act and 1934 Securities Exchange Act “painted with a broad brush as to what’s a security.”<\/span>","<span data-v-f87c67ca=\"\">This question of what is and is not a security has been a defining characteristic of the crypto industry and its relationship with the SEC and other regulators for years. In conversation, Gensler offered a broad view of this dynamic.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“If you are offering a lending product, it is quite likely that that lending product itself is under the securities laws,” Gensler said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A recent SEC <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/117140\/secs-handling-of-coinbase-lend-signals-sea-change-for-us-crypto-lending\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">spat with Coinbase over its Lend product<\/span><\/a><span data-v-f87c67ca=\"\"> suggested to many that crypto lending platforms would need to register with the SEC sooner rather than later.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Using a “not your keys, not your coins” argument, Gensler further pulled staking platforms into his consideration, telling The Block:<\/span>","During the hearing itself, Gensler found many in the Senate Banking Committee receptive to his broad view of what qualifies as a security and requires corresponding registration and regulation.","Senator Elizabeth Warren, for one, shared <a href=\"https:\/\/www.theblockcrypto.com\/linked\/117651\/elizabeth-warren-and-gary-gensler-place-coinbase-in-oversight-crosshairs\" data-v-f87c67ca=\"\">Gensler's concerns over exchanges like Coinbase<\/a> — a political push that the two have been <a href=\"https:\/\/www.theblockcrypto.com\/linked\/114222\/gensler-asks-sen-warren-for-more-sec-authority-to-regulate-crypto-exchanges\" data-v-f87c67ca=\"\">working together on for months<\/a>.&nbsp;","\"Many have been enticed by dramatic jumps in the value of new digital assets,\" said Committee Chairman Sherrod Brown of the past year of market volatility. \"Some professional investors and celebrities make earning millions look easy. But, as we are reminded time and again, it’s never that simple – and too often, someone’s quick profit comes at the expense of workers and entire communities.\"","Meanwhile, Ranking Member Pat Toomey criticized the SEC's lack of clarity over what is and is not a security, saying:","In his questioning, Toomey asked for more specifics as to which cryptocurrencies are securities. Gensler answered broadly.","Toomey brought up <a href=\"https:\/\/www.theblockcrypto.com\/news+\/114954\/everything-you-need-to-know-about-the-stablecoin-wars\" data-v-f87c67ca=\"\">stablecoins in particular<\/a>, to which Gensler replied“I think they may well be securities.”","Toomey, in turn, disputed that there was an expectation of profit with stablecoins, a critical prong of the SEC's determination of whether an investment is an investment contract and, thus, a security.","“If it doesn’t meet the Howey test it doesn’t look to me like a security,” said Toomey. “And we certainly shouldn’t be taking enforcement action against somebody without first having provided that clarity.”"],"hashtag":["GARY GENSLER","SEC"]}