{"summary":"Grayscale&#x27;s CEO joined Frank Chaparro for the latest episode of The Scoop, which drops Thursday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/218193\/grayscales-sonnenshein-left-encouraged-after-hearing-in-sec-case","publishDate":"2023-03-08T17:56:50","id":3026,"type":null,"title":"Grayscale&#x27;s Sonnenshein left &#x27;encouraged&#x27; after hearing in SEC case","category":["CRYPTO INFRASTRUCTURE"],"content":["Grayscale Chief Executive Officer Michael Sonnenshein is optimistic following a hearing over the Securities and Exchange Commission's rejection of his firm's application for a spot bitcoin ETF.","Sonnenshein said the company was left \"feeling encouraged\" walking out of the courtroom, before adding that yesterday was \"another example of consistency\" in a discussion with The Scoop's Frank Chaparro. It was the latest leg of a media tour following oral arguments in the firm's case versus the SEC on Tuesday.&nbsp;","For a long time, the SEC maintained a stance of no bitcoin ETF products, which, while frustrating, was at least fair, according to Sonnenshein. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"There was no imbalance in the types of products coming to market,\" he said.&nbsp;","The turning point, as the CEO put it, was the approval of a bitcoin futures ETF by fund group Teucrium. Unlike previous bitcoin futures products, this application was filed under the Securities Exchange Act of 1934. Approved bitcoin futures products before then were filed under the Investment Company Act of 1940.","The argument of the act's additional protections didn't stand up after the Teucrium approval, Sonnenshein argues. He explained that bitcoin futures are a derivative of the spot market, another focal point of the firm's argument.&nbsp;","\"Inherently, if the SEC got comfortable enough with bitcoin futures contracts to approve a bitcoin futures ETF, at the same time, they had to have gotten comfortable with that underlying spot market,\" he said.&nbsp;","When asked about offering redemptions, specifically Regulation M, Sonnenshein said there's an abundance of experts, but in reality, it's a \"pretty nuanced piece of financial product rule.\"","Sonnenshein said ETFs are granted relief from this regulation, which is designed to prevent manipulation by individuals with an interest in the outcome of an offering, and prohibits activities and conduct that could artificially influence the market for an offered security, according to the Financial Industry Regulatory Authority.","\"What reg M relief allows them to create and redeem shares of the ETF simultaneously,\" he said. The process of creating shares, or redeeming shares, helps to keep the ETF's share price trading in line with the underlying asset — thus eradicating the premium\/discount the fund trades at.&nbsp;","Shares in the Grayscale Bitcoin Trust rose more than 2% and GBTC's discount to net asset value was 35.7%, following oral arguments. The bitcoin fund has been trading at a discount since early 2021, meaning shares in the fund are cheaper than the underlying bitcoin. The discount has narrowed to its lowest level since October.","Several investors and competitors have rejected the asset managers' claim that conversion to a spot-based ETF is the best outcome for GBTC.&nbsp;","FTX debtors sued the asset manager this week, <a href=\"https:\/\/www.theblock.co\/post\/217535\/ftx-sues-grayscale-and-dcg-citing-exorbitant-fees\" data-v-f87c67ca=\"\">saying<\/a> shares would be worth $550 million, or 90% more, if the asset manager reduced fees and allowed redemptions.","\"Our goal is to unlock value that we believe is currently being suppressed by Grayscale's self-dealing and improper redemption ban,\" FTX CEO John Ray III said in a statement.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<em data-v-f87c67ca=\"\">The full discussion between Sonnenshein and Chaparro will be available tomorrow morning. For that episode and more, head over to <a href=\"https:\/\/www.theblock.co\/podcasts\" data-v-f87c67ca=\"\">https:\/\/www.theblock.co\/podcasts<\/a>.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"GBTC","content":"ORGANIZATION"},{"type":"90%","content":"PERCENT"},{"type":"1940","content":"DATE"},{"type":"Financial Industry Regulatory Authority","content":"ORGANIZATION"},{"type":"Grayscale Bitcoin Trust","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"2%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"35.7%","content":"PERCENT"},{"type":"$550 million","content":"MONEY"},{"type":"1934","content":"DATE"},{"type":"Sonnenshein","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Securities Exchange","content":"ORGANIZATION"},{"type":"Sonnenshein","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"John Ray III","content":"PERSON"},{"type":"Michael Sonnenshein","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Chaparro","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"}],"hashtag":["INVESTMENT FIRMS","SEC"],"authors":["Adam Morgan McCarthy","Frank Chaparro","The Block"]}