{"summary":"BlockFi executives lost $800 million in equity as part of the restructuring deal with FTX, and stored over $2 million on the platform, new filings reveal.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/201398\/blockfi-executive-salaries-wipeout","publishDate":"2023-01-12T06:11:28","id":3029,"type":null,"title":"BlockFi increased some executives&#x27; salaries after wipeout of equity stakes","category":["BANKRUPTCY"],"content":["Several BlockFi executive team members saw their equity stakes wiped out last year as part of its emergency restructuring plan, which included borrowing $400 million from collapsed crypto exchange FTX.","A statement of assets and liabilities document filed on Jan. 12 as part of BlockFi's bankruptcy proceedings documented the financial positions of both the platform and executives in the lead-up to the lender filing for Chapter 11 bankruptcy protection.","Senior management lost around $800 million in equity due to the loan transaction with FTX. BlockFi CEO and founder Zac Prince took the biggest hit with a loss of $412 million. Yet, at the same time, the firm approved a ”retention program” by increasing salaries by up to 50% for top staff.","\"The massive impact of the FTX transaction on management equity led BlockFi’s board of directors to, among other things, increase base salaries and make retention payments for those that remained in the interest of retaining business critical knowledge and capabilities,\" said the filing.","Members of the executive team also stored over $2 million in individual accounts on the lending platform in the lead-up to its bankruptcy in November. Prince also had the most-significant deposit within the management team, with $1.4 million on the platform as of Nov. 21, 2022. Amit Cheela, the firm's chief financial officer, had $292,000 on BlockFi, while Flori Marquez stored $109,000 on the platform.","No member of the BlockFi management team withdrew any cryptocurrency from BlockFi’s platform after Oct. 14, 2022, the filing said. It also showed that management team withdrawals represented 0.15% of the total volume in 2022.&nbsp;Prince did, however, take out around $10 million from the platform to pay taxes in April.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$412 million","content":"MONEY"},{"type":"$109,000","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$2 million","content":"MONEY"},{"type":"Zac Prince","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"Jan. 12","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"$292,000","content":"MONEY"},{"type":"Flori Marquez","content":"PERSON"},{"type":"$400 million","content":"MONEY"},{"type":"Oct. 14, 2022","content":"DATE"},{"type":"$1.4 million","content":"MONEY"},{"type":"0.15%","content":"PERCENT"},{"type":"$800 million","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"Nov. 21, 2022","content":"DATE"},{"type":"$10 million","content":"MONEY"}],"hashtag":["BANKRUPTCY FILINGS","BLOCKFI"],"authors":["Kari McMahon","The Block"]}