{"summary":"The collection features data visualizations representing data collected from the first-ever all-civilian spaceflight.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/148715\/ai-based-nft-collection-by-refik-anadol-auctioned-for-6-2-million","publishDate":"2022-05-25T09:40:45","id":303,"type":null,"title":"AI-based NFT collection by Refik Anadol auctioned for $6.2 million","category":["NFTS"],"content":["Turkish-American artist Refik Anadol has <a href=\"http:\/\/m.koreaherald.com\/amp\/view.php?ud=20220525000700\" data-v-f87c67ca=\"\">auctioned<\/a> off one of his latest non-fungible token (NFT) collections for $6.2 million, the Korea Herald reported on Wednesday.","Titled “An Important Memory for Humanity,” the collection features data visualizations representing data collected from the first-ever all-civilian spaceflight.","The collection is a collaboration between Anadol and LG Display with the latter’s transparent OLED panels serving as the canvas for the digital art piece, developed using artificial intelligence.","According to Anadol, using LG Display’s transparent OLED panels allowed for easy visualization of health, video, and audio data from the spaceflight including telemetry, heartbeats, and ultrasound.","Anadol called the OLED panels an “exciting medium” adding that they are the right fit for displaying “data paintings and data sculptures.”","The Turkish-American new media artist recently <a href=\"https:\/\/twitter.com\/ChristiesInc\/status\/1524194225029627908\" data-v-f87c67ca=\"\">sold<\/a> another NFT piece called “Living Architecture” for $1.38 million. The sale was part of an event held by British auction house Christie’s earlier in May.","Anadol is part of a growing group of digital artists — like Beeple, Anyma, and Krista Kim — in the alternative art space who are using NFTs as a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/98047\/christies-beeple-auction-ends-digital-art\" data-v-f87c67ca=\"\">medium for their creative work<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Krista Kim —","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Korea Herald","content":"ORGANIZATION"},{"type":"$1.38 million","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Anyma","content":"LOCATION"},{"type":"Refik Anadol","content":"PERSON"},{"type":"$6.2 million","content":"MONEY"},{"type":"Anadol","content":"LOCATION"},{"type":"LG","content":"ORGANIZATION"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}