{"summary":"Crypto-friendly Signature Bank has reported a 30% drop in Q1 2020 net income \nThe bank said the drop is due to an increase in the provision for credit losses of $60.5 million\nSignature Bank’s earnings per share (EPS) also came in lower than analyst estimates ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/62914\/crypto-friendly-signature-banks-net-income-falls-30-in-q1-2020","publishDate":"2020-04-24T05:35:20","id":3030,"type":null,"title":"Crypto-friendly Signature Bank&#x27;s net income falls 30% in Q1 2020","category":["Cryptocurrency"],"content":["Crypto-friendly Signature Bank has reported a 30% drop in its net income for the first quarter of 2020, as compared to the first quarter of 2019.","The Q1 2020 net income stood at $99.6 million as compared to $143.5 million in Q1 2019, according to financial results <a href=\"https:\/\/investor.signatureny.com\/file\/Index?KeyFile=403704865\" data-v-f87c67ca=\"\">published<\/a> on Thursday. Signature Bank said the drop in net income is due to an increase in the provision for credit losses of $60.5 million.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe provision for the losses \"was wholly attributable to COVID-19,\" said the bank.&nbsp;","Signature Bank’s earnings per share (EPS) for Q1 2020 also came in lower at $1.88. <a href=\"https:\/\/www.thehour.com\/business\/article\/Signature-Bank-1Q-Earnings-Snapshot-15220362.php\" data-v-f87c67ca=\"\">Analyst estimates<\/a> (Refinitiv Ibes Data) were at $2.18 EPS. The bank’s Q1 2019 EPS was at $2.63.","On a positive side, Signature Bank’s net interest income for Q1 2020 increased by 9.2% at $348.3 million, as compared to the first quarter of 2019. “This increase is primarily due to growth in average interest-earning assets,\" said the bank.","The New York-based bank’s deposits also grew by 15% to $42.24 billion in Q1 2020 as compared to Q1 2019, while average deposits grew by $1.1 billion in Q1 2020.","“This was the second-best quarter of deposit growth we ever reported,” Joseph DePaolo, president and CEO of Signature Bank, said in an <a href=\"https:\/\/seekingalpha.com\/article\/4339507-signature-bank-sbny-ceo-joseph-depaolo-on-q1-2020-results-earnings-call-transcript?part=single\" data-v-f87c67ca=\"\">earnings call<\/a> on Thursday. “Moreover, this is now the third quarter in a row of over $1 billion in deposits in both total and average deposit growth. Since the end of the 2019 first quarter, deposits have increased $5.6 billion and average deposits increased $4.7 billion,” DePaolo added.","Looking at the bank’s lending businesses, loans during Q1 2020 increased 5% to $41 billion as compared to Q1 2019. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“The increase in loans this quarter was again driven primarily by new fund banking capital call facilities. This is the sixth consecutive quarter where C&amp;I [commercial and industrial] outpaced CRE [commercial real estate] growth furthering the rapid transformation of the balance sheet to include more floating-rate assets and diversifying our credit portfolio,” DePaolo said in the earnings call.","Signature Bank’s pre-tax, pre-provision earnings also increased by 5% at $218.5 million in Q1 2020 as compared to $207.9 million for Q1 2019.","“The increase was predominately driven by substantial asset growth of $4.5 billion offset by the investments we made in business initiatives including our West Coast expansion,” said DePaolo.","Signature Bank hired new leadership in the West Coast in Q1 2020 and onboarded private client banking team, said DePaolo, adding: \"As go through the next several years I'd like to see the West Coast take over the East Coast.”","Notably, the Q1 2020 results did not provide details on Signature Bank’s blockchain-based payments platform Signet. It remains unclear how many clients the bank onboarded to Signet and what was the platform's transaction volume in the quarter. The Block has reached out to the bank and will update this story should we hear back."],"hashtag":[]}