{"summary":"Sequoia Capital India and Quona Capital have co-led a $6 million seed round for decentralized finance (DeFi) lending protocol MoHash. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/155068\/sequoia-and-quona-lead-6-million-seed-round-for-defi-protocol-mohash","publishDate":"2022-06-30T08:12:31","id":3032,"type":null,"title":"Sequoia and Quona lead $6 million seed round for DeFi protocol MoHash","category":["ASIA"],"content":["Sequoia Capital India and Quona Capital co-led a $6 million seed round for decentralized finance (DeFi) lending protocol MoHash, according to a news release.&nbsp;","Jump Crypto, Hashed Ventures, Coinbase Ventures, Ledger Prime and CoinSwitch also participated in the round. The Block reached out to a company representative for the valuation, but it had not been disclosed by the time of publication.&nbsp;","Founded in 2021, MoHash is a DeFi protocol that uses crypto assets to provide access to capital and liquidity for private debt in fast-growing economies. It primarily uses stablecoins to achieve this.&nbsp;","“MoHash is bringing real world assets to DeFi users globally and providing sustainable, uncorrelated, and hard to access yields on-chain for the first time,\" said Shailesh Lakhani of Sequoia India. \"We think that this is exactly the type of product DeFi needs - one that leverages the strengths of blockchains and helps solve a real-world problem.\"&nbsp;","The raise comes as fellow players in the crypto lending space face increased pressures on their ability to sustain operations. Earlier this month, Crypto lender Celsius&nbsp;<a href=\"https:\/\/www.theblock.co\/linked\/151522\/crypto-lending-firm-celsius-pauses-withdrawals-and-transfers-citing-market-conditions\" data-v-f87c67ca=\"\">paused withdrawals and transfers<\/a>&nbsp;due to market conditions. The firms's lawyers are now pushing management to&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/154368\/celsius-seeks-show-of-client-support-as-lawyers-push-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">file for a Chapter 11 bankruptcy<\/a>. Yesterday, The Wall Street Journal <a href=\"https:\/\/www.theblock.co\/post\/154760\/celsiuss-risk-profile-close-to-double-that-of-a-us-bank-wsj-reports\" data-v-f87c67ca=\"\">reported<\/a> that its risk profile was almost double that of a US bank at the time of a fund raising last year.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Shailesh Lakhani","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"MoHash","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"$6 million","content":"MONEY"},{"type":"Sequoia India","content":"LOCATION"},{"type":"Sequoia Capital India","content":"ORGANIZATION"},{"type":"Quona Capital","content":"ORGANIZATION"},{"type":"Hashed Ventures","content":"ORGANIZATION"}],"hashtag":["LENDING"],"authors":["Tom Matsuda","The Block"]}