{"summary":"Crypto mining pool Simplecoin and bitcoin gaming platform Chopcoin are shutting down, citing forthcoming EU money-laundering rules\nChristian Grieger, co-founder of both Simplecoin and Chopcoin, claims that the former has 42,000 users, while the latter has 305,000 users\nJust last week, crypto payments startup Bottle Pay also announced that it is shutting down over the EU rules ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/50613\/two-more-crypto-firms-shutting-down-over-impending-eu-money-laundering-rules","publishDate":"2019-12-16T03:15:06","id":3036,"type":null,"title":"Simplecoin and Chopcoin Shutting down: Cites EU money-laundering rules","category":["Regulation"],"content":["Two more firms - cryptocurrency mining pool Simplecoin and bitcoin gaming platform Chopcoin - are shutting down over the AMLD5 European Union regulation coming into effect Jan. 10, 2020.","A <a href=\"https:\/\/simpleco.in\/shutting_down\" data-v-f87c67ca=\"\">notice<\/a> on the Simplecoin website reads that it is closing down on Jan. 1 because the new rules will require the firm to implement several anti-money laundering (AML) know-your-customer (KYC) requirements and it is against those to protect users' privacy.&nbsp;","“When the laws come into effect, we would be forced to require you, the users, to identify yourselves for anti-money-laundering purposes. Mining should be available to anyone and we refuse to jeopardize our users’ privacy,” said Simplecoin.","Christian Grieger, co-founder of Simplecoin, told The Block that the firm has 42,000 users and two employees. Grieger co-founded Simplecoin with Marvin Janssen in Aug. 2018. “Simplecoin allowed users to save mined hashes (digital points) and cash them out for any of the supported currencies, including proof of stake coins that are no longer mineable,” Grieger told The Block.","Users of Simplecoin have until Dec. 20 to withdraw their funds and until Dec. 31 to delete their account information as after this date, wallets and the entire platform will be shut down.","Another firm, bitcoin gaming platform Chopcoin, also co-founded by Grieger is <a href=\"https:\/\/chopcoin.io\/\" data-v-f87c67ca=\"\">shutting down<\/a> for the same reason. <a href=\"https:\/\/www2.deloitte.com\/lu\/en\/pages\/risk\/articles\/amld5-has-entered-into-force.html\" data-v-f87c67ca=\"\">AMLD5<\/a> imposes more stringent reporting obligations for cryptocurrency firms and authorizes Financial Intelligence Units to obtain the addresses and identities of cryptocurrency owners and users.","Grieger told The Block that he co-founded Chopcoin with Joshua Stoffels in Sept. 2015 and the firm has 305,000 users and two employees. Both Simplecoin and Chopcoin did not ever raise any funding from venture firms or investors, Grieger told The Block, adding that he has some plans for other businesses but declined to share further details.","Simplecoin and Chopcoin aren’t the only crypto firms impacted by the regulations. Just last week, cryptocurrency payments startup Bottle Pay <a href=\"https:\/\/www.theblockcrypto.com\/linked\/50496\/uk-crypto-payments-firm-to-shut-down-due-to-new-eu-anti-money-laundering-guideline?utm_source=newsletter&amp;utm_medium=email&amp;utm_campaign=2019-12-16\" data-v-f87c67ca=\"\">announced<\/a> that it is shutting down on Dec. 31 over AMLD5 rules, which would \"alter the current user experience so radically, and so negatively, that we are not willing to force this onto our community.\"&nbsp; Bottle Pay announced the decision just three months after <a href=\"https:\/\/www.theblockcrypto.com\/post\/40658\/team-behind-bottle-pay-raises-2m-to-bring-bitcoin-lightning-network-payments-to-the-masses\" data-v-f87c67ca=\"\">raising<\/a> $2 million in a seed funding round. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nMore crypto firms could likely get succumbed to AMLD5 regulations."],"hashtag":[]}