{"summary":"This opinion involves a federal court lawsuit over the alleged failure to deliver bitcoin mining equipment\nDefendant’s motion to dismiss is granted in part and denied in part\nCourt says that the case can proceed to discovery so that the parties can figure our whether or not party who received $400,000 from equipment was acting as an agent of party who was supposed to deliver the equipment\nNo guidance given (yet) about how damages would be calculated in a case like this","author":["Stephen Palley","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/42187\/bitcoin-mining-contract-stays-in-federal-court-after-motion-to-dismiss-is-mostly-denied","publishDate":"2019-10-06T08:16:41","id":3040,"type":null,"title":"Bitcoin mining contract lawsuit stays in federal court after motion to dismiss is mostly denied","category":["Legal"],"content":["This new federal court opinion comes out of a breach of contract lawsuit relating to the alleged failure to deliver Bitcoin mining equipment in a timely manner. Plaintiff also makes claims for unjust enrichment and alleged violation of the Washington Consumer Protection Act.","The opinion is a mixed bag — it dismisses some of the claims against some of the parties in the lawsuit and keeps a couple of them alive. (It also uses lots of contractions, which I’m a big fan of in judicial opinions — why not make ’em readable? — but which is a source of some disagreement among lawyers).","So, the plaintiff sued a company called Blackhack for allegedly failing to deliver mining equipment. Blackhawk responded by saying, whelp, it may be true that you didn’t get your equipment or that we got paid, but you didn’t have a contract with us — it was with a company called Coin Miner. As a result it said that the Court should dismiss the breach of contract claim against it.","One of the things you learn about in law school is something called Principal\/Agent law. The basic idea is that you can act on behalf of someone else and even bind them to contractual agreements if you have the actual or apparent authority to do so. Here, the court says that the allegations in the lawsuit were solid enough that the breach of contract claim could proceed on the theory that Coin Miner was acting as an agent of Blackhawk. If it later turns out from the evidence that there’s no agency relationship, the court can then dismiss the case.","(This is one of the nuances that exists in federal court in the US, by the way — a lawsuit will survive a motion to dismiss if the allegations state a claim under the law and give the other side enough details to “present a story that holds together[.]” That’s a lay explanation and an over-simplification but the general gist is right.)","The Court also rejected an argument that the defendant didn’t plead an unjust enrichment allegation well enough to survive a motion to dismiss. Unjust enrichment is what’s known as an equitable cause of action, as opposed to one arising at law like a breach of contract claim. There are some FASCINATING historical reasons for this, but I’ll short circuit that and tell you that as a practical matter unjust enrichment claims are often added to lawsuits as an alternative to a breach of contract claim. You don’t have to show a contract, just that Plaintiff conferred a benefit upon the Defendant, that Defendant knew it and appreciate it and that it would be unfair under the circumstances to let the plaintiff keep it without paying. Here, the defendant allegedly got $400,000 from the plaintiff for the equipment that it ordered and the court said, look, at the very least it’s premature to dismiss the case gien that so I’ll let the case proceed for now.","Anyhoo — honestly, pretty standard stuff as lawsuits and judicial opinions go. What I was kinda hoping for from this opinion was something interesting on damages — like what’s the measure of damages for late delay or non-delivery of mining equipment. Do you get to claim lost profits from the lack of ability to mine? And if so, how would you go about making an arguing that such losses were provable, and non-speculative? &nbsp;No such precedent now, but this case isn’t dead yet, so maybe we’ll see some interesting precedent in the future from this one in the future.","<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Disclaimer: Crypto Caselaw Minute is provided for educational purposes only by Stephen Palley (@stephendpalley) and Nelson Rosario (@nelsonmrosario). &nbsp;These summaries are not legal advice. They are our opinions only, aren’t authorized by any past, present or future client or employer. Also, we might change our minds. We contain multitudes. &nbsp;<\/em><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">As always, Rosario summaries are “NMR” and Palley summaries are “SDP”. &nbsp;<\/em>"],"hashtag":[]}