{"summary":"Weather plays a big role in the success of bitcoin mining operations, according to a top executive in the space.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/151012\/how-extreme-texas-weather-impacts-the-bitcoin-mining-industry","publishDate":"2022-06-10T08:46:07","id":3040,"type":null,"title":"How extreme Texas weather impacts the bitcoin mining industry","category":["THE BLOCK"],"content":["When most people consider what it takes to run a successful bitcoin mining operation, the price of the digital asset or the availability of so-called mining rigs come to mind.&nbsp;","Weather also matters.&nbsp;","<span data-v-f87c67ca=\"\">In a <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/150693\/marathon-ceo-explains-the-3-key-factors-that-make-or-break-a-bitcoin-mining-company\" data-v-f87c67ca=\"\">recent episode<\/a><span data-v-f87c67ca=\"\"> of The Scoop, Marathon CEO Fred Thiel talked through the logistics of Marathon’s new West Texas plant, including how extreme weather conditions affect miner productivity.<\/span>","<span data-v-f87c67ca=\"\">As Thiel explains, temperature extremes in both directions have a direct impact on the energy demanded from the grid:<\/span>","<span data-v-f87c67ca=\"\">“If it's 105 degrees in Austin, I bet you there's a lot of air conditioning running and it's running 24\/7 versus just between 4 and 9. And then, in the opposite weather conditions, when it's really cold, people are running their heaters.”<\/span>","<span data-v-f87c67ca=\"\">Still, in these periods of extreme temperature, Thiel says bitcoin mining operations can act as “energy capacitors,” since miners are able to switch off their machines and provide the energy they were consuming directly to the grid.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Marathon has a contract with the Electric Reliability Council of Texas (ERCOT) through which its mining operations can be temporarily halted if the grid needs more power:<\/span>","<span data-v-f87c67ca=\"\">“They can just curtail us and then we shut down for an hour or 2 hours, whatever it is they need, and then we come right back online. You can't do that with food processing industries, you can't do it with steel, you can't do it with most manufacturing — it's a very unique, symbiotic relationship that bitcoin mining and the power industry can have in this regard.”<\/span>","<span data-v-f87c67ca=\"\"> The impact of weather was on display this week with high temperatures in Texas leading to record-breaking usage of power.&nbsp;<\/span>","As <a href=\"https:\/\/www.theblockcrypto.com\/post\/151084\/bitcoin-miners-in-texas-have-been-powering-down-amid-heatwave-and-record-electricity-demand\" data-v-f87c67ca=\"\">reported<\/a> by The Block, many Bitcoin miners in the state have set agreements with ERCOT to power down at peak energy demand times. Advocates say this kind of flexibility can be an asset to the grid.","<span data-v-f87c67ca=\"\">Outside of the fluctuations in energy demand caused by temperature extremes, another way weather affects bitcoin mining is related to overheating the machines themselves, a<\/span><span data-v-f87c67ca=\"\">s Thiel explained during the interview:<\/span>","<span data-v-f87c67ca=\"\">“Where the high heat affects the mining industry is when the temperature starts getting into the 100 degree range… Then all of a sudden you have to start shutting down miners just because they overheat.”<\/span>","<span data-v-f87c67ca=\"\">Marathon is stocking the forthcoming West Texas facility with Bitmain S19 miners, which are rated for operation between 0-40 degrees celsius (32-104 fahrenheit), according to the <\/span><a href=\"https:\/\/shop.bitmain.com\/product\/detail?pid=00020220520140042364UNq72Vcc067E\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">product specifications<\/span><\/a><span data-v-f87c67ca=\"\"> from Bitmain’s website.<\/span>","<span data-v-f87c67ca=\"\">While the Texas climate is a force to be reckoned with, miners are still able to remain operational for most of the year, according to Thiel:<\/span>","<span data-v-f87c67ca=\"\">“When you balance it out over the course of the year, you can most probably even with severe heat spikes and curtailment resulting from that and then cold spells in the winter, you're still most probably over 90% uptime.”<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">To hear more about Marathon’s bitcoin mining operation, listen to the <\/span><\/i><a href=\"https:\/\/www.theblockcrypto.com\/post\/150693\/marathon-ceo-explains-the-3-key-factors-that-make-or-break-a-bitcoin-mining-company\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">full episode<\/span><\/i><\/a><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> now.<\/span><\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Electric Reliability Council of Texas (ERCOT","content":"ORGANIZATION"},{"type":"90%","content":"PERCENT"},{"type":"West Texas","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Marathon","content":"ORGANIZATION"},{"type":"Fred Thiel","content":"PERSON"},{"type":"Austin","content":"LOCATION"},{"type":"Thiel","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"}],"hashtag":["BITCOIN","MINING"],"authors":["Davis Quinton","The Block"]}