{"summary":"Crypto exchange Binance is ceasing its stock tokens trading offering.\nThe move comes as several regulators, including those from Germany and Hong Kong, have warned about the offering.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/111661\/binance-ceases-stock-tokens-trading","publishDate":"2021-07-16T06:07:26","id":3041,"type":null,"title":"Binance says it will no longer offer trading of stock tokens","category":["The Block"],"content":["Crypto exchange Binance announced Friday that it is ceasing trading of its stock tokens. Users of Binance.com will no longer be able to buy stock tokens, effective immediately, <a href=\"https:\/\/www.binance.com\/en\/support\/announcement\/3a0304f3ee1c43668959c1b01f610d59\" data-v-f87c67ca=\"\">said<\/a> Binance.","Existing stock tokens holders should sell their holdings before October 14, said the exchange. If they don't sell by that date, their stock token positions will be closed on October 15.","The news came a few hours ahead of the Hong Kong Securities and Futures Commission's (SFC's) <a href=\"https:\/\/apps.sfc.hk\/edistributionWeb\/gateway\/EN\/news-and-announcements\/news\/doc?refNo=21PR76\" data-v-f87c67ca=\"\">warning on Friday<\/a> that said Binance is not licensed to conduct \"regulated activity\" in the city, specifically offering stock tokens.","\"In Hong Kong, Stock Tokens are likely to be 'securities' under the Securities and Futures Ordinance (SFO) and if so, they are subject to the regulatory remit of the SFC,\" said the regulator.","\"The SFC warns that where the Stock Tokens are 'securities,' marketing and\/or distributing such tokens – whether in Hong Kong or targeting Hong Kong investors – constitute a 'regulated activity' and require a licence from the SFC unless an applicable exemption applies,\" the regulator added.","Stock tokens, also known as tokenized stocks, are blockchain-based shares of publicly traded companies. Unlike traditional shares, stock tokens can be bought in fractions — a feature especially useful for expensive stocks.","Binance <a href=\"https:\/\/www.theblockcrypto.com\/post\/101335\/binance-launches-tokenized-stock-trading-tesla\" data-v-f87c67ca=\"\">launched<\/a> its stock tokens trading service in April of this year and offered five stock tokens: Apple, Coinbase, Microsoft, MicroStrategy, and Tesla. Their 24-hour <a href=\"https:\/\/www.binance.com\/en\/stock-token\" data-v-f87c67ca=\"\">trading volume<\/a> at the time of writing was only around $1 million, according to Binance's website. And since the launch of the service, these tokens did a total combined trading volume of nearly $73 million, according to data from <a href=\"https:\/\/stomarket.com\/\" data-v-f87c67ca=\"\">Security Token Market<\/a>.&nbsp;","Earlier this year, Germany's Federal Financial Supervisory Authority, or BaFin, also <a href=\"https:\/\/www.theblockcrypto.com\/linked\/103143\/german-finance-regulator-issues-warning-about-binances-stock-tokens-offering\" data-v-f87c67ca=\"\">said<\/a> that Binance may be in violation of the country's securities laws in connection with its stock tokens offering.","The U.K.'s Financial Conduct Authority was also reportedly <a href=\"https:\/\/www.theblockcrypto.com\/post\/102563\/binance-european-regulators-stock-token-offering\" data-v-f87c67ca=\"\">examining<\/a> whether Binance complied with security rules before launching the stock tokens trading service.","Binance offered the service via German financial services firm CM-Equity. The exchange today said CM-Equity AG is setting up its own stock tokens trading portal for residents of the European Economic Area (EEA) and Switzerland and that Binance users in these regions could utilize that portal once launched.","\"Those users may transition their stock token balances to CM-Equity AG once its new portal is established,\" said Binance. \"The portal is scheduled to be open approximately two-to-four weeks before 2021-10-15 (UTC), and additional KYC measures will be requested by CM-Equity AG to complete the transition.\"","It's unclear why Binance had to cease its stock tokens trading service when other crypto exchanges including FTX and Bittrex Global offer similar service via CM-Equity AG. When contacted, a Binance spokesperson told The Block that \"we believe shifting our commercial focus to other product offerings will better serve our users.\"","Binance also appears to be under scrutiny for its primary offering of cryptocurrency trading in several countries around the world. Regulators in the U.S, the U.K., Italy, Japan, Thailand, Poland, and the Cayman Islands&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/post\/111482\/italy-binance-consob-warning\" data-v-f87c67ca=\"\">have all<\/a> either issued warnings or taken action against the exchange recently.","<em data-v-f87c67ca=\"\">This story has been updated to include the Hong Kong warning and comments from a Binance spokesperson.<\/em>","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to subscribe to The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/t.me\/the_block_crypto\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/t.me\/the_block_crypto\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Telegram<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>"],"hashtag":["BINANCE"]}