{"summary":"Korean crypto startup Contents Protocol Team is shutting shop and refunding investors\nThe startup raised a total of 29,334 ETH via an ICO and private token sale in 2018\nLack of business prospects and regulatory uncertainty contributed to the fallout  ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/56339\/a-korean-startup-that-raised-millions-in-eth-via-ico-is-shutting-down-and-refunding-investors","publishDate":"2020-02-19T04:10:33","id":3044,"type":null,"title":"A Korean startup that raised millions in ETH via ICO is shutting down and refunding investors","category":["ICO and IEO"],"content":["South Korean crypto startup Contents Protocol Team, which raised a total of 29,334 ETH (~$8.15 million in today's prices) via initial coin offering or ICO and private token sale, is shutting down and refunding investors.","Announcing the news on Wednesday, Contents Protocol <a href=\"https:\/\/contentsprotocol.io\/\" data-v-f87c67ca=\"\">said<\/a> it took the decision due to lack of business prospects and continued regulatory uncertainty in the crypto sector.","The project <a href=\"https:\/\/medium.com\/contents-protocol\/how-to-watcha-watcha-play-b2f2e856e135\" data-v-f87c67ca=\"\">aimed to<\/a> collect consumer data from local content platforms like Watcha and Watcha Play, by rewarding the platforms and their users with Contents Protocol’s native token CPT. Watcha is a Korean movie rating and recommendations app and Watcha Play is a local online movie streaming service like Netflix.","Contents Protocol then aimed to sell the collected data to content providers for creating a better content production ecosystem. But that idea didn’t seem to work.","“There were numerous difficulties in encouraging participation from content consumers because of their negative perception toward cryptocurrency, price volatility and complex user experience. It was also a challenge to bring in content platforms who would provide data to Contents Protocol. With limited capacity in data collection, it was difficult to provide useful insight that could help content producers,” said the firm.","Uncertain legal and accounting risks also contributed to the fallout, per the announcement.&nbsp;","Contents Protocol is now liquidating and distributing its remaining assets to investors. The firm has around 26,878 ETH ($7.52 million) left after expenses, and will distribute these to CPT holders in the following ratio:","","","Contents Protocol held an ICO from Dec. 17-20 in 2018, according to <a href=\"https:\/\/icobench.com\/ico\/contents-protocol\" data-v-f87c67ca=\"\">information<\/a> from ICObench. At the time, one ETH was worth around $115, meaning the total value of ETH the firm raised was around $3.40 million. The price of ETH has more than doubled since then and is currently trading at around $280 a piece.&nbsp;"],"hashtag":[]}