{"summary":"The UK business entity saw higher losses after a change in accounting methodology.\nR3’s Corda platform supports many of Europe’s best-known enterprise blockchain pilots.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/85068\/r3-cash-position-uk-entity-losses-2019","publishDate":"2020-11-18T11:37:03","id":3045,"type":null,"title":"R3 says it&#x27;s in a &#x27;very strong cash position&#x27; despite UK entity losses in 2019","category":["Startups"],"content":["The UK subsidiary of leading enterprise blockchain business R3 lost £19.6m in 2019 after posting a slim profit the previous year, according to the company’s latest filings.","R3 spokespeople say the company is in good health at the group level, however.","“You can’t extrapolate the figures reported in the UK to the wider R3 global business. That would be misleading and foolish!” said R3’s chief communications officer Charley Cooper, in response to questions from The Block.","“So for the bigger picture, R3 is fortunate to be in a very strong cash position. We can confirm the company is not in an overall debt position,” he added.","R3’s New York-headquartered parent company is privately held and does not report annual performance numbers.","In the UK, R3 Limited saw revenues fall 35.6% on the previous year to just over £13m, while costs increased significantly, according to annual accounts covering the 12 months to December 31, 2019, published on October 6. Headcount alone grew from 109 at the end of 2018 to 162 by the end of the following year, raising staff costs 35% to £19.8m.","The UK company also reported £58.2m in debt coming due within one year of December 31, 2019. On the same date, it held roughly £25.2m in cash.","R3 Limited’s annual report states that the UK business’s turnover fell as the result of a change in accounting methodology following a Transfer Pricing study by Deloitte. R3 Limited switched from a “cost-plus basis” in 2018 to a “profit\/loss split” with R3 LLC, a US subsidiary of parent company R3 Holdco LLC, in 2019.","In <a href=\"https:\/\/www.bdo.global\/en-gb\/insights\/tax\/transfer-pricing\/react-profit-splits-and-cost-sharing-what-about-losses\" data-v-f87c67ca=\"\">a recent post<\/a> on such accounting methods, BDO Global explains that profit splits “are typically implemented when the participating parties to an intercompany transaction both (or all) own significant intangibles that are put to use as part of the transaction”, adding that a similar arrangement can apply to cost arrangements.","R3’s private blockchain platform Corda serves as the bedrock for many of Europe’s best-known enterprise blockchain pilot programmes, in addition to supporting the efforts of a number of central banks which are exploring the development of central bank digital currencies.","High profile projects running on Corda include Switzerland’s SIX Group long-awaited digital assets exchange, the<a href=\"https:\/\/www.theblockcrypto.com\/linked\/80730\/italian-banks-r3-corda\" data-v-f87c67ca=\"\"> Spunta interbank reconciliation system<\/a> in Italy and Sweden’s CBDC pilot.","R3 began life in 2015 as a project backed by a consortium of global banks, but later morphed into a private business. The company raised $107m from a number of big banks and Intel, the technology firm, in May 2017."],"hashtag":[]}