{"summary":"There was huge news on the ICO\/token sale front from the SEC on Friday regarding two initial coin offering (ICO) issuers. Let’s break it down. What","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/3571\/the-sec-cracks-down-on-two-icos-creates-a-template-for-future-enforcement","publishDate":"2018-11-17T10:51:33","id":3045,"type":null,"title":"The SEC cracks down on two ICOs, creating a template for future enforcement","category":["ICO AND IEO"],"content":["There was huge news on the ICO\/token sale front <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2018-264\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">from the SEC<\/a> on Friday regarding two initial coin offering (ICO) issuers. Let’s break it down.","<strong data-v-f87c67ca=\"\">What happened<\/strong>? Cease-and-desist orders were entered under the <a href=\"https:\/\/en.wikipedia.org\/wiki\/Securities_Act_of_1933\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Securities Act of 1933<\/a> against two companies that raised money in token sales in late 2017. The SEC says:","(1) each company’s token was a security","(2) each broke U.S. securities laws because they","(a) failed to register with the SEC","(b) did not qualify for an exemption","<strong data-v-f87c67ca=\"\">Who are the companies<\/strong>?&nbsp; Here is how the orders describe them:","<strong data-v-f87c67ca=\"\">How much money did they raise?<\/strong>&nbsp; Airfox raised $15 million in its ICO. Paragon raised $12 million.","If you sell securities in interstate commerce in the U.S. you have to register with the SEC unless you fall within an exemption. Neither Airfox nor Paragon did this. That’s what these two orders and the remedies they impose deal with.","<strong data-v-f87c67ca=\"\">What are the implications?<\/strong> A number of things jump out about these two orders:","<b data-v-f87c67ca=\"\">(1) A template:&nbsp;<\/b>They are nearly identical in structure. In a number of sections the language is identical. The introductory paragraphs are exactly the same language, including the same initial footnote. The same is true of the language describing the remedial actions and penalties at the end of each order. <em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">In short, <\/strong><strong data-v-f87c67ca=\"\">the SEC has developed or appears to be developing a template for ICO enforcement.<\/strong><\/em>","It is not very difficult once there is an enforcement template in place to look down the list of tokens on www.coinmarketcap.com and start instituting boilerplate enforcement actions against issuers with a U.S. nexus.","<b data-v-f87c67ca=\"\">(2)<\/b>&nbsp;<strong data-v-f87c67ca=\"\">Publicly available information<\/strong>: Each order provides a detailed factual record derived in substantial measure from the ICO white papers, social media comments, websites, and a large record of public statements. The SEC had these folks dead to rights based on things that were easily available in the public.&nbsp; This was entirely predictable and some of us predicted it.","<strong data-v-f87c67ca=\"\">(3)<\/strong>&nbsp;<strong data-v-f87c67ca=\"\">Functionality did not exist:<\/strong> In both cases, the token sale was used to raise money for functionality that did not exist and that would only exist once built using token sale proceeds. For example, in the case of Airfox, the SEC observes:","“The terms of Airfox’s initial coin offering purported to require purchasers to agree that they were buying AirTokens for their utility as a medium of exchange for mobile airtime, and not as an investment or a security. &nbsp;At the time of the ICO, this functionality was not available. Rather, the Airfox App was a prototype that only enabled users to earn and redeem loyalty points, which could be exchanged for mobile airtime. According to the company, the prototype was “really just for the ICO and just for investment purposes so people know&nbsp;... how it’s going to work” and “[did not] have any real users” at the time of the ICO. Despite the reference to AirTokens as a medium of exchange, at the time of the ICO, investors purchased AirTokens based upon anticipation that the value of the tokens would rise through Airfox’s future managerial and entrepreneurial efforts.”","<strong data-v-f87c67ca=\"\">(4) An \"ecosystem\" is not not a defense:<\/strong>&nbsp;Both projects promised to build an “ecosystem” that would give the token value. “But it’s an ecosystem,” it seems, is not a defense to a securities enforcement action. Similarly, calling something a “utility token” doesn’t fool anyone either (see (3) above).","<strong data-v-f87c67ca=\"\">(5) Promises of a secondary-trading market:<\/strong>&nbsp;In both Orders the SEC notes that the issuers highlighted to investors that the the issuer “ensure a secondary trading market for [Paragon] PRG tokens would be available shortly after the completion of the offering and prior to the creation of the ‘ecosystem’.” In other words, the fact that the tokes were marketed as speculative trading instruments that would be available on crypto exchanges did not escape the SEC’s eye and was certainly a factor in its conclusion that these things were in fact securities.","<strong data-v-f87c67ca=\"\">(6) Cut-and-paste legal analysis:<\/strong>&nbsp;The legal analysis is exactly the same in both orders. They appear to be cut and paste, in fact, tailored to the precise facts of each case. In fact, paragraphs 37 and 44 of the Paragon Order are identical to paragraph 17 and 23 of the AirFox Order. It’s pretty much straight <a href=\"https:\/\/consumer.findlaw.com\/securities-law\/what-is-the-howey-test.html\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Howey Test<\/a>, with a nod to the DAO report and a wave at <em data-v-f87c67ca=\"\"><a href=\"https:\/\/www.sec.gov\/litigation\/admin\/2017\/33-10445.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">In re Munchee<\/a><\/em>. (As a reminder: “An investment contract is an investment of money in a common enterprise with a reasonable expectation of profits to be derived from the entrepreneurial or managerial efforts of others.” There is no blockchain exception.).","<strong data-v-f87c67ca=\"\">(7) Tokens that fit within the Howey rubric are securities:<\/strong>&nbsp;In fact, some of the language in these orders also appears in the <em data-v-f87c67ca=\"\">In Re Munchee<\/em> Order from December 11, 2017.&nbsp; The Legal Analysis section in both looks like a cut and paste. The SEC made it clear that tokens that fit within the Howey rubric are actually securities. The roadmap and analytical framework were there, for anyone who wanted to see it.","<strong data-v-f87c67ca=\"\">(8) The remedial actions are identical:<\/strong>&nbsp;In both cases the remedial actions and undertakings by the companies are identical  --  payment of a $250,000 penalty to the SEC, registration of the token as a class of security, publication of a <br data-v-f87c67ca=\"\">\n\"claim form” to token purchasers, ongoing Exchange Act reporting for at least one year, and a number of other reporting obligations to the SEC regarding compliance with the Order. Does that mean these cases provide a “roadmap” for how to bring an errant ICO into compliance? Maybe. Maybe not.&nbsp; They do show a path that these two companies were able to follow. Whether it will work for them and whether it will be available for others remains to be seen.&nbsp; For now, resolution appears to remain <em data-v-f87c67ca=\"\">ad hoc<\/em>.","<strong data-v-f87c67ca=\"\">(9) No fraud or misrepresentation is involved:<\/strong>&nbsp;Neither case involves fraud or misrepresentation of any kind. The SEC didn’t come down on these companies due to allegations that they ran off with money to pay for fancy cars or home furnishings as they have in some other well-publicized enforcement litigation. Rather, the SEC is focusing here on a statutory requirement that one must register securities unless they qualify for an exemption. This has been the law in the United States since the 1930s, and this law applies with equal weight, blockchain or no blockchain. This shouldn’t be a surprise to anyone in the space, post <a href=\"https:\/\/www.sec.gov\/litigation\/investreport\/34-81207.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">the DAO report<\/a>, which is also cited in both Orders.","<strong data-v-f87c67ca=\"\">What happens next?<\/strong> If you look at the SEC’s actions and statements over the past 18 months or so, you can see a clear pattern. It started with a warning from the SEC that securities laws apply to token sales in the DAO Report. This was followed by a focus on clearly fraudulent offerings.","Next, in <em data-v-f87c67ca=\"\">In re Munchee,<\/em> the SEC warns one must file a registration statement. The SEC issued a cease-and-desist order, while allowing the issuer to shut down its offering and return the money it received — no penalty imposed. Finally, on Friday, the SEC has imposed civil penalties on two larger issuers, and imposed registration and other obligations on them.","In short, it would appear that the screws are tightening on ICOs, and it seems reasonable to expect them to tighten more. It would also seem that the volume of enforcement actions by the SEC is set to increase given the consistency of language and apparent enforcement template that now exists.","From a five act play standpoint, we’re definitely in Act III territory now.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"AirFox Order","content":"ORGANIZATION"},{"type":"$250,000","content":"MONEY"},{"type":"Airfox’s","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"December 11, 2017","content":"DATE"},{"type":"$12 million","content":"MONEY"},{"type":"Paragon Order","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Airfox nor Paragon","content":"ORGANIZATION"},{"type":"1930s","content":"DATE"},{"type":"AirTokens","content":"ORGANIZATION"},{"type":"1933","content":"DATE"},{"type":"Airfox App","content":"ORGANIZATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"Airfox","content":"LOCATION"},{"type":"ICOs","content":"ORGANIZATION"},{"type":"$15 million","content":"MONEY"},{"type":"Howey","content":"PERSON"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"United States","content":"LOCATION"}],"hashtag":["SEC"],"authors":["Stephen D. Palley","The Block"]}