{"summary":"Coinbase found American interest in Bitcoin and crypto is increasing, if search engine data is any indication\nU.S. legislation surrounding crypto has also led to increased interest in the space, according to Coinbase’s research","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/29544\/coinbase-data-shows-americans-are-googling-bitcoin-a-lot","publishDate":"2019-06-28T19:24:46","id":3046,"type":null,"title":"Coinbase data shows Americans are Googling Bitcoin. A lot.","category":["Bitcoin"],"content":["<span data-v-f87c67ca=\"\">A new report from Coinbase shows Americans have Bitcoin on the brain, whether or not they’re invested. The term dominated Google searches, surpassing “royal wedding” and “election results,” as well as exceeding searches for Kim Kardashian three-fold in December, according to research conducted by YouGov.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\"><a href=\"https:\/\/blog.coinbase.com\/the-united-states-of-crypto-55282c97855c\" data-v-f87c67ca=\"\">Coinbase said<\/a> this indicates Bitcoin is headed to the mainstream in the U.S., with YouTube searches for crypto also reaching an all-time high. They also said legislatures are following suit, passing crypto-focused legislation.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Indeed, crypto has reached some mainstream media outlets with intrigue surrounding Facebook’s Libra, as legislative bodies in the U.S. and across the world take note and begin talks of how Libra could work within their jurisdictions.<\/span>","<span data-v-f87c67ca=\"\">According to Coinbase, 58% of Americans indicate they’ve heard of bitcoin. Those surveyed reported a variety of reasons for interest. Some said they were looking to diversify their assets, while others were primarily concerned with the potential of decentralized finance.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Some states showed more holders than others, with California leading the pack, followed by New Jersey, Washington, New York and Colorado respectively rounding out the top five. Coinbase also highlighted that Alaska reached number eight on the list for highest percentage of crypto holders, but clocked the lowest percentage of unaided brand awareness for Bitcoin, showing only 18%.<\/span>","<span data-v-f87c67ca=\"\">Washington, New York and California also appeared on the list of the top five states with the highest average account value per crypto owner, with Delaware leading the group.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On the legislative front, Coinbase found more than 70% of states enacted regulations impacting crypto and blockchain as of this month. Wyoming, for example, passed 13 laws recognizing crypto as money and allowing banks to deal with digital assets, according to Coinbase. New York State has issued 18 BitLicenses to broker trades and other deals.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Coinbase also found around 15% of Americans said they were at least “somewhat” likely to buy crypto in the near future.<\/span>","<span data-v-f87c67ca=\"\">The data was derived from Coinbase user activity and research conducted by YouGov for the exchange. Outside data from YouGov was collected in late 2018 and included 2,000 U.S. adult internet users.<\/span>"],"hashtag":["COINBASE"]}