{"summary":"Tether is launching on Hermez, an Ethereum Layer 2 scaling solution that uses ZK-Rollups.\nTether CTO Paolo Ardoino told The Block that Hermez is a “really good scalability solution” since it helps store the entire data rollup on-chain.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/90738\/tether-usdt-hermez-ethereum-layer-2-scaling-solution-zk-rollups","publishDate":"2021-01-11T08:00:29","id":3048,"type":null,"title":"Tether is launching on Hermez — an Ethereum Layer 2 scaling solution that uses ZK-Rollups","category":["Tether"],"content":["Stablecoin Tether (USDT) is launching on Hermez Network — an <a href=\"https:\/\/www.theblockcrypto.com\/linked\/1719\/ethereum-constantinople-hard-fork-goes-live-on-testnet-with-some-issue\" data-v-f87c67ca=\"\">Ethereum<\/a> Layer 2 scaling solution that uses ZK-Rollups.","Sharing the news with The Block on Monday, Hermez said USDT will go live on the network when its mainnet launches in the coming weeks. Hermez is targeting mid-February for the launch, technical lead Jordi Baylina told The Block in an interview.","ZK-Rollups are a <a href=\"https:\/\/ethereum.org\/en\/developers\/docs\/layer-2-scaling\/\" data-v-f87c67ca=\"\">Layer 2 solution<\/a> that help scale Ethereum. They bundle hundreds of transfers into a single transaction, reducing data storage and gas fees for validating transactions. ZK-Rollups use a cryptography technique called zero-knowledge proofs that runs computation off-chain and submits a validity proof to Ethereum.","So when a transaction takes place using ZK-Rollups, it goes through, said Jordi. With Optimistic Rollups, on the other hand, a transaction can be challenged, he said. <a href=\"https:\/\/www.theblockcrypto.com\/linked\/89907\/ethereum-layer-2-scaling-solution-optimism-preliminary-mainnet-january-15\" data-v-f87c67ca=\"\">Optimistic Rollups<\/a> are another Layer 2 scaling solution for Ethereum, which assumes transactions are valid by default (optimistic approach) and only runs computation in the event of a challenge.","There are pros and cons of both the solutions. Tether CTO Paolo Ardoino told The Block in the interview that the stablecoin issuer chose Hermez because it is a \"really good scalability solution\" since it helps store the entire data rollup on-chain.","Implementing Layer 2 scaling solutions is necessary, said Ardoino, because Ethereum will be \"more and more clogged before <a href=\"https:\/\/www.theblockcrypto.com\/daily\/85771\/eth2-phase-0-roll-out-long-way-to-go\" data-v-f87c67ca=\"\">Ethereum 2.0<\/a> goes live\" in the coming years.","Jordi said Hermez will help process 2,000 transactions per second at \"one-tenth\" of current fees. Ethereum's current capacity is about 15 transactions per second, and the <a href=\"https:\/\/bitinfocharts.com\/comparison\/ethereum-transactionfees.html\" data-v-f87c67ca=\"\">current average fee<\/a> is about $11 per transaction.","Tether <a href=\"https:\/\/www.theblockcrypto.com\/linked\/76552\/tether-plans-zk-rollups-support-reduce-pressure-on-ethereum\" data-v-f87c67ca=\"\">first revealed its plan to implement ZK-Rollups<\/a> in September, after integrating with OMG Network, another Layer-2 scaling solution that is designed to reduce congestion on Ethereum.","When asked if Tether is looking to integrate with more Layer-2 solutions, Ardoino said not so in the near future.","As for Hermez, Jordi said it is in \"conversation with other projects\" for possible integrations. He added that any project offering support for ERC-20 tokens can launch on the network since it is a decentralized solution."],"hashtag":["ETHEREUM","TETHER"]}