{"summary":"Former Consensys product lead Ben Edgington has joined development company OP Labs as its lead technical program manager.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276694\/ben-edgington-consensys-op-labs","publishDate":"2024-02-08T07:35:21","id":3049,"type":null,"title":"Former Consensys product lead Ben Edgington joins OP Labs","category":["PEOPLE"],"content":["Former Consensys product lead Ben Edgington has joined Layer 2 developer OP Labs as its lead technical program manager.","“As Lead Technical Program(me) Manager at OP Labs I will, ‘grow and manage the core development program, working with engineering, product, and governance teams towards the success and decentralization of the [Optimism] Collective,” Edgington <a href=\"https:\/\/x.com\/benjaminion_xyz\/status\/1755248488516915403?s=20\" data-v-f87c67ca=\"\">said<\/a>.","OP Labs is the core contributor to Optimism — an ecosystem of Ethereum Layer 2 chains that utilize optimistic rollups to bring down transaction costs for dapps. The ecosystem is governed by its DAO known as the Optimism Collective.","The move follows the Edgington's <a href=\"https:\/\/x.com\/benjaminion_xyz\/status\/1749127053306138985?s=20\" data-v-f87c67ca=\"\">departure<\/a> from Ethereum development firm Consensys last month. “After 6.3 fabulous years, I have left Consensys. I won't be going far, however. I am #crypto4lyfe,” Edgington <a href=\"https:\/\/x.com\/benjaminion_xyz\/status\/1749127053306138985?s=20\" data-v-f87c67ca=\"\">said<\/a> at the time.","After joining ConsenSys in 2017, Edgington shortly moved on to work on Ethereum-based software products. He started developing what would become Teku (originally called Artemis), a widely used staking client software for Ethereum.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ben Edgington","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"Edgington","content":"LOCATION"},{"type":"Edgington","content":"PERSON"},{"type":"Artemis","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["HIRING","OPTIMISM"],"authors":["James Hunt","The Block"]}