{"summary":"Crypto has made a resurgence in recent months, and the stablecoin sector is joining in the excitement.  With several new projects launching, experts","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274469\/the-decentralized-value-of-next-gen-stablecoins","publishDate":"2024-01-26T09:01:56","id":3051,"type":null,"title":"The Decentralized Value of Next Gen Stablecoins","category":["SPONSORED"],"content":["Crypto has made a resurgence in recent months, and the stablecoin sector is joining in the excitement.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp; <\/span>With several new projects launching, experts speculate that the stablecoin segment could become <a href=\"https:\/\/fortune.com\/crypto\/2023\/02\/26\/stablecoins-statecraft-uncle-sam-satoshi-digital-currency\/\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">a trillion-dollar industry by 2030<\/span><\/a>. This anticipation stems from a very tangible, long-standing function of stablecoins acting as a hedge against market volatility while serving a real-world purpose as a store of value in the form of “programmable money.”&nbsp;","Despite this optimistic outlook, today’s most prominent stablecoins face some limitations that may hinder their future growth. For example, a growling number of chains and app chains must rely on “<a href=\"https:\/\/www.cnbctv18.com\/cryptocurrency\/explained-what-are-wrapped-coins-and-how-they-function-12405852.htm\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">wrapped<\/span><\/a>” stablecoins, dependent on cross-chain bridges with uncertain security. Also, the economic benefits from reserve assets backing stablecoins are often captured by a few centralized players instead of being used to support decentralized ecosystems.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp; <\/span>Finally, many stablecoins struggle to provide transparent verification of their assets, as shown by the <a href=\"https:\/\/www.theblock.co\/post\/273263\/trueusd-continues-to-depeg-hits-low-point-of-0-97\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">recent depeg of TUSD<\/span><\/a>.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp; <\/span>For stablecoins to achieve their potential in coming years, decentralized markets will require a “next generation” of technology and features.","<b data-v-f87c67ca=\"\">Omnichain Expansion<\/b>","Accessibility is a key factor in the success of stablecoins, especially as we enter an omnichain future. Acting as a pegged unit of account for lending, borrowing, and other financial services across multiple blockchain ecosystems, stablecoins face the practical need to use fiat-linked money in cross-blockchain transactions. In this respect, interoperability is paramount. Solutions enabling decentralization offer omnichain interoperability, offering fair distribution of value, enhancing accessibility and adaptability across the ecosystem. LayerZero’s <a href=\"https:\/\/layerzero.gitbook.io\/docs\/evm-guides\/layerzero-omnichain-contracts\/oft\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">OFT standard<\/span><\/a> – and the recent introduction of <a href=\"https:\/\/usdv.money\/about\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">USDV<\/span><\/a>, a stablecoin designed with interoperable OFT standard integration at launch – exemplifies a new generation of stablecoins that overcome the dangerous prospect of “one-chain-above-all” by promoting interoperability across an ecosystem of multiple blockchain communities.","<b data-v-f87c67ca=\"\">Decentralized Value<\/b>","Instead of relying on a centralized private entity to issue stablecoins, a better model could involve a robust community of stablecoin minters to facilitate sustainability and adoption. Achieving this goal requires a new mechanism to track and share economic value, which can in turn provide incentives to minters and ensure equitable rewards for their contributions. Such a decentralized model is inherently more scalable, enabling stablecoins to circulate as fungible tokens across more geographies and use cases, with deeper liquidity pools and connections to many more chains.","<b data-v-f87c67ca=\"\">Transparency: Gone are the days of audit reports<\/b>","Although all cryptocurrencies consider ‘transparency’ to be a fundamental principle inherent in blockchain technology, the reality is that it’s easy for crypto-ventures to obscure certain information, especially when it comes to financials. Stablecoins, in particular, may not always provide visibility around underlying reserves. Through innovations like <a href=\"https:\/\/chain.link\/education-hub\/proof-of-reserves\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">on-chain Proof of Reserves<\/span><\/a> – which allow real-time public attestations of reserves on the blockchain – stablecoins like USDV provide true transparency and immediate access to financial metrics.","Now, as stablecoins become increasingly instrumental in various blockchain financial applications – from payments and lending to financial products – reimagining stablecoins and bringing an era of the new generation of stablecoins will be critical in uncapping crypto’s potential and real-world applications.","<i data-v-f87c67ca=\"\">About the author: President of the Verified USD Foundation, Matthew Commons<\/i>","<i data-v-f87c67ca=\"\">Matthew is a senior executive and serial entrepreneur in the FinTech and Web3 fields.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp; <\/span>At the <\/i><a href=\"https:\/\/usdv.money\/about\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Verified USD Foundation<\/i><\/span><\/a><i data-v-f87c67ca=\"\">, he focuses on facilitating seamless, equitable, and transparent on-chain and off-chain digital asset transactions.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp; <\/span>Committed to fostering a shared digital asset ecosystem, the Foundation uses an orphan special purpose vehicle (SPV) structure to manage stablecoin reserves, upholding the highest standards of transparency and fiduciary duty. USDV is interoperable and currently available on Ethereum, BSC, Avalanche, Arbitrum, Optimism, Polygon and Viction, with more coming soon. Learn more <\/i><a href=\"https:\/\/usdv.money\/about\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">here<\/i><\/span><\/a><i data-v-f87c67ca=\"\">.<\/i>","<em data-v-f87c67ca=\"\">This post is commissioned by Matrixport and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USDV","content":"ORGANIZATION"},{"type":"Foundation","content":"ORGANIZATION"},{"type":"fiat","content":"ORGANIZATION"},{"type":"FinTech","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Matrixport","content":"PERSON"},{"type":"Verified USD Foundation","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Matthew Commons","content":"PERSON"},{"type":"Arbitrum","content":"LOCATION"},{"type":"OFT","content":"ORGANIZATION"},{"type":"2030","content":"DATE"}],"hashtag":[],"authors":["Sponsored","The Block"]}