{"summary":"Transport for London has increased its scrutiny of crypto-related advertising on its network. \nThe new stance is said to have come into effect following an Advertising Standards Authority investigation into Floki adverts in November 2021.","author":["Lucy Harley-McKeown","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/129290\/london-travel-network-cracks-down-on-crypto-ads-amid-regulation-blitz","publishDate":"2022-01-05T11:23:47","id":3054,"type":null,"title":"London travel network cracks down on crypto ads amid regulation blitz","category":["Regulation"],"content":["<span data-v-f87c67ca=\"\">London transport authorities have tightened the reins on crypto advertising following a number of rulings by the UK’s marketing regulator.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Short of an outright ban, a spokesperson for Transport for London (TfL) told The Block that the body is not currently approving any adverts which “look to promote [crypto] products in a similar fashion to those being investigated.”<\/span>","TfL has been monitoring crypto advertising since 2018, but only recently decided to take a harder line on ad approvals.","<span data-v-f87c67ca=\"\">A spokesperson from the Advertising Standards Authority (ASA) said that the regulator is “proactively monitoring” the situation as firms push to market products. The watchdog is set to issue new guidance on crypto ads early in 2022.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Advertising industry sources, who asked not to be named due to commercial sensitivity, told The Block they have been having trouble getting crypto-related adverts for clients signed off, including ones promoting NFTs.&nbsp;<\/span>","The new stance from TfL is said to have come into effect following the ASA<span data-v-f87c67ca=\"\"> investigation into Floki adverts, which had breached its code.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">These ads urged consumers to look to the token if they had not been quick enough to buy into other popular cryptocurrencies such as Dogecoin before meteoric price bumps. <\/span>","“Missed Doge? Get Floki,” said one strapline.&nbsp;","<span data-v-f87c67ca=\"\">In December, the ASA issued a ‘red alert’ warning on the marketing of crypto-assets, banning seven separate ads in one swoop.<\/span>","<span data-v-f87c67ca=\"\">Companies whose ads were deemed to have broken the rules at the time included trading platforms eToro and Coinburp; exchanges EXMO, Luno, Kraken and Coinbase; as well as a promotion from pizza chain Papa John's.&nbsp;<\/span>","Since then it has also ruled on Arsenal Football Club's marketing of <a href=\"https:\/\/www.theblockcrypto.com\/post\/128283\/uk-watchdog-bans-arsenal-football-club-fan-token-ads\" data-v-f87c67ca=\"\">fan tokens<\/a> and two <a href=\"https:\/\/www.theblockcrypto.com\/linked\/129097\/uk-regulator-bans-two-crypto-com-ads-in-latest-crackdown\" data-v-f87c67ca=\"\">adverts from Crypto.com<\/a>."],"hashtag":[]}