{"summary":"The Dutch investor primarily invests in DeFi protocols and Web3 apps.\nThe firm has closed 28 new deals since June, when its second fund closed a first raise of $40 million.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/126080\/maven-11-capital-closes-second-crypto-investment-fund-at-120-million","publishDate":"2021-12-02T07:00:38","id":3056,"type":null,"title":"Maven 11 Capital closes second crypto investment fund at $120 million","category":["DeFi"],"content":["Maven 11 Capital, an Amsterdam-based crypto investor, has closed its second venture capital fund with a total of $120 million raised, according to an announcement.","The vehicle, named Venture Fund II, is a closed-end fund that wrapped up a $40 million ‘first raise’ in June. Since then, the Maven team has made 28 investments — primarily in DeFi protocols and Web3 apps.","Maven has been venture investing since 2017, and through its two funds has backed projects such as Celestia, Qredo, Nym Technologies, Spectral Finance, Merit Circle, Maple Finance, Anoma and Zapper.","Balder Bomans, a partner at Maven 11 Capital, said the company invests in both tokens and equity. But he added that he “very strongly believes that tokens are going to be the go-to in terms of crypto and the development of this asset class.”","Like a growing number of crypto-native investment firms, Maven also plays an active role helping the protocols it has backed to grow. It is, for example, acting as a ‘pool delegate’ for <a href=\"https:\/\/www.theblockcrypto.com\/post\/124694\/defi-goes-institutional-maple-finance-offers-syndicated-loans-to-alameda-research\" data-v-f87c67ca=\"\">Maple Finance<\/a> — which entails managing a collection of lenders and borrowers whose contracts are buttressed by blockchain technology.","“As a venture capitalist we think our model will massively change within the coming years. It’s already changing in terms of what our roles are within these ecosystems,” said Bomans. &nbsp;","The capital for Maven’s first fund came primarily from wealthy individuals, whereas its second vehicle also manages money contributed by crypto entrepreneurs, family offices and institutions such as fund-of-funds. &nbsp;","As for where that capital will be directed, Bomans said Maven is bullish on the ability of DeFi to make financial markets more efficient, and highlighted options and insurance as two underdeveloped areas that the firm is keen on.","It is also looking closely at non-fungible token (NFT) infrastructure players, and has already invested in NFTfi, a marketplace for NFT-backed loans."],"hashtag":[]}