{"summary":"Tether has frozen 46 million of USDT owned by crypto exchange FTX, as a result of a request from law enforcement.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/185353\/tether-freezes-46-3-million-usdt-owned-by-ftx-at-request-of-law-enforcement","publishDate":"2022-11-10T09:42:44","id":3060,"type":null,"title":"Tether freezes 46.3 million USDT owned by FTX at request of law enforcement","category":["COMPANIES"],"content":["Tether has frozen 46 million of USDT owned by crypto exchange FTX at the request of law enforcement.","On-chain&nbsp;data&nbsp;shows Tether has frozen a <a href=\"https:\/\/tronscan.org\/#\/transaction\/ab9ad4b118ab3de9fd7b0117ebd167c9950418905436bb7fc30f49adb4f59ce7\/event-logs\" data-v-f87c67ca=\"\">wallet address<\/a> with 46,360,701 USDT ($46.3 million) on the Tron network. This address reportedly belongs to FTX.","\"We are starting to receive requests from LE to temporarily freeze assets while investigation occur,\" a Tether executive told CoinDesk.","This comes days after FTX stopped withdrawals, citing liquidity issues. FTX CEO Sam Bankman-Fried said today, however, that the exchange has more assets than client deposits.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Fried","content":"ORGANIZATION"},{"type":"$46.3 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FTX","TETHER"],"authors":["Tim Copeland","The Block"]}