{"summary":"Liat Shetret told legislators at a Wednesday congressional hearing that the solution to crypto-enabled crimes is not to ban the use of cryptocurrencies but to disseminate available tools to the right hands \nAccording to Liat, regulatory discrepancies across jurisdictions, the transition from bitcoin to privacy coins, and the cross-over between crypto and the traditional financial sectors constitute the biggest challenges for regulators today.","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/53163\/elliptics-liat-shetret-congress-risks-losing-the-tech-war-to-china-if-it-bans-privacy-coins","publishDate":"2020-01-16T10:39:35","id":3065,"type":null,"title":"Elliptic&#x27;s Liat Shetret: Congress risks losing the tech war to China if it imposes stringent regulations on crypto","category":["Regulation"],"content":["The U.S. risks losing its innovative edge if regulators create too much resistance to emerging blockchain applications like privacy coins, crypto compliance analyst Liat Shetret told Congress during a Wednesday hearing.","On Jan. 15, the House of Representatives’&nbsp;Tom Lantos Human Rights Commission hosted a <a href=\"https:\/\/humanrightscommission.house.gov\/events\/hearings\/trafficking-victims-protection-act-20-look-back-and-look-ahead\" data-v-f87c67ca=\"\">Congressional hearing<\/a> that revisited the 2000 “Trafficking Victims Protection Act,” and called on Shetret, senior advisor at crypto compliance tools provider Elliptic, to discuss blockchain’s impact on anti-human trafficking efforts.","During the hearing, committee co-chair Christopher Smith (R-NJ) asked Shetert why the U.S. should not simply ban the use of privacy coins – a classification of cryptocurrencies for which transactions are untraceable and especially difficult to regulate.","“When we look at what organized crimes and gangs are doing, we try to be one step ahead of them. We seem to be five steps behind when it comes to cryptocurrencies,” he said. “If [privacy coins] facilitate organized crimes, why not just outlaw it?”","Indeed, in Shetret’s statement, she acknowledged the growing risks associated with privacy coins, which she said are being added as payment options at most dark marketplaces.","However, although she recommended Congress to issue additional guidance specific to privacy coins, the cost of outlawing them are simply too high.","She responded to Smith’s question by stressing the high stakes involved when it comes to international competition in the crypto field, in which China is playing a leading role.","“China is very much in an advanced stage of developing its own digital currency,” Shetret remarked. “The more legislations we add to our own U.S. structure here, we might in fact be coming up with an unintended consequence of inhibiting our own innovation here in the United States and potentially shooting ourselves in the foot when it comes to developing globally against competitors who are moving forward quickly.”","For Shetret, the issue, at heart, is not whether to ban privacy coins but how to disseminate available tools to the right hands.","“The software is out there. Elliptic and others are offering them,” she said. “But do financial institutions, law enforcement agencies federally and at the state level have them? At the moment, the answer is broadly mixed.”","She cited successful attempts on the U.S.’s part to deter the criminal use of cryptocurrencies by simply applying existing regulations and tools.","“Bitcoin wallets owned by Chinese nationals have been sanctioned for trafficking to the U.S.,” she said. “So there are good examples in which we have the ability to intercept and interdict utilizing our existing regulatory framework.”","In recent years, cryptocurrencies have been associated with criminal networks, including those tied to human traffickers, due to its anonymous nature.","In a newly released report, blockchain analysis firm Chainalysis claims to have detected $2.8 billion worth of bitcoin sent to crypto exchanges by criminals&nbsp;in year 2019. Two popular exchanges, Huobi and Binance, alone account for over 50% of the number of transactions received.","David Murray from Financial Integrity Network, for example, told Congress in <a href=\"https:\/\/www.banking.senate.gov\/imo\/media\/doc\/Murray%20Testimony%209-3-2019.pdf\" data-v-f87c67ca=\"\">written testimony<\/a> dated Sep. 2019 that there needs to be more regulation to prevent cryptocurrencies from facilitating trafficking networks.","But Shetret sought to push back on this narrative this week. In her statement to Congress, she highlighted the low percentage of bitcoin actually exploited by cybercriminals.","“Our analysis shows that in 2019, less than 0.5% of all bitcoin transactions were associated with the purchase of illicit goods or services on the dark web,” she said. “And we expect this to continue to fall.”","Shetret told The Block that she does not think Congress should draw up specific regulations for crypto since these additional measures would hinder innovation in the field.","Rather, she would recommend regulators to make use of existing regulations for finance and digital cash and apply them to the crypto space.","“A lot of regulatory responses that we're seeing now focus on dividing definitions across different agencies,” she said during an interview. “And anything that's kind of hooked and a particular definition is just not going to keep the flexibility that's needed in such a new changing field.”","In fact, Shetret believes that the U.S. regulators are quite advanced when it comes to understanding crypto-related risks.","The challenge, she said, is to get every jurisdiction on the same page.","In June 2019, the Financial Action Task Force put forward detailed <a href=\"https:\/\/www.google.com\/search?q=Financial+Action+Task+Force+guidance+virtual+assets&amp;oq=Financial+Action+Task+Force+guidance+virtual+assets&amp;aqs=chrome..69i57.5134j0j7&amp;sourceid=chrome&amp;ie=UTF-8\" data-v-f87c67ca=\"\">guidance<\/a> on the regulatory goals regarding digital assets. While a few sophisticated economies like Japan, Singapore, and Australia have gone a long way to promote the framework, Shetret told The Block, there are many jurisdictions with high cryptocurrency activities that are very far behind on this.","Regulators in South Africa, Nigeria, Kenya, Bermuda, to name a few, need to move faster to catch up to the international standard, she said.","“Cryptocurrency does not respect borders,” she said in her statement. “It is very easy for criminals to cash-out or launder funds by sending them to an exchange overseas that does not perform anti-money laundering checks.”","“Congress should ensure that attention is drawn to jurisdictions that fail to implement the FATF guidance on the regulation of cryptocurrency service providers,” she added."],"hashtag":["ANTI-MONEY LAUNDERING","CONGRESS"]}