{"summary":"Solana wallet Phantom is going cross-chain in a hope to unify three crypto ecosystems and take on market leader MetaMask.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/190241\/crypto-wallet-phantom-is-expanding-to-ethereum-and-polygon","publishDate":"2022-11-29T09:38:54","id":3066,"type":null,"title":"Crypto wallet Phantom is expanding to Ethereum and Polygon","category":["CRYPTO ECOSYSTEMS"],"content":["Crypto wallet Phantom is expanding to the Ethereum and Polygon blockchains — posing a potential threat to the current market leader, MetaMask. The crypto wallet is set to go live in beta within a few weeks, with a public launch to come shortly afterward.","Phantom is the most popular wallet on the Solana blockchain. Created by a bunch of Ethereum developers — who built the 0x decentralized exchange — it <a href=\"https:\/\/www.theblockcrypto.com\/news+\/118611\/a-close-look-at-phantom-solanas-take-on-metamask\" data-v-f87c67ca=\"\">became dominant<\/a> due to its friendly user experience and ability to show NFTs, now counting more than 3 million active users. Its widespread success on Solana is what makes it one of the most potent threats to MetaMask’s grip on the market.","“We definitely want to become the most dominant wallet,” said Phantom CEO Brandon Millman in an interview. “I think we really do have what it takes in terms of just being able to taste that amount of scale and understand what it needs and what is required to run a wallet from an operational perspective.”","Phantom’s path to Ethereum has been a long-time coming. The founding team originally wanted to build a better version of MetaMask but thought — rather than compete directly straight away, a better go-to-market strategy would be to start with a nascent ecosystem first. Now it’s taking on MetaMask, not from scratch but with roughly a tenth of its user base.","“I think overall the market's definitely ready for a different wallet. It's sort of been in the cards for a while. No shade on MetaMask at all but it’s a very different product, it’s very developer-oriented,” said Millman. “I feel like we really need to make a kind of paradigm shift to more consumer friendly applications.”","One key way Phantom will be different is that it will show its users’ tokens — across all blockchains it supports —&nbsp;in one view. This contrasts to MetaMask, which forces the user to switch between blockchains to see their different tokens. Phantom’s approach is similar to Zerion, which is also <a href=\"https:\/\/www.theblock.co\/post\/183304\/zerion-prepares-to-take-on-metamask-with-in-browser-wallet\" data-v-f87c67ca=\"\">launching<\/a> a multi-chain web extension.&nbsp;","Like MetaMask, Phantom also lets users make token swaps within the web extension. This is the only source of revenue for its 53-person team, according to Millman, who said it brings in around a 7-8 figure sum per year, depending on the state of the market.&nbsp;","With Phantom offering token swaps and supporting multiple blockchains, the wallet could theoretically enable cross-chain swaps in the future. This is not in the immediate roadmap, Millman said, but the team is keeping a close eye on it.&nbsp;","Phantom is planning to offer more crypto tools within the web extension, which will let it generate new sources of revenue. The wallet already offers swaps and staking, but may add NFT auctions and other features, Millman said. “We're going to start experimenting more with monetization in those areas.”","As Phantom expands across different blockchains, a big question is whether it will try to cover as many chains as possible or take a slower approach. Millman said the team is evaluating this every day but reckoned that there would be some kind of a consolidation toward just a few key ecosystems, which it might choose to focus on. “But we definitely don't want to end up in a world where we're a jack of all trades, master of none.”","As for the possibility of Phantom offering a token, this seems to have largely died down. Last year, Millman said offering a token was on the table, but there were no concrete plans. Now he seems a lot more skeptical. “We have no immediate plans to do a token,” he said.","Offering a token is very risky, Millman claimed. First, he highlighted that there’s a lot of regulatory uncertainty surrounding token offerings, particularly in relation to airdrops. Second, he said a badly timed token launch could single-handedly kill a company. If the token goes up after launch, you could generate a loyal community, but if it does go down — for any reason —&nbsp;then you could end up creating a “legion of undying haters.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Millman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Brandon Millman","content":"PERSON"},{"type":"Zerion","content":"LOCATION"},{"type":"Solana","content":"PERSON"}],"hashtag":["WALLETS"],"authors":["Tim Copeland","The Block"]}