{"summary":"Short-seller Boatman Capital first targeted Argo Blockchain over the purchase of land for a crypto mining facility in Texas.\nIts second report on the company, published this morning, focuses on shareholder dilution.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/126444\/argo-blockchain-short-selling-attack","publishDate":"2021-12-06T12:33:07","id":3066,"type":null,"title":"Short-seller homes in on shareholder dilution in new Argo attack","category":["Public Companies"],"content":["Short-seller Boatman Capital has published a new report on what it describes as ‘serious governance failures’ at London-listed crypto miner Argo Blockchain.","The <a href=\"https:\/\/theboatmancapital.com\/wp-content\/uploads\/2021\/12\/Argo-Blockchain-061221_.pdf\" data-v-f87c67ca=\"\">report<\/a>, which comes several months after Boatman’s initial attack on Argo, focuses on the extent to which shareholders have been diluted by the company’s capital raising.","“Argo has diluted shareholders by 52% so far this year with further dilution likely given potential capex [capital expenditure] requirements of $1.5-2 billion for the Texas project,” stated Boatman in the report, adding that Argo has also raised money by issuing bonds at “eye-watering interest rates.”","Argo’s current market capitalization stands at around £500 million (roughly $660 million). It was worth more than double that in February of this year after a sudden spike in its share price.","Boatman bases its dilution claims on publicly available information that suggests that the number of Argo shares in circulation has risen from 307,905,000 at the start of the year to&nbsp;468,082,335 today.","Boatman’s <a href=\"https:\/\/www.telegraph.co.uk\/business\/2021\/08\/10\/london-bitcoin-miner-hit-attack-short-seller-boatman-capital\/\" data-v-f87c67ca=\"\">first report<\/a> on Argo focused on the company’s $17.5 million purchase of a plot of land in Texas. Boatman concluded that Argo had paid more than 100 times the value of the land, but Argo’s CEO Peter Wall defended the move, calling it “a very solid deal” and a “project acquisition.”","The $1.5-2 billion in potential build-out costs for the Texas facility came to light in November when Argo was <a href=\"https:\/\/www.theblockcrypto.com\/post\/123386\/argo-filing-reveals-texas-mining-facility-could-cost-up-to-2-billion-to-build\" data-v-f87c67ca=\"\">forced to disclose inside information<\/a> that had mistakenly been published on Twitter by a fund manager who met with Argo executives.","A spokesperson for Argo Blockchain declined to comment on the latest Boatman report but pointed to <a href=\"https:\/\/www.youtube.com\/c\/ArgoBlockchain\/videos?app=desktop\" data-v-f87c67ca=\"\">videos posted on YouTube last week<\/a>&nbsp;in which Wall fielded questions about the business.","Wall said he doesn't believe that there will be delays with the Texas facility, which is scheduled to be up and running in March, and confirmed that construction costs would likely top $1 billion in total. With Argo now listed on Nasdaq, Wall said the focus is entirely on execution and mining as much bitcoin as possible.","Argo has been busy since Boatman’s first report was published in August. In September, the company <a href=\"https:\/\/investegate.co.uk\/argo-blockchain-plc\/rns\/closing-of-offering\/202109271800531288N\/\" data-v-f87c67ca=\"\">raised roughly $128 million<\/a> (before deducting underwriting costs) through an American Depositary Shares offering on the Nasdaq Global Select Market in the United States. Argo’s shares have traded on the main market of the London Stock Exchange since 2018.","The firm has also taken on debt. In September, Argo expanded a bitcoin-backed loan facility provided by Galaxy Digital <a href=\"https:\/\/investegate.co.uk\/argo-blockchain-plc\/rns\/bitcoin-backed-loan-agreement\/202109100700053378L\/\" data-v-f87c67ca=\"\">from $25 million to $45 million<\/a>. A few months later, the company announced that it <a href=\"https:\/\/investegate.co.uk\/argo-blockchain-plc\/rns\/closing-of-8.75--senior-notes-due-2026-offering\/202111180700047565S\/\" data-v-f87c67ca=\"\">had secured another $40 million<\/a> through the issuance of bonds with an 8.75% coupon. In its latest report, Boatman states that the 8.75% interest rate places the bond “firmly in ‘junk’ territory” and points out that the proceeds fell short of <a href=\"https:\/\/www.theblockcrypto.com\/linked\/123613\/argo-blockchain-hopes-to-raise-57-5-million-for-texas-mining-facility-via-public-offering\" data-v-f87c67ca=\"\">the $57.5 million target<\/a>.","“The bond market has given its verdict on Argo Blockchain and it does not look good: even with a high interest rate as enticement, Argo could only raise two-thirds of its target amount,” the report states.","The latest Boatman report also drew attention to equity investments that Argo has made in other crypto businesses — such as <a href=\"https:\/\/www.theblockcrypto.com\/post\/102168\/crypto-investment-pluto-digital-assets-listing-aquis\" data-v-f87c67ca=\"\">Pluto<\/a> and GPUone — and to the short terms served by several of the company’s board members. Colleen Sullivan, former CEO of crypto trading firm CMT Digital, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/123512\/colleen-sullivan-quits-argo\" data-v-f87c67ca=\"\">resigned<\/a> after three months as a non-executive director at Argo, after taking a job at Brevan Howard that precluded her from holding board positions elsewhere.","“Given the litany of problems outlined above, we believe it is essential for Argo to bring in a strong chairman and directors who will stick around for more than a few months,” the report concluded.","In the Q&amp;A videos posted last week, Wall said Argo is&nbsp;“in the process of looking for a new chairman” but would not put a timeframe on the search."],"hashtag":[]}