{"summary":"The Chamber of Digital Commerce is adding former Acting White House Chief of Staff Mick Mulvaney to its board.\nThe Chamber is also adding Visa, Goldman Sachs and SDX Digital Exchange to its Executive Committee.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/78550\/blockchain-trade-association-adds-former-white-house-acting-chief-of-staff-visa-and-goldman-to-its-ranks","publishDate":"2020-09-23T06:00:06","id":3067,"type":null,"title":"Blockchain trade association adds former White House acting chief of staff, Visa and Goldman to its ranks","category":["Regulation"],"content":["A former White House senior staffer is joining the board of blockchain trade association Chamber of Digital Commerce, and traditional finance giants have been added to its members list as well.","Former Acting White House Chief of Staff Mick Mulvaney will join the Chamber of Digital Commerce as of today, while Visa and Goldman Sachs become Executive Committee members.","The Chamber represents the digital asset and blockchain industry, working to educate policymakers and advocating for policy clarity in the U.S. Mulvaney joins other leaders like former chair of the Commodity Futures Trading Commission Chris Giancarlo and former J.P. Morgan head of global commodities Blythe Masters.&nbsp;","This is not Mulvaney's first step into the world of blockchain policy. He co-founded the Congressional Blockchain Caucus when he represented the state of South Carolina. The Blockchain Caucus has since been active with Reps. Darren Soto, Tom Emmer, David Schweikert and Bill Foster serving as co-chairs.&nbsp;","After his time in Congress, Mulvaney held offices including&nbsp; director of the U.S. Office of Management and Budget, Acting Director of the Consumer Financial Protection Bureau and, ultimately, Acting White House Chief of Staff. During his time in office he became <a href=\"https:\/\/www.nytimes.com\/2019\/11\/24\/us\/politics\/mulvaney-ukraine-aid.html\" data-v-f87c67ca=\"\">implicated<\/a> in the Ukraine scandal by blocking aid to Ukraine at the request of President Donald Trump.&nbsp;","Trump <a href=\"https:\/\/www.npr.org\/2020\/03\/06\/766025774\/mick-mulvaney-out-as-white-house-chief-of-staff\" data-v-f87c67ca=\"\">dismissed<\/a> Mulvaney in March of this year, moving him to a post as envoy to Northern Ireland.&nbsp;","In addition to Mulvaney's board seat, the Chamber is also adding Goldman Sachs, Six Digital Exchange (SDX) and Visa to its Executive Committee. Visa has been looking further into the digital asset realm, recently <a href=\"https:\/\/www.theblockcrypto.com\/post\/65314\/visa-is-seeking-a-patent-for-digital-fiat-currency-and-the-filing-points-to-a-central-bank-use-case\" data-v-f87c67ca=\"\">filing a patent application<\/a> for a \"digital fiat currency.\" The payments giant has already dipped its toe into crypto by a<a href=\"https:\/\/www.theblockcrypto.com\/post\/58935\/coinbases-visa-debit-card-can-now-be-linked-with-google-pay-to-spend-crypto\" data-v-f87c67ca=\"\"> debit card partnership<\/a> with Coinbase and the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/52914\/visa-to-acquire-crypto-serving-fintech-unicorn-plaid-for-5-3b\" data-v-f87c67ca=\"\">acquisition<\/a> of crypto-serving unicorn Plaid.&nbsp;","Goldman is also looking to get deeper into crypto, eyeing the possibility of a token project with its <a href=\"https:\/\/www.theblockcrypto.com\/linked\/74184\/goldman-digital-assets-token\" data-v-f87c67ca=\"\">appointment<\/a> of a new global head of digital assets.&nbsp;"],"hashtag":["GOLDMAN SACHS"]}