{"summary":"BlockFi said that it expected to finish work and necessary testing to allow for some customers to start getting their money back this summer.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234316\/blockfi-says-customer-withdrawals-could-start-this-summer","publishDate":"2023-06-12T17:58:29","id":3067,"type":null,"title":"BlockFi says customer withdrawals could start this summer","category":["COMPANIES"],"content":["Crypto lending firm BlockFi, which was forced to <a href=\"https:\/\/www.theblock.co\/post\/185753\/blockfi-suspends-withdrawals-after-ftx-collapse\" data-v-f87c67ca=\"\">suspend<\/a> withdrawals last year in the wake of the collapse of the FTX exchange, said that it expected to finish work and necessary testing to allow for some customers to start getting their money back this summer.","\"At that time, we will be in a position to begin allowing clients to withdraw digital assets held in BlockFi Wallet accounts that are not subject to potential preference claims,\" the company said in an email to clients on Monday.","BlockFi said that any withdrawals must be done in batches, and that those who are eligible will receive an email from the firm. In the mean time, the company recommends users set up third-party wallets to withdraw funds.","BlockFi has been struggling to allow customer returns ever since it <a href=\"https:\/\/www.theblock.co\/post\/186515\/after-pausing-withdrawals-blockfi-customers-are-confused-and-angry\" data-v-f87c67ca=\"\">paused<\/a> customer withdrawals on Nov. 13 and subsequently filed for Chapter 11 <a href=\"https:\/\/www.theblock.co\/post\/188915\/crypto-firm-blockfi-files-for-bankruptcy\" data-v-f87c67ca=\"\">bankruptcy<\/a> protection two weeks later.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Monday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"summer","content":"DATE"},{"type":"Nov. 13","content":"DATE"},{"type":"two weeks later","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}