{"summary":"Clusters will be designed to support human readable domain names across multiple blockchains, while relying on LayerZero&#x27;s technology.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275507\/delegate-layerzero-to-launch-naming-protocol-clusters-on-ethereum-solana-and-other-chains","publishDate":"2024-02-01T05:50:34","id":3068,"type":null,"title":"Delegate, LayerZero to launch naming protocol &#x27;Clusters&#x27; on Ethereum, Solana and other chains","category":["CRYPTO ECOSYSTEMS"],"content":["Ethereum infrastructure project Delegate is launching today a blockchain-based naming protocol called Clusters in collaboration with interoperability platform LayerZero.","Domain name services map complex blockchain addresses to human-readable names. The Ethereum Name Service is the most well known example. While ENS does allow for the registry of addresses from other blockchains — using an integration with oracle provider Chainlink — the data remains stored on Ethereum as a single point of truth.","Delegate's alternative wants to bring this kind of registry natively to multiple blockchains, including Ethereum, Solana, other EVM-based chains and later Bitcoin, according to a <a href=\"https:\/\/twitter.com\/clustersxyz\/status\/1752778434030477692\" data-v-f87c67ca=\"\">post on X<\/a>.","\"Clusters is a cross-chain, multi-wallet naming protocol addressing issues like address fragmentation, wallet management complexity, and domain squatting,\" said LayerZero in a <a href=\"https:\/\/medium.com\/layerzero-official\/layerzero-v2-deep-dive-869f93e09850\" data-v-f87c67ca=\"\">Medium post<\/a>. \"It serves as a unified identity layer, enabling users to maintain a consistent identity across multiple chains — very similar to what ENS does, but for many chains, natively.\"","In the post, LayerZero claimed that this service will streamline user interaction with decentralized applications and protocols across multiple blockchains.","LayerZero will be the main technology behind the service. Its protocol is designed to allow messages to flow between blockchains, which can be used for sharing value (like tokens) or simply information. \"On the backend, LayerZero is used as the messaging layer to move actions and state changes across chains to help Clusters maintain accuracy across millions of names and billions of wallet addresses,\" the post said.","Formerly called Delegate Cash, Delegate already has experience managing blockchain addresses. Its main protocol is used for crypto wallet holders to <a href=\"https:\/\/www.theblock.co\/post\/207581\/delegate-cash-hits-400-million-milestone-as-lesser-known-project-finds-real-adoption\" data-v-f87c67ca=\"\">delegate rights or responsibilities<\/a> from their wallet to another wallet. For instance, a Bored Ape owner might delegate ownership of that NFT to an empty wallet they control and use the empty wallet to sign into the Bored Ape Discord server. If that wallet is compromised, their NFT remains safe.","According to its website, Delegate's technology is used to secure <a href=\"https:\/\/delegate.xyz\/\" data-v-f87c67ca=\"\">$993 million of assets<\/a> across 182,500 wallets. While the service only works for projects that integrate with Delegate, many top NFT projects have done so, including Yuga Labs — the owner of CryptoPunks and the Bored Ape Yacht Club — and Azuki and NFT marketplace OpenSea.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Ethereum Name Service","content":"ORGANIZATION"},{"type":"Bored Ape","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"oracle","content":"ORGANIZATION"},{"type":"$993 million","content":"MONEY"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Solana","content":"LOCATION"}],"hashtag":["CRYPTO","DECENTRALIZED INFRASTRUCTURE","INTEROPERABILITY","PROTOCOLS","SMART CONTRACTS"],"authors":["Tim Copeland","The Block"]}