{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley. They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/17065\/ruling-in-lawsuit-against-state-farm-bank-involving-cash-advance-fees-on-crypto-purchases","publishDate":"2019-03-24T11:29:21","id":3069,"type":null,"title":"Ruling in lawsuit against State Farm Bank involving cash advance fees on crypto purchases","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\". This week’s guest post by <a href=\"https:\/\/twitter.com\/FinTechAttorney\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Justin Steffen<\/a> is “JCS”","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]Eckhardt v. State Farm Bank, №18-cv-01180, C.D. Ill. 2019, 3\/13\/19 [JCS]<br data-v-f87c67ca=\"\">\n<\/strong><\/em>","History is full of epic adversaries: Tesla and Edison, Coke and Pepsi, Magic and Bird. But for the law, the battle is between black and white and gray. Legislators and regulators seek clarity — predictable laws and regulations that can be consistently and fairly applied. Similarly, deal attorneys often seek contractual certainty. Litigators, in contrast, live in the gray. They crave ambiguity. Uncertainty is the foundation on which billable hours are built or settlements cemented. The Central District of Illinois’s recent Eckhardt decision arises from this colorless, conceptual battle: black and white v. gray.","In Eckhardt, Plaintiff had a State Farm Bank Credit card. The cardholder agreement stated that Plaintiff could purchase goods and services with the card. The agreement also stated that certain transactions — “Quasi-cash transactions” — would not be treated as purchases. Instead, they would be deemed to be “Cash Advances,” which were subject to a higher interest rate and additional fees. The agreement defined “Quasi-cash transactions,” likening them to “wire transfer money orders, other money orders, travelers checks, or foreign currency or tax payment.” Virtual currency or cryptocurrency were not mentioned in the agreement.","On multiple occasions, Plaintiff purchased crypto using his State Farm Bank card. Prior to February 2018, State Farm treated the transactions as purchases of goods. On February 4, 2018, Plaintiff once again purchased crypto using his card. This time, however, State Farm treated the transaction as a cash advance. After Plaintiff unsuccessfully attempted to negotiate away his “surprise” charges, he filed suit, asserting, among other claims, that: (1) Defendant violated the Truth in Lending Act (TILA) by failing to provide advanced notice of its intent to classify crypto transactions as cash advances (Count I) and to provide clear and conspicuous disclosures (Count II); (2) Defendant breached the cardholder agreement by treating cryptocurrency transactions as quasi-cash transactions (Count III); and (3) Plaintiff was entitled to a declaration that the cardholder agreement did not permit State Farm to impose cash advance fees and interest for crypto transactions (Count VI). State Farm moved to dismiss all claims under Federal Rule 12(b)(6).","First, the Court addressed the TILA claims. TILA is designed to ensure consumers receive meaningful, advance disclosure of credit terms and to protect them against inaccurate and unfair credit card billing and other practices. Here, the Court held that State Farm’s shifting opinion as to the classification of crypto transactions was a change of interpretation, not a change of in the actual credit terms (like the applicable interest rate) and therefore advance notice was not required. The Court thus dismissed Count I. TILA, however, also requires that initial disclosures be clear and conspicuous. Defendant also moved to dismiss Count II, arguing that cryptocurrency is cash-like and that, as a result, the initial disclosures were clear. The Court declined to dismiss Count II, noting Defendant’s argument presented nothing more than a fact dispute (Plaintiff alleged ordinary consumers would not know how cryptocurrency transactions were classified). A fact dispute is not the basis for a motion to dismiss.","The Court next addressed Plaintiff’s breach of contract and declaratory judgment allegations. Mirroring its argument with respect to Count II, Defendant again argued the contract was clear and that cryptocurrency was cash-like. As with Count II, the Court declined to dismiss the Counts, holding that Plaintiff had adequately alleged that the cardholder agreement did not specify that crypto transactions were “Quasi-cash transactions” and were not cash-like. The Defendant’s motion to dismiss only highlighted the parties’ factual disagreement; it did not identify a missing element of Plaintiff’s claim.","Accordingly, the Court granted Defendant’s Motion in Part and Denied the Motion in part. Put simply, a number of Plaintiff’s claims survive, Plaintiff’s attorneys get to proceed to discovery, and they can now bill more hours (if they bill by the hour) and\/or try and negotiate a settlement. State Farm Bank will have to pay its attorneys to defend it during depositions, mediations, negotiations, and pre-trial proceedings. Facts will be adduced, arguments made, and, if necessary, winners chosen by a finder of fact. The Court has not determined whether cryptocurrency payments are the purchase of goods or quasi-cash transactions. Similarly, we do not yet know if State Farm’s breached its cardholder terms or violated TILA. All we know is that Plaintiff gets to continue his fight. Gray wins (for now, at least).","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part III of this week's analysis, Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Justin Steffen","content":"PERSON"},{"type":"the Court","content":"ORGANIZATION"},{"type":"February 4, 2018","content":"DATE"},{"type":"Pepsi","content":"ORGANIZATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"State Farm","content":"ORGANIZATION"},{"type":"Count II","content":"ORGANIZATION"},{"type":"State Farm Bank","content":"ORGANIZATION"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"},{"type":"Coke","content":"ORGANIZATION"},{"type":"Court","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"Eckhardt v. State Farm Bank","content":"ORGANIZATION"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"State Farm Bank Credit","content":"ORGANIZATION"},{"type":"Ill. 2019","content":"DATE"},{"type":"Central District of Illinois","content":"ORGANIZATION"},{"type":"February 2018","content":"DATE"},{"type":"Edison","content":"ORGANIZATION"},{"type":"Palley","content":"PERSON"},{"type":"C.D.","content":"LOCATION"},{"type":"Magic","content":"ORGANIZATION"},{"type":"Eckhardt","content":"PERSON"},{"type":"Eckhardt","content":"LOCATION"},{"type":"JCS","content":"ORGANIZATION"}],"hashtag":[],"authors":["Contributor Network","The Block"]}