{"summary":"Bitcoin hashrate has declined by nearly 50% in over a month, according to The Block Research.\nChina’s mining crackdown and bitcoin price drop are the two main reasons for the hashrate fall.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/109315\/bitcoin-hashrate-declines-50-percent-china-mining-crackdown","publishDate":"2021-06-23T07:45:35","id":3071,"type":null,"title":"Bitcoin hashrate drops by nearly 50% following China&#x27;s mining crackdown","category":["Bitcoin"],"content":["Bitcoin hashrate, or the total computational power to mine the cryptocurrency, has dropped by nearly 50% in over a month.","From about 168,000 petahashes per second (PH\/s) on May 15, the bitcoin hashrate has dropped to nearly 86,000 PH\/s as of June 23, according to real-time data compiled by The Block.","","","<span data-v-f87c67ca=\"\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Source: The Block Research, BTC.com<\/span>","The hashrate has dropped significantly after the government of China last month moved to shut down bitcoin mining activities in some regions, including <a href=\"https:\/\/www.theblockcrypto.com\/post\/107707\/xinjiang-bitcoin-miner-shut-crackdown-china\" data-v-f87c67ca=\"\">Xinjiang<\/a> and <a href=\"https:\/\/www.theblockcrypto.com\/post\/108916\/sichuan-orders-state-power-grid-to-cut-supply-for-26-bitcoin-mining-farms\" data-v-f87c67ca=\"\">Sichuan<\/a>. These two regions alone <a href=\"https:\/\/www.theblockcrypto.com\/post\/109301\/secondhand-bitcoin-miner-supply-spiking-bitmain\" data-v-f87c67ca=\"\">estimated to have<\/a> 50 exahashes per second (EH\/s) hashrate or about 30% of the total bitcoin hashrate.","China took drastic action as it aims to reduce its carbon footprint and related impact on the environment.","About 65% of the world's bitcoin mining took place in China as of April 2020, <a href=\"https:\/\/cbeci.org\/mining_map\" data-v-f87c67ca=\"\">according to<\/a> the Cambridge Bitcoin Electricity Consumption Index. Over the months, however, that dominance has been fading, <a href=\"https:\/\/www.theblockcrypto.com\/daily\/102612\/why-chinas-bitcoin-mining-dominance-is-fading\" data-v-f87c67ca=\"\">as The Block reported recently.<\/a> Market participants at the time said that China has less than 50% share of the bitcoin hashrate.","With the latest mining crackdown, that share has been further declining. The bitcoin price plunge in recent weeks is another major reason for the hashrate fall.","According to data compiled by The Block, most Chinese bitcoin mining pools have seen their hashrate fall by over 50% in the past month. AntPool and F2Pool, for instance, have seen their hashrate drop by 58% and 56%, respectively, over the past month.","","","Foundry USA, on the other hand, has seen its hashrate increase by about 15% during the same period. Foundry USA is Digital Currency Group's (DCG's) mining subsidiary that <a href=\"https:\/\/www.theblockcrypto.com\/linked\/97984\/dcg-foundry-bitcoin-btc-mining-pool\" data-v-f87c67ca=\"\">publicly opened<\/a> its pool in March of this year.","DCG founder and CEO Barry Silbert last week <a href=\"https:\/\/twitter.com\/BarrySilbert\/status\/1406256948320866304\" data-v-f87c67ca=\"\">tweeted<\/a> that the Foundry pool was launched at the \"perfect time\" and suggested that it could soon become a top-five bitcoin mining pool worldwide. Foundry is <a href=\"https:\/\/btc.com\/\" data-v-f87c67ca=\"\">currently ranked<\/a> seventh.","Besides the U.S., Kazakhstan, Russia, and Georgia appear to be attractive bitcoin mining destinations for Chinese miners. Earlier this week, China-based BIT Mining, formerly known as 500.com, <a href=\"https:\/\/www.theblockcrypto.com\/post\/109190\/bit-mining-bitcoin-miners-kazakhstan\" data-v-f87c67ca=\"\">already shipped<\/a> some of its bitcoin mining equipment to Kazakhstan. The company is set to send more machines to the country next month."],"hashtag":["BITCOIN"]}