{"summary":"Ethereum core developers are planning a new testnet called Holli in response to ongoing difficulties in acquiring testnet ETH.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/214974\/ethereum-core-developers-plan-new-testnet-called-holli","publishDate":"2023-02-24T08:20:00","id":3071,"type":null,"title":"Ethereum core developers plan new testnet called Holli","category":["CRYPTO ECOSYSTEMS"],"content":["The Ethereum core developers are planning a new testnet called Holli in response to difficulties in acquiring ETH on the blockchain's primary test networks, Tim Beiko of the Ethereum Foundation <a href=\"https:\/\/twitter.com\/TimBeiko\/status\/1628823216574844928\" data-v-f87c67ca=\"\">said<\/a>.","The release of Holli, expected later this year, may improve the testing environment for client and application developers as well as node operators. It aims to address challenges associated with acquiring ETH supply on Ethereum test networks, particularly on Goerli.","Test networks (or testnets) are clone blockchains for experimental purposes, allowing developers to deploy applications and check for bugs before deploying them on the mainnet. Currently, Ethereum's ecosystem features two primary testnets: Goerli and Sepolia.&nbsp;","Goerli is a critical network, serving as the first native multi-client testnet widely used by validators. Still, Goerli's distribution method for native ETH (GoETH) has been deemed \"less reliable,\" Beiko said. The distribution of GoETH is primarily in the hands of a few validator entities. They distribute a small amount of GoETH via \"faucets\" to users who pass a Twitter verification check, which has raised concerns over privacy and time consumption.&nbsp;","Recently, the developers of the interoperability protocol Layer Zero <a href=\"https:\/\/www.theblock.co\/post\/213868\/layerzero-sparks-controversy-by-making-it-possible-to-buy-testnet-ether\" data-v-f87c67ca=\"\">launched<\/a> a cross-chain liquidity pool that allows users to buy GoETH. While this market attempts to quell developer complaints about acquiring GoETH, many think it may jeopardize the free nature of the testnet.","Sepolia, the other testnet, attempted to address the supply issue with a design that let test validators freely mint Sepolia-ETH (SepETH). Still, Sepolia is not open to permissionless validators, meaning that its supply may be hoarded by a few entities. Hence, Beiko and other core developers have proposed introducing Holli as a new testnet to address supply issues and provide a better environment for developers and validators.","To make Holli-ETH more accessible to application developers, Beiko has suggested automatic allocations to all developers’ addresses that have ever deployed smart contracts on the testnets or the Ethereum mainnet.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tim Beiko","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Sepolia","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Sepolia","content":"PERSON"},{"type":"Holli","content":"PERSON"},{"type":"Holli","content":"LOCATION"},{"type":"Goerli","content":"ORGANIZATION"},{"type":"Beiko","content":"PERSON"},{"type":"Ethereum Foundation","content":"ORGANIZATION"}],"hashtag":["ETHEREUM"],"authors":["Vishal Chawla","The Block"]}