{"summary":"David Chaum, the inventor of Ecash, is launching a new digital currency\nThe famed cryptocurrency forerunner is disappointed in current blockchain development, believing it is trapped in the trilemma of blockchains where scalability, decentralization, and security cannot be achieved all at once\nThe new cryptocurrency, Praxxis, is built on Chaum’s Elixxir blockchain platform and will be mainly used for payments ","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/36791\/crypto-forefather-david-chaum-issues-new-digital-currency-intended-as-a-paradigm-shift-from-bitcoin","publishDate":"2019-08-20T12:57:32","id":3072,"type":null,"title":"Crypto forefather David Chaum issues new digital currency","category":["Layer 1s"],"content":["<span data-v-f87c67ca=\"\">Cryptocurrency pioneer David Chaum is reviving his original vision of digital cash.<\/span>","<span data-v-f87c67ca=\"\">The famed cryptographer is issuing a new digital currency, Praxxis, that has the security, speed, and scalability to grow into a replacement of physical cash, Chaum said in an interview with The Block.&nbsp;<\/span>","Previously in stealth mode, the aim of the new digital currency is to serve as a proper payments vehicle, fulfilling Chaum's view of Satoshi Nakamoto's original vision for bitcoin to be a \"<span data-v-f87c67ca=\"\">purely peer-to-peer version of electronic cash.\" The digital asset is built on the so-called Elixxir blockchain, launched early last year.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Bitcoin is not cash; It's a digital currency; It's a store of value. But it's missing key features of cash,\" said Elixxir president Jim Dolbear. \"What we are doing in supporting payments is much more like electronic cash in the same way that bitcoin is a store of value.\"<\/span>","<span data-v-f87c67ca=\"\">Chaum is known as the father of the first digital currency, Ecash. His 1982 dissertation is also hailed as the inspiration of Satoshi’s bitcoin white paper and the first known work that proposes a blockchain protocol. Chaum started a company in 1990 to implement Ecash. The company <a href=\"https:\/\/www.wired.com\/1998\/11\/digicash-outta-cash\/\" data-v-f87c67ca=\"\">went bankrupt in 1998<\/a>.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Although Ecash was short-lived, Chaum believes Praxxis will face a different fate. <\/span><span data-v-f87c67ca=\"\">According to Chaum, existing blockchain solutions are trapped in the so-called trilemma of blockchain where scalability, decentralization, and security cannot all be satisfied by a single protocol<\/span><span data-v-f87c67ca=\"\">. Chaum said he believes it's time for people to break free from this old paradigm because blockchains designed under this model \"don't actually work.\"&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“If you want to create a religious war, then any deviation from the current paradigm would be considered unholy,\" said Chaum. \"But for years people have been promising scale, sidechains, sharding, but it's still not doing it.\"&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The failure to address security, scalability, and speed at the same time has also been hindering cryptocurrencies from developing into a global transaction system, said Chaum. Praxxis, on the other hand, looks to break this deadlock and ensure user privacy by deploying the so-called \"denominated coin structure.\" The scheme breaks payments into smaller amounts and associates them with other payments, so only the user knows how much money he spends on each transaction.&nbsp;<\/span>","According to a Chaum, the Praxxis protocol is also quantum-resistant, meaning that the protocol can survive hacks generated by quantum computers. This means Praxxis could be bulletproof against regular cryptanalysis initiated by hackers and even government agencies. Chaum said the government standardized the encryption scheme that is widely adopted to secure digital information, including digital assets. However, this scheme is based on specific functions and could still be broken by the government. Instead, the Praxxis protocol <span data-v-f87c67ca=\"\">“uses cryptography based on random function… then it is automatically quantum-resistant to a certain extent, and it's also resistant to conventional cryptanalysis.\"<\/span>","<span data-v-f87c67ca=\"\">To be sure, hash functions, which are the mathematical backbone of blockchains, are very difficult to reverse even with quantum computers. Although the private key encryption commonly adopted for cryptocurrency wallet solutions is prone to quantum attacks, hence the theoretical need for a quantum-resistant digital currency. <\/span>However, the <a href=\"http:\/\/www.crypto-textbook.com\/\" data-v-f87c67ca=\"\">perpetual tension<\/a> between computing power and cryptography dictates that a quantum-resistant solution may still be susceptible to future attacks as quantum computers advance.&nbsp;&nbsp;","For now, the technical details behind Praxxis are sparse, but the white paper is said to be released later this year.&nbsp;","<span data-v-f87c67ca=\"\">Chaum has been critical of, if not disappointed in the current development of blockchains in recently years. He has <\/span><a href=\"https:\/\/www.theblockcrypto.com\/2019\/04\/23\/e-cash-inventor-david-chaum-on-making-a-comeback-pre-empting-bitcoin-and-keeping-satoshi-anonymous\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">lamented publicly<\/span><\/a><span data-v-f87c67ca=\"\"> existing cryptocurrencies' failure to realize his own vision of digital cash, and feels the need to be \"more active in this space earlier,\" Chaum <a href=\"https:\/\/www.theblockcrypto.com\/2019\/04\/23\/e-cash-inventor-david-chaum-on-making-a-comeback-pre-empting-bitcoin-and-keeping-satoshi-anonymous\/\" data-v-f87c67ca=\"\">told The Block.<\/a><br data-v-f87c67ca=\"\">\n<\/span>","Dolbear said the company is currently funded by private investors. It is unclear whether they are planning a token sale.","<span data-v-f87c67ca=\"\">“That seems to be the way people do things,” said Chaum, referring to the usual succession of a token sale following the issue of new digital currency.&nbsp;&nbsp;<\/span>"],"hashtag":[]}