{"summary":"Bitfinex CTO Paolo Ardoino said drivechains in Bitcoin could be a “game-changer” amid the reignited debate surrounding the BIP-300 proposal.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/258167\/drivechains-bitcoin-game-changer-bitfinex-cto","publishDate":"2023-10-18T10:30:18","id":3072,"type":null,"title":"Drivechains in Bitcoin could be a &#x27;game-changer,&#x27; but there&#x27;s a catch, Bitfinex CTO says","category":["PEOPLE"],"content":["Bitfinex CTO Paolo Ardoino told The Block in a recent interview that drivechains in Bitcoin could be a \"game-changer\" amid the recently reignited debate surrounding the <a href=\"https:\/\/github.com\/bitcoin\/bips\/blob\/master\/bip-0300.mediawiki\" data-v-f87c67ca=\"\">BIP-300<\/a> proposal, originally authored by Layer 2 Labs CEO Paul Sztorc in 2017.","\"Drivechains in Bitcoin could be a game-changer, since they aspire to faster block times, improved privacy and more complex smart contracts,\" Ardoino said. \"However, they require a change to Bitcoin which could threaten the stability of the mainnet.\"","Drivechains are native, merge-mined sidechain mechanisms for Bitcoin that require a contentious fork. They could enable users to securely lock their bitcoin using a decentralized two-way peg and mint coins with attributes similar to various altcoins. Drivechains could also offer miners extra fees, boosting Bitcoin's hashrate and security while introducing features such as DeFi, NFTs, security tokens and stablecoins anchored by Bitcoin.","Ardoino said he saw how drivechains strived for an optimal balance between harnessing the security of Bitcoin and exploring novel new features. But, as with other sidechain solutions, the safety of the asset when transferring to the sidechain was the main concern.","As implementing drivechains would require modifications to the Bitcoin protocol, it could also introduce vulnerabilities, Ardoino warned. However, drivechains set themselves apart by using Bitcoin's mining power to secure the sidechain, incentivized with techniques like merged mining and hashrate escrows, he added.","Despite the pros and cons, Bitcoin is also going through an ossification process — making it increasingly difficult to make changes to the Bitcoin core code, Ardoino said. \"Until there is consensus on what the best Bitcoin scaling solution is, I am certain that the debate will continue. Ultimately, the debates we are seeing are a good thing because they are driving innovation and growth of sidechain technology.\"","Ardoino added that it was hard to say where Bitcoin scaling would be over the coming years as technological innovation doesn't happen at a predictable rate. \"In just a few months, a technological advancement could take place that moves us forward ten years. We ultimately see Bitcoin as the primary solution to democratizing and transforming the global financial system, and Bitcoin adoption has only continued to grow, even during this supposed crypto winter.\"","Last week, stablecoin issuer Tether <a href=\"https:\/\/www.theblock.co\/post\/256298\/tether-paolo-ardoino-new-ceo\" data-v-f87c67ca=\"\">promoted<\/a> Ardoino to CEO. He remains in his position as Bitfinex CTO.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Paul Sztorc","content":"PERSON"},{"type":"2017","content":"DATE"},{"type":"Ardoino","content":"PERSON"},{"type":"Bitfinex CTO","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"CTO","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["BITCOIN"],"authors":["James Hunt","The Block"]}