{"summary":"Wild West-themed gunslinger game Grit will become the first web3 game hosted on the Epic Games Store, Gala Games announced on Monday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/150444\/epic-games-store-will-host-its-first-web3-game-this-year","publishDate":"2022-06-07T05:39:33","id":3073,"type":null,"title":"Epic Games Store will host its first web3 game this year","category":["GAMING AND METAVERSE"],"content":["Wild West-themed gunslinger game Grit will become the first web3 game hosted on the Epic Games Store, the game’s publisher Gala Games announced on Monday.","The company described Grit as a ride-or-die battle royale set in the Wild West. In it, players face off in showdowns and shootouts, and different modes allow for teaming up with other players and squads.","Developed by Team Grit, the game will become available to players later this year and marks another attempt by web3 gaming developers to go mainstream. According to a DappRadar <a href=\"https:\/\/dappradar.com\/blog\/dappradar-x-bga-games-report-q1-2022\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">report<\/a> in April, blockchain gaming activity grew 2,000% in Q1 over the previous year. But it still faces challenges when it comes to mass adoption.","Part of that comes from the reluctance of storefronts to host web3 games. While Epic's CEO Tim Sweeney has said he is open to web3 gaming, competitor Valve banned games that use blockchain technology on its distribution platform Steam last year.","<span class=\"xn-person\" data-v-f87c67ca=\"\">However, John Osvald<\/span>, president of games at Gala Games, hopes that its titles being available on Epic will bring legitimacy to web3 gaming.&nbsp;","\"Easy access to web3 games is a turning point for those players who have not yet seen how digital ownership can enrich the gaming experience,\" Osvald added.","The cost of playing has also been associated with turning would-be players off of web3 gaming, particularly when it comes to the costs associated with getting set up and purchasing unique avatars — and Grit may be no exception to this issue. Its NFT collection of 10,000 gunslinger avatars doubled in price from $600 on Monday to $1,200 on Tuesday, and on June 9 the public sale will kick off with a minimum price of $1,500 per NFT.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tim Sweeney","content":"PERSON"},{"type":"Team Grit","content":"ORGANIZATION"},{"type":"Osvald","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$600","content":"MONEY"},{"type":"June 9","content":"DATE"},{"type":"$1,200","content":"MONEY"},{"type":"$1,500","content":"MONEY"},{"type":"Gala Games","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"2,000%","content":"PERCENT"},{"type":"John Osvald","content":"PERSON"},{"type":"Wild West","content":"LOCATION"},{"type":"April","content":"DATE"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}