{"summary":"Ethereum staking rewards have shot up in recent weeks, on the back of more value coming from transaction fees.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/178703\/ethereum-staking-rewards-rise-with-leveraged-stakers-seeing-11-apr","publishDate":"2022-10-20T12:53:52","id":3076,"type":null,"title":"Ethereum staking rewards rise with leveraged stakers seeing 11% APR","category":["ETHEREUM"],"content":["Ethereum staking rewards have risen in the last few weeks, with validators receiving larger transaction fees as a result of increased network activity.","As an example, the seven-day moving average for annualized staking rewards on stETH, a liquid staking token backed by ether, has climbed to 5.5%, as <a href=\"https:\/\/twitter.com\/mhonkasalo\/status\/1583054336828940288\" data-v-f87c67ca=\"\">noted<\/a> by DeFi researcher Mika Honkasalo on Twitter. This is up from just 3.5% in September, according to data from <a href=\"https:\/\/lido.fi\/\" data-v-f87c67ca=\"\">Lido Finance<\/a>.&nbsp;","<span data-v-f87c67ca=\"\">The staking APR for stETH has shot up in recent weeks. Image: Lido Finance<\/span>","For those leveraging their staking rewards, through offerings such as icETH or ETHMAXI, APRs have shot up as high as 11%. This is where the tokens are used to borrow more tokens and all of them are staked, increasing the yield.&nbsp;","The main cause for the rising yield is increased network activity, specifically in ways that result in higher fees for network validators. In particular, maximal extractable value (MEV) activity — where bots front-run transactions on the blockchain — has picked up, Honkasalo told The Block.","Honkasalo also said there has been an increase in trading of altcoins on Uniswap in recent weeks. This has <a href=\"https:\/\/coinmarketcap.com\/exchanges\/uniswap-v2\/\" data-v-f87c67ca=\"\">been led<\/a> by a token called The Protocol, which was created as a joke following one of Ethereum co-founder Vitalik Buterin’s recent <a href=\"https:\/\/twitter.com\/vitalikbuterin\/status\/1580981360499757056\" data-v-f87c67ca=\"\">tweets<\/a>.","There has also been a lot of extra activity in the form of <a href=\"https:\/\/www.theblock.co\/post\/176923\/someone-abused-ftxs-withdrawal-fee-subsidy-to-mint-70000-of-xen\" data-v-f87c67ca=\"\">XEN<\/a> in recent weeks. XEN is a token that’s free to claim as long as claimants paid for the Ethereum transaction fees, which effectively spammed the blockchain for a couple of weeks.&nbsp;","This increased activity on Ethereum has seen the supply of ether decrease in recent weeks, as more tokens have been burned during the transaction fee process than were created as rewards for validators. EthHub co-founder Anthony Sassano <a href=\"https:\/\/twitter.com\/sassal0x\/status\/1583101551643459585\" data-v-f87c67ca=\"\">highlighted<\/a> on Twitter that the supply of ether has not grown over the last 30 days as the burning process has equaled out the issuance.&nbsp;","Were activity to increase even further, it could lead to higher APRs and cause the supply of ether to become deflationary.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"3.5%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"5.5%","content":"PERCENT"},{"type":"Anthony Sassano","content":"PERSON"},{"type":"11%","content":"PERCENT"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Lido Finance","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Honkasalo","content":"PERSON"},{"type":"last 30 days","content":"DATE"},{"type":"Mika Honkasalo","content":"PERSON"}],"hashtag":["ETHEREUM","STAKING"],"authors":["Tim Copeland","The Block"]}