{"summary":"Tendermint is gearing up to launch a beta version of its crypto app store, called Emeris, later this month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/110667\/tendermint-is-creating-a-crypto-app-store-that-goes-beyond-cosmos","publishDate":"2021-07-07T07:50:48","id":3079,"type":null,"title":"Tendermint is creating a crypto app store that goes beyond Cosmos","category":["LAYER 1S"],"content":["Blockchain company Tendermint is building a crypto app store called Emeris that will allow access to a range of decentralized applications (dapps), it announced today.&nbsp;","Emeris will provide a single place for users to interact with different applications, such as lending protocols and decentralized exchanges.&nbsp;","Tendermint plans to release a beta version of the project later this month and is targeting a public launch in September.","“Emeris is our most ambitious product to date. We will finally offer end users a one-stop portal to navigate the Internet of Blockchains. Our beta — launching this month — starts fulfilling this vision, with a focus on cross-chain DeFi,” said Tendermint CEO Peng Zhong.","Tendermint is a core contributor to the Cosmos network, a set of multiple interconnecting blockchains. It provides blockchain software as well as development kits, both used by blockchain projects in the Cosmos ecosystem.","The beta launch of Emeris will begin as a non-custodial dashboard — meaning that users maintain control over their own funds — for dapps in the Cosmos ecosystem. It will start with a core focus on decentralized finance (DeFi) protocols.","When the beta goes live, it will have support for the Gravity DEX protocol, a decentralized exchange for trading tokens across blockchains. It will start by supporting several Cosmos blockchains, such as Cosmos Hub, Crypto.com and Akash Network.","But the plan is for Emeris to go beyond the Cosmos ecosystem. The goal will be for it to support multiple other blockchains, beginning with Ethereum.","“Ultimately, Emeris will give access to the best crypto apps, no matter what blockchain they run on,” said Zhong.","It will also grow beyond the dashboard. Tendermint hopes to build a mobile application and a browser extension wallet to provide wider access.","Tendermint isn’t the only company planning to provide a unified access point to the crypto ecosystem. Crypto exchange Coinbase, which recently revealed that it <a href=\"https:\/\/www.theblockcrypto.com\/post\/109889\/coinbase-ceo-we-plan-to-list-every-crypto-asset-where-legally-viable\" data-v-f87c67ca=\"\">wants to add all cryptocurrencies<\/a> where legally viable to its exchange, also plans to build a crypto app store.","Coinbase CEO Brian Armstrong wrote in a blog post that the exchange wants to build “the” crypto app store, citing Apple’s success in doing so for centralized apps.&nbsp;","“There is now 10s of billions of dollars of economic activity running on [dapps], and a new trend coming out every three months. We’ll work to give our users easy access to all of this from the main Coinbase product,” he said.","Coinbase already offers access to dapps through Coinbase Wallet, its non-custodial wallet app. This has an in-app web browser that shows a range of dapps on a Coinbase website. Users who click on these dapps are taken to the respective websites to access them directly.","The difference between that and a crypto app store is that the dapps would be natively built within the store, providing for a much more seamless experience.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Peng Zhong","content":"PERSON"},{"type":"Akash Network","content":"ORGANIZATION"},{"type":"Zhong","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Emeris","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"10s of billions of dollars","content":"MONEY"},{"type":"Cosmos","content":"LOCATION"},{"type":"Cosmos Hub","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Ethereum","content":"PERSON"},{"type":"Coinbase Wallet","content":"ORGANIZATION"}],"hashtag":["COSMOS"],"authors":["Tim Copeland","The Block"]}