{"summary":"The average cleared trade price for Coinbase’s stock on Nasdaq Private Market continues to move higher\nData from Nasdaq Private Market shows a secondary market this week for Coinbase equity saw an average clear price of $373 per share, which would value the firm at $100.3 billion","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/95469\/coinbase-stock-traded-at-implied-valuation-of-100-billion-this-week-nasdaq-private-market-data-shows","publishDate":"2021-02-19T14:21:31","id":3079,"type":null,"title":"Coinbase stock traded at an implied valuation of $100bn this week","category":["The Block"],"content":["Deep-pocketed investors appear hungry for Coinbase equity ahead of the crypto exchange's long-awaited <a href=\"https:\/\/www.theblockcrypto.com\/linked\/93007\/coinbase-crypto-exchange-direct-listing\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">direct listing<\/a>.&nbsp;","As per data compiled by The Block, the average clearing price for shares on Nasdaq Private Market continues to tick higher since the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/92251\/coinbase-offer-secondary-market-private-shares-nasdaq\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">first secondary sale<\/a> four weeks ago. The most recent cleared price was $373 a share, which would imply a valuation of about $100 billion.&nbsp;","That's an increase from the first average cleared price of $200 in January, according to data shared with The Block.&nbsp;","","","Nasdaq enables secondary offerings for Coinbase stock, a process that allows ex-employees and investors of the crypto exchange to sell their shares.","The secondaries start Monday morning and end Thursday afternoon each week. The auctioning and clearing process happens after the close and results are posted Friday morning. The identities of the bidders are not clear at this time, but a source said that they are likely large investment firms.&nbsp;","Sizable resting bids came in over the course of the most recent secondary offering. To be clear, buyers don't need to pre-fund their account and can bid at whatever price they want. Data from the top of the order book shows two large multi-million dollar bids at $350 and $450 a share.&nbsp;","","","It's not clear which of these bids were filled (typically about 100,000 shares match per secondary).&nbsp;"],"hashtag":["COINBASE"]}