{"summary":"The New York State district court has denied iFinex’s motion to dismiss the New York Attorney General (NYAG)’s lawsuit against the company\niFinex now needs to produce documents at the request of the NYAG, and the NYAG can continue its investigation","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/36744\/court-rules-it-has-jurisdiction-over-bitfinex-allowing-nyag-to-continue-investigation","publishDate":"2019-08-19T17:45:28","id":3080,"type":null,"title":"NYS court ruling: demands Bitfinex to produce documents to NYAG","category":["Legal"],"content":["The New York State Supreme Court has decided that it has jurisdiction to rule over the case between the New York Attorney General (NYAG) and iFinex, the parent company of cryptocurrency exchange Bitfinex. The decision now allows the NYAG to continue its investigation and demands the company to produce documents at the request of the law enforcement agency, <a href=\"https:\/\/iapps.courts.state.ny.us\/nyscef\/ViewDocument?docIndex=3VoKZl7wi8ozNi6K6wcxCA==\" data-v-f87c67ca=\"\">according to a filing<\/a>.&nbsp;","iFinex previously appealed to the court to <a href=\"https:\/\/www.theblockcrypto.com\/2019\/07\/29\/bitfinex-and-nyags-jurisdictional-battle-to-continue-as-judge-sets-another-date\/\" data-v-f87c67ca=\"\">halt the NYAG investigation<\/a> over its alleged commingling of funds to cover up an $850 million loss, among other issues. In response, the NYAG argued that it was too early for the court to address jurisdictional questions during an ongoing investigation.","The court now repeals such argument, ruling that it indeed can adjudicate the matter. It also denies iFinex's motion to thwart the NYAG's investigation and rules that the law enforcement agency can carry on its investigation.&nbsp;","With this latest decision, the court now partially upholds to its <a href=\"https:\/\/www.theblockcrypto.com\/2019\/05\/22\/bitfinex-and-tether-claim-a-victory-in-court-battle-with-nyag\/\" data-v-f87c67ca=\"\">May 22 order<\/a>, which limited the scope of the documents that iFinex must produce to the NYAG. Meanwhile, the stay imposed on the NYAG by the court to prevent it from demanding further documents from iFinex is also eliminated. This means that documents relevant to the investigation should now be submitted by iFinex to the NYAG. The company has until October 14 to turn over the documents to the NYAG, according to the filing.&nbsp;","\"This is an unsurprising development but certainly not a welcome one for Bitfinex,\" said Anderson Kill partner and The Block legal advisor Stephen Palley.","In response to the court’s ruling, iFinex and Tether later submitted a<a href=\"https:\/\/iapps.courts.state.ny.us\/nyscef\/ViewDocument?docIndex=fMaxtVkuhRQ2rNvH61tBEQ==\" data-v-f87c67ca=\"\"> notice<\/a>, appealing a reversal of the decision:<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“The trial court lacked personal jurisdiction because service was defective and because Petitioner failed to show that the Respondents engaged in purposeful activity toward New York. The trial court lacked subject matter jurisdiction because the cryptocurrency that is the focus of Petitioner’s investigation is neither a commodity or security, as required for jurisdiction under the Martin Act. The trial court incorrectly held that the Martin Act could be applied extraterritorially because the language of Gen. Bus. L. ยง 354 does not provide for extraterritorial reach.","Respondents seek a reversal of the Decision and Order on Motion in its entirety.”","<em data-v-f87c67ca=\"\">This story has been updated to include a notice of appeal from iFinex and Tether.<\/em>"],"hashtag":[]}