{"summary":"The committee members span the globe, and represent a mix of individuals and institutional crypto investors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195429\/committee-to-represent-creditors-formed-in-ftx-bankruptcy-case","publishDate":"2022-12-15T11:44:15","id":3081,"type":null,"title":"Committee to represent creditors formed in FTX bankruptcy case","category":["POLICY"],"content":["A committee to represent unsecured creditors and serve as the voice for most FTX customers in court was&nbsp;established in the U.S. bankruptcy case of FTX and its affiliated companies.","The formation of the committee, meant to represent anyone who had money in FTX or affiliated companies but was not given collateral for what FTX owes them, will allow the bankruptcy proceedings to move forward. Representatives for the U.S. Trustee, an office within the Justice Department that represents the U.S. government in bankruptcy proceedings and helps formalize such committees, said earlier this week that forming this one had been difficult due to the highly international nature of FTX’s customer base.","While U.S. government lawyers have pushed for more transparency in identifying large businesses that FTX owes money to, the collapsed exchange, under its new leadership, has argued to keep that information under seal on the grounds that its client list is a valuable company asset that could be sold to help recoup money. The formation of a creditor committee will allow the matter to move to a conclusion, as the judge presiding over the case had wanted to wait until the committee was formed and able to express its view before making a decision on the matter.","Friction also remains over the fate of the Bahamas arm of FTX's group of companies, FTX Digital Markets. Former FTX CEO Sam Bankman-Fried put that part of his corporate empire into a separate bankruptcy process, with a different group of lawyers charged with liquidating the company. Lawyers representing the rest of the corporate family, now headed by corporate bankruptcy and restructuring expert John Ray III, have claimed that movement of hundreds of millions of dollars-worth of assets out of accounts controlled by that subsidiary violated U.S. bankruptcy law.","Members of the unsecured creditor committee include:","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"earlier this week","content":"DATE"},{"type":"hundreds of millions of dollars","content":"MONEY"},{"type":"Alameda","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"John Ray III","content":"PERSON"},{"type":"Justice Department","content":"ORGANIZATION"},{"type":"Bahamas","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"FTX Digital Markets","content":"ORGANIZATION"}],"hashtag":["COURT HEARINGS","SAM BANKMAN-FRIED"],"authors":["Colin Wilhelm","The Block"]}