{"summary":"If the offer for sale is accepted, it would become the most expensive CryptoPunk sale ever — by a considerable margin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/113181\/rare-cryptopunk-million-dollar-listing-nft-mania","publishDate":"2021-08-01T12:36:17","id":3086,"type":null,"title":"A rare CryptoPunk is being listed for $90.5 million as NFT mania takes flight","category":["NFTS"],"content":["Somebody just put a rare CryptoPunk NFT for sale for $90.5 million that, if accepted, would become the biggest CryptoPunk sale ever.","The offer for sale was for CryptoPunk 3100, <a href=\"https:\/\/www.larvalabs.com\/cryptopunks\/details\/3100#\" data-v-f87c67ca=\"\">according to<\/a> Larva Labs (the creators of CryptoPunks). The Punk is an alien — one of nine — with a headband. The NFT was previously sold for $7.6 million.","One of the earliest NFT collections, CryptoPunks are a collection of 10,000 pixelated faces. They include humans, zombies apes and aliens. NFTs, or non-fungible tokens, are unique digital tokens that can represent images, audio or video content.","CryptoPunks fetch some of the highest NFT prices. In July, there were 1,395 sales totaling $135 million (paid in ether), according to NFT tracker <a href=\"https:\/\/www.cryptoslam.io\/\" data-v-f87c67ca=\"\">CryptoSlam<\/a>. The average sale was just shy of $100,000 — a much higher average than most NFT projects.","Indeed, the listing is perhaps indicative of the eye-popping prices some Punks and other NFTs have gone for to date. Zombie punks are on the rare side, with only two being listed for sale at this time and the most recent sale taking place four months ago.","Previous record sales include this CryptoPunk 3100 and another alien for $7.6 million each. Beyond that, an ape was sold for $5.4 million and another ape went for $3.7 million to entrepreneur Gary Vaynerchuk.","The three next biggest sales were for zombies, ranging from $1 to $2 million.","Just yesterday, an anonymous investor purchased 88 CryptoPunks in one go for $5.5 million. They're now one of the top 20 biggest CryptoPunk investors.","What's interesting is that they used MiningDAO, which works similarly to communication protocol Flashbots — <a href=\"https:\/\/www.theblockcrypto.com\/daily\/111790\/will-ethereum-miners-become-time-bandits-and-reorganize-the-blockchain\" data-v-f87c67ca=\"\">used for extracting MEV<\/a> — to buy the Punks. This service enabled them to communicate with a miner and have the transaction directly included in a block, without getting broadcast to the network first.","By doing this, they avoided sellers raising prices once they saw the sales coming in. The investor gave the miner a 5 ETH tip, worth around $12,000 at the time, for their help.","Since then, the investor has set up a <a href=\"https:\/\/twitter.com\/0x650d\" data-v-f87c67ca=\"\">Twitter account<\/a> and signed a transaction to prove themselves as the owner of the Ethereum address that purchased the Punks.","They simply tweeted: \"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Few.<\/span>\"","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Correction:<\/strong> This report has been updated to reflect that the $90.5 million represented an offer to sell, not an offer to purchase. Lede and context have been updated as well.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"3100","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$7.6 million","content":"MONEY"},{"type":"$2 million","content":"MONEY"},{"type":"$5.4 million","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"Punk","content":"ORGANIZATION"},{"type":"$1","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$100,000","content":"MONEY"},{"type":"$135 million","content":"MONEY"},{"type":"$90.5 million","content":"MONEY"},{"type":"$3.7 million","content":"MONEY"},{"type":"$5.5 million","content":"MONEY"},{"type":"Gary Vaynerchuk","content":"PERSON"},{"type":"$12,000","content":"MONEY"},{"type":"CryptoPunk NFT","content":"ORGANIZATION"}],"hashtag":["ETHEREUM"],"authors":["Tim Copeland","The Block"]}