{"summary":"The firm behind top-20 coin Dash has made a series of layoffs due to fiscal strains, the Block has learned.  Around 8 percent of the staff will leave the","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/14281\/corporation-behind-dash-lays-off-senior-staff-as-bear-market-grip-tightens","publishDate":"2019-03-04T17:38:41","id":3088,"type":null,"title":"Corporation behind Dash lays off senior staff as bear market grip tightens","category":["THE BLOCK"],"content":["The firm behind top-20 coin Dash has made a series of layoffs due to fiscal strains, the Block has learned.&nbsp;","Around 8 percent of the staff will leave the company on March 7, including&nbsp;their Head of Strategy and Head of Business.","\"Dash Core Group [DCG] was faced with some tough decisions to maintain financial stability in light of the current market,\" the company's CEO Ryan Taylor said <a href=\"https:\/\/www.dash.org\/forum\/threads\/planned-reduction.43620\/\" data-v-f87c67ca=\"\">in a blog post <\/a>at the end of last month. He also emphasised the lay-offs had been concentrated in specific business areas to limit “disruption.”","Aside from cutting top-level managers, Taylor said other staff had voluntarily forgone their entire salaries and employment benefits as an additional budget-control measure.","Having forked from Litecoin in 2014, the Dash company did not raise funds via an ICO. Instead, DCG gets funded by 10 percent of the reward mined by masternodes (miners), subject to approval from the Dash Network Treasury.&nbsp;Its development is therefore&nbsp;funded entirely in Dash,&nbsp;and while they can convert it into fiat, a large bulk of DCG's funds remains in the privacy coin -&nbsp;even paying staff wages in it. The coin's price drop this winter has hence had a notable impact, dropping to $66, having risen to a&nbsp;<a href=\"https:\/\/bitinfocharts.com\/comparison\/dash-price.html\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">peak of over $1,000<\/a>&nbsp;last year when it was the world’s fifth largest cryptocurrency by market cap.","&nbsp;[related id=\"1\"]&nbsp;","Management argue they have been conservative in their spending, introducing a hiring freeze more than six months ago; prior to the bear market.","<strong data-v-f87c67ca=\"\">Down but not out<\/strong>","The Dash coin is marketed as “digital cash” with particular use-cases for those involved in legal cannabis sales, international remittance payments and for businesses trading in volatile fiat currencies. Der Spiegel also <a href=\"http:\/\/www.spiegel.de\/wirtschaft\/soziales\/venezuela-nichts-zu-essen-aber-kostenlos-benzin-das-plant-juan-guaido-a-1251621.html\" data-v-f87c67ca=\"\">recently&nbsp;reported <\/a>that the coin was the \"most popular\" cryptocurrency in Venezuela, where locals can buy goods at 2,400 Dash merchants in “near-instant transactions.\"","One purchase channel is via Dash-loaded Kriptomobile phones. Sixty-six thousand units have already been shipped to the LATAM region and an order for 120,000 more is now pending. The phones are said to be part of an \"acquire and spend\" strategy, although <a href=\"https:\/\/blog.dash.org\/kriptomobile-dash-venezuela-use-case-7bb582528258\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">data shows the currency is largely being hodled in the mobile wallets<\/a>.","Despite the staff cut-backs, the firm behind Dash is said to remain confident about its survival, having previously noted a cash buffer of more than $1 million.","\"DCG is not at risk of shutting down anytime soon, or of any significant cuts in staffing levels in the near term,\" Taylor said in a <a href=\"https:\/\/blog.dash.org\/dash-core-group-is-sustainable-5e6e1e877ad3\" data-v-f87c67ca=\"\">December blog post. <\/a>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"Venezuela","content":"LOCATION"},{"type":"DCG","content":"ORGANIZATION"},{"type":"Head of Business","content":"ORGANIZATION"},{"type":"$66","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"8 percent","content":"PERCENT"},{"type":"Dash Core Group [DCG","content":"ORGANIZATION"},{"type":"$1,000","content":"MONEY"},{"type":"Ryan Taylor","content":"PERSON"},{"type":"20","content":"DATE"},{"type":"December","content":"DATE"},{"type":"Taylor","content":"PERSON"},{"type":"winter","content":"DATE"},{"type":"ICO","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"last month","content":"DATE"},{"type":"Kriptomobile phones","content":"ORGANIZATION"},{"type":"March 7","content":"DATE"},{"type":"Dash Network Treasury","content":"ORGANIZATION"},{"type":"10 percent","content":"PERCENT"},{"type":"Der Spiegel","content":"ORGANIZATION"}],"hashtag":[],"authors":["Isabel Woodford","The Block"]}