{"summary":"Bakkt announced its acquisition of loyalty program provider Bridge2 Solutions and the deal is expected to close later this quarter\nBridge2’s pilot project, Loyalty Pay, will offer merchants the option to integrate directly with the consumer app that Bakkt is developing ","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/55022\/bakkt-set-to-acquire-loyalty-program-provider-bridge2-solutions","publishDate":"2020-02-05T09:46:33","id":3089,"type":null,"title":"Bakkt set to acquire loyalty program provider Bridge2 Solutions","category":["Bitcoin"],"content":["Intercontinental Exchange is set to acquire loyalty program provider Bridge2 Solutions, the firm announced Wednesday.&nbsp;","Following the closure of the deal – terms undisclosed – the company will be acquired by Bakkt, the cryptocurrency venture by ICE, later this quarter, <span data-v-f87c67ca=\"\">according to a press statement<\/span>. Bakkt will use funds from its Series B funding round for the deal. <span data-v-f87c67ca=\"\">The deal follows Bakkt's acquisitions of Digital Asset Custody Company and Rosenthal Collins Group, a futures commission merchant.<\/span>","<span data-v-f87c67ca=\"\">Bakkt is well-known for its institutional-aimed products, such as its bitcoin options and futures products. It also has a <a href=\"https:\/\/www.theblockcrypto.com\/post\/53745\/bakkts-consumer-app-is-coming-in-2020-and-itll-look-more-like-paypal-than-coinbase\" data-v-f87c67ca=\"\">consumer-facing product<\/a> in the works that aims to serve as a digital wallet for an array of assets, including cryptocurrencies, rewards, and in game tokens.<\/span>","<span data-v-f87c67ca=\"\">The acquisition, which is set to close by the end of the quarter, will accelerate the build-out of Bakkt’s consumer application, the press statement said.&nbsp;<\/span>","<strong data-v-f87c67ca=\"\">Integrating Bridge2's Loyalty Pay with Bakkt's consumer app<\/strong>","Bridge2 <span data-v-f87c67ca=\"\">manages loyalty rewards platforms for merchants and financial institutions with a combined total of $60 billion worth of reward points, Fortune <a href=\"https:\/\/fortune.com\/2020\/02\/05\/bakkt-rewards-points-bitcoin-cash-wallet\/?utm_medium=social&amp;utm_source=twitter.com&amp;xid=soc_socialflow_twitter_FORTUNE&amp;utm_campaign=fortunemagazine\" data-v-f87c67ca=\"\">reported<\/a>. <\/span><span data-v-f87c67ca=\"\">Amid the acquisition, Bakkt plans to leverage Bridge2’s existing merchant relationships to build out its own consumer app. <\/span>","<span data-v-f87c67ca=\"\">With Bridge 2’s pilot project, Loyalty Pay, merchants can opt to link their payment process directly to the Bakkt app<\/span><span data-v-f87c67ca=\"\">. This way, they do not need to pay banks an interchange fee of around 2.5%. Rather, they can issue their own digital credit cards carrying their brand names, and the system will convert rewards into cash for their customers.<\/span>","<span data-v-f87c67ca=\"\">Bakkt will charge a small fee for handling the trading between reward points and cash, but the fee will be much lower than the interchange fee that merchants have to pay today, according to Fortune.<\/span>","<span data-v-f87c67ca=\"\">Right now, Loyalty Pay has attracted interest among a wide range of stores, Bridge 2 told Fortune, and the project is expected to launch in just a few months. However, as of now there isn’t a clear timeline for combining all rewards in a single wallet and converting them to cash. This process will simply take longer, Bridge 2 said.&nbsp;<\/span>","\"Combining Bridge2 Solutions’ embedded relationships with banks and merchants and their innovative Loyalty Pay solution will enable us to launch new products that further drive loyalty and empower consumers to trade, transfer and spend digital assets in entirely new ways,\" Bakkt chief executive officer Mike Blandina said in the press statement.&nbsp;","<em data-v-f87c67ca=\"\">Correction: This post incorrectly referred to Bridge2's Loyalty Pay solution as Loyal Pay.<\/em>"],"hashtag":[]}