{"summary":"Parity’s Shasper joins Prysmatic Labs’ Prysm on the Sapphire Testnet, making it the first public multi-client Ethereum 2.0 test network \nPrysmatic Labs, the client implementation team responsible for the Ethereum project, expects more clients to run on the testnet in the near future and is aiming for a Phase 0 mainnet launch in early 2020","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/49563\/ethereum-2-0-phase-0-reaches-final-stage-of-testing-as-developer-launches-public-multi-client-testnest","publishDate":"2019-12-06T14:53:33","id":3092,"type":null,"title":"Ethereum 2.0 Phase 0 reaches final stage of testing as developer launches public multi-client testnest","category":["Ethereum"],"content":["There has not been a&nbsp;public&nbsp;multi-client Eth2 testnet up until now, according to Prysmatic Labs CEO Preston van Loon, but the team is accelerating its efforts and users can expect a Phase 0 mainnet launch in early 2020.","Sapphire was launched in June as the third single-client Eth2 testnet, followed by the Nimbus and Lighthouse testnets released earlier this year. Prysmatic Labs, client implementation team responsible for the creation of the Sapphire testnet, first ran a private multi-client test network at an interoperability event in Canada in September where clients shared a fixed set of validators.","This time, Prysmatic Labs <a href=\"https:\/\/github.com\/paritytech\/shasper\/pull\/191\" data-v-f87c67ca=\"\">released<\/a> a full end-to-end public network where clients can participate in an environment identical that of the mainnet, van Loon told The Block. The purpose of the testnet, he said, is to run these clients in a chaotic environment that mimics how the final production environment works. It will help the team find edge cases and performance optimizations as well as solving issues that they have not imagined yet.","“[The interop event] was the first time multiple clients were able to work together to build the phase 0 chain,” said van Loon. “Now, with Prysmatic Labs' full end to end sapphire test network, we are seeing different client implementations sync for the first time. Like the interop event, this is a major&nbsp;milestone towards full multi-client interoperability.”","Currently, the majority of client nodes on the Sapphire public testnet are Prysm nodes. Shasper has connected with the network on Thursday. There are <a href=\"https:\/\/eth.wiki\/en\/eth2\/clients\" data-v-f87c67ca=\"\">six other clients<\/a> who can potentially join the network, including Ethereum Foundation’s Trinity, ChinSafe’s Lodestar, and Status’ Nimbus. Van Loon expects these clients will soon run on the testnet as Sapphire transforms into a full multi-client test network.","In the new year, van Loon said, Prysmatic Labs is looking to work closely with other client implementation <a href=\"h\" data-v-f87c67ca=\"\">teams<\/a> to increase the test network’s resilience. It has <a href=\"https:\/\/prysmaticlabs.com\/\" data-v-f87c67ca=\"\">received<\/a> over $1.5 million from donors including the Ethereum Foundation, Aragon, and Ethereum Community Fund. The Ethereum Foundation, especially, has been a major donor to a number of ETH2 client teams and has supported Prysmatic Labs throughout the process with grants, research insights, and community organization."],"hashtag":[]}