{"summary":"Certik tweeted that it is investigating the incident, and that its initial findings suggest a potential issue with private key management.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228302\/zksync-dex-merlin-hack","publishDate":"2023-04-26T01:14:38","id":3092,"type":null,"title":"zkSync DEX Merlin reportedly hacked for $1.82 million after code audit","category":["SECURITY"],"content":["Merlin, a decentralized exchange using zkSync, appears to have been&nbsp;<a href=\"https:\/\/explorer.zksync.io\/address\/0x2744d62a1e9ab975f4d77fe52e16206464ea79b7\" data-v-f87c67ca=\"\">hacked<\/a> for over $1.82 million immediately after <a href=\"https:\/\/skynet.certik.com\/projects\/merlin-dex\" data-v-f87c67ca=\"\">receiving<\/a> a code audit from smart-contract auditor Certik.","Certik <a href=\"https:\/\/twitter.com\/CertiK\/status\/1651088669187473408\" data-v-f87c67ca=\"\">tweeted<\/a> that it is investigating the incident and that its initial findings suggest a potential issue with private key management — not necessarily a code exploit.&nbsp;\"While audits cannot prevent private key issues, we always highlight best practices to projects,\" Certik said. \"Should any foul play be discovered, we will work with the appropriate authorities and share relevant info. Stay tuned for updates.\"","Meanwhile, eZKalibur — a zkSync decentralized exchange and launchpad that, like Merlin, forked part of DEX Camelot's contract &nbsp;— <a href=\"https:\/\/twitter.com\/zkaliburDEX\/status\/1651087592052359169\" data-v-f87c67ca=\"\">claims<\/a> to have identified the malicious code responsible for the draining of funds.","\"These two lines of code in the<span class=\"r-b88u0q\" data-v-f87c67ca=\"\"> initialize function<\/span> are essentially granting approval for the <span class=\"r-b88u0q\" data-v-f87c67ca=\"\">feeTo<\/span> address to transfer an unlimited (<span class=\"r-b88u0q\" data-v-f87c67ca=\"\">type(uint256).max<\/span>) amount of <span class=\"r-b88u0q\" data-v-f87c67ca=\"\">token0<\/span> and <span class=\"r-b88u0q\" data-v-f87c67ca=\"\">token1<\/span> from the contract's address,\" it explained while questioning the quality of Certik's audit. \"In this case, the <span class=\"r-b88u0q\" data-v-f87c67ca=\"\">feeTo<\/span> address could potentially call the <span class=\"r-b88u0q\" data-v-f87c67ca=\"\">transferFrom<\/span> function on the respective tokens to transfer tokens from the contract's address to itself.\"","Though Certik tweeted that it highlighted Merlin's centralization risk in its audit of the DEX, some feel that the risk of a rug pull should have been highlighted.","A finding like this should be reported at least as \"major,\" if not \"critical.\" eZKalibur commented to The Block, adding: \"It can't be marked as a hidden and simple decentralization issue since, without a timelock, it could lead to an immediate drain of the totality of the funds deposited on the protocol, which is exactly what happened.\"","Merlin developers have since asked users to revoke wallet permissions connected to its website. They claim to be&nbsp;analyzing the exploit of the protocol.","Merlin did not immediately respond to a request for comment.&nbsp;The Block also contacted Certik.","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Update<\/strong>: Initially believed to be a hack, security analysts, including CertiK, <a href=\"https:\/\/twitter.com\/CertiK\/status\/1651276441949028373\" data-v-f87c67ca=\"\">concluded<\/a> that it was a rug pull – an exit scam executed by one or more developers of the Merlin team with privileged access to user funds deposited in the protocol's smart contracts.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DEX","content":"ORGANIZATION"},{"type":"DEX Camelot","content":"ORGANIZATION"},{"type":"Certik","content":"ORGANIZATION"},{"type":"Certik","content":"PERSON"},{"type":"Merlin","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$1.82 million","content":"MONEY"}],"hashtag":["DEXS","EXPLOITS","HACKS","ZKSYNC"],"authors":["Adam James","The Block"]}