{"summary":"A group of Ethereum community members has proposed ERC 7265 that would enable DeFi protocols to integrate &quot;circuit breaker&quot; to mitigate hacks.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237671\/ethereum-erc-7265-circuit-breaker-defi-hacks","publishDate":"2023-07-04T07:10:53","id":3093,"type":null,"title":"Ethereum community proposes new standard to mitigate DeFi hacks","category":["SECURITY"],"content":["A group of Ethereum community members has proposed a new standard to improve the security of decentralized finance (DeFi) protocols.","Dubbed ERC (Ethereum Request for Comments) 7265, <a href=\"https:\/\/github.com\/ethereum\/EIPs\/pull\/7265\" data-v-f87c67ca=\"\">the proposed standard<\/a> would enable a \"<a href=\"https:\/\/twitter.com\/real_philogy\/status\/1675854852419727365?s=20\" data-v-f87c67ca=\"\">circuit breaker,<\/a>\" allowing DeFi protocols to easily add a back-stop in their smart contracts that stops tokens before they leave the contracts in the event of a hack, according to one of the standard's builders who goes by @tcb_00 on Twitter. The other builders include @Diyahir and @real_philogy.","The proposed ERC 7265 standard comes amid rising DeFi hacks. Nearly $3 billion worth of funds have been stolen by attackers from DeFi protocols to date, <a href=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/exploits\/funds-stolen-by-defi-attackers\" data-v-f87c67ca=\"\">according to The Block's Data Dashboard<\/a>. \"We all agree, DeFi is broken,\" <a href=\"https:\/\/twitter.com\/MeirBank\/status\/1675851684386570240\" data-v-f87c67ca=\"\">said<\/a> Meir Bank of Fluid Protocol. \"Not only are there many hacks, but the results are catastrophic. When protocols are hacked, often they lose everything. The TVL [total value locked] tanks to zero in a matter of seconds.\"","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/exploits\/funds-stolen-by-defi-attackers\/embed\" title=\"Funds Stolen by DeFi Attackers\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<a href=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/exploits\" data-v-f87c67ca=\"\">DeFi attacks<\/a> result in big losses because most protocols don't react quickly enough to stop them, according to Bank, who said by the time anyone realizes what's happening, it's already too late, and even when a team tries to fix things, it's usually too late.","\"ERC 7265 allows teams to create a circuit breaker protecting their protocol, with highly customized rate limit parameters per asset,\" Bank said. \"When a hack happens, the attacker will no longer be able to drain an entire contract in seconds. The majority of funds can be recovered.\"","The ERC 7265 standard is designed for protocols that can be upgraded by governance, which are the most common in DeFi. \"There are very few downsides and many upsides for governed DeFi protocols to integrate ERC 7265,\" Bank said. \"We are going to continue education going forward to save DeFi.\"","Given the ERC 7265 standard is a proposed standard, it remains to be seen whether the core Ethereum team accepts and implements it as the final standard. ERCs are proposed standards that define how specific features or functionalities should be implemented on the Ethereum network, while Ethereum Improvement Proposals or EIPs are submitted changes and improvements to the Ethereum protocol itself. ERCs and EIPs get finalized after they are passed by the broader Ethereum community and implemented by core developers.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$3 billion","content":"MONEY"},{"type":"Ethereum Request for Comments","content":"ORGANIZATION"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"\" Bank","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Meir Bank of Fluid Protocol","content":"ORGANIZATION"},{"type":"7265","content":"DATE"}],"hashtag":["ETHEREUM","EXPLOITS","HACKS","SMART CONTRACTS"],"authors":["Yogita Khatri","The Block"]}