{"summary":"Investors include General Catalyst, LocalGlobe, SIG, and Balaji Srinivasan.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/255217\/ostium-labs-raises-3-5-million-to-bring-dex-perpetual-swaps-to-oil-and-gold","publishDate":"2023-10-06T11:26:51","id":3094,"type":null,"title":"Ostium Labs raises $3.5 million to bring DEX perpetual swaps to oil and gold","category":["COMPANIES"],"content":["Ostium Labs, a cryptocurrency startup, raised $3.5 million in funding to develop a protocol for digitized commodities perpetual swaps.","It aims to attract both traditional commodities traders and crypto-native traders by offering transparent and flexible alternatives for trading assets like oil, bitcoin, foreign exchange pairs, and more.<br data-v-f87c67ca=\"\">\n&nbsp;","A cryptocurrency startup aims to combine traditional commodities trading with the world of crypto, following the close of a $3.5 million fundraise.&nbsp;","Backed by a diverse group of investors, including General Catalyst, LocalGlobe, SIG, and Balaji Srinivasan, Ostium Labs is currently developing a new protocol for digitized commodities perpetual swaps. Co-founders Kaledora Kiernan-Linn and Marco Antonio aspire for this platform to attract both traditional commodities traders seeking a more transparent and flexible alternative to conventional derivatives platforms, as well as crypto-native traders.","To start, the protocol will support trading in perpetuals tied to oil, bitcoin, and oil, Kiernan-Linn told The Block in a phone interview. It will also support trading in foreign exchange pairs for the Australian dollar, the pound, euro, and yen.&nbsp;","Up until this point, traditional assets—or real-world assets—have made up a tiny fraction of overall crypto-related activity. Companies like Tether and Paxos offer trading in tokenized gold products, but volumes in those products have been paltry relative to the stablecoins they operate. The market capitalization of Tether Gold stands at $450 million compared to USDT's $83 billion.&nbsp;","Ash Arora, a partner at Ostium Labs investor LocalGlobe, is part of the cadre of investors who are keen to see real-world assets — which span commodities to real estate to stocks — migrate on-chain.&nbsp;","“In the last century, we've seen vast growth in access to both financial and tangible assets,\" she said in a press release. \"However, consumer access to and transparency in tangible assets still lags far behind, leading to reduced trading volumes and higher fees. We believe tangible, or 'real-world' assets, are overdue for a technological upgrade.\"","Indeed, it is a segment that has historically attracted venture dollars, with $1.6 billion raised across 188 funding deals, according to The Block Research, and $907 million injected into such firms in the last 2 years — illustrating a resurgence.&nbsp;","","","Kiernan-Linn believes that the project's partnership with Chainlink will set it apart from the numerous companies integrating real-world assets into their blockchains. Their derivative pricing will be based on a novel pricing fee mechanism introduced by the project. Earlier this month, Chainlink <a href=\"https:\/\/blog.chain.link\/data-streams-mainnet\/\" data-v-f87c67ca=\"\">introduced<\/a> new data streams designed to facilitate decentralized finance projects, providing them with pricing fees that enable high-speed, low-latency trading. This development significantly reduces the time it takes for asset price data to update on-chain, bringing it in line with the high-speed trading standards of Wall Street firms. Trades on the protocol will be settled in USDC, Kiernan-Linn said.&nbsp;","The crypto-native traders, in particular, might be seeking an alternative to crypto derivatives due to the stagnation in crypto trading activity. According to The Block's data dashboard, monthly bitcoin futures volumes have been consistently decreasing since March, plummeting from a peak of nearly $1.5 trillion in March to $549 billion in September. DEX-based perpetual swap platforms, meanwhile, have seen under a billion traded per day over the last month.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/derivatives\/perpetual-protocol-trade-volume\/embed\" title=\"Perpetual Swaps Trade Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","At the same time, traditional markets have been gripped by the US Federal Reserve's move to hold interest rates steady while indicating plans to hike rates further by the end of the year. That's injected fresh fears into the market that a potential recession could be on the table. It has also been interesting for macro, with assets like gold and oil declining as bond yields surge. &nbsp;","“Perpetuals have grown exponentially in the last 18 months. Yet the market lacks a dedicated platform for traders who want direct on-chain exposure to a broader range of asset classes,” said Kiernan-Linn. “We're building Ostium to fill this gap, and drive the next wave of mainstream adoption by accelerating the transition of RWAs from narrative to reality.\"","In fact, Nick van Eck, a partner at General Catalyst, believes that Ostium represents a new breed of decentralized finance project.","He views it as a company pioneering a novel product category atop the foundational elements that have already been established in the market.","\"I think the last bull market witnessed the creation of most of the fundamental DeFi building blocks, with many companies making incremental improvements,\" he noted in a phone interview. \"It is fascinating to witness fresh ideas entering the market that cater to an entirely different audience.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$549 billion","content":"MONEY"},{"type":"$450 million","content":"MONEY"},{"type":"US Federal Reserve","content":"ORGANIZATION"},{"type":"Marco Antonio","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SIG","content":"ORGANIZATION"},{"type":"$907 million","content":"MONEY"},{"type":"$3.5 million","content":"MONEY"},{"type":"Balaji Srinivasan","content":"PERSON"},{"type":"Ostium","content":"ORGANIZATION"},{"type":"General Catalyst","content":"ORGANIZATION"},{"type":"Linn","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"$83 billion","content":"MONEY"},{"type":"Kiernan","content":"PERSON"},{"type":"Kaledora Kiernan","content":"PERSON"},{"type":"euro","content":"ORGANIZATION"},{"type":"last century","content":"DATE"},{"type":"Ash Arora","content":"PERSON"},{"type":"$1.5 trillion","content":"MONEY"},{"type":"USDT","content":"ORGANIZATION"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$1.6 billion","content":"MONEY"},{"type":"Linn","content":"LOCATION"},{"type":"Nick van Eck","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"DEX","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"last 18 months","content":"DATE"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}