{"summary":"Swiss crypto broker Bitcoin Suisse is raising Series A at over $280 million pre-money valuation\nThe firm is looking to raise at least ~$47.5 million; around ~$20.6 million has already been “committed” \nBitcoin Suisse has plans to become a Swiss bank","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/64518\/swiss-crypto-broker-bitcoin-suisse-is-raising-series-a-at-over-280-million-pre-money-valuation","publishDate":"2020-05-08T08:05:17","id":3094,"type":null,"title":"Swiss crypto broker Bitcoin Suisse is raising Series A","category":["Investments"],"content":["Switzerland-based crypto financial services firm Bitcoin Suisse is raising Series A at CHF 275 million (~$283 million) pre-money valuation, in order to pursue its expansion plans.","Announcing the news on Friday, the firm <a href=\"https:\/\/files.bitcoinsuisse.ch\/assets\/pdf\/BTCS_private_placement_(series_a)_presentation.pdf?v=07052020-1\" data-v-f87c67ca=\"\">said<\/a> it is looking to raise at least CHF 46 million (~$47.5 million) to push its total capital to CHF 100 million (~$103 million).","Around CHF 20 million (~$20.6 million) has already been \"committed\" by “friends &amp; family,” led by Swiss banker Roger Studer and the Studer Family Office. Studer was head of investment banking at Vontobel and is now chairman of the board of directors of the family office.&nbsp;","Studer believes Bitcoin Suisse is “poised to grow rapidly” given its “proven and solid business.” The firm currently provides prime brokerage, custody, lending, staking, and tokenization services to institutional and corporate clients.","Bitcoin Suisse is also <a href=\"https:\/\/www.bitcoinsuisse.com\/news\/bitcoin-suisse-applies-for-swiss-banking-license\/\" data-v-f87c67ca=\"\">undergoing licensing<\/a> as a Swiss bank since October 2019.","“As Bitcoin Suisse transitions into becoming a Swiss bank, company equity solidly above CHF 100m will provide a strong and profitable balance sheet,” said CEO Arthur Vayloyan. “The Series A round opens the way to greatly accelerate and grow the business volume of Bitcoin Suisse, as well as its profitability.”","The firm is offering up to 20% of shares on a group level - in BTCS Holding AG - the holding company owning and controlling all Bitcoin Suisse subsidiaries. Subscription starts from May 11 and will end around mid-June 2020. The minimum subscription per investor is CHF 250,000 (~$257,000).","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">‘Unicorn by 2025’<\/strong><\/span>","Founded in 2013, Bitcoin Suisse aims to grow into a unicorn (a valuation of $1 billion) by 2025. The firm plans to convert its Liechtenstein operations into a fully operational bank.","In 2021, Bitcoin Suisse also plans to conduct a security token offering (STO), and then an initial public offering (IPO) in 2022\/ 2023.","The firm's monthly average revenue in Q1 2020 was CHF 1.8 million (~$1.85 million), as compared to CHF 1.7 million (~$1.75 million) monthly average revenue in 2019.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThere are currently over 140 people working for Bitcoin Suisse across its offices in Switzerland, Denmark and Liechtenstein.","",""],"hashtag":["CRYPTO BANKS AND LENDERS","SERIES A"]}