{"summary":"The Internal Revenue Service has begun sending letters to cryptocurrency holders, asking them to report their virtual currency holdings and pay taxes properly\nNames of these cryptocurrency holders were obtained via “several ongoing compliance efforts” that the IRS is conducting, according to the agency\nThe IRS warns taxpayers that failure to comply may result in “future civil and criminal enforcement activities”","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/33664\/irs-sends-letters-to-warn-over-10000-cryptocurrency-investors-to-report-and-pay-tax-properly","publishDate":"2019-07-26T13:55:22","id":3095,"type":null,"title":"IRS sends letters to warn over 10,000 cryptocurrency investors to report and pay taxes properly","category":["Startups"],"content":["<span data-v-f87c67ca=\"\">The Internal Revenue Service (IRS) is sending letters to over 10,000 cryptocurrency investors, urging them to report and pay their tax properly. The agency said it obtained these investors’ names via “ongoing IRS compliance efforts” and it is expanding its effort related to virtual currencies.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The tax collector said that it started sending out educational letters to these taxpayers associated with virtual currency transactions last week and it is expecting to complete this process by the end of August. Per a Forbes article, these letters are “intended to scare recipients into action.” In some of these letters, the IRS warns taxpayers that if they do not report their virtual transactions accurately, they “may be subject to future civil and criminal enforcement activity.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Although the IRS does not specify what compliance efforts help it identify these cryptocurrency investors, it is likely that the regulator obtains some of these names from Coinbase. In 2018, Coinbase turned over information of around 13,000 accounts on its exchange platform to the IRS.<\/span>","<span data-v-f87c67ca=\"\">The IRS started its virtual <\/span><a href=\"https:\/\/www.irs.gov\/businesses\/irs-announces-the-identification-and-selection-of-five-large-business-and-international-compliance-campaigns\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">currency compliance campaign in July 2018<\/span><\/a><span data-v-f87c67ca=\"\">, when it made clear that cryptocurrencies are properties for federal tax purposes. Meanwhile, <\/span><a href=\"https:\/\/twitter.com\/celiawan2\/status\/1139237101759864833?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The Block first discovered<\/span><\/a><span data-v-f87c67ca=\"\"> that the criminal investigation division of the IRS requested licenses at the end of 2018 to use cybersecurity company Neutrino’s technology to track and monitor cryptocurrency flow.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In the statement, the IRS Commissioner Chuck Rettig advised <\/span><span data-v-f87c67ca=\"\">taxpayers to “take these letters very seriously by reviewing their tax filings and when appropriate, amend past returns and pay back taxes, interest and penalties.”&nbsp;<\/span>"],"hashtag":["IRS"]}