{"summary":"With the surge in on-chain gas fees driven by the most recent memecoin frenzy, the staking reward rate on Ethereum reached a post-Merge all-time high.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230000\/ethereums-staking-rewards-rate-hits-post-merge-record-high-fueled-by-memecoin-frenzy","publishDate":"2023-05-09T14:03:38","id":3095,"type":null,"title":"Ethereum&#x27;s staking rewards rate hits post-Merge record high, fueled by memecoin frenzy","category":["CRYPTO ECOSYSTEMS"],"content":["Ethereum's staking rewards rate climbed to a post-Merge record 8.6% this week, fueled by a surge in on-chain gas fees driven by the recent memecoin frenzy.&nbsp;","The jump in the staking rewards rate, which is a metric for the annualized yield of validators, has translated into $46 million in total income for validators in the first week of May. In all, validators earned 24,997 ETH on the week, according to <a href=\"https:\/\/beaconcha.in\/ethstore\" data-v-f87c67ca=\"\">data<\/a> by ETH Store on the beaconcha.in website. That's a 40% increase over the $33 million in income for the final week of April, when 18,339 ETH were distributed as rewards.&nbsp;","Validators can thank the current memecoin trading trend.&nbsp;Ethereum's average fees consistently surpassed 100 gwei in the last week, the <a href=\"https:\/\/www.theblock.co\/post\/229508\/ethereum-gas-price-high-memecoin-hype\" data-v-f87c67ca=\"\">highest<\/a> since May 2022. Thats' resulted in costs of over $30 per swap for end users. As gas fees rise, validators benefit from higher fee income from processing transactions, in addition to their regular validator rewards.","According to beaconcha.in, the current staking rate rate represents how much annualized return validators can expect. To participate in the network's consensus process, Ethereum validators are required to stake a minimum of 32 ETH, which is approximately $58,000.","ETH Store, a firm that measures reward rates, identifies two types of rewards: consensus rewards for proposing and attesting blocks, and transaction fees for processing transactions on the Ethereum network.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/eth-staking-rewards-reference-rate\/embed\" title=\"ETH Staking Rewards Reference Rate\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","ETH staking has become increasingly important for institutions since the Ethereum network switched to a proof-of-stake (PoS) consensus mechanism with The Merge last year, and with the recent Shapella upgrade that enabled validator withdrawals for the first time. Currently, there are over <a href=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\" data-v-f87c67ca=\"\">19 million ether<\/a> staked on the network by 560,000 validator entities, which valued at $34 billion.","The price of ETH is down 1% on the day, changing hands at $1840 at the time of writing.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$30","content":"MONEY"},{"type":"May 2022","content":"DATE"},{"type":"8.6%","content":"PERCENT"},{"type":"first week of May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"ETH Store","content":"ORGANIZATION"},{"type":"$34 billion","content":"MONEY"},{"type":"final week of April","content":"DATE"},{"type":"40%","content":"PERCENT"},{"type":"$58,000","content":"MONEY"},{"type":"$46 million","content":"MONEY"},{"type":"1%","content":"PERCENT"},{"type":"$1840","content":"MONEY"},{"type":"$33 million","content":"MONEY"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}