{"summary":"Tether has published a transparency report detailing its reserves as of June 30.\nTether ramped up its allocation to treasury bills as of June, compared to March numbers.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/113874\/tether-new-reserves-report-june-2021-treasury-bills","publishDate":"2021-08-09T10:09:56","id":3096,"type":null,"title":"Tether significantly increased exposure to treasury bills as of June","category":["Tether"],"content":["Stablecoin issuer Tether has <a href=\"https:\/\/tether.to\/wp-content\/uploads\/2021\/08\/tether_assuranceconsolidated_reserves_report_2021-06-30.pdf\" data-v-f87c67ca=\"\">published<\/a> a transparency report detailing the breakdown of its $62.8 billion in reserves as of June 30.","The majority — 85% of Tether's (USDT's) reserves — was held in the \"Cash &amp; Cash Equivalents &amp; Other Short-Term Deposits &amp; Commercial Paper\" category as of the date.","Within this category, commercial paper and certificates of deposit formed the majority, with a 58% share. Treasury bills accounted for 29%, cash and bank deposits for 12%, and reverse repo notes for 2% of the category.","Notably, Tether's allocation to treasury bills has increased significantly. The amount of treasury bills has increased from 3% of the cash &amp; cash equivalents category <a href=\"https:\/\/www.theblockcrypto.com\/post\/104780\/tether-usdt-reserves-breakdown-first-time-since-launch\" data-v-f87c67ca=\"\">in March<\/a> to 29% of the even bigger category in June. Treasury bills are short-term government debt obligations with a maturity of one year or less.","Tether has also made a notable change to its cash and bank deposits category this time around. Last time, cash and fiduciary deposits were separate categories. Now Tether has combined these two categories, with a new name: cash and bank deposits. And the allocation to this combined category as of June is down from 28% to 12% — meaning it has reduced the combined amount of cash and fiduciary deposits.","Another notable change in the latest reserves report is that Tether has given the ratings of its commercial paper and certificates of deposit holdings as of June 30. The majority of its holdings had an A-1 rating, followed by A-2, A-3, A-1+, and other ratings as of the date.","Tether has also given the breakdown of the maturity of the commercial paper and certificates of deposit holdings this time. The majority of these holdings had a maturity of 81–365 days, followed by 0–90 days and 91–180 days.","This is Tether's second reserves report since its launch in 2014. Earlier this year, Tether proposed ongoing publication of the reserve breakdown as part of its $18.5 million settlement agreement with the New York Attorney General's Office. Audit firm Moore Cayman has given an assurance opinion for both the reports.","\"Our most recent assurance opinion from Moore Cayman again confirms Tether is fully backed,\" said Tether CTO Paolo Ardoino. \"A healthy and conservative portfolio with an emphasis on liquidity continues to fuel our growth and confidence in our innovative offerings.\""],"hashtag":["TETHER"]}