{"summary":"Andy Haldane, chief economist at the Bank of England, has said digital currencies could mitigate the need for negative interest rates.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/85093\/bank-england-haldane-cbdc-negative-rates","publishDate":"2020-11-18T12:53:45","id":3097,"type":null,"title":"Bank of England’s chief economist: digital currencies may mitigate the need for negative interest rates","category":["CENTRAL BANKS"],"content":["Andy Haldane, the chief economist at the Bank of England, has said digital currencies could mitigate the need for negative interest rates.","“At root, the Zero Lower Bound arises from a technological constraint on the ability to pay or receive interest on physical cash, whether positive or negative,” he said.","“In principle, a widely-used digital currency could mitigate, if not eliminate, that technological constraint by enabling interest rates to be levied on retail monetary assets.”","The Bank of England is currently mulling over whether to cut the base rate to below zero, which would likely mean that banks would have to start charging customers for deposits. Sam Woods, chief executive of the Prudential Regulation Authority, <a href=\"https:\/\/www.bankofengland.co.uk\/prudential-regulation\/letter\/2020\/info-request-operational-readiness-policy-rates\" data-v-f87c67ca=\"\">sent a letter<\/a> to banks seeking information about how negative interest rates would affect them on October 12. Negative interest rates already prevail in the Eurozone.","Speaking at a conference on November 10, Haldane laid out both the risks and benefits of various different variations of digital currency – including Central Bank Digital Currencies and private stablecoins.","“While the focus so far has been on the costs of this disruption – for funding and credit provision – weight needs also to be given to the potential longer-term benefits of such a structural shift,” he said.","Haldane said that a widely-used digital currency could have profound effects on financial stability, giving rise to something he described as “closer to narrow banking” – in which payments and credit-based activities are more cleanly divided.","Instabilities in the banking sector often arise from risk and duration mismatches on either side of banks’ balance sheets, he explained.","“In principle, separating safe payments and risky lending activities could lead to a closer alignment of risk and duration on the balance sheets of those institutions offering these services,” Haldane continued. “","We would move closer to a bifurcated intermediation model of narrow banking for payments (money backed by safe assets) and limited purpose banking for lending (risky assets backed by capital-uncertain liabilities). In principle, this would reduce, at source, the intrinsic instabilities of the traditional banking model.”","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Eurozone","content":"LOCATION"},{"type":"Haldane","content":"PERSON"},{"type":"Central Bank Digital Currencies","content":"ORGANIZATION"},{"type":"the Bank of England","content":"ORGANIZATION"},{"type":"Andy Haldane","content":"PERSON"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Prudential Regulation Authority","content":"ORGANIZATION"},{"type":"November 10","content":"DATE"},{"type":"Sam Woods","content":"PERSON"},{"type":"October 12","content":"DATE"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}