{"summary":"Genesis originated more than $40 billion in loans since it launched its credit business in 2018.\nThe demand for cash continues to fuel the business.\nAs lenders seek funding sources, securitization is popping up as one option.","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/103769\/genesis-quarterly-report-shows-relentless-demand-for-dollars-in-crypto-credit-market","publishDate":"2021-05-04T17:50:09","id":3099,"type":null,"title":"Genesis quarterly report shows &#x27;relentless&#x27; demand for dollars in crypto credit market","category":["Lending"],"content":["Since Genesis Global Trading launched a lending business in 2018, it has originated more than $40 billion loans — and that growth doesn't appear to be slowing down.&nbsp;","The firm, which releases a breakdown of its business across trading, lending, and derivatives every quarter, saw active loans outstanding on its platform increase 136% relative to the previous quarter, totaling $9.03 billion. The sharp increase in outstanding loans illustrates the desire for credit, which is being driven by \"relentless\" demand for dollars among crypto market participants.&nbsp;","That demand for cash is tied to the basis trade, cashing in on the difference between the price of futures on bitcoin and the underlying crypto. There's also demand from companies in the market that want to borrow dollars against their crypto to build out operations without having to sell.&nbsp;","","","Contributing to the demand for credit is the entrance of corporate treasuries into the crypto market over the last several months, according to Josh Lim, head of derivatives at Genesis.&nbsp;","In an interview with The Block, Lim said the \"biggest driver comes from the growth of corporate treasury usage of crypto and the associated lending needs of those types of accounts.\"","\"It is very linked to the overall growth of the industry,\" said Lim, who previously worked at both Galaxy and Circle in trading capacities. \"It's not just price action, it is the qualitative category of counter-parties entering the space.\"","\"They want to have as much capital efficiency as they can get to deploy risk into leveraged strategies, basis and derivative trades or DeFi yield programs, whatever their mandate may be,\" he added.&nbsp;","Lim and the team at Genesis are not the only ones beating the drum about the lending market's growth. Alan Lane, CEO of Silvergate, told The Block in a recent interview that the entrance of corporate treasurers will likely fuel demand for credit. Silvergate lends to clients who store their crypto with custody partners through SEN Leverage. Bitstamp, the crypto exchange, is one of its custody providers and recently said it believes it will originate nearly a quarter-billion worth of loans by the end of the year through SEN.&nbsp;","\"You have folks like Elon,\" Lane said, referring to Elon Musk, CEO of Tesla, which notably made a billion-dollar-plus bitcoin allocation. \"He could have just put his bitcoin in custody with Silvergate and then we could lend dollars against it.\"","The demand for dollars is putting pressure on lenders in the market to find new sources of funding. One such source might be familiar to those familiar with Wall Street parlance: securitization. Indeed, the topic of bundling up loans or interest payments into securitized products that banks or other financial players purchase from crypto firms is becoming a centerpiece of recent convos in the crypto credit market.&nbsp;","\"It is a very, very common topic,\" Lim said.&nbsp;"],"hashtag":["LENDING"]}