{"summary":"dYdX Chain&#x27;s beta mainnet stage has gone live, enabling active trading across more than 33 perpetual markets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262993\/dydx-chain-trading-goes-live-beta-mainnet-stage","publishDate":"2023-11-14T08:02:50","id":3099,"type":null,"title":"dYdX Chain trading goes live, enters beta stage following governance vote","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">The standalone Cosmos-based Layer 1 <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">dYdX <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248448\/dydx-dydx-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/hjnIm9bV.jpg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">DYDX<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.56%\n    <\/span><\/a> <!----><\/span><\/span> Chain has entered its beta mainnet stage, enabling active trading to go live for the first time following a decisive governance vote.<\/span>","Transitioning from its alpha stage, dYdX Chain’s beta launch occurred at 8:45 a.m. EST on Monday, according to a <a href=\"https:\/\/www.dydxopsdao.com\/blog\/dydx-chain-beta-live\" data-v-f87c67ca=\"\">blog post<\/a> by the dYdX Operations subDAO, which leads decentralized infrastructure for dYdX Chain. The launch followed a <a href=\"https:\/\/www.mintscan.io\/dydx\/proposals\/1\" data-v-f87c67ca=\"\">community vote<\/a> to change trading on all markets from post-only to active, which garnered over 99% support.","Users can now engage in trading across more than 33 perpetual markets via the dydx.trade platform, offering up to 20x leverage. No trading rewards will be distributed during this stage, but validators and stakers will accrue trading fees, according to the post. “The beta stage serves as the critical testing phase for active trading environments,” the subDAO wrote.","Once the dYdX Chain protocol is stable with minimal bugs or issues, progression from active to full trading, including rewards, will be determined by another governance vote, it added — urging vigilance in monitoring the dYdX Chain before trading significant size.","The alpha mainnet for dYdX version 4, along with the debut of its Cosmos-based blockchain, was <a href=\"https:\/\/www.theblock.co\/post\/259658\/dydx-chain-officially-launches-on-mainnet-as-standalone-cosmos-layer-1\" data-v-f87c67ca=\"\">launched<\/a> on Oct. 26, signaling a notable transition for the leading decentralized derivatives platform to become a standalone Layer 1 on Cosmos after previously relying on Ethereum Layer 2 scaling solution StarkEx in version 3.","\"After years of development, five testnets involving over 60 validators and top tier trading firms, the dYdX Chain has been officially launched by the community and DAO,\" Charles d’Haussy, CEO of the dYdX Foundation, told The Block at the time.","The dYdX platform ranks as the most extensive decentralized derivatives trading platform in crypto, with a cumulative volume of over <a href=\"https:\/\/dydx.exchange\/blog\/1trillion-trading-volume\" data-v-f87c67ca=\"\">$1 trillion<\/a> since 2020.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Charles d’Haussy","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Oct. 26","content":"DATE"},{"type":"$1 trillion","content":"MONEY"},{"type":"-1.56%","content":"PERCENT"},{"type":"99%","content":"PERCENT"},{"type":"2020","content":"DATE"},{"type":"8:45 a.m. EST","content":"TIME"},{"type":"dYdX Foundation","content":"ORGANIZATION"}],"hashtag":["COSMOS","DERIVATIVES","DEXS"],"authors":["James Hunt","The Block"]}