{"summary":"More than half—52%—of the Fortune 100 have pursued crypto, blockchain or web3 initiatives since the start of 2020, according to the enclosed research conducted in partnership with The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237142\/the-state-of-crypto-corporate-adoption","publishDate":"2023-06-29T13:31:59","id":31,"type":null,"title":"The State of Crypto: Corporate Adoption","category":["THE BLOCK"],"content":["<b data-stringify-type=\"bold\" data-v-f87c67ca=\"\"> The Block Research has created “The State of Crypto: Corporate Adoption” in partnership with Coinbase. To access the full report in PDF format, please fill out the form below&nbsp;<\/b>","More than half—52%—of the Fortune 100 have pursued crypto, blockchain or web3 initiatives since the start of 2020, according to the enclosed research conducted in partnership with The Block. About 60% of Fortune 100 initiatives reported since the start of 2022 have been either in the pre-launch stage or already launched. Zooming out, 83% of surveyed Fortune 500 executives who are familiar with cryptocurrency or blockchain say their companies have either current initiatives or are planning them.","","","These companies, among the world’s largest and best known, are innovating and investing in these technologies because they know that our century-old global financial system needs updating, that blockchain can be a foundational solution, and that not keeping pace will mean losing ground in this global economy to competitors around the world, among other reasons. About two thirds (64%) of surveyed Fortune 500 executives who are familiar with cryptocurrency or blockchain say that investing in these technologies is important for staying ahead of their competition.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Coinbase","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"64%","content":"PERCENT"},{"type":"2020","content":"DATE"},{"type":"83%","content":"PERCENT"},{"type":"60%","content":"PERCENT"},{"type":"52%","content":"PERCENT"},{"type":"Block Research","content":"ORGANIZATION"}],"hashtag":[],"authors":["The Block Research","The Block"]}