{"summary":"Crypto exchange Coinbase has explained what technical factors it looks into before deciding to list an ERC-20 token. \nAccording to the exchange, each ERC-20 token should have four qualities: Verified source code, industry-standard library use, limited scope for privileged roles, and simple and modular design.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/75178\/coinbase-explains-evaluation-erc-20-tokens-listing","publishDate":"2020-08-18T05:20:26","id":3100,"type":null,"title":"Coinbase explains how it evaluates ERC-20 tokens for listing","category":["Exchanges"],"content":["Crypto exchange Coinbase has explained what technical factors it looks into before deciding to list an ERC-20 token on its trading platforms.&nbsp;","In a blog post <a href=\"https:\/\/blog.coinbase.com\/securing-an-erc-20-token-for-launch-on-coinbase-68313652768f\" data-v-f87c67ca=\"\">published<\/a> Monday, Nadir Akhtar, a blockchain security engineer at Coinbase, listed four qualities that each ERC-20 token should possess: Verified source code, industry-standard library use, limited scope for privileged roles, and simple and modular design.","Firstly, the token's source code should be verified, said Akhtar. \"This is the most important step to getting a token listed.\"","Akhtar has suggested that developers should upload the source code for all smart contracts to a \"reliable\" platform, such as Etherscan. If the code is not yet deployed, it should be added to an easily shareable repository, such as <a href=\"https:\/\/www.theblockcrypto.com\/post\/21317\/digital-assets-data-raises-6-million-to-be-the-bloomberg-and-github-of-cryptocurrency-data\" data-v-f87c67ca=\"\">GitHub<\/a>, he said.","Secondly, developers should use open-source smart contract standards to develop ERC-20 tokens, according to Akhtar. It means developers should avoid writing smart contract code from scratch because they can miss a crucial detail, \"compromising the integrity of the token.\"","Akhtar recommended using popular and \"well-vetted\" standards, such as OpenZeppelin's repository of smart contracts.","Thirdly, ERC-20 tokens' smart contracts should have limited privileged or \"admin\" roles, said Akhtar. \"These roles can wield significant power, such as pausing transactions, modifying balances, or completely changing the token's logic,\" which reduces the likelihood of listing the token on Coinbase.","Lastly, tokens' protocols should have \"simple\" and \"modular\" design to avoid complexities, said the security engineer.&nbsp;","Besides the above listed four factors, Coinbase also looks into factors such as external audits, thorough documentation, up-to-date Solidity language versions, and comprehensive test suites of ERC-20 tokens to catch bugs early.","External audits of smart contracts are especially important, said Akhtar, since their failures can cost \"millions of dollars.\"","\"By developing tokens with these security best practices in mind, the path towards building an open financial system becomes much safer,\" Akhtar concluded."],"hashtag":["COINBASE","TOKENS"]}