{"summary":"N26 is the latest in a growing line of fintech firms to branch out into the crypto space.\nThe neobank is expanding its “marketplace enablement team” to spur on development of its crypto products.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/110577\/thiel-german-neobank-n26-crypto-exchanges-trading-feature","publishDate":"2021-07-06T12:52:23","id":3101,"type":null,"title":"N26 is working with &#x27;top-tier crypto exchanges&#x27; on new trading feature","category":["Fintech"],"content":["N26, the Berlin-based neobank valued at $3.5 billion, is planning to launch crypto trading tools as part of a new marketplace initiative.","A spokesperson for the firm told The Block that it is working with “top-tier crypto exchanges” to launch the new product. It is not yet clear, however, which partners the neobank is working with.","“We plan to offer crypto features through a marketplace environment, integrating elements of a crypto exchange experience inside the banking and budgeting features at N26,” they added.","News of N26’s crypto expansion was <a href=\"https:\/\/financefwd.com\/de\/n26-serbien\/\" data-v-f87c67ca=\"\">first reported<\/a> by German publication Finance FWD, which stated that the neobank’s customers will be able to trade bitcoin and other cryptocurrencies by the end of the year.","N26 is currently expanding its “marketplace enablement team” to spur on development of the crypto product, according to the company’s spokesperson.","“It is our aim to become the one-stop-app for our customer’s finances. We want customers to be able to access all of their financial services in one place, without having to sign-in through several different places. This will include saving products, loans, trading, taxes and crypto,” they added.","N26 is one of Europe’s largest neobanks, with backers including Peter Thiel’s Valar Ventures, Tencent and GIC, Singapore’s sovereign wealth fund. It has raised €744 million (roughly $879 million) in equity investment to date.","Since late last year, a period in which bitcoin and other cryptocurrencies have — until recently at least — surged in price, fintech firms have been rushing to add new crypto trading tools to their apps.","The Block reported in February that Plum and Freetrade, two United Kingdom-based investment apps, were <a href=\"https:\/\/www.theblockcrypto.com\/post\/95439\/european-investment-freetrade-plum-crypto-launches-bitcoin-surge\" data-v-f87c67ca=\"\">hiring crypto experts<\/a> to expand their offerings. In the same month, on the other side of the pond, mobile banking app MoneyLion <a href=\"https:\/\/www.theblockcrypto.com\/linked\/94753\/moneylion-spac-merger-plans-crypto-products\" data-v-f87c67ca=\"\">announced plans<\/a> for a new suite of crypto products. In April, German neobroker Trade Republic officially <a href=\"https:\/\/www.theblockcrypto.com\/linked\/103231\/trade-republic-neo-broker-crypto-trading\" data-v-f87c67ca=\"\">entered the crypto market<\/a>.","Although the space is becoming increasingly crowded, N26 seems to feel that the convenience of meshing crypto tools together with a banking app will help it stand out.","“By observing consumer trends in crypto as well as regulatory landscape changes, we believe that we can bring great value to our customers by making crypto part of their banking experience with us. Our aim is for our customers to be able to choose the right crypto product and to give them full control over their financial decisions,” said the company’s spokesperson."],"hashtag":["BITCOIN","CRYPTO"]}