{"summary":" Layer-2 scaling solution Boba Network has expanded its support to the Avalanche blockchain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/171757\/layer-2-solution-boba-network-integrates-with-avalanche","publishDate":"2022-09-21T12:00:37","id":3102,"type":null,"title":"Layer 2 solution Boba Network integrates with Avalanche","category":["TECHNOLOGY"],"content":["Layer-2 scaling solution Boba Network has expanded its support to the Avalanche blockchain.","According to Ava Labs, Boba is Avalanche’s first Layer 2 solution and will offer developers a new scaling toolkit.","Boba Network, a multi-chain Layer 2 scaling project, has expanded to Avalanche.","Boba will help meet scalability demands for<a href=\"https:\/\/www.theblock.co\/post\/156865\/inside-the-avalanche-ecosystem-with-ava-labs-coo-kevin-sekniqi\" data-v-f87c67ca=\"\"> Avalanche<\/a>, a Layer 1 blockchain that presents itself as a faster Ethereum. Boba is Avalanche’s first Layer 2, according to a Wednesday announcement from Avalanche's core contributor Ava Labs.","It will be available to help scale dApps built on C-Chain — Avalanche’s main smart contract platform that offers compatibility with the Ethereum Virtual Machine and hosts several decentralized applications (dApps).","Boba is an Optimistic rollup that reduces gas fees and improves transaction throughput for blockchains. While Boba was originally launched on Ethereum last year, it first went multi-chain in June of this year by simultaneously<a href=\"https:\/\/www.theblock.co\/post\/149837\/ethereum-layer-2-boba-network-integrates-with-fantom-and-moonbeam\" data-v-f87c67ca=\"\"> integrating<\/a> with Fantom and Moonbeam blockchains.","Besides its Optimism-based scaling solution, the Boba Network team plans to give Avalanche developers access to its offering called Hybrid Compute. This is a cloud environment using which blockchain applications can interact with data from web2 apps such as social media platforms.","“By deploying to additional chains, Boba breaks fresh ground and brings Avalanche its very first L2, equipping our talented developers with yet another way to make dApps cheap, fast, and scalable will only benefit users,” Luigi D'Onorio DeMeo, head of decentralized finance at Avalanche's core development firm Ava Labs, said of Boba's integration. “We’re excited to see how this integration evolves and where the story of Avalanche L2s leads.”","The Avalanche integration will see EvoVerses, a 3D play-to-earn strategy game, go live on Avalanche's Boba implementation as a launch partner dApp.","SushiSwap, one of the largest decentralized exchanges, is also deploying on the Boba Network layer 2 on Avalanche.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Fantom","content":"PERSON"},{"type":"Ava Labs","content":"PERSON"},{"type":"Boba","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Ava Labs","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"Boba","content":"ORGANIZATION"},{"type":"Boba Network","content":"ORGANIZATION"},{"type":"Luigi D'Onorio DeMeo","content":"PERSON"}],"hashtag":["AVALANCHE"],"authors":["Vishal Chawla","The Block"]}