{"summary":"CryptoPunk holders will be able to purchase one of 250 NFTiff passes powered by blockchain solutions company Chain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/160284\/tiffany-co-announces-nft-backed-limited-edition-cryptopunk-pendants","publishDate":"2022-07-31T15:03:41","id":3105,"type":null,"title":"Tiffany &amp; Co. announces NFT-backed, limited edition CryptoPunk pendants","category":["COMPANIES"],"content":["Luxury jewellery firm Tiffany &amp; Co. is set to sell non-fungible tokens (NFT), which give CryptoPunk holders the right to turn their NFT into a custom pendant, containing gemstones and diamonds.","The 250 tokens are part of a limited edition campaign, the company <a href=\"https:\/\/nft.tiffany.com\/faq\/\" data-v-f87c67ca=\"\">announced on Sunday<\/a>.","The campaign was prompted by the company's vice president Alexandre Arnault, who owns CryptoPunk #3167, turning his NFT into a pendant which he shared on social media in early April.","CryptoPunk holders will be able to purchase one of 250 NFTiff passes powered by blockchain solutions company Chain from Tiffany, with a maximum of three per person, which will enable them to mint a custom pendant based on their CryptoPunk.","Chain CEO Deepak Thapliyal <a href=\"https:\/\/docs.new\" data-v-f87c67ca=\"\">trailed the move<\/a> on his social media earlier in the month.&nbsp;","","","The company said Tiffany’s designers will work with the 87 attributes and 159 colors that appear across the collection of 10,000 CryptoPunk NFTs to match with the most similar gemstone or enamel color.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Each pendant will include a minimum of 30 gemstones and diamonds, and feature an engraving of the CryptoPunk’s edition number on the back. Owners will also receive a digital rendering of the pendant and a certificate of authenticity.","With this move, Tiffany &amp; Co has joined the slew of luxury fashion houses attempting to establish a foothold in the web3 world and engage with a new generation of customers. As an April Fools joke it announced the launch of TiffCoin, which it then turned into an actual limited-edition gold coin.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"Alexandre Arnault","content":"PERSON"},{"type":"Tiffany’s","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Tiffany &amp; Co.","content":"ORGANIZATION"},{"type":"Deepak Thapliyal","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"#3167","content":"DATE"},{"type":"April Fools","content":"ORGANIZATION"},{"type":"Tiffany","content":"ORGANIZATION"},{"type":"Tiffany &amp; Co","content":"ORGANIZATION"},{"type":"April","content":"DATE"}],"hashtag":["TIFFANY &AMP; CO."],"authors":["Callan Quinn","The Block"]}