{"summary":"Crypto platform DX.Exchange is reportedly going through bankruptcy proceedings\n78 current and former employees of the firm behind DX.Exchange have filed a petition to dissolve the exchange \nSeveral suppliers have also sued the exchange ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/48293\/nasdaq-powered-dx-exchange-is-going-through-bankruptcy-proceedings-just-weeks-after-shutting-down","publishDate":"2019-11-25T02:30:15","id":3109,"type":null,"title":"Nasdaq-powered DX.Exchange is going through bankruptcy proceedings, just weeks after shutting down","category":["Cryptocurrency"],"content":["Less than a month after shutting down, cryptocurrency trading platform DX.Exchange, is reportedly going through bankruptcy proceedings.","Seventy-eight former and present employees of CX Technologies Ltd., the company behind DX.Exchange, have filed a petition in an Israeli court to dissolve the exchange, the Times of Israel <a href=\"https:\/\/www.timesofisrael.com\/much-hyped-cryptocurrency-website-goes-bust-revealing-ties-to-binary-options\/\" data-v-f87c67ca=\"\">reported<\/a> Sunday.","Estonia-registered DX.Exchange, built on Nasdaq’s matching engine and market surveillance technology, <a href=\"https:\/\/www.theblockcrypto.com\/post\/45672\/nasdaq-powered-crypto-platform-dx-exchange-shuts-down-on-lookout-for-merger-or-acquisition\" data-v-f87c67ca=\"\">closed its operations<\/a> earlier this month and said that it was on the lookout for merger or acquisition. “The costs of providing the required level of security, support, and technology is not economically feasible on our own,” the company said at the time. It also said that if a merger or acquisition does not take place on time, it could halt operations permanently.","In the bankruptcy petition, filed on Oct. 24, employees of CX Technologies claim that they have not been paid their salaries for September or October 2019 and some have not received benefits for even longer, as well as that the company has no money left in its bank accounts. The company’s owner, Pinhas Patarkazishvili, apparently agreed with this assessment and allowed the bankruptcy proceedings to go forward.","The petition also claims that CX Technologies is a successor company to SpotOption, which was raided by the U.S. Federal Bureau of Investigation (FBI) in January 2018 over suspicions that it was involved in Israel’s multibillion-dollar binary options scam. The petition also claims that most of CX Technologies’ 55 employees are former employees of SpotOption.","DX.Exchange was indeed<a href=\"https:\/\/www.ccn.com\/is-dx-exchange-a-sham-crypto-platform-for-us-stock-trading-linked-to-shady-spotoption\/\" data-v-f87c67ca=\"\"> linked to SpotOption<\/a> earlier this year, as Limor Patarkazishvili (Pinhas' wife), the sole shareholder of DX.Exchange, owned 90% of binary options platform SpotOption. DX.Exchange has in the past denied any connection to SpotOption, while SpotOption has denied all allegations of wrongdoing, per the Times of Israel report.&nbsp;","<strong data-v-f87c67ca=\"\">Suppliers have also sued<\/strong><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIn addition to the petition by employees, several Israeli suppliers have also sued CX Technologies in the last six months for allegedly failing to pay its bills. These companies include White Hat Ltd., which provided cybersecurity services to DX.Exchange; Bee2See Dotan B.S. Solutions, which provided targeted marketing of potential customers; and Malam Team, which supplied servers to the exchange, per the report, which adds that more creditors could come forward.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nDX.Exchange <a href=\"https:\/\/www.theblockcrypto.com\/post\/15784\/europes-dx-exchange-makes-waves-by-listing-security-tokens-for-secondary-trading\" data-v-f87c67ca=\"\">was launched<\/a> in January, and also offered trading in cryptocurrencies as well as tokenized securities such as Tesla and Apple stock. <a href=\"https:\/\/www.theblockcrypto.com\/post\/45672\/nasdaq-powered-crypto-platform-dx-exchange-shuts-down-on-lookout-for-merger-or-acquisition\" data-v-f87c67ca=\"\">The Block reported<\/a> earlier this month that the firm has now scrubbed any mention of tokenized securities from its platform.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIn response, DX.Exchange CEO Daniel Skowronski told The Block at the time that he exchange has “applied for an MTF (multilateral trading facility) exchange license and about to be granted under a different entity. Our intention was to move the digital stocks to the MTF. So they were removed from the website until then. The Security Token trading would fall under the MTF too.\"","When DX.Exchange announced that it is shutting down, some people on social media platforms called it \"an exit scam.\" Skowronski told The Block at the time that the scam claims are \"ridiculous.\"","Skowronski told The Block on Monday that DX.Exchange has not filed for bankruptcy yet. “We are still in talks about being acquired. Taking longer than we thought,\" he added.&nbsp;"],"hashtag":[]}