{"summary":"Ethereum’s London upgrade has happened successfully.\nDue to EIP-1559, the network is now burning ETH on a regular basis.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/113650\/heres-how-much-eth-has-already-been-burned-due-to-eip-1559","publishDate":"2021-08-05T09:50:14","id":3110,"type":null,"title":"Here’s how much ETH has already been burned due to EIP-1559","category":["Ethereum"],"content":["Ethereum’s London hard fork has gone live and its effects are already underway. The network upgrade included a specific improvement called EIP-1559, which was designed to simplify how transaction fees are paid.","But part of the new mechanism involves burning a portion of the transaction fees, removing them from the circulating supply of coins. And while new ether (ETH) is being issued every block, this reduction in supply is helping to counter that — effectively reducing the network’s rate of inflation.&nbsp;","And so far, 213 ETH has already been burned, at a value of $559,000 — according to block explorer Etherchain's <a href=\"https:\/\/etherchain.org\/burn\" data-v-f87c67ca=\"\">burn tracker<\/a>.","While burning is a very dramatic term, it just means removing the coin from circulation.","Typically, this is very simple in technical terms. To burn a cryptocurrency, you send it to an address that nobody has control over. Unless someone happens to guess the private keys to that address (an exceedingly unlikely possibility) nobody will ever be able to spend the coins.","In this case, however, the tokens are actually destroyed by the protocol — which means they no longer exist on the network.","<a href=\"https:\/\/twitter.com\/Luit_H\/status\/1423281752206757894\" data-v-f87c67ca=\"\">According<\/a> to MyCrypto developer Luit Hollander, this happens by removing the ETH from the person making the transaction (and paying the base fee) but not giving it to the miner. This is unlike transaction fees that are paid directly to miners. As a result, nobody is able to spend it on the network from that moment on.","So far, the network has been burning ETH at quite a high rate. But it won’t necessarily continue like this.","As The Block <a href=\"https:\/\/www.theblockcrypto.com\/post\/113595\/ethereums-london-hard-fork-what-it-is-and-why-it-matters\" data-v-f87c67ca=\"\">explained<\/a>, the upgrade enables the network to adapt to moments of higher demand. So when there are more transactions, there is a higher base fee (the part that gets burned) and more ETH gets burned. But once the network goes quiet, less ETH gets burned.","So right now, the network is processing all the transactions in the current backlog, a pre-blockchain limbo called the mempool. Once those transactions have been processed, then there will be lower demand and the base fee will likely drop.","“Don't expect the current burn rate to cont forever,” <a href=\"https:\/\/twitter.com\/hasufl\/status\/1423265593776553993\" data-v-f87c67ca=\"\">wrote<\/a> pseudonymous security researcher Hasu. “Once the mempool has been cleared entirely (which should happen any moment now), blocks will become smaller and basefee will fall again.”","While EIP-1559 is not slated to make Ethereum deflationary — where the network would burn more supply than is being newly issued — there has already been a block where that was the case.","As <a href=\"https:\/\/twitter.com\/econoar\/status\/1423277029143711748\" data-v-f87c67ca=\"\">pointed out<\/a> by EthHub co-founder Eric Conner, Ethereum block <span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">12,965,263<\/span> saw more ETH being burned than was issued. In this case, there was 2.078 ETH burned in base fees, while the amount of new ETH given to miners for mining blocks is only 2 ETH. Conner described this as, \"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">The first deflationary block in history.<\/span>\"","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to subscribe to The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/t.me\/the_block_crypto\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/t.me\/the_block_crypto\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Telegram<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>"],"hashtag":["ETHEREUM","TOKENS"]}