{"summary":"A Florida resident pleaded guilty to a securities fraud conspiracy charge in a case involving a crypto Ponzi scheme said to have netted as much as $100 million from customers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168746\/florida-man-pleads-guilty-to-securities-fraud-charge-in-100-million-crypto-ponzi-scheme","publishDate":"2022-09-08T17:20:09","id":3111,"type":null,"title":"Florida man pleads guilty to securities fraud charge in $100 million crypto Ponzi scheme","category":["LEGAL"],"content":["A Florida resident pleaded guilty to a securities fraud conspiracy charge in a case involving a crypto Ponzi scheme said to have netted as much as $100 million from customers.","The Department of Justice announced the guilty plea, saying that Joshua Nicholas faces up to five years in prison at sentencing. Nicholas admitted that he and others fraudulently promoted EmpiresX by making numerous misrepresentations regarding, among other things, a purported proprietary trading bot and fraudulent “guaranteed” returns to investors and prospective investors in the company.","EmpiresX falsely claimed to use trading bot software but in reality paid out older investors using incoming funds — the definition of a Ponzi scheme.","\"In addition, despite representations to the contrary, EmpiresX never registered, nor took steps to register, EmpiresX’s investment program as an offering and sale of securities with the U.S. Securities and Exchange Commission, nor did EmpiresX have a valid exemption from this registration requirement,\" the DOJ said.","An <a href=\"https:\/\/www.instagram.com\/empiresxcompany\/?hl=en\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Instagram account<\/a> devoted to the EmpireX scheme promised high investment returns to would-be participants.&nbsp;","Nicholas faces a maximum penalty of five years in prison. A sentencing date has not yet been scheduled.&nbsp;&nbsp;","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"Florida","content":"LOCATION"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Joshua Nicholas","content":"PERSON"}],"hashtag":["CRYPTO"],"authors":["Michael McSweeney","The Block"]}