{"summary":"Motion to dismiss ruling in trademark infringement action by Blockchain Luxembourg (“Blockchain”) against Paymium for use of domain “blockchain.io”\nCourt denied most of the motion, agreeing that their marks were not inherently descriptive, had acquired secondary meaning, and that the Blockchain marks and blockchain.io marks were substantially similar enough for the case to proceed.\nCourt demised claims against French executive named as defendant for lack of personal jurisdiction.","author":["Nelson Rosario","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/36453\/new-york-federal-court-allows-trademark-infringement-lawsuit-over-use-of-blockchain-io-to-proceed-in","publishDate":"2019-08-16T19:05:49","id":3111,"type":null,"title":"New York federal court allows trademark infringement lawsuit over use of &quot;blockchain.io&quot; to proceed","category":["Legal"],"content":["Onomastics is the study of proper names. A proper name is a name for a particular thing, such as, for example, Coca Cola, or Wu Tang Clan, or Boyajian’s Star.","Conversely, a common name is a name for a category of things, such as, for example, soda, rappers, and stars.","The name of a company is a proper name. Generally, you don’t want the same name as another company, because, you know, people might get confused. Also, if you are a new or smaller company and there is a bigger company out there they might not like you naming yourself after them, and they definitely won’t like it if you name yourself after them and you operate in the same industry.","And that, is how we find ourselves here, with an alleged trademark infringment lawsuit involving Blockchain Luxembourg v. Paymium.","This case was originally filed September 20, 2018, when Blockchain Luxembourg, which you may know as the company simply called Blockchain, sued Paymium for trademark infringement, unfair competition, false advertising, and a smattering of NY state law claims.","Now just hold on one second. How does a company named PAYMIUM get sued for trademark infringement by a company known as BLOCKCHAIN. Haha, oh dear reader, because Paymium did an ICO in February of 2018 rebranding themselves as Blockchain.io. Obviously.","As the plaintiff’s stated in their amended complaint “Paymium’s use of the [BLOCKCHAIN.IO] Marks is likely to cause consumers mistakenly to believe that the Paymium’s products emanate from or are otherwise associated with [Blockchain].” This is the fundamental allegation in this case, but it is not the primary purpose of the current order handed down by the court. In February of this year, the defendants filed a motion to dismiss the case for failure to state a claim, lack of personal jurisdiction, etc., which brings us to the current order.","First, in their motion the defendants tried to argue that the trademark infringement and unfair competition claims should be thrown out. It should come as no surprise that that was denied. The plaintiffs, Blockchain, managed to sufficiently argue three things that guaranteed the case will continue: 1) their marks were not inherently descriptive, 2) their marks acquired secondary meaning; and 3) the Blockchain marks and Blockchain.io marks were substantially similar enough for the case to proceed.","The plaintiffs also alleged false advertising with respect to statements that Paymium made about being hack free and offering certain atomic swaps services. They also allege that Paymium had registered its offering with the SEC. The Court found that the hack free and atomic swaps statements were not false, so the Court granted that motion.","What about the SEC statement? Here is what Paymium said in advertising materials “Paymium is pleased to announce [its] filing has been accepted and [it is] now registered with the SEC!” What did Paymium file with the SEC? A Form D. As the plaintiffs argued, and as the Court agreed, “[t]he filing of a Form D does mean that a security is ‘registered’ or that it has been in any way scrutinized or approved by the SEC.” Look, puffery and embellishment is in some respects a natural part of life and business. That said, puffery and embellishment about approval from a government entity is a one way ticket to BadTimeVille. In addition, the Court found that Blockchain plausibly alleged injury to their brand based on the false SEC statement. The Court denied this motion meaning the claim stays in the suit.","One bright spot for Paymium, in what is an otherwise grim order, is that the motion to dismiss the case against the CEO for lack of personal jurisdiction was granted. Loyal CCM readers are at this point personal jurisdiction gurus, but let’s briefly review. You have to have some connection to the place you’re getting sued in. Brief review done.","Here, as the first part of a two part test, the Court applied NY State’s Long Arm Statute to see if they could exercise jurisdiction over the CEO. In the 2nd Circuit, where the Southern District of New York is located, a corporate officer can be held personally liable if they participate or commit a tort, even if they do so as part of their role as a corporate officer. In the Court’s estimation based on the filings from the two parties, the plaintiff’s failed to sufficiently allege that the CEO was involved in the alleged activities claimed in the lawsuit. Instead, the Court felt that the plaintiff made a set of conclusory statements that didn’t met the necessary standard. A small win for the moment as this case continues.","<strong data-v-f87c67ca=\"\"><em class=\"ll\" data-v-f87c67ca=\"\">Disclaimer: Crypto Caselaw Minute is provided for educational purposes only by Nelson Rosario (@nelsonmrosario) and Stephen Palley (@stephendpalley). These summaries are not legal advice. They are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em><\/strong>"],"hashtag":[]}