{"summary":"Donald Trump&#x27;s latest NFT drop includes a chance to have dinner with the former president and score a piece of history.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267294\/trump-hawks-new-nfts-for-a-chance-to-win-a-piece-of-his-mugshot-suit","publishDate":"2023-12-12T17:46:34","id":3114,"type":null,"title":"Trump hawks new NFTs for a chance to win a piece of his mugshot suit","category":["NFT COLLECTIONS"],"content":["Former President Donald Trump is adding a twist to his latest NFT sales pitch, unveiling another set of digital trading cards that will give fans the chance to not only eat dinner with him but also score a piece of the suit he wore for his recent mugshot.","The new \"Mugshot Edition\" trading cards cost $99, and anyone who buys 47 in a single transaction ($4,653) <a href=\"https:\/\/collecttrumpcards.com\/#how-it-works\" data-v-f87c67ca=\"\">will get<\/a> both dinner with Trump and a physical trading card that includes a piece of the suit he wore when the mugshot was taken by police in Georgia after he was indicted in August.","Previous Trump NFT drops have included bonuses like <a href=\"https:\/\/www.theblock.co\/post\/201600\/new-trump-nft-collection-lets-users-buy-zoom-access-to-donald-trump\" data-v-f87c67ca=\"\">Zoom calls<\/a> and an opportunity to dine with the president at a gala dinner. Trump is calling the suit he wore \"the most historically significant artifact in United States history,\" according to the website promoting the NFT drop and bonus merchandise.","Consumers who use crypto to buy 100 trading cards in one go will get extra bonuses including a chance to attend a \"pre-gala\" cocktail reception with the former president. Besides a physical card with a piece of the suit, those buying more than 100 cards will also receive another physical card that includes a piece of the tie he wore when police photographed him.","Trading volume for Trump's first digital trading <a href=\"https:\/\/www.theblock.co\/post\/197752\/the-art-of-the-drop-trump-nfts-may-prove-the-utility-of-utility\" data-v-f87c67ca=\"\">card collection<\/a>, released in December 2022, jumped by more than 200% during the last 24 hours amid the announcement of the \"Mugshot Edition.\" While the 24-hour increase is notable, the total volume registered below $100,000, according to OpenSea data.","There are 2,024 limited-edition, physical trading cards that come with a piece of the suit, the Trump site said. The offering is being run by NFT INT LLC which \"is not owned, managed or controlled by Donald J. Trump, The Trump Organization, CIC Digital LLC or any of their respective principals or affiliates,\" according to the website.","\"NFT INT LLC uses Donald J. Trump's name, likeness and image under paid license from CIC Digital LLC, which license may be terminated or revoked according to its terms,\" the website added.","Trump has <a href=\"https:\/\/www.theblock.co\/post\/245428\/trump-hurdles-toward-crypto-whale-status-with-ethereum-wallet-worth-millions\" data-v-f87c67ca=\"\">previously been listed<\/a> as CIC Digital LLC's manager, president, secretary and treasurer, according to disclosures posted by Citizens for Responsibility and Ethics in Washington. In August, those documents showed that the former president owned up to $5 million worth of ether and has earned at least $4.9 million from NFT licensing fees.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Trump","content":"ORGANIZATION"},{"type":"$99","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Trump Organization","content":"ORGANIZATION"},{"type":"Citizens for Responsibility and Ethics","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"CIC Digital LLC","content":"ORGANIZATION"},{"type":"$4,653","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"Donald J. Trump","content":"PERSON"},{"type":"$5 million","content":"MONEY"},{"type":"August","content":"DATE"},{"type":"Trump NFT","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Georgia","content":"LOCATION"},{"type":"200%","content":"PERCENT"},{"type":"$100,000","content":"MONEY"},{"type":"Donald Trump","content":"PERSON"},{"type":"Trump","content":"PERSON"},{"type":"December 2022","content":"DATE"},{"type":"$4.9 million","content":"MONEY"},{"type":"NFT INT LLC","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}