{"summary":"A new bill was signed into law in Wyoming that would give decentralized autonomous organizations legal standing in the crypto-friendly state. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281414\/wyoming-governor-signs-into-law-a-bill-to-give-daos-legal-standing-in-the-state","publishDate":"2024-03-08T12:02:00","id":3117,"type":null,"title":"Wyoming governor signs into law a bill to give DAOs legal standing in the state","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">A new bill was signed into law in Wyoming that would give decentralized autonomous organizations legal standing in the crypto friendly state.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The bill, called the Wyoming Decentralized Unincorporated Nonprofit Association Act, dubbed DUNA, was <a href=\"https:\/\/content.govdelivery.com\/accounts\/WYGOV\/bulletins\/38f683c\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">signed<\/span><\/a> into law by Governor Mark Gordon on Thursday.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Miles Jennings, a16zcrypto general counsel, called the bill a \"major breakthrough\" on <a href=\"https:\/\/twitter.com\/milesjennings\/status\/1766095660204626343\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">Friday<\/span><\/a> on X. The venture capital fund advised on the bill and testified before the state's Senate and House committees.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Wyoming’s new law will enable blockchain projects to operate within the bounds of applicable laws without compromising their decentralization,\" Jennings posted on X.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">DAOs have met the ire of U.S. regulators over the past few years. The Commodity Futures Trading Commission notably won a case last year involving Ooki DAO after the group failed to respond. The <a href=\"https:\/\/www.theblock.co\/post\/234019\/cftc-wins-ooki-dao-case-setting-precedent-that-daos-can-be-held-liable\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">judgment<\/span><\/a> set a precedent that other DAOs could be held liable for legal violations as a \"person\" under the Commodity Exchange Act.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Wyoming's bill would give DAOs legal existence, which enables them to contract with third parties, open bank accounts, appear in court and enables them to pay taxes, Jennings said in a <a href=\"https:\/\/a16zcrypto.com\/posts\/article\/duna-for-daos\/\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">post<\/span><\/a> about the new bill.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"It accomplishes all of this without interfering with how DAOs are currently launched and operated – it safeguards decentralization and positions DAOs to effectively grow the ecosystems of their underlying blockchain networks,\" Jennings said.&nbsp;<\/span>","Sen. Cynthia Lummis, R-Wyo., who has been supportive of crypto, said the bill would provide certainty for her state.","<span class=\"s1\" data-v-f87c67ca=\"\">“I am encouraged to see this legislation advance through the Wyoming legislature,\" Lummis said in an emailed statement to The Block. \"It is a huge victory for not only the crypto asset community, but the entire state of Wyoming by providing much-needed certainty to web3 builders and it boosts our state’s economy.\"&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">The Securities and Exchange Commission often invokes the <a href=\"https:\/\/www.theblock.co\/learn\/251857\/are-cryptocurrencies-securities\" data-v-f87c67ca=\"\">Howey Test<\/a>, <\/span><span class=\"s5\" data-v-f87c67ca=\"\">which is based on a 1946 U.S. Supreme Court case frequently cited by the SEC to determine if an asset qualifies as a security. The test says an asset has to have three components — &nbsp;an investment of money in a common enterprise with a reasonable expectation of profits to be derived from the efforts of others.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Jennings said DUNA bolsters arguments that the third component of Howey is not satisfied, in part because DUNA is an \"inherently decentralized entity\" and doesn't have a management function, such as officers and directors.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"While SEC theories about the applicability of U.S. securities laws to digital asset transactions are amorphous and constantly changing, the fact remains that they are bound by the Howey case law and its progeny. Under that case law, adoption of a DUNA can be used by a DAO to bolster its community’s arguments against the application of securities laws to the digital assets of that DAO,\" Jennings said.<\/span>","<em data-v-f87c67ca=\"\">Updated at 4:45 p.m. ET to include comments from Sen. Lummis<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Jennings","content":"PERSON"},{"type":"DUNA","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"1946","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Ooki DAO","content":"ORGANIZATION"},{"type":"Lummis","content":"PERSON"},{"type":"Wyoming Decentralized Unincorporated Nonprofit Association","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Cynthia Lummis","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"U.S. Supreme Court","content":"ORGANIZATION"},{"type":"Wyo.","content":"LOCATION"},{"type":"Mark Gordon","content":"PERSON"},{"type":"Wyoming","content":"LOCATION"},{"type":"House","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"4:45 p.m.","content":"TIME"},{"type":"Howey","content":"PERSON"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":["CFTC","SEC"],"authors":["Sarah Wynn","The Block"]}