{"summary":"Despite the market downturn and many layoffs in the industry, some crypto firms are continuing to add new jobs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/152935\/companies-list-hundreds-of-new-crypto-jobs-despite-recent-layoffs","publishDate":"2022-06-18T08:47:18","id":3118,"type":null,"title":"Companies list hundreds of new crypto jobs despite recent layoffs","category":["COMPANIES"],"content":["Business firms are opening up hundreds of job vacancies pertaining to blockchain and cryptocurrency amid mass layoff in the crypto space in recent months.","Large and small companies have posted over 500 crypto-related jobs in the last seven days, according to a new analysis from <a href=\"https:\/\/cryptojobslist.com\/\" data-v-f87c67ca=\"\">cryptojobslist.com<\/a>. The website looked at the job listings posted on jobs board Indeed to identify open positions in the crypto industry.","Deloitte, the multinational professional services provider based in London, advertised the most positions with 144 new listings in the past seven days. The UK company is followed by Block Inc., a financial tech company founded by former Twitter CEO Jack Dorsey, which posted 59 positions. Most of the jobs advertised are remote positions.","Cryptojobslist.com also highlighted that there were 569 crypto-related jobs posted on Indeed last week, compared to 388 new jobs listed in the previous week. “[The new job listings] show that prolific companies are seeing the long-term value of cryptocurrency,” a spokesperson from Cryptojobslist.com said in the statement.","On Wednesday, Binance exchange CEO Changpeng Zhao <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1537013824666095617?s=20&amp;t=V_ADbUQFmKUumq2A06Tvvw\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">announced<\/span><\/a> on Twitter that the company is hiring for 2,000 open positions. “It was not easy saying no to Super Bowl ads, stadium naming rights, large sponsor deals a few months ago, but we did,” Zhao said in the <a href=\"https:\/\/twitter.com\/cz_binance\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">tweet<\/span><\/a>.","Numerous firms have publicly laid off more than <a href=\"https:\/\/www.theblock.co\/post\/152059\/crypto-firms-have-laid-off-more-than-1500-people-in-the-last-two-months-as-downturn-fears-persist\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">1,500 people<\/span><\/a> since earlier this spring when the crypto market entered an extended drawdown. Publicly traded crypto exchange Coinbase cut the most employees, announcing on June 14 a layoff of around 1,100 people.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Binance exchange CEO Changpeng Zhao","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"London","content":"LOCATION"},{"type":"earlier this spring","content":"DATE"},{"type":"June 14","content":"DATE"},{"type":"Block Inc.","content":"ORGANIZATION"},{"type":"Zhao","content":"PERSON"},{"type":"Jack Dorsey","content":"PERSON"}],"hashtag":["BINANCE","COINBASE"],"authors":["Kharishar Kahfi","The Block"]}