{"summary":"Crypto exchanges Binance and WazirX have jointly set up a $50 million token fund to invest in Indian blockchain startups\nThe fund is backed by Binance’s native tokens BNB and BUSD, and WazirX’s WRX token\nWazirX founder and CEO Nischal Shetty told The Block that since it’s a token fund, it would not invest in startups via cash","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/58921\/binance-wazirx-launch-50m-token-fund-to-invest-in-indian-blockchain-startups","publishDate":"2020-03-17T02:30:27","id":3119,"type":null,"title":"Binance, WazirX launch $50M token fund to invest in Indian blockchain startups","category":["Exchanges"],"content":["Cryptocurrency exchanges Binance and WazirX have jointly set up a $50 million token fund to invest in Indian blockchain startups.","The fund, dubbed “<a href=\"https:\/\/www.binance.com\/en\/blog\/421499824684900463\/Binance-and-WazirX-announce-USD-50M-Blockchain-for-India-Fund-to-foster-the-growth-of-the-Indian-startup-ecosystem\" data-v-f87c67ca=\"\">Blockchain for India<\/a>,” is backed by Binance’s native tokens BNB and BUSD, and WazirX’s WRX token.","It’s a token fund, meaning it would not invest in startups via cash, WazirX founder and CEO Nischal Shetty told The Block. WazirX is <a href=\"https:\/\/www.theblockcrypto.com\/post\/47852\/binance-acquires-indian-crypto-exchange-wazirx-to-serve-over-1-billion-people-of-the-country\" data-v-f87c67ca=\"\">owned<\/a> by Binance, since their million-dollar deal last November.","The fund comes weeks after the Supreme Court of India <a href=\"https:\/\/www.theblockcrypto.com\/post\/57708\/indias-supreme-court-strikes-down-rbis-banking-ban-against-crypto\" data-v-f87c67ca=\"\">struck down<\/a> a circular issued by the Reserve Bank of India (RBI), which banned banks from dealing in crypto transactions.","“Due to the previous banking ban, India has been behind the rest of the world by two years, and we want to help expedite and bootstrap the ecosystem. This fund is a step in that direction,” Shetty told The Block.","“We want to encourage, help and provide resources, connections, and knowledge to all the entrepreneurs who want to build solutions in the crypto and blockchain domains,” he added.","<strong data-v-f87c67ca=\"\">Fund details<\/strong>","The fund will make investments in both equity and tokens, ranging from $100,000 to $5 million. The selected startups will also get direct access to Binance’s blockchain infrastructure, as well as mentorship support.","Binance and Wazir look to invest in startups focused on fiat-to-crypto gateway solutions, payment and remittance providers, and decentralized finance (DeFi) platforms, among other areas.","“Let’s invest in India,” said Binance CEO Changpeng “CZ” Zhao, <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1239764141776101382?s=20\" data-v-f87c67ca=\"\">adding<\/a>: “I foresee many other blockchain companies following our footsteps.”","Earlier this week, Indian crypto exchange CoinDCX also announced a $1.3 million fund called “TryCrypto” to promote awareness and adoption of cryptocurrencies within the country.","“Only 5 million people in India currently hold cryptocurrencies—less than 0.5% of the population. We believe, however, that by educating consumers and combating negative preconceptions of the industry we can boost the number from 5 million to 50 million,” CoinDCX co-founder and CEO Sumit Gupta said at the time.","<strong data-v-f87c67ca=\"\">Regulatory uncertainty<\/strong>","While the RBI’s banking ban for crypto has been lifted, India’s biggest banks are yet to begin servicing crypto exchanges, <a href=\"https:\/\/www.theblockcrypto.com\/daily\/58000\/indias-biggest-banks-weigh-their-options-hold-off-on-servicing-crypto-firms-in-wake-of-supreme-court-ruling\" data-v-f87c67ca=\"\">as The Block reported<\/a> earlier this month.","The RBI itself is also reportedly planning to file a <a href=\"https:\/\/www.theblockcrypto.com\/post\/57987\/indias-central-bank-plans-to-file-a-review-petition-on-supreme-courts-crypto-ruling-report\" data-v-f87c67ca=\"\">review petition<\/a> to overturn the Supreme court’s ruling.","Overall, India is still awaiting regulatory clarity for the crypto sector. The country’s government had been deliberating on the “Banning of Cryptocurrency and Regulation of Official Digital Currency <a href=\"https:\/\/www.prsindia.org\/sites\/default\/files\/bill_files\/Draft%20Banning%20of%20Cryptocurrency%20%26%20Regulation%20of%20Official%20Digital%20Currency%20Bill%2C%202019.pdf\" data-v-f87c67ca=\"\">Bill<\/a> 2019” since February last year. The bill seeks to ban all cryptocurrencies.","“There’s a lot more work ahead of us in terms of clearing the regulatory uncertainty. We need to spread the right education,” Shetty told The Block."],"hashtag":["BINANCE","BNB","BUSD"]}