{"summary":"The research division of Morgan Stanley, one of the major investment banks, released a new 50-page report titled: “Update: Bitcoin, Cryptocurrencies and","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/2578\/morgan-stanley-releases-a-report-looking-at-the-current-state-of-cryptocurrencies","publishDate":"2018-11-01T09:49:13","id":312,"type":null,"title":"Morgan Stanley report: The bitcoin thesis is &#x27;rapidly morphing&#x27;, cryptos highly correlated","category":["CRYPTOCURRENCY"],"content":["<span data-v-f87c67ca=\"\">The research division of Morgan Stanley, one of the major investment banks, <a href=\"https:\/\/ny.matrix.ms.com\/eqr\/article\/webapp\/rf\/renditionpdf\/PublishedContent3\/2018\/10\/31\/Documents\/Crypto.PDF\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">released a new 50-page report<\/a> titled: “Update: Bitcoin, Cryptocurrencies and Blockchain” on Wednesday. The new report is an update to the first version titled “Bitcoin Decrypted: A Brief Teach-in and Implications”, which was released at the peak of the bubble in December. Morgan Stanley has been researching cryptocurrency and blockchain for quite some time; it already released 15 research reports with the oldest one dating to May 2017.<\/span>","<span data-v-f87c67ca=\"\">Morgan Stanley starts off the report by noting that bitcoin’s thesis has been “rapidly morphing”. It details the perceived change in narratives, which started as digital cash, moved to store of value, and is now an institutional investment class.<\/span>","","","<span data-v-f87c67ca=\"\">The report then shows high correlation between the price of cryptocurrencies and the trading volumes. It notes that bitcoin is now increasingly traded against digital assets now -- 52% is traded against crypto pairs while 48% is traded against fiat pairs.<\/span>","","","<span data-v-f87c67ca=\"\">Morgan Stanley notes that the realized volatility of bitcoin has fallen to the lowest level since the start of 2017 while the cross correlation with other cryptocurrencies stays high. Morgan Stanley speculates that the price stability comes as “markets wait for the next technological development that increases adoption of the underlying asset or derivative.”<\/span>","","","<span data-v-f87c67ca=\"\">The report finds an interesting correlation between Bitcoin’s crash in 2018 and Nasdaq’s crash in 2000 and asks “whether the bear market is coming to an end in the way the Nasdaq’s did”.<\/span>","","","<span data-v-f87c67ca=\"\">Next, the report has a section about the recent rise of stablecoins. It says: “Similar to the FX world, not all stablecoins will survive so we watch for ones with the lowest transaction costs, highest liquidity and defined regulatory structure which will all increase adoption.” It also has a graphic showing different types of stablecoins and their market share.<\/span>","","","&nbsp;","<span data-v-f87c67ca=\"\">Morgan Stanley says that valuation losses of ether caused ICOs to liquidate into USD, which further increased the downward pressure on ether. <\/span>","","","<span data-v-f87c67ca=\"\">The report also points out that capital raised by ICOs has been continuously decreasing in 2018 and that approximately 32% of ICOs failed after raising money $1.3bn in 2017. According to Morgan Stanley, approximately 64% of ICOs failed before or after their ICOs in 2017, which is a higher failure rate than seen among startups in the first year (25%). Morgan Stanley thinks that the next development to watch is the creation of security token offerings or regulated ICOs.<\/span>","","","","","&nbsp;","","","","&nbsp;","<span data-v-f87c67ca=\"\">The report says that Bitcoin’s thesis as digital cash didn’t work out because:<\/span>","<span data-v-f87c67ca=\"\">Morgan Stanley argues against Bitcoin’s limited supply of 21M because “anybody can create a “hard fork” of the open source code, which in turn can create a new currency for those that already hold Bitcoin. We view these hard forks as being like stock splits or new class creations.” Morgan Stanley adds that “unlike a stock split, the fork is not lowering the price per Bitcoin”.<\/span>","<span data-v-f87c67ca=\"\">The report says that Bitcoin is failing as a payment system for underbanked because financial inclusion is of increasing priority for payment providers. It gives an example of the QR-based payment schemes in India, which shows “that reaching the underbanked can be done much less expensively than Bitcoin”. Moreover, it goes on to say that there is virtually no acceptance among US eCommerce merchants.<\/span>","","","<span data-v-f87c67ca=\"\">Investment Banks’ response to Bitcoin has been limited so far:<\/span>","","","&nbsp;","<span data-v-f87c67ca=\"\">Morgan Stanley thinks that the current investment thesis is the institutional development. Morgan Stanley cites CryptoFundResearch, which is tracking cryptocurrency fund AUM. In July 2016, the crypto fund AUM was $380Mn while two years later, the AUM is $6.11bn. <\/span>","<span data-v-f87c67ca=\"\">The types of these funds are:<\/span>","<span data-v-f87c67ca=\"\">The location of these funds is: <\/span>","","","<span data-v-f87c67ca=\"\">The report summarizes this year’s institutional developments in the following slide:<\/span>","","","<span data-v-f87c67ca=\"\">It says that from their client conversations they found three major obstacles preventing large scale investment in the cryptocurrency space:<\/span>","&nbsp;","<span data-v-f87c67ca=\"\">This sections starts by saying that Bitcoin and Environmentalism is mutually exclusive because Bitcoin’s electricity consumption is currently that of 3-4 million US homes. It also says that it’s predictable that ASIC miners fall in prices, which drives electricity use higher.<\/span>","","","&nbsp;","<span data-v-f87c67ca=\"\">The report says that cryptocurrency activity is driven by regulation and that the exchanges are moving to regulatory friendly jurisdictions such as Malta, Belize and Seychelles. Morgan Stanley thinks that regulators are now watching closely in the US, Europe and Asia. According to Morgan Stanley, the most cryptocurrency exchanges are based in the UK followed by Hong Kong. <\/span>","","","&nbsp;","<span data-v-f87c67ca=\"\">Blockchain works best for:<\/span>","&nbsp;","<strong data-v-f87c67ca=\"\">Banks testing blockchain:<\/strong>","","","&nbsp;","<strong data-v-f87c67ca=\"\">Use Cases by Banks:<\/strong>","","","&nbsp;","<strong data-v-f87c67ca=\"\">Use Cases by Corporates:<\/strong>","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2017","content":"DATE"},{"type":"$1.3","content":"MONEY"},{"type":"32%","content":"PERCENT"},{"type":"64%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"USD","content":"ORGANIZATION"},{"type":"Asia","content":"LOCATION"},{"type":"52%","content":"PERCENT"},{"type":"Europe","content":"LOCATION"},{"type":"AUM","content":"ORGANIZATION"},{"type":"$380Mn","content":"MONEY"},{"type":"25%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"Morgan Stanley","content":"ORGANIZATION"},{"type":"May 2017","content":"DATE"},{"type":"July 2016","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"2000","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Belize","content":"LOCATION"},{"type":"$6.11","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"Seychelles","content":"LOCATION"},{"type":"ICOs","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Malta","content":"LOCATION"},{"type":"48%","content":"PERCENT"},{"type":"India","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":[],"authors":["Larry Cermak","The Block"]}