{"summary":"Morgan Stanley has co-led a $48 million Series B round for blockchain firm Securitize.\nThis is Morgan Stanley’s first investment in the blockchain space.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/109113\/morgan-stanley-invests-blockchain-securitize","publishDate":"2021-06-21T07:47:08","id":3123,"type":null,"title":"Morgan Stanley co-leads $48 million Series B for blockchain firm Securitize","category":["Layer 1s"],"content":["Blockchain firm Securitize, which provides asset tokenization services, has raised $48 million in a Series B funding round.","<a href=\"https:\/\/www.prnewswire.com\/news-releases\/securitize-raises-48-million-in-series-b-capital-to-expand-its-leadership-in-digital-asset-securities-and-in-the-digitization-of-private-capital-markets-301316112.html\" data-v-f87c67ca=\"\">The round<\/a> was co-led by Morgan Stanley and Blockchain Capital. Specifically, Morgan Stanley Tactical Value Investing, a team within Morgan Stanley Investment Management, invested in Securitize.","As part of the deal, Pedro Teixeira, co-head of Morgan Stanley Tactical Value Investing, has joined Securitize's board of directors.","This is Morgan Stanley's first venture capital investment in the blockchain space, according to Teixeira. \"We make long-term investments in businesses and asset classes that are ahead of the curve,\" said Teixeira. \"Our investment in Securitize is a sign that we believe in the growth and adoption of digital asset securities.\"","Several other investors, both new and existing, also participated in Securitize's Series B round. New investors included Sumitomo Mitsui Trust Bank, Japan's largest trust bank, Ava Labs, IDC Ventures, Migration Capital, and NTT Data, a Japanese IT company. Existing investors, including Ripple and Blockchain Ventures, also participated in the round.","The raise comes as the firm is developing a marketplace called Securitize Markets for the trading of digital asset securities. The marketplace, expected to launch in the coming months, aims to provide liquidity for the private capital markets.","Founded in 2017, U.S.-based Securitize allows private companies to raise capital by issuing digital securities through its blockchain-based platform. Securitize says more than 150 companies have used its platform to date and have raised funds from over 300,000 investors. The firm also manages an asset management unit called Securitize Capital, which offers <a href=\"https:\/\/www.prnewswire.com\/news-releases\/securitize-announces-launch-of-securitize-capital-with-two-cryptocurrency-yield-funds-301300168.html\" data-v-f87c67ca=\"\">two cryptocurrency yield funds<\/a>. The funds — bitcoin and USDC yield funds — provide accredited and institutional investors exposure to cryptocurrencies and decentralized finance (DeFi) in the form of digital asset securities.","The Series B round brings Securitize's total funding to date to $87.5 million. The firm has <a href=\"https:\/\/www.theblockcrypto.com\/linked\/54864\/sony-financial-ventures-invests-six-figure-sum-in-token-tech-firm-securitize\" data-v-f87c67ca=\"\">previously<\/a> raised a total of $39.5 million in various rounds, according to <a href=\"https:\/\/www.crunchbase.com\/organization\/securitize-inc\" data-v-f87c67ca=\"\">Crunchbase.<\/a>"],"hashtag":["SERIES B"]}