{"summary":"Rep. Hill is feeling optimistic about his crypto bills in 2024 and said he is open to hearing Democrats&#x27; views on illicit finance.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275004\/republican-french-hill-says-hes-optimistic-about-prospect-for-new-crypto-legislation-in-2024","publishDate":"2024-01-29T17:44:04","id":3128,"type":null,"title":"Republican French Hill says he&#x27;s optimistic about prospect for new crypto legislation in 2024","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Top Republican Rep. French Hill said he is feeling optimistic about the prospects of a bill to regulate stablecoins and another focused on market structure in 2024. He's also open to hearing views from top Democrats about illicit finance.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The Arkansas Republican spoke about the Clarity for Payment Stablecoins Act and the Financial Innovation and Technology for the 21st Century Act, both of which advanced out of the House Financial Services Committee last year, during an event on Monday hosted by the Foundation for Defense Democracies.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"I still am optimistic that you'll see those bills come to fruition during 2024,\" Hill said during a panel discussion. \"I've been very pleased with every meeting I've been in, both bipartisan as well as in the administration on those, but there's a timing issue, and you know, timing is everything in politics, but when you have so many things on our plate, we're all navigating that.\"<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Hill leads the House Financial Services Committee's digital assets focused panel and has <a href=\"https:\/\/www.theblock.co\/post\/216600\/rep-hill-says-he-plans-to-work-with-house-agriculture-on-crypto-legislation\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">worked<\/span><\/a> on legislation with the committee's chair, Patrick T. McHenry, R-N.C. That committee advanced two bills during the summer that would regulate stablecoins at the federal level and take a comprehensive approach to crypto's market structure.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">After advancing those bills, Hill said they took every amendment or suggestion and worked that into the texts in the fall.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"We finished the end of calendar 2023 with what I think is a very good working draft of the fit for purpose regulatory framework bill, and we continue to engage with our colleagues on the other side of the aisle and in the administration and in the regulatory environment — how to craft the best outcome on the stablecoin bill,\" Hill said.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Anti-money laundering and alleged terrorist financing involving crypto has been at the forefront of concerns held by some lawmakers as well as the Biden Administration. Sen. Elizabeth Warren, D-Mass., has pushed for a bill over the past year that would aim to extend Bank Secrecy Act requirements including know-your-customer rules to miners, validators, wallet providers and others.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Senate Banking Committee Chair Sen. Sherrod Brown, D-Ohio, who would be instrumental in advancing the House's crypto bills, has said he is in talks about a bill that would target the use of digital assets for money laundering, according to <a href=\"https:\/\/subscriber.politicopro.com\/article\/2024\/01\/brown-lines-up-anti-money-laundering-legislation-00136114\" data-v-f87c67ca=\"\"><span class=\"s4\" data-v-f87c67ca=\"\">Politico<\/span><\/a>.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Hill told reporters after Monday's panel that he, McHenry and others are working to&nbsp;<\/span><span class=\"s2\" data-v-f87c67ca=\"\">\"find a place where we can provide features either in the two bills we have or in another bill that addresses members' concerns about illicit finance that are not already dealt with.\"<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"We dealt with those in the amendments and in the drafting of both the stablecoin bill and the fit for purpose bill, but to the extent Sen. Brown and Sen. Warren are looking for something constructive there that the Treasury supports, the Biden administration supports, and that we could have support for in the House, we're happy to listen to that,\" Hill said.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Hill also confirmed to a reporter that there is an AML provision in the market structure text.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span><\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"fall","content":"DATE"},{"type":"Warren","content":"PERSON"},{"type":"Foundation for Defense Democracies","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Sherrod Brown","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Hill","content":"PERSON"},{"type":"Brown","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"AML","content":"ORGANIZATION"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"Elizabeth Warren","content":"PERSON"},{"type":"Politico","content":"LOCATION"},{"type":"Mass.","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Ohio","content":"LOCATION"},{"type":"Biden Administration","content":"ORGANIZATION"},{"type":"French Hill","content":"PERSON"},{"type":"House","content":"ORGANIZATION"},{"type":"Patrick T. McHenry","content":"PERSON"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Senate Banking Committee Chair","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"Biden","content":"PERSON"},{"type":"McHenry","content":"PERSON"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}