{"summary":"Bitfinex, the cryptocurrency exchange, responded to brutal rumors surrounding its business in a blog post Sunday.  In recent weeks, rumors emerged that","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/1325\/bitfinex-is-not-insolvent-crypto-exchange-giant-bitfinex-responds-to-recent-rumors-in-new-blog-post","publishDate":"2018-10-07T13:39:43","id":3129,"type":null,"title":"&#x27;Bitfinex is not insolvent:&#x27; Crypto exchange giant Bitfinex responds to recent rumors in new blog post","category":["EXCHANGES"],"content":["Bitfinex, the cryptocurrency exchange, responded to brutal rumors surrounding its business in a blog post Sunday.&nbsp;","In recent weeks, rumors emerged that Bitfinex, and its affiliated firm Tether, could face insolvency amid reports that its reported banking partner Noble International was no longer working with the firm.","Bitfinex has had a long and winding banking history.&nbsp;In April 2017, a banking relationship between Wells Fargo and Bitfinex ended, according to media reports. Bitfinex then moved its business to Noble International later in the year. But that relationship has also ended in recent months as Noble grips with the possibility of going out of business. On Saturday,&nbsp;<em data-v-f87c67ca=\"\">The Block&nbsp;<\/em>reported the firm might possibly be banking with HSBC.&nbsp;","Meanwhile, unverified accounts of Bitfinex's insolvency have emerged on Medium, with many folks tying Noble Bank's troubles to systemic issues with Bitfinex and Tether, the company behind the stable coin of the same name.&nbsp;","Bitfinex threw cold water on those accounts, saying \"Bitfinex is not insolvent, and a constant stream of Medium articles claiming otherwise is not going to change this.\"","\"As one of only a very few exchanges operating since 2013, with a small team and low operating costs, we do not entirely understand the arguments that purport to show us to be insolvent without providing any explanation about why,\" the firm added.&nbsp;","At the end of the blog, the firm distanced itself from Noble, saying \"stories and allegations currently circulating mentioning an entity called Noble Bank have no impact on our operations, survivability, or solvency.\"","The exchange’s banking relationships have been closely scrutinized, due to its close relationship with the Tether stablecoin. The two entities share common management and investors and much of Tether’s volume is transacted with Bitfinex. Tether is viewed by many as systemically important to the cryptocurrency ecosystem due to its large volumes relative to other cryptocurrency trading pairs and its potential&nbsp;<a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2018-06-13\/professor-who-rang-vix-alarm-says-tether-used-to-boost-bitcoin\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">role in cryptocurrency price manipulation<\/a>. There have been numerous questions historically about whether Tether is fully collateralized in the face of a reluctance by the cryptocurrency&nbsp;<a href=\"https:\/\/www.coindesk.com\/tether-review-claims-crypto-asset-fully-backed-theres-catch\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">to release fully transparent audits<\/a>.","As per data from CoinMarketCap, Bitfinex saw $147 million worth of trading volumes over the last 24-hours.&nbsp;","<a href=\"https:\/\/medium.com\/@Bitfinex\/a-response-to-recent-online-rumours-677de7c4d171?source=rss------bitcoin-5\" data-v-f87c67ca=\"\">Read the full blog post, here.&nbsp;<\/a>","<em data-v-f87c67ca=\"\">Mike Dudas contributed reporting.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"Mike Dudas","content":"PERSON"},{"type":"HSBC","content":"ORGANIZATION"},{"type":"Noble Bank","content":"ORGANIZATION"},{"type":"Wells Fargo","content":"ORGANIZATION"},{"type":"Bitfinex","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"Bitfinex","content":"ORGANIZATION"},{"type":"last 24","content":"DATE"},{"type":"Noble International","content":"ORGANIZATION"},{"type":"April 2017","content":"DATE"},{"type":"$147 million","content":"MONEY"},{"type":"Noble","content":"ORGANIZATION"},{"type":"Saturday","content":"DATE"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}