{"summary":"There is a substantial premium of over $2,000 on bitcoin futures contracts on Binance that are set to expire at the end of March.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/269927\/bitcoin-futures-show-clear-bullish-indicator-for-spring-2024-analyst-says","publishDate":"2024-01-03T06:39:43","id":3131,"type":null,"title":"Bitcoin futures show &#x27;clear bullish indicator&#x27; for Spring 2024, analyst says","category":["MARKETS"],"content":["When futures contracts trade at a higher value than the current spot price, this is termed contango. This condition suggests the market anticipates an appreciation in the asset’s price before the expiration date of the futures contract, which, in this case, is Friday, March 29.","YouHodler Head of Markets Ruslan Lienkha described the current contango as “a clear bullish indicator” for Bitcoin. He added that institutional investors are hedging the Bitcoin price using futures and expect further growth following the possible approval of multiple <a href=\"https:\/\/www.theblock.co\/post\/269881\/bitcoin-price-spike-above-45800-caused-over-73-million-in-short-liquidations\" data-v-f87c67ca=\"\">spot Bitcoin ETFs<\/a>. \"Institutional investors are accepting the current price for their future bitcoin purchases and are ready to pay more to fixate the current price for future asset purchases,\" Lienkha told The Block.","<span data-v-f87c67ca=\"\">The current premium on bitcoin futures for the next quarterly expiry is trading at over $2,000 above the index price. Image: Binance Futures.<\/span>","In an interview, Bitnomial exchange President Michael Dunn said \"the large premium in futures is usually a bullish indicator, signaling a strong leveraged buy-side interest.\"","\"It’s important to note the possibility of liquidity issues on the sell-side, since low-risk premiums can be earned by selling longer-dated futures against spot bitcoin,\" Dunn added.","The heightened premium on Bitcoin futures contracts is evident in data from The Block, which also indicates that the market is factoring in an anticipated increase in the price of BTC by the end of March.","According to <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/futures\/btc-annualized-basis-binance\" data-v-f87c67ca=\"\">The Block’s Data Dashboard<\/a>, Bitcoin’s futures basis—the difference between the spot price of an asset and the future price of the same asset—has increased to an all-time high. Using <a href=\"https:\/\/www.binance.com\/en\/delivery\/BTCUSD_QUARTER\" data-v-f87c67ca=\"\">data<\/a> from Binance Futures contracts for the end of March quarterly expiry date, the BTC annualized daily basis is now over 20%. \"When the basis is increasing, it suggests that the market expects the spot price to rise,\" Deribit Chief Commercial Officer Luuk Strijers told The Block.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dunn","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"March 29","content":"DATE"},{"type":"Ruslan Lienkha","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Bitnomial","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"$2,000","content":"MONEY"},{"type":"Binance Futures","content":"ORGANIZATION"},{"type":"Michael Dunn","content":"PERSON"},{"type":"The Block’s Data Dashboard","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"}],"hashtag":["BINANCE","BITCOIN","CRYPTO MOVERS","ETHEREUM","SEC","SOLANA"],"authors":["Brian McGleenon","The Block"]}