{"summary":"Declines in monthly NFT marketplace volume continued last month as the industry entered Q3 mired in the bear market.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/160506\/july-nft-data-wrap-investor-interest-in-gaming-nfts-continued-despite-market-downturn","publishDate":"2022-08-01T13:49:55","id":3132,"type":null,"title":"July NFT data wrap: Investor interest in gaming, NFTs continued despite market downturn","category":["GAMING AND METAVERSE"],"content":["Declines in monthly NFT marketplace volume <a href=\"https:\/\/www.theblock.co\/post\/160378\/nft-marketplace-volumes-fell-further-this-month\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">continued last month<\/a> as the industry entered Q3 mired in the bear market.","But while retail may be down, there are signs from reports on Q2 investments that blockchain gaming and NFT projects were not as deeply affected by the downturn as other areas of crypto.&nbsp;","Interest among <a href=\"https:\/\/www.theblockresearch.com\/an-overview-of-the-most-active-blockchain-investors-in-q222-157820\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">investors for gaming and NFT projects<\/a> is not easing despite the market downturn, Blockchain gaming accounted for 47% of investments from the top 10 most active crypto investors — among them Coinbase Ventures, a16z and Dragonfly Capital — in Q2 of 2022.","","","Out of 694 blockchain-related investment deals, 258 were related to NFTs and gaming, and represent a combined value of $2.6 billion, according to The Block Research.","“On average, NFTs\/Gaming vertical proportionally take up almost half of all the most active deals, and, at least relatively, the interest in the blockchain gaming sector is not easing,” said The Block researcher Edvinas Rupkus.","","","Gaming accounted for 1.1 million Unique Active Wallets (UAW), or 52%, in Q2, according to a <a href=\"https:\/\/dappradar.com\/blog\/dappradar-x-bga-games-report-q2-2022\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">July report<\/a> from Dapp Radar.","Monthly NFT marketplace volumes on Ethereum are down this month by 26% to a total of $678 million compared to last month's $884.68 million in volume.","But NFTfi is bucking the trend, hitting nearly a record high in ETH volume last month. NFTfi offers lending in wETH of DAI through collateralizing NFTs from popular collections and doesn’t appear to have suffered so far in the recent NFT trading volumes collapse.","","","However, it should be noted things look a little different when the volume is shown in USD.","","","Layer-1s are competing to become the go-to gaming hub — and <a href=\"https:\/\/www.theblockresearch.com\/gala-games-permissioned-gaming-blockchain-156822\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">BNB Chain is in the lead<\/a> by a long shot. Ethereum’s gas fee issues are causing the proliferation of more and more layer-1 chains offering NFT and gaming project-specific solutions. &nbsp;","","","Splinterlands was the top game app of Q2 with 283k daily average unique active wallets, according to the Dapp Radar report. It is followed by Alien Worlds (188k), Farmers World (124k), Upland (45k), Axie Infinity (33k), Second Live (30k), Gameta (19k), MOBOX: NFT Gamer (19k), Mining Network (16k) and Pegaxy (16k).","However, Splinterlands is down 16% compared to last quarter, most likely due to the effect of reward structure changes including disincentivizing log-in rewards and overreliance on starter cards.","“These changes have flushed many low-effort participants and cut deep into the percentage of users who relied heavily on the free aspect of the game. The present community reflects the active player base for the dapp,” noted Dapp Radar.","The once-top blockchain game Axie Infinity is attempting to change its fortunes following the Ronin hack and the severe drop in its Smooth Love Potion token’s value earlier this year with the release of Axie: Origin and a complete revamp of the game.","Facebook\/Meta is still the primary association for the metaverse among many people, according to a&nbsp;<a href=\"https:\/\/drive.google.com\/file\/d\/1OpUmzI-Vknl6ukHDcHOEpWS6D1hb7MSO\/view\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">survey<\/a> of 1,000 US-based gamers by IT company Globant and YouGov.","When asked about companies associated with the metaverse, 73% named Facebook\/Meta, 27% Epic Games and Fortnite, 21% Roblox, 15% The Sandbox, and 10% Niantic.","Just over half of the gamers believed the metaverse would change the video game industry and just four in 10 say the buzz around metaverse gaming is warranted.","And while advertisers and marketers are queuing up to partner with metaverse and NFT projects, potential players are less enthused. A total of 35% said they were comfortable with advertising in a metaverse space versus 40% who were uncomfortable with it.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$884.68 million","content":"MONEY"},{"type":"Dapp Radar","content":"ORGANIZATION"},{"type":"Edvinas Rupkus","content":"PERSON"},{"type":"10%","content":"PERCENT"},{"type":"July","content":"DATE"},{"type":"DAI","content":"ORGANIZATION"},{"type":"52%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"47%","content":"PERCENT"},{"type":"35%","content":"PERCENT"},{"type":"27%","content":"PERCENT"},{"type":"15%","content":"PERCENT"},{"type":"UAW","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Meta","content":"ORGANIZATION"},{"type":"21%","content":"PERCENT"},{"type":"USD","content":"LOCATION"},{"type":"73%","content":"PERCENT"},{"type":"Splinterlands","content":"PERSON"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"16%","content":"PERCENT"},{"type":"US","content":"LOCATION"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"26%","content":"PERCENT"},{"type":"$678 million","content":"MONEY"},{"type":"$2.6 billion","content":"MONEY"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}