{"summary":"The Uniswap website is only pulling up a blank page when loaded, with the team blaming a routing problem with internet infrastructure provider Cloudflare.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/187963\/uniswap-website-goes-dark-for-some-users-after-cloudflare-routing-problem","publishDate":"2022-11-17T07:07:45","id":3133,"type":null,"title":"Uniswap website goes dark for some users after Cloudflare routing problem","category":["CRYPTO ECOSYSTEMS"],"content":["Uniswap, the biggest decentralized exchange (DEX) for crypto, is suffering an outage affecting some users caused by a routing problem at internet infrastructure firm Cloudflare.","The Uniswap <a href=\"https:\/\/app.uniswap.org\/#\/swap\" data-v-f87c67ca=\"\">website<\/a> currently loads as a blank page when opened by some users — while others appear unaffected. Users have reported that the issue has been ongoing for more than four hours as of the time of publishing. The project’s official Discord addressed the issue, blaming Cloudflare, a tool that enables secure connections on the internet.","In a Reddit post, the Uniswap team <a href=\"https:\/\/www.reddit.com\/r\/UniSwap\/comments\/yxn2m4\/if_you_are_having_trouble_accessing_appuniswaporg\/\" data-v-f87c67ca=\"\">advised<\/a> users to connect to the protocol via its IPFS <a href=\"https:\/\/bafybeias77hrdbrsalgbx6ti2fhrmq3yvwuymt4lrnvhjgdwlbl4efdrni.ipfs.dweb.link\/\" data-v-f87c67ca=\"\">link<\/a>. IPFS stands for interplanetary file system and is a decentralized file storage protocol that powers connections on peer-to-peer networks.","The problem does not yet seem to have a negative impact on the protocol's trading volume. <a href=\"https:\/\/info.uniswap.org\/#\/\" data-v-f87c67ca=\"\">Data<\/a> from Uniswap shows 24-hour trading volume is up 14%, with $269 million in trades completed today.","Other DEXes and DEX aggregators do not seem to be affected by the same issue. Platforms like SushiSwap, Kyber and 1inch have their front-end websites operating normally as of the time of publishing.","Uniswap is not the first crypto protocol to suffer issues with its front end due to a Cloudflare outage. A similar problem <a href=\"https:\/\/www.theblock.co\/linked\/153171\/crypto-exchanges-hit-by-cloudflare-web-outage\" data-v-f87c67ca=\"\">affected many centralized exchanges<\/a> — including FTX, Bitfinex and OKX — earlier this year. Coinbase and CoinMarketCap were also hit by the same issue in July 2019.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DEX","content":"ORGANIZATION"},{"type":"Reddit","content":"LOCATION"},{"type":"14%","content":"PERCENT"},{"type":"July 2019","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"$269 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["DEXS","UNISWAP"],"authors":["Osato Avan-Nomayo","The Block"]}