{"summary":"Coinbase has called on users to convert their Tether stablecoins to the stablecoin it cofounded, USD Coin — while waiving fees for doing so.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193564\/stablecoin-wars-coinbase-tether-usdc","publishDate":"2022-12-09T05:58:57","id":3138,"type":null,"title":"Stablecoin wars heat up as Coinbase offers fee-free swaps from USDT to USDC","category":["STABLECOINS"],"content":["Coinbase has called on users to convert their Tether stablecoins to the stablecoin it cofounded, USD Coin — while waiving fees for doing so.","\"Now more than ever, stability and trust are of the utmost importance to customers,\" the crypto exchange <a href=\"https:\/\/www.coinbase.com\/blog\/switch-to-the-trusted-and-reputable-digital-dollar-usdc\" data-v-f87c67ca=\"\">said<\/a> in an official blog post, adding that the ability to swap USDT to USDC at no cost represents a continued effort to give users \"safe, responsible ways to hold and grow their crypto.\"","Coinbase reiterated that its associated stablecoin is \"unique in that it's 100% backed by cash and short-dated U.S. treasuries held in U.S. regulated financial institutions.\" The exchange added that USDC delivers monthly attestations and is \"always redeemable 1:1 for U.S. dollars.\"","The move by Coinbase may be seen as a shot at Tether's USDT in the so-called \"stablecoin wars.\"","On Dec. 1, the Wall Street Journal published a report <a href=\"https:\/\/www.wsj.com\/articles\/rising-tether-loans-add-risk-to-stablecoin-crypto-world-11669875590\" data-v-f87c67ca=\"\">claiming<\/a> the company behind tether \"may not have enough liquid assets to pay redemptions in a crisis.\" That assessment came from an apparent increase in loans, as opposed to direct sales.","Tether <a href=\"https:\/\/tether.to\/en\/wsj-and-co-the-hypocrisy-of-mainstream-media-asleep-at-the-wheel-of-information\" data-v-f87c67ca=\"\">responded<\/a> with a scathing blog post titled: \"WSJ &amp; CO: The Hypocrisy of Mainstream Media, Asleep at the Wheel of Information.\"&nbsp;","\"Critics and media outlets have spent years criticizing, investigating, and warning against the purported 'ever impending' failure of Tether, yet they were completely asleep at the wheel as a hugely significant portion of the crypto industry imploded due to irresponsible leverage, outright fraud, and regulatory arbitrage,\" the post said.","Tether identified collapsed crypto exchange FTX and its sister firm Alameda Research, bankrupt crypto lender BlockFi, embattled hedge fund Genesis, lender Celsius, collapsed hedge fund Three Arrows Capital and the failed Terra project as \"a few\" of the entities Tether skeptics had ignored.","USDC currently has a circulating supply of 43.8 billion, while USDT has a circulating of 65.7 billion, according to Circle and Tether's respective websites.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-stablecoin-supply-daily\/embed\" title=\"Total Ethereum Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<em data-v-f87c67ca=\"\">Updated to provide circulating supply numbers.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"100%","content":"PERCENT"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Dec. 1","content":"DATE"},{"type":"USDC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"WSJ &amp; CO","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Wheel of Information","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["COINBASE","USDC"],"authors":["Adam James","The Block"]}