{"summary":"The U.K. FCA has extended its financial crime reporting framework to crypto businesses.\nThe extension comes into force on March 30, 2022.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/100150\/uk-fca-crypto-businesses-financial-crime-reporting-obligation","publishDate":"2021-04-01T07:30:11","id":314,"type":null,"title":"UK regulator brings crypto businesses under financial crime reporting obligation","category":["Regulation"],"content":["The U.K.'s Financial Conduct Authority (FCA) has extended its financial crime reporting framework to include cryptocurrency businesses.","Announcing the news on Wednesday, the FCA <a href=\"https:\/\/www.fca.org.uk\/publications\/policy-statements\/ps21-4-extension-annual-financial-crime-reporting-obligation\" data-v-f87c67ca=\"\">said<\/a> cryptocurrency exchange and wallet operators would have to submit an annual financial crime reporting document, known as \"REP-CRIM,\" from March 30, 2022.","\"We consider it appropriate to include cryptoasset businesses irrespective of their total annual revenue because they pose a higher inherent money laundering and terrorist financing risk,\" <a href=\"https:\/\/www.fca.org.uk\/publication\/policy\/ps21-4.pdf\" data-v-f87c67ca=\"\">said<\/a> the FCA.","The regulator initially introduced the REP-CRIM framework in 2016, and last August, it <a href=\"https:\/\/www.fca.org.uk\/publication\/consultation\/cp20-17.pdf\" data-v-f87c67ca=\"\">consulted on<\/a> increasing the number of firms required to submit a REP-CRIM return. Following that consultation, the FCA has now published its final policy and requirements.","Per the policy, around 7,000 firms would now have to submit a REP-CRIM return instead of about 2,500 before. Besides crypto firms, banks, building societies, and other businesses have also been brought under the REP-CRIM framework.","\"These changes will give us firm-specific information about financial crime from a wider set of firms, across an increased variety of sectors and firm sizes,\" said the FCA. \"This additional information will allow our supervisory approach to be more data-led, and broaden our understanding of firms that may have inherent money laundering risks due to their activities.\"","The FCA, during its consultation, had initially proposed the effective date of the REP-CRIM extension to January 10, 2022. But it then changed it to March 30, 2022, due to the \"<a href=\"https:\/\/www.theblockcrypto.com\/post\/88013\/uk-regulator-fca-crypto-temporary-registration-regime-new-deadline-july-9\" data-v-f87c67ca=\"\">Temporary Registration Regime\"<\/a> that was announced last December and enabled existing businesses to continue to operate until July 9, 2021, pending the FCA's determination of their application.","Essentially, the FCA wanted to give crypto businesses at least a few months after their registration to follow the new REP-CRIM rules.","The FCA continues to toughen its rules for crypto businesses since it began overseeing crypto firms' adherence to <a href=\"https:\/\/www.theblockcrypto.com\/daily\/51782\/amld5-fills-regulatory-void-for-crypto-firms-but-state-by-state-rules-pose-challenges%20target=\" data-v-f87c67ca=\"\">AMLD5 regulations<\/a> in January 2020. But to date, the regulator has registered only four crypto firms. There are still more than 150 firms waiting to get registered, <a href=\"https:\/\/www.theblockcrypto.com\/daily\/86276\/uk-fca-crypto-registry-backlog-aml\" data-v-f87c67ca=\"\">as The Block reported previously<\/a>. The situation recently prompted trade body CryptoUK to call on <a href=\"https:\/\/www.theblockcrypto.com\/post\/98313\/trade-body-chancellor-crypto-register-saga\" data-v-f87c67ca=\"\">chancellor Rishi Sunak<\/a> to intervene."],"hashtag":[]}