{"summary":"Argentina&#x27;s tax authority made 40 arrests in an operation to dismantle an undeclared crypto mining farm.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179097\/argentina-tax-authority-breaks-up-crypto-mining-farm-in-major-crackdown","publishDate":"2022-10-21T17:52:05","id":3141,"type":null,"title":"Argentina tax authority breaks up crypto mining farm in major crackdown","category":["THE BLOCK"],"content":["<span data-v-f87c67ca=\"\">Argentina’s national tax authority broke up an undeclared crypto mining farm in a so-called “mega operation” leading to the arrest of 40 people, marking the latest action in a series of crypto-related crackdowns there.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The tax authority, which goes by AFIP in Spanish, worked with local agencies to conduct 70 raids, it said in a statement. It seized more than 100 cell phones and SIM cards, cash, cars, firearms, computers and assorted office equipment such as memory cards, flash drives and printers.<\/span>","<span data-v-f87c67ca=\"\">The mining farm allegedly operated out of a shed in the municipality of Quilmes, about 12 miles southeast of the city of Buenos Aires. The farm was operating with stolen cables, and authorities investigated <\/span><span data-v-f87c67ca=\"\">the alleged theft of electricity to mask the crypto mining activities.<\/span>","<span data-v-f87c67ca=\"\">AFIP has ramped up investigations related to digital asset operations since its director Carlos Castagneto stepped into his role in late July.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The agency announced in September that it had <a href=\"https:\/\/www.theblock.co\/post\/169345\/clandestine-crypto-miners-in-argentina-caught-by-authorities\" data-v-f87c67ca=\"\">discovered<\/a> three crypto mining sites that allegedly hid their mining operations by not properly declaring their activities.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The AFIP said it has specialized areas of the organization that can detect undeclared crypto farms around the country based on high electricity levels.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Through these in-person verifications, agents verify the existence of the corresponding import documentation for equipment and the correct registration of both the mining activity and income received,” AFIP said in a statement.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While the Argentine government’s crackdown on crypto mining seems to center on undeclared operations and equipment, recent raids have raised questions about whether mining is legal at all. To clarify, the nonprofit organization ONG Bitcoin Argentina has <\/span><a href=\"https:\/\/ongbitcoinargentina.medium.com\/ong-bitcoin-argentina-la-miner%C3%ADa-de-criptomonedas-no-es-un-delito-171203e2ccc9\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">communicated<\/span><\/a><span data-v-f87c67ca=\"\"> the message that crypto mining in itself is not a crime when it adheres to local laws.<\/span>","<span data-v-f87c67ca=\"\">“Cryptocurrency mining is not a crime defined by the criminal code, so it is not an activity that in itself can be considered clandestine or illegal,” ONG Bitcoin Argentina <a href=\"https:\/\/ongbitcoinargentina.medium.com\/ong-bitcoin-argentina-la-miner%C3%ADa-de-criptomonedas-no-es-un-delito-171203e2ccc9\" data-v-f87c67ca=\"\">wrote<\/a> in a Sept. 27 blog post.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Argentina","content":"LOCATION"},{"type":"Carlos Castagneto","content":"PERSON"},{"type":"Bitcoin Argentina","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Sept. 27","content":"DATE"},{"type":"July","content":"DATE"},{"type":"Buenos Aires","content":"ORGANIZATION"},{"type":"SIM","content":"ORGANIZATION"},{"type":"AFIP","content":"ORGANIZATION"}],"hashtag":[],"authors":["Kristin Majcher","The Block"]}