{"summary":"Stride, the largest liquid staking provider in the Cosmos ecosystem, will adopt Interchain Security.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240509\/liquid-staking-network-stride-adopts-cosmos-hubs-interchain-security","publishDate":"2023-07-19T09:17:05","id":3142,"type":null,"title":"Liquid staking network Stride adopts Cosmos Hub’s Interchain Security","category":["CRYPTO ECOSYSTEMS"],"content":["Stride, the largest liquid staking protocol on Cosmos, announced the imminent adoption of Interchain Security. This integration is part of Cosmos Hub proposal 799, which garnered approval from the Cosmos Hub governance community with 97% of votes in favor.","Stride will be the second blockchain in the Cosmos ecosystem to adopt Interchain Security after <a href=\"https:\/\/www.theblock.co\/post\/230581\/cosmos-blockchain-neutron-goes-live-on-mainnet-with-replicated-security\" data-v-f87c67ca=\"\">Neutron<\/a>.&nbsp;","Beginning today, as Stride incorporates ICS, block production responsibilities will transition from Stride’s validator set to that of the Cosmos Hub — the central chain of <a href=\"https:\/\/www.theblock.co\/post\/185784\/making-the-cosmos-hub-more-relevant-with-cosmos-co-founder-ethan-buchman\" data-v-f87c67ca=\"\">Cosmos<\/a>. The move indicates that Stride’s blockchain will pivot from using staked STRD for its economic security to relying on staked ATOM, and it seeks to synchronize Stride network's security measures with those of the Cosmos Hub, which holds $2.3 billion in staked ATOM.","The Stride team told The Block it will continue to maintain its unique identity as a sovereign blockchain, governed by the STRD token. For Stride users, this means they can continue to stake STRD, earn staking rewards and participate actively in on-chain governance.","Stride’s fundamental features, such as liquid staking, inter-blockchain communication protocol, will remain unchanged.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$2.3 billion","content":"MONEY"},{"type":"Interchain Security","content":"ORGANIZATION"},{"type":"Cosmos","content":"LOCATION"},{"type":"Cosmos Hub","content":"ORGANIZATION"},{"type":"Stride","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"97%","content":"PERCENT"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}