{"summary":"Arcade, a platform that facilitates loans against NFTs as collateral, has raised $15 million.\nThe platform will open to the public in early Q1 next year, Arcade co-founder Robert Masiello told The Block.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/128353\/nft-lending-platform-arcade-raises-15-million-in-series-a-funding","publishDate":"2021-12-22T12:00:34","id":3142,"type":null,"title":"NFT lending platform Arcade raises $15 million in Series A funding","category":["Venture Capital"],"content":["Arcade (formerly Pawn.fi), a platform that lets users borrow against their NFTs as collateral, has raised $15 million in a Series A funding round.","Pantera Capital led the round, with Castle Island Ventures, Franklin Templeton Blockchain Fund, Golden Tree Asset Management, Eniac Ventures, Protofund, Probably Nothing Capital, and Lemniscap also participating.","Angel investors such as BlockFi CEO Zac Prince and Quantstamp CEO Richard Ma also joined the round.","The fundraise was an equity funding round and will help Arcade expand its team, launch the platform publicly, and reach more users, co-founder Robert Masiello told The Block. Arcade's current headcount is 13, and the startup is hiring for various roles across product, business development, marketing, and engineering functions.","Arcade is currently available in a private beta form and will open to the public in early Q1 next year, said Masiello. In its private release, Arcade says it has facilitated the largest loan of $800,000 and that its total loan volume to date has been $3.3 million.","The platform currently supports Ethereum-based NFTs as collateral for getting loans in all ERC-20 tokens such as wrapped ether (wETH) and stablecoins USDC and DAI. Masiello said other blockchains and Layer 2 networks are also being explored for support in 2022.","Arcade is mainly targeted at institutional lenders and high-net-worth retail investors. As for its business model, the platform earns \"a small percentage\" of every transaction completed on it, said Masiello.","There are several such platforms that facilitate loans against NFTs, including <a href=\"https:\/\/www.theblockcrypto.com\/post\/123165\/someone-took-out-a-1-4-million-loan-with-an-nft-as-collateral\" data-v-f87c67ca=\"\">NFTfi<\/a> and Pawnfi. Masiello said Arcade's competitive edge is that it allows multiple NFTs to be included in a bundle to acquire a single loan through a wrapped asset called <a href=\"https:\/\/docs.arcade.xyz\/docs\/creating-a-wnft\" data-v-f87c67ca=\"\">wNFT<\/a>. This helps with lower gas fees since there is a single loan transaction instead of multiple ones, he added.","The Series A round brings Arcade's total funding to date to $17.75 million. In May, the startup raised $2.75 million and that was also an equity round, said Masiello.","Arcade currently does not have its native token, but it is evaluating the launch of one, said Masiello."],"hashtag":[]}