{"summary":"ConsenSys has announced a major restructuring of its business, dividing its software development and investment efforts\nAs part of the move, ConsenSys has reduces its headcount by 14 percent.\n“Over the past year, ConsenSys undertook a deep strategic review and articulated two separate strategies to grow and support the ecosystem as a software company and a separate investment company,” ConsenSys said in Tuesday’s statement.","author":["Frank Chaparro","Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/54898\/ethereum-consensys-software-investment-200-million-raise-layoffs","publishDate":"2020-02-04T12:00:40","id":3143,"type":null,"title":"Ethereum company ConsenSys to divide software and investment businesses, cuts staff by 14% as it aims for $200M raise","category":["Ethereum"],"content":["Ethereum development studio ConsenSys announced Tuesday a major restructuring of its core business model.","ConsenSys told The Block that the move will see the ethereum-focused firm effectively dividing its efforts in two, with one side focusing on the development of software products and the other on investments in startups. ConsenSys has also undertaken a 14% reduction of its headcount, adding to the 13 percent in layoffs it <a href=\"https:\/\/www.theblockcrypto.com\/daily\/4501\/ethereum-co-founder-joe-lubin-sounds-the-alarm-and-refocuses-consensys-in-expansive-employee-letter\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">announced<\/a> in December 2018.","“Over the past year, ConsenSys undertook a deep strategic review and articulated two separate strategies to grow and support the ecosystem as a software company and a separate investment company,” ConsenSys said in Tuesday’s statement.","A source with knowledge of the process told The Block that the split in efforts was a result of difficulties in raising money for a company that was involved in both investment and software development.","With the changes in place, the software company is eyeing a $200 million raise, according to the source. <a href=\"https:\/\/www.theblockcrypto.com\/linked\/19662\/consensys-looks-to-raise-200m-generated-21m-in-revenue-in-2018\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">The Information<\/a>&nbsp;reported in August that ConsenSys was seeking to raise that amount from outside investors.","“ConsenSys will operate a software business composed of several of its products&nbsp;optimized for a modular stack, which includes Infura, PegaSys, MetaMask, and Codefi,&nbsp;among several others,” ConsenSys said in a statement. “The business is focused on two goals: providing developer tools and infrastructure for the developer, decentralized finance, and startup communities; and helping enterprises in the financial services, trade finance, and commerce sectors deploy and operationalize blockchain solutions.","ConsenSys’s investment arm, according to the company, “will continue its venturing activities by supporting its current portfolio of industry-leading companies and investing in best-in-class teams building at the protocol, infrastructure, application, and business layers, under the direction of a focused investment management team.","“The priority for new investments includes early-stage equity, liquid digital assets, and strategic opportunities where applicable,” the firm added.","Tuesday’s announcement would seem to be the culmination of a year-long process that began when the 13 percent layoffs were announced in December 2018. At the time, the firm articulated its strategy for a so-called ConsenSys 2.0.","In Tuesday’s statement, ConsenSys said: “Separating the core software business from investment activity means the shape and size of ConsenSys will change.\"","The company went on to explain:&nbsp;","“ConsenSys will finalize the transition from its venture production model and spin out a number of its internally funded projects into the ConsenSys Investments portfolio,” the firm added.","The company also contended that it will continue to support projects in the ethereum ecosystem – it awarded some $175K <a href=\"https:\/\/www.theblockcrypto.com\/linked\/42759\/consensys-grants-175k-to-seven-blockchain-projects\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">in grants<\/a> to project teams in October&nbsp;– and stated that it will do so “through both client work and&nbsp;investment activity.","Meanwhile, ConsenSys is trying to break into the $3.8 trillion municipal debt market. In a separate announcement on Tuesday, ConsenSys disclosed its acquisition of broker-dealer Heritage Financial Systems, which will give the firm both advisory and broker-dealer capabilities.","ConsenSys believes that blockchain technology can ease the issuance of tokenized bond offerings. Especially, it can help issuers sell securities in smaller denominations, or mini bonds, as Bloomberg first <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2020-02-04\/tough-to-disrupt-municipal-market-attracts-blockchain-developer\" data-v-f87c67ca=\"\">reported<\/a>.","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Editor's Note:<\/strong>&nbsp;The headline of this article has been amended for clarity.&nbsp;<\/em>"],"hashtag":[]}