{"summary":"Crypto investment firm Pantera&#x27;s Liquid Token Fund is rotating back into altcoins from bitcoin and ether for the first time since spring. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/206821\/pantera-returns-to-altcoins-after-seeking-haven-in-bitcoin-ether","publishDate":"2023-01-30T15:00:54","id":3144,"type":null,"title":"Pantera returns to altcoins after seeking haven in bitcoin, ether","category":["FINANCE FIRMS"],"content":["Crypto investment firm Pantera’s Liquid Token Fund is rotating back into altcoins from bitcoin and ether for the first time since spring.&nbsp;","The firm moved from altcoins to ether last year “to try to avoid further drawdowns.”","Crypto investment firm Pantera is rotating back into altcoins from bitcoin and ether for the first time since spring.&nbsp;&nbsp;","The firm moved from altcoins to ether last year \"to try to avoid further drawdowns\" but has started to rotate back into some altcoins it believes will \"outperform ETH over the coming cycle,\" according to co-Chief Investment Officer Joey Krug.","The move comes as cryptocurrencies have seen a modest rally in January after last year's rout, when bitcoin lost more than 60% of its value. Pantera's Liquid Token Fund fell 80% in 2022.","\"This was a very brutal year for risk assets in general,\" Krug said.","The Liquid Token Fund—which typically invests in 15 to 25 liquid tokens at a time — is back up this month, rising some 47% so far this year, the firm said in an <a href=\"https:\/\/www.youtube.com\/watch?v=60p-2yQtnbg\" data-v-f87c67ca=\"\">investor call<\/a> last week.","By comparison, the Bloomberg Galaxy Crypto Index fund was down 72% in 2022 and up nearly 40% in January, Pantera said.","Pantera was founded in 2013, making it one of the oldest investment firms in the crypto industry.","<em data-v-f87c67ca=\"\">With assistance from Frank Chaparro.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"80%","content":"PERCENT"},{"type":"Pantera’s Liquid Token Fund","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"January","content":"DATE"},{"type":"72%","content":"PERCENT"},{"type":"60%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"Joey Krug","content":"PERSON"},{"type":"Bloomberg Galaxy Crypto Index","content":"ORGANIZATION"},{"type":"47%","content":"PERCENT"},{"type":"Pantera","content":"ORGANIZATION"},{"type":"spring","content":"DATE"},{"type":"Krug","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"}],"hashtag":["INVESTMENT FIRMS"],"authors":["Catarina Moura","The Block"]}