{"summary":"FTX, a new crypto derivatives exchange, is looking to dominate in Asia by boasting unrivaled liquidity thanks to its incubator, U.S.-trading firm Alameda research \nCEO Sam Bankman-Fried forecasts FTX could turn over up to $500,000 a day in revenue within six months\nHe also revealed plans to issue an ‘exchange token index’ next, so users can bet on the fate of Bitfinex’s $LEO and Binance’s $BNB\n\nNonetheless, the platform has faced seemingly impossible compliance demands, having just six members of staff designated to KYC-ing 10,000 clients ","author":["Isabel Woodford","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/35056\/inside-the-derivatives-exchange-hoping-to-rival-bitmex-its-secret-a-wealth-of-liquidity-and-a-kyc-miracle","publishDate":"2019-08-07T15:50:49","id":3144,"type":null,"title":"Inside the derivatives exchange hoping to rival BitMEX. Its secret? A wealth of liquidity and a KYC miracle","category":["Exchanges"],"content":["Taking on derivatives giants like <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/bitmex-has-clocked-in-1-trillion-in-volumes-over-the-last-year\/\" data-v-f87c67ca=\"\">BitMEX and Deribit <\/a>is high stakes.","But new Asia-based crypto derivatives exchange <a href=\"https:\/\/ftx.com\/\" data-v-f87c67ca=\"\">FTX<\/a> has accepted the challenge and has bolted out of the gate; born out of U.S.-trading firm Alameda Research. In the three months since launching, it's turned over up to $200 million in daily volumes, allegedly KYC-ed 10,000 clients, and conducted its own token offering.","It's perhaps little surprise, then, that CEO Sam Bankman-Fried answers the phone at 1:00 a.m. local time, <a href=\"https:\/\/blog.ftx.com\/forward\/\" data-v-f87c67ca=\"\">still chained<\/a> to his desk.","His caffeine, for now, is his resoluteness that FTX is filling an obvious gap in the market; offering futures, spot trading, and an OTC desk to mid-size traders in Asia and beyond.","“As traders [ourselves], we had a lot of frustrating experiences with existing exchanges. They had incomplete APIs and not enough liquidity,\" Bankman-Fried explained to The Block in an interview.","\"We've built a much smoother and much more scalable trading experience. We've more innovative,\" pointing to plans for quirky products like an 'exchange token index' and a 'shitcoin index' for low-cap tokens (launched last week).","In particular, the former Jane Street Capital trader credits FTX for being the world's \"most liquid crypto exchange since day one,\" courtesy of its parent firm Alameda, who Bankman-Fried says currently provides \"around 75-80%” of FTX's liquidity. That means Alameda, which manages up to $100 million in crypto, takes the other side of most futures contracts and absorbs most of that risk.","But aside from seeking to fix a technical gap, Bankman-Fried has also eyed a potential cash cow.","\"If I think in a very successful scenario, FTX would be trading close to $1 billion [in volume] a day,\" he said; translating to $500,000 in daily revenue and putting it hot on BitMEX's heels, which regularly sees <a href=\"https:\/\/austeritysucks.com\/premiumcatcher.php\" data-v-f87c67ca=\"\">$7 billion worth of crypto futures trade hands<\/a> in 24 hours.","\"If we can keep up the momentum and on-board large traders...that's pretty do-able.\"","Admittedly, he's not naive. Bankman-Fried is aware that a scandal could set the exchange reeling. And of course, FTX may need to account for potential competition from Binance, which has its <a href=\"https:\/\/www.theblockcrypto.com\/2019\/05\/16\/binance-is-building-out-a-derivatives-platform-heres-everything-we-know\/\" data-v-f87c67ca=\"\">own derivatives plans in the works.<\/a>&nbsp;","So he's also hedging his income predictions, having announced an<a href=\"https:\/\/venturebeat.com\/2019\/08\/06\/ftx-raises-8-million-for-cryptocurrency-derivatives-exchange-and-trading-platform\/\" data-v-f87c67ca=\"\"> $8 million private<\/a> raise this week. That's on top of the <a href=\"https:\/\/coinmarketcap.com\/currencies\/ftx-token\/\" data-v-f87c67ca=\"\">firm conducting an IEO<\/a> of its native utility token, $FTT, whose price climbed 70% on day 2 of being listed earlier this month. Bankman-Fried also clarified that those buying $FTT in bulk were offered discounts, this was related to slightly varying lock-up periods.","<strong data-v-f87c67ca=\"\">Compliance bugbears<\/strong>","Still, the Antigua-registered exchange will need to remain wary of biting off more than it can chew.&nbsp;","One potential issue is that Bankman-Fried said that FTX had onboarded around 10,000 traders in three months with just six employees dedicated to KYC, having decided not to outsource it yet. Some quick back-of-the-envelope calculations suggest that over three months, each employee KYC-ed 27 clients a day (excluding weekends), alongside being \"all hands on deck\" for other roles.","\"Yeah, it's a lot,\" Bankman-Fried admitted. \"It's a long day.\"","Calling it \"a massive job\" therefore might be putting it lightly. Indeed, an executive at an exchange in London cast doubt on whether FTX's traders have been sufficient vetted, saying the numbers sounded \"impossible.\"","The potential risk here is that neither FTX nor its token can be legally accessed by U.S. citizens, and <a href=\"https:\/\/www.theblockcrypto.com\/2019\/07\/26\/new-york-users-can-still-use-bitfinex-with-a-minor-fib-and-a-click-of-a-button\/\" data-v-f87c67ca=\"\">KYC-ing<\/a> is a key measure to guarantee this. Nonetheless, Bankman-Fried waved off rumoured scrutiny from the SEC.","\"I’d like to clarify that we have no reason to think we’re under any sort of investigation from any governmental body anywhere,\" he confirmed in a<a href=\"https:\/\/blog.ftx.com\/forward\/\" data-v-f87c67ca=\"\"> blog post.<\/a> He also told The Block that none of FTX's functions are carried out in the U.S., despite Alameda Research (where Bankman-Fried is also CEO) having a California office.<b data-v-f87c67ca=\"\"><\/b>","Bankman-Fried is also confident in $FTT's status as a utility token, whose rumored market cap is around $35 million.","\"As well as seeking legal counsel and getting opinions from various institutions about it not being a security...there are actual economics around this token...and some actual built-in functions,\" the CEO said, including reduced fees on FTX.","\"It lives on the success of the FTX exchange and, as that grows, you know...\"","Still, even if regulators are appeased, Bankman-Fried also faces <a href=\"https:\/\/twitter.com\/bitshine_\/status\/1156665108174651392?s=12\" data-v-f87c67ca=\"\">cries<\/a> about a potential conflict of interest, given Alameda's links with FTX and his role as CEO of both.","In response, he told The Block there are imminent plans to make FTX \"as independent as possible\" by onboarding the \"handful\" of reputable <a href=\"https:\/\/www.theblockcrypto.com\/2019\/03\/12\/suspicious-behavior-on-kraken-exemplifies-the-gap-between-crypto-and-legacy-market-structure\/\" data-v-f87c67ca=\"\">market-makers<\/a> in the space. He vaguely added that there were \"walls\" between the two firms, like a separate \"client-facing arm.\" The CEO also clarified that Alameda could pay back \"all of its [$65 million in] loans if it wanted to, pretty quickly,\" and that the company was in good financial health; quashing claims FTX is an attempt to salvage Alameda.","In fact, the question now is actually whether<i data-v-f87c67ca=\"\">&nbsp;<\/i>Alameda could be inadvertently damaged, being so instrumental to FTX. Indeed, one industry player noted that while FTX would likely succeed, there may be unintended consequences for its parent firm.","\"I think it will be a successful exchange and will make a lot of money for their sponsor Alameda, but it dooms the latter to long-term irrelevance in the OTC market, as institutions will not touch a group that spurns U.S. regulations,\" the source said. \"Just like BlackRock will not in a million years trade on Binance.\""],"hashtag":["BITMEX","CFTC","DERIVATIVES","FTX"]}