{"summary":"Paul Grewal decried continued “misinformation” about ether as the crypto community awaits a decision from the SEC on spot Ethereum ETFs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283899\/sec-no-good-reason-to-deny-spot-ethereum-etfs-coinbase-chief-legal-officer-paul-grewal","publishDate":"2024-03-21T07:42:01","id":3148,"type":null,"title":"Coinbase legal chief argues SEC has ‘no good reason’ to deny spot Ethereum ETFs","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">Amid ongoing speculation surrounding the prospect of spot <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.21%\n    <\/span><\/a> <!----><\/span><\/span> exchange-traded fund approvals in the United States, Coinbase Chief Legal Officer Paul Grewal said the Securities and Exchange Commission has “no good reason” to deny the ETF applications.<\/span>","“Sigh... again with the ETH misinformation as we await a decision on ETH ETPs,” Grewal <a href=\"https:\/\/x.com\/iampaulgrewal\/status\/1770594620969501035?s=20\" data-v-f87c67ca=\"\">wrote<\/a> on X. “Millions of Americans hold ETH; it has been vital to crypto since its 2015 launch; and ETH is a commodity, not a security.”","Grewal went on to argue that the SEC has taken this position on its status for years, with senior SEC officials like former Director of Corporation Finance Bill Hinman’s <a href=\"https:\/\/www.theblock.co\/post\/234408\/sec-comments-on-hinman-speech-released-in-ripple-labs-filing\" data-v-f87c67ca=\"\">speech in 2018<\/a> suggesting ether was not a security. In the same year, before becoming SEC Chair, Gary Gensler also <a href=\"https:\/\/www.congress.gov\/115\/meeting\/house\/108562\/witnesses\/HHRG-115-AG00-Wstate-GenslerG-20180718.pdf\" data-v-f87c67ca=\"\">testified<\/a> to Congress that ether is not a security, Grewal added.","Recent comparisons between ether and bitcoin by the SEC’s own trial lawyers in the case against Ripple Labs, the Commodity Futures Trading Commission and federal courts' confirmation of ether as a commodity and the ether futures contracts which started trading on CFTC-regulated futures exchanges in 2021, were additional arguments against the classification of ether as a security, Grewal said.","“The SEC has no good reason to deny the ETH ETP applications. And we hope they won’t try to invent one by questioning the long established regulatory status of ETH, which the SEC has repeatedly endorsed. That’s not how the law works. And Americans deserve better,” Grewal said.","Furthermore, the Coinbase CLO added that the SEC’s Howey Test doesn’t determine ether’s status either. “Digital assets like ether that do not involve an ongoing contractual obligation related to a business enterprise are not ‘investment contracts’ or otherwise ‘securities.’” Even if the test was applied, ether fails it anyway, he argued.","Yesterday, The Block <a href=\"https:\/\/www.theblock.co\/post\/283686\/ethereum-foundation-has-received-a-confidential-enquiry-from-a-state-authority-shows-github-commit\" data-v-f87c67ca=\"\">reported<\/a> that the Ethereum Foundation — a non-profit based in Switzerland that helps support the Ethereum ecosystem — had removed a \"Warrant Canary\" from its website following a voluntary and confidential enquiry from an unspecified state authority, according to the Foundation's <a href=\"https:\/\/github.com\/ethereum\/ethereum-foundation-website\/commit\/769b30603504b4b5e8f601f8014691a8d1821390\" data-v-f87c67ca=\"\">GitHub<\/a> repository.","\"This commit removes a section of the footer as we have received a voluntary enquiry from a state authority that included a requirement for confidentiality,\" said Pablo Pettinari, a front-end developer at the Ethereum Foundation, in a commit on Feb. 26.","The removed \"Warrant Canary\" image represented that the Ethereum Foundation had not been contacted by an agency in a way that required contact not to be disclosed. It also removed text that said, \"The Ethereum Foundation (Stiftung Ethereum) has never been contacted by any agency anywhere in the world in a way which requires that contact not to be disclosed.\"","Historical records from the Wayback Machine indicate that the canary and its message were still visible on the Foundation's website as recently as January.","Meanwhile, Fortune <a href=\"https:\/\/www.theblock.co\/post\/283753\/sec-subpoenaed-firms-that-dealt-with-the-ethereum-foundation-fortune\" data-v-f87c67ca=\"\">reported<\/a> that the SEC seems to be \"waging an energetic legal campaign to classify Ethereum as a security\" — citing crypto companies that have received subpoenas connected to an Ethereum-related investigation.","Individuals from companies receiving the subpoenas said the inquiries were highly-specific to the Ethereum Foundation. In addition, some firms received subpoenas recently, while others obtained theirs after Ethereum switched to a proof-of-stake (PoS) consensus system in September 2022 in a transition dubbed \"The Merge.\"","In contrast to Grewal’s view on the SEC’s stance throughout Ethereum’s history, others see the <a href=\"https:\/\/x.com\/CoinDesk\/status\/1552738783736512512?s=20\" data-v-f87c67ca=\"\">switch to PoS<\/a> as a key differentiator, with the probe raising questions about whether it is part of a broader push to classify ether as a security — potentially dashing <a href=\"https:\/\/www.theblock.co\/post\/275174\/sec-ethereum-etf-approval-may-standard-chartered-bank\" data-v-f87c67ca=\"\">hopes<\/a> that the regulator will approve spot Ethereum ETFs in the coming months.","“This situation to me is a case of 'where there's smoke there may actually be fire,’” Bloomberg ETF analyst James Seyffart <a href=\"https:\/\/x.com\/JSeyff\/status\/1770506432976175235?s=20\" data-v-f87c67ca=\"\">said<\/a> yesterday, responding to the news.","Shortly after <a href=\"https:\/\/www.theblock.co\/post\/166708\/the-merge-everything-you-need-to-know-about-ethereums-big-upgrade\" data-v-f87c67ca=\"\">The Merge<\/a>, Gensler <a href=\"https:\/\/www.theblock.co\/post\/172097\/proof-of-security-gensler-eyes-proof-of-stake-after-the-merge\" data-v-f87c67ca=\"\">stated<\/a> that tokens in a PoS consensus system could be considered securities since investors rely on the efforts of others to make a profit.","However, crypto lawyer Preston Byrne <a href=\"https:\/\/x.com\/prestonjbyrne\/status\/1770497285224321303?s=20\" data-v-f87c67ca=\"\">said<\/a> on Wednesday, “If the SEC is going to try to undermine Ethereum's claim that it's like Bitcoin, it's going to do so by reference to the distribution of coins in the presale.”","The ETF Store President Nate Geraci <a href=\"https:\/\/x.com\/NateGeraci\/status\/1770269002025119929?s=20\" data-v-f87c67ca=\"\">said<\/a> that when contemplating potential SEC disapproval of spot Ethereum ETFs, it is useful to look back to Commissioner Hester Peirce’s comments following spot Bitcoin ETF approval.","Peirce said at the time that the agency’s “arbitrary and capricious treatment of applications in the area will continue to harm our reputation far beyond crypto,” adding that, “By failing to follow our normal standards and processes in considering spot Bitcoin ETFs, we have created an artificial frenzy around them.”","“I’ll remind you that investors can currently buy futures-based Ethereum ETFs,” Geraci added.","Former CFTC commissioner and Global Head of Policy at a16z crypto Brian Quintenz seemingly agrees. “When the SEC allowed ETH futures ETFs to trade on its regulated security exchanges, it explicitly acknowledged the status of the underlying, ETH, as being a non-security and outside of its jurisdiction,” he <a href=\"https:\/\/x.com\/BrianQuintenz\/status\/1770541103667929161?s=20\" data-v-f87c67ca=\"\">posted<\/a> on X yesterday.","Quintenz pointed out that the Ethereum futures ETF approval decision was made in October 2023 — well after Ethereum changed to PoS in September 2022. “If the SEC had any doubt about the regulatory treatment of ETH in Oct 2023, it wouldn’t have approved the ETF. Moreover, if ETH were a security, then the ETH futures ETF would be an illegal instrument. The SEC cannot approve an illegal instrument to trade over a national securities exchange,” he said.","“It will be interesting to watch what, if any, excuse the SEC uses if it were to delay or deny an ETH ETF given it has already informed the market on ETH being outside its jurisdiction,” Quintenz added. “The SEC's conduct in refusing to acknowledge these facts is causing confusion and actively harming the public.”","Intially optimistic, Bloomberg ETF analysts Eric Balchunas and James Seffart recently reduced their expectations for spot ETF approvals to <a href=\"https:\/\/x.com\/EricBalchunas\/status\/1770453011321495889?s=20\" data-v-f87c67ca=\"\">25%<\/a> by May 23 — the final deadline for the SEC to rule on a spot Ethereum ETF application from Ark and 21Shares, the first that was filed.","The analysts cited differences in the comments process from the SEC leading up to the spot Bitcoin ETF approvals compared to the spot Ethereum ETF application timeline.","“Bitcoin spot comments from the SEC came 91 days before the final deadline. We are currently 65 days away from the Ethereum ETF deadline. Tick tock..,” Balchunas <a href=\"https:\/\/x.com\/EricBalchunas\/status\/1770453011321495889?s=20\" data-v-f87c67ca=\"\">said<\/a> on Wednesday. “Until issuers say the SEC’s reached out, approval shall remain in serious doubt,” he added. However, if the SEC gave comments their odds would at least double, maybe triple, Balchunas noted.","<span data-v-f87c67ca=\"\">Timeline of Bitcoin, Ethereum ETFs. Image: <a href=\"http:\/\/Timeline of Bitcoin, Ethereum ETFs. Image: Bloomberg.\" data-v-f87c67ca=\"\">Bloomberg<\/a>.<\/span>","“Agree if SEC not engaging with issuers on spot Ethereum ETF, that’s clearly not a good sign… I will say that the SEC isn’t completely checked out. They recently met with Coinbase and Grayscale attorneys on this topic,” Geraci replied.","Others remain a little more optimistic about approvals, at least for some time this year. “We believe the ETH ETF approval this year is still a 50% probability — we prefer not being hung up on the May 23 approval date, as the participants may go to the courts, if SEC denies, given the perfectly similar regulatory setup as the Grayscale Bitcoin ETF ruling (ETH futures on CME, ETH futures ETF approved and similar tight correlations between spot and futures market for ETH),” Bernstein analysts Gautam Chhugani and Mahika Sapra wrote in a note to clients on Wednesday. “Further, we don’t believe the industry will give up the ETH ETF battle without a fight, pushing SEC to come up with a ‘really solid and creative’ reason to deny.”","The SEC recently delayed the decision on the approval of several spot Ethereum ETFs, informing <a href=\"https:\/\/www.theblock.co\/post\/283769\/sec-delays-decision-on-vaneck-spot-ethereum-etf-asks-for-public-comments\" data-v-f87c67ca=\"\">VanEck<\/a> on Wednesday that it is the latest contender whose verdict has been postponed until May 23.","<a href=\"https:\/\/www.theblock.co\/post\/283233\/fidelity-amends-spot-ethereum-etf-to-include-staking\" data-v-f87c67ca=\"\">Fidelity<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/283542\/following-fidelitys-lead-grayscale-looks-to-add-staking-for-its-proposed-ethereum-etf\" data-v-f87c67ca=\"\">Grayscale<\/a> also amended their filings this week to include staking. “Fidelity not giving up on Ethereum ETFs and not giving up on SEC allowing them to stake within the ETF,” Seyffart said. “Our base case is still that these aren't gonna be approved.”","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Brian Quintenz","content":"PERSON"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"Gautam Chhugani","content":"PERSON"},{"type":"Switzerland","content":"LOCATION"},{"type":"Ethereum ETFs","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Feb. 26","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"Grewal","content":"PERSON"},{"type":"Director of Corporation Finance Bill Hinman","content":"ORGANIZATION"},{"type":"Nate Geraci","content":"PERSON"},{"type":"James Seffart","content":"PERSON"},{"type":"Geraci","content":"PERSON"},{"type":"Pablo Pettinari","content":"PERSON"},{"type":"Eric Balchunas","content":"PERSON"},{"type":"May 23","content":"DATE"},{"type":"Foundation","content":"ORGANIZATION"},{"type":"Bloomberg ETF","content":"ORGANIZATION"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Preston Byrne","content":"PERSON"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"VanEck","content":"PERSON"},{"type":"Seyffart","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"\"Warrant Canary\"","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"September 2022","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Global Head of Policy","content":"ORGANIZATION"},{"type":"ETH ETF","content":"ORGANIZATION"},{"type":"+0.21%","content":"PERCENT"},{"type":"2015","content":"DATE"},{"type":"Coinbase CLO","content":"ORGANIZATION"},{"type":"ETH ETP","content":"ORGANIZATION"},{"type":"Bernstein","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"October 2023","content":"DATE"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"25%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"Oct 2023","content":"DATE"},{"type":"James Seyffart","content":"PERSON"},{"type":"Hester Peirce","content":"PERSON"},{"type":"Ethereum Foundation (Stiftung Ethereum)","content":"ORGANIZATION"},{"type":"Mahika Sapra","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Wayback Machine","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Peirce","content":"PERSON"},{"type":"Grayscale Bitcoin ETF","content":"ORGANIZATION"},{"type":"Balchunas","content":"PERSON"},{"type":"Paul Grewal","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["ETHEREUM","SEC","SPOT ETHEREUM ETF"],"authors":["James Hunt","The Block"]}