{"summary":"A member of parliament has called on HM Treasury to create a safe space for crypto businesses to innovate.\nLobbying over fears of a mass exodus of U.K. crypto businesses has heated up in recent months.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/105639\/uk-politician-calls-for-hm-treasury-to-start-nurturing-crypto-businesses","publishDate":"2021-05-21T09:05:22","id":3150,"type":null,"title":"UK politician calls for HM Treasury to start nurturing crypto businesses","category":["Layer 1s"],"content":["Until this week, it’s quite possible that the term “flippening,” which refers to the market capitalization of ether outstripping that of bitcoin, had never before been uttered in the U.K.'s House of Commons.","Enter Tom Tugendhat, Conservative member of Parliament (MP) for Tonbridge and Malling, who used the term in a <a href=\"https:\/\/parliamentlive.tv\/event\/index\/c36ebdde-5ca8-40a5-a421-f5beb5040be3?in=15:22:47\" data-v-f87c67ca=\"\">response to the Queen's speech<\/a> on May 18. The MP ran out of time before he was able to finish his full speech — which he later <a href=\"https:\/\/twitter.com\/TomTugendhat\/status\/1395514137925521419\" data-v-f87c67ca=\"\">posted online<\/a> — but briefly mentioned the topics he was unable to address.","\"I'm not going to go in in the few moments left to me of the flippening and why I'm going to be bullish on ether and not bitcoin, or the nature of the change in the Treasury that is needed to enable innovation that sees the sharing of prosperity on a global basis,\" he told Parliament.","Tugendhat urged HM Treasury, the U.K.’s finance ministry, to encourage crypto innovation.","“This Treasury needs to create a safe space for cryptocurrency development, because setting a standard for this new economy will shape a new electronic age, a new digital world,” he told Parliament.","According to the full speech, Tugendhat planned to call on the Treasury to “create a box into which people can experiment with cryptocurrencies, with crypto contracts.” The proposal seems somewhat similar to the Financial Conduct Authority’s <a href=\"https:\/\/www.fca.org.uk\/news\/press-releases\/financial-conduct-authority%E2%80%99s-regulatory-sandbox-opens-applications\" data-v-f87c67ca=\"\">regulatory sandbox program<\/a>, through which cohorts of fintech firms have been able to test their systems since 2016.","The intervention comes just a few months after CryptoUK, the lobby group representing more than 50 crypto firms, <a href=\"https:\/\/www.theblockcrypto.com\/post\/98313\/trade-body-chancellor-crypto-register-saga\" data-v-f87c67ca=\"\">called on chancellor Rishi Sunak<\/a> to intervene over continued delays to the FCA’s anti-money laundering registration process.","Hundreds of crypto startups in the U.K. remain <a href=\"https:\/\/www.theblockcrypto.com\/daily\/86276\/uk-fca-crypto-registry-backlog-aml\" data-v-f87c67ca=\"\">trapped in limbo<\/a> awaiting approval from the regulator, prompting CryptoUK chair Ian Taylor to write in March that the FCA’s actions risked a raft of businesses going bust or leaving the country.","Taylor’s warning was echoed in parliament by Tugendhat, who told MPs: “If we do not get this right, those standards [governing the crypto economy] will be set by authoritarian governments with no interest in innovation or in wild places where there is no regulation and no accountability.”","The Block checked <a href=\"https:\/\/publications.parliament.uk\/pa\/cm\/cmregmem\/210426\/210426.pdf\" data-v-f87c67ca=\"\">the latest available register<\/a> of MPs' financial interests and found no relevant shareholding disclosures related to Tugendhat. He has a small shareholding in Crypto Quantique Ltd, a cyber-security startup focused on the Internet of Things.","Taylor told The Block that it is “good to see a member of parliament raise awareness of crypto in the house and we fully support the idea of public support to further develop the U.K.’s burgeoning crypto industry.”","Tugendhat’s office was contacted by The Block for additional comment but did not respond by press time.","The crypto register saga is not the only grudge born by U.K. crypto startups against regulators. In October 2020, the FCA <a href=\"https:\/\/www.fca.org.uk\/news\/press-releases\/fca-bans-sale-crypto-derivatives-retail-consumers\" data-v-f87c67ca=\"\">banned the sale of crypto derivative products<\/a> to retail consumers despite considerable opposition to the move during a consultation period. Some founders in the sector have become disheartened.","“I’m done with the crypto lobby in the U.K. It’s a waste of time. The very fact they’re thinking sandbox and experimentation while there’s trillions of dollars flying around says it all,” said one senior executive at one of the country’s largest crypto firms, who insisted on anonymity.&nbsp;","Others remain optimistic.","“When you consider the FCA sandbox, the multiple crypto-asset taskforce consultation papers and most recently the Bank of England's CBDC taskforce ‘call to arms’ with the proposed engagement forum, there is a clear trend going back multiple years that these British institutions are thinking and positioning themselves for a world where new technology, including blockchain, is used for exchanging value,” said Matthew Pollard, chief financial officer at digital assets exchange Archax, which is one of just <a href=\"https:\/\/register.fca.org.uk\/s\/search?predefined=CA\" data-v-f87c67ca=\"\">four businesses<\/a> to have been fully registered by the FCA."],"hashtag":["BITCOIN"]}