{"summary":"Coinbase debuts support for crypto transfers on both Polygon and Solana as part of the company’s multi-chain expansion.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/153835\/coinbase-polygon-support-eth-usdc-crypto","publishDate":"2022-06-23T16:00:35","id":3150,"type":null,"title":"Coinbase rolls out Polygon support for transfers of ETH, USDC","category":["EXCHANGES"],"content":["Coinbase customers over the next month will be able to send and receive crypto on Polygon.","According to Thursday's announcement, eligible customers will be able to send and receive ether (ETH), polygon (MATIC), and USD Coin (USDC) on Polygon. Polygon becomes the first scaling network of its kind supported by the US exchange giant for transferring those crypto assets.&nbsp;","USDC transfers will also be available on Solana per the announcement. Coinbase rolled out support for Solana as <a href=\"https:\/\/www.theblock.co\/post\/153497\/coinbase-launches-redesigned-mobile-defi-wallet-adds-solana-support\" data-v-f87c67ca=\"\">reported by The Block<\/a> on Wednesday.","The move marks the start of the company’s multi-chain approach to crypto transactions for customers. Coinbase says it is reducing the “time, effort, and high fees” associated with transacting via the Ethereum network.","Coinbase also stated in the announcement that its multi-chain approach will simplify the process of sending crypto across different networks. Moving one token from its native blockchain to another network usually requires bridging. This process involves using a bridge protocol to make the transfer and costs fees and can take hours or days to complete.","By going multi-chain, Coinbase says both retail and institutional clients do not have to go through the process. They can, instead, have all their assets unified in one balance even if the tokens are spread across different blockchains. The exchange also plans to offer support for other assets and networks in the future.","<strong data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Editor's Note:&nbsp;<\/em><\/strong><em data-v-f87c67ca=\"\">This report and its headline have been updated for clarity regarding the nature of Polychain.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Thursday","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"USD Coin (USDC","content":"ORGANIZATION"}],"hashtag":["COINBASE","POLYGON","SOLANA"],"authors":["Osato Avan-Nomayo","The Block"]}