{"summary":"Bitcoin’s mining difficulty rate is expected to climb by over 2% on March 10\nThe rate saw its first dip in 2020 during the last adjustment, as mining equipment makers temporarily shut down due to the coronavirus\nNow that most of the manufacturers in China have resumed operations, new rigs are being shipped and deployed.","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/57808\/bitcoin-mining-activity-expected-to-surge-as-chinese-hardware-makers-shake-off-coronavirus-slowdown","publishDate":"2020-03-05T14:34:55","id":3151,"type":null,"title":"Bitcoin mining activity expected to surge as Chinese hardware makers shake off coronavirus slowdown","category":["Asia"],"content":["<span data-v-f87c67ca=\"\">Following a 0.38% dip in late February, the bitcoin mining difficulty rate is expected to bounce back by more <a href=\"https:\/\/btc.com\/stats\/diff\" data-v-f87c67ca=\"\">than 5%<\/a> on March 10 as a coronavirus-triggered hardware delivery slowdown abates.<\/span>","<span data-v-f87c67ca=\"\">The bitcoin mining difficulty is adjusted roughly every two weeks, benchmarking the computing power needed to find one new block. The difficulty decreased for the first time in 2020 during its last adjustment on February 25, <a href=\"https:\/\/www.coindesk.com\/bitcoins-mining-difficulty-stagnates-as-coronavirus-outbreak-delays-new-equipment?utm_source=hootsuite&amp;utm_medium=twitter&amp;utm_term=Events&amp;utm_content=Register&amp;utm_campaign=FATF\" data-v-f87c67ca=\"\">partly due to<\/a>&nbsp;a government quarantine against the coronavirus in China that led to mining delivery delays.<\/span>","<span data-v-f87c67ca=\"\">Despite that drop, however, the hash rate for the trailing seven days has posted strong performance, and on the last day of February <a href=\"https:\/\/btc.com\/stats\/diff\" data-v-f87c67ca=\"\">hit<\/a> 136 EH\/s, an all-time high. The total network difficulty is now estimated to jump by 5% on March 10.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As previously reported, even at the time when growth in the difficulty rate slowed, market participants still <a href=\"https:\/\/www.theblockcrypto.com\/daily\/54853\/china-bitcoin-mining-coronavirus-hardware-delays\" data-v-f87c67ca=\"\">anticipated<\/a> that the rate would shoot up very soon once the outbreak's impact on hardware shipping subsided.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This prediction came about because many miners had already placed large orders for new mining rigs to <\/span><a href=\"https:\/\/www.theblockcrypto.com\/daily\/54853\/china-bitcoin-mining-coronavirus-hardware-delays\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">gear up<\/span><\/a> <span data-v-f87c67ca=\"\">ahead of bitcoin's block reward halving in May, when the per-block reward will fall from 12.5 BTC to 6.25 BTC. However, government quarantines forced all major mining equipment makers in China to temporarily shut down, delaying production and shipments of mining machines.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Chinese government has loosened the nationwide quarantine since mid-February and, to spur economic activity, has&nbsp;<\/span><a href=\"http:\/\/money.163.com\/20\/0304\/23\/F6TLMNDO00259DLP.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">urged<\/span><\/a><span data-v-f87c67ca=\"\"> businesses to resume normal operations.&nbsp;<\/span><span data-v-f87c67ca=\"\">Bitcoin mining equipment maker Canaan <\/span><a href=\"https:\/\/canaan-creative.com\/jiananfabuneibuxinjiandingjishuxinyang-teshushiqizuohaosanjianshi.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">started partial operations <\/span><\/a><span data-v-f87c67ca=\"\">on February 10, while Bitmain also resumed shipping and production in mid-February.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"We got back to work as soon as the Shenzhen municipal government said we can resume work. There was no delay,\" a Bitmain employee told The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In a notice <\/span><a href=\"https:\/\/mp.weixin.qq.com\/s\/Pf6FtxOW1Ugu11Kk4x0WxA\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">published<\/span><\/a><span data-v-f87c67ca=\"\"> on February 25, MicroBT, the manufacturer of Whatsminer, said it resumed its maintenance services.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This means that miners are gradually receiving their long-awaited new rigs and deploying them, filling the gap left by some miners who were preemptively selling off their old machines, such as Antminer S9s.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"<\/span><span data-v-f87c67ca=\"\">Miners have sold off their S9's or upgraded electrical infrastructure for their next-generation equipment… probably 60% to 70% of miners dumped S9's prior to 2020,\" said Blockware Solution CEO Matt D'Souza, whose firm provides services to North American miners.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Once deployed, these new machines, which generally offer double the hash rate of the old ones such as Antminer S9's, can ramp up the overall network hash rate, which is positively correlated to the difficulty rate.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, although <\/span><a href=\"https:\/\/www.weibo.com\/3982803458\/IsGac2MuX?from=page_1005053982803458_profile&amp;wvr=6&amp;mod=weibotime&amp;type=comment&amp;display=0&amp;retcode=6102\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">a few mines<\/span><\/a><span data-v-f87c67ca=\"\"> closed down due to the coronavirus, most of them have remained unaffected, continuing operating over the past two months, multiple industry participants told The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"There are very few factories shut down during the outbreak. I haven't heard of any mine shutting down due to virus, or perhaps the dust hasn’t settled on this,\" said Chris Zhu, COO of Poolin, one of the largest bitcoin mining pools.<\/span>","<span data-v-f87c67ca=\"\">However, for mines located in the northwestern region of China, the story may be a bit different. <\/span>","<span data-v-f87c67ca=\"\">While mines in China tend to concentrate in the southwest – owing to the region's access to cheap hydroelectricity – Xinjing province, located further west, is becoming one of the fastest-growing mining hubs in the country.<\/span>","<span data-v-f87c67ca=\"\">According to the Bitmain employee and Flex Yang, whose crypto lending desk Babel Finance has a large miner client base, many miners are looking to open up new sites in Xinjiang. However, the quarantine had made it impossible to transport mining equipment into this area and move broken machines out for repair. <\/span>","<span data-v-f87c67ca=\"\">Now, as the government called off regional lockdown, new rigs that are being shipped to the region and deployed at these new sites will also add to the network hash rate.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"The logistics in Xinjiang should have been restored. Once delivery companies started working, these machines can be sent in,\" said the Bitmain employee.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"Xinjiang is slow in resuming business operations. Now we have the machines, but there are various problems during the deployment process,\" Yang told The Block in mid-February when the Chinese government first relaxed the quarantine in certain areas.&nbsp;<\/span>"],"hashtag":[]}