{"summary":"Several companies in the crypto space have reported earnings, providing insights into how digital assets are affecting financial performance.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242902\/robinhood-microstrategy-q2-earnings","publishDate":"2023-08-03T05:02:51","id":3152,"type":null,"title":"Robinhood, MicroStrategy turn profit: Q2 earnings recap","category":["COMPANIES"],"content":["This week, several companies operating within the crypto space have reported — or are set to report — earnings, shedding light on how the current backdrop for digital assets might impact the bottom line.&nbsp;","Already, Robinhood, which operates a cryptocurrency brokerage service, and MicroStrategy — Michael Saylor's bitcoin buying machine — have reported earnings, both reporting profitable quarters. Robinhood had a surprise beat, while MicroStrategy fell short of Wall Street's expectations.&nbsp;","Here's a deep dive into the results — and the degree to which crypto is helping or hurting their results.&nbsp;","Robinhood did not have crypto trading to thank for its stronger-than-expected second-quarter results.","The U.S. equities and options brokerage firm <a href=\"https:\/\/investors.robinhood.com\/financials\/quarterly-results\/\" data-v-f87c67ca=\"\">reported<\/a> earnings on Wednesday, beating Wall Street's revenue estimates — despite a decline in the number of traders on the platform punting coins and stocks. Total net revenues increased 10% to $486 million. Shares in Robinhood were down 3.34% in after-market trading.&nbsp;","Interest rate hikes were vital to the beat and the firm's first profitable quarter as a public company, boosting its net interest revenues to $234 million for the quarter. The tailwind of higher rates <a href=\"https:\/\/www.wsj.com\/articles\/robinhood-learns-to-nab-interest-income-11660482001\\\" data-v-f87c67ca=\"\">allows<\/a> Robinhood to generate more revenue from the idle cash it holds on behalf of its clients as well as the margin loans it extends out to traders.","","","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Source: Robinhood<\/em><\/span>","As for crypto, Robinhood’s transaction-based revenue derived from cryptocurrencies dropped 18% in the second quarter. Still, Robinhood <a href=\"https:\/\/www.theblock.co\/post\/242875\/robinhood-reports-drop-in-crypto-revenue-in-latest-earnings-report\" data-v-f87c67ca=\"\">said<\/a> it's continuing to build in the industry, citing its plans to introduce a non-custodial wallet later this year, allowing customers to control their crypto. The firm delisted several coins after the U.S. Securities Exchange Commission sued Coinbase.","Despite declining crypto activity, the firm's chief financial officer Jason Warnick noted that it believes it has taken market share from its competitors in a less active trading environment. Here's Warnick [emphasis is our own]:","\"It's a little harder in crypto to measure market share. It's not as easy as it is with equities and options. <strong data-v-f87c67ca=\"\">But by our analysis, it does look like we're gaining share in the coins that we offer.<\/strong> In terms of why, I'd probably point to the value proposition. We think we're the best place for retail traders to buy crypto for the coins that we offer.\"","MicroStrategy <a href=\"https:\/\/www.microstrategy.com\/en\/investor-relations\/press\/microstrategy-announces-second-quarter-2023-financial-results_08-01-2023\" data-v-f87c67ca=\"\">missed<\/a> Wall Street's estimates on Tuesday, with revenues declining 1% Y\/Y to $120 million. Still, the Tysons Corner, Virginia-based company turned profitable during the second quarter and saw operating expenses decrease by more than 88% compared to the same quarter of last year.&nbsp;","The stock, which has soared by more than 180% since the beginning of the year, slid by more than 9.6% over the last five days.&nbsp;","The crypto market darling, which develops business intelligence and analytics software, reported that it acquired 12,333 bitcoin ($361.4 million) during the second quarter, bringing its total holdings to more than 152,800 bitcoin as of July 31. Here's CFO Andrew Kang [emphasis is our own]:","“Our bitcoin holdings increased to 152,800 bitcoins as of July 31, 2023, with the addition in the second quarter of 12,333 bitcoins being the largest increase in a single quarter since Q2 2021. We efficiently raised capital through our at-the-market equity program and used cash from operations to continue to increase bitcoins on our balance sheet. <strong data-v-f87c67ca=\"\">And we did so against the promising backdrop of increasing institutional interest, progress on accounting transparency, and ongoing regulatory clarity for bitcoin.<\/strong>\"","The firm said in a separate filing Tuesday that it could raise as much as $750 million via the sale of stock for general purposes, which could pave the way for the purchase of even more coins.&nbsp;","And that strategy appears to be winning over Wall Street's heart. Analysts were increasingly bullish on MSTR leading up to the earnings drop, with Berenberg Capital Markets raising its price target for the stock to $510 from $430. Analysts at the firm maintain that the stock could appreciate based on the assumption that bitcoin will hit $56,630 by the end of the year. Here's Berenberg:&nbsp;","\"Supporting our expectation that bitcoin will appreciate significantly in the coming months is improved sentiment driven by anticipation of the bitcoin halving estimated to occur in April 2024 and keen interest demonstrated by large institutions.\"","As CoinDesk <a href=\"https:\/\/www.coindesk.com\/markets\/2023\/07\/31\/bullish-microstrategy-analysts-raise-price-targets-ahead-of-q2-earnings\/\" data-v-f87c67ca=\"\">reported<\/a>, analysts at TD Cowen praised the firm for its \"hybrid corporate strategy\" as part of the initiation of its coverage, describing its bitcoin-buying strategy as a \"paradigm shift.\"","Indeed, MicroStrategy chairman Michael Saylor <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-08-02\/microstrategy-mstr-expects-to-retain-appeal-even-if-bitcoin-etf-approved\" data-v-f87c67ca=\"\">told<\/a> Bloomberg News that he expects the company to continue to be a darling among investors looking for bitcoin exposure, even if a spot bitcoin exchange-traded fund is approved by Gary Gensler's Securities and Exchange Commission. As the largest public company holding bitcoin on its balance sheet, MicroStrategy has often served as a proxy for the cryptocurrency but, more recently, has outperformed it.&nbsp;","","","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Source: <a href=\"https:\/\/www.tradingview.com\/chart\/?symbol=NASDAQ%3AMSTR\" data-v-f87c67ca=\"\">TradingView<\/a><\/em><\/span>","Saylor juxtaposed MSTR with a potential spot ETF, describing the former as \"that sports car.\"","\"The spot ETF will be that super tanker,\" he added.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"April 2024","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Virginia","content":"LOCATION"},{"type":"9.6%","content":"PERCENT"},{"type":"TradingView","content":"ORGANIZATION"},{"type":"July 31, 2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"88%","content":"PERCENT"},{"type":"$56,630","content":"MONEY"},{"type":"U.S. Securities Exchange Commission","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Berenberg Capital Markets","content":"ORGANIZATION"},{"type":"$234 million","content":"MONEY"},{"type":"$750 million","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Jason Warnick","content":"PERSON"},{"type":"180%","content":"PERCENT"},{"type":"second quarter","content":"DATE"},{"type":"Michael Saylor","content":"PERSON"},{"type":"Tysons Corner","content":"ORGANIZATION"},{"type":"July 31","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"$510","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Andrew Kang","content":"PERSON"},{"type":"$486 million","content":"MONEY"},{"type":"3.34%","content":"PERCENT"},{"type":"Warnick","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"18%","content":"PERCENT"},{"type":"TD Cowen","content":"ORGANIZATION"},{"type":"$120 million","content":"MONEY"},{"type":"1%","content":"PERCENT"},{"type":"$430","content":"MONEY"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Bloomberg News","content":"ORGANIZATION"},{"type":"$361.4 million","content":"MONEY"}],"hashtag":["MICROSTRATEGY"],"authors":["Frank Chaparro","The Block"]}