{"summary":"Tata Consultancy Services (TCS), India’s largest tech company and the second-largest company by market capitalization, has launched a cryptocurrency trading solution for financial institutions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/70759\/indian-tech-giant-tcs-launches-crypto-trading-solution-for-financial-institutions","publishDate":"2020-07-08T10:50:12","id":3156,"type":null,"title":"Indian tech giant TCS launches crypto trading solution for financial institutions","category":["CRYPTOCURRENCY"],"content":["Tata Consultancy Services (TCS), India’s largest tech company and the <a href=\"https:\/\/www.moneycontrol.com\/stocks\/marketinfo\/marketcap\/bse\/index.html\" data-v-f87c67ca=\"\">second-largest<\/a> company by market capitalization, has launched a cryptocurrency trading solution for financial institutions.","Dubbed “Quartz Smart Solution for Crypto Services,” <a href=\"https:\/\/www.tcs.com\/tcs-launches-quartz-smart-solution-help-financial-institutions-offer-cryptocurrency-trading\" data-v-f87c67ca=\"\">the solution<\/a> allows banks and investment firms to provide crypto trading services to their clients. The solution supports multiple cryptocurrencies, stablecoins, and trading venues.","TCS said the solution is integrated with several features, including multi-signature wallets, exchange and OTC desk connectivity, and blockchain forensic checks, to ensure that a transaction is executed only after proper validation and authorization.","A TCS spokesperson told The Block that one customer has already signed up for the solution and “a few more” are close to signing up, without disclosing any names.","“Progressive financial institutions are looking to provide [crypto trading services] to their clientele,” said R Vivekanand, global head of Quartz at TCS. “We are excited to offer them our robust, secure and scalable solution for trading, storing and transfer of these assets.”","Quartz is a TCS-incubated startup and provides various blockchain solutions across industries, including “Smart Ledgers” and “<a href=\"https:\/\/www.theblockcrypto.com\/linked\/50642\/tata-rolls-out-blockchain-development-kit-to-help-enterprises-build-apps-40-faster\" data-v-f87c67ca=\"\">DevKit<\/a>.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSumit Gupta, CEO of Indian crypto exchange CoinDCX, told The Block that the TCS news is “extremely promising” for the Indian crypto industry. “TCS must have seen increasing demand in the Indian space, directly from their banking and investment firm clients, for such products.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"While the inception of such products shows that established financial institutions believe crypto will be part of the financial ecosystem, the right way forward will require smart and sensible crypto regulations,” Gupta added.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe news comes at a time when<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\"> India's finance ministry is <a href=\"https:\/\/www.theblockcrypto.com\/daily\/68133\/india-crypto-ban-revived-report\" data-v-f87c67ca=\"\">said to be seeking<\/a> inter-ministerial consultations on a “note” reportedly related to a crypto ban and when major banks in India are still <\/span><a class=\"_e75a791d-denali-editor-page-rtfLink\" href=\"https:\/\/www.theblockcrypto.com\/daily\/58000\/indias-biggest-banks-weigh-their-options-hold-off-on-servicing-crypto-firms-in-wake-of-supreme-court-ruling\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">hesitant<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;to serve the crypto sector.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBanks are <a href=\"https:\/\/www.theblockcrypto.com\/daily\/58000\/indias-biggest-banks-weigh-their-options-hold-off-on-servicing-crypto-firms-in-wake-of-supreme-court-ruling\" data-v-f87c67ca=\"\">waiting for clarity and directions<\/a> from the Reserve Bank of India (RBI), even though the country's Supreme Court overturned the RBI's April 2018 circular that had barred banks from serving crypto exchanges and firms.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gupta","content":"PERSON"},{"type":"Quartz Smart Solution for Crypto Services","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"India","content":"LOCATION"},{"type":"TCS","content":"ORGANIZATION"},{"type":"Supreme Court","content":"ORGANIZATION"},{"type":"Reserve Bank of India","content":"ORGANIZATION"},{"type":"Tata Consultancy Services","content":"ORGANIZATION"},{"type":"Sumit Gupta","content":"PERSON"},{"type":"RBI","content":"ORGANIZATION"},{"type":"April 2018","content":"DATE"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}