{"summary":"Payments giant PayPal has disclosed that it is developing crypto capabilities\nIn a letter to the European Commission in March, PayPal said it has taken “unilateral and tangible steps to further develop its capabilities in [the crypto-assets] area”\nPayPal’s revelation is significant since it is said to be in the works to offer crypto buying and selling services to its over 300 million users","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/71483\/paypal-reveals-that-it-is-developing-crypto-capabilities","publishDate":"2020-07-14T06:31:19","id":3156,"type":null,"title":"PayPal reveals that it is developing crypto capabilities","category":["Cryptocurrency"],"content":["Payments giant PayPal has revealed that it is developing cryptocurrency capabilities.","In a <a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2020\/07\/PayPal.pdf\" data-v-f87c67ca=\"\">letter<\/a> to the European Commission in March, PayPal said it is “monitoring the evolution of the crypto-asset space” and has taken “unilateral and tangible steps to further develop its capabilities in this area,” especially since the Libra stablecoin project was announced in June 2019.","PayPal was a member of the Libra project for about four months before it <a href=\"https:\/\/www.theblockcrypto.com\/linked\/42101\/paypal-officially-drops-out-of-facebooks-libra-project\" data-v-f87c67ca=\"\">withdrew<\/a> in October 2019, along with other payment giants such as Mastercard and Visa.","PayPal’s revelation is significant since it is <a href=\"https:\/\/www.theblockcrypto.com\/linked\/69201\/paypal-venmo-crypto-buy-sell-report\" data-v-f87c67ca=\"\">said to be in the works<\/a> to offer crypto buying and selling services to its over 300 million users. PayPal's response to the commission is part of a public consultation that <a href=\"https:\/\/ec.europa.eu\/info\/law\/better-regulation\/have-your-say\/initiatives\/12089-Directive-regulation-establishing-a-European-framework-for-markets-in-crypto-assets\/public-consultation\" data-v-f87c67ca=\"\">opened<\/a> in December 2019 — the commission wanted feedback on building an EU framework for crypto-assets.","PayPal said it is supportive of such a framework. The company said blockchain and crypto-assets could help achieve “greater financial inclusion and help reduce\/eliminate some of the pain points that exist today in financial services.”","“As these technologies continue to evolve, we believe thoughtful regulation that fosters innovation while promoting clarity can help the industry grow and thrive,” said PayPal.","The company wants the commission to set clear definitions of various crypto activities to ensure adequate consumer and investor protection. PayPal has also suggested the commission to put crypto-activities within the scope of applicable anti-money laundering rules.","“Any regulatory framework in Europe should strive to be technology neutral to support innovation and competition in this fast-evolving space,” said PayPal.","The company has a license to provide banking and payments services in Luxembourg, and serves customers and businesses in 31 European jurisdictions, representing about 95 million merchants and consumers.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nPayPal has been active in the crypto space since as early as 2014. At the time, the company <a href=\"https:\/\/www.coindesk.com\/paypal-announces-first-partnerships-bitcoin-space\" data-v-f87c67ca=\"\">partnered<\/a> with three bitcoin payment processors, including Coinbase, which allowed merchants in its network to accept bitcoin as payment."],"hashtag":["CRYPTO","EUROPEAN COMMISSION"]}