{"summary":"As part of the more than 100 dockets filed by the failed crypto group — which includes Alameda Research — FTX filed motions to group entities together.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/187011\/ftx-million-creditors","publishDate":"2022-11-15T03:28:50","id":3157,"type":null,"title":"Bankrupt crypto exchange FTX says it may have more than a million creditors","category":["BANKRUPTCY"],"content":["FTX, the crypto exchange founded by Sam Bankman-Fried that filed for bankruptcy last week, said it may may have more than a million creditors in a sign of how complicated this insolvency will be to unpick.","\"As set forth in the Debtors' petitions, there are over one hundred thousand creditors in these Chapter 11 cases,\" according to a court <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.deb.188450\/gov.uscourts.deb.188450.9.0.pdf\" data-v-f87c67ca=\"\">filing<\/a> added to the federal court database system on Monday. \"In fact, there could be more than one million creditors.\"","As part of the more than 100 dockets filed by the failed crypto exchange group — which includes sister trading firm Alameda Research — FTX filed motions to group entities together, as opposed to individualizing the cases. \"The debtors submit that cause exists to modify that requirement such that the debtors will file a consolidated list of their top 50 creditors,\" the filing reads.","FTX's operators are also requesting the ability to serve bankruptcy notices to creditors via email, as opposed to at their physical residences — particularly because its customers' email addresses are already on record.","Last week's hundreds of millions of dollars of unusual crypto outflow were also noted in the filing, and the exchange claims it has been in contact with the U.S. Attorney's Office, the Securities and Exchange Commission and the Commodity Futures Trading Commission, among others. The reason for the outflows — which some <a href=\"https:\/\/www.theblock.co\/post\/186289\/ftx-claims-it-has-been-hacked-of-all-of-its-funds-website-and-mobile-app-compromised\" data-v-f87c67ca=\"\">speculate<\/a>&nbsp;was a hack or an inside job — is still unknown.","FTX <a href=\"https:\/\/www.theblock.co\/post\/185083\/ftx-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">filed<\/a> for Chapter 11 bankruptcy protection on Friday, citing somewhere between $10 billion and $50 billion in assets and liabilities, as well as more than 100,000 creditors.&nbsp;","Monday's court filing also indicates that Friday's Chapter 11 filing was declared on an emergency basis, noting: \"FTX faced a severe liquidity crisis that necessitated the filing of these cases on an emergency basis.\"","It also added: \"Questions arose about Mr. Bankman-Fried's leadership and the handling of FTX's complex array of assets and businesses under his direction.\" Sam Bankman-Fried <a href=\"https:\/\/www.theblock.co\/post\/185964\/bankman-frieds-really-really-sorry-again-following-bankruptcy-filing\" data-v-f87c67ca=\"\">resigned<\/a> on the same day FTX filed for Chapter 11 bankruptcy protection.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$10 billion","content":"MONEY"},{"type":"$50 billion","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"Alameda Research — FTX","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"last week","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"millions of dollars","content":"MONEY"},{"type":"Friday","content":"DATE"}],"hashtag":["BANKRUPTCY FILINGS","FTX"],"authors":["Adam James","The Block"]}