{"summary":"Era Lend, operating on zkSync Layer 2 network, suffered a &#x27;read-only reentrancy attack&#x27; with a loss of $3.4 million.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241314\/zksync-based-era-lend-loses-3-4-million-in-defi-exploit","publishDate":"2023-07-25T09:57:57","id":3159,"type":null,"title":"ZkSync-based Era Lend loses $3.4 million in DeFi exploit","category":["CRYPTO ECOSYSTEMS"],"content":["Era Lend, a decentralized lending protocol operating on zkSync Layer 2, become the latest victim of a reentrancy attack that resulted in a loss of $3.4 million, as <a href=\"https:\/\/twitter.com\/BlockSecTeam\/status\/1683824959452504065\" data-v-f87c67ca=\"\">confirmed<\/a> by security analysts at BlockSec.","The attack exploited a read-only reentrancy vulnerability that allowed the hacker to make repeated calls to a function within a single transaction, withdrawing more funds than they were entitled to. Taking advantage of a faulty price oracle that Era Lend relied upon, the attacker used the reentrancy exploit to further drain assets from the protocol.","Typically, view functions labeled as read-only are considered safe, often lacking reentrancy protection since they don’t change the contract’s state. The term “read-only” indicates that the function merely performs a view action, such as calculating a token balance based on a third-party pool’s supply. In this incident, the third-party was another decentralized exchange called SyncSwap. However, as this case demonstrates, these functions can be manipulated to siphon off substantial funds.","“The attacker altered the LP’s price during the burn\/mint actions of SyncSwap, using its reserves to determine the LP price [on Era Lend],” Lei Wu, co-founder and CTO of BlockSec, told The Block. “All projects that utilize the SyncSwap code should remain alert.”","“We have detected and confirmed a cyber attack on our platform. We want to assure you that the attack has been contained, and the threat actor can no longer continue their actions,” Era Lend said in a <a href=\"https:\/\/discord.com\/channels\/936926364391604245\/936938589055500368\/1133380816387452958\" data-v-f87c67ca=\"\">statement<\/a> on Discord.&nbsp;","It clarified that only the USDC pool was compromised, while the security of assets other than USDC remains intact.","As a precautionary measure, the team advised users to refrain from depositing USDC for the time being. Additionally, borrowing operations on the platform have been temporarily halted, the team added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USDC","content":"ORGANIZATION"},{"type":"$3.4 million","content":"MONEY"},{"type":"BlockSec","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"CTO","content":"ORGANIZATION"},{"type":"” Lei Wu","content":"PERSON"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}