{"summary":"Conferences held in Asia during September saw higher attendance, and the sentiment regarding the future of digital assets was notably more optimistic.\nThis first appeared in Frank Chaparro’s biweekly The Scoop Newsletter. Sign up now.","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/252619\/electric-vibe-at-asia-crypto-conferences-points-toward-growing-momentum-in-region","publishDate":"2023-09-22T15:06:15","id":316,"type":null,"title":"Electric vibe at Asia crypto conferences points toward growing momentum","category":["Companies"],"content":["Keep your eyes on Asia.","This advice comes from a wide range of sources and industry contacts who attended conferences in the region this month.","Unfortunately, I was not able to make it out this year, but apparently the vibe was electric — especially when juxtaposed against their American counterparts (hat tip to Messari and Blockworks Group for excellent lineups).","The conferences held in Asia during September saw higher attendance, and the sentiment regarding the future of digital assets was notably more optimistic. That exuberance points to the momentum that countries like South Korea and Singapore have when it comes to their digital asset industries.&nbsp;","Long-term crypto market participants will remember when Asia served as the industry's heartbeat, with \"OG\" firms like Bitfinex and BitMEX based in the region. However, this position weakened as China initiated a crackdown on the industry and imposed a ban in 2021, prompting companies to seek more favorable environments elsewhere. Indeed, the Covid-induced retail trading frenzy made the Western world a hotbed for crypto speculation, helping push companies based here to eye-popping valuations. In the wake of FTX's meltdown and the uncertain regulatory environment in the U.S., that frenzy has moved to Asia.&nbsp;","For South Korea, specifically, I am hearing that interest in crypto is incredibly strong among retail traders. Part of that has to do with the country's culture of gambling. And whilst many younger Koreans see wealth from traditional assets like real estate or corporate equities out of reach, crypto serves as a potential escape hatch from a modest lifestyle. At the institutional level, there is a lot of money ready to enter the space with certain crypto-focused firms, some of which you may not have heard of, raising over $100 million.","\"They don't buy houses, but they can buy tokens every week,\" a recent conference attendee told me. \"There is a huge market.\"","The sector can be challenging for Westerners to access, however, due to the way the corporate world is structured. Basically, to do any business there, you have to navigate the political and rigid structure of its largest corporate behemoths (think Samsung and LG). BitGo, for instance, signed a strategic agreement with Korean heavyweight Hana Bank, as Bloomberg reported. Despite the difficulties, a number of firms are just beginning to do go-to-market in South Korea because of the tepid interest right now in the U.S.&nbsp;","\"The liquidity is insane,\" another attendee said. \"But it is siloed and protectionist. You have to speak Korean.\"","One trading firm, which requested anonymity in this column, revealed that they have been waiting for five years to operate as a liquidity provider in the country.","\"When they open up we can be first in line,\" they said. \"It's a great retail market.\"","Indeed, South Korea-based Upbit typically sees more monthly trading volumes than U.S.-based Coinbase, as The Block's data dashboard shows. So far this month, Coinbase has recorded $14 billion in spot trading volumes, while Upbit has surpassed it with $23 billion.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/cryptocurrency-exchange-volume-monthly\/embed\" title=\"Cryptocurrency Monthly Exchange Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","As for Hong Kong, the city has made its own push to be more crypto friendly, with China apparently quietly working behind the scenes to make the city a potential breeding ground for crypto innovation. A Bloomberg <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-02-21\/hong-kong-s-crypto-hub-ambitions-win-quiet-backing-from-beijing\" data-v-f87c67ca=\"\">report<\/a> at the beginning of the year highlighted that Hong Kong had \"rolled out the red carpet for crypto businesses.\"","Here's a relevant passage from the report:","Representatives from China’s Liaison Office and other officials have been frequent guests at the city’s crypto gatherings over the past months, swapping business cards and WeChat details, said people familiar with the matter, who asked not to be named discussing private information. The encounters have been friendly, with officials checking on developments, asking for reports and in some cases making follow-up calls, the people said.","\"This Asia trip blew my mind,\" noted another attendee.&nbsp;","\"The excitement in Korea and Singapore is polar opposite of what’s going on in the U.S.\"","<strong data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">This first appeared in Frank Chaparro's biweekly The Scoop Newsletter.&nbsp;<a href=\"https:\/\/www.theblock.co\/newsletters\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Sign up<\/a>&nbsp;now.&nbsp;<\/em><\/strong>"],"hashtag":[]}