{"summary":"During the 4th Digital China Summit, China’s central bank made by far the most extensive demonstration of its work on the central bank digital yuan.\nNot only did the central bank sport a dedicated booth for the e-CNY, major commercial banks and tech giants also showcased various use case scenarios.","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/102942\/china-bank-prototype-payments-digital-yuan","publishDate":"2021-04-27T10:35:58","id":3160,"type":null,"title":"Bank prototype reveals how China wants foreigners to adopt the digital yuan","category":["China"],"content":["Bank of China, one of the \"big four\" state-owned commercial banks, has showcased a machine prototype that's designed to let foreigners try out China's central bank digital currency.","During the 4th Digital China Summit <a href=\"https:\/\/www.szzg.gov.cn\/\" data-v-f87c67ca=\"\">organized<\/a> by several Chinese central government ministries over the weekend, the People's Bank of China (PBoC) made by far the most extensive demonstration of its work on the country's central bank digital yuan, known as e-CNY or DC\/EP.","Not only did the PBoC host its own exhibition area to educate the public on the adoption of e-CNY, major state-owned commercial banks as well as technology giants like Alibaba's Ant Group, Tencent, JD.com and Huawei all set up booths to showcase their e-CNY wallet services.&nbsp;","The efforts signal that China is moving closer to a roll-out of the e-CNY. What's more, the developments spoke to the competition among the issuers of the digital yuan – i.e. the state-owned commercial banks and third-party payment providers like AliPay and WeChat Pay – that's rising up as they are geared towards seizing more market shares in the future.","Indeed, Bank of China demonstrated a machine prototype for the first time during the summit, which can convert 16 foreign currencies into the e-CNY, according to business publication Yicai's <a href=\"https:\/\/www.yicai.com\/news\/101033731.html\" data-v-f87c67ca=\"\">report<\/a> on Monday.","The idea is that overseas nationals with valid passports can put foreign banknotes into the machine, which will issue a physical e-CNY card based on the exchange rate. The card looks similar to the card-based digital yuan hardware wallet <a href=\"https:\/\/www.theblockcrypto.com\/daily\/90503\/shanghai-test-digital-yuan-hardware\" data-v-f87c67ca=\"\">reported<\/a> by The Block in January.&nbsp;","The prototype of the e-CNY card for foreigners also has a small screen that shows the available balance of the hardware wallet and can be used in shops that have an e-CNY payment terminal. The report added that it will be put into real-world use during the next Winter Olympics, slated for February 2022 in Beijing.","Although China has not decided on the timeline of an official launch, it is nonetheless pushing for wider usage gradually through tests and trials.","With the May 1 holiday season coming up in China, the Shanghai government is expected to conduct its first city-wide e-CNY giveaway campaign to increase public awareness as well as boost domestic consumption, the Yicai report added.","It's unclear how much money the giveaway will feature but Shanghai is set to become the fifth city to issue the free e-CNY after Shenzhen, Suzhou, Beijing and Chengdu.","Meanwhile, e-commerce giant JD.com announced during the Digital China Summit that its support for the e-CNY has expanded beyond online shopping, according to business publication Jiemian's <a href=\"https:\/\/www.jiemian.com\/article\/6014005.html\" data-v-f87c67ca=\"\">report<\/a> on Monday. The firm said it tested paying two of its suppliers as well as some of its employees' salaries in digital yuan this year.","The Summit also saw Ant Group and Tencent demonstrate their e-CNY wallet services in public for the first time.","Although it's been known since 2019 that Ant Group and Tencent have been participating in the development process of the e-CNY, the companies have remained discreet on details, particularly given Ant Group's landmark duo-IPO in Shanghai and Hong Kong was halted by Chinese regulators.","Ant Group only <a href=\"https:\/\/www.theblockcrypto.com\/daily\/91224\/alipay-digital-yuan-test-shanghai\" data-v-f87c67ca=\"\">conducted<\/a> a three-day test of the digital yuan recently through its AliPay app for its authorized employees in Shanghai quietly.","Elsewhere at the event, Huawei revealed a design prototype for how the e-CNY can be used in an offline environment to pay for staff-less hotel rooms. The <a href=\"https:\/\/smart.huanqiu.com\/article\/42sRp4M2aox\" data-v-f87c67ca=\"\">demo video<\/a> from Global Times shows that the idea is to let users check-in and pay for a hotel room in digital yuan by touching their mobile phones with a terminal on the door through the e-CNY's <a href=\"https:\/\/www.theblockcrypto.com\/linked\/89902\/shenzhen-third-digital-yuan-test\" data-v-f87c67ca=\"\">touch-to-pay<\/a> capability.","",""],"hashtag":[]}