{"summary":"Anurag Arjun, a co-founder of Polygon, departed as the company spun off its modular blockchain project, Avail.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/220454\/polygon-avail-anurag-arjun","publishDate":"2023-03-16T09:30:10","id":3166,"type":null,"title":"Polygon spins off project Avail and co-founder departs","category":["PEOPLE"],"content":["Anurag Arjun, a co-founder of Polygon, departed as the company spun off its modular blockchain project, Avail.","\"Avail will be spun off completely from Polygon Labs,\" Polygon said in a blog post shared with The Block. Arjun \"is moving out of Polygon Labs and will become Avail's sole steward and will continue to lead the project in a separate, standalone and self-funded entity.\"","Polygon initiated the Avail project in late 2020 and <a href=\"https:\/\/www.theblock.co\/post\/141116\/polygon-releases-testnet-plans-for-a-new-scalability-focused-blockchain-called-avail\" data-v-f87c67ca=\"\">introduced<\/a> it publicly in mid-2021. Arjun co-created the project and, as part of the spin-off, it is now acquired by a corporate entity wholly owned by Arjun, an Avail spokesperson told The Block.","\"In due course, the structure will evolve into a decentralized organization,\" the spokesperson added. \"The timing of that evolution has not yet been determined, with the immediate focus being ensuring a smooth transition away from Polygon ownership.\"","Avail is a modular blockchain that allows developers to build customizable and scalable applications. Unlike monolithic blockchains — such as Ethereum and Solana — modular blockchains break down the essential functions of consensus, security, data availability and execution, and handle them separately.","\"Avail decouples the data availability layer, making it easier for chain developers to focus on execution and settlement,\" Arjun said in a separate blog post shared with The Block. \"By using Avail, it allows builders to make their applications fast, efficient, and scalable.\"","Avail is currently live on a testnet, with the mainnet to follow in the near future. As part of the spin-off, Avail will create a new not-for-profit foundation, the Avail Foundation, and eventually hand over governance to a community.","\"The spin-off is a win-win,\" Polygon said in its blog post. \"Avail will benefit from being developed autonomously in an innovative and independent manner. Polygon Labs can increase Ethereum-alignment and focus on developing scaling products, a portfolio that already includes the Polygon PoS [proof of stake] chain, three zero-knowledge solutions (Polygon zkEVM, Polygon Zero and Polygon Miden), Polygon Supernets and a number of smaller efforts.\"","As part of the deal, the entire Avail team at Polygon will move to Arjun's new entity, the Avail spokesperson said — declining to comment on the size of the team.","\"I have a great relationship with Anurag, on a personal level,\" Sandeep Nailwal, co-founder of Polygon, told The Block. \"I might also invest in his new endeavor.\"","When asked if Avail has started raising funds, the Avail spokesperson declined to comment. They also declined to comment when asked if Avail has its own native token, but said: \"Avail's plan is to eventually become a community-owned protocol.\"","The spin-off comes shortly after Polygon <a href=\"https:\/\/www.theblock.co\/post\/213586\/polygon-labs-cuts-staff-by-20-in-consolidation\" data-v-f87c67ca=\"\">cut<\/a> around 100 jobs, or 20% of its workforce, late last month.","The native token of Polygon, MATIC, is down around 4% on the day at about $1.15, according to <a class=\"c-link\" href=\"https:\/\/www.coingecko.com\/en\/coins\/polygon\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.coingecko.com\/en\/coins\/polygon\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">CoinGecko<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Arjun","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"Avail spokesperson","content":"ORGANIZATION"},{"type":"Avail Foundation","content":"ORGANIZATION"},{"type":"Sandeep Nailwal","content":"PERSON"},{"type":"\" Polygon","content":"ORGANIZATION"},{"type":"Anurag Arjun","content":"PERSON"},{"type":"\" Arjun","content":"PERSON"},{"type":"$1.15","content":"MONEY"},{"type":"Anurag","content":"PERSON"},{"type":"Ethereum","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"Avail","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"}],"hashtag":["MOVES","POLYGON","PRIVATE COMPANY M&AMP;A","SIDECHAINS"],"authors":["Yogita Khatri","The Block"]}