{"summary":"The total amount of money locked into DeFi applications and protocols has crossed $1 billion\nMaker remains the market leader with nearly 60% dominance\nBut, is the value locked an ideal metric? The Block’s Matteo Leibowitz noted last month that the metric fails to accurately reflect DeFi activity","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/55212\/value-locked-into-defi-protocols-has-crossed-1-billion","publishDate":"2020-02-07T03:10:10","id":3167,"type":null,"title":"Value locked into DeFi protocols has crossed $1 billion","category":["DeFi"],"content":["The total amount of money locked into decentralized finance (DeFi) applications and protocols has crossed a milestone of $1 billion.","There has been a growth of nearly 100% since the start of this year as the amount locked was $670.77 million as of Dec. 31, 2019, according to <a href=\"https:\/\/defipulse.com\/\" data-v-f87c67ca=\"\">DeFi Pulse<\/a>. The current locked value stands at around $1.01 billion.","Maker, the Ethereum-based lending protocol, remains the leader in the space with nearly 60% dominance. The amount of funds locked in Maker is now worth over $597 million.","","","Some market observers note that the surge in DeFi value is mostly because of the price of ether (ETH) has been going up lately. The ETH price has <a href=\"https:\/\/www.coingecko.com\/en\/coins\/ethereum\" data-v-f87c67ca=\"\">gone up<\/a> by over 52% in the last 30 days, according to CoinGecko.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">But, is value locked an ideal metric?<\/strong><\/span>","While the total value locked provides an idea of the DeFi growth, it falls short in accurately reflecting DeFi activity, as The Block’s research analyst Matteo Leibowitz <a href=\"https:\/\/www.theblockresearch.com\/introducing-the-blocks-open-finance-index-ofi-49568\" data-v-f87c67ca=\"\">noted<\/a> last month. For instance, the value locked fails to account for decentralized exchange volumes.","In an attempt to more accurately measure DeFi activity, Leibowitz developed an alternative metric - <a href=\"https:\/\/www.theblockresearch.com\/introducing-the-blocks-open-finance-index-ofi-49568\" data-v-f87c67ca=\"\">The Block’s Open Finance Index (OFI)<\/a>.&nbsp; OFI departs from total value locked by aggregating vertical-specific metrics, including outstanding debt for lending, transaction volume for payments and volume for exchanges.","Per the version one of OFI, the DeFi market grew significantly over the past 12 months (218%) as of last month, although not nearly at the rate suggested by the total value locked metric (297%). Leibowitz noted at the time that the market can expect further growth in 2020 as protocol developers make use of improved infrastructure and concentrate efforts on user experience.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nNotably, The Block OFI's version one excluded protocols such as Synthetix, Nuo and Connext, largely due to lack of easily available data."],"hashtag":[]}