{"summary":"Prosecutors proposed an instruction that the defendant’s intent to repay misappropriated funds is not a defense.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/258599\/us-prosecutors-bankman-frieds-lawyers-submit-requests-on-jury-instructions","publishDate":"2023-10-20T03:05:21","id":3168,"type":null,"title":"US prosecutors, Bankman-Fried’s lawyers submit requests on jury instructions","category":["LEGAL"],"content":["<span data-v-f87c67ca=\"\">Sam Bankman-Fried’s lawyers and U.S. prosecutors have submitted their revised proposals for potential jury instructions for District Judge Lewis A. Kaplan to consider in an <\/span><a href=\"https:\/\/www.theblock.co\/post\/258573\/inside-sbfs-trial-ftx-general-counsel-quit-after-he-learned-of-massive-hole-in-balance-sheet\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">ongoing criminal trial for the failed crypto exchange founder<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">In a Thursday <\/span><a href=\"https:\/\/www.courtlistener.com\/docket\/66631291\/326\/united-states-v-bankman-fried\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">letter<\/span><\/a><span data-v-f87c67ca=\"\"> filed to the judge, the prosecutors requested an instruction that a defendant’s intent to repay misappropriated or fraudulently obtained funds is not a defense. <\/span><span data-v-f87c67ca=\"\">“Over the course of the trial, the defense has attempted to introduce evidence and argument to suggest that the defendant’s misappropriation of FTX customer funds was not criminal because he believed that he would ultimately be able to repay customers,” the prosecutors wrote.<\/span>","<span data-v-f87c67ca=\"\">The Department of Justice added that, as the court noted previously, “it is immaterial as a matter of law whether the defendant intended to repay the misappropriated funds because the offense is ‘complete’ where, as alleged here, there is an ‘immediate intent to misapply and defraud.’”<\/span>","<span data-v-f87c67ca=\"\">The prosecutors also requested an instruction that it is not a defense if the defendant was motivated by his moral or political beliefs to break the law. Specifically, the DOJ said that the defendant has in certain public statements emphasized his philosophy of so-called “effective altruism” to argue that his business decisions were motivated by a desire to do good in the world.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Any such arguments are not a defense to fraud or other criminal charges, as courts have repeatedly recognized,” the DOJ added. “[Good] motive alone is not a defense.”<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, Bankman-Fried’s defense counsel said in a Thursday <\/span><a href=\"https:\/\/www.courtlistener.com\/docket\/66631291\/327\/united-states-v-bankman-fried\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">filing<\/span><\/a><span data-v-f87c67ca=\"\"> that the jury should understand that the U.S. only has crimes that are defined by statute. “The fact that you may think something is morally wrong or unfair, is truly of no interest whatsoever.”<\/span>","<span data-v-f87c67ca=\"\">“Some vague feeling or belief that something wrong has been done, or that some law should have prevented it, is insufficient to convict anyone of any charge whatsoever,” Bankman-Fried’s attorneys added. “A witness’s stated feeling or belief as to what the law should or should not have prohibited is not sufficient to convict anyone of any charge.”<\/span>","<span data-v-f87c67ca=\"\">When it comes to the charge of wire fraud on FTX customers, the defense team said that the purpose of the scheme to defraud must be to obtain money or property.&nbsp;<\/span><span data-v-f87c67ca=\"\">“The term ‘property’ includes traditional property interests,” the attorneys continued. “Property does not include intangible interests such as the right to control the use of one’s assets, nor does it include potentially valuable economic information that a person might consider valuable in deciding how to use his or her assets.”<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried’s trial will take a week-long hiatus and is expected to resume on Oct. 26.<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Lewis A. Kaplan","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"Oct. 26","content":"DATE"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FTX","SAM BANKMAN-FRIED","SBF TRIAL"],"authors":["Timmy Shen","The Block"]}