{"summary":"Japan’s Ministry of Finance, the Financial Services Agency and the central bank are said to have joined forces to promote research on digital currencies\nOfficials from the three agencies recently discussed how digital currencies might impact the global currency system ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/56775\/japanese-authorities-collaborate-to-advance-digital-currency-research","publishDate":"2020-02-24T06:51:10","id":317,"type":null,"title":"Japanese authorities collaborate to advance digital currency research","category":["Asia"],"content":["Three Japanese authorities - the Ministry of Finance, the Financial Services Agency (FSA) and the Bank of Japan (BOJ) - are said to have joined forces to promote research on digital currencies.","The agencies have held several meetings to discuss the economic impacts of digital currencies, the Japan Times <a href=\"https:\/\/www.japantimes.co.jp\/news\/2020\/02\/22\/business\/tech\/japans-financial-monetary-authorities-examine-creation-digital-currencies\/#.XlOMJygzY2w\" data-v-f87c67ca=\"\">reported<\/a> Saturday, citing JIJI Press. Their most recent meeting reportedly took place last month.","The meeting brought together Yoshiki Takeuchi, vice minister of finance for international affairs; Ryozo Himino, FSA vice minister for international affairs; and Shinichi Uchida, BOJ executive director for international affairs, per the report.","The three officials are said to have discussed how digital currencies might impact the global currency system, which is dominated by the U.S. dollar, as well as other issues.","“We are advancing research and study from the technical and legal perspectives so that we will be able to move in an appropriate way when there is a growing need,” BOJ Governor Haruhiko Kuroda was quoted as saying in the report.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">Digital yen research efforts&nbsp;<\/strong>","Japan appears to have quickened its efforts to research digital currencies in recent weeks. Last month, the BOJ <a href=\"https:\/\/www.theblockcrypto.com\/post\/53545\/uks-central-bank-to-explore-digital-currency?li_source=LI&amp;li_medium=right-column\" data-v-f87c67ca=\"\">partnered<\/a> with five other major central banks - the Bank of England, the Bank of Canada, the European Central Bank, the Sveriges Riksbank (Sweden) and the Swiss National Bank - to explore digital currencies.","Earlier this month, Japan’s ruling Liberal Democratic Party <a href=\"https:\/\/www.theblockcrypto.com\/linked\/55355\/japan-should-create-its-digital-currency-within-2-3-years-says-a-senior-lawmaker\" data-v-f87c67ca=\"\">said<\/a> it was working on digital currency proposals to curb the potential influence of China’s upcoming digital yuan.","Japan’s Finance Minister Taro Aso, however, yesterday <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2020-02-23\/japan-s-aso-expresses-concerns-over-china-s-digital-yuan?srnd=premium\" data-v-f87c67ca=\"\">warned<\/a> that China’s digital currency needs more work before any issuance. “There is a big risk in a central bank digital currency unless the regulation is well-sorted I would say ‘hold on’ for the issuance of a government-backed digital currency, at least for now,” he said.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nWhile Japan has no immediate plans to issue digital yen, several officials have recently commented on the prospects of one. Last month, BOJ deputy governor Masayoshi Amamiya <a href=\"https:\/\/www.theblockcrypto.com\/linked\/54492\/japans-central-bank-must-be-prepared-to-issue-digital-currency-says-deputy-governor\" data-v-f87c67ca=\"\">said<\/a> the central bank \"must be prepared\" to issue a digital currency if public demand for it soars."],"hashtag":[]}