{"summary":"Indonesian investment app Pluang has announced a $55 million funding round led by Accel. \nThe company plans to use the extra dosh to dive deeper into crypto, with wallets, staking, and NFT support in the product pipeline. ","author":["Tom Matsuda","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/130014\/pluang-raise","publishDate":"2022-01-12T06:25:00","id":3170,"type":null,"title":"Indonesian financial super-app Pluang raises $55 million from Accel","category":["Fintech"],"content":["Indonesian investment super-app Pluang has announced a $55 million round led by Accel. A wide range of additional investors also participated in the round, with Monzo COO Sujata Bhatia, Axie Infinity founders <span data-v-f87c67ca=\"\">Aleksander Leonard Larsen and Jeffrey Zirlin, and even The Chainsmokers joining the fray. <\/span>&nbsp;","The raise comes at a pivotal time for fintech in South East Asia. Last year, fintech startups in the region raised <a href=\"https:\/\/app.dealroom.co\/transactions.rounds\/f\/growth_stages\/not_mature\/industries\/anyof_fintech\/regions\/anyof_Southeast%20Asia\/rounds\/not_GRANT_SPAC%20PRIVATE%20PLACEMENT\/tags\/not_outside%20tech?showStats=YEAR&amp;sort=-amount&amp;statsType=rounds\" data-v-f87c67ca=\"\">$6 billion from investors<\/a>. Pluang's raise is just the beginning of what should be a banner year for fintech in South East Asia, according to Accel's Ethan Choi, who compared the upcoming year to Latin America's fintech boom in 2021.&nbsp;","Set up by Claudia Kolonas and Richard Chua after meeting at Harvard, Pluang began by offering gold as a trading asset and later expanded into indexes, mutual funds, and crypto.&nbsp;","<span data-v-f87c67ca=\"\">\"Their story is very unique to Indonesia in that they started with gold. There are 16 times more gold investors than equities in Indonesia and there are 80 million gold investors in the country,\" explains Accel's Ethan Choi. \"They used [gold] as an entryway to get people used to buying assets, and investing online.\"<\/span>","Pluang's founders aim to increase access to financial investment tools for Indonesians so that the population is able to participate in markets to drive wealth creation. While the app currently only offers access to shares traded on the US stock market, Kolonas says that she is looking at introducing Indonesian ETFs and stocks, which will guide the company's acquisition strategy in the region.&nbsp;","Along with the traditional stock market, Pluang is looking to build out its crypto offerings to tap into the growing interest in digital assets in the country.&nbsp;","\"When we launched [digital asset trading], we were just trying to get users to dip their toes into crypto,\" says Kolonas. \"What we didn't expect was that crypto now has almost 10 million users in Indonesia — larger than the stock market.\"&nbsp;","Similar to crypto investment products offered by fellow financial super-app Revolut, Pluang currently offers a walled garden approach, withholding the ability for users to withdraw their crypto from the app. Chua says, however, that support for NFTs, DeFi, and even a possible crypto wallet are all in the pipeline as the startup tries to emulate the features of a typical crypto exchange."],"hashtag":["FINTECH"]}