{"summary":"Pinar Emirdag, a senior vice president at State Street and head of Digital Product Development and Innovation, has left the firm\nEmirdag had been overseeing a dedicated digital assets team based in London at the world’s second-largest custodian bank \nShe is the second major departure from the team in recent months, following Moiz Kohari’s exit","author":["Isabel Woodford","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/32489\/state-streets-digital-assets-lead-has-left-the-firm","publishDate":"2019-07-18T09:17:02","id":3172,"type":null,"title":"State Street&#x27;s Digital Assets lead has left the firm","category":["Institutional Investors"],"content":["State Street has seen another casualty in its digital assets hub.&nbsp;","<a href=\"https:\/\/www.linkedin.com\/in\/pinaremirdag\/?originalSubdomain=uk\" data-v-f87c67ca=\"\">Pinar Emirdag<\/a>, State Street's head of Digital Product Development and Innovation, has left her role at the bank, The Block has learned.&nbsp;","Emirdag joined the bank at its London-base in April 2017 \"to lead and control strategy and execution of the firm's digital assets initiatives,\" according to a press release at the time. She was previously involved with several high-profile blockchain firms including Clearmatics, R3, and Hyperledger, and had also held a position at the London Stock Exchange.","A representative at the bank said it could not comment further about the reason for Emirdag's departure, but confirmed the news had been announced internally in recent weeks.","The company also lost its global blockchain chief, Moiz Kohari, in May, after he&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/tiny\/state-streets-blockchain-chief-departing-bank-to-set-up-data-privacy-startup\/\" data-v-f87c67ca=\"\">announced<\/a> he was leaving to launch a startup which utilises blockchain technology for data privacy. Kohari helped develop State Street's broad DLT programme since joining in 2016.","It is unknown where Emirdag's next role will be, although her LinkedIn suggests she is still an advisor for several firms as well as a board member at University College London's Centre for Blockchain Technology.&nbsp;","She spoke <a href=\"https:\/\/www.imn.org\/audiofull\/1059%7C02205C6D79731E9AB?wle=aXNhYmVsQHRoZWJsb2NrY3J5cHRvLmNvbQ%3D%3D\" data-v-f87c67ca=\"\">at the Synchronize conference in London<\/a> last month, telling the audience that she saw no end to the range of possibilities with digital assets.","\"We are talking about new types of assets which are going to drive liquidity and broader distribution, and broader changes in financial changes,\" she said.","\"This is not about blockchain, this is something our clients have been looking into....And if money is going to change, you can think about valuations, trading, issuance, custody, the entire value chain of what happens with tokenization.\""],"hashtag":[]}