{"summary":"Plans are revealed for the proof of work based fork, ETHPoW, however some contend that critical details are late in coming.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/169466\/official-ethereumpow-ethw-fork-date-announced","publishDate":"2022-09-12T19:09:50","id":3173,"type":null,"title":"Official EthereumPoW (ETHW) fork date announced","category":["THE MERGE"],"content":["The Ethereum proof of work fork will deploy within 24 hours of The Merge.","That's according to a Twitter announcement by @EthereumPoW, the social media account behind the forthcoming ETHPoW mainnet, which laid out the plan in a <a href=\"https:\/\/twitter.com\/EthereumPoW\/status\/1569427804764405761?s=20&amp;t=TnFAG2ZU64PjFtpMW0e4vw\" data-v-f87c67ca=\"\">thread<\/a> detailing the strategy.","An official announcement is expected one hour before the exact time of the network launch. Afterwards the ETHPoW chainID will switch to 10001, and final code, config files, binaries, as well as other vital materials such as node data, RPC and explorer info will be made available.","To provide sufficient time for the chainID switch to take place, the mainnet will go live at the specified time after 2048 empty blocks are processed, meaning that the first ETHPoW block to contain any transactions on the mainnet will be the Merge block +2049 according to thread.","The decision to delay the code release and update the chainID until the last minute has some developers puzzled.","Days ago Coinbase Distinguished Software Engineer Roberto Bayardo submitted a GitHub <a href=\"https:\/\/github.com\/ethereumpow\/go-ethereum\/pull\/17\" data-v-f87c67ca=\"\">pull request<\/a> on behalf of Coinbase to clarify EthereumPoW fork code availability and activation, where it was noted that a new chainID had yet to be submitted, and that using the same chainID post-merge would pose a significant risk to replay, or double-spend attacks.","Although the ETHPoW team responded to Bayardo, indicating that steps are being taken to mitigate replay attacks, deferring the public release of the code until the cusp of the merge has drawn comments of criticism from other users.","GitHub user mrtestyboy781&nbsp;stated that any serious organization requires time to run regression tests prior to running code in a production environment, and asks why the team has not implemented a function to switch the chainID terminal total difficulty is reached.","\"That requires a developer intern with a high school understanding of if conditionals. Probably can't find one,\" replied RotKi founder Lefteris Karapetsas.","With these details coming clear just days before <a href=\"https:\/\/www.theblock.co\/category\/the-merge\" data-v-f87c67ca=\"\">The Merge<\/a>, it remains to be seen how an ETHPoW chain will be perceived by users and exchanges.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2048","content":"DATE"},{"type":"Bayardo","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Coinbase Distinguished Software","content":"ORGANIZATION"},{"type":"Roberto Bayardo","content":"PERSON"},{"type":"RPC","content":"ORGANIZATION"},{"type":"Lefteris Karapetsas","content":"PERSON"}],"hashtag":["ETHEREUM"],"authors":["Jeremy Nation","The Block"]}