{"summary":"Visa now has 50 active partnerships with crypto firms, up from 35 just four months ago.\nVisa’s head of crypto Cuy Sheffield told The Block that crypto and stablecoins are on track to become an important part of the financial future.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/110775\/visas-crypto-partnerships-grow-by-43-in-four-months","publishDate":"2021-07-08T06:20:27","id":3175,"type":null,"title":"Visa&#x27;s crypto partnerships grow by 43% in four months","category":["Cryptocurrency"],"content":["The number of Visa's partnerships with crypto firms has grown by 43% in the last four months.","<a href=\"https:\/\/usa.visa.com\/visa-everywhere\/blog\/bdp\/2021\/07\/06\/crypto-linked-cards-see-1625612645562.html\" data-v-f87c67ca=\"\">Visa now has<\/a> 50 active partnerships, up from 35 just four months ago, the company's head of crypto, Cuy Sheffield, told The Block. That means 50 crypto firms have launched or are set to launch debit and credit cards with the payments technology giant.","Some of the notable partnerships include those with <a href=\"https:\/\/www.theblockcrypto.com\/post\/82683\/coinbase-visa-crypto-debit-card-us-launch-bitcoin-2021\" data-v-f87c67ca=\"\">Coinbase<\/a>, <a href=\"https:\/\/www.binance.com\/en\/cards\" data-v-f87c67ca=\"\">Binance<\/a>, <a href=\"https:\/\/crypto.com\/cards\" data-v-f87c67ca=\"\">Crypto.com<\/a>, and others. These firms offer Visa-linked debit cards, which help their customers to spend cryptocurrencies at Visa's global network of 70 million merchants. <a href=\"https:\/\/www.theblockcrypto.com\/linked\/110557\/blockfi-is-shipping-out-its-bitcoin-rewards-credit-card\" data-v-f87c67ca=\"\">BlockFi<\/a>, on the other hand, offers a Visa credit card that allows customers to spend fiat and get rewards in crypto.","Visa said more than $1 billion has been spent via its crypto-linked cards in the first six months of this year.","\"We've seen a lot of momentum since we first set out on this journey,\" Sheffield told The Block. \"As we look to the future, cryptocurrency and stablecoins are on track to become an important part of the broader digital transformation of financial services, and we're excited to help shape and support that development.\"","Crypto exchange FTX is the latest firm to partner with Visa. FTX has joined Visa's Fintech Fast Track Program, which helps firms to launch card programs, among other things. It is not clear whether FTX is going to launch a Visa-linked card. The exchange operator's CEO Sam Bankman-Fried did not respond to The Block's request for comment by press time. FTX's U.S. entity, FTX.US, currently <a href=\"https:\/\/help.ftx.us\/hc\/en-us\/articles\/1500004008701-Swipe-FAQ\" data-v-f87c67ca=\"\">offers<\/a> a Visa-linked debit card, which is powered by Swipe — a <a href=\"https:\/\/www.theblockcrypto.com\/post\/70592\/binance-completes-acquisition-of-crypto-debit-card-provider-swipe-lists-its-sxp-token\" data-v-f87c67ca=\"\">Binance-owned<\/a> crypto cards provider.","As for Visa, the company appears to be upping its focus on the crypto sector. It recently <a href=\"https:\/\/www.theblockcrypto.com\/post\/110119\/visa-makes-five-strategic-crypto-hires-and-placements\" data-v-f87c67ca=\"\">made five hires and placements<\/a> to its crypto team, as The Block reported last week. The company is looking to add even more people to its crypto team across product management, business development, and engineering functions.","Besides crypto card programs, Visa has also entered into stablecoin settlements. The company recently <a href=\"https:\/\/www.theblockcrypto.com\/post\/99639\/visa-now-settles-payments-in-usdc-stablecoin-ethereum\" data-v-f87c67ca=\"\">became<\/a> the first major payments network to use the USDC stablecoin to settle a transaction. Visa trialed the USDC stablecoin settlement with Crypto.com, meaning the latter did not have to sell crypto to cover its obligations to Visa in cash and paid directly in USDC. Visa plans to offer the USDC settlement capability to additional partners later this year.","Looking into the future, Visa also plans to support payments with <a href=\"https:\/\/www.theblockcrypto.com\/daily\/102347\/visa-merchants-cbdc-central-bank-digital-currency\" data-v-f87c67ca=\"\">central bank digital currencies or CBDCs<\/a>. \"We think that for CBDC to be successful, it's important that CBDC can be accepted at any merchant that already accepts Visa credentials today, instead of merchants having to upgrade their terminals just to be able to access and let a consumer spend from a balance of CBDC,\" Sheffield told The Block recently.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to subscribe to The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/t.me\/the_block_crypto\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/t.me\/the_block_crypto\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Telegram<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>"],"hashtag":[]}