{"summary":"Agam served as a Chief Information Security Officer to two other firms for a combined five years previously.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/271351\/blockchain-analytics-firm-chainalysis-hires-chief-information-security-officer","publishDate":"2024-01-09T14:16:04","id":3179,"type":null,"title":"Blockchain analytics firm Chainalysis hires Chief Information Security Officer","category":["COMPANIES"],"content":["Blockchain analytics firm Chainalysis hired Omesh Agam as its Chief Information Security Officer.&nbsp;","Agam will head security engineering, operations, compliance and other endeavors for Chainalysis's global security team, the firm wrote in a <a href=\"https:\/\/www.chainalysis.com\/blog\/welcoming-omesh-agam-as-ciso\/\" data-v-f87c67ca=\"\">release<\/a>.&nbsp;","\"I look forward to working with the security team and folks across <a href=\"https:\/\/www.theblock.co\/post\/264310\/kpmg-chainalysis-crypto-crime-canada\" data-v-f87c67ca=\"\">Chainalysis<\/a> to contribute to this important mission, and am pumped to dive in and help securely scale the platform and organization,\" Agam said.&nbsp;","Prior to joining Chainalysis, Agam served as the CISO for the professional services firm Celonis for two years and at the software company Appian Corporation for three years, according to Agam's LinkedIn <a href=\"https:\/\/www.linkedin.com\/in\/oagam\/\" data-v-f87c67ca=\"\">profile<\/a>.&nbsp;","In October 2023, Chainalysis cut <a href=\"https:\/\/www.theblock.co\/post\/254051\/chainalysis-lays-off-15-of-staff-plans-to-focus-on-public-sector\" data-v-f87c67ca=\"\">150<\/a> employees comprising about 15% of its staff. Leadership at the time noted that market conditions forced the firm to reduce its expenses as it shifts to focusing on government contracting as opposed to the commercial market, The Block previously reported.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Chainalysis","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Agam","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Omesh Agam","content":"PERSON"},{"type":"15%","content":"PERCENT"},{"type":"Chainalysis","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Appian Corporation","content":"ORGANIZATION"},{"type":"October 2023","content":"DATE"}],"hashtag":["HIRING"],"authors":["MK Manoylov","The Block"]}