{"summary":"Popular NFT marketplace Rarible has secured $14.2 million in a Series A round led by venture capital funds Venrock and CoinFund. \nThe platform also announced it will launch a marketplace on the Flow blockchain in an effort to take NFTs mainstream. ","author":["Saniya More","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/109327\/rarible-aims-to-take-nfts-mainstream-with-new-funding-layer-2-adoption","publishDate":"2021-06-24T13:13:34","id":3179,"type":null,"title":"Rarible aims to take NFTs mainstream with new funding, Layer 2 adoption","category":["NFTs"],"content":["NFT marketplace Rarible has raised $14.2 million in a Series A round led by venture capital funds Venrock and CoinFund, with participation from 01 Advisors, a venture and advisory firm.","In tandem with the news, the platform also announced it will launch a marketplace on the Flow blockchain in a bid to take NFTs mainstream. Flow also powers the popular NFT basketball platform NBA Top Shot.","According to Rarible co-founder Alexander Salnikov, the marketplace plans to partner with several low-cost and environmentally-friendly blockchains.&nbsp;","<span data-v-f87c67ca=\"\">“Flow has a fantastic track record of bringing NFTs mainstream by creating native experiences for non-crypto audiences,” Salnikov said in a statement. “As a blockchain, Flow enables easier access and lowers the entry barrier for consumers and brands via gasless minting, low-cost transactions, and scalability. As we enter the next stage, pursuing to further pioneer the mass adoption of NFTs, we see Flow as a perfect partner for this journey.”<\/span>","According to Salnikov, the Series A funding will be used to make new hires as well as to continue developing the marketplace. More specifically, the Rarible team plans to adopt a layer 2 solution to bring down gas costs, which will make it easier for any digital artist to enter the space and sell their work. The team also plans to make the consumer experience more user-friendly and seamless by allowing users to carry out transactions using a debit or credit card.","Lastly, the team is working on launching a decentralized protocol that will be governed by its own DAO, which it says will \"place decision-making power in the hands of our community.\"","The Rarible marketplace, which launched in 2020, experienced a significant <a href=\"https:\/\/coinmarketcap.com\/currencies\/rarible\/\" data-v-f87c67ca=\"\">increase<\/a> in trading activity with the NFT boom that took place earlier this year. However, it also encountered some issues with user verification, and some artists <a href=\"https:\/\/www.theblockcrypto.com\/daily\/83110\/users-are-gaming-the-most-popular-nft-marketplace-and-some-artists-feel-left-out-in-the-cold\" data-v-f87c67ca=\"\">complained<\/a> that already verified users with large followings were gaming the platform via wash-trading.","Following the reports, the marketplace introduced buyer and seller fees to discourage wash trading, and the Rarible team said it has created more avenues for users to report \"pointless transactions.\"","While there has been an overall decline in NFT transactions, Salnikov said he doesn't believe the hype around the digital collectibles is dying.&nbsp;","<span data-v-f87c67ca=\"\">\"Even at the height of all the publicity and hype around NFTs, less than <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">1 percent<\/span><\/i><span data-v-f87c67ca=\"\"> of the world was in the market — and that is still true today,\" he said.<\/span>","<span data-v-f87c67ca=\"\">\"NFTs provide such a utility for artists, giving creators digital rights to their work, and I don't see that going away any time soon — in fact, I believe more and more creators are going to be taking advantage of this and the adoption of NFTs will continue to grow,\" he added.<\/span>"],"hashtag":["ETHEREUM","RARIBLE","SERIES A"]}