{"summary":"Crypto exchange Coinbase will begin trading of the PayPal stablecoin PYUSD on Aug. 31 — if liquidity conditions are met.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/248239\/coinbase-paypal-pyusd-listing","publishDate":"2023-08-31T04:35:57","id":3180,"type":null,"title":"Coinbase set to list PayPal stablecoin PYUSD","category":["EXCHANGES"],"content":["Crypto exchange Coinbase is adding support for newly launched PayPal stablecoin PYUSD.","\"Trading will begin on or after 9AM PT on 31 August 2023, if liquidity conditions are met,\" <a href=\"https:\/\/twitter.com\/CoinbaseAssets\/status\/1696915560284467609\" data-v-f87c67ca=\"\">Coinbase tweeted Wednesday<\/a>. \"Once sufficient supply of this asset is established trading on our PYUSD-USD trading pairs will launch in phases. Support for PYUSD may be restricted in some supported jurisdictions,\" it added.","<a href=\"https:\/\/twitter.com\/CoinbaseAssets\/status\/1694844095796253091?s=20\" data-v-f87c67ca=\"\">Coinbase first indicated the listing of PYUSD last week<\/a>. Now, with the confirmation, the exchange will add support for PYUSD with the \"experimental\" label — applied to certain assets that are either new to its platform or have relatively low trading volume compared to its broader crypto marketplace. Coinbase monitors experimental assets and may remove the label when an asset no longer meets the criteria.","PayPal's stablecoin was <a href=\"https:\/\/www.theblock.co\/post\/243569\/paypal-launches-stablecoin\" data-v-f87c67ca=\"\">launched<\/a> earlier this month in partnership with Paxos. Several exchanges have already listed the stablecoin, including Huobi, Kraken and Crypto.com, but its adoption appears to be slow. <a href=\"https:\/\/etherscan.io\/token\/0x6c3ea9036406852006290770bedfcaba0e23a0e8\" data-v-f87c67ca=\"\">The current total supply of PYUSD stands at around 43 million tokens<\/a>. \"On the surface there's a lack of demand from crypto users for PYUSD when other alternatives exist,\" <a href=\"https:\/\/www.theblock.co\/post\/247553\/paypals-new-stablecoin-facing-sluggish-demand-from-crypto-users-nansen-says?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">Nansen said in a report last week<\/a>, suggesting this could be occurring because the payments giant is targeting a different demographic.","<a href=\"https:\/\/newsroom.paypal-corp.com\/2023-08-07-PayPal-Launches-U-S-Dollar-Stablecoin\" data-v-f87c67ca=\"\">PayPal has said PYUSD is designed to make payments easier<\/a> and let big brands use digital money more.","It remains to be seen whether crypto exchange giant Binance will list PYUSD.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"August 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"Huobi","content":"PERSON"},{"type":"Nansen","content":"PERSON"}],"hashtag":["COINBASE"],"authors":["Yogita Khatri","The Block"]}