{"summary":"The cross-examination of SBF in his trial on seven counts of fraud and conspiracy related to the downfall of FTX took up most of Monday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/260107\/inside-sbfs-trial-sam-wasnt-sure-nearly-one-hundred-and-fifty-times","publishDate":"2023-10-30T20:38:09","id":3181,"type":null,"title":"Inside SBF&#x27;s Trial: Sam &#x27;wasn&#x27;t sure&#x27; nearly one hundred and fifty times","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">At one point on Monday, Assistant United States Attorney Danielle Sassoon asked Sam Bankman-Fried a seemingly simple question during her cross-examination of the defendant at <a href=\"https:\/\/www.theblock.co\/tag\/sbf-trial\" data-v-f87c67ca=\"\">his trial<\/a> over seven counts of fraud and conspiracy: \"Just to be clear, Mr. Bankman-Fried, taking money from FTX to pay back lenders, that's not margin trading, is it?\"<\/span>","<span data-v-f87c67ca=\"\">The exchange that followed perfectly encapsulated the cat-and-mouse game that Bankman-Fried and Sassoon played throughout much of his cross-examination on Monday, complete with, according to my count, nearly 150 responses of \"I don't know,\" \"I don't recall,\" or other similar deferrals.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried: I'm not——I don't think that's what happened, and I'm also not saying that's not margin trading.<\/span>","<span data-v-f87c67ca=\"\">Judge Lewis A. Kaplan: Would you please answer the question.<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried: I'm not sure I agree. I don't think I agree.<\/span>","<span data-v-f87c67ca=\"\">Sassoon: If Alameda took money off FTX to repay its lenders, that's not a margin trade, correct?<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried: I'm not sure I agree with that.<\/span>","<span data-v-f87c67ca=\"\">Sassoon: It's your testimony that that's a margin trade.<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried: It's my testimony that it depends on the details, but that that very well could be a margin trade. I'm sorry. It's a hypothetical. I'm speculating here.<\/span>","<span data-v-f87c67ca=\"\">Sassoon: You were CEO of FTX, right?<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried: Yeah.<\/span>","<span data-v-f87c67ca=\"\">Sassoon: And you know what margin trading is, correct?<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried: Yeah. I'm telling you that sounds like a margin trade to me, but it is speculative, so I don't know what to say about that.<\/span>","<span data-v-f87c67ca=\"\">Sassoon: Well, this is the question, Mr. Bankman-Fried.<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried: Yup.<\/span>","<span data-v-f87c67ca=\"\">Sassoon: Is withdrawing money from FTX to repay a lender within your definition of a margin trade?<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried: Potentially, yeah. I can explain if you want.<\/span>","<span data-v-f87c67ca=\"\">Sassoon did not give Bankman-Fried the opportunity to explain, instead moving on to the next question.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Though Bankman-Fried squirmed, Sassoon showed few visible signs of frustration or fatigue as her relentless questioning continued throughout the day. Sassoon almost always seemed to have a piece of government evidence on hand to cast doubt on Bankman-Fried's assertions or remind him what he had testified to previously, from press articles and tweets to photographs and financial statements.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Sassoon also usually caught when Bankman-Fried answered a different question than the one she had asked, pressing him again until she got a satisfactory response — or enough deferrals for the jury to presumably award her the point anyway.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Here's another illustrative example. At one point, Sassoon asked Bankman-Fried, \"Do you recall saying to [FTX employee] Andy Croghan you kept your hair long because it was important for the business 'for people to think I look crazy'?\"<\/span>","<span data-v-f87c67ca=\"\">When Bankman-Fried responded, \"I don't think I said that in that way,\" Sassoon pulled up an excerpt from a New York Times article, with Croghan recounting how, after he told Bankman-Fried to get a haircut, the latter responded, according to Croghan's remarks quoted by the reporter, \"I honestly think it's negative EV for me to cut my hair. I think it's important for people to think I look crazy.\"<\/span>","<span data-v-f87c67ca=\"\">Sassoon asked if Bankman-Fried still denied saying the quote, to which Bankman-Fried responded \"I have no memory of saying it in that way and don't think I would have. I may have said parts of that or that with other context.\"<\/span>","<span data-v-f87c67ca=\"\">Again, this frustrating exchange was far from unique during Monday's cross-examination. What remains unclear is whether the jury found enough material in Bankman-Fried's meandering answers to reasonably doubt the government's case.<\/span>","<span data-v-f87c67ca=\"\">We should know soon, though; with the case proceeding on schedule, the jury is expected to begin deliberations by the end of this week, absent any further delays. The Block will be back in the courtroom for the remainder of Bankman-Fried's cross examination tomorrow. <\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sassoon","content":"ORGANIZATION"},{"type":"Andy Croghan","content":"PERSON"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"Assistant United States","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Croghan","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"Danielle Sassoon","content":"PERSON"},{"type":"Bankman","content":"LOCATION"},{"type":"Lewis A. Kaplan","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Sassoon","content":"PERSON"}],"hashtag":["FTX","SAM BANKMAN-FRIED","SBF TRIAL"],"authors":["Zack Abrams","The Block"]}