{"summary":"The crypto community has largely decried the decision by U.S. prosecutors to drop Bankman-Fried&#x27;s remaining charges. Even Elon weighed in.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/269808\/coinbases-top-lawyer-rfk-jr-slam-decision-to-drop-second-sbf-trial","publishDate":"2023-12-31T19:05:54","id":3182,"type":null,"title":"Coinbase&#x27;s top lawyer, RFK jr., and more slam decision to drop second SBF trial","category":["CRYPTO ECOSYSTEMS"],"content":["United States prosecutors have decided not to try Sam Bankman-Fried on the remaining charges he faces, including charges of foreign bribery, bank fraud, and more. Prosecutors, led by U.S. Attorney for the Southern District of New York Damian Williams, have also decided not to pursue a charge of unlawful political donations that was severed from the original indictment due to a dispute with the Bahamas over Bankman-Fried's extradition.&nbsp;","In a letter explaining the decision, prosecutors noted that evidence concerning several of the charges was already presented during Bankman-Fried's original trial, in which he was found guilty on all seven counts of fraud and conspiracy related to his leadership of FTX and its sister trading firm, Alameda Research. That evidence may be considered at sentencing, even though a jury was never given a chance to weigt in, the prosecutors explain.&nbsp;","\"Proceeding with sentencing in March 2024 without the delay that would be caused by a second trial would advance the public’s interest in a timely and just resolution of the case,\" the prosecutors <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.nysd.590940\/gov.uscourts.nysd.590940.388.0.pdf\" data-v-f87c67ca=\"\">wrote<\/a>.&nbsp;","As such, certain information may never come to light, like exactly how <a href=\"https:\/\/www.theblock.co\/post\/256063\/sbf-tried-thai-sex-worker-wallets-to-unlock-frozen-funds-before-bribing-official-witness-claims\" data-v-f87c67ca=\"\">Thai sex workers<\/a> figured in to Alameda's plan to unfreeze its Chinese accounts, a situation that ultimately resulted in Alameda paying a bribe to Chinese government officials, according to the testimony of star witness and former Alameda CEO Caroline Ellison.&nbsp;","However, the crypto community seems largely concerned with one dropped charge in particular: the charge of unlawful political donations, given Bankman-Fried's <a href=\"https:\/\/www.theblock.co\/post\/184820\/sam-bankman-fried-goes-from-toast-of-washington-to-political-pariah\" data-v-f87c67ca=\"\">well-publicized donations<\/a> to large numbers of both Democratic and Republican politicians. Prosecutors alleged that Bankman-Fried used customer funds for <a href=\"https:\/\/www.theblock.co\/post\/244858\/prosecutors-allege-bankman-fried-used-customer-funds-for-100-million-in-political-contributions\" data-v-f87c67ca=\"\">$100 million in political donations<\/a>.&nbsp;","\"No one is even surprised. THAT is a bigger problem than the fraud itself. It shows how normalized corruption has become,\" declared Presidential candidate Robert F. Kennedy, Jr., who is running as an Independent in the 2024 race, in a <a href=\"https:\/\/x.com\/RobertKennedyJr\/status\/1741548290175312062?s=20\" data-v-f87c67ca=\"\">quote-post on X<\/a> referencing the decision.","Elon Musk, in a <a href=\"https:\/\/x.com\/elonmusk\/status\/1741083764036653481?s=20\" data-v-f87c67ca=\"\">reply<\/a> to that same quoted post, said simply \"!!\".&nbsp;","Coinbase's Chief Legal Officer, Paul Grewal, called the decision to drop the charge a \"miscarriage of justice\" in a <a href=\"https:\/\/x.com\/iampaulgrewal\/status\/1740951263825535308?s=20\" data-v-f87c67ca=\"\">thread on X<\/a>. \"The public interest in a public airing of charges almost always matters. Campaign finance charges are at the very top of this list,\" wrote Grewal. \"What politicians and others knew what and when are critical questions that deserve answers.\"","Bankman-Fried's sentencing is currently scheduled for March 28, 2024.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Grewal","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"March 2024","content":"DATE"},{"type":"Robert F. Kennedy, Jr.","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bahamas","content":"LOCATION"},{"type":"the Southern District of New York Damian Williams","content":"ORGANIZATION"},{"type":"Bankman","content":"PERSON"},{"type":"Alameda","content":"ORGANIZATION"},{"type":"March 28, 2024","content":"DATE"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Paul Grewal","content":"PERSON"}],"hashtag":["SAM BANKMAN-FRIED"],"authors":["Zack Abrams","The Block"]}