{"summary":"Citigroup has become the first digital custodian for the BondbloX Bond Exchange (BBX), the global investment bank said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/251413\/citi-expands-digital-asset-services-with-bond-custody-tokenized-deposits","publishDate":"2023-09-18T10:56:20","id":3183,"type":null,"title":"Citi expands digital asset services with bond custody, tokenized deposits","category":["COMPANIES"],"content":["Citigroup is expanding its digital asset services with a new custodian partnership and a pilot program for tokenized deposits.&nbsp;","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The global investment bank became the first digital custodian for the BondbloX Bond Exchange, it <\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.citigroup.com\/global\/news\/press-release\/2023\/citi-to-become-first-digital-custodian-on-bondblox-bond-exchange\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">said<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\"> in a statement on Sept. 15. <\/span><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">BBX is regulated by the <a href=\"https:\/\/www.theblock.co\/post\/243554\/singapore-mas-fintech-web3-funding\" data-v-f87c67ca=\"\">Monetary Authority of Singapore<\/a> and is described as the world’s first fractional bond exchange that uses atomic settlement and distributed ledger technology.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The partnership gives Citi's eligible clients access to BBX's fractionalized bond trading, with the investment bank offering settlement and custodial services.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"This proprietary digital custody technology is scalable and will allow us to provide settlement and custody services for clients investing in assets issued on permissioned blockchain networks,\" Citi Securities Services Head of Digital Assets Nadine Teychenne said.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">BBX allows investors to trade $1,000 fractions of traditional wholesale bonds. The tokenized bonds are held on a distributed ledger, enabling almost instantaneous exchange via atomic settlement. Traditionally, it takes around 48 hours to settle bond trades. However, atomic settlement uses innovations from the blockchain sector, such as smart contracts for automated clearing and settlement and digital signatures in the form of public or private keys.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Citigroup became the custodian for BondbloX's underlying traditionally issued bonds in 2021. The latest development gives Citigroup custody of the fractional, tokenized versions of the underlying <a href=\"https:\/\/www.theblock.co\/post\/201275\/el-salvador-one-step-closer-to-bitcoin-bonds-after-law-passage\" data-v-f87c67ca=\"\">bonds<\/a>. According to the press release, Citigroup's custody of the full financial vertical opens up these products to a wider base of institutional investors. The enhanced partnership with Citi also gives BondbloX users greater access to the global bond market, enabling them to have a more diverse digital asset portfolio.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"This partnership will enable Citi’s clients and others to enjoy the full benefits of bond trading, coupled with Citi’s securities services support, almost immediately. Digital Custody is the next big step in the transformation of the bond market, making bond markets, more transparent, electronic, and accessible to all. Now, bonds are more easily accessible to everyone,\" BondbloX Co-Founder Dr. Rahul Banerjee said.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The international investment bank added that the digital asset innovations it is pursuing include digital money and bonds, digital custody, asset servicing, and collateral mobility.<\/span>","Citigroup is also debuting a pilot program for turning customer deposits into digital tokens with an initiative that will use a private blockchain owned and managed by the investment bank.","The product, named Citi Token Services, transforms customer deposits into digital tokens, enabling instantaneous global transfers, processed on blockchain-based payment rails, Bloomberg News <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-09-18\/citi-debuts-token-service-in-latest-foray-into-digital-assets\" data-v-f87c67ca=\"\">reported<\/a> on Monday.&nbsp;","The pilot is a part of Citi's initiative to expand its digital asset offerings and address the needs of its institutional clients, including the provision of a 24\/7 cross-border payment service with high liquidity.","\"The development of Citi Token Services is part of our journey to deliver real-time, always-on, next generation transaction banking services to our institutional clients,\" Citi Global Head of Services Shahmir Khaliq said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Citi Token Services","content":"ORGANIZATION"},{"type":"Rahul Banerjee","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Citigroup","content":"ORGANIZATION"},{"type":"$1,000","content":"MONEY"},{"type":"BondbloX Bond Exchange","content":"ORGANIZATION"},{"type":"Citi Global Head of Services Shahmir Khaliq","content":"ORGANIZATION"},{"type":"BBX","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"Citi Securities Services Head of Digital Assets Nadine Teychenne","content":"ORGANIZATION"},{"type":"Sept. 15","content":"DATE"},{"type":"Bloomberg News","content":"ORGANIZATION"},{"type":"Citi","content":"ORGANIZATION"}],"hashtag":["ASSET MANAGERS","DEBT FINANCING","INVESTMENT FIRMS","PAYMENTS","TRADFI BANKS","WEALTH MANAGERS"],"authors":["Brian McGleenon","The Block"]}