{"summary":"Ira Kleiman v. Craig Wright, “Order Regarding Plaintiffs’ Request To Re-Depose Plaintiff”\nThe Court over-ruled Wright’s objections to answering questions based on marital privilege but said it was going to wait to rule on whether his deposition could be “re-opened” until he complied with a court order regarding his bitcoin holdings\n“The Court further finds that Dr. Wright’s objections were unfounded under Florida law. The questions did not elicit marital communications and therefore would not have been protected by the Florida marital privilege.”","author":["Stephen D. Palley","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/22792\/craig-wright-objections-overruled-by-federal-judge","publishDate":"2019-05-10T09:21:58","id":3184,"type":null,"title":"Craig Wright objections overruled by federal judge","category":["Legal"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]Ira Kleiman v. Craig Wright, “Order Regarding Plaintiffs’ Request To Re-Depose Plaintiff”, 18-CIV-80176, S.D. Fl., 5\/7\/2019 [SDP]<br data-v-f87c67ca=\"\">\n<\/strong><\/em>","There’s a new order that was just issued in the <a href=\"https:\/\/www.theblockcrypto.com\/2019\/04\/07\/lawsuit-against-craig-wright-trudges-forward-and-plaintiff-wants-to-know-who-controlled-satoshi-nakamotos-three-email-addresses\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">ongoing and heated<\/a> Kleiman v. Wright litigation in federal court in Florida. The Court overruled Wright’s objections to answering questions based on marital privilege but said it was going to wait to rule on whether his deposition could be “re-opened” until he complied with a court order regarding his bitcoin holdings.","What does all this mean? To understand how this all sounds to a litigator you need to understand a little bit about discovery and depositions, so let’s begin with a brief civil procedure lesson. Depositions are a part of the “discovery” process in American litigation. Discovery is actually a pretty fair description of the entire process — the parties are allowed to use a variety of methods to “discover” evidence about the other side’s case. Discovery includes written requests, in the form of things called interrogatories (written questions, basically), requests for production (document requests), requests for admissions (requests that the other side admit or deny certain statements) and depositions, which are usually oral examinations under oath and outside the presence of a judge or jury. (On rare occasions a deposition can be taken by using written questions).","There are of course some limitations to discovery. For written discovery requests you can’t go on a complete fishing expedition and ask for things that aren’t at all related to their claims or defenses. The Federal Rules of Civil Procedure (which were recently amended to clarify this) say, specifically “Parties may obtain discovery regarding any non-privileged matter that is relevant to any party’s claim or defense and proportional to the needs of the case, considering the importance of the issues at stake in the action, the amount in controversy, the parties’ relative access to relevant information, the parties’ resources, the importance of the discovery in resolving the issues, and whether the burden or expense of the proposed discovery outweighs its likely benefit. Information within this scope of discovery need not be admissible in evidence to be discoverable.”","[related id=2]Well, one of the things that a lawyer defending a deposition can do if they don’t like a question that has been asked of their client is to lodge an objection. The only proper objections in Federal Court are that the form of the question is bad (leading, argumentative, assumes facts not in evidence, etc.) or that it is privileged. With some nuanced exceptions, the only really appropriate time for a client not to answer is if doing so would violate privilege. That can include attorney-client privilege, marital privilege or any other judicially or statutorily recognized privilege.","If you have taken and defended a lot of depositions you are familiar with the lawyers who argue too much in their objections and clients who try to act like lawyers. It is really, really bad form for a client to raise objections on their own and to argue with a lawyer who is deposing them. Witnesses who do this tend to lose credibility and if the lawyer examining them has the right skills they will hoist the witness on their own petard. Think about the classic scene in A Few Good Men where Tom Cruise goads Jack Nicholson into an on the stand confession. Cases are rarely this dramatic in real life, but the dynamic is totally real.","At one point in Wright’s April 4, 2019 deposition he was asked questions about his former wife. Here’s part of the colloquy:","<em data-v-f87c67ca=\"\">Q. So we do not have to go through every single question. Are you refusing to answer any questions about Ms. Lynne Black?<\/em>","<em data-v-f87c67ca=\"\">A. I am not refusing to answer questions. I have an oath that has been filed within a court in Australia. I will not breach oath and perjure myself or break oath. You are asking me to break oath, and unless instructed by a judge, etcetera, etcetera, I will not do that.<\/em>","As to his second wife, Mr. Wright objected to a line of questions by saying “My wife is privileged in the UK. My marriage is privileged. You should know that, as a lawyer. Are you seeking to have me breach marital privilege?”","<em data-v-f87c67ca=\"\">Q: Dr. Wright, it will not be productive for us to have a conversation about whether or not the time of when your wife’s name changed from Ang to Watts is covered by [] privilege, but — — <\/em><br data-v-f87c67ca=\"\">\n<em data-v-f87c67ca=\"\">A: I do not discuss my family, full stop.<\/em><br data-v-f87c67ca=\"\">\n<em data-v-f87c67ca=\"\">Q: Dr Wright, you understand that you are being sued in this case.<\/em><br data-v-f87c67ca=\"\">\n<em data-v-f87c67ca=\"\">A: I understand perfectly well that a con man in America has made up a fraudulent claim, yes.<\/em>","Personally, I read this testimony and cringe. The witness thinks that he is besting the lawyer, but by acting like an advocate and arguing he is walking into a trap. If it were my client, I would take him out into the hallway and tell him to stop arguing and let me make the objections. Anyway, the lawyers got the judge on the phone and the judge asked for briefing on the application of marital privilege to the question of whether or not someone’s name had changed (a dubious proposition under U.S. law). Following briefing, the Court issued a ruling which (in my view, unsurprisingly) over-ruled Wright’s objection:","<em data-v-f87c67ca=\"\">“The Court finds that the Plaintiffs’ proposed topic areas are reasonably designed to identify Ms. Wright’s and Ms. Watts’ knowledge of facts material to the issues in this case and\/or the existence and location of additional relevant evidence. They are designed to narrow the issues in dispute and potentially limit the scope of future discovery. They fall squarely within the Court’s intended scope for Dr. Wright’s deposition. The Court further finds that Dr. Wright’s objections were unfounded under Florida law. The questions did not elicit marital communications and therefore would not have been protected by the Florida marital privilege. Nevertheless, the Court will defer ruling on whether to reopen Dr. Wright’s deposition until after Dr. Wright responds to the Court’s orders relating to his bitcoin holdings.”<\/em>","I am not entirely sure why the Court is deferring ruling on re-opening the deposition, but if one is reading the tea-leaves, this tactic of objecting to questions based on Australian and UK law was unwise. Federal judges will give the litigants a lot of leeway but if you push your luck too far, they tend to see through games and will hold them against you.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part I of this week's analysis, Crypto Caselaw Minute, is above.<\/em>"],"hashtag":[]}