{"summary":"Ripple paid money services firm MoneyGram more incentives in the first quarter of 2020, amounting to a total of $16.6 million. Ripple pays incentives to several clients for using its solutions. Two major clients of Ripple – PNC Bank and goLance.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/63855\/ripple-paid-16-6-million-in-xrp-incentives-to-moneygram-in-q1-2020","publishDate":"2020-05-04T10:31:11","id":3185,"type":null,"title":"Ripple paid $16.6 million in XRP incentives to MoneyGram in Q1 2020","category":["RIPPLE"],"content":["Ripple has paid money services firm MoneyGram more incentives in the first quarter of 2020, amounting to a total of $16.6 million.","The publicly-traded remittance company <a href=\"http:\/\/ir.moneygram.com\/news-releases\/news-release-details\/moneygram-international-reports-first-quarter-2020-results\" data-v-f87c67ca=\"\">revealed<\/a> the figure in its Q1 financial results, published on Friday, saying that its total operating expenses include \"Ripple market development fees of $16.6 million, partially offset by related transaction and trading expenses of $4.5 million.\"","Ripple <a href=\"https:\/\/www.theblockcrypto.com\/linked\/56948\/ripple-paid-moneygram-11-3-million-in-2019-remittance-firms-ceo-says-trading-volume-continues-to-grow\" data-v-f87c67ca=\"\">pays<\/a> MoneyGram incentives for using its RippleNet solution, and MoneyGram categorizes these payouts as a \"contra expense rather than revenue\" and as a \"market development fee based on the volume of foreign exchange that we transact on Ripple's platform.\"","Notably, these incentives are <a href=\"https:\/\/www.theblockcrypto.com\/post\/57429\/ripple-would-not-be-profitable-without-selling-xrp-says-ceo-garlinghouse\" data-v-f87c67ca=\"\">paid in the form of XRP<\/a>, as MoneyGram noted earlier this year. \"The Company is compensated by Ripple in XRP for developing and bringing liquidity to foreign exchange markets, facilitated by the ODL [Ripple's On-Demand Liquidity] platform, and providing a reliable level of foreign exchange trading activity. We refer to this compensation as market development fees.\" MoneyGram said at the time.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Higher incentives&nbsp;<\/strong><\/span>","The first quarter compensation is <a href=\"https:\/\/www.theblockcrypto.com\/linked\/56948\/ripple-paid-moneygram-11-3-million-in-2019-remittance-firms-ceo-says-trading-volume-continues-to-grow\" data-v-f87c67ca=\"\">higher than<\/a> the combined $11.3 million MoneyGram received during Q3 and Q4 of 2019.","\"We continue to be extremely pleased with the Ripple partnership,\" Alexander Holmes, chairman and CEO of MoneyGram,&nbsp;<a href=\"https:\/\/www.fool.com\/earnings\/call-transcripts\/2020\/05\/01\/moneygram-international-inc-mgi-q1-2020-earnings-c.aspx\" data-v-f87c67ca=\"\">said in an earnings call<\/a> on Friday.","Holmes added:","\"From a new service, I would say it was a little bit of a relatively quiet quarter, in the sense of really pushing anything, particularly new into the market or expanding of the service. We did a lot of that in the back half of last year, and really got going on a number of new corridors for that service. We also have a variety of new services in the pipeline and things that we'll be rolling out, and expanding with later this year.\"&nbsp;","While MoneyGram receives incentives in XRP, it does not hold the digital asset for long. \"We sell XRP as soon as we receive it – we don't hold any XRP,\" a MoneyGram spokesperson <a href=\"https:\/\/www.theblockcrypto.com\/daily\/58860\/we-sell-xrp-as-soon-as-we-receive-it-says-moneygram-on-ripple-incentive-payments\" data-v-f87c67ca=\"\">told The Block<\/a> earlier this year.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe spokesperson, however, declined to comment at the time about how the incentive payments are determined or which conditions must be met before they are paid.","Ripple and MoneyGram partnered last June. As part of the agreement, Ripple invested a total of $50 million into the remittance firm. Their agreement is scheduled to expire on July 1, 2023.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nRipple pays incentives to several clients for using its solutions. Two major clients of Ripple – PNC Bank and goLance – confirmed to The Block earlier this year that they receive incentives from Ripple. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nA Ripple spokesperson at the time told The Block that incentive programs are \"standard practice\" for any growing business, adding: \"In payments, even established players continue to run robust incentive programs, including Visa, Mastercard and Paypal to name a few.\"&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alexander Holmes","content":"PERSON"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"MoneyGram","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$4.5 million","content":"MONEY"},{"type":"Paypal","content":"ORGANIZATION"},{"type":"last June","content":"DATE"},{"type":"the first quarter of 2020","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"$16.6 million","content":"MONEY"},{"type":"last year","content":"DATE"},{"type":"PNC Bank","content":"ORGANIZATION"},{"type":"July 1, 2023","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"$11.3 million","content":"MONEY"},{"type":"$50 million","content":"MONEY"}],"hashtag":["XRP"],"authors":["Yogita Khatri","The Block"]}