{"summary":"Ethereum scaling solution zkSync rolled out a critical integration for its zkEVM technology called validity proofs ahead of its mainnet launch on Oct. 28.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/177819\/zksync-rolls-out-critical-testnet-integration-for-its-validity-proofs-ahead-of-mainnet","publishDate":"2022-10-17T17:19:24","id":3186,"type":null,"title":"zkSync rolls out critical testnet integration for its validity proofs ahead of mainnet","category":["THE BLOCK"],"content":["Ethereum scaling solution zkSync rolled out a critical integration for its zkEVM technology called validity proofs ahead of its mainnet launch on Oct. 28.","This integration is live on the zkSync 2.0 testnet, and marks the completion of a final necessary step leading up to its formal launch.","This integration is what “many development teams have been waiting for,” Matter Labs, the project's developer, <a href=\"https:\/\/medium.com\/@shazia_h\/milestone-3-zksync-end-to-end-prover-is-now-live-on-testnet-9ee4fdc1874f\" data-v-f87c67ca=\"\">wrote<\/a> in a Medium post. The integration of validity proofs will enable developers to fully test out the technology that is needed for core functions of the network, such as proof generation, aggregation and on-chain verification.","Validity proofs are the underlying technology that enables increased scalability capabilities for zkSync, without compromising on security. The proofs themselves “guarantee correctness of program execution” and the actual state, or history of the network, zkSync wrote. The proofs are then sent to Ethereum which in turn verifies the proofs for correctness and security.","ZkSync’s mainnet launch on Oct. 28 will initially not have any external projects or applications.","The goal is to conduct audits and security checks, ensuring that the validity proofs are operating correctly.","The next stage after the testnet is the Fair Launch Alpha, where developers will be able to port and develop on the mainnet for further testing in a live environment. This is expected to come later this year.","The Full Alpha, which is the following stage after the Fair Launch Alpha, will allow actual users to bridge over following security checks, and should be launched by the end of 2022.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Oct. 28","content":"DATE"},{"type":"Fair Launch Alpha","content":"LOCATION"}],"hashtag":["ETHEREUM"],"authors":["Mike Truppa","The Block"]}