{"summary":"Blockchain project Aleo has raised $200 million in a Series B funding round and is now valued at $1.45 billion.\nAleo plans to build a GitHub-like company, the project’s CEO and CTO Howard Wu told The Block.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/133218\/aleo-raises-200-million-softbank-tiger-others-blockchain","publishDate":"2022-02-07T09:00:43","id":3187,"type":null,"title":"Blockchain project Aleo raises $200M from SoftBank, Tiger, and others","category":["Venture Capital"],"content":["Aleo, a blockchain project focused on privacy through zero-knowledge-proof technology, has raised $200 million in a Series B funding round.","SoftBank Vision Fund 2 and Kora Management co-led the round, with Tiger Global, Andreessen Horowitz (a16z), Samsung Next, Slow Ventures, and Sea Capital also participating.","As part of the deal, SoftBank and Kora have each acquired one board seat at Aleo; however, the seats are yet to be assigned to specific executives, Aleo's CEO and CTO Howard Wu told The Block.","This was an equity funding round and will help Aleo build a company that provides services on top of its blockchain network, said Wu. \"A good analogy we have made is Git vs. GitHub. Git is an open-source protocol used by millions of developers worldwide, and GitHub has built a lucrative and viable business by layering on a suite of products that add even more utility for the end-user (aka developer),\" said Wu.","Aleo's blockchain network is currently in testnet, and its mainnet is scheduled to launch in the third quarter of this year. When asked how Aleo is different from other blockchains that already utilize zero-knowledge-proof technology, Wu said most other projects use the technology to solve the scalability issue on Ethereum.&nbsp;","Aleo, on the other hand, has developed its own Layer 1 blockchain that significantly improves both scalability and privacy, he said.","Aleo uses a new computation system called Zexe. Short for zero-knowledge execution, Zexe helps make off-chain computation with on-chain verification by default for scalability and privacy. Wu <a href=\"https:\/\/eprint.iacr.org\/2018\/962.pdf\" data-v-f87c67ca=\"\">published<\/a> a paper on Zexe last year along with Zcash's Sean Bowe and a few academics. He is also a blockchain advisor at the University of California, Berkeley.","According to a16z, which led Aleo's <a href=\"https:\/\/www.theblockcrypto.com\/linked\/102350\/andreessen-horowitz-leads-28-million-round-for-zero-knowledge-private-applications-platform\" data-v-f87c67ca=\"\">Series A round<\/a> last year, Zexe is a template for a blockchain \"that is entirely private and that scales far beyond most blockchains that are live today.\"","Aleo has also created its own programming language called Leo, which will let developers build decentralized and private applications more easily, according to Wu.","But how will Aleo attract developers to its network, given the Layer 1 blockchain space is already so competitive? Wu said, \"We're confident that when developers experience how intuitive it is to write and deploy applications within Aleo, we'll see even greater adoption than we already have.\"","Aleo recently launched a $1 million developer grants program, and it has had more than 80 applicants so far, said Wu. The project now plans to expand that program to $5 million to attract more developers.","Aleo will launch its mainnet with \"<a href=\"https:\/\/www.aleo.org\/post\/aleo-token-economics\" data-v-f87c67ca=\"\">Aleo credits<\/a>,\" which will work like its native token.&nbsp;The purpose of Aleo credits (similar to AWS credits) is to serve compute credits, said Wu. One credit can be subdenominated into 1000 \"gates,\" which are used to price computations. \"Every program in Aleo is Turing-decidable, meaning the exact size of the computation can be known upfront. The size is measured by the number of gates (like logic gates) and thus priced accordingly using credits,\" he said.","There are currently 34 people working for Aleo, and the project is looking to expand the team across various roles, including engineering, business development, and operations, to achieve its goals.&nbsp;","The Series B round brings Aleo's total funding to date to $228 million and its valuation to $1.45 billion. Last April, the project raised $28 million."],"hashtag":["TIGER GLOBAL"]}