{"summary":"1.35 billion Jupiter tokens will be in circulation at launch, which accounts for 13.5% of the 10 billion total supply.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275322\/jupiter-token","publishDate":"2024-01-31T08:04:01","id":3188,"type":null,"title":"Jupiter token to begin trading on exchanges today","category":["THE BLOCK"],"content":["The native token of Jupiter, a decentralized exchange aggregator on Solana, is set to go live today, with availability for trading on centralized exchanges soon after.","Centralized exchanges — including Bybit, Binance, Bitfinex, OKX, among others — have already listed the token and will begin its trading, expected after 10 am EST.","The project’s pseudonymous founder, Meow, <a href=\"https:\/\/twitter.com\/weremeow\/status\/1752355081499132228?s=61&amp;t=I05SQbin74dADQTJfR_W0A\" data-v-f87c67ca=\"\">said<\/a> Jupiter has also created a native liquidity pool, with tokens initially available at $0.40 — in line with the pool’s price curve.","There will be 1.35 billion tokens in circulation, which accounts for 13.5% of the overall supply of 10 billion tokens.","Upon the token’s activation, Jupiter will also open its retrospective <a href=\"https:\/\/www.theblock.co\/post\/263283\/jupiter-airdrop-solana-wallets\" data-v-f87c67ca=\"\">airdrop,<\/a> which is a reward for users who traded at least $1,000 on the platform before Nov. 2. The airdrop is targeting 955,000 wallet addresses — but, as of now, <a href=\"https:\/\/dune.com\/alpaxxx\/dollarjup-analiz\" data-v-f87c67ca=\"\">fewer than 670,000<\/a> have claimed their tokens.","While the official distribution of the JUP token occurs today, trading of the coin as a pre-launch <a href=\"https:\/\/app.aevo.xyz\/perpetual\/jup\" data-v-f87c67ca=\"\">perpetual derivative Aevo<\/a> has been available for some time. Currently, JUP’s price on Aevo’s pre-market stands at $0.66, giving it a fully diluted market cap of $6.6 billion.","Jupiter is the top decentralized exchange aggregator on Solana by volume — consolidating liquidity from various DEXs on the network. It has facilitated a trading volume of <a href=\"https:\/\/www.coingecko.com\/en\/exchanges\/jupiter\" data-v-f87c67ca=\"\">over $600 million<\/a> in the last 24 hours.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"1.35 billion","content":"MONEY"},{"type":"Binance","content":"LOCATION"},{"type":"last 24 hours","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Bitfinex","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$1,000","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$0.40","content":"MONEY"},{"type":"$6.6 billion","content":"MONEY"},{"type":"$600 million","content":"MONEY"},{"type":"13.5%","content":"PERCENT"},{"type":"Jupiter","content":"ORGANIZATION"},{"type":"Meow","content":"ORGANIZATION"},{"type":"Nov. 2","content":"DATE"},{"type":"$0.66","content":"MONEY"},{"type":"Solana","content":"PERSON"}],"hashtag":["DEXS","SOLANA"],"authors":["Vishal Chawla","The Block"]}