{"summary":"The wilderness of DeFi and its consequent lack of accessibility has warded-off too many potential users from CeFi – and makes the possibility of mass","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/155537\/nested-defi-turned-socialfi-for-mass-adoption","publishDate":"2022-07-04T08:54:39","id":3194,"type":null,"title":"Nested: DeFi turned SocialFi for mass adoption","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">The wilderness of DeFi and its consequent lack of accessibility has warded-off too many potential users from CeFi –&nbsp;and makes the possibility of mass adoption all but a sweet dream.<\/span>","<span data-v-f87c67ca=\"\">A hard-to-digest user experience that narrows users to diehard crypto fans, steep fees that excludes many, a dire lack of technical guidance leading to expedited liquidations, and the absence of community oriented mechanisms to incentivize users to share more –&nbsp;DeFi has a lot of work to do before turning the dream of mass adoption into reality.<\/span>","<span data-v-f87c67ca=\"\">Hope isn’t dead though –&nbsp;it just needs a little push.<\/span>","<b data-v-f87c67ca=\"\">DeFi for all<\/b>","<span data-v-f87c67ca=\"\">DeFi must become a reassuring place if it wishes to break new highs.<\/span>","<a href=\"https:\/\/app.nested.fi\/portfolios\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Nested<\/span><\/a><span data-v-f87c67ca=\"\"> is a social trading platform that intends to revolutionize DeFi for good by making it social – hence rendering it accessible.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Multi-chain and built to scale, Nested provides a smooth user experience that reduces web 3 noise, brings social features that tame technicality for newcomers, and implements a solution that enables savvy traders to monetize their knowledge –&nbsp;all while aggregating several protocols together on a single platform.<\/span>","<span data-v-f87c67ca=\"\">That platform allows users to create financial portfolios —&nbsp; ‘Nested portfolios’— enveloped in non-fungible tokens (NFTs) that reflect a chosen set of up to twelve tokens per portfolio.<\/span>","<span data-v-f87c67ca=\"\">Users can then freely manage these portfolios, share them with friends or even copy other users’ strategies.<\/span>","<a href=\"https:\/\/app.nested.fi\/portfolios\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Nested<\/span><\/a><span data-v-f87c67ca=\"\"> allows DeFi newbies to copy&nbsp;strategies that correspond to what they are looking for while giving the opportunity to more experienced DeFi traders, such as community leaders, to earn royalties every time one of their&nbsp;portfolios is copied — and enjoy a seamless asset management experience.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The company’s solution makes crypto investment easier, more social and affordable thanks to its use of NFT technology that drastically reduces transaction fees –&nbsp;with only one transaction needed for up to twelve assets.<\/span>","<span data-v-f87c67ca=\"\">Moreover, the near total absence of mutual support in Web 3.0 is ironic given that it was built upon the idea of peer-to-peer.&nbsp;It has led to many people giving up.<\/span>","<span data-v-f87c67ca=\"\">Bringing a <\/span><a href=\"https:\/\/twitter.com\/RudyKadoch\/status\/1511358249655836679\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">social dimension<\/span><\/a><span data-v-f87c67ca=\"\"> so that users might benefit from each other is the means to mitigate risks.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This is why Nested’s solution lies at the crossroads of social media and crypto trading –&nbsp;to ultimately increase DeFi’s accessibility.<\/span>","<span data-v-f87c67ca=\"\">Peer-to-peer guidance through an easy-to-use and all-in-one platform that socializes DeFi is the missing element to truly mitigate risks for rookie traders and turn a marginally obscure experience into a more pleasantly mainstream one.<\/span>","<span data-v-f87c67ca=\"\">Come learn more: https:\/\/nested.fi<\/span>","&nbsp;","","","<b data-v-f87c67ca=\"\">Step by step<\/b>","<span data-v-f87c67ca=\"\">Nested is conscious that before reaching the masses, it must first convince CeFi users that it is the best decentralized alternative to what they are accustomed to.<\/span>","<span data-v-f87c67ca=\"\">To that effect, <\/span><a href=\"https:\/\/app.nested.fi\/portfolios\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Nested<\/span><\/a><span data-v-f87c67ca=\"\"> is developing a mobile application that will rival those of CeFi while offering the advantages of DeFi –&nbsp;essentially gathering the best of both worlds.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">CeFi users are used to smooth onramp and offramps solutions that make investment easy through speedy bank card deposits or even SEPA transfers. Nested intends to align with that approach to simplify DeFi investment.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The goal ultimately is to abstract Metamask and make the idea of a seed phrase a notion of the past. Users must be able to create a profile and a portfolio in no time, like anyone would when creating an Uber account.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Finally, being DeFi native usually induces that one must manually alternate between chains to trade.<\/span>","<span data-v-f87c67ca=\"\">This however will not make for a simple user experience.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This is why Nested intends to become cross-chain by the end of 2023 –&nbsp;once the technology will have matured enough and be more applicable.<\/span>","<span data-v-f87c67ca=\"\">In the meantime, Nested has plenty of advantages that put it ahead of the curve against its competitors. Its innovative social focus and usage of NFT technology combined with the fact that it is decentralized and aggregates several protocols make it all a top runner.<\/span>","<span data-v-f87c67ca=\"\">Nested is backed by some of the most prominent actors of the crypto sphere –&nbsp;like Alan Howard, CMT Digital, Jump and Republic Capital –who believe in our vision and in what we try to achieve.<\/span>","<span data-v-f87c67ca=\"\">Nested’s official links:<\/span>","&nbsp;","<iframe frameborder=\"0\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/G8F6i7wDsyM\" title=\"YouTube video player\" width=\"560\" data-v-f87c67ca=\"\"><\/iframe>","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Nested<\/i><i data-v-f87c67ca=\"\">&nbsp;and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Nested","content":"ORGANIZATION"},{"type":"CMT Digital","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Alan Howard","content":"PERSON"}],"hashtag":[],"authors":["Sponsored","The Block"]}