{"summary":"Blockdaemon, a New York-based blockchain node provider, has raised $5.5 million from investors including Hashkey, CoinShares, Blockchain.com, and Fenbushi Capital\nThe company will use the fresh funds to expand into new markets in Asia and Europe.","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/64857\/blockchain-nodes-blockdaemon-funding","publishDate":"2020-05-12T09:00:18","id":3197,"type":null,"title":"Blockdaemon Raises $5.5 million In New Funding","category":["Investments"],"content":["<span data-v-f87c67ca=\"\">Blockchain node provider Blockdaemon has secured $5.5 million in funding from prominent investors like Hashkey and Fenbushi Capital. The New York-based company is set to use the new investment to expand into the Asian and European markets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Founded in 2017, Blockdaemon offers a set of tools to help exchanges, custodians, financial institutions, and developers deploy and manage nodes on over 30 blockchain protocols, including Bitcoin, Ethereum, XRP, Tezos, and Polkadot. Users can launch the nodes either on their own infrastructure or with cloud providers like Amazon Web Services, Microsoft Azure, and Google Platform.<\/span>","<span data-v-f87c67ca=\"\">The company will use the fresh funds to expand into new markets in Europe and the Asia-Pacific, Richter told The Block. Blockdaemon recently opened up a new office in Germany and is in the process of setting up an operation in Singapore.<\/span>","<span data-v-f87c67ca=\"\">Firms like Figment Networks, Staked.us, and Bison Trails also provide blockchain infrastructure, with a focus on staking. Meanwhile, projects like Infura are offering APIs for users to tap into specific blockchains. <\/span><span data-v-f87c67ca=\"\">Blockdaemon's competitive edge, argues CEO Konstantin Richter, lies in the large variety of tooling options it offers to users. Additionally, the company is working closely with payment-centric networks like Celo, MobileCoin, and the Lightning Network to explore running payment channels on Layer 2 systems.<\/span>","<b data-v-f87c67ca=\"\">Node outsourcing<\/b>","<span data-v-f87c67ca=\"\">Nodes are the basic units that make up a distributed network. Running a node on a blockchain like Bitcoin or Ethereum lets users securely send and receive cryptocurrencies. It also allows developers and businesses to create DApps and deploy smart contracts on these networks.<\/span>","<span data-v-f87c67ca=\"\">While users can opt to run a node themselves, starting a node from scratch involves a prolonged process of reading through the documentation, downloading the software client, and setting up a virtual machine.&nbsp;<\/span><span data-v-f87c67ca=\"\">Using a professional node provider can free users from the time-consuming grunt work of figuring out all the technical difficulties that come with managing a node, Richter contended.<\/span>","<span data-v-f87c67ca=\"\">\"There're an unlimited amount of problems that could happen, from your node not being connected to the right peers, to you not having the latest software version updated, to your machine size being wrong with respect to what the network needs,\" he said. \"We're building a software that hundreds of thousands of people are using, so we just get much more input about potential problems. Every time we fix a problem for one customer, we pre-fix it for everyone else.\"<\/span>","<span data-v-f87c67ca=\"\">According to Richter, the main reason why some people do not wish to outsource node operation is their concern that services like Amazon Web Services are centralized and that someone might steal their keys.&nbsp; This is why he recommended that users distribute their nodes across a few different cloud providers.<\/span>","<span data-v-f87c67ca=\"\">\"You shouldn't have all your nodes on Amazon,\" he said. \"You want to make sure that you are not overly dependent on any one provider at any given time.\"<\/span>"],"hashtag":[]}