{"summary":"The U.S. Securities and Exchange Commission’s acting chief accountant warned investors to put little faith in crypto companies’ proof-of-reserves.\nPaul Munter noted that the SEC is scrutinizing crypto companies’ supposed financial reports more closely.","author":["Adam James","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/197648\/sec-scrutiny-proof-of-reserves","publishDate":"2022-12-23T04:28:16","id":320,"type":null,"title":"SEC increasing scrutiny of crypto &#x27;proof-of-reserves&#x27;: WSJ","category":["Regulation"],"content":["The U.S. Securities and Exchange Commission's acting chief accountant, Paul Munter, warned investors to put little faith in crypto companies' proof-of-reserves.","“We’re warning investors to be very wary of some of the claims that are being made by crypto companies,” Munter <a href=\"https:\/\/www.wsj.com\/articles\/sec-heightening-scrutiny-of-auditors-crypto-work-11671681693\" data-v-f87c67ca=\"\">told<\/a> The Wall Street Journal, adding:&nbsp;“Investors should not place too much confidence in the mere fact a company says it’s got a proof of reserves from an audit firm.”","Munter also noted that the SEC is scrutinizing crypto companies' supposed financial reports more closely. “We are increasing our understanding of what’s going on in the marketplace,” Munter said. “If we find fact patterns that we think are troublesome, we will consider a referral to the division of enforcement.”","Munter's statements come about a week after accounting firm Mazars — a subject of <a href=\"https:\/\/www.theblock.co\/post\/193935\/skepticism-mazars-crypto-exchange\" data-v-f87c67ca=\"\">scrutiny<\/a> — temporarily <a href=\"https:\/\/www.theblock.co\/post\/195623\/mazars-pauses-crypto-audits\" data-v-f87c67ca=\"\">ceased<\/a> all efforts for crypto exchanges.","<em data-v-f87c67ca=\"\">Updated headline to attribute The Wall Street Journal.<\/em>"],"hashtag":["SEC"]}