{"summary":"Post-trade in capital markets today operates primarily based on provision of balance-sheet to off-set counterparty risk, either directly or indirectly, via settlement agents, CCPs and CSDs etc.  The issues with this ‘hub and spoke’ model are well known, including the resulting massive duplication of data, bifurcated processes, concentration of risk and subsequent deployment of capital and resources that could be better utilized. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/131722\/the-era-of-dfmi-for-institutional-digital-asset-markets","publishDate":"2022-01-26T09:00:49","id":320,"type":null,"title":"The Era of dFMI for Institutional Digital Asset Markets","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">Post-trade in capital markets today operates primarily based on provision of balance-sheet to off-set counterparty risk, either directly or indirectly, via settlement agents, CCPs and CSDs etc.&nbsp; The issues with this ‘hub and spoke’ model are well known, including the resulting massive duplication of data, bifurcated processes, concentration of risk and subsequent deployment of capital and resources that could be better utilized.&nbsp; Furthermore, the way many markets operate today is slow, and ‘markets’ are fixed to ‘business hours’ with significant constraints in terms of interoperability.&nbsp; Consequently, the markets are ‘layered’ with many intermediaries commercialising operational inefficiencies that artificially constrain market access and operation.&nbsp; We are entering a new era of Decentralised Financial Market Infrastructure (dFMI) for Digital Asset markets that provides modern infrastructure and post-trade capabilities utilizing the power of blockchain and avoiding the constraints of balance-sheet utilization-based systems, truly unlocking the potential of Digital Assets.<\/span>","<span data-v-f87c67ca=\"\">As part of this new era, the wider adoption of crypto currencies by institutional investors is also now entering a new and very relevant phase, especially as crypto currencies are more widely recognised as a suitable asset class to a range of investors from family offices to asset managers.&nbsp; This further highlights the need for better post-trade services.&nbsp; Post-trade is now widely recognized as <\/span><a href=\"https:\/\/www.marketsmedia.com\/post-trade-biggest-pain-point-in-digital-assets\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">the biggest pain point in Digital Assets<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp; Crypto currencies are in many ways, the MVP for the digitalization of capital markets, in that in time, all assets will be crypto assets, i.e., cryptographically provable and issued on-chain or tokenized onto a blockchain ledger.&nbsp; Bonds, equities, loans, funds, commodities etc., will all be either digitally native (from issue) or tokenized (by agents) as Digital Assets.&nbsp; As a consequence, the Digital Asset industry is rapidly evolving and benefiting from record levels of investment, including a range of new ‘institutional service providers.’&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A number of the largest TradFi and CeFi players are now building new Digital Asset and crypto capabilities as they enter or expand their footprint in the space.&nbsp; However, not all service providers are equal, or perhaps more important, neutral.&nbsp; Institutional investors need to ensure fiduciary certainty, as well as segregation of duties, and in general, self-custody or use of platforms that build up credit risk, fundamentally fails to achieve this.&nbsp; Additionally, the new breed of ‘prime brokers’ are a mix of credit providers (against their own balance sheet), exchange and custodian all-in-one, a model that is significantly flawed for most serious institutional investors.&nbsp; Insight into the size of balance sheet required to scale, such a business can be gleaned from looking at Credit Suisse, one of the largest Prime Brokers in traditional assets who is now exiting the Prime Brokerage business after a <\/span><a href=\"https:\/\/www.thetradenews.com\/credit-suisse-to-exit-prime-brokerage-following-archegos-capital-losses\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">loss related to a single hedge fund client of $5.5 Billion<\/span><\/a><span data-v-f87c67ca=\"\"> – <\/span><a href=\"https:\/\/seekingalpha.com\/symbol\/COIN\/balance-sheet\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">more than the entire balance sheet of Coinbase<\/span><\/a><span data-v-f87c67ca=\"\"> (total loss across all PBs was over $10 billion).&nbsp;<\/span>","<a href=\"https:\/\/bosonic.digital\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The Bosonic Network™<\/span><\/a><span data-v-f87c67ca=\"\"> is dFMI that connects clients, custodians, liquidity pools and is built on cryptographically provable asset ownership and value transfer leveraging programmable Layer-1 Smart Contracts coupled with the scalability of Layer-2 protocols that have much greater TPS, for greater inclusion, full interoperability and quality of service.&nbsp; Furthermore, this enables the elimination of counterparty credit and settlement risk for both trade execution and post-trade net settlement movements using <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/127370\/atomic-exchange-what-is-it-why-does-it-matter\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Atomic Exchange<\/span><\/a><span data-v-f87c67ca=\"\"> without dependency on the balance sheet.&nbsp; The Bosonic Network is a dFMI and peer-to-peer network with members accessing in-built features and applications via nodes, applications or APIs.&nbsp; At the core is an Atomic Exchange for transactions and settlements built on a Layer-2 blockchain that is fully interoperable with Layer-1 for final net settlement movements.&nbsp; The Bosonic Network enhances the role of the Digital Asset Custodian (DAC) who can tokenize or ‘re-ledger’ assets, so assets need never leave the custodian.&nbsp; Furthermore, with our network of DACs, the clients and the DACs benefit from cross-custodian net settlements.&nbsp; As a best-in-class dFMI for institutional clients, this results in a better, more institutionally aligned model that:&nbsp;&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Fit for purpose dFMI is essential to safe institutional adoption and development of the Digital Asset markets.&nbsp; The adoption of dFMI is part of the wider DeFi journey and the eventual digitalization of all assets and transactions.&nbsp; The technology infrastructure that ensures resilient and safe transacting for all market participants is the fabric on which this is built.&nbsp;&nbsp;&nbsp;<\/span>","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Decentralised Financial Market Infrastructure","content":"ORGANIZATION"},{"type":"Bosonic Network™","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Digital Asset","content":"ORGANIZATION"},{"type":"Digital Assets","content":"ORGANIZATION"},{"type":"$10 billion","content":"MONEY"},{"type":"MVP","content":"ORGANIZATION"},{"type":"DACs","content":"ORGANIZATION"},{"type":"Atomic Exchange","content":"ORGANIZATION"},{"type":"Bosonic Network","content":"ORGANIZATION"},{"type":"1","content":"DATE"},{"type":"Digital Asset Custodian (DAC","content":"ORGANIZATION"},{"type":"$5.5 Billion","content":"MONEY"},{"type":"Prime Brokerage","content":"ORGANIZATION"},{"type":"Credit Suisse","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}