{"summary":"Crypto venture firm Multicoin Capital has announced a new fund worth $100 million.\nThe fund would invest in DeFi, NFT, and other crypto projects.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/103700\/multicoin-capital-second-fund-100-million-defi-nft-crypto","publishDate":"2021-05-04T10:00:21","id":3202,"type":null,"title":"Multicoin Capital announces new $100 million fund to invest in DeFi, NFT and other projects","category":["Cryptocurrency"],"content":["Crypto investment firm Multicoin Capital has launched a new fund worth $100 million, according to a Tuesday announcement.","The Venture Fund II would invest in several crypto sectors, including decentralized finance (DeFi), non-fungible tokens (NFTs), Web3 applications, and crypto infrastructure projects, said Multicoin.","Specifically, in DeFi, the fund is interested investing in projects that are building on Solana, which Multicoin invested in previously.&nbsp;","Multicoin said that \"there will be a burgeoning DeFi ecosystem on Solana written natively in Rust that takes advantage of Solana's performance, and plugs into Serum's composable on-chain order book.\"","As for NFTs, Multicoin said that it is \"convinced\" that virtual world projects, known by some as the Metaverse, will be a \"massive\" opportunity. When asked why, Kyle Samani, managing partner of Multicoin Capital, told The Block: \"One of the most important trends in the world over the last 20 years has been that people spend an increasing percentage of their time online. The Metaverse represents the logical conclusion of that trend.\"","Besides DeFi and NFTs projects, Multicoin said it is also looking to invest in crypto-native distribution platforms for creators, gaming platforms, and Web3 infrastructure projects through its second fund.","\"Over the next few years, there is going to be an incredible wave of innovation in Open Finance and Web3, as well as new kinds of crypto-enabled infrastructure and applications,\" said the firm. \"This wave will only be possible because the underlying infrastructure has matured to a sufficient level. We expect to deploy a significant amount into these areas out of Venture Fund II over the next few years.\"","Multicoin's second fund was closed last November and has already made some investments, Samani told The Block, without sharing project names.","Multicoin's first fund is fully deployed, said Samani, but declined to share its size. That fund invested in more than 30 projects, including Solana, The Graph, Audius, Helium, and Arweave, <a href=\"https:\/\/www.theblockresearch.com\/mapping-out-multicoin-capitals-portfolio-2-97906\" data-v-f87c67ca=\"\">as The Block Research reported recently.<\/a>","Multicoin also announced that it has promoted three of its team members — Matt Shapiro, Mable Jiang, and John Robert Reed — to partners."],"hashtag":[]}