{"summary":"The Federal Reserve dropped a new central bank digital currency white paper on Thursday. While largely avoiding the topic of crypto, it suggests that a US CBDC could compete with &quot;private digital money.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/131096\/new-fed-paper-hints-that-a-us-cbdc-could-compete-with-private-digital-money","publishDate":"2022-01-20T18:40:07","id":3206,"type":null,"title":"New Fed paper hints that a US CBDC could compete with ‘private digital money’","category":["CENTRAL BANKS"],"content":["Thursday proved Fed chair Jerome Powell right in that the US central bank’s long-awaited central bank digital currency (CBDC) paper was right around the corner.","The <a href=\"https:\/\/www.theblockcrypto.com\/linked\/131051\/federal-reserve-publishes-long-awaited-central-bank-digital-currency-report\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">40-page paper<\/a> represents a key step toward what one day might become a digital dollar – though the authors stress at the outset that the paper’s existence doesn’t foretell any definitive policy move on the part of the Fed. Rather, it’s intended to be a conversation starter.","That said, it does offer a window into both the existing thought process of the Fed as it pertains to a potential digital dollar, as well as any contributions Fed officials may make when it comes to global policy and action around CBDCs.","One area of particular note, in the section on potential CBDC benefits, offers some interesting clues as to a potential motivation for a CBDC issuance: the rise and spread of private digital money.","At first glance, the while report doesn’t seem to offer much in the way of implications for digital assets and cryptocurrencies, apart from reiterating past calls for Congress to regulate stablecoins more closely.","Yet on pages 14 and 15 of the report, it invokes the “proliferation of private digital money” in a “rapidly digitizing economy” – and explores what role a CBDC might perform in that environment.","The Fed states that a CBDC “would offer the general public broad access to digital money that is free from credit risk and liquidity risk. As such, it could provide a safe foundation for private-sector innovations to meet current and future needs and demands for payment services.”","The authors then posit that “[a]ll options for private digital money, including stablecoins and other cryptocurrencies, require mechanisms to reduce liquidity risk and credit risk,” explaining:","“But all these mechanisms are imperfect. In our rapidly digitizing economy, the proliferation of private digital money could present risks to both individual users and the financial system as a whole. A U.S. CBDC could mitigate some of these risks while supporting private sector innovation.”","Additionally, per the Fed paper, a CBDC could “help to level the playing field in payment innovation for private sector firms of all sizes.”","In the Fed’s view, smaller companies may not have the capability to issue their own private money. Rather, a US CBDC “could overcome this barrier and allow private-sector innovators to focus on new access services, distribution methods, and related service offerings.”","The Fed also floated the role of a CBDC for micropayments, long seen as a use case for digital assets.","“As noted above, for example, a CBDC could potentially be programmed to deliver payments at certain times,” the paper explains. “Additionally, a CBDC could potentially be used to carry out micropayments—financial transactions that usually occur online and involve very small sums of money—which traditional payment systems are not necessarily designed to facilitate.”","To be sure, the Fed doesn’t explicitly invoke the word “competition” here. But given the context and potential use cases cited, it’s fair to contend that, in the Fed’s view, some of the services and innovations being developed in the crypto space today could take place in a CBDC-enhanced payments environment of the future.","Such offerings would likely emerge from some of the major payments players that have made no secret of their CBDC-related ambitions. These companies include <a href=\"https:\/\/www.theblockcrypto.com\/post\/94687\/paypal-ceo-central-bank-digital-currencies\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">PayPal<\/a> and <a href=\"https:\/\/www.theblockcrypto.com\/linked\/103333\/mastercard-cbdcs-payments-beyond\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Mastercard<\/a> – both of which have pursued crypto-related initiatives.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jerome Powell","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"}],"hashtag":["FEDERAL RESERVE"],"authors":["Michael McSweeney","The Block"]}