{"summary":"A bill that would exempt foreign residents from capital gains taxes when they sell digital currencies and reduce tax on crypto options for employees is making its way through Israel’s parliament.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237980\/bill-to-exempt-foreigners-from-crypto-capital-gains-tax-advances-in-israel-coindesk","publishDate":"2023-07-05T15:58:42","id":3208,"type":null,"title":"Bill to exempt foreigners from crypto capital gains tax advances in Israel: CoinDesk","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">A bill to exempt foreign residents from capital gains taxes when they sell digital currencies and reduce tax on crypto options for employees, has started to make its way through Israel’s parliament, according to a report from <a href=\"https:\/\/www.coindesk.com\/policy\/2023\/07\/05\/israeli-lawmakers-support-axing-crypto-capital-gains-tax-for-foreigners\/\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">CoinDesk<\/span><\/a>.&nbsp;<\/span>","The bill passed a preliminary reading in the country's parliament on Wednesday, according to the news site.&nbsp;","<span class=\"s3\" data-v-f87c67ca=\"\">\"Up until now, workers in the crypto industry had to pay double the tax on their options compared to workers in the traditional high-tech industry. Moreover, foreign investors in the blockchain industry were not entitled to the same benefits as those entitled to investors in the traditional high-tech industry,” said Dan Illouz, a lawmaker in Israel, cited by CoinDesk.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">The bill too has support of the coalition government led by Prime Minister Benjamin Netanyahu, Illouz said.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Israel's approach to crypto&nbsp;<\/b>","<span class=\"s3\" data-v-f87c67ca=\"\">Israel has been active over the past year in regulating crypto. The country’s financial regulator proposed draft <a href=\"https:\/\/www.theblock.co\/post\/199076\/israels-financial-regulator-proposes-crypto-inclusion-to-securities-law\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">amendments<\/span><\/a> in January to push digital assets into existing financial laws and expand the definition of securities.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">The Israel Securities Authority at the time said it saw an opportunity in crypto for investors and its economy.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">“The advanced technology in these assets can lead to economic efficiency in many areas, reduce costs, save the need for intermediaries and optimize the way information is transferred between entities,” the regulator said in January.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Israel Securities Authority","content":"ORGANIZATION"},{"type":"Israel","content":"LOCATION"},{"type":"Illouz","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"January","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Dan Illouz","content":"PERSON"},{"type":"Benjamin Netanyahu","content":"PERSON"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}