{"summary":"Crypto and AI are two key challenges to the SEC in the absence of consistent regulatory approaches, according to a report.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/261722\/sec-is-struggling-to-hire-crypto-experts","publishDate":"2023-11-06T12:17:54","id":3209,"type":null,"title":"The SEC is struggling to hire crypto experts, because they seem to want to HODL","category":["POLICY"],"content":["The Securities and Exchange Commission's Office of Inspector General, which supervises the financial regulator, says the agency is having a hard time hiring crypto experts who don't want to sell their digital assets to get a job.","\"Many qualified candidates hold crypto assets, which the Office of the Ethics Counsel has determined would prohibit them from working on particular matters affecting or involving crypto assets,\" the office said in a <a href=\"https:\/\/www.sec.gov\/files\/inspector-generals-statement-sec-mgmt-and-perf-challenges-october-2023.pdf\" data-v-f87c67ca=\"\">report<\/a> dated Oct. 31. \"This prohibition, according to SEC officials, has been detrimental to recruiting, as candidates are often unwilling to divest their crypto assets to work for the SEC.\"","The regulator, which is involved in a number of enforcement actions against major exchanges including Coinbase and Binance, also faces a small candidate pool of qualified experts, and high competition from the private sector.","The comments came in a 25-page report that details the SEC's top management and performance challenges. Along with artificial intelligence, crypto was cited as an \"emerging area\" presenting special challenges for the regulator.&nbsp;","\"The SEC's ability to remain an effective regulator requires that it continuously monitor the market environment, and as appropriate, adjust and modernize its expertise, rules, regulations, and oversight tools and activities,\" the report stated. \"The SEC recognizes the rapid growth in crypto assets as one of several 'evolutionary risks.'\"","Highlighting recent court rulings, and referencing a recent SEC lawsuit against <a href=\"https:\/\/www.theblock.co\/post\/258581\/ripple-celebrates-dismissed-lawsuit-calling-it-a-surrender-by-the-sec\" data-v-f87c67ca=\"\">Ripple Labs<\/a>, the report said that there was still no consistent caselaw for crypto, leading to a situation where \"even judges in the same district can reach inconsistent decisions on similar facts or issues.\"","\"It may take years before the law in this area crystalizes to the point where outcomes are reasonably predictable. This uncertainty may affect the SEC's enforcement decisions and priorities,\" the report stated.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Office of the Ethics Counsel","content":"ORGANIZATION"},{"type":"Oct. 31","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["SEC"],"authors":["Anna Baydakova","The Block"]}