{"summary":"Robinhood came back online today after a 17-hour outage that infuriated traders \nMarket structure experts say regulators will likely react, possibly harshly \nIt is also possible that the incident could reignite debates over a little-known regulation called Reg SCI","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/57587\/robinhoods-17-hour-outage-reignites-debate-over-a-controversial-rule-that-reshaped-the-stock-market","publishDate":"2020-03-03T19:50:54","id":3211,"type":null,"title":"Robinhood&#x27;s 17-hour outage reignites debate over a controversial rule that reshaped the stock market","category":["Capital Markets"],"content":["Robinhood has been making headlines&nbsp;for its <a href=\"https:\/\/www.nytimes.com\/2020\/03\/03\/technology\/trading-app-robinhood-outage.html\" data-v-f87c67ca=\"\">17-hour platform outage<\/a>, but angry clients could be just the beginning of their concerns, according to some market structure experts.&nbsp;","The California-based brokerage firm is among Silicon Valley's hottest financial technology startups, boasting a $7 billion valuation, a young, bright-eyed, client base in the millions, and of course its sleek trading app. Still, over the past year, the firm has hit a few bumps on its journey to toppling the Wall Street old guard, botching the launch of its <a href=\"https:\/\/techcrunch.com\/2019\/10\/08\/robinhood-cash-management\/\" data-v-f87c67ca=\"\">checking account feature<\/a>, getting slapped with a $1.25 million fine from self-regulatory organization <a href=\"http:\/\/finra.org\/media-center\/newsreleases\/2019\/finra-fines-robinhood-financial-llc-125-million-best-execution\" data-v-f87c67ca=\"\">FINRA<\/a>, and most recently, of course, the two-day outage during the most volatile trading period since the financial crisis.","For the most part, the infrastructure of U.S. equity markets was running as usual: market makers were filling quotes and exchanges' systems were matching trades — even as volumes soared beyond 19 billion shares traded, the highest since the financial crisis. Indeed, analysts <a href=\"https:\/\/twitter.com\/ltabb\/status\/1234501710279774208?s=20\" data-v-f87c67ca=\"\">commented<\/a>&nbsp;on the resiliency of most market infrastructure as prices plummeted over the course of last week and whipsawed this week.&nbsp;However, Robinhood stood out as the one notable exception and their clients weren't shy about hiding their discontentment, taking to Twitter and Reddit their lamentations.&nbsp;The firm came back online just after 9 a.m. PT Tuesday.","While there are many places you can <a href=\"https:\/\/markets.businessinsider.com\/news\/stocks\/robinhood-outage-reddit-twitter-backlash-brokerage-stock-market-volatility-2020-3-1028960920\" data-v-f87c67ca=\"\">read<\/a> about the reaction of frustrated traders, this piece examines the market structure ramifications and the regulatory ramifications for Robinhood as a company.&nbsp;Following conversations with several market structure specialists, the outage will likely elicit a reaction and response from regulators. A spokeswoman for Robinhood said in an email to The Block that the firm cannot comment on regulatory matters.&nbsp;","<strong data-v-f87c67ca=\"\">Broader market structure ramifications <\/strong>","John Schwall, the co-founder of equities exchange IEX, told The Block in a phone interview that he wouldn't be surprised if there was a potential Senate hearing to address the outage.&nbsp;","\"They could be forced to testify and explain what could have been millions of dollars worth of losses,\" Schwall said.&nbsp;","Regulators could also revisit a little-known markets rule, Regulation Systems Compliance Integrity or Reg SCI. <a href=\"https:\/\/www.sec.gov\/spotlight\/regulation-sci.shtml\" data-v-f87c67ca=\"\">Adopted in 2014<\/a>, the regulation was adopted following a fury of market snafus in the 2000s, including the $440 million glitch at Knight Capital in 2012, Facebook's botched IPO, and the 2010 market flash crash. The idea, market participants at the time say, was to expand regulators' oversight over the infrastructure of systemically important institutions in the market. Retail brokers like Charles Schwab, TDAmeritrade, and, yes, Robinhood are not covered by Reg SCI while exchanges and some alternative trading systems are.&nbsp;","To be clear, the point of Reg SCI is to prevent market snafus that impact the broader market, which Robinhood's outage did not do. For instance, it did not result in faulty prices being quoted in the broader market or force traders to execute when they did not want to. A spokeswoman said the outage was tied to \"an issue with a part of our infrastructure.\"&nbsp;","In a <a href=\"https:\/\/blog.robinhood.com\/news\/2020\/3\/3\/an-update-from-robinhoods-founders\" data-v-f87c67ca=\"\">blog<\/a> published shortly before the publication of this article, Robinhood's co-founders further explained the cause and length of the outage, noting:","\"We worked as quickly as possible to restore service, but it took us a while. Too long. We now understand the cause of the outage was stress on our infrastructure—which struggled with unprecedented load. That in turn led to a “thundering herd” effect—triggering a failure of our DNS system.\"","Several employees in the broker space reached out to The Block about the \"egregiousness\" of the incident following publication. Still, Dave Weisberger, who contributed to the conversation on Reg SCI when he worked at Two Sigma, said it could have been much worse, from a market impact perspective.&nbsp;","\"They could have flooded the market with faulty orders,\" he said, as an example.&nbsp;","Weisberger and Schwall represent two different camps on Reg SCI. Schwall points to the Robinhood outage as a prime example as to why some brokers should have been covered all along.&nbsp;","\"When I think back to 2014, it was remarkable to me that they didn't include oversight of the retail brokers and the venues where those orders are being executed,\" referring to firms like TDAmeritrade and the firms they route their order flow to.&nbsp;","\"Minimally, the retail brokers have zero cybersecurity oversight, nor do the wholesale firm,\" he said. \"And now you see the lack of quality control.\"","Larry Tabb, who founded capital markets consultancy Tabb Group, disagreed with Schwall's take, noting that a broker would not be categorized as \"critical infrastructure\" to fall under the auspices of SCI.&nbsp;","\"Maybe a market maker would be critical infrastructure (like the top 2 or 3), but one broker...?,\" he said in a tweet.","Still, Schwall noted Robinhood's unique position in the market could make it count as key infrastructure.&nbsp;","\"If a broker becomes the single order entry gateway for over 10 million retail investors or a wholesaler trades against 40% of all retail orders, then you have to question whether that participant has become a key part of the US Equity market infrastructure,\" he said.&nbsp;","<strong data-v-f87c67ca=\"\">Reg SCI debate<\/strong>","The debate boils down to most regulatory debates: protecting investors versus overburdening companies with regulatory headwinds. Indeed, to Robinhood's credit, it has expanded the pool of U.S. stock investors to millions of previously underserved clients. There's an argument to be made that if Reg SCI covered brokers when Robinhood first started off, the company would not have grown to its current size since it would have faced steep regulatory burdens. Although, others might argue that's a good thing.&nbsp;","\"Customers of these firms are going to vote with their feet,\" Weisberger said. \"People who care about operational excellence will go somewhere else.\"&nbsp;","Still, even Weisberger agrees with Schwall that regulators are going to take this seriously. And that could mean revisiting the parameters of Reg SCI and possibly new standards.&nbsp;","\"There will be scrutiny here,\" Weisberger said. Indeed, Weisberger mused over the thought of a possible Reg SCI lite.","\"I would be very surprised if there isn't some sort of open meeting to discuss whether some of this should apply to certain brokers of a certain size.\"","In an SCI lite, Schwall said certain broker activities would not need to be covered such as access to research or charting. Schwall said:&nbsp;","\"But investors should have the ability to enter and execute orders, especially during extreme market events. This is something the regulators realized after the ‘87 crash when investors couldn’t get through to their brokers. That was over 30 years ago where there was limited online brokerage. We now have a very heavy concentration of all retail investors among a very limited number of retail brokers.\"","It is not clear if Robinhood will ever share specific details of the impact of the outage. The firm has said that it is working on a case-by-case basis to make things right with clients and a spokeswoman said they would be releasing information about how they plan to avoid this scenario in the future. Still, they have no obligation to report the impact to the SEC, Schwall says.&nbsp;","\"We may never get information on the impact on the customer,\" he said.&nbsp;","\"I bet the SEC is kicking themselves in the head.\"","<em data-v-f87c67ca=\"\">This post was updated to include information from a blog post published by Robinhood Tuesday evening.&nbsp;<\/em>"],"hashtag":[]}