{"summary":"Roblox&#x27;s DAUs grew by 23% to 56 million year-over-year in 2022.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/212025\/the-metaverse-is-already-here-gamers-spent-nearly-50-billion-hours-on-roblox-in-2022","publishDate":"2023-02-15T10:31:05","id":3212,"type":null,"title":"The metaverse is already here: Gamers spent nearly 50 billion hours on Roblox in 2022","category":["METAVERSE & NFT"],"content":["<span data-v-f87c67ca=\"\">Metaverse enthusiasts have something to cheer about, with Roblox growing on all fronts.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nNot only did Roblox increase its user numbers and the size of its platform’s internal economy in 2022, players also<\/span><span data-v-f87c67ca=\"\"> spent nearly 50 billion hours engaging with the platform, up 19% from the previous year. Shares of the company jumped 25% after the open.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Roblox reported that its daily active-user total grew by 23% to 56 million when comparing 2022 to the previous year. The company also said that in January its number of daily active users hit 65 million.<\/span>","<span data-v-f87c67ca=\"\">In the eyes of many tech leaders, Roblox’s popularity with younger users, coupled with the way the platform functions, serves as a model of an already working metaverse.&nbsp;<br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Full year 2022 “bookings” also increased by 5%, with Roblox reporting that it generated $2.9 billion selling the platform's internal currency. The company characterizes “bookings” as the revenue it created by users purchasing \"Robux,\" the currency players then use to customize their playing experience, such as their avatars.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">“2022 was a year of innovation and invention for Roblox,” Roblox founder and CEO David Baszucki said in a statement. “With 65 million daily active users in January, we are driving towards our vision to reimagine the way people come together by enabling deeper forms of expression, communication and immersion.”<br data-v-f87c67ca=\"\">\n<\/span>","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"19%","content":"PERCENT"},{"type":"25%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"David Baszucki","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"23%","content":"PERCENT"},{"type":"$2.9 billion","content":"MONEY"}],"hashtag":[],"authors":["RT Watson","The Block"]}