{"summary":"Ethereum scaling project Polygon has another co-founder make a professional pivot months after launching upgrade.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/254771\/another-polygon-co-founder-steps-away-from-duties","publishDate":"2023-10-04T12:13:57","id":3214,"type":null,"title":"Another Polygon co-founder steps away from duties","category":["COMPANIES"],"content":["Polygon co-founder Jaynti Kanani has decided to step away from his full-time duties helping to lead the company he helped start in 2017.","\"After kickstarting Polygon in 2017, around 6 months back, I decided to step back from the day-to-day grind,\" he posted on&nbsp; X to <a href=\"https:\/\/twitter.com\/jdkanani\/status\/1709569503099519296?s=46&amp;t=Fc6SuL5caET2iiGtYJsxTw\" data-v-f87c67ca=\"\">make the announcement<\/a>.&nbsp;\"I'll be focusing on new adventures while still cheering and contributing to Polygon from the sidelines.\"","Polygon saw another co-founder make a professional pivot earlier this year when Anurag Arjun <a href=\"https:\/\/www.theblock.co\/post\/220454\/polygon-avail-anurag-arjun\" data-v-f87c67ca=\"\">departed<\/a> the company to spin off the modular blockchain project Avail. In total, Polygon and its projects have a total of 10 co-founders, according to its website.","Kanani said he is \"bullish\" on Polygon 2.o. Last month, the Ethereum scaling project <a href=\"https:\/\/www.theblock.co\/post\/250944\/polygon-matic-upgrade\" data-v-f87c67ca=\"\">officially proposed<\/a> changes for the upgrade after first introducing it in June.","Polygon 2.0 aims to establish a comprehensive network of interconnected Layer 2 chains, driven by zero-knowledge proofs.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kanani","content":"PERSON"},{"type":"Jaynti Kanani","content":"PERSON"},{"type":"2017","content":"DATE"},{"type":"Anurag Arjun","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"2023","content":"DATE"}],"hashtag":[],"authors":["RT Watson","The Block"]}