{"summary":"Crypto brokerage Voyager has signed a definitive agreement with Circle to acquire its Circle Invest app.Voyager said the deal will add over 40,000 retail accounts to its customer base.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/55656\/voyager-to-acquire-circles-retail-trading-platform-in-an-all-stock-deal","publishDate":"2020-02-12T09:30:23","id":3216,"type":null,"title":"Voyager acquiring Circle’s retail trading platform via all-stock deal","category":["STARTUPS"],"content":["Crypto brokerage Voyager is set to acquire Circle’s retail trading app, Circle Invest, in an all-stock deal.","The Canada-listed brokerage firm has signed a definitive agreement with Circle for the deal, according to an announcement shared with The Block on Wednesday. As part of the deal, Voyager will issue its common shares to Circle, representing nearly a 4% ownership stake. One share of Voyager is currently <a href=\"https:\/\/in.tradingview.com\/symbols\/CSE-VYGR\/\" data-v-f87c67ca=\"\">priced<\/a> at around CA$ 0.40 (~US$0.30).","It remains unclear how many shares does the stake involve and when the acquisition will get completed. Both Voyager and Circle did not respond to The Block’s requests for comment by press time.","The acquisition will add over 40,000 retail accounts to Voyager’s customer base, per the announcement, making its total to over 200,000 global users. The firm said the “majority” of Circle Invest customers are expected to be converted to its platform by the end of this March.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"This product line acquisition signifies a tremendous development for Voyager as we welcome a substantial number of new users to our platform,” said Stephen Ehrlich, co-founder and CEO of Voyager. “This transaction also helps us deliver on our promise to investors, providing regulated brokerage services and resources to as many users as possible in the digital asset marketplace.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Trading app&nbsp;<\/strong><\/span>","Circle Invest was <a href=\"https:\/\/mashable.com\/2018\/05\/23\/circle-invest-cryptocurrency\/\" data-v-f87c67ca=\"\">launched<\/a> in March 2018 to let users buy cryptocurrencies, such as bitcoin (BTC) and ether (ETH), for as low as $1. The app currently <a href=\"https:\/\/apps.apple.com\/us\/app\/circle-invest\/id1334770744?_branch_match_id=434246903874593954\" data-v-f87c67ca=\"\">supports<\/a> a total of 13 cryptocurrencies and tokens.","Circle Invest is notably only available in the U.S. The app also offers a “collections” <a href=\"https:\/\/www.circle.com\/en\/invest\" data-v-f87c67ca=\"\">feature<\/a>, which allows users to automatically divide their investment across all coins in a bundle based on market cap. Crypto exchange Coinbase also offered a similar feature, “Coinbase Bundle,” but <a href=\"https:\/\/www.theblockcrypto.com\/linked\/32639\/coinbase-shuts-down-the-coinbase-bundle-product\" data-v-f87c67ca=\"\">shut it down<\/a> last year without giving any reason.","Voyager said Circle Invest’s “popular” collections feature will be integrated into its platform, allowing users to maintain a diversified digital assets portfolio.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Series of changes&nbsp;<\/strong><\/span>","The Voyager deal comes almost two months after Circle <a href=\"https:\/\/www.theblockcrypto.com\/post\/50900\/circle-otc-trading-desk-crypto-exchange-kraken\" data-v-f87c67ca=\"\">sold<\/a> its once-mighty over-the-counter (OTC) trading operation to Kraken in December. Jeremy Allaire, founder of Circle, <a href=\"https:\/\/www.theblockcrypto.com\/post\/50994\/circle-says-it-sees-hope-in-usdc-stablecoin-after-otc-desk-sale-poloniex-spin-out\" data-v-f87c67ca=\"\">told The Block<\/a> at the time that rising pressure on the regulatory front in the U.S. was a key factor for the Kraken deal.&nbsp;","This reasoning also applied to Poloniex's spin-out from Circle, Allaire said at the time. Crypto exchange Poloniex, which Circle bought for a heaping $400 million,&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/post\/43794\/circle-spinning-out-poloniex-plans-to-invest-100m-and-not-serve-us-clients\" data-v-f87c67ca=\"\">spun out<\/a>&nbsp;of Circle last October.","Circle, founded in 2013, has undergone a series of changes in recent months. The firm <a href=\"https:\/\/www.theblockcrypto.com\/post\/50994\/circle-says-it-sees-hope-in-usdc-stablecoin-after-otc-desk-sale-poloniex-spin-out\" data-v-f87c67ca=\"\">laid off<\/a> around 10 employees, following its co-founder Sean Neville's exit in December. Circle's CFO Naeem Ishaq also quit last month.","Circle, for now, appears to be betting on the future of stablecoins and prospective digital currencies issued by central banks. \"The global interest in stablecoins and digital currency backed by central bank money, the introduction of third generation public blockchains, and the accelerated global policy interest in crypto all provide an exciting backdrop for our new platform services in 2020,\" the firm said in December.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nCircle is planning to offer a crypto banking platform-as-a-service to firms that need to interact with legacy financial systems, Allaire told The Block at the time. These services could include crypto custody, risk and identity management and compliance management, among others.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"This transition comes at a time when Circle is launching new platform services and products for businesses around the world to help them bring the benefits of stablecoins into their products and grow global commerce in new and innovative ways,\" Rachel Mayer, director of product management at Circle, said in today's statement. ","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"4%","content":"PERCENT"},{"type":"2013","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Voyager and Circle","content":"ORGANIZATION"},{"type":"$1","content":"MONEY"},{"type":"Allaire","content":"PERSON"},{"type":"Stephen Ehrlich","content":"PERSON"},{"type":"March 2018","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"$400 million","content":"MONEY"},{"type":"Sean Neville","content":"PERSON"},{"type":"U.S","content":"LOCATION"},{"type":"Poloniex","content":"ORGANIZATION"},{"type":"Jeremy Allaire","content":"PERSON"},{"type":"CFO Naeem Ishaq","content":"ORGANIZATION"},{"type":"Rachel Mayer","content":"PERSON"},{"type":"Circle Invest","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"“majority” of Circle Invest","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Voyager","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Circle","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"October","content":"DATE"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}