{"summary":"Blockchain infrastructure provider Biconomy has raised $9 million in a funding round.\nBiconomy looks to grow its current team of 14 to 20 by the end of this year and work on its planned product roadmap, CEO Ahmed Al-Balaghi told The Block. ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/112770\/blockchain-infrastructure-provider-biconomy-raises-9-million-saft","publishDate":"2021-07-28T09:00:50","id":3217,"type":null,"title":"Blockchain infrastructure provider Biconomy raises $9 million in SAFT sale","category":["Venture Capital"],"content":["Biconomy, which provides blockchain infrastructure to developers, has raised $9 million in a funding round. The funding was secured via a Simple Agreement for Future Tokens (SAFT) sale, Biconomy CEO Ahmed Al-Balaghi told The Block.","Venture firms DACM and Mechanism Capital co-led the round, with participation from Coinbase Ventures, Bain Capital Ventures, NFX, Ledgerprime, Huobi Innovation Labs, Primitive Ventures, and others. Angel investors, including Stani Kulechov of Aave, Prabhakar Reddy of FalconX, Stephane Gosselin of Flashbots, and independent crypto researcher Hasu also participated in the round.","The fresh capital injection will help Biconomy to grow its current team of 14 to 20 by the end of this year and work on its planned product roadmap, said Al-Balaghi.","Launched in 2019, Biconomy currently provides two products to blockchain developers to increase the adoption of decentralized finance (DeFi) applications. The first product is called Gasless, which allows DeFi apps to pay gas fees on behalf of their users, resulting in smoother onboarding and user experience. The second product is called Forward, which offers users an option to also pay gas fees in stablecoins and ERC-20 tokens, besides the standard ether (ETH) option.","Al-Balaghi said about 30 crypto projects are using its infrastructure and additional 50 clients are set to be added.","Biconomy is also set to launch a new tool called Hyphen in the first week of August, which will allow developers to offer fast value transfers between Ethereum and Layer-2 solutions such as Polygon and enable quick onboarding from Layer-1 networks to Layer-2 networks, said Al-Balaghi.","As part of its near-term plans, Biconomy is also looking to decentralize its infrastructure with a new multichain relayer protocol called Mexa.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>To that end, Biconomy is gearing up to launch its native token BICO that will enable community governance and incentivize stakeholders. “We’ll launch the token either by the end of the third quarter or fourth quarter of this year,” said Al-Balaghi.","The SAFT funding brings Biconomy’s total funding to date to $10.5 million. The firm <a href=\"https:\/\/www.theblockcrypto.com\/post\/90723\/blockchain-biconomy-1-5-million-seed-funding-round\" data-v-f87c67ca=\"\">raised<\/a> $1.5 million in a seed funding round earlier this year, which was an equity round, said Al-Balaghi."],"hashtag":[]}