{"summary":"Crypto security startup Casa has seen major growth in its Keymaster product and has decided to open source its Bitcoin and Lightning nodes to focus on the former\nCasa is working on a multisig inheritance solution as a new feature of its Keymaster product\nCurrent head of product, Nick Neuman, is replacing Jeremy Welch as the company’s CEO","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/54619\/crypto-security-firm-casa-shifts-its-focus-from-selling-bitcoin-nodes-to-improving-its-multisig-solution","publishDate":"2020-01-31T10:00:28","id":3218,"type":null,"title":"Casa is shifting its focus from hardware to software","category":["Custody"],"content":["<span data-v-f87c67ca=\"\"><a href=\"https:\/\/www.theblockcrypto.com\/daily\/13866\/casa-is-dramatically-shifting-its-business-and-its-kicking-off-with-two-new-products\" data-v-f87c67ca=\"\">Casa<\/a>, the cryptocurrency custody startup that aims to help Bitcoin holders maximize safety and security, is announcing a major shift in its leadership and business strategies.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For one, the company’s CEO, Jeremy Welch, is stepping down due to a family health issue and Nick Neuman, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/10002\/casa-opens-its-code-to-the-public\" data-v-f87c67ca=\"\">Casa's<\/a> current head of product, is filling his role, the firm told The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Moreover, in light of the significant growth it has observed with its Keymaster product, the company has decided to open source its other product, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/19750\/casa-kicks-off-data-privacy-campaign-with-a-privacy-policy-update\" data-v-f87c67ca=\"\">Casa<\/a> nodes, to focus on adding new features to Keymaster and improving its usability.&nbsp;<\/span>","\"We are focusing on Keymaster because helping people secure their bitcoin is the most important problem to solve right now, and we've heard that loud and clear from our customers,\" Neuman said of Keymaster.","<span data-v-f87c67ca=\"\">“The growth that we’ve seen in Keymaster has been so strong and it’s something that we as a business can use to make a profit and make a return for investors,” added. “We couldn’t ignore that traction that we’ve been seeing and we’ve realized we needed to double down there.”<\/span>","<strong data-v-f87c67ca=\"\">Inheritance play<\/strong>","<span data-v-f87c67ca=\"\">One new feature that <a href=\"https:\/\/www.theblockcrypto.com\/linked\/42479\/casa-announces-a-new-version-of-its-bitcoin-full-node\" data-v-f87c67ca=\"\">Casa<\/a> plans to roll out in the near future is an inheritance solution. <\/span>","<span data-v-f87c67ca=\"\">Conventionally, bitcoin holders need to have very specific instructions in space for their heirs to receive their bitcoin after they pass away. The new solution that Casa is building, on the other hand, utilizes multisig and allows <a href=\"https:\/\/www.theblockcrypto.com\/linked\/74256\/casa-bitcoin-buying-mobile-app\" data-v-f87c67ca=\"\">Casa<\/a> to distribute keys to the heir after the bitcoin holder's death.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We’re talking about a life changing amounts of money and people potentially storing life savings in these vehicles,” Casa CTO Jameson Lopp said. “And when you're comparing the risk and loss potential with this service to that of the lightning node services, Keymaster is an order of magnitude more important to people.”<\/span>","<span data-v-f87c67ca=\"\">Casa has also decided to reduce the price of its gold membership plan, which covers the 2-of-3 multisig solution, from $408 to $128 per year to enable a larger use base to access the security product.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In the meantime, Neuman noted that <a href=\"https:\/\/www.theblockcrypto.com\/post\/1203\/casa-the-crypto-security-firm-brings-on-an-industry-heavyweight-as-it-eyes-new-opportunities\" data-v-f87c67ca=\"\">Casa<\/a> will not give up its Bitcoin and Lightning nodes completely. Instead, the company will open source the product for the whole community to use.<\/span>","<span data-v-f87c67ca=\"\">“Rather than completely just dropping the product, we're like actually putting internal company resources into making sure that it's open sourced and continues to be a great way to run a bitcoin for our community and for the Bitcoin community as a whole,” he said.<\/span>","<em data-v-f87c67ca=\"\">Frank Chaparro contributed to the reporting.<\/em>"],"hashtag":[]}