{"summary":"Following Binance’s alleged KYC leak last week, several sources told The Block that Huobi users’ information is surfacing on some dark-web markets\nHuobi claims that most of this information, mainly consisting of phone numbers, is not associated with Huobi users\nHuobi said these phone numbers may be gathered by hijacking third party messaging service providers and the leak is not due to any security breach on Huobi ","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/36190\/this-issue-is-different-huobi-responds-to-user-phone-number-leak-following-binance-kyc-hack","publishDate":"2019-08-15T17:37:52","id":3221,"type":null,"title":"&quot;This issue is different&quot;: Huobi responds to user phone number leak following the alleged Binance KYC hack","category":["Security"],"content":["Binance <a href=\"https:\/\/www.theblockcrypto.com\/2019\/08\/07\/binance-responds-to-an-alleged-kyc-breach-on-telegram-saying-there-are-inconsistencies-involved\/\" data-v-f87c67ca=\"\">made headlines<\/a> earlier this month after its users' personal information was allegedly spread in a Telegram chat, but sources have told The Block that the problems facing the world's largest cryptocurrency exchange might also hang over other crypto firms.&nbsp;","Huobi, another crypto exchange with Chinese roots, appears to be in a similar boat as Binance. The exchange's name constantly surfaces on the dark web markets, where self-proclaimed hackers are selling user information that allegedly belongs to Huobi's customers.","<strong data-v-f87c67ca=\"\">All roads lead to the Dark Web<\/strong>","On Chinese dark-web markets, &nbsp;folks can buy alleged Huobi user data for as little as $0.30.","<span data-v-f87c67ca=\"\">This data supposedly includes phone numbers and text messages users receive when they withdraw from the exchange.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">One seller, who claimed to be a hacker, promised that these phone numbers are “absolutely real” and can yield a high pick-up rate, suggesting that potential scammers can expect responses when reaching out to these numbers. The hacker even added that these phone numbers' \"convert rate is decent for conducting a pyramid scheme.\"&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This particular seller, along with some others, also claims to have user data from other less known exchanges such as BIKI, Hetbi, and ZDCoin.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">When reached for comment, Huobi head of marketing Ross Zhang told The Block that at least one of the advertisements are not, in fact, selling user data from Huobi. The exchange ran the data being sold against its own database and found “only a negligible portion of the phone numbers are associated with Huobi accounts.”<\/span>","<span data-v-f87c67ca=\"\">“We suspect that the hacker is using Huobi's name as a gimmick for their own business interests,” said Zhang.<\/span>","<strong data-v-f87c67ca=\"\">A breach of a messaging service?<\/strong>","<span data-v-f87c67ca=\"\">The phone numbers that are allegedly associated with Huobi users might have been gathered by means other than hacking the Huobi platform directly. A Huobi spokesperson said that these phone numbers might have been hijacked by breaching a third-party messaging provider, which would explain why some data contains content of verification messages sent by Huobi to users.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We understand that due to the recent leak from a major exchange, there are growing concerns regarding the leak of users’ KYC data which contains essential and highly confidential user information. However, this issue is different,” said the spokesperson.<\/span>"],"hashtag":["BINANCE","HTX"]}