{"summary":"A judge dismissed some claims against Bitfinex and Tether today, including those that sought to litigate issues under a New York act focused on fighting organized crime.\nThe court upheld other claims, including ones alleging monopolistic practices and market manipulation that could have harmed traders.\nTether and Bitfinex say they don’t intend to settle the remaining claims.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/119054\/judge-dismisses-some-claims-against-bitfinex-and-tether-but-class-action-lawsuit-continues","publishDate":"2021-09-30T12:19:40","id":3222,"type":null,"title":"Judge dismisses some claims against Bitfinex and Tether but class-action lawsuit continues","category":["Legal"],"content":["A judge has thrown out about half of the claims in a class-action lawsuit alleging that exchanges Bitfinex, Bittrex and Poloniex, stablecoin operator Tether and others manipulated crypto markets.","In <a href=\"https:\/\/www.theblockcrypto.com\/post\/67379\/amended-lawsuit-filed-against-bitfinex-and-tether-for-allegedly-manipulating-crypto-market-bittrex-and-poloniex-added-as-new-defendants\" data-v-f87c67ca=\"\">June of 2020<\/a>, a group of traders and trading firms grouped up to file an amended complaint against the exchanges in the Southern District Court of New York. The lawsuit alleged the group of exchanges utilized Tether to manipulate the crypto markets, having Tether issue USDT to itself without dollar-backing and then selling the newly issued tokens to its sister company Bitfinex. The filing had been amended to include Bittrex and Poloniex, claiming the exchanges knew Bitfinex was transferring large amounts of unbacked USDT onto their platforms.&nbsp;","That lawsuit sought \"reasonable costs of suit, pre- and post-judgment interest, and reasonable attorneys’ fees” and a trial by jury to hammer out those claims.&nbsp;","Now, according to an <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.nysd.524076\/gov.uscourts.nysd.524076.182.0_2.pdf\" data-v-f87c67ca=\"\">order<\/a> dated Sept. 28, Judge Katherine Polk Failla has preserved some of those claims to be litigated and dismissed others.&nbsp;","Perhaps most impactfully, the plaintiffs filed claims under the Racketeer Influenced and Corrupt Organizations Act, or RICO Act, which aims to eradicate organized crime. The traders made multiple claims under this act, all of which were dismissed by Failla, meaning Bitfinex and fellow defendants won't face claims of racketeering or scrutiny as a possible organized crime enterprise.","Tether touted the decision Wednesday, <a href=\"https:\/\/tether.to\/ny-court-dismisses-half-of-class-action-plaintiffs-claims-against-tether\/\" data-v-f87c67ca=\"\">announcing<\/a> that the Court dismissed \"half of the class action plaintiffs’ claims against Tether and Bitfinex, including all of their RICO claims.\"","Indeed, the order dismissed six claims, upheld five claims and partially dismissed one.&nbsp;","\"With half their case now dismissed, their primary expert debunked, and their lead law firm embroiled in its own internecine war—with its partners and former partners trading allegations of fraud and ethics violations—this case is doomed. This is unsurprising given that plaintiffs’ claims are meritless,\" said the firm's statement.","The exchanges will still have to face a myriad of claims from the plaintiffs. Failla decided that the traders adequately alleged possible market manipulation, and that serves as the catalyst for further monopoly claims.&nbsp;","The plaintiffs claim that buying a manipulated asset and losing money is enough to constitute an antitrust injury. Antitrust issues are litigated under the Sherman Act, which safeguards against monopolies. Bitfinex and fellow defendants argued that price manipulation that doesn't result in a clearly defined loss as a result of manipulation doesn't fall under monopolistic practices under this law. Failla didn't fully agree with either take, but she sustained the claim.","\"While the Court disagrees with Plaintiffs’ argument that merely purchasing an item in a market subject to price manipulation necessarily suffices to demonstrate antitrust injury, it ultimately concludes that Plaintiffs have sufficiently alleged facts to establish that the price manipulation by which they claim to have been injured was the product of an anticompetitive scheme,\" Failla wrote in the order.","Failla also concluded that the traders adequately alleged their monopolization claim against Bitfinex and Tether, but not the other defendants. The traders argued that the alleged collaboration of Bitfinex and Tether constituted a monopolistic practice since the two could manipulate supply and demand forces. To be clear, making this argument stick would require the plaintiffs to prove that Bitfinex and Tether did actually collaborate to print USDT for this reason, as Failla noted.","\"It remains to be seen whether Plaintiffs will be able to establish willful acquisition in discovery,\" said the order. \"But taking the allegations in the Amended Complaint as true and drawing all reasonable inferences in Plaintiffs’ favor, Plaintiffs plausibly allege the DigFinex Defendants’ willful intent to acquire monopoly power.\"","The traders wanted to include Bittrex and Poloniex in their conspiracy to monopolize claim, but Failla found there wasn't sufficient evidence to show that the exchanges might've helped the alleged Bitfinex\/Tether operation. The Court didn't find evidence that there was intent to assist, and possibly knowing was not enough to uphold the claim.","Through the alleged actions, defendants claimed that the exchanges conspired to restrain trade, and these violations of the Sherman Act resulted in damages against them as individuals. Failla found these claims adequately alleged as well.","Defendants also claim that the alleged manipulation constituted violations of the Commodities Exchange Act (CEA), which safeguards against contract or swap manipulation. These claims were upheld as well.","Bittrex, Poloniex and other individual defendants are also still on the hook for possible principal-agent liability and possible aiding and abetting. The traders alleged that these entities acted as agents of Bitfinex and Tether by serving as corporate officers.","Tether, Bitfinex and fellow defendants must file answers to the amended complaint by October 28. Both plaintiffs and defendants will file a joint status letter with a case management proposal by Nov. 18.&nbsp;","Bitfinex and Tether say they look forward to litigating the case and don't plan to settle on the claims that remain.&nbsp;","\"Litigation will expose this case for what it is: a clumsy attempt at a money grab, which recklessly harms the whole cryptocurrency ecosystem,\" said the firm's statement."],"hashtag":["TETHER"]}