{"summary":"Binance DEX is going to list five stablecoins from issuer TrustToken\nTrueUSD is the first stablecoin to be listed on the exchange from the lot \nThe rest four stablecoins – TrueGBP, TrueAUD, TrueCAD, and TrueHKD – will be listed in the near future","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/35061\/binance-dex-set-to-list-usd-gbp-aud-cad-hkd-stablecoins-from-trusttoken","publishDate":"2019-08-07T12:03:19","id":3223,"type":null,"title":"Binance DEX set to list USD, GBP, AUD, CAD, HKD stablecoins from TrustToken","category":["Cryptocurrency"],"content":["Non-custodial exchange Binance DEX is soon going to list five new fiat-pegged stablecoins from issuer TrustToken, which is backed by notable venture capital firm Andreessen Horowitz (a16z).","Revealing the news exclusively to The Block, TrustToken said Wednesday that the stablecoins - TrueUSD, TrueGBP, TrueAUD, TrueCAD, and TrueHKD - are launching on Binance Chain, the native public blockchain from the exchange.","Until now, the five stablecoins were only available as ERC-20 tokens on Ethereum.","The launch of the stablecoins on Binance DEX would enable new fiat onramps, increasing options for users to move between cryptocurrencies and bank accounts, TrustToken said. It would also allow the non-custodial exchange’s users to trade the stablecoins with trading fees “as low as 0.04%.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIn June, Stably <a href=\"https:\/\/medium.com\/stably-blog\/stably-lists-first-stablecoin-trading-pair-on-binance-dex-a306c664030d\" data-v-f87c67ca=\"\">was the first to issue<\/a> a stablecoin on Binance Chain and get it listed it on Binance DEX.","Binance DEX will list TrueUSD next, which is scheduled to go live for trading on Aug. 8. The proposals for listing the other four stablecoins (GBP, AUD, CAD, HKD) will be submitted by TrustToken “over the coming weeks.”","“Our goal is to provide more users with easy access to stablecoins they can trust,” said TrustToken co-founder and CEO, Jai An.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nFounded in 2017, TrustToken <a href=\"https:\/\/blog.trusttoken.com\/trueusd-a-usd-backed-stablecoin-you-can-trust-9688796cfd0d\" data-v-f87c67ca=\"\">introduced TrueUSD<\/a> stablecoin, which is pegged 1:1 to the U.S. dollar, in January 2018. Over the period, the issuer also launched <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/trueusd-issuer-trusttoken-launches-new-stablecoin-pegged-to-uk-pound\/\" data-v-f87c67ca=\"\">TrueGBP<\/a>, pegged to the British pound, <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/trusttoken-rolls-out-its-first-asian-offering-with-hong-kong-dollar-backed-stablecoin\/\" data-v-f87c67ca=\"\">TrueHKD<\/a>, pegged to the Hong Kong dollar, <a href=\"https:\/\/blog.trusttoken.com\/truecad-69f751e23eeb\" data-v-f87c67ca=\"\">TrueCAD<\/a>, pegged to the Canadian dollar and TrueAUD, pegged to the Australian dollar. The issuer's website says TrueSGD, a stablecoin pegged to the Singaporean dollar is also \"<a href=\"https:\/\/www.trusttoken.com\/currencies\/\" data-v-f87c67ca=\"\">coming soon<\/a>.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAll five stablecoins provide <a href=\"https:\/\/blog.trusttoken.com\/trueusd-attestation-reports-86f693b90a4\" data-v-f87c67ca=\"\">attestations<\/a> of their fiat backing by third-party accounting firm Cohen &amp; Co. To give users a chance to earn interest on their holdings, TrustToken also recently <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/trusttoken-partners-up-with-cred-to-offer-up-to-8-per-cent-annual-interest-on-stablecoin-holdings\/\" data-v-f87c67ca=\"\">collaborated<\/a> with cryptocurrency lending platform Cred. The partnership allows TrueUSD stablecoin to earn “up to 8%” annualized interest on their holdings.&nbsp;","Looking ahead, TrustToken plans to issue its stablecoins on “one or two additional blockchains by year-end,” a source familiar with the matter told The Block.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBinance recently <a href=\"https:\/\/www.binance.com\/en\/blog\/347360878904684544\/Introducing-BitcoinPegged-Token-on-Binance-Chain\" data-v-f87c67ca=\"\">listed<\/a> BTCB token, which is pegged 1:1 to bitcoin, on Binance DEX. It also plans to issue several other tokens that will be pegged to \"leading\" cryptocurrencies."],"hashtag":[]}