{"summary":"Crypto asset manager Bitwise and Swiss fintech company Amun AG have launched a new exchange-traded product (ETP) on Switzerland’s top stock exchange SIX\n“Amun Bitwise Select 10 Large Cap Crypto Index ETP” will not be available to U.S. customers","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/28999\/bitwise-amun-launch-a-new-crypto-etp-on-swiss-stock-exchange","publishDate":"2019-06-26T08:08:52","id":3225,"type":null,"title":"Bitwise, Amun launch a new crypto ETP on Swiss stock exchange","category":["Investments"],"content":["Cryptocurrency asset manager Bitwise and Swiss fintech company Amun AG have launched a new exchange-traded product (ETP) on Switzerland’s top stock exchange SIX, and it promises to offer diversified liquid exposure to the nascent digital market.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBitwise has licensed “The Bitwise 10 Select Large Cap Crypto Index” to Amun AG, which will be used as the benchmark index for the <a href=\"https:\/\/www.six-group.com\/exchanges\/exchange_traded_products\/security_info_en.html?id=CH0475986318USD4\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">new ETP<\/span><\/a> product - “Amun Bitwise Select 10 Large Cap Crypto Index ETP” with the ticker symbol KEYS.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nNotably, the ETP will not be available to U.S. customers, according to the statement from Bitwise.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBitwise said that the index will track the performance of up to 10 of the largest cryptocurrencies in the world, as measured and weighted by free-float and inflation-adjusted market capitalization.","Currently, the index comprises of eight cryptocurrencies - bitcoin (weight: 67.80%), ether (11.50%), XRP (8.33%), bitcoin cash (3.52%), litecoin (3.47%), EOS (3.36%) Stellar lumens (1.10%) and Cardano (0.90%), per the statements.&nbsp;","The index will provide non-U.S. investors “diversified exposure” to the crypto markets, said Matt Hougan, global head of research at Bitwise Asset Management.","The index will be rebalanced and reconstituted every month. Hougan said it is designed for Swiss investors who want to “gain and maintain exposure to the most important crypto projects in the world.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBitwise built the ETP using Amun's Onyx issuance and administration platform, Hany Rashwan, CEO of Amun, told The Block, adding that “we have 2-3 additional customers that will use the platform by Fall to list their own products. After that point, we will open this platform up much more broadly.”","Amun AG already <a href=\"https:\/\/www.six-group.com\/exchanges\/exchange_traded_products\/overview_en.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">manages<\/span><\/a> four crypto ETPs, which are also listed on the SIX exchange - <a href=\"https:\/\/www.theblockcrypto.com\/2018\/11\/26\/traders-are-going-crazy-over-switzerlands-new-exchange-traded-product\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Crypto Basket Index ETP<\/span><\/a> (HODL), Bitcoin ETP (ABTC), Ethereum ETP ((AETH) and the recently launched Amun XRP ETP (AXRP).<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAll the four ETPs are “heavily traded,” Amun AG said in the statement, adding that the HODL ETP is the “most traded USD-denominated ETP on SIX since inception on Nov. 21, 2018, in terms of trading volume.”","“Of all the existing crypto products currently listed globally, the Amun Bitwise Select 10 ETP is uniquely the most diversified listed crypto product,” said Rashwan."],"hashtag":["XRP"]}