{"summary":"Safe, formerly Gnosis Safe, has added support for “ERC-4337,” an Ethereum feature facilitating account abstraction.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239386\/safe-wallet-erc-4337-account-abstraction","publishDate":"2023-07-13T09:47:36","id":3226,"type":null,"title":"Safe wallet adds &#x27;ERC-4337&#x27; to boost account abstraction features","category":["CRYPTO ECOSYSTEMS"],"content":["Safe, previously known as Gnosis Safe, has integrated \"ERC-4337,\" an Ethereum feature that allows for <a href=\"https:\/\/www.theblock.co\/post\/216504\/ethereum-developers-deploy-entrypoint-to-let-wallets-operate-as-smart-contracts\" data-v-f87c67ca=\"\">account abstraction<\/a>. Safe, one of the largest institutional wallet providers, secures <a href=\"https:\/\/dune.com\/safe\/all\" data-v-f87c67ca=\"\">$60 billion<\/a> in digital assets.","ERC-4337, a key update for Ethereum <a href=\"https:\/\/www.theblock.co\/post\/216504\/ethereum-developers-deploy-entrypoint-to-let-wallets-operate-as-smart-contracts\" data-v-f87c67ca=\"\">introduced<\/a> by core developers in March 2023, enabled account abstraction (AA) on Ethereum for the first time through specialized smart contracts.&nbsp;","Today, Safe added support for ERC-4337 as a plugin software to its existing AA infrastructure, which is part of the software stack called Safe Core. The update includes a fully audited upgrade that supports ERC-4337 in a modular manner, potentially offering developers more flexibility.","Account abstraction enables wallets to work as smart contracts and operate a host of sophisticated features like multi-factor authentication, wallet social recovery and the flexibility for users to transact with any token.","“ERC-4337 is an exciting addition to the Safe Smart Account toolkit and gives developers the flexibility to choose the relayer technologies they want to build with,\" Richard Meissner, co-founder and technical lead at Safe, said. \"ERC-4337, as it matures, will play a key part as a relaying option for developers to build products for millions of users.”","Account abstraction was recently <a href=\"https:\/\/www.theblock.co\/post\/233969\/vitalik-buterin-calls-for-three-mandatory-transitions-for-ethereum\" data-v-f87c67ca=\"\">highlighted<\/a> by Ethereum co-founder Vitalik Buterin as among the crucial advancements that the network needed to implement. AA has already attracted the attention of major companies, <a href=\"https:\/\/www.theblock.co\/post\/231411\/visa-taps-ethereums-goerli-testnet-to-experiment-with-account-abstraction\" data-v-f87c67ca=\"\">including Visa<\/a>, who are testing its capabilities.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Richard Meissner","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"4337","content":"DATE"},{"type":"Gnosis Safe","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$60 billion","content":"MONEY"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"March 2023","content":"DATE"}],"hashtag":["DEVELOPER TOOLS","SMART CONTRACTS","WALLETS"],"authors":["Vishal Chawla","The Block"]}