{"summary":"Ether options open interest hits multi-month high, with the increase mostly skewed towards calls, an analyst said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278647\/ether-options-open-interest-hits-multi-month-high-with-a-skew-towards-calls-analyst","publishDate":"2024-02-22T14:55:43","id":3228,"type":null,"title":"Ether options open interest hits multi-month high with a skew towards calls: analyst","category":["MARKETS"],"content":["An analyst has noted a significant surge in options open interest, with the majority of the increase being skewed towards calls.","\"Ether options open interest has increased by more than 300,000 contracts in the past week,\" Bitfinex Head of Derivatives Jag Kooner told The Block. This concurs with <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/options\/volume-and-oi-of-cme-ethereum-options\" data-v-02bbd79b=\"\" data-v-f87c67ca=\"\">The Block's Data Dashboard,<\/a> which shows the total ether options OI across crypto derivatives exchanges has reached a multi-month high of $9 billion.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/options\/aggregated-open-interest-of-ethereum-options\/embed\" title=\"Aggregated Open Interest of Ethereum Options\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Similarly, ether options open interest on ether futures on the <a href=\"https:\/\/www.theblock.co\/post\/274474\/deribit-sees-increase-in-bitcoin-futures-open-interest-despite-declines-on-the-chicago-mercantile-exchange\" data-v-02bbd79b=\"\" data-v-f87c67ca=\"\">Chicago Mercantile Exchange<\/a> (CME) has also risen sharply, recently hitting a fresh all-time high. CME ether options open interest for February has reached $543.25 million, with still almost two days to go before the end-of-month <a href=\"https:\/\/www.cmegroup.com\/tools-information\/quikstrike\/options-calendar.html\" data-v-02bbd79b=\"\" data-v-f87c67ca=\"\">expiry<\/a> on Friday, Feb. 23.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/options\/volume-and-oi-of-cme-ethereum-options\/embed\" title=\"Volume and OI of CME Ethereum Options\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Kooner added that most traders have recently been taking a straightforward bullish position on ether's price by buying individual call options without simultaneously engaging in other offsetting \"call spread\" options positions.","\"The increase in open interest is mostly skewed towards calls indicating that we have a lot of naked longs implying traders are buying calls directly at a much faster pace instead of call spreads which was seen earlier in the month,\" he said.","According to <a href=\"https:\/\/metrics.deribit.com\/options\/ETH\" data-v-f87c67ca=\"\">data<\/a> from Deribit, the top cohort of options by trading volume in the past 24 hours is for calls at a strike price of $3,500, for the March quarterly and end-of-month expiry.&nbsp;","A call <a href=\"https:\/\/www.theblock.co\/learn\/245708\/what-are-decentralized-derivatives\" data-v-f87c67ca=\"\">option<\/a> gives the right to buy, and a put offers the right to sell. It is assumed that a trader who buys call options is implicitly bullish on the market, while a put buyer is bearish.&nbsp;","<span data-v-f87c67ca=\"\">Top volume by open interest in the past 24 hours has been calls at $3,500 for the end of March expiry. Image: Deribit.<\/span>","Kooner added that the \"max pain price\" for options with expiries in April and beyond has shifted higher, around $2,400, with a significant call-side bias. \"This suggests that traders are optimistic about ether's price appreciation in the medium to long term,\" he added.","However, Kooner mentioned that it was too early to connect this shift to anticipation of the U.S. Securities and Exchange Commission possibly approving a <a href=\"https:\/\/www.theblock.co\/post\/277223\/franklin-templeton-takes-initial-step-for-spot-ethereum-etf-with-new-sec-filing\" data-v-f87c67ca=\"\">spot ether ETF<\/a>. The analyst suggested that the current put-call ratio indicates derivatives traders are also not factoring in the possibility that the SEC could reject ETF applications.","\"The put-call ratio has declined significantly to 0.55, and remains low in terms of the past 24 hours at 0.43 which suggests that at least in the past couple of days there has not been any significant increase in hedging for an SEC rejection,\" Kooner said.","A put-call ratio of less than 1 implies bullish sentiment, indicating more interest in potential upside (calls). In contrast to this, a put-call ratio greater than 1 typically suggests bearish sentiment, indicating more interest in downside protection (puts).","In the past 24 hours the price of ether has risen by over 3% to trade at $2,991 at 1:50 p.m. ET, according to <a href=\"https:\/\/www.theblock.co\/price\/248349\/ethereum-eth-usd\" data-v-02bbd79b=\"\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">The Block's Price Page<\/a>.","Fluctuating price action in the past 24 hours has caused a spike in liquidations of ether positions, totaling over $33 million, according to Coinglass <a href=\"https:\/\/www.coinglass.com\/LiquidationData\" data-v-02bbd79b=\"\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">data<\/a>. Short positions experienced the greatest losses, with more than $20 million in shorts liquidated.","The&nbsp;<a href=\"https:\/\/www.theblock.co\/indices\/top\/277090\/gmci-30-gm30\" data-v-02bbd79b=\"\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">GM 30 Index<\/a>, representing a selection of the top 30 cryptocurrencies, has increased by 2.29% in the past 24 hours, now at 113.44.","<span data-v-f87c67ca=\"\">The price of ether has risen by over 3% in the past 24 hours. Image: The Block. <\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"GM","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Feb. 23","content":"DATE"},{"type":"$543.25 million","content":"MONEY"},{"type":"$3,500","content":"MONEY"},{"type":"Chicago Mercantile Exchange","content":"ORGANIZATION"},{"type":"$2,400","content":"MONEY"},{"type":"Deribit","content":"LOCATION"},{"type":"1:50 p.m. ET","content":"TIME"},{"type":"Friday","content":"DATE"},{"type":"Bitfinex Head of Derivatives Jag Kooner","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"3%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"March expiry","content":"DATE"},{"type":"March","content":"DATE"},{"type":"$2,991","content":"MONEY"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"$20 million","content":"MONEY"},{"type":"$9 billion","content":"MONEY"},{"type":"Kooner","content":"PERSON"},{"type":"2.29%","content":"PERCENT"},{"type":"$33 million","content":"MONEY"}],"hashtag":["CRYPTO MOVERS","SPOT BITCOIN ETF","SPOT ETHEREUM ETF"],"authors":["Brian McGleenon","The Block"]}