{"summary":"Reddit co-founder Alexis Ohanian spoke at the Solana-focused conference Breakpoint today.\nHe announced that he will be earmarking $100 million for building social media on Solana.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/123763\/reddit-co-founder-to-invest-50-million-in-social-media-on-solana","publishDate":"2021-11-09T09:14:41","id":3228,"type":null,"title":"Reddit co-founder to invest $100 million in social media on Solana","category":["Cryptocurrency"],"content":["Reddit co-founder Alexis Ohanian will be investing in building out a form of decentralized social media using the Solana blockchain, according to an announcement today.","During a fireside chat with Solana co-founder Raj Gokal, Reddit co-founder Alexis Ohanian said, “One of the reason why i’m here is to announce — I have a venture fund called 776 — we’re earmarking $50 million to invest in the next wave of social, built on Solana.\"","During the chat, Ohanian added that $50 million wasn't enough so that the plan is to increase the initiative to $100 million.","This comes a day after FTX CEO Sam Bankman-Fried <a href=\"https:\/\/www.theblockcrypto.com\/post\/123558\/ftx-ceo-social-media-on-the-blockchain-could-be-absolutely-huge\" data-v-f87c67ca=\"\">said that building social media<\/a> on the blockchain could be \"absolutely huge.\"","During his talk, Bankman-Fried claimed that decentralized social media could solve a lot of pain points. He pointed to pre-existing social media sites, which have massive userbases, and stated that integrations with these sites could help to scale DeFi to millions more users.","<em data-v-f87c67ca=\"\">Update: An earlier version of this story misattributed the increase in size to Gokal.<\/em>","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>"],"hashtag":["CRYPTO","SOLANA"]}