{"summary":"Bernstein analysts see a 1600% upside for crypto revenue, projecting it to close in on $400 billion by 2033.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/202834\/drop-zero-crypto-policy-bernstein-tells-institutions","publishDate":"2023-01-17T11:26:10","id":3229,"type":null,"title":"Drop zero crypto policy Bernstein tells institutions","category":["COMPANIES"],"content":["Bernstein has some advice for institutions: Get some skin in the game.&nbsp;","\"Get off zero crypto allocation,\" the asset manager told institutions following the publication of its global crypto revenue pool model for the next decade. \"For institutional investors with no allocation to crypto, 2023 might be the best time to start placing the building blocks for a long-term strategy.\"","Analysts at Bernstein expect revenue to grow to $400 billion by 2033 from less than $25 billion today — an increase of more than 1600%.","To date, crypto has mostly been driven forward by retail investors and off-shore regulations, the note said. \"Going forward, we expect growth to be driven by institutional investors with participation in on-shore regulated structures,\" analysts Gautam Chhugani and Manas Agrawal wrote.","Based on this, Chhugani and Agrawal said opportunities in custody, market making and prime brokerages present \"massive opportunities\" for the growth of institutional capital in crypto.&nbsp;","The asset manager expects institutional services' opportunity to grow to $30 billion by 2033, a compound annual growth rate of 37%. The growth will be driven by custody solutions ($8 billion), market making ($8 billion), and prime broking ($14 billion).","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$25 billion","content":"MONEY"},{"type":"Gautam Chhugani","content":"PERSON"},{"type":"2033","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Bernstein","content":"LOCATION"},{"type":"1600%","content":"PERCENT"},{"type":"Bernstein","content":"PERSON"},{"type":"$14 billion","content":"MONEY"},{"type":"$400 billion","content":"MONEY"},{"type":"37%","content":"PERCENT"},{"type":"Chhugani","content":"PERSON"},{"type":"Manas Agrawal","content":"PERSON"},{"type":"Agrawal","content":"PERSON"},{"type":"$8 billion","content":"MONEY"},{"type":"$30 billion","content":"MONEY"}],"hashtag":["INVESTMENT FIRMS"],"authors":["Adam Morgan McCarthy","The Block"]}