{"summary":"Risc Zero has released Zeth, an open-source prover technology designed to help develop Ethereum-based Layer 2 solutions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246778\/risc-zero-zeth-ethereum","publishDate":"2023-08-22T14:00:33","id":323,"type":null,"title":"Risc Zero releases &#x27;Reth&#x27; prover to develop ZK rollups on Ethereum","category":["DEFI"],"content":["Risc Zero, a Seattle-based crypto startup, has released Zeth, an open-source prover technology designed to help develop Ethereum-based Layer 2 solutions called ZK rollups and associated client software.","More specifically, Zeth aims to aid in the development of a type of ZK rollup whose code is compatible with the Ethereum blockchain, also referred to as zero-knowledge Ethereum Virtual Machine (or zkEVM).","Developers can utilize Zeth on a specific framework offered by the team, known as Risc Zero zkVM, to facilitate this process.","Zero-knowledge proofs, although holding the potential to help scale Ethereum, are often seen as compute-intensive and time-consuming. Risc Zero says that proofs for Ethereum blocks can be generated in just minutes and verified on-chain using Zeth.","“Our technology allowed Zeth to be built at a tiny fraction of the cost of similar efforts; RISC Zero’s zkVM can be used by any team to build innovative new offerings in record time,” said Brian Retford, CEO and co-founder.","Risc Zero raised a $40 million Series A round in July that was led by Blockchain Capital.","In a a ZK-rollup system, a prover is a component responsible for creating a proof of computation. This proof is then verified by the main blockchain (Layer 1) or other validators. The aim is to offload computational work from the main blockchain, thus enhancing scalability for apps.","The release comes at a time when the field of ZK-rollups is seeing a major uptick and interest from various research teams. The crypto unit at Andreessen Horowitz, a16z crypto, recently introduced a zero knowledge-based prover named <a href=\"https:\/\/www.theblock.co\/post\/244116\/a16z-crypto-zero-knowledge-proofs-lasso-jolt\" data-v-f87c67ca=\"\">Lasso<\/a>.","Furthermore, crypto teams associated with projects such as Polygon and Matter Labs are working on their own <a href=\"https:\/\/www.theblock.co\/post\/239880\/zksync-launches-new-proof-system-called-boojum-for-era-mainnet\" data-v-f87c67ca=\"\">provers<\/a>, all aiming to enhance ZK-rollup solutions.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Brian Retford","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$40 million","content":"MONEY"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Ethereum","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"Seattle","content":"LOCATION"},{"type":"Ethereum blockchain","content":"PERSON"},{"type":"Blockchain Capital","content":"ORGANIZATION"},{"type":"Zeth","content":"PERSON"}],"hashtag":["SMART CONTRACTS","ZKEVM"],"authors":["Vishal Chawla","The Block"]}