{"summary":"The Eth2 staking deposit contract continues to attract deposits.\nThe contract now has more than $500 million worth of ETH locked, or 852,928 ETH, for Eth2’s Phase 0 launch tomorrow.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/85941\/eth-worth-more-than-500-million-has-been-staked-for-eth2s-phase-0-launch-tomorrow","publishDate":"2020-11-30T06:25:43","id":3230,"type":null,"title":"ETH worth more than $500 million has been staked for Eth2&#x27;s Phase 0 launch tomorrow","category":["Ethereum"],"content":["The Eth2 staking deposit contract continues to attract deposits, even after the milestone for the Phase 0 launch was reached last week.","The <a href=\"https:\/\/etherscan.io\/address\/0x00000000219ab540356cbb839cbe05303d7705fa\" data-v-f87c67ca=\"\">contract now has<\/a> more than $500 million worth of ETH locked, or 852,960&nbsp;ETH, 62% more than <a href=\"https:\/\/www.theblockcrypto.com\/linked\/85531\/eth2-deposit-contract-threshold-phase-0\" data-v-f87c67ca=\"\">what is needed<\/a> for Eth2's Phase 0 launch tomorrow.","\"It is a fantastic display of confidence by the Ethereum community,\" Justin Drake, Eth2 researcher at the Ethereum Foundation, told The Block. \"I'm proud <a href=\"https:\/\/etherchain.org\/account\/0x00000000219ab540356cbb839cbe05303d7705fa\" data-v-f87c67ca=\"\">thousands of<\/a> Ethereans felt compelled to lock their funds for many months to secure Eth2.\"","Indeed, the deposits are locked and can be withdrawn only when Phase 1.5 of Eth2 goes live, sometime in 2022.","The Eth2 journey will begin with Phase 0 tomorrow, December 1, at 12 UTC. It would see the beacon chain — a kind of backbone for Eth2 — go live.","\"This is a huge milestone in 80 years of computer science and proves confidence in the progress Ethereum and blockchain technology has made in the decade to date. I'm looking forward to the next ten years,\" Afri Schoedon, pioneer of Eth2 multi-client testnets, told The Block.","<iframe title=\"ETH in ETH2 Deposit Contract\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/asset-management\/eth-in-eth2-deposit-contract\/embed\" width=\"100%\" height=\"420\" frameborder=\"0\" data-v-f87c67ca=\"\"><\/iframe>","Once the beacon chain gets activated, the Eth2 transition process will move on to the next stage of its multi-phase approach, to complete the full upgrade. There are four more phases left for Eth2. The estimated timelines say the full upgrade would take at least until 2022. However, in reality, it could take more time, since the development journey won’t be without its challenges, <a href=\"https:\/\/www.theblockcrypto.com\/daily\/85771\/eth2-phase-0-roll-out-long-way-to-go\" data-v-f87c67ca=\"\">as The Block reported in detail last week<\/a>.","\"Longer term, we will need at least 10x the amount staked for robust security,\" said Drake.","The development of Eth2 has been in the works for years. Once fully completed, Ethereum will move from its current proof-of-work model to function as a proof-of-stake network."],"hashtag":[]}