{"summary":"Troubled Asian crypto exchange Zipmex is under increasing pressure after its rescue investor V Ventures missed a fourth tranche payment, leaving the company unable to pay certain staff and at risk of liquidation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/222519\/zipmexs-rescue-investor-misses-payment-company-warns-employees-of-liquidation","publishDate":"2023-03-24T04:51:47","id":3235,"type":null,"title":"Zipmex&#x27;s rescue investor misses payment, company warns employees of liquidation","category":["DEALS"],"content":["Troubled Asian crypto exchange Zipmex is under increasing pressure as its rescue investor V Ventures missed a fourth tranche payment, leaving the company unable to pay certain staff and at risk of liquidation.","\"Zipmex is currently experiencing cash flow issues and we will not be able to make full payroll for this month of March 2023,\" states an email obtained by The Block that was sent by Zipmex co-founder Akalarp Yimwilai to employees of Zipmex Technology today.","\"As you know, since we signed the investment deal in December 2022, the investor is committed to provide monthly tranche payments in order for us to make payroll each month. As of today, we have yet to receive the tranche payment despite numerous attempts, the investor remains unresponsive.\"","The investor in question, V Ventures, was due to pay a fourth tranche worth $1.25 million on March 23, a person with direct knowledge of the matter told The Block. But despite requests, the money hasn't arrived. Zipmex is still optimistic, however, that the payment will arrive. \"We are still hopeful that the transfer of the monthly tranche payment by the investor is only slightly delayed but at this critical juncture, we have to prepare for all eventualities,\" states the email.","Zipmex Technology is a Thailand-based entity of the crypto exchange operator Zipmex, and was responsible for hiring more than half of its full-time staff, the source said. Non-payment by its investor means more than 100 people won't get their March salaries, they added. Zipmex has around 230 employees and consultants in total. The remainder are part of the group's other entities and won't be impacted by the missed payment for now.&nbsp;","\"This is because the other entities in the Zipmex Group do have sufficient existing cash to make payroll for employees under them for the moment,\" reads the email.","Zipmex also informed its shareholders on Thursday about V Ventures' non-response, according to a separate email sent to shareholders and obtained by The Block. \"At this stage we have not received any final indications from the investor's decision as to when and whether they would make Tranche 4 payment and whether they would or would not be completing the transaction or not,\" the email to shareholders states.","V Ventures, an existing investor of Zipmex, signed <a href=\"https:\/\/www.theblock.co\/post\/182116\/zipmex-close-to-signing-100-million-rescue-deal-in-return-for-a-90-stake\" data-v-f87c67ca=\"\">a $100 million deal<\/a> with the company late last year in return for a 90% stake in it. Zipmex got into trouble in July when it <a href=\"https:\/\/www.theblock.co\/post\/158672\/crypto-exchange-zipmex-halts-withdrawals-due-to-volatile-market-conditions\" data-v-f87c67ca=\"\">halted<\/a> client withdrawals due to its exposure to Babel Finance and Celsius, two beleaguered crypto lenders that themselves froze customer funds in June. Zipmex has estimated its total exposure to Babel and Celsius at $53 million.","As the deal with V Ventures now appears at risk of falling through, Zipmex is working closely with its lawyers on alternative measures, according to the email sent to shareholders. “Should the investor fail to transfer the working capital earmarked for March 2023, we will have no choice but to commence liquidation proceedings for Zipmex Technology Company Limited,” the email states.&nbsp;","Zipmex declined to comment.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Babel Finance","content":"ORGANIZATION"},{"type":"Zipmex","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"March 2023","content":"DATE"},{"type":"Zipmex Technology","content":"ORGANIZATION"},{"type":"March 23","content":"DATE"},{"type":"$53 million","content":"MONEY"},{"type":"Akalarp Yimwilai","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Zipmex Technology Company Limited","content":"ORGANIZATION"},{"type":"Thailand","content":"LOCATION"},{"type":"Zipmex Group","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"December 2022","content":"DATE"},{"type":"$1.25 million","content":"MONEY"},{"type":"Babel","content":"LOCATION"}],"hashtag":["PRIVATE COMPANY M&AMP;A"],"authors":["Yogita Khatri","The Block"]}