{"summary":"The social media platform will expand its verification system to include gold and grey checks for companies and governments, respectively.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189918\/twitter-to-roll-out-multi-colored-verified-user-system-following-blue-check-chaos","publishDate":"2022-11-25T06:59:57","id":3236,"type":null,"title":"Twitter to roll out multi-colored verified user system following blue check chaos","category":["TECH"],"content":["It's been a crazy month since Elon Musk took over Twitter, and now even more changes are coming to its verification system.","The social media platform will expand verification options to include gold and gray checks for companies and governments, respectively.","Blue checks will remain in place for individuals, who can also have secondary smaller checks if they are part of certain organizations.","All verified accounts will be manually authenticated before they receive a checkmark, according to Musk. He called the updates “painful, but necessary” in a <a href=\"https:\/\/twitter.com\/elonmusk\/status\/1596053664338440192\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">tweet<\/a>.","Twitter has undergone profound changes since Musk took the helm of the company, laying off thousands of employees and reinstating formerly banned accounts.","Blue checks were previously reserved for celebrities and public figures, then on Nov. 9 Musk opened up the option to <a href=\"https:\/\/www.theblock.co\/post\/181862\/musk-to-offer-twitter-account-verification-as-a-subscription-service\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">obtain one<\/a> to anyone willing to pay $8 a month.","Reception to the change was mixed and critics raised concerns that it would increase scams. With anyone able to purchase one, users were able to make accounts impersonating people like former U.S. President George W. Bush and basketball star LeBron James, with an extra veneer of believability due to their blue check status.&nbsp;","The system was later paused, with Musk saying it wouldn’t reopen until there was “high confidence of stopping impersonation.”","The team at Twitter is working on restarting it, tentatively next week. Some changes have already been introduced, including new accounts having to wait 90 days from creation to buy a Twitter Blue subscription.","More details will be released next week, according to Musk.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"George W. Bush","content":"PERSON"},{"type":"Musk","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$8","content":"MONEY"},{"type":"James","content":"PERSON"},{"type":"Nov. 9","content":"DATE"}],"hashtag":["ELON MUSK","TWITTER"],"authors":["Callan Quinn","The Block"]}