{"summary":"The Wikimedia community has requested that Wikipedia stop accepting cryptocurrency donations.\n\nOver 70% of voters came out against crypto donations.","author":["Callan Quinn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/141821\/community-contributors-ask-wikimedia-foundation-to-ban-crypto-donations","publishDate":"2022-04-13T12:31:48","id":324,"type":null,"title":"Community contributors ask Wikimedia Foundation to ban crypto donations","category":["Bitcoin"],"content":["<span data-v-f87c67ca=\"\">The Wikimedia contributor community has <\/span><a href=\"https:\/\/meta.wikimedia.org\/wiki\/Requests_for_comment\/Stop_accepting_cryptocurrency_donations\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">requested<\/span><\/a><span data-v-f87c67ca=\"\"> that the Wikimedia Foundation, a non-profit that funds Wikipedia and other sister projects, should cease accepting donations in cryptocurrency, following a three-month debate over the ethics of using the technology.<\/span>","<span data-v-f87c67ca=\"\">US-based software developer Molly White, who edits Wikipedia under the username GorillaWarfare, put forward the proposition on January 10. This led to a period where contributors could state their support or opposition to the idea. The Requests for Comment page debating the proposition closed this week with a total of 232 to 94 contributors (71.7%) in favor of the ban.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Thus, the Wikimedia community requests that the Wikimedia Foundation stop accepting cryptocurrency donations,” states the proposal, in light of the feedback.<\/span>","<span data-v-f87c67ca=\"\">The community cited concerns around environmental sustainability, whether accepting cryptocurrency equates to an endorsement of the technology, and reputational implications as reasons for implementing a ban.<\/span>","<span data-v-f87c67ca=\"\">The foundation currently accepts donations in Bitcoin, BitcoinCash and Ether. In the last financial year, it received over $130,000 in cryptocurrency donations. This represents just 0.08% of revenue, making it one of the foundation's smallest donation channels.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Among the 347 people who opted to donate via crypto, Bitcoin was the most common option.<\/span>","<span data-v-f87c67ca=\"\">The news comes just days after Mozilla <\/span><a href=\"https:\/\/twitter.com\/mozilla\/status\/1512106462163746818?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1512106462163746818%7Ctwgr%5E%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fcointelegraph.com%2Fnews%2Fno-bitcoin-mozilla-will-only-accept-proof-of-stake-crypto-donations\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">posted<\/span><\/a><span data-v-f87c67ca=\"\"> “we got it wrong, we heard you, and we've evolved“ on its official Twitter account as it announced plans to resume crypto donations — excluding some coins. It paused the payment option in January.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Mozilla’s co-founder is longtime crypto critic Jamie Zawinski, who via his blog has <a href=\"https:\/\/www.jwz.org\/blog\/2022\/01\/mozilla-blinked\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">branded<\/a> cryptocurrencies an “apocalyptic ecological disaster,” a “greater-fool pyramid scheme” and “incredibly toxic to the open web.”<\/span>","<span data-v-f87c67ca=\"\">It is one of several groups who have rolled back involvement in crypto and blockchain technology over the last few months following criticism about the environmental impact.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While Mozilla will not accept cryptocurrencies using proof of work due to environmental considerations, it is now working on a list of approved proof-of-stake payment options which will be published and implemented by the end of Q2 2022.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Like Mozilla, Wikimedia began accepting crypto in 2014. It has not yet clarified whether it will adhere to its community’s wishes.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Block has reached out to the Wikimedia Foundation for its response to the proposal.&nbsp;<\/span>"],"hashtag":[]}