{"summary":"The hash rate securing Bitcoin and Ethereum is slowly recovering as some Chinese miners have completed their relocations.\nShenzhen-headquartered BIT Mining said it has already deployed Bitcoin and Ethereum mining equipment outside China.","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/112901\/bitcoin-ethereum-hashrate-recovery-chinese-miners","publishDate":"2021-07-29T04:14:48","id":3241,"type":null,"title":"Bitcoin, Ethereum hash rates recover as Chinese miners redeploy overseas","category":["Mining"],"content":["The hashing power securing the world's two largest blockchains is on track of a slow recovery, as some Chinese miners have gradually completed their relocation after the crackdown.","Based on The Block's Dashboard, the seven-day moving average of Bitcoin's hash rate has slowly climbed up to and remained at the 100 exahashes per second (EH\/s) level over the past three weeks.","Following China's crackdown on the bitcoin mining industry, power stations across multiple provinces have been ordered to suspend energy supply to mining facilities. Bitcoin's hash rate initially plunged to below 90 EH\/s, a level not seen since early 2020. With the slow recovery, bitcoin's mining difficulty is expected to post a 4% growth in its next adjustment, after having recorded four consecutive drops since mid-May.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoins-hash-rate-daily\/embed\" title=\"Bitcoin's Hash Rate (7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Although China's initial crackdown comment specifically said it was about bitcoin mining, the shutdown orders that were eventually handed down locally also affected the mining farms that housed graphic cards and ASIC miners securing the Ethereum network. That situation sparked Ethereum miners to <a href=\"https:\/\/www.theblockcrypto.com\/post\/110638\/chinese-crypto-miners-dump-gpu\" data-v-f87c67ca=\"\">dump their used GPUs<\/a> on the secondhand marketplace.","Similarly, the hash rate on Ethereum also <a href=\"https:\/\/www.theblockcrypto.com\/post\/109629\/ethereum-hash-rate-sink-china-mining-shutdown\" data-v-f87c67ca=\"\">took a hit by over 20%<\/a> after China's crackdown orders but has steadily recovered to above 500 terahashes per second.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/ethereums-hash-rate-daily\/embed\" title=\"Ethereum's Hash Rate (7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The hash rate rebound suggests that at least some Chinese miners have completed their relocation process and subsequently plugged in.","For instance, Shenzhen-headquartered BIT Mining, previously known as online sport lottery firm 500.com, had over <a href=\"https:\/\/www.sec.gov\/ix?doc=\/Archives\/edgar\/data\/0001517496\/000110465921050188\/wbai-20201231x20f.htm\" data-v-f87c67ca=\"\">50,000 bitcoin ASIC miners<\/a> in Xinjiang and Qinghai as of April this year. It also owned two operational mining facilities in Sichuan.&nbsp;","After the crackdown, the New York Stock Exchange-listed bitcoin miner said it would ship <a href=\"https:\/\/www.theblockcrypto.com\/post\/109190\/bit-mining-bitcoin-miners-kazakhstan\" data-v-f87c67ca=\"\">3,000 units<\/a> to Kazakhstan by July. In a <a href=\"https:\/\/www.prnewswire.com\/news-releases\/bit-mining-to-expand-its-fleet-of-bitcoin-mining-machines-301343074.html\" data-v-f87c67ca=\"\">statement<\/a> on Wednesday, BIT Mining said it has shipped and deployed 3,819 units of bitcoin mining equipment with a total hash rate of 172 PH\/s at facilities in Kazakhstan. It announced earlier this week that it has completely exited its lottery business to focus entirely on mining.","\"A further 4,033 bitcoin mining machines with a total hash rate capacity of 121 PH\/s have been shipped to data centers in Kazakhstan and are awaiting deployment,\" BIT Mining said. In addition, it has signed purchase agreement to acquire 2,500 new bitcoin miners that are expected to be delivered within seven days and it plans to deploy them in Kazakhstan as well.&nbsp;","Apart from bitcoin mining equipment, BIT Mining has started Ethereum mining operations outside of China with 86.4 gigahashes per second (GH\/s) deployed. \"An additional hash rate capacity of 4,713.6 GH\/s is expected to be deployed by the end of October 2021,\" the firm said, which accounts for about 0.7% of the total hash rate on Ethereum.","BIT Mining purchased 2,000 Ethereum miners for $30 million in February that are due for shipment throughout this year.&nbsp;","Russia-headquartered colocation provider BitRiver told The Block that after China's shutdown orders, it signed contracts with Chinese mining clients for a capacity of 150 megawatts, which are expected to go online in batches over the coming four months.","Taking a step back, BitRiver's founder and CEO Igor Runets said with a worldwide supply crunch for bitcoin mining hosting capacity, it may take much longer for bitcoin's hash rate to fully recover to the all-time-high 180 EH\/s level.","Meanwhile, BIT Digital, another U.S.-listed bitcoin mining firm that previously had operations in China, is in the process of shipping <a href=\"https:\/\/www.theblockcrypto.com\/linked\/111462\/bit-digital-14500-bitcoin-miners-us-china-crackdown\" data-v-f87c67ca=\"\">over 14,500 units<\/a> of bitcoin miners to the U.S."],"hashtag":[]}