{"summary":"Crypto exchange Binance has announced the plan of launching “Venus” cryptocurrency \nThe exchange defines Venus as a “regional version of Libra” ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/36611\/binance-planning-to-launch-venus-similar-to-facebooks-upcoming-cryptocurrency-libra","publishDate":"2019-08-19T02:46:00","id":3244,"type":null,"title":"Binance planning to launch ‘Venus,’ similar to Facebook’s upcoming cryptocurrency Libra","category":["Stablecoins"],"content":["The world's largest cryptocurrency exchange Binance is planning to launch \"Venus,\" calling it an \"independent regional version of Libra,\" according to an <a href=\"https:\/\/binance.zendesk.com\/hc\/zh-cn\/articles\/360032604131\" data-v-f87c67ca=\"\">announcement<\/a> Monday. Astrologically speaking, Libra's <a href=\"https:\/\/en.m.wikipedia.org\/wiki\/Libra_(astrology)\" data-v-f87c67ca=\"\">ruling planet<\/a> is Venus.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBinance said it is going to launch Venus cryptocurrency because it has a presence in several countries, has its native blockchain Binance Chain in place, as well as it hopes to break the “<a href=\"https:\/\/en.wikipedia.org\/wiki\/Monetary_hegemony\" data-v-f87c67ca=\"\">financial hegemony<\/a>” and reshape the world’s financial system.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“We believe that in the near and long term, stablecoins will progressively replace traditional fiat currencies in countries around the world, and bring a new and balanced standard of the digital economy,” Binance co-founder, Yi He, told The Block.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nShe added: “We hope to achieve a vision, that is, to reshape the world financial system, allow countries to have more tangible financial services and infrastructures, protect their financial security and increase the economic efficiency of countries.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nVenus is an open blockchain project to develop \"localized\" stablecoins and digital assets pegged to fiat currencies, according to an English <a href=\"https:\/\/www.binance.com\/en\/support\/articles\/360032604131\" data-v-f87c67ca=\"\">version<\/a> of the announcement. \"Binance will provide full-process technical support, compliance risk control system and multi-dimensional cooperation network to build Venus, leveraging its existing infrastructure and regulatory establishments,\" it added.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBinance further said that it welcomes more governments, companies and organizations with \"strong influence\" on a global scale to collaborate with it for the Venus initiative.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nFacebook’s planned cryptocurrency, <a href=\"https:\/\/www.theblockcrypto.com\/category\/facebook\/\" data-v-f87c67ca=\"\">Libra<\/a>, also has a similar structure. It <a href=\"https:\/\/www.theblockcrypto.com\/2019\/06\/18\/facebook-libra-cryptocurrency-calibra-launch\/\" data-v-f87c67ca=\"\">intends<\/a> to serve the unbanked and facilitate low-fee money transfers globally. Libra is expected to go live sometime next year, but it has already <a href=\"https:\/\/www.theblockcrypto.com\/2019\/08\/01\/libra-is-washingtons-crypto-wake-up-call-a-look-back-at-a-fireworks-filled-july-in-digital-asset-policy\/\" data-v-f87c67ca=\"\">faced<\/a>&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/2019\/07\/16\/facebook-is-dangerous-senators-grill-facebooks-david-marcus-over-libra-in-2-hour-hearing\/\" data-v-f87c67ca=\"\">scrutiny<\/a>&nbsp;from central banks and politicians around the world. Facebook has itself recently <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/libra-crypto-may-never-launch-due-to-regulatory-scrutiny-warns-facebook\/\" data-v-f87c67ca=\"\">said<\/a> in a risk disclosure filed with the Securities and Exchange Commission that Libra may never launch due to “significant” regulatory scrutiny.","Binance today said that it believes that Libra is growing at an “exponential rate” and will reshape the world financial system, bringing changes more than the Internet. “Instead of resisting change and losing the opportunity, it is better to embrace change. [...] At the same time, ‘Libra’ needs to be developed in an orderly manner under the regulatory framework,” the exchange added.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAfter the publication of this story, Binance CEO Changpeng Zhao<a href=\"https:\/\/twitter.com\/cz_binance\/status\/1163397758276911104?s=20\" data-v-f87c67ca=\"\"> (“CZ”) tweeted<\/a> that while Venus would help to push cryptocurrency adoption, it does not look to dominate Libra. “Always happy to co-exist. In fact, this should help Libra, if you think about it. Will leave it at that.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nZhao’s tweet hints that Venus could focus on countries where Libra won't be allowed, such as China or India. <a href=\"https:\/\/www.theblockcrypto.com\/linked\/27874\/facebook-announces-its-crypto-subsidiary-calibra-is-registered-with-us-fincen\" data-v-f87c67ca=\"\">Facebook<\/a> recently confirmed that it wouldn’t launch Libra where there are local restrictions.","Earlier this month, The Block reported that retail giant <a href=\"https:\/\/www.theblockcrypto.com\/2019\/08\/02\/walmart-could-be-looking-to-rival-facebooks-libra-with-a-usd-pegged-stablecoin-issuance-a-patent-filing-shows\/\" data-v-f87c67ca=\"\">Walmart<\/a> could also be working on issuing a USD-pegged stablecoin, similar to Facebook’s Libra cryptocurrency.<em data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/em>","<em data-v-f87c67ca=\"\">Some statements in the story are translated from Chinese.&nbsp;<\/em>"],"hashtag":["BINANCE"]}