{"summary":"Celsius told the bankruptcy court it is close to finalizing a plan to return value to its Celsius Earn customers. Celsius Earn customers will be entitled to a &quot;significant return,&quot; a representative for the firm said in bankruptcy court on Tuesday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/205199\/celsius-lawyer-says-earn-account-customers-entitled-to-a-significant-return","publishDate":"2023-01-24T16:18:24","id":3245,"type":null,"title":"Celsius lawyer says Earn account customers entitled to a &#x27;significant return&#x27;","category":["THE BLOCK"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Celsius Earn account customers will be “entitled to a significant return,” a representative for crypto lending firm Celsius told a bankruptcy court on Tuesday.&nbsp;&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“The Earn customers we think are going to be treated equally and will be entitled to a significant return of value here,” the representative said, while also respecting the rights of the different categories of customers. &nbsp;&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The vast majority of Celsius’ customers are in the Earn program and the vast majority of the value of the assets is going to go to customers of that program, the representative said on Tuesday.&nbsp;&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The debtor's obligation is to \"propound a plan\" to return value to the \"right people in the right form,\" the representative said.&nbsp;&nbsp;<\/span><span class=\"s1\" data-v-f87c67ca=\"\">\"And that's what we're doing and we're in the later stages of being ready to do that.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Company representatives at the hearing also spoke about a recovery corporation concept, a proposal for the company to tokenize and distribute to account holders an “asset share token that would reflect the value of the assets managed by the Recovery Corporation.” That token would also entitle holders to dividends from the recovery corporation over time, they said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">If approved, the tokens would be provided to all account holders who have account balances over a certain threshold. The recovery corporation would also be a public company, and file public financial reports, such as 10-ks, in the future.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Judge Martin Glenn, chief judge for the U.S. Bankruptcy Court for the Southern District of New York ruled earlier this month that assets in Celsius Earn accounts belong to the company, not customers. Earn accounts allowed users to deposit assets into a Celsius account, which was then used by Celsius to generate yields across various on-chain and off-chain investment strategies. &nbsp;&nbsp;&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Glenn said Celsius’ terms of use formed a “valid, enforceable contract” and “that the terms unambiguously transfer title and ownership of Earn Assets deposited into Earn Accounts from accounts holders to the debtors.” He acknowledged the decision could make it harder for Celsius customers to recoup the full value of their accounts, as the company looks to sell off portions of itself to fulfill its debts.&nbsp;&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Celsius filed for Chapter 11 bankruptcy protection in July, one of several firms that have fallen over the past year. &nbsp;&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\"> &nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Martin Glenn","content":"PERSON"},{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"Southern District of New York","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Celsius","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Glenn","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"Recovery Corporation","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}