{"summary":"The NFT platform’s latest curated drop fetched more than $15 million.\nBut a reorganization of confirmed transactions on the Ethereum network meant buyers who believed they had purchased pieces ended up missing out.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/118888\/art-blocks-hit-block-reorg-frenzied-nft-auction","publishDate":"2021-09-28T05:58:47","id":3245,"type":null,"title":"Art Blocks hit with ‘block reorg’ during latest frenzied auction","category":["NFTs"],"content":["Customers of Art Blocks are complaining after failing to receive pieces they appeared to have purchased in the NFT platform’s latest headline drop.","Generative artist Piter Pasma’s <a href=\"https:\/\/artblocks.io\/project\/173\" data-v-f87c67ca=\"\">Skuptuur collection<\/a> — 1,000 digital sculptures “carved from a sea of infinite possibilities” — sold out in less than an hour on Art Blocks’ curated section last night.","The Dutch auction never dipped below 5 ether (roughly $14,500) and netted a total of 5,281 ether (around $15.34 million), <a href=\"https:\/\/twitter.com\/FutureAce6\/status\/1442537379584090121\/photo\/2\" data-v-f87c67ca=\"\">according to Twitter user FutureAce6<\/a>. Since then, individual items, such as <a href=\"https:\/\/opensea.io\/assets\/0xa7d8d9ef8d8ce8992df33d8b8cf4aebabd5bd270\/173000647\" data-v-f87c67ca=\"\">Skulptuur #647<\/a>, have been sold on NFT marketplace OpenSea for as much as 90 ether ($261,400).","Yet some buyers were left puzzled when pieces that they believed they had secured during a frenzied mint failed to appear in their wallets.","One would-be buyer pointed out, on Art Blocks’ Discord server, that <a href=\"https:\/\/opensea.io\/assets\/0xa7d8d9ef8d8ce8992df33d8b8cf4aebabd5bd270\/173000445\" data-v-f87c67ca=\"\">Skulptuur #445<\/a> seemed to have been minted by two separate accounts, according to OpenSea’s records. Another said they had spent over $1,400 in gas fees — costs linked with verifying transactions on the Ethereum blockchain — only to see someone else claim the piece they believed they had bought.","“I never got the money back but that’s not I want. I want to receive the artwork that I paid for!” they said.","Roughly an hour after the mint, an Art Blocks representative confirmed via Discord that the platform had fallen victim to a “block-reorg” — meaning a temporarily confirmed block of Ethereum transactions had later been replaced by a different block.","This kind of thing may have been just due to how blockchains work (small reorgs happen all the time) or it could have been a user collaborating with a miner to put the transactions in their favor.","“This is not something that Art Blocks has any control over, this re-org happened at the level of the state of the Ethereum Virtual Machine as a whole,” they said. The representative provided Etherscan links to the affected blocks – <a href=\"https:\/\/etherscan.io\/block\/13308900\/f\" data-v-f87c67ca=\"\">13308900<\/a> and <a href=\"https:\/\/etherscan.io\/txs?block=13308901\" data-v-f87c67ca=\"\">13308901<\/a>. They also suggested that a recently upgraded version of the Art Blocks site should solve this issue in the future.","“On the <a href=\"https:\/\/beta.artblocks.io\/\" data-v-f87c67ca=\"\">new site<\/a> we should be waiting for multiple block confirmations before showing you a success to avoid this bad UX [user experience] of seeing a success that isn’t ultimately true once chain-state finality is achieved. We definitely understand the frustration here and are sorry that the issue exists on the old site,” they added.","Some Art Blocks observers saw the episode as an example of miners on the Ethereum network — who earn fees in exchange for verifying transactions — exploiting their position for profit.","EthereumDegen <a href=\"https:\/\/twitter.com\/ethereumdegen\/status\/1442548323483717637\" data-v-f87c67ca=\"\">tweeted<\/a> that the reorganization of transaction blocks allow miners to “get their mints in and earn free money by flipping.”","“If you aren’t mining blocks your chance to get an Art Blocks mint are reduced and those miners are scalping us,” they added.","Art Blocks was contacted for comment but did not respond by press time.&nbsp;"],"hashtag":[]}