{"summary":"DeFiance Capital argues in a new statement that it&#x27;s separate from Three Arrows Capital. It once described itself as a &quot;sub-fund and share class of Three Arrows Capital.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157740\/defiance-capital-distances-itself-from-bankrupt-crypto-fund-three-arrows-capital","publishDate":"2022-07-15T06:15:50","id":3246,"type":null,"title":"DeFiance Capital distances itself from bankrupt crypto fund Three Arrows Capital","category":["VENTURE CAPITAL"],"content":["DeFiance Capital, the crypto venture capital firm with ties to Three Arrows Capital (3AC), has distanced itself from the <a href=\"https:\/\/www.theblock.co\/linked\/155578\/three-arrows-capital-files-for-chapter-15-bankruptcy-in-new-york\" data-v-f87c67ca=\"\">bankrupt<\/a> hedge fund in a statement today.","Sharing the statement exclusively with The Block on Friday, DeFiance Capital said its founder Arthur Cheong created the firm \"entirely separate\" from 3AC in 2020, eight years after 3AC was founded by Kyle Davies and Zhu Su. DeFiance went on to say that none of its assets under management were raised from 3AC, its founders or any of its affiliates.","\"Arthur grew, developed and managed the DC [DeFinance Capital] business, assets and investments since that time,\" the statement claims. \"Arthur is not, and never was, a director of 3AC and\/or any of its affiliates. Further, Arthur is not, and never was, involved in the management of 3AC.\"","3AC had grown into one of the crypto industry's biggest hedge funds, before May's collapse of the Terra ecosystem left it facing significant losses. Last month, a court in the British Virgin Islands <a href=\"https:\/\/www.theblock.co\/post\/154809\/three-arrows-capital-liquidation-teneo\" data-v-f87c67ca=\"\">appointed<\/a> financial advisory firm Teneo to handle 3AC's liquidation and 3AC filed for Chapter 15 bankruptcy in New York a few days later.&nbsp;","As The Block has reported previously, DeFiance Capital's website once said it operated as a \"<a href=\"https:\/\/www.theblock.co\/post\/115996\/vincent-van-dough-nft-fund-three-arrows-capital-100-million\" data-v-f87c67ca=\"\">sub-fund and share class of Three Arrows Capital<\/a>.\"&nbsp;Now their <a href=\"https:\/\/defiance.capital\/\" data-v-f87c67ca=\"\">website<\/a> says: “DeFiance Capital is not a related company to, and operates independently from, Three Arrows Capital Pte. Ltd. (‘Three Arrows’), which is a Registered Fund Management Company in Singapore.”","DeFiance Capital declined to comment on this change and other questions when contacted.","The firm's statement further claims that Cheong \"has had no access to and consequently no visibility on 3AC's financial statements and\/or financial condition and only became aware of 3AC's solvency problems around the time the news became public in mid-June 2022.\"","The exact business relationship between DeFinance and 3AC isn't clear, but the former claims that it was a counterparty to the latter.","\"Like many counterparties which had dealings with 3AC, the business of DC has been materially affected and indeed prejudiced by the liquidation of 3AC,\" the statement reads. \"Arthur Cheong is committed to taking all necessary steps to protect, preserve and recover all assets which are and were owned in the context of DC's business.\"","DeFiance Capital's statement is similar to another known affiliate of 3AC, TPS Capital.","TPS Capital, which once described itself on its LinkedIn page and in <a href=\"https:\/\/www.theblockcrypto.com\/news+\/155338\/inside-the-three-arrows-capital-money-machine\" data-v-f87c67ca=\"\">messages seen by The Block<\/a> as the over-the-counter (OTC) trading arm of 3AC, <a href=\"https:\/\/twitter.com\/TPSCapital\/status\/1544870918853459969?s=20&amp;t=V5luqTZO6TGO4YlMwzG4YA\" data-v-f87c67ca=\"\">said last week<\/a> that it's an independent firm with separate management.","\"TPS is an independent legal entity and its operations are separate and distinct from those of 3AC,\" TPS Capital said at the time. \"TPS is run by a separate management team and operates its main count business without the involvement of 3AC or its principals.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"TPS Capital","content":"ORGANIZATION"},{"type":"DeFiance Capital","content":"ORGANIZATION"},{"type":"Kyle Davies","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Arthur","content":"PERSON"},{"type":"Registered Fund Management Company","content":"ORGANIZATION"},{"type":"DeFinance","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Three Arrows Capital Pte. Ltd.","content":"ORGANIZATION"},{"type":"Teneo","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Three Arrows Capital","content":"ORGANIZATION"},{"type":"Arthur Cheong","content":"PERSON"},{"type":"British Virgin Islands","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"DC","content":"ORGANIZATION"},{"type":"mid-June 2022","content":"DATE"}],"hashtag":["THREE ARROWS CAPITAL"],"authors":["Yogita Khatri","The Block"]}