{"summary":"Jean-Marc Stenger stressed that public networks enhance interoperability\n\nSocGen’s Forge is experimenting with issuing securities on a number of different blockchains","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/85892\/socgen-blockchain-boss-natural-preference-public-networks","publishDate":"2020-11-27T05:10:05","id":3246,"type":null,"title":"SocGen&#x27;s blockchain boss has &#x27;natural preference&#x27; for public networks","category":["Layer 1s"],"content":["<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">After centuries of advertising a smorgasbord of financing products and advisory services to wholesale customers, investment bankers will soon offer up a menu of blockchains.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">That is the vision of Jean-Marc Stenger, chief executive of Société Générale’s enterprise blockchain unit Forge.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">“We have, I would say, a natural preference for public blockchains,” said Stenger, in an interview with The Block.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">“Because we really think that’s where we will find the maximum interoperability, the ability of multiple players to interconnect with the protocol.”<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">His comments come roughly a month after Société Générale<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.theblockcrypto.com\/linked\/82557\/ethereum-consensys-socgen-digital-euro\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;announced a partnership with Ethereum software firm ConsenSys<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">, which will focus on central bank digital currency (CBDC) issuance and management, among other things.&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Forge has been working closely with Banque de France to experiment with CBDCs. The pair issued a €40 million tokenized bond that was settled using CBDC in May.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Forge hopes the use of security tokens will improve liquidity, shorten settlement times, and cut costs. <a href=\"https:\/\/www.theblockcrypto.com\/linked\/82557\/ethereum-consensys-socgen-digital-euro\" data-v-f87c67ca=\"\">As The Block&nbsp;<\/a><\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/82557\/ethereum-consensys-socgen-digital-euro\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">reported in May<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">, the tokenized bond was fully subscribed by Société Générale, which simultaneously paid the issuer – the bank’s covered bond vehicle Société Générale’s SFH. Payment was made in digital euros issued by the Banque de France on a blockchain built by the central bank’s “in-house blockchain team.”&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Société Générale has also experimented with issuing securities using Tezos and will be leveraging other networks for “forthcoming issuances,” according to Stenger.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">“One of the key hypotheses we took when we started this development is to make sure that we remain a bank. We are not turning ourselves into an IT provider or something like this,” Stenger continued.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">“There is still an uncertainty on what will be the blockchain protocol that will basically win the race and impose itself in the future. You have a few protocols that are leading the pack.”<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">One of those is Ethereum, but there are least “five or six other protocols” in contention, Stenger added.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Forge began as the product of an internal innovation programme at Société Générale roughly three years ago but has recently been transformed into a separate – albeit wholly-owned – subsidiary of the bank.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Like many blockchain initiatives undertaken in wholesale financial markets, one of the biggest challenges facing Stenger and his team is to convince the wider market to embrace a bold new method of transacting.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">SDX, the digital assets exchange developed by Six Group in Switzerland, has sought to spur on adoption of the project and of digital assets more generally by<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.fnlondon.com\/articles\/swiss-exchange-owner-six-says-investor-talks-for-blockchain-plan-behind-schedule-20200423\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;bringing in strategic investors<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Stenger, on the other hand, is hopeful that engaging in open source initiatives might do the trick.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">“We do think that there is a need to be more open than what we were previously; the way to be more open is not necessarily to open the capital of this subsidiary,” he said.&nbsp;<\/span>"],"hashtag":[]}