{"summary":"Shares ticked down as much as 15% in early trade in London, hovering around the £29.10 mark by mid-morning.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175468\/argo-blockchain-shares-crumble-as-it-sets-out-plan-to-raise-34-million","publishDate":"2022-10-07T05:53:32","id":3248,"type":null,"title":"Argo Blockchain shares crumble as it sets out plan to raise $34 million","category":["MINING"],"content":["Investor confidence in Argo Blockchain was rocked on Friday morning as it unveiled a plan to shore up its balance sheet amid declining bitcoin prices and rocketing energy costs.","The company, which is listed in London, plans to sell 3,400 mining machines for cash proceeds of £6 million ($6.8 million). It will also raise approximately £24 million ($27 million) via a proposed subscription with a strategic investor, it said <a href=\"https:\/\/argoblockchain.com\/news-room\/2022-october-strategic-actions\" data-v-f87c67ca=\"\">in a release<\/a>.","It also amended an existing agreement for equipment financing, releasing £5 million ($5.7 million) of restricted cash.","The moves were made to ensure it \"has the working capital necessary to execute its current strategy and meet its obligations over the next twelve months,\" it added.&nbsp;","\"After careful consideration, we are convinced that taking these steps will better position the company to navigate the current market conditions and preserve shareholder value,” said Peter Wall, CEO at Argo, in the release.&nbsp;","The company’s next regular monthly operational update will be released on Oct. 11.","Shares <a href=\"https:\/\/uk.finance.yahoo.com\/quote\/ARB.L\/\" data-v-f87c67ca=\"\">ticked down<\/a> as much as 15% in early trade in London, hovering around the £29.10 mark by mid-morning. Bitcoin, meanwhile, sat around the $20,000 mark, having declined 0.8% in the last 24 hours.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"0.8%","content":"PERCENT"},{"type":"$20,000","content":"MONEY"},{"type":"Peter Wall","content":"PERSON"},{"type":"$6.8 million","content":"MONEY"},{"type":"24 million ($27 million","content":"MONEY"},{"type":"Oct. 11","content":"DATE"},{"type":"morning","content":"TIME"},{"type":"15%","content":"PERCENT"},{"type":"London","content":"LOCATION"},{"type":"Argo Blockchain","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"$5.7 million","content":"MONEY"}],"hashtag":["MINING"],"authors":["Lucy Harley-McKeown","The Block"]}