{"summary":"The DeFi lending platform is asking its community to select two out of four institutional borrowers for onboarding.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179639\/ribbon-finance-mulls-new-defi-lending-pools-for-institutional-borrowers","publishDate":"2022-10-25T08:31:33","id":3249,"type":null,"title":"Ribbon Finance mulls new DeFi lending pools for institutional borrowers","category":["GOVERNANCE"],"content":["Ribbon Finance, a DeFi protocol that offers investors access to <a href=\"https:\/\/www.theblock.co\/post\/173357\/defi-platform-ribbon-finance-announces-crypto-options-exchange-aevo\" data-v-f87c67ca=\"\">crypto structured products<\/a>, is considering a second round of lending pools for its DeFi lending product Ribbon Lend.","The Ribbon community is considering onboarding a new set of institutional borrowers, according to a new governance <a href=\"https:\/\/gov.ribbon.finance\/t\/rgp-28-ribbon-lend-second-borrower-cohort\/657\" data-v-f87c67ca=\"\">proposal<\/a> on the project’s forum. Four firms are currently under consideration: Parallel Capital, Amber Group, Auros, and Nibbio. Out of these four, the community will vote to select two of them. Ribbon Finance will then create two new lending pools for the selected institutional borrowers.","The governance proposal stated that the four firms under consideration have already been vetted. “Note that all the choices presented have undergone KYC\/AML and have completed credit underwriting with Credora, with strong credit scores,” the proposal stated.","Ribbon launched its DeFi lending product in August. Ribbon Lend has processed over $35 million in loans to institutional borrowers including Wintermute and Folkvang, according to DeFiLlama. Lenders on the platform enjoy a 12% annualized yield divided between 7% interest and 5% in RBN emissions. RBN is Ribbon’s native token and is currently trading at $0.36, up 7% in the last 24 hours.","The Ribbon community will have five days to discuss the new borrowers under consideration. Voting on the matter will commence after the discussion period.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"DeFiLlama","content":"ORGANIZATION"},{"type":"Wintermute","content":"PERSON"},{"type":"$35 million","content":"MONEY"},{"type":"Amber Group","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Nibbio","content":"ORGANIZATION"},{"type":"12%","content":"PERCENT"},{"type":"$0.36","content":"MONEY"},{"type":"RBN","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"Credora","content":"PERSON"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}