{"summary":"A recent audit report of ETH 2.0’s specifications revealed security vulnerabilities regarding the protocol’s P2P messaging system and block proposer system, and Ethereum co-founder Vitalik Buterin claimed that the team is working on the problems’ long-term solutions\nAccording to Buterin, successful multiclient testnets will have to precede the long-anticipated Phase 0 mainnet launch and the testnets will likely start running in April. ","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/60292\/ethereum-2-0s-phase-0-multiclient-testnets-will-likely-go-live-in-april-predicts-buterin","publishDate":"2020-03-30T12:55:10","id":3249,"type":null,"title":"Report: Phase 0 multiclient testnets will likely go live in April","category":["Ethereum"],"content":["<span data-v-f87c67ca=\"\">According to Ethereum co-founder Vitalik Buterin, the <a href=\"https:\/\/www.theblockresearch.com\/mapping-out-ethereums-developer-ecosystem-6450\" data-v-f87c67ca=\"\">Ethereum<\/a> 2.0 team will likely move ahead with multiclient testnets in April.<\/span>","<span data-v-f87c67ca=\"\">ETH 2.0 specifications recently <a href=\"https:\/\/www.theblockcrypto.com\/post\/59936\/a-new-ethereum-2-0-audit-has-highlighted-potential-security-vulnerabilities\" data-v-f87c67ca=\"\">underwent<\/a> an audit by technology security firm Least Authority, which highlighted the protocol's peer-to-peer (P2P) messaging system and the block proposer system as two areas with potential security vulnerabilities.<\/span>","<span data-v-f87c67ca=\"\">In response to the report, Buterin told The Block that the ETH 2.0 team is currently working to address these problems, although it might require long-term efforts rather than immediate revisions.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Least Authority raised concerns over the spam problem in the protocol’s P2P messaging system and recommended the implementation of a fully BAR-resilient gossip protocol to prevent malicious spamming.<\/span>","<span data-v-f87c67ca=\"\">According to Buterin, this issue was also present in the existing ETH 1.0 framework and was only mitigated overtime. He expects the same to take place for ETH 2.0.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"In general, we definitely take network security anti-spam seriously,\" Buterin said. \"Eth1 has taken some time to harden its network layer and there are currently a lot of eyes on networking issues so I expect DoS issues to be mitigated over time.\"<\/span>","<span data-v-f87c67ca=\"\">\"Regarding BAR resiliency, I expect that the approach we'll take will be to assume altruism at the beginning and then build in better incentive properties over time; the eth1 networking is also evolving in this direction,\" he added.<\/span>","<span data-v-f87c67ca=\"\">The second security vulnerability identified in the report concerns potential information leaks with ETH 2.0's block proposer system.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Buterin claimed that the team is taking seriously Least Authority's recommendation of using a Single Secret Leader Election (SSLE) mechanism to conceal the selection process. Indeed, SSLE is one of the team's main research focuses right now and is included in Buterin's 5-10 year<\/span> <a href=\"https:\/\/twitter.com\/VitalikButerin\/status\/1240365047421054976?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">roadmap<\/span><\/a> for ETH 2.0<span data-v-f87c67ca=\"\">. According to the roadmap, the SSLE system will be implemented in Phase 2 or later.&nbsp;<\/span>","<strong data-v-f87c67ca=\"\">Multiclient testnets likely take place in April&nbsp;<\/strong>","<span data-v-f87c67ca=\"\">Now that the auditing process has been completed, the <\/span><a href=\"https:\/\/twitter.com\/dannyryan\/status\/1242442148642869248?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">next steps<\/span><\/a><span data-v-f87c67ca=\"\"> are to carry out multi-client testnets and a Phase 0 bug bounty program, according to ETH 2.0 project lead Danny Ryan.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Speaking to The Block, Buterin revealed that the major push for multiclient testnets would likely happen in April.<\/span>","<span data-v-f87c67ca=\"\">\"<\/span><span data-v-f87c67ca=\"\">The best way to think about when phase 0 mainnet launch will take place is, <\/span><span data-v-f87c67ca=\"\">first we need a multiclient test net, then we wait for that testnet to run for some time without issues, and if it does then we launch,\" said Buterin. \"This is a similar procedure to what we did back in 2015 for eth1.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“So it is not easy to predict when mainnet will happen, though we absolutely expect multiclient test nets very soon; April seems very likely,\" he added.<\/span>"],"hashtag":["VITALIK BUTERIN"]}