{"summary":"Crypto exchange Seed CX’s unit has begun UAT testing of its upcoming physically settled bitcoin margin swaps\nSeed CX co-founder and CEO, Edward Woodford, told The Block that the product could launch “within the next three months”\nThe cryptocurrency derivatives market has been burgeoning, with several products expected to launch in the coming months","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/35705\/seed-cx-begins-testing-physically-settled-bitcoin-margined-swaps-expects-to-go-live-within-the-next-three-months","publishDate":"2019-08-13T09:00:03","id":3253,"type":null,"title":"Seed CX begins testing physically settled bitcoin margin swaps, expects to go live ‘within the next three months’","category":["Exchanges"],"content":["Cryptocurrency exchange Seed CX’s subsidiary, Seed SEF (swap execution facility), has started user acceptance testing of its physically-settled bitcoin margin swaps, a type of derivative contract in which two parties typically trade a financial instrument over-the-counter and with customized features.","Revealing the news exclusively to The Block on Tuesday, Seed SEF said that the testing will continue through August and post the successful results and pending regulatory review, it will launch the product in the U.S.","“We are working closely with the CFTC [the U.S. Commodity Futures Trading Commission] and hope to be able to launch the product publicly within the next three months,” Seed CX co-founder and CEO, Edward Woodford, told The Block.","The firm has been working “closely” with the regulator for the past 18 months and is awaiting final approval, which will allow Seed SEF to “self-certify” the bitcoin swaps product, Woodford added.","Claiming to be the “first” platform to test physically-settled bitcoin margin swaps, Woodford said the product will be both margin and physically-settled, meaning it will allow traders to enter into a leveraged position to buy or sell bitcoin for physical delivery at a later date.","Other cryptocurrency derivatives products in the U.S. market are either financially-settled or fully collateralized, the CEO said. And those products which are physically-settled, such as from CoinFLEX, are not available in the U.S. as the platform is not regulated in the country, Woodford added.&nbsp;","Indeed, CoinFLEX is based in Seychelles, and its CEO Mark Lamb, <a href=\"https:\/\/www.theblockcrypto.com\/2019\/03\/18\/inside-the-polychain-backed-offshore-futures-exchange-hoping-to-beat-bakkt\/\" data-v-f87c67ca=\"\">told<\/a> The Block recently that the exchange is not trying to appeal to the U.S. “The U.S.-regulated futures market is sub-2% of the crypto derivatives market, which is primarily an Asian phenomenon,” Lamb said at the time.","Seed SEF plans to list a combination of weekly and monthly contracts in a way that at any point there will be four upcoming weekly contracts, three upcoming serial monthly contracts, and two upcoming quarterly monthly contracts available for trading, per the announcement.","Woodford believes that such combination of maturities are “unique” and act as a “perfect complement” to those products that are currently available in the market. Specifically, Seed SEF’s weekly contracts will complement offshore contracts on exchanges like OKEx, while monthly contracts will align with the CME’s cash-settled contracts, the CEO explained. He added that Seed SEF’s swaps product is standardized with one bitcoin (BTC) contract size.","Regarding the swap product's margin methodology, the firm said it will use the Value-at-Risk (VaR) model, a measure of the risk of loss for investments. “We will utilize Value-at-Risk model with a 99% confidence level and a 10 day margin period of risk with additional aspects to account for extreme periods of volatility of the underlying asset of the contract,” Maurice Goodman, head of risk and settlement at Seed CX, told The Block.","Seed SEF is targeting institutional clients, including hedge funds and mining pools for the upcoming product. Woodford did not comment on volumes and revenues the firm is expecting from the product in the near future or in the long run.","The cryptocurrency derivatives market has been burgeoning, with several products lined up in the space. Just yesterday, Coinbase-backed upcoming crypto derivatives Blade <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/coinbase-backs-4-3m-seed-round-for-upcoming-crypto-derivatives-exchange-blade\/\" data-v-f87c67ca=\"\">announced<\/a> that it is going to launch bitcoin and altcoins perpetual swap contracts.","Earlier this month, LedgerX <a href=\"https:\/\/www.theblockcrypto.com\/2019\/08\/01\/actually-ledgerx-might-not-have-launched-physically-settled-bitcoin-futures-contracts-after-all\/\" data-v-f87c67ca=\"\">jumped<\/a> the gun on the announcement of beating rival Bakkt to offer physically-settled bitcoin futures contracts. However, LedgerX still lacks the CFTC approval to do so.","Bakkt has also been preparing to offer one-month and one-day physically-settled bitcoin futures contracts but is still <a href=\"https:\/\/www.theblockcrypto.com\/2019\/07\/26\/bakkt-is-eyeing-a-launch-in-q3-but-part-of-its-plan-is-risky-sources-say\/\" data-v-f87c67ca=\"\">awaiting<\/a> regulatory approvals. ErisX exchange, which is backed by U.S. brokerage TD Ameritrade, is also <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/erisx-picks-up-dco-license-for-its-planned-futures-market\/\" data-v-f87c67ca=\"\">expected<\/a> to launch its futures products sometime later this year.","<em data-v-f87c67ca=\"\">Disclosure: The Block reporter Isabel Woodford is Ed Woodford’s sister. She has no ownership stake or financial connection to his business.<\/em>"],"hashtag":["DERIVATIVES"]}