{"summary":"The FIO protocol is looking to make wallet transactions more accessible\nDeveloper Dapix is looking toward a 2020 mainnet launch and hoping for industry-wide adoption\nDapix raised $5.7 million in its Series A round, led by Binance Labs","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/38526\/fio-protocol-nets-5-7-million-series-a-led-by-binance-labs-to-make-wallet-transactions-more-user-friendly","publishDate":"2019-09-05T09:00:10","id":3255,"type":null,"title":"FIO protocol nets $5.7 million Series A led by Binance Labs to make wallet transactions more user friendly","category":["Wallets"],"content":["Binance's venture arm is leading a $5.7 million <wbr data-v-f87c67ca=\"\">fundraiser for a protocol looking to make wallets easier to use. Developer Dapix is making strides in the development of its Foundation for Interwallet Operability (FIO) protocol bolstered with the latest funding. The protocol could lower the barrier to entry in crypto by abstracting the need to understand private keys and public addresses.&nbsp;","This Series A comes after last year's seed round, when it raised $2.3 million. The announcement of this round coincides with a presale of the product. At its core, FIO is trying to streamline the user experience of transacting in-wallet.","<strong data-v-f87c67ca=\"\">Putting usability at the forefront<\/strong>","CEO David Gold said his first impression of blockchain was very similar to his first interactions with a mosaic browser using dial-up in the dot-com era. The once dot-com entrepreneur said in both cases, he saw clumsy usability getting in the way of revolutionary technology.","“On the one hand I looked at it and said, ‘this is going to change the world,’ and on the other hand, this is really hard to use,” he said. “This needs to be dramatically improved if blockchain is going to achieve its potential and actually reach mass adoption.”","That was the genesis of FIO, according to Gold. Asking a new user to enter a world of private keys and long public addresses seemed daunting, especially when a mistaken address can lead to failed transactions, the loss of funds or hours lost trying to recover them. As Gold said in FIO’s demos, the process for a new user isn’t \"psychologically comfortable.\"","The system circumvents these barriers to entry by integrating with wallets, adding to the wallet’s operating system rather than overhauling it. Users are given a so-called “FIO address,” similar to an email address, mitigating the need to keep track of private keys and public addresses. These “human readable” addresses work identically across every token and coin.","<span data-v-f87c67ca=\"\">“FIO addresses are the way of abstracting public addresses so that users do not need to see, nor even know that public addresses exist,” said Gold.<\/span>","<strong data-v-f87c67ca=\"\">From testnet to mainnet <\/strong>","<span data-v-f87c67ca=\"\">The company has conducted a testnet launch of its protocol, eyeing a mainnet launch in 2020. For now, there’s a presale coinciding with the funding announcement, allowing interested parties to claim FIO usernames and domains ahead of launch. Gold said so far he was impressed with the number of people engaging in the presale despite its recent unveiling.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Users can also type in the desired FIO address and request funds in-wallet, much like popular digital payment systems Venmo and CashApp. FIO even mimics the memo capability, with the opportunity to write what a payment is for in the request. According to Gold, all this lessens the chance of a faulty transaction, since FIO addresses are less complicated than public ones, and the server will not allow users to send funds to an invalid FIO address.<\/span>","<span data-v-f87c67ca=\"\">“That concept [of request] largely doesn’t exist in the blockchain world today,” he said. “Everything starts with send, and in the world of irreversible transactions, request for send is critical because that is the way you create error-free transactions.”<\/span>","<strong data-v-f87c67ca=\"\">Industry-wide adoption<\/strong>","<span data-v-f87c67ca=\"\">Still, this begs the question – what if your counterparty doesn’t have the protocol? Gold admitted mass adoption is key for the system to reach its potential. Both the transactor and the counterparty need to utilize FIO for it to work. So far 25 members have integrated the protocol, according to Gold, and the system was built in conversation with industry players. Gold said it's on the path to being industry standard.<\/span>","<span data-v-f87c67ca=\"\">Getting everyone to agree to one integration can be challenging, and Gold said mass adoption is tough until you hit a 50% tipping point, but a $5.7 million vote of confidence led by Binance Labs and bolstered by backers like Blockwall Capital and LuneX Ventures among others, is an encouraging early sign.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Gold also couldn’t point to much competition. Others in the space have focused on one aspect of what FIO does, rather than solving multiple usability problems in one system.<\/span>","<span data-v-f87c67ca=\"\">Gold said he’s looking to amass more partners ahead of the mainnet launch. Wallet providers like BRD, Trust Wallet, MyCrypto and Mycelium are already on board.<\/span>"],"hashtag":["BINANCE","SERIES A"]}