{"summary":"Palm Network announced an expansion of its existing Layer 1 blockchain to a proof-of-stake sidechain within the Polygon ecosystem.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241693\/palm-network-polygon","publishDate":"2023-07-27T09:00:52","id":3256,"type":null,"title":"Palm Network to rollout Polygon-based Supernets chain next week","category":["LAYER 1S"],"content":["Palm Network has announced its plan to release a proof-of-stake sidechain within the Polygon ecosystem using the Supernets software stack while maintaining its existing Layer 1 blockchain. The launch of the Supernets chain is set for next week.","The expansion to Polygon is planned in two stages, Palm Foundation said. During the initial phase, Palm Network aims to implement a proof-of-stake sidechain by Aug 1. Following this, the next phase will see the network migrate to a Layer 2 chain — also based on Supernets — that will utilize zero-knowledge rollups, slated for the subsequent year.","This strategic shift — done in collaboration with Polygon Labs — is rooted in the network’s objective to tackle scalability issues and more effectively cater to its user demographic in the creators and gaming niches, the Palm Foundation said.","Supernets, previously Polygon Edge, is a Polygon platform that lets teams create their blockchain networks using a software development kit. Palm has joined other projects — like <a href=\"https:\/\/www.theblock.co\/post\/221420\/polygon-to-help-develop-immutable-zkevm-secured-by-matic-stakers\" data-v-f87c67ca=\"\">Immutable<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/221942\/gaming-project-aavegotchi-to-release-own-blockchain-with-polygon-supernets\" data-v-f87c67ca=\"\">Aavegotchi<\/a>, and <a href=\"https:\/\/www.theblock.co\/post\/238140\/idex-unveils-a-zkevm-layer-2-chain-based-on-polygon-supernets\" data-v-f87c67ca=\"\">IDEX<\/a>&nbsp;— working on Supernets for their blockchains in the Polygon ecosystem.&nbsp;","“The high speed, security, and scalability that Polygon Supernets provide are pivotal as we progress towards becoming a zkEVM multiprover,” remarked Andrea Lerdo, executive director of the Palm Foundation.","The transition, the foundation said, is anticipated to boost interoperability with Ethereum and the broader Polygon 2.0, a planned ecosystem of multiple Layer 2 chains.","Palm Network has previously been used by entities like the Gary Vaynerchuk-backed Candy Digital and Ethereum developer <a href=\"https:\/\/consensys.net\/blog\/nft\/over-32000-users-from-130-countries-applied-to-purchase-damien-hirsts-nfts-on-the-palm-network\/\" data-v-f87c67ca=\"\">Consensys<\/a> for issuing digital collectibles.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Palm Foundation","content":"ORGANIZATION"},{"type":"IDEX","content":"ORGANIZATION"},{"type":"Aavegotchi","content":"LOCATION"},{"type":"Andrea Lerdo","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Gary Vaynerchuk","content":"PERSON"},{"type":"Palm Network","content":"ORGANIZATION"},{"type":"Candy Digital","content":"ORGANIZATION"}],"hashtag":["POLYGON"],"authors":["Vishal Chawla","The Block"]}