{"summary":"When images emerged of apparently stolen rare Pokemon cards, some began using them as an argument for Pokemon to embrace NFTs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/227007\/pokemon-cards-stolen-nfts","publishDate":"2023-04-19T04:31:39","id":3257,"type":null,"title":"Stolen Pokemon cards highlight trustless nature of NFTs","category":["GAMING"],"content":["Over the past week, photos circulated on the internet showing a table stacked with hundreds of rare Pokemon trading cards organized neatly in rows — almost as if they were stolen straight off the printing line.","When someone attempted to sell the cards from Pokemon's Fusion Strike set to Trading Card World, the sheer volume set alarm bells ringing. It also got NFT fans thinking.&nbsp;","“It took them a month or two [for the seller to] provide a picture,” Scott Emer, co-founder of Trading Card World, <a href=\"https:\/\/www.polygon.com\/tabletop-games\/23687028\/stolen-pokemon-card-rumors-true-story-fusion-strike\" data-v-f87c67ca=\"\">told<\/a> Polygon in an interview. “When they finally did, we were like, <em data-v-f87c67ca=\"\">Well, this looks really weird<\/em>.”","In a statement <a href=\"https:\/\/m.facebook.com\/groups\/239026353914564\/permalink\/975227613627764\/?mibextid=Nif5oz\" data-v-f87c67ca=\"\">issued<\/a> on Facebook, TCW said it contacted The Pokemon Company — which allegedly already knew the cards were missing — and worked together to retrieve and return them. A spokesperson for The Pokemon Company didn't immediately respond to a request for comment on the alleged theft.&nbsp;","Either way, fans of the Pokemon trading card game weren't happy, with some now seeking a blockchain-based solution so this can't happen again.&nbsp;","<span data-v-f87c67ca=\"\">A desk stacked with apparently stolen Pokemon cards. Source: Reddit.<\/span>","Pokemon trading cards are distributed in blind packs — meaning buyers do not know what is inside. Even the manufacturer is kept in the dark.","Still, each pack is guaranteed to have one rare card. And some rares, such as those printed with a rainbow holographic theme or alternative art, are significantly rarer (and more valuable) than others.","It's this blind nature of Pokemon card packs that feeds into the popularity of pack-opening videos on YouTube and other video streaming services. People love to watch and see if others get a hit card (or don't).","Pokemon cards also aren't cheap — especially in some countries outside of the United States. For example, one booster box containing 36 packs of Pokemon cards (360 single cards in total) costs 63,000 Hungarian forint ($185) in the central European country at retail. (Buyers in the U.S. can scoop the same boxes for roughly $120 on eBay).","For these reasons, some fans of the Pokemon Trading Card Game have <a href=\"https:\/\/twitter.com\/adamamcbride\/status\/1648385192363433992\" data-v-f87c67ca=\"\">vented<\/a> their frustrations online over the apparent off-the-production-line theft of prized cards.&nbsp;Making matters worse is a long-standing complaint that pull rates for the most-prized cards feel very low — particularly for the set in question, Fusion Strike.","\"The rarest card in Chilling Reign was a Alternate Art Vmax Blaziken,\" one blog <a href=\"https:\/\/pokepatch.com\/2021\/11\/14\/fusion-strike-pull-rates-might-be-the-worst-weve-seen\/\" data-v-f87c67ca=\"\">explained<\/a>, claiming: \"The pull rate on this Blaziken is about 1\/450. The pull rate on the Alternate Art Vmax Mew in Fusion Strike is about 1\/2,100. That means the rarest card in Fusion Strike is 4x harder to pull than the rarest card in Chilling Reign.\"","<span data-v-f87c67ca=\"\">An ungraded Gengar VMAX #271 currently costs around the same as an entire Fusion Strike booster box. Source: <a href=\"https:\/\/www.pricecharting.com\/game\/pokemon-fusion-strike\/booster-box\" data-v-f87c67ca=\"\">Price Charting<\/a><\/span>","All this has got some considering whether the future of Pokemon cards should be digital.&nbsp;&nbsp;","While the distribution of physical cards is inherently somewhat opaque and tough to police, digital cards — particularly those existing as non-fungible tokens that may be verified on distributed public ledgers — don't share the same issues.","“Blockchain tech removes the need for trust,\" Nayn, a pseudonymous representative of the Echelon Prime Foundation, which promotes the growth of novel gaming models, explained in an interview.","This means no one can steal freshly printed (or minted) cards off the production line without the entire world seeing, they said, adding that newer trading card games like Parallel are already embracing the digital world.&nbsp;","\"Parallel Studios minted the entire base set of Parallel TCG cards on the Ethereum blockchain,\" Nayn explained. \"Distributed across six separate drops, the total supply of the base set can easily be tracked and on-chain randomness makes the distribution provably fair.\"","\"Additionally, by delivering the cards directly to consumers, this method eliminates the possibility of what happened with Pokemon cards,\" they added.","The Pokemon Company International itself may be looking at using blockchain technology to enhance its incredibly popular product.","In March, the shepherds of arguably the world's most-valuable media brand — Pokemon has made upwards of $100 billion since its inception in the mid-1990s — <a href=\"https:\/\/boards.greenhouse.io\/pokemoncareers\/jobs\/5540422003\" data-v-f87c67ca=\"\">listed<\/a> a job position requiring candidates to understand web3 and blockchain technology.","The Pokemon Company didn't immediately respond to a request for comment on its blockchain-related plans.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Reddit","content":"LOCATION"},{"type":"Blaziken","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Echelon Prime Foundation","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Pokemon","content":"ORGANIZATION"},{"type":"TCW","content":"ORGANIZATION"},{"type":"Vmax Blaziken","content":"PERSON"},{"type":"Scott Emer","content":"PERSON"},{"type":"Pokemon Company","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Trading Card World","content":"ORGANIZATION"},{"type":"The Pokemon Company","content":"ORGANIZATION"},{"type":"\" Nayn","content":"ORGANIZATION"},{"type":"$100 billion","content":"MONEY"},{"type":"$120","content":"MONEY"},{"type":"Fusion Strike","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"TCG","content":"ORGANIZATION"},{"type":"Pokemon Company International","content":"ORGANIZATION"},{"type":"$185","content":"MONEY"}],"hashtag":["TRADING CARD GAMES"],"authors":["Adam James","The Block"]}