{"summary":"The marketplace has acknowledged that its head of product Nate Chastain purchased NFTs that he knew were going to be displayed prominently.\nChastain was accused by Twitter users overnight of snapping up items in OpenSea’s front-page collections ahead of general release.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/117751\/opensea-confirms-executive-used-insider-knowledge-when-buying-nfts","publishDate":"2021-09-15T09:07:09","id":3258,"type":null,"title":"OpenSea confirms executive used insider knowledge when buying NFTs","category":["NFTs"],"content":["<strong data-v-f87c67ca=\"\">UPDATE (9\/16):&nbsp;<\/strong>On Tuesday, OpenSea co-founder and CEO Devin Finzer <a href=\"https:\/\/opensea.io\/blog\/announcements\/employee-information-use-at-opensea\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">said<\/a> that Chastain had been asked to resign from his position at the startup.","\"When we launched OpenSea, there was only one collection on our platform: CryptoKitties. Today, there are 20 million NFTs to discover on OpenSea,\" he wrote. \"We owe this growth to the vibrant community of creators and collectors who use our platform every day, and we have a strong obligation to this community to move it forward responsibly and diligently. The behavior of one of our employees violated that obligation and, yesterday, we requested and accepted his resignation.\"","Finzer said that a previously announced investigation is ongoing \"but we are committed to quickly implementing its recommendations.\"","One of the non-fungible token (NFT) space’s biggest marketplaces has admitted that a senior employee has been getting the drop on its most popular drops.","Twitter users last night <a href=\"https:\/\/twitter.com\/zuwutv\/status\/1437921263394115584?s=21\" data-v-f87c67ca=\"\">accused Nate Chastain<\/a>, head of product at OpenSea, of using secret Ethereum wallets to snap up the platform’s front-page NFT drops before general release. Citing <a href=\"https:\/\/etherscan.io\/tx\/0x54bcb222978a0daa91276edce9d59fab8d276439c797d123c29fadf4ccacf316\" data-v-f87c67ca=\"\">transactional data<\/a> on Etherscan, Twitter user Zuwu said that Chastain seems to be selling these pieces “shortly after the front-page-hype spike for profits.”","His actions have been likened to frontrunning or insider trading, which in regulated financial markets refers to dealing on information that is not yet public.","On September 15, OpenSea published <a href=\"https:\/\/opensea.io\/blog\/announcements\/employee-information-use-at-opensea\/\" data-v-f87c67ca=\"\">a blog post<\/a> acknowledging Chastain’s actions.","“Yesterday we learned that one of our employees purchased items that they knew were set to display on our front page before they appeared there publicly,” said OpenSea. “This is incredibly disappointing. We want to be clear that this behavior does not represent our values as a team. We are taking this very seriously and are conducting an immediate and thorough review of this incident so that we have a full understanding of the facts and additional steps we need to take.”","The company has rolled out new policies specifying that team members may not buy or sell from collections while they are being promoted, and cannot use confidential information to purchase or sell NFTs.","The accusations caused quite the stir on Twitter, with some users highlighting a tweet by Chastain on August 3 in which he <a href=\"https:\/\/twitter.com\/natechastain\/status\/1422368341717573633?s=19\" data-v-f87c67ca=\"\">appears to admit<\/a> to snapping up an NFT from a collection by the artist Arya Mularama ahead of the public drop. “I just wanted to get one of these before they all disappeared tbh,” wrote Chastain at the time.","Others have turned to Etherscan to <a href=\"https:\/\/mobile.twitter.com\/0xngmi\/status\/1437954038465761283\" data-v-f87c67ca=\"\">produce their own analysis<\/a> of the movement of NFT-linked funds between wallets associated with Chastain.","Chastain is the owner of CryptoPunk #3501, which he purchased for 26.98 ether (about $92,000 at today’s prices) some seven months ago, <a href=\"https:\/\/opensea.io\/assets\/0xb47e3cd837ddf8e4c57f05d70ab865de6e193bbb\/3501\" data-v-f87c67ca=\"\">according to OpenSea data<\/a>. Since this NFT identified his Ethereum address, it was relatively simple for observers to watch his transactions and know that he was behind them.","Both Chastain and OpenSea were contacted for comment but did not respond by press time. The Block will update this story if it receives a response.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to subscribe to The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/t.me\/the_block_crypto\" target=\"_blank\" rel=\"noopener noreferrer\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Telegram<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>"],"hashtag":["OPENSEA"]}