{"summary":"The Block&#x27;s Frank Chaparro chats with Alok Vasudev, co-founder at Standard Crypto about the VC landscape, DAOs and embracing the weirdness.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/133508\/standard-crypto-co-founder-on-leaning-into-the-weirdness-of-crypto","publishDate":"2022-02-09T15:02:47","id":3258,"type":null,"title":"Standard Crypto co-founder on leaning into the &#x27;weirdness&#x27; of crypto","category":["PODCASTS"],"content":["<span data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Episode <strong data-v-f87c67ca=\"\">7<\/strong><\/i><b data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\"> <\/i><\/b><i data-v-f87c67ca=\"\">of Season 4 of The Scoop was recorded remotely with The Block’s Frank Chaparro and Alok Vasudev, co-founder at Standard Crypto.<\/i><\/span>","<span data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Listen below, and subscribe to The Scoop on <\/i><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Apple<\/i><\/a><i data-v-f87c67ca=\"\">, <\/i><a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Spotify<\/i><\/a><i data-v-f87c67ca=\"\">, <\/i><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5tZWdhcGhvbmUuZm0vdGhlYmxvY2stdGhlc2Nvb3A?sa=X&amp;ved=0CAMQ4aUDahcKEwionbSO9fbxAhUAAAAAHQAAAAAQAg\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Google Podcasts<\/i><\/a><i data-v-f87c67ca=\"\">, <\/i><a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Stitcher<\/i><\/a><i data-v-f87c67ca=\"\"> or wherever you listen to podcasts. Email feedback and revision requests to <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"e999868d8a889a9da99d818c8b85868a828a9b90999d86c78a8684\">[email&nbsp;protected]<\/a>.<\/i><\/span>","<span data-v-f87c67ca=\"\"><b data-v-f87c67ca=\"\">This episode is brought to you by our sponsors <a href=\"http:\/\/www.fireblocks.com\" data-v-f87c67ca=\"\">Fireblocks<\/a>, <a href=\"https:\/\/coinbase.com\/prime\" data-v-f87c67ca=\"\">Coinbase Prime<\/a> &amp; <a href=\"http:\/\/Chainalysis.com\" data-v-f87c67ca=\"\">Chainalysis<\/a><br data-v-f87c67ca=\"\">\n<\/b><em data-v-f87c67ca=\"\">Fireblocks is an enterprise-grade platform delivering a secure infrastructure for moving, storing, and issuing digital assets. Fireblocks enables exchanges, lending desks, custodians, banks, trading desks, and hedge funds to securely scale digital asset operations through the Fireblocks Network and MPC-based Wallet Infrastructure. Fireblocks serves over 725 financial institutions, has secured the transfer of over $1.5 trillion in digital assets, and has a unique insurance policy that covers assets in storage &amp; transit. For more information, please visit <a href=\"http:\/\/www.fireblocks.com\" data-v-f87c67ca=\"\">www.fireblocks.com<\/a>.<\/em><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">About Coinbase Prime<br data-v-f87c67ca=\"\">\n<\/strong><em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Coinbase Prime is an integrated solution that provides institutional investors with an advanced trading platform, secure custody, and prime services to manage all their crypto assets in one place. Coinbase Prime fully integrates crypto trading and custody on a single platform, and gives clients the best all-in pricing in their network using their proprietary Smart Order Router and algorithmic execution. For more information, visit <a href=\"https:\/\/coinbase.com\/prime\" data-v-f87c67ca=\"\">www.coinbase.com\/prime<\/a>.<\/span><\/em><\/span>","<span data-v-f87c67ca=\"\"><b data-v-f87c67ca=\"\">About Chainalysis<br data-v-f87c67ca=\"\">\n<\/b><em data-v-f87c67ca=\"\">Chainalysis is the blockchain data platform. We provide data, software, services, and research to government agencies, exchanges, financial institutions, and insurance and cybersecurity companies in over 60 countries. Our data powers investigation, compliance, and market intelligence software that has been used to solve some of the world’s most high-profile criminal cases and grow consumer access to cryptocurrency safely. Backed by Accel, Addition, Benchmark, Coatue, Paradigm, Ribbit, and other leading firms in venture capital, Chainalysis builds trust in blockchains to promote more financial freedom with less risk. For more information, visit <a href=\"http:\/\/www.chainalysis.com\" data-v-f87c67ca=\"\">www.chainalysis.com<\/a>.<br data-v-f87c67ca=\"\">\n<iframe loading=\"lazy\" frameborder=\"0\" height=\"200\" src=\"https:\/\/playlist.megaphone.fm?e=BLOCK8197153168\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe><br data-v-f87c67ca=\"\">\n<\/em><\/span>","For some, a landscape of colorful NFTs and crypto anons can be daunting — yet for traditional investors, it can present an array of new challenges that require near-constant adjustment or reinvention.","But as novel use cases evolve under the twin banners of \"Web3\" and \"the metaverse,\" business interests such as VC firm Standard Crypto are eyeing the opportunity to leap into such a world.&nbsp;","During this episode of The Scoop, Alok Vasudev, co-founder at Standard Crypto, joined The Block's Frank Chaparro to discuss the future of decentralized autonomous organizations (DAOs) and NFTs, when a project \"merits\" a DAO, and how Vasudev learned to stop worrying and embrace the 'weirdness' of crypto.&nbsp;","Vasudev contends that, unlike other venture firms, Standard Crypto doesn't follow themes but rather operates first as fans of the innovations technology can present.","\"We've always likened ourselves as entrepreneur followers rather than being overly thematic about where things are going and trying to develop too much kind of a fund-specific thesis.\" This broad investment approach has recently included DAOs, which Vasudev said he believes could one day potentially function like companies in the future, with the added benefit of on-chain governance.","\"One thing that we talk about is whether DAOs in how they're structured are actually going to evolve to look a little bit more like companies than they have in the past, but with radically different accountability structures because of token holder governance,\" he remarked.","Vasudev also believes NFTs and projects being built for Web3 may likely serve as the proving ground for the future iterations of internet success stories like Angry Birds or Facebook, explaining:","\"We're believers that these cultural outgrowths of crypto and Web3 are actually going to become mainstream and become some of the most sought after and recognizable imagery and characters and IP that's out there.\"","Using Angry Birds as an example, Vasudev compared the potential of NFTs to forge a franchise:","\"I think I remember the first time I was kind of stunned that they were actually making an Angry Birds movie... and next thing you turn around and it's actually being made in feature films. So this idea that kind of internet culture is just going to become mainstream culture, I think is already proven out. And now I think NFTs are the next chapter in that story.\"","<em data-v-f87c67ca=\"\">During this episode, Vasudev and Chaparro also discuss:<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1.5 trillion","content":"MONEY"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Alok Vasudev","content":"PERSON"},{"type":"Google","content":"ORGANIZATION"},{"type":"Coinbase Prime<\/a> &amp; <a href=\"http:\/\/Chainalysis.com\" data-v-f87c67ca=\"\">Chainalysis<\/a><br data-v-f87c67ca=\"\">\n<\/b><em data-v-f87c67ca=\"\">Fireblocks","content":"ORGANIZATION"},{"type":"Coatue","content":"ORGANIZATION"},{"type":"The Scoop","content":"ORGANIZATION"},{"type":"Accel","content":"ORGANIZATION"},{"type":"Benchmark","content":"ORGANIZATION"},{"type":"Vasudev","content":"PERSON"},{"type":"Ribbit","content":"LOCATION"},{"type":"Spotify","content":"LOCATION"},{"type":"Vasudev","content":"ORGANIZATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Fireblocks Network","content":"ORGANIZATION"},{"type":"MPC","content":"ORGANIZATION"},{"type":"Standard Crypto","content":"ORGANIZATION"},{"type":"Chainalysis<br data-v-f87c67ca=\"\">\n<\/b><em data-v-f87c67ca=\"\">Chainalysis","content":"PERSON"},{"type":"Coinbase Prime<br data-v-f87c67ca=\"\">\n<\/strong><em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Coinbase Prime","content":"ORGANIZATION"},{"type":"Chaparro","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"}],"hashtag":["DAOS"],"authors":["Frank Chaparro","The Block"]}