{"summary":"U.S. Treasury Secretary Steven Mnuchin and Federal Reserve Chairman Jerome Powell are not keen on issuing a digital dollar\n “Chair Powell and I…we both agree that in the near future, in the next five years, we see no need for the Fed to issue a digital currency,” said Mnuchin \nNotably, Mnuchin is “fine” with Facebook-led stablecoin project Libra, provided it is “fully compliant” ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/49491\/mnuchin-powell-see-no-need-to-issue-digital-dollar-in-the-next-5-years","publishDate":"2019-12-06T06:15:11","id":3259,"type":null,"title":"Mnuchin, Powell see no need to issue digital dollar &#x27;in the next 5 years&#x27;","category":["Cryptocurrency"],"content":["<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">U.S. Treasury Secretary Steven Mnuchin and Federal Reserve Chairman Jerome Powell are not keen on issuing a digital dollar.&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">“Chair Powell and I have discussed this at length- we both agree that in the near future, in the next five years, we see no need for the Fed to issue a digital currency,” Mnuchin said Thursday at a House Financial Services Committee&nbsp;<\/span><a class=\"_e75a791d-denali-editor-page-rtfLink\" href=\"https:\/\/financialservices.house.gov\/calendar\/eventsingle.aspx?EventID=404856\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">hearing<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;in Washington.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Mnuchin’s comment came in response to a lawmaker’s question that referred to Facebook-led Libra stablecoin under development and China’s upcoming digital yuan.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Notably, the Treasury Secretary has no issues with Libra, provided it is compliant. “I’m fine if Facebook wants to get into digital payments...and that may be good for their customer base and good for a lot of Americans who don't have access to banks... we want to make sure if they do it they're doing it in a way that is fully compliant with our BSA\/AML [the Bank Secrecy Act\/ anti-money laundering] and that in no way can this be used for terrorist financing,” Mnuchin said at the hearing.&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The Treasury Secretary further said that he has had a “dozen” meetings with Facebook, going through regulatory concerns, which has slowed down the company’s progress with Libra.&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The Fed, on its part, has been <\/span><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">evaluating<\/span><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\"> the benefits of issuing a digital dollar, but has \"not identified potential material benefits of [a] general purpose CBDC to the implementation of monetary policy relative to our existing tools,\" Powell <a href=\"https:\/\/twitter.com\/Zachary\/status\/1196942798081138688\" data-v-f87c67ca=\"\">said<\/a> recently. The central bank is currently focused on <a href=\"https:\/\/www.theblockcrypto.com\/linked\/34824\/fed-to-develop-24-7-instant-payment-and-settlement-service\" data-v-f87c67ca=\"\">developing<\/a> an instant \"round-the-clock real-time\" payment and settlement system, with a hopeful launch date in 2023 or 2024. Mnuchin called the system a \"<\/span>very sophisticated\" one at the hearing.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Fed counterpart, the <\/span>European Central Bank (ECB), has also been exploring the benefits of digital currency. In fact, just yesterday, the ECB <a href=\"https:\/\/www.theblockcrypto.com\/post\/49307\/european-central-bank-is-in-favor-of-its-own-digital-currency-for-faster-and-cheaper-payments\" data-v-f87c67ca=\"\">said<\/a> that it could one day issue its own digital euro if the private sector fails to make cross-border payments faster and cheaper. “If industry efforts fall short of developing an innovative and efficient pan-European payment solution, the social need for it could potentially be met by issuing a CBDC [central bank digital currency],\" it said.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nLast week, Governor of France’s central bank, François Villeroy de Galhau, also <a href=\"https:\/\/www.theblockcrypto.com\/linked\/49253\/report-bank-of-france-to-test-digital-currency-in-2020\" data-v-f87c67ca=\"\">said<\/a> that the bank will start testing digital currency soon and \"will launch a call for projects before the end of the first quarter of 2020.\" While in Asia, China's central bank <a href=\"https:\/\/www.theblockcrypto.com\/linked\/35493\/chinas-central-bank-digital-currency-is-ready-after-5-years-of-development\" data-v-f87c67ca=\"\">is almost ready<\/a> to launch its national digital yuan after five years of research and development."],"hashtag":["ECB","FEDERAL RESERVE","JEROME POWELL"]}