{"summary":"The government of the Chinese province of Yunnan has set out a plan to support local blockchain development.\nOne notable part of the plan is to support the infrastructure construction of what it calls ‘blockchain computing platforms.’\nYunnan, like the adjacent Sichuan province, is a hydropower hub that powers a significant portion of the bitcoin network’s hash rate.","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/100317\/china-yunnan-blockchain-computing-plan","publishDate":"2021-04-02T10:01:29","id":3260,"type":null,"title":"Chinese hydropower hub reveals &#x27;blockchain computing&#x27; plan","category":["Bitcoin"],"content":["The government of the Chinese province of Yunnan has a new plan to support local blockchain development, including a move that could bolster crypto mining infrastructure in the region.","The provincial government <a href=\"https:\/\/mp.weixin.qq.com\/s\/1yztZotADcNjcVUFS3cgAQ\" data-v-f87c67ca=\"\">published<\/a> the plan on Friday. It outlines 10 areas that it intends to support relating to blockchain development — for instance by providing state subsidies to startups in the space for rent and talent recruitment.","One notable component of the plan is to \"support blockchain new infrastructure construction,\" which means accelerating the development of \"base-layer blockchain service platforms\" as well as \"blockchain computing platforms.\"","Yunnan, like the adjacent Sichuan province, has abundant hydropower resources that currently power a significant portion of bitcoin's hash rate — albeit a much smaller portion than produced by the miners housed in Sichuan.","Data from the Cambridge Center for Alternative Finance <a href=\"https:\/\/cbeci.org\/mining_map\" data-v-f87c67ca=\"\">shows<\/a> that mining facilities in Yunnan accounted for 5.4% of the global bitcoin computing power as of April 2020.","Though the government's plan doesn't explicitly mention bitcoin or crypto mining, its release follows visits by government officials to various bitcoin mining farms in Yunnan, where they studied the farms' interactions with the local economy, local farm managers told The Block.","The plan could be the Yunnan government's first step towards building something similar to the state-sanctioned crypto-mining parks like those recently developed in Sichuan.","As The Block <a href=\"https:\/\/www.theblockcrypto.com\/daily\/86520\/china-sichuan-hydropower-consumption-parks-bitcoin-mining\" data-v-f87c67ca=\"\">reported<\/a> last year, bitcoin mining farms in China's Southwestern Yunnan and Sichuan provinces have traditionally sourced electricity directly from hydropower plants. But the governments in Sichuan and Yunnan had been cracking down on that approach.","Still, since bitcoin mining helps consume excessive hydropower during the summer rainy season, the Sichuan government did not want to completely phase out local bitcoin mining farms, which are estimated to account for 50% of the network's total computing power.&nbsp;So it established \"Hydro-electricity Consumption Industrial Demonstration Zones\" that are open to companies in select energy-intensive industries including bitcoin mining.","Bitcoin mining farm operators in Sichuan now have an option to reside legally in a government-approved industrial park where they can access a reliable supply of electricity. In return, The State Grid and the local government are able to generate revenue from mining farms by charging them fees for using the electricity."],"hashtag":["BITCOIN"]}