{"summary":"113 million Arbitrum governance tokens — representing more than 83% of the total vote — have voted against the proposal to return 700 million ARB.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/226366\/arbitrum-funds-return-vote-fail","publishDate":"2023-04-14T03:35:00","id":3261,"type":null,"title":"Arbitrum proposal to return $1 billion in governance tokens slated to fail","category":["GOVERNANCE"],"content":["With only one day remaining for governance votes to be cast, Arbitrum Improvement Proposal 1.05 — which aims to return 700 million ARB tokens \"unjustly allocated to the Foundation from the DAO\" — is slated to fail by an overwhelming majority.","As of this writing, 113 million Arbitrum governance tokens — representing more than 83% of the total vote — have <a href=\"https:\/\/snapshot.org\/#\/arbitrumfoundation.eth\/proposal\/0x3ae4c725f7cb82d450b6fe8517178b2a0a51d1105beaad0adb421df1bc8f8cc4\" data-v-f87c67ca=\"\">voted<\/a> against the proposal. 20 million ARB tokens have voted for the proposal, while 2.2 million have abstained.","Titled \"AIP 1.05: Return 700M $ARB to the DAO Treasury [REAL],\" the Arbitrum governance proposal claims that the pre-emptive and unapproved allocation of 700 million ARB tokens — worth more than $1 billion — \"was a clear overreach of the DAO's power of treasury resources.\"","The drama started during the first weekend in April, when the Arbitrum Foundation <a href=\"https:\/\/www.theblock.co\/post\/224459\/arbitrum-proposal-backlash-response\" data-v-f87c67ca=\"\">backtracked<\/a> on a key governance proposal, AIP-1, that controversially planned to send 750 million ARB tokens to itself — which it claimed would be used to fund investment initiatives built using Arbitrum's technology.","The proposal seemingly went ahead without the approval of token holders — the decentralized autonomous organization that theoretically governs Arbitrum — who <a href=\"https:\/\/www.theblock.co\/post\/224444\/arbitrum-sells-tokens-aip1?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">voted<\/a> overwhelmingly against the proposal.","AIP 1.05 claims it \"is a symbolic gesture to demonstrate that the governance holders ultimately control the DAO, not the Arbitrum service provider nor the Foundation.\"","Prominent token holders voting against AIP-1.05 include \"0x0eB5,\" olimpio.eth, 0xBbE9, galxe.arb, chainlinkgod.eth and blockworksres.eth — all of which have voted with millions of ARB tokens.","Possible reasons for accounts voting against the proposal include a belief that small voters may be solely <a href=\"https:\/\/twitter.com\/0xG00gly\/status\/1646770507671379969\" data-v-f87c67ca=\"\">interested<\/a> in maximizing the price of Arbitrum's governance token. At the same time, large holders — primarily delegates — are more focused on long-term sustainability and the Arbitrum Foundation's ability to distribute tokens.","Others may <a href=\"https:\/\/twitter.com\/YohanGGlobal\/status\/1646771202269016065\" data-v-f87c67ca=\"\">view<\/a> the proposed forced buyback as an \"extremist approach\" that is a call for attention rather than a realistic option.","Furthermore, others <a href=\"https:\/\/twitter.com\/Cattin0x\/status\/1646769484865077248\" data-v-f87c67ca=\"\">claim<\/a> AIP-1.1 already addresses the issue of the problematic funds, as the Arbitrum Foundation plans to send the tokens to a smart contract with vesting — which the DAO can modify. Because of this, AIP-1.05 could conceivably overcomplicate the issue.","Whichever side one is on, one thing is sure: DAO governance, as a whole, will remain a hot topic for the foreseeable future.","\"I think that this is pretty impactful,\" Arnold Toh, research analyst at The Block, said, explaining: \"The fact that there is still a hotly debated matter shows the ramifications of Arbitrum's unsolicited actions will continue to pervade their governance for the foreseeable future.\"","\"Arbitrum is the largest Optimistic Rollup — both in total value locked and in valuation — meaning that how its governance pans out will likely set an example for many other rollup communities ahead,\" Toh added.","The price of Arbitrum's governance token is up 24.4% over the past 24 hours. It is currently trading at more than $1.50 per token.","<span data-v-f87c67ca=\"\">The price of Arbitrum's governance token has increased substantially over the past week. Source: TradingView<\/span>","<em data-v-f87c67ca=\"\">Updated with additional information about AIP-1.1.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DAO Treasury","content":"ORGANIZATION"},{"type":"Foundation","content":"ORGANIZATION"},{"type":"AIP","content":"ORGANIZATION"},{"type":"TradingView","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Arnold Toh","content":"PERSON"},{"type":"$1.50","content":"MONEY"},{"type":"the first weekend","content":"DATE"},{"type":"83%","content":"PERCENT"},{"type":"Arbitrum Foundation","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"1","content":"DATE"},{"type":"$ARB","content":"MONEY"},{"type":"24.4%","content":"PERCENT"},{"type":"April","content":"DATE"},{"type":"Arbitrum","content":"ORGANIZATION"}],"hashtag":["ARBITRUM","DAOS","GOVERNANCE VOTES"],"authors":["Adam James","The Block"]}