{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley . They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/9948\/crypto-accounts-necessary-to-assess-net-worth","publishDate":"2019-02-02T16:00:03","id":3262,"type":null,"title":"Crypto accounts necessary to assess net worth?","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario [twitter:<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>] and Stephen Palley [twitter:<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>]. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","[As always, Rosario summaries are “NMR” and Palley summaries are “SDP”]","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]Gersh v. Anglin, Case No. CV 17–50-M-DLC-JCL (D. Mont. January 18, 2019) [NMR]<\/strong><\/em>","<a href=\"https:\/\/scholar.google.com\/scholar_case?case=486526933315625316\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Link to order<\/a>","This order involves a discovery dispute. Discovery is the process by which the parties in a lawsuit get evidence they think is important to the suit. The process follows very particular rules, and some common things that occur are requests for the production of documents as well as the filing of interrogatories, which are basically questions that one side wants answered by the other side to clarify facts.","This particular dispute involves Tanya Gersh suing Andrew Anglin who is the founder of the neo-Nazi website Daily Stormer. Sidebar: really uplifting material this week, isn’t it? Back to the case. Gersh asserts “state law claims against Anglin for invasion of privacy, intentional infliction of emotional distress, violations of Montana’s Anti-Intimidation Act, and punitive damages.” After some pre-discovery back and forth between the parties about whether the lawsuit was proper the court on May 24, 2018, issued an order terminating the discovery stay thus allowing the parties to file interrogatories and requests for production.","This order is based on a motion to compel filed by Gersh to force Anglin to respond to some interrogatories. One of those interrogatories is quoted below:","Interrogatory 10: List all bank and\/or crypto-currency accounts by account number, account holder, bank name, and bank location, used by you or for which you had access at any time between 2013 and the present. This includes, but is not limited to, any and all Bitcoin, Monero, or other crypto-currency accounts you have used or for which you had access at any time between 2013 and the present.","Wow, any and all Bitcoin and Monero, or other cryptos. This type of request is becoming more and more common. Anglin objected to that interrogatory saying “it is irrelevant, disproportionate to the needs of the case, vague, overbroad, and unduly burdensome.” He also objected to “pre-judgment asset discovery as irrelevant.” The judge disagrees.","Under Montana state law it is proper to allow pre-judgment asset discovery “where a claim for punitive damages is made,” and so the law “permits consideration of a defendant’s net worth in assessing an appropriate amount of a punitive damage award, if any.” Because Gersh alleges Anglin acted maliciously and Gersh is seeking punitive damages the judge is going to grant the motion to compel Anglin to more fully respond to this interrogatory.","Anglin had previously responded to the interrogatory by providing one cryptocurrency wallet, but nothing else with respect to his other financial information. Now he is going to have to provide “a current financial statement allowing for preliminary evaluation of his net worth, as well as the name and location of any institution where he has maintained an account between January 1, 2016 and the present.” The plaintiff is obviously pleased with this, and as was alluded to above the request for crypto holdings is probably going to be common place in lawsuits sooner rather than later.","<em data-v-f87c67ca=\"\">The Block is delighted to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part II of this week's analysis,&nbsp;Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"January 18, 2019","content":"DATE"},{"type":"Tanya Gersh","content":"PERSON"},{"type":"Stormer","content":"PERSON"},{"type":"Gersh","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Anglin","content":"PERSON"},{"type":"2013","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"Nelson Rosario [","content":"PERSON"},{"type":"Andrew Anglin","content":"PERSON"},{"type":"January 1, 2016","content":"DATE"},{"type":"May 24, 2018","content":"DATE"},{"type":"Gersh v. Anglin","content":"PERSON"},{"type":"Montana","content":"LOCATION"},{"type":"Monero","content":"LOCATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"Mont","content":"LOCATION"},{"type":"Palley","content":"PERSON"},{"type":"Stephen Palley","content":"PERSON"},{"type":"DLC","content":"ORGANIZATION"},{"type":"Rosario","content":"PERSON"}],"hashtag":[],"authors":["Contributor Network","The Block"]}