{"summary":"UK fintech Wirex has today launched its services in the US, almost one year after its original April 2021 launch. \nThe fintech allows its users to buy, hold and exchange fiat currencies and crypto in an account linked to a debit card. ","author":["Tom Matsuda","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/133194\/wirex-launch","publishDate":"2022-02-07T09:00:25","id":3263,"type":null,"title":"Crypto fintech Wirex launches in the US, almost a year later than planned","category":["Fintech"],"content":["<span data-v-f87c67ca=\"\">UK fintech Wirex has today launched its services in the US, almost one year after its original launch date of&nbsp;<\/span><a href=\"https:\/\/www.prnewswire.com\/news-releases\/wirex-partners-with-zero-hash-ahead-of-us-launch-301230749.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">April 2021<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">Wirex CEO Pavel Matveev says it currently has 300,000 US customers on its waiting list. In the US, the company sees Coinbase as a key competitor and believes it can compete with the exchange by offering zero exchange rates.<\/span>","<span data-v-f87c67ca=\"\">Wirex allows its users to buy, hold and exchange fiat currencies — such as US dollars and cryptocurrencies such as bitcoin and ether — in an account linked to a debit card.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Spearheaded by its US CEO Harold Montgomery, the company has partnered with Zero Hash to get local permissions to hold cryptocurrencies, and the Ohio-based Sutton Bank in order to issue its debit card in the country. &nbsp;<\/span>","<span data-v-f87c67ca=\"\">Last year, one month before announcing its April US launch, the company temporarily paused UK sign-ups following <\/span><a href=\"https:\/\/cointelegraph.com\/news\/wirex-halts-uk-signups-after-consultation-with-financial-regulator\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">discussions with the UK's Financial Conduct Authority (FCA)<\/span><\/a><span data-v-f87c67ca=\"\"> regarding anti-money laundering (AML) compliance. This followed a <\/span><a href=\"https:\/\/www.fintechfutures.com\/2021\/02\/exclusive-wirex-users-hit-by-unexplained-account-restrictions-and-disappearing-funds\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Fintech Futures report<\/span><\/a><span data-v-f87c67ca=\"\"> that customers were being locked out of their accounts without explanation.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We voluntarily took restrictions after our conversation with the FCA,” says Matveev. “We’re progressing well, we resumed our services for existing customers. And we're planning to resume onboarding of new customers relatively soon, but it takes time with the regulators.”<\/span>","<span data-v-f87c67ca=\"\">Matveev says that the talks with the FCA are “unrelated” to the delayed launch. He pointed instead to the company having committed resources to its APAC launch, coupled with time constraints related to integrating with local partners in the US.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Currently, the fintech firm is registered with the FCA on a temporary basis as a cryptoasset firm following a January 2020 announcement that the authority would become the AML supervisor for companies in the digital asset space. It’s on track to meet the end of March deadline to register with the FCA on a permanent basis, says Matveev.&nbsp;&nbsp;<\/span>"],"hashtag":["FINTECH"]}