{"summary":"A third of Robinhood users who invested in spot bitcoin ETFs sold part of their existing portfolio to do so.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273417\/blackrock-takes-lead-on-robinhood-among-spot-bitcoin-etfs","publishDate":"2024-01-18T13:06:06","id":3264,"type":null,"title":"BlackRock takes lead on Robinhood among spot bitcoin ETFs","category":["FUNDS"],"content":["<span data-v-f87c67ca=\"\">BlackRock's spot bitcoin ETF has ranked as the most popular of the 11 new funds available on Robinhood in terms of volume, the company's chief brokerage officer Steve Quirk told The Block.<\/span>","<span data-v-f87c67ca=\"\">\"The BlackRock one has been the one that's seen the most volume from our standpoint with Grayscale right behind it,\" he said in an interview.<\/span>","<span data-v-f87c67ca=\"\">\"It’s basically our customers saying 'We want a low-cost avenue to have this be a component of our portfolio,'\" he continued, adding that \"Grayscale is a sale and it continues to be sale whereas the other ones continue to be largely buys.\"<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Among Robinhood users who recently chose to buy spot bitcoin ETFs, a third of those customers did so after selling a portion of their existing portfolio, Quirk said.<\/span>","<span data-v-f87c67ca=\"\">\"Of all the people that participated in trading these 11 [spot bitcoin ETFs], 33% of the people sold a portion of their portfolio — so they sold some equity — and then they bought these [ETFs]. So they basically made this a component of their portfolio.\"<\/span>","<span data-v-f87c67ca=\"\">While BlackRock’s new ETF is generating more volume on Robinhood, in the broader market, Grayscale has seen the most activity among spot bitcoin exchange-traded funds currently trading. A large portion of Grayscale’s volume has been <a href=\"https:\/\/www.theblock.co\/post\/272945\/grayscale-blackrock-and-fidelity-dominate-spot-etf-market-with-nearly-90-of-volume-on-third-day-of-trading\" data-v-f87c67ca=\"\">generated by outflows<\/a>, according to Bloomberg Intelligence.<\/span>","<span data-v-f87c67ca=\"\">The firm’s spot bitcoin ETF is a conversion of its flagship GBTC fund and charges a higher fee than some of its competitors. It's also much larger in terms of assets under management, and investors who had wanted to sell before the ETF conversion faced a hefty discount.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Grayscale didn't immediately respond to a request for comment.<\/span>","<span data-v-f87c67ca=\"\">So far, <a href=\"https:\/\/www.theblock.co\/post\/273147\/cumulative-spot-bitcoin-etf-volume-crosses-10-billion-on-fourth-day-of-trading\" data-v-f87c67ca=\"\">more than 90%<\/a> of all spot bitcoin ETF trading is going through the top three funds by volume, which are offered by Grayscale, BlackRock and Fidelity. Into their fifth day of trading, the cumulative trading total of all spot bitcoin ETFs was $12.7 billion as of 12:47 p.m. ET.<\/span>","<span data-v-f87c67ca=\"\">Quirk, who is bullish about spot bitcoin ETFs, said he is pleased with how popular the new bitcoin-based instruments have been among Robinhood users.<\/span>","<span data-v-f87c67ca=\"\">\"If we look at the overall volume in our world, these [ETFs] have worked their way up to the top 20\" most popular investments on the platform,\" he said.<\/span>","<span data-v-f87c67ca=\"\">Last week, Robinhood <a href=\"https:\/\/www.theblock.co\/post\/272177\/robinhood-lists-all-11-spot-bitcoin-etfs\" data-v-f87c67ca=\"\">announced<\/a> it would list all 11 spot bitcoin ETFs on its trading platform.<\/span>","<span data-v-f87c67ca=\"\">\"We believe crypto is the financial framework of the future and that increased access to bitcoin <\/span><span data-v-f87c67ca=\"\">via ETFs is a good thing for the industry,\" Johann Kerbrat, general manager of Robinhood Crypto, said at the time.<\/span>","<span data-v-f87c67ca=\"\">Robinhood currently has 23 million users. <\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Robinhood Crypto","content":"ORGANIZATION"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"33%","content":"PERCENT"},{"type":"$12.7 billion","content":"MONEY"},{"type":"12:47 p.m. ET","content":"TIME"},{"type":"Quirk","content":"ORGANIZATION"},{"type":"Bloomberg Intelligence","content":"ORGANIZATION"},{"type":"Steve Quirk","content":"PERSON"},{"type":"Johann Kerbrat","content":"PERSON"}],"hashtag":[],"authors":["RT Watson","The Block"]}