{"summary":"Switzerland’s primary stock exchange SIX has listed an incoming-generating crypto exchange-traded product (ETP)\nThe ETP, tied to tezos (XTZ) tokens, is issued by fintech firm Amun AG \nCoinbase Custody will custody and stake the underlying tezos tokens of the ETP ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/47081\/swiss-stock-exchange-six-lists-first-income-generating-crypto-product-tied-to-tezos-token","publishDate":"2019-11-14T01:35:29","id":3267,"type":null,"title":"Swiss stock exchange SIX lists first income-generating crypto product, tied to tezos token","category":["Exchanges"],"content":["Switzerland’s primary stock exchange SIX has listed an income-generating exchange-traded product (ETP) based on tezos (XTZ) token.","The ETP, with the ticker symbol AXTZ, is being issued by fintech firm Amun AG, according to an announcement Thursday. Amun said it is the first such product, which will allow investors to earn a passive income via transactions that are validated on the Tezos blockchain. The firm will <a href=\"https:\/\/www.six-group.com\/exchanges\/exchange_traded_products\/trading\/newlistings\/2019\/details_en.html?id=CH0491507486USD4\" data-v-f87c67ca=\"\">charge<\/a> an annual management fee of 2.5%.","“Investors will be able to buy a stock for as low as $20 and we bake\/stake on their behalf and return it to them as a dividend without them required to do any staking on their own,” Hany Rashwan, co-founder and CEO of Amun, told The Block. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe underlying tezos tokens of the ETP are custodied with and staked by Coinbase Custody, per the announcement. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe product is available for both retail and institutional investors, who can participate in the rewards for contributing to the security and stability of the Tezos blockchain, \"without the need to ever have to set up a crypto wallet or taking care of a private key,\" said Rashwan.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nWith today’s launch, Amun AG now has a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/41884\/swiss-six-exchange-lists-bitcoin-and-ether-exchange-traded-product\" data-v-f87c67ca=\"\">total of nine<\/a> cryptocurrency ETP products <a href=\"https:\/\/www.six-group.com\/exchanges\/exchange_traded_products\/trading\/newlistings\/\" data-v-f87c67ca=\"\">listed<\/a> on the SIX exchange, including an XRP-based ETP, a BTC-based ETP, a bitcoin cash (BCH)-based ETP and an ETH-based ETP, among others.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">ETPs also on Borse Stuttgart&nbsp;<\/strong><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAmun AG has today also launched seven of its ETP products on Germany's Boerse Stuttgart stock exchange, denominated in euros. Previously investors only had access to these ETPs in US dollars and Swiss francs.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"For the first time, European investors have access to an institutional-grade, low-cost, exchange-traded investment vehicle in Euros tracking a basket of crypto currencies and other single issuances,\" said Laurent Kssis, managing director of Amun AG.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nWith the listing of these ETPs on Boerse Stuttgart, Amun AG now has a total of 25 products in three currencies (CHF, EUR, USD) and in two countries (Germany, Switzerland), across three stock exchanges (<a href=\"https:\/\/www.boerse-stuttgart.de\/en\/products\/etps\/etns\/stuttgart\/a2t64e-amun-bitcoin-crypto-single-tracker\" data-v-f87c67ca=\"\">Borse Stuttgart<\/a>,<a href=\"https:\/\/www.six-group.com\/exchanges\/exchange_traded_products\/trading\/newlistings\/\" data-v-f87c67ca=\"\"> SIX<\/a>, <a href=\"https:\/\/www.bxswiss.com\/instruments\/CH0496454155\" data-v-f87c67ca=\"\">BX Swiss Exchange<\/a>), Rashwan told The Block, adding:","“We now have 25 total ETPs, making Amun far and away the largest issuer of crypto ETPs. At this point, 75% of all crypto ETPs have been issued by our firm.” Other such players include CoinShares' <a href=\"https:\/\/xbtprovider.com\/products\" data-v-f87c67ca=\"\">XBT Provider<\/a> and Digital Currency Group’s <a href=\"https:\/\/grayscale.co\/\" data-v-f87c67ca=\"\">Grayscale<\/a>.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nGrayscale saw its inflows up by 200% in Q3 at $254.9 million. A market observer <a href=\"https:\/\/www.theblockcrypto.com\/daily\/43598\/grayscale-sees-inflows-up-by-200-in-q3-but-where-are-its-competitors\" data-v-f87c67ca=\"\">recently told The Block<\/a> that Grayscale's availability on the public market holds strong appeal to both institutional and retail investors and some of Grayscale's offerings are traded at very high premiums on the secondary market."],"hashtag":[]}