{"summary":"Smart contract protocol Flare has raised $11.3 million in a funding round let by Hong Kong-based blockchain firm Kenetic Capital. \nThe protocol issues tokenized versions of other cryptocurrencies, which can then be used in smart contracts.","author":["Saniya More","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/107564\/smart-contract-platform-flare-raises-11-3-million-in-a-funding-round","publishDate":"2021-06-08T09:30:29","id":3268,"type":null,"title":"Smart contract platform Flare raises $11.3 million in a funding round","category":["DeFi"],"content":["<span data-v-f87c67ca=\"\">Decentralized smart contract platform Flare has raised $11.3 million in a funding round, the company announced Tuesday.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Hong Kong-based blockchain firm <a href=\"https:\/\/www.theblockresearch.com\/mapping-out-kenetic-capitals-portfolio-92144\" data-v-f87c67ca=\"\">Kenetic Capital<\/a> led the funding round, which included participation from <a href=\"https:\/\/www.theblockcrypto.com\/linked\/103623\/dcg-grayscale-bitcoin-trust-shares-500-million\" data-v-f87c67ca=\"\">Digital Currency Group<\/a>, <a href=\"https:\/\/www.theblockresearch.com\/mapping-out-coinfunds-portfolio-86724\" data-v-f87c67ca=\"\">Coinfund<\/a> and LD Capital.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Jehan Chu, managing partner of Kenetic, the protocol will provide smart contract functionality to tokens like dogecoin and XRP, making it possible for users to activate their assets “across DeFi, NFT's, and a universe of utility.”<\/span>","<span data-v-f87c67ca=\"\">To do this, Flare issues tokenized versions of other cryptocurrencies. This is a process known as wrapping, where the original coins are locked up and the equivalent amount of tokens are issued. The tokens on Flare can then be used in smart contracts. Once finished with, the tokens can be destroyed and the original ones unlocked.<\/span>","<span data-v-f87c67ca=\"\">Flare co-founder and CEO Hugo Philion highlighted the platform’s ability to “link a vast number of chains and ecosystems that have previously been underutilized all on a highly scalable smart contract platform.”<\/span>","<span data-v-f87c67ca=\"\">The platform currently supports XRP, Stellar (XLM), Litecoin (LTC), and Dogecoin (DOGE).&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Flare is a smart contract platform that has integrated the Ethereum Virtual Machine (EVM). This is the core of the Ethereum blockchain that allows for the creation of decentralized applications. Integrating it means Ethereum-based applications can easily be deployed on Flare.<\/span>","<span data-v-f87c67ca=\"\">The Flare team claims it can handle more transactions per second than Ethereum. The platform’s consensus mechanism — what keeps it in sync — is based on the Federated Byzantine Agreement (FBA), a system that is used for its network scalability and low transaction costs.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A platform that uses the FBA is essentially utilizing a type of network where each node chooses other nodes it trusts. The network only needs to exchange information with a small number of nodes in order to reach a consensus. Popular payment protocols that use FBA include Stellar and XRP.&nbsp;<\/span>"],"hashtag":["XRP"]}