{"summary":"Nigeria&#x27;s government filed tax evasion charges against crypto exchange Binance amid reports one of its executives has escaped from custody.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284393\/nigeria-tax-evasion-charges-binance-exec-escapes-custody","publishDate":"2024-03-25T06:16:47","id":3268,"type":null,"title":"Nigeria files tax evasion charges against Binance, exec escapes custody: reports","category":["LEGAL"],"content":["Nigeria’s federal government filed charges against crypto exchange Binance for tax evasion at the country’s High Court on Monday, local newspaper Punch <a href=\"https:\/\/punchng.com\/fg-files-tax-evasion-charges-against-binance\/\" data-v-f87c67ca=\"\">reported<\/a>.","Nigeria’s Federal Inland Revenue Service, the country’s tax agency, accuses Binance of four tax evasion charges in the filing: the non-payment of value-added tax, the non-payment of company income tax, failure to file tax returns and complicity in aiding customers to evade taxes through its platform.","The lawsuit also alleges Binance failed to register with FIRS for tax purposes and contravened existing tax regulations within the country.","Two senior Binance executives recently detained in Nigeria — Tigran Gambaryan and Nadeem Anjarwalla — were also named defendants in the suit.","Gambaryan, a U.S. citizen overseeing financial crime compliance at the crypto exchange, and Anjarwalla, Binance’s Africa regional manager, were <a href=\"https:\/\/www.theblock.co\/post\/281904\/binance-executives-detained-in-nigeria\" data-v-f87c67ca=\"\">detained<\/a> following their arrival in Nigeria’s capital city, Abuja, on Feb. 26, amid accusations of Binance making illegal-transaction profits locally. Criminal charges were filed against them on Feb. 28.","“While it is inappropriate for us to comment on the substance of the claims at this time, we can say that we are working collaboratively with Nigerian authorities to bring Nadeem and Tigran back home safely to their families,” a Binance spokesperson told The Block at the time.&nbsp;","However, one of the executives, Anjarwalla, escaped the custody of the Economic and Financial Crimes Commission on Friday, Nigeria’s Premium Times <a href=\"https:\/\/www.premiumtimesng.com\/news\/top-news\/680511-exclusive-detained-binance-executive-escapes-from-custody-in-nigeria.html\" data-v-f87c67ca=\"\">reported<\/a>. Anjarwalla was being held at a guest house with colleague Gambaryan but reportedly escaped after guards had escorted him to a nearby mosque for Friday prayers.","Anjarwalla is a British national who also holds a Kenyan passport and is thought to have fled the country via a Middle East airline. Anjarwalla boarded the international flight despite his British passport being confiscated by the Nigerian authorities. However, an immigration official reportedly said he used his Kenyan passport instead.","\"We were made aware that Nadeem is no longer in Nigerian custody,\" a Binance spokesperson told The Block. \"Our primary focus remains on the safety of our employees and we are working collaboratively with Nigerian authorities to quickly resolve this issue.\"","Nigerian authorities are now investigating how he obtained the passport, as it was not on his person at the time of arrest, and his intended destination to try and bring him back into custody.","Earlier this month, Binance <a href=\"https:\/\/www.theblock.co\/post\/280577\/binance-nigeria-naira-support\" data-v-f87c67ca=\"\">cut support<\/a> for the Nigerian naira on its platform amid numerous reports of its conflicts with the Nigerian regulators and requests for information on its <a href=\"https:\/\/www.theblock.co\/post\/282164\/nigeria-binance-user-data\" data-v-f87c67ca=\"\">top 100 users<\/a> in the country.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Middle East","content":"LOCATION"},{"type":"Economic and Financial Crimes Commission","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"FIRS","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Nigerian naira","content":"ORGANIZATION"},{"type":"Abuja","content":"LOCATION"},{"type":"Feb. 26","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Feb. 28","content":"DATE"},{"type":"Anjarwalla","content":"LOCATION"},{"type":"’s High Court","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Nadeem","content":"PERSON"},{"type":"Nadeem Anjarwalla","content":"PERSON"},{"type":"Nigeria","content":"LOCATION"},{"type":"Nigeria’s Federal Inland Revenue Service","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Africa","content":"LOCATION"},{"type":"Nadeem","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BINANCE","LAWSUITS"],"authors":["James Hunt","The Block"]}