{"summary":"The eBTC token is designed to enable users to get paid to borrow synthetic bitcoin without any upfront fees or interest.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284700\/badgerdao-lido-steth-backed-synthetic-bitcoin-ebtc","publishDate":"2024-03-26T09:00:03","id":3269,"type":null,"title":"BadgerDAO launches stETH-backed synthetic bitcoin, rewarding users for taking out loans","category":["DEFI"],"content":["<span data-v-f87c67ca=\"\">BadgerDAO, a decentralized autonomous organization focused on bringing bitcoin into DeFi, has launched eBTC — a <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248354\/lido-staked-ether-steth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/steth_logo.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">stETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.24%\n    <\/span><\/a> <!----><\/span>-backed, bitcoin-pegged token in collaboration with liquid staking platform Lido.<\/span>","The launch enables users to take out no-fee, reward-bearing bitcoin loans, designed to provide a more capital-efficient way to borrow bitcoin, according to a statement.","The experimental eBTC token is backed by staked ether (stETH). Rather than locking up assets through traditional staking, Lido’s liquid staking protocol allows users to earn staking rewards on the underlying asset — in this case, ether — while unlocking utility and liquidity for it across various DeFi applications in the form of a liquid staking derivative token — in this case, stETH.","<span data-v-f87c67ca=\"\">\"After 18 months of rigorous development, we are excited to launch eBTC, a truly unique DeFi primitive that makes it easy for anyone to borrow bitcoin with absolute transparency,” BadgerDAO founder Chris Spadafora, also known as Spadaboom, said. “Finally, we can bring the power of Ethereum staking to <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +1.07%\n    <\/span><\/a> <!----><\/span><\/span>.”<\/span>","Lido’s Liquidity Observation Lab will provide 15 stETH ($55,000) in additional rewards for early adopters as part of the collaboration, distributed via an airdrop at the end of a one-month incentive period.","BadgerDAO claims to have generated $3.5 billion in lifetime bitcoin deposits. The DeFi protocol currently has a total value locked of $23.4 million, down significantly from a peak of $2.3 billion in February 2021, according to DefiLlama <a href=\"https:\/\/defillama.com\/protocol\/badger-dao?tokenVolume=false&amp;tvl=true\" data-v-f87c67ca=\"\">data<\/a>.","Lido, Ethereum’s largest liquid staking solution, has a current TVL of <a href=\"https:\/\/defillama.com\/protocol\/lido\" data-v-f87c67ca=\"\">$35.1 billion<\/a>, per DefiLlama, with the market capitalization of stETH ranking among the top ten cryptocurrencies.","\"The eBTC protocol introduces an exceptional new use case for Lido Staked ETH, leveraging the power of staking rewards to provide a more capital-efficient borrowing option for bitcoin on Ethereum,” Lido’s DeFiYaco said.","Users can deposit ether in various forms to borrow over-collateralized eBTC without incurring initiation fees, repayment fees or interest charges typical in DeFi lending protocols. The eBTC protocol then stakes the ether with Lido as stETH, allowing users to earn on their collateral instead of paying fees to borrow.","The protocol generates revenue by taking a percentage of accrued staking yield from the total system collateral, known as the \"protocol yield share.\"","BadgerDAO unveiled a \"purple paper\" for the <a href=\"https:\/\/www.theblock.co\/post\/241431\/badgerdao-purple-paper-ebtc-steth\" data-v-f87c67ca=\"\">eBTC Protocol<\/a> in July 2023, designed to be a trustless synthetic version of bitcoin in DeFi, adopting a minimized governance mechanism.","The approach ensures the protocol remains non-custodial and censorship-resistant while retaining some flexibility to alter parameters related to fee competitiveness, peg stability, risk management and economic and technical security to adapt to market developments, the team said at the time.","This contrasts with popular wrapped bitcoin tokens like wBTC, which rely on custodial services to manage the bitcoin backing the token, and eliminates the requirement to use cross-chain bridges — which remain one of the most prominent attack vectors in DeFi.","To ensure the system's solvency, eBTC employs a liquidation mechanism — meaning that if the collateral ratio of a collateralized debt position falls below a minimum of 110%, the debt position becomes eligible for liquidation. “The outstanding debt can be repaid by any market participant in exchange for some surplus collateral and the gas stipend as an incentive,” the team said last year.","In cases where a debt position is not liquidated despite its collateral ratio dropping below 103%, the protocol considers this under-collateralized and implements debt redistribution. Liquidators can receive the outstanding collateral at a 3% fixed discount, and any outstanding debt gets redistributed among active collateralized debt positions.","In December 2021, BadgerDAO was exploited for <a href=\"https:\/\/www.theblock.co\/post\/126072\/defi-protocol-badgerdao-exploited-for-120-million-in-front-end-attack\" data-v-f87c67ca=\"\">$120 million<\/a> in a front-end attack. The incident had a knock-on effect for the crypto industry, with troubled crypto lender Celsius Network among those who <a href=\"https:\/\/www.theblock.co\/linked\/126286\/celsius-network-confirms-it-lost-money-in-the-badgerdao-defi-hack\" data-v-f87c67ca=\"\">lost money<\/a> in the hack.","In the aftermath of this attack, BadgerDAO said it approached the eBTC launch with a renewed focus on “top-tier” security, including engaging with RiskDAO for economic risk assessments, Spearbit for smart contract audits, Cod4rena for a crowdsourced audit and Immunefi for a pre-launch bug bounty.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"+1.07%","content":"PERCENT"},{"type":"Chris Spadafora","content":"PERSON"},{"type":"$2.3 billion","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"3%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"103%","content":"PERCENT"},{"type":"Lido’s DeFiYaco","content":"PERSON"},{"type":"Spadaboom","content":"LOCATION"},{"type":"$23.4 million","content":"MONEY"},{"type":"110%","content":"PERCENT"},{"type":"December 2021","content":"DATE"},{"type":"+0.24%","content":"PERCENT"},{"type":"Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"February 2021","content":"DATE"},{"type":"$120 million","content":"MONEY"},{"type":"$35.1 billion","content":"MONEY"},{"type":"$55,000","content":"MONEY"},{"type":"$3.5 billion","content":"MONEY"},{"type":"July 2023","content":"DATE"}],"hashtag":["BITCOIN","ETHEREUM","LIDO FINANCE","STAKING","TOKENS"],"authors":["James Hunt","The Block"]}