{"summary":"Binance has taken an equity stake in crypto derivatives platform FTX\nSam Bankman-Fried, founder and CEO of FTX, told The Block that the deal involves “tens of millions”\nThis is Binance’s second investment in crypto derivatives platform as it acquired JEX in September ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/51206\/binance-invests-tens-of-millions-in-alameda-research-backed-crypto-derivatives-platform-ftx","publishDate":"2019-12-20T01:45:04","id":3270,"type":null,"title":"Binance invests &#x27;tens of millions&#x27; in crypto derivatives platform FTX","category":["Exchanges"],"content":["Cryptocurrency exchange Binance has doubled down its efforts to grow market share in the derivatives space.","The exchange has <a href=\"https:\/\/www.binance.com\/en\/blog\/414610870200725504\/Binance-Announces-Strategic-Investment-in-Cryptocurrency-Derivatives-Exchange-FTX\" data-v-f87c67ca=\"\">acquired<\/a> an equity stake in Alameda Research-backed crypto derivatives platform FTX. While the investment amount was not disclosed by Binance, Sam Bankman-Fried, founder and CEO of FTX, told The Block that it is in the “tens of millions.”","The news follows Binance’s recent <a href=\"https:\/\/www.theblockcrypto.com\/post\/38204\/binance-acquires-cryptocurrency-trading-platform\" data-v-f87c67ca=\"\">acquisition<\/a> of little-known derivatives platform JEX in September, which was renamed to Binance JEX. FTX, on the other hand, will continue to operate as an independent entity.","“The investment will help accelerate the growth of FTX with support and strategic advisory from Binance while FTX maintains its independent operations,” said Bankman-Fried, who is also the CEO of Alameda Research, a cryptocurrency liquidity provider.","FTX <a href=\"https:\/\/help.ftx.com\/hc\/en-us\/articles\/360038115631-Strategic-Partnership-with-Binance\" data-v-f87c67ca=\"\">said<\/a> Binance is the first and the only outside investor in the platform.","As part of the deal, both the firms plan to build better crypto trading products and platforms. Specifically, Binance will help FTX grow “faster and larger,” while FTX will help Binance build out liquidity and institutional products across its main exchange as well as over-the-counter (OTC) trading desk.","Binance has also taken a long-term position in the FTX’s native token, FTT, in addition to the equity investment.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“The FTX team has built an innovative crypto trading platform with stunning growth. With their backgrounds as professional traders, we see quite a bit ourselves in the FTX team and believe in their potential in becoming a major player in the crypto derivatives markets.“ said Changpeng \"CZ\" Zhao, CEO of Binance.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">Derivatives market heating up&nbsp;<\/strong>","FTX was launched in May of this year and claims to have reached $500 million in trading volume per day. But its market share is still meager, as the derivatives space is currently dominated by BitMEX, Huobi and OKEx, according to <a href=\"https:\/\/skew.com\/dashboard\/bitcoin-futures\" data-v-f87c67ca=\"\">data<\/a> from Skew, compiled by The Block.","","\"One of the interesting aspects of derivatives is often their notional value can outpace spot. The proliferation is going to continue,” Paul Chou, co-founder of LedgerX, <a href=\"https:\/\/www.theblockcrypto.com\/daily\/12340\/the-derivatives-market-is-heating-up-in-crypto-and-binance-might-be-the-next-firm-to-jump-in\" data-v-f87c67ca=\"\">told The Block<\/a> recently, adding: “Every new derivative contract is a new revenue line.\""],"hashtag":["BINANCE","DERIVATIVES","FTX"]}