{"summary":"Blockchain analytics firm Elliptic has raised a $23 million Series B; the round was led by Japan’s SBI Holdings\nElliptic is looking to expand into Japan and Singapore with the new capital \nDr. James Smith, co-founder and CEO of Elliptic, told The Block that the funding gives the firm “an excellent foundation for the next growth stage” ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/38327\/blockchain-analytics-firm-elliptic-raises-23m-series-b-to-fund-asia-expansion","publishDate":"2019-09-03T23:00:03","id":3273,"type":null,"title":"Blockchain analytics firm Elliptic raises $23M Series B to fund Asia expansion","category":["Investments"],"content":["Elliptic, a blockchain analytics firm that helps cryptocurrency companies and financial institutions manage money laundering risk, has raised $23 million in Series B funding.","The round is led by Japanese financial services giant SBI Holdings, with participation from venture firm AlbionVC and existing investors SignalFire, Octopus Ventures and Santander Innoventures.","UK-based Elliptic said it will utilize the new capital to expand into Asia, by opening new offices in Japan and Singapore. The firm chose the two countries over other Asian countries because of its “vibrant” cryptocurrency ecosystem and “clear” regulatory framework, Dr. James Smith, co-founder and CEO of Elliptic, told The Block. The new offices will serve as a base to serve clients throughout the Asia-Pacific region, Smith added.","Elliptic said its revenues from Asia-based clients have increased 11x over the past two years. When asked for specific figures, Smith declined to disclose them. He also did not comment on the firm's current valuation or total funding to date.","According to Crunchbase, Elliptic has<a href=\"https:\/\/www.crunchbase.com\/organization\/elliptic\" data-v-f87c67ca=\"\"> raised<\/a> $12 million to date. So today's Series B brings the total funding to $35 million. Back in 2016, Elliptic raised $5 million in a&nbsp;<a href=\"https:\/\/www.elliptic.co\/press-releases\/blockchain-analytics-elliptic-raises-5-million-funding\" data-v-f87c67ca=\"\">Series A<\/a> round to support its expansion plans at the time.","With the Series B, Elliptic also plans to further develop its solutions to support new cryptocurrencies such as <a href=\"https:\/\/www.theblockcrypto.com\/2019\/06\/18\/facebook-libra-cryptocurrency-calibra-launch\/\" data-v-f87c67ca=\"\">Facebook’s Libra<\/a>&nbsp;and central bank digital currencies (<a href=\"https:\/\/www.theblockcrypto.com\/tag\/cbdc\/\" data-v-f87c67ca=\"\">CBDCs<\/a>). “We believe that corporations and governments will increasingly seek to issue their own crypto-assets, and we will look to support them on our platform,\" Smith told The Block.","Elliptic hit the scene in 2013 with an aim to stop illicit cryptocurrency activities. It built anti-money laundering (AML) compliance software and started offering forensic and investigative services to detect and prevent cryptocurrency-enabled crimes.","Elliptic said that today over 100 cryptocurrency businesses and financial institutions globally use its solutions to screen “billions of dollars” in transactions every day and to analyze them for links to illicit activities such as money laundering, terrorist financing and sanctions evasion.","Yoshitaka Kitao, representative director president and CEO of SBI Holdings, said: “We are seeing a growing demand for [Elliptic’s] services across our portfolio of crypto-assets related companies.” With SBI as a lead investor, Elliptic will be able to “double down” on its mission to “enable the crypto industry to grow and take shape,\" said Smith.","Elliptic has also doubled the size of its team this year, mainly in its London and New York offices, Smith told The Block, adding: “We will continue to expand these teams in key areas such as customer success, product and marketing, as well as expanding our presence in Japan and Singapore.”","Smith further said that the firm does not plan to raise any more funds in the near future as the latest round gives it “an excellent foundation for the next growth stage” and provides what it needs to meet its overall goals."],"hashtag":[]}