{"summary":"The Bank of England and HM Treasury have jointly created a CBDC taskforce.\nThey will explore a potential digital currency in the U.K.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/102109\/bank-of-england-hm-treasury-new-taskforce-cbdc-digital-currency","publishDate":"2021-04-19T04:55:26","id":3274,"type":null,"title":"Bank of England, HM Treasury establish new taskforce to explore digital currency","category":["Central Banks"],"content":["<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The Bank of England and HM Treasury have jointly created a taskforce to explore a potential central bank digital currency (CBDC) in the U.K.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Announcing the news on Monday, the two government authorities&nbsp;<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.bankofengland.co.uk\/news\/2021\/april\/bank-of-england-statement-on-central-bank-digital-currency\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">said<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\"> they have not yet decided whether to issue a CBDC in the U.K. but will explore its use cases and risks.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">They will also evaluate the design features of a CBDC and monitor international CBDC developments to ensure the U.K. \"remains at the forefront of global innovation.\"<\/span>","\"Our vision is for a more open, greener, and more technologically advanced financial services sector,\" <a href=\"https:\/\/www.gov.uk\/government\/news\/ambitious-plans-to-boost-uk-fintech-and-financial-services-set-out-by-chancellor\" data-v-f87c67ca=\"\">said the country’s finance minister Rishi Sunak.<\/a> \"The steps I've outlined today, to boost growing fintechs, push the boundaries of digital finance and make our financial markets more efficient, will propel us forward.\"","As part of digitalizing financial services, firms exploring blockchain technology will also get access to a new sandbox to improve financial market infrastructure.","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">As for CBDC, if issued, it would exist alongside cash and banknotes rather than replacing them, said the two authorities.<\/span>","The taskforce will be co-chaired by Bank of England's deputy governor for financial stability Jon Cunliffe and HM Treasury's director general of financial services Katharine Braddick. The two agencies will also involve other U.K. authorities as appropriate, they said.","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The Bank of England appears to be all in on CBDC. It has also created a new CBDC unit, a CBDC engagement forum, and a CBDC technology forum. <\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The CBDC unit will lead the central bank's internal and external coordination around potential digital currency. The engagement forum will focus on non-technical aspects of a CBDC, such as its use cases, roles of public and private sectors in a CBDC system, and data and privacy implications. The technology forum, on the other hand, will focus on understanding the technological challenges of designing, implementing, and operating a CBDC.<\/span>","The new initiatives come a year after the Bank of England <a href=\"https:\/\/www.theblockcrypto.com\/post\/58530\/bank-of-england-issues-discussion-paper-on-central-bank-digital-currency\" data-v-f87c67ca=\"\">issued a discussion paper on digital currency<\/a>. At the time, the central bank said it is interested in CBDC because \"this is a period of significant change in money and payments.\"","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Last year, the Bank of England&nbsp;<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.theblockcrypto.com\/post\/53545\/uks-central-bank-to-explore-digital-currency\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">also created a group<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;with five other central banks – the Bank of Canada, the Bank of Japan, the European Central Bank, the Sveriges Riksbank of Sweden, and the Swiss National Bank to explore potential uses cases for CBDCs.<\/span>","Central banks around the world are exploring digital currencies, as <a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2020\/08\/The-Block-Research-CBDC-Report-From-Iteration-to-Implementation_v1.04.pdf\" data-v-f87c67ca=\"\">The Block's recent CBDC report<\/a> noted. The European Central Bank <a href=\"https:\/\/www.theblockcrypto.com\/post\/84404\/ecb-lagarde-hunch-digital-euro\" data-v-f87c67ca=\"\">also formed<\/a> a high-level taskforce on CBDC last year. The ECB, however, has not yet decided to issue digital euro. China’s <a href=\"https:\/\/www.theblockcrypto.com\/linked\/101072\/china-hainan-test-digital-yuan-currency-april\" data-v-f87c67ca=\"\">digital yuan<\/a>, on the other hand, is almost ready to launch."],"hashtag":[]}