{"summary":"Crypto companies including Alchemy, Blockdaemon and Nexo backed crypto security firm Hypernative in a $9 million seed round. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/206570\/hypernative-funding-round","publishDate":"2023-01-30T08:04:14","id":3277,"type":null,"title":"Crypto security startup Hypernative raises $9 million seed round","category":["DEALS"],"content":["Crypto companies such as Alchemy, Blockdaemon and Nexo backed crypto security firm Hypernative in a $9 million seed round.&nbsp;","The round, led by Boldstart Ventures and IBI Tech Fund, also saw participation from CMT Digital and Borderless, per a press release. The startup began raising funding after it was founded in March and closed the round around May, according to founder and CEO Gal Sagie in an interview.","Hypernative's platform monitors on and off-chain data after a protocol is deployed to a blockchain to predict any potential threat of an exploit in real-time. Through this, Sagie claims that the platform can detect symptoms of a potential hack to warn clients before it occurs.","\"I think the major thing we have unlocked is that there is no post-deployment monitoring and real-time prevention of hacks and exploits,\" said Sagie.&nbsp;","He explained that most security measurements currently in crypto are based around a manual audit process that doesn't cover changes in risk that could occur post-deployment.&nbsp;&nbsp;","After retrospectively analyzing the <a href=\"https:\/\/www.theblock.co\/post\/159308\/hacker-pockets-1-1-million-after-stealing-from-music-streaming-protocol-audius\" data-v-f87c67ca=\"\">recent hack<\/a> of web3 music streaming service Audius, Sagi says that its system would have given a warning 17 minutes before the attack. The frequency of crypto hacks accelerated rapidly last year, topping $3 billion in total funds lost, <a href=\"https:\/\/go.chainalysis.com\/2022-Crypto-Crime-Report.html\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">according to<\/a>&nbsp;a&nbsp;Chainalysis&nbsp;report.","\"Until now, there are no systems that not only accurately predict and alert on hacks before they happen but also provide actionable advice to stop them. The opportunity in front of Hypernative is massive as stopping zero-day attacks will go a long way towards rebuilding trust in the crypto ecosystem,” said founding partner Ed Sim at Boldstart Ventures in a statement announcing the funding round.&nbsp;","Sagie said that Hypernative is currently targeting crypto hedge funds along with blockchain networks and protocols themselves. It's already scooped up a few funds managing \"hundreds of millions of dollars\" as clients, he claimed.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$3 billion","content":"MONEY"},{"type":"CMT Digital","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Ed Sim","content":"PERSON"},{"type":"\"hundreds of millions of dollars","content":"MONEY"},{"type":"Blockdaemon","content":"PERSON"},{"type":"Boldstart Ventures","content":"ORGANIZATION"},{"type":"Gal Sagie","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"$9 million","content":"MONEY"},{"type":"Alchemy","content":"ORGANIZATION"},{"type":"Sagie","content":"PERSON"},{"type":"Hypernative","content":"PERSON"},{"type":"Sagi","content":"PERSON"}],"hashtag":["HACKS","SEED &AMP; PRE-SEED"],"authors":["Tom Matsuda","The Block"]}