{"summary":"Q2 reports from Bakkt’s majority shareholder ICE suggest the exchange paid $11 million for DACC, which it acquired in April\nIn total, ICE spent $352 million on mergers and acquisitions. Given ICE paid $322 million for Simplifie and Bakkt likely paid $19 million for RCG in Q1 19, that leaves an outstanding sum of $11 million","author":["Isabel Woodford","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/34533\/bakkt-may-have-acquired-dacc-for-11m","publishDate":"2019-08-02T13:00:57","id":3277,"type":null,"title":"Bakkt may have acquired DACC for $11M","category":["Exchanges"],"content":["Upcoming crypto exchange Bakkt likely paid $11 million for the April<a href=\"https:\/\/www.theblockcrypto.com\/2019\/04\/29\/bakkt-acquires-custodian-dacc-as-it-builds-out-its-own-solution-for-storing-cryptocurrencies\/\" data-v-f87c67ca=\"\"> acquisition of Digital Asset Custody Company (DACC)<\/a>, an analysis of its parent company ICE's Q2 financial filings suggest.&nbsp;","Bakkt and ICE declined to confirm the figure, but as ever, here are the essential clues.","On page 8 <a href=\"https:\/\/ir.theice.com\/~\/media\/Files\/I\/Ice-IR\/events-presentations\/2q19-form-10q.pdf\" data-v-f87c67ca=\"\">of its filings,<\/a> ICE notes the amount it paid in cash for acquisitions in the last six months was $352 million. ICE then explains on page 11 that it acquired <span lang=\"EN-US\" data-v-f87c67ca=\"\">Simplifie LC on June 12 for $338 million. That includes the $16 million in cash-assets held on Simplifie’s balance sheet, which belongs to ICE post-acquisition, meaning ICE paid net $322 million for Simplifie.<\/span>","On page 12, ICE then s<span lang=\"EN-US\" data-v-f87c67ca=\"\">tates Bakkt acquired two other companies during the 6-month period: (1) RCG and (2) DACC. As <a href=\"https:\/\/www.theblockcrypto.com\/2019\/05\/14\/bakkt-may-have-acquired-rcg-for-19-million\/\" data-v-f87c67ca=\"\">reported by The Block<\/a> in May, it is possible to deduce that Bakkt paid $19 million for its<a href=\"https:\/\/www.theblockcrypto.com\/2019\/04\/29\/bakkt-acquires-custodian-dacc-as-it-builds-out-its-own-solution-for-storing-cryptocurrencies\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"> first acquisition<\/a>, RCG. In brief, this is based on the fact the only purchase seemingly made in Q1 was of RCG, to which ICE's cash flow statement attributed the figure of $19 million. That figure was then confidently attributed to Bakkt rather than the ICE or its other subsidiary, NYSE, by process of elimination.<\/span>","<span lang=\"EN-US\" data-v-f87c67ca=\"\">Therefore, if ICE spent $352 million in total in acquisitions over the last 6 months, that leaves a delta of $11 million (assuming the $19 million paid for RCG is correct). This is likely to be the cash consideration paid for DACC.<\/span>","","<em data-v-f87c67ca=\"\">Captured from page 8 of ICE's <a href=\"https:\/\/ir.theice.com\/~\/media\/Files\/I\/Ice-IR\/events-presentations\/2q19-form-10q.pdf\" data-v-f87c67ca=\"\">most recent filings<\/a>. <\/em><em data-v-f87c67ca=\"\">Because Bakkt is controlled by ICE, Bakkt's investments sit on its books.<\/em>","Another hint about the price is during <a href=\"https:\/\/www.fool.com\/earnings\/call-transcripts\/2019\/05\/03\/intercontinental-exchange-inc-ice-q1-2019-earnings.aspx\" data-v-f87c67ca=\"\">ICE's Q1 earnings call<\/a> in May, Jeff Sprecher, ICE's CEO, said the crypto winter had helped make the purchase of DACC affordable.&nbsp;","\"[We] acquired a company earlier this week that wouldn't have been available to us had this market been really hot because valuations were really hot,\" he said.","Bakkt is building its own custody solution to store customers’ bitcoins. To comply with federal and state regulations, it is seeking a trust license from the New York Department of Financial Services for approval to serve as a Qualified Custodian for digital assets. Meanwhile, DACC provides custody solutions that help institutional investors safe-keep their crypto and digital assets. At the time, Bakkt said the acquisition of DACC, along with its team, would allow it to integrate DACC’s existing custody service with its own product and comply with regulatory requirements.&nbsp;","At the time of the RCG acquisition, sources said the $19 million price tag was rather high. Still, others pointed out that given <a href=\"https:\/\/www.theblockcrypto.com\/2019\/03\/21\/bakkt-raises-series-a-at-valuation-topping-700-million\/\" data-v-f87c67ca=\"\">Bakkt raised over $182.5 million<\/a>, \"they can afford a crazy overhead,\" and that acquisitions of this sort are central to its business model."],"hashtag":[]}