{"summary":" CoinShares is launching a new physically-backed bitcoin exchange-traded product (ETP).\nThe product will list on Switzerland’s SIX exchange today.\nA physically-backed ETP minimizes credit risk, CoinShares’ head of product Townsend Lansing told The Block.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/91628\/coinshares-physically-backed-bitcoin-btc-etp-bitc","publishDate":"2021-01-19T01:45:00","id":3278,"type":null,"title":"CoinShares is launching a physically-backed bitcoin ETP","category":["Bitcoin"],"content":["Crypto asset manager CoinShares is launching a new physically-backed bitcoin exchange-traded product (ETP).","The product, dubbed CoinShares Physical Bitcoin (BITC), will list on Switzerland's principal stock exchange SIX today. Each unit of BITC will be backed with 0.001 bitcoin.","ETPs are traded and settled like shares. They are passive investments that aim to mirror the performance of an underlying asset. Since CoinShares' BITC product is physically-backed, it will directly hold the underlying asset to secure obligations.","The firm's <a href=\"https:\/\/coinshares.com\/assets\/etps\/documents\/xbt-base-prospectus-2020-05-15.pdf\" data-v-f87c67ca=\"\">existing bitcoin products<\/a> are synthetically structured. \"It means they are not 100% physically backed,\" CoinShares' head of product Townsend Lansing told The Block. \"They hold at least 75% of the exposure in physical bitcoin, and the remaining 25% can be used to get bitcoin futures or cash for liquidity purposes.\" BITC, on the other hand, \"will always be 100% physical,\" said Lansing.","A physically-backed ETP minimizes credit risk, according to Lansing. While with a synthetic ETP, \"there's always some element of credit risk because you effectively have financial obligations.\"","Indeed, CoinShares' counterparty for existing bitcoin ETPs is GABI Trading, and hence it is exposed to credit risk. \"Any circumstance under which GABI Trading does not have sufficient capital or is otherwise unable to repay the Issuer could have an adverse effect on the Issuer's business and its financial position and subsequently its ability to repay its liabilities created by the Certificates,\" CoinShares <a href=\"https:\/\/coinshares.com\/assets\/etps\/documents\/xbt-base-prospectus-2020-05-15.pdf\" data-v-f87c67ca=\"\">says<\/a> on its website.","As for BITC, a CoinShares entity will directly hold physical bitcoins. That entity is Komainu — a joint venture between CoinShares, Ledger, and Nomura.","BITC will also have a lower expense ratio of 0.98% compared to CoinShares' existing bitcoin ETPs that charge 2%. Lansing said charges of the existing products won't be reduced now, given legal limitations. \"When we first launched a bitcoin ETP, there was really the only way to do a bitcoin ETP, i.e., a synthetic structure. We would now run both sets of products simultaneously, and investors can choose what they want.\"","Europe-based CoinShares currently manages about $3.5 billion worth of assets. Its U.S.-based rival Grayscale, on the other hand, has an AUM of more than $27 billion. When asked why bitcoin investment products are less popular in Europe, Lansing said, the U.S. is a much larger market anyway, \"so you would see a U.S. product by definition be larger than its European equivalent.\"","\"I spent years doing commodity products and work for a company that had for the longest time the largest gold products, gold ETPs in the European market, and they were four or five times smaller than the equivalent U.S. products. So that is always something to realize,\" said Lansing. \"The U.S. is a single, unified financial market, one of the largest, if not the largest in the world in terms of sophistication and access.\"","Nonetheless, crypto ETP providers in Europe are growing. Just last week, Germany-based ETC Group also <a href=\"https:\/\/www.six-group.com\/en\/newsroom\/media-releases\/2021\/20210113-six-welcomes-btc-etc-tm.html\" data-v-f87c67ca=\"\">listed<\/a> a physically-backed bitcoin ETP on SIX. The stock exchange now <a href=\"https:\/\/www.six-group.com\/en\/newsroom\/media-releases\/2021\/20210113-six-welcomes-btc-etc-tm.html\" data-v-f87c67ca=\"\">provides<\/a> a total of 35 crypto ETP products."],"hashtag":["BITCOIN"]}