{"summary":"ConsenSys and EY announced their working project, Baseline Protocol, joined by 12 other firms and organizations including Microsoft, AMD, ChainLink, and MakerDAO\nThe new protocol allows enterprise synchronize data with collaborators via the Ethereum blockchain without having to publicize all business records","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/57672\/consensys-and-ey-announces-new-enterprise-targeted-protocol-in-collaboration-with-microsoft","publishDate":"2020-03-04T10:05:27","id":3282,"type":null,"title":"ConsenSys and EY announce enterprise-targeted protocol that&#x27;s built on Ethereum and backed by Microsoft","category":["Layer 1s"],"content":["<span data-v-f87c67ca=\"\"><a href=\"https:\/\/www.theblockcrypto.com\/linked\/5647\/the-verge-consensys-could-be-laying-off-as-many-as-50-60-of-its-employees\" data-v-f87c67ca=\"\">ConsenSys<\/a> and EY have announced the formation of Baseline Protocol, a project aimed at enterprises. The project has garnered support from 12 other companies and organizations, including Microsoft, AMD, ChainLink, and MakerDAO.<\/span>","<span data-v-f87c67ca=\"\">The new protocol will allow enterprises to access decentralized finance (DeFi) services built on the Ethereum blockchain without having to publicize all their private information.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to John Wolpert, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/6486\/consensys-partners-with-chip-manufacturer-amd-to-develop-blockchain-infrastructure\" data-v-f87c67ca=\"\">ConsenSys’<\/a> group executive for enterprise mainnet, <\/span><span data-v-f87c67ca=\"\">businesses using internal record-keeping systems like ERP and CRM have <\/span><span data-v-f87c67ca=\"\">a hard time synchronizing their data with counterparts. <\/span><span data-v-f87c67ca=\"\">While blockchain provides a potential solution, many are deterred from using public blockchains due to the risk of exposing business secrets to potential competitors.<\/span>","<span data-v-f87c67ca=\"\">This realization, John said, has led <a href=\"https:\/\/www.theblockcrypto.com\/linked\/65507\/consensys-fintech-exec-says-libra-could-become-a-developer-magnet-if-the-stablecoin-project-takes-off\" data-v-f87c67ca=\"\">ConsenSys<\/a> and EY to develop the Baseline Protocol to enable the compartmentalization of information among collaborators. The protocol makes use of messaging, digital signatures, a zero-knowledge algorithm, and other techniques to create a common frame of reference that teams need to keep things in sync. At the same time, each step in the workflow is compartmentalized, and a person working on certain steps would have no information about the other steps.<\/span>","<span data-v-f87c67ca=\"\">Paul Brody, EY's global blockchain lead, gave the example of a volume discount table to illustrate the protocol’s use cases. Buyers and sellers are not monolithic organizations, he said, but have subsidiaries and business partners that they want to authorize their master purchase agreement to. Using the Baseline Protocol, they can convert the legal agreement to a digital smart contract that operates with full confidentiality.<\/span>","<span data-v-f87c67ca=\"\">“If you're just a subcontractor that’s doing work on my behalf, when you make a purchase order, the smart contract on the chain will tell you the correct price but won’t give you any information about what the overall volume discount table looks like, how much has been purchase, or who else is buying,” Brody explained.<\/span>","<span data-v-f87c67ca=\"\">The end goal, according to the firms, is to let current enterprise systems vendors, solutions firms, and cloud providers improve their products based on the protocol. The code will be donated into the public domain through the non-profit standards body OASIS.<\/span>","<span data-v-f87c67ca=\"\">Right now, roughly three-quarters of the work has been done. And the project is transitioning from a close-knit team consisted just of the two firms to a larger one with participation from Microsoft, AMD, ChainLink, Core Convergence, Duke University, Envision Blockchain, MakerDAO, Neocava Splunk, UniBright, Provide, and W3BCLOUD.<\/span>"],"hashtag":[]}