{"summary":"Crypto miners going to have to keep answering to lawmakers even in the absence of statute. \nNew political pressure on the mining industry is, however, part of its maturation, according to lawmakers. ","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/132712\/congress-crypto-mining-no-pending-legislation","publishDate":"2022-02-01T16:38:47","id":3284,"type":null,"title":"‘No pending legislation’ on crypto mining, says Blockchain Caucus co-chair","category":["Congress"],"content":["<span data-v-f87c67ca=\"\">“Welcome to being in an industry that has arrived,” Darren Soto tells The Block, chuckling about Congress's pace.<\/span>","<span data-v-f87c67ca=\"\">Soto (D-FL), a congressman representing the suburbs of Orlando, is specifically talking about crypto mining. It’s an issue that has been ascendant in public awareness as miners have flooded into the US over the past year. Its political dimension has become especially conspicuous in the <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/130633\/congressional-committee-releases-witness-list-in-advance-of-crypto-mining-hearing\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">aftermath of a hearing<\/span><\/a><span data-v-f87c67ca=\"\"> before the Oversight Subcommittee of the House Energy and Commerce Committee earlier in January.<\/span>","<span data-v-f87c67ca=\"\">Soto, a member of the full Energy Committee and a co-chair of the Blockchain Caucus, rushed from votes to join the subcommittee in its questioning of several leaders in crypto mining. Presiding remotely, subcommittee chair Dianna DeGette (D-CO) almost passed him over.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As congressional attention on crypto has intensified — particularly in the form of more frequent hearings on the subject — the industry has been at odds trying to come to terms with its new popularity on Capitol Hill. <\/span>","<span data-v-f87c67ca=\"\">Effectively, what does it all mean? Is this a prelude to a crackdown?&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Not in the form of legislation, according to Soto. “It could be months but more likely years before there are any statutory moves,” he says. “There is no pending legislation right now.”<\/span>","<span data-v-f87c67ca=\"\">Rather than heralding a crackdown, the mining hearing was more in line with the Energy Committee’s work on the energy grid across industries. Other recent hearings have raised questions about the resilience of US oil pipelines and the future of domestic wind energy.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“There are other industries using far more energy that we’ve been looking at for years,\" says Soto. \"We’re going down the list of energy users: transportation, manufacturing, utilities.” <\/span>","<span data-v-f87c67ca=\"\">It is a mark of the crypto industry’s development that it is on this list, according to Soto. <\/span><span data-v-f87c67ca=\"\">“Crypto has become a more mature industry,\" he says. \"There’s not a partisan disagreement as to whether mining should happen, it’s more a question of ‘how do we protect the environment’”<\/span>","<span data-v-f87c67ca=\"\">In an interview with The Block, Rep. Morgan Griffith (R-VA) tried to illustrate that sense of agreement across the aisle. Energy use is “something we should be concerned about,\" Griffith said. \"Do we shut the industry down because of that? Absolutely not. We have to figure out ways to do it better.”<\/span>","<span data-v-f87c67ca=\"\">For now, legislation at the federal level remains unlikely. As The Block has reported, pending revisions of the <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/131077\/no-fireworks-at-houses-bitcoin-mining-hearing-but-pending-climate-bills-could-home-in-on-crypto\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Build Back Better Act<\/span><\/a><span data-v-f87c67ca=\"\"> could target crypto mining within its climate provisions. But it is procedurally limited in new rules that it can put into place.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As Soto notes, “Grants fit well, because it’s a budget bill, but regulation would in all likelihood have to come primarily in the form of incentives.”<\/span>","The current oversight of crypto mining is most meaningful in establishing a general spectrum of good and bad actors. Then, Congress can turn up political pressure on miners to act more like the former and less like the latter, which it can do without passing new laws.","However, federal lawmakers will certainly be looking out for responses from states with large mining industries to gauge any prospective nationwide response.","So, if for instance, Bitcoin mining ends up funding the expansion of stranded wind turbine farms in West Texas, that might score points for the industry in DC. But if New York brings its energy and carbon goals <a href=\"https:\/\/www.theblockcrypto.com\/linked\/108243\/unions-shoot-down-new-yorks-crypto-mining-moratorium-for-now-at-least\" data-v-f87c67ca=\"\">into reach by banning mining<\/a>? Federal policymakers will notice.&nbsp;","But for now, nobody seems to be in a hurry.&nbsp;"],"hashtag":[]}