{"summary":"Such tax would be exempt for companies that intend to hold the crypto assets for the long term, local media reported.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/269200\/japan-seeks-to-exempt-companies-from-tax-on-unrealized-crypto-gains-reports","publishDate":"2023-12-25T04:11:14","id":3288,"type":null,"title":"Japan seeks to exempt companies from tax on unrealized crypto gains: reports","category":["ASIA"],"content":["<span data-v-f87c67ca=\"\">The Japanese government has approved a 2024 tax regime revision that seeks to exclude corporations from paying tax on unrealized crypto gains if they hold the assets longer term, according to local media <\/span><a href=\"https:\/\/www.nikkei.com\/article\/DGXZQOUB195YC0Z11C23A2000000\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reports<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">Nikkei and CoinPost <\/span><a href=\"https:\/\/coinpost.jp\/?p=500501\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reported<\/span><\/a><span data-v-f87c67ca=\"\"> on Saturday that the cabinet approved the revision on Friday that would be applied to companies that own cryptocurrencies issued by third parties.<\/span>","<span data-v-f87c67ca=\"\">Currently, third-party-issued cryptocurrencies held by corporations are regarded as profits or losses based on the difference between market value and book value at the end of the fiscal year. The revision intends to stipulate that such mark-to-market valuation would no longer be applied if companies hold the assets for the long term, according to the media report.<\/span>","<span data-v-f87c67ca=\"\">That means companies would be taxed only on profits generated from the sale of cryptocurrency, the report said.<\/span>","<span data-v-f87c67ca=\"\">The proposed revision for the fiscal year 2024 still needs to be submitted to a regular Diet session set in January 2024 and approved by the Lower House and the Upper House, according to the report.<\/span>","<span data-v-f87c67ca=\"\">“Holdings of [crypto] assets issued by other companies that are considered short-term holdings will continue to be subject to year-end unrealized gains taxation,” Daiki Moriyama, director of Japan- and Singapore-based gaming blockchain builder Oasys, told The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The fact that the Japanese government has demonstrated its willingness to grow Web3 business by enacting tax reform for the second year in a row is extremely important to all Web3 business stakeholders around the world,” Moriyama said.<\/span>","<span data-v-f87c67ca=\"\">Such potential change in the tax regime comes after the country’s tax agency <\/span><a href=\"https:\/\/www.theblock.co\/post\/236226\/japanese-tax-code-exempts-crypto-issuers-from-paying-unrealized-tax-gains\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">clarified<\/span><\/a><span data-v-f87c67ca=\"\"> in June that crypto issuers would no longer have to pay the capital gains tax of around 35% on unrealized gains.<\/span>","<span data-v-f87c67ca=\"\">In June, Fumio Kishida, Japan’s Prime Minister, <\/span><a href=\"https:\/\/www.theblock.co\/post\/241258\/web3-japan-fumio-kishida\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\"> that web3 has the potential to transform the traditional internet framework and contribute to social change and that the government is dedicated to creating an environment conducive to the promotion of web3.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"CoinPost","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"January 2024","content":"DATE"},{"type":"Lower House","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Upper House","content":"ORGANIZATION"},{"type":"Japan","content":"LOCATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Moriyama","content":"PERSON"},{"type":"Oasys","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"35%","content":"PERCENT"},{"type":"Fumio Kishida","content":"PERSON"},{"type":"Daiki Moriyama","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Saturday","content":"DATE"}],"hashtag":["ASIAN PARLIAMENTS","ASIAN REGULATION"],"authors":["Timmy Shen","The Block"]}