{"summary":"BitMEX Group has signed a purchase agreement with Bankhaus von der Heydt, a 268-year-old German bank.\nThe deal is subject to the approval of German financial regulator BaFin.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/130567\/crypto-bitmex-plans-to-acquire-german-bank-bankhaus-von-der-heydt","publishDate":"2022-01-18T05:22:30","id":329,"type":null,"title":"BitMEX Group plans to acquire a 268-year-old German bank","category":["Exchanges"],"content":["Crypto firm BitMEX Group announced Tuesday its plan to acquire Bankhaus von der Heydt, a 268-year-old private bank based in Germany.","The group's BXM Operations AG — a company founded by BitMEX CEO Alexander Höptner and its CFO Stephan Lutz — has <a href=\"https:\/\/blog.bitmex.com\/bxm-operations-intends-purchase-german-bank-bankhaus-von-der-heydt\/\" data-v-f87c67ca=\"\">signed<\/a> a purchase agreement with Dietrich von Boetticher, the bank's current owner. The deal is subject to the approval of German financial regulator BaFin.","Bankhaus von der Heydt was founded in 1754. In October, it partnered with Fireblocks to offer crypto services to its clients.","BitMEX Group said it expects the transaction to complete in the middle of this year. But the BaFin approval may not come easy after recent fintech scandals in Germany, including Wirecard and Greensill Bank.","Greensill Bank was deemed insolvent by a local German court last year, and German payments firm Wirecard filed for insolvency after revelations that over $2 billion was \"missing\" from its balance sheet.","BitMEX Group did not disclose the terms of the deal in the making. But said once BaFin approves it, Bankhaus von der Heydt will continue to operate as a standalone business unit, with Höptner and Lutz joining its supervisory board.","Höptner said BitMEX Group aims to create \"a regulated crypto products powerhouse in the heart of Europe\" if the deal goes through. The group plans to launch regulated crypto products in Germany, Austria, and Switzerland with the planned acquisition.","BitMEX Group has been planning to increase its footprint in Europe. Earlier this year, the group launched BitMEX Link, a crypto brokerage service based in Switzerland. BitMEX Link is owned by BXM Link AG, another company of the group.","Ever since BitMEX and its founders were sued by the US Commodity Futures Trading Commission (CFTC) in October 2020, it has been trying to recover its lost market share.","At the time, the CFTC filed charges against BitMEX and its founders Arthur Hayes, Ben Delo, and Samuel Reed for operating an unregistered trading platform. Last year, BitMEX settled the case with the CFTC with a $100 million penalty, but the agency's litigation against the founders continues.","Höptner joined BitMEX in December 2020 from Börse Stuttgart GmbH and Euwax AG and has taken several steps to regain the exchange's market share.","Last month, BitMEX announced that it will issue its <a href=\"https:\/\/www.theblockcrypto.com\/post\/128227\/crypto-exchange-bitmex-own-bmex-token-launch-airdrop\" data-v-f87c67ca=\"\">own token<\/a> BMEX to provide trading incentives to users. Earlier this month, BitMEX also hired several new C-level executives to expand into spot, brokerage, and custody products, beyond its primary derivatives offering.","The company hired Rupertus Rothenhaeuser from Crypto Finance (Brokerage) AG as its chief commercial officer. It also hired Raphael Polansky as its new chief operating officer, from Blocknox, a subsidiary of Boerse Stuttgart Digital Ventures. It also appointed Marcus Hughes as chief risk officer, who was previously managing director of Coinbase’s European business."],"hashtag":["BITMEX"]}