{"summary":"USDe is now also being backed by bitcoin amid a resurgence in the world&#x27;s oldest cryptocurrency, Ethena Labs said Thursday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286585\/ethena-usde-bitcoin-backing","publishDate":"2024-04-04T16:08:17","id":3290,"type":null,"title":"Ethena Labs adds bitcoin as USDe backing asset","category":["DEFI"],"content":["Ethena Labs has added bitcoin as a backing asset for its USDe synthetic dollar, as traders embrace a resurgence in the world’s oldest digital asset.","The decentralized finance (DeFi) protocol <a href=\"https:\/\/twitter.com\/ethena_labs\/status\/1775944410011926931?t=UNH1oRLhDl3oiyW5JeNvNA&amp;s=19\" data-v-f87c67ca=\"\">said<\/a> Thursday in a series of posts on X that backing USDe with bitcoin will enable its dollar-pegged token to scale by a factor of more than 2.5, as well as make its products safer for traders. The move comes as bitcoin derivative markets outpace their ether-based equivalents.","“As Ethena scales closer towards $10bn this provides a more robust backing, and ultimately a safer product for users,” the protocol said Thursday. USDe’s current supply is worth roughly $2 billion, it added.","Ethena also pointed to bitcoin's superior liquidity and duration profile for delta hedging compared to liquid staking tokens as a factor in its decision to add bitcoin as a backing asset.","Until now, USDe has been backed exclusively by ether liquid staking tokens, Ethena Labs’ website shows. Token holders are showing stronger interest in trading bitcoin, however.","Bitcoin open interest surged 150% to $25 billion in the past year, leading to a more than doubling of USDe's capacity to scale, Ethena said. Meanwhile, ether's open interest grew just 100% to $10 billion during the same period, according to data the protocol cited.","Bitcoin's comparatively strong demand comes amid a spectacular run-up in the virtual token's speculative value. Bitcoin is trading at $68,384 at the time of writing, <a href=\"https:\/\/www.theblock.co\/price\/248348\/bitcoin-btc-usd\" data-v-f87c67ca=\"\">The Block's price data<\/a> shows, up 4% over the past 24 hours.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"delta","content":"ORGANIZATION"},{"type":"$25 billion","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"$10bn","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"Ethena","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$10 billion","content":"MONEY"},{"type":"100%","content":"PERCENT"},{"type":"150%","content":"PERCENT"},{"type":"Ethena Labs","content":"ORGANIZATION"},{"type":"$68,384","content":"MONEY"},{"type":"$2 billion","content":"MONEY"}],"hashtag":[],"authors":["Elizabeth Napolitano","The Block"]}