{"summary":"A number of crypto liquidity providers have also invested in dYdX, which hopes to become one of the world’s largest crypto exchanges over the next three to five years.\nThe derivatives exchange announced a $10 million Series B round just four months ago.","author":["Ryan Weeks","Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/105881\/defi-exchange-dydx-65-million-raise","publishDate":"2021-06-15T10:30:04","id":3291,"type":null,"title":"DeFi exchange dYdX closes $65 million raise led by Paradigm","category":["DeFi"],"content":["dYdX, the decentralized derivatives exchange, has secured $65 million in a Series C raise led by Paradigm.","The San Francisco-based protocol development firm, which is focused on decentralized perpetual swaps, announced <a href=\"https:\/\/www.theblockcrypto.com\/post\/92562\/decentralized-derivatives-exchange-dydx-raises-10-million-series-b\" data-v-f87c67ca=\"\">a $10 million Series B fundraise<\/a> as recently as January of this year. Three Arrows Capital and DeFiance Capital led that round, with Wintermute,&nbsp;Hashed, GSR, SCP,&nbsp;Scalar Capital,&nbsp;Spartan Group, and&nbsp;RockTree Capital all participating.","“It is a raise that’s coming pretty soon after the previous one. The reason for this is we just see a huge opportunity in crypto derivatives and especially the way that decentralized derivatives can play into the market,” Antonio Juliano, founder of dYdX, told The Block. “Really our goal for dYdX is to make it one of the biggest crypto exchanges period, but on a three to five-year time horizon.”","Earlier backers of the protocol include a16z, Bain Capital Ventures and Coinbase CEO Brian Armstrong.","A number of new strategic investors participated in the Series C raise alongside Paradigm, including liquidity providers QCP Capital, CMS Holdings, CMT Digital, Finlink Capital, Sixtant, Menai Financial Group, MGNR, Kronos Research; venture capital firms HashKey, Electric Capital, Delphi Digital; and StarkWare, a partner focused on scaling solutions for blockchains.&nbsp;","The money will be used to add new assets and features to the exchange's perpetual contracts, launch a new mobile app, continue to invest in international expansion, and to double the 16 person-strong team over the course of the next year. There are also plans to decentralize the protocol.","“Our goal really is to get to a point where we’re only publishing open-source code and all of dYdX is run natively on the blockchain, and the blockchain is available to more people in more places in the world,” said Juliano.","Launched October 2018, cumulative trading volumes across perpetual, margin and spot trading on dYdX <a href=\"https:\/\/defirate.com\/dydx-raises-series-b\/\" data-v-f87c67ca=\"\">reached $2.5 billion in 2020<\/a>, up from $63 million in 2019. By January 27 this year, the protocol had already surpassed $3.5 billion in total trading volume.","But in February, dYdX launched a new Layer 2 protocol for cross-margined perpetual contracts using StarkWare’s StarkEx scalability engine. The idea behind the integration was to make the exchange function more efficiently, and dYdX said in a press release that customers can now trade with zero gas fees, lower trading fees, and reduced minimum trade sizes.","“The primary purpose of rolling that out was for scalability. A huge problem that’s plagued decentralized exchanges on the whole, dYdX included, was gas fees and transaction fees on top of Ethereum,” said Juliano.","At one point in March this year, dYdX users were paying on average over $100 in gas fees to make a single trade, according to Juliano. Under the new Layer 2 system, dYdX picks up those fees, but they are roughly 100x less than what its users were paying previously.&nbsp;","“We’re able to offer very competitive fees now in terms of what users are used to on centralized exchanges,” said Juliano.&nbsp;","In the past five months, the Layer 2 protocol has supported over $2.2 billion in volume from over 11,000 traders.","",""],"hashtag":["ETHEREUM","PARADIGM"]}