{"summary":"Crypto exchange operator FTX is planning to acquire troubled crypto lender BlockFi outright, The Block has learned.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/154929\/ftx-blockfi-deal-sources","publishDate":"2022-06-29T20:34:47","id":3292,"type":null,"title":"FTX seeks to acquire troubled crypto lender BlockFi: sources","category":["MERGERS & ACQUISITIONS"],"content":["Crypto exchange operator FTX is seeking to acquire BlockFi outright, The Block has learned.","The development comes in the wake of reports that FTX was in talks to <a href=\"https:\/\/www.theblock.co\/post\/154060\/ftx-in-talks-to-acquire-blockfi-stake-wall-street-journal-reports\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">buy a stake<\/a> in the crypto lender, which struck a $250 million <a href=\"https:\/\/www.reuters.com\/technology\/crypto-firm-blockfi-signs-250-mln-revolving-credit-agreement-with-ftx-2022-06-21\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">credit agreement<\/a> with FTX earlier this month.","A source with knowledge of the process told The Block that the credit deal gave FTX an option on 50% of BlockFi equity. The remainder would be purchased for $25 million. Another source also said the latter.","A spokesperson for BlockFi told The Block: \"BlockFi does not comment on market rumors.\"","<a href=\"https:\/\/www.theblock.co\/post\/154681\/a-leaked-investor-call-revealed-morgan-creeks-bid-for-blockfi-here-are-four-more-big-takeaways-from-the-call\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Details from an investor call<\/a> leaked earlier this week — revealing a bid by Morgan Creek to assemble investors to buy a majority stake in the crypto lender — had suggested that FTX possessed the right, via its credit deal, to convert loans into BlockFi's equity without restriction. A BlockFi representative previously told The Block that such comments are “highly speculative.”","It’s not immediately clear at this time whether the FTX deal will go through, given the possible existence of other offers. Any FTX deal will also be subject to approval by BlockFi shareholders.","BlockFi has faced severe financial headwinds amid a significant crypto market downturn. The firm was among a number of industry companies that announced cost-saving measures such as layoffs, and sources previously told The Block that BlockFi was seeking a fresh round of capital at a lower valuation compared to previous funding rounds.","According to the two sources, BlockFi’s staff count will be significantly reduced if the FTX deal goes through. They say as many as 80% of the team could be let go.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"Morgan Creek","content":"ORGANIZATION"},{"type":"80%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$250 million","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$25 million","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["BLOCKFI","FTX"],"authors":["Yogita Khatri","Frank Chaparro","The Block"]}