{"summary":"SoFi has agreed to acquire payment processor Galileo in a $1.2 billion deal.\nAccording to SoFi CEO, the shutdown of physical bank branches has made it all the more important to explore digital financial management right now.","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/61170\/personal-finance-platform-sofi-to-acquire-payment-processor-galileo-in-a-1-2-billion-deal","publishDate":"2020-04-07T15:12:44","id":3293,"type":null,"title":"Personal finance platform SoFi to acquire payment processor Galileo in a $1.2 billion deal","category":["Mergers &amp; Acquisitions"],"content":["<span data-v-f87c67ca=\"\">Personal finance platform SoFi has signed an acquisition agreement to purchase payments software company Galileo in a $1.2 billion deal.<\/span>","<span data-v-f87c67ca=\"\">Founded in 2000, <a href=\"https:\/\/www.galileo-ft.com\/\" data-v-f87c67ca=\"\">Galileo<\/a> utilizes API technology to connect banks to credit card processors. Its API and payments platform has been serving not only the SoFi's own cash management account product<a href=\"https:\/\/www.sofi.com\/money\/\" data-v-f87c67ca=\"\"> SoFi Money<\/a>, but also SoFi competitors like Robinhood, Chime, Monzo, and Revolut.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to a Tuesday <\/span><a href=\"https:\/\/www.sofi.com\/blog\/galileo-and-sofi\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">announcement<\/span><\/a><span data-v-f87c67ca=\"\">, SoFi is set to acquire Galileo to leverage the latter's API technology and tap into a larger scope of financial services.<\/span>","<span data-v-f87c67ca=\"\">\"One of the many reasons we're thrilled to add the Galileo team is that it gives us the ability to better serve our members through their best-in-class API technology, furthering our goal to provide 24\/7 access to critical financial services,\" said SoFi’s press statement.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The deal involves $875 in company stock, $75 million in cash payment, and $250 million in shelter financing debt, CNBC <\/span><a href=\"https:\/\/www.cnbc.com\/2020\/04\/07\/sofi-to-acquire-payment-software-company-galileo-for-1point2-billion.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reported<\/span><\/a><span data-v-f87c67ca=\"\">. Following the acquisition, Galileo will operate as an independent business. Its current CEO, Clay Wilkes, will continue to lead the operation.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The two firms told CNBC that talks about the acquisition started before \"things got challenging.\" Despite the spread of coronavirus and the ensuing economic turmoil, Galileo and SoFi opted to go through with the deal.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Wilkes, the deal will help Galileo add new products like lending services onto its platform.<\/span>","<span data-v-f87c67ca=\"\">\"We see product road maps that have big gaps in them that can easily be filled with the products SoFi has developed,\" he told CNBC. \"Now is a good time to do this.\"<\/span>","<span data-v-f87c67ca=\"\">SoFi CEO Anthony Noto added that the ongoing pandemic has prompted many users to shift from physical to digital banking since a number of bank branches have been shut down, which makes the acquisition all the more important.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"It's the right time to do something like this — we're on the precipice of a transition to digital from physical finance,\" Noto told CNBC. \"It's going to serve people in this environment and the need for mobile financial services is only going to accelerate.\"<\/span>"],"hashtag":[]}