{"summary":"The Commodity Futures Trading Commission charged Mirror Trading International and operator Johannes Steynberg with fraud and registration violations Thursday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/155189\/mirror-trading-international-mastermind-steynberg-charged-in-us-court","publishDate":"2022-06-30T13:38:07","id":3296,"type":null,"title":"Mirror Trading International mastermind Steynberg charged in US court","category":["LEGAL"],"content":["The CFTC charged Johannes Steynberg, the alleged mastermind behind a major Bitcoin scheme, with fraud and registration violations in a U.S. court.","The Mirror Trading International operation is the largest fraudulent scheme involving Bitcoin charged in any CFTC case, the commission said Thursday.","<span data-v-f87c67ca=\"\">The Commodity Futures Trading Commission <\/span><a href=\"https:\/\/www.cftc.gov\/PressRoom\/PressReleases\/8549-22?utm_source=govdelivery\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">charged<\/span><\/a><span data-v-f87c67ca=\"\"> Mirror Trading International and boss Johannes Steynberg with alleged fraud and registration violations on Thursday. <\/span>","<span data-v-f87c67ca=\"\">The commission deemed the South Africa-based operation as the \"largest fraudulent scheme involving Bitcoin charged in any CFTC case.\"<\/span>","<span data-v-f87c67ca=\"\">Mirror Trading International allegedly engaged in an “international fraudulent multilevel marketing scheme,” for nearly three years, according to the complaint.&nbsp; Steynberg allegedly solicited Bitcoin from members of the public for participation in a commodity pool operated by Mirror Trading International — without being registered as an operator — from May 2018 to March 2021.<\/span>","<span data-v-f87c67ca=\"\">“The defendants misappropriated, either directly or indirectly, all of the Bitcoin they accepted from the pool participants,” the CFTC said in a release. The commission filed its civil enforcement action in the US District Court for the Western District of Texas.<\/span>","<span data-v-f87c67ca=\"\">Steynberg allegedly accepted at least 29,421 BTC, with a value of more than $1.7 billion, from 23,000 participants in the United States who were not eligible contract participants. He also took contributions from others around the world, according to the CFTC. <\/span>","<span data-v-f87c67ca=\"\">Per the agency, Steynberg “purportedly traded off-exchange, retail foreign currency on a leveraged, margined and\/or financed basis” with the participants “through what the defendants falsely claimed was a proprietary ‘bot’ or software program.”<\/span>","<span data-v-f87c67ca=\"\">Investigators in the United States joined the investigation into Mirror Trading International last summer, <\/span><a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2021-08-03\/u-s-joins-probe-into-south-african-crypto-firm-mirror-trading\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bloomberg reported<\/span><\/a><span data-v-f87c67ca=\"\"> in August. The commission is seeking restitution to defrauded investors and disgorgement of ill-gotten gains. The CFTC is also seeking civil monetary penalties, permanent registration and trading bans and a permanent injunction against future violations of CFTC rules and the Commodity Exchange Act.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Steynberg disappeared two years ago after Mirror Trading International stopped payouts to many of its members. He was arrested in Brazil last year and lost a bid earlier this month to be released from prison ahead of an extradition hearing, according to South African news outlet <\/span><a href=\"https:\/\/www.news24.com\/fin24\/companies\/mti-mastermind-johann-steynberg-to-remain-in-brazilian-prison-ahead-of-extradition-hearing-20220608\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">News24<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Western District of Texas","content":"ORGANIZATION"},{"type":"Mirror Trading International —","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Brazil","content":"LOCATION"},{"type":"South Africa","content":"LOCATION"},{"type":"March 2021","content":"DATE"},{"type":"Mirror Trading International","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"last summer","content":"DATE"},{"type":"Johannes Steynberg","content":"PERSON"},{"type":"May 2018","content":"DATE"},{"type":"$1.7 billion","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"US District Court","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":["CFTC"],"authors":["Stephanie Murray","The Block"]}