{"summary":"Part II: A History of “ground-zero” experimentation for blockchain and cryptoasset enabled gaming which created the first infrastructure to introduce the blockchain games of today and tomorrow","author":["Contributor Network","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/35251\/blockchain-gaming-part-ii-successes-and-failures-of-first-generation-games","publishDate":"2019-08-08T18:43:23","id":3296,"type":null,"title":"Blockchain Gaming Part II: Successes and Failures of First-Generation Games","category":["Technology"],"content":["<em data-v-f87c67ca=\"\">This is Part II of a multi-part comprehensive series on blockchain-based gaming by <a href=\"https:\/\/twitter.com\/jeffthedunker\" data-v-f87c67ca=\"\">Zane Huffman<\/a>: Twitter @jeffthedunker<\/em>","<em data-v-f87c67ca=\"\">The series is a culmination of historical accounts and interviews with a number of blockchain and crypto based game projects, sprinkled in with opinions on the current state and opportunities within gaming.<\/em>","Part 1 can be read <a href=\"https:\/\/www.theblockcrypto.com\/2019\/08\/02\/blockchain-gaming-part-i-the-opportunity\/\" data-v-f87c67ca=\"\">here.<\/a>","<b data-v-f87c67ca=\"\">Cryptocurrency Game vs Blockchain Game<\/b>","<span data-v-f87c67ca=\"\">A cryptocurrency game, or crypto game, represents any video game that, in some capacity, incorporates crypto assets. As a rule of thumb, every blockchain game is also a crypto game.<\/span>","<span data-v-f87c67ca=\"\">However, not all crypto games are blockchain games. A blockchain game is a game in which some or all of the gameplay takes place directly on the blockchain. In other words, gameplay inputs or activity in a blockchain game look like transactions broadcast by players onto the network. In a “true” blockchain game, 100% of the game persists on-chain. This means the game world runs, serverless, on the network itself.<\/span>","<span data-v-f87c67ca=\"\">While crypto incorporation at any level is interesting and potentially worthwhile for game development, this document will focus more heavily on blockchain gaming, and even moreso on “true” blockchain games. The peak potential in future application of blockchain technology in the video game industry comes through the emergence of true blockchain games as a paradigmatic shift in the industry as a whole.<\/span>","&nbsp;","<b data-v-f87c67ca=\"\">Gaming, not Gambling<\/b>","<span data-v-f87c67ca=\"\">Another distinction to be made is that between video gaming and gambling. While the term “gaming” is sometimes used to refer to gambling activity, for the purpose of this document, gaming will refer only to online gaming. For instances that deal with gambling applications, they will be referred to only as “gambling”.<\/span>","&nbsp;","<b data-v-f87c67ca=\"\">Decentralized Applications (“DApps”)<\/b>","<span data-v-f87c67ca=\"\">Decentralized applications, or DApps, refer to user-facing projects that are interacted with through blockchain networks. Many crypto games exist as DApps upon various blockchains. Virtually all blockchain games can be represented as DApps.<\/span>","<span data-v-f87c67ca=\"\">The current iteration of blockchain gaming projects kicked off with CryptoKitties in December of 2017. However, gaming goes back almost as far as cryptocurrency itself. A recurring theme for the pioneers of Bitcoin was an effort to incorporate Bitcoin into online gaming.<\/span>","<span data-v-f87c67ca=\"\">In retrospect, many of these primary initiatives were executed in a manner that was archaic and ineffective. That’s not to say the first generation of crypto games were a failure- Huntercoin and Spells of Genesis are both regarded as successes within the community, and every project helped create the first infrastructure to introduce the blockchain games of today and tomorrow. Below we will explore the first cryptocurrency games and blockchain games.<\/span>","<span data-v-f87c67ca=\"\">It’s difficult to pinpoint what exactly represents the very first instance of a cryptocurrency game. Discussion on Bitcointalk forums as early as 2011 shows there has been historic support from indie developers interested in Bitcoin from the very beginning. However, many of the proposed ideas and games never came to fruition beyond their discussion on the forums. By 2013, there were several instances of full-fledged games operating via Bitcoin. There was a similar surge in 2015, but this next wave expanded to incorporate various altcoins.<\/span>","&nbsp;","<strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin PvP Gaming<\/span><br data-v-f87c67ca=\"\">\n<\/strong>","<span data-v-f87c67ca=\"\">By 2013, Bitcoin gambling was already in place and thriving. Seals with Clubs was a budding online poker room with consistent activity of several hundred players. Primedice had been in operation for sometime and was expanding its capacity into the hundreds of thousands of users.<\/span>","<span data-v-f87c67ca=\"\">Player-vs.-Player gaming via Bitcoin then represented the most logical step forward. Rather than playing against the house, these PvP games instead offered simple games for players to compete against one another.<\/span>","<span data-v-f87c67ca=\"\">The most popular and successful of the initial PvP games was a website called <\/span>Gambit<span data-v-f87c67ca=\"\">. <\/span><a href=\"https:\/\/bitcointalk.org\/index.php?topic=319802.0\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Launched in late 2013<\/span><\/a><span data-v-f87c67ca=\"\">, Gambit offered an array of board and card games through which players competed and bet Bitcoin against one another. These games included a number of crypto-spinoffs of classic games like Monopoly, BattleShips, and Risk. Much of Gambit’s appeal for players was the generous faucet offerings. Every game allowed users to play with no buy-in for modest winnings. The Monopoly game had the highest payouts, of .00025 BTC for the winner of a no buy-in game. There was no limit or restrictions on how often someone could sign on to the faucet games.<\/span>","<span data-v-f87c67ca=\"\">Unfortunately, Gambit’s faucet was <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">too <\/span><\/i><span data-v-f87c67ca=\"\">good. Players simply didn’t care to wager their own coin, and instead stuck to free games in hopes of multiplying winnings enough times to cash out. The site lowered payouts from faucet over time, and incorporated new features like monthly leaderboards with top player payouts. However, they failed to garner attention beyond a BTC faucet game site. <\/span><a href=\"https:\/\/www.gambit.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The site is still live<\/span><\/a><span data-v-f87c67ca=\"\">, but in 2015, Bitcoin was removed as a currency altogether.<\/span>","<span data-v-f87c67ca=\"\">Other PvP games suffered similar fates. Their success relied on the attractiveness of faucet earnings, but it was a delicate balance. Too little, nobody plays; too much, and the game operator runs at a loss. Other instances included <\/span>Bombermine, <span data-v-f87c67ca=\"\">an online Bomberman spinoff where players wagered Bitcoin and <\/span>Gamerholic, <span data-v-f87c67ca=\"\">a competitive website for retro arcade games. There were also websites that acted as a peer-to-peer wager platform for betting in traditional games like League of Legends and CS:GO. However, all of these projects failed to gain meaningful traction.<\/span>","","","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Minecraft Servers<\/strong><\/span>","<span data-v-f87c67ca=\"\">The next branch of development beyond the PvP games came through an interesting medium: Minecraft. The infinitely modded sandbox block game housed specialized servers that incorporated Bitcoin as early as late 2012. Developers created open-source plugins that enabled in-game avatars to maintain Bitcoin wallets, and several independent server owners built customized servers around this functionality.<\/span>","<span data-v-f87c67ca=\"\">The first documented Bitcoin Minecraft server is <\/span>MinecraftCC<span data-v-f87c67ca=\"\">. On MinecraftCC, players earned weekly payouts in Bitcoin for every action on the server, such as placing blocks, killing monsters, and building structures. Administrators found creative ways to fund the payouts, such as through paid advertisements auctioned on the Bitcointalk forums. However, by 2016, the program had grown unsustainable, and the Bitcoin earnings were removed. The server is still active to this day, but the role cryptocurrency still plays is not clear.<\/span>","<span data-v-f87c67ca=\"\">The most popular server in 2013 was <\/span>BitVegas, <span data-v-f87c67ca=\"\">which was a casino custom-built and coded that used Bitcoin as the sole currency. By referring players and spending time on the server, users received regular rewards: .005 BTC per player referred, for example. Like its PvP gaming counterparts, BitVegas was unable to find a sustainable faucet model, and after the owner reported over 2 BTC in daily losses, BitVegas was shut down.<\/span>","<span data-v-f87c67ca=\"\">The other interesting example is <\/span>BitQuest, <span data-v-f87c67ca=\"\">which launched later than the other two but still operates to this day. BitQuest had a novel approach of converting the server hardware into a Bitcoin miner that turned mining rewards into in-game goods that could be collected by killing mobs. However, as mining has become far more competitive, there are no more BTC earnings for playing.<\/span>","<span data-v-f87c67ca=\"\">There have been other servers that incorporated different altcoins in following years. Most notably, there were attempts to create specialized servers running on Dogecoin and DigiByte.<\/span>","","","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Indie Games<\/strong><\/span>","<span data-v-f87c67ca=\"\">Of the three categories, indie games represent the most exciting and groundbreaking of the first niches. To varying levels of success, different individuals and studios put together games from the ground up that operated via Bitcoin and other altcoins.<\/span>","<span data-v-f87c67ca=\"\">By many regards, <\/span>Dragon’s Tale<span data-v-f87c67ca=\"\"> was the most successful indie game running on Bitcoin. With roots back to 2011, it predates the other listed developments, too. Dragon’s Tale was an MMO with soft RPG elements whose gameplay was focused on gambling. There were numerous games of varying luck and skill to wager BTC on, alongside simple questions and explorations to earn BTC. Dragon’s Tale began to fizzle after several years, and activity seemed to majorly die down sometime in 2015-2016.<\/span>","<span data-v-f87c67ca=\"\">Some other examples include <\/span>Hammercoin, <span data-v-f87c67ca=\"\">a massively multiplayer online rogue-like hack ‘n slash, <\/span>Island Forge, <span data-v-f87c67ca=\"\">a sandbox island-hopping MMO, and <\/span>Bitfantasy, <span data-v-f87c67ca=\"\">a pay-to-play Bitcoin MMORPG. All of these similarly fizzled out with the recurring theme that the growing inaccessibility of Bitcoin as a game currency with slow transaction times and increasingly expensive transaction fees rendered the growth of each game infeasible.<\/span>","<span data-v-f87c67ca=\"\">There has been more success among the first cryptocurrency games that took the more modern approach of introducing their own assets. The most popular and first widely successful example is <\/span>Spells of Genesis<span data-v-f87c67ca=\"\">. Spells of Genesis is a Trading Card role playing bubble shooter. The game’s economy is denominated in the fungible Counterparty (XCP)&nbsp; asset BitCrystals (BCY), and cards represent non-fungible XCP assets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Through an effective pre-sale for tokens and cards and sound tokenomics with burn mechanisms, Spells of Genesis saw impressive growth in terms of activity on the <\/span><a href=\"https:\/\/play.google.com\/store\/apps\/details?id=com.channel4.spellsofgenesis&amp;hl=en_US\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Google Play <\/span><\/a><span data-v-f87c67ca=\"\">store, and the valuation of its assets did, too. After a 2016 soft launch and 2017 main launch, SoG has amassed over 10,000 downloads and BitCrystals grew to an eight-figure market cap throughout the majority of 2016 and 2017.<\/span>","<span data-v-f87c67ca=\"\">In the same realm, <\/span>Nexium<span data-v-f87c67ca=\"\"> came across shortly after as a Multiplayer Online Battle Arena (MOBA) in an outer space setting where players competed and wagered NXM in spaceship battles across various planets. It saw similar attention and valuations as SoG and BCY throughout 2017, but has fallen out since.<\/span>","&nbsp;","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Gamecoins<\/strong><\/span>","<span data-v-f87c67ca=\"\">Even prior to the 2017 ICO-Mania, there were a number of altcoins built to be universal gaming coins- the predecessors to projects like Enjin Coin. These altcoins included <\/span>Hyper, GoldPieces, GameCredits, DigiByte, <span data-v-f87c67ca=\"\">alongside several others. Each of these projects took community-oriented approaches in on-boarding new games and developers to adopt their currencies.<\/span>","<span data-v-f87c67ca=\"\">Hyper, GP, and DGB all offered, at one point or another, mechanisms in which users could earn faucet earnings of each coin through gameplay on popular games like Team Fortress 2 (Hyper and GP) and League of Legends (DGB). GameCredits took a different approach, instead focusing attention on creating new games specifically for the use of GAME. There were three games in development throughout 2016 and the first half of 2017, although these projects were scrapped before they came to fruition.<\/span>","<span data-v-f87c67ca=\"\">While the first cryptocurrency games certainly played a worthwhile role and acted as the foundation to future projects, the most ambitious and impressive developments during this time frame are represented as the world’s first blockchain games. With no framework in place as to how exactly one puts a game on a blockchain, the first blockchain games number far fewer.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The two most notable of this class are Huntercoin and Motocoin. While each were very different and saw their own sets of successes and shortcomings, they both act as the inspiration behind the blockchain games that permeate today, and could grow to dominate tomorrow.<\/span>","&nbsp;","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Huntercoin<\/strong><\/span>","<span data-v-f87c67ca=\"\">For the standard blockchain gaming historian, enthusiast, evangelist, or whichever title is preferred, <\/span>Huntercoin<span data-v-f87c67ca=\"\"> in my humble opinion, is pure gold. Forked from Namecoin, Huntercoin is a custom blockchain whose network fosters the virtual Huntercoin world, in which players command characters to fight, defend, and collect HUC tokens.<\/span>","<span data-v-f87c67ca=\"\">Huntercoin mainnet (as well as the game world) launched in February of 2014. Players interacted with the world by running a Huntercoin node. They used Huntercoin transactions to create and direct their characters in the pursuit of collecting HUC as they spawned into the map. Huntercoin was merge-mined against Bitcoin, with miners receiving 10% of HUC block rewards. The other 90% went onto the map for players to collect in a fashion coined “human mining”.<\/span>","<span data-v-f87c67ca=\"\">Huntercoin was initially planned as a one-year experiment to test the practicality and longevity of such an endeavor. However, it was such an overwhelming success that the community pushed a fork to eliminate the year timeframe. <\/span><a href=\"https:\/\/www.youtube.com\/watch?v=czUU3Z8spUQ&amp;feature=youtu.be\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">This timelapse<\/span><\/a><span data-v-f87c67ca=\"\"> shows the activity of the world across the first 500,000 blocks- through which tens of thousands of players competed as members of each of the four teams to collect millions of HUC.<\/span>","<span data-v-f87c67ca=\"\">This game is a whopping success as a working proof-of-concept for blockchain gaming, but is even more impressive in its model of creating value for players to capture. Huntercoin players have collectively earned <\/span><a href=\"https:\/\/medium.com\/@XAYA\/just-how-much-money-have-people-made-with-huntercoin-7c7336f5ac04\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">over $1 million<\/span><\/a><span data-v-f87c67ca=\"\"> worth of HUC, traded back to Bitcoin with high liquidity on Poloniex. The Huntercoin blockchain generated million dollar plus profits for gamers simply through its own propagation and creation of HUC. This is the basis for the “play-to-earn” directive, in which blockchain game developers are attempting to create games that are situated so that their players earn real world profit for their activities. Huntercoin was delisted from exchanges earlier this year, though the game continues to see active players to this day.<\/span>","","","&nbsp;","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Motocoin<\/strong><\/span>","<span data-v-f87c67ca=\"\">On May 20, 2014, shortly after the launch of Huntercoin, <\/span>Motocoin<span data-v-f87c67ca=\"\"> launched with its innovative “proof-of-play” consensus mechanism. Similarly to Huntercoin, users connected to the Motocoin game as nodes in the network. Unlike Huntercoin, the gameplay in Motocoin itself was the mechanism for achieving consensus and minting blocks.<\/span>","<span data-v-f87c67ca=\"\">The gameplay of Motocoin was a motorcycle racing game in a procedurally generated environment with each block. The first player to solve the block by racing to the finish earned the MOTO block reward. At each new block, characters reset and the map was replaced with its procedurally generated successor.<\/span>","<span data-v-f87c67ca=\"\">Motocoin saw sizeable activity for years after launch, however it was crippled in the fact that the game was dominated by botters. The fastest path to the finish line was an easy solution for bots to compute and carry out faster than any player manually could, and the organic gameplay of MOTO was stifled. Officially, Motocoin still carries a market cap of roughly $500,000, but the coin has seen no significant trading activity throughout most of its lifespan.<\/span>","&nbsp;","<span data-v-f87c67ca=\"\">The current iteration of blockchain games represents a surge that commenced in December of 2017. If the first generation of games refers to “gen zero”, then the current field of blockchain and cryptocurrency games from December 2017 to now signifies a next-generation. The criticisms of blockchain games as pay-to-play cash grabs and infeasible at scale largely corresponds to mistakes and shortcomings of many projects and developments in this 2017-2019 era of blockchain gaming.<\/span>","Zane was first exposed to Bitcoin in 2013 through a gaming community that utilized Bitcoin. Since then, he's followed gaming closely while immersing himself further in the cryptocurrency space. In 2015, he began working as a freelance writer for several crypto news blogs, and today continues to work as a freelance writer for various projects and websites in the space, primarily focusing on educational and technical content. His pinpoint area of focus within cryptocurrency continues to be gaming."],"hashtag":[]}