{"summary":"Users must withdraw their Bitcoin NFTs from the platform by May 18, less than a year after support for them was added by the platform.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286530\/binance-set-to-end-bitcoin-nft-support","publishDate":"2024-04-04T11:24:26","id":33,"type":null,"title":"Binance set to end Bitcoin NFT support despite recent surge in interest","category":["NFT MARKETPLACES"],"content":["Crypto exchange Binance is set to end support for Bitcoin NFTs less than a year after they were introduced to its marketplace.","Binance said in a <a href=\"https:\/\/www.binance.com\/en\/support\/announcement\/binance-nft-update-on-bitcoin-nfts-2c2fb8f1f5e9421e8f777407a58df111\" data-v-f87c67ca=\"\">blog post<\/a> on Thursday it would not support any further airdrops, benefits, or utilities associated with Bitcoin NFTs after April 10, citing “ongoing efforts to streamline product offerings” on its NFT marketplace.","The platform will then cease support for trading and deposits of Bitcoin NFTs at 6 a.m. UTC on April 18. This means users will no longer be able to buy, bid for, or list NFTs on the marketplace, and existing orders will be canceled at that time. Binance also advised users to withdraw their Bitcoin NFTs before 12 a.m. UTC on May 18.","Explicitly referring to Bitcoin-based Runestone NFTs, Binance said users who met the conditions for the recent Runestone airdrop had been distributed the NFTs by April 4 but advised them to withdraw them by April 10 “to ensure they still have the opportunity to receive any associated tokens, utilities, and benefits.” Binance added that the trading of Runestone NFTs will not be supported during this period.","Bitcoin became the <a href=\"https:\/\/www.theblock.co\/post\/233265\/binance-adds-bitcoin-nfts-to-its-marketplace-one-day-after-sec-lawsuit\" data-v-f87c67ca=\"\">fourth blockchain<\/a> supported by Binance’s NFT marketplace in June 2023. However, that addition now appears to be over less than a year after its implementation.","Binance’s decision comes despite a recent surge in interest for Bitcoin Ordinals NFTs, with the floor prices of the NodeMonkes collection <a href=\"https:\/\/www.theblock.co\/post\/283001\/bitcoin-ordinals-nft-interest-soars-as-nodemonkes-records-53-surge-in-floor-price\" data-v-f87c67ca=\"\">soaring over 50%<\/a> last month to surpass Bored Ape Yacht Club in market capitalization.","\"At Binance, we periodically review our products and services to ensure that our resources continue to be focused on core efforts that align with our long-term strategy,\" a Binance spokesperson told The Block. \"In the last six years, Binance has grown from being an exchange to a global blockchain ecosystem with multiple business lines. We consistently adapt and modify our business approach in response to changing market and user needs.\"","The Bitcoin Ordinals protocol, <a href=\"https:\/\/www.theblock.co\/post\/207086\/what-are-bitcoin-nfts-ordinals-and-how-do-they-work\" data-v-f87c67ca=\"\">launched<\/a> in January 2023 by Casey Rodarmor, offers a new way to store and trade digital content on Bitcoin. By utilizing satoshis, the smallest units of bitcoin, users can engrave NFTs, BRC-20 tokens and other arbitrary data directly onto the blockchain, with each piece becoming a unique, tradeable asset.","While the terms \"Ordinals\" and \"inscriptions\" are often used interchangeably, an ordinal is technically a unique serialized identifier for a single satoshi, and an inscription is the content or data attached to that specific satoshi.","The rise in popularity of <a href=\"https:\/\/www.theblock.co\/post\/207086\/what-are-bitcoin-nfts-ordinals-and-how-do-they-work\" data-v-f87c67ca=\"\">Ordinals<\/a> on Bitcoin over the past year fueled <a href=\"https:\/\/www.theblock.co\/post\/266512\/why-bitcoin-miners-are-unlikely-to-fight-a-moral-battle-over-ordinals\" data-v-f87c67ca=\"\">debate<\/a> over whether or not inscriptions representing things like NFTs and BRC-20 tokens on Bitcoin should exist. Inscriptions rely on Bitcoin’s OP_RETURN function, which stores arbitrary data in the blockchain.","However, spikes in Ordinals activity also led to congestion, causing transaction fees to rise. Bitcoin users encountered delays in processing transactions without paying the higher fees.&nbsp;","<em data-v-f87c67ca=\"\">Updated with comment from Binance.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bitcoin Ordinals NFTs","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"last six years","content":"DATE"},{"type":"January 2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"20","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"12 a.m.","content":"TIME"},{"type":"6 a.m.","content":"TIME"},{"type":"Binance’s NFT","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"May 18","content":"DATE"},{"type":"April 4","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Casey Rodarmor","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"April 10","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"April 18","content":"DATE"},{"type":"BRC","content":"ORGANIZATION"},{"type":"Binance","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"},{"type":"June 2023","content":"DATE"}],"hashtag":["BINANCE","BITCOIN"],"authors":["James Hunt","The Block"]}