{"summary":"The Financial Stability Board finalized high level recommendations for regulating crypto-assets and stablecoins.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240072\/g20-body-sets-out-recommendations-for-regulating-crypto-assets-and-stablecoins","publishDate":"2023-07-17T16:28:41","id":330,"type":null,"title":"G20 body sets out recommendations for regulating crypto-assets and stablecoins","category":["POLICY"],"content":["The <a href=\"https:\/\/www.fsb.org\/\" data-v-f87c67ca=\"\">Financial Stability Board<\/a>&nbsp;finalized its recommendations for regulating global cryptocurrency activities.","The international body that advises G20 nations on global finance made two sets of recommendations. The first set advised on appropriate regulation, supervision, and oversight of <a href=\"https:\/\/www.theblock.co\/post\/239286\/google-play-allows-users-to-earn-crypto-assets-in-apps-and-games\" data-v-f87c67ca=\"\">crypto asset activities<\/a> and markets. The second set was specifically aimed at global stablecoin arrangements.","The FSB made <a href=\"https:\/\/www.fsb.org\/2023\/07\/fsb-global-regulatory-framework-for-crypto-asset-activities\/\" data-v-f87c67ca=\"\">nine recommendations for regulating crypto-assets and markets<\/a>, stressing data collection, monitoring issuer governance frameworks, and fostering cross-border regulatory cooperation. The FSB also urged routine risk assessments of crypto's impact on the financial system and insisted on clear, comprehensive information disclosure by crypto-asset issuers and service providers about their operations, risk profiles, and offerings.","The FSB proposed a <a href=\"https:\/\/www.fsb.org\/2023\/07\/high-level-recommendations-for-the-regulation-supervision-and-oversight-of-global-stablecoin-arrangements-final-report\/\" data-v-f87c67ca=\"\">set of recommendations<\/a> for regulating global stablecoin arrangements. It urged authorities to demand robust recovery and resolution plans from issuers.","The recommendations also emphasized the need for issuers to provide users with a strong legal claim for prompt redemption. If a stablecoin is tied to a single fiat currency, redemption should match that currency's value. To maintain value and avoid risks, authorities should ensure redemption rights, stabilization mechanisms, and adherence to prudential standards.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"FSB","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Financial Stability Board","content":"ORGANIZATION"}],"hashtag":["ASIAN REGULATION","CRYPTO","EUROPEAN COMMISSION","EUROPEAN COUNCIL","EUROZONE REGULATION","FCA","FDIC","FEDERAL RESERVE","SEC"],"authors":["Brian McGleenon","The Block"]}