{"summary":"Gemini and Kraken have announced trading support for Filecoin (FIL) ahead of its mainnet launch on October 15.\nHuobi will list FIL after the mainnet goes live, a spokesperson of the exchange told The Block.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/80859\/gemini-kraken-announce-trading-support-for-filecoin-ahead-of-its-mainnet-launch","publishDate":"2020-10-14T11:40:13","id":3300,"type":null,"title":"Gemini, Kraken announce trading support for Filecoin ahead of its mainnet launch","category":["Layer 1s"],"content":["Crypto exchanges Gemini and Kraken have announced trading support for Filecoin (FIL), whose mainnet is yet to be launched.","Gemini <a href=\"https:\/\/gemini.com\/blog\/upcoming-support-for-filecoin\" data-v-f87c67ca=\"\">today said<\/a> deposits and withdrawals for FIL would open October 15, when the Filecoin mainnet launches, and trading will follow shortly after that. The exchange would also support FIL for its custody offering. Kraken <a href=\"https:\/\/blog.kraken.com\/post\/6522\/filecoin-fil-trading-begins-october-15\/\" data-v-f87c67ca=\"\">said<\/a> on Monday that trading in FIL would begin October 15, with four pairs: FIL\/USD, FIL\/EUR, FIL\/BTC, and FIL\/ETH.","Historically, listing announcements don't come until after a given token's mainnet has launched. It's not clear if Gemini and Kraken — which appear to be the only major exchanges doing this — are trying to start a new trend or if they are both making an exception for Filecoin.&nbsp;","Filecoin, developed by Protocol Labs, is a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/78993\/blockchain-based-storage-network-filecoin-to-launch-mainnet-in-october\" data-v-f87c67ca=\"\">decentralized storage network<\/a>. It is meant to enable users to buy and sell unused storage on the network using FIL. The project has been under development for three years. In 2017, Protocol Labs raised $200 million in just 30 minutes via an initial coin offering or ICO. The mainnet was originally supposed to launch in March of this year but has been <a href=\"https:\/\/www.theblockcrypto.com\/post\/62442\/filecoin-mainnet-delay-launch-window-july-august\" data-v-f87c67ca=\"\">delayed<\/a> multiple times.","Jeremy Welch, VP of product at Kraken, told The Block that it is \"not a departure\" from the company's regular listing strategy. \"We have a robust review framework that examines efforts to develop crypto services and goes through a rigorous compliance, legal and security process.\"","Gemini has not responded to an inquiry from The Block at press time.","Meanwhile, a Huobi spokesperson told The Block that the exchange plans to list Filecoin after its mainnet goes live. Representatives from Binance and OKEx declined to comment on their listing plans."],"hashtag":["GEMINI","KRAKEN"]}