{"summary":"The experiment on the International Space Station is a step forward for trusted setup deployments that zero-knowledge proof protocols use.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/201343\/crypto-in-space-cryptosat-and-dorahacks-complete-zk-proof-experiment-on-space-station","publishDate":"2023-01-12T09:00:54","id":3300,"type":null,"title":"Crypto in space: Cryptosat and DoraHacks complete ZK proof experiment on space station","category":["TECH"],"content":["<span data-v-f87c67ca=\"\">The first successful experiment to launch a Zero-Knowledge (ZK) proof system in space occurred onboard the International Space Station (ISS) today, in a partnership between crypto-satellite developer Cryptosat and global hackathon organizer DoraHacks.<\/span>","<span data-v-f87c67ca=\"\">The experiment performed onboard the ISS demonstrated the capacity of a satellite-based computation environment to perform part of the trusted setup process necessary to utilize a ZK proof protocol, DoraHacks and Cryptosat said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The success of the ZK proof experiment is an important step forward in proving the efficacy of space-bound computational environments, according to Cryptosat, which is seeking to launch a constellation of cubesats into orbit and build out its satellite fleet.<\/span>","<span data-v-f87c67ca=\"\">For the ISS experiment to be successful, the teams needed to work with infrastructure that accounted for lapses in ground station connectivity. “ISS has a regular radio frequency communication link with [a] ground station,” Cryptosat founder Yonatan Winetraub told The Block. “We used that link for our demonstration.”<\/span>","<span data-v-f87c67ca=\"\">The procedure involved transmitting pre-uploaded open source programs via secure link to the ISS to output a string file for the ZK proof-based voting program used by DoraHacks.<\/span>","<span data-v-f87c67ca=\"\">Cryptosat already launched two mug-sized satellites, cubesats <\/span><a href=\"https:\/\/www.theblock.co\/post\/180245\/cryptosat-founder-already-landed-on-the-moon-eyes-computations-in-orbit\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Crypto1<\/span><\/a><span data-v-f87c67ca=\"\"> and <\/span><a href=\"https:\/\/www.theblock.co\/post\/199033\/cryptosat-launches-second-satellite-with-30-times-faster-computation\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Crypto2<\/span><\/a><span data-v-f87c67ca=\"\">, the latter of which is undergoing testing, Winetraub said.<\/span>","<span data-v-f87c67ca=\"\">A major component of ZK proofs is the deployment of a trusted setup that must be managed by an impartial party, and Cryptosat’s cubesats “essentially provide the perfect environment for those trusted setups,” Cryptosat founder Yan Michalevsky told The Block.<\/span>","<span data-v-f87c67ca=\"\">There are still some limitations with the cryptographic scheme behind the ZK proof used in the experiment, Groth16, which requires a new setup for any updates to the voting program. In addition, the experiment only encompassed the second phase of a Groth16 setup.<\/span>","<span data-v-f87c67ca=\"\">“There are already multiple use-cases that are ready to move to production, including random beacons, trusted setups, private ballots, etc. However, a larger satellite fleet enables us to tackle new use cases that require even higher and available bandwidth,” Michalevsky said.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Yan Michalevsky","content":"PERSON"},{"type":"Cryptosat","content":"PERSON"},{"type":"Michalevsky","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Winetraub","content":"ORGANIZATION"},{"type":"Yonatan Winetraub","content":"PERSON"}],"hashtag":[],"authors":["Jeremy Nation","The Block"]}