{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley. They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/22041\/former-fbi-analyst-alleges-fraud-breach-of-contract-and-rico","publishDate":"2019-05-05T20:07:50","id":3301,"type":null,"title":"Former FBI analyst alleges fraud, breach of contract and RICO","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]Polites v. Alchemy, et al., Case №1:19-cv-03862 (SD NY April 30, 2019) [NMR]<br data-v-f87c67ca=\"\">\n<\/strong><\/em>","This is a newly filed complaint from an aggrieved PR professional who feels that he was wronged by a company that launched an ICO with the help of his services, and has refused to pay him his owed monies. What specifically does Polites allege? The usual allegations in these matters: breach of contract, fraud, unjust enrichment, and a rare occurrence on the Crypto Caselaw Minute, violations of the Racketeer Influenced and Corrupt Organizations Act, better known as doing the RICO.","What happened here? Jared Polites is a former FBI analyst turned blockchain consultant, specifically offering services focused on “blockchain marketing, PR services, and expertise.” Sidebar: decent chance Polites is the only former FBI analyst turned blockchain consultant, but I digress. After meeting with individuals representing Alchemy, Polites entered into an agreement with Alchemy to help them with marketing for an upcoming ICO.","Allegedly, “[d]efendants agreed in writing to compensate Mr. Polites one percent (1%) of all funds raised from their ICO in exchange for Mr. Polites’” services. Fast forward to post-ICO, and apparently, Alchemy pulled in $46 million off of a leveraged token swap agreement that utilized the $30 million Alchemy that they raised in their ICO. According to the plaintiff, Alchemy never paid Polites and now he seeks $462,000 and more in damages. Wait, I thought this was about doing the RICO?","When most people hear RICO they think of criminal enterprises as that was the impetus for the passage of the Act in 1970. With the passage of the Act law enforcement had a powerful new tool kit to go after the leaders of criminal organizations for directing others to commit crimes on their behalf, as well as other malfeasance. Additionally, with the passage of the RICO Act, a civil cause of action was created for individuals that were harmed as a consequence of these criminal enterprises. How does this relate to this case?","Well, among other things, the plaintiff very specifically alleges in four counts that Alchemy made use of interstate commerce and engaged in “a pattern of racketeering activities for the unlawful purpose of intentionally defrauding Mr. Polites.” According to the plaintiff this scheme was allegedly achieved by using Mr. Polites as a pawn in fraudulent transactions, multiple instances of wire and mail fraud, utilization of multiple offshore entities with similar names, operating as an unlicensed consumer lending platform, and so on. Additionally, the plaintiff alleges that by not paying Mr. Polites the defendants were able to continue and further their alleged criminal enterprise.","RICO claims are complicated (most legal claims can be), so this new case doesn’t mean that we will start to see them pop up more and more in civil litigation. Ultimately, this case will be interesting to watch since these particular RICO claims seems relatively more robust than many of the somewhat nutty RICO claims you see from time to time in civil litigation.","<strong data-v-f87c67ca=\"\">Update:<\/strong> About a month after this story was published we heard from counsel for Alchemy who wrote ‘Alchemy Finance strongly denies each and every allegation set forth in the specious and meritless law suit brought by Jared Polites in the Southern District of New York. Alchemy intends to seek justice through the judicial system and is highly confident its position will be vindicated in Court.’”","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part III of this week's analysis, Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"1970","content":"DATE"},{"type":"‘Alchemy Finance","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"Polites","content":"PERSON"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"FBI","content":"ORGANIZATION"},{"type":"RICO","content":"ORGANIZATION"},{"type":"April 30, 2019","content":"DATE"},{"type":"$30 million","content":"MONEY"},{"type":"Jared Polites","content":"PERSON"},{"type":"Alchemy","content":"ORGANIZATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"$46 million","content":"MONEY"},{"type":"Southern District of New York","content":"LOCATION"},{"type":"Palley","content":"PERSON"},{"type":"1%","content":"PERCENT"},{"type":"$462,000","content":"MONEY"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"}],"hashtag":[],"authors":["Nelson Rosario","The Block"]}