{"summary":"Swiss non-profit the NEAR Foundation has launched a $100 million venture capital fund and venture lab for web3, it announced on Monday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/169154\/near-foundation-launches-100-million-vc-fund-and-lab-for-web3","publishDate":"2022-09-12T05:06:44","id":3302,"type":null,"title":"NEAR Foundation launches $100 million VC fund and lab for web3","category":["WEB3"],"content":["Swiss non-profit the NEAR Foundation launched a $100 million venture capital fund and venture lab for web3, it announced on Monday.","The NEAR Foundation, which supports the governance and development of the NEAR protocol, will partner with Caerus Ventures, a newly launched investment firm, for the project.","The VC fund will have an initial closing of $50 million. It will aim to bring in $100 million during seed to Series A funding rounds.","The Venture Lab will be Caerus' first investment and will focus on attracting creators, talent and franchise owners to build the next generation of web3 platforms and applications.","“The Lab will offer cross-functional support to portfolio projects and will be supported by advisory partners who will be announced by the end of this year,” said Marieke Flament, CEO of the NEAR Foundation.","Caerus was founded byNathan Pillai, an executive who spent the past five years with IMG\/Endeavor, spearheading M&amp;A and venture development of entertainment properties, including Larry Ellison’s SailGP.&nbsp;","Pillai said in a press released statement that he hoped the firm will \"be a catalyst for innovation that unleashes a new generation of platforms, applications and services across sport, music, film, TV, fashion, art and gaming which offer greater equity for talent and consumers alike.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Caerus Ventures","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Pillai","content":"PERSON"},{"type":"$100 million","content":"MONEY"},{"type":"IMG","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"byNathan Pillai","content":"PERSON"},{"type":"Larry Ellison","content":"PERSON"},{"type":"Marieke Flament","content":"PERSON"},{"type":"NEAR Foundation","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}