{"summary":"Coinbase is preparing for the worst when it comes to the coronavirus outbreak\nIt is preparing for four different outcomes, according to a document shared publicly by CEO Brian Armstrong.","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/56923\/coinbase-shares-its-four-tier-coronavirus-plan-for-employees","publishDate":"2020-02-25T15:10:04","id":3305,"type":null,"title":"Coinbase shares its four-tier coronavirus plan for employees","category":["Exchanges"],"content":["Coinbase has shared its preparation plans for various outcomes of the fast-spreading coronavirus.&nbsp;","The virus, which has origins in China's Wuhan region, has dominated news coverage since its emergence. The <a href=\"https:\/\/www.cnn.com\/2020\/02\/25\/europe\/italy-coronavirus-backfoot-intl\/index.html\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">latest<\/a> reports focused on the soaring number of infected people in Italy and Iran. While the World Health Organization has yet to deem the infection a pandemic, many companies and governments are urging folks to prepare for the worst-case scenario.","Coinbase, the poster child of cryptocurrency trading in the U.S., says it is planning \"for a really negative outcome\" despite having an optimistic outlook. <a href=\"https:\/\/docs.google.com\/document\/d\/1SRP4dnVCvKB7A5WXrESe-cL51i6_cg5nNGLNld6qch0\/preview\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">From a shared document<\/a>&nbsp;published by CEO Brian Armstrong on Tuesday:","<span data-v-f87c67ca=\"\">\"<span data-v-f87c67ca=\"\">Our expectation is that the measured mortality rate (once low-severity cases are included in the overall count) will fall significantly and that we’ll see limited transmission in the west, where there will be fewer high density multi-generational housing situations.\"<\/span><\/span>","The firm has offices in Ireland, the U.S., Japan, and the UK.&nbsp;Coinbase is planning for three phases of the disease. At this point, all of the firm's offices are in tier zero, except for Japan which is tier 1.&nbsp;","\"We have a standing Crisis Management Team continually reviewing new information as it comes in,\" the document said. \"We have established a four tier escalation ladder (from tier 0 to tier 3) for response to changes that impact Coinbase offices.\"","In the case of there being 100 instances of infected persons in the commuting radius of a given Coinbase office, the firm will ask certain employees to work from home. The firm will also boost the cleaning schedules of those office and offer mask disposal bins.","Phase two kicks in if \"[m]ore than 1000 events as above or any government quarantine actions in the commute range of a Coinbase office\" as well as in the event that the \"measured mortality rate remains 1% or above (10x the seasonal flu) [and] Observed transmission rate remains above 1.5.\"","At that point, Coinbase will stop serving office meals and ban all visitors to the office or \"institute a visitor health screening program.\"","If there are more than 5,000 infections, Coinbase notes it will be \"a wild ride\" as \"containment has failed.\"","In phase 3, all employees will be required to work from home. \"At this level, I'd expect our ability to use 3rd party services like cleaning, snacks, etc to start to break down because of fear driven absenteeism...&nbsp;I’d also expect to see regional isolation in the impacted area,\" Armstrong wrote.","\"We continue to believe the risk of COVID-2019 coronavirus to most employees is low, with a slightly elevated risk to our team in Japan,\" the firm said.&nbsp;","At this point, the firm has restricted travel to China, Hong Kong, Japan, Italy, and South Korea.&nbsp;"],"hashtag":["COINBASE","CRYPTO"]}