{"summary":"Technology security firm Least Authority has completed its audit of ETH 2.0 specifications at the Ethereum Foundation’s request\nThe report identified a lack of documentation on the protocol’s peer-to-peer (P2P) networking layer and the Ethereum node records (ENR) system\nThe audit also highlighted two areas of potential security vulnerabilities: the block proposer system and the P2P messaging system.","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/59936\/a-new-ethereum-2-0-audit-has-highlighted-potential-security-vulnerabilities","publishDate":"2020-03-25T16:25:38","id":3307,"type":null,"title":"A new Ethereum 2.0 audit has highlighted potential security vulnerabilities","category":["Ethereum"],"content":["<span data-v-f87c67ca=\"\">An audit of the ETH 2.0 specifications highlighted the need to address potential vulnerabilities with the protocol’s peer-to-peer (P2P) networking layer and block proposer system, according to the published findings.<\/span>","<span data-v-f87c67ca=\"\">At the Ethereum Foundation’s request, technology security firm Least Authority started its review of ETH 2.0 specs in January and worked closely with the Foundation throughout the process.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to the final <\/span><a href=\"https:\/\/leastauthority.com\/static\/publications\/LeastAuthority-Ethereum-2.0-Specifications-Audit-Report.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">audit report<\/span><\/a><span data-v-f87c67ca=\"\">, Least Authority has found the specs to be \"very well thought out and comprehensive.\" However, the team argued that there hasn’t been any real-world example of a large-scale protocol utilizing Proof of Stake and sharding. In that sense, it is hard to assess ETH 2.0’s long-term stability at the moment.<\/span>","<span data-v-f87c67ca=\"\">\"It is one of the first Proof of Stake (PoS)\/sharded protocol projects planned for production,\" the report said. \"As a result, there has been minimal opportunity to study the impacts of design decisions on real-world uses of such blockchain implementations, and none at the same scale. The long term stability of PoS blockchains is an area of active research that will need to be monitored over time as they are used in production.\"<\/span>","<span data-v-f87c67ca=\"\">The report highlighted the lack of documentation when it comes to the protocol’s peer-to-peer (P2P) networking layer and the <a href=\"https:\/\/www.theblockresearch.com\/ethereum-core-devs-greenlight-asic-resistant-update-but-launch-timeline-still-uncertain-6547\" data-v-f87c67ca=\"\">Ethereum<\/a> node records (ENR) system.<\/span>","<span data-v-f87c67ca=\"\">\"We found that the Peer-to-peer (P2P) networking layer and the ENR system are underrepresented,\" the report said. \"These may be elaborated on in later phases, but their significance suggests that Phase 0 would be a good starting point for laying the foundation of a strong network layer.\"<\/span>","<span data-v-f87c67ca=\"\">Additionally, the report pointed out two areas with potential security risks: the block proposer system and the P2P messaging system. Both require long-term research efforts and might be addressed in the project’s later phases, the report said.<\/span>","<span data-v-f87c67ca=\"\">Notably, the <a href=\"https:\/\/www.theblockresearch.com\/ethereum-essentials-node-nuances-8372\" data-v-f87c67ca=\"\">Ethereum<\/a> Foundation had previously informed the auditing team that the Phase 0 mainnet launch would take place in April 2020, Least Authority told The Block. However, the April timeline was meant to help inform the audit schedule and Least Authority could not confirm whether it is the actual launch date.<\/span>","<span data-v-f87c67ca=\"\">Indeed, ETH 2.0 project lead Danny Ryan announced in a Tuesday <a href=\"https:\/\/twitter.com\/dannyryan\/status\/1242442148642869248?s=20\" data-v-f87c67ca=\"\">tweet<\/a> that the next steps for the ETH 2.0 team would be to carry out multi-client testnets and a Phase 0 bug bounty program. <\/span>","<span data-v-f87c67ca=\"\">As The Block previously <\/span><a href=\"https:\/\/www.theblockcrypto.com\/daily\/54776\/everything-you-need-to-know-about-whats-coming-for-ethereum-2-0-in-2020\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">explained<\/span><\/a><span data-v-f87c67ca=\"\">, developers would need to implement a major multi-client testnet and run it for at least two months before the Phase 0 mainnet launch can take place. Therefore, it is unlikely that the launch will happen in the upcoming weeks.&nbsp;<\/span>","Ethereum co-founder Vitalik Buterin confirmed to The Block that launch will have to follow a successful multiclient testnet, which will likely take place in April.&nbsp;","\"First we need a multiclient test net, then we wait for that testnet to run for some time without issues, and if it does then we launch,\" said Buterin. \"This is a similar procedure to what we did back in 2015 for eth1. So it is not easy to predict when mainnet will happen, though we absolutely expect multiclient test nets very soon; April seems very likely.\"","<span data-v-f87c67ca=\"\">ETH 2.0 marks a transition from a Proof of Work (PoW) to a Proof of Stake (PoS) system. With PoW, the process of electing a winning block is straightforward and no observer can predict who will be the first to solve the puzzle. With PoS, however, there needs to be a block proposer to decide which block will go into the chain. This process, the report explained, opens up the risk of information leak.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In order to mitigate this risk, the report recommended using a Single Secret Leader Election (SSLE) mechanism to conceal the selection process. At the same time, the chosen block proposer would be able to communicate its identity to others.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"With the information leak patched, the block proposer remains as protected as it would be in PoW chains, but without the computational overhead,\" said the report's authors.<\/span>","<span data-v-f87c67ca=\"\">\"The Ethereum 2.0 team acknowledged the suggested mitigation,\" they continued. \"However, SSLE is still very much an active area of research. As a result, we expect more information and updates around these vectors to emerge as research on SSLE continues and Ethereum 2.0 reaches the Phase 1 and 2 milestones.\"<\/span>","Buterin claimed that SSLE is a major research focus for the ETH 2.0 team and included it as a part of his personal <a href=\"https:\/\/twitter.com\/VitalikButerin\/status\/1240365047421054976?s=20\" data-v-f87c67ca=\"\">roadmap<\/a> revealed on March 18.","<span data-v-f87c67ca=\"\">The second potential vulnerability concerns the \"spam problem\" in the protocol’s P2P messaging system. <\/span>","<span data-v-f87c67ca=\"\">Without a centralized entity judging nodes' actions, a dishonest node can spam the network with an unlimited number of old block messages without much penalty. Such attacks will flush out legitimate messages. Similarly, nodes can also send out an unlimited number of slashing messages and create unnecessary traffic on the blockchain.<\/span>","<span data-v-f87c67ca=\"\">\"This type of attack would slow down or potentially halt network processing for the duration it was carried out,\" the report said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">To address this problem, Least Authority suggested the implementation of a fully BAR-resilient gossip protocol to prevent malicious gossiping. According to the report, technology research firm Protocol Labs is currently looking into BAR-resilient peer-sampling techniques.&nbsp;&nbsp;<\/span>","\"In general, we definitely take network security anti-spam seriously,\" said Buterin regarding the identified vulnerability. \"Eth1 has taken some time to harden its network layer and there are currently a lot of eyes on networking issues so I expect DoS issues to be mitigated over time.\"","\"Regarding BAR resiliency, I expect that the approach we'll take will be to assume altruism at the beginning and then build in better incentive properties over time; the eth1 networking is also evolving in this direction,\" he said."],"hashtag":[]}