{"summary":"Crypto and blockchain startups in the U.K. are shifting back to equity funding, according to MMC Ventures \nUntil early 2018, ICOs had been the go-to source of funding ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/63721\/uk-crypto-startups-are-shifting-back-to-equity-funding-as-ico-route-has-faded","publishDate":"2020-05-01T06:30:31","id":3311,"type":null,"title":"UK crypto startups are shifting back to equity funding as ICO route has faded","category":["Layer 1s"],"content":["Crypto and blockchain startups in the U.K. are shifting back to equity financing as the initial coin offering (ICO) route has become difficult, according to venture capital firm MMC Ventures.","In a report <a href=\"https:\/\/www.mmcventures.com\/wp-content\/uploads\/2020\/04\/MMC_Crypto-Winter-or-Crypto-Spring_Blockchain-2020.pdf\" data-v-f87c67ca=\"\">published<\/a> Thursday, MMC Ventures said ICO funding declined sharply last year as compared to 2018. Startups raised only over £200 million (~$251 million) via ICOs in 2019 as compared to over £700 million (~$880 million) in 2018.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"The ICO bubble burst in 2018 — a welcome development within the community. Over time, a ‘plateau of reality’ is emerging,\" said MMC Ventures.","","","“As the ICO funding model becomes increasingly difficult, companies are shifting back to traditional capital raising strategies. This has prompted founders to place more focus on company fundamentals,” said MMC Ventures.","The report further finds that 2,700 blockchain firms have been founded in the U.K. since 2008, but only 9% of these have been equity funded as ICOs had been the “go-to” source of funding until early 2018.","“While capital may be less abundant than it was during the ICO bubble, resources are being deployed more efficiently and targeted at fundamental areas of the technology stack,” <a href=\"https:\/\/www.mmcventures.com\/we-release-our-latest-research-on-the-uks-blockchain-ecosystem\/\" data-v-f87c67ca=\"\">said<\/a> Asen Kostadinov, research manager at MMC Ventures.","“The innovation occurring at the infrastructure layer over the past 18 months might not be as easy to appreciate from a distance, but it is laying the foundations for more sustainable growth in both business and consumer adoption,” he added.&nbsp;","MMC Ventures <a href=\"https:\/\/www.theblockcrypto.com\/post\/56183\/crypto-custodian-copper-raises-8m-series-a-to-expand-globally\" data-v-f87c67ca=\"\">made<\/a> its first investment in crypto custody startup Copper earlier this year. Kostadinov said blockchain would continue to be an area investment focus for the venture firm.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nOverall, financial services remain a core focus for U.K.'s equity-funded blockchain startups, per the report, with 6 in 10 B2B (business to business) startups serving the financial sector."],"hashtag":[]}