{"summary":"The dForce attacker has returned entire $25 million worth of stolen funds back to the DeFi project\nSergej Kunz, CEO of 1inch.exchange, told The Block that the exchange aggregator got a request from Singapore police for revealing the attacker’s IP data and helped dForce recover the stolen funds\nA Singapore police spokesperson declined to provide details, telling The Block that the information is “confidential in nature”  ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/62530\/dforce-attacker-returns-all-25m-stolen-funds-back-to-the-defi-project","publishDate":"2020-04-21T03:00:52","id":3314,"type":null,"title":"dForce attacker returns all $25M stolen funds back to the DeFi project","category":["DeFi"],"content":["In a new twist to the dForce attack saga, the exploiter has returned all stolen funds - worth about $25 million - back to the Chinese decentralized finance (DeFi) project.","Yesterday, the attacker <a href=\"https:\/\/www.theblockresearch.com\/open-finance-exploitation-episode-iii-and-iv-62400\" data-v-f87c67ca=\"\">returned<\/a> $2.79 million to dForce, and today the rest of the amount i.e. nearly $22 million, has been returned, according to Etherscan <a href=\"https:\/\/etherscan.io\/tokentxns?a=0xa9bf70a420d364e923c74448d9d817d3f2a77822\" data-v-f87c67ca=\"\">data analyzed by The Block Research.<\/a><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-offset-key=\"b065r-2-0\" data-v-f87c67ca=\"\">Sergej Kunz, CEO of <\/span><span class=\"Link__link___Z6Bdx\" data-v-f87c67ca=\"\"><span data-offset-key=\"b065r-3-0\" data-v-f87c67ca=\"\">1inch.exchange,<\/span><\/span><span data-offset-key=\"b065r-4-0\" data-v-f87c67ca=\"\">&nbsp;told The Block that the<\/span> attacker has returned all the funds because their IP address was shared with Singapore police.<span data-offset-key=\"b065r-4-0\" data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"We got a request from Singapore police and we were helping dForce. Based on the request, we delivered to the police the IP addresses and sensitive meta information, which the hacker speeded by using our CDN,\" Kunz told The Block.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"We reacted very fast [when the police sent an email]... we protect the user data, but in such a case it is a must to help police... the idea was to make pressure as much possible to the hacker,\" Kunz told The Block.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/span>A Singapore police spokesperson declined to provide details, telling The Block that the information is \"confidential in nature.\"&nbsp;&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe returned funds are now worth about $24.3 million, which is slightly less than the value of the stolen funds because the exploiter converted some of them and they lost some value:","","","<span data-v-f87c67ca=\"\">Source: Etherscan, The Block Research<\/span>","After publication of this story, dForce founder and CEO Mindao Yang <a href=\"https:\/\/mp.weixin.qq.com\/s\/jFsytlmHMV8V0OrHJsk5XQ\" data-v-f87c67ca=\"\">confirmed<\/a> retrieving stolen funds. \"We have successively recovered the stolen assets with the assistance of all parties. However, because some assets were converted into other tokens during the stolen process, we need more time to conduct asset accounting and formulate the next distribution plan,\" said Yang on his WeChat account.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nMulticoin Capital-backed dForce was <a href=\"https:\/\/www.theblockcrypto.com\/linked\/62346\/multicoin-capital-backed-defi-protocol-dforce-loses-25m-total-locked-value-in-an-exploit\" data-v-f87c67ca=\"\">exploited<\/a> last weekend, during which it lost nearly 100% of its total value locked. The attacker had got access to the following coins and tokens:","","","<span data-v-f87c67ca=\"\">Source: Etherscan, The Block Research<\/span>","Multicoin Capital principal Mable Jiang, who <a href=\"https:\/\/www.theblockcrypto.com\/post\/61903\/chinese-defi-startup-dforce-raises-1-5m-in-funding-led-by-multicoin-capital\" data-v-f87c67ca=\"\">led<\/a> the dForce investment last week, declined to comment on the attacker returning stolen funds.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nNotably, The Block has learned that ParaSwap declined to help dForce with the attacker's information because they said they being a French company follow GDPR (General Data Protection Regulation) laws. But that is not true, a person familiar with the matter, told The Block. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"They [ParaSwap] don’t have any contact information on the website, which is required and can cause €200k punishment. Also, they collect user email addresses for the notification system if the price change and also IP addresses and don’t have any policy on the webpage,\" the person told The Block.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nParaSwap founder and CEO Mounir Benchemled brushed those allegations off, telling The Block: \"ParaSwap hasn’t been contacted by any domestic (French) or foreign authority. It is illegal for enterprises to communicate user data to private individuals or private organizations that do not go through legal channels to access these data. ParaSwap has acted according to company values that promote the respect of the security and privacy of our users.\"","Regarding the lack of contact information on the website, Benchemled said the ParaSwap has an Intercom chat integrated on its website, as well as has other social channels.&nbsp;","\"The notification system is an optional feature, an extra service that we offer to our users, a 'price alert' that they can choose or not, very similar to industry standards. It is not by any means a way to 'collect' their email address. We don't use these for any other communication regarding ParaSwap besides the request for which our users allowed us to (the specific price alert and only that). Therefore, the email address given by users in this context is only a transactional one, as desired by our users, without any other purpose (i.e. marketing),\" Benchemled added.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nNotably, ParaSwap's <a href=\"https:\/\/paraswap.io\/public\/ps_tos.pdf\" data-v-f87c67ca=\"\">privacy policy<\/a> is dated April 21. Benchemled told The Block: \"We made some small modifications yesterday...ParaSwap Pool section wasn't clear enough. There was a typo on page 9 of the policy, and the insurance link wasn't pointing to the right page.\"","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Update:<\/strong> This story has been updated to include comments from <span class=\"Link__link___Z6Bdx\" data-v-f87c67ca=\"\"><span data-offset-key=\"b065r-3-0\" data-v-f87c67ca=\"\">1inch.exchange CEO <\/span><\/span><span data-offset-key=\"b065r-2-0\" data-v-f87c67ca=\"\">Sergej Kunz,&nbsp; ParaSwap founder and CEO Mounir Benchemled, Singapore police, and more information.&nbsp;<\/span><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThis is a developing story: We'll give updates on the situation as we learn more.<\/span><\/em>"],"hashtag":[]}