{"summary":"Aave has executed a treasury swap with Balancer to the tune of about $1 million of their respective tokens, following a unanimous vote.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/158706\/aave-dao-carries-out-1-million-treasury-swap-with-balancer","publishDate":"2022-07-20T10:13:36","id":3315,"type":null,"title":"Aave DAO carries out $1 million treasury swap with Balancer","category":["GOVERNANCE"],"content":["The Aave community has carried out a $1 million token swap with fellow decentralized finance (DeFi) protocol Balancer, following on from a successful on-chain <a href=\"https:\/\/app.aave.com\/governance\/proposal\/?proposalId=87\" data-v-f87c67ca=\"\">vote<\/a> concluded on July 19.","Tuesday’s vote was on a <a href=\"https:\/\/governance.aave.com\/t\/arc-strategic-partnership-with-balancer-part-1\/7617\/8\" data-v-f87c67ca=\"\">proposal<\/a> to swap 200,000 balancer (BAL) tokens worth $1.13 million for 16,907.28 aave (AAVE) tokens worth $1.62 million from the Aave treasury. The proposal called for the BAL tokens received to be paired with ether (ETH) in Aave’s 80\/20 BAL:ETH pool on Balancer.","Aave will then lock the liquidity seeded to the 80\/20 pool for one year. By locking its liquidity position, Aave will receive veBAL tokens which the project can use to vote for more BAL rewards on pools that support Aave token pairs on Balancer. This could put Aave in a position to attract more liquidity for its pools on Balancer and earn more revenue from increased yields in the process.","With the vote having passed, Aave executed the swap at a fixed rate of 1 AAVE for 11.829 BAL tokens. This exchange benchmark makes up for the almost $500,000 disparity in the token swap at the current spot prices of each coin.","The proposal, authored by Llama contributor Matthew Graham, described the token swap as an example of the ongoing collaboration between Aave and Balancer. According to Graham, the coin exchange is enough for both DeFi protocols to become major holders of each other’s tokens. “Each community will have influence in the other’s governance process, enabling them to best represent their interests and to collaborate,” Graham stated in the proposal.","Tuesday’s vote is also the latest treasury swap involving Balancer. The DeFi liquidity platform has already swapped governance tokens with other protocols like TribeDAO, PrimeDAO, mStable, and Gnosis. These swaps are reportedly part of Balancer’s efforts to incentivize liquidity in its veBAL market.","Treasury swaps are also the latest form of <a href=\"https:\/\/www.theblock.co\/post\/158441\/lido-finance-proposal-wants-lido-dao-to-sell-2-of-all-ldo-tokens\" data-v-f87c67ca=\"\">treasury management for DeFi protocols<\/a> amid the current bear market. DeFi projects have seen their pools of funds decline as the value of their native coins, which often dominate these treasuries, have fallen since the start of the year. Many projects are now trying to see what measures they can put in place to prevent their treasuries from declining further.","<em data-v-f87c67ca=\"\">This article has been updated to state that Chris Graham is a contributor to the Llama project.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Chris Graham","content":"PERSON"},{"type":"$1 million","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"Gnosis","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$1.13 million","content":"MONEY"},{"type":"$1.62 million","content":"MONEY"},{"type":"July 19","content":"DATE"},{"type":"Graham","content":"PERSON"},{"type":"$500,000","content":"MONEY"},{"type":"Matthew Graham","content":"PERSON"}],"hashtag":["AAVE"],"authors":["Osato Avan-Nomayo","The Block"]}