{"summary":"Sen. Cynthia Lummis, R-Wyo., an outspoken policymaker on digital asset issues, cast doubt on legislation that would give the Commodity Futures Trading Commission more power over crypto markets. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/190366\/lummis-casts-doubt-on-bankman-fried-backed-bill-plugs-own-solutions","publishDate":"2022-11-28T16:02:51","id":332,"type":null,"title":"Lummis casts doubt on Bankman-Fried-backed bill, plugs own solutions","category":["POLICY"],"content":["In light of the FTX collapse, Sen. Cynthia Lummis, R-Wyo., sees a brighter future for her signature crypto legislation in the next congressional session.","While noting that little action in Congress is imminent before the end of this year, \"w<span class=\"fontstyle0\" data-v-f87c67ca=\"\">hen we reconvene in January with the new Congress I'm very hopeful that the Lummis-Gillibrand bill will be high on our legislative agenda,\" Lummis said in a pre-recorded interview for a Financial Times event in London. <\/span><span class=\"fontstyle0\" data-v-f87c67ca=\"\">\"Now we may need to break it apart into standalone pieces that go to different committees.\"&nbsp;<\/span>","The bill, also known as the Responsible Financial Innovation Act, is wide-ranging legislation that since its June introduction seemed aimed at <a href=\"https:\/\/www.theblock.co\/post\/177371\/pieces-of-crypto-bill-could-pass-in-six-months-authors-lummis-and-gillibrand-say\" data-v-f87c67ca=\"\">being broken up<\/a> into smaller bills.","The bill would amend current securities laws to accommodate digital assets, as well as set new rules around taxation, custody, consumer protection and other areas of federal law touching on cryptocurrencies. Lummis said she's also open to tightening up definitions around digital assets in the bill, in collaboration with the Securities and Exchange Commission, who are concerned about \"unintended consequences,\" she said.","The Wyoming Republican cast some doubt on the status of another bill to create new rules around crypto markets and exchanges, the Digital Commodity Consumer Protections Act, or DCCPA. Lummis noted that \"FTX was heavily involved in drafting the bill,\" and argued,&nbsp;\"<span class=\"fontstyle0\" data-v-f87c67ca=\"\">That bill needs to be rewritten in a way that is more effective and neutral as to business models, but very, very focused on consumer protection.\"<\/span>","Lummis instead plugged her own bill as a safeguard against the alleged malfeasance that led to FTX's failure.&nbsp;","<span class=\"fontstyle0\" data-v-f87c67ca=\"\">\"The FTX failure, had they been complying with the regulatory regime in our bill, would not have happened,\" Lummis said. <\/span><span class=\"fontstyle0\" data-v-f87c67ca=\"\">\"Their customers need to know that when a customer allows someone to custody their asset — whether it's bitcoin or ethereum, or solana or cardano or anything else — that their custodied funds will be segregated from other monies, so when it goes into a bankruptcy or everything goes wrong, the customers' money is protected and not commingled with the mismanaged business entity's liabilities.\"<\/span>","FTX's recent <a href=\"https:\/\/www.theblock.co\/post\/185083\/ftx-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">bankruptcy filing<\/a> is one of higher-profile instances of crypto firms collapsing, leaving customers locked out of deposits they had thought to be safe.&nbsp;","<em data-v-f87c67ca=\"\">Kari McMahon contributed reporting to this article.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kari McMahon","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Wyo.","content":"LOCATION"},{"type":"January","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Lummis","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"London","content":"LOCATION"},{"type":"Cynthia Lummis","content":"PERSON"},{"type":"Financial Times","content":"ORGANIZATION"},{"type":"Gillibrand","content":"PERSON"}],"hashtag":["SEC","SENATE AGRICULTURE COMMITTEE"],"authors":["Kollen Post","The Block"]}