{"summary":"Citadel Securities is suing Portofino Technologies, a high-frequency crypto trading firm, alleging two former executives stole trade secrets as they tried to raise money and launch their startup.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231206\/citadel-employees-secrets-lawsuit-crypto","publishDate":"2023-05-17T14:00:27","id":3320,"type":null,"title":"Citadel sues crypto trading firm alleging former staff stole secrets","category":["COMPANIES"],"content":["Citadel Securities is suing high-frequency crypto trading firm Portofino, alleging two former executives stole trade secrets as they tried to raise money and launch their startup.","<a href=\"https:\/\/www.linkedin.com\/in\/leonardlancia\/?locale=en_US\" data-v-f87c67ca=\"\">Leonard Lancia<\/a> and <a href=\"https:\/\/www.linkedin.com\/in\/alex-casimo-bb721940\/\" data-v-f87c67ca=\"\">Alex Casimo<\/a>, co-founders of Portofino Technologies, allegedly accessed Citadel’s proprietary information during the development of their firm. Citadel wants to put them on trial to determine monetary damages and potential restitution, according to a complaint filed in New York.","The suit alleges the pair \"engaged in a brazen scheme to steal Citadel Securities’ trade secrets, lie to their Citadel Securities colleagues, and raid the ranks of Citadel Securities’ employees.”&nbsp;","A Portofino spokesperson called the suit from Citadel \"corporate bullying.\"","\"This claim is the latest step in a campaign by Citadel to seek to prevent Portofino from going about its legitimate business,\" the spokesperson said.&nbsp; \"It is unmeritorious, anticompetitive and a classic example of corporate bullying. We emphatically deny the accusations that have been levelled against us. We will fight this and are confident that we will be successful.\"","In September, <a href=\"https:\/\/www.theblock.co\/post\/170285\/ex-citadel-securities-employees-raise-50-million-for-crypto-market-maker-portofino-technologies\" data-v-f87c67ca=\"\">Portofino Technologies announced it had raised $50 million<\/a>&nbsp;with backers including Valar Ventures, Global Founders Capital and Coatue. The valuation was not disclosed.","Founded in April last year, the startup said it built high-frequency trading technology for digital assets and claimed to have already traded billions of dollars across both centralized and decentralized cryptocurrency exchanges and over the counter. Customers include institutions and web3 projects that require access to liquidity in the digital asset market.","Citadel's suit alleges that Lancia and Casimo \"were already deep into their efforts to build and raise capital for their new company\" nearly six months before notifying Citdael of their intent to resign and that Portofino’s founders \"left no doubt\" about how they were using Citadel Securities’ trade secrets.","In a pitch deck, Citadel said it found that \"the founders boasted that Portofino’s objective was to '[r]eplicate the most successful trading business model in traditional financial markets in crypto-currency markets.'”","\"In other words,\" the suit said, \"Portofino intended to use Citadel Securities’ trade secrets to 'replicate' Citadel Securities’ business.\"","<em data-v-f87c67ca=\"\">(Updates with comment from Portofino spokesperson.)<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lancia","content":"ORGANIZATION"},{"type":"April last year","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Coatue","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Portofino Technologies","content":"ORGANIZATION"},{"type":"Citadel","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Citadel Securities","content":"ORGANIZATION"},{"type":"Portofino","content":"LOCATION"},{"type":"Alex Casimo","content":"PERSON"},{"type":"Valar Ventures","content":"ORGANIZATION"},{"type":"Global Founders Capital","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":["LAWSUITS"],"authors":["Christiana Loureiro","The Block"]}