{"summary":"Crypto.com has signed a deal with the UFC, becoming its global official fight kit partner.\nThe goal of the deal is to “bring crypto to the mainstream,” Crypto.com CEO Kris Marszalek told The Block.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/110655\/crypto-com-ufc-fight-kit-partner","publishDate":"2021-07-07T06:45:01","id":3321,"type":null,"title":"Crypto.com becomes UFC&#x27;s official global &#x27;fight kit&#x27; partner","category":["Cryptocurrency"],"content":["Crypto.com has struck a deal with the Ultimate Fighting Championship (UFC), the world's leading mixed martial arts organization, becoming its \"first-ever global official fight kit partner.\"","The news means Crypto.com will now have its logo placed on UFC apparel worn by athletes in competitions, as well as clothing worn by their cornermen or women.","Apparel manufacturer <a href=\"https:\/\/www.mmamania.com\/2020\/7\/10\/21319941\/venum-replaces-reebok-as-exclusive-global-outfitting-apparel-partner-ufc-mma\" data-v-f87c67ca=\"\">Venum<\/a> is also UFC's existing partner and also has its logo on the fighters' kits. When asked how Crypto.com's partnership is different, UFC spokesperson Chris Bellitti told The Block that Venum is UFC's \"official outfitting and apparel partner, meaning Venum designs the fight kits for athletes to wear in competition as well as the fan apparel available for purchase.\"","Crypto.com, on the other hand, is the \"official branding partner on the fight kits, but plays no role in the design\/manufacture of the fight kits,\" said Bellitti.","Crypto.com says it will have significant visibility given UFC's global fan base of more than 625 million people and over 150 million social media followers. Crypto.com will also receive the designation of UFC's \"first-ever official cryptocurrency platform partner,\" creating a new sponsorship category for the UFC, it said.","The goal of the deal is to \"bring crypto to the mainstream, while raising our brand's profile by supporting the world's best athletes, teams, and leagues,\" Crypto.com CEO Kris Marszalek told The Block.","Crypto.com said it is a \"long-term partnership\" with the UFC, but declined to comment on the specific term. Typically, such deals are five to 10 years long (the UFC's last partnership was <a href=\"https:\/\/www.espn.in\/mma\/story\/_\/id\/31176357\/ufc-new-venum-uniform-deal-gives-fighters-slight-pay-bump\" data-v-f87c67ca=\"\">with Reebok for seven years<\/a>).","Crypto.com-branded assets will debut this Saturday, July 10, in Las Vegas during UFC 264, Dustin Poirier and Conor McGregor's trilogy fight.","This is not Crypto.com's first such sponsorship. The firm recently struck a deal with <a href=\"https:\/\/blog.crypto.com\/formula-1-r-announce-crypto-com-as-global-partner-and-inaugural-partner-of-the-f1-sprint-series-cn\/\" data-v-f87c67ca=\"\">Formula One (F1)<\/a> for a reported <a href=\"https:\/\/www.businessinsider.in\/cryptocurrency\/news\/formula-one-strikes-a-100-million-sponsorship-deal-with-a-crypto-exchange-for-five-years\/articleshow\/84013515.cms\" data-v-f87c67ca=\"\">$100 million<\/a>, becoming its first official cryptocurrency sponsor and NFT partner. Crypto.com declined to comment on the size of the UFC deal, but according to CNBC's sources, it is <a href=\"https:\/\/www.cnbc.com\/2021\/07\/07\/ufc-gets-sports-cryptocurrency-money-with-fight-kit-sponsorship-.html\" data-v-f87c67ca=\"\">worth $175 million<\/a> over ten years.","Earlier this year, Crypto.com also collaborated with F1 team <a href=\"https:\/\/blog.crypto.com\/crypto-com-partners-with-aston-martin-cognizant-formula-one-team\/\" data-v-f87c67ca=\"\">Aston Martin Cognizant<\/a>, the National Hockey League team <a href=\"https:\/\/insidersport.com\/2021\/03\/18\/montreal-canadiens-add-crypto-com-to-sponsorship-portfolio\/\" data-v-f87c67ca=\"\">Montreal Canadiens<\/a>, and football league <a href=\"https:\/\/blog.crypto.com\/crypto-com-becomes-official-cryptocurrency-nft-sponsor-of-the-2021-coppa-italia\/\" data-v-f87c67ca=\"\">Lega Serie A.<\/a>","Crypto firms have started spending millions of dollars trying to attract non-crypto natives. Earlier this year, crypto exchange <a href=\"https:\/\/www.theblockcrypto.com\/linked\/100858\/ftx-miami-heat-partnership-is-official\" data-v-f87c67ca=\"\">FTX struck a $135 million deal<\/a> with the Miami Heat basketball team to rename the Heat's home stadium to \"FTX Arena.\" In a similar deal last month, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/107210\/ftx-tsm-e-sports-team-rename-deal-crypto\" data-v-f87c67ca=\"\">FTX spent $210 million<\/a> to rename a professional e-sports team from TSM to TSM FTX. Most recently, FTX <a href=\"https:\/\/www.theblockcrypto.com\/post\/109970\/tom-brady-equity-stake-crypto-exchange-ftx-gisele-bundchen\" data-v-f87c67ca=\"\">appointed<\/a> American football star Tom Brady as its brand ambassador, giving him equity in the exchange."],"hashtag":["CRYPTO"]}