{"summary":"Coinbase has briefed market-making and trading firms about the plans to roll out the platform in an offshore jurisdiction in a move that will pit it against rival Binance, which dominates the space.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/220853\/coinbases-proposed-overseas-trading-venue-would-offer-derivatives-sources","publishDate":"2023-03-17T11:54:42","id":3321,"type":null,"title":"Coinbase&#x27;s proposed overseas trading venue would offer derivatives: Sources","category":["COMPANIES"],"content":["Crypto exchange Coinbase is exploring launching an offshore platform to trade perpetual swaps tied to cryptocurrencies, according to two sources familiar with the firm’s aspirations to gate-crash a sector dominated by rival Binance.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe firm has briefed market-making and trading firms about the plans to roll out the platform in an offshore jurisdiction. Perpetual swaps — a type of future and a popular product in the crypto space – will be among the offerings. They provide a more capital-efficient way for traders to make bets on the underlying crypto market.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"As shared on our blog, we are accelerating our 'Go Broad, Go Deep' international strategy across six continents to better serve our global user base,\" a Coinbase spokesperson said by email. \"Our international expansion drive will focus on high-bar regulatory jurisdictions.\"","Bloomberg reported earlier that Coinbase Global is considering setting up a new trading platform overseas, without specifying what the new venue would trade.","Crypto exchange behemoth Binance commands a plurality of market share in bitcoin futures, according to The Block’s data dashboard. At its peak, FTX was a large player in the market as well, with nearly 25% market share in early 2021.","Last year, Coinbase <a href=\"https:\/\/www.coinbase.com\/blog\/coinbases-path-to-creating-a-robust-and-regulated-crypto-derivatives-market\" data-v-f87c67ca=\"\">acquired<\/a> of FairX, a CFTC-regulated derivatives exchange, and in 2021 applied for membership in the National Futures Association, the U.S. self-regulatory organization for such businesses.&nbsp;","<em data-v-f87c67ca=\"\">Update: This story was updated with Coinbase comment.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"National Futures Association","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"25%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"Coinbase Global","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Coinbase spokesperson","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["BINANCE","COINBASE"],"authors":["Christiana Loureiro","Frank Chaparro","The Block"]}