{"summary":"Starbucks is putting an end to its Odyssey Beta program, an NFT-related extension to its existing rewards system.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282934\/starbucks-odyssey-beta-nft-closure","publishDate":"2024-03-16T03:22:18","id":3322,"type":null,"title":"Starbucks shutting down Odyssey Beta NFT program","category":["CORPORATE NFTS"],"content":["Starbucks is putting an end to its Odyssey Beta program, an NFT-related extension to its existing rewards system.","The American multinational coffee chain <a href=\"https:\/\/odyssey.starbucks.com\/#\/faq\" data-v-f87c67ca=\"\">wrote<\/a> in an official blog post yesterday that the Starbucks Odyssey Beta program \"must come to an end to prepare for what comes next as we continue to evolve the program.\"","Starbucks Odyssey Beta will close on March 31.","The company's nonfungible tokens, called Stamps, will remain accessible on Nifty Gateway, a curated NFT platform. Its Odyssey marketplace will transition to the Nifty marketplace, but Stamps can be — like other NFTs — transferred to external wallets and traded on other marketplaces.","Starbucks Odyssey is also shutting down its Discord server on March 19.","\"As we look to evolve the program, we will be keeping the community in mind, and we are working to have a place for members to connect in the future,\" the company wrote.","\"While the Starbucks Odyssey Beta program is ending, we are excited for you to see what comes next and are grateful for your consistent engagement and feedback,\" it added. \"We are thankful to have had this opportunity to test into these different ways of driving community and loyalty at Starbucks and we look forward to bringing these learnings to a broader audience.\"","The coffee company shuttering its NFT program may not come as a surprise to some. It notably <a href=\"https:\/\/www.theblock.co\/post\/227573\/starbucks-nft-first-store-collection-fails\" data-v-f87c67ca=\"\">failed to sell out its Starbucks First Store Collection<\/a> — which was sold, at the time, for $100 per token — in April 2023.","The news also comes at a time when NFT mints on Ethereum are trending to historic lows, according to The Block's data.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/nft-overview\/ethereum-nft-mints\/embed\" title=\"Ethereum NFT Mints\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"April 2023","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Starbucks Odyssey Beta","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"March 19","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Starbucks First Store Collection","content":"ORGANIZATION"},{"type":"March 31","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Nifty Gateway","content":"ORGANIZATION"},{"type":"Starbucks Odyssey","content":"ORGANIZATION"},{"type":"$100","content":"MONEY"},{"type":"Starbucks","content":"ORGANIZATION"}],"hashtag":[],"authors":["Adam James","The Block"]}