{"summary":"Mahe, Seychelles, 6 December, 2023 - BitMEX, the market-leading crypto derivatives exchange, announces today a strategic partnership with PowerTrade, an","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266286\/bitmex-forms-a-strategic-partnership-with-powertrade-to-meet-product-demands-from-professional-traders","publishDate":"2023-12-06T09:00:56","id":3324,"type":null,"title":"BitMEX Forms a Strategic Partnership with PowerTrade to Meet Product Demands from Professional Traders","category":["SPONSORED"],"content":["<strong data-v-f87c67ca=\"\">Mahe, Seychelles, 6 December, 2023<\/strong> -<a href=\"https:\/\/www.bitmex.com\/\" data-v-f87c67ca=\"\"> BitMEX,<\/a> the market-leading crypto derivatives exchange, announces today a strategic partnership with <a href=\"https:\/\/power.trade\/\" data-v-f87c67ca=\"\">PowerTrade<\/a>, an innovative crypto options platform backed by industry leaders Ascend Ventures, Pantera Capital, and Ledger Prime amongst others.","<br data-v-f87c67ca=\"\">\nThe strategic partnership will explore the integration of new products to BitMEX’s comprehensive portfolio and reinforce the platform’s commitment to pioneering innovation and enhancing its trading experience for users.","<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">Stephan Lutz, CEO at BitMEX<\/strong>, states, \"The strategic partnership with PowerTrade exemplifies our ambition to offer crypto traders the most profitable opportunities on the safest and most reliable trading platform in the market. We recognise the dynamics and competitive nature of the market, and we hope to set new standards for the future of crypto trading.\"","<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">PowerTrade's team, led by CEO Mario Gomez Lozada<\/strong>, brings extensive expertise from traditional finance and cryptocurrency sectors. Lozada comments, \"This partnership aims to develop a game-changer in the market, combining our advanced financial products with BitMEX's established user base and liquidity.\"","<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">About BitMEX<\/strong> <br data-v-f87c67ca=\"\">\n<a href=\"https:\/\/www.bitmex.com\/\" data-v-f87c67ca=\"\">BitMEX<\/a> stands as a globally leading exchange for crypto derivatives, offering traders a professional-grade trading platform. Since its inception in 2014, BitMEX has maintained an impeccable security record with “no coin lost, ever!”.","BitMEX Forms a Strategic Partnership with PowerTrade to Meet Product Demands from Professional Traders 1 <br data-v-f87c67ca=\"\">\nOur platform caters to cryptocurrency derivatives traders by providing low latency, deep liquidity, and maximum availability.","Currently, BitMEX offers more than 100 derivatives contracts, 11 pairs for spot trading, and an easy covert function between 30 different cryptocurrencies.","In 2015, BitMEX revolutionised the market by inventing the Perpetual Swap, which has since become the most widely traded crypto product. Demonstrating a commitment to transparency, since 2021, BitMEX has been among the first exchanges to regularly publish its on-chain Proof of Reserves and Proof of Liabilities, ensuring that the funds available exceed the total client balances.\"","For more information on BitMEX, company initiatives, product listings, launches and competitions, please visit the BitMEX Blog or www.bitmex.com, and follow Discord, Telegram and Twitter. <br data-v-f87c67ca=\"\">\nFor further inquiries, please contact <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"4f3f3d2a3c3c0f2d263b222a37612c2022\">[email&nbsp;protected]<\/a>.","<strong data-v-f87c67ca=\"\">About PowerTrade<\/strong> <br data-v-f87c67ca=\"\">\n<a href=\"https:\/\/power.trade\/\" data-v-f87c67ca=\"\">PowerTrade<\/a> is a leading crypto derivatives exchange specialising in USD-settled, European crypto options for Bitcoin and Ethereum, as well as perpetual swaps, futures, and spot markets. Catering to institutional firms and professional traders, PowerTrade offers a robust RFQ system, customisable multi-leg options structures, and a competitive fee structure. For more information, visit Power.Trade.","<strong data-v-f87c67ca=\"\">Contact PowerTrade<\/strong> <br data-v-f87c67ca=\"\">\nGeneral Media Inquiries: Sam Patton (Head of Marketing) ● Email: <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"2655474b665649514354085254474243\">[email&nbsp;protected]<\/a> <br data-v-f87c67ca=\"\">\nPartnerships &amp; Collaboration: Bernd Sischka (Head of Institutional Sales) ● Email: <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"593b3c2b373d1929362e3c2b772d2b383d3c\">[email&nbsp;protected]<\/a> and Twitter.","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by PowerTrade <\/i><i data-v-f87c67ca=\"\">and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Stephan Lutz","content":"PERSON"},{"type":"2014","content":"DATE"},{"type":"December, 2023","content":"DATE"},{"type":"2015","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"PowerTrade<\/strong> <br data-v-f87c67ca=\"\">\nGeneral Media Inquiries","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Sam Patton","content":"PERSON"},{"type":"Strategic Partnership","content":"ORGANIZATION"},{"type":"PowerTrade<\/strong> <br data-v-f87c67ca=\"\">\n<a href=\"https:\/\/power.trade\/\" data-v-f87c67ca=\"\">PowerTrade","content":"ORGANIZATION"},{"type":"Seychelles","content":"LOCATION"},{"type":"USD","content":"LOCATION"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"Mario Gomez Lozada","content":"PERSON"},{"type":"Ascend Ventures","content":"ORGANIZATION"},{"type":"PowerTrade","content":"ORGANIZATION"},{"type":"]<\/a> <br data-v-f87c67ca=\"\">\nPartnerships &amp; Collaboration","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}