{"summary":"The MakerDAO community is considering onboarding USDC as a DAI collateral, in addition to ETH and BAT\nThe move is to mitigate DAI liquidity risk, caused by the over $4 million undercollateral debt generated last week during ETH price crash\nMKR governance token holders will vote on this proposal tonight, with several details still under discussion","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/58873\/makerdao-community-considers-adding-usdc-as-collateral-to-ease-dai-liquidity-strain","publishDate":"2020-03-16T14:40:42","id":3324,"type":null,"title":"MakerDAO community considers adding USDC as collateral to ease DAI liquidity strain","category":["DeFi"],"content":["The MakerDAO community is considering whether to add the stablecoin USDC as an additional form of collateral in an attempt to inject more Dai liquidity into the decentralized finance (DeFi) ecosystem.&nbsp;","During last Thursday's ETH price crash, a roughly $4.5 million DAI deficit appeared as certain liquidators — known as Keepers — were able to win collateral liquidation auctions with 0 DAI. Put another way: the winners of these auctions did not reimburse the system with any DAI to erase the outstanding debt. As a result, the MakerDAO system will auction newly printed MKR on Wednesday to cover losses.","MakerDAO community members and governors are now weighing a proposal to add USDC as a third collateral type after ETH and BAT in order to \"help to create Dai liquidity and push the Dai peg back towards $1,\" according to a <a href=\"https:\/\/forum.makerdao.com\/t\/onboarding-usdc-as-collateral-to-mitigate-liquidity-risk\/1570\" data-v-f87c67ca=\"\">thread<\/a> posted in the MakerDAO online forum.&nbsp;","\"Given the ongoing liquidity risk of Dai in an uncertain market, both the community and members of the Maker Foundation have been making noise in the official chat about onboarding USDC as collateral as an emergency measure to help mitigate this liquidity risk,\" the thread stated.&nbsp;","MKR holders will likely vote on this proposal tonight at 23:15 UTC, while the MakerDAO Foundation, the nonprofit organization behind the DeFi protocol, is already \"making the technical preparation to make this possible,\" according to the thread.&nbsp;","Details of the mechanism, including setting a Stability Fee and Debt Ceiling for USDC-backed DAI, are still under discussion. A Stability Fee is an annual percentage interest rate that is calculated on top of the existing debt and paid by each MakerDAO vault owner. Community members on this morning's emergency governance call initially leaned towards setting a high stability fee for USDC to prevent non-Keepers from mining USDC-collateralized DAI, although this remains subject to change.&nbsp;","Keepers, on the other hand, would take advantage of the higher liquidity brought by USDC backed-DAI and use those newly minted DAI for liquidation auction. According to data <a href=\"http:\/\/makervaults.descipher.io\/\" data-v-f87c67ca=\"\">provided<\/a> by Vishesh Choudhy, roughly $52m worth of ETH collateral will be liquidated if the price of the digital asset falls below $56.&nbsp;&nbsp;","MKR holders then need to decide on USDC's debt ceiling, which is the maximum amount of debt that can be minted against a single collateral type. If the stability fee is on the higher end, the ceiling should also be higher to be able to provide enough liquidity. However, the debt ceiling should also not be so high to generate additional risk.&nbsp;","Other considerations include hard-coding USDC price to $1 instead of using a price oracle and deciding on a liquidation ratio that can incentivize users to mint USDC-backed DAI.&nbsp;","\"Adding USDC as collateral to Maker is valuable, as it provides an auxiliary source of credit backed by stable collateral in order to inject and provide DAI liquidity in moments of market dislocation as witnessed over the past week,\" said Parafi Capital principal Kevin Yedid-Botton, whose fund serves as a market maker on various DeFi protocols.&nbsp;"],"hashtag":["DAI","USDC"]}