{"summary":"Twitter could be added as a defendant in the class action lawsuit that alleges dogecoin is a Ponzi scheme being manipulated by Elon Musk, if the plaintiffs can demonstrate that changing Twitter&#x27;s logo to a shiba inu was part of the scam.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225894\/https-www-theblock-co-post-152538-elon-musk-twitter-accused-dogecoin-ponzi-class-action","publishDate":"2023-04-12T08:05:52","id":3326,"type":null,"title":"Twitter targeted in dogecoin lawsuit if Elon Musk can&#x27;t get case dismissed","category":["PEOPLE"],"content":["Twitter will be added as a defendant in the <a href=\"https:\/\/www.theblock.co\/post\/152538\/tesla-ceo-elon-musk-accused-of-dogecoin-ponzi-scheme-in-new-class-action-lawsuit\" data-v-f87c67ca=\"\">class action lawsuit that alleges dogecoin is a Ponzi scheme<\/a> being manipulated by Elon Musk, if the plaintiffs get their way, a lawyer in the case told The Block.","Lawyers for Tesla, the Dogecoin Foundation, and Musk asked a U.S. federal district court in New York to dismiss the case against them on March 31. The case was brought by investors who lost money when the price of dogecoin collapsed between 2019 and 2021, after Musk appeared to stop supporting the memecoin. During that period, Musk made many supportive tweets of the coin. But in May 2021, he appeared on Saturday Night Live and called dogecoin “a hustle”.","The dogecoin price plummeted, wiping out $86 billion in value as a result, the suit claims.","Although Musk had been named personally as a defendant Twitter itself has not yet been sued. But in October, Musk acquired Twitter and named himself as chief executive officer. In early April, he changed Twitter’s logo for that of a shiba inu dog — the icon of dogecoin. <a href=\"https:\/\/www.theblock.co\/post\/224621\/dogecoin-skyrockets\" data-v-f87c67ca=\"\">The price of DOGE rallied 30%<\/a> before collapsing again a few days later <a href=\"https:\/\/www.theblock.co\/post\/225328\/dogecoin-dives\" data-v-f87c67ca=\"\">when Musk reverted the logo back to the blue bird<\/a>.","The Block asked lawyers on both sides if Musk’s recent antics would complicate the pre-existing lawsuit. Lawyers for Musk and Tesla did not respond.","Perhaps unsurprisingly, Evan Spencer, who represents the investors who claim they lost money on dogecoin due to Musk’s manipulation of its price, said he believed Musk’s logo change could drag Twitter into the case.","“After reviewing Defendants motions to dismiss we are more confident than ever that we will prevail in this case,” he told the Block. “Our opposition&nbsp;brief&nbsp;will be filed within 60 days.&nbsp;After the court rules in our favor, we will be filing a motion to add Twitter as a Defendant.”","He declined further comment.","<strong data-v-f87c67ca=\"\">Related stories:<\/strong>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$86 billion","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"May 2021","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Tesla","content":"LOCATION"},{"type":"Tesla","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Dogecoin Foundation","content":"ORGANIZATION"},{"type":"March 31","content":"DATE"},{"type":"Night","content":"TIME"},{"type":"Musk","content":"ORGANIZATION"},{"type":"Evan Spencer","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"April","content":"DATE"},{"type":"Saturday","content":"DATE"}],"hashtag":["ELON MUSK","LAWSUITS"],"authors":["Jim Edwards","The Block"]}