{"summary":"The team responsible for the viral Saint Fame project is releasing a new platform that lets brands capture their products’ resale value using a bonding curve\nThe project’s creator, Jacob Horne, explained how the team built out Saint Fame in one day and witnessed the product go through a full hype cycle\nAccording to Horne, the Genesis Shirts will be ready for redemption in around a week","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/57358\/team-behind-viral-saint-fame-t-shirt-comes-out-of-stealth-with-new-online-marketplace","publishDate":"2020-03-02T09:00:15","id":3326,"type":null,"title":"Team behind viral Saint Fame T-shirt comes out of stealth with new online marketplace","category":["Projects"],"content":["<span data-v-f87c67ca=\"\">The team behind the viral Saint Fame fashion house has launched a new platform to let fashion brands and musicians follow its successful T-shirt experiment and drop products in a tokenized form.<\/span>","<span data-v-f87c67ca=\"\"><a href=\"https:\/\/www.saintfame.com\/\" data-v-f87c67ca=\"\">Saint Fame<\/a> – the decentralized autonomous organization (DAO) that has created an Ethereum-based fashion house – took inspiration from <a href=\"https:\/\/unisocks.exchange\/\" data-v-f87c67ca=\"\">Unisocks<\/a>, a similar project issuing tokens representing a pair of limited edition socks.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Much like Unisocks, the FAME token is dynamically priced using a bonding curve, which means that the price increases every time a token is sold. The DAO was built on Uniswap’s protocol, utilizes Aragon to make governance proposals, and uses OpenZeppelin to deploy smart contracts.<\/span>","<span data-v-f87c67ca=\"\">Since its launch in December 2019, the price of a single FAME token – relative to one Genesis Shirt – has risen from $8 to $402, with 79 of the 100 limited-edition Genesis Shirts already sold at the time of writing.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The new platform, called <a href=\"https:\/\/www.ourzora.com\/\" data-v-f87c67ca=\"\">Zora<\/a>, is essentially an online marketplace where all brands and creators can copy Saint Fame’s strategy. The pitch, according to <\/span><span data-v-f87c67ca=\"\">the project’s creator Jacob Horne, is to allow brands to capture their products’ resale value.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I like to describe the problem as the Yeezy problem,” he said. “When Kanye sells a pair of Yeezy, he sells them at a flat rate of $200. Then a whole bunch of professionals wait in line hours to buy them and immediately resell them for $2000. Kanye and Adidas don’t get any of that extra revenue they could’ve captured themselves.”<\/span>","<span data-v-f87c67ca=\"\">With Zora, on the other hand, brands generate revenues based on their products’ real-world demand. <\/span><span data-v-f87c67ca=\"\">All items will be tokenized and sold on a bonding curve. On the brand-creation <\/span><span data-v-f87c67ca=\"\">side, up-and-coming brands can use the platform to engage the community in the early stages and garner excitement around a new product before it even exists. On the speculative side, people can purchase fractions of an item to trade on secondary markets.<\/span>","<span data-v-f87c67ca=\"\">“Saint Fame was a happy experiment that blew up more than we ever could have expected,” said Horne. “We got a lot of inbound interest from brands and musicians who wanted to do the same thing.”<\/span>","<span data-v-f87c67ca=\"\">“We'd like to use Saint Fame as the first brand and customer of Zora,” he said. “Eventually, our goal is building out Zora to help anyone in the world create their own ‘Saint Fame.’”<\/span>","<span data-v-f87c67ca=\"\">The platform does not yet have a clear revenue model. Horne said it would be either a percentage of revenue generated from the token or a fee in the token itself. Zora also does not have a community-based governance structure, but the team is exploring ways to do so, including potentially launching a platform token.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Its 2020 goal, according to Horne, is to onboard 100 high-quality brands and continue to educate the broader population about the concept of DAOs. <\/span>","<span data-v-f87c67ca=\"\">Horne had been a product manager at Coinbase for over three years (he recently resigned from his post to focus on Zora). On Nov. 11, 2019, he found himself with a full day off for Veterans Day and decided to test out an idea he'd had for a long time.<\/span>","<span data-v-f87c67ca=\"\">He called up a designer friend. They started with a simple Twitter profile with a description of the idea – an Internet-owned fashion house – and finished building the DAO that same day, expecting little to happen.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We shipped it at around 1:30 a.m. I put out one tweet, expecting nothing to happen,” he recalled. “I woke up in the morning and it had done over $10,000 in volume already.”<\/span>","<span data-v-f87c67ca=\"\">At the time when Horne launched the FAME token, he did not even know how the shirt was going to look. The only information they put out was that the shirt would be designed by Matthew Vernon, nicknamed “Dapp Boi.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We love the Unisocks project and thought ‘how can we push this one step further?’” he said. “So, we decided to launch before we even know what the design of the shirt was going to be.”<\/span>","<span data-v-f87c67ca=\"\">In the weeks that followed, Horne watched the price surge and the demand increase. Before the design was even announced, one FAME token was already worth more than $200 and the volume reached nearly $20,000.<\/span>","<span data-v-f87c67ca=\"\">When Vernon finally submitted his work, the DAO – consisting of around ten members – voted to approve it. Curiously, the price dropped back to $80 before slowing climbing up to its current value.<\/span>","<span data-v-f87c67ca=\"\">“We were literally seeing the hype cycle play out,” Horne said. “So we've spent the past couple of months getting the highest possible quality shirts made. We got some amazing packaging and we're hoping to enable redemption in the next week or so.”<\/span>","<span data-v-f87c67ca=\"\">Though taking heavy inspiration from Unisocks, Saint Fame tried to improve upon the latter by letting the DAO create and own the FAME tokens itself. According to Horn, it was the first DAO to actually create an exchange directly on Uniswap and add liquidity to it.<\/span>","<span data-v-f87c67ca=\"\">As the Genesis Shirt is almost ready for redemption, Horne confirmed that the fashion house has more products in the works. “Stay tuned,” he said.<\/span>"],"hashtag":["COINBASE"]}