{"summary":"UK’s financial regulator is set to strengthen its rules on how crypto products are marketed.\nThe regulator wants consumers to understand what they are investing in.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/130767\/uk-regulator-issues-draft-rules-to-tighten-crypto-promotions","publishDate":"2022-01-19T04:20:18","id":3327,"type":null,"title":"UK FCA issues draft rules to tighten crypto promotions","category":["Regulation"],"content":["The UK's Financial Conduct Authority (FCA) is set to strengthen its rules on how high-risk financial products, including crypto, are marketed.","The regulator <a href=\"https:\/\/www.fca.org.uk\/publication\/consultation\/cp22-2.pdf\" data-v-f87c67ca=\"\">has issued draft rules this morning<\/a>, proposing restrictions on the marketing of certain crypto assets. The rules essentially bar firms from promoting crypto products to users without assessing their financial knowledge and experience.","The draft rules come a day after HM Treasury, the UK's finance ministry, <a href=\"https:\/\/www.theblockcrypto.com\/post\/130571\/uk-government-latest-to-ramp-up-scrutiny-of-crypto-ads\" data-v-f87c67ca=\"\">confirmed<\/a> that it intends to extend the scope of the Financial Promotions Order to include \"qualifying\" crypto assets.","\"We only want consumers to access [cryptoassets] knowingly, and after they have been assessed as having sufficient knowledge and experience to understand the risks involved,\" said the FCA.","\"We are therefore proposing to apply the same financial promotion rules to cryptoassets as we are proposing to apply to other high-risk investments,\" which are categorized as 'Restricted Mass Market Investments,' it added.&nbsp;","Such investments can generally be mass-marketed, but subject to certain conditions.","These conditions include categorizing the recipient of a crypto promotion as either a certified high-net-worth investor, a certified sophisticated investor, a self-certified sophisticated investor, or a certified \"restricted\" investor.","Secondly, firms must consider the consumer's investment knowledge and experience to assess whether the product is appropriate for them.","The FCA is inviting feedback on its draft rules by March 23 and intends to confirm its final rules in summer of this year.","The FCA defines qualifying cryptoassets as \"any cryptographically secured digital representation of value or contractual rights which is: (a) fungible; (b) transferable or confers transferable rights, or is promoted as being transferable or as conferring transferable rights, except if transferable or conferring transferable rights, or promoted as such, only to one or more vendors or merchants in payment for goods or services; (c) not any other controlled investment; (d) not electronic money; and (e) not currency issued by a central bank or other public authority.\"","That means non-fungible tokens or NFTs don't fall under the FCA's draft crypto promotion rules.","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Several countries have recently tightened their rules around crypto promotions, including&nbsp;<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.theblockcrypto.com\/linked\/130457\/singapore-curbs-crypto-marketing-in-digital-asset-crackdown\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Singapore<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;and&nbsp;<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.theblockcrypto.com\/linked\/130499\/spain-announces-new-rules-for-influencer-crypto-posts\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Spain<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">.<\/span>"],"hashtag":["FCA"]}