{"summary":"Three high-fee Ethereum transactions took place last week. Out of these three transactions, two were by the same sender, in which they spent around $5 million in fees\nEthermine pool, which facilitated one of the two transactions, has decided to distribute $2.4 million worth of transaction fees to its miners\nSparkPool, the facilitator of the other transaction, has also decided to distribute the fee to miners","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/68288\/ethermine-will-distribute-mysterious-2-4-million-fee-to-miners-sparkpool-is-still-waiting-for-the-sender-to-surface","publishDate":"2020-06-15T11:14:24","id":3330,"type":null,"title":"Ethermine and SparkPool will distribute transaction fees to miners","category":["Ethereum"],"content":["Mining pool Ethermine, which on June 11 facilitated a high-fee Ethereum <a href=\"https:\/\/www.theblockcrypto.com\/linked\/67978\/a-bug-another-mysterious-ethereum-transaction-took-place-with-2-6-million-in-fees\" data-v-f87c67ca=\"\">transaction<\/a> in which a sender spent around $2.4 million — the second mysterious transaction from the same sender in as many days — has decided to distribute the fees among its miners.","Bitfly, the operator of Ethermine, <a href=\"https:\/\/twitter.com\/etherchain_org\/status\/1272425639673462784\" data-v-f87c67ca=\"\">tweeted<\/a> the news on Monday, saying it had given the sender a “sufficient” amount of time to get in contact.","Bitfly said multiple people have claimed to be the sender of the transaction, but that no one has been able to produce a valid signature of the sending account.","In <a href=\"https:\/\/twitter.com\/etherchain_org\/status\/1272425642559254531?s=20\" data-v-f87c67ca=\"\">another tweet<\/a>, Bitfly said Ethermine won’t \"interfere\" with the payout of large transaction fees in the future: “Our advertised payout policy is to always distribute the full block reward and we will be sticking to that independent [of] the amount involved.\"","The transaction was one of two high-fee transactions that took place last week — both from the same sender with the same fees. The <a href=\"https:\/\/www.theblockcrypto.com\/linked\/67881\/ethereum-miner-says-it-has-frozen-a-2-5-million-fee-paid-alongside-a-133-transaction\" data-v-f87c67ca=\"\">other transaction<\/a> was facilitated by SparkPool, which promptly froze the fees. The SparkPool transaction occurred on June 10, a day before the Ethermine transaction.","SparkPool was waiting until Monday for the sender to reach out, the pool's key account manager Shelton Qiu told The Block at the time.&nbsp; SparkPool <a href=\"https:\/\/twitter.com\/sparkpool_eth\/status\/1272809999392071680\" data-v-f87c67ca=\"\">tweeted<\/a> on Tuesday that it has decided to distribute the fee on June 17 to its miners since the sender hasn't contacted them.&nbsp;&nbsp;","Meanwhile, a <a href=\"https:\/\/twitter.com\/FrankResearcher\/status\/1271318008233750529\" data-v-f87c67ca=\"\">third high-fee transaction<\/a>, which involved over $540,000 in fees, also occurred last week. This one was from a different address that belongs to Mining Pool Hub.","F2Pool facilitated the third transaction. In a revised statement to The Block on Tuesday, the mining pool said it is yet to reach a final decision as to whether to divide the fee among its miners or return it to Mining Pool Hub.","Mining Pool Hub <a href=\"https:\/\/twitter.com\/FrankResearcher\/status\/1271318008233750529\" data-v-f87c67ca=\"\">reportedly suffered<\/a> a hack. The Block has reached out to the hub to inquire more, and will update this story should we hear back.","<em data-v-f87c67ca=\"\">Update (June 16): This story has been updated with a revised statement from F2Pool and new information from SparkPool.&nbsp;<\/em>"],"hashtag":["ETHEREUM"]}