{"summary":"The Block&#x27;s Frank Chaparro chats with Shaun Martinak, research and portfolio manager for digital assets at One River Digital.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/124108\/heres-one-rivers-crypto-pitch-to-multi-billion-dollar-pension-funds-and-endowments","publishDate":"2021-11-12T12:24:28","id":3331,"type":null,"title":"Here&#x27;s One River&#x27;s crypto pitch to multi-billion dollar pension funds and endowments","category":["PODCASTS"],"content":["<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Episode <strong data-v-f87c67ca=\"\">74 <\/strong>of Season 3 of The Scoop was recorded remotely with The Block’s Frank Chaparro and Shaun Martinak, Research and Portfolio Manager at One River Digital.<\/em><\/span>","<i data-v-f87c67ca=\"\">Listen below, and subscribe to The Scoop on&nbsp;<\/i><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Apple<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Spotify<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5tZWdhcGhvbmUuZm0vdGhlYmxvY2stdGhlc2Nvb3A?sa=X&amp;ved=0CAMQ4aUDahcKEwionbSO9fbxAhUAAAAAHQAAAAAQAg\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Google Podcasts<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Stitcher<\/i><\/a><i data-v-f87c67ca=\"\">&nbsp;or wherever you listen to podcasts. Email feedback and revision requests to <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"8afae5eee9ebf9fecafee2efe8e6e5e9e1e9f8f3fafee5a4e9e5e7\">[email&nbsp;protected]<\/a>.<\/i>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">This episode is brought to you by our sponsors <a href=\"http:\/\/Bakkt.com\" data-v-f87c67ca=\"\">Bakkt<\/a>,&nbsp;<a href=\"http:\/\/kraken.com\/scoop\" data-v-f87c67ca=\"\">Kraken<\/a>&nbsp;and&nbsp;<a href=\"http:\/\/masterworks.io\/scoop\" data-v-f87c67ca=\"\">Masterworks<\/a><\/strong><\/span>","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bakkt® unlocks the $1.2+ trillion of digital assets that is currently held in cryptocurrencies, rewards and loyalty points, gaming assets and merchant stored value. We began in 2018 with the vision to bring trust and transparency to digital assets. Through the Bakkt Warehouse and Bakkt Bitcoin Futures and Options contracts, we serve institutional clients in an end-to-end regulated market with true price transparency. For consumers, Bakkt aggregates digital assets to enable instant liquidity and to empower users to trade, transfer and pay however they want. Visit <a href=\"http:\/\/Bakkt.com\" data-v-f87c67ca=\"\">Bakkt.com<\/a> for more information<\/span><\/em><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">About Kraken<br data-v-f87c67ca=\"\">\n<\/strong><\/span><span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Whether you’re an experienced crypto trader or just starting out, Kraken has the tools to help you achieve financial freedom. With 50+ cryptocurrencies to choose from, industry-leading security and a wide variety of features to suit any investing strategy, Kraken puts the power in your hands to buy, sell and trade digital assets. Visit&nbsp;<\/em><a href=\"http:\/\/kraken.com\/scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Kraken.com<\/em><\/a><em data-v-f87c67ca=\"\">&nbsp;to get started today.<\/em><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">About Masterworks<br data-v-f87c67ca=\"\">\n<\/strong><\/span><em data-v-f87c67ca=\"\">Masterworks is democratizing the exclusive multi-trillion-dollar art world. Instead of needing to write a $10 million dollar check to buy one Picasso painting, you can buy shares of masterpiece paintings. Masterworks has securitized over $250 million worth of art for their 235,000 members and was recently valued at over $1 billion, making them the first and only unicorn in the alternative investing space. Invest like a billionaire today with a few easy clicks at&nbsp;<a class=\"c-link\" tabindex=\"-1\" href=\"http:\/\/masterworks.io\/scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"http:\/\/masterworks.io\/scoop\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">masterworks.io\/scoop<\/a><br data-v-f87c67ca=\"\">\n<iframe loading=\"lazy\" frameborder=\"0\" height=\"200\" src=\"https:\/\/playlist.megaphone.fm?e=BLOCK2725128094\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe><br data-v-f87c67ca=\"\">\n<\/em>","<br data-v-f87c67ca=\"\">\n\"It's really a matter of moving at the pace of the decisions of institutional players.\"","That's Shaun Martinak, research and portfolio manager at One River Digital, the newly-launched arm of One River Asset Management that's working with clients to add crypto exposure to their portfolios.&nbsp;","<span data-v-f87c67ca=\"\">In an interview during the latest episode of The Scoop podcast, Martinak observed that while institutional players have made headlines entering crypto, some of the largest investors--including pensions and endowments--account for only a small fraction of the crypto market. He believes that, in the future, there will be a place for such investments in the portfolios of these types of investors.&nbsp;<\/span>","\"I think between 2 and 10 percent is a perfectly good number,\" he said, speaking to the penetration of pension funds and endowments into crypto. \"And it's a matter of the timeline for education and the timeline for decision making. Those organizations are careful. They're careful because they manage the money of all of those people that we just referenced. So, you know, they don't make these decisions lightly.\"","He said such firms are actively seeking exposure though One River as they actively pitch for their business.&nbsp;","<span data-v-f87c67ca=\"\">\"I think the pitch is multifaceted, but it really boils down to: This is an area of fundamental growth at a time where fundamental growth is difficult to find.\"<\/span>","<strong data-v-f87c67ca=\"\">The metaverse&nbsp;<\/strong>","<span data-v-f87c67ca=\"\">While hesitant to make predictions on cryptocurrency portfolio allocation over the next 12 months, Martinak was enthusiastic about the growth and technological advancement he’s seen in the gaming segment.<\/span>","<span data-v-f87c67ca=\"\">Ultimately, he sees the possibility of gaming and NFT assets sitting alongside traditional assets in an investor's portfolio.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“When I think about the metaverse and I think about what digital assets and crypto primitives bring to existing in a space with other people in a digital environment, it just seems like it compounds how much time and attention we spend on our screens and in our information universe because your bank account is going to live in there with you, your value is going to live in there with you,\" he said.<\/span>","<span data-v-f87c67ca=\"\">As Martinak posits: “What is this going to look like in its version of the Super Bowl?”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bakkt Warehouse","content":"ORGANIZATION"},{"type":"$1.2+ trillion","content":"MONEY"},{"type":"$250 million","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Shaun Martinak","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Spotify","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"One River Digital","content":"ORGANIZATION"},{"type":"10 percent","content":"PERCENT"},{"type":"$10 million dollar","content":"MONEY"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"Martinak","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}