{"summary":"Founders of Huobi Group and OK Group are both dissolving their Chinese entities.\nThis won’t affect Huobi and OKEx’s crypto trading services because the two moved their exchange businesses out of China years ago.","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/112583\/crypto-exchange-huobi-dissolve-entity-china","publishDate":"2021-07-27T04:23:27","id":3331,"type":null,"title":"Crypto exchange Huobi is dissolving its entity in China","category":["Exchanges"],"content":["Huobi is dissolving an entity in Beijing that was founded in 2013 to operate its crypto exchange, which was originally based in China.","According to Chinese business registration <a href=\"http:\/\/bj.gsxt.gov.cn\/corp-query-entprise-info-enliqdetail.html?liId=961616e2d9274508a123e47e4f787a73&amp;crenotId=C7B12A5062FD5D31E0533E0B63A0D954&amp;nodeNum=110000\" data-v-f87c67ca=\"\">records<\/a>, stakeholders of Beijing Huobi Tianxia Network Technology Limited have passed a resolution to dissolve the firm, posting a notice on July 22. Li Lin, founder and CEO of Huobi Group, who also controls Beijing Huobi, is the person in charge of the clearing and liquidation process.","The notice didn't draw wider public attention until Tuesday when Chinese crypto media started to report on the dissolution. The share price of Huobi Tech, another Hong Kong-listed subsidiary of Huobi Group owned by Li, plunged by a whopping 21.88% during the trading hours on Tuesday.","","","Huobi's move comes just a month after Beijing Lekuda, founded by OK Group's Star Xu in 2012 to operate Huobi's then-rival exchange OKCoin, also <a href=\"http:\/\/bj.gsxt.gov.cn\/corp-query-entprise-info-enliqdetail.html?liId=93c4a82d1df340608d97996b8add0831&amp;crenotId=C57E151BCA427024E0533E0B63A02CAE&amp;nodeNum=110000\" data-v-f87c67ca=\"\">filed for dissolution<\/a>.","Huobi and OKEx's crypto trading services won't be affected since the two moved their exchange businesses out of China years ago. But the dissolving decisions come at a time when China is stepping up efforts to crack down on both crypto trading and mining activities inside the country.","Based on court judgements of multiple legal disputes involving <a href=\"https:\/\/wenshu.court.gov.cn\/website\/wenshu\/181107ANFZ0BXSK4\/index.html?docId=723ff0baf49a45c7b1e2abf100ebe0d8\" data-v-f87c67ca=\"\">Beijing Lekuda<\/a> and <a href=\"https:\/\/wenshu.court.gov.cn\/website\/wenshu\/181107ANFZ0BXSK4\/index.html?docId=e55585413c4344c6af91a89d00a54ea4\" data-v-f87c67ca=\"\">Beijing Huobi Tianxia<\/a>, the two entities had operated the Huobi and OKCoin exchanges in China since their inception. This ended when the People's Bank of China issued the ban in September 2017 on initial coin offerings and centralized fiat-to-crypto trading.","Since then, both exchanges have moved their trading businesses overseas although they still have significant user bases in China with employees stationed in the country as well. The two entities had also been used to register and manage the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/97992\/weibo-suspends-huobi-okex-binance\" data-v-f87c67ca=\"\">now-suspended<\/a> Weibo accounts of Huobi and OKEx exchanges.","A Huobi spokesperson said that because the Beijing entity \"has not had any business operations, it is unnecessary and has applied for cancellation.\"","They didn't specify what the arrangement will be for its China-based staffers but said the exchange is \"committed to its globalization process as it continues to hire employees from countries around the world.\"","\"In addition to allowing Huobi to better service the needs of its many international users, Huobi believes that by doing so, it will also improve its ability to ensure business continuity worldwide,\" they added in a statement."],"hashtag":["HTX"]}