{"summary":"Crypto exchange Bitfinex has launched a new exchange called Bitfinex Securities that will allow trading of tokenized equities and bonds.\n“We are basically trying to eat the lunch of London Stock Exchange and other traditional stock exchanges,” Bitfinex Securities CTO Paolo Ardoino told The Block.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/116728\/bitfinex-securities-new-exchange-tokenized-equities-bonds","publishDate":"2021-09-06T10:00:15","id":3333,"type":null,"title":"Bitfinex launches new exchange for trading tokenized equities and bonds","category":["The Block"],"content":["Crypto exchange Bitfinex is entering into the world of traditional finance with the launch of its new trading platform Bitfinex Securities.","Bitfinex Securities will allow small and medium-sized companies to list their tokenized equities, bonds, or funds and raise capital. In turn, Bitfinex Securities' customers will be able to invest in and trade tokenized securities.","This offering is different from stock token trading, which is offered by crypto exchanges such as <a href=\"https:\/\/www.google.com\/search?q=ftx+stock+tokens+site%3Atheblockcrypto.com&amp;oq=ftx+stock+tokens+site%3Atheblockcrypto.com&amp;aqs=chrome..69i57.9598j0j7&amp;sourceid=chrome&amp;ie=UTF-8\" data-v-f87c67ca=\"\">FTX<\/a> and <a href=\"https:\/\/www.theblockcrypto.com\/linked\/86836\/crypto-exchange-bittrex-tokenized-stock-trading\" data-v-f87c67ca=\"\">Bittrex Global.<\/a> This is because these two exchanges list tokens of stocks that are already public. Bitfinex Securities, on the other hand, will list equities, bonds, or funds of private companies that are looking to go public through a tokenized issue.","\"We are basically trying to eat the lunch of London Stock Exchange and other traditional stock exchanges,\" Bitfinex Securities CTO Paolo Ardoino told The Block in an interview.","Bitfinex Securities says it is based in Astana, Kazakhstan, and is regulated by the Astana International Financial Centre (AIFC) Authority. But the exchange currently has a conditional investment exchange license from the authority, Tim Aron, head of compliance at Bitfinex Securities, said in the interview. The conditional permit means Bitfinex Securities will operate in a sandbox environment until the full license is granted.","\"We will operate in a very controlled environment,\" said Aron. \"We have to limit the amount of capital raises at $15 million and the maximum number of customers at 1,000.\"","These limits are global and not per issuer, said Ardoino. That means if Bitfinex Securities does, say, three capital raises of $5 million each, it will have hit the limit.","Ardoino said these limits will be \"waived soon once we confirm with the regulator that the first raises went well\" and once a full license is issued.","When asked why Bitfinex Securities chose to be based and licensed in Astana, a relatively lesser-known jurisdiction, Ardoino said Astana is setting up as one of the financial capitals of Asia and has an \"extremely thorough\" regulatory process based on regimes in the U.K., Dubai and Abu Dhabi. \"We had been working on obtaining this license for the last year and a half,\" said Ardoino.","As with its crypto trading platform, Bitfinex's securities platform will also be not available to residents of the U.S. and other prohibited jurisdictions. Citizens of Canada, Switzerland, Venezuela, Austria, and Italy are also on Bitfinex Securities' list of prohibited persons.","Those who will be able to trade on the platform will have to complete verification and know-your-customer (KYC) processes, said Aron.","Both retail and accredited investors will be able to trade on Bitfinex Securities, but retail investors can only participate in issues of those entities who have issued a prospectus for their capital raises, said Aron."],"hashtag":[]}