{"summary":"Hong Kong-listed Loto Interactive could see 97% of its revenues eliminated by Sichuan&#x27;s recent shutdown orders on bitcoin mining operations.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/110077\/sichuan-bitcoin-mining-crackdown-hong-kong-loto-interactive","publishDate":"2021-06-30T16:57:52","id":3335,"type":null,"title":"Sichuan’s bitcoin miner crackdown could cripple a Hong Kong-listed firm","category":["BITCOIN"],"content":["Hong Kong-listed Loto Interactive could see 97% of its revenues hampered by Sichuan's recent shutdown orders on bitcoin mining operations.","Loto Interactive, a subsidiary of New York-listed BIT Mining, disclosed to the Hong Kong Stock Exchange earlier this month that two of its wholly-owned bitcoin mining facilities in China's Sichuan province received notices from their respective power suppliers regarding energy cuts.&nbsp;","Both facilities have hence suspended their operations. Loto said in a further <a href=\"https:\/\/www1.hkexnews.hk\/listedco\/listconews\/gem\/2021\/0625\/2021062501178.pdf\" data-v-f87c67ca=\"\">disclosure<\/a> on June 25 as a warning to shareholders that the two data centers brought in a revenue of HK$392 million ($47.9 million) for 2020 by hosting miners for customers, which accounted for 97% of last year's total.","Loto added that its third mining facility was originally planned to be operational in June but due to the governmental policy in Sichuan, it is \"unable to anticipate the time of resumption of operations.\"","Further, Loto said it procured about 4,000 bitcoin miners in February to expand its proprietary cryptocurrency mining business. But the change of the regulatory dynamics has compelled it to \"explore the possibility of expanding its operations to other locations\" and it is making the best efforts to \"accelerate the materialization of such possibilities in order to protect the interests of the Group and its shareholders as a whole.\"","It's the latest evidence of the ripple effect of China's bitcoin mining crackdown that is affecting not only private businesses but publicly-listed firms as well.","All told, the New York Stock Exchange-listed BIT Mining owns a controlling 60% stake in Loto Interactive, which fully owns three bitcoin mining facilities in Sichuan that have now been forced into an indefinite suspension.","Loto started as an online lottery business in Hong Kong but pivoted to bitcoin mining as it went through an acquisition by BIT Mining, formerly known as <a href=\"https:\/\/www.theblockcrypto.com\/daily\/96817\/chinese-state-owned-capital-500-bitcoin-mining\" data-v-f87c67ca=\"\">500.com<\/a>. BIT Mining also announced the pivot from online sports lottery to bitcoin mining last year.","Loto said the first mining facility that received the power shutdown order <a href=\"https:\/\/www1.hkexnews.hk\/listedco\/listconews\/gem\/2021\/0620\/2021062000007.pdf\" data-v-f87c67ca=\"\">on June 19<\/a> was called Ganzi Changhe Hydropower Consumption Service. It was the same entity BIT Mining referred to in its last announcement where it said it has deployed some of its bitcoin miners to <a href=\"https:\/\/www.theblockcrypto.com\/post\/109190\/bit-mining-bitcoin-miners-kazakhstan\" data-v-f87c67ca=\"\">Kazakhstan<\/a> following the shutdown of the Changhe facility. The second facility, called Sichuan Lecai Yuntian Network Technology, received a similar order <a href=\"https:\/\/www1.hkexnews.hk\/listedco\/listconews\/gem\/2021\/0621\/2021062100564.pdf\" data-v-f87c67ca=\"\">on June 21<\/a>.&nbsp;","The suspension comes just about three months after Loto acquired the remaining 49% of the Ganzi Changhe facility's equity in March in a deal worth HK$88 million ($11.3 million), according to Loto's Q1 <a href=\"https:\/\/www1.hkexnews.hk\/listedco\/listconews\/gem\/2021\/0507\/2021050701147.pdf\" data-v-f87c67ca=\"\">earnings report<\/a>.","Subsequently, Loto signed an agreement in March with an indirect wholly-owned subsidiary of BIT Mining through which Loto will host bitcoin miners owned by the BIT Mining subsidiary in the Changhe facility.&nbsp;","In its 2020 <a href=\"https:\/\/www1.hkexnews.hk\/listedco\/listconews\/gem\/2021\/0330\/2021033001108.pdf\" data-v-f87c67ca=\"\">earnings report<\/a>, Loto boasted that once its third center is up and running, the three facilities would occupy an area of nearly 18,000 square meters (around 200,000 square feet) that can house 225,000 crypto miners combined. During a December 2020 roadshow, executives of Loto also told potential investors that its operating capacity in Sichuan was at 400 megawatts.","As The Block reported previously, following&nbsp;the bitcoin miner shutdown orders in Xinjiang and Sichuan earlier this month, about 90 exahashes per second of computing power on the bitcoin network <a href=\"https:\/\/www.theblockcrypto.com\/post\/110062\/bitcoins-hash-rate-has-fallen-50-from-its-peak-in-may\" data-v-f87c67ca=\"\">has gone offline<\/a>. That has resulted in a <a href=\"https:\/\/www.theblockcrypto.com\/post\/109301\/secondhand-bitcoin-miner-supply-spiking-bitmain\" data-v-f87c67ca=\"\">spiking supply<\/a> of secondhand bitcoin miners on the market.","There have also been instances where hydropower plant owners in Sichuan are trying to sell their assets as a direct result of the recent crackdown, according to a <a href=\"https:\/\/www.scmp.com\/tech\/policy\/article\/3139053\/hydropower-plants-go-sale-china-amid-mining-crackdown-and-bitcoin-slump\" data-v-f87c67ca=\"\">report<\/a> from the South China Morning Post.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ganzi Changhe","content":"PERSON"},{"type":"Xinjiang","content":"LOCATION"},{"type":"New York Stock Exchange","content":"ORGANIZATION"},{"type":"Ganzi Changhe Hydropower Consumption Service","content":"ORGANIZATION"},{"type":"Sichuan Lecai Yuntian Network Technology","content":"ORGANIZATION"},{"type":"60%","content":"PERCENT"},{"type":"New York","content":"LOCATION"},{"type":"49%","content":"PERCENT"},{"type":"Sichuan","content":"ORGANIZATION"},{"type":"June 25","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"June 21","content":"DATE"},{"type":"Hong Kong Stock Exchange","content":"ORGANIZATION"},{"type":"Sichuan","content":"LOCATION"},{"type":"BIT Mining","content":"ORGANIZATION"},{"type":"earlier this month","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"97%","content":"PERCENT"},{"type":"February","content":"DATE"},{"type":"Loto","content":"LOCATION"},{"type":"December 2020","content":"DATE"},{"type":"March","content":"DATE"},{"type":"HK$392 million ($47.9 million","content":"MONEY"},{"type":"HK$88 million ($11.3 million","content":"MONEY"},{"type":"June 19","content":"DATE"},{"type":"Kazakhstan","content":"LOCATION"},{"type":"South China Morning Post","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Loto","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"China","content":"LOCATION"},{"type":"the Group","content":"ORGANIZATION"}],"hashtag":["BITCOIN"],"authors":["Wolfie Zhao","The Block"]}