{"summary":"BadgerDAO has released its eBTC Protocol &quot;purple paper,&quot; introducing a censorship-resistant synthetic bitcoin for DeFi.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241431\/badgerdao-purple-paper-ebtc-steth","publishDate":"2023-07-26T06:14:39","id":3337,"type":null,"title":"BadgerDAO releases &#x27;purple paper&#x27; for eBTC synthetic bitcoin using stETH","category":["DEFI"],"content":["BadgerDAO, a decentralized autonomous organization focused on bringing bitcoin into DeFi, has unveiled a \"purple paper\" for its eBTC Protocol — enabling users to borrow synthetic bitcoin without any upfront fees or interest.","This fee-less borrowing mechanism aims to make Bitcoin accessible and affordable for users by using Lido's liquid staking ether derivative token, stETH, as collateral, according to an <a href=\"https:\/\/twitter.com\/eBTCprotocol\/status\/1683933024709406722?s=20\" data-v-f87c67ca=\"\">announcement<\/a> on Tuesday.","Users deposit stETH to borrow over-collateralized eBTC without incurring initiation fees or interest charges. Instead, the protocol generates revenue by taking a percentage of accrued staking yield from the total system collateral, known as the \"protocol yield share.\"","To ensure the system's solvency, eBTC employs a liquidation mechanism — meaning that if the collateral ratio of a collateralized debt position falls below a minimum of 110%, the debt position becomes eligible for liquidation. “The outstanding debt can be repaid by any market participant in exchange for some surplus collateral and the gas stipend as an incentive,” the team said.","In cases where a debt position is not liquidated despite its collateral ratio dropping below 103%, the protocol considers this under-collateralized and implements debt redistribution. Liquidators can receive the outstanding collateral at a 3% fixed discount, and any outstanding debt gets redistributed among active collateralized debt positions.","eBTC is designed to be a trustless synthetic version of Bitcoin in DeFi, adopting a minimized governance mechanism. The approach ensures the protocol remains non-custodial and censorship-resistant while retaining some flexibility to address potential security risks, the team added.","The project’s governance can alter parameters related to fee competitiveness, peg stability, risk management and economic and technical security to adapt to market developments.","eBTC also aims to ensure reliable oracle infrastructure for price feeds based on a combination of a primary oracle provided by the decentralized oracle network Chainlink and a controlled backup oracle that kicks in automatically if the primary oracle becomes unresponsive.","The protocol aggregates price feeds from various sources for the ETH\/BTC and stETH\/ETH pairs to ensure accurate and reliable pricing information, the team said.","The full eBTC Protocol \"purple paper\" is available via Badger Finance's Github.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"110%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"3%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"103%","content":"PERCENT"},{"type":"Badger Finance","content":"ORGANIZATION"}],"hashtag":["BITCOIN","LIDO FINANCE","STAKING"],"authors":["James Hunt","The Block"]}