{"summary":"Ant Group, the parent company of China’s Alipay, will list its public shares in Hong Kong and Shanghai — not New York\nThe firm, formerly known as Ant Financial, has ties to China’s central bank digital currency project and has invested heavily in blockchain technology ","author":["Mike Orcutt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/72311\/ant-group-ipo-blockchain-analysis","publishDate":"2020-07-20T17:45:21","id":3337,"type":null,"title":"What Ant Group’s massive IPO might mean for digital currency and blockchains","category":["China"],"content":["<span data-v-f87c67ca=\"\">Ant Group, the parent of&nbsp; China’s largest mobile payment company Alipay, has announced that it plans to list its public shares this year on both the Hong Kong stock exchange and the Shanghai stock exchange’s new STAR market. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">But while most of the coverage has focused on the Alibaba affiliate's decision not to list on the New York Stock Exchange, the development also has implications for the future of digital currency and blockchain technology.<\/span>","<span data-v-f87c67ca=\"\">Formerly called Ant Financial, Ant Group is seeking a $200 billion valuation, <\/span><a href=\"https:\/\/www.bloomberg.com\/amp\/news\/articles\/2020-07-20\/jack-ma-s-ant-plans-simultaneous-ipos-in-hong-kong-shanghai\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">according to Bloomberg<\/span><\/a><span data-v-f87c67ca=\"\">. The dual public offering will help Ant Group “accelerate its goal of digitizing the service industry in China,” <\/span><a href=\"https:\/\/www.cnbc.com\/2020\/07\/20\/chinas-ant-financial-to-go-public-in-dual-shanghai-hong-kong-listing.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">the firm said<\/span><\/a><span data-v-f87c67ca=\"\"> in a statement.<\/span>","<span data-v-f87c67ca=\"\">The decision to list on the STAR market, which has been described as China’s version of the Nasdaq, comes amid intensifying geopolitical tension between the U.S. and China. The U.S. Senate recently passed a bill, for instance, that would remove Chinese companies from U.S. stock exchanges unless they allowed regulators access to their audit records. In 2014, Alibaba, which owns 33% of Ant Group’s shares, raised $25 billion after listing its shares on the New York Stock Exchange.<\/span>","<span data-v-f87c67ca=\"\">The move also comes in the wake of a controversial <\/span><a href=\"https:\/\/www.cnbc.com\/2020\/06\/30\/china-reportedly-passes-national-security-law-for-hong-kong.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">new Hong Kong national security law<\/span><\/a><span data-v-f87c67ca=\"\">, which China passed late last month. Critics have said the law will undermine Hong Kong’s autonomy, but Ant's planned listing suggests that companies still see Hong Kong as an attractive market.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Geopolitics aside, though, Ant Group's IPO is also relevant to digital currency and blockchain development. <\/span>","<span data-v-f87c67ca=\"\">Alipay is already a ubiquitous mobile payment platform in China, where the use of cash has fallen dramatically in the past several years. But the platform and its main competitor in China, Tencent's WeChat Pay, are also expected to play a role in the distribution of China’s forthcoming central bank digital currency.<\/span>","<span data-v-f87c67ca=\"\">As The Block <\/span><a href=\"https:\/\/www.theblockcrypto.com\/daily\/63120\/everything-you-need-to-know-about-chinas-central-bank-digital-currency\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">has reported<\/span><\/a><span data-v-f87c67ca=\"\">, Tencent and Alipay are both working on projects related to the digital currency, called Digital Currency Electronic Payment, or DC\/EP. According to China’s national patent office website, <\/span><a href=\"https:\/\/www.theblockcrypto.com\/daily\/63120\/everything-you-need-to-know-about-chinas-central-bank-digital-currency\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Alipay has filed at least five patent applications<\/span><\/a><span data-v-f87c67ca=\"\"> related to DC\/EP.<\/span>","<span data-v-f87c67ca=\"\">Ant Group has also been a big investor in blockchain technology, <\/span><a href=\"https:\/\/www.technologyreview.com\/2019\/05\/03\/135487\/chinas-ubiquitous-digital-payments-processor-loves-the-blockchain\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">which it has said can help form the basis of an “industrial internet”<\/span><\/a><span data-v-f87c67ca=\"\"> in China. The firm has developed a proprietary blockchain platform, and as of last year was already using it to track charity donations, monitor supply chains, and to facilitate cross-border payments in Asia.<\/span>","<span data-v-f87c67ca=\"\">Ant’s dedication to blockchain aligns with that of the Chinese government. In October, China’s president Xi Jinping <\/span><a href=\"http:\/\/www.xinhuanet.com\/2019-10\/25\/c_1125153665.htm\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">called on the nation to take “leading position”<\/span><\/a><span data-v-f87c67ca=\"\"> in the development of blockchain technology. And that didn’t come out of the blue: the nation’s central bank has been studying the technology since 2014.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">More than 70 financial service firms in China, including every state-owned bank, <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/62691\/most-of-chinas-biggest-banks-are-already-using-blockchains\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">are already deploying blockchain-based applications<\/span><\/a><span data-v-f87c67ca=\"\">, as The Block has reported. And just last week, Beijing’s municipal government released a 145-page blueprint outlining how it <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/71992\/beijing-government-releases-its-blueprint-for-becoming-a-blockchain-hub\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">plans to become a leading “blockchain hub.”<\/span><\/a>","<span data-v-f87c67ca=\"\">The blockchains that both Ant Group and China’s leaders have in mind are of the permissioned variety, not public networks. In January, the Cyberspace Administration of China <\/span><a href=\"https:\/\/uk.reuters.com\/article\/us-china-blockchain\/china-imposes-blockchain-rules-to-enable-orderly-development-idUKKCN1P41FX\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">imposed new rules on blockchain platforms<\/span><\/a><span data-v-f87c67ca=\"\">: users will have to register using their real identities, and the companies running the platforms will be required to store user data and censor illegal content.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">To recap: China’s largest mobile payment provider — which is widely expected to be a distributor of its new digital currency and has already invested heavily in blockchain technology — is planning one of the largest stock offerings ever. <\/span>","<span data-v-f87c67ca=\"\">At the very least, this seems like a bullish indicator for the future of blockchains and digital currencies — or at least China’s version of those things.<\/span>"],"hashtag":[]}