{"summary":"BitMEX has hired Alexander Höptner—a veteran of the German stock exchange world—as its new CEO\nHöptner will take the reigns of the embattled exchange in January 2021","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/86074\/bitmex-names-german-stock-exchange-veteran-as-new-ceo","publishDate":"2020-11-30T21:00:04","id":3338,"type":null,"title":"BitMEX names German stock exchange veteran as new CEO","category":["Exchanges"],"content":["100x Group, the parent company of crypto derivatives exchange <a href=\"https:\/\/www.theblockcrypto.com\/linked\/65415\/bitmex-parent-open-source-grants\" data-v-f87c67ca=\"\">BitMEX<\/a>, has hired a veteran of the German stock exchange world as its new chief executive.","<a href=\"https:\/\/www.theblockcrypto.com\/linked\/62909\/bitmex-is-launching-new-ether-usd-futures-which-settle-in-bitcoin\" data-v-f87c67ca=\"\">BitMEX<\/a>, which has been rattled by legal troubles and a shakeup of its top brass, said on Monday that Alexander Höptner would take the reigns as CEO beginning January 1.","Previously, Höptner held positions at Börse Stuttgart and Deutsche Börse AG. Most recently, Höptner led Euwax AG, which played a role in the build out of BISON—a crypto trading subsidiary of Börse Stuttgart.","\"The Börse Stuttgart exchange became a pioneer of digital asset trading under Alex’s leadership as Germany’s first regulated trading venue for cryptocurrency and the European Union’s first traditional exchange operator to become a regulated crypto multilateral trading facility,\" 100x Group said in a statement.","Höptner is taking over for Vivien Khoo. 100x Group had appointed Khoo as interim CEO after Arthur Hayes stepped down in the wake off twin lawsuits from the Commodities Futures Trading Commission and Department of Justice.&nbsp;","Once known for being the center of liquidity in the cryptocurrency derivatives market, the firm's market share has in terms of open interest for bitcoin futures declined from above 40% in September 2019 to 11% in November 2020.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/futures\/share-of-open-interest-across-bitcoin-futures-monthly\/embed\" title=\"Share of Open Interest across Bitcoin Futures\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Höptner declined to comment on the firm's ongoing legal battles in an interview with The Block, but he acknowledged that the exchange's momentum has slowed.","\"Yes, things might have slowed down a bit,\" Höptner said. \"And we have a little bit lost our edge, but I think the power and the capabilities of the company, they're there.\"","He continued: \"We need to channel them in the right way. We will look to ourselves and make sure we can deliver to our partners and clients.\"","Höptner told The Block that he's keen to leverage his past experience in building a regulated digital asset venue to execute on a global vision for <a href=\"https:\/\/www.theblockcrypto.com\/linked\/75293\/bitmex-operator-invests-1-5-million-vietnamese-crypto-vcc-exchange\" data-v-f87c67ca=\"\">BitMEX<\/a>. A media release announcing Höptner's hire signaled that the company would explore a \"wider vision\" as well. Specifically, the firm could explore potential acquisition targets or launch products beyond cryptocurrency derivatives.&nbsp;","Market observers told The Block earlier this year that 100x rebranding from HDR indicated it could explore new asset classes outside of crypto. At the time, Hayes said the \"evolution will provide us with more freedom to explore, incubate and pursue new opportunities and investments, whilst remaining entirely committed to enhancing <a href=\"https:\/\/www.theblockcrypto.com\/linked\/76535\/bitmex-mobile-trading-app\" data-v-f87c67ca=\"\">BitMEX’s<\/a> leadership position.\"","While Höptner wouldn't outline his exact ambitions for <a href=\"https:\/\/www.theblockcrypto.com\/linked\/65778\/bitmexs-trading-engine-is-down\" data-v-f87c67ca=\"\">BitMEX<\/a>, he did single out the development of blockchain-based derivatives as potential one market structure development he's thinking about.","\"The next step is tokenization of classic derivatives,\" he said, referring to the crypto ecosystem as a whole. \"We have classic derivatives and crypto derivatives. So far, nearly nobody globally has tapped into tokenization of classic derivatives.\"","\"The question will be whether at all is this interesting and whether someone will pick this up,\" he told The Block.","<em data-v-f87c67ca=\"\">This post has been updated to clarify that Euwax AG is affiliated with&nbsp;Börse Stuttgart.<\/em>"],"hashtag":["BITMEX","HIRING"]}