{"summary":"Cairo Native integration and data availability compression are also among Starknet’s potential updates this year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283593\/starknet-parallel-execution","publishDate":"2024-03-20T08:00:03","id":3339,"type":null,"title":"Starknet&#x27;s 2024 roadmap includes parallel transaction execution coming in Q2","category":["CRYPTO ECOSYSTEMS"],"content":["Starknet, a ZK-Rollup solution for scaling decentralized applications, published its 2024 roadmap today, outlining plans to enhance throughput and reduce transaction fees on the Ethereum Layer 2 network.","One of the notable updates includes the introduction of parallel execution in v0.13.2, scheduled for the second quarter of this year.","Instead of Starknet’s sequencer—a component that organizes and batches multiple off-chain transactions before submitting them to the Ethereum blockchain—executing each transaction sequentially as it currently does, parallelization will allow for the simultaneous execution of multiple transactions.","\"Parallel execution is basically multitasking for rollups, or more specifically, for the sequencer on L2. It will enable the sequencer to execute many transactions at once,” Eli Ben-Sasson, CEO of developer StarkWare and board member of the Starknet Foundation, said in a statement shared with The Block. “This will address a bottleneck, and keep transactions flowing faster and more efficiently. It's like a subway station with one entrance point tackling congestion by opening more entrances.\"","Starknet recently added support for EIP-4844 or proto-danksharding as part of <a href=\"https:\/\/www.theblock.co\/post\/282236\/ethereum-dencun-upgrade-blobs\" data-v-f87c67ca=\"\">Ethereum’s Dencun upgrade<\/a> last week. Following this, Argent, one of the prominent wallet providers on the network, reported a significant reduction in average fees for a swap on Starknet, dropping to $0.04 compared to over $6.80 shortly before the Dencun upgrade.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/scaling-overview\/daily-ethereum-layer-2-l1-data-fees-in-usd\/embed\" title=\"Daily Ethereum Layer 2 L1 Data Fees (in USD)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Cairo Native integration into the Starknet sequencer is also tentatively scheduled for v0.13.3 in Q3, in collaboration with blockchain research firm Nethermind. Cairo Native allows the sequencer to operate directly on standard hardware architecture, which is expected to accelerate transaction execution, decrease latency, and enhance throughput.","Starknet’s v0.14.0, set for Q4, aims to further reduce fees on Starknet through three primary strategies: introducing volition for hybrid data storage, implementing “applicative recursion” to consolidate data storage evidence, and exploring data availability compression to minimize Starknet’s data footprint on Ethereum.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"second quarter of this year","content":"DATE"},{"type":"4844","content":"DATE"},{"type":"$6.80","content":"MONEY"},{"type":"Nethermind","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Eli Ben-Sasson","content":"PERSON"},{"type":"Starknet Foundation","content":"ORGANIZATION"},{"type":"$0.04","content":"MONEY"},{"type":"Argent","content":"ORGANIZATION"},{"type":"Cairo Native","content":"ORGANIZATION"}],"hashtag":["ETHEREUM","STARKNET"],"authors":["James Hunt","The Block"]}