{"summary":"Bloomberg Senior ETF Analyst Eric Balchunas believes that the odds of an ether ETF garnering approval are &quot;a very pessimistic 25%.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284648\/spot-ethereum-etf-no-positive-signs","publishDate":"2024-03-26T06:17:04","id":334,"type":null,"title":"Spot Ethereum ETF approval has &#x27;no positive signs,&#x27; says ETF expert","category":["FUNDS"],"content":["While the prospects of a spot ether exchange-traded fund receiving approval from the U.S. Securities and Exchange Commission are up for debate, one ETF expert remains largely pessimistic.","Bloomberg Senior ETF Analyst Eric Balchunas <a href=\"https:\/\/twitter.com\/EricBalchunas\/status\/1772372601098162624\" data-v-f87c67ca=\"\">posted<\/a> on X today their belief that the odds of an ether ETF garnering approval are \"a very pessimistic 25%.\"","\"The lack of engagement seems to be purposeful vs procrastination,\" Balchunas explained. \"No positive signs\/intel anywhere you look.\"","\"Personally hope they do approve it but it just ain't looking good,\" he added.","On the other side of the debate was Grayscale's Chief Legal Officer, Craig Salm, who shared his belief on the social media platform that the SEC's lack of engagement is neither a positive nor a negative signal — citing the idea that many details that would have previously required engagement have already been determined through the spot bitcoin ETF approval process.","\"In the final months leading up to Bitcoin ETF approval, Grayscale and others received positive and constructive engagement from the SEC,\" Salm <a href=\"https:\/\/www.theblock.co\/post\/284628\/grayscale-clo-believes-spot-ether-etfs-should-be-approved\" data-v-f87c67ca=\"\">wrote<\/a>, adding: \"We had thoughtful conversations and discussed the finer details of creation\/redemption procedures, cash v. in-kind, APs, LPs, custody, etc.\"","\"All of these issues were figured out and are identical when comparing spot Bitcoin to Ethereum,\" Salm added. \"The only difference is rather than the ETF holding bitcoin, it holds ether. So in many ways, the SEC already has engaged and issuers simply have less to engage on this time.\"","While the SEC hasn't necessarily engaged with the spot ether ETF applications, the agency reportedly is in a supposed campaign to label ether as a security.","The regulator has reportedly <a href=\"https:\/\/www.theblock.co\/post\/284284\/spot-ethereum-etf-approval-may-extremely-unlikely-galaxy-thorn\" data-v-f87c67ca=\"\">issued subpoenas<\/a> to crypto firms regarding their relationship with the Ethereum Foundation.","These recent actions from the SEC <a href=\"https:\/\/www.theblock.co\/post\/284284\/spot-ethereum-etf-approval-may-extremely-unlikely-galaxy-thorn\" data-v-f87c67ca=\"\">indicate to<\/a> Alex Thorn, head of firmwide research at Galaxy Digital, that approval for spot ether exchange-traded funds in May seems \"extremely unlikely.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Alex Thorn","content":"PERSON"},{"type":"Craig Salm","content":"PERSON"},{"type":"25%","content":"PERCENT"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Eric Balchunas","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["SEC","SPOT ETHEREUM ETF"],"authors":["Adam James","The Block"]}