{"summary":"Bitcoin startup Purse is shutting down after six years of its launch\nPurse support manager Eduardo Gomez told The Block that the firm is open to acquisition opportunities\nA source with knowledge of the matter told The Block that Purse had plenty of runway, but the management and founding team wanted to do things of their own","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/62220\/bitcoins-killer-app-purse-is-shutting-down-open-to-acquisition-opportunities","publishDate":"2020-04-17T06:00:21","id":3341,"type":null,"title":"Bitcoin&#x27;s &#x27;killer app&#x27; Purse is shutting down, open to acquisition opportunities","category":["Bitcoin"],"content":["Crypto startup Purse, which allowed people to buy items on Amazon at discount rates using bitcoin and bitcoin cash, is shutting down.","Announcing the news on Thursday, San Francisco-based Purse <a href=\"https:\/\/support.purse.io\/en\/articles\/3851246-purse-is-saying-goodbye\" data-v-f87c67ca=\"\">said<\/a> it will cease operations on June 26. Until then, the firm will continue to offer support for ongoing orders and withdrawals.","“We had a good run. But the uncertainty of the current market dynamic made things really hard,” Eduardo Gomez, support manager at Purse, told The Block. “We also had some departures over the years from people who were tackling new projects,\" he added.","Founded in 2014, Purse is <a href=\"https:\/\/purse.io\/investors\" data-v-f87c67ca=\"\">backed<\/a> by some notable investors including Digital Currency Group and Bitcoin.com’s Roger Ver, who <a href=\"https:\/\/purse.io\/how-it-works\" data-v-f87c67ca=\"\">called<\/a> Purse as bitcoin’s “killer app.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"I still believe this product has tremendous potential,\" Gomez told The Block, adding that the firm had “hundreds of thousands of registered users” from countries across the world.","So what led to the closure decision? A source with knowledge of the matter told The Block that Purse was able to run operations well with a lean team and had plenty of runway, but the management and founding team wanted to do things of their own and many of them just wanted to retire.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAfter the publication of this article, Purse co-founder and CEO Andrew Lee told The Block: \"We're not retiring,\" but \"taking time off.\"","Lee also confirmed that Purse is open to acquisition opportunities.&nbsp;","Purse employed 12 people, Gomez told The Block, adding that it also employed some open-source bitcoin developers to support Bcoin and Handshake projects.","Purse raised $1 million in a seed funding round in 2015. The firm's total funding to date is at $2.4 million, Lee told The Block.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Update<\/strong> (April 17, 10:30 AM EST): This story has been updated to include comments from Purse co-founder and CEO Andrew Lee.<\/em>"],"hashtag":["BITCOIN"]}