{"summary":"China is about to embark on a second city-wide test of its central bank digital currency, known as DC\/EP\nThe scale and scope appear to be much wider than the first one in multiple crucial aspects","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/86773\/six-things-china-digital-yuan-lottery","publishDate":"2020-12-06T11:51:16","id":3342,"type":null,"title":"Six ways China&#x27;s newest larger-scale digital yuan lottery is different than before","category":["Central Banks"],"content":["China is about to embark on a second city-wide test of its central bank digital currency on much wider scale than the first one in multiple crucial aspects.","The city of Suzhou <a href=\"https:\/\/www.theblockcrypto.com\/linked\/86654\/suzhou-3m-digital-yuan-lottery\" data-v-f87c67ca=\"\">announced<\/a> on Friday that it will give away 20 million yuan – or $3 million – in the form of digital renminbi via lottery, which is similar to the first one conducted in Shenzhen. The purpose is to encourage the testing of DC\/EP during the upcoming \"Double 12\" online shopping season.","But the scope and the scale of the Suzhou test appear to be more extensive in several notable ways.&nbsp;","One notable advance of the Suzhou test is the acceptance of DC\/EP by China's e-commerce giant JD.com, although it is not a platform-wide adoption.","According to <a href=\"https:\/\/mp.weixin.qq.com\/s\/2B0eqj8_z7mQkerkgFmacw\" data-v-f87c67ca=\"\">JD.com<\/a>, lottery winners can spend the DC\/EP via the e-commerce giant's mobile app on goods from its proprietary warehouses only — meaning that products sold by third-party vendors on the platform are excluded.","That said, the online acceptance marks a new type of use case scenario for digital yuan since JD's proprietary warehouse is a key business model that differentiates itself from Alibaba's Taobao or Tmall.","JD.com said its proprietary offline stores are also among a total of nearly 10,000 physical shops that will support the DC\/EP payments during the test, including supermarkets, restaurants and convenient stores in major commercial areas across the whole Suzhou city.&nbsp;","By comparison, the test in Shenzhen had about 3,300 physical stores – all limited to inside the city's Luohuo district – that supported DC\/EP payments.","When Shenzhen kicked off China's first digital yuan giveaway campaign in October, it was meant for 50,000 local residents with a total of 10 million digital yuan available. In the end, nearly 2 million people in Shenzhen signed up for the lottery, meaning the winning probability was already less than 3%.&nbsp;","While the population of Suzhou (10.7 million) is smaller than that in Shenzhen (13 million), the total participants of the second test are now doubled to 100,000 residents.&nbsp;","It remains to be seen how many Suzhou residents will participate in the lottery, the results of which will be revealed on December 11.","In addition, the Suzhou test period has been extended to more than two weeks from December 11 to December 27. During the Shenzhen rollout, residents had less than seven days to spend their free digital yuan.","But the Shenzhen test appears to have boosted the public interest and awareness of China's DC\/EP initiative. For instance, the WeChat blog post from the Shenzhen government about the first test, which was <a href=\"https:\/\/mp.weixin.qq.com\/s\/0aL8mojfATn585H9b7klWw\" data-v-f87c67ca=\"\">published<\/a> two months ago, has a total of 83,000 views as of today.","The official WeChat <a href=\"https:\/\/mp.weixin.qq.com\/s\/P7JoXI7G2EcRM1AuyZfP_w\" data-v-f87c67ca=\"\">blog post<\/a> of the Suzhou government, on the other hand, attracted more than 100,000 views within a day of going live on December 4.","Another sign that Suzhou's test involves a wider scope of technological advancement is the introduction of an offline payment feature for DC\/EP — albeit in a very controlled environment.","According to the government's WeChat post, it will select fewer than 1,000 people from the 100,000 lottery-winners to test this feature, which is based on near-field wireless technologies.","The People's Bank of China (PBoC) previously said DC\/EP wallets, at the point of their official rollout, will be capable of sending transactions by having two smartphones or hardware devices touch each other — even without an internet connection.","The central bank's Digital Currency Research Institute was granted a patent for \" a method and system of using digital currency chip cards to complete offline transactions\" in October.","The authorized patent details how the invention relies on either Near Field Communications or Bluetooth to initiate offline transactions. However, once a party that receives the offline transaction is connected to the internet, it will sync up with the central bank's private ledger and provide the transaction information.&nbsp;&nbsp;","It is no secret that China's four biggest state-owned commercial banks have participated in the development of mobile and hardware wallets for DC\/EP with initial leaks starting to surface since <a href=\"https:\/\/www.theblockcrypto.com\/post\/61819\/chinese-state-owned-bank-releases-test-app-for-central-banks-digital-currency\" data-v-f87c67ca=\"\">April<\/a> this year.","Industrial and Commercial Bank of China, China Construction Bank, Agricultural Bank of China and Bank of China – all listed in Hong Kong – are not only the biggest banking giants in China, but the four largest banks in the world by total assets, according to S&amp;P's <a href=\"https:\/\/www.spglobal.com\/marketintelligence\/en\/news-insights\/latest-news-headlines\/the-world-s-100-largest-banks-2020-57854079\" data-v-f87c67ca=\"\">data<\/a> as of April.","Lottery-winners in the Shenzhen test had to choose one of the four banking giants in order to activate a DC\/EP wallet, even if they don't have a saving account with any of the four.","In the Suzhou test, residents will be able to choose to activate their digital yuan wallets at two additional state-owned institutions: Bank of Communications and the Postal Savings Bank of China.","The move suggests that more institutions, even private entities, could potentially join the DC\/EP issuance system during future tests.","The Suzhou government said in the post that the PBoC has been developing the digital yuan system with some commercial banks as well as other relevant entities since the end of 2017.","”Based on the test preparation this time, the six commercial banks are equipped to participate while other entities are still actively developing their [wallet] systems,\" the Suzhou government said.","In addition to these banking giants, other companies that were reported to have been participating in the DC\/EP wallet development include Union Pay, DiDi, Meituan, AliPay as well as WeChat Pay.&nbsp;"],"hashtag":[]}