{"summary":"The crypto indexing firm launched the product with Chainlink and hopes it will facilitate the creation of products like interest rate derivatives contracts.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173442\/cf-benchmarks-launches-bitcoin-interest-rate-curve-as-lenders-continue-to-increase-yields-for-savers","publishDate":"2022-09-28T12:06:31","id":3344,"type":null,"title":"CF Benchmarks launches bitcoin interest rate curve as lenders continue to increase yields for savers","category":["MARKETS"],"content":["Crypto indexing firm CF Benchmarks has launched a bitcoin interest rate curve in partnership with Chainlink.&nbsp;","The CF bitcoin interest rate curve will measure bitcoin borrowing and lending using three different data sources, transaction data from futures exchanges, DeFi lending protocols such as Aave or Compound, and OTC crypto lenders. Using this data the interest rate curve is created, with CF Benchmarks aiming to improve how borrowing and lending work in crypto.","The Chicago Mercantile Exchange (CME), Bitmex, FTX, OKX, ByBit, Aave and Compound are among the firm's contributing data to the interest rate curve, CF Benchmark's head of product Ghando told&nbsp; The Block.","The firm said it hopes to facilitate the creation of financial products, like interest rate derivatives contracts, by making each point on the curve \"representative, replicable and efficient.\"","CF Benchmarks has been working on the product since January, with Chainlink joining as a partner early in the process, Ghando said. In the intervening time, crypto credit lending has gone through a turbulent period.","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Following the collapse of the Terra blockchain in May, crypto lenders faced extreme difficulty operating which led to a credit crisis for some in June. Firms like Voyager and Celsius have since filed for bankruptcy, with the former's assets being <a href=\"https:\/\/www.theblock.co\/post\/172946\/ftx-wins-auction-for-bankrupt-crypto-lender-voyager\" data-v-f87c67ca=\"\">purchased at auction<\/a> by FTX while the latter's CEO was <a href=\"https:\/\/www.theblock.co\/post\/173177\/celsius-creditor-committee-called-for-ceos-removal\" data-v-f87c67ca=\"\">forced to resign<\/a> on Tuesday.&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">During this time some lenders were forced to cut their rates to encourage more borrowing. However, this trend started to reverse in August, as <a href=\"https:\/\/www.theblock.co\/post\/165000\/crypto-lending-platforms-increase-rates-due-to-higher-borrowing-demand\" data-v-f87c67ca=\"\">lending rates became more lucrative<\/a>.<\/span>","<span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">Indeed, crypto lending platform Ledn is increasing the savings rate offered to customers from Oct. 1. <\/span>The interest rate for bitcoin saving accounts on Ledn will rise from 5.25% to 6%, on balances up to 0.1 bitcoin. Meanwhile, the interest rate on USDC will rise to 8% from 7.5%.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"7.5%","content":"PERCENT"},{"type":"6%","content":"PERCENT"},{"type":"8%","content":"PERCENT"},{"type":"Bitmex","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"Oct. 1","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"CF Benchmarks","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Ghando","content":"PERSON"},{"type":"5.25%","content":"PERCENT"},{"type":"Chicago Mercantile Exchange","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"June","content":"DATE"},{"type":"USDC","content":"ORGANIZATION"},{"type":"CF Benchmark","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Adam Morgan McCarthy","The Block"]}