{"summary":"The SEC rejected VanEck’s proposal for a spot bitcoin ETF earlier this month.\nGrayscale still has an application before the agency to convert its GBTC product to an ETF.\nGrayscale sent a letter to the SEC claiming the agency’s willingness to approve a futures-based product but not a spot product is “arbitrary and capricious” and could constitute a violation of the Administrative Procedure Act (APA). ","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/125817\/grayscale-argues-the-secs-bitcoin-etf-treatment-could-violate-the-apa","publishDate":"2021-11-30T15:37:51","id":3344,"type":null,"title":"Grayscale argues the SEC&#x27;s bitcoin ETF treatment could violate the APA","category":["Regulation"],"content":["In the wake of the Securities and Exchange Commission's most recent bitcoin exchange-traded fund (ETF) rejection, Grayscale is pushing back on the regulator's arguments.","Grayscale is seeking to <a href=\"https:\/\/www.theblockcrypto.com\/linked\/121175\/grayscale-starts-the-clock-on-sec-decision-to-convert-gbtc-to-an-etf\" data-v-f87c67ca=\"\">convert<\/a> its bitcoin trust, GBTC, to an ETF, and recently put the Securities and Exchange Commission on the clock in October, when NYSE Arca <a href=\"https:\/\/www.theblockcrypto.com\/linked\/123227\/sec-seeks-comments-on-grayscales-gbtc-etf-proposal\" data-v-f87c67ca=\"\">filed<\/a> to list the product. A decision could come as early as Dec. 24, although the agency has a history of extensions. It's already published a notice on Nov.2 seeking comments on the proposed rule change.&nbsp;","The SEC took a similar approach to VanEck's offering, soliciting feedback in June of this year. The agency <a href=\"https:\/\/www.theblockcrypto.com\/linked\/124192\/sec-rejects-vanecks-spot-bitcoin-etf\" data-v-f87c67ca=\"\">rejected<\/a> that proposal earlier this month, making it the first to receive an answer in this wave of applications.","In light of those events, Grayscale sent a <a href=\"https:\/\/www.sec.gov\/comments\/sr-nysearca-2021-90\/srnysearca202190-9410842-262990.pdf\" data-v-f87c67ca=\"\">letter<\/a> to the agency Monday night, arguing that the SEC's repeated rejections could violate the Administrative Procedure Act (APA). The APA governs the decision-making process of federal agencies.","Grayscale claims the agency's decisions have been \"arbitrary and capricious\" since the Commission has approved futures-based bitcoin ETFs, but not spot-based offerings. Since the early rumblings of bitcoin futures ETF approvals, Grayscale has been pointing out the inconsistencies in the willingness to approve a futures-based product but not one that holds the underlying.","\"Bitcoin futures ETPs registered under the 1940 Act and spot Bitcoin ETPs that are not required or eligible to be so registered are the same in all relevant respects, but based on the analysis in the November 12, 2021 disapproval order, the Commission is treating them differently,\" the letter stated.","VanEck's product was proposed under the Securities Act of 1933, while the approved futures products have the additional oversight of the Investment Company Act of 1940. SEC chair Gary Gensler has previously stated his interest in approving products under the '40 Act due to its heightened protections. While the '33 Act is focused on disclosures, the '40 Act empowers regulators to check up on issuers and sets consumer protection standards that issuers must meet.&nbsp;","The SEC has pointed to the difference in registrations as the reason for the different treatment between futures and spot-based products, but Grayscale argues this is a departure from the market manipulation concerns the SEC has continuously cited in its rejection orders.","Some argue that if the SEC is comfortable with the lack of market manipulation in a futures market, it follows that the underlying asset market must also be sufficiently free of manipulation.","\"Although the Commission cited investor protections afforded by the 1940 Act as justification for disparate treatment, the 1940 Act’s protections do not address and thus are not relevant to the concern the Commission has repeatedly invoked to deny Rule 19b-4 applications for spot Bitcoin ETPs like BTC: market manipulation and fraud in the underlying Bitcoin market,\" said the letter.&nbsp;","Grayscale's VP of legal, Craig Salm, explained the firm's argument in a <a href=\"https:\/\/grayscale.com\/unpacking-the-news-a-new-argument-for-a-bitcoin-etf\/\" data-v-f87c67ca=\"\">post<\/a> on Grayscale's website. He argued that the protections afforded by the '40 Act don't actually address the concerns the SEC has repeatedly laid out in its rejection orders. The '40 Act seeks to regulate the management of investment products, but the SEC has repeatedly expressed concerns about the lack of oversight of the venues where spot price is derived, which wouldn't fall into the purview of the '40 Act.","Still, the approved futures products hold bitcoin futures contracts that trade on the Chicago Mercantile Exchange, which is a federally regulated marketplace. But many of the rejected spot products plan to track CME's indexes, which set the pricing for the futures products as well.","Grayscale argues it's unclear why CME's pricing mechanisms are sufficient for filtering out manipulation in the futures market, but not products tracking the spot market.&nbsp;","\"As it stands, the Bitcoin ETF landscape is unfair and discriminatory against GBTC shareholders and all of the other U.S. investors looking for an accessible and efficient way to gain their Bitcoin exposure,\" Salm wrote. \"Fortunately, the Administrative Procedure Act (APA) exists to address situations just like this one — to govern the process by which federal agencies develop and issue regulations, ultimately to protect the American investor.\"","The SEC has yet to formally respond to the letter, but it is published on the agency's database.&nbsp;"],"hashtag":["SEC"]}