{"summary":"Hxro Network has raised $34 million in a token round.\nThe network is building a Solana-based derivatives trading platform. ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/125758\/solana-based-derivatives-network-hxro-raises-34-million-in-token-round","publishDate":"2021-11-30T08:37:31","id":3346,"type":null,"title":"Solana-based derivatives network Hxro raises $34 million in token round","category":["Venture Capital"],"content":["Hxro (pronounced \"hero\") Network, a Solana-based derivatives trading platform, has raised $34 million in a token round.","SIG DT Investments (a Susquehanna International Group company), Jump Crypto, and Blockchain Capital co-led the round, with Alameda Research, Chicago Trading Company, Solana Ventures, Coinbase Ventures, Commonwealth Asset Management, and others also participating.","The new funding round comes just four months after Hxro Network raised $15 million. The project is building a decentralized crypto derivatives trading platform, including futures and options.","\"Think about Hxro Network as being very much B2B2C [business to business to consumer] where the network protocols are just software that sit at the base layer,\" Dan Gunsberg, co-founder of Hxro Network, told The Block.","In other words, Hxro Network will consist of several <a href=\"https:\/\/docs.hxro.network\/\" data-v-f87c67ca=\"\">protocols<\/a> that traders can use. \"When composed with a Serum order book and Pyth as a data oracle, you now have the elements needed to generate a market,\" said Gunsberg. \"This market can be created by anyone who is part of the network.\"","Hxro plans to support markets for the \"most well-known\" cryptocurrencies. The first version (v1) of Hxro Network is expected to launch on Solana from next month across phases, including futures, options, and perpetual swaps.","With the fresh capital in place, Hxro plans to fund the network treasury, support early liquidity, and fund network rewards.","Hxro will primarily derive its value from transaction fees generated within the network. \"One hundred percent of the network's value will accrue to staked HXRO token holders, specialized node operators, the network treasury, and developer pools vital to network scaling and functionality,\" said Hxro, in a statement.","Hxro started out with a gaming product called <a href=\"https:\/\/hxro.zendesk.com\/hc\/en-us\/articles\/360060015574-About-MoonRekt\" data-v-f87c67ca=\"\">MoonRekt<\/a> that allows traders to take bullish (MOON) or bearish (REKT) positions on bitcoin in several time frames. Gunsberg said MoonRekt is operated by Hxro.Trade, and not Hxro Network. \"When Hxro Network goes to mainnet, Hxro.Trade will likely become an operator at the application layer of the network,\" he said."],"hashtag":["DERIVATIVES","SOLANA"]}