{"summary":"Square 4Q earnings saw $178 million worth of bitcoin sold in the quarter, up ~20% from last quarter and 240% year over year\nSquare also made $8 million worth of gross profit on bitcoin sales in 2019, less than 2% of gross profit from subscription and transaction-based services.","author":["Ryan Todd","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/57083\/square-sold-over-half-a-billion-worth-of-bitcoin-in-2019-and-outpaced-broader-crypto-exchange-volume-growth-in-4q","publishDate":"2020-02-26T16:21:54","id":3350,"type":null,"title":"Square sold over half a billion dollars worth of bitcoin in 2019, outpacing broader crypto exchange volume growth in Q4","category":["Exchanges"],"content":["Payment and mobile financial service company Square reported 4Q earnings this evening, which included another record-breaking quarter of bitcoin purchase volumes.","Square reported more than $178 million in bitcoin purchase volumes in the fourth quarter. For 2019 as a whole, the payments firm registered more than $516 million worth of bitcoin sales, translating to $8 million in gross profits – less than 2% of gross profit from subscription and transaction-based services.","","","While bitcoin volumes still pale in comparison to larger U.S. retail crypto exchanges, the surge in bitcoin demand at Square actually grew at a larger clip than Coinbase (~40% decline Q\/Q), Gemini (~60% decline Q\/Q), and Kraken (10% growth Q\/Q) in Q4. This data is drawn from analysis by The Block using data from CryptoCompare as well.","Square volumes were more in line with Binance U.S. which saw ~$250 million worth of bitcoin volume in 4Q.","","","The ability to purchase bitcoin is one of features that have been rolled into Cash App, all aimed at providing greater financial access – most recently&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/linked\/46151\/square-cash-app-q3-bitcoin-sales-topped-a-record-159-million-up-over-150-since-last-year\" data-v-f87c67ca=\"\">the ability to purchase fractionalized shares<\/a>&nbsp;of public companies.","In its Q4 shareholder letter, Square said that \"[in]&nbsp;the first three months since its launch, equity investing has seen the fastest adoption of any product ever launched by Cash App. Customers are taking advantage of the ability to buy fractional shares, with the average customer buying around $20 of stock every time they make a purchase.\"","The ability to cross-sell into other products, such as stock trading and traditional banking services, is something that other U.S. based pure retail crypto exchange apps like Coinbase currently lack. It also offers a competitive advantage on driving wider revenue per user for broader retail brokerage apps that currently don't offer the ability to buy or sell bitcoin.","On the Q4 earnings call Jack Dorsey stated that in December Cash App users generated more than $30 in annualized revenue per user, with \"bitcoin actives generating 2-3x annual revenue compared to other cash customers.\"","Square noted in its 3Q Investor Letter that the redesign of the Cash App to include shares trading had helped to drive approximately \"double\" the number of first-time bitcoin buyers within the Cash App within the 30 days following the redesign.","Dorsey has indicated on prior calls the firm is moving quickly to ensure \"quality\" for its customers, stating:","<em data-v-f87c67ca=\"\">This is a developing story and will be updated with information from the earnings call as it proceeds.<\/em>"],"hashtag":[]}