{"summary":"Binance.com is soon adding support for fiat trading, starting with Russian rubles\nSpeaking in Moscow, Binance CEO CZ said that in “about two weeks,” Binance.com should have support for Russian rubles\nLast week, euro and British pound pairs were quietly added to Binance’s API ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/43960\/binance-com-to-add-fiat-pairs-starting-with-russian-rubles-in-about-two-weeks","publishDate":"2019-10-21T05:55:56","id":3352,"type":null,"title":"Binance.com to add fiat pairs; starting with Russian rubles ‘in about two weeks’","category":["Exchanges"],"content":["Binance.com, the largest crypto-to-crypto exchange, is preparing to add support for trading between fiat and crypto — starting first with Russian rubles.&nbsp;","Binance CEO Changpeng Zhao “CZ” announced the news at the Open Innovations <a href=\"https:\/\/openinnovations.ru\/en\/\" data-v-f87c67ca=\"\">conference<\/a> in Moscow, Russia on Monday, saying: “In about two weeks or so, we should have support for Russian rubles trading directly. So you [will be able to] buy cryptocurrencies on Binance.com using rubles.\"","Just last week, on Oct. 16, Binance quietly added euro (EUR) and British pound (GBP) pairs to its application programming interface or API.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBinance <a href=\"https:\/\/www.theblockcrypto.com\/linked\/7620\/binance-starts-spreading-its-fiat-to-crypto-wings\" data-v-f87c67ca=\"\">intended<\/a> to launch a fiat-to-crypto exchange in Russia earlier this year, among other countries. So far, the exchange has launched four international fiat-to-crypto exchanges - in Uganda, Jersey, Singapore and the U.S.","The Block has reached out to Binance for a comment on the new initiative and will update this story if the firm responds.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBinance has been expanding its fiat gateways, giving users more options to buy cryptocurrencies. Last month, the exchange <a href=\"https:\/\/www.theblockcrypto.com\/post\/41011\/binance-adds-one-more-channel-to-its-fiat-gateway-allowing-users-to-pay-for-crypto-with-debit-and-credit-cards\" data-v-f87c67ca=\"\">partnered<\/a> with London-based payments processor Koinal for a fiat gateway, which allows users to purchase cryptocurrencies with Visa and MasterCard debit and credit cards, as well as via wire bank transfers. Binance also has similar partnerships with Simplex, Paxos and TrustToken for its fiat gateway channels.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nCZ said at the time that Binance will \"continue to build fiat-to-crypto gateways in our effort to increase accessibility and adoption of crypto.”"],"hashtag":["BINANCE","CZ"]}