{"summary":"Canadian users of Crypto exchange Bitstamp must withdraw funds before then and deactivate their accounts afterward.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/255748\/crypto-exchange-bitstamp-to-end-canadian-services-in-january","publishDate":"2023-10-10T14:42:30","id":3354,"type":null,"title":"Crypto exchange Bitstamp to end Canadian services in January","category":["EXCHANGES"],"content":["Crypto exchange Bitstamp will discontinue services in Canada early next year.&nbsp;","\"After initially informing our valued customers in March, Bitstamp will officially discontinue its services to customers in Canada starting Jan. 8, 2024,\" Bobby Zagotta, Bitstamp's U.S. CEO and Global Chief Commercial Officer, said in a statement emailed to The Block. \"As a result, all Canada accounts will be closed and customers will no longer have access to their accounts.\"","Zagotta urged customers to withdraw their funds by the January date.","\"This is not a decision we took lightly, and we thank our Canadian customers for their loyalty over the years,\" Zagotta added. \"We hope to be able to serve Canada again at some point in the future.”&nbsp;&nbsp;","Bitsamp also has halted certain services in the U.S. due in part to the regulatory crackdown by the Securities and Exchange Commission on <a href=\"https:\/\/www.theblock.co\/post\/233174\/solana-matic-cardano-others-securities-sec-binance-lawsuit\" data-v-f87c67ca=\"\">certain<\/a> cryptocurrencies.","The exchange <a href=\"https:\/\/www.theblock.co\/post\/243892\/bitstamp-halts-polygon-solana-other-tokens-us\" data-v-f87c67ca=\"\">stopped<\/a> the trading of MATIC, SOL, NEAR, AXS, CHZ, MANA and SAND on Aug. 9 and ended <a href=\"https:\/\/www.theblock.co\/post\/247109\/bitstamp-ether-staking-ending-us\" data-v-f87c67ca=\"\">ether<\/a> trading on Aug. 23, The Block previously reported.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Aug. 23","content":"DATE"},{"type":"Canada","content":"LOCATION"},{"type":"March","content":"DATE"},{"type":"Bobby Zagotta","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Bitstamp","content":"ORGANIZATION"},{"type":"Jan. 8, 2024","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Aug. 9","content":"DATE"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}