{"summary":"Crypto lender BlockFi announced Thursday the close of a $50 million Series C fundraise as competition in the digital asset lending market heats up.  The","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/75338\/blockfi-raises-50-million-eyes-potential-spac","publishDate":"2020-08-20T08:25:33","id":3355,"type":null,"title":"BlockFi raises $50 million, eyes potential SPAC","category":["THE BLOCK"],"content":["Crypto lender BlockFi announced Thursday the close of a $50 million Series C fundraise as competition in the digital asset lending market heats up.&nbsp;","The announcement confirms earlier reporting from The Block that BlockFi was in the process of closing a round after a Series B in February, which injected $30 million of fresh capital into the New York-based company.","The Series C was led by Morgan Creek Digital with participation from several other investors, including crypto investment firms like CMT Digital, Winklevoss Capital, Castle Island Ventures as well as two university endowments, according to BlockFi chief executive Zac Prince. The firm raised at a $400 million pre-money valuation, according to a source familiar with the deal.&nbsp;","Prince said the raise will better capitalize the business, describing the fresh funds as \"a nice to have but not a need to have.\" Indeed, Prince said the firm was still sitting on the majority of the funds from its previous raise, but it wanted to raise again to avoid having to slow down growth in its current suite of lending products and soon-to-launch bitcoin credit card.&nbsp;","\"We are launching this credit card and we have a pretty good feeling it will succeed,\" Prince said in a phone interview with The Block. \"We will have to spend a lot of money on marketing it and we wouldn't want to have to pump the brakes if it grows too fast and say 'let's slow down this awesome growth.'\"","The launch of the credit card fits into BlockFi's larger plan to evolve into a full-fledged financial services firm for the digital asset space. It would follow the launch of its retail brokerage service last year and its native app.&nbsp;","<strong data-v-f87c67ca=\"\">Competition in lending&nbsp;<\/strong>","The money might also help it fend off encroaching competition from more incumbent crypto players with far larger user-bases like Coinbase and Blockchain.com. Coinbase, which is an investor in BlockFi, announced earlier this month it would allow retail clients in the U.S. to <a href=\"https:\/\/www.theblockcrypto.com\/post\/74689\/coinbase-cash-loans-bitcoin\" data-v-f87c67ca=\"\">borrow cash<\/a> against a portion of their bitcoin holdings. Blockchain, which launched a crypto interest account service in June, <a href=\"https:\/\/www.theblockcrypto.com\/post\/75036\/preview\" data-v-f87c67ca=\"\">ramped up<\/a> its rates for bitcoin and stablecoin deposits on its platform.&nbsp;","\"I think this is awesome,\" Prince said referring to the mounting competition. \"Coinbase launched the product we launched in 2018. It is a great step and I hope they try to recreate every product BlockFi has. Competition adds value to the customer and I am sure there will only be more people trying to piggyback.\"","Still, Prince said that BlockFi losing its edge is something that keeps him up at night.&nbsp;","\"Financial services and crypto are insanely fast moving,\" he said. \"This is the landscape we are competing in and we need to stay sufficiently capitalized to keep our edge.\"&nbsp;","To date, the firm has been successful in growing its revenue ten-fold over the past year, according to a press release. The firm, which offers lending services to institutions and retail clients, says it is on pace to reach $100 million in revenue over the next 12 months. Internal documents reviewed by The Block show the company's monthly revenues have increased from $44,900 in January 2019 to more than $3 million in May. Revenues from institutions far outstrip those from retail clients.&nbsp;","","","<em data-v-f87c67ca=\"\">Source: Internal BlockFi data&nbsp;<\/em>","Jason Williams, a partner at Morgan Creek, said BlockFi is \"the rocket ship emoji.\" Sterling Witzke, a partner at Winklevoss Capital, said: \"BlockFi has demonstrated an incredible ability to build crypto-focused fin-tech products that resonate with both retail and institutional customers.\"","<strong data-v-f87c67ca=\"\">Zac's SPAC<\/strong>","Looking to the future, the firm has its sights set on possibly becoming a publicly-traded company in the next two years, as The Block previously <a href=\"https:\/\/www.theblockcrypto.com\/post\/70963\/blockfire-cfo-hire-2021-possible-ipo\" data-v-f87c67ca=\"\">reported<\/a>.&nbsp;","Prince said the firm might even consider tapping the public markets via a special purpose vehicle (SPAC).&nbsp;","\"The selling point of a SPAC is speed and there could be a scenario where based on what is going on in the crypto market this could be a very valuable way to go public.\" As <a href=\"https:\/\/www.axios.com\/spac-ipo-stock-market-cf9881e4-0170-4235-b77b-d0d3934ba77b.html\" data-v-f87c67ca=\"\">reported<\/a> by Axios' Dan Primack, SPACs are \"all the rage right now, easily outpacing traditional IPOs.\"","SPACs have accounted for $28 billion of the $72 billion raised via initial public offerings (IPOs) on U.S.-based exchanges, according to data from <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2020-08-18\/casper-sleep-s-ceo-krim-files-for-300-million-blank-check-ipo?sref=w3vFo7gi\" data-v-f87c67ca=\"\">Bloomberg<\/a>. Known as blank-check raises, such transactions strip the IPO process of some of its complexities by allowing a private company to be acquired by an already listed shell firm.&nbsp;","\"The way we think about it is we want to have all of these options available,\" he said. \"We want to have the right governance and financial controls.\"","To be sure, the firm could stay private for the next five years, but if bitcoin were to undergo a price surge then a SPAC in the short-term might make more sense. For now, the company is keeping an eye on other potential crypto IPOs, like a possible one from Coinbase. Reuters <a href=\"https:\/\/www.reuters.com\/article\/us-coinbase-ipo-exclusive\/exclusive-crypto-exchange-coinbase-readies-landmark-stock-market-listing-sources-say-idUSKBN24A21W\" data-v-f87c67ca=\"\">reported<\/a> such a deal could happen this year.&nbsp;","\"If they come out and trade like Square that would be great for the sector,\" he said. \"But if they trade a bank multiple then that is a little bit different.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Castle Island Ventures","content":"ORGANIZATION"},{"type":"Prince","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"Coinbase","content":"LOCATION"},{"type":"2018","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"SPAC","content":"ORGANIZATION"},{"type":"Witzke","content":"PERSON"},{"type":"Dan Primack","content":"PERSON"},{"type":"$400 million","content":"MONEY"},{"type":"Winklevoss Capital","content":"ORGANIZATION"},{"type":"$44,900","content":"MONEY"},{"type":"Morgan Creek","content":"ORGANIZATION"},{"type":"Morgan Creek Digital","content":"ORGANIZATION"},{"type":"Prince","content":"PERSON"},{"type":"next 12 months","content":"DATE"},{"type":"CMT Digital","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Axios","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Zac Prince","content":"PERSON"},{"type":"$3 million","content":"MONEY"},{"type":"$72 billion","content":"MONEY"},{"type":"$30 million","content":"MONEY"},{"type":"January 2019","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Jason Williams","content":"PERSON"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"\" Prince","content":"PERSON"},{"type":"$28 billion","content":"MONEY"},{"type":"$50 million","content":"MONEY"}],"hashtag":["BLOCKFI"],"authors":["Frank Chaparro","The Block"]}