{"summary":"Under a proposed bankruptcy deal, smaller creditors would get 70% of their money back.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/216416\/celsius-creditors-tout-novawulf-deal-as-best-option","publishDate":"2023-03-01T17:57:13","id":3359,"type":null,"title":"Celsius creditors tout NovaWulf deal as ‘best’ option","category":["LEGAL"],"content":["The Official Committee of Unsecured Creditors in the Celsius bankruptcy case said a proposed sale to NovaWulf Digital Management is “the best” option, according to a new court filing.","Smaller creditors would receive 70% of their money back under the <a href=\"https:\/\/www.theblock.co\/post\/211865\/celsius-sale-plan-novawulf\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">proposed<\/span><\/a> deal, while larger creditors would receive tokenized shares in a new entity managed by NovaWulf. Celsius filed for bankruptcy protection last year and owes billions to its creditors.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“While the committee will consider all options until a plan is confirmed and has become effective, the committee also believes that the NovaWulf Transaction is the best, actionable alternative at this time,” the filing said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Celsius drew nine takeover bids and 40 expressions of interest, court documents say. The new owners plan to inject between $45 million and $55 million into the business and add new divisions, like private wealth and trade finance.","The independent examiner in the Celsius bankruptcy filed a bombshell report in January detailing operational failures, market manipulation and improper use of customer assets to fund customer withdrawal requests.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NovaWulf","content":"ORGANIZATION"},{"type":"NovaWulf Transaction","content":"ORGANIZATION"},{"type":"Official Committee of Unsecured Creditors","content":"ORGANIZATION"},{"type":"70%","content":"PERCENT"},{"type":"last year","content":"DATE"},{"type":"$45 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$55 million","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"NovaWulf Digital Management","content":"ORGANIZATION"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}