{"summary":"One of the promises of blockchain has been the idea you can “tokenize” any security or asset by creating a digital, crypto token that represents an","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/260\/block-market-reinventing-securities-trading-for-the-digital-age-gets-real-2","publishDate":"2018-08-28T17:13:37","id":3360,"type":null,"title":"Block market: Reinventing securities trading for the digital age gets real","category":["MARKETS"],"content":["One of the promises of blockchain has been the idea you can “tokenize” any security or asset by creating a digital, crypto token that represents an ownership interest in a company, a building, a work of art. The skeptic might note that’s already mostly possible. Shares of stock represent fractional ownership interest in corporations and they are easily traded on exchanges throughout the world — no (analog) paper certificates required like in the old days.","So the news today that&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.openfinance.io\/\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.openfinance.io\/\" data-v-f87c67ca=\"\">OpenFinance<\/a>&nbsp;has launched the first regulated exchange for securities tokens might not seem very exciting at first glance. In this case, though, first impressions might miss the bigger picture. Sure, you can buy or sell a small piece of Apple or Tesla, but what about interest in a venture capital fund or discrete real-estate project? Publicly traded vehicles to handle those kinds of things tend to aggregate assets — like real-estate investment trusts — to avoid the complexity of listing numerous individual stocks for trading.","The promise of tokenization is that a simpler, faster method now exists to atomize ownership interest in assets.&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.spicevc.com\/\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.spicevc.com\/\" data-v-f87c67ca=\"\">SPiCE venture capital<\/a>&nbsp;will trade on the new exchange OpenFinance has built, offering small pieces of their venture fund to investors that are freely tradable. SPiCE is built around the idea that asset tokenization will be big, so they are “eating their own dog food” by listing. Blockchain Capital, another VC firm, will also list on OpenFinance (and yes their name describes the business well). The other early listings seem mostly focused specifically on blockchain and crypto-related entities — which makes sense, even though it doesn’t yet foretell mass use of the platform.","Still, a better, cheaper faster way of buying and selling assets&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">does have<\/em>&nbsp;mass appeal. And if OpenFinance is successful, similar efforts at Coinbase, Bittrex, and Overstock might be as well. There will be issues of price discovery and consistency if a thousand token markets bloom; today, you can be fairly well assured that a share of Tesla is worth the same no matter where it trades. Fortunately, cryptocurrency hacks won’t be an issue, however.","These tokens are true, registered security interests. They’ll only be listed if they fall under a “safe harbor” of an existing SEC regulation (whether that be Reg D, S, A+ or CF). That means there are some compliance costs associated with tokenizing your asset, whatever it may be, but much less than what it takes to do a traditional IPO in the stock market. If necessary, the issuers can cancel the tokens stolen by thieves, reissue them, et al. This isn’t&nbsp;<em data-v-f87c67ca=\"\">pseudo-anonymous<\/em> bitcoin where thieves can disappear into the night with millions.","But so far, it doesn’t seem like OpenFinance is providing an inexpensive platform, belying one of the promises of blockchain, token-based assets.","Their listing and transaction fees seem a bit high. $50,000 to list plus $50,000 per year plus trading fees of 3% from buyer and 2% from seller. The whole idea of Blockchain is to cut out the costs, but this does not achieve the goal if they are double, triple dipping fees.","<script async=\"async\" src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\" data-v-f87c67ca=\"\"><\/script>","I asked Garrett how he learned of the fees, and he replied he was told about them during a conversation with the company about listing his security token. If tokenization is to make asset trading easier, fees from the old days of Wall Street can’t realistically be part of the mix. We at&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">The Block&nbsp;<\/em>will talk more with OpenFinance as well as the other would-be alternative trading systems in the coming weeks.","Questions about costs, though, are just the beginning. Liquidity of these markets will also matter a great deal (e.g. how easily can I buy and sell at prices that are reported and understood? what happens if there’s a stampede into or out of a token?) But of course compared to existing methods for many assets, liquidity will be improved measurably simply by having these new platforms. Trading limited partnership interests in a VC fund, or a single real-estate deal, or a baseball team involves lawyers, bespoke deals, and significant control on who you’re even allowed to sell to.","The promise, then, of asset tokenization is a more democratic, less controlled method to buy and sell assets. It’s perhaps best to think about it like a stock market on steroids. Because OpenFinance and its fast followers are working within the regulations, including “know your customer” laws and money-laundering concerns broadly, there is reason for hope. Indeed, Tesla’s “go private” scheme where individual investors would’ve been allowed to keep a stake in the company while the company technically left the Nasdaq and “went private” could have worked here. Technically, the company would still have been public, albeit with lighter reporting requirements and perhaps some protections against so-called activist investors.","Of course, that hybrid model isn’t ultimately entirely investor friendly. The responsibilities of being a public company in the traditional sense afford investors reporting rules and clear governance. But even there, Facebook and Snapchat are object lessons in how shareholders might not have control even with ownership (you get no votes at Snapchat on shareholder matters!). So today’s news is a harbinger of a new kind of market. Perhaps even one that will revolutionize things. But this is a long game and we’re barely in the warm-up stages.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Garrett","content":"PERSON"},{"type":"3%","content":"PERCENT"},{"type":"2%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Tesla","content":"LOCATION"},{"type":"$50,000","content":"MONEY"},{"type":"OpenFinance","content":"ORGANIZATION"},{"type":"Bittrex","content":"LOCATION"},{"type":"Overstock","content":"ORGANIZATION"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":[],"authors":["John Biggs","The Block"]}