{"summary":"Atomic Loans has raised a $2.45 million seed round led by Initialized Capital, with participation from ConsenSys, Morgan Creek Digital, and Bison Trails’ Joe Lallouz and Aaron Henshaw\nThe startup provides DeFi lending experience for BTC holders; users can lock BTC in an on-chain escrow and take out DAI or USDC loans or lend out their DAI to earn interest\nThe borrowing feature of the protocol is now open to the public, while the lending side is still being beta tested","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/61652\/atomic-loans-funding-decentralized-lending-bitcoin","publishDate":"2020-04-14T12:10:13","id":3360,"type":null,"title":"Atomic Loans raises $2.45 million to build a decentralized lending protocol for bitcoin","category":["Lending"],"content":["<span data-v-f87c67ca=\"\">Atomic Loans, a startup that allows users to deposit bitcoin and take out DAI and USDC loans, has raised a $2.45 million seed round led by Initialized Capital.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Toronto-based company was founded in January 2019 and previously raised a $200,000 pre-seed from ConsenSys. The latter also participated in the latest funding round, along with Morgan Creek Digital and enterprise blockchain startup Bison Trails founders Joe Lallouz and Aaron Henshaw.&nbsp;<\/span>","<span data-v-f87c67ca=\"\"><a href=\"https:\/\/www.coindesk.com\/lock-btc-get-dai-lending-firm-bridges-bitcoin-defi-divide-in-latin-america\" data-v-f87c67ca=\"\">Although there are other crypto lending firms<\/a><\/span><span data-v-f87c67ca=\"\"> that accept BTC as collateral for DAI loans, Atomic Loans seeks to differentiate itself by providing a decentralized lending experience that does not require users to give away custody of their BTC.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Instead of storing BTC when issuing loans, Atomic Loans locks the bitcoin collateral in a non-custodial escrow. When borrowers repay their loans, those coins locked in the escrow will be released and returned to the borrowers.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"Something we've been doing is asking every potential user how much they care about custodial risk on a scale of 1-5. Definitely some that don’t care as much, but the early adopters who really want Atomic are often a 4 or a 5,\" said Atomic Loans co-founder and CTO Matthew Black.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Black, Atomic Loans' offering can be attractive to miners, who need cash to cover their monthly operational expenses but do not want to sell BTC. Traditionally, miners would go to lending desks to borrow cash, waiting for those firms to approve their requests and issue the loans manually.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">With the new fund, Atomic Loans hopes to expand its three-person team, obtain a protocol audit and strengthen its compliance efforts.<\/span>","<span data-v-f87c67ca=\"\">\"Our goal is to create a decentralized financial infrastructure for bitcoin from the ground up… we really can access the full liquidity of bitcoin very easily and take advantage of lenders that want to put their USDC and DAI to work,\" said Black.&nbsp;<\/span>","According to Black, the borrowing feature is now open to the general public, while the lending side of the protocol – wherein users deposit DAI or USDC to earn interests – is still under beta testing.&nbsp;"],"hashtag":["DAI"]}