{"summary":"A recent token deal between crypto firms Alameda Research and Reef Finance quickly turned into an ugly — and public — fight on Monday.\nHere’s what went wrong.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/98345\/reef-finance-alameda-research-token-deal-drama","publishDate":"2021-03-16T12:55:20","id":3361,"type":null,"title":"Token deal drama between Alameda, Reef Finance breaks into public view","category":["DeFi"],"content":["A recent token deal between crypto firms Alameda Research and Reef Finance quickly turned into an ugly — and public — fight on Monday.","Both parties started slinging mud at each other, alleging that the other party was in the wrong. It all <a href=\"https:\/\/www.theblockcrypto.com\/linked\/98146\/alameda-research-buys-20-million-worth-reef-tokens-polkadot-defi\" data-v-f87c67ca=\"\">started with Alameda Research buying<\/a>, or \"investing,\" $20 million in Reef Finance by buying the DeFi project's REEF tokens for that amount. Alameda bought the tokens at a <a href=\"https:\/\/medium.com\/reef-finance\/our-official-response-to-recent-events-regarding-alameda-a1978f7fbe57\" data-v-f87c67ca=\"\">20% discount<\/a>.","Three days after Reef Finance announced the investment, Alameda's trader <a href=\"https:\/\/twitter.com\/AlamedaTrabucco\/status\/1371429927698886657\" data-v-f87c67ca=\"\">Sam Trabucco tweeted<\/a> that the market maker is not affiliated with Reef and that it does not recommend anyone to do business with Reef in any way.","\"We agreed to an OTC [over-the-counter] trade with REEF; they immediately went to the press to brag. They then reneged on the OTC trade,\" said Trabucco. Alameda had wanted to buy more REEF tokens, but for some reason, Reef backed out.","As The Block reported last week, Alameda <a href=\"https:\/\/www.theblockcrypto.com\/linked\/98146\/alameda-research-buys-20-million-worth-reef-tokens-polkadot-defi\" data-v-f87c67ca=\"\">wanted to buy a further $60 million worth of REEF tokens<\/a>. But the deal has now been canceled.","So what went wrong? Based on the information that became public, it appears that a mix of competing incentives and the reliance on what Alameda called a “<a href=\"https:\/\/alameda-research.medium.com\/reef-updates-b3645b65790a\" data-v-f87c67ca=\"\">handshake deal<\/a>” — that is, a verbal commitment to a transaction conducted via Telegram — are to blame.","The deal involved Alameda first buying $20 million worth of REEF tokens and subsequently purchasing more tokens for $60 million, making the total $80 million.","Soon after the first $20 million tranche, <a href=\"https:\/\/medium.com\/reef-finance\/our-official-response-to-recent-events-regarding-alameda-a1978f7fbe57\" data-v-f87c67ca=\"\">Reef says it noticed<\/a> that Alameda immediately offloaded the tokens on Binance. \"We could not understand why Alameda, our long-term strategic investor would offload their tokens immediately after purchase to Binance,\" said Reef.","Reef CEO Denko Mancheski told The Block that Alameda sold \"all\" tokens it bought, suggesting that the firm wasn't interested in holding the tokens for the long term.","Alameda's Trabucco said that’s not what happened. \"We are still in possession of the great majority, any claims about us immediately selling all the tokens are false,\" he said.","According to The Block Research, Alameda deposited all the 675 million purchased tokens onto Binance, which may have triggered Reef’s initial suspicion. But then Alameda withdrew at least 50 million tokens from the total and deposited them onto FTX.","It is not possible to track the trading of all tokens since that information would be available only with Alameda and Binance. The Block Research could track the movement of the 50 million tokens because this was the first transfer to the FTX wallet through Alameda's deposit wallet.","Alameda's Trabucco declined to comment on the number of REEF tokens sold.","Reef's Mancheski claimed that Alameda did in fact sell all the tokens. Otherwise, they could have proved that \"they are not lying, by moving the tokens back to addresses.\"","\"They did more than just sell them,\" said Mancheski. \"They ignited the dump themselves, which is market manipulation.\"","FTX — Alameda's sister company — ran a poll on Twitter, asking users if REEF should be delisted from the exchange because it was a \"rug pull.\"","FTX later deleted that tweet. Alameda also threatened to send legal letters to Reef via Telegram messages and later deleted them.","Amid the fiasco, the REEF token fell about 30% in the last 24 hours, though it has since recovered. It is currently trading down by about 3%, at $0.04, according to TradingView.","","","While it cannot be said for sure which party is at fault here, the drama nonetheless provided a window into the often invisible world of crypto deal-making — albeit via an example illustrated in public, personal terms.","According to one observer, the back-and-forth also shined a light on the importance of formal agreements. Equity finance rounds tend to rely on those instead of such \"handshake\" deals like this one.","\"Trades should be supported by contracts (and collateral!),\" <a href=\"https:\/\/twitter.com\/maxboonen\/status\/1371708397825970176\" data-v-f87c67ca=\"\">tweeted<\/a> Max Boonen, founder of crypto market maker B2C2. “Remember when Bitfinex sent $1bn to CryptoCapital without a contract?”","Boonen said that the notion that the crypto OTC market doesn't rely on contracts is not true — at least in the \"serious\" part of the market.","\"Oral contracts: yes, but good luck enforcing that,\" he said."],"hashtag":["FTX"]}