{"summary":"Galaxy Digital announced its financials from Q4 2020\nThe firm said that it experienced growth across all of its business units\nIt has brought on a new CFO and is eyeing a secondary listing in the US","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/99841\/galaxy-digital-new-cfo-q4-financials","publishDate":"2021-03-30T11:35:17","id":3363,"type":null,"title":"Galaxy Digital announces new CFO, company-wide growth in Q4 financial report","category":["The Block"],"content":["Mike Novogratz's crypto investment bank Galaxy Digital released its financial results for the fourth quarter of 2020, outlining growth across its asset management, trading, and new mining operation.&nbsp;","The New York-based firm—which trades publicly in Canada—said that its net comprehensive income came in at $335.7 million, an increase of 1,175% relative to the same quarter in 2019. Underpinning the firm's income growth were fresh performance records across its business units.&nbsp;","Its trading business, for instance, reported record trading volume with clients, while its asset management unit's assets under management (AUM) climbed to $807 million by the end of the year—a 98% increase from its AUM at the end of September, the firm said.&nbsp;","Its new mining business, led by Amanda Fabiano, established a bitcoin mining operation and has begun proprietary mining, according to the firm.&nbsp;","The financial report also revealed the firm's plans to conduct a secondary listing to trade on a US-based venue as well as the hire of a new chief financial officer. It's unclear exactly what form that secondary listing would take.&nbsp;","Alex Ioffe, previously was CFO of Virtu Financial, has filled the C-suite position following the exit of Ash Prithipaul.&nbsp;","Ioffe is among the several new Wall Street vets to join Galaxy Digital's ranks after Michael Ashe <a href=\"https:\/\/www.theblockcrypto.com\/post\/84528\/galaxy-digital-crypto-q3-2020-results-financials-acquisition-deals\" data-v-f87c67ca=\"\">joined<\/a> from Oppenheimer to lead investment banking. Alex Thorn, a more than 10 year veteran at Fidelity Investments, recently <a href=\"https:\/\/www.theblockcrypto.com\/post\/95747\/galaxy-digital-crypto-research-growth\" data-v-f87c67ca=\"\">joined<\/a> the firm to lead its new research business.&nbsp;","The firm expects to expand its headcount by 40% over the next year.&nbsp;","Galaxy Digital stock was up more than 2% during Tuesday morning trading and is up more than 119% year-to-date.&nbsp;","<iframe title=\"Bitcoin vs Crypto Stocks Performance\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/crypto-stocks-returns\/embed\" width=\"100%\" height=\"420\" frameborder=\"0\" data-v-f87c67ca=\"\"><\/iframe>"],"hashtag":[]}