{"summary":"Genesis creditors are working to finalize a plan for the firm&#x27;s bankruptcy ahead of filing, according to two sources familiar with the negotiations.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/203310\/genesis-creditors-negotiating-prepackaged-bankruptcy-sources","publishDate":"2023-01-18T13:55:26","id":3365,"type":null,"title":"Genesis creditors negotiating prepackaged bankruptcy: Sources","category":["COMPANIES"],"content":["Genesis Global Capital creditors are negotiating a prepackaged bankruptcy plan with the firm, two sources familiar with the talks told The Block.&nbsp;","Creditors like the Winklevoss twins' Gemini would agree to a forbearance period — in most of the payments — of between one and two years under the prepackaged bankruptcy plan, according to one of the sources. In exchange, creditors will receive cash payments and equity in Genesis parent company Digital Currency Group, the source said.","Gemini formed an ad hoc committee late last year in an effort to coordinate efforts with other creditors and advocate together for a resolution after Genesis halted withdrawals on its platform. The creditor committee has been privately negotiating for the past few weeks with Genesis in an effort to finalize a Chapter 11 bankruptcy protection plan ahead of filing.","Publicly, Gemini co-founder Cameron Winklevoss has been feuding with Barry Silbert, the head of Genesis parent Digital Currency Group. He's accused him of comingling funds at the crypto conglomerate, negotiating in bad faith and, in his most recent open-letter, insisted he step down as DCG's top executive.&nbsp;","Genesis, DCG and Gemini didn't immediately respond to requests for comment.","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">The idea when filing Chapter 11 is to create a window of time and space in which the business and its creditors can come together to save the underlying economic enterprise,<\/span><span data-contrast=\"auto\" data-v-f87c67ca=\"\"> according to Vincent Buccola, who researches and teaches about reorganization and bankruptcy at Wharton Business School.<\/span>","<span class=\"TextRun SCXW66972015 BCX0\" lang=\"EN-GB\" xml:lang=\"EN-GB\" data-contrast=\"auto\" data-v-f87c67ca=\"\"><span class=\"NormalTextRun SCXW66972015 BCX0\" data-v-f87c67ca=\"\">A prepackaged filing involves the debtor negotiating the terms of its plan and soliciting votes from creditors prior to the actual filing with the goal of speeding up the time it takes to emerge from bankruptcy protection.&nbsp;<\/span><\/span>","Genesis halted withdrawals and new loan originations from its lending affiliate on Nov. 16 in the wake of FTX's collapse. Genesis Global Trading's derivatives business had $175 million stuck in FTX after its demise. The firm had previously been impacted by the collapse of the hedge fund firm 3AC.&nbsp;","Investment and financial services firm Houlihan Lokey <a href=\"https:\/\/www.theblock.co\/post\/197117\/genesis-and-dcg-creditor-committee-propose-plan-for-asset-recovery\" data-v-f87c67ca=\"\">presented<\/a> a liquidity resolution plan on behalf of the creditor committee for Genesis and DCG in December.&nbsp;","The firm told clients on Jan. 4 it was working toward a solution for the troubled borrowing and lending unit but that it needed more time to do so.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Wharton Business School","content":"ORGANIZATION"},{"type":"DCG","content":"ORGANIZATION"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"Gemini","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Winklevoss twins","content":"ORGANIZATION"},{"type":"$175 million","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"Barry Silbert","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Houlihan Lokey","content":"PERSON"},{"type":"Jan. 4","content":"DATE"},{"type":"Cameron Winklevoss","content":"PERSON"},{"type":"Vincent Buccola","content":"PERSON"},{"type":"Nov. 16","content":"DATE"}],"hashtag":["CAMERON &AMP; TYLER WINKELVOSS","GEMINI"],"authors":["Adam Morgan McCarthy","Frank Chaparro","The Block"]}