{"summary":"Bitcoin miner manufacturer Ebang has officially filed for U.S. IPO\nThe company is looking to raise up to $100 million by listing its shares either on the NYSE or Nasdaq ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/63010\/bitcoin-miner-maker-ebang-officially-files-for-100-million-us-ipo","publishDate":"2020-04-25T03:50:18","id":3365,"type":null,"title":"Bitcoin miner maker Ebang officially files for $100 million US IPO","category":["Mining"],"content":["Ebang International, one of the world’s largest bitcoin mining machines manufacturers, has just formally filed for an initial public offering (IPO) in the U.S.","Ebang is looking to raise up to $100 million through the offering, according to an <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1799290\/000121390020010071\/ea121021-f1_ebanginter.htm#a_001\" data-v-f87c67ca=\"\">F-1 form filed<\/a> with the U.S. Securities and Exchange Commission (SEC) on Friday. The company looks to offload Class A ordinary shares, having a face value of HK$0.001 (US$ 0.00013) per share.","China-based Ebang intends to list its shares either on the New York Stock Exchange (NYSE) or Nasdaq Global Market, under the symbol “EBON,” per the form F-1. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nHong Kong-based AMTD Global Markets Limited and U.S.-based Loop Capital Markets LLC are listed as joint underwriters for Ebang's IPO.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nEbang is one of the leading ASIC (application-specific integrated circuit) chips designers and made 82% of its 2019 revenue on designing these chips for bitcoin mining. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nEbang's revenues, however, fell sharply last year to $109 million as compared to $319 million in 2018. The company had a gross loss of $30.6 million in 2019 as compared to a gross profit of $24.4 million in 2018.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Revenue split<\/strong><\/span><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nEbang, the Ebit bitcoin miner maker, had most of its 2019 revenues (over 53%) from selling Ebit E12 Series machines, followed by Ebit E10 Series machines (34%).<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\"><\/strong>","","It is worth noting that the number of chips and the average price at which Ebang sold its chips, both declined in 2019 as compared to the previous year. In 2018, Ebang sold 415,930 mining chips for the average price of $737, while in 2019 it sold 289,953 chips at an average price of only $304.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“The decrease in the Bitcoin price in 2018 and the first quarter of 2019 resulted in a material decrease in our sales volume and in the average selling price of our Bitcoin mining machines. Although the Bitcoin price started to recover in the second quarter of 2019, our operations generally lag behind the increase of Bitcoin price, and we recorded a revenue of US$109.1 million in 2019,” said Ebang.","<strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Risk factors<\/span>&nbsp;<\/strong>","Ebang said its operations significantly depend on bitcoin's price. “Our results of operations have been and are expected to continue to be significantly impacted by the fluctuation of Bitcoin price, and in particular, significantly and negatively impacted by the sharp Bitcoin price decrease,\" said the company, adding:","\"The price of Bitcoin tends to have a direct impact on the market demand for our Bitcoin mining machines, in terms of both the price and the quantity, and we expect this trend to continue.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe coronavirus pandemic has \"adversely affected\" the bitcoin price, according to Ebang, and the lower prices \"may continue in the near term and adversely affect our business of operations and financial condition.\"","“We and our customers have experienced significant business disruptions and suspension of operations due to quarantine measures to contain the spread of the pandemic, which may cause shortage in the supply of raw materials, reduce our production capacity, increase the likelihood of default from our customers and delay our product delivery,” Ebang added.","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Second attempt&nbsp;<\/strong><\/span>","This is Ebang's second attempt to go public. In June 2018, the company filed for an IPO in Hong Kong, but it failed to take off. At the time, Ebang was reportedly <a href=\"https:\/\/www.reuters.com\/article\/us-bitcoin-hongkong-ipo\/chinese-bitcoin-mining-gear-makers-set-sights-on-worlds-largest-bitcoin-ipos-idUSKCN1IG0F2\" data-v-f87c67ca=\"\">looking to<\/a> raise as much as $1 billion. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nFriday's filing confirms recent <a href=\"https:\/\/news.8btc.com\/chinese-bitcoin-miner-maker-ebang-is-planning-a-u-s-ipo-following-canaan-and-bitmain\" data-v-f87c67ca=\"\">reports,<\/a>&nbsp;which said Ebang is looking to go for a U.S. IPO. But the targeted raise amount is sharply down.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nEbang rival Canaan Creative, also based in China, went public in the U.S. last year. It raised $90 million (compared to a targeted amount of $400 million) by listing its shares on Nasdaq in November. But Canaan's shares have taken a beating and are down by around 53% since its listing.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n",""],"hashtag":["SEC"]}