{"summary":"Dubbed &quot;Code Reader,&quot; the Etherscan tool can be used to &quot;gain deeper insights into the code by generating AI prompts.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235459\/etherscan-unveils-ai-fueled-code-reader-tool-to-analyze-smart-contract-code","publishDate":"2023-06-19T10:28:10","id":3367,"type":null,"title":"Etherscan unveils AI-fueled &#x27;Code Reader&#x27; tool to analyze smart contract code","category":["COMPANIES"],"content":["Ethereum blockchain <a href=\"https:\/\/www.theblock.co\/post\/176153\/google-now-showing-ethereum-wallet-balances\" data-v-f87c67ca=\"\">explorer<\/a> Etherscan has unveiled a new AI tool that will use OpenAI's large language model to help users learn about the source code of any smart contract.","Dubbed \"<a href=\"https:\/\/info.etherscan.com\/code-reader\/\" data-v-f87c67ca=\"\">Code Reader<\/a>,\" Etherscan said the beta tool can be used to \"gain deeper insights into the code by generating AI prompts for specific code sections or functions that you want to understand better.\" It added that targeted questions will produce AI-generated explanations for specific smart contract code, thereby \"enabling you to delve into the inner workings of the code.\"","\"This feature is particularly valuable when interacting with a smart contract for the first time, as it provides a thorough understanding of its operations and functionality,\" Etherscan added.","<span data-v-f87c67ca=\"\">A screenshot of Etherscan's Code Reader AI tool<\/span>","Among other use cases, Etherscan said the tool can be used to obtain a comprehensive list of smart contract functions related to reading and writing Ethereum data. The tool can be used to explore code to integrate a smart contract with decentralized applications.","Etherscan <a href=\"https:\/\/twitter.com\/etherscan\/status\/1670757726178390016\/photo\/1\" data-v-f87c67ca=\"\">posted<\/a> a disclaimer stating that an OpenAI API key with sufficient usage limits will be required to use the AI service on its website. It also advised users not to assume that all answers are correct. To get started, a user can insert the API key, enter a contract address, select a source file to interact with, and then begin asking questions.","\"Don’t assume answers are correct!\" Etherscan <a href=\"https:\/\/twitter.com\/etherscan\/status\/1670757723858956290\" data-v-f87c67ca=\"\">warned<\/a> on Twitter. \"This is very much a *Beta* release - please let us know what you'd like us to add or improve!\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Etherscan","content":"PERSON"},{"type":"Etherscan","content":"ORGANIZATION"},{"type":"API","content":"ORGANIZATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}