{"summary":"LedgerX is teaming up with T3 on a new bitcoin volatility index\nFor now, it will just be a reference for traders, says CEO Zach Dexter\nPending regulatory approvals, LedgerX and T3 plan to commercialize it, meaning it would be tradable like Wall Street’s infamous VIX","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/71174\/ledgerx-is-taking-another-shot-at-a-bitcoin-fear-gauge","publishDate":"2020-07-10T14:02:02","id":3368,"type":null,"title":"LedgerX is taking another shot at a bitcoin fear gauge","category":["Startups"],"content":["LedgerX is taking another stab at a VIX-like bitcoin volatility index.&nbsp;","Announced Friday, the so-called BitVol Index is the result of a partnership between the New York-based options venue and T3 Index, a provider of options-based indices. Similar to Wall Street's fear gauge—the VIX—BitVol measures the 30-day implied volatility of bitcoin, leveraging LedgerX's market data.&nbsp;","This isn't LedgerX first attempt at a bitcoin volatility index. In 2019, it <a href=\"https:\/\/www.coindesk.com\/ledgerx-launches-bitcoin-fear-index-to-track-market-volatility\" data-v-f87c67ca=\"\">launched<\/a> the LedgerX Volatility Index (LXVX). But chief executive officer Zach Dexter said the new product will draw on data from multiple sources.&nbsp;","\"The more data we can add, the more high-quality of an index we can display,\" he said in a phone interview with The Block.","For now, the index will be visible on LedgerX's platform. It is also visible on Refinitiv's Eikon—a rival to the ubiquitous Bloomberg terminals that pepper Wall Street. Dexter said it could serve as a resource for options traders, such as those who might want to buy calls if they see a dip in volatility. Call options are cheaper when volatility decreases.&nbsp;","It could also lure participants to the firm's market, which has lagged behind rivals like Deribit, CME Group, and OKEx.&nbsp;","Looking to the future, Dexter said T3 and LedgerX could \"commercialize\" the index, meaning build a tradable product on top of it. Such a product would be a first in the bitcoin market. LedgerX wouldn't move forward with listing the product on its market until it received all of the necessary regulatory approvals, Dexter stressed.","On Wall Street, traders have poured into the VIX and strategies relating to volatility have soared, as recently <a href=\"https:\/\/www.wsj.com\/articles\/volatility-is-everywhere-the-market-tactic-thats-driving-stocks-haywire-11591977978\" data-v-f87c67ca=\"\">reported<\/a> by The Wall Street Journal. Specifically, more than a trillion dollars’ worth of derivatives bets connected to the VIX have traded since the beginning of the year, according to The Journal.","T3's Simon Ho said that the commercialization of BitVol could lead to the development of additional products tied to bitcoin's volatility and allow traders to execute new types of strategies.&nbsp;","\"It could engender cross-asset trading between [BitVol] and the VIX,\" he said."],"hashtag":[]}