{"summary":"The developer behind the new mobile game said the title has been ranking high in several markets ahead of its token airdrop on Tuesday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276136\/binance-backed-heroes-of-mavia-token-airdrop-crypto-game-1-million-downloads","publishDate":"2024-02-06T08:26:06","id":3368,"type":null,"title":"Binance-backed &#x27;Heroes of Mavia&#x27; airdrops token after crypto game nabs over 1 million downloads","category":["GAMING"],"content":["Fresh from scoring more than 1 million downloads, the blockchain-powered mobile game \"Heroes of Mavia\" is airdropping its token on Tuesday, the developer Skrice Studios said in a statement.","Heroes of Mavia launched for both Apple and Android devices less than a week ago and already has more than 230,000 daily active users, the company said. Besides the mobile game shooting to the number one slot as the top free mobile game available on Android devices in China, it has dominated on the Google Play store in Nigeria. \"Heroes of Mavia\" is also ranked high on the Apple's App Store in Poland, Finland and Canada, according to the company.","Skrice Studios said that 100,000 players have qualified for today's airdrop of the MAVIA token. Up to 6,250,000 tokens can be claimed — 2.5% of the total supply of 250 million.","While the challenge to become the first blockchain video game to break into the mainstream has yet to be achieved, \"Heroes of Mavia\" appears to be off to a strong start. Other high-profile <a href=\"https:\/\/www.theblock.co\/post\/275776\/epic-games-is-listing-call-of-duty-style-crypto-video-game-shrapnel\" data-v-f87c67ca=\"\">gaming projects<\/a> hoping to become successful with mainstream gamers include \"Star Atlas,\" \"Illuvium\" and \"Shrapnel.\"&nbsp;","Skrice Studios' most recent raise was two years ago when it collected $2.5 million in a round led by Crypto.com Capital, giving the developer a valuation of $100 million at the time, the company said. <a href=\"https:\/\/www.theblock.co\/post\/191666\/animoca-binance-investment-program-falters\" data-v-f87c67ca=\"\">Binance Labs<\/a> led a separate seed round of $5.5 million in 2021. The company has raised a total of $9 million, it said in its statement.","The \"Heroes of Mavia\" token was scheduled to go live as of 7 a.m. ET on exchanges like Bybit, KuCoin and HTX, the company also said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"$2.5 million","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"7 a.m.","content":"TIME"},{"type":"Google","content":"ORGANIZATION"},{"type":"Mavia","content":"ORGANIZATION"},{"type":"2.5%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Skrice Studios","content":"ORGANIZATION"},{"type":"$9 million","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Nigeria","content":"LOCATION"},{"type":"$5.5 million","content":"MONEY"},{"type":"Poland","content":"LOCATION"},{"type":"MAVIA","content":"ORGANIZATION"},{"type":"Finland","content":"LOCATION"},{"type":"China","content":"LOCATION"}],"hashtag":["GAME"],"authors":["RT Watson","The Block"]}