{"summary":"SoftBank Vision Fund 2 and Tiger Global Management have just plowed $800 million into Revolut, the London-based neobank.\nStaff with ordinary shares and those whose options have vested can sell a chunk of their shares as part of the capital injection.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/111681\/revolut-staff-sell-shares-through-softbank-mega-round","publishDate":"2021-07-16T11:42:32","id":3369,"type":null,"title":"Revolut staff can cash in 20% of eligible shares via SoftBank mega-round","category":["Fintech"],"content":["Veteran staff at Revolut are being given the chance to sell a portion of their shares in the company as part of the British neobank’s <a href=\"https:\/\/www.theblockcrypto.com\/linked\/111469\/revolut-raises-800-million-33-billion-valuation\" data-v-f87c67ca=\"\">$800 million Series E round<\/a>, The Block has learned.","Announced July 15, the SoftBank Vision Fund 2 and Tiger Global Management led fundraise gives Revolut a valuation of $33 billion, making it the most valuable British fintech firm in history.","Revolut’s founder and CEO Nikolay Storonsky now boasts a paper fortune of around $7.1 billion, <a href=\"https:\/\/www.forbes.com\/sites\/daviddawkins\/2021\/07\/15\/founder-nik-storonskys-net-worth-more-than-quintuples-after-revolut-becomes-uks-most-valuable-fintech\/?sh=4cffaac668d5\" data-v-f87c67ca=\"\">according to reports<\/a>. But it's a boon for his 2,200 employees too, who were informed on July 16 that they will be given the chance to sell 20% of their shares in the startup, on certain conditions.","Only staff holding ordinary shares, vested share options, and vested ‘growth shares’ will be eligible to take advantage of the opportunity. They must also have been working at Revolut for at least 18 months and must have started before February 1, 2020. Those eligible to cash in their holdings have until July 20 to do so.","Sales will take place at the price of $609.775 per share, which is roughly five times what they had been worth on paper before the fundraise. The overall value of the company has risen six times since it <a href=\"https:\/\/techcrunch.com\/2020\/07\/24\/revolut-extends-series-d-round-to-580-million-with-80-million-in-new-funding\/\" data-v-f87c67ca=\"\">raised $580 million<\/a> across two Series D rounds in February and July last year at a valuation of $5.5 billion. The slight difference in uplift is due to the effects of dilution.","A spokesperson for Revolut was contacted for comment and said they had “nothing to add to what you have already.”","In February, Revolut rolled out <a href=\"https:\/\/www.theblockcrypto.com\/post\/94999\/revolut-growth-shares-employees-plan-neobank\" data-v-f87c67ca=\"\">a new ‘growth shares’ scheme<\/a> which became the de facto bonus structure for staff based in the United Kingdom, Ireland, France, Portugal and Sweden. The scheme was designed to lower the tax liability attached to employee options should they get the chance to sell them.","At the time, The Block reported that staff had expressed concerns over the new structure because of up-front fees of £1.95 and a “hurdle rate” — the price at which the growth shares could be converted into normal shares — of £91 (around $126) per share. That hurdle rate was the same price paid per share by Revolut’s Series D investors.","To profit from their share options, Revolut needed to provide an exit opportunity at a price far enough in excess of $5.5bn that the pay-out would also cover the up-front cost of purchasing the growth shares and Capital Gains Tax.","Whether or not an uplift of 5x fits the bill remains to be seen, but it is surely as lofty a price as shareholders could have hoped for.","Launched in 2015 as an app and card business offering travellers cheap foreign exchange rates, Revolut has since ballooned into a so-called ‘super-app’.","“SoftBank and Tiger Global’s investments are an endorsement of our mission to create a global financial super-app that enables customers to manage all their financial needs through a single platform,” said Storonsky in a statement.","The startup now offers its more than 15 million customers current accounts, insurance products, stock investments, and a suite of crypto trading tools."],"hashtag":[]}