{"summary":"Perpetual Protocol has raised $1.8 million in strategic funding in a round led by Multicoin Capital.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/75951\/defi-perpetual-protocol-funding-multicoin","publishDate":"2020-08-25T11:00:11","id":337,"type":null,"title":"DeFi project Perpetual Protocol raises $1.8 million in funding round led by Multicoin Capital","category":["DEFI"],"content":["Taiwan-based decentralized finance (DeFi) project Perpetual Protocol has raised $1.8 million in strategic funding.","Sharing the news exclusively with The Block on Tuesday, Perpetual Protocol said the round was led by Multicoin Capital, with participation from Three Arrows Capital, CMS Holding, and Alameda Research. The protocol will use the fresh capital to launch its mainnet in September. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAs the name suggests, Perpetual Protocol is a decentralized protocol focused only on perpetual futures contracts. Co-founder Yenwen Feng told The Block that Perpetual Protocol could be seen as a combination of Uniswap, a decentralized exchange protocol, and BitMEX, a derivatives exchange that offers perpetual contracts.","But what differentiates Perpetual Protocol is the \"virtual automated market maker (vAMM)\" design, contended Feng. \"The virtual part of vAMM implies that there is no real asset stored inside the vAMM. The real asset is stored in a smart contract vault that manages all of the collateral backing the vAMM.\" This helps support leveraged trading, said Feng.","Protocols like dYdX and MCDEX also support perpetual contracts with leverage trading, but Feng said these platforms follow either order-book or AMM design or combination of both.","Perpetual Protocol's vAMM model also helps with lower slippage rate, said Feng. \"Traders on constant product (x*y=k) market makers like Uniswap suffer from higher slippages than centralized exchanges because k is capped by liquidity provided. Perpetual Protocol's vAMM can have 'k' set algorithmically to provide lower slippage to traders,\" said Feng. The slippage rate is the difference between the expected price and the execution price of a trade.","At launch, Perpetual Protocol would support bitcoin (BTC), ether (ETH) and Chainlink (LINK) futures, and will expand to other synthetic assets in the future, including those tied to gold, crude oil and fiat currencies. The protocol would not be available to U.S. residents.","Perpetual Protocol will also have its native token called PERP, and its insurance fund will be guaranteed by token holders. If the insurance fund is depleted, Perpetual Protocol said it would mint more PERP tokens to refill the fund and cover losses. The token can also be used for staking, said the protocol.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"CMS","content":"ORGANIZATION"},{"type":"Perpetual Protocol","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$1.8 million","content":"MONEY"},{"type":"Taiwan","content":"LOCATION"},{"type":"Multicoin Capital","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"September","content":"DATE"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Feng","content":"ORGANIZATION"},{"type":"Yenwen Feng","content":"PERSON"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}