{"summary":"Acting Comptroller of the Currency Brian Brooks told The Scoop that a CBDC design should come from the private sector\nFederal Reserve Chair Jerome Powell told the House Financial Services Committee last week that it’s the role of the central bank to craft the digital dollar since the private sector isn’t involved in creating the money supply","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/69216\/heres-how-brian-brooks-disagrees-with-fed-chair-jerome-powell-on-the-digital-dollar","publishDate":"2020-06-23T09:56:04","id":3370,"type":null,"title":"Here&#x27;s how Brian Brooks disagrees with Fed chair Jerome Powell on the digital dollar","category":["The Block"],"content":["Talk of potential plans for a \"digital dollar\" has increased in recent weeks, thanks in part to recent Congressional hearings that have touched on the issue. Much of the discussion has focused on the question of whether it should be the private sector or government entities in charge of designing and running an American central bank digital currency (CBDC).","On this week's episode of The Scoop, Acting Comptroller of the Currency Brian Brooks touted a private sector-led approach, saying that the tech realm is best suited to build the currency, while the government's role is to regulate it. Brooks's thinking seems to generally align with that of former Commodities Futures Trading Commission (CFTC) chair Christopher Giancarlo, who has called for <a href=\"https:\/\/www.theblockcrypto.com\/post\/53714\/former-cftc-chair-releases-first-formal-remarks-about-his-digital-dollar-project-at-davos\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a digital dollar<\/a> that features heavy private-sector involvement. But it flies in the face of something Federal Reserve Chair Jerome Powell told Congress himself last week.","During his <a href=\"https:\/\/www.theblockcrypto.com\/linked\/65863\/us-bank-regulator-otting-brooks\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">previous role<\/a> as Coinbase's top lawyer, Brooks said he had conversations with senior Federal Reserve staff that left him confident that the Fed is taking a serious interest in the CBDC discussion. Brooks said anti-money laundering and other compliance concerns will be the most substantial hurdles.","\"The problem will have to be solved, but I don't think America necessarily has to have the government leading in order for America to lead,\" he told The Scoop. \"The government didn't give you the iPhone. When we usually do best as a country is when we're harnessing our market dynamic to let innovators motivated by a profit instead go and build stuff.\"","The government can build the guardrails, he argued. \"My thought about all of this is that the role of government in a stablecoin project, for instance, is to say, listen, here are the collateral requirements that have to be observed.\"","Powell's comments at last week's House Financial Services Committee meeting paint a different picture. In response to a question from U.S. Representative Tom Emmer (R-MN) asked the Fed chair about \"substantive, recent actions\" the central bank has taken on digital currency, Powell said there are still serious questions that must be answered.","Then, when U.S. Representative French Hill (R-AR) asked what role the private sector might have in the creation of a CBDC, Powell responded that the private sector is not involved in creating money supply. A CBDC \"is something that central banks have to design principally,\" he said.&nbsp;","He added: \"I don’t really think the public would welcome the idea that private employees who are not accountable solely to the public good, would be responsible for something this important.\"","Brooks further elaborated on the private\/public sector CBDC debate in this week's episode, touching on how stablecoin projects like USDC fit into the larger context and what it means to bring a crypto perspective to the Office of the Comptroller of the Currency.&nbsp;","<i data-v-f87c67ca=\"\">Listen below, and subscribe to The Scoop on&nbsp;<\/i><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Apple<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Spotify<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Google Play<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Stitcher<\/i><\/a><i data-v-f87c67ca=\"\">&nbsp;or wherever you listen to podcasts. Email feedback and revision requests to <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"6e1e010a0d0f1d1a2e1a060b0c02010d050d1c171e1a01400d0103\">[email&nbsp;protected]<\/a>.<\/i>","<iframe src=\"https:\/\/playlist.megaphone.fm?e=BLOCK6737988942\" width=\"100%\" height=\"200\" frameborder=\"0\" scrolling=\"no\" data-v-f87c67ca=\"\"><\/iframe>"],"hashtag":["COINBASE"]}