{"summary":"Curio, the premier NFT platform for the biggest names in entertainment, today launched a partnership with InTrove, a company that connects physical collectibles with NFTs, to provide a first-of-its-kind experience to comic book and NFT collectors. The partnership brings together two red-hot markets and creates a new way for collectors to buy and own unique blue-chip collectible comics tethered to one-of-a-kind NFTs","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/117460\/curio-and-introve-launch-first-of-its-kind-partnership-for-nfts-tethered-to-rare-comic-books","publishDate":"2021-09-13T07:52:04","id":3370,"type":null,"title":"Curio and InTrove Launch First-of-Its Kind Partnership for NFTs Tethered to Rare Comic Books","category":["SPONSORED"],"content":["<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">First auction debuting today features rare run of Teenage Mutant Ninja Turtles #1-4, estimated value over $90,000<\/span><\/i>","<b data-v-f87c67ca=\"\">LOS ANGELES – September 13, 2021 --<\/b><span data-v-f87c67ca=\"\">&nbsp; <\/span><a href=\"https:\/\/hubs.la\/H0X2V280\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Curio<\/span><\/a><span data-v-f87c67ca=\"\">, the premier NFT platform for the biggest names in entertainment, today launched a <\/span><a href=\"https:\/\/hubs.la\/H0X2Vwb0\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">partnership with InTrove<\/span><\/a><span data-v-f87c67ca=\"\">, a company that connects physical collectibles with NFTs, to provide a first-of-its-kind experience to comic book and NFT collectors. The partnership brings together two red-hot markets and creates a new way for collectors to buy and own unique blue-chip collectible comics tethered to one-of-a-kind NFTs. Auctions will feature curated selections of some of the most sought-after comics in prime condition, kicking off with a run of the extremely rare first printings of <\/span><a href=\"https:\/\/hubs.la\/H0X2VjP0\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Teenage Mutant Ninja Turtles #1-4<\/span><\/a><span data-v-f87c67ca=\"\"> in CGC 9.4-9.8 condition, with a combined value upwards of $90,000.<\/span>","<span data-v-f87c67ca=\"\">Curio and InTrove’s innovative approach combines the convenience, innovation and momentum of NFTs with the proven value of real physical collectibles. When a collector purchases <\/span><a href=\"https:\/\/hubs.la\/H0X2Vwb0\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">InTrove NFTs on Curio<\/span><\/a><span data-v-f87c67ca=\"\"> through the auctions, they will be the owner of a digital collectible tethered to a unique physical copy of an extremely rare, valuable comic book. The NFT provides the collector with a way to show off their collection digitally, sell or trade instantly with other collectors, and own a value-added, rare digital component to complement the already-rare physical item. Buyers can elect to store their items with InTrove partner Diamond International Galleries (with first six months of storage and insurance included) or take delivery of the physical copy in exchange for the NFT.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This new approach solves important problems for traditional and digital collectors. The collectible comics and original art market has seen appreciation of 200-1,000% since 2020, with no end in sight. More collectors are seeking ways to invest in these properties, and currently bear the responsibility to preserve, store and insure their items post-auction. Curio’s new partnership with InTrove provides an option for the physical items to be held in secure custody while transactions can take place using the NFT as a proxy. At the same time, it offers digital collectors the security of owning a collectible that is backed by an item that has its own independent financial value.<\/span>","<a href=\"https:\/\/hubs.la\/H0X2VjP0\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The first auctions<\/span><\/a><span data-v-f87c67ca=\"\">, beginning September 13, 2021, will feature Teenage Mutant Ninja Turtles #1-4, some of the rarest comics produced since the 1960s. There were only 3,000 items in the original print run and they are graded CGC (Certified Guaranty Company) 9.4-9.8. To get a sense of value, the most recent sale of Teenage Mutant Ninja Turtles #1 in August went for $245,000 without the NFT element. Future auctions will include a curated section of high-grade and key comic issues from some of the industry’s top dealers and collectors including Harley Yee, Josh Geppi and others.<\/span>","<span data-v-f87c67ca=\"\">“Curio is focused on pushing the boundaries of what NFTs can mean for their collectors and our new partnership with InTrove is unlocking a brand new opportunity for fans of comic books and NFT collectors alike,” said Juan Hernandez, CEO, Curio. “Now there’s a way for collectors to break into the burgeoning NFT market while simultaneously holding onto a piece of comic book history.”<\/span>","<span data-v-f87c67ca=\"\">Curio will be the sole platform for InTrove auctions and will produce and mint each NFT with images of the specific collectible provided by InTrove. An item’s auction will be live for one week and new items will be posted regularly. Curio and InTrove will continue to offer a curated collection of truly rare, unique and premium condition collectible comics, trading cards, video games, artwork and more for every interest and every price range. The program will feature some of the most rare and desirable comics in prime condition, consigned from top figures in the collecting world.<\/span>","<span data-v-f87c67ca=\"\">Collectors of InTrove NFTs will experience benefits including:&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Comic book collectors looking to cash in on rare items often have to invest even more in proper storage because of the sensitive nature of these items,” said Adam Fortier, President of InTrove. “This partnership takes all the pain out of that maintenance while still giving collectors a way to display their rare collectibles and show to anyone the amazing things they own.”<\/span>","<span data-v-f87c67ca=\"\">InTrove ensures authentication from one owner to the next, guaranteeing a chain of custody. This process certifies that the NFT ownership will only belong to whomever has physical ownership of the collectible, and alleviates any concerns about unauthorized NFTs and artwork.<\/span>","<b data-v-f87c67ca=\"\">ABOUT CURIO<\/b>","<span data-v-f87c67ca=\"\">Curio delivers a new universe to serve fans through digital collectibles, driven by state-of-the-art non-fungible token (NFT) technology. Working with the biggest names in the entertainment industry, Curio brings innovative, cutting-edge engagement opportunities to delight fans and provide new ways to enhance their relationship with brands. To learn more, please visit:<\/span> <a href=\"https:\/\/hubs.la\/H0X2V280\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/oncurio.com\/<\/span><\/a>","<b data-v-f87c67ca=\"\">ABOUT INTROVE<\/b>","<span data-v-f87c67ca=\"\">InTrove delivers physical collectibles to the digital space via NFTs, creating a synergy that benefits both physical ownership as well as digital ownership. Instead of owning a facsimile of the original, InTrove lets anyone own the original itself, the ultimate flex. To learn more, please visit : <\/span><a href=\"http:\/\/www.introve.net\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">http:\/\/www.InTrove.net<\/span><\/a><span data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$90,000","content":"MONEY"},{"type":"Teenage Mutant Ninja Turtles","content":"ORGANIZATION"},{"type":"InTrove","content":"ORGANIZATION"},{"type":"Adam Fortier","content":"PERSON"},{"type":"1,000%","content":"PERCENT"},{"type":"Harley Yee","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"1960s","content":"DATE"},{"type":"September 13, 2021","content":"DATE"},{"type":"Juan Hernandez","content":"PERSON"},{"type":"Diamond International Galleries","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"InTrove NFTs","content":"ORGANIZATION"},{"type":"$245,000","content":"MONEY"},{"type":"Josh Geppi","content":"PERSON"},{"type":"4","content":"DATE"},{"type":"CGC","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Sponsored","The Block"]}