{"summary":"Robinhood, the California-based broker, now has the green light from regulators in New York to open up shop in the state, the firm said Thursday.  The","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/8692\/robinhood-crypto-coming-to-new-york-after-firm-nabs-coveted-bitlicense","publishDate":"2019-01-24T12:45:11","id":3371,"type":null,"title":"Robinhood Crypto coming to New York after firm nabs coveted BitLicense","category":["MARKETS"],"content":["Robinhood, the California-based broker, now has the green light from regulators in New York to open up shop in the state, <a href=\"https:\/\/blog.robinhood.com\/news\/2019\/1\/23\/robinhood-crypto-is-coming-to-new-york\" data-v-f87c67ca=\"\">the firm said Thursday<\/a>.&nbsp;","The company announced that the New York Department of Financial Services granted Robinhood the so-called BitLicense, which is only held by a handful of crypto companies including Genesis Trading and payments firm Square. The agency also granted LibertyX a license.&nbsp;","\"Today, Robinhood Crypto received a virtual currency license, also known as the BitLicense, and a money transmitter license in New York,\" the firm said. \"This will allow New Yorkers to invest in cryptocurrencies on the Robinhood platform, and marks another important step towards our mission of democratizing the financial system.\"","The BitLicense, which was introduced in 2014 by Benjamin Lawsky, is controversial in some corners of the crypto market. Coin Center, a crypto think tank, has been a long-time critic of the regulatory framework. \"The final BitLicense still creates a lopsided regime as between digital currency businesses and traditional money transmitters and banks,\" Peter Van Valkenburgh, director of research at Coin Center, <a href=\"https:\/\/coincenter.org\/entry\/new-york-bitlicense-falls-short\" data-v-f87c67ca=\"\">said in 2015<\/a>. \"It has cybersecurity and state-level anti money laundering requirements that will not and have never applied to the legacy payments industry.\"","As for Robinhood, its future New York clients would be able to invest in 7 cryptocurrencies including bitcoin and ethereum. Robinhood Crypto is currently available in over 30 states, the firm said. It will roll-out in New York in the coming months.","Robinhood Crypto gatecrashed the crypto trading world with the announcement of its new offering in January 2018. It quickly grabbed the attention of financial media and its over 4 million-strong user base. Over 1 million people signed up for the product <a href=\"https:\/\/www.businessinsider.com\/over-1-million-people-have-signed-up-for-robinhood-crypto-2018-1\" data-v-f87c67ca=\"\">within the first few days following its announcement<\/a>.&nbsp;","<em data-v-f87c67ca=\"\">Editor's note: an earlier version of this post incorrectly stated that Gemini held a BitLicense.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"2015","content":"DATE"},{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"Robinhood Crypto","content":"ORGANIZATION"},{"type":"Today","content":"DATE"},{"type":"New Yorkers","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Coin Center","content":"ORGANIZATION"},{"type":"January 2018","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"California","content":"LOCATION"},{"type":"Benjamin Lawsky","content":"PERSON"},{"type":"Peter Van Valkenburgh","content":"PERSON"}],"hashtag":["CRYPTO","ROBINHOOD"],"authors":["Frank Chaparro","The Block"]}