{"summary":"Moody&#x27;s cut its outlook on Coinbase to negative from stable after the crypto exchange was sued by the U.S. Securities and Exchange Commission earlier in the week.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/233897\/moodys-cuts-coinbase-outlook-to-negative","publishDate":"2023-06-08T18:18:14","id":3375,"type":null,"title":"Moody&#x27;s cuts Coinbase outlook to negative on SEC lawsuit uncertainty","category":["THE BLOCK"],"content":["Moody's said Thursday that it had changed its outlook on Coinbase to negative from stable after the U.S. Securities and Exchange Commission <a href=\"https:\/\/www.theblock.co\/post\/233826\/gensler-lays-out-paths-for-crypto-compliance-criticizing-binance-and-coinbase\" data-v-f87c67ca=\"\">sued<\/a> the crypto exchange earlier this week.","\"The change in outlook to negative from stable reflects the uncertain magnitude of impact the SEC's charges will have on Coinbase's business model and cash flows,\" the ratings agency said. The company's B2 corporate family rating and B1 guaranteed senior unsecured notes' ratings were affirmed.&nbsp;","Coinbase faces possible implications from regulatory actions that include \"disgorgement of ill-gotten gains,<br data-v-f87c67ca=\"\">\ninterest and penalties and adverse consequences to certain of its product offering and business activities, including its taking rewards business,\" Moody's added, noting that the timing and financial consequences pertaining to the resolution of the matters is uncertain.&nbsp;","Moody's said that 20% of Coinbase revenue for the trailing-twelve months ending in March was driven by bitcoin trading, while 13% came from ethereum trading and 28% from other crypto asset trading. The ratings agency said the company had been benefiting from a higher interest rate environment and noted its \"strong\" liquidity position with $5 billion in cash and equivalents.&nbsp;","\"Moody's expects Coinbase to maintain focus on expense management that has served to mitigate the adverse impact of the decline in transaction revenue it has suffered following the spike in activity that occurred after the onset of the coronavirus pandemic,\" the ratings agency said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Moody's","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"28%","content":"PERCENT"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"13%","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Moody","content":"ORGANIZATION"},{"type":"$5 billion","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}