{"summary":"Blockchain-gaming unicorn Mythical Games’ plan for surviving a prolonged crypto winter? Go on the offensive.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/205223\/mythical-games-eyes-50-million-raise-launches-enhanced-nft-gaming-marketplace","publishDate":"2023-01-25T07:00:52","id":3378,"type":null,"title":"Mythical Games eyes $50 million raise, launches enhanced NFT-gaming marketplace","category":["METAVERSE & NFT"],"content":["<span data-v-f87c67ca=\"\">Blockchain-gaming unicorn Mythical Games’ plan for surviving a prolonged crypto winter? Go on the offensive.<\/span>","<span data-v-f87c67ca=\"\">While on one front Mythical CEO John Linden has traveled to Dubai to meet with potential investors — his company is considering raising an additional $50 million — on a separate front, the web3 firm is launching a digital-asset marketplace it hopes will streamline the process of onboarding new gamers.<\/span>","<span data-v-f87c67ca=\"\">Mythical Games was last valued at <\/span><span data-v-f87c67ca=\"\">$1.25 billion<\/span><span data-v-f87c67ca=\"\"> after it <a href=\"https:\/\/www.theblock.co\/linked\/123306\/gaming-startup-mythical-games-raises-150-million-in-series-c-round-led-by-a16z\" data-v-f87c67ca=\"\">raised <\/a><\/span><span data-v-f87c67ca=\"\">$150 million<\/span><span data-v-f87c67ca=\"\"> from investors including <\/span><span data-v-f87c67ca=\"\">Andreessen Horowitz. D<\/span><span data-v-f87c67ca=\"\">eteriorating prices for digital assets and corruption, however, <a href=\"https:\/\/www.theblock.co\/post\/201528\/nft-sales-rise-13-in-december-breaking-8-month-streak-of-declines\" data-v-f87c67ca=\"\">have been roiling<\/a> the world of crypto, making gaming executives’ quest to add new users an increasingly steep hill to climb in recent months.<\/span>","One of the primary aims with the company's new marketplace, dubbed Mythical Marketplace 2.o, is catering to gamers who prize being able to quickly move assets, Linden said. “Gamers are not necessarily crypto traders,” he said. “Gamers are mostly looking for liquidity.”","Although Mythical kept the acquisition under wraps, it began integrating DMarket’s technology months ago as it pursued an improved marketplace platform. Linden said the tech overhaul is already paying dividends with monthly transactions on the rise. After going live about six weeks ago, Mythical’s new marketplace has processed more than 2 million transactions, the company said.","Unlike the market for high-profile digital-asset collections like <a href=\"https:\/\/www.theblock.co\/post\/203492\/bored-ape-yacht-clubs-sewer-pass-mint-nabs-1-3-million-one-hour-after-launch\" data-v-f87c67ca=\"\">Bored Ape Yacht Club<\/a> and Doodles — where a single NFT can sell for thousands if not millions of dollars —&nbsp; web3 gaming companies like Mythical are pursuing high volumes of lower-priced in-game transactions. One challenge is simplifying, for those new to crypto, the process of buying and selling digital assets, namely non-fungible tokens (NFTs).","“Marketplace 2.0 provides a frictionless user experience that enables peer-to-peer transactions … for gamers looking to participate in the play-and-own gaming economies of the future,” Mythical also said in a statement.","Linden also said a major advantage inherited from DMarket is that the marketplace has a working relationship with dozens of digital payment providers around the world. This should make onboarding new customers, regardless of location, even easier.","“It’s more consumer options,” Linden said. “Depending on where you’re at geographically they have a lot more payment options that are regionalized.”<span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","<em data-v-f87c67ca=\"\">Mythical Games CEO John Linden<\/em>","As the num<span data-v-f87c67ca=\"\">ber of blockchain-enabled gaming <a href=\"https:\/\/www.theblock.co\/post\/199387\/illuvium-release-third-blockchain-game\" data-v-f87c67ca=\"\">projects proliferate<\/a> and an increasing number of veteran video game developers enter the space, Mythical Games may have a leg up on at least some of its competitors as the company has made inroads both launching games and raising its profile through partnerships with well-known brands.<\/span>","<span data-v-f87c67ca=\"\">Last September, Mythical launched Blankos Block Party, a title Linden said has so far attracted one million signups. The game is available on the Epic Game Store. Mythical also, through its partnership with the wildly popular National Football League has a sports game nearing a wide release <a href=\"https:\/\/www.theblock.co\/post\/181731\/nfl-crypto-video-game-kick-off-draws-closer\" data-v-f87c67ca=\"\">called NFL Rivals<\/a>.<\/span>","“People are playing the crap out of the game,” Linden said of NFL Rivals, adding “the game’s going into soft launch next month and we’re aiming for a full launch a few months from now.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Updates with photo of Mythical Games CEO John Linden.<\/span><\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1.25 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"National Football League","content":"ORGANIZATION"},{"type":"John Linden","content":"PERSON"},{"type":"Linden","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Mythical","content":"ORGANIZATION"},{"type":"Dubai","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"millions of dollars","content":"MONEY"},{"type":"NFL Rivals","content":"ORGANIZATION"},{"type":"$150 million","content":"MONEY"},{"type":"Blankos Block Party","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":[],"authors":["RT Watson","The Block"]}