{"summary":"Members of the Nimbus team are running a mobile Eth2 client for the first time\nThe Nimbus client team has updated the latest specification of the Beacon Chain and is now preparing to deliver and participate in a multi-client network\nRunning eth2 in a mobile environment offers more user accessibility, although it brings additional challenges regarding battery life and bandwidth usage.","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/55064\/nimbus-runs-its-ethereum-2-0-testnet-on-smartphones","publishDate":"2020-02-05T16:27:50","id":3379,"type":null,"title":"Nimbus runs its Ethereum 2.0 testnet on smartphones","category":["The Block"],"content":["<span data-v-f87c67ca=\"\">Members of the ethereum infrastructure team Nimbus are experimenting with a mobile Ethereum 2.0 testnet as Phase 0 moves through its testing period.<\/span>","<span data-v-f87c67ca=\"\">“The #ethnimbus team is currently meeting in Brussels, playing with the first mobile Eth2 testnet,” Nimbus network engineer, Mamy Ratsimbazafy, <\/span><a href=\"https:\/\/twitter.com\/m_ratsim\/status\/1224769743892230151?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">tweeted<\/span><\/a><span data-v-f87c67ca=\"\"> on Tuesday.<\/span>","<script async=\"async\" src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\" data-v-f87c67ca=\"\"><\/script>","<span data-v-f87c67ca=\"\">Founded in 2018 by Status Network, Nimbus is building an Eth2 client, and <\/span><a href=\"https:\/\/github.com\/eth2-clients\/eth2-testnets\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">opened<\/span><\/a><span data-v-f87c67ca=\"\"> a Nimbus-to-Nimbus testnet in March 2019. On Jan. 28, it <a href=\"https:\/\/www.theblockcrypto.com\/linked\/54146\/eth-2-0-client-nimbus-receives-another-650k-from-the-ethereum-foundation\" data-v-f87c67ca=\"\">received<\/a><\/span> a $650,000 grant from the Ethereum Foundation to continue its Eth2 work. The new grant&nbsp;brought the foundation’s total commitment to Nimbus to $1.65 million.","Since the start of testing, developers have found a number of bugs in the system and are working to address them, Ratsimbazafy told The Block. To uncover additional deficiencies, he said, the team needs to implement fuzzing, a testing technique that sends random inputs into the network to trigger corner cases.","Moreover, while testing has been mostly focused on Eth2 specifications up to this point, a fully-featured client needs to make sure that other elements – peer discovery and handling, monitoring, performance, automation, etc. – are robust as well.","<span data-v-f87c67ca=\"\">Right now, Nimbus' eth2 client is running the latest specification of the Beacon Chain in preparation for integration with other clients in the near future, Ratsimbazafy said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The team’s priorities for 2020 are to deliver and participate in a multiclient testnet with both desktop and mobile nodes, to audit and secure the client, to start implementing phase 1 and phase 2 of Ethereum 2,” he said.&nbsp;<\/span>","<strong data-v-f87c67ca=\"\">Mobile-first client<\/strong>","<span data-v-f87c67ca=\"\">Nimbus is a mobile-first project. <\/span>","<span data-v-f87c67ca=\"\">According to Ratsimbazafy, the team hopes to ensure that Eth2 is built with mobile constraints from the ground up since a huge part of the world is accessing the Web through mobile devices rather than desktop computers.<\/span>","<span data-v-f87c67ca=\"\">“If we want to reach those communities, blockchain needs to be mobile,” he said. “This is even more important as often there is distrust in the centralized services and actors in those parts of the world.”<\/span>","<span data-v-f87c67ca=\"\">While running the client in a mobile environment offers improved accessibility, it brings additional challenges regarding data consumption, battery drain, and dealing with ephemeral presence. Developers are currently working to resolve these problems, Ratsimbazafy said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“As [Phase 0] deployment approaches, we will increase our automated testing to cover a large range of mobile devices,” he said. “However, we won’t be able to test all the thousands of phone models that exist.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For now, developers can manually install Nimbus on their Andriod devices using the provided <\/span><a href=\"https:\/\/our.status.im\/building-nimbus-on-android-2\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">tutorial<\/span><\/a><span data-v-f87c67ca=\"\">. In the long run, however, Nimbus will continue to optimize the client’s usability to make it as easy as downloading an app from an appstore, Ratsimbazafy said.<\/span>"],"hashtag":[]}