{"summary":"Payments giant Visa has made five hires and placements as it continues to build out its crypto team.\nThe company focuses heavily on stablecoins and is gearing up to support central bank digital currencies.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/110119\/visa-makes-five-strategic-crypto-hires-and-placements","publishDate":"2021-06-30T10:23:55","id":338,"type":null,"title":"Visa makes five strategic crypto hires and placements","category":["People"],"content":["Payments giant Visa has expanded its in-house crypto team with five key hires and moves, according to Visa’s head of crypto Cuy Sheffield on Twitter.","This month, the firm brought in two new team members. These included <a href=\"https:\/\/www.linkedin.com\/in\/catherinecarle\/\" data-v-f87c67ca=\"\">Catherine Carle<\/a>, who will focus on crypto social impact and community partnerships. She joins the firm from the University of St. Thomas in Minnesota where she worked in healthcare innovation and entrepreneurship. Prior to that, she worked at Monitor Deloitte, a strategy consulting firm that was acquired by Deloitte in 2013.","Visa also added Chike Ukaegbu, founder of New York-based tech accelerator Startup52, which focuses on backing firms that have strong diversity profiles. He will be the team’s head of crypto strategy for emerging markets. Previously, Ukaegbu ran for president in Nigeria where he “spearheaded the leanest and first fully digital presidential campaign in Africa,” according to his <a href=\"https:\/\/www.linkedin.com\/in\/chikeukaegbu\/\" data-v-f87c67ca=\"\">LinkedIn profile<\/a>.","“I'm incredibly grateful to work with such an amazing team and have the opportunity to leverage the power of Visa to help advance the adoption and utility of Bitcoin, stablecoins, NFTs, DeFi, and public blockchain networks,” <a href=\"https:\/\/twitter.com\/cuysheffield\/status\/1409900435272470530\" data-v-f87c67ca=\"\">tweeted<\/a> Sheffield.","The payments company has also brought in three employees from the rest of the company to take on key roles in its crypto team.","First, <a href=\"https:\/\/www.linkedin.com\/in\/anujbathla\/\" data-v-f87c67ca=\"\">Anuj Bathla<\/a>, former senior director focused on product commercialization and go to market (GTM), has become the global crypto GTM lead. Bathla will work for AJ Shanley’s global crypto business development team, which connects with crypto exchanges and companies to help them issue Visa cards. Based in California, he has worked at the company for nine years.","Second, product manager Daniel Mottice will shift over from Visa Direct to take ownership of its crypto products. According to <a href=\"https:\/\/www.linkedin.com\/in\/daniel-mottice-3a02b160\/\" data-v-f87c67ca=\"\">his LinkedIn<\/a>, he will lead “the expansion of Visa's digital currency settlement capabilities.” This will focus on using stablecoins for cross-border payments.","Third, Alex Chiang, who joined Visa as an associate in its graduate development program four years ago, will be part of its product team. He will focus on growing the adoption of NFTs in e-commerce, according to Sheffield, as well as helping Visa’s clients to leverage decentralized finance (DeFi) protocols.","Visa plans to expand its crypto team even further. Sheffield highlighted that the company has job openings for product management, business development and engineering roles.","To date, Visa has provided some insight into its plans for the cryptocurrency space. Such plans revolve around performing similar services for crypto as Visa does for fiat payments — namely enabling companies and consumers to access crypto and move it around.&nbsp;","While crypto’s nature makes it possible for consumers to “be their own bank” by custodying their own assets and making direct transactions, the relatively complex nature of doing so provides opportunities for the firm to perform that work instead.&nbsp;","Visa has sought to make it easy for consumers to swap crypto to fiat through its range of crypto debit cards. The firm claims to be <a href=\"https:\/\/usa.visa.com\/visa-everywhere\/blog\/bdp\/2020\/07\/21\/advancing-our-approach-1595302085970.html\" data-v-f87c67ca=\"\">working with<\/a> more than 25 digital currency wallets, enabling their users to spend crypto (kind of) at its 61 million merchants around the world.","It’s also stepping into the settlement game, having started experimenting with using the USD Coin (USDC) stablecoin to accept payments from its partner Crypto.com, a crypto exchange and crypto debit card provider. According to Fortune, this is a <a href=\"https:\/\/fortune.com\/2021\/03\/29\/visa-crypto-business\/\" data-v-f87c67ca=\"\">major change<\/a> on the infrastructure side for Visa that will mean crypto wallet firms will no longer need to swap their funds into fiat money to send to the company.","Beyond this, Visa plans to expand support for more digital currencies in the future. But instead of backing cryptocurrencies like bitcoin, ether, it will <a href=\"https:\/\/www.theblockcrypto.com\/linked\/103048\/visa-ceo-crypto-earnings-call-comments\" data-v-f87c67ca=\"\">be focusing<\/a> on the two types of fiat-related currencies, namely stablecoins and central bank digital currencies"],"hashtag":["CRYPTO","HIRING"]}