{"summary":"Originally built to support the Kava Platform, the Kava network is a highly secure and scalable Layer-1 blockchain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/124214\/kava-network-powering-a-decentralized-future","publishDate":"2021-11-16T09:00:19","id":3380,"type":null,"title":"Kava Network: Powering a Decentralized Future","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">In our last article on Kava, we covered its origins and explored the suite of high-yield DeFi protocols that make up the Kava Platform. In the second article of our three-part series, we dive deeper into the Kava network and take a look at the ecosystem of best-in-class DeFi, NFT, and GameFi services that are being built on top of it.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Originally built to support the Kava Platform, the Kava network is a highly secure and scalable Layer-1 blockchain. Built using the Cosmos SDK, the Kava network is interoperable, lightning fast, and has been tested and refined over the course of two years. In that time, it has supported the successful launch and operation of three DeFi protocols totaling over $500M in TVL and over $2.1B in on-chain assets.<\/span>","<span data-v-f87c67ca=\"\">After optimizing the speed and security of the Kava network in the controlled environment of the Kava Platform, Kava is opening up to the public and welcoming other projects and protocols into its ecosystem.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Kava’s mission has always been to provide users with secure, trusted access to the earning potential of DeFi. Over the past two years, the utility of distributed ledgers has expanded to include NFTs, GameFi, Metaverse projects, and beyond. This shift has prompted Kava to open its network to other projects to give users access to a more expansive ecosystem of top-tier decentralized services.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">To ensure that Kava’s rigorous standards for security and UX are maintained as it grows, Kava is taking a somewhat unique approach to onboarding new projects to its network. Other Layer-1 blockchains have shown time and again the risks of onboarding projects without proper vetting. Ethereum-based protocols alone have racked up losses in the hundred of millions to hacks and scams. For DeFi to mature and service a wider market, people need to trust that their life savings are secure. This is where Kava Airlock comes in.<\/span>","<span data-v-f87c67ca=\"\">Where most Layer-1 blockchains like Ethereum allow anyone to launch a token or protocol on them, Kava is implementing a filtration process to ensure the quality of projects in the ecosystem. This filtration will be handled in a completely decentralized way via the Kava DAO. Projects will be able to build and test on a public testnet (Kava Airlock) before submitting a proposal to launch on the mainnet. $KAVA token holders will then be able to vote on which protocols are accepted and become part of the Kava ecosystem.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The first major step toward making the Kava ecosystem a reality is coming with the Kava 9 mainnet upgrade in Q1, 2022. This will lay the foundation for easily onboarding cross-chain projects by implementing Comsos’ Inter Blockchain Communication Protocol (IBC) and preparing the network for the launch of an ETH bridge shortly after. In our next article, we will examine what these will mean for the Kava ecosystem and take a look at what is in store for the Kava network in the rest of 2022.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"TVL","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"$2.1","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$KAVA","content":"MONEY"},{"type":"Cosmos SDK","content":"ORGANIZATION"},{"type":"$500M","content":"MONEY"},{"type":"Kava Platform","content":"LOCATION"},{"type":"Kava DAO","content":"ORGANIZATION"},{"type":"Comsos’ Inter Blockchain Communication Protocol (IBC","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Kava","content":"PERSON"},{"type":"Kava","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}