{"summary":"Mining pools that cater to Chinese miner clients have witnessed a significant drop in hash rate in the last 24 hours.\nThis comes as China continues to crack down on bitcoin mining, with further restrictions put in place today.","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/107736\/chinese-bitcoin-mining-pools-hash-rate-drop","publishDate":"2021-06-09T08:07:08","id":3381,"type":null,"title":"Chinese bitcoin mining pools experience sharp hash rate drop","category":["China"],"content":["Some of the world's biggest bitcoin mining pools that cater to Chinese miner clients have seen a sharp hash rate drop over the past 24 hours.","Data from BTC.com shows that major China-based bitcoin mining pools, in particular AntPool, F2Pool, Poolin, BTC.com, have seen hash rate drops between 11% to 30% in the last 24 hours. Bitcoin mining pools run by Huobi and Binance have also seen a 24-hour decline of over 10%.","The hashing power of the two main non-Chinese mining pools, namely Slushpool and Foundry USA, have remained steady over the past day.","Such a notable hash rate drop of Chinese bitcoin mining pools comes as China continues to <a href=\"https:\/\/www.theblockcrypto.com\/post\/105814\/china-bitcoin-miners-brace-regulatory-uncertainty\" data-v-f87c67ca=\"\">crack down<\/a> on bitcoin mining. Today, the Changji prefecture in China's Xinjiang province ordered bitcoin mining farms in the Zhundong Economic Technological Development Park to <a href=\"https:\/\/www.theblockcrypto.com\/post\/107707\/xinjiang-bitcoin-miner-shut-crackdown-china\" data-v-f87c67ca=\"\">shut down their operations<\/a> by 2:00 pm China time on June 9.","The Zhundong park is a 15,500 square km economic zone home to a variety of coal production industries including coal-based power plants and industrial factories. It also houses a significant portion of the bitcoin mining facilities in the Xinjiang province.&nbsp;","In April, bitcoin miners in Xinjiang were forced to shut down due to security concerns surrounding local coal-based power plants after several security incidents. Bitcoin's hash rate also dropped by around 25% in the next seven days before mining farms <a href=\"https:\/\/www.theblockcrypto.com\/post\/102603\/bitcoin-hash-rate-xinjiang-miner-power\" data-v-f87c67ca=\"\">plugged back<\/a> in.","Since the crackdown began, there have been reports of Chinese bitcoin miners starting to <a href=\"https:\/\/www.theblockcrypto.com\/daily\/107104\/china-bitcoin-miners-state-council-crackdown\" data-v-f87c67ca=\"\">relocate their equipment<\/a> away from China. This may see hash power move toward Central Asia, North America and some parts of the EU.","Bitcoin mining hardware firm Canaan said, in its Q1 financial report, that overseas sales of mining equipment made up <a href=\"https:\/\/www.theblockcrypto.com\/linked\/106756\/canaan-q1-bitcoin-miner-revenue-comes-from-overseas\" data-v-f87c67ca=\"\">nearly four fifths<\/a> of its revenue that quarter. This appeared to be the first time Canaan has reported that its domestic sales were eclipsed by its overseas business.","Over in the US, bitcoin mining farms are expanding. Companies including mining companies <a href=\"https:\/\/www.londonstockexchange.com\/news-article\/ARB\/land-purchase-issue-of-consideration-shares\/14890491\" data-v-f87c67ca=\"\">Argo Blockchain<\/a>, <a href=\"https:\/\/www.riotblockchain.com\/news-media\/press-releases\/detail\/109\/riot-blockchain-completes-acquisition-of-whinstone-us\" data-v-f87c67ca=\"\">Riot Blockchain<\/a> and market making firm <a href=\"https:\/\/www.theblockcrypto.com\/post\/107066\/crypto-market-maker-gsr-goes-carbon-neutral-including-for-its-bitcoin-mining-business\" data-v-f87c67ca=\"\">GSR<\/a> are planning to increase their bitcoin mining operations, with GSR focusing on using hydroelectric power. Payments firm Square has also partnered with Bitcoin technology startup Blockstream to <a href=\"https:\/\/www.theblockcrypto.com\/linked\/107469\/square-blockstream-solar-powered-bitcoin-mine-united-states\" data-v-f87c67ca=\"\">launch a 100% solar-powered Bitcoin mine<\/a> in the United States.&nbsp;"],"hashtag":[]}