{"summary":"Hex is a new project described on its website as a the “the first high interest blockchain certificate of deposit.” If you have Bitcoin you can claim","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/49989\/the-hex-token-sale-may-be-an-unregistered-securities-offering-but-its-no-ponzi","publishDate":"2019-12-10T17:23:41","id":3385,"type":null,"title":"The Hex token sale may be an unregistered securities offering but it&#x27;s no Ponzi","category":["ICO AND IEO"],"content":["Hex is a new project described on its website as a the “the first high interest blockchain certificate of deposit.” If you have Bitcoin you can claim “free Hex” by “staking” your bitcoin (signing a transaction with your private key to prove it's yours). If you own ether, you can send it to an Ethereum wallet in exchange for Hex, which is an ERC20 token native to the Ethereum blockchain. (If you pay ether you get more Hex than someone who signs a bitcoin transaction but doesn’t pay for the privilege of owning these currently nearly worthless tokens. &nbsp;You also never get your ether back, as explained in further detail below).","The website makes some predictably extraordinary claims. It say, among other things, that it is the “first high interest blockchain CD” and that you could make a 10,000x profit. It’s “designed to go higher, faster and retain its value.” It’s “the future of finance.” &nbsp;And in all caps (because that makes everything more true): &nbsp;\"HEX IS DESIGNED TO INCREASE IN VALUE FASTER THAN ANYTHING ELSE IN HISTORY.\"","You get the picture. Like these things do, it also touts the value of getting in early to maximize your return, and has its own brand new vocabulary to describe all the ways you will get rich quick (“AdoptionAmplified”, “SillyWhalePenalty”, “StakeSharePrice”). In short, it sounds like a million other get rich quick schemes promoted by evangelical leaders who most of the time turned out to be in it for themselves entirely and caused a lot of people to lose a lot of money. (Yes, Carlos Matos and Bitconnect do come to mind).","<iframe src=\"\/\/www.youtube.com\/embed\/vabXXkZjKiw\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" data-v-f87c67ca=\"\"><\/iframe>","Now, if you are like me, you will probably see the promise of 10,000 percent easy returns in exchange for money sent to somebody else’s wallet and snort loudly at the audacity. And you might also wonder if the person shilling this horse puckey is within the territorial jurisdiction of the United States.","Getting down to details -- let's talk about this claim that Hex is a &nbsp;CD. The thing about a CD (the kind you get from a bank) is that you agree to a certain time lock up, pay in dollars and receive dollars in the form of interest in return at the end of that time period. The premise here is that you will make money not in the form of like-kind interest (interest in ether for your ether payment, along with return of principal) but that you will make money because the Hex you get will increase in value.","There's a huge catch, which you might not realize until after your ether is gone. &nbsp;Here it is, buried at the end of the terms of service: &nbsp;unlike a CD you don’t get the principal back.","","","Yeah, that’s right — you don’t ever get your Ether back. Never. Ever. Just a bunch of Hex. So: is this really a CD? No. No sweetheart, it’s not a CD. It looks to me more like wealth transfer to somebody else’s Ethereum wallet based on a promise that network effects and a magic pool of liquidity will make Hex worth a lot of money some day.","One guy on twitter who I like a lot (a bitcoin rabbi, baruch ha shem, of all things) explained to me that it is a CD in the sense that he’s “referring [to] the hex itself”:","","","I get that is what the Hex people might say (and to be clear the Rabbi is quite critical of the project, not apologizing for them).","But think about this for minute. &nbsp;Imagine a bank CD where you get sand in exchange for dollars, and you can use the sand to get extra sand but you never get your dollars back? This is where one would think that an agency like the Federal Trade Commission (or one of many state level equivalent) might take an interest in the accuracy of representations being made to consumers about the nature of the instrument they are buying into. (Also, where exactly is the certificate part of the certificate of deposit?).&nbsp;","Whether or not it’s actually a CD, according to the website, over 35,452 ETH “has joined the transformation lobby to be transformed into Hex.” (Also, “transformation lobby” — you mean website?) At a price of $146.37, that means that people have paid more than $5.1 million for the expectation that Hex will appreciate in value and be worth something someday. I gather from social media postings that Hex is now tradable on a couple of decentralized exchanges but its future value is entirely speculative and there’s a decent argument that its future value depends on the entrepreneurial and managerial efforts of its founders, who are listed on the hex.win website.","","","&nbsp;","","","Am I saying that Hex involves an investment of money in a common enterprise with an expectation of profits from the managerial\/entrepreneurial efforts of others? I’ll leave that to the SEC and federal courts, but I will tell you that a disclaimer that says that it isn’t any of those things is about as valuable as a billion Hex right now.","","","I kinda love, but also hate, the audacious wackadoodle notion that this means anything: &nbsp;\"HEX is not a security. There aren't actually any coins, they're just numbers in a distributed database. No one is actually given anything.\" &nbsp;It's like saying \"Heroin is not a schedule I controlled substance. &nbsp;There aren't actually any drugs, they're just molecules in the universe.\" &nbsp;Repeat after me -- the substance of the transaction is what matters, the thing itself, not what you say in a disclaimer. &nbsp;(Yes, I used the word audacious twice in this piece). &nbsp;","That said, and as an aside, one thing that Hex is not is a Ponzi scheme. It is a pet peeve of mine when people confuse Ponzi and pyramid schemes. In a typical Ponzi, investors are told that their investment is going to be used to fund an enterprise but their money goes into the scammer’s pocket and the old investors are paid by new investors. We don’t have that here. Everyone who pays ether into the Hex wallet knows that they are getting a pile of worthless Hex in exchange for their not worthless Ether. So, not a ponzi. Maybe a pyramid scheme, in the sense that it is a system of making money that is dependent on recruiting new investors as opposed to making money by\/through genuine economic activity. (There’s a nice, albeit slightly dated, discussion of the difference between the two on the FTC website, <a href=\"https:\/\/www.ftc.gov\/public-statements\/1998\/05\/pyramid-schemes#N_8_\" data-v-f87c67ca=\"\">here<\/a>).","* &nbsp; &nbsp;* &nbsp; &nbsp;*","Wrapping up — What is Hex? It’s not a CD, you never get your ether back, and the future success of the platform and the token depend in large measure on the work undertaken by a small group of people who you can see on a website, at least one of whom probably set up the Ethereum wallet where investors money is being transmitted. It’s either an unregistered securities offering, a pyramid scheme, or a combination of the two. It is definitely not something I would put my money in. If I had ether — I don’t — I sure wouldn’t send it there.","Prediction — if this thing is still operating in a couple of months I will be really, really surprised. It is has <em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">ex parte <\/em>Temporary Restraining Order written all over it.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$5.1 million","content":"MONEY"},{"type":"$146.37","content":"MONEY"},{"type":"Federal Trade Commission","content":"ORGANIZATION"},{"type":"FTC","content":"ORGANIZATION"},{"type":"Carlos Matos","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Stephen Palley","The Block"]}