{"summary":"Portugal&#x27;s 2023 budget proposal includes a 28% income tax on cryptocurrencies held for less than a year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175982\/portugals-new-budget-draft-includes-crypto-income-tax","publishDate":"2022-10-10T14:10:37","id":3386,"type":null,"title":"Portugal&#x27;s new budget draft includes crypto income tax","category":["POLICY"],"content":["The government of Portugal proposed a 28% income tax on cryptocurrencies in its 2023 <a href=\"https:\/\/www.dgo.gov.pt\/politicaorcamental\/OrcamentodeEstado\/2023\/Proposta%20do%20Or%C3%A7amento\/Documentos%20do%20OE\/OE2023_Relatorio.pdf\" data-v-f87c67ca=\"\">budget draft,<\/a> released on Monday.","The tax would apply only to cryptocurrencies owned for less than a year, with gains from crypto held for longer than that period of time still exempt.","Free crypto transactions would also be taxed, and a 4% rate would apply to commissions charged by intermediaries.","The budget is still subject to discussions and approval within the Parliament in the coming weeks. Given that the ruling party (PS) has an absolute majority, it has the power to single-handedly see it through.","The Parliament <a href=\"https:\/\/www.theblock.co\/linked\/148806\/portugals-parliament-rejects-crypto-tax-proposals-amidst-budget-negotiations\" data-v-f87c67ca=\"\">struck down two separate proposals<\/a> from minority political parties for a crypto tax, during a&nbsp;2022 budget voting session in May.","Earlier that month, Fernando Medina, Portugal's minister of finance, declared <a href=\"https:\/\/www.theblock.co\/post\/147099\/portugal-considering-capital-gains-tax-for-cryptocurrency\" data-v-f87c67ca=\"\">his commitment<\/a> to start taxing crypto, stating that the government would work on the regulatory framework. He also argued that there shouldn't be any \"gaps\" resulting in certain gains not being taxed in the country.","The government said that these measures would provide a sense of \"safety and legal certainty,\" by creating a framework to \"foster the cryptoeconomy.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"28%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"Portugal","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"May","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"Parliament","content":"ORGANIZATION"},{"type":"Fernando Medina","content":"PERSON"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}