{"summary":"The Digital Currency Research Institute of China’s central bank has signed an agreement with Huawei \nThe agreement is for fintech research \nThis appears to be the first such publicly announced deal by the central bank with a big-name company ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/45697\/pbocs-digital-currency-research-institute-signs-a-deal-with-telecoms-giant-huawei-for-fintech-research","publishDate":"2019-11-04T09:31:31","id":3388,"type":null,"title":"PBoC&#x27;s Digital Currency Research Institute signs a deal with telecoms giant Huawei for fintech research","category":["China"],"content":["The Digital Currency Research Institute of the People’s Bank of China (PBoC), the country’s central bank, has signed an agreement with telecommunications giant Huawei.","Announcing the news on its official WeChat account on Monday, Huawei <a href=\"https:\/\/mp.weixin.qq.com\/s\/J6Chc4bwYebvjZCnJbKN_g\" data-v-f87c67ca=\"\">said<\/a> that the \"strategic cooperation\" agreement is for financial technology (fintech) research, without disclosing further details. The agreement was signed during PBoC vice president Yifei Fan's tour of the Huawei headquarter. Fan also praised the firm's achievement in developing distributed databases and computing chips, according to Huawei's WeChat post.&nbsp;","It is not clear whether the partnership will specifically focus on blockchain or other technologies. The Block has reached out to Huawei for a comment and will update this story if a reply is received.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nHuawei itself is active in the blockchain space. Last year, the company<a href=\"https:\/\/www.huawei.com\/en\/press-events\/news\/2018\/11\/huawei-cloud-blockchain-service\" data-v-f87c67ca=\"\"> launched<\/a> a blockchain service to help global enterprises and developers create, deploy and manage blockchain applications faster and at a lower cost.&nbsp;","Today's agreement with Huawei seems to be the PBoC’s first publicly announced partnership with a big-name company. Interestingly, Huawei CEO Ren Zhengfei recently <a href=\"https:\/\/finance.sina.cn\/chanjing\/gsxw\/2019-07-26\/detail-ihytcerm6336647.d.html?ivk_sa=1023197a\" data-v-f87c67ca=\"\">supported<\/a> China on issuing digital currency to rival Facebook-led planned stablecoin Libra. He said: “Even China is able to issue such currencies, why wait for Libra? The strength of a state is greater than that of an Internet company.”","China has been <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/chinas-central-bank-digital-currency-is-ready-after-5-years-of-development\/\" data-v-f87c67ca=\"\">gearing up<\/a> to launch its digital yuan in the near future, after five years of research and development. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe PBoC <a href=\"http:\/\/finance.ifeng.com\/a\/20170629\/15497372_0.shtml\" data-v-f87c67ca=\"\">opened<\/a> its Digital Currency Research Institute in Jan. 2017, with research interests including blockchain and fintech. The Institute is headed by Mu Changchun, who was <a href=\"https:\/\/www.scmp.com\/economy\/china-economy\/article\/3026038\/china-appoints-new-digital-currency-head-race-facebooks-libra\" data-v-f87c67ca=\"\">appointed<\/a> in September. Mu recently<a href=\"https:\/\/www.theblockcrypto.com\/linked\/38748\/chinas-digital-currency-will-be-like-facebooks-libra-says-central-bank-official\" data-v-f87c67ca=\"\"> said<\/a> that the design of China’s digital currency would be similar to Libra and that it could also be used across major payment platforms such as WeChat and Alipay.","China has also been embracing blockchain technology, with the country’s president Xi Jinping recently <a href=\"https:\/\/www.theblockcrypto.com\/post\/44646\/xi-jinping-says-to-let-china-take-the-leading-position-in-blockchain\" data-v-f87c67ca=\"\">publicly supporting<\/a> the technology, saying that the nation should take the leading position in its development. Earlier today, China<a href=\"https:\/\/www.theblockcrypto.com\/linked\/45654\/china-launches-blockchain-based-identification-system-for-smart-cities\" data-v-f87c67ca=\"\"> launched<\/a> a blockchain-based identification system for smart cities, aimed at better connectivity and data sharing between these cities."],"hashtag":[]}