{"summary":"Kraken has emerged as the leading U.S. crypto exchange for altcoin trading, with around 50% of market depth for top 10 altcoins, per data from Kaiko.\nKraken’s market share among exchanges supporting USD deposits has risen to 21.1% in July from 8.3% in August 2022, attributed to its improved offering including Kraken Pro, despite a general industry-wide decline in trading volumes.","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244348\/kraken-outpaces-coinbase-as-most-liquid-us-exchange-for-altcoins-kaiko","publishDate":"2023-08-11T06:04:25","id":339,"type":null,"title":"Kraken outpaces Coinbase as most liquid US exchange for altcoins: Kaiko","category":["Companies"],"content":["California-based crypto exchange Kraken has become the go-to market in the U.S. for altcoin trading, according to data from crypto research firm <a href=\"https:\/\/twitter.com\/DessislavaIane2\/status\/1689301335760363521?s=20\" data-v-f87c67ca=\"\">Kaiko<\/a>, outpacing rivals like Coinbase.","Kraken <a href=\"https:\/\/twitter.com\/DessislavaIane2\/status\/1689301335760363521?s=20\" data-v-f87c67ca=\"\">commands<\/a> 47% of the market depth for the top 10 altcoins, according to Kaiko. Market depth refers to a given market's ability to absorb a large buy or sell order without impacting the price of that market's asset. In the wake of last year's price drawdown and the meltdown of FTX, market depth and liquidity have been negatively impacted across exchanges and cryptocurrencies.&nbsp;","In addition to its more robust market depth in alts, Kraken's marketshare among exchanges that support USD deposits has steadily increased over the last year, rising to 21.1% in July from around 8.3% in August 2022, according to The Block's <a href=\"https:\/\/www.theblockcrypto.com\/data\/crypto-markets\/spot\/usd-support-exchange-volume-market-share\" data-v-f87c67ca=\"\">data dashboard<\/a>.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/usd-support-exchange-volume-market-share\/embed\" title=\"USD Support Exchange Volume Market Share\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","In an email to The Block, a spokesperson for the exchange attributed the \"outperformance\" to an enhancement of its offering, pointing specifically to Kraken Pro. The advanced trading platform <a href=\"https:\/\/pro.kraken.com\/\" data-v-f87c67ca=\"\">launched<\/a> in December.&nbsp;","\"Our share of total volumes has hit an 18-month high. Our share of EUR spot markets has increased from 35% to 53% and AUD spot markets have increased 6x in the past 12 months,\" the spokesperson said.&nbsp;","To be sure, the firm has not been immune to the industry-wide trend of declining volumes, with monthly trading volumes declining from a high of $28.07 billion in March to $13.6 billion last month.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/cryptocurrency-exchange-volume-monthly\/embed\" title=\"Cryptocurrency Monthly Exchange Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>"],"hashtag":[]}