{"summary":"The Block&#x27;s Frank Chaparro and Mika Honkasalo chat recent developments in the decentralized finance (DeFi) marketplace.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/108950\/the-two-signs-of-strength-in-defi-today-according-to-the-blocks-mika-honkasalo","publishDate":"2021-06-18T14:02:32","id":3392,"type":null,"title":"The two signs of strength in DeFi today, according to The Block&#x27;s Mika Honkasalo","category":["DATA"],"content":["<i data-v-f87c67ca=\"\">Episode <\/i><strong data-v-f87c67ca=\"\">33<\/strong><i data-v-f87c67ca=\"\"> of Season 3 of The Scoop was recorded remotely with The Block’s Frank Chaparro and The Block analyst Mika Honkasalo. <\/i>","<i data-v-f87c67ca=\"\">Listen below, and subscribe to The Scoop on <\/i><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Apple<\/i><\/a><i data-v-f87c67ca=\"\">, <\/i><a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Spotify<\/i><\/a><i data-v-f87c67ca=\"\">, <\/i><a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Google Play<\/i><\/a><i data-v-f87c67ca=\"\">, <\/i><a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Stitcher<\/i><\/a><i data-v-f87c67ca=\"\"> or wherever you listen to podcasts. Email feedback and revision requests to <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"1969767d7a786a6d596d717c7b75767a727a6b60696d76377a7674\">[email&nbsp;protected]<\/a>.<\/i>","<strong data-v-f87c67ca=\"\">This episode is brought to you by our sponsors <a href=\"http:\/\/eventussystems.com\/\" data-v-f87c67ca=\"\">Eventus<\/a>, <a href=\"http:\/\/kraken.com\/scoop\" data-v-f87c67ca=\"\">Kraken<\/a>, and Exodus<\/strong>","Eventus is the leading global provider of multi-asset class trade surveillance, transaction monitoring and market risk solutions. Eventus offers a powerful, award-winning trade surveillance platform that is easy to deploy, customize and operate. Eventus is proven in the most complex, high-volume and real-time environments and supports many of the industry’s leading crypto exchanges including Coinbase, Gemini, ErisX and OSL. The company’s rapidly growing client base relies on Eventus’ responsive support and product development teams to overcome its most pressing regulatory challenges.","<strong data-v-f87c67ca=\"\">About Kraken<\/strong>","<em data-v-f87c67ca=\"\">Whether you’re an experienced crypto trader or just starting out, Kraken has the tools to help you achieve financial freedom. With 50+ cryptocurrencies to choose from, industry-leading security and a wide variety of features to suit any investing strategy, Kraken puts the power in your hands to buy, sell and trade digital assets. Visit <\/em><a href=\"http:\/\/kraken.com\/scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Kraken.com<\/em><\/a><em data-v-f87c67ca=\"\"> to get started today.<\/em>","<strong data-v-f87c67ca=\"\">About Exodus<\/strong>","The slump in prices across the cryptocurrency market has hit DeFi hard.","On this episode of The Scoop, The Block's Mika Honkasalo walked us through The Block's <a href=\"https:\/\/www.theblockcrypto.com\/data\/crypto-markets\/spot\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Data Dashboard<\/a> to illustrate the impact of the decline in retail interest across non-custodial trading venues.&nbsp;","The most notable area of weakness is demand for trading with leverage on decentralized derivatives venues such as Perpetual Protocol, which are \"m<span data-v-f87c67ca=\"\">ore reflexive versions of DEX's themselves,\" according to Honkasalo. \"And this is where the trade volumes have really dropped off—almost 80 to 90 percent.\"<\/span>","","","DEX volumes on venues like Uniswap and Sushiswap have held up a bit better, but are down around 50%, according to Honkasalo.&nbsp;","","","Still, there are some areas of growth despite the overall market doldrums.&nbsp;","Lending protocols, for instance, have seen growth recently. Outstanding Aave debt has surged and clocked in fresh all-time highs earlier this month. Honkasalo ties this to a thirst for dollars in the market.&nbsp;","","","Yearn is another example \"of where the money is going,\" Honkasalo added. According to the Data Dashboard, total value locked in Yearn vaults hit an all-time high above $5 billion this month.&nbsp;","Looking to the future, Honkasalo said that it will be interesting to watch how technical improvements in DeFi help sustain future periods of price appreciation, noting that the most recent cycle was stunted by scaling limitations.","\"Ethereum ran into this problem where no one could really use Ethereum when it was really really popular, and now that we have these layer two solutions coming up like Arbitrum and Optimism, it may be that the last time was really the last time where as soon as activity picks up it becomes immediately way too expensive for users, and that's the path to the excitement dying down,\" he said. &nbsp;","Honkasalo also had this to say:","“Liquidity, mining and ICOs have really shown us that the technical innovation happens very slowly in a very sort of linearly and reasonably predictable fashion, whereas these financial incentives come on top, so they're the ones that really maybe kick off the interest and activity properly. So these two have a mismatch and they don't always talk to each other perfectly. So interest doesn't grow as technology grows at the same rate. So seeing just how these cycles play out and how sort of violent they are, do they become less volatile over time? That's something I think will be interesting to follow over the next two years.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Gemini","content":"LOCATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"$5 billion","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"OSL","content":"ORGANIZATION"},{"type":"The Block's <a href=\"https:\/\/www.theblockcrypto.com\/data\/crypto-markets\/spot\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Data Dashboard","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Spotify","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Honkasalo","content":"PERSON"},{"type":"Ethereum","content":"PERSON"},{"type":"Mika Honkasalo","content":"PERSON"},{"type":"Data Dashboard","content":"ORGANIZATION"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"90 percent","content":"PERCENT"}],"hashtag":["ETHEREUM"],"authors":["Frank Chaparro","The Block"]}