{"summary":"The guidance, released after two months&#x27; public consultation, requires crypto firms to formulate token listing and delisting policies for approval.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/263243\/new-york-financial-watchdog-releases-guidance-to-strengthen-crypto-listing-delisting","publishDate":"2023-11-15T20:46:28","id":3393,"type":null,"title":"New York financial watchdog releases guidance to strengthen crypto listing, delisting","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">New York’s financial watchdog has started to take a more active role in supervising token listing and delisting on exchanges as it seeks to bolster oversight of crypto firms.<\/span>","<span data-v-f87c67ca=\"\">The New York State Department of Financial Services on Wednesday published&nbsp;<\/span><a href=\"https:\/\/www.dfs.ny.gov\/industry_guidance\/industry_letters\/il20231115_listing_virtual_currencies\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">guidance<\/span><\/a><span data-v-f87c67ca=\"\"> on the listing of cryptocurrencies — rules that take effect immediately. Crypto firms are required to get their coin-listing policy approved by the regulator before they can list a coin, the regulator said.<\/span>","<span data-v-f87c67ca=\"\">The release of the latest guidance comes after NYDFS <\/span><a href=\"https:\/\/www.theblock.co\/post\/251502\/new-york-financial-watchdog-proposes-strengthened-crypto-guidelines\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">issued the draft for public comment<\/span><\/a><span data-v-f87c67ca=\"\"> in September.<\/span>","<span data-v-f87c67ca=\"\">“Following DFS approval of a coin-listing policy, a [virtual currency entity] may proceed with self-certification of coins, thereby making them available for approved virtual currency business activity in New York or to New Yorkers,” <\/span><span data-v-f87c67ca=\"\">NYDFS Superintendent Adrienne Harris said in the industry letter<\/span><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The regulator noted that crypto firms without NYDFS-approved coin-listing policies may only list tokens included in its “greenlist” unless otherwise approved.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A coin-listing policy “must include robust procedures” and must be tailored to the crypto firm’s specific business model, operations, customers and counterparties, geographies of operations and service providers, according to the guidance. The policies must cover governance, risk assessment and monitoring of coins.<\/span>","<span data-v-f87c67ca=\"\">The new guidance also stipulated that in the event a listed coin is “identified as presenting newly elevated risk,” crypto firms must discontinue support of that coin. The regulator said that all entities must have a draft coin-delisting policy by Dec. 8, 2023, and a final version must be submitted to the regulator for approval by Jan. 31, 2024.<\/span>","<span data-v-f87c67ca=\"\">NYDFS has been active in overseeing the crypto industry for the past few years. In 2015, it issued its virtual currency regulation, 23 NYCRR Part 200, or what’s known as the <\/span><a href=\"https:\/\/www.dfs.ny.gov\/virtual_currency_businesses\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">BitLicense regime<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York","content":"LOCATION"},{"type":"Jan. 31, 2024","content":"DATE"},{"type":"2015","content":"DATE"},{"type":"New Yorkers","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"Dec. 8, 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Adrienne Harris","content":"PERSON"},{"type":"DFS","content":"ORGANIZATION"},{"type":"New York State Department of Financial Services","content":"ORGANIZATION"}],"hashtag":["CRYPTO"],"authors":["Timmy Shen","The Block"]}