{"summary":"Robinhood, the California-based investment app, today launched commission-free crypto trading in the European Union.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266452\/robinhood-launches-crypto-trading-app-in-europe","publishDate":"2023-12-07T01:39:16","id":3395,"type":null,"title":"Robinhood launches crypto trading app in Europe","category":["EXCHANGES"],"content":["Robinhood, the investment app, today announced the launch of its crypto trading app in the European Union. The app will go live on Thursday, with over 25 coins and tokens available to investors, including bitcoin, ether and SOL.","The company <a href=\"https:\/\/www.cnbc.com\/2023\/11\/30\/robinhood-to-launch-in-the-uk-in-latest-international-expansion-bid.html\" data-v-f87c67ca=\"\">launched its brokerage services in the UK<\/a> just a week ago after two failed attempts. One of those involved the purchase of UK crypto startup Ziglu, <a href=\"https:\/\/www.theblock.co\/post\/182459\/robinhood-wont-close-ziglu-acquisition-this-quarter\" data-v-f87c67ca=\"\">but that deal ultimately fell through<\/a>.","In its announcement today, Robinhood said its platform is the only one on the market that offers to repay a percentage of customers’ trading volume each month in bitcoin. Users can also earn referral bonuses in bitcoin.","“The EU has developed one of the world’s most comprehensive policies for crypto asset regulation, which is why we chose the region to anchor Robinhood Crypto’s international expansion plans,” said Johann Kerbrat, GM of Robinhood Crypto, in a statement.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"European Union","content":"LOCATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"Johann Kerbrat","content":"PERSON"},{"type":"GM of Robinhood Crypto","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Robinhood Crypto","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"}],"hashtag":["ROBINHOOD"],"authors":["Ryan Weeks","The Block"]}