{"summary":"A16z has used 15 million UNI tokens to vote against a community proposal that would see Jump Crypto-backed Wormhole used as a the bridge in deploying Uniswap V3 on BNB Chain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/208729\/a16z-votes-against-proposal-to-deploy-latest-uniswap-iteration-on-bnb-chain","publishDate":"2023-02-05T07:27:28","id":3396,"type":null,"title":"A16z votes against proposal to deploy latest Uniswap iteration on BNB Chain","category":["CRYPTO ECOSYSTEMS"],"content":["A proposal to deploy the latest version of decentralized exchange Uniswap on the BNB Chain passed an early temperature check, and a full governance vote on the Uniswap DAO is bringing the heavy hitters out to bat.","OxPlasma Labs put forward the <a href=\"https:\/\/www.tally.xyz\/gov\/uniswap\/proposal\/31\" data-v-f87c67ca=\"\">proposal<\/a> to deploy Uniswap V3 on BNB Chain, using the Wormhole bridge for the deployment. A16z put its considerable UNI holdings to use by voting against it. The VC firm has significant skin in the game, as does Jump Crypto — pitting two of the space's most active VCs against each other. Voting will conclude on Feb. 10.&nbsp;","Jump Crypto won't be voting on the proposal a spokesperson told The Block","Andreessen Horowitz's crypto arm, a16z, backs LayerZero as a bridge, while Jump is invested in Wormhole. A16z could not vote in last week's temperature check, but partners noted their intention to back LayerZero.","\"To be totally unambiguous, we at a16z would have voted 15 million tokens toward LayerZero if we were technically able to. And we will be able in future Snapshot votes,\" Eddie Lazzarin, partner at a16z, wrote in a forum <a href=\"https:\/\/gov.uniswap.org\/t\/rfc-update-deploy-uniswap-v3-1-0-3-0-05-0-01-on-bnb-chain-binance\/19734\/78\" data-v-f87c67ca=\"\">post<\/a>.","The fund could not participate in the temperature check due to the custodial set-up of its tokens, a source with knowledge of the process told The Block.","The debate about these bridges is partly about security&nbsp; — cross-chain bridges have been the target of numerous attacks, including last year's $325 million attack on Wormhole. The fact that two massive VC firms' own portfolio companies are involved was also a topic of discussion.&nbsp;","Wormhole proponents were <a href=\"https:\/\/www.theblock.co\/post\/207297\/uniswap-temperature-check-spurs-feverish-backroom-maneuvering-among-crypto-vc-heavyweights?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">hoping<\/a> to avoid this scenario, with one person close to the project telling The Block: \"If a16z goes against community vote and tries to tank it, I'd be shocked. That would be truly abhorrent, and I don't think they would go that far.\"","<em data-v-f87c67ca=\"\">Update: This story has been updated to include that Jump has will not vote on the proposal.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Wormhole","content":"LOCATION"},{"type":"$325 million","content":"MONEY"},{"type":"Uniswap DAO","content":"ORGANIZATION"},{"type":"Feb. 10","content":"DATE"},{"type":"Eddie Lazzarin","content":"PERSON"},{"type":"BNB","content":"ORGANIZATION"},{"type":"UNI","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Andreessen Horowitz","content":"PERSON"}],"hashtag":["CROSS-CHAIN SWAPS","DAOS","GOVERNANCE VOTES","INTEROPERABILITY"],"authors":["Adam Morgan McCarthy","The Block"]}