{"summary":"The SEC has issued new “guidance” on broker-dealers working with “digital asset securities.”\nThe regulator says it won’t take action in the next five years against broker-dealers that comply with a specific set of standards.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/89047\/sec-digital-asset-securities-custody-guidance-comment","publishDate":"2020-12-23T13:57:06","id":3396,"type":null,"title":"SEC issues custody-focused guidance for brokers of digital asset securities, seeks comment from industry stakeholders","category":["Regulation"],"content":["In a new <a href=\"https:\/\/www.sec.gov\/rules\/policy\/2020\/34-90788.pdf\" data-v-f87c67ca=\"\">statement<\/a> from the Securities and Exchange Commission (SEC), the U.S. securities regulator says it won't bring enforcement actions against broker-dealers of digital asset securities that meet a number of requirements during the next five years.","The SEC is aiming to garner comments from industry players to help shape standards related to the custody of digital asset securities.","The statement does not use the terms \"safe harbor\" or \"no action,\" but does indicate that the SEC is not planning to bring actions against most digital asset security broker-dealers as it navigates how to craft new standards. Commissioner Hester Peirce referred to the statement as \"guidance\" in a <a href=\"https:\/\/twitter.com\/HesterPeirce\/status\/1341791853176352770\" data-v-f87c67ca=\"\">tweet<\/a>.&nbsp;","\"In particular, the Commission’s position, which will expire after a period of five years from the publication date of this statement, is that a broker-dealer operating under the circumstances set forth in Section IV will not be subject to a Commission enforcement action on the basis that the broker-dealer deems itself to have obtained and maintained physical possession or control of customer fully paid and excess margin digital asset securities for the purposes of paragraph (b)(1) of Rule 15c3-3,\" the agency said in its statement.","<span data-v-f87c67ca=\"\"><a href=\"https:\/\/www.sec.gov\/rules\/policy\/2020\/34-90788.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Those circumstances<\/a> feature a number of due diligence procedures that are subject to examination from the SEC and the Financial Industry Regulatory Authority, or FINRA. They include limiting business to only \"digital asset securities\" and no traditional assets, although the statement does not indicate the difference between \"digital assets\" and \"digital asset securities.\" Broker-dealers also must disclose risk to customers and implement \"policies and procedures reasonably designed to mitigate risk.\" That means written contingency plans for hard forks, 51% attacks, theft, and the unauthorized use of keys, among other possibilities. It also means written policies related to assessing risk of assets and their underlying technology.<\/span>","In a statement outlining the amended procedure, the SEC acknowledged that the \"technical requirements\" for transacting and holding custody of digital asset securities is different from the traditional securities realm, and the market itself is still evolving.","The regulator says it hopes the five-year window will foster an environment in which firms are developing best practices to be shared with the SEC in the form of formal comments.&nbsp;","\"The five-year period in which the statement is in effect is designed to provide market participants with an opportunity to develop practices and processes that will enhance their ability to demonstrate possession or control over digital asset securities,\" said the statement. \"It also will provide the Commission with experience in overseeing broker-dealer custody of digital asset securities to inform further action in this area.\""],"hashtag":["SEC"]}