{"summary":"Paradigm, Pantera Capital, Coinbase Ventures, Fenbushi Capital, Polychain Capital, and Blockchain.com have invested $28 million in Hong Kong and Shenzhen-based crypto finance firm Amber\nAmber offers integrated crypto trading services, including market making, over-the-counter (OTC) trading, electronic sales trading, lending, treasury management.","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/56044\/asian-crypto-trading-firm-amber-raises-28m-series-a-from-pantera-paradigm-coinbase-ventures-and-others","publishDate":"2020-02-14T11:42:59","id":3399,"type":null,"title":"Asian crypto trading firm Amber raises $28M Series A from Pantera, Paradigm, Coinbase Ventures and others","category":["Asia"],"content":["Top U.S. crypto venture funds are betting big on a lesser-known Asian crypto firm that says it has traded $100 billion in digital assets since early 2018.&nbsp;","<span data-v-f87c67ca=\"\">Paradigm and Pantera Capital, along with Coinbase Ventures, Fenbushi Capital, Polychain Capital, and Blockchain.com, have invested $28 million in Hong Kong and Shenzhen-based crypto finance firm Amber, joining its existing investor Dragonfly Capital. Paradigm and Pantera co-led the Series A round.<\/span>","<span data-v-f87c67ca=\"\"><a href=\"https:\/\/www.theblockcrypto.com\/post\/56044\/asian-crypto-trading-firm-amber-raises-28m-series-a-from-pantera-paradigm-coinbase-ventures-and-others\" data-v-f87c67ca=\"\">Amber<\/a> started as a side project of five Morgan Stanley investment traders and one Bloomberg engineer in 2015. It was officially founded in January 2018 and became profitable in the second month of its operation, Amber co-founder Tiantian Kullander told The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The firm offers so-called integrated secondary market services, tying market-making, over-the-counter (OTC) trading, electronic sales trading, lending, treasury management, and other trading services for institutional investors under one roof. Within half a year, the firm has generated $100 million in loans – and is currently sitting on $60 million outstanding loans as of today with 150% in quarterly growth, according to Kullander.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As a point of reference, Asia-based Matrixport <\/span><a href=\"https:\/\/www.theblockcrypto.com\/daily\/54000\/500-million-in-crypto-spot-trades-in-less-than-a-year-a-deep-dive-into-the-rise-of-jihan-wus-matrixport\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">had around $100 million<\/span><\/a><span data-v-f87c67ca=\"\"> in outstanding loans by January 2020, and that firm inherited one of the best miner client networks from its founder Jihan Wu, who currently helms mining equipment maker Bitmain.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“More and more of these services, they are very synergistic with each other, and hence whilst we can break them down into different business lines now, and track revenue separately, overtime the revenue will be commingled,” said Kullander.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Compared to Matrixport and Genesis Global Trading – both of which have ties with notable firms in the institutional lending space,&nbsp;Bitmain and Digital Currency Group, respectively – Amber may still hold an edge as its active presence in trading allows them to offer competitive interest rate, Kullander argued.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The reason why we feel like we have a strong edge in lending, even though we don't have as big of a balance sheet… is because we are also very active in trading interest rate in the market,” said Kullander.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Amber also finds itself in a unique spot in the crypto venture investment scene, wherein there are not a lot of middle-stage startups with clear business models and revenue-generating capacity with which VCs can entrust their investments.&nbsp;<\/span>","\"As market liquidity further bifurcates among sophisticated dealers and client-facing broker in a fully electronic market, Amber plays a huge rule by enabling clients to trade across fragmented crypto markets through a single software interface,\" Arjun Balaji, an investment partner at Paradigm, told The Block. \"We led Amber’s Series A because we believe Amber is well-positioned to capture this opportunity. They’re a world-class team that is both financially sophisticated and deeply crypto-native and we’re excited to partner with them on the journey.\"","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Disclosure:<\/strong>&nbsp;Pantera Capital and Fenbushi Capital are <a href=\"https:\/\/www.crunchbase.com\/funding_round\/the-block-crypto-seed--e8ac73f5#section-overview\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">investors<\/a> in The Block.&nbsp;<\/em>"],"hashtag":[]}