{"summary":"In a YouTube AMA, Binance CEO Changpeng “CZ” Zhao discussed the Malta-based exchange’s key plans for the months ahead – hours after announcing a security breach that saw 7,000 bitcoin stolen\nWe summarize the talk, including his confirmation that margin trading would begin “very soon”\nNo deposits or withdrawals will be accepted on the exchange for around a week as a security precaution ","author":["Isabel Woodford","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/22467\/binance-ceo-confirms-margin-trading-stablecoin-discussions-and-possible-argentina-launch-in-wake-of-security-breach","publishDate":"2019-05-08T07:14:33","id":3400,"type":null,"title":"Binance CEO confirms margin trading, stablecoin discussions, and possible Argentina launch in wake of security breach","category":["Exchanges"],"content":["It's been a hectic 24 hours for Binance. \"A rough day,\" CEO Changpeng \"CZ\" Zhao admitted to viewers during his <a href=\"https:\/\/www.youtube.com\/watch?v=CDm-m1FNl1w\" data-v-f87c67ca=\"\">live ask-me-anything<\/a> (AMA) session on YouTube early this morning, after a chat user pointed out he looked \"exhausted\" amid the chaos of a security breach.&nbsp;","But despite his sleep deprivation, CZ offered AMA viewers updates on the hack alongside some other big news.","Here's the breakdown:","<strong data-v-f87c67ca=\"\">On the 7,000 BTC hack (1.00-7.00)<\/strong>","<strong data-v-f87c67ca=\"\">On margin trading (15.15-16.00)<\/strong>","<strong data-v-f87c67ca=\"\">On a future stablecoin<\/strong>","<strong data-v-f87c67ca=\"\">On The Launchpad timeline<\/strong>","<strong data-v-f87c67ca=\"\">On Binance Chain<\/strong>","<strong data-v-f87c67ca=\"\">Elsewhere...<\/strong>","* In the AMA, CZ discussed reorganizing the bitcoin network to recover the funds, but he has since dismissed this option, confirming Binance will replenish the funds from its own insurance fund."],"hashtag":["BINANCE","CZ"]}