{"summary":"Cash App is looking to hire a new product manager\nThe new hire could build out new features like peer-to-peer bitcoin gifting and auto-investing","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/51701\/a-job-ad-hints-at-new-bitcoin-features-for-cash-app-including-auto-investing-and-p2p-gifting","publishDate":"2019-12-29T14:42:25","id":3401,"type":null,"title":"A job ad hints at new bitcoin features for Cash App, including auto-investing and P2P gifting","category":["Bitcoin"],"content":["Cash App, the Venmo-rival unit of Square, is eyeing an expansion of its bitcoin services, and is currently seeking a product manager for the job.&nbsp;","Square, the financial technology company led by Twitter founder Jack Dorsey, began offering users the ability to buy and sell bitcoin in <a href=\"https:\/\/www.cnbc.com\/2017\/11\/15\/square-is-letting-some-people-buy-and-sell-bitcoin-on-its-cash-app.html\" data-v-f87c67ca=\"\">November 2017<\/a>. Still, the feature is limited compared to offerings by crypto-native firms like Coinbase.","Change is soon coming, however. As per a job ad, which has not been previously reported on, Square has been accepting applications for a PM to add new possible features including \"auto-investing\" and peer-to-peer \"BTC gifting.\"&nbsp;","\"You will own the Crypto Investing product and be entirely responsible for growing its adoption in whatever ways you see fit, which could include tried and true growth tactics, new functionality (e.g. limit orders, auto-invest), or building entirely new features like BTC gifting (P2P),\" the <a href=\"https:\/\/www.linkedin.com\/jobs\/view\/1510820856\/\" data-v-f87c67ca=\"\">job description<\/a> states.&nbsp;","","","Square's bitcoin offering has witnessed steady growth in 2019, as previously noted by The <a href=\"https:\/\/www.theblockcrypto.com\/linked\/46151\/square-cash-app-q3-bitcoin-sales-topped-a-record-159-million-up-over-150-since-last-year\" data-v-f87c67ca=\"\">Block's Ryan Todd<\/a>.&nbsp;","Square posted a record $148 million in quarterly bitcoin sales for the third quarter of 2019, up ~20% on volumes from last quarter, and up more than 245% since Q3 2018.&nbsp;In terms of BTC, The Block estimates that the total volume of BTC sales through the Cash App was ~14,300 BTC, using the average price of bitcoin in Q3 ($10.3K).","In the company's third quarter investor letter, the firm credited Cash App's redesigned customer interface in September for increased product adoption of both Bitcoin and Cash Card. Square also noted that first-time bitcoin buyers have \"approximately doubled\" since the redesign."],"hashtag":[]}