{"summary":"Vietnam-based little-known crypto exchange VinDAX has been hacked and lost at least $500,000 worth of cryptocurrencies \nThe exchange is mainly engaged in conducting token sales of little-known blockchain projects ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/46408\/little-known-asian-crypto-exchange-vindax-got-hacked-lost-half-a-million-usd-worth-of-tokens","publishDate":"2019-11-08T05:35:14","id":3402,"type":null,"title":"VinDAX got hacked; lost ‘half a million USD’ worth of tokens","category":["Exchanges"],"content":["Vietnam-based little-known cryptocurrency exchange VinDAX has been hacked, losing “half a million USD” worth of cryptocurrencies, The Block has learned.","An admin of VinDAX’s official Telegram channel, with the handle “@VinDAXSupport” confirmed to The Block on Friday that it is “true” that the exchange got hacked and lost cryptocurrencies worth the amount. They said the breach took place “3 days ago.”","One source familiar with the matter told The Block that VinDAX has lost the funds via 23 cryptocurrencies. The admin declined to share further information but said: \"We have made a full recovery from this attack,\" without providing details.","VinDAX is primarily engaged in conducting<a href=\"https:\/\/vindax.com\/launchpad.html\" data-v-f87c67ca=\"\"> token sales<\/a> of little-known projects via its Launchpad platform. There is currently a token sale going on the platform for blockchain project MyFie, while there are at least 5 more token sales scheduled on the platform.","Notably, VinDAX had <a href=\"https:\/\/www.similarweb.com\/website\/vindax.com#overview\" data-v-f87c67ca=\"\">over 390,000 visitors<\/a> last month and the majority (over 65%) of them were from India, according to web analytics firm SimilarWeb.","The Block has further learned that VinDAX has been sending emails to projects of hacked tokens, asking for funds.","\"Please lend us an amount of your token\/coin equal to 30%-100% the amount that was stolen in the last accident so that we can address the withdrawal request of the users that are related to your token\/coin,” one of the emails reportedly read.","<strong data-v-f87c67ca=\"\">7th hack of the year&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/strong>VinDAX's hack marks this year’s seventh breach, and the total amount stolen from cryptocurrency exchanges to date now stands at around $1.39 billion, according to The Block’s research.<br data-v-f87c67ca=\"\">\n","","While for this year alone, cryptocurrency exchanges have so far lost over $100 million.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"hashtag":["HACKS"]}