{"summary":"Bitcoin-backed loans provider Ledn has raised $2.7 million in a seed extension round.\nThe round was led by White Star’s Digital Asset Fund, with participation from Coinbase Ventures and others. ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/94166\/ledn-bitcoin-backed-loans-seed-funding-round","publishDate":"2021-02-08T10:26:33","id":3403,"type":null,"title":"Bitcoin-backed loans provider Ledn raises $2.7 million in new funding","category":["Bitcoin"],"content":["Crypto financial services firm Ledn has raised $2.7 million in a seed extension round.","The round was led by White Star’s Digital Asset Fund, with participation from Coinbase Ventures, Darrow Holdings (an affiliate of Susquehanna International Group), CMT Digital and others.","With fresh capital at hand, Ledn indicated that it will expand its suite of services as well as grow its international footprint. In a statement to The Block, CEO Adam Reeds highlighted Africa as a noteworthy growth market for the startup.","“We are particularly excited about the adoption we are seeing in Africa,” said Reeds. “So we intend to use our additional resources to expand deeper into growth markets that can truly benefit from bitcoin's properties as a savings asset.”","Founded in 2018, the Canada-based <a href=\"https:\/\/www.theblockcrypto.com\/post\/2684\/meet-ledn-canadas-first-bitcoin-backed-lender\" data-v-f87c67ca=\"\">Ledn provides<\/a> bitcoin savings accounts and bitcoin-backed loans, among other services. Reeds said Ledn is already profitable, but needed the capital to “double-down on our growth.”","Ledn has “thousands of active clients,” co-founder Mauricio Di Bartolomeo told The Block, adding that the top five markets based on revenue are Colombia, Mexico, Argentina, Canada, and the U.S.","The startup is preparing to launch a new, no-fee crypto trading service in Colombia next week, according to Bartolomeo. “From there we will enable the trade feature market by market,\" he added.","This is an “incremental” service and not core to Ledn’s profitability, Reeds told The Block. “It is just important to allow our clients to do more with their bitcoin in one place. Clients will be able to trade directly from our savings accounts, so they will earn interest while they are not trading. Ledn will earn a small spread by providing a time-locked price guarantee.\"","As part of its expansion plans, Ledn also looks to more than double its headcount, from 12 people to 30, by June, Reeds told The Block. He added that the firm is hiring across engineering, legal, compliance, marketing and finance functions.","The seed extension round brings Ledn’s total funding to $3.8 million, said Reeds. The firm previously raised an undisclosed amount of debt capital to fund its bitcoin-backed loan portfolio.","“Ledn borrows from institutional partners to fund its bitcoin-backed loans (no debt is borrowed for corporate operations - we are fully funded through equity and existing cash flows),” said Reeds. “We have not yet disclosed the size of our bitcoin-backed loan portfolio, but will have exciting news to share shortly about our growth.”","Looking ahead, Ledn plans to raise between $10 million and $20 million in a Series A funding round later this year, according to Reeds."],"hashtag":["BITCOIN"]}