{"summary":"The report said that a number of contentious issues have been resolved and that the majority of assets are secured.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/268781\/3ac-liquidators-estimate-46-per-cent-recovery-rate-for-creditors-teneo-report","publishDate":"2023-12-21T06:37:07","id":3404,"type":null,"title":"3AC liquidators estimate 46% recovery rate for creditors: Teneo report","category":["COMPANIES"],"content":["The joint liquidators of defunct crypto hedge fund Three Arrows Capital have estimated that creditors will receive 45.74% of their claims with the bankrupt estate, with initial distributions planned for the first quarter of next year.","In a December report to creditors viewed by The Block, Teneo’s joint liquidators Russell Crumpler and Christopher Farmer said the estimated value of the company’s assets stood at $1.16 billion as of Dec. 18, while claims to the value of $2.7 billion are expected to be recognized for distribution.","Teneo noted that it had settled litigation against several parties, including DCG, Genesis and BlockFi — which has boosted the firm’s reported assets by an estimated $292 million. The BlockFi settlement remains subject to approval.","There were 154 claims filed against the 3AC estate, with a total value of $3.4 billion, the report notes. It states that $200 million of the claims were not admitted for distribution, while $322 million of claims have either been rejected or are expected to be rejected. Claims worth $76 million are being disputed.","The large majority of the assets held by the liquidators are illiquid tokens subject to vesting periods, according to a breakdown of the assets. Only 6% of the portfolio is liquid.","Illiquid tokens make up 82% of assets, while equity and investments come to 6.9%, and 4.8% is in cash.","The illiquid tokens comprise 13 different tokens and have a combined value of $563 million at current prices. They are subject to vesting schedules with roughly $50 million of assets to be unlocked in most quarters until the end of 2026. By the end of 2024, $200 million of tokens will have been unlocked.","The liquidators have staked a number of these tokens, they said — which has already resulted in $5.4 million of staking rewards. The cash holdings have also generated $1 million in interest payments.","The liquidators have been generally converting liquid tokens and NFTs to fiat. So far, $34.5 million worth of liquid tokens have been sold, in addition to $15 million worth of NFTs. When combined with other asset sales, the liquidators have realized $66 million.","As Teneo stated earlier today, A British Virgin Islands court <a href=\"https:\/\/www.theblock.co\/post\/268758\/bvi-court-freezes-three-arrows-capital-founders-1-billion-in-assets\" data-v-f87c67ca=\"\">has frozen up<\/a> to $1.1 billion worth of assets belonging to 3AC co-founders Su Zhu and Kyle Davies, as well as Davies’ wife Kelly Chen.","The liquidators’ report adds further detail. It says liquidators have filed a claim for insolvent trading against the 3AC founders for $1.078 billion. It further filed claims against Davies for $66 million and Chen for $4.6 million.","After <a href=\"https:\/\/www.theblock.co\/post\/255133\/photos-show-the-moment-3ac-co-founder-su-zhu-was-arrested-in-singapore\" data-v-f87c67ca=\"\">Zhu was arrested in Singapore<\/a> on Sept. 29, he was sentenced to four months imprisonment, the report notes. On Nov. 28, he was allowed to serve the rest of his sentence under house arrest. He was released on Dec. 20, having served two-thirds of his sentence.&nbsp;","The report notes that after Zhu was arrested, <a href=\"https:\/\/www.theblock.co\/post\/267382\/3ac-co-founder-su-zhu-set-to-be-released-faces-singapore-court-questioning\" data-v-f87c67ca=\"\">he was examined<\/a> on Dec. 12 and 13, providing the joint liquidators with further insights and clarifications.","While the liquidators have a good understanding of where Davies is located, they say he has yet to cooperate meaningfully or serve the custodial sentence that was ordered against him.","Litigation involving DeFiance Capital is still ongoing, with <a href=\"https:\/\/www.theblock.co\/post\/244914\/defiance-capital-3ac-singapore\" data-v-f87c67ca=\"\">parallel proceedings in the British Virgin Islands and Singapore<\/a>. Liquidators are also still investigating 3AC’s relationship with Tai Ping Shan, a company that worked closely with 3AC.","Legal fees have amounted to $49.7 million during the bankruptcy proceedings.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DCG","content":"ORGANIZATION"},{"type":"Nov. 28","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Sept. 29","content":"DATE"},{"type":"82%","content":"PERCENT"},{"type":"Su Zhu","content":"ORGANIZATION"},{"type":"Christopher Farmer","content":"PERSON"},{"type":"$3.4 billion","content":"MONEY"},{"type":"$1.078 billion","content":"MONEY"},{"type":"2026","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"DeFiance Capital","content":"ORGANIZATION"},{"type":"Kyle Davies","content":"PERSON"},{"type":"$66 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"$49.7 million","content":"MONEY"},{"type":"$292 million","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"$563 million","content":"MONEY"},{"type":"first quarter","content":"DATE"},{"type":"$76 million","content":"MONEY"},{"type":"Teneo","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"$1 million","content":"MONEY"},{"type":"$4.6 million","content":"MONEY"},{"type":"Davies","content":"PERSON"},{"type":"$1.1 billion","content":"MONEY"},{"type":"$50 million","content":"MONEY"},{"type":"6%","content":"PERCENT"},{"type":"6.9%","content":"PERCENT"},{"type":"Dec. 20","content":"DATE"},{"type":"$1.16 billion","content":"MONEY"},{"type":"$5.4 million","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"45.74%","content":"PERCENT"},{"type":"British Virgin Islands","content":"LOCATION"},{"type":"$200 million","content":"MONEY"},{"type":"$322 million","content":"MONEY"},{"type":"4.8%","content":"PERCENT"},{"type":"fiat","content":"ORGANIZATION"},{"type":"earlier today","content":"DATE"},{"type":"Tai Ping Shan","content":"PERSON"},{"type":"Kelly Chen","content":"PERSON"},{"type":"Dec. 18","content":"DATE"},{"type":"Chen","content":"ORGANIZATION"},{"type":"Dec. 12","content":"DATE"},{"type":"$2.7 billion","content":"MONEY"},{"type":"British Virgin Islands","content":"ORGANIZATION"},{"type":"$15 million","content":"MONEY"},{"type":"$34.5 million","content":"MONEY"},{"type":"Russell Crumpler","content":"PERSON"}],"hashtag":["SU ZHU","THREE ARROWS CAPITAL"],"authors":["Timmy Shen","Tim Copeland","The Block"]}