{"summary":"Swiss crypto infrastructure provider METACO has raised $17 million in Series A funding from notable investors\nWith the fresh capital in place, METACO plans to serve central banks to support their digital currency initiatives ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/71502\/crypto-infrastructure-provider-metaco-raises-17-million-in-series-a-funding","publishDate":"2020-07-14T08:00:37","id":3404,"type":null,"title":"Crypto infrastructure provider METACO raises $17 million in Series A funding","category":["Infrastructure"],"content":["Switzerland-based crypto infrastructure provider METACO has raised $17 million in Series A funding from notable investors.","German security technology company Giesecke+Devrient led the round, with participation from Standard Chartered Bank's SC Ventures, Swiss bank Zurcher Kantonalbank and venture capital firm Investiere. Existing investors Swisscom, SICPA, Avaloq, and Swiss Post also participated in the Series A.","With the fresh capital in place, METACO wants to invest in research and development and expand its solutions in the U.S., South East Asia, and Western Europe. METACO provides crypto custody, trading, and tokenization solutions for financial institutions.","METACO said it is also looking to serve central banks for their digital currency initiatives. Its investors Giesecke+Devrient and SICPA already provide security solutions to central banks.","\"The tokenization narrative is gaining momentum among regulators and central banks, encompassing a broad spectrum of promising innovations ranging from digital currencies to national identities,\" said Assaf Shamia, investment director at Giesecke+Devrient. \"Yet tokenized assets require a trusted, secure and scalable solution to handle the safeguarding of private keys. Following extensive market research we identified METACO as the dominant player in its field.\"","Founded in 2015, METACO has previously raised funding twice, and today's Series A brings the firm's total funding to date to $21 million, a METACO spokesperson told The Block.&nbsp;","Switzerland-based crypto firms have been attracting investments at an increasing pace. Earlier this year, crypto asset manager Crypto Finance AG raised $14.5 million in Series B financing; crypto infrastructure startup Taurus Group raised ~$11 million in Series A, and Swiss crypto broker Bitcoin Suisse was looking to raise at least ~$47.5 million."],"hashtag":["SERIES A"]}