{"summary":"Blockchain infrastructure-as-a-service provider Bison Trails, which is also a member of the Libra Association, has just raised $25.5 million in Series A","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/47549\/bison-trails-a-libra-association-member-raises-25-5m-series-a-to-expand-its-blockchain-infrastructure-offerings","publishDate":"2019-11-19T09:00:20","id":3405,"type":null,"title":"Bison Trails, a Libra Association member, raises $25.5M Series A to expand its blockchain infrastructure offerings","category":["INVESTMENTS"],"content":["Blockchain infrastructure-as-a-service provider Bison Trails, which is also a member of the Libra Association, has just raised $25.5 million in Series A funding to expand its offerings.","The round was led by Blockchain Capital, with participation from Silicon Valley venture firm Kleiner Perkins, Coinbase, Consensys and Galaxy Digital, among several others.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nJoe Lallouz, CEO of Bison Trails, told The Block that the firm will utilize the fresh capital to expand its offerings as well as to develop a new network roadmap for several projects, including Libra, Telegram, Skale and Polkadot.","“As one of 21 founding members of the Libra Association, we’re actively working with founding members to move the technology forward, from testnet to mainnet launch,” Lallouz told The Block.","Bison Trails said it will be playing a key role in strengthening the Libra network to support “billions of transactions.”","Bison Trails will also bring its platform, out of a limited beta currently, to a wider market in the future; hire more members to its team; build partnerships with leading exchanges and custodians, with the new capital in place, said Lallouz.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">Blockchain infrastructure&nbsp;<\/strong>","Founded in 2018, Bison Trails removes the need for blockchain projects to spend resources on developing in-house security and infrastructure. Currently, over 20 protocol projects rely on Bison Trails’ infrastructure, said the firm.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBison Trails' charges vary based on a network, Lallouz told The Block, adding: \"Many of our services, including launching, managing, monitoring, scaling, securing their infrastructure and handling network updates, are included in the price of running a node cluster.\"","\"When we started building Bison Trails, we wanted to bring transparency and ease to entrepreneurs bold enough to build in a decentralized ecosystem... We have become the easiest way to run infrastructure on multiple blockchains,\" said Lallouz.","On participating in the Series A, Monica Desai, an investor at Kleiner Perkins, told The Block: “Bison Trails realized early that node infrastructure would become a bottleneck to blockchain adoption, which is why they created a decentralized, user-friendly solution that developers and customers love. We’re excited to be part of their next chapter.”","The Series A round brings the firm’s total funding to date to $31 million, said Lallouz. He declined to comment on Bison Trails’ valuation and revenues.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"Libra Association","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Kleiner Perkins","content":"PERSON"},{"type":"$31 million","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"Monica Desai","content":"PERSON"},{"type":"$25.5 million","content":"MONEY"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Telegram","content":"LOCATION"},{"type":"Joe Lallouz","content":"PERSON"},{"type":"Lallouz","content":"PERSON"},{"type":"Blockchain Capital","content":"ORGANIZATION"},{"type":"Bison Trails","content":"ORGANIZATION"},{"type":"Silicon Valley","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}