{"summary":"A serious risk to bitcoin could be a &quot;sudden loss of confidence&quot; in Tether (USDT) stablecoin, according to JPMorgan analysts.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/95412\/bitcoin-tail-risk-tether-btc-usdt-jpmorgan-analysts","publishDate":"2021-02-19T06:00:18","id":3406,"type":null,"title":"Bitcoin&#x27;s tail risk could be &#x27;sudden loss of confidence&#x27; in Tether, say JPMorgan analysts","category":["BITCOIN"],"content":["A serious risk to bitcoin could be a \"sudden loss of confidence\" in Tether (USDT) stablecoin, according to JPMorgan analysts.","In a comprehensive, 86-page report published Thursday, JPMorgan analysts, led by the chair of global research Joyce Chang, said that if USDT were to see any adverse developments, it could impact bitcoin's price.","\"A sudden loss of confidence in USDT would likely generate a severe liquidity shock to Bitcoin markets, which could lose access to by far the largest pools of demand and liquidity,\" said the analysts.","Most bitcoin trading occurs via USDT, <a href=\"https:\/\/www.theblockcrypto.com\/post\/94431\/tether-usdt-market-cap-30-billion-investors-buying-bitcoin-btc\" data-v-f87c67ca=\"\">as The Block reported earlier this month<\/a> when the stablecoin's market capitalization crossed $30 billion. Citing data from asset manager NYDIG, JPMorgan analysts said around 50-60% of bitcoin trading has been happening via USDT since 2019.","USDT is issued by Tether and is pegged 1:1 to the U.S dollar. But since Tether is not subject to the same strict supervisory and disclosure regime as traditional commercial banks and it \"certainly does not have anything like deposit insurance,\" USDT presents a tail risk to bitcoin, according to the analysts.","Tail risk is the possibility that an unlikely event will occur and cause a considerable loss to an asset. It is a form of portfolio risk that arises when an investment moves more than three standard deviations from the mean above the risk of normal distribution.","JPMorgan analysts said Tether claims reserve assets of cash and equivalents equal to their outstanding liabilities \"but has famously not produced an independent audit and has claimed in court filings that they need not maintain full backing.\"","\"Thus, were any issues to arise that could affect the willingness or ability of both domestic and foreign investors to use USDT, the most likely result would be a severe liquidity shock to the broader cryptocurrency market which could be amplified by its disproportionate impact on HFT [high-frequency trading]-style market makers which dominate the flow,\" said the analysts.","Overall, JPMorgan's global research team believes that bitcoin is an \"economic side show,\" but is here to stay as an \"alternative\" currency.","Still, the analysts aren't sure whether crypto assets provide diversification benefits against assets such as equities.","\"Crypto assets continue to rank as the poorest hedge for major drawdowns in Equities, with questionable diversification benefits at prices so far above production costs, while correlations with cyclical assets are rising as crypto ownership is mainstreamed,\" said the analysts.","You can read <a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2021\/02\/JPM_Bitcoin_Report.pdf\" data-v-f87c67ca=\"\">the full report here<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USDT","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Joyce Chang","content":"PERSON"},{"type":"60%","content":"PERCENT"},{"type":"2019","content":"DATE"},{"type":"$30 billion","content":"MONEY"}],"hashtag":["BITCOIN","JPMORGAN","TETHER"],"authors":["Yogita Khatri","The Block"]}