{"summary":"The newly-appointed futurist shared some of his views with The Block on where crypto is headed, and why ARK&#x27;s moving now.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168907\/ark-invests-new-chief-futurist-sees-unprecedented-asset-value-appreciation-exclusive","publishDate":"2022-09-12T11:00:01","id":3407,"type":null,"title":"ARK Invest&#x27;s new chief futurist sees &#x27;unprecedented&#x27; asset value appreciation: Exclusive","category":["BLOCKCHAIN"],"content":["Cathie Wood's ARK Invest has seen its big bets on cryptocurrency and tech sour over the past year, but that's not deterring the asset manager from doubling down on risky assets.&nbsp;","The firm, which had $16.9 billion in assets under management as of their last quarterly 13-F filing, recently promoted its director of research Brett Winton to \"chief futurist\" as it scales up its research department, also promoting four analysts to director roles and hiring five research associates.&nbsp;","Blockchain technology combined with artificial intelligence, robotics, energy storage and genomic sequencing, will rise from less than 10% of the global public equity market capitalization to more than 60% by 2030, Winton said.","\"ARK will dimension the impact of this unprecedented technological boom as it transforms public equities, private equities, crypto assets, fixed income and the global economy,\" he added.","The newly-appointed futurist shared some of his views with The Block on where crypto is headed, and why ARK's moving now.","<strong data-v-f87c67ca=\"\">How do you explore predictions and possibilities, specifically in a market as volatile as crypto?<\/strong>","We really believe this is a new technological boom. This business cycle, with the converging technological platforms that are compounding on top of each other, is going to drive an unprecedented amount of asset value appreciation.","Longer-term forecasting is getting pulled into business results more quickly. So the importance of having a good quantified bracketed expectation for the future has never been more critical for investing and allocating resources. Specific to cryptocurrencies — and this is true across technologies — it's actually sometimes easier to do a medium-term forecast than it is to do a near-term forecast.","<strong data-v-f87c67ca=\"\">Why is that?<\/strong>","You could ask me what bitcoin's price is two days from now and that's not actually meaningful. Can you actually measure and project what the flows into the crypto asset space over the next five and 10 years might be? I think that's easier than predicting, \"OK, this is actually what the price response is going to be to Ethereum's merge.\" Because a lot of that is recursive, where the market has pre-anticipated a lot of it.","The more important variable for most investors is what is the ultimate appreciation potential of ethereum and bitcoin or crypto assets generally.","<strong data-v-f87c67ca=\"\">Speaking of The Merge, how do you think it will affect ethereum and bitcoin's value?<\/strong>","Bitcoin itself is best positioned to win a revolution in money. The conservatism of the protocol actually means that it's quite likely to supplant certainly second-tier currencies as a medium exchange over time. There's a perception in the marketplace that bitcoin and ethereum are in competition with each other and that is both untrue and actually even less true post-Merge.","It's clear to me that proof-of-work is a more robust mechanism for decentralization relative to proof-of-stake. So as ethereum transfers into proof-of-stake, there are all kinds of potential benefits and interesting things that spill off of that but it actually segregates the competitive space more.&nbsp;","<strong data-v-f87c67ca=\"\">Why don't you think bitcoin and ethereum are in competition?<\/strong>","Ethereum's promise is to transform the system of financial intermediaries and potentially — by providing digital ownership to all kinds of different assets — expand how much of the economy is financialized. Bitcoin's role in the world is to transform the system of money. There is some overlap between those.","The perception that ethereum is going to win in money is absolutely wrong. The move to proof-of-stake makes that less likely, not more. [With bitcoin], the value of that protocol will be the degree to which it becomes a truly global hard money that is accepted and desired as an alternative to fiat-controlled currencies.","<strong data-v-f87c67ca=\"\">Do you see that happening?<\/strong>","If you're in a market where the odds that the government does something to arbitrarily seize your assets are much higher, where the monetary price inflation is much more severe — which represents an everyday seizing of the purchasing power of the money that you've earned — it's absolutely critical.","The question is not \"Is it money today?\" The question is, \"Can you, with reasonable confidence, predict that its use as a money will increase over time and at what rate?\"","<strong data-v-f87c67ca=\"\">And your answer is yes?<\/strong>","Yes. And it will be increasingly used as a money. And that's the point. There's $100 trillion in monies out there and they're fragmented across all kinds of different sovereign (powers) for no good economic reason but for the political interest of the people that control this. This is a tool to erode those barriers.&nbsp;","<strong data-v-f87c67ca=\"\">How is the current crypto winter going to change the face of crypto?<\/strong>","Because it's a financialized system, it's gonna go through leverage cycles. It seems as if we have gotten past this leverage cycle and leverage cycles are useful for cleaning out the riffraff. The people that are building very useful products over time are going to enjoy appreciation.","Same on the investor side. If you take on leverage yourself, you're mechanically limiting the time horizon over what you need to realize some sort of return. In a volatile asset class, with still a lot of uncertainty as to exactly how the game board is even going to be set up, you actually want to reduce your mechanical time horizon shrinking as much as possible.","<strong data-v-f87c67ca=\"\">Do you believe that crypto will rise to 2021 values? What needs to happen?<\/strong>","Crypto will wildly surpass the 2021 levels, given enough time. There's a lot of legal, regulatory and really market development that still needs to occur and that is occurring. Over a reasonable time horizon, you're going to continue to see inflows from all different sorts of market participants. Yeah, crypto will well exceed it over the next five years.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$16.9 billion","content":"MONEY"},{"type":"Brett Winton","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"fiat","content":"ORGANIZATION"},{"type":"$100 trillion","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"2030","content":"DATE"},{"type":"60%","content":"PERCENT"},{"type":"Winton","content":"PERSON"}],"hashtag":["BITCOIN","CRYPTO","ETHEREUM"],"authors":["Catarina Moura","The Block"]}