{"summary":"The European Central Bank reveals five selected partners to design the digital euro prototype.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/170734\/amazon-among-five-companies-to-develop-digital-euro-prototype-for-the-ecb","publishDate":"2022-09-16T10:56:07","id":3409,"type":null,"title":"Amazon among five companies to develop digital euro prototype for the ECB","category":["CENTRAL BANKS"],"content":["<span data-v-f87c67ca=\"\">The European Central Bank (ECB) announced the selection of five new partners to support the development of a digital euro prototype. <\/span>","<span data-v-f87c67ca=\"\">Each of the companies will take on a different role in putting together the prototype. Among them is the tech giant Amazon, which will be responsible for developing e-commerce payments within the project.<\/span>","<span data-v-f87c67ca=\"\">Spanish bank CaixaBank will develop online peer-to-peer payments for a mobile application, while the French multinational payment service, Worldline, is responsible for the offline version. <\/span>","<span data-v-f87c67ca=\"\">Point of sale payments from the payer and payee are in the hands of the ECB-backed European Payment Initiative and the Italian paytech company, Nexi, respectively.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The ECB opened a call for partners at the end of&nbsp; April and received 54 respondents from the likes of national banks and multinational tech firms. The five chosen service providers were selected based on their compliance to “specific capabilities” which were an advantage on top of the basic criteria required.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The prototyping exercise is set to begin within the month of September and finish at the end of December.<\/span>","<span data-v-f87c67ca=\"\">This process forms part of an ongoing investigation phase spanning over two years. The ECB expects to complete this phase by March 2023 by evaluating the prototypes produced as well as the success of the collaboration between the partners.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The ECB launched its investigation into the digital euro in July 2021, without promising that it would issue the digital currency at the end.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"CaixaBank","content":"ORGANIZATION"},{"type":"Worldline","content":"LOCATION"},{"type":"Amazon","content":"LOCATION"},{"type":"ECB","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"European Central Bank (ECB","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"December","content":"DATE"},{"type":"March 2023","content":"DATE"},{"type":"July 2021","content":"DATE"},{"type":"Nexi","content":"ORGANIZATION"}],"hashtag":["ECB"],"authors":["Inbar Preiss","The Block"]}