{"summary":"Creditors claim the law firm was so closely involved with FTX that it should be held partially responsible for the exchange’s actions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277936\/ftx-creditors-file-class-action-against-bankruptcy-lawyers-over-ties-to-ftx-prior-to-its-collapse","publishDate":"2024-02-17T06:32:01","id":3412,"type":null,"title":"FTX creditors file class action against bankruptcy lawyers over ties to FTX prior to its collapse","category":["COMPANIES"],"content":["FTX’s bankruptcy law firm Sullivan and Cromwell is facing a <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.flsd.662461\/gov.uscourts.flsd.662461.1.0.pdf\" data-v-f87c67ca=\"\">class action<\/a> that alleges it was so closely involved with the exchange prior to its collapse that it should be held partially responsible for its actions.","The class action focuses on the number of times that S&amp;C worked as outside counsel for FTX prior to its collapse. Through these dealings, it alleges, the law firm gained knowledge of the exchange’s workings and ultimately supported it in its fraudulent behavior.","“While customers of FTX, Class Members, lost everything, S&amp;C was able to gain millions from the FTX fraud. S&amp;C served as primary legal counsel to FTX for the 16 months preceding FTX’s collapse, during which time S&amp;C billed around $8.5 million in fees,” it says.","The lawsuit alleges that after lawyer <a href=\"https:\/\/www.theblock.co\/post\/250891\/former-ftx-general-counsel-starts-his-own-law-firm\" data-v-f87c67ca=\"\">Ryne Miller<\/a> left S&amp;C and joined FTX as General Counsel in 2021, he pushed to send business to S&amp;C as outside counsel. It claims this resulted in 20 engagements, including FTX’s bid for the assets of crypto exchange Voyager and its acquisition of crypto exchange LedgerX.","It claims that S&amp;C represented a special purpose vehicle called Emergent, which was used to buy Robinhood stock with FTX customer money, while also representing former FTX CEO Sam Bankman-Fried himself.","The class action alleges, citing FTX insiders, that Miller became aware of the “back door” in FTX’s platform that enabled it to funnel FTX customer funds to Alameda and that he gave this information to multiple individuals at S&amp;C.","The lawsuit also notes the amount that S&amp;C has gained by overseeing the FTX bankruptcy proceedings.","“Since taking a leading role, S&amp;C’s income from matters related to FTX has surged, exceeding $180 million — or 10% of the total revenue the 900-lawyer firm publicly stated it collected in all of 2022 — with paralegals billing $595\/hr. and partners billing up to $2,165\/hr,” it says, <a href=\"https:\/\/news.bloomberglaw.com\/business-and-practice\/sullivan-cromwell-wins-big-in-ftx-silicon-valley-bank-wrecks\" data-v-f87c67ca=\"\">citing Bloomberg<\/a>.","S&amp;C did not immediately respond to a request for comment.","In January 2023, multiple U.S. Senators <a href=\"https:\/\/www.theblock.co\/post\/200542\/senators-voice-concerns-over-law-firms-role-in-ftx-bankruptcy\" data-v-f87c67ca=\"\">expressed concerns<\/a> that S&amp;C is not a disinterested party with respect to the exchange. At the time, they <span data-v-03de5780=\"\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">called for an independent examiner to oversee the investigation into the crypto exchange’s collapse.<\/span><\/span>","Around the same time, Bankman-Fried <a href=\"https:\/\/sambf.substack.com\/p\/ftx-pre-mortem-overview\" data-v-f87c67ca=\"\">claimed<\/a> the law firm, “was one of FTX International’s two primary law firms prior to bankruptcy, and was FTX US’s primary law firm,” highlighting that he used to work out of the law firm’s offices. He claimed the law firm pressured the exchange into bankruptcy and strong-armed him into naming its preferred CEO, John Ray III.","The issue was raised in a <a href=\"https:\/\/www.theblock.co\/post\/203953\/law-firm-sullivan-cromwell-to-face-scrutiny-in-ftx-bankruptcy-hearing-friday\" data-v-f87c67ca=\"\">bankruptcy hearing<\/a> in January 2023, where creditors claimed that S&amp;C could be a target for investigation with its own liability in the bankruptcy case. Despite objections, the judge approved the law firm to be retained for the proceedings. The following month, a request for an independent examiner was denied.","In January 2024, the Third Circuit Court of Appeals in Philadelphia ruled that FTX <a href=\"https:\/\/www.theblock.co\/post\/273614\/ftx-must-be-investigated-by-independent-examiner-court-rules\" data-v-f87c67ca=\"\">must be investigated<\/a> by an independent examiner. An investigation by John Ray III is not enough, and an independent probe might shed new light on crypto industry practices, one of the appellate judges wrote in a precedential opinion.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Cromwell","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$8.5 million","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"January 2024","content":"DATE"},{"type":"January 2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"the Third Circuit Court of Appeals","content":"ORGANIZATION"},{"type":"Ryne Miller","content":"PERSON"},{"type":"Miller","content":"PERSON"},{"type":"$2,165","content":"MONEY"},{"type":"John Ray III","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Emergent","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Philadelphia","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Sullivan","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"$180 million","content":"MONEY"},{"type":"$595","content":"MONEY"},{"type":"General Counsel","content":"ORGANIZATION"}],"hashtag":["FTX"],"authors":["Tim Copeland","The Block"]}