{"summary":"The Biden administration has formally nominated its pick for the Office of the Comptroller of the Currency.\nSaule Omarova has been the administration’s heir apparent for over a month. In that time, she has become the subject of a squall in the Senate, primarily focusing on her relationship to banks.\nHer existing public statements on crypto fall well into the party line that Democratic senators like Sherrod Brown and Elizabeth Warren have been promulgating recently, to the dismay of the crypto industry itself. ","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/123154\/biden-formalizes-nominee-to-lead-the-us-national-bank-regulator-what-does-she-think-about-crypto","publishDate":"2021-11-03T13:00:21","id":3412,"type":null,"title":"Biden formalizes nominee to lead the US national bank regulator. What does she think about crypto?","category":["Regulation"],"content":["<span data-v-f87c67ca=\"\">On Nov. 2, the Biden administration formalized Saule Omarova, a professor at Cornell’s Law School, as its nominee to lead the U.S. Office of the Comptroller of the Currency.<\/span>","<span data-v-f87c67ca=\"\">Omarova will still need to face confirmation, which will entail a series of hearings and a vote in a tightly locked Senate, none of which have been scheduled yet. While the administration announced its plan for the nomination in September, the formal process has now begun. Omarova's confirmation has, in the interval, become the epicenter of something of a political storm. <\/span>","<span data-v-f87c67ca=\"\">Republicans on the Senate Banking Committee have, in particular, been sounding the alarm as to tendencies they call “anti-bank.” <\/span><span data-v-f87c67ca=\"\">Sen. Pat Toomey, who leads the Senate Banking Committee’s Republicans, has <\/span><a href=\"https:\/\/www.banking.senate.gov\/newsroom\/minority\/toomey-on-senate-floor-ive-never-seen-a-more-radical-regulatory-nominee-than-saule-omarova\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">publicly called<\/span><\/a><span data-v-f87c67ca=\"\"> Omarova a radical candidate.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Omarova, who grew up in Kazakhstan and finished her undergrad at Moscow State University in 1989, shortly before the fall of the Soviet Union, authored a thesis titled “Karl Marx’s Economic Analysis and the Theory of Revolution in The Capital,” which Toomey has called on Omarova to publicize. Elsewhere, Sen. Sherrod Brown, chairman of the Senate Banking Committee, came to Omarova’s defense.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Before today, I thought, red scare McCarthyism was rightly relegated to the dustbin of history,” said Brown, in a statement. “Any American citizen who fled communist repression — whether it be FDIC Chair Jelena McWilliams or OCC nominee Saule Omarova — should be lauded for their courage and conviction.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But Toomey is not alone in his concerns. The Wall Street Journal’s editorial board <\/span><a href=\"https:\/\/www.wsj.com\/articles\/a-regulator-who-hates-banks-saule-omarova-socialist-central-bank-11635101487\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">subsequently called<\/span><\/a><span data-v-f87c67ca=\"\"> Omarova “a banking regulator who hates banks.”&nbsp;<\/span>","In a statement to The Block, a White House official said \"Saule Omarova is eminently qualified and was nominated for this role given her strong track record on regulation and strong academic credentials. The White House continues to strongly support this historic nomination.\"","<span data-v-f87c67ca=\"\">But what is the intersection between that role and crypto? Currently, under Acting Comptroller Michael Hsu, the OCC is the leading regulator of national banks. It took on a starring role within the crypto industry under the tenure of Brian Brooks, who pushed forward policies favorable to crypto’s role within the banking system. Critics accused Brooks of unilaterally undermining bank oversight.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In many ways, it was Brooks who first got the crypto industry’s attention on the OCC. Omarova’s thoughts on crypto will, consequently, be critical, both for the OCC’s independent ability to regulate the authorization of new national banking charters and for its roles in the President’s Working Group and the Financial Stability Oversight Board, which will be <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/122890\/us-treasury-releases-long-awaited-report-on-stablecoin-risk-features-request-for-new-laws\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">determining the fate of stablecoins<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","A spokesperson for Sen. Toomey wrote to The Block: “Professor Omarova has described cryptocurrencies as being ‘effectively untethered from . . . any productive activity in the real economy’ and ‘benefitting mainly the dysfunctional financial system we already have.’ This tells us everything we need to know about how she will seek to regulate digital assets if confirmed.”","<span data-v-f87c67ca=\"\">In 2019 <a href=\"https:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract_id=3224393\" data-v-f87c67ca=\"\">research<\/a> she wrote for Cornell, Omarova sought to demonstrate: <\/span>","<span data-v-f87c67ca=\"\">While that was research published back in 2019 — and therefore conducted well before — it’s a sentiment she <\/span><a href=\"https:\/\/twitter.com\/STOmarova\/status\/1390751410606723084\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">re-upped<\/span><\/a><span data-v-f87c67ca=\"\"> on Twitter in May in response to Goldman Sachs’ new cryptocurrency trading team. In June, she tweeted a line that <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/116692\/sen-elizabeth-warren-says-crypto-is-the-new-shadow-bank\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Senator Elizabeth Warren would later paraphrase<\/span><\/a><span data-v-f87c67ca=\"\">, writing: “Crypto was bound to become new 'shadow banking.'”<\/span>","","<span data-v-f87c67ca=\"\">In addition to suspicion towards crypto trading, Omarova’s views on a central bank digital currency line up more closely with proposals for FedAccounts that appeared in early versions of last year's pandemic-era stimulus legislation. <\/span>","<span data-v-f87c67ca=\"\">Just weeks ago, Vanderbilt Law Review published work by Omarova called “<\/span><a href=\"https:\/\/vanderbiltlawreview.org\/lawreview\/2021\/10\/the-peoples-ledger-how-to-democratize-money-and-finance-the-economy\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The People’s Ledger<\/span><\/a><span data-v-f87c67ca=\"\">” that pushes a vision of the Federal Reserve as a central public payment platform. It ruminates on the ability of CBDCs to disintermediate commercial banks — a prospect that obviously worries banks as well as those skeptical of the Fed’s ability to manage such a system.<\/span>","<span data-v-f87c67ca=\"\">In that article, Omarova points to the rise in cryptocurrencies as well as Reddit-fueled trading of so-called meme stocks as examples of a “broader quest for more equitable and inclusive <\/span><span data-v-f87c67ca=\"\">modes of finance.”<\/span>","<span data-v-f87c67ca=\"\">Omarova’s takeaway: “Ultimately, however, it takes a system to beat a system.”<\/span>","The OCC declined to comment on this article. Staffers for Senator Brown declined to go on the record when reached.&nbsp;"],"hashtag":["OCC","TRADFI BANKS"]}