{"summary":"A consultation on Britain’s proposed crypto regulation ends on April 30. The intention is to make the UK “a safe jurisdiction for cryptoasset activity.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/226800\/uk-crypto-regulation-law-brexit-andrew-griffith","publishDate":"2023-04-18T06:40:52","id":3413,"type":null,"title":"UK could use Brexit to make new crypto regulation","category":["GOVERNANCE"],"content":["The UK government will use Brexit to carve a different regulatory program for crypto that could come into law in the next 12 months, according to Andrew Griffith, economic secretary to the Treasury.","“We’ve got control back of our rulebook, not something the UK has had for decades,” <a href=\"https:\/\/www.cnbc.com\/2023\/04\/18\/britain-could-see-crypto-regulation-in-12-months-lawmaker-says.html\" data-v-f87c67ca=\"\">Griffith said in an interview with CNBC, referencing Britain's departure from the European Union<\/a>. “So we’ve got the ability to move in an agile and proportionate way. And I’m definitely keen we make the most of that opportunity.”","The <a href=\"https:\/\/www.gov.uk\/government\/news\/uk-sets-out-plans-to-regulate-crypto-and-protect-consumers\" data-v-f87c67ca=\"\">consultation period for Britain’s proposed crypto regulation ends on April 30<\/a> this year. The intention is to make Britain “a safe jurisdiction for cryptoasset activity to take place, fostering innovation and providing firms clarity over the planned regulatory framework.” The new law will particularly focus on “exchange activities, custody activities and lending activities.”","The EU is taking a different path. Its proposals for new <a href=\"https:\/\/eur-lex.europa.eu\/legal-content\/EN\/TXT\/?uri=CELEX%3A52020PC0593\" data-v-f87c67ca=\"\">regulation on Markets in Crypto-Assets (MiCA)<\/a> are currently more detailed. They will focus on stablecoins, central bank digital currencies (CBDCs), threats to financial stability and consumer protection.","Griffith said the UK's new crypto laws would run alongside traditional finance regulation. “Wherever possible, we want to see the same asset, the same transaction regulated in the same way. But there are some additional opportunities in the crypto asset or distributed ledger space and we want to take advantage of that,” Griffith told CNBC.","Prime Minister <a href=\"https:\/\/www.gov.uk\/government\/news\/government-sets-out-plan-to-make-uk-a-global-cryptoasset-technology-hub\" data-v-f87c67ca=\"\">Rishi Sunak said last year<\/a> that he wanted to make “the UK a global hub for cryptoasset technology”.","The crypto industry might not want to get too excited at the notion that the UK will have a comprehensive new regulatory framework for crypto by this time next year. The government began <a href=\"https:\/\/www.gov.uk\/government\/consultations\/cryptoasset-promotions\" data-v-f87c67ca=\"\">a review of crypto promotion and marketing<\/a> laws in 2020 and only published its <a href=\"https:\/\/www.gov.uk\/government\/consultations\/cryptoasset-promotions\/government-approach-to-cryptoasset-financial-promotions-regulation-policy-statement\" data-v-f87c67ca=\"\">proposed legislation<\/a> three years later in March of this year. The law is yet to be passed.","<strong data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">Related:<\/span><\/strong>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"April 30<\/a> this year","content":"DATE"},{"type":"European Union","content":"LOCATION"},{"type":"Griffith","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"Britain","content":"LOCATION"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"three years later","content":"DATE"},{"type":"Andrew Griffith","content":"PERSON"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Rishi Sunak","content":"PERSON"},{"type":"March of this year","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"Crypto","content":"LOCATION"}],"hashtag":["UK PARLIAMENT"],"authors":["Jim Edwards","The Block"]}