{"summary":"Square reported $306 million in bitcoin revenue via its Cash App for the first quarter of 2020\nThe company’s gross profit from bitcoin sales reached new highs, coming in at nearly $7 million in gross profit.","author":["Ryan Todd","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/64207\/square-cash-app-2020-q1","publishDate":"2020-05-06T16:15:15","id":3413,"type":null,"title":"Square&#x27;s Cash App shattered its quarterly bitcoin sales volume record in Q1 2020","category":["Bitcoin"],"content":["Square said Wednesday it generated $306 million in bitcoin revenue during the first quarter of 2020.","\"Bitcoin revenue generated gross profit of $7 million in the first quarter of 2020,\" the firm continued in its <a href=\"https:\/\/s21.q4cdn.com\/114365585\/files\/doc_financials\/2020\/Q1\/2020-Q1-Shareholder-Letter-Square.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">earnings release<\/a> to investors, which was released after the market close.&nbsp;","Square's gross profit from bitcoin sales nearly doubled from the last quarter (~90%), based on the results. The firm reported that volumes were up 72% quarter-over-quarter and 367% year-over-year.","","","Square said in the letter that April was an especially busy month for Cash App, noting:","<a href=\"https:\/\/www.theblockcrypto.com\/post\/59805\/square-says-bitcoin-engagement-on-its-cash-app-has-grown-in-recent-weeks-amid-period-of-market-volatility\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">As The Block reported last month<\/a>, Square's Cash App saw elevated bitcoin \"engagement\" amid the economic turmoil caused by the coronavirus pandemic and subsequent shutdowns ordered by state and local governments in the U.S.&nbsp;","\"Adoption and engagement of fractional equity investing in Bitcoin has accelerated in recent weeks given recent market interest and volatility,\" CFO Amrita Ahuja said during an investor day call in March.&nbsp;","The broader market volatility driven by the global pandemic has been a boon for both brokers and exchanges alike. As The Wall Street Journal reported at the end of April, brokers have seen <a href=\"https:\/\/www.wsj.com\/articles\/coronavirus-turmoil-free-trades-draw-newbies-into-stock-market-11588158001\" data-v-f87c67ca=\"\">a surge in new accounts and trading activities<\/a> as new accounts have flooded into the market.","TD Ameritrade announced that its retail clients opened a record 608,000 new funded accounts in the first quarter of 2020, with more than two-thirds of openings coming in March alone. E*Trade and Charles Schwab also reported new brokerage account records in the first quarter.","Last month, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/61590\/square-coronavirus-stimulus-cash-app\" data-v-f87c67ca=\"\">Square announced<\/a> that it was adding a feature to allow users to direct those stimulus payments to their Cash App accounts with the inclusion of traditional routing and bank account numbers accessible within user Cash App accounts.","On that point, Square said in the letter:","According to the latest investor letter, the growth in direct deposit usage accounted for a significant increase in the total cash balances held in customer Cash App accounts, which totaled more than $1.3 billion as of the end of April.&nbsp;"],"hashtag":["BITCOIN"]}