{"summary":"The fundraise values the Paris-based NFT startup at $4.3 billion.\nIt comes off a period of rapid growth for Sorare, which now boasts 600,000 registered users.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/118094\/fantasy-soccer-nft-sorare-scores-680-million-raise-softbank","publishDate":"2021-09-21T00:00:33","id":3414,"type":null,"title":"Fantasy soccer NFT platform Sorare scores $680 million raise led by SoftBank","category":["NFTs"],"content":["Sorare, a soccer-focused NFT trading platform, has announced a $680 million Series B fundraise led by SoftBank.","Rumours of the investment have been swirling <a href=\"https:\/\/www.businessinsider.com\/sorare-soccer-nft-funding-softbank-sequoia-2021-5?r=US&amp;IR=T\" data-v-f87c67ca=\"\">since May of this year<\/a>. Now finalized, the investment values Sorare at $4.3 billion.","Atomico, Bessemer Ventures, D1 Capital, Eurazeo, IVP and Liontree are all investing in the startup for the first time alongside SoftBank, with existing backers Benchmark, Accel and Headline also participating.","Sorare lets fans trade non-fungible token (NFT) trading cards of superstar players like Cristiano Ronaldo and Antoine Griezmann, which are underpinned by the Ethereum blockchain. Founded in 2018, the Paris-based startup has notched $150 million in cards sales so far this year.","The platform’s monthly active paying users grew by 34 times between the second quarter of 2020 and the second quarter of this year, with quarterly sales up 51 times over the same period. It currently boasts 600,000 registered users and has licensed players from over 180 soccer organizations, including Real Madrid, Liverpool and Juventus.","“Sorare’s game is born from our love for football and our expertise in tech. We saw the immense potential that blockchain and NFTs brought to unlock a new way for football clubs, footballers, and their fans to experience a deeper connection with each other,” said Nicolas Julia, CEO and co-founder of Sorare, in a statement.","The platform plans to use the funding injection to help it expand into other fantasy sports; for hiring; marketing campaigns with partners and athletes; and to open its first office in the United States.","Over the course of this year, SoftBank – primarily through its Vision Fund 2 – has backed a host of fintech firms.","Its recent bets include the $33 billion neobank <a href=\"https:\/\/www.theblockcrypto.com\/linked\/111469\/revolut-raises-800-million-33-billion-valuation\" data-v-f87c67ca=\"\">Revolut<\/a>; <a href=\"https:\/\/www.theblockcrypto.com\/post\/111821\/drivewealth-set-to-raise-up-to-400-million-from-softbank-and-insight-partners-sources\" data-v-f87c67ca=\"\">DriveWealth<\/a>, an infrastructure firm supporting fractionalized investing in U.S. stocks; Nigerian-based payments firm <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2021-08-23\/softbank-bets-on-fintech-startup-opay-at-2-billion-valuation\" data-v-f87c67ca=\"\">OPay<\/a>; and, through its Latin America Fund, Brazilian crypto exchange <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2021-08-23\/softbank-bets-on-fintech-startup-opay-at-2-billion-valuation\" data-v-f87c67ca=\"\">Mercado Bitcoin<\/a>.","Marcelo Claure, CEO of SoftBank Group International and COO of SoftBank Group, said Sorare “sits at the intersection of two really exciting industries in digital collectibles and fantasy sports.”&nbsp;","“It’s evident from Sorare’s amazing growth this year alone that football fans around the world have been eagerly waiting for the ‘game within the game’ that Sorare provides,” he added."],"hashtag":["SORARE"]}