{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley. They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/13194\/bittrex-impostures-no-more","publishDate":"2019-02-24T12:00:42","id":3416,"type":null,"title":"Bittrex impostures no more?","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR”, Palley summaries are “SDP\", guest post from Drew Hinkes is \"DH\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]Bittrex Inc. v. Amanda Lomendres Lopes, 2019 WL 6562239 (UDRP-ARB Dec.)[DH]<br data-v-f87c67ca=\"\">\n<\/strong><\/em>","In the early 1990s, Federal Judge Frank Easterbrook and Harvard Law Professor Lawrence Lessig (he who brought us “Code is Law”) famously disagreed about whether law schools should teach students about the emerging “Law of Cyberspace.” Judge Easterbrook thought that industry-specific classes (<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">i.e.<\/em>&nbsp;“The Law of the Horse”) were “doomed to be shallow and miss unifying principles,” and that law schools should instead teach “subjects that could illuminate the entire law,” like torts, property, and contracts, and&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">then<\/em>&nbsp;teach students to apply those general laws to novel factual situations. Professor Lessig suggested that there was value in studying the new aspects of cyberspace (privacy, IP rights,&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">etc.<\/em>…) that would allow students to consider broader concepts of how law and regulation actually work. Although their dispute focused on what law schools should teach, it highlighted a broader question- would the Internet require radical new legal approaches, or mere adaptations of existing law? Both were right in a sense - although the Internet spawned innovative privacy and IP-related laws, most contract, property, and tort laws work on the Internet the same way they do offline.","One area that required a new legal approach was resolving disputes over web site domain names. Domain names are a new type of property created by the Internet that are globally accessible, adding to the complexity of the issue. Disputes over domain names would be common and needed to be resolved on a global basis.","The solution emerged in the form of Uniform Domain Name-Dispute Resolution Policy (UDRP) established by the Internet Corporation for Assigned Names and Numbers (ICANN), an SRO that sets standards for how the Internet functions. ICANN commissioned the United Nations World Intellectual Property Organization (WIPO) to report on the Trademark Dilemma. On April 30, 1999, WIPO&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.wipo.int\/export\/sites\/www\/amc\/en\/docs\/report-final1.pdf\" target=\"_blank\" rel=\"nofollow noopener noreferrer\" data-href=\"https:\/\/www.wipo.int\/export\/sites\/www\/amc\/en\/docs\/report-final1.pdf\" data-v-f87c67ca=\"\">recommended<\/a>&nbsp;a “mandatory administrative procedure concerning abusive [domain name] registrations”, which would allow for a “neutral venue in the context of disputes that are often international in nature.”","Here’s the process created by the UDRP. First, domain registrars require domain name registrants to agree to arbitration, and to agree that they will not use the domain name to infringe on any other party’s rights. The Complainant, claiming that a domain name is infringing, can file its claim before one of five arbitration organizations to start a proceeding to decide who should own the domain name. To prevail on its claim, the complainant must show that the (a) domain name is confusingly similar or identical to its protected trademark \/service mark, (b) registrant has no rights\/legitimate interests in the domain name, and (c) the domain name was registered and is being used in bad faith.","The registrant can defend by showing (a) use or preparations for use of the domain or a name corresponding to the domain name in connection with a legitimate offering of goods and services before the registrant was notified of the dispute, (b) common knowledge of the registrant being known under the domain name, even absent trademark \/service mark, or, (c) a legitimate noncommercial or fair use of the domain name, with no intent for commercial gain to misleadingly divert consumers or tarnish the Complainant’s trademark \/service mark. The arbitrator may rule for registrant and deny any relief, or rule for the complainant and order the domain registrar to either cancel the domain registration or transfer the domain to the complainant.","A party who loses a UDRP proceeding may still appeal the arbitration outcome in court, or — in the US- file an independent claim under the Anticybersquatting Consumer Protection Act. Most cases are resolved by UDRP arbitration. (Also, crypto world, take note: Here’s a non-governmental entity recognizing an emerging legal problem and implementing its own effective solution with buy in from necessary intermediaries.)","Recently, crypto exchange Bittrex filed a claim of infringement against Lopes, who registered&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"http:\/\/www.bittrex-es.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\" data-href=\"http:\/\/www.bittrex-es.com\/\" data-v-f87c67ca=\"\">www.bittrex-es.com<\/a>. Bittrex alleged that the domain name is confusingly similar to Bittrex’s web site,&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"http:\/\/www.bittrex.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\" data-href=\"http:\/\/www.bittrex.com\/\" data-v-f87c67ca=\"\">www.bittrex.com<\/a>, that Bittrex owns the trademark for Bittrex, and that the domain was used for a phishing scheme. The arbitrator found that Bittrex made out a&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">prima facie&nbsp;<\/em>case, and then shifted the burden of proof to registrant Lopes — who failed to respond. (It’s usually smooth sailing when you have competent counsel and the opposing party doesn’t appear to oppose). The arbitrators in this case found that:","Game, set, match, Bittrex. The arbitrator ordered the domain transferred to Bittrex’s control.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part II of this week's analysis,&nbsp;Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"WIPO","content":"ORGANIZATION"},{"type":"Drew Hinkes","content":"LOCATION"},{"type":"UDRP","content":"ORGANIZATION"},{"type":"Amanda Lomendres Lopes","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"April 30, 1999","content":"DATE"},{"type":"SDP","content":"ORGANIZATION"},{"type":"Bittrex","content":"PERSON"},{"type":"Bittrex","content":"LOCATION"},{"type":"Lopes","content":"PERSON"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"},{"type":"Dec.","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"]Bittrex Inc.","content":"ORGANIZATION"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"Easterbrook","content":"PERSON"},{"type":"Frank Easterbrook","content":"PERSON"},{"type":"ICANN","content":"ORGANIZATION"},{"type":"Harvard Law","content":"ORGANIZATION"},{"type":"Lessig","content":"PERSON"},{"type":"early 1990s","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Lawrence Lessig","content":"PERSON"},{"type":"Trademark Dilemma","content":"ORGANIZATION"},{"type":"Palley","content":"PERSON"},{"type":"Internet Corporation for Assigned Names","content":"ORGANIZATION"},{"type":"United Nations World Intellectual Property Organization (WIPO","content":"ORGANIZATION"},{"type":"Cyberspace","content":"LOCATION"}],"hashtag":["INTERNET"],"authors":["Contributor Network","The Block"]}