{"summary":"Cryptocurrency custodian Anchorage has acquired a data analytics firm, Merkle Data, for an undisclosed amount\nThe firm is also launching a brokerage service for its institutional clients\nAs competitions in the crypto custody market heat up, custodians like Anchorage are expanding its offerings from custody to staking, trading, lending, other areas of financial services. ","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/53116\/crypto-custodian-anchorage-acquires-analytics-firm-and-launches-brokerage","publishDate":"2020-01-15T13:32:58","id":3416,"type":null,"title":"Crypto custodian Anchorage acquires analytics firm and launches brokerage","category":["Custody"],"content":["Cryptocurrency custodian Anchorage has written its first acquisition, buying data analytics company Merkle Data for an undisclosed amount.&nbsp;","<a href=\"https:\/\/medium.com\/anchorage\/trading-announcement-9f2c047d2818\" data-v-f87c67ca=\"\">Announcing<\/a> the news on Wednesday, the San Francisco-based firm said it is also launching a brokerage service – dubbed Anchorage Trading – for its institutional clients. The new service lets investors store their cryptocurrencies with Anchorage in order to directly trade from its platform and charges a 10 basis point flat fee per trade.&nbsp;&nbsp;","Founded in 2018, Merkle Data helps clients detect manipulative behaviors and other risks in the crypto market. Anchorage said it has already integrated Merkle Data's product to its new trading feature.&nbsp;","“Customer demand drives the market, and institutional investors want a single solution for all their crypto needs: custody, trading, staking, voting, and more. Our goal is for Anchorage to be that solution. Different providers may take different paths to meet customer demand, but given the current fragmentation across the B2B crypto marketplace, we expect to see further consolidation,\" said Anchorage CEO Nathan McCauley.&nbsp;","This move places the startup in direct competition with crypto brokers like Tagomi and custodians that offer trading services like BitGo.","All three firms have raised big rounds from well-known venture funds. Anchorage <a href=\"https:\/\/techcrunch.com\/2019\/07\/10\/anchorage-cryptocurrency-security\/\" data-v-f87c67ca=\"\">closed<\/a> a $40 million Series B in July last year, backed by Blockchain Capital, Visa, and Andreessen Horowitz; Tagomi <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2019-03-04\/crytpo-brokerage-tagomi-gets-12-million-in-second-funding-round\" data-v-f87c67ca=\"\">raised<\/a> a total of $28 million from Paradigm, Pantera Capital, and others; and BitGo is <a href=\"https:\/\/www.bitgo.com\/marketing\/img\/pressRelease\/BitGo_10-18-18_Press_Release.75d60b1184a03e29.pdf\" data-v-f87c67ca=\"\">backed<\/a> by Goldman Sachs, Galaxy Digital Ventures, Digital Currency Group, and others.&nbsp;","In December, Tagomi slashed its trading fees to a 10 basis point flat rate, similar to Anchorage.&nbsp;","Competition in the crypto custody market is&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/daily\/47036\/bakkts-custody-ambitions-could-trigger-market-consolidation\" data-v-f87c67ca=\"\">heating up<\/a> with the entrance of financial services giants like Fidelity and the Intercontinental Exchange (ICE)-backed Bakkt."],"hashtag":[]}