{"summary":"Logan Paul was shamed for promoting NFT project CryptoZoo as a fun game without building it. The community made one anyway.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/218751\/degenzoo-used-ai-to-create-logan-pauls-nft-game-without-him","publishDate":"2023-03-10T09:00:53","id":3417,"type":null,"title":"DegenZoo used AI to create Logan Paul’s NFT game without him","category":["CRYPTO ECOSYSTEMS"],"content":["It started with an angry tweet.","“It takes 30 days to build CryptoZoo. To prove that I will build: CryptoPoo $POO in less,” <a href=\"https:\/\/twitter.com\/czdaomaker\/status\/1611402812960686093\" data-v-f87c67ca=\"\">tweeted<\/a> Chris Zaknun, the CEO of crypto fundraising platform DAO Maker, in January.","His outburst was in reaction to Logan Paul’s NFT project CryptoZoo, a game that Paul <a href=\"https:\/\/www.youtube.com\/watch?v=rqrH7TbruZA\" data-v-f87c67ca=\"\">promised<\/a> would be “really fun” but one that was never fully developed — and turned into a real mess for everyone involved. Paul blamed the developers for running off with the code, while the developers claimed Paul never paid them. It ended in a back-and-forth with another YouTuber called Coffeezilla, culminating in a recent <a href=\"https:\/\/twitter.com\/LoganPaul\/status\/1613961266984255515\" data-v-f87c67ca=\"\">apology<\/a> by Paul and a promise to pay everyone back (which hasn’t happened yet, <a href=\"https:\/\/www.youtube.com\/watch?v=RbPJD4Wh-l8&amp;t=68s\" data-v-f87c67ca=\"\">according<\/a> to Coffeezilla).","Zaknun’s original tweet suggested that he wanted to build a parody version of the CryptoZoo game, purely to make a point that — regardless of the issues with the game’s developers — Paul could have managed to build it anyway.","Two months later and Zaknun is almost ready to release his version of the game, which was built in a month and has gone through a month of testing. He’s hoping to put it live next week. Only, it’s no longer a parody, it's been renamed DegenZoo and he reckons it actually has potential to gain traction.","“I hope that the animals will become a major NFT collection, that people play the game until level 3 is all played out,” said Zaknun in an interview.","DegenZoo is raising funds through Zaknun’s main project DAO Maker. Here, anyone can fork over a few hundred dollars of the project’s native DAO token and chosen parties can swap their DAO tokens for DegenZoo’s native token DZOO. Parties will be judged and selected based on their on-chain histories. Those who bought into the original CryptoZoo project are receiving a higher priority in the token sale.","In many ways, the game is similar to Paul’s idea: You buy eggs, which hatch into random animals. Then you can combine these animals and hope to make money through doing so.","But there are a few differences. Instead of matching two animals and having their features combine into one bizarre hybrid — something Zaknun says is a bad idea because the number of possible combinations would be incredibly high — the game has one animal eat the other (smaller) one.&nbsp;","This design was built to reflect what happens in real life, with actual predators. When this happens, the bigger animal is leveled up, and this can be done twice. The owner can choose to burn the NFT and will receive more tokens, depending on how high it has been leveled up to and how rare it is.","The overall idea is that players can choose to either level up their NFTs and eventually burn them, to try to generate larger token multipliers, or to sell the NFTs on a marketplace. Whichever they think is the most profitable strategy.","“The game is to make the most money,” said Zaknun. “Every crypto game is about making money.”","Still, Zaknun sees a greater purpose here. When the NFTs are burned, “you get this horrifying blood splash to reflect the idea that one more animal died to human greed,” he said. This is designed to represent the impact of capitalism on animals; the more NFTs are burned, the more it will reflect how many species have been pushed to extinction.","With that stance in mind, he said all profits from the project — through a 2.5% royalty fee —&nbsp;will go to charity.","Zaknun said the team of six who built DegenZoo in 30 days was highly experienced, including the DAO Maker CTO and a former senior developer at MakerDAO (a different project). He also said that it wouldn’t have been possible to build the game in its current form so quickly without the use of AI.","“The AI; it’s crazy,” Zaknun said, when asked about the biggest learning experience from the project. “I really think people who do not embed AI into everything they do are not going to be competitive.”","He said AI was used to generate the images. He created a rough template to give the images the same look and feel and then handed the process of generating the 1,200 images (that make up the 40,000-strong NFT collection) over to the community. For this, he used Midjourney, but he said he didn’t look into whether there would be any issues with commercial use of images generated through it.","<span data-v-f87c67ca=\"\">An example of the AI-generated animals used in the game. Image: DegenZoo.<\/span>","Beyond this, Zaknun said he used AI in spreadsheets to quickly translate messages into multiple languages. These would then go out to the community forums focused on different countries. He said the community used AI to generate tweets and content used to promote the project.","The only thing AI wasn’t used for was the code itself. He said it may have been used for code review, but it wasn’t used for any of the code related to the project’s smart contracts.","The biggest challenge with building this project wasn’t the time pressure but creating a way to generate on-chain randomness, Zaknun said.&nbsp;","Randomness is important for the project because when someone turns an egg into an NFT, they need to end up with a random NFT. But if all the data was on-chain, it would be possible to work out which NFT would be generated with each egg and someone could choose to only buy the eggs that would produce the rarest NFTs.","One option to solve this would be to use the Chainlink oracle service, which can provide a random number generator. Still, Zaknun said this would have too expensive for the project because it’s built on the Ethereum mainnet and the transaction fees would add up.","Instead, he said, the project has its own randomness function that’s based on data produced by the wallet claiming the NFT. This should go some way in thwarting those trying to game the system, as wallets can’t really compete with each other since they would have different results.&nbsp;&nbsp;","That said, he acknowledged that it’s possible big Ethereum validators might find an edge here. He said it might be possible they would be able to work out which eggs to hatch that would give them the greatest rewards. But he dismissed the notion.&nbsp;","“I think the Ethereum validators have better things to do than play my game,” he said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DAO Maker CTO","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Paul","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Zaknun","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"$POO","content":"MONEY"},{"type":"2.5%","content":"PERCENT"},{"type":"Chainlink oracle","content":"ORGANIZATION"},{"type":"Logan Paul","content":"LOCATION"},{"type":"Chris Zaknun","content":"PERSON"},{"type":"Paul’s","content":"PERSON"}],"hashtag":["ETHEREUM"],"authors":["Tim Copeland","The Block"]}