{"summary":"Square’s Cash App brought in $3.51 billion in bitcoin revenue during the first quarter of 2021, according to Thursday’s earnings release.\nThe firm made $75 million of bitcoin gross profit during the same period.\n“Bitcoin revenue and gross profit benefited from a year-over-year increase in the price of bitcoin, bitcoin actives, and growth in customer demand. In future quarters, we recognize that bitcoin revenue may fluctuate as a result of changes in customer demand or the market price of bitcoin,” the firm said.","author":["Michael McSweeney","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/104136\/square-reports-3-51-billion-in-bitcoin-revenue-via-its-cash-app-for-first-quarter-of-2021","publishDate":"2021-05-06T16:18:56","id":342,"type":null,"title":"Square reports $3.51 billion in bitcoin revenue via its Cash app for first quarter of 2021","category":["Bitcoin"],"content":["Square hauled in $3.51 billion in bitcoin revenue during 2021's first quarter, according to Thursday's earnings release.","That resulted in $75 million in gross profits during the same period. On a broader scale, Square said it made $964 million in gross profits for the period, meaning that the gross profits from its bitcoin offering contributed 7.7% to the total. The Q1 total exceeds Q4 2020's total of $1.76 billion in bitcoin revenue.&nbsp;","","","\"Bitcoin revenue and gross profit benefited from a year-over-year increase in the price of bitcoin, bitcoin actives, and growth in customer demand. In future quarters, we recognize that bitcoin revenue may fluctuate as a result of changes in customer demand or the market price of bitcoin,\" the firm <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1512673\/000119312521153261\/d180447dex991.htm\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">said<\/a> in materials published.","As the firm noted:","In the release, Square also highlighted the performance of the bitcoin investment holdings it <a href=\"https:\/\/www.theblockcrypto.com\/post\/80175\/jack-dorsey-square-purchases-50-million-worth-of-bitcoin\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">previously<\/a> <a href=\"https:\/\/www.reuters.com\/technology\/square-puts-skin-game-with-170-million-more-bitcoin-buy-2021-02-23\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">obtained<\/a>.","\"In the fourth quarter of 2020 and first quarter of 2021, we invested $50 million and $170 million, respectively, in bitcoin. As an indefinite-lived intangible asset, bitcoin is subject to impairment losses if the fair value of bitcoin decreases below the carrying value during the assessed period. In the first quarter, we recognized a bitcoin impairment loss of $20 million on our bitcoin investment. As of March 31, 2021, the fair value of our investment in bitcoin was $472 million based on observable market prices, which is $272 million greater than the carrying value of the investment.\"","<em data-v-f87c67ca=\"\">This story is developing and will be updated with additional information.<\/em>","&nbsp;"],"hashtag":["BITCOIN"]}