{"summary":"Mining difficulty jumped 9.95% on Friday, as the network hashrate rose over 300 EH\/s.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/214589\/mining-difficulty-up-9-95-with-more-machines-coming-online-amid-recent-rally","publishDate":"2023-02-24T20:45:39","id":3420,"type":null,"title":"Mining difficulty up 9.95% with more machines coming online amid recent rally","category":["CRYPTO INFRASTRUCTURE"],"content":["Bitcoin's mining difficulty has increased by 9.95% after the latest adjustment, according to an update posted Friday on BTC.com.","More machines have been coming online, likely due in part to the recent rally in bitcoin prices, combined with declining power costs, which have provided some much-needed relief for struggling miners.","Mining difficulty refers to the complexity of the computational process used in mining, and it adjusts about every two weeks (or every 2,016 blocks) in sync with the network's hashrate.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoins-hash-rate-daily\/embed\" title=\"Bitcoin's Hash Rate (EH\/s, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The network's global hashrate temporarily jumped over 320 EH\/s this week, according to data compiled by The Block Research.","\"Network hashrate continues to march upwards, as more efficient machines come to market, electricity rates fall, infrastructure gets built out and mining economics improve with Bitcoin price and ordinal transaction fees,\" Luxor COO Ethan Vera said.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoin-miner-revenue-daily\/embed\" title=\"Bitcoin Miner Revenue (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Even as miners benefit from improved economics, they will likely be offset by increased difficulty, which has jumped for the third time this year.","\"We expect hashprice to trade in a tight band of $70 to 90\/PH\/Day as increases in bitcoin price are offset by gains in network difficulty and the network settles at new equilibrium prices,\" Vera said.","Hashprice is a metric coined by Luxor that refers to revenue miners earn from a unit of hashrate over a specific timeframe.","Investment firm D.A. Davidson said in a note recently that it would remain \"cautious\" in light of the increased competition in the industry.","\"We continue to lean on miners with low-cost power, funded growth plans, and ample liquidity to capitalize on the impending shakeout,\" it said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"9.95%","content":"PERCENT"},{"type":"Ethan Vera","content":"PERSON"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"D.A. Davidson","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Luxor","content":"LOCATION"},{"type":"$70","content":"MONEY"},{"type":"Vera","content":"PERSON"}],"hashtag":["MINING COMPANIES"],"authors":["Catarina Moura","The Block"]}