{"summary":"Blockstack is transferring 100 million Stacks (STX) tokens to the Stacks Foundation to decentralize its network.\nUltimately, the effort seems to be aimed at removing the “security” tag of STX tokens.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/74523\/blockstack-transferring-100-million-stacks-tokens-stacks-foundation","publishDate":"2020-08-11T05:05:09","id":3421,"type":null,"title":"Blockstack is transferring 100 million Stacks tokens to the Stacks Foundation to decentralize its network","category":["Layer 1s"],"content":["Muneeb Ali's blockchain project <a href=\"https:\/\/www.theblockcrypto.com\/post\/74523\/blockstack-transferring-100-million-stacks-tokens-stacks-foundation\" data-v-f87c67ca=\"\">Blockstack<\/a> is transferring 100 million Stacks (STX) tokens to the Stacks Foundation to decentralize its network.","The tokens are currently worth about $27 million. <a href=\"https:\/\/www.theblockresearch.com\/blockstack-wants-to-build-a-new-internet-for-decentralized-applications-10455\" data-v-f87c67ca=\"\">Blockstack<\/a> is also offering $950,000 worth of loan to the foundation for meeting working capital requirements, according to a <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1693656\/000119312520214222\/d10114d1u.htm\" data-v-f87c67ca=\"\">form filed<\/a> with the U.S. Securities and Exchange Commission (SEC) on Monday.","Ali <a href=\"https:\/\/blog.blockstack.org\/blockstack-pbc-stacks-foundation-contribution\/\" data-v-f87c67ca=\"\">said<\/a> the foundation would have \"complete control\" over <a href=\"https:\/\/www.theblockcrypto.com\/post\/37344\/japanese-internet-giant-recruit-holdings-makes-strategic-investment-in-blockstack\" data-v-f87c67ca=\"\">Blockstack<\/a> assets, including tokens and I.P. rights for the Stacks 2.0 blockchain software, and \"complete discretion\" over their subsequent administration, development, and deployment.","\"We believe that for us to be successful in our mission to build a user-owned internet, the infrastructure underlying the Stacks ecosystem cannot be controlled or significantly influenced by a single party,\" said Ali.","The Stacks Foundation is a non-profit organization that <a href=\"https:\/\/forum.blockstack.org\/t\/stacks-foundation-developing-governance-for-blockstack\/10335\" data-v-f87c67ca=\"\">was set up<\/a> in February of this year to develop governance of the project. \"The Stacks Foundation should be a long-term, permanent home for Blockstack-related governance,\" <a href=\"https:\/\/www.theblockresearch.com\/blockstack-2q19-update-estimated-runway-until-end-of-2021-or-more-seems-unlikely-given-rapidly-growing-expenses-42584\" data-v-f87c67ca=\"\">Blockstack<\/a> said at the time. Blockstack itself is a public-benefit corporation, with a traditional corporate goal of maximizing profit for shareholders. Ali said transferring assets to the non-profit foundation would help ensure that the Stacks ecosystem reaches its full potential.","Stacks tokens are currently treated as securities in the U.S. since they are SEC-qualified tokens. Ali, however, recently said that the tokens wouldn't have to be treated as securities forever. \"The board of Blockstack PBC will periodically consider if the <a href=\"https:\/\/www.theblockresearch.com\/blockstack-airdrop-bringing-token-dilution-and-maybe-user-adoption-43161\" data-v-f87c67ca=\"\">Blockstack<\/a> network is decentralized enough for Stacks to be treated as non-security in the U.S.,\" Ali <a href=\"https:\/\/www.theblockcrypto.com\/post\/63540\/blockstacks-revenue-declined-37-last-year-due-to-lower-stacks-token-sales\" data-v-f87c67ca=\"\">said<\/a> at the time.","As and when Stacks tokens get a non-security tag, they could see a listing on U.S. crypto exchanges, who have generally shied away from listing tokens that are deemed as securities. Stacks tokens are currently listed on Binance, KuCoin and Hoo exchanges, according to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/blockstack#markets\" data-v-f87c67ca=\"\">Coingecko<\/a>."],"hashtag":[]}