{"summary":"The comment window for FinCEN’s so-called self-hosted wallet regulations closed on Monday night\nThe development comes as the Treasury Department moves to enact major components of President Joe Biden’s domestic policy agenda\nStill, FinCEN appears as focused as ever on the issues it says are posed by cryptocurrencies.","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/99898\/what-comes-next-for-the-us-treasury-departments-plans-to-monitor-crypto-wallets","publishDate":"2021-03-30T18:50:38","id":3422,"type":null,"title":"What comes next for the US Treasury Department&#x27;s plans to monitor crypto wallets?","category":["Regulation"],"content":["Initially delayed by mass outcry and a change in the presidential administration, the U.S. Treasury has once again <a href=\"https:\/\/www.regulations.gov\/document\/FINCEN-2020-0020-0001\" data-v-f87c67ca=\"\">closed the window<\/a> to send in comments on a now-notorious proposal focused on peer-to-peer crypto transactions.&nbsp;","Yet because it's tied up distributing billions of dollars in stimulus funds and assembling the contours of President Joe Biden's domestic policy agenda, the new leadership at the Treasury Department appears less interested in rushing new rules forward for the crypto industry.&nbsp;","The saga dates back to the tail end of the Trump administration. Then-Secretary of the Treasury Stephen Mnuchin <a href=\"https:\/\/www.theblockcrypto.com\/linked\/88511\/fincen-proposes-new-kyc-for-crypto-wallets\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">advanced a rule proposal<\/a> through the Financial Crimes Enforcement Network (FinCEN) that would require crypto exchanges to apply Bank Secrecy Act scrutiny to transfers from their platforms to so-called self-hosted wallets. Every transaction valued at over $10,000 would require a report to U.S. authorities, while the exchange itself would need to maintain personal records of ownership to any off-exchange wallet that exceeded $3,000 in value.","The change would, in effect, deputize crypto exchanges in their bid to apply more oversight on crypto transactions. Regarding the approach, Congressman Warren Davidson told The Block: “Treasury — and the federal government in general — if they can’t be the intermediary... they can make an intermediary which effectively acts as a proxy for them.”&nbsp;","The $3,000 requirement was especially controversial, as it is based on a FATF \"travel rule\" threshold that effectively assumes all crypto wallets to be foreign transfers until proven otherwise.","FinCEN first posted those rules right before the 2020 holiday season and gave the public just 15 days to respond — far shorter than the traditional 60, even when those days don't coincide with traditional vacation times. Many saw the rushed timeframe as an effort to sneak past industry stakeholders and beat the clock on the incoming Biden administration. Kristin Smith, executive director of the Blockchain Association, told The Block:","<a href=\"https:\/\/www.theblockcrypto.com\/daily\/93691\/wonk-talk-jerry-brito-fincen-crypto-rule\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Broad pushback<\/a> from the crypto industry and the general chaos of Washington in January put the Mnuchin-era proposal on hold. Biden further stymied it by calling for a general freeze on new rulemaking in the interval before his appointees could take the reins.","Once the Senate confirmed former Federal Reserve chairwoman Janet Yellen as Mnuchin's replacement, the proposal returned, much to the industry's chagrin. The new Treasury approach was less rushed, leaving the proposal open for the full 60 days of public commentary. The 60-day window ended Monday night.","The Treasury Department has not had time to respond to commentary from either round of responses. So the question is, has anything really changed?&nbsp;","FinCEN, notably, has not. A Mnuchin-era hire, Director Kenneth Blanco has stayed on during the transition and remains at the helm of the anti-money laundering watchdog. Just this past Friday, FinCEN <a href=\"https:\/\/www.fincen.gov\/sites\/default\/files\/2021-03\/FinCEN%20IH%20Prgm%20Public%20Report%20508C.pdf\" data-v-f87c67ca=\"\">published notes<\/a> from its \"Innovation Hours\" program. The program focuses heavily on \"convertible virtual currencies,\" or CVCs, which in some ways reinforces the office's defensive posture when it comes to crypto. The most recent IH notes promised that \"FinCEN will host additional periodic workshops to facilitate targeted innovation focused on specific threats and vulnerabilities of the U.S. and global financial system, particularly in the area of CVC.\"","FinCEN is, however, looking elsewhere, with the need to implement major changes to AML regimes embedded in the National Defense Authorization Act, which passed on New Year's Day.","Still, the Treasury Department does not make new rules on the basis of FinCEN's priorities alone. While Yellen is <a href=\"https:\/\/www.theblockcrypto.com\/linked\/95667\/yellen-bitcoin-effiency-comments-cbdc\" data-v-f87c67ca=\"\">hardly a crypto fan<\/a>, the Treasury's agenda has changed. The Treasury's flurry of activity in managing the American Rescue Act has kept it busy in recent days, and indications of an ambitious infrastructure program from the Biden White House all suggest that the months ahead will stay that way. But, more broadly, Yellen's agenda appears more focused in domestic financial concerns rather than shoring up hypothetical leaks in the US's capital controls.","Among the industry, some see promise in the simple fact that Yellen does not seem as dogmatically interested in the proposed rules in the same manner as Mnuchin. Sources instead point to alternatives that open ledgers present for any potential investigations into specific clients, which would be possible without exchanges trading volleys of personal client information with every blockchain transaction.","“When it’s cash, there’s no third party there,\" Davidson told The Block. \"That’s the permissionless nature of cash. You don’t have the audit trail that the federal government wants. With blockchain, you have an inherent audit trail, but you preserve some privacy.”","The Blockchain Association's Graham Newhall told The Block:","On this point, FinCEN seems set to come around as well. The recent Innovation Hours notes also said: \"The IH Program has confirmed there are various solutions already available for many of the AML\/CFT challenges that financial institutions face — particularly supporting compliance with existing funds transfer and recordkeeping requirements for convertible virtual currency exchangers.\""],"hashtag":["JANET YELLEN"]}