{"summary":"Bakkt’s consumer app is set to roll out in 2020\nDuring The Block’s inaugural Davos event, Bakkt president Adam White said the app would possibly support cryptocurrencies, as well as equities and loyalty rewards","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/53745\/bakkts-consumer-app-is-coming-in-2020-and-itll-look-more-like-paypal-than-coinbase","publishDate":"2020-01-22T12:24:55","id":3423,"type":null,"title":"Bakkt&#x27;s consumer app is coming in 2020, and it&#x27;ll look more like PayPal than Coinbase","category":["Cryptocurrency"],"content":["Bakkt president Adam White shared some details about one of the major developments underway at the Intercontinental Exchange-backed venture while speaking at Davos.&nbsp;","During a panel at The Block’s event <a href=\"https:\/\/e8.partners\/davos-2020\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">hosted by E8 Partners<\/a> in Davos on Wednesday during the World Economic Forum, White said Bakkt's consumer app will view digital assets as any form of value that is digital, including cryptocurrencies like bitcoin. This means the app could also support virtual goods such as loyalty reward points and equities. The possible inclusion of equity trading, a portal for merchants, and a wide array of other assets would make the app more similar to a traditional fintech product like PayPal than a crypto-native offering that allows retailers to accept bitcoin, like Flexa.&nbsp;","Thus far, Bakkt has been known for its institution-aimed products, which include Bitcoin futures and options. Bakkt also offers institutional custody services, which counts Galaxy Digital and Tagomi as clients.&nbsp;","Still, as The Block previously reported, the firm's <a href=\"https:\/\/www.theblockcrypto.com\/daily\/51654\/with-ceo-appointment-bakkt-shows-commitment-to-consumer-ambitions\" data-v-f87c67ca=\"\">recent CEO pick<\/a> shows the firm is just as serious (if not more serious) about its upcoming consumer offering. Bakkt&nbsp;named Mike Blandina as its new CEO at the end of last year, replacing Kelly Loeffler, who was appointed as a U.S. Senator from the state of Georgia.&nbsp;","Indeed, in an October blog post, Blandina said&nbsp;the firm was focused on building the consumer app and merchant portal, for which Starbucks is serving as a launch partner.","At the panel, White also commented on the general state of the crypto market, noting that a \"killer app\" has yet to come to fruition.&nbsp;","\"I do not think we are there yet,\" he said. \"What gives me optimism is that we are seeing a lot of developer interest. I am confident that someone is going to find something.\""],"hashtag":[]}