{"summary":"VC Andreessen Horowitz&#x27;s crypto team is up to something. Maybe. It&#x27;s not quite clear right now as all we have to go on is tweets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/226966\/a16z-crypto-orange-ball-andreessen-horowitz","publishDate":"2023-04-19T06:08:33","id":3425,"type":null,"title":"A16z Crypto teases Twitter with mysterious orange ball","category":["DEALS"],"content":["Andreessen Horowitz's web3 investment arm, a16z Crypto, is working on something.&nbsp;","The venture capital giant's crypto arm teased a launch on Twitter yesterday, <a href=\"https:\/\/twitter.com\/NoahCitron\/status\/1648409237142269957?s=20\" data-v-f87c67ca=\"\">starting<\/a> with engineering partner Noah Citron posting a picture of an orange ball and the words \"coming soon.\" The brief tweet prompted a bout of speculation on the social media platform, with some likening the mystery to similar buzz-building tactics employed by Coinbase ahead of its <a href=\"https:\/\/www.theblock.co\/post\/214183\/coinbase-unveils-layer-2-network-and-developer-fund\" data-v-f87c67ca=\"\">Layer 2 launch<\/a> in February.&nbsp;","A16z Crypto Chief Technology Officer Eddy Lazzarin appeared to <a href=\"https:\/\/twitter.com\/eddylazzarin\/status\/1648431541612351488?s=20\" data-v-f87c67ca=\"\">shut down<\/a> the possibility of a new Layer 2, tweeting \"not an L2.\" Despite this, the native token of the Optimism blockchain, OP, rose a little as Coinbase's Layer 2, known as Base, is built on the open-source OP Stack.","<a href=\"https:\/\/www.coingecko.com\/en\/coins\/optimism\" data-v-f87c67ca=\"\">The OP price<\/a> has since dipped, in line with the broader crypto market.","Lazzarin responded to The Block's request for more info via Twitter direct messages with the orange ball emoji. a16z's comms team declined to comment.&nbsp;","Andreessen Horowitz is one of the highest profile investors in crypto, with <a href=\"https:\/\/www.theblock.co\/post\/148685\/a16z-announces-4-5-billion-fund-for-crypto-and-blockchain-startups\" data-v-f87c67ca=\"\">more than $7 billion in funds<\/a> dedicated to investments in the sector. The California-based firm has been involved in 11 fundraisings for crypto startups so far this year, according to <a href=\"https:\/\/www.theblock.pro\/deals\/results?company=a16z&amp;checkedDeals=&amp;checkedVerticals=&amp;checkedRound=&amp;checkedBlock=&amp;dateRange=&amp;dealRange=&amp;subcategory=&amp;yearfounded=&amp;country=\" data-v-f87c67ca=\"\">The Block's Deals Dashboard<\/a>.&nbsp;&nbsp;","Lazzarin later shared more tweets with the orange ball, adding, \"We need more TUIs and data dense displays.\" TUIs might reference Text-based User Interfaces (or Terminal User Interfaces), giving rise to speculation that the fund is working on some terminal for developers.&nbsp;","He followed the tweet by adding, \"What's the best Rust (or Crab) TUI framework?\" Rust is also one of the most popular programming languages used by blockchain developers — and its (sort of) <a href=\"https:\/\/dev.to\/azure\/rust-time-for-ferris-says--3gam#:~:text=Ferris%20the%20crab%2C%20is%20the%20unofficial%20mascot%20for%20Rust.\" data-v-f87c67ca=\"\">mascot<\/a> is an orange crab named Ferris.&nbsp;","","","That said, there is no certainty as to what the team at a16z is teasing right now, and the answer might not live up to the speculation.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$7 billion","content":"MONEY"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Noah Citron","content":"PERSON"},{"type":"California","content":"LOCATION"},{"type":"Ferris","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Eddy Lazzarin","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"The Block's Deals Dashboard","content":"ORGANIZATION"},{"type":"TUI","content":"ORGANIZATION"}],"hashtag":["ANDREESSEN HOROWITZ","OPTIMISM"],"authors":["Adam Morgan McCarthy","The Block"]}