{"summary":"BitDAO’s Ethereum Layer 2 project called Mantle has moved into its public testnet phase with the launch of Wadsley.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/200625\/bitdao-launches-testnet-for-ethereum-layer-2-network-mantle","publishDate":"2023-01-10T14:00:20","id":3426,"type":null,"title":"BitDAO launches testnet for Ethereum Layer 2 network Mantle","category":["CRYPTO ECOSYSTEMS"],"content":["BitDAO has launched the testnet for its modular Ethereum Layer 2 network project called Mantle with 37,000 developers already signed up for the launch, the DAO stated on Tuesday.","Dubbed “Wadsley,” the testnet will enable Mantle to test and implement new features for the chain before the mainnet launch scheduled for later in the year. The testnet is available to the public and developers have been urged to sign up to test their apps on the chain.","<a href=\"https:\/\/www.theblock.co\/post\/190926\/bitdao-launches-modular-ethereum-layer-2-network-mantle\" data-v-f87c67ca=\"\">BitDAO announced Mantle in November<\/a> as a modular Ethereum Layer 2 network. Modular networks have separate layers for handling network functions such as consensus, transaction execution and settlement. They are a newer take on blockchain design that is different from older monolithic chains where all network functions occurred on the same base layer.","BitDAO’s announcement on Tuesday reiterated that Mantle will deliver faster finality at cheaper transaction costs. The chain will also utilize multi-party computation, the announcement added. This type of computation sees the use of nodes specially designed to handle off-chain transactions correctly. Multi-party computation is one of the ways Layer 2 networks try to minimize the risk involved in transactions executed outside the base layer of a blockchain network.","The Mantle launch is also expected to boost the utility of BitDAO’s governance token, called bit. This is because bit will function as the native token of the Layer 2 network. Improving bit utility has become a major focus for the DAO. The community <a href=\"https:\/\/www.theblock.co\/post\/196509\/bitdao-mulls-100-million-token-buyback-for-next-year\" data-v-f87c67ca=\"\">voted in favor<\/a> of a $100 million token buyback in December 2022.","A BitDAO spokesperson told The Block that using bit as the native token for Mantle will foster the growth of the DAO’s ecosystem. BitDAO is an outlier in the DAO space as it is set up to support a single DeFi project as is the case with most DAOs. Instead, BitDAO is an investment DAO that seeks to grow its ecosystem by supporting a network of projects. It holds the second-largest treasury among DAOs with <a href=\"https:\/\/www.bitdao.io\/\" data-v-f87c67ca=\"\">$1.9 billion<\/a> currently in its reserves.","“A large ecosystem of partners already exists and will continue to grow within BitDAO. Mantle is the blockchain that binds all of this together and helps build value for each moving part,” said a BitDAO spokesperson.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mantle","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"December 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"$1.9 billion","content":"MONEY"},{"type":"November","content":"DATE"}],"hashtag":["DAOS","OPTIMISM","SIDECHAINS"],"authors":["Osato Avan-Nomayo","The Block"]}