{"summary":"Benjamin Ha v. Overstock.com, Gregory Iverson and Patrick Byrne is a securities fraud lawsuit filed in Utah federal court on Friday\nThis is a putative class action alleges punitive short squeeze strategy engineered by Byrne damaged investors\nLawsuit also alleges flawed cryptocurrency strategy and “bizarre” CEO statements led to draw in stock price","author":["Stephen Palley","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/41360\/overstock-com-and-execs-sued-for-securities-fraud-crypto-strategy-and-bizarre-ceo-statements-cited","publishDate":"2019-09-28T18:18:24","id":3427,"type":null,"title":"Overstock.com and execs sued for securities fraud; crypto strategy and &quot;bizarre&quot; CEO statements cited","category":["Legal"],"content":["A two count federal securities fraud lawsuit against Overstock.com, Gregory Iverson and Patrick Byrne was filed Friday in Utah federal court.&nbsp; This follows Iverson's resignation as Overstock CFO on September 17 and Byrne's resignation as CEO on August 22.","The lawsuit alleges that after a long streak of losing money, Overstock \"embarked on a blockchain strategy ... designed to profit on new markets for cryptocurrency. In fact, it was recently reported that, for the last several years, defendant Byrne spent no fewer than 220 days a year on the road, “spreading his blockchain gospel, despite the fact that Overstock was hemorrhaging cash.\"","According to the putative class action complaint, the defendants claimed in SEC filings and investor\/analyst conference calls that Overstock's transition to being a cryptocurrency exchange provider would be a great benefit to investors. However, plaintiff says that this was a risky strategy that was actually \"revenge upon short sellers and tried to create a short squeeze by offering a digital token dividend that would not be registered and could not be resold for at least 6 months. The lock-up period created by the issuance of an unregistered security effectively resulted in the inability of short sellers to deliver the security upon the surrender of their shares.\"","Plaintiffs allege that this strategy was thwarted by \"[m]arket participants and the SEC\", but only after Byrne sold $102 million of his privately held Overstock shares. But by then, they say, the damage was done and made worse by an alleged failure to disclose conditions that were adversely effecting the Company, which enabled them (among other things) to \"sell additional shares of Overstock in the market to create a cash fund necessary to support its crypto projects (in the face of them being abandoned by investment partners.)\"","The lawsuit also alleges that \"bizarre\" statements by Byrne had a negative effect on investor confidence and following the statement below stocks traded lower:","<br data-v-f87c67ca=\"\">\n","","Count I alleges violations of the antifraud prohibitions of the Securities Exchange of 1934. Count II alleges control person liability against Mr. Byrne. &nbsp;","<a href=\"https:\/\/www.scribd.com\/document\/427868939\/Tzero-Lawsuit\" data-v-f87c67ca=\"\">Link to Complaint can be read, here.<\/a>","<em data-v-f87c67ca=\"\">This is a breaking story, and we will provide updates if and as we receive them.<\/em>"],"hashtag":["SEC"]}