{"summary":"The SEC again postponed making a decision on VanEck\/SolidX’s proposal for an exchange-traded fund\nThe proposal was originally filed in January and was delayed in March\nThe commission is seeking comments from the public on the proposal","author":["Celia Wan","Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/23937\/sec-delays-decision-on-vaneck-solidx-etf-proposal-seeking-public-comments","publishDate":"2019-05-20T14:58:02","id":3428,"type":null,"title":"SEC delays decision on VanEck\/SolidX ETF proposal, seeking public comments","category":["Regulation"],"content":["<span data-v-f87c67ca=\"\">The Securities and Exchange Commission has decided to postpone making a decision on the VanEck, SolidX, and Cboe joint proposal to trade a bitcoin exchange-traded fund (ETF) and is seeking public comment in the interim.<\/span>","<span data-v-f87c67ca=\"\">With this latest decision, the VanEck\/SolidX proposal joins the long list of failed attempts to get an ETF approved by the SEC, leaving the space for the first approved bitcoin ETF still open. <\/span>","<span data-v-f87c67ca=\"\">Having received 25 comment letters so far, the commission is seeking more comments on the VanEck\/SoildX proposal before it makes a further decision. The deadline to submit comments is due 21 days from when the order is published and rebuttal to the comments are due 35 days after the publication.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The postponed ETF proposal was first filed over a year ago. However, it was withdrawn in January amid the U.S. Government shutdown. The partnership resubmitted the proposal in late January, only to receive a postponement notice on March 29. With the extension, the regulator then had 45 days to make a decision, drawing May 21 as the deadline for it to rule. Now, the hope that VanEck will receive a positive answer from the SEC this week is also dashed.&nbsp;<\/span>","In response to the repeated delays, VanEck digital asset strategy director Gabor Gurbacs <a href=\"https:\/\/twitter.com\/gaborgurbacs\/status\/1130551647200075778?s=21\" data-v-f87c67ca=\"\">said on Twitter<\/a> that \"we continue the hard work towards better-regulated, safer and more liquid digital assets markets. Bitcoin is too big to ignore.\"&nbsp;&nbsp;","<span data-v-f87c67ca=\"\">Meanwhile, the regulator had issued several extensions and rejections on ETF proposals, citing concerns that the proposals <\/span><a href=\"https:\/\/www.coindesk.com\/winklevoss-brothers-bitcoin-etf-rejected-by-sec-for-second-time\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">did not satisfy SEC standards<\/span><\/a><span data-v-f87c67ca=\"\"> to prevent fraud and manipulation. <\/span>","In the announcement today, the SEC reiterates these concerns:","“The Commission is instituting proceedings to allow for additional analysis of the proposed rule change’s consistency with Section 6(b)(5) of the Act, which requires, among other things, that the rules of a national securities exchange be “designed to prevent fraudulent and manipulative acts and practices, to promote just and equitable principles of trade,” and “to protect investors and the public interest.”","The SEC has sought public opinions on other ETF proposals before and it <a href=\"https:\/\/www.coindesk.com\/sec-commissioner-says-bitcoin-etf-will-be-approved-eventually\" data-v-f87c67ca=\"\">has released some friendly signals<\/a> towards ETFs in the past. However, it has yet to approve any.&nbsp;","“Looks like [the SEC] wants to deny it but also provide opportunity for a hearing before they deny it,” a lawyer told The Block under the condition of anonymity.&nbsp;","<span data-v-f87c67ca=\"\">Along with VanEck, other firms have received rejections or delays from the SEC on starting a ETF. The latest delay came on May 14, when the SEC<\/span><a href=\"https:\/\/www.coindesk.com\/sec-again-delays-decision-on-bitwise-bitcoin-etf-approval\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">announced it would hold off<\/span><\/a><span data-v-f87c67ca=\"\"> deciding on Bitwise Asset Management’s ETF proposal. <\/span>","<span data-v-f87c67ca=\"\">The SEC’s repeated postponements in sanctioning a bitcoin ETF may reflect its lack of confidence in the maturity of the crypto market. The commission has long expressed concern about the lack of transparency in cryptocurrency pricing. As a result, it <\/span><a href=\"https:\/\/www.coindesk.com\/sec-commissioner-says-bitcoin-etf-will-be-approved-eventually\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">has turned down at least 10 ETF proposals<\/span><\/a><span data-v-f87c67ca=\"\"> to date. And so it seems whichever firm can successfully address the SEC’s concerns over price manipulation will win the horse race to introduce ETF to the crypto market. <\/span>"],"hashtag":["SEC"]}