{"summary":"Previously exclusive to launch partners, Fraxtal is now accessible to the general public through its official bridge.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280734\/frax-opens-bridge-access-to-layer-2-network-fraxtal-plans-reward-snapshot-today","publishDate":"2024-03-05T23:18:10","id":3428,"type":null,"title":"Frax opens access to Layer 2 network Fraxtal; plans reward snapshot","category":["CRYPTO ECOSYSTEMS"],"content":["DeFi project Frax Finance opened a bridge to Fraxtal, its new Ethereum Layer 2 network, facilitating the transfer of funds for individual users.","This move follows the network’s <a href=\"https:\/\/www.theblock.co\/post\/276634\/frax-fraxtal-launch\" data-v-f87c67ca=\"\">restricted mainnet launch<\/a>, initially available only to selected partner applications, including infrastructure providers such as Safe, Chainlink, Axelar and LayerZero.","The expansion lets users deposit assets, including ETH, CRV, sfxETH, and others from Ethereum to Fraxtal.","Developed as an Ethereum-compatible optimistic rollup using the OP Stack, Fraxtal is set to become part of the Optimism Superchain ecosystem, aligning with other players like the Coinbase-backed <a href=\"https:\/\/www.theblock.co\/post\/239393\/coinbase-base-mainnet-developers\" data-v-f87c67ca=\"\">Base<\/a>, Mode, <a href=\"https:\/\/www.theblock.co\/post\/274039\/aevo-intends-to-open-up-its-rollup-for-other-protocols-to-build-on-it\" data-v-f87c67ca=\"\">Aevo<\/a>, Lyra and Zora. The network aims to serve as a dapps platform with a particular emphasis on decentralized finance.","Frax is the creator of the decentralized Frax stablecoin and liquid staking derivative Frax Ether, supporting a total value locked of over $1 billion.","In a related development, the Frax team plans to take a snapshot of all vote-escrowed stakers of Frax Shares (veFXS) on the Ethereum mainnet today. These stakers will receive a distribution in the form of Fraxtal (FXTL) later on, which may convert into a new token.","The network will separately introduce what's known as the Flox incentive system that will reward users based on the amount of gas they spend on the network, encouraging active participation.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lyra","content":"ORGANIZATION"},{"type":"CRV","content":"ORGANIZATION"},{"type":"Aevo","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Frax Finance","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Chainlink","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}