{"summary":"The Reserve Bank of India has said that it is exploring the need for digital currency.\nThe central bank initially formed a group to study digital currencies in 2018.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/92550\/india-central-bank-rbi-exploring-digital-currency","publishDate":"2021-01-26T03:00:07","id":3429,"type":null,"title":"India&#x27;s central bank says it is exploring the possibility of digital currency","category":["Central Banks"],"content":["The Reserve Bank of India (RBI), the country's central bank, has said that it is exploring the need for digital currency.","In a <a href=\"https:\/\/rbidocs.rbi.org.in\/rdocs\/Publications\/PDFs\/PSSBOOKLET93D3AEFDEAF14044BC1BB36662C41A8C.PDF\" data-v-f87c67ca=\"\">booklet on payment systems<\/a> published Monday, the RBI said if there is a need for a digital rupee, it will explore how to operationalize it.","\"Private digital currencies (PDCs) \/ virtual currencies (VCs) \/ crypto currencies (CCs) have gained popularity in recent years. In India, the regulators and governments have been skeptical about these currencies and are apprehensive about the associated risks. Nevertheless, RBI is exploring the possibility as to whether there is a need for a digital version of fiat currency and in case there is, then how to operationalize it,\" the central bank said.","This is not the first time the RBI has commented on researching and exploring digital currencies. In 2018, the central bank said it had <a href=\"https:\/\/rbidocs.rbi.org.in\/rdocs\/AnnualReport\/PDFs\/0ANREPORT201718077745EC9A874DB38C991F580ED14242.PDF\" data-v-f87c67ca=\"\">formed an inter-departmental group<\/a> to study and provide guidance on the \"desirability and feasibility\" of introducing a <a href=\"https:\/\/www.theblockcrypto.com\/post\/75022\/a-global-look-at-central-bank-digital-currencies-full-research-report\" data-v-f87c67ca=\"\">central bank digital currency (CBDC)<\/a> in order to reduce printing costs of banknotes and other benefits.","In December 2019, RBI governor Shaktikanta Das <a href=\"https:\/\/rbidocs.rbi.org.in\/rdocs\/Content\/PDFs\/RBIMEDIADEC0520196A3915E0F5D248C8A06F13FCEF7E5678.PDF\" data-v-f87c67ca=\"\">said it is \"too early\"<\/a> to talk about a CBDC due to technological barriers. \"As and when the technology evolves with adequate safeguards, I think it is an area where the Reserve Bank will certainly look at seriously at an appropriate time,\" he said at the time.","Das also commented on cryptocurrencies at the time, saying that the RBI is \"very clearly against\" those since issuing currency is a sovereign function.","In Monday's booklet, the RBI said digital payments are rapidly rising in India through mobile phones and cards. But in remote areas, where there is no or slow internet, it will explore an option of offline payments. \"Entities are being encouraged to develop offline payment solutions, and a pilot scheme in this regard was rolled out in August 2020. The pilot scheme is being undertaken till March 31, 2021 and based on experience gained, a decision will be taken on roll out of the scheme,\" the RBI said.","In all, the RBI is not opposed to the idea of digital currency, but it is also not in a rush to issue one. Meanwhile, India's neighbor <a href=\"https:\/\/www.theblockcrypto.com\/post\/87754\/china-digital-yuan-touching-pay\" data-v-f87c67ca=\"\">China is nearing the launch of digital yuan<\/a> after researching and developing it for the past six years."],"hashtag":[]}