{"summary":"Crypto firms in Taiwan are expected to come up with self-supervisory rules based on guidelines provided by the financial regulator.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285555\/taiwans-crypto-sector-receives-government-approval-to-form-industry-association","publishDate":"2024-03-29T03:03:56","id":3429,"type":null,"title":"Taiwan’s crypto sector receives government approval to form industry association","category":["ASIA"],"content":["Taiwan’s Ministry of the Interior has approved the application from the local cryptocurrency industry to form an industry association, as the government moves closer to regulating the nascent sector.","The local crypto industry working group, <a href=\"https:\/\/www.theblock.co\/post\/252884\/taiwans-crypto-industry-prepares-to-form-association-ahead-of-new-regulation\" data-v-f87c67ca=\"\">formed last year<\/a> in preparation for establishing an industry association, said in a notice on Friday that it received the green light from the government for the application.","The working group now needs to finish all preparation work and officially establish the crypto industry association by the end of June, as required by the government.","The working group currently comprises 22 crypto firms, including major exchanges in Taiwan such as MaiCoin and BitoPro. The working group noted that it removed ACE Exchange from the group, as the troubled exchange has been <a href=\"https:\/\/www.theblock.co\/post\/274214\/taiwan-ace-exchange-fraud\" data-v-f87c67ca=\"\">mired in investigations<\/a> by prosecutors for its former executives’ alleged wrongdoing.","<span data-v-f87c67ca=\"\">Currently, Taiwan requires cryptocurrency service providers to comply with anti-money laundering laws since the Financial Supervisory Commission <\/span><a href=\"https:\/\/law.fsc.gov.tw\/LawContent.aspx?id=GL003218&amp;kw=%e8%99%9b%e6%93%ac%e9%80%9a%e8%b2%a8%e5%b9%b3%e5%8f%b0%e5%8f%8a%e4%ba%a4%e6%98%93%e6%a5%ad%e5%8b%99%e4%ba%8b%e6%a5%ad%e9%98%b2%e5%88%b6%e6%b4%97%e9%8c%a2%e5%8f%8a%e6%89%93%e6%93%8a%e8%b3%87%e6%81%90%e8%be%a6%e6%b3%95\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">introduced<\/span><\/a><span data-v-f87c67ca=\"\"> anti-money laundering rules in July 2021. Otherwise, the crypto industry remains largely unregulated.<\/span>","<span data-v-f87c67ca=\"\">In September 2023, the FSC <\/span><a href=\"https:\/\/www.theblock.co\/post\/252915\/taiwan-releases-guidelines-for-crypto-exchanges-restricts-offshore-exchanges-unless-compliant\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">released guidelines<\/span><\/a><span data-v-f87c67ca=\"\"> that place great emphasis on customer protection for crypto firms. By setting up an industry association, crypto firms hope they can come up with self-supervisory rules based on the guidelines.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"FSC","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Financial Supervisory Commission","content":"ORGANIZATION"},{"type":"September 2023","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"July 2021","content":"DATE"},{"type":"Taiwan’s Ministry of the Interior","content":"ORGANIZATION"},{"type":"Taiwan","content":"LOCATION"}],"hashtag":["ASIAN REGULATION"],"authors":["Timmy Shen","The Block"]}