{"summary":"Crypto markets run 24\/7 — is that good for market structure? And might traditional markets eventually work that way?","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/147579\/is-the-24-7-crypto-market-good-or-bad-for-traders-experts-disagree","publishDate":"2022-05-18T16:06:02","id":3430,"type":null,"title":"Is the 24\/7 crypto market good or bad for traders? Experts disagree.","category":["CAPITAL MARKETS"],"content":["As the TerraUSD stablecoin was losing its peg to the dollar last week, one high-profile crypto critic posted a tweet warning about one of the crypto market’s signature features.","\"Crypto trades 24\/7. This is not necessarily a good thing and we may soon find out why,” said Ben McKenzie, an actor best known for his role in the crime drama Gotham, who is now working on a book about crypto and fraud.","McKenzie is of course correct that, unlike equities or bonds, crypto trades on-chain, across over-the-counter desks, and on exchanges every day.&nbsp;","Over the years, that has caused some headaches for traders who might yearn for peace and quiet amidst gyrating prices.&nbsp;","\"I'd like to lodge a complaint against whoever decided that crypto should trade 24\/7,\" crypto mogul Barry Silbert mused in a recent tweet making light of the situation in the midst of the Luna-triggered drawdown.&nbsp;","Traders large and small have lost money while sleeping — and the always-open crypto markets can become especially risky during times like last week, when the prices of TerraUSD (UST) and its companion token, Luna, <a href=\"https:\/\/www.theblockcrypto.com\/post\/146444\/terra-luna-and-ust-how-we-got-here\" data-v-f87c67ca=\"\">were in freefall<\/a>.&nbsp;","An undeniable aspect of a 24\/7 market is that there are pockets of low liquidity when market participants pull back — for instance, over the weekend or during holidays — leaving the market open to manipulation. Historically, crypto markets are more volatile during weekend trading sessions, according to data from The Block.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/options\/btc-dvol-index-vol-of-vol\/embed\" title=\"BTC DVol Index Vol of Vol\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","But would shorter market hours really translate into more robust markets? Experts disagree on the matter.&nbsp;&nbsp;","\"I definitely think there are advantages to concentrating liquidity into certain time periods,” market structure expert Dave Lauer told The Block in a recent interview. “I think continuous markets, in general, are really bad because they struggle to do that.\"&nbsp;","\"If people wake up in Europe and Bitcoin is down because it was manipulated during a low liquidity period, I don't think you are necessarily going to see a recovery,\" he added.&nbsp;","David Mercer, chief executive at LMAX, has a different point of view.\"You can't stop money,\" he said.","In 2020, LMAX expanded its own foreign exchange business to service clients over the weekend. It also operates a 24\/7 crypto exchange business.&nbsp;","In Mercer's view, a 24\/7 market levels the playing field for market participants who don't have the sophisticated tools at their disposal to hedge positions during off-market hours. While a large investment firm may be able to do off-book trades with another large counterparty, a mom-and-pop retail trader in the US must wait until 9:30 am EST to act on her market decision.&nbsp;","\"Any time you pick [to close the market] will disadvantage one participant over another,\" said FTX.US President Brett Harrison. His firm has been hinting at the launch of its own trading service for US equities.&nbsp;","\"And if you're using liquidity as a yardstick for trading, then why stop at the weekend? why not close trading during lunchtime on Friday or the day before Thanksgiving?” said Harrison. “We should accept that there are periods of low liquidity.&nbsp;","Besides that, 24\/7 markets are better for price discovery, argues Doug Colkitt, a former quant researcher at Citadel Securities and founder of DeFi project Crocodile Labs. The ability for market participants to continuously contribute their view to the market adds a level of \"fidelity\" to the crypto market, according to Colkitt.","\"Markets are tools for price discovery,\" he said in a recent tweet. \"Continuous trading is high fidelity information.\"","In an interview with The Block, Colkitt argued that even if you pause the market during periods of market tumult — such as when Luna was hurtling towards zero— this will not keep it from ultimately finding the \"correct response.\"","Good or bad, it is unlikely that the genie will be put back in the proverbial bottle for crypto markets. And some even think that 24\/7 markets are likely to become the norm in traditional markets.&nbsp;","According to LMAX's Mercer, this type of expansion of hours is \"inevitable.\"","Rival Robinhood has already hinted that it is keen to expand its market to 24\/7 for its stock brokerage business. The firm launched extended hours trading in March.&nbsp;","\"Our new extended trading hours for equities will give them more opportunities to manage their portfolio at a convenient time for them, whether that’s in the early morning or in the evening,\" Robinhood said at the time.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Harrison","content":"PERSON"},{"type":"Dave Lauer","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Crocodile Labs","content":"ORGANIZATION"},{"type":"Colkitt","content":"ORGANIZATION"},{"type":"Barry Silbert","content":"PERSON"},{"type":"Europe","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"LMAX","content":"ORGANIZATION"},{"type":"Gotham","content":"LOCATION"},{"type":"Doug Colkitt","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Mercer","content":"PERSON"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Luna","content":"LOCATION"},{"type":"evening","content":"TIME"},{"type":"David Mercer","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Ben McKenzie","content":"PERSON"},{"type":"Citadel Securities","content":"ORGANIZATION"},{"type":"Brett Harrison","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"UST","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}