{"summary":"R3 Llc V. O(1) Labs Operating Corporation et al. is a new trademark lawsuit filed on Oct. 24 in U.S. District Court in Delaware\n\nR3 alleges that uses of the name “Coda Blockchain” is confusingly similar to “Corda Blockchain” and violates R3’s trademark rights\n\nWhether Coda infringes Corda may be a close call for a federal court, but if taken through full litigation will be an expensive fight and economics could have an impact on how the case is resolved","author":["Stephen Palley","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/44753\/r3-sues-competitor-over-coda-blockchain-name","publishDate":"2019-10-26T11:00:35","id":3431,"type":null,"title":"R3 sues competitor over &#x27;Coda Blockchain&#x27; name","category":["Layer 1s"],"content":["<a href=\"https:\/\/www.scribd.com\/document\/432119448\/R3-Trademark-Suit\" data-v-f87c67ca=\"\">Link to lawsuit<\/a>","Coda is a musical term, a Led Zeppelin rarities album and was at one time a really solid pizza joint outside of Hoboken, N.J. It's also the subject of a new federal court trademark lawsuit filed by blockchain behemoth R3 in Delaware federal court on Oct. 24. R3 says another blockchain company's \"Coda trademark\" is confusingly similar to the Corda trademark. (As an aside, it's been a big month for crypto-related lawsuits. Readers may recall that Facebook and Calibra were <a href=\"https:\/\/www.theblockcrypto.com\/post\/42909\/facebook-and-calibra-sued-in-ny-federal-court-in-trademark-case-involving-logo-design\" data-v-f87c67ca=\"\">sued early this month<\/a> over use of the Calibra logo.)","The lawsuit begins with an explanation of who R3 is and an allegation that it is doing really well, thank you very much. It is, to wit, \"a highly successful enterprise blockchain software technology company that has created and leads the largest blockchain ecosystem in the world comprised of hundreds of tech firms building applications on its CORDA Platform and Software.\" (Hmmm, he wonders, bigger than Bitcoin and Ethereum?)","Corda is R3's registered trademark, which according to the lawsuit covers the following:","","","R3 in August of this year also filed an application for the Corda logo, which appears below:","","","Plaintiff is upset because (so they say), people will be confused by the use of the word \"Coda\" in connection with the defendants' business, which \"purportedly addresses one of the fundamental challenges in cryptocurrency by creating the first succinct blockchain that enables decentralization at scale.\"","The complaint runs through all the ways that people will be confused by the use of the Coda mark, alleging that it constitutes \"willful infringement\" and unfair competition and that \"Current and prospective customers looking for R3 and the CORDA Platform and Software and encountering the CODA Mark are likely to be confused or deceived as to the source of the goods or mistaken belief that the CODA Protocol or CODA Network is somehow built on or affiliated with or emanated from the CORDA Platform and Software, and sales and undue benefits could thus be diverted to Defendants.\"","Stated differently, this all comes down to R3's claim that because they use the term Corda in connection with Blockchain someone else using the word Coda in connection with Blockchain is so confusing that it violates their trademark rights. There are plenty of other companies that use the word Coda -- which as anyone with a little bit of music training knows is also a thing in sheet music. (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Coda_(music)\" data-v-f87c67ca=\"\">Per wikipedia<\/a> \"In music, a coda ([ˈkoːda]) (Italian for 'tail', plural code) is a passage that brings a piece (or a movement) to an end. Technically, it is an expanded cadence. It may be as simple as a few measures, or as complex as an entire section.\" As noted above, it's also a <a href=\"https:\/\/www.youtube.com\/watch?v=1xkQX6GIys0\" data-v-f87c67ca=\"\">Led Zeppelin rarities album<\/a>, among other things.","Now, nobody asked me of course but, boy, this seems like a close call. On the one hand, Corda and Coda do sound and look kinda similar, so you can see how someone who invested a lot of time and money in the Corda brand name might be pissed. On the other hand, they are definitely separate and distinct words, and owning a trademark doesn't mean you own all adjacent or similar words. Like, what about \"Code Blockchain\", \"The Cord Blockchain\" or \"Crudo Blockchain\"? \"The Led Zeppelin Coda Blockchain.\" Perhaps you see my point.","The problem for the defendant may be as much economic as it is legal. These are expensive battles to fight and R3 has by all counts plenty of resources. The substantive and procedural issues in cases like this are non-trivial and how a court rules on this particular case may depend in large part on the persuasiveness of the two sides' briefing and argument. I'm not sure, reviewing the complaint, that the result is necessarily crystal clear."],"hashtag":[]}