{"summary":"The name HAL is a nod to the late Hal Finney as well as Stanley Kubrick&#x27;s film, 2001: A Space Odyssey.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/171175\/coinshares-launches-algorithmic-trading-tool-for-retail-investors","publishDate":"2022-09-20T08:22:11","id":3432,"type":null,"title":"CoinShares launches algorithmic trading tool for retail investors","category":["COMPANIES"],"content":["CoinShares launched an algorithmic trading strategies platform for retail investors on Tuesday.&nbsp;","Named HAL, the platform will offer users access to trading algorithms designed by the CoinShares quantitative team. The platform will initially launch in Europe, where the firm is based, where it will integrate with major exchanges, adding more integrations progressively.","The firm is looking to help people delegate their trading needs in a market that trades fast seven days a week, CoinShares CEO Jean-Marie Mognetti told The Block ahead of the launch.","Consumers trading crypto don't have time to look at their phone every five seconds, Mognetti noted, \"you have to delegate some of the decision making process to help you make the right choice.\"","The product name has sci-fi connotations, with a nod to Stanley Kubrick's film, 2001: A Space Odyssey, where HAL 9000 is a computer with a human personality. It is also a hat tip to the late Hal Finney, who received the <a href=\"https:\/\/www.theblock.co\/linked\/2472\/bitcoin-white-paper-10-years-and-10-facts\" data-v-f87c67ca=\"\">first bitcoin transaction<\/a> from Satoshi Nakamoto. Mognetti added that his firm often uses sci-fi related names when it comes to new product lines and even servers.&nbsp;","HAL costs €19.90 ($19.88) per month and can be cancelled any time. Currently there is no limit on the number of strategies users can select.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mognetti","content":"PERSON"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"2001","content":"DATE"},{"type":"Hal Finney","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Marie Mognetti","content":"PERSON"},{"type":"Jean","content":"PERSON"},{"type":"Stanley Kubrick","content":"ORGANIZATION"},{"type":"9000","content":"DATE"},{"type":"$19.88","content":"MONEY"},{"type":"Europe","content":"LOCATION"}],"hashtag":[],"authors":["Adam Morgan McCarthy","The Block"]}