{"summary":"Crypto exchange FTX has launched a marketplace for trading NFTs.\nThe platform is hosted on both the main FTX exchange and the FTX.US exchange websites.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/107087\/crypto-exchange-ftx-nft-marketplace","publishDate":"2021-06-03T11:02:41","id":3432,"type":null,"title":"Crypto exchange FTX launches a platform for buying and selling NFTs","category":["NFTs"],"content":["Crypto exchange FTX has launched a marketplace for trading non-fungible tokens (NFTs).","A number of NFTs are already listed on the marketplace, which is hosted on both <a href=\"https:\/\/ftx.com\/nfts\" data-v-f87c67ca=\"\">the main FTX exchange<\/a> and <a href=\"https:\/\/ftx.us\/nfts\" data-v-f87c67ca=\"\">the FTX.US exchange<\/a> websites.","NFTs are unique digital tokens tied to digital content. They are based on blockchain technology, which proves their authenticity and ownership.","One of the NFTs on the new FTX marketplace is \"<a href=\"https:\/\/ftx.com\/nfts\/token\/396255454752013180\" data-v-f87c67ca=\"\">SBF Lunch<\/a>,\" which is redeemable for an in-person lunch or 30-minute Zoom call with FTX CEO Sam Bankman-Fried. The highest bid for the NFT at the time of writing is $100,000. The bidding for the NFT closes on June 17.","Other NFTs available on the marketplace include FTX and FTX.US branded caps, hoodies, t-shirts, and socks. A number of third-parties have also listed NFTs.","These tokens appear to be based on Solana and Ethereum. Block explorers for both platforms are available to view on the platform.","Users of the marketplace will be able to buy, sell, and hold NFTs. They will also \"soon\" be able to withdraw the tokens to their personal wallets, according to a <a href=\"https:\/\/help.ftx.com\/hc\/en-us\/articles\/360061609792-NFT-Overview\" data-v-f87c67ca=\"\">statement<\/a> on FTX's website. FTX will charge a 5% fee to both buyers and sellers of NFTs.","FTX is the latest crypto exchange to enter the NFTs space. In April, crypto exchange <a href=\"https:\/\/www.theblockcrypto.com\/post\/102959\/binance-is-launching-its-own-nft-marketplace-in-june\" data-v-f87c67ca=\"\">Binance said<\/a> it would launch an NFT marketplace in June. Last week, Binance-owned Indian crypto exchange WazirX and South Korea's <a href=\"https:\/\/www.theblockcrypto.com\/linked\/106763\/crypto-exchange-korbit-launches-nft-marketplace-in-south-korea\" data-v-f87c67ca=\"\">Korbit<\/a> crypto exchange also launched NFT platforms.","NFTs made global headlines when <a href=\"https:\/\/www.theblockcrypto.com\/daily\/102856\/metakovan-beeple-nft-1-billion\" data-v-f87c67ca=\"\">MetaKovan<\/a> (also known as Vignesh Sundaresan) paid $69.3 million for an NFT created by the digital artist Beeple. The purchase came via an auction hosted by the centuries-old auction house Christie's in March. Since then, many well-known artists, content creators, and brands have joined the NFT bandwagon.","In recent weeks, however, the NFT activity has declined. Weekly NFT trading volumes, weekly users, as well as transactions of NFT platforms are all down, according to The Block Research.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/nft-overview\/weekly-trade-volume-of-nfts\/embed\" title=\"Weekly Trade Volume of NFTs\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>"],"hashtag":["FTX"]}