{"summary":"Three clandestine crypto companies in Argentina were discovered last week in raids.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/169345\/clandestine-crypto-miners-in-argentina-caught-by-authorities","publishDate":"2022-09-12T15:48:07","id":3433,"type":null,"title":"‘Clandestine’ crypto miners in Argentina caught by authorities","category":["THE BLOCK"],"content":["Three crypto miner sites in Argentina were caught last week by the country's tax and customs policy agency, the Administración Federal de Ingresos Públicos (AFIP).","The agency carried out those operations on sites allegedly working undercover in Lisandro Olmos, San Juan and Córdoba, it said in a statement on Friday.","\"(AFIP) carried out a control operation on a company dedicated to cryptocurrency mining, which worked on a property declared for other commercial purposes and whose documentation could not justify the elements found there,\" it said about the site in Lisandro Olmo.","The firm had declared that it was carrying out activities different from the ones that agents found when searching the place, as a way to account for the electricity consumption, \"thus concealing the economic reality of the place.\"","These were the first raids of clandestine mining facilities carried out by the agency.","When it searched the site in San Juan, AFIP found that it was hidden inside a refrigeration chamber meant to store fruit, according to iProUP, an Argentine news tech website.","Upon investigation, authorities identified a taxpayer that had imported mining equipment using a company of which he was partner. That person initially told inspectors that he had sold equipment, but eventually showed them where the machines were operating.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Argentina","content":"LOCATION"},{"type":"San Juan","content":"LOCATION"},{"type":"Córdoba","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Lisandro Olmo","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"Administración Federal de Ingresos Públicos (AFIP","content":"ORGANIZATION"},{"type":"Lisandro Olmos","content":"PERSON"},{"type":"AFIP","content":"ORGANIZATION"}],"hashtag":["CRYPTO"],"authors":["Catarina Moura","The Block"]}