{"summary":"Galaxy Digital disclosed its Q4 financials for 2019 in an earnings call on Wednesday\nThe crypto merchant bank printed a $32.9 million net loss for the period\nIts stock is also down by 65% from its 2019 high in June.","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/61269\/galaxy-digital-reports-a-32-9m-net-loss-for-the-final-quarter-of-2019","publishDate":"2020-04-08T15:16:58","id":3434,"type":null,"title":"Galaxy Digital reports a $32.9M net loss for the final quarter of 2019","category":["Startups"],"content":["Crypto merchant bank Galaxy Digital Holding experienced a $32.9 million net loss in the fourth quarter of 2019, according to the latest financial release from the company.","The disclosure comes as its stock continues a downward trend that began with its 2019 high last June.&nbsp;","In a Q4 earnings call Wednesday morning, the Canadian TSX Venture exchange-listed company disclosed its 2o19 financials. CEO Michael Novogratz tried to reinforce investor confidence after a period of significant turbulence in the crypto market, including the so-called Black Thursday that saw bitcoin's price among other cryptos plummet.","\"I don't think [Black Thursday] invalidates bitcoin's thesis,\" said Novogratz during the earnings call.","\"I am just really confident that at the end of the year it [bitcoin] is going to go higher,\" he added later.&nbsp;","As confident as Novogratz sounded for the overall bitcoin market, Galaxy Digital still experienced a troubled final quarter of 2019. Its trading desk saw a net realized loss of over $32 million, with its overall net loss (including unrealized gain\/loss on different assets) coming in at roughly $16.7 million. Its principal investing division also showed a net loss of $8.4 million.&nbsp;","The disclosed financials are current as of December 30, 2019, and thus don't include performance details for 2020, let alone the period in mid-March.","Galaxy Digital suffered less of a loss in Q4 compared to Q3, when it <a href=\"https:\/\/www.theblockcrypto.com\/search?s=galaxy%20digital\" data-v-f87c67ca=\"\">saw a $68.2 total net loss<\/a> across all divisions. Its comprehensive net income for 2019 reached $25.8 million, compared to its 2018 loss of $272.7 million.&nbsp;","The firm's stock price is down 65% since its 2019 high in June. When asked about the stock's poor performance, Novogratz said Galaxy Digital's stock is \"cheap\" compared to the company's actual performance, noting that the Canadian stock market historically does not have a strong appetite for crypto-related companies.&nbsp;","","","As The Block <a href=\"https:\/\/www.theblockcrypto.com\/daily\/60690\/galaxy-digitals-head-of-trading-strategies-departs-following-february-layoffs\" data-v-f87c67ca=\"\">reported<\/a> last week, Galaxy Digital parted ways with several executives in recent months, including its head of trading strategy, Josh Lim. The firm also underwent a notable headcount trim in mid-February, <a href=\"https:\/\/www.coindesk.com\/novogratzs-crypto-investment-firm-galaxy-digital-shrinks-workforce-15\" data-v-f87c67ca=\"\">laying off 15%<\/a> of its total workforce.&nbsp;"],"hashtag":[]}