{"summary":"Metaverse fund will go towards early-stage support for Enjin ecosystem partners.\nEnjin said the fund is part of the company’s commitment to an open metaverse.","author":["Osato Avan-Nomayo","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/123271\/enjin-floats-100m-efinity-metaverse-fund-to-boost-nft-marketplace","publishDate":"2021-11-04T07:56:39","id":3439,"type":null,"title":"Enjin floats $100M Efinity Metaverse Fund to boost NFT marketplace","category":["Startups"],"content":["Enjin has announced the creation of a $100 million fund to boost the development of its planned metaverse.","According to the<a href=\"https:\/\/enjin.io\/blog\/100m-efinity-metaverse-fund\" data-v-f87c67ca=\"\"> announcement<\/a> issued on November 4, the fund dubbed the Efinity Metaverse Fund will be used to support gaming and non-fungible token (NFT) developers in the Enjin ecosystem.","<a href=\"https:\/\/www.theblockcrypto.com\/post\/99980\/enjin-polkadot-based-blockchain-nft-funding\" data-v-f87c67ca=\"\">Enjin launched the Efinity ecosystem<\/a> as a blockchain for NFTs on the Polkadot network back in March. At the time, the company secured $18.9 million in a funding round led by cryptocurrency exchange service Crypto.com.","Detailing plans for the metaverse fund, Enjin said the move was a conscious effort to support a free and open metaverse.","The news comes as several major tech brands, including Facebook and Microsoft, have begun outlining metaverse-related <a href=\"https:\/\/www.theblockcrypto.com\/linked\/122856\/firm-backed-by-alan-howard-winklevoss-twins-closes-100-million-metaverse-fund\" data-v-f87c67ca=\"\">plans<\/a> of their own.","The $100 million fund will be used to lay the groundwork for integrating the different projects and marketplaces within the Efinity and broader Enjin ecosystems.","According to the announcement, the fund will also be used to support collaborative metaverse projects with a focus on cross-chain compatibility.","Given its presence in the emerging blockchain gaming space, Enjin will also be looking to support blockchain games, as well as NFTs.","“Our team will consider equity investments in seed \/ Series A fundraising rounds and purchases of new project native tokens for potential use in our ecosystem,” said Enjin in its announcement.","Enjin, like several other gaming and NFT-related tokens, has posted significant price gains in 2021. ENJ, the project’s native token is up 2,300% year-to-date, according to data from CoinGecko."],"hashtag":[]}