{"summary":"The event was substantially smaller than the 15,000-strong NFT.NYC, which is run by the same group. But its cosier feel and lack of the usual conference circuit speakers gave it the relaxed community atmosphere that NFT collections always seem to be striving for.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/183803\/nft-londons-inaugural-event-attracts-2500-with-bayc-food-truck-free-nfts-and-puppies","publishDate":"2022-11-07T14:19:28","id":344,"type":null,"title":"NFT.London&#x27;s inaugural event attracts 2,500 with BAYC food truck, free NFTs and puppies","category":["NFTS"],"content":["From a distance, the only thing you could see of NFT.London was a yellow and orange fast food truck parked outside in the rain.","It was a collaboration between frozen potato product corporation McCain’s — which recently launched a Roblox game where children can farm <a href=\"https:\/\/www.theblock.co\/post\/180804\/mccain-foods-wants-young-consumers-to-farm-its-metaverse-potatoes\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">metaverse potatoes<\/a> — and Bored and Hungry, a Bored Ape Yacht Club-themed restaurant in California. Perhaps one of the stranger web3 collaborations, it wasn’t the only gimmick that drew attention. Nearby sat an NFT vending machine through which one could purchase NFTs using card. Upstairs there were puppies and a \"zen den.\"","From NFT t-shirt printers and new metaverse platforms to tables littered with QR codes advertising whitelists for upcoming mints, NFT.London’s two-day inaugural stint saw over 2,500 registered attendees and 800 speakers.","The event was substantially smaller than the <a href=\"https:\/\/www.theblock.co\/post\/154347\/what-bear-market-nft-nyc-showcased-the-wild-and-opulent-world-of-nft-culture\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">15,000-strong NFT.NYC<\/a>, which is run by the same group. But its cosier feel and lack of the usual conference circuit speakers — many of whom spent that week at WebSummit in Lisbon instead — gave it the relaxed community atmosphere that NFT collections always seem to be striving for.","“This was our first major event in London (we hosted a small NFT event there in March 2018) and have seen a great response from the community. At our first NFT.NYC in 2019 we had total attendance of only 460,” said Cameron Bale, co-founder and producer of NFT.NYC.","The event offered NFT ticketing via YellowHeart, which recently launched its own <a href=\"https:\/\/www.theblock.co\/post\/179632\/creator-of-kings-of-leons-nft-album-now-has-a-metaverse-music-venue-exclusive\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">metaverse hub<\/a>, but 90% of attendees still opted for QR code tickets.","Like NFT.NYC, people The Block spoke to at the event commented at the poor showing at talks in London. While areas such as the VIP lounge were bustling — although that's likely due a company offering free bottles of wine — many talks had fewer than a handful of people in attendance, particularly toward the end of the event.&nbsp;","Perhaps there were simply too many speakers, some of whom took to the stage to do little more than pontificate over how “web2 + web3 = web5.”","There were some gems, however. Independent fashionistas took aim at the web3 efforts of the big fashion houses. Fashion designer and creator of NFT collection The Rebels, Robertas Kalinkinas was not impressed with the likes of Gucci's metaverse marketing.","He argued for web3&nbsp;as a way for designers to get around the barriers for entry into high fashion. He recounted dropping thousands of dollars for booths at fashion shows and designers doing unpaid internships. Web3 could give people a better and cheaper way to connect directly with customers and show off their collections.&nbsp;","Some ideas for web3 fashion might raise eyebrows among the more privacy-focused though. A phygital fashion panel floated the idea of putting trackers in garments to collect data about what customers do with their clothes after they buy them in the name of sustainability. Production limits could also be placed on companies who aren’t selling out their stock.","“Putting NFC chips in every garment and then tracking what is actually being wasted is how we make change because [when] you visibly see data and see where the problem is, [that's] when you can really fix it,” said Lauren Kacher, founder and creative director of DAO-led fashion label Alterrage.","The NFT.London event organizers rounded off the conference by announcing the dates of NFT.NYC 2023. It will be held in Hudson Yards and Times Square April 12-14. NFT.London will be making a return too.","“We think it is still early days and will be back in 2023,” Bale said.","<em data-v-f87c67ca=\"\">(Story was corrected to show that NFT.NYC 2023 event will run April 12-14.)<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"” Bale","content":"ORGANIZATION"},{"type":"Hudson Yards","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"April 12","content":"DATE"},{"type":"14","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Lauren Kacher","content":"PERSON"},{"type":"Roblox","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"California","content":"LOCATION"},{"type":"Robertas Kalinkinas","content":"PERSON"},{"type":"McCain","content":"PERSON"},{"type":"March 2018","content":"DATE"},{"type":"London","content":"LOCATION"},{"type":"Lisbon","content":"LOCATION"},{"type":"Cameron Bale","content":"PERSON"},{"type":"Gucci","content":"ORGANIZATION"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}