{"summary":"The new text looks more like the original, and places a €1,000 value cap for crypto transactions for self-hosted wallets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/222390\/crypto-payment-restrictions-back-self-hosted-wallets-eu","publishDate":"2023-03-24T05:47:06","id":3441,"type":null,"title":"Crypto payment restrictions back on self-hosted wallets in final EU Parliament AML text","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">Policymakers in the European Parliament have agreed on the text of the anti-money laundering bill that's due for a vote on March 28 and the crypto industry appears to have gotten a partial reprieve.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Following concerns raised by the digital assets industry, policymakers decided to revert back to the original language in the proposal about commercial payments, according to a draft obtained by The Block and confirmed by multiple sources. <\/span>","<span data-v-f87c67ca=\"\">An article that MEPs put into the bill aimed to place a cap on transactions merchants can accept unless the owner of a crypto wallet is fully identified. Changes previously <\/span><a href=\"https:\/\/www.theblock.co\/post\/221328\/payment-restriction-in-eu-anti-money-laundering-bill-irks-crypto-industry\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">introduced<\/span><\/a> <span data-v-f87c67ca=\"\">into the draft of the regulation proposed that only transfers made from an EU-licensed crypto service provider would be allowed to exceed an amount equivalent to €1,000 ($1,090), language that caused major pushback from the European digital assets industry.<\/span>","The crypto sector's concerns focused on this departure from the regulatory path already outlined in other bills and a perception it might create barriers for DeFi innovation.","<span data-v-f87c67ca=\"\">In the latest version of the bill, cash transactions would be capped at €7,000 for commercial payments, in contrast to the €1,000 value cap for crypto transactions involving self-hosted wallets. The bill text allows for exceptions to the €7,000 cash threshold for interpersonal payments, except if they are for real estate, luxury goods, or a deposit into a financial institution.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The return to the original language means that the transaction cap applies to <\/span><a href=\"https:\/\/www.theblock.co\/post\/213380\/self-hosted-wallet-ban-avoided-in-new-draft-of-eus-anti-money-laundering-bill\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">self-hosted addresses<\/span><\/a><span data-v-f87c67ca=\"\"> — “unless the customer or beneficial owner of such self-hosted addresses can be identified,” the draft reads.<\/span>","MEPs have added a mandate for the European Commission to assess whether to adjust the rule on commercial payments in three years' time, to align with regulations like the European Union's <a href=\"https:\/\/www.theblock.co\/post\/220515\/european-parliament-passes-eu-digital-wallet-legislation\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">digital identity framework<\/a> as well as the newly-proposed Anti-Money Laundering Authority's requirements.&nbsp;","<span data-v-f87c67ca=\"\">The text is expected to receive a stamp of approval in a vote in the Parliament's Committee on Civil Liberties, Justice and Home Affairs and Committee on Economic and Monetary Affairs, which oversaw the negotiations. Then, it will need to pass a plenary vote before entering inter-institutional negotiations. This will be an opportunity to re-open debate on requirements for commercial crypto payments.<\/span>","<em data-v-f87c67ca=\"\">Update: story updated to give more detail on the crypto industry's concerns.&nbsp;<\/em>","<em data-v-f87c67ca=\"\">Update: Clarifies types of wallets affected in fifth paragraph.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1,090","content":"MONEY"},{"type":"European Parliament","content":"ORGANIZATION"},{"type":"Parliament's Committee on Civil Liberties, Justice","content":"ORGANIZATION"},{"type":"Laundering Authority","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"March 28","content":"DATE"},{"type":"European Commission","content":"ORGANIZATION"},{"type":"European Union","content":"ORGANIZATION"},{"type":"Home Affairs and Committee on Economic and Monetary Affairs","content":"ORGANIZATION"}],"hashtag":["EUROPEAN PARLIAMENT"],"authors":["Inbar Preiss","The Block"]}