{"summary":"The ongoing rout in cryptocurrencies has sent companies offering services in the space into a tailwind, with Coinbase trading down more than 30% year-to-date.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/135362\/coinbase-is-reporting-earnings-today-amid-a-crypto-volumes-slump","publishDate":"2022-02-24T14:28:32","id":3442,"type":null,"title":"Coinbase is reporting earnings today amid a crypto volumes slump","category":["BITCOIN"],"content":["Crypto exchange Coinbase will report fourth-quarter earnings Thursday, revealing to Wall Street exactly how the firm navigated the recent drawdown in bitcoin's price and whether the current macro uncertainty will put pressure on its share price.&nbsp;","The ongoing rout in cryptocurrencies has sent public companies offering services in the space into a tailspin, with Coinbase trading down more than 30% year-to-date. It's not the only victim of the current market backdrop, which has been underpinned by concerns about mounting inflation and, in recent days, the escalating military conflict in Ukraine.&nbsp;","A wide range of stocks exposed to crypto fell sharply over the course of the fourth quarter, including MicroStrategy, Square (now Block), and Silvergate. Block is also reporting earnings on Thursday.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/crypto-stocks-marketcaps\/embed\" title=\"Crypto Stocks Marketcaps\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<span data-v-f87c67ca=\"\">Still, trading volumes – Coinbase's bread butter money maker —will likely fall in the upcoming quarter. In total, daily exchange volumes fell from around $45 billion in mid-November to $25 billion towards the end of the year, according to data from The Block Research.<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/total-exchange-volume-daily\/embed\" title=\"Daily Exchange Volume (7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Price will likely be a focus as well. In fact, Owen Lau, an analyst at Oppenheimer, said that the price of bitcoin is the \"number one\" concern for the stock.&nbsp; “Fundamentally speaking, I don’t think they should be trading hand-in-hand, but in reality they are.”","In fact, Coinbase performed worse than bitcoin as both slid over the last three months.","","","Still, despite the headwinds facing Coinbase, Wall Street remains optimistic about its stock. The average price target across Wall Street analysts covering the stock stood at $358 on February 22 — far higher than its share price of $209. At the same time, buy recommendations far outnumber hold and sell recommendations.&nbsp;","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Silvergate","content":"ORGANIZATION"},{"type":"$25 billion","content":"MONEY"},{"type":"February 22","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$358","content":"MONEY"},{"type":"Owen Lau","content":"PERSON"},{"type":"Oppenheimer","content":"ORGANIZATION"},{"type":"$209","content":"MONEY"},{"type":"30%","content":"PERCENT"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"last three months","content":"DATE"},{"type":"fourth quarter","content":"DATE"},{"type":"$45 billion","content":"MONEY"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["COINBASE","EARNINGS"],"authors":["Frank Chaparro","The Block"]}