{"summary":"FinCEN’s deadline for public comments on its proposed crypto wallet regulation ends just before midnight on January 4.\nLawmakers and industry players alike have petitioned the U.S. Treasury Department to extend the abnormally short comment period.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/90021\/fincen-crypto-wallet-rule-deadline-feature","publishDate":"2021-01-04T18:56:03","id":3445,"type":null,"title":"As FinCEN&#x27;s comment window on crypto wallet rule comes to a close, uncertainty on path forward remains","category":["Regulation"],"content":["At 11:59 PM EST on January 4, the clock will run out on the window to submit written comments on a proposed rule that could create significant regulatory hurdles for crypto transacting.","The Financial Crimes Enforcement Network (FinCEN) released a notice of proposed rulemaking <a href=\"https:\/\/www.theblockcrypto.com\/linked\/88511\/fincen-proposes-new-kyc-for-crypto-wallets\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">on December 18<\/a> that seeks to heighten identification requirements for crypto transactions. The proposed <a href=\"https:\/\/public-inspection.federalregister.gov\/2020-28437.pdf\" data-v-f87c67ca=\"\">“Requirements for Certain Transactions Involving Convertible Virtual Currency or Digital Assets,”<\/a> would subject all wallets, even those that are self-hosted or held at non-U.S. institutions, to know-your-customer (KYC) and reporting requirements for transactions greater than $3,000. It also proposes rules against structuring — a strategy used to get around reporting requirements by breaking larger transactions into smaller ones.","Though lawmakers and industry players alike have petitioned the U.S. Treasury Department to extend the abnormally short comment period, the deadline has yet to be moved as of this press time.","<b data-v-f87c67ca=\"\">The stakes and the stakeholders<\/b>","At its core, the rule is an attempt to apply traditional banking standards to the cryptocurrency ecosystem. The issue many critics raise is that crypto is, as a technology, different from the traditional system, and curbing the ability to anonymously transact or transact with decentralized entities could limit innovation.","The rule itself centers on what FinCEN calls “unhosted” or “self-hosted” wallets. The crypto industry tends to interpret this as wallets unaffiliated with a centralized entity like an exchange. That’s also how the Internal Revenue Service breaks down its regulation, between exchange-hosted and non-exchange hosted.","But, as former New York Department of Financial Services enforcer and current Seward &amp; Kissel attorney Andrew Jacobson pointed out, while FinCEN is clear about its expectations for unhosted wallets, it isn’t clear about what actually constitutes an unhosted wallet.","“The notice of proposed rulemaking has pages and pages dedicated to the risk of unhosted wallets but the regulation itself, the exact proposed regulation, doesn’t define what an unhosted wallet is,” he said. “I think that’s very interesting because a lot of people are talking about the decentralized finance space, smart contracts — I think there’s still a lot of ambiguity and regulatory gray area that people are struggling with right now.”","If the rule takes effect in the coming weeks, it’s possible that the decentralized finance (DeFi) ecosystem could suffer in the short term since it remains unclear how KYC measures would work when one is sending money to a protocol rather than a person. As larger exchanges attempt to get up to speed with the new compliance standards — which would require new structures of reporting and identity confirmation — firms may freeze certain activities to such wallets or decentralized entities until a compliant KYC system is in place.","Representative Warren Davidson, a member of Congress’s Blockchain Caucus, said he’s worried the rule could limit potential use cases for distributed ledger technology. Issues of money laundering and illicit finance abound in the traditional world as well, said Davidson, so there’s little point in regulating the new look according to the rules of the old.","“It’s an effort to try to make digital assets conform to a system that frankly doesn’t work that well already,” he told The Block.","<b data-v-f87c67ca=\"\">A race against time<\/b>","With the proposal came an unusually contracted timeline of 15 days. So-called “significant” rule changes sport a 60-day public comment period, according to FinCEN’s guidelines — except in case of emergency necessities.","Though the substance of the rule has drawn concern from industry players, with many citing the potential for a proverbial barrier to fall in place between centralized and more decentralized modes of transacting in crypto, the more pressing concern was the lack of time. A 15-day comment period conducted over the course of a holiday season with eight business days was unreasonable, many said.","The Administrative Procedures Act (APA) requires federal agencies to conduct a comment period that’s open to the public before any rule is set in stone. Jake Chervinsky, Decentralized Finance (DeFi) group chair at the Blockchain Association and general counsel to Compound, <a href=\"https:\/\/twitter.com\/jchervinsky\/status\/1340054149874941952?s=20\" data-v-f87c67ca=\"\">tweeted<\/a> that a 15-day comment period could be considered a violation of the APA.","Why? As Coinbase put it in its letter to FinCEN director Kenneth Blanco, “there is no emergency.”","The exchange asked the regulator to “reconsider its haste” in its letter, saying the shortened period did not provide adequate time for stakeholders to meaningfully respond. Similar statements came from <a href=\"https:\/\/blog.kraken.com\/post\/7286\/fincens-new-rule-is-about-to-wall-off-the-poor-from-our-financial-system-forever\/\" data-v-f87c67ca=\"\">Kraken<\/a>, Coin Center and the <a href=\"https:\/\/twitter.com\/BlockchainAssn\/status\/1344333245735972868?s=20\" data-v-f87c67ca=\"\">Blockchain Association<\/a>, among others, criticizing the shortened comment period and committing to pushback.","Still, despite the shortened time period, stakeholders have managed to submit more than 5,000 formal responses. <a href=\"https:\/\/www.regulations.gov\/document?D=FINCEN_FRDOC_0001-0121\" data-v-f87c67ca=\"\">The regulations.gov website<\/a> counts 5,633 comments tracked as submitted as of Jan. 4.","<b data-v-f87c67ca=\"\">Meanwhile, in Congress<\/b>","The notice of proposed rulemaking came through at a time when lawmakers were largely focused on political squabbles around the federal budget and coronavirus aid funding. The coronavirus relief bill was top of mind, since many lawmakers were required to read and respond to thousands of pages of proposals in a matter of days. But as the dust settled, Blockchain Caucus members turned their eyes to FinCEN.","Reps. Tom Emmer, David Schweikert, Warren Davidson, Ted Budd, Bill Foster, Darren Soto, Susan DelBene and Tulsi Gabbard penned a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/89783\/representatives-ask-mnuchin-to-extend-comment-period-for-proposed-wallet-rule-to-traditional-60-days\" data-v-f87c67ca=\"\">letter<\/a> to Blanco and Treasury Secretary Steve Mnuchin. The group called for an extended comment period and also pushed FinCEN to consider an extended implementation of the proposed rule to give exchanges time to develop technological solutions to the reporting requirements.","Though the letter only critiques the timeline, some lawmakers have already said they’re wary of the proposal. Budd is among those in the opposition, saying it threatens America’s competitive advantage.","“We’re competing with countries around the world and we shouldn’t hurt ourselves by restricting the freedom of individuals to use self-hosted wallets,” he said.","Wyoming Senator-elect Cynthia Lummis tweeted her concerns of the proposed rule before it was public, saying it could threaten the U.S.’s competitiveness if implemented too hastily. In the days since then, she has invited stakeholders to copy her in their comments.","Davidson, who opposes the rule, said it’s indicative of a larger problem. The regulatory narrative on crypto wallets has been murky, coming from a variety of agencies rather than Congressional action.","“I really fear that if Congress doesn’t take action soon to get the actions of the agencies — the SEC, Treasury, the IRS — aligned, we’re going to be stuck with a disparate patchwork of agency policies that’s going to be resolved by another disparate patchwork of court decisions,” he said. “This is a reflection of failure to act by Congress.”"],"hashtag":["WALLETS"]}