{"summary":"Montenegro’s Supreme State Prosecutor’s Office said the court’s decision to extradite Do Kwon to South Korea overstepped its authority.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284071\/montenegro-prosecutor-contests-do-kwon-extradition","publishDate":"2024-03-21T21:45:07","id":3445,"type":null,"title":"Montenegro’s top prosecutor contests Do Kwon’s South Korea extradition","category":["ASIA"],"content":["<span data-v-f87c67ca=\"\">Montenegro's top prosecutors are pushing back against a decision from their country's highest court to extradite Terraform Labs co-founder Do Kwon to his native South Korea.<\/span>","<span data-v-f87c67ca=\"\">Prosecutors are contesting the extradition's legality, <\/span><a href=\"https:\/\/sudovi.me\/vrdt\/sadrzaj\/W8V9\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">claiming<\/span><\/a><span data-v-f87c67ca=\"\"> Montenegro's High Court overstepped its powers in carrying out an “abbreviated” legal procedure to secure Kwon’s transfer to South Korea instead of the U.S., according to a translation of its statement released on Thursday. Those extradition powers belong chiefly to the Montenegrin Ministry of Justice, prosecutors said in the statement, which&nbsp;refers to former Terraform leader Kwon Do-hyeong&nbsp;by his initials, K.D.H.<\/span>","<span data-v-f87c67ca=\"\">Montenegro's High Court <a href=\"https:\/\/sudovi.me\/vrhs\/sadrzaj\/ONBM\" data-v-f87c67ca=\"\">said<\/a> in a statement on Friday that it&nbsp;would pause Kwon's extradition, a major concession to the country's prosecutors.<\/span><span data-v-f87c67ca=\"\">&nbsp; The freeze will remain in effect until a judge rules on the extradition request early next week. The extradition's approval or denial will come on the heels of the court's ruling early next week on whether the extradition is legally valid according to Montenegrin law.<\/span>","<span data-v-f87c67ca=\"\">Earlier this week, Kwon seemed ready to pack his bags for the U.S. On Wednesday, the Balkan country’s Appellate Court confirmed the <\/span><a href=\"https:\/\/www.theblock.co\/post\/281138\/do-kwon-to-be-extradited-to-south-korea-after-court-reverses-extradition-to-us\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">High Court’s decision<\/span><\/a><span data-v-f87c67ca=\"\"> to extradite Kwon to South Korea, as it <\/span><a href=\"https:\/\/www.theblock.co\/post\/283690\/montenegro-appellate-court-rejects-do-kwons-appeal-of-south-korean-extradition\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">rejected Kwon’s<\/span><\/a><span data-v-f87c67ca=\"\"> latest appeal.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Between South Korea and the U.S., Kwon and his lawyers have reportedly preferred his home country, where the maximum sentence for financial criminals typically ranges from 30 to 40 years. In contrast, the U.S. follows a principle where the court can impose consecutive sentences for each crime of which a defendant is found guilty.<\/span>","<span data-v-f87c67ca=\"\">Terraform Labs’ algorithmic stablecoin Terra and sister cryptocurrency Luna crashed in May 2022, wiping out over $40 billion worth of market capitalization in a matter of days. Since then, U.S. and South Korean authorities have sought Kwon and Terraform Labs on charges including fraud and violations of securities laws.<\/span>","<span data-v-f87c67ca=\"\">Kwon, who has been a fugitive with an Interpol Red Notice issued for his arrest, was apprehended in Montenegro last March for attempting to travel with fake documents.<\/span>","<strong data-v-f87c67ca=\"\">UPDATE (12:15 p.m. EDT):<\/strong> Adds information about a Montenegrin High Court's decision to pause Do Kwon's potential extradition from Montenegro.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Interpol Red Notice","content":"ORGANIZATION"},{"type":"South Korea","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Montenegro's High Court","content":"ORGANIZATION"},{"type":"May 2022","content":"DATE"},{"type":"12:15 p.m. EDT","content":"TIME"},{"type":"Balkan country’s Appellate Court","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"Kwon","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"High Court","content":"ORGANIZATION"},{"type":"Montenegrin High Court","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Montenegro","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"Montenegrin Ministry of Justice","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"}],"hashtag":["CRIME","DO KWON"],"authors":["Danny Park","The Block"]}