{"summary":"Messari reported monthly active users in blockchain gaming and new users dropped by 30% and 34%, respectively.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/211085\/blockchain-gamings-struggles-continue-as-active-users-drop-30-in-three-months-messari","publishDate":"2023-02-13T13:29:48","id":3447,"type":null,"title":"Blockchain gaming&#x27;s struggles continue as active users drop 30% in three months: Messari","category":["METAVERSE & NFT"],"content":["Web3 gaming has been a bright spot in an otherwise down year for an industry that has seen funding dry up. That might not be the case for much longer if interest in blockchain gaming continues to wane.&nbsp;","<span data-v-f87c67ca=\"\">The number of active users for such games dropped 30% since October, crypto market researcher Messari said. <\/span><span data-v-f87c67ca=\"\">The number of new users dropped by 34%.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">After an initial wave of simple “play-to-earn” games like Axie Infinity gained popularity during crypto’s bull run, a new class of more sophisticated games developed by seasoned developers has entered the market. Crypto enthusiasts continue to see blockchain gaming as a surefire way to eventually convince consumers to embrace web3, possessing digital wallets and owning digital assets.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">But Axie Inifity's popularity collapsed as the bear market set in. So far there have not been any new blockchain game – Yuga Labs's recent headline-grabber Dookey Dash may or may not qualify, depending on how one defines a web3 game – which have managed to attract a large number of gamers.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">During the last several months, a sharp reduction in cryptocurrency prices and non-fungible token trading volumes has caused sentiment to sour. But investment in blockchain gaming and NFT projects has remained robust, pulling in hundreds of millions of dollars in fresh venture capital each month. The trend continued last month with the NFT-gaming vertical securing the most funding among all categories, outpacing both infrastructure and financial services, according to The Block Research.<\/span>","<span data-v-f87c67ca=\"\"><\/span>","","<span data-v-f87c67ca=\"\">“Blankos has a million players. Axie has a couple million players. But that’s not really that big, to be super honest, in gaming. Call of Duty mobile has 500 million. Niantic has a billion. We’re still in the infancy.” <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Mythical Games achieved a value of $1.25 billion after it <\/span><a href=\"https:\/\/www.theblock.co\/linked\/123306\/gaming-startup-mythical-games-raises-150-million-in-series-c-round-led-by-a16z\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">raised <\/span><\/a><span data-v-f87c67ca=\"\">$150 million in 2021 from investors including Andreessen Horowitz.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1.25 billion","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"34%","content":"PERCENT"},{"type":"Niantic","content":"LOCATION"},{"type":"30%","content":"PERCENT"},{"type":"Axie Inifity","content":"ORGANIZATION"},{"type":"hundreds of millions of dollars","content":"MONEY"},{"type":"Messari","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"$150 million","content":"MONEY"}],"hashtag":[],"authors":["RT Watson","The Block"]}