{"summary":"News of the unicorn valuation comes just four months after Dune raised $8 million in a Series A round.\nValuations are surging across the crypto industry — with data startups among those reaping the rewards.","author":["Ryan Weeks","Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/127759\/dune-analytics-is-raising-funds-at-a-1-billion-valuation-sources","publishDate":"2021-12-16T12:57:28","id":3448,"type":null,"title":"Dune Analytics is raising funds at a $1 billion valuation: sources","category":["Data"],"content":["Dune Analytics, the Norwegian crypto analytics startup, is raising a fresh round of financing at a strikingly high valuation of $1 billion, according to several investors with knowledge of the round.","One person close to the deal said that Coatue Management, the hedge fund, will participate in the fundraise.&nbsp;","While further details of the deal remain unclear, the valuation is noteworthy in that it comes just four months after the startup — which was founded in 2018 — <a href=\"https:\/\/www.theblockcrypto.com\/post\/114343\/dune-analytics-crypto-data-series-a-funding\" data-v-f87c67ca=\"\">closed an $8 million Series A round<\/a>. No valuation was disclosed at that time.","Dune and Coatue were contacted for comment but did not respond by press time.","New York-based investor Union Square Ventures led Dune’s Series A round, with Redpoint Ventures and earlier backers Dragonfly Capital and Multicoin Capital also participating in that fundraise.","Dune offers a free service that allows users to pull data and draw up dashboards on a wide range of digital assets, ranging from DeFi protocols to non-fungible tokens (NFTs). It also offers a paid-for subscription service starting at $390 per user.","As of August, Dune supported data queries for four blockchains: Ethereum, Polygon, Optimism and xDAI. But co-founder and CEO Fredrik Haga told The Block at the time that it plans to expand into all Ethereum Virtual Machine-based blockchains and other networks in due course.","News of Dune’s latest raise comes with valuations across the crypto sector soaring to notable heights.","A <a href=\"https:\/\/www.theblockresearch.com\/mapping-out-the-blockchain-unicorns-124025\" data-v-f87c67ca=\"\">recent report<\/a> from The Block Research found that the industry now boasts 64 so-called ‘unicorns’ — private startups with a valuation north of $1 billion. Thirty-nine of those companies reached unicorn status in 2021.","Crypto analytics companies have been getting in on the act, with Kaiko, Messari, Coin Metrics, CryptoCompare, and DappRadar all raising money in recent months.&nbsp;","On Thursday morning, news broke that Nansen, another on-chain analytics firm, had <a href=\"https:\/\/www.theblockcrypto.com\/post\/127747\/data-startup-nansen-secures-fresh-funding-at-750-million-valuation\" data-v-f87c67ca=\"\">raised $75 million<\/a> in a fresh round of funding that valued it at $750 million.&nbsp;"],"hashtag":[]}