{"summary":"Though trading volumes have generally fallen, Kraken and Bybit have seen an increase in spot trading and Bitget in derivatives trading.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234857\/kraken-bybit-and-bitget-make-gains-following-ftx-collapse-nansen","publishDate":"2023-06-15T06:00:24","id":3449,"type":null,"title":"Kraken, Bybit and Bitget make gains following FTX collapse: Nansen","category":["EXCHANGES"],"content":["Crypto exchange Kraken, Bybit and Bitget made gains following the <a href=\"https:\/\/www.theblock.co\/post\/186132\/ftx-collapse-timeline-six-days-that-rocked-the-crypto-industry\" data-v-f87c67ca=\"\">demise<\/a> of rival exchange FTX, according to a <a href=\"https:\/\/research.nansen.ai\/articles\/880\" data-v-f87c67ca=\"\">report<\/a> by blockchain analytics platform Nansen.","While the majority of crypto exchanges saw a decline in spot trading volumes over the six months post-FTX, Kraken and Bybit bucked the trend. Kraken is up 14.4% in average monthly trading volume to $18.9 billion, with Bybit up 7.65% to $18.2 billion. Binance remained the largest centralized exchange during the period, down marginally by -0.2% to $444 billion.","In terms of derivatives trading, Bitget saw its average monthly volumes grow by 4.85% to $204 billion in the six months that followed FTX's collapse. Again, Binance remains the most dominant exchange with $1.3 trillion in derivatives trading. However, its volumes have fallen 12.9% compared to pre-FTX.","Meanwhile, decentralized exchange trading volume remained relatively stable over the same period.&nbsp;","Since the collapse of FTX, trading volumes across centralized exchanges experienced a general decline. This downturn can be attributed to three factors, according to Nansen: investor shock, the loss of trust in centralized exchanges prompting a shift towards decentralized alternatives and increased regulatory pressure on exchange platforms post-FTX.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/cryptocurrency-exchange-volume-monthly\/embed\" title=\"Cryptocurrency Monthly Exchange Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","FTX’s collapse shook the cryptocurrency industry and eroded user confidence in centralized exchanges (CEXs). As a result, exchanges have pivoted their attention from product and market expansion to prioritizing financial solvency and security. This shift was driven by growing demand from users for transparency and enhanced protection measures, according to Nansen.&nbsp;","To assure clients, centralized exchanges are now implementing proof of reserves, a measure that demonstrates the actual possession of claimed funds, injecting transparency into operations. However, many have <a href=\"https:\/\/www.theblock.co\/post\/187240\/exchanges-rushed-to-show-proof-of-reserves-its-not-enough\" data-v-f87c67ca=\"\">criticized<\/a> such measures, claiming they fail to reveal audited fiat reserves, client and company liabilities and other information to assess a firm’s financial health.","Protection funds are also meant to boost user confidence, serving as dedicated repositories to cover losses resulting from hacks or unforeseen events. Binance and Bitget are the only exchanges to disclose their protection fund wallet addresses. Notably, both platforms have increased their protection funds to $1 billion from $735 million and to $300 million from $200 million, respectively, Nansen said, leveraging its analysis of over 250 million labeled cryptocurrency wallets.","Nansen's report also highlights the mounting challenges faced by CEXs due to increased legal requirements and regulatory scrutiny following the FTX collapse, exemplified by the U.S. Securities and Exchange Commission’s recent charges against <a href=\"https:\/\/www.theblock.co\/post\/233270\/sec-sues-coinbase-binance\" data-v-f87c67ca=\"\">Coinbase<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/233146\/us-sec-sues-binance-ceo-zhao-for-breaking-securities-rules\" data-v-f87c67ca=\"\">Binance<\/a>.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"12.9%","content":"PERCENT"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Nansen","content":"PERSON"},{"type":"7.65%","content":"PERCENT"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"$444 billion","content":"MONEY"},{"type":"$1.3 trillion","content":"MONEY"},{"type":"Nansen","content":"ORGANIZATION"},{"type":"4.85%","content":"PERCENT"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$18.9 billion","content":"MONEY"},{"type":"$200 million","content":"MONEY"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"-0.2%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"$735 million","content":"MONEY"},{"type":"14.4%","content":"PERCENT"},{"type":"Bitget","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$18.2 billion","content":"MONEY"},{"type":"Alameda","content":"LOCATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"$204 billion","content":"MONEY"},{"type":"$300 million","content":"MONEY"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["FTX","KRAKEN"],"authors":["James Hunt","The Block"]}