{"summary":"However, given the “cutthroat competition,” VanEck remains “generally bearish” on the long-term value prospects for most Layer 2 tokens.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286474\/ethereum-layer-2-market-1-trillion-usd-2030-vaneck","publishDate":"2024-04-04T07:58:11","id":345,"type":null,"title":"VanEck predicts Ethereum Layer 2 tokens will reach $1 trillion valuation by 2030","category":["LAYER 2S AND SCALING"],"content":["The Ethereum Layer 2 market is expected to reach a valuation of at least $1 trillion by 2030, according to a <a href=\"https:\/\/www.vaneck.com\/us\/en\/blogs\/digital-assets\/matthew-sigel-vanecks-ethereum-layer-2s-valuation-prediction-by-2030\/\" data-v-f87c67ca=\"\">report<\/a> from investment firm VanEck.","VanEck calculated its $1 trillion base case valuation for Layer 2s by applying a free cash flow multiple of 25 to its expectations of future cash flows, assuming an Ethereum ecosystem smart contract market share of 60%. VanEck estimated the cash flows by projecting transaction revenues (inclusions of transactions on a blockchain) and maximal extractable value (revenue derived from the ordering of transactions) for the Layer 2 networks’ anticipated total addressable market.","VanEck’s estimated net revenue for the Layer 2 market by 2030 comes in at around $41 billion, leading to a fully diluted valuation of $1.02 trillion after applying the multiple. The current market cap for Layer 2 tokens is $33.3 billion, according to CoinGecko <a href=\"https:\/\/www.coingecko.com\/en\/categories\/layer-2\" data-v-f87c67ca=\"\">data<\/a>.","Ethereum has faced significant scalability challenges, struggling with high transaction fees and processing times during peak usage. Layer 2 technologies have emerged as a promising solution, enabling higher transaction volumes and cheaper fees by batching transactions off the main blockchain while retaining Ethereum’s security. Ethereum base chain transactions as a share of the ecosystem have fallen dramatically as a result of Layer 2s.","<span data-v-f87c67ca=\"\">Ethereum ecosystem transactions vs. Ethereum mainnet market share. Image: <a href=\"https:\/\/www.vaneck.com\/us\/en\/blogs\/digital-assets\/matthew-sigel-vanecks-ethereum-layer-2s-valuation-prediction-by-2030\/\" data-v-f87c67ca=\"\">VanEck<\/a>.<\/span>","VanEck analyzed 46 networks for its Layer 2 market valuation, focusing on transaction pricing, developer and user experiences, trust assumptions and ecosystem size to assess the potential for success or failure.","Zero-knowledge rollups face higher fixed costs for proof generation and verification, while optimistic rollups deal with costs related to posting transaction data to Ethereum. Innovations like EIP-4844 following <a href=\"https:\/\/www.theblock.co\/post\/282236\/ethereum-dencun-upgrade-blobs\" data-v-f87c67ca=\"\">Ethereum’s Dencun upgrade<\/a> last month reduced these expenses, particularly benefiting optimistic rollups by lowering average transaction fees, with Mantle ($0.17), zkSync ($0.21) and Starknet ($0.25) emerging as the most cost-effective chains, VanEck Head of Digital Assets Research Matthew Sigel and Senior Investment Analyst Patrick Bush said.","Optimistic rollups trust transactions by default, checking only in the event of disputes, while zero-knowledge rollups verify each transaction's validity with cryptographic proofs.","The developer experience, significantly influenced by Ethereum Virtual Machine (EVM) compatibility, was also assessed. However, the requirements of zero-knowledge rollups have led to the adoption of specialized languages like Cairo for Starknet, reflecting a trade-off between leveraging Ethereum's developer base and optimizing for Layer 2 efficiency. Additionally, some Layer 2s are exploring non-EVM languages and frameworks to attract a diverse range of developers and expand beyond Ethereum's limitations, the analysts said.","User experience is another critical battleground for Layer 2 networks, focusing on asset onboarding\/offboarding, transaction finality and the seamless integration of familiar wallets and other tools, with zero-knowledge rollups allowing quicker access to funds, Sigel and Bush said.","Trust assumptions are another factor, with Layer 2 networks tackling safety and liveness challenges by moving toward decentralized sequencer models to mitigate risks of failure and attacks. A sequencer is a component that orders and batches multiple off-chain transactions before submitting them to the Ethereum blockchain.","“To simplify our views on the set of safeguards L2s have in place, we rank them from most risky to least risky and find Arbitrum to be the current, although still inadequate, gold standard,” the analysts wrote.","<span data-v-f87c67ca=\"\">Layer 2 trust assumptions. Image: <a href=\"https:\/\/www.vaneck.com\/us\/en\/blogs\/digital-assets\/matthew-sigel-vanecks-ethereum-layer-2s-valuation-prediction-by-2030\/\" data-v-f87c67ca=\"\">VanEck<\/a>.<\/span>","Finally, VanEck evaluated the ecosystem size of Layer 2s, suggesting that the most important competitive factor was the total value locked on the networks. Sigel and Bush argued that Arbitrum, Optimism and Blast have shown they have ecosystems that matter to users, bridging $16.3 billion, $7.85 billion and $2.43 billion, respectively.&nbsp;","Arbitrum and Optimism generated particular interest via their token airdrop programs, with activity also attributed to rollup frameworks, like the OP Stack or Arbitrum Orbit.","However, the analysts saw Layer 2s trading more on speculation of long-term value accrual rather than current revenue dynamics.&nbsp;","Ultimately, the VanEck analysts expect a few general-purpose Layer 2s to dominate, though they also forecast a future of thousands of smaller use-case-specific rollups.","“Accordingly, we see cutthroat competition amongst Layer 2s where the network effect is the only moat. As a result, we are generally bearish on the long-term value prospects for the majority of Layer 2 tokens,” Sigel and Bush said.&nbsp;","“The top 7 tokens for Layer 2 collectively already have $40 billion of FDV, and there are many strong projects that intend to launch over the medium term. This means there is potentially $100 billion more in FDV in Layer 2 tokens coming to market over the next 12-18 months. It seems a bridge too far for the crypto market to absorb even limited amounts of that supply without massive discounts,” they added.","Disclaimer: This article was produced with the assistance of OpenAI’s ChatGPT 3.5\/4 and reviewed and edited by our editorial team.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$2.43 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"VanEck Head of Digital Assets Research Matthew Sigel","content":"ORGANIZATION"},{"type":"$16.3 billion","content":"MONEY"},{"type":"60%","content":"PERCENT"},{"type":"Cairo","content":"LOCATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Ethereum Virtual Machine (EVM","content":"ORGANIZATION"},{"type":"$1 trillion","content":"MONEY"},{"type":"VanEck","content":"ORGANIZATION"},{"type":"2030","content":"DATE"},{"type":"$33.3 billion","content":"MONEY"},{"type":"$0.17","content":"MONEY"},{"type":"$1.02 trillion","content":"MONEY"},{"type":"4844","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"18","content":"DATE"},{"type":"$41 billion","content":"MONEY"},{"type":"Bush","content":"PERSON"},{"type":"VanEck","content":"PERSON"},{"type":"$0.25","content":"MONEY"},{"type":"Mantle","content":"PERSON"},{"type":"$0.21","content":"MONEY"},{"type":"Patrick Bush","content":"PERSON"},{"type":"$100 billion","content":"MONEY"},{"type":"Sigel","content":"PERSON"},{"type":"$7.85 billion","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ARBITRUM","ETHEREUM","INVESTMENT FIRMS","OPTIMISM","ROLLUPS"],"authors":["James Hunt","The Block"]}