{"summary":"Monette Stephens v. Tokensoft, Inc. et al.\nPlaintiff alleges age and sex discrimination under California’s Fair Employment and Housing Act (“FEHA”)\nPlaintiff was hired as head of corporate development, for a set fee plus commission, without benefits or equity, while two younger male employees were hired as employees with benefits and equity\nThe Complaint details a narrative that excludes the plaintiff from any meaningful opportunity within the company and instead throwing full support behind the younger male employees","author":["Stephen D. Palley","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/19513\/alleged-discrimination-at-blockchain-startup","publishDate":"2019-04-14T14:35:15","id":3452,"type":null,"title":"Alleged discrimination at blockchain startup","category":["Legal"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]Monette Stephens v. Tokensoft, Inc. et al., Cal. Superior Court (County of San Francisco, Case Number CGC-19–574792, 3\/26\/2019) [SDP]<\/strong><\/em>","This lawsuit alleges age and sex discrimination under California’s Fair Employment and Housing Act (“FEHA”) against a company that describes itself as providing “institutional grade compliance for blockchain-based securities.” (As a reminder, lawsuits such as this one contains unproven allegations — the plaintiff has the burden of proof and the defendant will have the opportunity to answer and deny the allegations or seek dismissal of the claims).","According to the Plaintiff she is a 55 year old woman who is a business and technology leader with a B.S. and M.S. in Electrical and Computer Engineering who was previously qualified with Series 7, 24 and 63 FINRA investment banking qualifications. She was hired by TokenSoft’s CEO to serve as Head of Corporate Development, for a set fee plus commission, without benefits or equity.","In May 2018 she says she asked the CEO if she could accompany him to a blockchain conference in New York, presumably Consensus. He allegedly said there was no point in both of attending, but then took a dude (younger) with him instead and then hired him to be the Direct of East Coast Operations and Business Development and then (allegedly) hired another dude (also younger) to be head of Corporate Development. Both of them were hired as employees, with benefits and equity.","When she confronted TokenSoft’s CEO he then (allegedly) said “he hired them after a venture capitalist colleague advised him to hire ‘young, hungry guys,’ who would be willing to work under a primarily commission-based structure with a lower base salary than [Plaintiff].” The Complaint says the CEO didn’t allow her to attend weekly sales meetings, “even though [she] was part of the weekly sales team and responsible for business development.” The Complaint proceeds in this fashion, detailing a narrative that excludes the plaintiff from any meaningful opportunity within the company and instead throwing full support behind the younger male employees.","While most people think of the federal Equal Employment Opportunity Commission in employment discrimination cases, sex and age discrimination claims generally require the employer have a minimum number of employees for federal claims to arise. Here, the plaintiff filed under California state law, after first filing with the California State Department of Fair Employment and being given what is known as “a right to sue” by that agency.","Bottom line — it doesn’t matter whether you are a blockchain startup or a fortune 500 company, under U.S. law you can’t discriminate against people because of their age or gender. I’m not saying that happened here. The plaintiff has the burden of proof. But note that blockchain isn’t a defense to be a horse’s ass, so if your V.C. really did tell you that you should focus on hiring “young, hungry guys,” consider finding a new V.C. and definitely not repeating that comment to someone who you later fire.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part III of this week's analysis, Crypto Caselaw Minute, is above.<\/em>"],"hashtag":[]}