{"summary":"Cryptocurrency exchange Poloniex has acquired TRXMarket, a decentralized exchange (DEX) built on the TRON blockchain. TRXMarket hit a seven-day transaction volume of 30 million, CoinMarketCap shows that the exchange’s trading volume in the past 24 hours was below $40,000.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/48603\/poloniex-acquires-tron-based-dex-to-offer-decentralized-trading","publishDate":"2019-11-27T13:31:17","id":3453,"type":null,"title":"Poloniex acquires TRON-based DEX to offer decentralized trading","category":["EXCHANGES"],"content":["Cryptocurrency exchange Poloniex has acquired TRXMarket, a decentralized exchange (DEX) built on the TRON blockchain.&nbsp;","Poloniex, the exchange whose recent spinoff from Circle was partially financed by TRON founder Justin Sun, announced the acquisition on Wednesday in a <a href=\"https:\/\/medium.com\/@Poloniex\/poloniex-acquires-trxmarket-the-largest-dex-in-the-tron-ecosystem-c9039927db58\" data-v-f87c67ca=\"\">blog post.<\/a> All of TRXMarket's platform functions will remain the same under the new name Poloni DEX and Poloniex users can directly access the decentralized trading services through the exchange's official website.&nbsp;","Notably, while the blog post claims that TRXMarket hit a seven-day transaction volume of 30 million, <a href=\"https:\/\/coinmarketcap.com\/exchanges\/trx-market\/\" data-v-f87c67ca=\"\">CoinMarketCap<\/a> shows that the exchange’s trading volume in the past 24 hours was below $40,000.&nbsp;","In October, Poloniex <a href=\"https:\/\/www.theblockcrypto.com\/post\/43794\/circle-spinning-out-poloniex-plans-to-invest-100m-and-not-serve-us-clients\" data-v-f87c67ca=\"\">spun off<\/a> from Boston-headquartered Circle. The Block first <a href=\"https:\/\/www.theblockcrypto.com\/daily\/43811\/circle-insiders-say-justin-sun-is-leading-the-investment-consortium-taking-over-poloniex\" data-v-f87c67ca=\"\">reported<\/a> that Sun was behind the spinoff and the TRON founder later confirmed that he was one of the investors who funded Poloniex at the time of its departure from Circle.&nbsp;","A DEX allows users to trade while safekeeping their own private keys instead of handing them over to the exchange. According to the blog post, Poloniex acquired TRXMarket in order to expand its decentralized trading system and diversify trading options for its users—a long-term strategy that Poloniex has been working on since 2018.","<a href=\"https:\/\/www.theblockresearch.com\/spot-market-trends-binances-dominance-on-the-rise-while-bitfinex-continues-to-underperform-47846\" data-v-f87c67ca=\"\">Research<\/a> by The Block shows that Poloniex experienced a rebound in market share after its October departure. While the exchange was struggling for most of 2019 to rise above 1% market share, after the spinoff its market share hit 2% for the first time in the past several months. It is likely that the rise is due to Poloniex's new zero trading fee program, which the exchange implemented after it left Circle.","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Justin Sun","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Poloniex","content":"PERSON"},{"type":"TRON","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Poloni DEX","content":"ORGANIZATION"},{"type":"Boston","content":"LOCATION"},{"type":"1%","content":"PERCENT"},{"type":"October","content":"DATE"},{"type":"$40,000","content":"MONEY"},{"type":"Poloniex","content":"ORGANIZATION"}],"hashtag":["JUSTIN SUN"],"authors":["Yilun Cheng","The Block"]}