{"summary":"The Major Payments Institution license lets Ripple offer regulated digital asset payment services in the country. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/254590\/ripple-obtains-digital-asset-license-from-monetary-authority-of-singapore","publishDate":"2023-10-03T22:00:02","id":3455,"type":null,"title":"Ripple obtains digital asset license from Monetary Authority of Singapore","category":["REGULATION"],"content":["Blockchain payments firm Ripple has obtained a digital asset license from the Monetary Authority of Singapore.&nbsp;","Ripple's freshly received Major Payments Institution (MPI) license allows the firm to offer regulated digital asset token services in the country. The license applies to Ripple's Singapore subsidiary Ripple Markets APAC Pte Ltd.&nbsp;","“Since establishing Singapore as our Asia Pacific headquarters in 2017, the country has been pivotal to Ripple’s global business. We have hired exceptional talent and local leadership, doubling headcount over the past year and plan to continue growing our presence in a progressive jurisdiction like Singapore,” said Ripple CEO Brad Garlinghouse in a statement. “Under MAS’ leadership, Singapore has developed into one of the leading fintech and digital asset hubs striking the balance between innovation, consumer protection and responsible growth.”","Ripple intends to keep prioritizing crypto adoption in the Asia Pacific, as the region comprises one of the firm's fastest growing regions, according to a company release.","Ripple joins a slew of other high-profile web3 firms to receive a MPI license from the Monetary Authority of Singapore. Stablecoin issuer <a href=\"https:\/\/www.theblock.co\/post\/233409\/circle-mpi-singapore\" data-v-f87c67ca=\"\">Circle<\/a> received one in June of this year, followed by the major crypto exchange <a href=\"https:\/\/www.theblock.co\/post\/253755\/coinbase-granted-full-license-in-singapore\" data-v-f87c67ca=\"\">Coinbase<\/a> on Oct. 2, The Block previously reported.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Brad Garlinghouse","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"MPI","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"June of this year","content":"DATE"},{"type":"APAC Pte Ltd.","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Oct. 2","content":"DATE"},{"type":"Asia Pacific","content":"LOCATION"}],"hashtag":["ASIAN REGULATION"],"authors":["MK Manoylov","The Block"]}