{"summary":"A new class-action lawsuit has been filed against Ripple, its CEO Brad Garlinghouse and its subsidiary XRP II, LLC.\nThe case alleges that the defendants sold “millions of dollars (or more)” of XRP without registering it either with federal or Florida authorities.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/92747\/ripple-new-class-action-lawsuit-xrp-florida","publishDate":"2021-01-27T05:55:24","id":3455,"type":null,"title":"Ripple faces a new class-action lawsuit over unregistered XRP sales in Florida","category":["Ripple"],"content":["A new class-action lawsuit has been filed against Ripple, its CEO Brad Garlinghouse and its subsidiary XRP II, LLC.","Filed in the Middle District Court of Florida on Monday, <a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2021\/01\/ripple_toomey.pdf\" data-v-f87c67ca=\"\">the case alleges<\/a> that the defendants sold \"millions of dollars (or more)\" of XRP without registering it either with federal or Florida authorities.","\"On numerous occasions, Defendants made public statements claiming that XRP was not a security, when in fact it is,\" the lawsuit claims. \"Defendants actively concealed from investors the true nature of XRP.\"","The lawsuit is filed by Tyler Toomey, a resident of Florida. Toomey claims that he owned 135 XRP in November 2020 (worth about $100 at the time) and sold it in two transactions in December 2020 at a loss of about 50%.","To be sure, that is a negligible amount, but since the lawsuit is class-action, other similarly situated XRP investors in Florida could join Toomey in the case. \"Plaintiff seeks to represent a class defined as all persons or entities in the State of Florida who purchased XRP,\" the lawsuit states.","The Block has reached out to Ripple for comments and will update this story should we hear back.","This is not the first time the defendants are facing a class-action lawsuit. In 2018, investor Vladi Zakinov <a href=\"https:\/\/www.coindesk.com\/another-investor-lawsuit-claims-xrp-security\" data-v-f87c67ca=\"\">filed<\/a> a case in California alleging that XRP is a security controlled by Ripple. At the time, another investor Ryan Coffey <a href=\"https:\/\/www.coindesk.com\/investor-sues-ripple-and-alleges-xrp-is-a-security\" data-v-f87c67ca=\"\">also filed<\/a> a suit in California against the defendants, alleging that XRP is a security.","After years of regulatory uncertainty, last month, the U.S. Securities and Exchange Commission (SEC) also <a href=\"https:\/\/www.theblockcrypto.com\/linked\/88912\/sec-ripple-labs-lawsuit-filed-2\" data-v-f87c67ca=\"\">sued<\/a> Ripple, the CEO and co-founder Chris Larsen. The agency said it views XRP as a security and alleged that the defendants engaged in unregistered securities sales.&nbsp;","Ripple has maintained that XRP is not a security and has vowed to fight the SEC charges. Ripple and the SEC <a href=\"https:\/\/www.theblockcrypto.com\/post\/90437\/ripple-ceo-garlinghouse-questions-sec-lawsuit-twitter\" data-v-f87c67ca=\"\">are set to meet<\/a> for a pretrial conference on February 22. Their joint letter describing the facts of the case is due February 15."],"hashtag":["LAWSUITS","XRP"]}