{"summary":"Tether blacklisted an Ethereum address last week that had over $1 million of USDT balance in it.\nA Tether spokesperson told The Block that Tether regularly works with regulators for freezing addresses.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/129133\/tether-freezes-over-1-million-usdt-single-address","publishDate":"2022-01-04T10:23:02","id":3457,"type":null,"title":"Tether froze over $1 million worth of USDT last week","category":["Tether"],"content":["Stablecoin issuer Tether froze over $1 million worth of USDT last week, according to on-chain data.","The amount is significant, given it belongs to a single blockchain address. Tether called the \"AddedBlacklist\" function on December 30 to block <a href=\"https:\/\/etherscan.io\/address\/0xc390a623aabd2964dc72ed8a8f1bd26a8aabd200\" data-v-f87c67ca=\"\">this address<\/a> within <a href=\"https:\/\/etherscan.io\/tx\/0xa71bb2a6219fdc0f66f142ac093c0f075ee22eedaa5ba7d0f804ea641e19e6f8\" data-v-f87c67ca=\"\">this transaction.<\/a>","This address now won't be able to move the frozen funds. When Tether <a href=\"https:\/\/www.theblockcrypto.com\/news+\/76470\/stablecoins-blacklist-explainer\" data-v-f87c67ca=\"\">blacklists an address<\/a>, it freezes the USDT balance of it, as The Block has reported previously.","","","It is unclear who owns this address, which holds many other tokens in the low five-figure ranges that it hasn't transferred out. When contacted, a Tether spokesperson declined to share those details to maintain the owner's privacy but said Tether regularly works with regulators and law enforcement agencies worldwide, including on any cases related to hacks and scams, for freezing addresses.","\"Through the freezing of addresses, Tether has been able to help recover funds stolen by hackers or are compromised,\" said the spokesperson.","Tether <a href=\"https:\/\/www.theblockcrypto.com\/linked\/70981\/tether-blacklist-addresses-ethereum-usdt\" data-v-f87c67ca=\"\">began banning<\/a> blockchain addresses in 2017 and has blocked over 500 addresses to date on Ethereum, according to <a href=\"https:\/\/www.theblockcrypto.com\/data\/decentralized-finance\/stablecoins\/usdt-banned-addresses\" data-v-f87c67ca=\"\">The Block's Data Dashboard<\/a>.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/usdt-banned-addresses\/embed\" title=\"USDT Banned Addresses on Ethereum\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Tether also has <a href=\"https:\/\/www.theblockcrypto.com\/news+\/77571\/tether-usdt-recovery-mechanism\" data-v-f87c67ca=\"\">a \"recovery\" mechanism<\/a> in place, meaning it can freeze USDT and reissue them in certain cases. For example, if a user sends USDT to the wrong address, it can help recover it by freezing the USDT sent to the wrong address and reissuing new USDT to the user.","In the latest blacklisting case, however, the funds remain in the frozen address. Such cases usually mean that a frozen address is under dispute or being investigated by a law enforcement agency, said the Tether spokesperson."],"hashtag":["TETHER"]}