{"summary":"The SEC has halted the token registration of the first Wyoming-based DAO LLC.\nIt has begun administrative proceedings against the company due to “misleading” statements in its registration filings.\nThe American CryptoFed DAO LLC sought to use the path laid out in Commissioner Hester Peirce’s Token Safe Harbor proposal.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/123979\/sec-halts-token-registrations-of-wyoming-based-dao","publishDate":"2021-11-10T13:44:44","id":3462,"type":null,"title":"SEC halts token registrations of Wyoming-based DAO","category":["Regulation"],"content":["The Securities and Exchange Commission (SEC) is taking action against a Wyoming-based decentralized autonomous organization (DAO) and its planned tokens.","The securities regulator <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2021-231\" data-v-f87c67ca=\"\">announced<\/a> today it had instituted proceedings against American CryptoFed DAO LLC, which touts itself as the first DAO out of Wyoming, resulting in a freeze on the registration of its tokens. The state passed a heavily debated law earlier this year allowing DAOs to seek state charter and official recognition as limited liability companies.&nbsp;","CryptoFed filed <a href=\"https:\/\/www.theblockcrypto.com\/linked\/118030\/wyoming-based-dao-files-s-1-with-sec-for-token-distribution\" data-v-f87c67ca=\"\">an S-1<\/a> with the SEC in September of this year, formally requesting recognition from the federal agency. In its registration, it attempted to register its two tokens, Locke and Ducat. The group registered to use these tokens in a secondary market and refundable auctions at sales higher than initial value. In terms of function, the Locke token was supposedly for governance decisions, while the Ducat token was typical transactions.","In its announcement of the proceedings, the SEC said the action halts, \"the effectiveness of the company’s registration of two digital tokens as securities.\"","At the time of the S-1 filing, the DAO's organizers claimed the tokens were not securities and sought registration with the agency as utility tokens. Until the filing became effective, CryptoFed intended to distribute the tokens but restrict their trading and transferring.&nbsp;","The registrations were made in line with guidelines laid out in crypto-friendly Commissioner Hester Peirce's most recent draft of the <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1881928\/000188192821000001\/Exhibit1_ACFDAOConstitution.pdf\" data-v-f87c67ca=\"\">Token Safe Harbor proposal<\/a>. However, the SEC has not formally recognized that path, and it remains a proposal rather than guidance.&nbsp;","Still, CryptoFed filed a Form 10 related to the tokens, which is a general form for registration of securities, on Sept. 16. The SEC alleges that CryptoFed's Form 10 registration was \"materially deficient and misleading.\"&nbsp;","\"The Enforcement Division alleges that the Form 10 failed to contain certain required information about the two tokens as well as about American CryptoFed’s business, management, and financial condition, including audited financial statements,\" said the statement.","The Form 10 also contained what the SEC deemed \"inconsistent statements\" about whether Ducat and Locke were securities. It also claims that statements related to the DAO's intention to distribute made in a separate form, Form S-8, which is used to register securities offered through employee benefit plans, were misleading, since the DAO failed to disclose that its Locke tokens cannot be legally distributed despite filing this form.","Administrative proceedings will now take place to determine whether to deny CryptoFed's registrations suspend their effective date of the token registrations.&nbsp;","\"American CryptoFed’s registration of the two tokens is stayed pending a determination by an administrative law judge whether to deny or suspend the registration of the tokens,\" said the SEC."],"hashtag":["SEC"]}