{"summary":"Dallas Mavericks owner and investor Mark Cuban did a Q&A segment with WIRED magazine where he expressed his concerns with cryptocurrencies and bitcoin\nIn the segment, Cuban said that cryptocurrencies are too complex for mainstream adoption\nCuban also compared bitcoin to gold, saying it is only “worth what somebody will pay for it”","author":["Steven Zheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/41516\/mark-cuban-bullish-on-blockchain-but-would-take-bananas-over-bitcoin","publishDate":"2019-09-30T16:08:40","id":3463,"type":null,"title":"Mark Cuban bullish on blockchain, but would take bananas over bitcoin","category":["Bitcoin"],"content":["<span data-v-f87c67ca=\"\">In a Q&amp;A video<\/span> <a href=\"https:\/\/youtu.be\/DWBlN9o6Azc?t=141\" data-v-f87c67ca=\"\">segment<\/a> <span data-v-f87c67ca=\"\">with WIRED magazine, Dallas Mavericks owner and billionaire investor Mark Cuban answered a question regarding the opportunity for cryptocurrencies and ICOs.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Cuban started off saying that crypto, particularly Bitcoin is only \"worth what somebody will pay for it.\"<\/span>","<span data-v-f87c67ca=\"\">Cuban then compared bitcoins with collectibles such as baseball cards, art, and comic books, stating that \"There’s no real intrinsic value, you can’t eat a baseball card or shouldn't eat a baseball card; your artwork might look good on the wall but not much you can do with it. Bitcoin, there’s even less you can do with it. At least I can look at my baseball card...I can look at artwork.”<\/span>","<span data-v-f87c67ca=\"\">Cuban also expressed his doubt for the mainstream adoption of cryptocurrencies due to its complexity, saying \"Crypto...is so complicated for 99% of the population. Do you put it in a device? Do you print it out? How do you keep it from being hacked? Who's going to host it for you? It's just so difficult that it's only worth what somebody will pay for it.\"<\/span>","<span data-v-f87c67ca=\"\">During the segment, Cuban also compared bitcoin to gold. \"So I say it’s like gold. Gold is a religion. Now, people who are really into gold, they’ll tell you that there’s a bad depression and things go to hell in a handbasket, if you own gold then you’ll be okay. No, you won’t! You carry around a gold bar someone’s gonna hit your ass, knock you out and steal your gold bar and it’s gonna happen again and again and again. I’d rather have bananas, I can eat bananas. Crypto, not so much.”<\/span>","<span data-v-f87c67ca=\"\">Cuban, however, did conclude on a more positive note, citing the blockchain as something he can make a great argument for, and conceding that cryptocurrencies can be used as a store of value. \"There's a lot of applications, and they'll be used...but you can create a blockchain on your own without using all the available cryptocurrencies,\" he said. \"It's not that I'm against cryptocurrencies. You just have to be very careful. At best they're a store of value.\"<\/span>","<span data-v-f87c67ca=\"\">The Block reached out to Cuban directly to clarify his perspective. In an email, Cuban said \"I probably shouldn't have said bananas, since they go bad,\" adding that the WIRED segment \"was supposed to be a humorous piece.\"<\/span>","<span data-v-f87c67ca=\"\">Cuban also added that \"the rest of the point was solid. [Cryptocurrencies are] a store of value, not a currency, fiat or otherwise\" and that \"If you can get enough people buying it the value will go up. And vice versa.\"<\/span>","In August, the Dallas Mavericks <a href=\"https:\/\/www.theblockcrypto.com\/linked\/36039\/dallas-mavericks-to-accept-bitcoin-as-payment\" data-v-f87c67ca=\"\">announced<\/a> that they were going to start accepting bitcoin as payment."],"hashtag":[]}