{"summary":"Token holders of long-forgotten DeFi project Yam Finance want to dissolve the project’s treasury among themselves to salvage what’s left.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175784\/yam-dao-mulling-distribution-of-treasury-among-token-holders","publishDate":"2022-10-09T07:09:52","id":3464,"type":null,"title":"Yam DAO mulling distribution of treasury among token holders","category":["GOVERNANCE"],"content":["Token holders of DeFi project Yam Finance are debating whether to dissolve the project’s treasury and distribute the funds among token holders in an attempt to salvage what’s left of the project.","Yam Finance is an automated yield farming protocol that was born in DeFi Summer and came out of another project called YFI. It achieved initial success, <a href=\"https:\/\/decrypt.co\/39232\/yam-prepares-for-a-second-life\" data-v-f87c67ca=\"\">seeing<\/a> $600 million in assets in its first 48 hours post-launch, before it was briefly shut down due to a bug. The platform would go on to <a href=\"https:\/\/1stdigital.com\/news-and-insights\/digital-assets\/defi-what-can-the-case-of-yam-teach-us-about-yield-farming\/\" data-v-f87c67ca=\"\">become<\/a> the seventh-largest DeFi platform during the yield farming craze.&nbsp;","Still, as the DeFi hype faded and attention turned to NFTs, projects like Yam Finance lost the spotlight. As a result, its token continued to slide, falling from highs of more than $6 to its current price of $0.17. This, and a lack of meaningful progress, has caused its community to lose faith in the current trajectory.","“After years of Yam contributors making various efforts in different and sometimes conflicting directions, we believe that Yam has reached a critical juncture where it can either continue on its downward trajectory (~97.69% value destruction from ATH) or allow token holders to redeem the assets that they rightfully own,” <a href=\"https:\/\/forum.yam.finance\/t\/the-great-yamdemption\/1758\" data-v-f87c67ca=\"\">wrote<\/a> a community member called 1tx in the proposal.","Core contributors are taking more than $30,000 out of the treasury each month to fund development work, 1tx wrote, yet there was not much to show for this. The proposal would largely shut the project down, stop funding further development and split treasury assets among token holders — with anything unclaimed going to charity.","“The correct, but unfortunate, choice is that Yam should be dissolved before there is further value destruction,” the proposal said.","A core contributor known as Feddas responded strongly against the proposal, claiming that it was a tactical move by those buying the token at less than the amount that could be redeemed if the treasury were to be dissolved.&nbsp;","Beyond this, opinion was split. Two commentators agreed with the idea, noting similar points and <a href=\"https:\/\/forum.yam.finance\/t\/the-great-yamdemption\/1758\/10\" data-v-f87c67ca=\"\">claiming<\/a> that it was “better than doing nothing.”&nbsp;","On the flip side, two others argued that the core developers should be given a chance to bring the project back, <a href=\"https:\/\/forum.yam.finance\/t\/the-great-yamdemption\/1758\/9\" data-v-f87c67ca=\"\">claiming<\/a> there was “not much to lose at this point.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Summer","content":"DATE"},{"type":"$6","content":"MONEY"},{"type":"97.69%","content":"PERCENT"},{"type":"$30,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$600 million","content":"MONEY"},{"type":"Yam","content":"ORGANIZATION"},{"type":"$0.17","content":"MONEY"},{"type":"Yam","content":"PERSON"},{"type":"Yam Finance","content":"ORGANIZATION"}],"hashtag":[],"authors":["Tim Copeland","The Block"]}