{"summary":"A bug affecting older versions of a major Ethereum client is causing those nodes to split from the main network.\nThis affects around 54% of Ethereum nodes.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/115822\/bug-impacting-over-50-of-ethereum-clients-leads-to-fork","publishDate":"2021-08-27T10:40:33","id":3464,"type":null,"title":"Bug impacting over 50% of Ethereum clients leads to fork","category":["Ethereum"],"content":["A bug in older versions of the Ethereum network client Geth has caused nodes running those versions to split from the main network.","The bug impacts older versions of Geth clients, specifically v1.10.7 and earlier. These make up <a href=\"https:\/\/www.ethernodes.org\/\" data-v-f87c67ca=\"\">nearly 75%<\/a> of all Ethereum nodes, and <a href=\"https:\/\/www.ethernodes.org\/client\/geth\" data-v-f87c67ca=\"\">73% of Geth clients<\/a> are still running the older versions.","This means that around 54% of Ethereum nodes are running with a major infrastructure bug.","The concern is that this could lead to double spending attacks, where cryptocurrency is spent but then the transaction is overwritten by the alternative chain.","The Block Research has identified <a href=\"https:\/\/etherscan.io\/address\/0x1a02a619e51cc5f8a2a61d2a60f6c80476ee8ead\" data-v-f87c67ca=\"\">this address<\/a> as the one that exploited the bug and it was funded by a Tornado Cash client. The bug, which has the potential to impact other EVM-compatible chains, has also been exploited on Binance Smart Chain by <a href=\"https:\/\/bscscan.com\/tx\/0xf667f820631f6adbd04a4c92274374034a3e41fa9057dc42cb4e787535136dce\" data-v-f87c67ca=\"\">this address<\/a> and on Huobi ECO Chain by <a href=\"https:\/\/hecoinfo.com\/tx\/0xce304844c45988d493ed26895d12249b5c40e16c5b55b7b622f5c5afd75220dd\" data-v-f87c67ca=\"\">this address<\/a> (H\/t <a href=\"https:\/\/twitter.com\/peckshield\/status\/1431283854564892682\" data-v-f87c67ca=\"\">Peckshield<\/a>). It does not appear to have been exploited on Polygon.","While a portion of nodes have split off from the network, it doesn’t appear to be having huge ramifications yet. It appears that the majority of miners are running updated versions of Ethereum, meaning the hash rate is supporting the longest chain.&nbsp;","Regarding nodes running the older versions of Geth, they are effectively unable to access the main network. As a result, while there are possible exploits that could happen, the network appears to be stable for now.","Ethereum Foundation security lead Martin Swende <a href=\"https:\/\/twitter.com\/mhswende\" data-v-f87c67ca=\"\">tweeted<\/a>, “A consensus bug hit #ethereum mainnet today, exploiting the consensus-bug that was fixed in geth v1.10.8. Fortunately, most miners were already updated, and the correct chain is also the longest (canon).”","Ethereum core developer Tim Beiko <a href=\"https:\/\/twitter.com\/TimBeiko\/status\/1431278258222338056\" data-v-f87c67ca=\"\">weighed in<\/a>, saying that three mining pools appear to have been mining on the wrong version of Geth, including Flexpool, BTC.com and Binance. He said Flexpool originally reported the issue so was aware of it and that developers are getting in touch with the other two pools.","This bug was found in an audit of Telos EVM, the version of the Ethereum Virtual Machine running on the Telos blockchain, according to a <a href=\"https:\/\/www.globenewswire.com\/news-release\/2021\/08\/24\/2285779\/0\/en\/Telos-EVM-Audit-Finds-High-Severity-Security-Issue-in-Ethereum-EVM-Code.html\" data-v-f87c67ca=\"\">press release<\/a>. Guido Vranken, auditor at Sentnl, which carried out the audit, found the bug, calling it a “high severity issue.”","After Ethereum core developers were informed about the issue, they released a patch on August 24 to fix it. But this only helps those who have upgraded their nodes.","When the fix was announced, a statement said, “The exact attack vector will be provided at a later date to give node operators and dependent downstream projects time to update their nodes and software. All Geth versions supporting the London hard fork are vulnerable (the bug is older than London), so all users should update.”","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to subscribe to The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/t.me\/the_block_crypto\" target=\"_blank\" rel=\"noopener noreferrer\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Telegram<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>"],"hashtag":["ETHEREUM"]}