{"summary":"DeFi project KeeperDAO has raised “seven-figure” seed funding from Polychain Capital and Three Arrows Capital.\nKeeperDAO enables users to pool capital into Ethereum smart contracts to collectively profit from on-chain arbitrage and liquidation opportunities.\nThe liquidity pool of KeeperDAO is currently sized at 4,474 ETH (about $1.5 million).","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/73545\/defi-project-keeperdao-seed-round","publishDate":"2020-07-31T04:25:40","id":3466,"type":null,"title":"DeFi project KeeperDAO raises &#x27;seven-figure&#x27; seed funding to build liquidity pool","category":["DeFi"],"content":["<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">KeeperDAO, an on-chain liquidity underwriter for decentralized finance (DeFi) protocols, has raised seed funding from notable investors.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The \"seven-figure\" seed round, i.e. worth more than $1 million, was led by Polychain Capital and Three Arrows Capital, KeeperDAO co-founder Tiantian Kullander, told The Block.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The KeeperDAO project was&nbsp;<\/span><a class=\"_e75a791d-denali-editor-page-rtfLink\" href=\"https:\/\/medium.com\/keeperdao\/introducing-keeperdao-an-on-chain-liquidity-underwriter-dbb63731f4a5\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">first revealed<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\"> in December, as a joint effort between Amber Group and Talo Systems. Amber is Kullander's crypto trading and market-making firm, and Talo is a blockchain research firm run by Taiyang Zhang, who is also the CEO of DeFi protocol Ren. Kullander and Zhang jointly manage the KeeperDAO project.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">KeeperDAO is on-chain liquidity underwriter for DeFi protocols, meaning it enables users to pool capital into Ethereum smart contracts to collectively profit from on-chain arbitrage and liquidation opportunities.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"The&nbsp;<\/span><a class=\"_e75a791d-denali-editor-page-rtfLink\" href=\"https:\/\/www.theblockcrypto.com\/post\/70567\/defi-hits-2-billion-in-total-value-locked-compound-snatches-makerdaos-top-spot\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">growth of DeFi<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;means increased reliance on external liquidators and arbitrageurs to ensure orderly markets,\" said Kullander. \"With a system that incentivizes collaboration amongst keepers, over time this will allow lending platforms and margin trading exchanges to lower their collateralization requirements. To this end, the system acts as a self-governing insurance fund for DeFi of sorts.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">KeeperDAO said, using its system, users can exploit more on-chain profit opportunities presented by protocols such as MakerDAO and Compound than they would be able to capture as individuals. Such opportunities, however, are mainly available in times of high volatility. So in periods of low volatility, KeeperDAO said it utilizes assets held by the liquidity pool to loan out on markets such as Compound and dYdX.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">There are currently 208 unique depositors to KeeperDAO's liquidity pool, and the pool is currently sized at 4,474 ETH (worth about $1.5 million), according to a&nbsp;<\/span><a class=\"_e75a791d-denali-editor-page-rtfLink\" href=\"https:\/\/explore.duneanalytics.com\/public\/dashboards\/RVyXbw2l5EuqnnDw5tDmbXdW3Pf9bgKgxtZdzXIh\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Dune Analytics<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;dashboard shared by Kullander.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"As DeFi continues its torrential growth, KeeperDAO and its cryptoeconomic incentives will help keep Ethereum onchain liquidations efficient and ensure that keepers can earn their keep,\" said Su Zhu, CEO and CIO of Three Arrows Capital.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">KeeperDAO is also planning to issue its own governance token to use it as a balancing mechanism to manage incentives between keepers and liquidity providers. The token will be launched with an incentive program, Kullander told The Block, without disclosing a specific timeline.&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"We can think of the governance token as a form of tokenized volatility on Ethereum,\" said Zhang.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">There are currently six people working for KeeperDAO, two more are joining soon, and the project is looking to hiring more staff, Kullander told The Block. The project has no plans to raise more funding in the near future, said Kullander.<\/span>"],"hashtag":["THREE ARROWS CAPITAL"]}