{"summary":"A New York district court judge’s order revealed what prosecutors may or may not bring up in the trial against Sam Bankman-Fried next week. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/253074\/sam-bankman-fried-cant-tell-jury-that-hes-been-waiting-for-trial-in-jail","publishDate":"2023-09-26T15:16:35","id":3470,"type":null,"title":"Sam Bankman-Fried can&#x27;t tell jury that he&#x27;s been waiting for trial in jail","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Sam Bankman-Fried won't be able to tell the jury about his pre-trial detention after a New York&nbsp;<\/span><span class=\"s1\" data-v-f87c67ca=\"\">district court judge ruled on a series of motions about what may be brought up in the trial that's due to start next week.&nbsp;<br data-v-f87c67ca=\"\">\n<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">For example, the former FTX CEO will not be able to argue or present evidence around his family background, age or health — and that he's <\/span><span class=\"s1\" data-v-f87c67ca=\"\">been waiting for the trial to start from jail.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The government moves to preclude defendant from presenting evidence or argument 'concerning his family background, health, age, pretrial detention, or any other similar factors…absent a showing that such a factor bears on his guilt,'\" <\/span>Judge Lewis Kaplan wrote in a court&nbsp;<a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.nysd.590940\/gov.uscourts.nysd.590940.289.0.pdf\" data-v-f87c67ca=\"\">filing<\/a> on Tuesday, granting the motion.","<span class=\"s1\" data-v-f87c67ca=\"\">Bankman-Fried has been <a href=\"https:\/\/www.theblock.co\/post\/252435\/us-court-of-appeals-rejects-sam-bankman-frieds-efforts-for-pre-trial-release\" data-v-f87c67ca=\"\">sitting in jail<\/a> for over a month after <\/span><span class=\"s2\" data-v-f87c67ca=\"\">prosecutors accused him of witness tampering by leaking the private diary of former colleague and ex-girlfriend Caroline Ellison to the New York Times and using an encrypted message app to contact a potential witness.&nbsp;<\/span>","The judge appeared to set the stage for a trial that will stick narrowly to the specific allegations being brought by prosecutors, leaving out many hot-button topics that have fueled media coverage since the crypto exchange collapsed last year.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">Bankman-Fried<\/span> was precluded from \"referring to any alleged prior <a href=\"https:\/\/www.theblock.co\/post\/250602\/sbf-lawyers-want-to-quiz-jurors-on-thoughts-about-crypto-body-language\" data-v-f87c67ca=\"\">good acts<\/a> by the defendant, including any charity or philanthropy, as indicative of his character or his guilt or innocence.\"","He also won't be allowed to argue or introduce \"evidence regarding whether FTX needed to declare bankruptcy, whether it was good for FTX and its customers to declare bankruptcy, whether the defendant supported the bankruptcy petition, whether the exchange would be operational today but for the bankruptcy&nbsp;and\/or whether the General Counsel of FTX US and outside attorneys at Sullivan &amp; Cromwell caused FTX declare bankruptcy so that they could benefit financially.\"","In an <a href=\"https:\/\/www.theblock.co\/post\/187767\/sam-bankman-fried-says-fck-regulators-in-wide-ranging-interview-with-vox\" data-v-f87c67ca=\"\">infamous interview<\/a> last year, Bankman-Fried said he regretted filing for Chapter 11 bankruptcy protection and that \"everything would be ~70% fixed right now if I hadn't.\"&nbsp;","<span class=\"s2\" data-v-f87c67ca=\"\">Prosecutors had moved to prevent Bankman-Fried from \"<\/span><span class=\"s1\" data-v-f87c67ca=\"\">cross-examining witnesses about their recreational drug use.\" Kaplan denied that motion, but said the former FTX CEO should not bring up the topic without giving prior notice to the court and prosecutors.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Prosecutors will be allowed to show evidence concerning Bankman-Fried's political contributions.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Evidence of defendant’s alleged illegal campaign finance scheme is direct evidence of the charged offenses,\" Kaplan said on Tuesday. \"Such evidence is intertwined inextricably with the evidence regarding the charged wire fraud scheme on customers of FTX and necessary to complete the story of the charged crimes on trial.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Prosecutors dropped campaign finance charges against Bankman-Fried in July, citing a complication related to the U.S.’s extradition treaty with the Bahamas. However, a campaign finance-related charge is included in a wire fraud <a href=\"https:\/\/www.theblock.co\/post\/243767\/doj-will-still-argue-campaign-finance-charges-against-sam-bankman-fried\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">charge<\/span><\/a>.&nbsp;<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"70%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Kaplan","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"General Counsel of FTX","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Sullivan &amp; Cromwell","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bahamas","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"Lewis Kaplan","content":"PERSON"}],"hashtag":["FTX","SBF TRIAL"],"authors":["Sarah Wynn","The Block"]}