{"summary":"Blockchain analytics firm TRM Labs has raised $14 million in a Series A funding round led by Bessemer Venture Partners.\nWith fresh capital at hand, TRM looks to expand its current team of 30 to 100 by the end of this year, CEO Esteban Castano told The Block. ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/108737\/blockchain-analytics-firm-trm-labs-raises-14-million-series-a","publishDate":"2021-06-17T10:00:31","id":3470,"type":null,"title":"Blockchain analytics firm TRM Labs raises $14 million Series A","category":["Venture Capital"],"content":["Blockchain analytics firm TRM Labs announced Thursday that it has raised $14 million in a Series A funding round.","The round was led by Bessemer Venture Partners, an investor in companies like LinkedIn and Shopify, with participation from several other existing and new investors. These include PayPal Ventures, Initialized Capital, Jump Capital, Salesforce Ventures, Y Combinator, unnamed executives from Google and Plaid, and several others.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAs part of the deal, Bessemer partner Ethan Kurzweil has joined the TRM board.","With fresh capital at hand, San Francisco-based TRM plans to grow its business and expand its current team of 30 to 100 by the end of this year, the firm's co-founder CEO Esteban Castano told The Block. TRM is hiring data engineers, data scientists, threat intelligence analysts, and sales and marketing staff, Castano said.","Founded in 2017, TRM Labs provides blockchain analytics tools to help financial institutions, government agencies, and crypto firms detect and manage crypto-related fraud and financial crime. Castano said TRM is seeing a surge in demand from clients and has seen its business grow 600% year-over-year.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nWhen asked what is TRM's competitive edge over rivals such as Chainalysis and Elliptic, Castano said TRM has the \"largest coverage of ransomware and emerging risks on blockchains\" with over 80 different risk categories.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"TRM is the first and only blockchain intelligence platform with native cross-chain analytics, meaning that customers can understand activity across blockchains, not just within them,\" said Castano. TRM supports 360,000 digital assets across 20 blockchains, Castano added.","TRM's Series A comes as <a href=\"https:\/\/www.theblockcrypto.com\/linked\/106958\/biden-white-house-ransomware-cryptocurrency\" data-v-f87c67ca=\"\">the Biden administration is expanding cryptocurrency analysis<\/a> to trace ransomware-tied transactions. When asked whether TRM has U.S. government agencies as clients, Castano said yes, but declined to share names.","The Series A brings TRM's total funding to date to around $20 million. In 2019, TRM <a href=\"https:\/\/www.theblockcrypto.com\/linked\/47604\/crypto-risk-management-platform-trm-labs-raises-4-2m-from-investors-including-paypal-and-y-combinator\" data-v-f87c67ca=\"\">raised<\/a> $4.2 million and $1.7 million in a round before that. Castano declined to share the firm's valuation from the latest round."],"hashtag":[]}