{"summary":"Cryptocurrency prime brokerage Tagomi today launched a lending and borrowing platform\nIn traditional asset classes, investors usually use lending and borrowing services to facilitate short trades, although these services barely exist in cryptocurrencies  ","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/39574\/crypto-broker-tagomi-launches-lending-and-borrowing-services-to-facilitate-short-selling","publishDate":"2019-09-12T16:51:18","id":3471,"type":null,"title":"Crypto broker Tagomi launches lending and borrowing services to facilitate short selling","category":["Lending"],"content":["<span data-v-f87c67ca=\"\">Cryptocurrency agency broker Tagomi is taking another step to build a Wall Street-like market structure in cryptocurrencies, this time by launching a lending and borrowing platform.&nbsp; <\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Peter Thiel-backed firm today announced a service that allows institutional clients to lend and borrow bitcoin and ethereum from an array of counterparties that Tagomi partners with, ranging from crypto-native over-the-counter trading desks to traditional hedge funds. With these new services, Tagomi aims to enable clients to sell short \"in one click,\" according to Tagomi COO Kevin Johnson.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In traditional asset classes, lending and borrowing services, which facilitate long and short trades, are so common that they are usually “taken for granted,” said Dennis Chou, director of trading at Pantera Capital. However, in the nascent digital asset industry, these services barely exist.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Currently, to do a short trade or lend out their digital assets, investors have to review different lending platforms individually and manage portfolios on them separately. This is a cumbersome process that’s not seen in traditional asset classes, said Johnson.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“There are a lot of things that we are used to having in other asset classes that yet to exist for crypto or frankly, are harder for crypto. In equities, if I am a client and I have a prime broker, I want to short IBM on Monday and then it magically happens. You don’t even have to know that behind the scenes, your prime broker is doing all these different things for you. In crypto, it’s very different,” Johnson told The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Although many cryptocurrency exchanges also run their own peer-to-peer lending marketplaces, Tagomi does not include any exchanges as lending partners. The firm also tries to differentiate itself from these exchanges by providing better interest and collateral rates across different counterparties.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“[On exchange-run lending platforms], you are locked into one pool of lenders, you are paying, generally, a much higher rate than you have to pay if you are using one of the centralized counterparties, and you have only one order book to short into,” said Tagomi COO Kevin Johnson.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Founded in 2017, Tagomi branded itself as the first digital asset prime broker, something familiar to traditional investors but had not been widely available in cryptocurrencies. The company was backed by Peter Thiel’s Founders Fund, Digital Currency Group, Pantera Capital, and others.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Our clients do not have to worry about that evolution behind the scene,” said Johnson. “We will just continue to innovate and give them more features, but in the meantime, they have an interface that feels like a traditional asset class, we are going to help bridge their experience as the environment grows up.\"<br data-v-f87c67ca=\"\">\n<\/span>"],"hashtag":[]}