{"summary":"The Wells Notice relates to aspects of the company’s exchange, its staking service Coinbase Earn, and Coinbase Wallet, Coinbase said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/222084\/sec-investigating-coinbase-for-its-earn-product-wallet-service-and-exchange-activity","publishDate":"2023-03-22T17:29:20","id":3472,"type":null,"title":"SEC investigating Coinbase for its Earn product, wallet service and exchange activity","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Exchange giant Coinbase was issued a Wells Notice by the Securities and Exchange Commission, notifying the company of investigations into several offerings and continuing a string of regulatory warning shots fired at crypto firms in the U.S.&nbsp;<\/span>","The notice relates to aspects of the company’s exchange, its staking service, Coinbase Earn and Coinbase Wallet, the company wrote in a <a href=\"https:\/\/www.coinbase.com\/blog\/we-asked-the-sec-for-reasonable-crypto-rules-for-americans-we-got-legal\" data-v-f87c67ca=\"\">blog post<\/a>.","\"Today, the SEC gave Coinbase a 'Wells Notice' regarding aspects of the company’s exchange, our staking service Coinbase Earn, and Coinbase Wallet after a cursory investigation,\" Coinbase said.","\"Today’s Wells Notice does not provide a lot of information for us to respond to,\" the company said. \"The SEC staff told us they have identified potential violations of securities law, but little more.\"","Coinbase added that it will operate products and services as usual.","<span data-v-f87c67ca=\"\">A Wells Notice is a document the regulator issues to entities that are under investigation — it does not necessarily imply a conclusion or foregone action.&nbsp;<\/span>","“We are prepared for this disappointing outcome and confident in the legality of our assets and services,\" Coinbase's Chief Legal Officer Paul Grewal said in a statement. \"If needed, we welcome a legal process to provide the clarity we have been advocating for and to demonstrate that the SEC simply has not been fair or reasonable when it comes to its engagement on digital assets.\"","The blog post states that the company has met with the SEC more than 30 times in the past nine months alone, but it has been unresponsive. It added that it has rejected more than 90% of assets that apply to be listed on the platform.&nbsp;","<span data-v-f87c67ca=\"\">The news comes as regulatory scrutiny ramps up with regards to staking, among other products. In February, rival exchange Kraken settled a case with the SEC over charges related to its <a href=\"https:\/\/www.theblock.co\/post\/210332\/kraken-settles-sec-charges-over-its-staking-program\" data-v-f87c67ca=\"\">staking-as-a-service program,<\/a> leading it to shut down those operations in the U.S. and pay a $30 million fine. The regulator charged the company with selling unregistered securities because of the expectation of return from the staking-as-a-service program. Coinbase has publicly asserted that its own staking activity does not fall afoul of U.S. securities law.&nbsp;<\/span>","\"Staking is not a security under the U.S. Securities Act, nor under the <a class=\"c-link\" href=\"https:\/\/www.sec.gov\/corpfin\/framework-investment-contract-analysis-digital-assets\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.sec.gov\/corpfin\/framework-investment-contract-analysis-digital-assets\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Howey test<\/a>, which the SEC uses to determine whether an investment contract is a security,\" Grewal wrote in a post soon after the SEC's settlement with Kraken.&nbsp;","The move was a signal of more headaches for crypto companies in the U.S. as the SEC looked to further crack down on the passive investment offering after several high-profile failures left customers in court trying to reclaim their funds.","The notice also follows former Coinbase product manager Ishan Wahi pleading guilty to wire fraud-related criminal charges <a href=\"https:\/\/www.theblock.co\/post\/209149\/former-coinbase-product-manager-pleads-guilty-to-criminal-charges-in-landmark-case\" data-v-f87c67ca=\"\">in February<\/a>.&nbsp;","That guilty plea may moot a legal argument in separate civil charges brought by the SEC as to whether the nine tokens in question are securities; the SEC has argued that they are, but are not properly registered. Lawyers for Wahi filed a motion to dismiss that case. <span class=\"s1\" data-v-f87c67ca=\"\">The Justice Department said Wahi tipped off his friend and brother about which tokens were going to be listed for trading on Coinbase — and in the process made over $1 million. The civil case remains ongoing, pending Wahi's expected sentencing in coming months.&nbsp;<\/span>","That case could leave the industry in the lurch. The judge would just need to decide that one of the tokens involved is a security, and the SEC could apply that to other market participants trading them, <a href=\"https:\/\/www.theblock.pro\/news\/post\/206002\/sec-case-against-former-coinbase-manager\" data-v-f87c67ca=\"\">experts have said<\/a>. In the lawyers' motion to dismiss the case, they argued that the tokens were not securities and warned of broader implications.","Coinbase had investigated Wahi's activity itself prior to the criminal and civil indictments, and is not accused of wrongdoing.&nbsp;","Nasdaq-listed Coinbase's stock dropped as much as 11.6% in after hours trading following the news, to trade at around $70.80. This time last year, its stock was trading at $183.00.&nbsp;","COIN chart by <a href=\"https:\/\/www.tradingview.com\/symbols\/NASDAQ-COIN\/\" data-v-f87c67ca=\"\">TradingView<\/a>","<em data-v-f87c67ca=\"\">Updated with Coinbase stock movement after publication.<\/em>","<em data-v-f87c67ca=\"\">With additional reporting by <a href=\"https:\/\/www.theblock.co\/author\/adam-morgan-mccarthy\" data-v-f87c67ca=\"\">Adam Morgan McCarthy<\/a>.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"Today","content":"DATE"},{"type":"$70.80","content":"MONEY"},{"type":"TradingView","content":"ORGANIZATION"},{"type":"Wells Notice","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"11.6%","content":"PERCENT"},{"type":"$183.00","content":"MONEY"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Ishan Wahi","content":"PERSON"},{"type":"Coinbase Wallet","content":"ORGANIZATION"},{"type":"\" Grewal","content":"PERSON"},{"type":"Adam Morgan McCarthy","content":"PERSON"},{"type":"Justice Department","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"$30 million","content":"MONEY"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Wahi","content":"PERSON"},{"type":"$1 million","content":"MONEY"},{"type":"Coinbase Earn","content":"ORGANIZATION"},{"type":"Howey","content":"PERSON"},{"type":"Paul Grewal","content":"PERSON"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["COINBASE","SEC"],"authors":["Lucy Harley-McKeown","Sarah Wynn","The Block"]}