{"summary":"TRON founder Justin Sun stood behind his decision to install a hardfork on the Steem Network against the will of the community\nHuobi and Binance, both of which supported TRON’s network takeover with an overwhelming amount of stake, denied claims of bribery and pulled their witness votes\nSome Steemit employees – including its lead blockchain developer and head of communications – resigned from their posts, while community developers continued to protest","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/57607\/justin-sun-stands-by-trons-decision-to-overturn-community-governance-rule","publishDate":"2020-03-03T11:56:52","id":3473,"type":null,"title":"Justin Sun stands by TRON&#x27;s decision to overturn community governance rule","category":["Layer 1s"],"content":["<span data-v-f87c67ca=\"\">Following yesterday’s controversy around TRON’s “hostile takeover” over the Steem network, its founder Justin Sun came in and defended his action to overturn the community’s governance decision.<\/span>","<span data-v-f87c67ca=\"\">Per <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/57508\/tron-steem-takeover-crypto-exchanges-governance-reversal-soft-fork-blockchain\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Monday’s development<\/span><\/a><span data-v-f87c67ca=\"\">, Steemit and TRON unilaterally enforced a hardfork to install 20 of their own witnesses with help from top exchanges including Huobi, Binance, and Poloniex. The two firms then declared that they were to remain control of the network for the next four to six weeks in order to <\/span><a href=\"https:\/\/steemit.com\/tron\/@steemitblog\/an-open-letter-to-the-community-hf22-5\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">“resume the order of the community.”<\/span><\/a>","<span data-v-f87c67ca=\"\">Approximately 11 hours ago, Sun responded to the incident in a <\/span><a href=\"https:\/\/twitter.com\/justinsuntron\/status\/1234690483298820097?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Twitter thread<\/span><\/a><span data-v-f87c67ca=\"\">, restating his position that the community’s decision to implement Softfork 22.2 was “criminal.”<\/span>","<span data-v-f87c67ca=\"\">“#STEEM has successfully defeated the hackers &amp; all funds are super #SAFU. @SteemNetwork and @steemit community is now stronger than ever since we united &amp; solved the difficulties,” he said.<\/span>","<span data-v-f87c67ca=\"\">“On Feb 22, some malicious hackers froze 65 million<\/span><span data-v-f87c67ca=\"\"> #STEEM<\/span><span data-v-f87c67ca=\"\"> legally owned by Steemit, the core STEEM developers. When we found out, the hackers already hijacked STEEM &amp; threatened to nullify the existing STEEM. We had a difficult choice,” he continued. “We double confirmed w\/ lawyers &amp; were told this was definitely a criminal activity from the hackers who froze over 10 million dollars worth of STEEM &amp; threatened to destroy the assets. The risk of nullifying the<\/span><span data-v-f87c67ca=\"\"> #STEEM<\/span><span data-v-f87c67ca=\"\"> network puts every STEEM holders’ interest in danger.”<\/span>","<span data-v-f87c67ca=\"\">Sun then attempted to pacify community outrage by confirming that TRON and Steemit plan to withdraw their votes as soon as they see no more foreseeable threats to the network.<\/span>","<span data-v-f87c67ca=\"\">“We will commit to withdrawing the votes ASAP once we're sure malicious hackers can’t sabotage<\/span><span data-v-f87c67ca=\"\"> #STEEM<\/span><span data-v-f87c67ca=\"\"> anymore &amp; will give the voting rights back to the community. All exchanges’ votes will be withdrawn soon. Shoutout to all the exchanges &amp; parties who helped us save STEEM!” he said.<\/span>","<b data-v-f87c67ca=\"\">Exchanges denied bribery claim and signaled stake withdrawal<\/b>","<span data-v-f87c67ca=\"\">A number of observers suspected that TRON bribed the exchanges into staking over 45 million STEEM Power in the network. Ethereum Foundation Vitalik Buterin, for example, <a href=\"https:\/\/twitter.com\/VitalikButerin\/status\/1234522463129800709?s=20\" data-v-f87c67ca=\"\">called<\/a> the incident possibly “the first big instance of a 'de facto bribe attack' on coin voting.”<\/span>","<span data-v-f87c67ca=\"\">Binance and Huobi, however, denied such claims and withdrew their witness votes.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On Monday, Binance CEO Changpeng Zhao acknowledged his approval of the hardfork in a <\/span><a href=\"https:\/\/twitter.com\/cz_binance\/status\/1234565384327585792?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">tweet<\/span><\/a><span data-v-f87c67ca=\"\">. But he also suggested that Binance did not receive any monetary incentives from TRON and pledged neutrality.<\/span>","<span data-v-f87c67ca=\"\">\"I was made aware of this upgrade\/hardfork beforehand, and approved it. Projects do this all the time, and we are usually just in a supportive position,\" Zhao said, going on to note in a subsequent <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1234577727077916673\" data-v-f87c67ca=\"\">tweet<\/a>.<\/span><span data-v-f87c67ca=\"\">: <\/span><span data-v-f87c67ca=\"\">\"We didn’t take a penny, thought it was a regular upgrade\/hard fork.\"<\/span>","<span data-v-f87c67ca=\"\">\"<\/span>Binance have no interest in chain governance. We stay neutral,\" he said in another <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1234676941111742467?s=20\" data-v-f87c67ca=\"\">tweet<\/a>.","<span data-v-f87c67ca=\"\">Huobi issued a similar statement this morning, claiming that the exchange decided to get involved after TRON reached out to them and gave the impression that there were “malicious activities and attacks” on the Steem network.<\/span>","<span data-v-f87c67ca=\"\">“We were informed that the Steem network was at immediate risk of an attack, an issue that directly impacts our users’ assets,” the statement said. “We decided that helping Steemit and Tron was in the best interest of our users — and the network at large.”&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“However, this action is not final,” the statement continued. “Thus we have removed the vote and will always stand behind the decisions of our users.\"<\/span>","<span data-v-f87c67ca=\"\">Regarding the allegation of bribery, a Huobi spokesperson told The Block that “Huobi did not accept any payment in exchange for support.”<\/span>","Notably, even though Binance and Huobi withdrew their witness votes, there is currently a 13-week power-down period for STEEM tokens, which means that the exchanges would not be able to take out their stake immediately. The Steemit team is currently working on an emergency hardfork to reduce the time to 1-3 days.","<span data-v-f87c67ca=\"\">Poloniex has not issued any statement or responded to our inquiry at the time of writing.<\/span>","Curiously, as flagged on <a href=\"https:\/\/twitter.com\/lukestokes\/status\/1234842595613925376?s=20\" data-v-f87c67ca=\"\">Twitter<\/a>, there is now another account voting in support of TRON's monology over the network.&nbsp;","<b data-v-f87c67ca=\"\">Community backlash<\/b>","<span data-v-f87c67ca=\"\">The “hostile takeover” has prompted a number of Steemit staff to resign from their posts and some developers to deactivate their Steem DApps.<\/span>","<span data-v-f87c67ca=\"\">Steemit’s head of communications <\/span><a href=\"https:\/\/steemit.com\/steemit\/@andrarchy\/my-resignation-from-steemit\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Andrew Levine<\/span><\/a><span data-v-f87c67ca=\"\">, senior blockchain developer<\/span><a href=\"https:\/\/steemit.com\/steemit\/@vandeberg\/an-update\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> Michael Vandeberg<\/span><\/a><span data-v-f87c67ca=\"\">, and software engineer <\/span><a href=\"https:\/\/steemit.com\/steemit\/@gerbino\/a-new-chapter\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Steve Gerbino<\/span><\/a><span data-v-f87c67ca=\"\"> all announced their resignation following yesterday’s event.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Some developers have also taken down their applications built on Steem in protest of the hardfork. The team behind Steem Wallet <\/span><a href=\"https:\/\/twitter.com\/roelandp\/status\/1234450200908849152?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">removed<\/span><\/a><span data-v-f87c67ca=\"\"> its app from the Apple App Store, and Steen Engine Tools temporarily shut down its website.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I've been building a dApp on #Steem for 2 years,” <\/span><a href=\"https:\/\/twitter.com\/FredrikAarresta\/status\/1234532194179264512?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">tweeted<\/span><\/a><span data-v-f87c67ca=\"\"> Fredrik Aarrestad, lead business developer at SteemPress. “Now we're told we're going to \"migrate\" to #Tron (without being informed before action was taken)... Sunk thousands of hours into building on this blockchain.”<\/span>"],"hashtag":["BINANCE","HTX","JUSTIN SUN"]}