{"summary":"Bitcoin’s volatility needs to recede for its price to remain high at around current levels, according to JPMorgan strategists.\nThey said bitcoin’s recent movements “appear to have been more influenced by speculative flows.”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/95115\/bitcoin-btc-price-looks-unsustainable-unless-volatility-decreases-jpmorgan","publishDate":"2021-02-17T05:35:15","id":3474,"type":null,"title":"Bitcoin&#x27;s current price &#x27;looks unsustainable&#x27; unless volatility decreases, says JPMorgan","category":["Bitcoin"],"content":["Bitcoin's volatility needs to recede for its price to remain high at around current levels, according to JPMorgan strategists.","In a <a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2021\/02\/Flows-Liquidity_16Feb21.pdf\" data-v-f87c67ca=\"\">note published<\/a> Tuesday, JPMorgan strategists led by Nikolaos Panigirtzoglou wrote that \"unless bitcoin volatility subsides quickly from here,\" its current price of around $50,000 \"looks unsustainable.\"","Bitcoin has been breaking records in recent months. It is currently trading above $51,500.<br data-v-f87c67ca=\"\">\n<iframe title=\"BTC Price\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/btc-price\/embed\" width=\"100%\" height=\"420\" frameborder=\"0\" data-v-f87c67ca=\"\"><\/iframe>","JPMorgan said bitcoin's market capitalization has increased by about $700 billion since last September, although it has seen institutional inflows of only around $11 billion.","How is it possible? There are likely two reasons, according to the strategists. First, an increase in interest from real money investors and speculative investors. Second, significantly high retail inflows.","\"Movements since January this year appear to have been more influenced by speculative flows,\" said the strategists. \"This also suggests that some pickup in real money flows would likely be needed to sustain current prices in the absence of a re-acceleration of the retail flow.\"","As for retail inflows, they said, \"the US retail impulse has been particularly strong since January and there is little doubt that this retail impulse has been a driving force not only for equities, but also for bitcoin.\"","","","The strategists compared bitcoin's volatility with gold's and said that bitcoin and its biggest fund — Grayscale Bitcoin Trust (GBTC) — on average consume 6.2x more risk capital than gold and its biggest fund — GLD — the largest gold exchange-traded fund by assets under management. <a href=\"https:\/\/www.investopedia.com\/terms\/r\/riskcapital.asp#:~:text=Risk%20capital%20refers%20to%20funds,risk%2C%20high%2Dreward%20investments.&amp;text=In%20the%20context%20of%20venture,promising%2C%20but%20unproven%2C%20startup.\" data-v-f87c67ca=\"\">Risk capital refers to<\/a> funds allocated to speculative activity and used for high-risk, high-return investments.","JPMorgan strategists also commented on recently launched ether (ETH) futures by CME Group and said that ETH futures' initial slow traction is similar to what CME bitcoin futures saw in their early days.","\"But in our opinion, it will likely not take as long for Ethereum futures to begin gaining traction as it initially took for Bitcoin futures, as investor interest in cryptocurrencies has had a few years to mature,\" said the strategists."],"hashtag":["BITCOIN","JPMORGAN"]}