{"summary":"As the market for decentralized exchange trading heats up, another firm is getting in on the action.\nA former Polychain incubee, DerivaDEX, expects to launch in late July.\nUnlike other venues, DerivaDEX leverages SGX-enabled trusted execution environments to provide real time price feeds and highly performant matching & liquidation engines.","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/70248\/polychain-dex-market-crowd","publishDate":"2020-07-02T12:00:22","id":3475,"type":null,"title":"A Polychain-backed DEX vies for dominance in a crowded market with new governance, tech approach","category":["The Block"],"content":["As derivatives continue to take center stage in the market for crypto trading, a similar trend is starting to play out in the non-custodial exchange space as well.","<a href=\"https:\/\/medium.com\/derivadex\/introducing-derivadex-a-next-generation-decentralized-exchange-for-derivatives-62cc0ab8ee7d\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">DerivaDEX<\/a>, a new Ethereum-based decentralized derivatives exchange, offers the latest example, having recently scored $2.7m in venture funding from crypto investment funds, including Polychain, Dragonfly and Three Arrows Capital.","Led by ex-DRW quant strategist Aditya Palepu and former software consultant, Frederic Fortier, DerivaDEX was incubated in Polychain Capital’s accelerator program, Genesis, where the team worked closely with partners Olaf Carlson-Wee and Niraj Pant to build a platform that aims to offer the best of both derivatives and decentralization.","Expected to launch in late July, the platform will start by offering maximum leverage as high as 25x and support Bitcoin and Ether perpetual swaps. The products will be margined and settled in Tether's USDT.","The firm comes online during a red-hot moment for the decentralized spot and derivatives exchange space. As previously reported, DEX venues <a href=\"https:\/\/www.theblockcrypto.com\/post\/70137\/june-dex-volume-all-time-high\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">saw their busiest month<\/a> ever ($1.51 billion) in terms of trading volume in June, up 70% versus May and 46% from its all-time-high in March.","","","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Source: The Block, Dune Analytics<\/em><\/span>","Naturally, as product-market-fit becomes progressively more obvious, the non-custodial exchange landscape is becoming increasingly crowded.","Incumbent dYdX <a href=\"https:\/\/www.theblockcrypto.com\/post\/62368\/dydx-a16z-decentralized-bitcoin-perpetual-contracts\" data-v-f87c67ca=\"\">launched<\/a> a Bitcoin perpetual swap market in April, and China-based MCDEX currently offers Ether swaps. Futureswap, another offering, saw over $13 million during its three-day alpha test. But the DerivaDEX's investors believe that Palepu and Fortier’s experience in the traditional trading world can translate to a unique ‘best-of-both-worlds’ experience for traders; CMS’ Bobby Cho expressed relief that the team “already had a solid understanding of markets.”","And while competition does exist, it is still relatively early days.","\"We think there could be multiple winners and early mover advantage is important,\" observed Kyle Davies, co-founder of Three Arrows Capital and one of the more active participants in the centralized cryptocurrency derivatives market.","In some respects, DerivaDEX looks similar to the litany of order book-based DEX offerings on the market. Traders maintain custody over their funds at all times, orders are submitted and matched off-chain, and after some time, trades are settled on the Ethereum network.","But behind the scenes, DerivaDEX represents a new breed of DEX, according to its founders. Taking inspiration from their previous work at Enigma, DerivaDEX leverages Software Guard Extensions (SGX)-enabled trusted execution environments (TEEs), which allow software to execute within secure, tamper-proof enclaves. Although security researchers have previously <a href=\"https:\/\/arxiv.org\/pdf\/1802.09085.pdf\" data-v-f87c67ca=\"\">uncovered<\/a> vulnerabilities and there may be <a href=\"https:\/\/twitter.com\/vitalikbuterin\/status\/1278497920703135747?s=21\" data-v-f87c67ca=\"\">some discomfort<\/a> around reliance on particular hardware manufacturers, Fortier insists that most attacks are purely theoretical. Cornell University researcher Phil Daian, who previously published a <a href=\"https:\/\/www.cs.cornell.edu\/~iddo\/RTExchSGX.pdf\" data-v-f87c67ca=\"\">paper<\/a> describing a similar SGX-enabled exchange design, has since joined the team as an official advisor.","Still, the platform aims to offer traders the feel of a centralized exchange as well. TEEs enable DerivaDEX operators to provide real-time price feeds and a centralized exchange-standard matching &amp; liquidation engine without compromising integrity and confidentiality, according to the company.","The events of Black Thursday — when both MakerDAO and Chainlink price feeds struggled to contend with network congestion — highlight the importance of real-time price feeds as a means of avoiding cascading liquidations and system undercapitalization.","DerivaDEX is also taking a novel corporate structure approach, committing to a Decentralized Autonomous Organization (DAO) design from day one.","“DerivaDEX is building not just a new business model, but rather transforming what it means to be a ‘company’ at all,” notes Polychain Capital founder, Olaf Carlson-Wee.","The decision to immediately yield control of the protocol to token holders was born out of founders Palepu and Fortier’s emphasis on robustness, given that operating the exchange themselves presented too much regulatory and single-point-of-failure risk. Additionally, by removing regulatory risk, DerivaDEX can cater to all geographies and issue innovative financial products. Both centralized exchange BitMEX and decentralized exchange dYdX restrict access to their perpetual swap products for users based in the United States.","That said, the team says they're conscious of the risks related to \"decentralizing\" too early, citing illiquid user-listed order books on alternative exchanges as undesirable. Rather, they will seek to emulate the path taken by money-market protocol Compound, which is transitioning to a more decentralized state over time.","“Infrastructurally we will be set up as a DAO. Operationally, because we currently have an effective majority of token holdings, we will retain influence over the direction of the platform at the outset. Our position will quickly be diluted through further token issuance, and control will increasingly democratize as time goes by,” Palepu stated.","DerivaDEX is also designed to support multiple concurrent operators. Operator nodes handle matching, price feed and liquidations, although their ability for active discretion is tightly limited by the use of TEEs. A small committee of operators reaches consensus on transactions before proceeding to batch and submit them to the Ethereum network (Palepu expects a frequency of roughly five minutes).","Running an operator node is a fairly sophisticated undertaking, requiring consistent uptime guarantees and SGX-enabled hardware. In return for their effort, operators receive some portion of trading fees, while in the future they may be subject to slashing conditions if they fail to maintain consistent uptime.","It is paramount for any derivatives exchange to have deep liquidity from day one. To that end, DerivaDEX has recruited professional market makers, and taker fees are expected to be in line with those charged by derivative exchange giants BitMEX and FTX.","A liquidity mining program will also help to draw in traders on the taker side, with distribution proportional to volumes. The token — dubbed DDX — will allow holders to participate in the governance and operations of the DAO, while also providing additional utility across the platform. The team will release further details around the token design in the coming weeks.","Still, Palepu says he's aware of the limitations of exchange rebates, with the <a href=\"https:\/\/www.theblockcrypto.com\/post\/69782\/coinflex-overhauls-strategy-to-focus-on-building-a-repo-market-for-the-crypto-industry\" data-v-f87c67ca=\"\">recent CoinFlex pivot<\/a> underscoring the notion that monetary incentives alone cannot build long-term sustainable and successful products.","“A token does not solve for an inherently deficient product,\" he told The Block. \"We believe we have a very robust underlying product and liquidity mining is something to bootstrap liquidity and democratize the platform early. We can carry the longevity of success after that.”"],"hashtag":["DRAGONFLY CAPITAL","THREE ARROWS CAPITAL"]}