{"summary":"Web3 gamer Aurory&#x27;s digital assets will now be able to live on both Arbitrum and Solana.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241343\/arbitrum-enlisted-as-web3-gamer-aurory-pursues-multi-chain-aspirations","publishDate":"2023-07-25T12:20:12","id":3478,"type":null,"title":"Arbitrum enlisted as web3 gamer Aurory pursues multi-chain aspirations","category":["GAMING"],"content":["<b data-v-f87c67ca=\"\"><\/b><span data-v-f87c67ca=\"\">Web3 gaming company Aurory announced that the digital assets users can acquire playing its free-to-play games can now exist on Arbitrum, an <\/span><span data-v-f87c67ca=\"\">Ethereum Layer-2 network.<\/span>","<span data-v-f87c67ca=\"\">“We have always imagined Aurory existing across multiple gaming ecosystems, and this is the first step in realizing that vision,” Jonathan Campeau, an executive producer at Aurory, said in a statement. The company’s gaming assets will now live on either the Arbitrum or Solana blockchains.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Aurory also said in the statement that gamers will be able to utilize its SyncSpace technology, which allows players to deposit gaming assets on Solana and then withdraw them on Arbitrum, or vice versa. The company hopes the plan will create a \"seamless cross-chain experience for users.\"<\/span>","<span data-v-f87c67ca=\"\">There has been significant activity involving the <\/span><span data-v-f87c67ca=\"\">Arbitrum network in recent weeks. Last month, not only did <\/span><span data-v-f87c67ca=\"\">Xai, a gaming-focused permissionless Layer 3 blockchain, say it <\/span><a href=\"https:\/\/www.theblock.co\/post\/234647\/gaming-focused-layer-3-xai-arbitrum-launch\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">would launch<\/span><\/a><span data-v-f87c67ca=\"\"> later this year<\/span><span data-v-f87c67ca=\"\"> on <\/span><span data-v-f87c67ca=\"\">the network, The Graph, a leading indexing and query protocol for organizing blockchain data, said it had begun the final phase of migrating to Arbitrum. Earlier this month, <\/span><a href=\"https:\/\/www.theblock.co\/post\/238584\/cega-defi-arbitrum\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Cega expanded<\/span><\/a><span data-v-f87c67ca=\"\"> its structured DeFi investments product to the <\/span><span data-v-f87c67ca=\"\">Arbitrum ecosystem.<\/span>","<span data-v-f87c67ca=\"\">Aurory also said that the gaming assets that players can choose to have live on Arbitrum will include Aury tokens, “<\/span><span data-v-f87c67ca=\"\">playable NFT characters, skins, and Neftie eggs.” These assets either have, or will have, utility on Aurory’s two flagship games which are Adventure and Tactics.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jonathan Campeau","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Aury","content":"LOCATION"},{"type":"Aurory","content":"ORGANIZATION"},{"type":"Neftie","content":"ORGANIZATION"}],"hashtag":["ARBITRUM"],"authors":["RT Watson","The Block"]}