{"summary":"The company will now get access to funding round leader Dream Sport’s 140 million users in India.\nDeloitte Global has predicted that NFTs for sports media will generate more than $2 billion in revenue this year.","author":["Callan Quinn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/142948\/cricket-nft-platform-rario-announces-120-million-funding-round","publishDate":"2022-04-21T14:37:48","id":348,"type":null,"title":"Cricket NFT platform Rario announces $120 million funding round","category":["NFTs"],"content":["<span data-v-f87c67ca=\"\">Cricket NFT platform Rario announced a $120 million funding round led by Dream Sports’ venture capital and M&amp;A arm Dream Capital on Thursday.<\/span>","<span data-v-f87c67ca=\"\">Along with Alpha Wave Global (previously Falcon Edge Capital), Dream Capital will join existing investors Animoca Brands, Presight Capital and Kingsway Capital.<\/span>","<span data-v-f87c67ca=\"\">Based in Singapore, Rario offers cricket fans NFT player cards, video moments and cricket artifacts. The company said it has sold over 50,000 NFTs since its launch last year.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Sporting teams have been quick to jump on the NFT bandwagon of late. In December, Michael Jordan secured $10 million in seed funding to launch fan engagement platform Heir. Last month it dropped its first NFTs, which were priced at around 2.3 SOL ($220).&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In soccer, Tim Mangnall, the CEO of Capital Block, an agency that specializes in helping teams and organizations in Europe and the MENA region launch NFTs for fans, claimed all 20 English Premier League clubs were considering involvement in NFTs. However, he also believes “95%” of NFT projects are destined to fail and advised caution among buyers.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Indeed, the liquidation of fan engagement platform Iqoniq, which counted LaLiga and the McLaren Formula One team among its partners, has already led to calls for more regulation around crypto sports sponsorships. And in December, the UK’s Advertising Standards Authority <\/span><a href=\"https:\/\/www.asa.org.uk\/rulings\/arsenal-football-club-plc-a21-1121873-arsenal-football-club-plc.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">banned ads<\/span><\/a><span data-v-f87c67ca=\"\"> for Arsenal fan tokens on the grounds that they took advantage of customer inexperience in crypto assets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Nevertheless, this trend in sports clubs creating NFTs shows little sign of abating just yet: Deloitte Global has <\/span><a href=\"https:\/\/www2.deloitte.com\/xe\/en\/insights\/industry\/technology\/technology-media-and-telecom-predictions\/2022\/sports-nfts-digital-media.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">predicted<\/span><\/a><span data-v-f87c67ca=\"\"> that NFTs for sports media will generate more than $2 billion in revenue this year and that by the end of 2022 4-5 million sports fans will have bought or been given an NFT sports collectible.<\/span>","<span data-v-f87c67ca=\"\">Rario so far has exclusive partnerships with six international teams and a roster of over 900 cricketers on its books, and recently signed a multi-year exclusive partnership with Cricket Australia and the Australian Cricketers’ Association to create an Australian cricket metaverse of collectibles and gaming.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">With the latest investment, the company will now get access to Dream Sports’ 140 million users, to whom they will offer more fiat-only products in India. Dream Capital has a nine-company portfolio focusing on sports, gaming and fitness tech.<\/span>"],"hashtag":[]}