{"summary":"Blossom Capital plans to allocate a full third of its new fund to crypto-powered firms.\nIn addition to backing MoonPay, the venture firm has quietly been amassing tokens and even NFTs.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/130454\/blossom-capital-third-fund-crypto","publishDate":"2022-01-18T00:00:36","id":3480,"type":null,"title":"Blossom Capital targets crypto tokens with new $432 million fund","category":["Web3"],"content":["London-based venture capital firm Blossom Capital, founded in 2017 as a generalist investor, is now planning to plough considerably more money into the cryptocurrency market.","Blossom has this morning announced a new $432 million fund, its third to date. The cash will be directed to European startups seeking Series A capital across a range of sectors including consumer, cybersecurity, developer tools, enterprise software-as-a-service, fintech and marketplaces. But a full third of the capital will be invested in crypto-powered firms, according to the company’s announcement.","“We do hold tokens. We will have exposure to the core protocols,” says Ophelia Brown, managing partner of Blossom Capital. “We are going to do a lot more of what we have already done.”","Blossom does not appear to have much of a track record backing crypto businesses — save for its investment in MoonPay, which it backed in November last year when the crypto payments firm <a href=\"https:\/\/www.theblockcrypto.com\/post\/124980\/moonpay-raise\" data-v-f87c67ca=\"\">raised $555 million<\/a> at a $3.4 billion valuation.","But Brown says Blossom’s $185 million-sized second fund has quietly been investing in tokens and even NFTs, without showcasing those bets in the way a standard equity investment would be. The company has invested a lot of time and resources in developing the infrastructure needed to invest in web3 organizations, she adds.","“We have some NFTs — we won’t disclose what, but we have NFTs,” says Brown. “We believe in the upside of some of these communities very much.”","Blossom’s&nbsp;efforts in the sector will be steered by a new crypto-focused partner, a role the company is now actively trying to fill.","Brown herself is focused on the firm’s fintech bets. Notably, she steered Blossom’s investment in Checkout.com when the payments startup raised $230 million in May 2019. Checkout.com’s value has ballooned <a href=\"https:\/\/www.google.com\/search?client=safari&amp;rls=en&amp;q=checkout.com+the+block&amp;ie=UTF-8&amp;oe=UTF-8\" data-v-f87c67ca=\"\">from $2 billion to $40 billion<\/a> since then.","This is not to say that Brown isn’t a crypto enthusiast. She says she tried, unsuccessfully, to get Index Ventures to buy into Ethereum’s presale in 2014 while working as a principal at the investment firm. Her profile picture on Twitter is <a href=\"https:\/\/opensea.io\/assets\/0xb47e3cd837ddf8e4c57f05d70ab865de6e193bbb\/985\" data-v-f87c67ca=\"\">CryptoPunk #985<\/a>, which she appears to have purchased in December for 98 ether (or around $320,000 at today’s prices), based on OpenSea records.","Brown says that getting Blossom’s own backers — its limited partners (LPs) — on board for greater crypto exposure wasn't an issue for the firm. Indeed, while the majority of the second fund’s LPs are again backing Blossom’s third, the company has also brought in some of the world’s biggest endowment funds.","“The best allocators are already positive on crypto,” says Brown."],"hashtag":[]}