{"summary":"Crypto exchange Coinbase&#x27;s much-waited NFT marketplace has launched in beta form for select customers on its waitlist.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/142684\/coinbase-nft-marketplace-beta-launch","publishDate":"2022-04-20T09:00:23","id":3482,"type":null,"title":"Coinbase NFT marketplace goes live in beta for select customers","category":["NFTS"],"content":["Crypto exchange Coinbase's long-awaited NFT marketplace has launched in beta form for select customers after the exchange first unveiled plans for it in October.","The <a href=\"https:\/\/nft.coinbase.com\/\" data-v-f87c67ca=\"\">beta NFT marketplace<\/a> is accessible to everyone to view from today, but initially only select users will be able to buy or sell. \"Coinbase will be onboarding a small number of users into the beta for Coinbase NFT,\" Sanchan Saxena, VP of product at Coinbase, told The Block.","Coinbase <a href=\"https:\/\/www.theblockcrypto.com\/post\/120223\/coinbase-announces-nft-waitlist-following-lead-of-rivals-binance-and-ftx\" data-v-f87c67ca=\"\">opened a waitlist<\/a> for the marketplace in October, winning more than 1.5 million sign-ups. Only some customers will initially be able to use the beta marketplace, based on their position on that waitlist, said Coinbase.","Beta testers will be able to create a profile on the marketplace to buy and sell NFTs. They can use any self-custody wallet, including Coinbase Wallet and MetaMask. Coinbase won't charge transaction fees for a limited time, the exchange said, adding that it will eventually add fees in line with industry norms.","Coinbase NFT for now only supports Ethereum-based NFTs and payments in ether. Saxena said the marketplace will integrate other blockchains in the future, and \"full fiat on-ramps will be coming soon.\"","As for gas fees, Coinbase said it has partnered with 0x Protocol to optimize transactions for lower costs.","Coinbase will also allow users to purchase NFTs via credit cards, as it announced earlier this year. At the time, the company <a href=\"https:\/\/www.theblockcrypto.com\/linked\/130596\/coinbase-mastercard-partnership-nft-cards\" data-v-f87c67ca=\"\">partnered with Mastercard<\/a> to let users buy NFTs by card.","Besides enabling buying and selling of NFTs, Coinbase says its NFT marketplace will also allow communities to engage. This community-building function is the heart of how Coinbase NFT plans to position itself against competitors such as OpenSea and LooksRare.","\"We're building a marketplace where you can buy and sell NFTs, of course, but more importantly, you can engage,\" Saxena said at a press briefing attended by The Block. \"You can engage with the creator. You can engage with the collector. And you can engage with fellow collectors from a community around that NFT. This is an important piece of our strategy.\"","When asked if the marketplace requires customers to go through a know-your-customer (KYC) process, Saxena said each wallet provider would have its own KYC procedure, which would need to be followed before connecting with Coinbase NFT. Coinbase Wallet itself does not require users to KYC, but a user must KYC if they wish to link their Coinbase Wallet to their Coinbase retail app, Saxena added.","As for its royalty norms, Saxena said there's flexibility for creators. \"Creators with contracts that don't support any of the common royalty standards can set an on-chain override through the Royalty Registry,\" he said.","Coinbase joins other crypto exchanges in launching an NFT marketplace. Binance, FTX and Okcoin have all launched such marketplaces recently.","But according to Saxena, Coinbase NFT will be a preferred destination for users due to its simplicity as its main platform for buying and selling crypto.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mastercard","content":"ORGANIZATION"},{"type":"Sanchan Saxena","content":"PERSON"},{"type":"Okcoin","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Saxena","content":"PERSON"},{"type":"Saxena","content":"LOCATION"},{"type":"October","content":"DATE"},{"type":"Coinbase NFT","content":"ORGANIZATION"},{"type":"ups","content":"ORGANIZATION"}],"hashtag":["COINBASE","COINBASE NFT"],"authors":["Yogita Khatri","The Block"]}