{"summary":"According to CMS Holdings partner Bobby Cho, the cryptocurrency field is currently a “no-man’s land” marked by unpredictable price movements and uncertainties regarding which projects will be successful in the long run\nCho argued that the industry is not seeing many vertical product offerings because the fast-changing crypto infrastructure makes it difficult to predict what’s going to happen in the next months and years.","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/60439\/the-cryptocurrency-space-is-a-no-mans-land-right-now-says-cms-holdings-partner-bobby-cho","publishDate":"2020-03-31T17:16:32","id":3483,"type":null,"title":"The cryptocurrency space is a &#x27;no-man&#x27;s land&#x27; right now, says CMS Holdings partner Bobby Cho","category":["Investments"],"content":["<span data-v-f87c67ca=\"\">The cryptocurrency space is a \"no-man’s land\" right now since no one can predict what the landscape will look like in the next year, according to Bobby Cho, partner at CMS Holdings.<\/span>","<span data-v-f87c67ca=\"\">In a <a href=\"https:\/\/www.pscp.tv\/w\/1OdJrqgVlwYGX?t=1\" data-v-f87c67ca=\"\">live episode<\/a> of The Scoop podcast, Cho said that recent price swings have further increased the field's unpredictability and have made it difficult for firms like CMS Holdings to pinpoint promising projects to invest in.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"I really feel like it’s a no man’s land,\" he said. \"We're in this price sideway movement right now. We just came off of local high in the past weeks and hit a low of around $3,700. A lot of the deals we are looking at, those models are a little bit broken now. They need to be revised with forecasting of what’s going to happen in the space.\"<\/span>","<span data-v-f87c67ca=\"\">In fact, this increased level of uncertainty has prompted CMS Holdings to partially shift from investment to active trading strategies, according to Cho.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"We've been deploying more capital toward our active trading strategies versus our investment side of things,\" he continued. \"We don't know what the world is going to look like in the 6, 8, 12 months from now, especially with where the crypto prices are today. It's really hard to pick individual winners in the space, so you tend to go a bit broader and probably go with the major coins in the space such as bitcoin and ethereum.\"<\/span>","<span data-v-f87c67ca=\"\">On a related note, Cho highlighted the fast-changing nature of crypto's underlying infrastructure, including rules and regulations which, according to him, has made it nearly impossible for businesses to offer fully-fledged products.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"You have a very horizontal type of product offering in the space and it's really hard to build a product that's very vertical, meaning that you build products on top of existing products and you flesh it out fully,\" he said. \"The underlying infrastructure like rules and regulations continues to change around you. So how can you really build a really robust product and come to an agreement that over the next six, eight, 12 months, you don’t have to rebuild this thing?\"<\/span>","<span data-v-f87c67ca=\"\">He pointed to exchanges as an example. Exchanges launched early on, which are still dominating the field, did not incorporate any staking reward service because that was not a point of interest for most users given the existing infrastructure at the time.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"The industry likes to talk about scalability and throughput,\" Cho said. \"Whereas the protocols might be able to handle it, with new blockchains coming online, the infrastructure being built on top of that really hasn't been stress-tested as we saw a few weeks ago.\"<\/span>","<iframe src=\"https:\/\/www.youtube.com\/embed\/bOgSDJqawfM\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" data-v-f87c67ca=\"\"><\/iframe>"],"hashtag":[]}