{"summary":"ParaSwap Foundation is launching its native token PSP today and will be performing a retroactive airdrop to early users.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/124312\/dex-aggregator-paraswap-launches-its-own-token-to-airdrop-150-million-psp","publishDate":"2021-11-15T07:01:41","id":3485,"type":null,"title":"DEX aggregator ParaSwap launches its own token with retroactive airdrop","category":["DEFI"],"content":["Decentralized exchange (DEX) aggregator provider ParaSwap Foundation is launching its native token, dubbed PSP, on the Ethereum blockchain by doing a retroactive airdrop.","Early users of ParaSwap — some 20,000 accounts — will be rewarded with 150 million tokens, which is 7.5% of the PSP's total supply of 2 billion. Specifically, \"active users on all supported chains\" will be rewarded with the retroactive airdrop, ParaSwap founder Mounir Benchemled told The Block.","The snapshot for the airdrop was taken on October 8, according to Benchemled.","When asked why only 20,000 users have been selected for the airdrop compared to 1.3 million addresses that have interacted with ParaSwap to date, Benchemled said the users were filtered based on their activity, specifically who used the platform “multiple times for the last six months (till October 8th).”","ParaSwap also looked at users’ on-chain activity, said Benchemled, meaning if an address used only ParaSwap, it is very likely that that address will not be eligible, he added.","The token launch comes a week after The Block Research's Igor Igamberdiev <a href=\"https:\/\/twitter.com\/FrankResearcher\/status\/1456992508009979914\" data-v-f87c67ca=\"\">saw this coming<\/a> by analyzing ParaSwap's smart contracts in a tweet thread.","PSP is a 'utility plus governance token', Benchemled told The Block. This is because, besides its usage in governance voting, the token will also be used to incentivize market makers similar to maker rebates in centralized exchanges, he said.","That means PSP tokens can be used for staking in ParaSwapPools as well as for voting on governance decisions of the protocol.","\"This is the first time that a DeFi protocol will reward off-chain liquidity with on-chain settlement in a similar fashion as centralized exchanges and proof of stake blockchains,\" said Benchemled.&nbsp;","Since 7.5% of the total 2 billion PSP tokens are getting airdropped, 150 million PSP will be in the initial circulation supply.","The rest of the tokens are divided among ParaSwap's core team (17.6%), future team members (5%), pre-seed investors and advisors (2.4%), seed investors (14%), reserves (10%), and ecosystem (51%).","The core team size is 12 members, said Benchemled. ParaSwap has raised $5.7 million in total funding to date, and its investors include CoinGecko, Blockchain Capital, and Aave founder Stani Kulechov.","","","<em data-v-f87c67ca=\"\">Update: This story has been updated with additional comments from ParaSwap founder Mounir Benchemled.<\/em>","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"7.5%","content":"PERCENT"},{"type":"PSP","content":"ORGANIZATION"},{"type":"17.6%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"2.4%","content":"PERCENT"},{"type":"10%","content":"PERCENT"},{"type":"October 8","content":"DATE"},{"type":"last six months (till October","content":"DATE"},{"type":"ParaSwap Foundation","content":"ORGANIZATION"},{"type":"2 billion","content":"MONEY"},{"type":"51%","content":"PERCENT"},{"type":"Benchemled","content":"PERSON"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Mounir Benchemled","content":"PERSON"},{"type":"14%","content":"PERCENT"},{"type":"ParaSwap","content":"ORGANIZATION"},{"type":"$5.7 million","content":"MONEY"},{"type":"Blockchain Capital","content":"ORGANIZATION"},{"type":"Igor Igamberdiev","content":"PERSON"},{"type":"Stani Kulechov","content":"PERSON"}],"hashtag":["AIRDROP"],"authors":["Yogita Khatri","The Block"]}