{"summary":"Citigroup and Goldman Sachs are warning their client that the current market rout has yet to hit a bottom\nStill, that isn’t keeping retail traders from buying the dip, according to estimates.","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/57225\/retail-crypto-and-stock-traders-appear-to-buy-the-dip-as-big-banks-sound-the-alarm","publishDate":"2020-02-28T13:10:36","id":3486,"type":null,"title":"Retail crypto and stock traders appear to buy the dip as big banks sound the alarm","category":["Markets"],"content":["Anxieties about the economic impact of the coronavirus continued to grip global markets during Friday's trading session.","At last check, the Dow Jones Industrial Average was down nearly 2.45%, piling onto a rough week for the U.S. stock market, which has entered official correction territory. Since the beginning of the week, the DJIA has shed 12%.&nbsp;","Indeed, financial services firms have been sounding the alarm bells with both Goldman Sachs and Citigroup <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2020-02-26\/goldman-citi-strategists-say-s-p-500-rout-is-bound-to-worsen\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">warning clients<\/a> to not buy the dip – Wall Street parlance for buying up assets after a significant sell-off. Indeed, investors are taking note, fleeing to safety in U.S. Treasuries. The 2-year treasury yield dropped below 1% for the first time since 2016, while the 10-year yield fell to an all-time low.&nbsp;","","","In a research report to clients, Goldman warned that the market retreat that kicked-off last Thursday might not bottom out until the summer. In the report, obtained by The Block, the bank expects the S&amp;P 500 to drop to 2,900 in the next three months.&nbsp;","","","\"In a downside scenario, we assume bond&nbsp;yields fall to 0.75% and the yield gap widens to 575 bp. As a result, the forward P\/E&nbsp;multiple would decline to 15x and S&amp;P 500 would end the year at 2450 (-21% from the current level,\" the report's authors said.&nbsp;","Goldman noted a concern that companies would deliver lower earnings per share if the virus spreads further. The firm said Friday that it expects a short-lived global economic contraction.&nbsp;","In a note to clients, Citigroup said the firm is \"reluctant to buy the dip in risk assets just yet.\"","It should be noted that such concerns aren't related solely to the coronavirus outbreak. Analysts at Citigroup stated that the bank is&nbsp;awaiting a sign from the Fed that the agency will raise short-term interest rates.&nbsp;","Still, even as investment banks tell their institutional clients to stay on the sidelines, retail investors and traders on fintech applications like Robinhood appear to be buying the dip.","A Robinhood spokesperson declined to share details about deposit inflows over the last week, but the number of stocks being held by Robinhood clients gives the impression that users of the app have ramped up their holdings of certain popular stocks.&nbsp;","Looking at data from Robintrack.net, it appears the number of users holding Ford (F) increased from 380,000 to 390,000 even as the price declined by more than 8% from February 24 to February 27.","","","It's a similar story for Apple. Over the same time horizon, the number of users holding the stock increased from 244,000 to 254,000 over the same time period. The price of Apple was down more than 6% during the same period.","","","Still, some stocks have seen the number of holders drop. For instance, users holding Snap fell by approximately 1,000 from 192,300 to 190,900 as the company's shares fell by 5%.&nbsp;","","","Looking at the top 12 stocks on the platform, 10 out of 12 saw the number of users holding on to a given stock increase.","","","To be sure, this data only offers a snapshot of Robinhood's platform. Yet, it is in line with the company's previous statements.&nbsp;","<span data-v-f87c67ca=\"\">Its co-founder Baiju Bhatt <\/span><a href=\"https:\/\/www.businessinsider.com\/millennials-are-following-one-of-the-classic-rules-of-investing-2017-8\" data-v-f87c67ca=\"\">told<\/a><span data-v-f87c67ca=\"\"> Business Insider in 2017 that users of the millennial-aimed stock trading application typically bought the dip. For instance, when jitters about the Chinese economy triggered a steep 8% drop in stocks between December 31, 2015, and January 15, 2016, users ramped up deposits.<\/span>","\"Those were the days we saw the biggest net deposits we had ever seen,\"&nbsp;Bhatt said.\"With this younger generation, when the market takes a slide, they see it as an opportunity to buy.\"","In 2018, Robinhood saw a \"large spike in transaction volume\" after a 1,600-point drop in the DJIA, according to a spokesperson.&nbsp;","At brokerage eToro, a spokeswoman said, certain tech stocks were being bought \"much more than they are being sold.\"","At wealth management startup Wealthfront, it is a similar story, according to a spokeswoman for the firm.&nbsp;","In a message to The Block, Kate Wauck said, \"our clients aren't so reactive to headlines,\" continuing: \"If the volatility continues, we'll probably see people hold off on additional deposits, which we've seen before.\"","\"They don't withdraw though,\" she added. In a note to The Block on Friday, Wauck said investment sign-ups were higher than usual on Thursday.","TDAmeritrade, which has a more sophisticated clientele than Robinhood, is seeing more conservative trading behavior, according to a statement from chief market strategist JJ Kinahan.&nbsp;","\"Our clients – like most investors – are protecting themselves because of this giant unknown that is persisting in the market,\" Kinahan said. \"This 'risk-off' mentality that is dominant right now means they're increasingly turning to the likes of bonds, gold and the VIX. We are also seeing them sell some equities to lock in profits after an incredible run in the market.\"","As for the crypto world, some anecdotal evidence suggests that retail users are buying the dip. That's despite bitcoin's negative performance over the last week.&nbsp;","At last check, bitcoin was trading down 13% since Monday.&nbsp;","A spokesperson for Coinbase declined to share whether users of its retail platform have increased deposits. A spokesperson at Kraken declined to comment specifically on whether retail clients were buying the dip but noted that \"it is atypical that you see new retail buyers rushing in during downward price movements.\"","Volumes for both exchanges have increased over the last week, but that shouldn't come as a surprise as volatility typically translates into higher volumes. Increased volumes, however, don't offer insights into the specific trading behavior of retail clientele.&nbsp;","Michael Moro, the chief executive officer of Genesis Global Trading, told The Block in an interview that the retail flow routing into the firm is far more bullish than the institutional flow.&nbsp;","\"Volumes have remained very strong as funds have picked their spots to trade the recently increased vol,\" he said. \"Something interesting to note is our retail flow has still skewed very much to the buy-side, which could signal that this is just a minor blip in an otherwise bullish trend.\""],"hashtag":["GOLDMAN SACHS"]}