{"summary":"Samsung has partnered with Decentraland to open its flagship 837 store in the metaverse. \nThe virtual Samsung 837X store will be open in Decentraland for a limited time. ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/129380\/samsung-metaverse-flagship-837-store-decentraland","publishDate":"2022-01-06T08:37:35","id":3487,"type":null,"title":"Samsung enters the metaverse, opening flagship 837 store in Decentraland","category":["NFTs"],"content":["Samsung Electronics America has entered the metaverse world in collaboration with Decentraland, an Ethereum-based virtual reality platform.","The electronics giant has opened a virtual version of its flagship 837 physical store in Decentraland. The physical store is located at 837 Washington Street in New York City's Meatpacking District, Manhattan. The virtual store, dubbed Samsung 837X, will be open in Decentraland for a limited time.","\"This is one of the largest brand land takeovers in the history of Decentraland,\" Samsung said in a statement shared with The Block on Thursday.","<span data-sheets-value=\"{&quot;1&quot;:2,&quot;2&quot;:&quot;The Samsung 837X store will offer digital adventures through “Connectivity Theater and Sustainability Forest” and a musical celebration at the “Customization Stage,” said Samsung.&quot;}\" data-sheets-userformat=\"{&quot;2&quot;:1,&quot;3&quot;:{&quot;1&quot;:0}}\" data-v-f87c67ca=\"\">The Samsung 837X store will offer digital adventures through “Connectivity Theater and Sustainability Forest” and a musical celebration at the “Customization Stage,” said Samsung.<\/span>","","","The Connectivity Theater will showcase Samsung's news from the Consumer Electronics Show (CES), which began on January 5 and will run until January 8. The Sustainability Forest will allow guests to have a mythical experience through millions of digital trees.","Samsung has also been planting trees in the real world. It recently <a href=\"https:\/\/news.samsung.com\/us\/samsung-veritree-plant-millions-trees-fight-climate-change\/\" data-v-f87c67ca=\"\">partnered<\/a> with Cardano-based climate restoration platform Veritree to manage the planting of two million trees in Madagascar by the first quarter of this year.","Veritree operates a \"<a href=\"https:\/\/ito.veritree.com\/\" data-v-f87c67ca=\"\">Cardano Forest<\/a>\" where users can donate 15 or more cardano (ADA) tokens to receive limited edition tree tokens. Veritree then plants one tree on behalf of users for each ADA exchanged. Tree tokens can be used for limited edition trees and NFT digital art, according to Veritree.","As for the Customization Stage in Samsung's 837X store, guests will get to experience a mixed reality live dance party hosted by DJ Gamma Vibes from the physical Samsung 837 store.","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Guests will also be invited to participate in quests that lead to 837X NFT badges and one of three limited-supply wearables. <\/span>Winners will be announced at 8:37PM ET on January 7.","","","\"The metaverse empowers us to transcend physical and spatial limits to create unique virtual experiences that could not happen otherwise,\" said Michelle Crossan-Matos, senior vice president of corporate marketing and communications at Samsung Electronics America. \"Innovation is in our DNA, and we can't wait for you all to experience this burgeoning virtual world.\"","As the Samsung 837X store will be open in Decentraland for a limited time, the company plans to bring more such experiences throughout the year.","Samsung appears to be betting big on NFTs and the metaverse. Earlier this week, the company <a href=\"https:\/\/www.theblockcrypto.com\/linked\/128942\/samsung-nft-platform-smart-tv-2022\" data-v-f87c67ca=\"\">announced<\/a> that its new smart TVs will allow users to purchase NFTs. Samsung's venture unit, Samsung Next, is also an investor in several NFT startups, including Sky Mavis (Axie Infinity creator), Dapper Labs, and Forte.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>"],"hashtag":["CARDANO","DECENTRALAND"]}