{"summary":"Ukraine&#x27;s official Twitter account posted several requests for cryptocurrency donations on Saturday in the form of bitcoin, ether and USDT. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/135569\/ukraines-official-twitter-account-posts-pleas-for-crypto-donations-amid-russian-invasion","publishDate":"2022-02-26T11:36:56","id":3487,"type":null,"title":"Ukraine&#x27;s official Twitter account posts pleas for crypto donations amid Russian invasion","category":["BITCOIN"],"content":["Ukraine's official Twitter account issued direct appeals for cryptocurrency donations on Saturday amid the ongoing invasion by Russian military forces.","As of press time, the official account, @Ukraine, has shared three such messages, though the first two were deleted. The addresses posted – for bitcoin as well as ether\/USDT – remained consistent, though the wording of the appeals changed in each iteration. It is unclear whether the messages were purposefully deleted and reposted or if the inclusion of cryptocurrency addresses triggered controls put in place by Twitter following the <a href=\"https:\/\/www.theblockcrypto.com\/post\/71779\/crypto-exchanges-binance-and-geminis-twitter-accounts-compromised-used-to-promote-scam\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">2020 account hacks<\/a>.","The donation addresses were also shared by vice prime minister Mykhailo Fedorov's verified Twitter account as well as in his verified Telegram channel.","When reached via a <a href=\"https:\/\/thedigital.gov.ua\/contacts\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">press contact email<\/a> listed on its website, The Ukrainian Ministry of Digital Transformation, which Fedorov leads, told The Block that \"the communications channels of the Ministry Of Digital Transformation of Ukraine and Minister Mykhailo Fedorov are secure. We are not hacked. This is [the] official position and messages we want to share.\"","\"We are trying to contribute to the Ukraine’s victory and raise the awareness of international society on what’s happening in Ukraine. In every possible way we can,\" the representative continued.","Ukrainian diplomat Olexander Scherba <a href=\"https:\/\/twitter.com\/olex_scherba\/status\/1497601344206557184\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">also shared<\/a> the Ukrainian account's donation appeal.","Blockchain data indicates that the <a href=\"https:\/\/www.blockchain.com\/btc\/address\/357a3So9CbsNfBBgFYACGvxxS6tMaDoa1P?page=52\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">BTC address<\/a> has garnered a total of 9.78612041 BTC as of press time, with the earliest transaction being posted on February 24.","Roughly 85 ETH has been sent to the listed address. Data from <a href=\"https:\/\/etherscan.io\/address\/0x165CD37b4C644C2921454429E7F9358d18A45e14#tokentxnsErc1155\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Etherscan <\/a>indicates that donations have also been made in the form of USDT, USDC, as well as several non-fungible tokens.","Still, the messages have raised concerns about their veracity, especially given that the Russian military has conducted <a href=\"https:\/\/www.reuters.com\/world\/europe\/ukrainian-government-foreign-ministry-parliament-websites-down-2022-02-23\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">cyberattacks<\/a> during its invasion. Among those expressing caution was Ethereum co-founder Vitalik Buterin, who urged people to avoid sending donations absent additional verification.","\"There have been *a lot* of hacks alongside this invasion, this could easily be a hack,\" Buterin wrote. \"This info environment is as hostile as it gets, exercise extreme vigilance.\"","Buterin <a href=\"https:\/\/twitter.com\/VitalikButerin\/status\/1497608588822466563\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">later wrote<\/a> that he was deleting his message, stating: \"Getting some confirmations from a couple sources that it's legit. Deleting my warning for now. But continue to be vigilant, and always be slow and careful when sending irreversible crypto transactions.\"","Justin Sun, founder of Tron, wrote on Twitter that he spoke to the Ukrainian embassy of the World Trade Organization, claiming that the embassy confirmed the messages.&nbsp;","Elliptic, the blockchain analytics firm that has been tracking donations amid the Ukrainian invasion, said Saturday that $5.1 million worth of crypto has been donated in recent days across nearly 3,000 donations.","When reached for comment about the donations, Elliptic co-founder Tom Robinson told The Block that some $200,00 worth of donations to the bitcoin address were sent to an exchange based in Ukraine. \"It is a little suspicious that the funds are being moved to an exchange so quickly, but I haven't been able to verify yet whether this is a genuine fundraising campaign,” he wrote.","The posts come as Russian invasion forces <a href=\"https:\/\/www.theguardian.com\/world\/2022\/feb\/26\/ukraine-russian-strikes-pound-kyiv-as-zelenskiy-refuses-us-offer-to-evacuate\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">move closer<\/a> to the Ukrainian capital of Kyiv. Reports also state that Ukraine's president, Volodymyr Zelenskiy, has declined US offers to evacuate.&nbsp;","Twitter did not immediately respond to a request for comment regarding the posts.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$5.1 million","content":"MONEY"},{"type":"Elliptic","content":"ORGANIZATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"Mykhailo Fedorov","content":"PERSON"},{"type":"Fedorov","content":"PERSON"},{"type":"Volodymyr Zelenskiy","content":"PERSON"},{"type":"February 24","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Justin Sun","content":"PERSON"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Tom Robinson","content":"PERSON"},{"type":"the World Trade Organization","content":"ORGANIZATION"},{"type":"$200,00","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"The Ukrainian Ministry of Digital Transformation","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Ministry Of Digital Transformation of Ukraine","content":"ORGANIZATION"},{"type":"Olexander Scherba","content":"PERSON"},{"type":"Ukraine","content":"LOCATION"},{"type":"Saturday","content":"DATE"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}