{"summary":"Huobi Global, one of the major crypto exchanges that cater to mainland China customers, will clear out all China-based user accounts later this year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/118711\/crypto-exchange-huobi-cease-all-mainland-china-user-accounts","publishDate":"2021-09-26T03:59:00","id":3492,"type":null,"title":"Crypto exchange Huobi to cease all mainland China user accounts","category":["CHINA"],"content":["Huobi Global, one of the major crypto exchanges that cater to mainland China customers, has said it will suspend all China-based user accounts later this year.","The exchange said in an <a href=\"https:\/\/www.huobi.com\/support\/en-us\/detail\/54886961978434\" data-v-f87c67ca=\"\">announcement<\/a> on Sunday that it has already discontinued account registration for new users in mainland China, effective on Friday, shortly after the People's Bank of China <a href=\"https:\/\/www.theblockcrypto.com\/linked\/118581\/china-issues-tougher-measures-to-keep-cracking-down-on-crypto-trading\" data-v-f87c67ca=\"\">release<\/a>d toughened measures in cracking down crypto trading activities.&nbsp;","\"Huobi Global will gradually retire existing Mainland China user accounts by 24:00 (UTC+8) on Dec 31, 2021, and ensure the safety of users' assets,\" the exchange said in the Sunday announcement. \"We will inform users of the specific arrangements and details through official announcements, e-mails, text messages, etc.\"","Huobi is one of the first major crypto exchange that has reacted to China's latest crackdown order that said it will now treat all crypto-related transactions as illegal, including services that let Chinese users exchange fiat currencies to crypto assets.&nbsp;","HT, the exchange token of Huobi, has plunged by 15% within the hour after the exchange made public the news, extending the loss to more than 27% over the past 24 hours. HT is now changing hands at $6.3 on Huobi.","OKEx, another major crypto exchange that caters to Chinese users, has not yet made any announcement about user account suspension in China.","Binance, on the other hand, has also suspended new mainland China user registration through Chinese mobile phone numbers, based on user registration process verified by The Block.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/exchange-tokens\/exchange-token-performance-1y\/embed\" title=\"Exchange Token Performance (1Y)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"People's Bank of China","content":"ORGANIZATION"},{"type":"Huobi Global","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Mainland China","content":"LOCATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$6.3","content":"MONEY"},{"type":"27%","content":"PERCENT"},{"type":"15%","content":"PERCENT"},{"type":"Dec 31, 2021","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Wolfie Zhao","The Block"]}