{"summary":"Decentralized exchanges Velodrome and Aerodrome warned users that their websites have been compromised.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265104\/velodrome-aerodrome-hit-by-attack-on-front-end-websites","publishDate":"2023-11-29T04:04:43","id":3493,"type":null,"title":"Velodrome, Aerodrome hit by attack on front-end websites","category":["CRYPTO ECOSYSTEMS"],"content":["Decentralized exchanges Velodrome and Aerodrome warned users that their websites have been compromised.","The incident appears to be a domain name system (DNS) attack aiming to take control of the official website links. In such incidents, hackers gain control of a site and redirect users to a phishing site associated with a malicious contract, in the hope of stealing users’ funds.","Both Velodrome and Aerodrome today warned against interacting with their websites until further notice, in posts issued on X.","“Our frontend is currently compromised. Please do not interact with Velodrome for the time being. The team are investigating and will communicate more here when we have it,” the team <a href=\"https:\/\/twitter.com\/zachxbt\/status\/1729777066780815540\" data-v-f87c67ca=\"\">noted<\/a>. The same notice was issued via Aerodrome's official account on X.","The domain name system is a widely used protocol on which websites rely. However, attackers can potentially exploit DNS issues to carry out exploits, as demonstrated in this incident.","While there has been no official statement about the impact of the incident on user assets, on-chain analyst ZachXBT <a href=\"https:\/\/twitter.com\/zachxbt\/status\/1729777066780815540\" data-v-f87c67ca=\"\">detected<\/a>&nbsp;over $40,000 in funds being transferred to two specific addresses, likely taken during the attack.","Velodrome is the second largest decentralized exchange protocol on OP Mainnet (previously Optimism) in terms of total value locked and revenue. It has over <a href=\"https:\/\/defillama.com\/protocol\/velodrome\" data-v-f87c67ca=\"\">$139 million<\/a> in total locked value from users. Meanwhile Aerodrome is the largest protocol on Base by TVL. It holds over <a href=\"https:\/\/defillama.com\/protocol\/aerodrome\" data-v-f87c67ca=\"\">$63 million<\/a> in funds.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$139 million","content":"MONEY"},{"type":"TVL","content":"ORGANIZATION"},{"type":"Aerodrome","content":"ORGANIZATION"},{"type":"X.","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"$63 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$40,000","content":"MONEY"}],"hashtag":["EXPLOITS","HACKS"],"authors":["Vishal Chawla","The Block"]}