{"summary":"Former chair of the Commodity Futures Trading Commission Chris Giancarlo has joined CoinFund in an advisory role. \nThe hire comes as crypto-focused venture capital firms across the board have been building out their regulatory wings. ","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/129612\/former-cftc-chair-joins-board-of-crypto-investment-firm","publishDate":"2022-01-13T12:00:10","id":3499,"type":null,"title":"Former CFTC chair joins board of crypto investment firm","category":["The Block"],"content":["Crypto investment firm CoinFund has onboarded a former leader in the U.S. regulation space to its advisory board.","Per a January 13 announcement shared with The Block, former Commodity Futures Trading Commission chair J. Christopher Giancarlo will join CoinFund as a strategic advisor.&nbsp;","<span data-v-f87c67ca=\"\">“It’s pretty high-level strategy,\" Giancarlo tells The Block, explaining that he hopes he \"can help them peer into the future a bit.\"<\/span>","<span data-v-f87c67ca=\"\">In particular, Giancarlo emphasized his work with brokerage firm GFI Group, and especially its 2005 initial public offering, as critical to his understanding of how to shepherd firms through investment rounds. Of the current market for investment in crypto, Giancarlo acknowledged a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/128397\/crypto-companies-raised-just-over-25-billion-in-venture-funding-during-2021\" data-v-f87c67ca=\"\">single overarching trend<\/a>: \"There’s a lot of capital chasing a lot of deals.”<\/span>","One beneficiary of this is CoinFund. The firm saw significant expansion over the course of 2021, launching a new <a href=\"https:\/\/www.theblockcrypto.com\/linked\/111954\/coinfund-launches-83-million-venture-fund-mandate-includes-defi-nfts\" data-v-f87c67ca=\"\">fund focused on decentralized finance<\/a> and helping <a href=\"https:\/\/www.theblockcrypto.com\/linked\/109792\/coinfund-set-to-launch-new-investment-vehicle-for-nfts\" data-v-f87c67ca=\"\">to launch Metaversal<\/a>, a holding company that invests in non-fungible tokens.&nbsp;","Giancarlo himself is no stranger to the world of crypto, earning the moniker of \"Crypto Dad\" owing to his favor towards the industry during his time at the CFTC. He would subsequently launch <a href=\"https:\/\/www.theblockcrypto.com\/linked\/103693\/digital-dollar-project-cbdc-pilot-giancarlo\" data-v-f87c67ca=\"\">the Digital Dollar Project<\/a>, which advocates for a U.S. central bank digital currency. Later, the CryptoDad nickname would appear as the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/116949\/former-cftc-chair-giancarlo-is-putting-out-a-book-titled-cryptodad\" data-v-f87c67ca=\"\">title of a book<\/a> he released near the end of 2021.&nbsp;","As CoinFund's president, Christopher Perkins, said in a statement: “Chris was a driving force in supporting innovation at the CFTC, and continues to serve as a trailblazer and advocate for thoughtful crypto policy in the United States.\"","A representative for CoinFund told The Block that Giancarlo is the first strategic advisor the firm has onboarded.&nbsp;","Crypto-native venture capital has radically expanded its investment into policy and regulation in recent months. Andreessen Horowitz, or a16z, has basically <a href=\"https:\/\/www.theblockcrypto.com\/linked\/129605\/crypto-vc-heavyweight-a16z-unveils-vision-for-crypto-regulation\" data-v-f87c67ca=\"\">rebuilt its regulation team<\/a> since August. New recently broke that Katie Haun, an outgoing partner at a16z and former Department of Justice official, was leaving the VC firm <a href=\"https:\/\/www.theblockcrypto.com\/post\/129651\/hauns-new-venture-fund-lining-up-investors-to-raise-approximate-900-million\" data-v-f87c67ca=\"\">to start her own fund<\/a>.&nbsp;"],"hashtag":["HIRING"]}