{"summary":"Following the immediate aftermath of the crypto market’s year-long deleveraging, 2023 ushered in substantial evolution and growth across various corners","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/268440\/2024-digital-assets-outlook","publishDate":"2023-12-21T08:26:25","id":35,"type":null,"title":"2024 Digital Assets Outlook","category":["THE BLOCK"],"content":["<b data-stringify-type=\"bold\" data-v-f87c67ca=\"\">The Block Research has created “2024 Digital Assets Outlook Report”. To access the full report via email in PDF format, please fill out the form below:&nbsp;<\/b>","<span data-v-f87c67ca=\"\">Following the immediate aftermath of the crypto market’s year-long deleveraging, 2023 ushered in substantial evolution and growth across various corners of the blockchain industry and cryptocurrency asset class.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The report provides an in-depth analysis of key developments shaping the year, focusing specifically on (1) general market and price activity, (2) the role played by infrastructure providers, institutions and regulators, (3) evolution across the blockchain platforms underpinning the on-chain economy, and (4) the applications that drove adoption.<\/span>","<span data-v-f87c67ca=\"\">Often, 2023 felt like a year simultaneously playing out across opposite universes. Prices broadly doubled despite relatively tepid investor activity, reflected by multi-year lows in volume and venture deals. Many institutions shied away from servicing crypto market participants, yet recent ETF filings mark the most prominent progress towards institutional adoption. Regulatory bodies warned the market about the risks of the sector and levied enforcement actions, but the judicial branch pushed back on regulatory overreach. And an Ethereum upgrade allowing for stake to be withdrawn led to the rapid growth in total ETH staked and aided the rise of a new dominant DeFi player. The following sections examine some of these nuances. <\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Block Research","content":"ORGANIZATION"}],"hashtag":[],"authors":["The Block Research","The Block"]}