{"summary":"Bitwise CIO Matt Hougan likened Coinbase’s ongoing tech issues to Facebook crashing while suggesting the cryptocurrency exchange’s repeated problems shouldn’t have “much direct impact” on spot bitcoin ETFs.\nCoinbase, which said it was experiencing problems Thursday, serves as custodian to the majority of the U.S. spot bitcoin ETFs trading.","author":["RT Watson","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281450\/bitwise-says-coinbase-tech-issues-similar-to-facebooks-past-bitcoin-etfs-unlikely-affected","publishDate":"2024-03-08T15:05:38","id":350,"type":null,"title":"Bitwise says Coinbase tech issues similar to Facebook&#x27;s past, bitcoin ETFs unlikely affected","category":["Companies"],"content":["After Coinbase suffered its third technical issue in less than ten days amid heavy trading volumes across crypto, Bitwise CIO Matt Hougan was largely supportive as many people took to X to voice their concern or displeasure.","\"Coinbase crashed all the time in past bull markets, yet it still grew like crazy,\" Hougan <a href=\"https:\/\/twitter.com\/Matt_Hougan\/status\/1766171682509934659\" data-v-f87c67ca=\"\">posted to X<\/a>. \"That's actually a theme through internet history. Facebook crashed all the time; it still got to billions of users.\"","Hougan opining on Coinbase's ongoing technical issues comes on the heels of the U.S.-based exchange announcement Thursday that it was \"experiencing high support volume and response times may be greater than 48 hours.\" That statement followed <a href=\"https:\/\/www.theblock.co\/post\/280475\/coinbase-glitch-shows-0-balances-again-amid-soaring-bitcoin-prices-and-trading-volume\" data-v-f87c67ca=\"\">Monday's pronouncement<\/a> that Coinbase's trading platform was experiencing problems amid heavy crypto trading, leading some customers' accounts to show $0 balances. Less than a week earlier, nearly the same issue <a href=\"https:\/\/www.theblock.co\/post\/279682\/coinbase-restabilized-after-heavy-traffic-caused-0-balance-glitch\" data-v-f87c67ca=\"\">occurred<\/a> as bitcoin's price soared.&nbsp;","Coinbase did not immediately respond for comment when asked if it was still encountering technical issues, though a high volume of criticism appeared online suggesting such. Independently, The Block tested Coinbase's app and found it to be functioning.&nbsp;","\"Once, no biggie. Twice, red flag. Third time, wtf. How is this [possible] for such a rich, tech-oriented company?\" Bloomberg Senior ETF analyst Eric Balchunas asked Hougan on Friday via X.","Hougan said Coinbase's issues are likely impacting retail users and not the institutional clients that have selected Coinbase as custodian for their spot bitcoin ETFs.","\"Institutional has been fine, and custody is a separate entity altogether and unaffected,\" he said. \"Most ETFs trade through multiple OTC counterparties that tap into global liquidity, and there is plenty of liquidity in non-Coinbase platforms.\"","Bitwise's spot bitcoin ETF, trading under the ticker BITB, uses Coinbase as a custodian. The exchange-traded fund had about $1.8 billion in assets under management as of Friday, according to The Block data dashboard.","&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/bitcoin-etf\/spot-bitcoin-etf-assets\/embed\" title=\"Spot Bitcoin ETF AUM\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>"],"hashtag":["COINBASE"]}