{"summary":"What potential could investors realize if they had access to a financial product that was built on a sound store of value, was a good fit for today’s highly liquid global markets and offered daily transparency reporting to protect consumers and aid regulators?","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/125095\/the-sweet-spot-financial-products-built-on-sound-fundamentals-with-high-transparency","publishDate":"2021-11-23T09:00:44","id":350,"type":null,"title":"The Sweet Spot: Financial Products Built on Sound Fundamentals with High Transparency","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">What potential could investors realize if they had access to a financial product&nbsp;built on&nbsp;a sound store of value, supported by highly liquid global markets, and with&nbsp;daily transparency reporting to enable the investor's trust?<\/span><span data-v-f87c67ca=\"\"> A bitcoin ETF offers a sweet spot the SEC and legacy investors should be ready for.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Industry proponents have long considered a bitcoin ETF (BTC ETF) an important step in changing the perception of bitcoin from that of a murky financial tool favored by shadowy super coders to an institutional-class asset embraced by mainstream investors. The SEC’s rejection of several spot bitcoin ETFs this fall, Valyrie’s and VanEck’s being the most recent, highlights the challenges facing crypto exchange-traded products in the U.S. The SEC has repeatedly cited its concern over the potential for market manipulation as the reason for spurning applications.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While market manipulation is a legitimate concern, and there is no debate about the need for investor protections, the SEC’s reasoning misses the mark. A financial product built on top of bitcoin’s blockchain is part of a greater transformational shift that is already underway, where the most distributed and secure ledger ever created will drive investors, managers, auditors and regulators to reimagine what is possible. Assurance tools to provide data transparency and financial insight on-demand and in real-time will be commonplace and have already been proven by Armanino’s ability to report on more than $28 billion of crypto-asset-backed instruments in real-time. These tools meet and exceed the SEC’s mission to provide financial transparency as a key component of consumer protection.<\/span>","<span data-v-f87c67ca=\"\">One important case in point: CoinShares’ XBT product. Launched in 2015, the <\/span><span data-v-f87c67ca=\"\">XBT Provider Tracker note<\/span><span data-v-f87c67ca=\"\">, traded on NASDAQ in Europe, has parallels to a spot BTC ETF in that the asset manager needs to maintain a hedge of the underlying assets in such a way that the notes are adequately backed, even with volatile daily market price changes. In 2020, CoinShares took the bold step of becoming the only publicly listed asset manager to offer real-time visibility into liabilities and assets through Armanino’s <\/span><a href=\"https:\/\/www.armaninollp.com\/industries\/crypto-digital-assets\/?utm_campaign=blockchain-crypto-digital-assets-trustexplorer-2111-wc21373851&amp;utm_medium=paid-advertising&amp;utm_source=third-party-newsletter-the-block\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">TrustExplorer Real-Time Attest<\/span><\/a> <span data-v-f87c67ca=\"\">t<\/span><span data-v-f87c67ca=\"\">echnology. As of today, CoinShares’ total assets under management is approximately $6 billion and <\/span><b data-v-f87c67ca=\"\">TrustExplorer has issued over 7,120 attest reports in the past 15 months<\/b><span data-v-f87c67ca=\"\">. Over the same time period, the largest ETF products have produced only a handful of reports.<\/span>","<span data-v-f87c67ca=\"\">Currently, ETFs available for commodities such as gold, rare metals, or income-producing assets like real property are far more opaque to markets, regulators and investors than a spot bitcoin ETF would be. With on-demand attest over the underlying assets and note obligations, there is simply no match. A bitcoin futures ETF is a better-than-nothing start, but the spot ETF, supported by Real-Time Attest, will usher in a new era of financial products built on transparent foundations and auditability to support customer protection, market protection and well-informed capital formation.<\/span>","<span data-v-f87c67ca=\"\">For questions or to learn more, contact our <\/span><a href=\"https:\/\/www.armaninollp.com\/industries\/crypto-digital-assets\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Digital Assets &amp; Blockchain team<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Follow us on Twitter at: @ArmaninoCrypto<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Time Attest","content":"ORGANIZATION"},{"type":"2015","content":"DATE"},{"type":"fall","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"NASDAQ","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"VanEck","content":"PERSON"},{"type":"$6 billion","content":"MONEY"},{"type":"$28 billion","content":"MONEY"},{"type":"Digital Assets &amp; Blockchain","content":"ORGANIZATION"},{"type":"U.S","content":"LOCATION"},{"type":"Armanino","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"TrustExplorer","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}