{"summary":"Ethereum core developers have indicated support for EIP-4844, a highly-anticipated scaling proposal, to go live in a future upgrade.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189829\/ethereum-core-developers-signal-support-for-proto-danksharding","publishDate":"2022-11-24T13:02:55","id":3500,"type":null,"title":"Ethereum core developers signal support for &#x27;proto-danksharding&#x27;","category":["LAYER 2S AND SCALING"],"content":["<span data-v-f87c67ca=\"\">Ethereum core developers are moving toward putting<\/span> <a href=\"https:\/\/eips.ethereum.org\/EIPS\/eip-4844\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">EIP-4844<\/span><\/a> —<span data-v-f87c67ca=\"\"> a highly-anticipated scaling proposal — live in a future mainnet upgrade, according to an Ethereum core developer <a href=\"https:\/\/www.youtube.com\/watch?v=HX_Zr_gVeOE\" data-v-f87c67ca=\"\">meeting<\/a>.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Developers have included EIP-4844, also called \"proto-danksharding,\" into a list called “considered for inclusion (CFI),” meaning they have committed to working on the proposed feature. If everything goes as planned, this feature will be deployed on the mainnet sometime next year. The proposal might be rolled out with or after the Shanghai upgrade, which aims to open up staking withdrawals for validators.<\/span>","<span data-v-f87c67ca=\"\">EIP-4844 aims to improve the scalability of Ethereum beyond what's available with Layer 2 solutions. It will introduce a new kind of transaction format to Ethereum called<\/span> \"<a href=\"https:\/\/eips.ethereum.org\/EIPS\/eip-4844\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">shard blob transactions<\/span><\/a>,<span data-v-f87c67ca=\"\">” allowing for off-chain data to be stored and accessed by Ethereum nodes temporarily to address scaling needs of blockchain apps.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This feature is intended to make Ethereum even cheaper when using Layer 2 rollup solutions like Optimism and Arbitrum, where transactions are already five to ten times cheaper than the Ethereum base layer.<\/span>","<span data-v-f87c67ca=\"\">“Reminder: EIP-4844 adds a new fee market to Ethereum for short-lived data. Rollups would use this for data availability instead of hijacking regular gas. This is a game changer for the rollup-centric roadmap, as fees could be lowered ~100x,”<\/span><a href=\"https:\/\/twitter.com\/liamihorne\/status\/1595592154650288129\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\"> Liam Horne, CEO of OP Labs, the developer of Optimism network.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"4844","content":"DATE"},{"type":"Arbitrum","content":"LOCATION"},{"type":"CFI","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Shanghai","content":"LOCATION"},{"type":"Liam Horne","content":"PERSON"},{"type":"OP Labs","content":"ORGANIZATION"}],"hashtag":["ETHEREUM"],"authors":["Vishal Chawla","The Block"]}