{"summary":"A popular Solana-based NFT project was “rugged” today by its creator.\nThey took in about $140,000, failed to deliver the artwork and deleted their Twitter account.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/119150\/supposed-17-year-old-artist-sells-138000-worth-of-fake-nfts-and-disappears","publishDate":"2021-09-30T11:38:55","id":3501,"type":null,"title":"Supposed 17-year-old artist sells $138,000 of fake NFTs and disappears","category":["NFTs"],"content":["A supposed 17-year-old 3D digital artist performed what's known in crypto lingo as a \"rugpull\" today, failing to deliver on a project and disappearing with all the money.","The rug in question was an NFT project called Iconics. It promised to deliver 8,000 NFTs focused on \"quality art.\" The artwork took the form of 3D renders of figurines from the chest up and around 14 artworks were presented in its Discord channel as examples.","Today, some of the NFTs were supposed to be sold in a pre-sale. There were 2,000 NFTs up for grabs at a price of 0.5 SOL to those who had access. The website went live, the NFTs started minting and very quickly sold out.","But instead of the artwork, all of the buyers received were random collections of emojis.","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Damn.. <\/span><span class=\"r-18u37iz\" data-v-f87c67ca=\"\">@IconicsSol<\/span><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\"> just RUGGED. Did a presale for 2K at .5 and made off with I think 1000 SOL,\" tweeted Sol Big Brain, an account popular in the Solana NFT community. \"Sorry to anybody who took the L here. I minted a bunch also as art looked good. Lesson Learned.\"<br data-v-f87c67ca=\"\">\n<\/span>","Since the NFT mint, there have been no more announcements in the Iconics Discord channel, the general chat is still disabled and the Iconics Twitter account has been deleted.","It appears the artist made away with around 1,000 solana (SOL), worth around $138,000. The money has already been split across multiple accounts, according to <a href=\"https:\/\/explorer.solana.com\/address\/3ZDAUZLzTthX8Nuu9gH2L2MgKsJ26AzkXPddpzHA9HaC\" data-v-f87c67ca=\"\">blockchain data<\/a>.","Victims of the rug have created their own Discord channel to discuss what happened and try to continue the project. At the same time, an announcement message encourages affected buyers to file claims with the FBI.","This isn't Solana's first NFT rug, however. A project called <span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">AstroSols<\/span> did a similar trick earlier this month, with question marks sent to NFT buyers that were supposedly \"waiting on metadata\" but never actually loaded."],"hashtag":["SOLANA"]}