{"summary":"Ethereum co-founder Vitalik Buterin commented that ZK-Rollups will dominate the Layer 2 space in the coming years.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/162098\/zk-rollups-likely-to-be-main-layer-2-solution-for-ethereum-says-vitalik-buterin","publishDate":"2022-08-08T10:45:54","id":3501,"type":null,"title":"ZK-Rollups likely to be main Layer 2 solution for Ethereum, says Vitalik Buterin","category":["TECHNOLOGY"],"content":["<span data-v-f87c67ca=\"\">Speaking during ETHSeoul on Friday evening, Ethereum co-founder <a href=\"https:\/\/www.theblock.co\/post\/162066\/potential-ethereum-proof-of-work-fork-unlikely-to-succeed-says-vitalik-buterin\" data-v-f87c67ca=\"\">Vitalik Buterin<\/a> predicted that ZK-Rollups will beat Optimistic Rollups in Ethereum's Layer 2 scaling wars.<\/span>","<span data-v-f87c67ca=\"\">At the event, Buterin stressed that while Optimistic Rollups are more mature, the fundamentals of the Zero-knowledge Rollup technology will allow it to supersede Optimistic Rollups in the long run.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Optimistic and ZK-Rollups are the most widely adopted Layer 2 solutions designed to scale Ethereum with off-chain computation while still retaining the security of the main blockchain. <\/span><span data-v-f87c67ca=\"\">There are differences, though, in the architecture of these solutions and the level of security they provide. <\/span>","<span data-v-f87c67ca=\"\">Buterin noted that ZK-Rollups are faster when moving funds to and from the mainnet, which may lead to wider adoption of them.<\/span>","<span data-v-f87c67ca=\"\">“My opinion is that in the longer term, ZK-Rollups are eventually going to beat Optimistic Rollups because they have these fundamental advantages like you don't need to have a seven-day withdrawal period,” Buterin said. “In more than 10 years from now or even more, I expect the Rollups to basically be all ZK.”<\/span>","<span data-v-f87c67ca=\"\">Buterin acknowledged, however, that ZK-Rollups have yet to mature and are currently hard to build on. <\/span><span data-v-f87c67ca=\"\">“So at the same time, the ZK technology is just hard to build. There are a lot of mental challenges especially in doing all of this stuff safely and making sure all of the circuits are correct. Optimistic rollup technology is just more mature,\" he said.<\/span>","<span data-v-f87c67ca=\"\">While ZK-Rollups are faster, one thing that ZK-Rollups lack is an Ethereum Virtual Machine (EVM), making them hard to run decentralized applications like DeFi protocols. The EVM is the main processing unit on the Ethereum blockchain for decentralized applications.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But this may change soon since EVM compatibility for ZK-Rollups is in the works. Layer 2 projects <\/span><span data-v-f87c67ca=\"\">like Scroll, zkSync and Polygon have announced plans to introduce a compute environment called <a href=\"https:\/\/www.theblock.co\/post\/158635\/polygon-is-helping-to-bring-the-ethereum-virtual-machine-to-zk-rollups\" data-v-f87c67ca=\"\">zk-EVM<\/a> that will allow ZK-Rollups to independently run all types of general-purpose smart contracts.<\/span>","<span data-v-f87c67ca=\"\">Buterin added, \"We've actually been starting to see zk-EVM implementations that are almost ready to scale with Ethereum transactions, which is amazing.\"<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Buterin","content":"PERSON"},{"type":"ZK","content":"LOCATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"evening","content":"TIME"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ETHEREUM","ROLLUPS"],"authors":["Vishal Chawla","The Block"]}