{"summary":"Fold is a bitcoin payment and reward provider offering bitcoin cashback on purchases\nThe startup raised $2.5 million from investors including Slow Ventures and CoinShares\nFold is adding credit and debit card support in the newest version of its mobile app","author":["Steven Zheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/40964\/fold-raises-2-5m-to-build-out-its-bitcoin-payments-and-rewards-offering","publishDate":"2019-09-25T08:59:26","id":3503,"type":null,"title":"Fold raises $2.5M to build out its bitcoin payments and rewards offering","category":["Bitcoin"],"content":["Bitcoin payments startup <a href=\"https:\/\/foldapp.com\/\" data-v-f87c67ca=\"\">Fold<\/a> has raised a $2.5 million seed round from investors including Craft Ventures, CoinShares, and Slow Ventures. As part of the raise, Fold is also unveiling a new version of its mobile app with credit and debit card support.","“Our new app gets you cashback in bitcoin and keeps your data private when you shop at retailers– this is great news for any fan of bitcoin, privacy or free money. We are especially excited because Fold also marks the first payment and rewards application to use bitcoin’s lightning network, which makes using bitcoin instant and nearly seamless,” said Will Reeves, CEO of Fold.","Fold is not the first company to offer bitcoin cashback rewards. Lolli, a popular bitcoin startup, has previously <a href=\"https:\/\/www.theblockcrypto.com\/linked\/3293\/lolli-raises-2-25m-to-build-out-its-app-that-lets-shoppers-earn-crypto\" data-v-f87c67ca=\"\">raised<\/a> funding to offer similar rewards services. In July, Lolli CEO Alex Adelman <a href=\"https:\/\/www.theblockcrypto.com\/post\/33099\/alex-adelman\" data-v-f87c67ca=\"\">told<\/a> The Block that his firm was getting ready to launch a mobile app.","Fold works by integrating its payments solution into the prepaid access programs and point-of-sales systems of merchants like Starbucks, Uber, and Target. This process enables users to earn bitcoin rewards of up to 20% of purchases while keeping their personal information private.","According to Reeves, because Fold processes payments on behalf of its users, the firm is able to provide additional privacy features. \"The<span class=\"c-message__body\" dir=\"auto\" data-qa=\"message-text\" data-v-f87c67ca=\"\"> credit card network only sees a payment to Fold, and the retailer only sees a payment from Fold. Therefore, the [credit card] company does not know where the transaction took place or what was purchased and the retailer does not know the identity of the purchaser or payment details,\" Reeves tells The Block.<\/span>","\"<span class=\"c-message__body\" dir=\"auto\" data-qa=\"message-text\" data-v-f87c67ca=\"\">You can think of Fold as an incognito mode for payment—we give you a burner payment code to use at retailers that lets you avoid sharing personal and payment details\"<\/span>"],"hashtag":[]}