{"summary":"MakerDAO community has supported a decision to deposit $100 million of USDC stablecoin into a Yearn Finance vault.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/205358\/makerdao-community-backs-plan-to-deposit-100-million-into-yearn-finance","publishDate":"2023-01-25T06:22:10","id":3503,"type":null,"title":"MakerDAO community backs plan to deposit $100 million into Yearn Finance","category":["CRYPTO ECOSYSTEMS"],"content":["Governance members of Dai stablecoin issuer MakerDAO have <a href=\"https:\/\/vote.makerdao.com\/polling\/Qma4jEPY#vote-breakdown\" data-v-f87c67ca=\"\">approved<\/a> a preliminary proposal to deposit $100 million worth of the USDC stablecoin from its reserves into a special investment account known as a \"vault\" managed by Yearn Finance. The vault has a limit of $100 million and is expected to earn an estimated yield of 2% per year for MakerDAO, worth $2 million.","The partnership between MakerDAO and Yearn Finance, which was first suggested in November 2022 by Yearn, a yield aggregator, still needs final approval through an executive vote. Executive Votes are the final step in the Maker Governance process and are used to implement technical changes to the Maker Protocol.","This move is in line with MakerDAO's strategy of generating income from its treasury reserves by attracting interest from both centralized and decentralized entities for partnerships where they deposit assets into the reserves.&nbsp;","In September 2022, Coinbase proposed that MakerDAO deposit <a href=\"https:\/\/www.theblock.co\/post\/179492\/security\" data-v-f87c67ca=\"\">$1.6 billion<\/a> worth of USDC into its institutional platform, offering a yield of 1.5% per year. MakerDAO has also allocated USDC on various decentralized finance platforms such as Aave, Compound, and Idle Finance.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Coinbase","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"2%","content":"PERCENT"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"September 2022","content":"DATE"},{"type":"$1.6 billion","content":"MONEY"},{"type":"1.5%","content":"PERCENT"},{"type":"Yearn Finance","content":"ORGANIZATION"},{"type":"$2 million","content":"MONEY"},{"type":"November 2022","content":"DATE"},{"type":"Idle Finance","content":"ORGANIZATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}