{"summary":"Crypto lender BlockFi is raising interest rates on bitcoin (BTC) and ether (ETH), effective April 1.\nZac Prince, founder and CEO of BlockFi, said: “Our balance sheet is stronger than ever and shifts in the institutional lending markets have created opportunities that expand our margin”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/58947\/crypto-lender-blockfi-is-raising-interest-rates-on-bitcoin-and-ether","publishDate":"2020-03-17T08:00:49","id":3504,"type":null,"title":"Crypto lender BlockFi is raising interest rates on bitcoin and ether","category":["Lending"],"content":["Crypto lender BlockFi is raising interest rates on bitcoin (BTC) and ether (ETH) holdings, effective April 1.","Users holding up to 5 bitcoins now will earn a 6% annual percentage yield (APY) as <a href=\"https:\/\/blockfi.com\/rates\/\" data-v-f87c67ca=\"\">compared to<\/a> 3.6% APY currently.","Ether holders, on the other hand, will earn 4.5% APY for up to 500 ETHs as compared to 2%-3.6% APY currently. Interest rates on stablecoins Gemini dollar (GUSD) and USD Coin (USDC), on the other hand, will remain unchanged at 8.6% APY.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe move appears to be unusual, given that interest rates are down in traditional financial markets amid coronavirus risks.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nZac Prince, founder and CEO of BlockFi, told The Block that there are two key factors enabling the firm to raise interest rates: \"Supply constraint as other market participants have pulled back on their lending activities, and ample opportunities for market-making and arbitrage coming out of the extreme volatility that we experienced last week.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"The next few weeks will be interesting as we will see if assets like gold and bitcoin decouple from the public equities market. In times of extreme panic, every asset is typically sold. After the dust settled in 2008, gold performed very well and we will see if bitcoin experiences a similar cycle,\" Prince added. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nHe went on to say that BlockFi's balance sheet is \"stronger than ever and shifts in the institutional lending markets have created opportunities that expand our margin.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBlockFi has also reported fewer loan liquidations during last week's bitcoin crash, \"with zero losses in the lending book.\" The firm said it did not&nbsp;liquidate USD loan client collateral below a price of ~$4,500, despite the market reaching lows of ~$3,800.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nFounded in 2018, BlockFi has grown significantly within two years. The firm's revenues grew over 20 times in 2019, and it currently boasts more than $650 million in assets on the platform.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nJust last week, BlockFi <a href=\"https:\/\/www.theblockcrypto.com\/post\/58257\/crypto-lender-blockfi-now-supports-cash-transfers-via-silvergate-bank\" data-v-f87c67ca=\"\">added<\/a> support for cash transfers to let non-crypto users buy their first $10 worth of crypto and earn interest on it.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe firm is backed by notable investors, including Valar Ventures and Morgan Creek Digital. It has raised over $100 million in funding to date, according to Crunchbase. Most recently, it raised $30 million in a Series B round."],"hashtag":["BLOCKFI"]}