{"summary":"MetaCene, the leading meta-MMO platform for all gamers, is redefining the boundaries of digital ownership and creativity. Today, it proudly announces the","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281669\/metacene-announces-10-million-private-a-round-funding-securing-its-place-as-a-web3-gaming-pioneer","publishDate":"2024-03-13T09:01:02","id":3506,"type":null,"title":"MetaCene announces $10 million private A round funding, securing its place as a Web3 gaming pioneer","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">MetaCene, the leading meta-MMO platform for all gamers, is redefining the boundaries of digital ownership and creativity. Today, it proudly announces the closure of its <\/span><b data-v-f87c67ca=\"\">$10 million <\/b><span data-v-f87c67ca=\"\">Private A round funding. The successful round brings together<\/span><b data-v-f87c67ca=\"\"> a star-studded lineup<\/b><span data-v-f87c67ca=\"\"> of investors, fueling MetaCene's mission to create a borderless on-chain homeland, which unites MMORPG players, content creators, and Web3 enthusiasts through “co-entertainment, co-creation, and co-governance”.<\/span>","<span data-v-f87c67ca=\"\">The round was led by renowned blockchain investment firms Folius Ventures and SevenX Ventures, with participation from other industry heavyweights including The Spartan Group, Mantle EcoFund, Animoca Ventures, Longling Capital, Comma3 Ventures, IGG and more. This diverse group of investors exemplifies the immense potential of MetaCene's vision and their confidence in the team's ability to execute.<\/span>","<span data-v-f87c67ca=\"\">\"Investing in <\/span><a href=\"https:\/\/metacene.io\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">MetaCene<\/span><\/a><span data-v-f87c67ca=\"\"> isn't just about backing a great project; it's about investing in the future of blockchain gaming. We believe their approach to empowering players to own digital identities and assets, claim their part of the gaming world, and infinitely create and extend this open world has great potential to create a truly revolutionary and timeproof gaming experience. This investment reflects our commitment to supporting projects that are shaping the future of the industry,\" said [Jason, Founder of Folius Ventures].<\/span>","<span data-v-f87c67ca=\"\">We are very optimistic that the Metacene team, under Alan's leadership, will bring a new level of innovation to Web3 games that not only elevates the level of Web3 game production to new standard but also deeply integrates a mature economic system, a native asset model and creative distribution mechanisms into an RPG genre that has great commercialization potential. We look forward to seeing Metacene bring the best experience to gamers around the world in the coming Web3 gaming boom. [Jon, Partner of SevenX Ventures]<\/span>","<span data-v-f87c67ca=\"\">Founded by industry veterans with over 20 years of experience from behemoths like Shanda Games, Blizzard, Perfect World, and others, MetaCene is developed on Unreal Engine 5 with wide accessibility across PC, iOS, Android, and cloud platforms, ensuring seamless million-player online experiences.<\/span>","<span data-v-f87c67ca=\"\">Through two rounds of rigorous Alpha Test in 2023, MetaCene has not only demonstrated the game's AAA-aspiring quality but also highlighted its rapidly growing community base. From Alpha Test V.1 to V.2, the number of participating players had grown from 2,961 to 5,000+; daily average gaming time had increased from 2.5 hours per player to 4 hours. Notably, during Alpha Test V.2, over 20% of players made on-chain purchases, averaging $143 per paid-player.<\/span>","<span data-v-f87c67ca=\"\">MetaCene has launched two major NFT collections along its rapid game development. The <\/span><b data-v-f87c67ca=\"\">MetaCene Apostle NFT (MAN) <\/b><span data-v-f87c67ca=\"\">collection, limited to 500 pieces for the most honorable contributors to the ecosystem, achieved an impressive 400% value growth during Alpha Test V.2. The <\/span><b data-v-f87c67ca=\"\">Cece Cube NFT<\/b><span data-v-f87c67ca=\"\"> collection, consisting of 2,997 pieces, has established itself as a driving force of MetaCene’s NFTFi system. MAN and Cece collections have accumulated a<\/span><b data-v-f87c67ca=\"\"> total volume of 1,314 ETH, <\/b><span data-v-f87c67ca=\"\">reflecting the strong valuation and community confidence in MetaCene assets.<\/span>","<span data-v-f87c67ca=\"\">\"This funding empowers us to accelerate our ambitious vision. We'll invest in expanding our development team and attracting top talent across tech, design, and community management. The funds will fuel user acquisition initiatives and deepen our engagement with the passionate MetaCene community. Ultimately, we're committed to delivering the most immersive and player-driven blockchain MMORPG experience possible, and this investment serves as a springboard for achieving that goal,\" said Alan Tan, the founder and CEO of MetaCene.<\/span>","<span data-v-f87c67ca=\"\">Collaborated with powerhouses like Mocaverse, YGG and Ancient8 and galvanized by committed investors, MetaCene looks forward to <\/span><a href=\"https:\/\/www.metacene.io\/thirdtest\/\" data-v-f87c67ca=\"\"><b data-v-f87c67ca=\"\">Alpha Test V.3 in March 2024<\/b><\/a><span data-v-f87c67ca=\"\">, which will include both PC and mobile platforms. Through the upcoming Content Creator Incubation Program, MetaCene is preparing to launch the<\/span><b data-v-f87c67ca=\"\"> Realms NFT <\/b><span data-v-f87c67ca=\"\">collection, an innovative server-centered asset that will allow holders to<\/span><b data-v-f87c67ca=\"\"> build <\/b><b data-v-f87c67ca=\"\">their own MetaCene world<\/b><b data-v-f87c67ca=\"\">.<\/b>","<span data-v-f87c67ca=\"\">As the release of <\/span><b data-v-f87c67ca=\"\">Commercial Version 1.0<\/b><span data-v-f87c67ca=\"\"> inches closer in 2024, MetaCene aims to bring its <\/span><b data-v-f87c67ca=\"\">co-creation and co-governance <\/b><span data-v-f87c67ca=\"\">vision into life through <\/span><b data-v-f87c67ca=\"\">AI <\/b><span data-v-f87c67ca=\"\">integration and blockchain assets. By actively incorporating community feedback and ideas into the game design, MetaCene aspires to drive the maturation of a meta-MMO platform and continues to offer an unparalleled experience for all players.<\/span>","<a href=\"https:\/\/metacene.io\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">MetaCene<\/span><\/a><span data-v-f87c67ca=\"\"> is building a next-gen blockchain MMORPG homeland for mass players. It presents a surreal post-apocalyptic society where survivors interact with diverse NFTs to redefine civilizations. MetaCene pioneers player-centric entertainment, governance, and creation through innovative PVE and PVP gameplay, robust technology infrastructures, social guild DAO governance, sustainable economic systems, and in-game <\/span><span data-v-f87c67ca=\"\">AIGC <\/span><span data-v-f87c67ca=\"\">editors. MetaCene is founded by gaming experts with 20+ years of industry experience from Shanda Games, Blizzard, Perfect World, and others. It envisages a multi-chain future from Rangers Protocol with real-time confirmation and super-low gas fees.<\/span>","<a href=\"https:\/\/metacene.io\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Website<\/span><\/a> <span data-v-f87c67ca=\"\">|<\/span> <a href=\"https:\/\/twitter.com\/MetaCeneGame\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Twitter<\/span><\/a> <span data-v-f87c67ca=\"\">|<\/span> <a href=\"https:\/\/discord.gg\/metacenegame-official\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Discord<\/span><\/a>","<br data-v-f87c67ca=\"\">\n<em data-v-f87c67ca=\"\">This post is commissioned by Blockman and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Blockman","content":"PERSON"},{"type":"Spartan Group","content":"ORGANIZATION"},{"type":"Longling Capital","content":"ORGANIZATION"},{"type":"MetaCene","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"[Jason","content":"PERSON"},{"type":"20%","content":"PERCENT"},{"type":"Cece Cube NFT","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Folius Ventures","content":"ORGANIZATION"},{"type":"Shanda Games","content":"PERSON"},{"type":"$143","content":"MONEY"},{"type":"Founder of Folius Ventures]","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"},{"type":"PVP","content":"ORGANIZATION"},{"type":"Partner of SevenX Ventures]","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Jon","content":"PERSON"},{"type":"Alan Tan","content":"PERSON"},{"type":"MetaCene Apostle NFT","content":"ORGANIZATION"},{"type":"400%","content":"PERCENT"},{"type":"Mocaverse","content":"PERSON"},{"type":"March 2024","content":"DATE"},{"type":"Animoca Ventures","content":"ORGANIZATION"},{"type":"Realms NFT","content":"ORGANIZATION"},{"type":"Mantle EcoFund","content":"PERSON"},{"type":"YGG","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}