{"summary":"USA v. Shamo is a federal criminal case involving a dark web drug conspiracy using bitcoin for sales.\nAfter conviction, defendant filed a motion for acquittal \nThe Court denied the motion, finding substantial evidence to support the conviction ","author":["Nelson Rosario","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/41397\/fed-court-upholds-dark-web-drug-market-conviction-where-bitcoin-was-used-for-payment","publishDate":"2019-09-29T10:18:06","id":3508,"type":null,"title":"Fed Court upholds dark web drug market conviction where bitcoin was used for payment","category":["Legal"],"content":["<a class=\"br cx lv lw lx ly\" href=\"https:\/\/scholar.google.com\/scholar_case?case=5188089718057708441\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Link to order<\/a>","This opinion from a Utah federal court denies a motion for a judgment of acquittal in a criminal case. &nbsp;That's what you do when you've been convicted of a crime and don't like the results because, say, you want to argue that the prosecutor screwed up or the jury got it wrong (and you don't want to go to prison). These motions are filed as a matter of course in criminal cases, and while they are occasionally successful, they are typically not so much, which is what happened here in <em data-v-f87c67ca=\"\">USA v. Shamo<\/em>.","So, what's this case about? &nbsp;Aaron Shamo was convicted on August 30, 2019, in Utah federal court for “engaging in a continuing criminal enterprise, three counts of aiding and abetting the importation of a controlled substance, possession of a controlled substance with intent to distribute, manufacture of a controlled substance, and two counts of knowing and intentional adulteration of drugs while held for sale,” according to a press release associated with the conviction.","Shamo ran a Dark Web storefront that allowed people to buy drugs with bitcoin. The buyers were individuals and other dealers around the country who could leverage Shamo’s contacts in China to get fentanyl and other opioids. After federal agents were able to gather evidence on the operation, Shamo and his co-conspirators were indicted, and ultimately convicted. &nbsp;For the eleventy-millionth time, the notion that bitcoin can do anything to save you from being convicted of crimes is here, again, debunked.","Shamo’s attorneys argued in their motion that there was insufficient evidence to sustain two of his convictions. Their reasoning? &nbsp;His attorneys argued that he should not be convicted of engaging in a continuing criminal enterprise because there was other evidence that would have been exculpatory. &nbsp;The Court responds by describing a bunch of evidence that it viewed as ultimately completely damning:","So, no dice on the motion to acquit on these grounds. Defendant also moved to acquit was related to his conviction for a death caused by fentanyl. The judge completely shut that down by pointing out that a toxicologist testified to the victim having fentanyl in his system, and that Shamo’s product was found at the scene. Alcohol and other drugs in the victim’s system could not have caused the respiratory failure that caused the victim’s death, but fentanyl could.","Shamo’s attorneys may appeal the case, but this motion failed for what looks like fairly obvious reasons. The Dark Web remains a thriving marketplace for illegal things that are seemingly more easily purchased with crypto, but the fact that can use magical internet money to buy and sell drugs doesn't mean that people won't get caught for doing the same."],"hashtag":[]}