{"summary":"The developers of Eco Protocol have unveiled a crypto wallet named Beam for payments on Optimism and Base.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241716\/beam-wallet-a16z","publishDate":"2023-07-27T09:00:43","id":3515,"type":null,"title":"a16z-backed Eco unveils Beam wallet to offer payments on Optimism, Base","category":["CRYPTO ECOSYSTEMS"],"content":["Eco Inc., the team behind the decentralized currency project Eco Protocol, unveiled a crypto wallet named Beam that offers users the ability to make payments on Ethereum Layer 2 networks: Optimism and Coinbase’s Base.","Beam incorporates features like <a href=\"https:\/\/www.theblock.co\/post\/239386\/safe-wallet-erc-4337-account-abstraction\" data-v-f87c67ca=\"\">account abstraction<\/a> (EIP-4884), enabling the wallet to function as smart contracts and support a range of advanced features like multi-factor authentication and wallet social recovery.","“We’re bridging the gap between conventional payments and cryptocurrency, fulfilling an industry expectation that has persisted for over a decade,” commented Andy Bromberg, CEO of Eco Inc., the a16z-backed primary entity leading the development of the Eco Protocol.","Elaborating on Beam’s capabilities, Bromberg, who took on Eco Inc.’s CEO role in 2020 after founding the cryptocurrency listing platform CoinList in 2017, remarked, “With Beam, users can access the intrinsic advantages of cryptocurrency—such as censorship resistance, self-custody, and privacy—integrated with the user-friendly interface of Web2 peer-to-peer payment systems, available globally.”","Till date, Eco Inc. has <a href=\"https:\/\/www.crunchbase.com\/organization\/eco-66cd\/company_financials\" data-v-f87c67ca=\"\">secured<\/a> over $90 million in multiple funding rounds to develop Eco Protocol from notable investors such as a16z, Lightspeed Venture Partners, and Pantera Capital.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"$90 million","content":"MONEY"},{"type":"2017","content":"DATE"},{"type":"Bromberg","content":"PERSON"},{"type":"4884","content":"DATE"},{"type":"Lightspeed Venture Partners","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Coinbase’s Base","content":"ORGANIZATION"},{"type":"Andy Bromberg","content":"PERSON"},{"type":"Beam","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Eco Inc.","content":"ORGANIZATION"}],"hashtag":["BASE"],"authors":["Vishal Chawla","The Block"]}