{"summary":"The Maker Foundation sold $27.5 million worth of MKR tokens to Dragonfly Capital and Paradigm \nThe foundation is looking to expand into Asia, where there is growing adoption of stablecoins\nThe Maker Foundation also sees the dominance of Tether’s USDT token in Asia as a positive sign for Dai adoption in the region.","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/51059\/makerdao-receives-27-5m-from-dragonfly-and-paradigm-to-expand-into-asia","publishDate":"2019-12-19T08:00:16","id":3515,"type":null,"title":"MakerDAO receives $27.5M from Dragonfly and Paradigm to expand into Asia","category":["Asia"],"content":["A pair of venture capital firms have invested $27.5 million in the MakerDAO protocol.","<span data-v-f87c67ca=\"\">Dragonfly Capital and Paradigm used the funds to purchase around 5.5% of the total MKR token supply in a bid to help the stablecoin project to capture the Asia market that has long been dominated by Tether's USDT. MKR tokens are used as part of MakerDAO's governance system, in which holders are granted voting rights and can participate in the decision-making process.<\/span>","<span data-v-f87c67ca=\"\">The Maker Foundation, the non-profit organization serving as an interim custodian for the MakerDAO protocol, announced the news on Thursday. <\/span>","<span data-v-f87c67ca=\"\">In September 2018, the foundation sold around 6% of the MKR tokens to venture capital heavyweight Andreessen Horowitz for $15 million. <\/span><span data-v-f87c67ca=\"\">With the completion of the sale, the three venture firms combined control 11.5% of the MakerDAO network’s decision-making power.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The partnerships with Dragonfly and Paradigm are part of MakerDAO’s effort to break into the Asia market. According to the Maker Foundation CEO Rune Christensen, Dai has seen a surge in traffic from China, and an expansion into the region at this time could lead to heightened market adoption of decentralized finance (DeFi) products and services.<\/span>","<span data-v-f87c67ca=\"\">“Right now there is this incredible hype and excitement about DeFi that is brewing, especially in China, but also South Korea… At some point there is just a switch that flips and you see the massive movement into bitcoin, ethereum, I think that same momentum could happen in DeFi as well and I think that’s exactly what’s brewing right now,” Christensen told The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The stablecoin market in Asia is currently still dominated by USDT, despite its issuer having been locked in <a href=\"https:\/\/www.theblockcrypto.com\/post\/20978\/ny-attorney-general-sues-bitfinex-and-tether\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a prolonged legal fight<\/a> with the New York Office of the Attorney General for alleged fraud. However, tether is still able to maintain a roughly&nbsp;<\/span><a href=\"https:\/\/www.stablecoinswar.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">95% market share<\/span><\/a><span data-v-f87c67ca=\"\">, much of which is <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/48857\/former-head-of-circle-otc-says-theres-more-to-the-tether-narrative\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">contributed<\/span><\/a><span data-v-f87c67ca=\"\"> by investors in Asia. <\/span>","<span data-v-f87c67ca=\"\">As such, the Maker Foundation thinks Dai can take advantage of the existing infrastructure that has been laid down for Asian investors to trade tether and capture the interest in a USD-denominated stablecoins.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"The dominance of tether [in Asia] is really what is appealing because it really shows this willingness to engage with crypto and also the demand for USD-denominated stablecoins… it would be the wrong approach to think of Dai as something that will directly compete with and try to replace tether, but rather it can benefit from the existing network that already exists with tether,\" said Christensen.<\/span>","<strong data-v-f87c67ca=\"\">Path to investment<\/strong>","<span data-v-f87c67ca=\"\">Christensen said the foundation has been in touch with Beijing and San Francisco-based Dragonfly for over a year, but it only recently decided to accept the venture firm’s check as a strategic investor to navigate the team through the Asia market.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"The Maker Foundation has always been very well capitalized, so we have been very focused on making sure that we distributed the limited 1 million MKR tokens as well as possible. So basically when they approached us in the past they just didn’t fit in with our current strategy, essentially,\" said Christensen.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">MakerDAO recently <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/50801\/okex-exchange-to-integrate-dai-savings-rate-allowing-users-to-earn-4-return\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">partnered<\/span><\/a><span data-v-f87c67ca=\"\"> with OKEx to integrate Dai Savings Rate, allowing holders of the stablecoin to earn a 4% return. OKEx, a cryptocurrency exchange that has a strong Asia presence, also lists MakerDAO’s MKR tokens. <\/span>","<span data-v-f87c67ca=\"\">Currently, the exchange and cryptocurrency wallet imToken are two of the major onramp venues for MKR and Dai, according to Christensen.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Our thesis on the space is that a lot of the really cool core technologies are being built in the west, and a lot of adoption in Asia, and we try to bridge that. Maker is perfect for that,” Dragonfly Capital managing partner Alexander Pack told The Block.&nbsp; <\/span>"],"hashtag":["DAI","PARADIGM"]}