{"summary":"Chinese tech giants have made their move into the NFT space by using their own permissioned blockchains.\nBut to do it in a compliant way, they have to localized the process and remove core crypto features of NFTs.","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/117245\/tencent-nft-mogao-caves-crypto","publishDate":"2021-09-13T11:33:00","id":3518,"type":null,"title":"Tencent mints NFTs to digitize a world heritage — on a private blockchain","category":["NFTs"],"content":["Chinese technology giants have made moves into the non-fungible token (NFT) space but in a localized way where crypto-native features are removed.","Tencent&nbsp;announced Wednesday that it has partnered with the Dunhuang Academy to digitalize the landmark wall paintings of the Mogao Caves, a <a href=\"https:\/\/whc.unesco.org\/en\/list\/440\/\" data-v-f87c67ca=\"\">UNESCO world heritage site<\/a> in China's Gansu province.","The project is Tencent's first move into the NFT market in its bid to use blockchain technology in a charity cause to protect and promote cultural heritage.","Tencent aims to issue 9,999 pieces of NFTs on its permissioned blockchain Zxinchain that each digitalizes a unique painting from the Mogao Caves. Starting from Wednesday, users on Tencent's WeChat messaging app can win the chance to get one NFT by taking a short quiz about the site and can display the digital card as a social status within the WeChat ecosystem.","For each issuance, Tencent's charity arm will make a donation to the Dunhuang Academy. The firm told The Block in an exclusive interview that the total donation is about 4 million yuan, or over half a million U.S. dollars.&nbsp;","Fino Feng, who leads the Dunhuang project at Tencent, said that as of Friday, about 380,000 people have participated in the quiz and all of the NFTs have been issued.&nbsp;","\"We want to use blockchain technology to break through the silos and bring more awareness to the protection of cultural heritage. NFTs can be that digital carrier for our traditional culture and bridge it with the people,\" Feng said.","Tencent is not the only tech firm that's riding on the recent NFT craze.","Alibaba's payment arm AliPay also tested the waters in June by selling NFTs of original arts created by the Dunhuang Fine Art Academy through its permissioned Antchain on AliPay's mobile app.","But different from a usual NFT issuance on public blockchains, Tencent has adapted to the local regulatory environment in China and essentially removed the core crypto features.","Issuing NFTs on public networks like Ethereum involves the usage of ether for whoever mints an NFT and whoever wants to buy and sell. Since the fiat on- and off-ramp for crypto assets in China has been increasingly restricted over the past years, the Dunhuang Academy deemed it not regulatory viable to launch the project on a public network.","Further, Qin Qing, product director at Tencent Blockchain, told The Block that currently the issuance happens only on the primary market level in that users won't be able to trade the NFT like what they can normally do with digital arts on Opensea.&nbsp;","However, Qin said they are open to the idea in the future — when there's a clearer regulation about NFTs in China – of opening up the system to allow third-party partners to create a marketplace where users can change hands of the NFTs.","\"Since Tencent issues it in the primary market, we can't launch a secondary marketplace ourselves,\" Qin said. \"But even with a secondary marketplace, it will only deal with fiat currency... and we obviously won't encourage flipping and speculative activities.\"","Qin added that another important difference for Tencent's NFT compared to crypto-native ones is every WeChat user who wins the lucky draw to get the Dunhuang NFT must be real-name verified in order to collect the digital card.","\"This is very different from NFTs on public blockchains that can remain anonymous,\" Qin said.","Similarly, AliPay forbids the trading of the NFTs sold or auctioned via its Antchain.","AliPay's user terms and services page currently indicates that NFT owners on Antchain can only give away an NFT after holding it for 180 days to a receiver who is above 14 years old, has completed the real-name verification inside AliPay and is a friend with the donor on AliPay.&nbsp;","But it appears AliPay didn't initially enforce the 180-day time constrain strictly and users found ways to flip the NFTs created by the Dunhuang Fine Art Academy in June on Alibaba's Xianyu app, a marketplace for second-hand goods.","Quotes on Xianyuan for one piece of those NFTs initially went up to as much as 1.5 million yuan, worth over $200,000. But Xianyu swiftly disabled such advertisements and the search for \"NFT\" on Xianyuan now shows no results.","",""],"hashtag":[]}