{"summary":"Hardware manufacturer AMD has joined the Blockchain Game Alliance and has also partnered with two blockchain gaming platforms \nAMD plans to “potentially transform the way games are created, published, purchased and played”\nAMD once bet big on crypto mining equipment business, but it failed to take off ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/50628\/nasdaq-listed-amd-enters-into-blockchain-gaming-space-after-its-crypto-mining-gear-business-failed-to-take-off","publishDate":"2019-12-16T05:40:06","id":3520,"type":null,"title":"AMD enters into blockchain gaming space; crypto mining gear business failed","category":["Startups"],"content":["Nasdaq-listed hardware manufacturer AMD has ventured into blockchain gaming space, after betting big on cryptocurrency mining equipment business once.","AMD has <a href=\"http:\/\/ir.amd.com\/news-releases\/news-release-details\/amd-and-industry-partners-develop-new-blockchain-based-gaming\" data-v-f87c67ca=\"\">joined<\/a> the Blockchain Game Alliance, which includes gaming giant Ubisoft and ethereum development studio ConsenSys as its members, among others. With the initiative, AMD plans to provide industry partners with “high-performance computing technologies” that could “potentially transform the way games are created, published, purchased and played.”","AMD has also partnered with blockchain-based <a href=\"https:\/\/www.theblockcrypto.com\/tag\/gaming\" data-v-f87c67ca=\"\">gaming<\/a> marketplaces Robot Cache and Ultra - both will use AMD’s Ryzen processors and Radeon graphics cards for “optimal” cryptographic computing performance. “Blockchain technology brings broader choice, security and flexibility to both gamers and publishers,” said Joerg Roskowetz, head of blockchain technology at AMD, adding: “Next-generation blockchain game platforms will give gamers access to exclusive online content, and provide new ways for them to truly own it.”","The hardware manufacturer once bet big on cryptocurrency mining equipment business, which <a href=\"https:\/\/www.coindesk.com\/crypto-mining-made-up-10-of-amds-revenue-in-q1\" data-v-f87c67ca=\"\">accounted<\/a> for as much as 10% of its Q1 2018 revenue of $1.65 billion. Over the next two quarters, its revenue from the crypto mining space decreased and <a href=\"https:\/\/seekingalpha.com\/filing\/4317131\" data-v-f87c67ca=\"\">disappeared entirely<\/a> in the fourth quarter of 2018. Its latest <a href=\"https:\/\/seekingalpha.com\/article\/4300171-advanced-micro-devices-inc-amd-ceo-lisa-su-on-q3-2019-results-earnings-call-transcript?part=single\" data-v-f87c67ca=\"\">earnings call<\/a> (Q3 2019) also doesn’t mention anything about the crypto mining space.","In Q3 2019, AMD <a href=\"http:\/\/ir.amd.com\/static-files\/f5bd3d28-b247-402f-a411-f1481981e076\" data-v-f87c67ca=\"\">recorded<\/a> revenue of $1.80 billion, driven by growth in the computing and graphics segment. “Our first full quarter of 7nm Ryzen, Radeon and EPYC processor sales drove our highest quarterly revenue since 2005, our highest quarterly gross margin since 2012 and a significant increase in net income year-over-year,” Lisa Su, president and CEO of AMB, said at the time.","Now with its focus on blockchain gaming space, AMD said it aims to enable several new blockchain-powered applications, services and use cases. “AMD is in a unique position to offer the best combination of high-performance CPUs [central processing units] and GPUs [graphics processing units] for demanding blockchain workloads,” it said."],"hashtag":[]}