{"summary":"Coinbase has rebooted its lobbying activities in recent months to become one of the crypto industry’s biggest spenders in Washington.\nIn addition to a range of new contracts with law and lobbying firms, Coinbase spent $625,000 on its internal lobbying activities, which had been dormant since 2016. \nThe backdrop of the new lobbying push is a series of setbacks among federal regulators, as well as heightened attention on cryptocurrency in Congress. ","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/121687\/coinbase-spent-nearly-800k-on-lobbying-in-2021s-third-quarter-as-part-of-influence-revamp","publishDate":"2021-10-22T12:25:45","id":3521,"type":null,"title":"Coinbase spent nearly $800K on lobbying in 2021&#x27;s third quarter as part of influence revamp","category":["The Block"],"content":["Leading crypto exchange Coinbase has massively ramped up its lobbying work in recent months, according to new lobbying disclosures.","Indeed, the lobbying disclosures from the third quarter of 2021 show that Coinbase has become one of the biggest spenders in crypto.&nbsp;Notably, the exchange re-registered its internal lobbying program in September. According to an October 20 disclosure, Coinbase revealed that Q3 spending on lobbying hit $625,000.","That amount comes from a firm that briefly registered to lobby back in 2015, spending a reported total of only $55,000 that whole year before terminating its registration at the beginning of 2016.&nbsp;","Subsequently, Coinbase contracted lobbying firm Franklin Square Group for several years and onboarded law firm Steptoe &amp; Johnson earlier in 2021. But Q3 2021 also saw the registration of contracts to lobby with a host of new firms, with reported spending of $170,000 on those companies.","Between Coinbase's internal lobbying operation and those contracts, Coinbase reported $795,000 in lobbying spending during the third quarter.","A Coinbase spokesperson told The Block:","The <a href=\"https:\/\/uscode.house.gov\/view.xhtml?req=granuleid:USC-prelim-title2-section1602&amp;num=0&amp;edition=prelim#:~:text=The%20term%20%22lobbying%20activities%22%20means,the%20lobbying%20activities%20of%20others.\" data-v-f87c67ca=\"\">Lobbying Disclosure Act<\/a>, which mandates these filings, is fairly limited in scope as to what it considers lobbying and who needs to register. It applies to any contact with members of Congress and their staff, as well as high-level members of the executive branch. Notably, it covers a surprisingly small segment of the staffs at financial regulators.","Lobbying activities, meanwhile, are defined as \"[l]obbying contacts and efforts in support of such contacts, including preparation and planning activities, research and other background work that is intended, at the time it is performed, for use in contacts, and coordination with the lobbying activities of others.\"","Within that scope, the $795,000 figure doesn't cover the full extent of Coinbase's spending on policy more broadly, including any full-time employees with a focus on this area.","The firm has plenty of work to do in Washington.","As the highest-profile publicly traded crypto firm in the U.S., Coinbase has emerged as a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/117651\/elizabeth-warren-and-gary-gensler-place-coinbase-in-oversight-crosshairs\" data-v-f87c67ca=\"\">central bugbear for the Securities and Exchange Commission<\/a> under Chairman Gary Gensler, who is eager to extend SEC registration to crypto exchanges.&nbsp;","There was apparently no love lost. Early in September, Coinbase CEO Brian Armstrong took to Twitter to attack the SEC's <a href=\"https:\/\/www.theblockcrypto.com\/linked\/116888\/coinbase-sec-crypto-yield-product\" data-v-f87c67ca=\"\">work on the firm's Lend product<\/a>, which, by his account, the commission effectively shut down.","As the disclosures illustrate, it was just weeks later that Coinbase began its flurry of new lobbying contracts and registrations. This push followed a series of new hires in compliance and policy earlier in the summer, including Faryar Shirzad as Chief Policy Officer.","Only last week, Shirzad <a href=\"https:\/\/www.theblockcrypto.com\/post\/120674\/coinbase-unveils-lobbying-push-for-a-brand-new-us-regulator-focused-on-digital-assets\" data-v-f87c67ca=\"\">unveiled the firm's massive push<\/a> for a new regulatory agency specialized in digital assets. The proposed agency is also a centerpiece of Coinbase's new lobbying efforts."],"hashtag":["COINBASE","GARY GENSLER","SEC"]}