{"summary":"Kakao-backed blockchain network Klaytn plans to explore tokenization practices with a shipping unit of Korindo, an Indonesian conglomerate.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/261933\/klaytn-plans-to-explore-ship-asset-tokenization-with-korindo-neopin","publishDate":"2023-11-07T19:00:03","id":3525,"type":null,"title":"Klaytn plans to explore ship-asset tokenization with Korindo, NEOPIN","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Klaytn, a Layer 1 blockchain network developed by South Korean internet giant Kakao, has partnered with PT Pelayaran Korindo and NEOPIN to explore tokenization opportunities.<\/span>","<span data-v-f87c67ca=\"\">The Klaytn Foundation said in a statement shared with The Block that it plans to develop a real-world asset tokenization business model with ship-related assets held by the shipping subsidiary of Korindo, whose businesses cover various industries including natural resources, logistics, heavy industry, paper, finance and real estate.<\/span>","<span data-v-f87c67ca=\"\">“Ship finance typically involves the financing of ship building and purchasing by offering the ships themselves as collateral,” Klaytn added. “The tokenization of ship assets is expected to significantly expand the accessibility of ship finance to individual investors as well as institutions, contributing to the diversification of investment assets for web 3-based finance.”<\/span>","<span data-v-f87c67ca=\"\">The blockchain company explained that its RWA initiative — starting with the tokenization of ship assets — is expected to enhance liquidity and diversify investment channels.<\/span>","<span data-v-f87c67ca=\"\">Klaytn did not disclose the potential size or value of such tokenization for ship-related assets as the partnership is still in the memorandum of understanding phase.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Sangmin Seo, Representative Director of Klaytn Foundation, said that the blockchain network has gained practical experience in the service-building process, “from identifying excellent RWA tokenization projects to launching actual services.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sangmin Seo","content":"PERSON"},{"type":"Kakao","content":"PERSON"},{"type":"Representative Director of Klaytn Foundation","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Korindo","content":"LOCATION"},{"type":"Klaytn Foundation","content":"ORGANIZATION"}],"hashtag":["CRYPTO","FINTECH"],"authors":["Timmy Shen","The Block"]}