{"summary":"Doodles 2 is arriving at the end of the month and will launch on the Flow blockchain, a move that the NFT shop hopes will unlock endless customization.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/205452\/doodles-2-arrives-with-new-personalization-options-and-expansion-to-flow-blockchain","publishDate":"2023-01-25T10:34:34","id":3526,"type":null,"title":"Doodles 2 arrives with new personalization options and expansion to Flow blockchain","category":["METAVERSE & NFT"],"content":["<span data-v-f87c67ca=\"\">For fans of the Doodles NFT collection the wait is nearly over. Doodles 2 is set to launch at the end of the month.<\/span>","<span data-v-f87c67ca=\"\">Confirming months of speculation, the new “NFT experience” called Doodles 2 will launch on the Flow blockchain, a distributed ledger created by the prolific NFT studio Dapper Labs.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Why the move? Like a lot of NFT collections which achieved early success during the bull run for digital assets — that has since <a href=\"https:\/\/www.theblock.co\/search?query=nft%20market&amp;start=10\" data-v-f87c67ca=\"\">cooled drastically<\/a> — the companies behind them are seeking alternative revenue streams by expanding the scope of their businesses.<\/span>","Doodles CEO Julian Holguin said in a statement that as the brand aims to grow across “other verticals like animation and music,” using Flow should help attract consumers unfamiliar with owning digital assets as it is perhaps by some measure more user friendly. In the same statement, Doodles suggested its updated strategy could lead to the onboarding of “millions” of new customers.","This new initiative labeled Doodles 2 appears to be focused on not only growing the community but also spurring increased engagement. The company said that because Doodles holders won’t have to pay gas fees with Flow they should “enjoy endless customization” of their Doodle.<span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","","<span data-v-f87c67ca=\"\">On Twitter especially, people often use NFTs from famous collections like Bored Ape Yacht Club, CryptoPunks and Doodles as their personal profile photo. Because of the high value attached to some of the NFTs from these collections, <a href=\"https:\/\/www.theblock.co\/post\/183292\/with-twitter-and-opensea-deal-adrift-magic-eden-emerges-as-key-nft-partner\" data-v-f87c67ca=\"\">employing the digital assets<\/a> as a personal avatar is considered trendy by some as a way to demonstrate not only one’s prestige but also enthusiasm for NFTs.<\/span>","<span data-v-f87c67ca=\"\">“Doodles is one of the most recognizable brands in web3,” Dieter Shirley, chief architect of Flow said in the statement.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Growing brand awareness and diversifying beyond the initial NFT collection — based on characters created by the artist Burnt Toast — appears to be top of mind for Doodles executives. The NFT shop earlier this week acquired the <\/span><span data-v-f87c67ca=\"\">animation studio Golden Wolf, which has worked on shows like “Rick and Morty” plus Hollywood’s most powerful movie studio, Disney. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Additionally, musical artist <\/span><span data-v-f87c67ca=\"\">Pharrell Williams <\/span><a href=\"https:\/\/www.theblock.co\/post\/183902\/doodles-ceo-says-brand-is-ready-to-grow-up-aims-for-disney-level-brand-recognition\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">became Doodles’s<\/span><\/a> <span data-v-f87c67ca=\"\">chief brand officer late last year.<\/span>","<span data-v-f87c67ca=\"\">Doodles entered the NFT market with its debut collection out in October 2021. It then raised $54 million last <\/span><a href=\"https:\/\/www.theblock.co\/post\/169601\/doodles-announces-54-million-raise-plots-hiring-spree\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">September<\/span><\/a> <span data-v-f87c67ca=\"\">in a funding round led by Reddit co-founder and NFT enthusiast Alexis Ohanian’s venture capital firm 776.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<em data-v-f87c67ca=\"\">Updated with new featured photo.<\/em><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Reddit","content":"LOCATION"},{"type":"Dieter Shirley","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Rick","content":"PERSON"},{"type":"Alexis Ohanian","content":"PERSON"},{"type":"Doodles NFT","content":"ORGANIZATION"},{"type":"October 2021","content":"DATE"},{"type":"Golden Wolf","content":"ORGANIZATION"},{"type":"Pharrell Williams","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$54 million","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"Julian Holguin","content":"PERSON"},{"type":"Disney","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}