{"summary":"Singapore’s largest bank has officially announced it will set up a digital asset exchange\nSingapore’s stock exchange will take 10% stake in the bank’s new crypto trading platform","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/87284\/singapore-stock-exchange-dbs-crypto","publishDate":"2020-12-10T05:36:26","id":3527,"type":null,"title":"Singapore stock exchange takes 10% stake in DBS’ new crypto trading platform","category":["Asia"],"content":["Singapore's largest bank DBS has officially announced it will set up a digital asset exchange and the country's stock exchange will take 10% stake in the new trading platform.","In a <a href=\"https:\/\/links.sgx.com\/FileOpen\/DBS%20Digital%20Exchange_media%20release.ashx?App=Announcement&amp;FileID=641963\" data-v-f87c67ca=\"\">release<\/a> on Thursday, DBS confirmed it will set up a digital exchange that opens to only institutional and accredited investors.","The platform, called DBS Digital Exchange, will be a regulated venue for the issuance and trading of security tokens. Further, DBS Digital Exchange will support crypto asset trading pairs for fiat currencies including SGD, USD, HKD and JPY against four crypto assets: BTC, ETH, BCH and XRP, which can begin as early as next week.","“The exponential pace of asset digitalization provides immense opportunities to reshape capital markets. For Singapore to become even more competitive as a global financial hub, we have to prepare ourselves to welcome the mainstream adoption of digital assets and currency trading,\" Piyush Gupta, Group CEO of DBS, said in the announcement.","In addition, the Singapore Stock Exchange (SGX) will take a 10% stake in DBS Digital Exchange. The two entities will work together to deepen the liquidity and grow Singapore’s capital markets in the developing space of digital assets and cryptocurrencies.","“We are excited to apply our strengths in market infrastructure and risk management to this venture. There are significant opportunities to bring trust and efficiency in price discovery to the global digital assets space,\" said Loh Boon Chye, CEO of SGX.","The announcement follows <a href=\"https:\/\/www.theblockcrypto.com\/post\/82411\/singapore-biggest-bank-dbs-crypto-exchange\" data-v-f87c67ca=\"\">reports<\/a> in October that DBS is launching a digital asset exchange. The banking giant made public a webpage with details about the digital exchange offerings but deleted it shortly after the page drew wide public attention.","The two parties said in the Thursday release that the plan follows the in-principle approval by the Monetary Authority of Singapore for DBS Digital Exchange to be a Recognized Market Operator.&nbsp;","In addition to crypto trading, DBS will offer digital asset custody under regulatory standards to meet the increasing demand for secure digital assets custodial services."],"hashtag":[]}