{"summary":"Bitcoin whales are on an accumulation spree and are holding on to their coins as prices remain rangebound, according to CryptoQuant.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241736\/bitcoin-whales-cryptoquant","publishDate":"2023-07-27T10:41:23","id":3528,"type":null,"title":"Bitcoin whales are in accumulation mode, says CryptoQuant","category":["MARKETS"],"content":["Bitcoin whales, or large holders of the cryptocurrency, are on an accumulation spree and are holding onto their coins as prices remain rangebound, according to data and research firm CryptoQuant.","Citing three data points in its latest weekly report — exchange whale ratio, exchange inflow coin days destroyed (CDD) and unspent transaction output (UTXO) value bands — CryptoQuant concluded that <a href=\"https:\/\/www.theblock.co\/linked\/135716\/number-of-bitcoin-whales-spikes-as-sanctions-on-russia-bite\" data-v-f87c67ca=\"\">bitcoin whales<\/a>, holding 1,000 to 10,000 bitcoin, have been accumulating more bitcoins this month at <a href=\"https:\/\/www.theblock.co\/post\/241516\/bitcoins-price-rises-slightly-after-fed-hikes-rates-as-expected\" data-v-f87c67ca=\"\">price<\/a> levels of around $30,000.","The first data point — <a href=\"https:\/\/cryptoquant.com\/asset\/btc\/chart\/flow-indicator\/exchange-whale-ratio?exchange=all_exchange&amp;window=DAY&amp;sma=30&amp;ema=0&amp;priceScale=log&amp;metricScale=linear&amp;chartStyle=line\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">bitcoin exchange whale ratio<\/a> — is the ratio of the top 10 bitcoin inflows to an exchange in comparison to the total bitcoin inflows of the exchange. The ratio indicates what percentage of inflows to an exchange was made by whales on a given day. CryptoQuant said bitcoin's exchange whale ratio on all exchanges using a simple moving average over the past 30 days (SMA 30) has hit a 5-year low, indicating that the top 10 inflows to exchanges are noticeably small compared to the total inflows to crypto exchanges.","In other words, whales are holding onto their bitcoin, resulting in reduced movements on exchanges.","","","The second data point — <a href=\"https:\/\/cryptoquant.com\/asset\/btc\/chart\/flow-indicator\/exchange-inflow-cdd?exchange=all_exchange&amp;window=DAY&amp;sma=0&amp;ema=0&amp;priceScale=log&amp;metricScale=linear&amp;chartStyle=line\" data-v-f87c67ca=\"\">exchange inflow coin days destroyed (CDD)<\/a> — is a metric that measures how long bitcoin has been held in an address before it was last moved, giving more weight to coins held for a longer time. Bitcoin's exchange inflow CDD has reached an 8-year low on SMA 30 basis, CryptoQuant said, adding that it indicates inflows to exchanges from long-term investors are at historically low levels. In other words, whales are not actively moving their coins to exchanges for selling purposes.","","","The third data point — <a href=\"https:\/\/cryptoquant.com\/asset\/btc\/chart\/network-indicator\/utxo-value-bands?window=DAY&amp;priceScale=log&amp;metricScale=log\" data-v-f87c67ca=\"\">unspent transaction output (UTXO) value bands<\/a> — represents the unspent bitcoin amounts in different addresses. \"In simple terms, UTXO is quite similar to a public address (wallet),\" Mikołaj Zakrzowski, research analyst at CryptoQuant, told The Block. \"You can think of UTXO as a box containing some amount of bitcoins. Each UTXO points to only one public address and for instance, the amount of bitcoins that you see in your wallet is in fact multiple UTXOs pointing to your public address and together, when summed up, they make up the number that you see as a 'balance' in your wallet.\"","Bitcoin's UTXO value band of 1,000 to 10,000 bitcoins has been rising, CryptoQuant said. It means that whales holding between 1,000 and 10,000 bitcoins have been accumulating more bitcoins, the firm added. Zakrzowski said wallets holding 1,000 to 10,000 bitcoins are actual whales, according to CryptoQuant, because the larger cohort of wallets holding more than 10,000 bitcoins typically belong to exchanges or funds.<br data-v-f87c67ca=\"\">\n","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"CryptoQuant","content":"PERSON"},{"type":"Mikołaj Zakrzowski","content":"PERSON"},{"type":"$30,000","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"UTXO","content":"ORGANIZATION"},{"type":"Zakrzowski","content":"PERSON"}],"hashtag":["BITCOIN"],"authors":["Yogita Khatri","The Block"]}