{"summary":"The United States Trustee filed a motion to appoint an examiner to provide more transparency in Celsius&#x27; Chapter 11 case.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/164417\/us-trustee-moves-to-appoint-examiner-in-celsius-bankruptcy-case","publishDate":"2022-08-18T18:26:55","id":3539,"type":null,"title":"US Trustee moves to appoint examiner in Celsius bankruptcy case","category":["LEGAL"],"content":["The United States Trustee wants to appoint an examiner to embattled lender Celsius to produce an unbiased public report providing transparency on the firm's business operations, investments, transactions, and customer accounts.","Shara Cornell, the representative for the Office of the Trustee, teased the move in this week's second-day <a href=\"https:\/\/www.theblock.co\/post\/163956\/celsius-approved-to-access-mined-bitcoin-to-meet-operational-expenses\" data-v-f87c67ca=\"\">hearing<\/a> when she opposed Celsius's motion to access its mined bitcoin. She argued Celsius had repeatedly failed to submit sufficient information to her office, including specifics about costs related to the still-in-progress mining expansion. For that reason, she said during the hearing, her office was considering appointing an examiner for clarity on this and other issues.","Now, a new motion filed by the office is asking the US Bankruptcy Court for the Southern District of New York to enter an order to appoint that examiner.","Celsius filed for Chapter 11 bankruptcy protection last month after significant market volatility led to liquidity issues forcing the firm to halt withdrawals and enter bankruptcy proceedings. The filing acknowledges its cooperation in the Chapter 11 process but argues significant \"financial irregularities\" have taken place in the novel bankruptcy case requiring a third party to investigate. This should be a group outside of the creditor committee that speaks for the interests of the creditors and customers, said the Office of the Trustee.&nbsp;","\"Irrespective of such cooperation, however, the divergent interests of the various estates, the extreme financial irregularities that have taken place, and the extensive mistrust of the Debtors’ customers, all make the appointment of an independent and disinterested examiner in the best interests of creditors, equity security holders, and the bankruptcy estates,\" said the motion.","The filing cites allegations from regulators that Celsius offered unregistered securities and failed to obtain proper licenses and hedge against market volatility.","\"If these allegations are true, they could expose further irregularities. An examiner would be able to look into these and other issues to determine if there are any claims or causes of actions that the Unsecured Creditors Committee (the “Committee”) can pursue,\" the filing said.&nbsp;","The third-party investigation would also include a look into allegations of \"fraud, dishonesty, incompetence, misconduct, mismanagement, or irregularity in the management of the affairs of [the Debtors] of or by current or former management of [the Debtors].\"&nbsp;","While the filing cites numerous areas in which the office feels Celsius hasn't been sufficiently transparent, it also points to public sentiment. Indeed, Celsius customers have flooded the docket with letters detailing their predicaments and ensuing mistrust of the firm.&nbsp;","\"While the allegations may not be aligned, the overall message is clear — the creditors feel misled by the Debtors and current management,\" the filing said.","An outside examiner would provide visibility into Celsius's business model and balance sheet, as well as \"bridge the gap between the creditors and the Debtors by fostering trust in the information provided for a successful reorganization,\" the office argues.&nbsp;","\"Creditors, as well as investors, require an independent, conflict-free, experienced party investigating the financial affairs of these Debtors, free from the constraints of current management, to serve as a clear, easily understood, and trusted source of information,\" the filing said.","<em data-v-f87c67ca=\"\">Updated to name the federal bankruptcy court overseeing Celsius's case.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Southern District of New York","content":"ORGANIZATION"},{"type":"Shara Cornell","content":"ORGANIZATION"},{"type":"Celsius","content":"ORGANIZATION"},{"type":"United States Trustee","content":"ORGANIZATION"},{"type":"Office of the Trustee","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Unsecured Creditors Committee","content":"ORGANIZATION"},{"type":"“Committee","content":"ORGANIZATION"},{"type":"US Bankruptcy Court","content":"ORGANIZATION"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}