{"summary":"Galaxy Digital posted financial results for the third quarter that beat the third quarter of 2019, overall\nThe trading business—which saw record volumes in Q3—did not beat its Q32019 income results\nGalaxy also announced two acquisition deals on Friday.","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/84528\/galaxy-digital-crypto-q3-2020-results-financials-acquisition-deals","publishDate":"2020-11-13T12:48:32","id":3539,"type":null,"title":"Galaxy posts strong third-quarter financials, announces two acquisition deals","category":["Startups"],"content":["The third quarter of 2020 was marked by a resurgence in the price of bitcoin, and that gave the trading business at Galaxy Digital a boost, according to the firm's third-quarter financials released Friday.&nbsp;","The New York-based merchant bank said that its trading business saw volumes top $1.4 billion during the period— a 75% increase year-over-year.&nbsp;","\"GDT's momentum and market share gains have continued into October and November as Bitcoin approaches 2017 highs and its counterparties remain engaged and nimble,\" <a href=\"https:\/\/www.newswire.ca\/news-releases\/galaxy-digital-announces-third-quarter-2020-financial-results-and-provides-corporate-updates-855046562.html\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a press statement<\/a> from the firm noted. \"During the same period GDT's continued enhancements to its product suite have generated ongoing demand across its spot, lending, derivatives, and structured products businesses.\"","As for Galaxy's financials, the company posted income of $44 million for the quarter compared to the $68 million loss it reported in Q3 2019. Still, the firm's trading business—despite the record volumes—posted a net gain that came in at just $28 million compared to $163 million during the same period in 2019.&nbsp;","Galaxy, which operates a business that spans trading, asset management, and advisory, also announced Friday two acquisitions aimed at beefing up its existing operations. The two acquired companies are crypto lender DrawBridge and market maker Blue Fire.&nbsp;","\"DrawBridge and Blue Fire are both pioneers in applying their teams' institutional expertise in traditional lending, structured products, futures, and market-making to the rapidly growing cryptocurrency derivatives and lending space,\" a press release said of the deals.&nbsp;","In an analyst call, CEO Mike Novogratz described the deals as \"acquihires,\" noting that the firm has found it difficult to hire at a pace necessary to keep up with the fast-moving nature of the crypto space in recent months.&nbsp;","On the hiring front, Galaxy announced that it had replaced Ian Taylor, who previously led the firm's M&amp;A business. Michael Ashe, a former banker at Oppenheimer, joined Galaxy in October as its new head of investment banking.&nbsp;"],"hashtag":[]}