{"summary":"As of Feb. 4 a Fortnite player who goes by Mongraal was top of the leaderboard. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/209603\/bayc-cracks-down-dookey-dash-cheaters","publishDate":"2023-02-08T06:45:09","id":3540,"type":null,"title":"BAYC cracks down on Dookey Dash cheaters as finale approaches","category":["METAVERSE & NFT"],"content":["Blockbuster NFT collection Bored Ape Yacht Club is cracking down on cheaters playing its gamified mint Dookey Dash, as contestants look to the finish line later today.&nbsp;","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">We want Dookey Dash to be as fair as possible. As we've mentioned previously, we will not allow cheating,\" wrote the blue chip collection on <a href=\"https:\/\/twitter.com\/BoredApeYC\/status\/1623110323854082049?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1623110323854082049%7Ctwgr%5E08d1b935b18a23e7df3bded154fd640a8d18cc62%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fbeincrypto.com%2Fbored-ape-yacht-club-dookey-dash-cheaters%2F\" data-v-f87c67ca=\"\">Twitter<\/a>. \"We’ve already noticed some <\/span><span class=\"r-18u37iz\" data-v-f87c67ca=\"\">Dookey Dash<\/span><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\"> Sewer Passes associated with cheating. Those scores have now been removed from the leaderboard.\"<\/span>","The game, which launched in January, operates through a token-gated NFT called a Sewer Pass. These were awarded to holders of NFTs in the BAYC project and its counterpart Mutant Ape Yacht Club. These passes could then be sold on the secondary market, meaning anyone could buy into the game to claim a piece of the <a href=\"https:\/\/www.theblock.co\/post\/201354\/yuga-labs-gamifies-minting-nfts-with-dookey-dash\" data-v-f87c67ca=\"\">Dookey<\/a>.","Later today, the scoreboard will be locked, and the highest-scoring player will be awarded the “ultimate” prize — one that’s not only crucial to the next chapter of BAYC’s story saga “The Trial of Jimmy the Monkey” but will also likely hold significant monetary value on the open market.","The rest of the Sewer Passes will be given an award based on the highest score attributed to each pass.","The way the NFT was created has meant that Sewer Pass holders can delegate their asset to another player to play the game in their stead. Bored Ape Yacht Club also urged those doing this to make sure the person they had delegated the pass to was playing fairly.&nbsp;","\"If you are delegating passes, do your due diligence,\" the club wrote on Twitter. \"Make sure the person you're working with is playing fairly. If you have any concerns with how that person might have been using your pass while delegated, get your pass back and log a new score before the leaderboard locks.\"","As of Feb. 4 a Fortnite player who goes by Mongraal was <a href=\"https:\/\/www.theblock.co\/post\/206895\/fortnite-player-mongraal-claims-top-score-on-bored-ape-yacht-clubs-viral-nft-game-dookey-dash\" data-v-f87c67ca=\"\">top of the leaderboard.<\/a>&nbsp;","1st dookeydash. <a href=\"https:\/\/t.co\/eu1sw1s6eX\" data-v-f87c67ca=\"\">pic.twitter.com\/eu1sw1s6eX<\/a>","<script async=\"async\" src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\" data-v-f87c67ca=\"\"><\/script>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Mutant Ape Yacht Club","content":"ORGANIZATION"},{"type":"Feb. 4","content":"DATE"},{"type":"Mongraal","content":"PERSON"}],"hashtag":["BAYC","MAYC","PLAY2EARN"],"authors":["Lucy Harley-McKeown","The Block"]}