{"summary":"Rensel v. Centra Tech, Inc.\nThe three founders of Centra Tech project, which raised more than $32 million, are the subject of both an SEC enforcement action and are a criminal prosecution for fraud in federal court in Manhattan\nThis particular order grants a motion to dismiss by DJ Khaled, Floyd Mayweather, and Centra Tech CTO Steven Sykes\nEven though these defendants were involved in a token sale that turned out to be a scam, their conduct (as alleged in the class action complaint) did not make them liable for sale of unregistered securities securities or securities fraud","author":["Stephen D. Palley","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/23788\/dj-khaled-floyd-mayweather-dismissed-from-lawsuit-against-32m-ico","publishDate":"2019-05-17T11:35:58","id":3540,"type":null,"title":"DJ Khaled, Floyd Mayweather dismissed from lawsuit against project that held $32M ICO","category":["Legal"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]Rensel v. Centra Tech, Inc., 2019 U.S. Dist. LEXIS 79855 (S.D. Fl., 17–24500, 5\/13\/2019) [SDP]<br data-v-f87c67ca=\"\">\n<\/strong><\/em>","This case arises out of the Centra Tech initial coin offering (“ICO”) that took place between July 2017 and April 2018. The ICO raised “more than $32 million from thousands of investors.” Things didn’t go so well after that seemingly auspicious beginning. Three founders are the subject of both an SEC enforcement action and are being criminally prosecuted for fraud in federal court in Manhattan. This particular order grants a motion to dismiss by DJ Khaled, Floyd Mayweather, and Centra Tech CTO Steven Sykes.","As readers may recall, the Centra Tech founders used a marketing campaign in which they claimed they had created a first of its kind crypto debit card that worked with more than eight “major cryptocurrency blockchain assets” and that it would be accepted “anywhere that accepted Visa and Mastercard.” They also had the requisite whitepaper which explained why buying the tokens would be profitable. They also created fake executives with storied backstories and even fake LinkedIn profiles, and used those fake bios in investor presentations.","Centra Tech also paid celebrities to promote the token sale, including Floyd Mayweather and D.J. Khaled. They both used social media to promote Centra Tech. Mayweather, for example, “posted a tweet with a picture of himself holding a Centra Tech debit card and captioned the picture: ‘Spending bitcoins Ethereum and other types of cryptocurrency in Beverly Hills[.]’” Khaled engaged in similar social media stylings. Both Khaled and Mayweather have since agreed to consent orders with the SEC for violating anti-touting rules which say, in essence, that if you’re being paid to promote a security you have to disclose that, and have paid fines.","Plaintiffs in this class filed a securities fraud class action against the Centra Token founders and Mayweather and Khaled and also against Centra Tech’s CTO Steven Sykes. These defendants filed motions to dismiss, which the Court granted.","The parties did not dispute that the CTR tokens were unregistered securities sold in interstate commerce. At issue is these defendants “sold or offered to sell securities.”","As to Mayweather, the Court reasoned that with respect to Count I, which alleged unlawful sale of an unregistered security under Section 12(a)(1) of the Securities Act, “[t]he Plaintiff’s complaint fails to establish that Mayweather “successfully solicited” the Plaintiffs to purchase CTR Tokens. The allegations against Mayweather establish that he posted two tweets from his Twitter account related to CTR Tokens. One of the posts urges his followers to “get yours before they sell out, I got mine.” This is the closest thing to “solicitation” in the complaint. However, there are no allegations that this was a successful solicitation, that Mayweather had any contact with Plaintiffs, or that Plaintiffs even saw the posts.” With respect to Count III, which alleged fraud under Section 10(b) of the Exchange Act, the Court similarly held that there was no reliance and no fraud. In addition, the Court held that a theory that his fraud created the market also failed because there was evidence that the market for the tokens already existed before Mayweather was involved.","The Court applied a similar analysis to DJ Khaled. First, “Plaintiffs cannot assert that Khaled “successfully solicited” the Plaintiffs to purchase CTR Tokens.” Second, there is no evidence that Plaintiffs relied on Khaled’s tweets, and (like Mayweather) no evidence that his alleged fraud “created the market”, which already existed prior to his social media posts. As a result, the claims against Khaled were also dismissed.","Centra Tech CTO Sykes also filed a motion to dismiss. “He was responsible for the content and maintenance of Centra Tech’s website, including the website’s “customer experience.” (Id.) Sykes’s motion to dismiss argues that his involvement with Centra Tech’s website does not make him a seller of securities under Section 12(a)(1) of the Securities Act. In response, the Plaintiffs argue that “any and all solicitations for the purchase of CTR Tokens contained on the Centra Tech website are equally attributable to him and hence, he was a ‘seller’ of unregistered securities.”","The Court reasoned that general involvement in a company as a CTO does not make you a seller of securities and “does not establish that he had any contact with investors or in any way solicited investors to purchase CTR Tokens.” Similarly, “The allegations against Sykes are based on his involvement with the website. The Complaint, however, is devoid of any specificity with regard to the content of the website, when the website was launched, the alleged misstatements on the website, who determined the content on the website, and if the Plaintiffs ever even visited the website.” For these reasons, the Court dismissed all claims against the CTO.","Finally, the Court dismissed claims against Centra Tech’s Director of PR. As with the other defendants, there was no evidence that he was involved in the sale of securities and that any plaintiff read or relied upon his statements, which included answering questions in public forums and posting press releases.","Bottom line — even though these defendants were involved in a token sale that turned out to be a scam, their conduct (as alleged in the class action complaint) did not make them liable for sale of unregistered securities securities or securities fraud.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part I of this week's analysis, Crypto Caselaw Minute, is above.<\/em>"],"hashtag":[]}