{"summary":"The lure of generating yield on large stablecoin reserves could encourage a switch to the newer assets, says Ondo&#x27;s COO.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275448\/stablecoins-yield-ondo-coo","publishDate":"2024-02-01T10:44:24","id":3541,"type":null,"title":"Stablecoins that earn yield could overtake current swathe of stablecoins, says Ondo COO","category":["STABLECOINS"],"content":["<span data-v-f87c67ca=\"\">The market for yield-bearing stablecoins could be greater than the demand for the current swathe of stablecoins, according to <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ondo <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/275452\/ondo-ondo-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><!----> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ONDO<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +7.16%\n    <\/span><\/a> <!----><\/span><\/span> COO Justin Schmidt.&nbsp;<\/span>","“I very much view the total addressable market for yield-bearing stablecoins to be at least as large or larger than the current total addressable market of stablecoins now, going into the future,” said Schmidt in an interview.","As the COO of Ondo, Schmidt supports a project offering two yield-bearing tokens. One is OUSG, a token that provides exposure to an ETF of short-term U.S. Treasurys for accredited investors. The second is USDY, a stablecoin backed by bank deposits and U.S. Treasurys, which offers yield generated from the underlying assets.","Schmidt argued that anyone sitting on a pile of dollar-denominated assets should probably have them in a yield-bearing asset, as is often the case in traditional finance. He also pointed out that current stablecoins are backed by Treasurys, meaning the issuer takes home the yield instead of the token holder.","“If you've got, you know, USDC or USDT in there, you're not earning that yield — somebody else is. So you might as well put a yield-bearing dollar in there, it's just much more capital efficient for you,” he said.","Since its launch in March 2023, OUSG has accumulated $113 million of value, while USDY launched in November 2023 and has reached $71 million of value. In December, these products expanded to Solana. Earlier this month, the project launched its own governance token.","The ONDO token came under mild controversy as it was <a href=\"https:\/\/www.dlnews.com\/articles\/defi\/ondo-tops-1bn-trade-volume-as-investors-bet-on-tokenisation\/\" data-v-f87c67ca=\"\">criticized<\/a> for having a low initial float. Its token sale also represented just 2% of its initial supply — although this was because its CoinList token sale didn't sell out as the market was downtrodden following the collapse of Terra\/Luna. The majority of the rest of its supply was allocated for ecosystem growth and protocol development, with a chunk allocated to private sales.","The token, which revived awareness of the project, came at a good time; the project had seen declines in inflows over the previous few months.&nbsp;","Monthly inflows into OUSG declined significantly in Q4 2023, with the most notable being a 30% month-over-month decline in November, according to <a href=\"https:\/\/www.theblock.pro\/research\/rapid-insights-ondo-finance-debuts-token-amid-fundamental-decline-274076\" data-v-f87c67ca=\"\">The Block Pro Researc<\/a>h. The market capitalization of OUSG also experienced a ~30% decline between November and December.","As for the ONDO token, it rose to a market cap high of $430 million before retracing to its current $308 million market cap.","“Broadly, what we're looking to do is get to the point where we're on par with the utility of the 1.0 stablecoins,” said Schmidt. “We very much are in the process of getting the word out, explaining how we have been structured, explaining how we're similar, how we're different.”","“But very much it's going to be, over the next couple of months, getting to the point where it's supported in multiple different places so you can get liquidity when you need it, you can transfer it to whom you need to,” he added.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$71 million","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"2%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"$113 million","content":"MONEY"},{"type":"November","content":"DATE"},{"type":"The Block Pro Researc<\/a>h","content":"ORGANIZATION"},{"type":"Ondo","content":"LOCATION"},{"type":"$430 million","content":"MONEY"},{"type":"USDY","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Ondo <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/275452\/ondo-ondo-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><!----> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ONDO","content":"LOCATION"},{"type":"March 2023","content":"DATE"},{"type":"December","content":"DATE"},{"type":"Schmidt","content":"PERSON"},{"type":"$308 million","content":"MONEY"},{"type":"U.S. Treasurys","content":"ORGANIZATION"},{"type":"Terra\/Luna","content":"ORGANIZATION"},{"type":"Justin Schmidt","content":"PERSON"},{"type":"ONDO","content":"LOCATION"},{"type":"Solana","content":"PERSON"},{"type":"+7.16%","content":"PERCENT"}],"hashtag":["TETHER","USDC"],"authors":["Tim Copeland","The Block"]}