{"summary":"Binance has acquired a controlling stake in little-known Indonesian crypto exchange Tokocrypto, The Block has learned.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/64889\/binance-acquires-controlling-stake-in-little-known-indonesian-crypto-exchange-tokocrypto","publishDate":"2020-05-12T05:25:30","id":3542,"type":null,"title":"Binance acquires controlling stake in little-known Indonesian crypto exchange Tokocrypto","category":["EXCHANGES"],"content":["Binance has invested an undisclosed sum in little-known Indonesian cryptocurrency exchange Tokocrypto.","Announcing the news on Tuesday, Binance <a href=\"https:\/\/www.binance.com\/en\/blog\/421499824684900576\/Binance-Invests-in-First-Regulated-Cryptocurrency-Exchange-in-Indonesia-Tokocrypto\" data-v-f87c67ca=\"\">said<\/a> the investment would help Tokocrypto to launch new products and services and expand across Indonesia.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nWhile Binance did not disclose financial details of the deal, The Block has learned that the exchange has acquired a majority or controlling stake in Tokocrypto.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nWhen reached for comment, a Binance spokesperson, said: \"Normally, we don't share the percentage of stake in our investments. It's covered in the NDA [Non-Disclosure Agreement].\"","Founded in 2018, Tokocrypto is regulated by Indonesia’s Commodity Futures Trading Regulatory Agency (locally known as Bappebti). The exchange is also backed by Singapore-based crypto market maker QCP Capital.","Despite being licensed and having a notable backer, Tokocrypto's trading volumes are low. In the last 24 hours, Tokocrypto did <a href=\"https:\/\/www.coingecko.com\/en\/exchanges\/tokocrypto\" data-v-f87c67ca=\"\">volumes<\/a> of about $700,000, according to CoinGecko, as <a href=\"https:\/\/www.coingecko.com\/en\/exchanges\/indodax\" data-v-f87c67ca=\"\">compared to<\/a> Indonesia’s leading crypto exchange Indodax, which did over $8 million in volumes during the period.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nTokocrypto's web traffic is also very low as compared to Indodax. The former had about 6,000 visitors last month, while the latter had over 3 million visitors, according to SimilarWeb.&nbsp;","It is also worth noting that trading volumes on Tokocrypto do not manifest a similar trend as in the case of other exchanges. This means Tokocrypto could be faking volumes as crypto exchanges with legitimate trading volume tend to show a similar trend (see chart below).&nbsp;","","","<span data-v-f87c67ca=\"\">Source: CoinGecko<\/span>","Joshua Ho, co-founder of QCP Capital and an advisor of Tokocrypto, told The Block that \"a lot of trades of [Tokocrypto] are OTC [over the counter].\"","“QCP has been the primary OTC liquidity and market-making provider in Indonesia for some time now. We're excited and got started early because by 2030 Indonesia will be the largest single market in Southeast Asia which is QCP's focus,” said Ho.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nQCP Capital invested a \"six-figure\" sum in Tokocrypto in 2018 at the seed stage, Ho told The Block.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">'Enormous potential'<\/strong><\/span><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIndonesia is the fourth most populous country in the world, with over 270 million people. So there’s “enormous potential, which is what attracted Binance to the deal,” according to Ho.","Binance CEO Changpeng “CZ” Zhao echoed similar thoughts. CZ believes Indonesia will become one of the leading centers of the blockchain ecosystem in Southeast Asia given the country’s fourth-largest population, fast technology adoption, and strong economic growth.","“Our investment in Tokocrypto will allow us to explore exciting new opportunities together for the Indonesian market with a regulated local partner to further enable the freedom of money,” said CZ.","Binance appears to be targeting countries with larger populations for its expansion. Last November, Binance <a href=\"https:\/\/www.theblockcrypto.com\/post\/47852\/binance-acquires-indian-crypto-exchange-wazirx-to-serve-over-1-billion-people-of-the-country\" data-v-f87c67ca=\"\">acquired<\/a> Indian cryptocurrency exchange WazirX to serve over 1 billion people of the country.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIt remains to be seen which exchange or platform Binance invests in or acquires next. CZ recently <a href=\"https:\/\/www.theblockcrypto.com\/post\/51969\/binance-ceo-says-some-major-strategic-acquisitions-are-in-the-works-for-2020\" data-v-f87c67ca=\"\">said<\/a> some “major” strategic acquisitions are in the works for 2020. Last month, Binance <a href=\"https:\/\/www.theblockcrypto.com\/post\/60371\/binance-is-set-to-acquire-coinmarketcap-the-deal-could-be-worth-as-much-as-400-million\" data-v-f87c67ca=\"\">acquired<\/a> CoinMarketCap for an estimated $400 million.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NDA","content":"ORGANIZATION"},{"type":"last 24 hours","content":"DATE"},{"type":"Southeast Asia","content":"LOCATION"},{"type":"QCP Capital","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Indonesia","content":"LOCATION"},{"type":"SimilarWeb","content":"ORGANIZATION"},{"type":"Joshua Ho","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"$8 million","content":"MONEY"},{"type":"Commodity Futures Trading Regulatory Agency","content":"ORGANIZATION"},{"type":"Tokocrypto","content":"PERSON"},{"type":"Tokocrypto","content":"LOCATION"},{"type":"November","content":"DATE"},{"type":"Tokocrypto","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"$400 million","content":"MONEY"},{"type":"2030","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"$700,000","content":"MONEY"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BINANCE"],"authors":["Yogita Khatri","The Block"]}