{"summary":"The outspoken crypto mogul seems eager to convince the world that he does, in fact, use the HTX cryptocurrency exchange.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279423\/justin-sun-says-he-owns-1-6-billion-of-bitcoin-with-bizarre-screenshot-of-htx-wallet","publishDate":"2024-02-27T14:19:31","id":3544,"type":null,"title":"Justin Sun says he owns $1.6 billion of crypto with bizarre screenshot of HTX wallet","category":["PEOPLE"],"content":["The always outspoken Justin Sun seems eager to convince the world that he does, in fact, use the HTX cryptocurrency exchange.","On Tuesday, Sun took to X to share a screenshot of what he says is his HTX wallet, which contains value equivalent to 28,614 bitcoin, worth about $1.6 billion at current prices. Apparently, Sun posted the image in response to suggestions he did not use HTX frequently, despite serving as the company's global advisor.","\"My personal HTX account balance (just for those who are saying I'm not using HTX much),\" Sun <a href=\"https:\/\/twitter.com\/justinsuntron\/status\/1762491124692795709\" data-v-f87c67ca=\"\">posted to X<\/a>. \"<span class=\"css-1qaijid r-bcqeeo r-qvutc0 r-poiln3\" data-v-f87c67ca=\"\">Personally, I use almost all main exchanges and am a supporter of those exchanges. However, if someone says I seldom use HTX <\/span><span class=\"css-1qaijid r-bcqeeo r-qvutc0 r-poiln3\" data-v-f87c67ca=\"\">that would be inaccurate. I am a heavy user of HTX. My personal use of HTX is the same as all HTX users, believing and trading.\"<\/span>","While the idea that Sun has more than a billion dollars in crypto will likely not take by surprise the people who have followed his up-and-down career as a would-be crypto mogul, the online flex seems a curious move considering the founder of the TRON blockchain has, since at least last year, been in the crosshairs of the Securities and Exchange Commission for fraud and violations of securities law.","Last year, the <a href=\"https:\/\/www.theblock.co\/post\/226264\/sec-justin-sun\" data-v-f87c67ca=\"\">SEC alleged<\/a> that Sun orchestrated a scheme to artificially inflate trading volumes, in addition to selling unregistered securities. According to the regulator, Sun instructed employees to conduct wash trading across various cryptocurrency exchanges to artificially inflate the demand and price of the Tronix token. The agency promptly <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2023-59\" data-v-f87c67ca=\"\">asked a court<\/a> to prohibit Sun and his companies from offering securities, including digital assets.","Meanwhile Sun, who has acted as an advisor to cryptocurrency exchange Huobi, also helped the Chinese company <a href=\"https:\/\/www.theblock.co\/post\/250931\/justin-sun-hopes-htx-rebrand-will-help-exchange-keep-pace-with-rivals-global-expansion\" data-v-f87c67ca=\"\">rebrand to HTX<\/a>. With the rebranding, HTX has sought to expand into international markets and attract customers outside of China.","<em data-v-f87c67ca=\"\">Update: Corrected article and headline to show this was an overall crypto balance, instead of a bitcoin balance — as HTX shows total balances as though it were in bitcoin.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"a billion dollars","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Justin Sun","content":"PERSON"},{"type":"$1.6 billion","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"HTX","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Huobi","content":"PERSON"},{"type":"China","content":"LOCATION"}],"hashtag":["HTX","JUSTIN SUN"],"authors":["RT Watson","The Block"]}