{"summary":"The Supreme Court of India has struck down a circular issued by the Reserve Bank of India, which directed banks not to deal in crypto transactions \nIn a ruling today, the court held the circular unconstitutional\nNischal Shetty, founder and CEO of Binance-backed WazirX exchange, told The Block that “thousands of dormant accounts are getting activated at our exchange today” as a result of the ruling ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/57708\/indias-supreme-court-strikes-down-rbis-banking-ban-against-crypto","publishDate":"2020-03-04T00:57:21","id":3545,"type":null,"title":"India&#x27;s Supreme Court strikes down RBI&#x27;s banking ban against crypto","category":["Cryptocurrency"],"content":["The Supreme Court of India has struck down a circular issued by the Reserve Bank of India (RBI), which directed banks not to deal in transactions involving cryptocurrency.","In a ruling today, the higher court held the central bank's circular dated April 6, 2018, as unconstitutional. The <a href=\"https:\/\/main.sci.gov.in\/supremecourt\/2018\/19230\/19230_2018_4_1501_21151_Judgement_04-Mar-2020.pdf\" data-v-f87c67ca=\"\">180-page ruling document<\/a> states: \"writ petitions are allowed and the Circular dated 06- 04-2018 is set aside.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIn April 2018, the RBI barred banks from serving cryptocurrency exchanges and firms. The banking ban prompted several exchanges to file petitions that sought to overturn the RBI move, a process that culminated in today's court ruling.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe case - the RBI vs. Internet and Mobile Association of India (IAMAI) - was heard today by a three-judge bench comprising Justices Rohinton Fali Nariman, Aniruddha Bose and V. Ramasubramanian.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nJaideep Reddy, leader of technology law at Nishith Desai Associates, a law firm which represented IAMAI in the case, told The Block: \"In a detailed and reasoned judgment, the Supreme Court of India set aside the RBI circular restricting banks from facilitating virtual currency transactions on the ground that it was a disproportionate restriction on the petitioners’ fundamental rights.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The RBI's ban at the time&nbsp;<\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/29198\/one-of-the-largest-indian-crypto-exchanges-is-shutting-down-amidst-regulatory-uncertainty\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">forced<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\"> several Indian crypto exchanges to either shut down their businesses, move to other locations, or shift their services from fiat-to-crypto gateways to crypto-to-crypto and over-the-counter trading. Zebpay, Koinex and CoinDelta are some of the exchanges that closed their operations.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nZebpay, however, recently <a href=\"https:\/\/twitter.com\/zebpay\/status\/1234358092722098177?s=20\" data-v-f87c67ca=\"\">relaunched<\/a> in India. Commenting on the ruling, it <a href=\"https:\/\/twitter.com\/zebpay\/status\/1235081864139788289?s=20\" data-v-f87c67ca=\"\">wrote<\/a> on Twitter today: “We will not stop here. We will continue to engage with the government to bring positive regulations through legislation.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Community rejoicing&nbsp;<\/strong><\/span><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nCrypto exchange players in India are rejoicing the ruling as businesses will now be able to gain banking access.&nbsp;","Nischal Shetty, founder and CEO of Binance-backed WazirX exchange, told The Block that today is a \"historic\" day for the Indian crypto community. \"The ruling will help create jobs as more crypto and blockchain startups open up. We will also see venture firms starting to invest in India now, who previously stayed away due to the banking ban.\"","\"More traders and investors will also involve in the space,\" Shetty said, adding that WazirX has already started seeing benefits as \"thousands of dormant accounts are getting activated at our exchange today.\"","Sumit Gupta, co-founder and CEO of CoinDCX exchange, which petitioned for the case, told The Block: \"As the only petitioner still operating, we are thankful to the Supreme Court for hearing our side of the story.\" Other exchanges that petitioned included Koinex and CoinDelta, both of which shut down due to the banking ban. Throughbit also petitioned, which is not yet operating; its website reads: \"coming soon.\"","\"The uplifting of the ban by the Supreme Court is going to open new opportunities for India in terms of investments, economic growth, financial inclusion, and market maturation. We have always seen crypto as a potential to unlock India’s dream of becoming a $5 trillion economy,\" Gupta added.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBinance CEO Changpeng \"CZ\" Zhao echoed Shetty's and Gupta's views. CZ <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1235133200416075778?s=20\" data-v-f87c67ca=\"\">tweeted<\/a> that Binance is the \"only international crypto exchange to invest in India, before the ruling, and even today. But I expect more investments to go there now.\"","&nbsp;","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">UPDATE:<\/strong> This story has been updated with the ruling document and more information<\/em>"],"hashtag":[]}