{"summary":"Chainnews, one of the major Chinese crypto media outlets, is shutting down.\nMeanwhile, the domains of major crypto mining pools have almost simultaneously become inaccessible for normal China IP addresses.","author":["The Block","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/125533\/china-crypto-censorship-media-mining-pools","publishDate":"2021-11-26T04:28:57","id":3546,"type":null,"title":"China&#x27;s crypto censorship reaches over news outlets and mining pools","category":["China"],"content":["China's internet censorship machine has expanded to include crypto media outlets and mining pools in a continued attempt to minimize Chinese users' exposure to the crypto market ecosystem.","Chainnews, one of the major Chinese crypto media outlets established since 2017, is now shutting down all channels of content production and distribution.","Meanwhile, Chinese internet service providers have taken further steps to detect and block domestic miner IPs from connecting to major mining pool services, based on a China Telecom document seen by The Block.&nbsp;","These moves are signs that China is not loosening its grip over the crypto industry even if its <a href=\"https:\/\/www.theblockcrypto.com\/news+\/118930\/the-industry-response-to-chinas-latest-crypto-crackdown\" data-v-f87c67ca=\"\">most severe crackdown<\/a> efforts ever since the summer has already dampened retail interests and forced businesses and executives to either cut ties with the Chinese market or physically move overseas.","Earlier this month, the mobile apps and web domains of at least three major Chinese language crypto media outlets — Chainnews, ODaily and BlockBeats — all became inaccessible almost at the same time. Since then they have switched to their official Telegram channels to distribute newsflashes to subscribers and changed to new web domains.","Yet still, after much thought, Chainnews editor-in-chief said in his WeChat news feed on Friday that the platform is shutting down entirely and expressed his genuine gratitude toward everyone in the community that has been with it over the years. Other outlets like ODaily and BlockBeats are still operating on new web domains but their mobile apps are inactive, which has limited their readership reach on the mobile front.","This comes months after popular market information sites such as CoinMarketCap, CoinGecko and TradingView were blocked by China's Great Firewall.","According to a recent document made by China Telecom and seen by The Block, the top Chinese internet service provider has come up with a detailed solution to detect domestic miner IPs that have communicated with mining pools' URLs.","Based on its ongoing detection, it can either cut off the internet service to specific IPs or manually blacklist the URLs that mining pools use to connect with individual equipment.","As of writing, the domains of almost all the 10 biggest mining pools by real-time hash rate for both Bitcoin and Ethereum are not accessible from IPs inside China, based on The Block's verification.","Among them, F2Pool, ViaBTC, BinancePool and BTC.com have seen sharp real-time hash rate declines by around 10% for either Bitcoin or Ethereum over the past 24 hours.&nbsp;"],"hashtag":["CENSORSHIP","MINING"]}