{"summary":"Arweave, a platform for decentralized web services, is launching a new “profit-sharing token” scheme designed to help developers cash in on the ownerless applications they build\nDevelopers will be able to add a system that sends small tips whenever a user generates a transaction, and the tip money can be distributed proportionately according to ownership stakes","author":["Mike Orcutt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/68255\/arweave-says-its-new-profit-sharing-token-scheme-makes-it-possible-to-run-inverse-icos","publishDate":"2020-06-15T12:02:30","id":3548,"type":null,"title":"Arweave: new token scheme makes it possible to run &#x27;inverse&#x27; ICOs","category":["The Block"],"content":["<span data-v-f87c67ca=\"\">Arweave, a platform for decentralized web services, is launching a new token scheme designed to help developers cash in on the ownerless applications they build.<\/span>","<span data-v-f87c67ca=\"\">Based on a “blockchain-like” data structure called “the blockweave,\" the platform&nbsp;features a <\/span><a href=\"https:\/\/www.arweave.org\/yellow-paper.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">unique pay-once pricing model<\/span><\/a><span data-v-f87c67ca=\"\">, which Arweave’s creators say makes it possible to store data in a way that makes it “permanent.” <\/span>","<span data-v-f87c67ca=\"\">The project has drawn <a href=\"https:\/\/www.theblockcrypto.com\/linked\/57928\/blockchain-startup-arweave-secures-8-3m-from-andreessen-horowitz-union-square-ventures-and-coinbase-ventures\" data-v-f87c67ca=\"\">investments from Andreessen Horowitz, Union Square Ventures and Coinbase Ventures<\/a>. According to Arweave CEO Sam Williams, the “permaweb” that arises from the blockweave is already home to around 250 applications.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Now app developers will be able to add a system that sends small tips whenever a user generates a transaction — for instance when someone submits a new post to a decentralized blogging platform. The tip money can be distributed proportionally to multiple people according to their ownership stakes in a “profit-sharing token.”<\/span>","<span data-v-f87c67ca=\"\">It will also be possible for developers to sell and trade profit-sharing tokens, Williams said in an interview with The Block. <\/span>","<span data-v-f87c67ca=\"\">“This is essentially an inverse ICO model,” he said. <\/span><span data-v-f87c67ca=\"\">“With an ICO you had this idea that there was going to be a team and the investors trusted the team to build a system and launch it, and then the tokens that you bought would have value in that system somehow.”<\/span>","<span data-v-f87c67ca=\"\">With profit-sharing tokens, on the other hand: “You are buying a share of a finished business model that is already live,” said Williams. Crucially, he says, this requires putting “zero trust” in the development team since the developers do not have the power to modify the service or its business model.<\/span>","<span data-v-f87c67ca=\"\">This means investors are buying into a reliable and predictable stream of “micro-dividends issued to you every day” as well as the option to trade the token in secondary markets, Williams said.<\/span>","<span data-v-f87c67ca=\"\">Even though the developers are not able to change the service once it’s live, they are free to build a new service that honors the same profit-sharing, he said.<\/span>","<span data-v-f87c67ca=\"\">Williams sees profit-sharing tokens as “a fundamentally new way of incentivizing founders to build web services.” The incentives of today’s web have led the creators of web services to figure out how to “productize” users he said, whereas the token scheme is designed to empower users.<\/span>","<span data-v-f87c67ca=\"\">Either way, Arweave’s profit-sharing tokens scheme is also likely to draw scrutiny from regulators around the world, many of whom are still trying to determine which crypto-tokens deserve to be regulated as securities.<\/span>","<span data-v-f87c67ca=\"\">But according to William, profit-sharing tokens will be distinct in at least one clear way. In the U.S., the Securities and Exchange Commission (SEC) makes this determination based on the Howey Test, which essentially asks whether investors have a “reasonable expectation” of profits based on the efforts of others, namely the development team.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Once Arweave developers issue profit-sharing tokens, on the other hand, they can't change the service. “By necessity, there can be no dependence on the active management duties of any of the founders that created the product,” Williams said. “What the SEC chooses to do with that, in the long run, is unfortunately not something that we can predict or control.”<\/span>"],"hashtag":[]}