{"summary":"Uniswap&#x27;s wallet app is now officially available on Apple&#x27;s App Store after it was delayed for unspecified reasons.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/226208\/uniswap-wallet","publishDate":"2023-04-13T11:47:50","id":3550,"type":null,"title":"Uniswap&#x27;s iOS app launches on Apple App Store","category":["COMPANIES"],"content":["Uniswap's iOS wallet has gone live on Apple's App Store after a delay.&nbsp;","The startup behind the decentralized exchange protocol originally unveiled the app in early March, but at the time <a href=\"https:\/\/twitter.com\/Uniswap\/status\/1631691337845075968\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Uniswap said that Apple<\/a> was holding up approval. It was launched in a limited release at the time, because Uniswap said in a Twitter thread that \"Apple won't green-light our launch, and we don't know why.\"","\"We submitted our mobile app months ago—and even though we are 100% compliant with their specifications, we’re still stuck in limbo,\" Uniswap said at the time.","Now those concerns appear to have been assuaged given the <a href=\"https:\/\/apps.apple.com\/us\/app\/uniswap-wallet\/id6443944476\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">official listing on the App Store<\/a>.&nbsp;","\"The Uniswap mobile wallet is out of Apple jail and now live in most countries,\" Uniswap said in a Twitter thread today.","Features include digital asset trades, wallet activity tracking and NFT data, according to Uniswap's launch blog post.&nbsp;","\"Apple approved the wallet for use in several countries throughout the world,\" the startup said. \"We’ll continue to launch in other countries as soon as Apple lets us.\"","That Apple may be slow-rolling approval on an app like Uniswap's is perhaps unsurprising, given the technology giant's policy posture.","In October, <a href=\"https:\/\/developer.apple.com\/news\/?id=xk8d7p8c\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Apple updated<\/a> its app rules around digital assets. The company said that apps could facilitate exchange transactions \"provided they are offered only in countries or regions where the app has appropriate licensing and permissions to provide a cryptocurrency exchange.\" Apple also notably ruled that apps can sell NFTs in limited circumstances.","Apple's posture toward crypto has drawn criticism, not only from industry quarters but also from the broader tech sector. In December, Owen O'Donoghue, formerly of Facebook’s gaming unit, <a href=\"https:\/\/www.theblock.co\/post\/197297\/facebooks-ex-gaming-chief-says-apple-holding-back-crypto-gaming-for-now\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">alleged that Apple<\/a> was holding back the adoption of blockchain-centric gaming due to its app store policies.&nbsp;","“A lot of games out there today … would not comply with the App Store and they are unable to really scale,\" he said at the time.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Uniswap","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"100%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Owen O'Donoghue","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"December","content":"DATE"}],"hashtag":["UNISWAP"],"authors":["Michael McSweeney","The Block"]}