{"summary":"In the wake of Terra Luna&#x27;s collapse and bearishness compounded by the macro outlook, all eyes are on institutional investors. Once perceived to be anchoring crypto’s triumph into the TradFi ecosystem, institutions are now getting out of their positions, regardless of cost, raising the question – will they still be around after all this is over?","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/151893\/post-luna-collapse-the-institutional-gameplay","publishDate":"2022-06-14T08:47:49","id":3552,"type":null,"title":"Post-Luna Collapse: The Institutional Gameplay","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">In the wake of Terra Luna's collapse and bearishness compounded by the macro outlook, all eyes are on institutional investors. Once perceived to be anchoring crypto’s triumph into the TradFi ecosystem, institutions are now getting out of their positions, regardless of cost, raising the question – will they still be around after all this is over?<\/span>","<b data-v-f87c67ca=\"\">Sentiment-Check<\/b>","<span data-v-f87c67ca=\"\">The general sentiment errs on the side of caution as speculation continues to fester on how the collapse of UST would trigger global regulatory authorities to tighten control within the crypto sphere. However, despite the market uncertainties, some view the long-term growth outlook of the industry to be healthy as investors continue to keep an eye on DeFi.<\/span>","<span data-v-f87c67ca=\"\">“The crypto industry has its own vitality and innovation that is undeterred by any external forces or regulations...More than 100 institutions have expressed interest in using<\/span><a href=\"https:\/\/www.matrixport.com\/institutions?utm_source=theblockon&amp;utm_medium=article\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">Matrixport’s ‘DeFi connector’<\/span><\/a><span data-v-f87c67ca=\"\"> on the custody solutions-side. The problems today are only temporary hurdles and long-term participation in DeFi is unlikely to slow down”<\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> — <\/span><\/i><b data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Cynthia Wu, Founding Partner and COO, Matrixport.<\/i><\/b>","<span data-v-f87c67ca=\"\">In fact, institutions are still exploring DeFi as a field to build their long-term presence. <\/span><span data-v-f87c67ca=\"\">On 31 May, Singapore’s monetary authority announced “<\/span><a href=\"https:\/\/www.mas.gov.sg\/news\/media-releases\/2022\/mas-partners-the-industry-to-pilot-use-cases-in-digital-assets\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Project Guardian<\/span><\/a><span data-v-f87c67ca=\"\">” to explore the tokenization of financial assets and use cases of DeFi, which will be done in collaboration with DBS Bank and JP Morgan, indicating that the institutional interest in digital assets is not going away any time soon.<\/span>","<b data-v-f87c67ca=\"\">The Comeback Strategy<\/b>","<span data-v-f87c67ca=\"\">As more institutions explore exposure in DeFi, their investment strategies have also evolved with it. In Q4 of last year, hedge funds were seen to be undertaking basic market-neutral trading strategies on central exchanges in search of a stable yield. Now, with the market seeing low volatility levels and lacklustre yield across the board, institutions are deploying a significant portion of their AUM into DeFi as they look to seek alpha.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In light of this, the concerns of risks and secure infrastructure come to the forefront. Most institutions are conducting due diligence on counterparty risks and actively monitor the yields and liquidity. To facilitate this, many professional services, like<\/span><a href=\"https:\/\/www.matrixport.com\/?utm_source=theblockon&amp;utm_medium=article\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">Matrixport<\/span><\/a><span data-v-f87c67ca=\"\">, offer an additional layer of assurance with robust auditing infrastructure, on par with institutional standards — ultimately, to create a more protected environment so that more investors feel safer to deploy assets into crypto.<\/span><b data-v-f87c67ca=\"\">&nbsp;<\/b>","<b data-v-f87c67ca=\"\">The Next Score<\/b>","<span data-v-f87c67ca=\"\">Moving forward, in tandem with the growing sophistication of the institutional investor pool, more advanced yield strategies like smart contract protocols and vaults that earn yield pickup by selling options will be in the works by<\/span><a href=\"https:\/\/www.matrixport.com\/?utm_source=theblockon&amp;utm_medium=article\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">financial services providers<\/span><\/a><span data-v-f87c67ca=\"\">. These platforms will also take a chain-agnostic approach by offering services across all dominant layer1 chains.<\/span>","<span data-v-f87c67ca=\"\">Despite the gloomy outlook today, there are many opportunities and innovations in crypto and DeFi that still prove it as a worthy opponent to other traditional assets. The fact remains that institutions are eager to score access to crypto and it is up to the industry to understand their needs and be the enablers for their foray.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Matrixport <\/i><i data-v-f87c67ca=\"\">and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Matrixport","content":"LOCATION"},{"type":"Terra Luna","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"DBS Bank","content":"ORGANIZATION"},{"type":"Matrixport","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"JP Morgan","content":"ORGANIZATION"},{"type":"today","content":"DATE"},{"type":"Cynthia Wu","content":"PERSON"},{"type":"UST","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}