{"summary":"Real-time NFT marketplace and aggregator Blur is airdropping its native tokens to users who list an NFT in the next 14 days.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/178407\/nft-marketplace-blur-to-airdrop-tokens-to-users-as-it-goes-live","publishDate":"2022-10-19T15:51:45","id":3553,"type":null,"title":"NFT marketplace Blur to airdrop tokens to users as it goes live","category":["NFTS"],"content":["Non-fungible token (NFT) marketplace Blur is airdropping \"care packages\" with BLUR tokens to its users in light of its launch.","Blur will send the tokens to \"everyone who’s stuck around in the bear market\" for the past six months, according to a Twitter <a href=\"https:\/\/twitter.com\/blur_io\/status\/1582777817141370885\" data-v-f87c67ca=\"\">post<\/a>. In order to access the drop, users need to list a single NFT on Blur in the next 14 days. The tokens will then become available in January when it is officially released.","There will be a second \"much bigger\" airdrop in November for traders who list on the platform and <a href=\"https:\/\/twitter.com\/blur_io\/status\/1582777895734239238?s=20&amp;t=NizpNyV6nklcrEYlvfwMzQ\" data-v-f87c67ca=\"\">one in January<\/a> for those who have Blur points from the company's waitlist or participated in its private beta.&nbsp;","The company said that its airdrops are a way to incentivize traders to honor royalties.","\"Today, royalties are not enforceable onchain and traders already have many zero royalty options,\" Blur said in a <a href=\"https:\/\/mirror.xyz\/blurdao.eth\/2nba-2j0zHPrBX0iPSNGquZ9s_WotNH6B4e5usz85mM\" data-v-f87c67ca=\"\">post<\/a>. \"Even if royalties are not enforceable onchain, we can create an incentive structure that increases royalty revenue in the ecosystem.\"","Blur is <a href=\"https:\/\/www.theblock.co\/linked\/139617\/nft-marketplace-blur-raises-11-million-in-seed-round-led-by-paradigm\" data-v-f87c67ca=\"\">backed by crypto VC firm Paradigm<\/a> and has raised $14 million to date. The real-time NFT marketplace and aggregator has been in a private beta phase for the past four months.","<em data-v-f87c67ca=\"\">Updated for clarity regarding the token launch timing.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Today","content":"DATE"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"next 14 days","content":"DATE"},{"type":"$14 million","content":"MONEY"},{"type":"November","content":"DATE"}],"hashtag":["AIRDROP"],"authors":["Catarina Moura","The Block"]}