{"summary":"Asset tokenization startup Upvest has raised €900,000 (~$1.01 million) in new funding\nThe startup plans to further develop its prediction tool for Ethereum gas fees\nUpvest said the tool helps its clients to estimate gas fees for Ethereum transactions and optimize their costs","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/67731\/tokenization-startup-upvest-raises-1-million-to-develop-prediction-tool-for-ethereum-gas-fees","publishDate":"2020-06-09T03:00:14","id":3555,"type":null,"title":"Upvest raises $1 million to develop prediction tool for Ethereum gas fees","category":["Ethereum"],"content":["Asset tokenization startup Upvest has raised €900,000 (~$1.01 million) in new funding from the European Regional Development Fund, through the ProFIT program of Investitionsbank Berlin (IBB).","With the fresh capital in place, Germany-based Upvest plans to further develop its prediction tool for <a href=\"https:\/\/www.theblockcrypto.com\/linked\/89994\/ethereum-derivatives-sunday-open-interest\" data-v-f87c67ca=\"\">Ethereum<\/a> gas fees. Every <a href=\"https:\/\/www.theblockcrypto.com\/linked\/90605\/ethereum-futures-volume-december\" data-v-f87c67ca=\"\">Ethereum<\/a> transaction <a href=\"https:\/\/www.theblockcrypto.com\/daily\/66192\/ponzis-ethereum-gas-transaction-fees\" data-v-f87c67ca=\"\">consumes gas<\/a>, or transaction fees, which are distributed to miners executing those transactions.","Upvest says estimating <a href=\"https:\/\/www.theblockcrypto.com\/linked\/90615\/december-beat-out-november-for-highest-trading-volume-of-ethereum-options\" data-v-f87c67ca=\"\">Ethereum<\/a> gas fees for a transaction is “risky and cost-inefficient,” meaning it carries the risk of being overfunded or underfunded.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“Overfunded transactions add up in terms of cost, especially when transaction count adds up. Underfunded transactions, on the other hand, come with the risk of being dropped, so never included in mined blocks.\"","To solve this issue, Upvest has developed a transaction fee recommendation or estimation engine, in the form of API (application programming interface), using machine learning technology.","The engine collects “real-time” network signals and data, including the number of unconfirmed transactions and the number of active miners, to help clients estimate gas fees and optimize their costs.","","","Upvest said according to initial results, cost efficiency is increased by 18%, meaning transactions are confirmed faster and cheaper. The API is specifically designed for firms that are executing a large number of <a href=\"https:\/\/www.theblockcrypto.com\/linked\/92764\/ethereum-foundation-conference-devcon-august-2021-postponed\" data-v-f87c67ca=\"\">Ethereum<\/a> transactions, said the startup.&nbsp;","“Our clients are using the fee recommendation engine in the context of primary security token issuance, and for transactions in the secondary market between investors,\" said Upvest, adding: \"Since the technology is use-case agnostic, it can easily be used by exchanges as well.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIt remains to be seen how the API would be helpful when <a href=\"https:\/\/www.theblockcrypto.com\/linked\/94159\/bridge-avalanche-ethereum-defi-networks\" data-v-f87c67ca=\"\">Ethereum<\/a> <a href=\"https:\/\/www.theblockcrypto.com\/daily\/54776\/everything-you-need-to-know-about-whats-coming-for-ethereum-2-0-in-2020\" data-v-f87c67ca=\"\">moves<\/a> to a proof-of-stake model sometime in the future. Upvest told The Block that it is following the developments of the <a href=\"https:\/\/www.theblockcrypto.com\/post\/12777\/document-circulating-around-ethereum-community-calls-for-positive-non-violent-debate\" data-v-f87c67ca=\"\">Ethereum<\/a> network \"very closely\" and has already conceptualized how the machine learning model and its inputs could look like, but can only make final assumptions when <a href=\"https:\/\/www.theblockcrypto.com\/linked\/99171\/poolin-ethereum-eth-hash-rate-peth18c\" data-v-f87c67ca=\"\">Ethereum<\/a> 2.0 is actually live and would then retrain the model based on the new reality.","Today’s investment comes in addition to Upvest’s $7.8 million <a href=\"https:\/\/www.theblockcrypto.com\/post\/50262\/asset-tokenization-startup-upvest-raises-7-8m-series-a-to-bring-real-assets-on-blockchain\" data-v-f87c67ca=\"\">Series A<\/a> funding in December. The Series A was raised to help more companies tokenize financial assets such as real estate and private equity via blockchain."],"hashtag":["ETHEREUM"]}