{"summary":"The Jack Dorsey-led payments company said that for the fourth quarter of 2020, it sold $1.76 billion worth of bitcoin to clients via its Cash App.\nGross profits came in at $41 million for the quarter, per the earnings release.\nA review of a full years’ worth of data shows $4.57 billion in sales for 2020 and $97 million in gross profits for the year.","author":["Michael McSweeney","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/95882\/square-bitcoin-2020-cash-app-results","publishDate":"2021-02-23T16:17:16","id":3556,"type":null,"title":"Square reports $4.57 billion in bitcoin sales for 2020 via Cash App","category":["Bitcoin"],"content":["Square said Tuesday that it conducted $1.76 billion in bitcoin sales during the fourth quarter of 2020, with $4.57 billion sold for the entirety of last year.","Accounting for the money spent to acquire the bitcoin it sold, Square said in its report, as <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1512673\/000119312521052320\/d128971dex991.htm\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">filed with the SEC<\/a>, that it generated $97 million in gross profits during 2020 from its bitcoin sales. Square said fourth-quarter gross profits were $41 million.","\"During the full year 2020, we saw significant growth in bitcoin revenue year over year. While bitcoin revenue was $4.57 billion in 2020, up approximately 9x year over year, bitcoin gross profit was only $97 million, or approximately 2% of bitcoin revenue,\" Square said.","","","\"Bitcoin revenue and gross profit benefited from an increase in bitcoin actives and growth in customer demand, as well as a significant year-over-year increase in the market price of bitcoin,\" the firm said.","Square noted in its report that Cash App's active user ranks have swelled because of its bitcoin offering, accounting for some three million customers who purchased or sold bitcoin in 2020:","Square also said that it expanded its bitcoin holdings beyond the <a href=\"https:\/\/www.theblockcrypto.com\/post\/80175\/jack-dorsey-square-purchases-50-million-worth-of-bitcoin\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">$50 million<\/a> worth it purchased in October:","As shown in the chart above, Square's bitcoin offering has come a long way since its inception in early 2018 in terms of volume as well as public visibility. Beyond the Cash App service, Square has devoted resources to bitcoin development.","CEO Jack Dorsey has become an advocate for bitcoin in the business world, and most recently unveiled a bitcoin development fund, in partnership with hip-hop artist and producer Jay-Z, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/94732\/twitter-dorsey-500-btc-developer\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">backed by 500 BTC<\/a>.&nbsp;","Dorsey said during Tuesday's earnings call: \"We're also going to double down on our commitment to Bitcoin and continue to look for new ways to connect our product lines within the Cash App.\"","Nor is Square alone in seeking to offer consumer-facing crypto services via the traditional payments realm.","Last year, PayPal went public with its crypto offering in partnership with industry startup Paxos. PayPal has said it is investing in <a href=\"https:\/\/www.theblockcrypto.com\/post\/93668\/paypal-crypto-business\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a new unit<\/a> focused on crypto and digital currencies, with a long-horizon view to support <a href=\"https:\/\/www.theblockcrypto.com\/post\/94687\/paypal-ceo-central-bank-digital-currencies\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">central bank digital currencies<\/a> should those gain traction in the world of payments.&nbsp;","For PayPal, the benefits are particularly visible in the form of user engagement, according to one of its executives.","\"Every day we're seeing an incredibly healthy influx of first-time users. An increased engagement once they've made their first crypto purchases. Customers who have purchased crypto have been logging into PayPal at roughly twice their log-in frequency prior to actually having purchased crypto which is amazing,\" chief strategy officer Jonathan Auerbach said recently.","Payments giants Visa and Mastercard have both highlighted their growing crypto footprints as well. Earlier this month, Mastercard revealed that it would support payments made with stablecoins as part of <a href=\"https:\/\/www.theblockcrypto.com\/post\/94669\/mastercard-cfo-cryptocurrencies-stablecoins-central-banks\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a broader, three-pronged strategy<\/a> focused on cryptocurrencies, stablecoins and CBDCs.","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Editor's Note: <\/strong>This story has been updated with additional information. The headline has also been updated for clarity.<\/em>","&nbsp;"],"hashtag":["BITCOIN"]}