{"summary":"A hearing before the Senate Banking Committee on July 27 focused squarely on the subject of cryptocurrencies.","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/112680\/senators-warm-up-to-cryptos-utility-in-latest-hearing-despite-continued-potshots-at-bitcoin-mining","publishDate":"2021-07-27T14:58:57","id":3558,"type":null,"title":"Senators warm up to crypto&#x27;s utility in latest hearing, despite continued potshots at bitcoin mining","category":["Legal"],"content":["A <a href=\"https:\/\/www.banking.senate.gov\/hearings\/cryptocurrencies-what-are-they-good-for\" data-v-f87c67ca=\"\">hearing<\/a> before the Senate Banking Committee on July 27 found the committee much more up to speed on crypto than it has historically shown itself.","Despite its fairly aggressive title — “Cryptocurrencies: What are they good for?” which instinctively invites the response “absolutely nothing” — the hearing featured fairly strong concessions to real uses of the technology.","As committee chair Sen. Sherrod Brown told The Block: “The problems of crypto migrating into traditional banking systems is a concern that a lot of us have had and likely will continue to have.”","In his opening statement, Brown cast a widely critical net as the hearing began:","The committee members who wished to express skepticism over crypto’s incursions into the financial system largely bounced their questions off of Angela Walch, a law professor at St. Mary’s University. Walch warned of increasing risk as the crypto industry became more entwined in traditional finance. She envisioned a scenario in which a software bug in Ethereum “could ripple through those links to the traditional financial system.”","Senator Elizabeth Warren, who has <a href=\"https:\/\/www.theblockcrypto.com\/linked\/112654\/sen-elizabeth-warren-pushes-for-tighter-crypto-rules-in-new-letter-to-yellen\" data-v-f87c67ca=\"\">become vocally critical<\/a> of the crypto industry in recent months, was one who brought Walch’s argument to the fore.","“There is no question that our financial system needs change — big structural change — and we should be willing to consider how these new technologies can help that system,” said Warren, before asking Walch: “Has your research shown that crypto is decentralized in this way?”","Walch said that “there are absolutely pockets of power within these systems, particularly the core software developers and the huge miners,” to which Warren gave the appraisal: “that sounds to me like a lousy tradeoff.”","Despite continued skepticism towards crypto’s financial utility, particularly from the Democrats of the committee, the hearing was broadly about parsing out broader applications. In doing so, the committee members appeared to demonstrate a new level of knowledge.","“It’s very clear that members of the Senate Banking committee have become much more sophisticated in their understanding of cryptocurrency and crypto networks,” noted the Blockchain Association’s Kristin Smith.","Senator Brown, for example, noted: “Some of these underlying technologies may have useful applications, beyond evasion of banking and securities laws — those are generally applications outside of finance.” He went on to praise Filecoin as an example of such a technology.","Ranking Member Pat Toomey applauded blockchain’s role in, for example, preserving Apple Daily’s publications from censorship by the Chinese government. He also signaled approval for various roles of cryptocurrencies and stablecoins as media of exchange or stores of value.","“With cryptocurrencies, making payments and conducting transactions may become cheaper, easier, and faster for consumers than it is using traditional currencies,” he said.","This line of thinking benefited greatly from the presence of Marta Belcher, who chairs the Filecoin Foundation and who was a late-stage addition to the witness list. Filecoin’s use case — decentralizing massive data storage farms owned by traditional tech giants with a token that can clearly go where the dollar cannot in terms of programmability — was met with sympathy from both sides of the aisle.","“The vast majority of data,” said Belcher, “Sit in warehouses owned by three companies: AWS, Microsoft Azure, and Google Cloud.” Comparing cryptocurrency to the internet of the 90s, Belcher concluded “I would urge the Committee to embrace the possibility that cryptocurrency’s uses might be just as expansive.”","The third witness, CoinCenter’s Jerry Brito, was also persuasive in favor of decentralized economies based on crypto. Nowhere was that clearer than the mining dispute.","The environmental impact of proof-of-work mining, especially of the Bitcoin network, has <a href=\"https:\/\/www.theblockcrypto.com\/post\/108494\/cbdc-central-banks-hearings-congress-june\" data-v-f87c67ca=\"\">figured heavily in recent hearings<\/a> on crypto. On Tuesday, Walch leaned heavily into criticism of miners for the power to arrange transactions in decentralized finance, which seemed to catch many on the committee off-guard.","“Miners cannot redirect, steal or initiate user payments. They can however affect the order in which a payment enters the block,” explained Brito. “This is not a problem in the general case of a person sending money to another person. It can be a problem on decentralized exchanges running on, for example, Ethereum, where decentralized finance traders position their orders first. The same problem happens with traditional finance.”","But as to what will come out of this hearing, there seemed to be no near-term legislative conclusions, despite efforts by, especially, Senator Warren to push the subject forward with regulators.","“I don’t sense that there’s an immediate plan for action or immediate legislation,” observed Smith."],"hashtag":[]}