{"summary":"The total loss of the Alphapo hack, including funds on the Tron and Bitcoin networks, now stands at $60 million.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241266\/alphapos-hack-now-estimated-at-60-million-zachxbt","publishDate":"2023-07-25T05:50:28","id":356,"type":null,"title":"Alphapo’s hack now estimated at $60 million: ZachXBT","category":["CRYPTO ECOSYSTEMS"],"content":["The recent hack involving crypto payments processor Alphapo’s hot wallets is now estimated to have resulted in a loss of $60 million, as per the latest findings.","This updated figure comes after on-chain analyst ZachXBT identified an additional $37 million in stolen assets on both the Tron and Bitcoin networks — raising the initial estimate from <a href=\"https:\/\/www.theblock.co\/post\/241048\/alphapo-hot-wallets-drained-for-23-million-hypedrop-disables-withdrawals\" data-v-f87c67ca=\"\">$23 million<\/a> to $60 million. This total also includes losses suffered by Coinspaid, which is an entity associated with Alphapo.","As a crypto payments processor, Alphapo managed transactions for online gambling platforms such as HypeDrop, Bovada, and Ignition. Given that hot wallets are online and constantly connected to the internet, they face a higher risk of cyberattacks compared to their offline counterparts: cold wallets.","In this instance, the hackers appear to have swapped the stolen funds on Ethereum for ETH and then transferred them to other blockchains, including Avalanche, Tron, and Bitcoin. The funds on Bitcoin were deposited into the crypto mixer service Sinbad, as informed by ZachXBT to The Block.","The distinctive on-chain patterns associated with this breach, according to ZachXBT, align closely with operations previously linked to the Lazarus, a North Korean hacking group. Lazarus has been implicated in several high-profile hacks, including the Ronin bridge breach which resulted in a loss of <a href=\"https:\/\/www.theblock.co\/post\/139761\/axie-infinitys-ethereum-sidechain-ronin-hit-by-600-million-exploit\" data-v-f87c67ca=\"\">over $600 million<\/a> last year.","\"This hack appears to likely have been done by Lazarus as they create a very distinct fingerprint on-chain,\" ZachXBT <a href=\"https:\/\/twitter.com\/zachxbt\/status\/1683747073227624448\" data-v-f87c67ca=\"\">highlighted<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lazarus","content":"PERSON"},{"type":"Tron","content":"ORGANIZATION"},{"type":"$60 million","content":"MONEY"},{"type":"$23 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$37 million","content":"MONEY"},{"type":"$600 million","content":"MONEY"},{"type":"Bovada","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Alphapo","content":"PERSON"}],"hashtag":["EXPLOITS","HACKS"],"authors":["Vishal Chawla","The Block"]}