{"summary":"Twenty-two blockchain projects, including Solana and Matic Network, have submitted their Ethereum scaling proposals to Reddit for its token project.\nAnatoly Yakovenko, founder and CEO of the Solana Foundation, recently told The Block that Solana completed the entire 5-day Reddit challenge in around 5 minutes for less than $5.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/73885\/22-blockchain-projects-ethereum-scaling-proposals-reddit","publishDate":"2020-08-04T06:45:11","id":3560,"type":null,"title":"22 blockchain projects submitted their Ethereum scaling proposals to Reddit","category":["Ethereum"],"content":["Twenty-two blockchain projects, including Solana and Matic Network, have submitted their <a href=\"https:\/\/www.theblockcrypto.com\/linked\/78613\/purestake-raises-1-4-million-ethereum-compatible-network-polkadot\" data-v-f87c67ca=\"\">Ethereum<\/a> scaling proposals to Reddit for its token project.","Evan Van Ness, a former member of <a href=\"https:\/\/www.theblockcrypto.com\/linked\/80317\/ethereum-2-bug-bounty\" data-v-f87c67ca=\"\">Ethereum<\/a> development studio ConsenSys, <a href=\"https:\/\/www.reddit.com\/r\/ethereum\/comments\/hbjx25\/the_great_reddit_scaling_bakeoff\/\" data-v-f87c67ca=\"\">revealed<\/a> the projects in an updated Reddit thread on Monday. These projects are: StarkWare, Dragonchain, Matic Network, Solana, Everest, xDai and Splunk, OMG Network, NEAR, Fuel Labs, Raiden, Connext, Arbitrum, Aztec, MatterLabs, Abridged and Kchannels, SKALE, Syscoin, Meter, Dapp Solutions, Hubble Project, Minter and Celer.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nA Reddit spokesperson confirmed to The Block that only these 22 projects had submitted their proposals. Blockchain projects and developers had until July 31 to submit their proposals.","Last month, Reddit <a href=\"https:\/\/www.theblockcrypto.com\/linked\/68880\/reddit-invites-developers-to-submit-ethereum-scaling-proposals-for-its-token-project\" data-v-f87c67ca=\"\">partnered<\/a> with the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/7894\/core-ethereum-devs-push-constantinople-upgrade-out-6-weeks-progpow-decision-put-on-hold\" data-v-f87c67ca=\"\">Ethereum<\/a> Foundation and invited blockchain developers to submit their <a href=\"https:\/\/www.theblockcrypto.com\/linked\/79261\/ethereum-2-another-testnet-zinken\" data-v-f87c67ca=\"\">Ethereum<\/a> scaling solutions that will support its new initiative to distribute ERC-20 tokens to users.","Reddit has been beta testing two ERC-20 tokens — MOON and BRICK — that will be issued to members of subreddits r\/Cryptocurrency and r\/FortniteBR, respectively. However, as <a href=\"https:\/\/www.theblockcrypto.com\/linked\/80066\/ethereum-hashrate-new-all-time-high-defi-growth\" data-v-f87c67ca=\"\">Ethereum's<\/a> current throughput (the number of transactions that it can process per second) is currently limited to 10 to 20 transactions per second, and it suffers from fee spikes and network congestion, Reddit invited proposals for solutions that are faster and cheaper.&nbsp;","Anatoly Yakovenko, president of the Solana Foundation, recently told The Block that Solana <a href=\"https:\/\/www.reddit.com\/r\/ethereum\/comments\/i09ftz\/solana_reddits_5day_scaling_challenge_in_5\/?utm_source=share&amp;utm_medium=web2x\" data-v-f87c67ca=\"\">completed<\/a> the entire 5-day Reddit challenge in around 5 minutes for less than $5. Solana is a layer 1, proof-of-stake (PoS) blockchain network.&nbsp;","Giving the details, Yakovenko said Reddit token minting was done under 2 seconds across 64 threads; 204,800 token transfers and point claims were completed in 3 minutes and 20 seconds, and Solana burned 75,520 tokens in 46 seconds.","“All while running on Solana’s mainnet across 130 geographically-distributed validators,” said Yakovenko.","Ultimately, Reddit is looking for a solution that will support “hundreds of thousands of Community Points users on mainnet today, and can eventually scale to all of Reddit (430 million monthly users).”","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Update: This story has been updated to include comments from a Reddit spokesperson.&nbsp;<\/em><\/span>"],"hashtag":["ETHEREUM","SOLANA"]}