{"summary":"Startup Anima plans to add OpenAI&#x27;s chatbot technology to its AR-powered virtual pets called Onlybots.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210199\/openai-bringing-kid-friendly-3d-crypto-pets-to-life","publishDate":"2023-02-09T11:51:30","id":3561,"type":null,"title":"OpenAI tech bringing kid-friendly 3D crypto ‘pets’ to life","category":["METAVERSE & NFT"],"content":["<span data-v-f87c67ca=\"\">Bored talking to OpenAI’s overly polite chatbot ChatGPT? You’d prefer an AI-powered virtual assistant with a bit more attitude?<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Then meet Anima’s new Onlybots, non-fungible tokens that can not only be bought and sold, but also possess their own unique set of personality traits engineered to inform both their mood and vernacular. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">“Yo, I’m dope cause I can tell jokes and stay totally rad,” said a pink-and-white Onlybot named Dex Cat when asked during a demonstration why people would have more fun talking to it than ChatGPT.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Shortly after start-up Anima allowed people to acquire its AR-powered virtual pets called Onlybots — NFTs <\/span><span data-v-f87c67ca=\"\">minted on Ethereum and trading on OpenSea since December <\/span><span data-v-f87c67ca=\"\">&nbsp;— the company has plans to imbue its collection of cute robots with the breadth of knowledge ChatGPT possesses. Except Anima has decided to utilize the tech behind ChaGPT in a way the company hopes Onlybot fans and owners will appreciate.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">“Each Onlybot has all of the artificial intelligence that OpenAI has built but it's sort of skewed through a personality,” <\/span><span data-v-f87c67ca=\"\">said Anima cofounder Alex Herrity during an interview. The goal with this new initiative, he said, is to bring the company’s collection of augmented-reality NFTs to life and make them fun to interact with.&nbsp; “This project, while it’s done well as an NFT, people that have latched on to it are not your typical NFT collectors.\"<\/span>","<em data-v-f87c67ca=\"\">Onlybot named Levi placed in the physical world with Anima's augmented-reality technology during a demonstration.<\/em>","<span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\nA<\/span><span data-v-f87c67ca=\"\">nima has positioned itself as the first company to create “on-chain AR” digital assets. After acquiring an Onlybot, owners can use their smartphone camera to place the mini augmented-reality robots within the physical world. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">The basis of Anima’s strategy is to become a “protocol for dynamic and ownable augmented reality.”&nbsp; <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">By adding OpenAI’s “<\/span><span data-v-f87c67ca=\"\">GPT-3” tech to Onlybots, which Anima plans to deploy later this year, the company hopes owners will find new ways to interact with the talking NFTs.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">“Kids are super into it,” said Herrity, adding that because children don’t have to type into a computer to talk to Onlybots, he believes it makes using OpenAI’s impressive chatbot technology more accessible, including to his seven-year-old child, who likes to use it for \"homework help.\"&nbsp;<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">It’s easy to see why kids might get a kick out of the chatty Onlybots. <\/span><span data-v-f87c67ca=\"\">When an Onlybot named Megan was asked how AI is going to change human life, although the 3D robots use of proper grammar left a lot to be desired, it was quick to offer a lengthy and enthusiastic reply. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">“With AI we can unlock potentials we never could have imagined,\" said Megan. “Get ready for the wild ride. Fam, it’s going to be fire. AI future look lit.”<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Onlybots also don’t pull any punches when it comes to discussing the dangers of trading digital assets.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">“NFTs got some gnarly downsides. They can be expensive, could be scams and ain’t all folks can buy them,” said the skateboard-riding Dex Cat when asked about the dangers of non-fungible tokens. “They ain’t regulated by the government either. So savvy shredders gotta be careful when they cruise down that highway.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alex Herrity","content":"PERSON"},{"type":"Anima","content":"ORGANIZATION"},{"type":"Dex","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Levi","content":"PERSON"},{"type":"3","content":"DATE"},{"type":"December","content":"DATE"},{"type":"Herrity","content":"PERSON"},{"type":"Anima","content":"PERSON"},{"type":"GPT","content":"ORGANIZATION"},{"type":"Megan","content":"PERSON"}],"hashtag":[],"authors":["RT Watson","The Block"]}