{"summary":"The Securities and Exchange Commission&#x27;s division of corporate finance will create a new office focused around filings of crypto firms.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168695\/sec-to-form-a-new-office-for-crypto-disclosures","publishDate":"2022-09-08T15:59:51","id":3562,"type":null,"title":"SEC to form a new office for crypto disclosures","category":["POLICY"],"content":["The Securities and Exchange Commission will establish a new office for cryptocurrency filings.","The office will be within the Division of Corporation Finance, which handles disclosures for publicly traded firms, said Cicely LaMothe, the associate director for disclosure operations within that division.","LaMothe told the audience at a legal conference in Washington on Thursday that the SEC saw the new office as necessary to address “unique and evolving” filings around crypto assets, the <a href=\"https:\/\/www.theblock.co\/post\/168600\/gensler-sec-has-been-clear-on-cryptocurrencies\" data-v-f87c67ca=\"\">vast majority of which the SEC views as securities<\/a>. Much of the crypto industry has pushed back against the definition or otherwise avoided registering new coins as securities, often resulting in enforcement actions or ongoing litigation.","According to LaMothe, the SEC still needs someone to run the office, which is expected to have legal and accounting branches for crypto firms to consult and file with.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cicely LaMothe","content":"PERSON"},{"type":"Washington","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Division of Corporation Finance","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"LaMothe","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["SEC"],"authors":["Kollen Post","The Block"]}