{"summary":"Ripple has partnered with Nasdaq-listed remittance firm International Money Express (Intermex)\nIntermex will utilize Ripple’s On-Demand Liquidity solution that leverages XRP to settle cross-border payments","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/54987\/ripple-inks-new-deal-with-remittance-firm-intermex-which-will-utilize-its-xrp-payments-solution","publishDate":"2020-02-05T03:25:38","id":3563,"type":null,"title":"Ripple inks new deal with remittance firm Intermex, which will utilize its XRP payments solution","category":["Ripple"],"content":["Ripple has announced a new partnership with the Nasdaq-listed remittance firm International Money Express (Intermex).","Intermex will utilize Ripple’s On-Demand Liquidity (ODL) solution, which leverages XRP to settle cross-border payments, the two <a href=\"https:\/\/ripple.com\/insights\/enabling-faster-cross-border-payments-between-the-us-and-mexico\/\" data-v-f87c67ca=\"\">companies<\/a> <a href=\"https:\/\/investors.intermexonline.com\/news-releases\/news-release-details\/international-money-express-inc-announces-partnership-ripple\" data-v-f87c67ca=\"\">announced<\/a> Tuesday. ODL is part of RippleNet.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"We are pleased to have begun the partnership with the Ripple team, and look forward to implementing new solutions on RippleNet and ODL to help drive growth and deliver greater efficiency,\" said Bob Lisy, CEO of Intermex.","The remittance firm believes that XRP is “the most efficient digital asset for settlement with transaction fees at just fractions of a penny.\"","Founded in 1994, Intermex is primarily focused on the Latin American-Caribbean corridor and will utilize ODL for remittances between the U.S. and Mexico.","\"Intermex is one of the largest U.S. to Mexico remitter service providers in the world—processing more than 30 million payment transactions a year through a network of 100,000 payer locations,\" said Ripple.","The ODL solution for the U.S.-Mexico corridor is also being used by Ripple’s other partner MoneyGram. Alex Holmes, chairman and CEO of MoneyGram recently <a href=\"https:\/\/www.theblockcrypto.com\/linked\/46431\/moneygram-processes-10-of-us-mexico-transactions-via-ripple-solution-that-uses-xrp\" data-v-f87c67ca=\"\">said<\/a> that the firm processes 10% of its transactions between the corridor via ODL.","Launched in October 2018, ODL currently supports Mexico, the Philippines, and Australia markets. Support for Brazil is “coming soon,” as well as <a href=\"https:\/\/www.theblockcrypto.com\/linked\/46219\/ripple-says-more-than-two-dozen-customers-use-its-payments-solution-that-leverages-xrp\" data-v-f87c67ca=\"\">additional corridors<\/a> across Asia-Pacific (APAC), Europe, Middle-East and Africa (EMEA) and Latin America (LatAm) are in progress for this year, Ripple said."],"hashtag":["XRP"]}