{"summary":"Bitwise has begun the process of getting its crypto index fund listed on OTC Markets (OTCQX) to let retail investors access the fund in their brokerage accounts\nBitwise continues to work on its bitcoin ETF product and plans to refile the proposal in the future.","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/60187\/bitwise-asset-management-is-seeking-to-list-its-crypto-index-fund-on-otc-markets","publishDate":"2020-03-27T17:15:10","id":3564,"type":null,"title":"Bitwise seeking to list its crypto index fund on OTC Markets","category":["Markets"],"content":["<span data-v-f87c67ca=\"\">Bitwise Asset Management is working toward getting its crypto index fund listed on OTC Markets (OTCQX).<\/span>","<span data-v-f87c67ca=\"\">On Friday, the firm notified investors that it has started the process of listing shares of the Bitwise 10 Index Fund on OTCQX under the SEC-regulated Alternative Reporting Standards.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Bitwise CEO Hunter Horsley, the firm will soon file a Form 211 with the Financial Industry Regulatory Authority (FINRA) and expects the approval to come in the second half of 2020. After that, investors can start trading shares of the index fund on popular platforms like Charles Schwab or TD Ameritrade.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"It'll be the first index product publicly tradable through brokerage accounts,\" Horsley told The Block. \"That adds a lot of simplicity for investors to not have to go outside of their traditional toolset.\"<\/span>","<span data-v-f87c67ca=\"\">\"It also opens up a second market in which any investor can trade the shares,\" he continued. \"We're working with OTC Markets to facilitate that second market and then shareholders of the fund can trade with the investing public. And non-accredited investors can also have access to shares.\"<\/span>","<span data-v-f87c67ca=\"\">The Bitwise 10 Index Fund currently includes bitcoin, ethereum, XRP, bitcoin cash, litecoin, EOS, tezos, stellar lumens, ADA and ethereum classic, which, according to Horsley, collectively account for 85% of the market per market cap. <\/span>","Notably, Grayscale Investments in Oct. 2019 received regulatory approval to list its own crypto index fund, <a href=\"https:\/\/www.otcmarkets.com\/stock\/GDLCF\/overview\" data-v-f87c67ca=\"\">Digital Large Cap Fund,<\/a> on OTCQX.&nbsp;","<b data-v-f87c67ca=\"\">Bitwise continues to work on its Bitcoin ETF proposal<\/b>","<span data-v-f87c67ca=\"\">Bitwise <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/53058\/bitwise-withdraws-bitcoin-etf-proposal\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">withdrew<\/span><\/a><span data-v-f87c67ca=\"\"> its bitcoin ETF proposal this past January after first filing for approval early 2019. Other firms also experienced difficulties in trying to build their own bitcoin ETF products. <\/span>","<span data-v-f87c67ca=\"\">Cboe BZX Exchange, for example, <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/40020\/vaneck-solidx-withdraws-bitcoin-etf-proposal\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">pulled back<\/span><\/a><span data-v-f87c67ca=\"\"> its VanEck\/SolidX bitcoin ETF proposal after the SEC repeatedly postponed the decision deadline. Most recently, the SEC rejected a proposal for the United States Bitcoin and Treasury Investment Trust from New York-based firm Wilshire Phoenix. That rejection drew a dissenting statement from commissioner Hester Peirce, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/57111\/sec-commissioner-hester-peirce-files-dissent-to-agencys-rejection-of-bitcoin-etf-proposal\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">who said the move<\/a> \"is the latest in a long string of disapproval orders that the Commission has issued regarding bitcoin-related products.\"<\/span>","<span data-v-f87c67ca=\"\">In a recent <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/58020\/dissecting-the-failed-bitcoin-etfs-and-mild-soupy-with-bitwise-coo-teddy-fusaro\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">episode<\/span><\/a><span data-v-f87c67ca=\"\"> of The Scoop, Bitwise COO Teddy Fusaro <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/58321\/bitwise-exec-bitcoin-etfs-would-offer-investors-advisors-a-new-way-to-gain-crypto-exposure\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">told<\/span><\/a><span data-v-f87c67ca=\"\"> The Block that the firm has not given up on its effort and plan to refile the proposal in the future since there is a real demand for accessing bitcoin products in a brokerage account.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Horsley confirmed that Bitwise continues to work toward a bitcoin ETF launch and hopes to list the product alongside the Bitwise 10 Index Fund as another option for investors.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"We've been working on it throughout the beginning of the year,\" he said. \"And we're committed to working with the SEC on getting to a place where they're comfortable approving a bitcoin ETF.\"<\/span>"],"hashtag":[]}