{"summary":"City Comptroller candidate Reshma Patel unveiled crypto-specific aspects to her platform, including investing pension funds in crypto.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/102122\/candidate-nyc-comptroller-crypto-blockchain","publishDate":"2021-04-19T10:38:31","id":3564,"type":null,"title":"A candidate for NYC Comptroller has a crypto-specific platform","category":["PEOPLE"],"content":["City Comptroller candidate Reshma Patel unveiled crypto-specific aspects to her platform today, including a call for allocating a portion of the city's pension funds to crypto.","The City Comptroller's office may be under extra pressure this year to aid the financial recovery of the COVID-19 pandemic. In an interview with The Block, Patel said she decided to run this January because she's concerned about the long-term financial health of the city.","\"I want to make sure that we're steered in the right direction as we come out of the economic fallout from the COVID-19 pandemic,\" she said. \"I start thinking about new ways we could do stuff, and one of those is we need more transparency and efficiency in our city government.\"","The comptroller oversees how the city allocates its money, specifically by managing government contracts for projects and investing the city's retirement funds. If Patel is elected, crypto and blockchain would have a role in the current recovery and future planning, with one to three percent of each of the city's five retirement funds will be invested in cryptocurrency, per the candidate's plan.","\"Fears of inflation today, and through the future, are valid, and that is why some of the world’s most forward-thinking companies, like Tesla and Square, have invested a portion of their total cash reserve in bitcoin,\" Patel's plan states. \"It is clear that cryptocurrencies have a future in finance and should have a future in the financial planning of New York City.\"","She also plans to make investments in \"blockchain-specific\" funds. She plans to convene a task force to examine how the city can more directly invest in blockchain tech. This would serve a dual purpose according to Patel's platform: \"capture enhanced returns and support New York City-based fintech start-ups while learning more about how this cutting-edge technology can help New York City residents.\"&nbsp;","That's why in addition to allocating some funds to crypto, Patel also wants to use blockchain in the procurement system — the way the office awards and pays out government contracts for city projects.","Right now, Patel says the comptroller's office has a 30-day deadline to settle on a contract, but other supporting agencies don't have the same time restrictions. This can lead to a situation where the office doesn't receive the necessary funds to execute a project for long swaths of time, which could force it to take out a loan to pay those providing services.","\"Especially in a year like last year where we couldn't do fundraisers and we had fewer funds, it was even harder situation for us to have to wait for the contract to be processed,\" she said.","Using blockchain, she said, could create the transparency and speed needed for multi-agency collaboration. Patel said she's seen these pain points first hand since working as a financial advisor to issuers of municipal bonds, meaning she spent ample time in the comptroller's office, even training new staff there. The current system hurts the city, but it also limits a lot of small firms from doing business with the city since they can't always afford to wait to begin work.","Patel sees this as a way to directly support start-ups, but she said she's also looking at indirect ways. Though the comptroller's main purview is investing the pension funds, it's still a city office with influence. Patel said she plans to use that influence to make New York City a more attractive location for crypto start-ups. In her conversations with fledgling crypto firms, she said a continuous point of conversation became advocating for a second look at the BitLicense framework even though the work of the comptroller's office is separate from the regulatory environment.","Current city comptroller Scott Stringer finishes his term this year and has been using the past few months to drum up support as a candidate for Mayor of the City of New York. Among his competitors are the crypto-friendly former presidential candidate Andrew Yang, who has said he would make the city a \"<a href=\"https:\/\/www.theblockcrypto.com\/linked\/94710\/andrew-yang-says-hed-make-new-york-city-a-hub-for-bitcoin-if-elected-mayor\" data-v-f87c67ca=\"\">hub for crypto\"<\/a> if elected. Yang has yet to outline a specific crypto agenda for the City.","Primaries for mayor and comptroller will take place on June 22.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York City","content":"LOCATION"},{"type":"Reshma Patel","content":"PERSON"},{"type":"19","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Patel","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Tesla","content":"LOCATION"},{"type":"City","content":"LOCATION"},{"type":"three percent","content":"PERCENT"},{"type":"Scott Stringer","content":"PERSON"},{"type":"Andrew Yang","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"last year","content":"DATE"},{"type":"June 22","content":"DATE"},{"type":"ups","content":"ORGANIZATION"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}