{"summary":"Canadian mining farm Hut 8’s CEO is stepping down \nHut 8 also entered into an agreement with Bitfury to pay back the $4.75 million debt and receive a reduction in annual fees paid to Bitfury\nOther mining farms, including Argo Blockchain, Bitfarms, Bitmain, have also reshuffled their management teams or renegotiated partnership agreement","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/54216\/publicly-traded-bitcoin-miner-hut-8-announces-pending-ceo-departure-reworked-deal-with-hardware-maker-bitfury","publishDate":"2020-01-28T15:32:46","id":3567,"type":null,"title":"Publicly traded bitcoin miner Hut 8 announces pending CEO departure, reworked deal with hardware maker Bitfury","category":["Mining"],"content":["Hut 8, one of the few publicly-listed bitcoin mining companies, announced Tuesday that its CEO Andrew Kiguel is stepping down.","The development was announced alongside the disclosure of an amended agreement with mining hardware firm Bitfury.&nbsp;In a Tuesday <a href=\"https:\/\/hut8mining.com\/hut-8-announces-leadership-transition-and-amendment-of-key-agreements-with-bitfury\" data-v-f87c67ca=\"\">blog post<\/a>, the Toronto-based mining firm said it will begin the search for a successor to replace Kiguel soon, who led the company to generate over $115 million in revenue amidst a fall in the price of bitcoin during 2018.&nbsp;&nbsp;","Additionally, Hut 8 also negotiated itself a deal with Bitfury to reduce operating costs and provide \"more autonomy to Hut 8 in managing its Canadian operations,\" stated the post.&nbsp;","\"The autonomy for Hut 8 will come from being able to price out alternative hardware... Previously, we had to purchase only from Bitfury, so we had less control over pricing and chips.&nbsp; Now, Hut 8 can seek out the best and lowest cost products on the market,\" a Hut 8 spokesperson told The Block.&nbsp;","The new deal will allow Hut 8 to reduce its annual fees paid to Bitfury by up to $2 million. As a tradeoff, Hut 8 will lose its exclusive access to Bitfury's equipment in North America. The mining farm has also agreed to repay Bitfury the $4.75 million debt soon, refinanced by a $5 million bitcoin-collateralized credit issued by Genesis Global Capital.&nbsp;","As previously <a href=\"https:\/\/www.theblockresearch.com\/hut-8-mining-3q19-review-core-operations-come-out-ahead-but-face-significant-headwinds-49504\" data-v-f87c67ca=\"\">reported<\/a> by The Block, in Q3 2019, Hut 8 mined 30% less bitcoin than the previous quarter, with its revenue declining by 5% during that period.","\"The Company believes that although the halving would reduce the block reward by 50%, other market factors such as the network difficulty rate and price of bitcoin would change to offset the impact of the halving sufficiently for the Company to maintain profitability. Nevertheless, there is a risk that a halving will render the Company unprofitable and unable to continue as a going concern,\" Hut 8 stated in its 3Q19 management discussion and analysis.&nbsp;","Other mining farms have also undergone similar management reshuffles in recent months.","In early January, London-based Argo Blockchain's CEO, along with one of the non-executive directors, <a href=\"https:\/\/iclg.com\/ibr\/articles\/10624-argo-blockchain-appoints-new-ceo\" data-v-f87c67ca=\"\">stepped<\/a> down. Around the same time, Bitmain <a href=\"https:\/\/www.theblockcrypto.com\/post\/52163\/bitmain-cancels-operation-partnership-for-its-texas-mining-farm\" data-v-f87c67ca=\"\">canceled<\/a> its operation partnership with DMG Blockchain for its Rockdale, Texas-based mining farm.","In October last year, Bitfarms <a href=\"https:\/\/www.businesswire.com\/news\/home\/20191003005895\/en\/Bitfarms-Corporate-Update\" data-v-f87c67ca=\"\">announced<\/a> the resignation of one of the company's founders. A Canadian business news site <a href=\"https:\/\/business.financialpost.com\/pmn\/business-pmn\/bitfarms-still-betting-on-quebec-despite-growing-pains-in-cryptocurrency-field\" data-v-f87c67ca=\"\">reported<\/a> that three additional managers and other lower-level staffers departed Bitfarms during that time.&nbsp;"],"hashtag":[]}