{"summary":"DBS, Singapore’s biggest bank, is launching a fiat-to-cryptocurrency exchange, The Block has learned.\nDubbed “DBS Digital Exchange,” the trading platform would allow users to trade in four crypto assets: BTC, BCH, ETH and XRP.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/82411\/singapore-biggest-bank-dbs-crypto-exchange","publishDate":"2020-10-27T05:40:06","id":357,"type":null,"title":"Singapore&#x27;s biggest bank DBS is launching a crypto exchange","category":["Exchanges"],"content":["DBS, Singapore's biggest bank, is launching a fiat-to-cryptocurrency exchange, The Block has learned.","Dubbed \"DBS Digital Exchange,\" the trading platform would allow users to trade in four crypto assets — bitcoin (BTC), bitcoin cash (BCH), ether (ETH), and XRP — against Singapore dollar (SGD), Hong Kong dollar (HKD), Japanese yen (JPY) and U.S. dollar (USD).&nbsp;","The exchange would also conduct security token offerings (STOs) \"in due course\" to help small and medium-sized firms raise funds, according to <a href=\"https:\/\/www.dbs.com.sg\/corporate\/solutions\/capital-markets\/dbs-digital-exchange\" data-v-f87c67ca=\"\">a now-deleted webpage<\/a>, but The Block can still access the <a href=\"https:\/\/webcache.googleusercontent.com\/search?q=cache:3Nkp5f0WSjsJ:https:\/\/www.dbs.com.sg\/corporate\/solutions\/capital-markets\/dbs-digital-exchange+&amp;cd=1&amp;hl=en&amp;ct=clnk&amp;gl=cz\" data-v-f87c67ca=\"\">cached version<\/a> of it.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"Digital assets are poised to be the future of tomorrow’s digital economy,\" the cached webpage reads. \"With DBS Digital Exchange, a bank-backed digital exchange, companies and investors can now leverage an integrated ecosystem of solutions to tap the vast potential of private markets and digital currencies.\"","","","As for custody of customers' funds, DBS Digital Exchange will utilize the services of its parent DBS Bank. The bank has \"deployed DBS Digital Custody, an institutional-grade custody solution specially tailored for safekeeping digital assets,\" per the webpage.","After the publication of this report, a spokesperson for DBS told The Block: \"DBS’ plans for a digital exchange are still work in process, and have not received regulatory approvals. Until such time as approvals are in place, no further announcements will be made.\"","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">No weekends trading&nbsp;<\/strong><\/span>","According to an FAQ section of the webpage, DBS Digital Exchange would be available to institutional investors directly, including financial institutions and professional market makers. Retail investors, on the other hand, would have to access the platform via a DBS member, such as DBS Vickers Securities (Singapore) and DBS Private Bank.","Unlike other crypto exchanges in the market today, DBS Digital Exchange won't allow trading on weekends, according to the webpage. And on weekdays, it would limit trading hours, from 9 am to 4 pm, similar to stock exchanges.","DBS Digital Exchange is regulated by the Monetary Authority of Singapore, per the webpage. Its official launch date remains unknown. The Block has reached out to DBS for comments and will update this story should we hear back.","The development appears to suggest that crypto is going mainstream across regions. Last week, U.S.-based payments giant PayPal <a href=\"https:\/\/www.theblockcrypto.com\/post\/81794\/paypal-to-enable-crypto-purchases-with-the-help-of-paxos\" data-v-f87c67ca=\"\">said<\/a> it would allow its 350 million users to trade cryptocurrencies, in partnership with industry startup Paxos."],"hashtag":[]}