{"summary":"Jens Weidmann, President of Germany’s central bank and a policymaker with the European Central Bank (ECB), has called on banks to come up with a cheaper","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/51963\/ecb-official-urges-european-banks-to-counter-facebooks-libra-with-a-cheaper-payment-solution","publishDate":"2020-01-03T04:50:31","id":357,"type":null,"title":"ECB official urges European banks to counter Facebook’s Libra with a cheaper payment solution","category":["FACEBOOK"],"content":["Jens Weidmann, President of Germany’s central bank and a policymaker with the European Central Bank (ECB), has called on banks to come up with a cheaper and faster payment solution to counter <a href=\"https:\/\/www.theblockcrypto.com\/linked\/17641\/facebooks-blockchain-team-is-fast-growing-and-now-it-needs-marketers-to-push-its-future-products\" data-v-f87c67ca=\"\">Facebook-led<\/a> proposed stablecoin Libra.","“I don't believe in always calling for the state right away” to come up with solutions, Weidmann said in an <a href=\"https:\/\/www.handelsblatt.com\/finanzen\/geldpolitik\/geldpolitik-bundesbank-praesident-weidmann-warnt-vor-einfuehrung-eines-digitalen-euros\/25362418.html?nlayer=Newsticker_1985586\" data-v-f87c67ca=\"\">interview<\/a> with German newspaper Handelsblatt published Thursday. “In a market economy, it is first up to companies to develop a corresponding offer for customer requests.”","In other words, Weidmann is not in favor of a central bank digital currency (CBDC) yet. He believes that it is necessary to first define the pros and cons of a CBDC. “Then it can be decided whether it is needed and the risks can be controlled,” he said in the interview.","ECB President Christine Lagarde, however, recently <a href=\"https:\/\/www.theblockcrypto.com\/linked\/50397\/european-central-bank-hopes-to-get-ahead-of-the-curve-on-stablecoins\" data-v-f87c67ca=\"\">said<\/a> that the central bank should get \"ahead of the curve\" on stablecoins. The ECB also plans to establish clear objectives for its digital currency task force by mid-2020, Lagarde said at the time.","China and Sweden are also set to launch their national digital currencies soon. Weidmann, however, is not keen on the idea of digital currency. He told Handelsblatt that China \"may be faster, but it also has a different political system,” adding: “The state has a wealth of power there that many of us would not like. I believe that a social market economy will ultimately find better solutions in a free society.”","Yet, Germany’s central bank is itself experimenting with a digital currency. To that, Weidmann said, it is about payment transactions between the central bank and commercial banks. Specifically, the central bank is testing blockchain tech to supplement its central, account-based solution, however, that has also not yielded any better results, according to Weidmann.","“In our special context with a few business partners we know, blockchain is initially no more efficient than central processing,” he said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Weidmann","content":"PERSON"},{"type":"Handelsblatt","content":"ORGANIZATION"},{"type":"Sweden","content":"LOCATION"},{"type":"Lagarde","content":"PERSON"},{"type":"ECB","content":"ORGANIZATION"},{"type":"Germany","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Jens Weidmann","content":"PERSON"},{"type":"Christine Lagarde","content":"PERSON"},{"type":"European Central Bank (ECB","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["ECB"],"authors":["Yogita Khatri","The Block"]}