{"summary":"The former head of Circle’s OTC desk, Dan Matuszewski, went on record with On The Brink with Castle Island’s Nic Carter this week, talking about Circle’s involvement with Tether\nMatuszewski sought to dispel much of the concern surrounding the creation of large swaths of Tether in 2017, saying a spread between Bitfinex and Coinbase led to a unique investment opportunity resulting in the creation of so many Tethers\nHe also said the Tethers were legitimately issued, since he, himself, funneled millions towards their generation","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/48857\/former-head-of-circle-otc-says-theres-more-to-the-tether-narrative","publishDate":"2019-12-02T13:42:00","id":3574,"type":null,"title":"Former head of Circle OTC says there&#x27;s more to the Tether narrative","category":["Tether"],"content":["The former head of over the counter trading at Circle went on the record with <a href=\"https:\/\/castleisland.libsyn.com\/dan-matuszewski-cms-holdings-ep22\" data-v-f87c67ca=\"\">On the Brink with Castle Island<\/a> this week, and he had a lot to say about Tether. Dan Matuszewski, now principal and co-founder of CMS Holdings, said during his time at Circle there was no incentive to speak up about Tether.","Matuszewski told <a href=\"https:\/\/castleisland.libsyn.com\/dan-matuszewski-cms-holdings-ep22\" data-v-f87c67ca=\"\">On the Brink's<\/a> Nic Carter that the idea of tethers driving the price of bitcoin significantly higher is \"not true whatsoever.\"&nbsp;","\"I say this as someone who created and redeemed billions of tether over the course of my life and specifically created it in 2017,\" he said.&nbsp;","Some outlets, including <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2018-06-13\/professor-who-rang-vix-alarm-says-tether-used-to-boost-bitcoin\" data-v-f87c67ca=\"\">Bloomberg<\/a>, reported the concerns of those who felt Tether was being used to stabilize and manipulate the price of BTC. Bitfinex denied the allegations, but some studies showed correlations between Tether creation and the use of Tether to buy bitcoin propping up the price.","Rather than Tether pumping the price of bitcoin, Matuszewski said the price was already rising. A spread emerged between the BTC price on Coinbase and the price on Bitfinex as retail speculators flocked to the more popular Coinbase. This spread opened up an arbitrage opportunity, causing many traders to mint large volumes of Tether in order to buy cheap Bitcoin on Bitfinex and then sell at a higher price on Coinbase. This led to the large generations of Tether that created suspicions of price manipulation.","In short, Matuszewski affirmed that there were incentivizing events for the generation of Tethers. Bitfinex didn't print Tether out of nowhere either, since Matuszewski said he himself was one of the drivers.&nbsp;","“I can tell you that billions of dollars were sent in to make it like that,\" he said. \"I can 100%, without question, verifiably guarantee it happened. I did it, I was there...That money wasn't just being hypothecated. It wasn't just coming out of thin air, that was happening.\"","Even though Matuszewski was privy to this information as concern surrounding Tether was proliferating, transparency wasn't in Circle's best interest at the time. He hearkened back to conversations he had at Circle, saying the exchange should be open about the stablecoin.","\"Internally, they're like 'why should we get involved in this? There's a lot of hair on Tether right now. You don't want to be named in all these actions, you don't want the New York AG rolling you into this thing,'\" he said.","According to Matuszewski, Circle saw no upside in associating itself, and other exchanges felt similarly. For this reason, much of the concern about Tether was never dispelled.&nbsp;","Since 2017, Tether's use case has changed with the rise of more regulated stablecoins like USDC. According to Matuszewski, it's split crypto into two worlds, with some preferring Tether's willingness to push back on regulatory scrutiny.","“Specifically people we’ve seen in Asia prefer that,\" he said. \"Here’s the deal, if something goes wrong with USDC there’s no chance that Coinbase and Circle are gonna fight whatever regulatory body comes in. They’re going to 100% give in. […] Tether is going to fight, and they have. So people like that, like maybe they won't just hand over or put KYC restrictions in the chain, or at least they'll try to fight it in court.\""],"hashtag":[]}