{"summary":"The market for cryptocurrency options has been heating up since the beginning of the year, but a first mover in the market continues to maintain its dominance – but for how long?","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/55519\/deribits-crypto-options-market-share-still-dwarfs-competitors-amid-ecosystem-growth","publishDate":"2020-02-11T16:23:18","id":3574,"type":null,"title":"Deribit&#x27;s crypto options market share still dwarfs competitors amid ecosystem growth","category":["MARKETS"],"content":["The market for cryptocurrency options has been heating up since the beginning of the year, but a first mover in the market continues to maintain its dominance.&nbsp;","Over the course of the last two months, a number of market participants have rolled out their own options tied to bitcoin, including traditional exchanges like Intercontinental Exchange's Bakkt as well as crypto-native exchanges like OKEx and FTX.","Still, Deribit has been able to preserve much of its marketshare, which as of February 11 stood at 86%, according to data provided by Skew. OKEx, which launched bitcoin options in December 2019, trails with 8.22% marketshare. FTX, which isn't included in Skew's data, saw 748.8 bitcoin (~7.6M) worth of its product trade over 24-hours, according to data from its website.","","","It is early days, however. And there's no guarantee that Deribit will forever be the options kingmaker.&nbsp;","The bitcoin futures market offers a possible glimpse into Deribit's future. BitMEX, which was once the dominant force in trading of perpetual bitcoin futures, reports volumes that are only slightly above that of OKEx, according to Skew data.&nbsp;","","","Another possible headwind could be Deribit's implementation of new know-your-customer (KYC) requirements for certain customers.","Earlier this year, Deribit announced it would incorporate its business in Panama and expand its KYC requirements for clients looking to withdrawal more than 1 bitcoin within a 24-hour period. The move was implemented on February 10. As such, certain clients are required to submit a passport or government ID. The move reminded some traders of the fate of crypto exchange Poloniex, which saw its marketshare nosedive as it <a href=\"https:\/\/poloniex.com\/press-releases\/2017.12.27-Notice-to-legacy-account-holders\/\" data-v-f87c67ca=\"\">rolled out KYC standards<\/a> in 2018.","Will Deribit suffer a similar fate? Probably not, says Emmanuel Goh, who leads Skew. In an email to The Block, Goh noted that Deribit's customer base skews more professional relative to where Poloniex was in 2018.&nbsp;","\"I wouldn’t expect much of a change as this has been well flagged in advance and Deribit has a high professional user base,\" Goh said.","Last year, the firm began offering block trading to its institutional clients in partnership with messaging service Paradigm. Deribit is one of the few crypto venues that offers this functionality for its clients.&nbsp;","Su Zhu, CIO of Three Arrows Capital, also noted that the majority of Deribit's volumes derives from \"already KYC-ed institutional flow.\" Zhu is an investor in Deribit.&nbsp;","Deribit co-founder Marius Jansen echoed Goh and Zhu, noting in an email to The Block:","\"Also keep in mind that the 'average' Poloniex trader during the previous altcoin mania is not to be compared to the&nbsp;Deribit&nbsp;users. I would consider most traders trading Futures and Options on&nbsp;Deribit&nbsp;to be more professional and most of these traders don't have any issue with KYC.\"","Still, crypto is not known for its predictability, as Jansen alluded to.","\"But who knows how it plays out... Maybe ping us again in a month or so?\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Intercontinental Exchange","content":"ORGANIZATION"},{"type":"February 11","content":"DATE"},{"type":"February 10","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"86%","content":"PERCENT"},{"type":"Deribit","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"December 2019","content":"DATE"},{"type":"Panama","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Goh","content":"PERSON"},{"type":"Emmanuel Goh","content":"PERSON"},{"type":"Deribit","content":"LOCATION"},{"type":"Deribit","content":"PERSON"},{"type":"Marius Jansen","content":"PERSON"},{"type":"Jansen","content":"PERSON"},{"type":"8.22%","content":"PERCENT"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}