{"summary":"China’s state-owned commercial bank China Merchants Bank International (CMBI) announced on Thursday a partnership with blockchain network Nervos\nThe bank hopes to build decentralized apps related to payments, tokenization, identity verification, etc, although details are sparse \nNervos is building a public, permissionless blockchain; the firm just raised $28 million last year from Polychain Capital, CMBI, Sequoia China, and others ","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/41816\/one-of-chinas-largest-banks-partners-with-permissionless-blockchain-to-roll-out-decentralized-apps","publishDate":"2019-10-03T08:22:49","id":3575,"type":null,"title":"One of China&#x27;s largest banks partners with permissionless blockchain to roll out decentralized apps","category":["China"],"content":["<span data-v-f87c67ca=\"\">One of China’s largest state-owned banks is partnering with a public, permissionless blockchain to build a series of fintech applications, some of which will serve the bank’s retail customers.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">China Merchants Bank International (CMBI), a subsidiary of China Merchants Bank (CMB), announced on Thursday it has partnered with blockchain network Nervos. The partnership will enable the bank to develop decentralized applications that are both retail and institution facing, according to Nervos Networks co-founder Kevin Wang.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Some of the areas that CMBI is exploring with blockchain include the tokenization of assets, payments, identity verification, trading, and lending, according to Wang. However, the details and timeline of when these apps will be rolled out are still sparse, he said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Basically what has mostly been under the traditional finance umbrella, they [CMBI] are going to experiment to put into decentralized applications,” Wang added.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">2019 has witnessed several banks jumping into the blockchain space, launching their own tokens such as the JPM Coin by JP Morgan Chase and Wells Fargo Digital Cash for interbank transfers. Meanwhile, CMBI has previously experimented with permissioned blockchain for internal purposes. This partnership with Nervos is the bank’s first venture into the public blockchain space, according to a Nervos spokesperson. Compared to permissioned blockchains, the permissionless ones are \"ideal for inter-bank or external client-facing applications where security and multi-party verification are needed,\" said the spokesperson.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“CMB are always early adopters of technology. They are way ahead of all the other banks that we know of, so they actually have done a lot of research internally, build pilot programs in that, and willing to jump in on the public side,” said Wang.<\/span>","<span data-v-f87c67ca=\"\">Nervos is public Proof-of-Work-based blockchain that aims to address the issues of both security and scalability with its two-layer design. In 2018, Nervos <\/span><a href=\"https:\/\/www.prnewswire.com\/news-releases\/nervos-network-secures-28m-to-make-blockchain-more-accessible-to-enterprises-300683103.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">raised<\/span><\/a><span data-v-f87c67ca=\"\"> $28 million from CMBI, Polychain Capital, Sequoia China, 1confirmation, Matrix Partner China, and others. The firm is launching a public sale of its native token on CoinList, while the public launch of its mainnet is slated for Q4 this year. <\/span>"],"hashtag":[]}