{"summary":"Bank of England chief economist Andrew Haldane said digital currency could result in the rise of “narrow banking.”\nHe argued this could reduce the fragilities in the traditional banking model, lowering the risk of financial crises.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/110093\/bank-of-england-chief-economist-digital-currency-disrupt-banking-model","publishDate":"2021-06-30T10:14:37","id":3579,"type":null,"title":"BoE chief economist: CBDCs could disrupt centuries-old banking model","category":["Central Banks"],"content":["In a speech given on his last day as chief economist of the Bank of England — after working for over 30 years at the central bank — Andrew Haldane spent a considerable amount of time ruminating over the possible consequences of Central Bank Digital Currencies (CBDCs).","In a speech <a href=\"https:\/\/www.bankofengland.co.uk\/-\/media\/boe\/files\/speech\/2021\/june\/thirty-years-of-hurt-never-stopped-me-dreaming-speech-by-andy-haldane.pdf?la=en&amp;hash=482A2B9C1CBAB7E96AEFF139F41BF7454334F408\" data-v-f87c67ca=\"\">published June 30<\/a>, Haldane said that a widely used digital currency could change the structural properties of banking on a fundamental level.","“It could result in something akin to narrow banking, with safe, payments-based activities segregated from banks’ riskier credit-provision activities. In other words, the traditional model of banking familiar for over 800 years could be disrupted,” he said.","The Bank of England — like many of the world’s central banks — is currently exploring the possibility of launching a so-called “Britcoin,” a digital version of the pound sterling. It has been <a href=\"https:\/\/www.theblockcrypto.com\/linked\/103424\/bank-of-england-hiring-cbdc-team\" data-v-f87c67ca=\"\">hiring CBDC experts<\/a> since late April.","But the Bank has <a href=\"https:\/\/www.theblockcrypto.com\/post\/107434\/uk-central-bank-digital-money-tread-carefully\" data-v-f87c67ca=\"\">repeatedly<\/a> stressed that a final decision on whether to proceed with the project remains some way off, and that both the risks and benefits of such a currency should be weighed carefully.","This is not the first time commercial banks have been put on notice. The momentum behind CBDCs globally has given rise to fears that the typical bank model of using short-term deposits to fund long-term investments — “maturity transformation” — could be put at risk.","The Federal Reserve Bank of Philadelphia warned of exactly that <a href=\"https:\/\/www.centralbanking.com\/fintech\/cbdc\/7559416\/cbdc-could-endanger-maturity-transformation-philadelphia-fed-paper\" data-v-f87c67ca=\"\">in a paper<\/a> published June 2020. The argument goes that central banks have a clear competitive advantage over commercial banks during times of stress, and so would hoover up deposits.","In November last year, the Bank of England’s deputy governor Sir John Cunliffe warned <a href=\"https:\/\/www.theblockcrypto.com\/linked\/84530\/boe-central-bank-digital-currencies-deputy\" data-v-f87c67ca=\"\">that it is not its job<\/a> to “protect bank business models.”","But in his farewell speech, Haldane said that any such disruption to commercial banking may come with a silver lining.","“Specifically, this could lead to a closer alignment of risk for those institutions, new and old, offering these services – narrow banking for payments (money backed by safe assets) and limited purpose banking for lending (risky assets backed by risky liabilities),” said Haldane. &nbsp;","“This radically different topology, while not costless, would reduce at source the fragilities in the banking model that have been causing financial crises for over 800 years. Given the costs of those crises – large and rising – this is a benefit that needs to be weighed,” he added."],"hashtag":["CBDCS"]}