{"summary":"BlackRock&#x27;s head of strategic ecosystem partnerships thinks institutional adoption of tokenization will take longer than people expect.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236073\/tokenization-will-be-monumental-in-shaping-our-ecosystem-blackrock","publishDate":"2023-06-22T16:54:14","id":3580,"type":null,"title":"BlackRock touts &#x27;monumental&#x27; impact of tokenization, even if it&#x27;s slow","category":["FINANCE FIRMS"],"content":["BlackRock head of strategic ecosystem partnerships Joseph Chalom thinks institutional adoption of <a href=\"https:\/\/www.theblock.co\/post\/234685\/securitize-takes-contrarian-view-in-cryptos-war-with-the-sec\" data-v-f87c67ca=\"\">tokenization<\/a> might be slower than expected in the short term, \"but in the long term it will be monumental in shaping our ecosystem.\"","\"We need to work with good actors, and with good infrastructure, that becomes self-reinforcing, then the money and adoption will come,\" he said Thursday at an <a href=\"https:\/\/stateofcryptosummit.live.ft.com\/agenda\/session\/1151273\" data-v-f87c67ca=\"\">event<\/a> in New York. His comments followed a flurry of excitement after the asset management firm filed for a spot bitcoin EFT with the U.S. Securities and Exchange Commission last week.&nbsp;","Chalom said BlackRock has been engaged in numerous conversations with both traditional and crypto-native clients, focusing on tokenization and its partnership with Circle. Chalom added the industry needs to coalesce around certain assets and prioritize real-world use cases.","When it comes to decentralized finance, however, Chalom was less optimistic in terms of widescale institutional adoption.","\"We go to jail if we don't know who we are trading with, we can only participate in ecosystems who are well regulated and understood,\" he said.","Chalom acknowledged the potential of DeFi in the long term, specifically highlighting the importance of smart contracts and deep liquidity pools. But he expressed concerns over the unresolved issue of digital identity, which he identified as a significant obstacle for institutional participation.","\"There is always the anti-money laundering issue, the KYC issue,\" he said. \"We need a clear understanding of who is in these pools.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York","content":"LOCATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"EFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Joseph Chalom","content":"PERSON"},{"type":"Chalom","content":"PERSON"}],"hashtag":["BLACKROCK","CRYPTO","SPOT BITCOIN ETF"],"authors":["Brian McGleenon","The Block"]}