{"summary":"Coinbase’s S-1 filing with the Securities and Exchange Commission is now public.\nThe development signifies that the firm’s push to go public is advancing toward completion.\nThe move comes after Coinbase announced the confidential filing of the S-1 with the SEC in December, as previously reported.","author":["Michael McSweeney","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/95921\/coinbases-s-1-public-filing-is-now-public-setting-stage-for-a-direct-listing-on-nasdaq","publishDate":"2021-02-25T07:41:56","id":3582,"type":null,"title":"Coinbase&#x27;s S-1 filing is now public, setting stage for a direct listing on Nasdaq","category":["Bitcoin"],"content":["Crypto exchange unicorn Coinbase's <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1679788\/000162828021003168\/coinbaseglobalincs-1.htm\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">S-1 registration statement filing<\/a> with the U.S. Securities and Exchange Commission -- a crucial step toward its bid for a direct stock listing on <a href=\"https:\/\/www.theblockcrypto.com\/linked\/93294\/coinbase-nasdaq-direct-listing\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nasdaq<\/a> -- is now available to the public.","The S-1 offers an unprecedented look at Coinbase's business, with the disclosures effectively serving as its pitch to investors. A confidential draft of the document was submitted to the SEC <a href=\"https:\/\/www.theblockcrypto.com\/linked\/88293\/coinbase-s-1-potential-ipo-filing\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">in mid-December<\/a>.","\"Coinbase intends to list its Class A common stock on the Nasdaq Global Select Market under the ticker symbol 'COIN',\" Coinbase said <a href=\"https:\/\/blog.coinbase.com\/coinbase-announces-filing-of-registration-statement-for-proposed-public-direct-listing-of-its-b7def721d2a1?gi=f69e225f86ad\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">in a blog post Thursday<\/a>.","Among other details included in the document: Coinbase posted $1.1 billion in net revenue for 2020. By comparison, Coinbase noted that it brought in $482.9 million in net revenue during 2019.&nbsp;","Per the filing, Coinbase reported operating expenses of $868.5 million, up from $579.5 million the year before.","Ultimately, 2020 was a positive year for Coinbase on the profit front, bringing in $322.3 million following a roughly $30 million loss in 2019.","As Coinbase noted:","The reveal signifies a landmark moment for Coinbase, the premier crypto exchange in the U.S. that, in the years since its founding in 2012, has amassed millions of users and hundreds of millions of dollars in venture capital from some of Silicon Valley's biggest names. Coinbase has also secured itself a position between the crypto and institutional investment worlds, having catered to the likes of <a href=\"https:\/\/www.theblockcrypto.com\/post\/95146\/coinbase-tesla-bitcoin-buy\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Tesla<\/a> and other deep-pocketed buyers by way of its brokerage service.","In the days and weeks leading up to today's reveal, speculation about Coinbase's valuation emerged thanks to chatter about its secondary offerings on Nasdaq Private Market. As The Block previously reported, Coinbase's stock <a href=\"https:\/\/www.theblockcrypto.com\/post\/95469\/coinbase-stock-traded-at-implied-valuation-of-100-billion-this-week-nasdaq-private-market-data-shows\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">landed at a $100 billion valuation<\/a> in light of those cleared trades.","The filing notes a who's-who of Wall Street giants as advisors on the deal, including Goldman Sachs, Citigroup, JPMorgan and Allen &amp; Co.","Coinbase's S-1 contains numerous details about the growth arc of the firm, including the number of verified users on its platform.","<iframe title=\"Coinbase's Total Volume\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/public-companies\/coinbase-total-volume\/embed\" width=\"100%\" height=\"420\" frameborder=\"0\" data-v-f87c67ca=\"\"><\/iframe>","The company said that \"[today], our platform enables approximately 43 million retail users, 7,000 institutions, and 115,000 ecosystem partners in over 100 countries to participate in the cryptoeconomy.\"","<iframe title=\"Coinbase's Volume by Customer Segment\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/public-companies\/coinbase-volume-by-customer-segment\/embed\" width=\"100%\" height=\"420\" frameborder=\"0\" data-v-f87c67ca=\"\"><\/iframe>","Coinbase further noted that it had 2.8 million \"transacting customers\" on its platform as of the end of 2020, compared to 1 million such customers at the end of the past year."],"hashtag":["COINBASE"]}