{"summary":"Privacy-focused smart contract platform Fhenix has raised a $7 million seed round led by Multicoin Capital and Collider Ventures.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/252931\/fhenix-seed-multicoin-capital","publishDate":"2023-09-26T10:00:03","id":3584,"type":null,"title":"Fhenix raises $7 million in seed round led by Multicoin Capital","category":["VENTURE CAPITAL"],"content":["Privacy-focused blockchain Fhenix has raised $7 million in a seed round led by Multicoin Capital and Collider Ventures. Participants also include Node Capital, Bankless, HackVC, TaneLabs, Metaplanet and Tarun Chitra’s and Robert Leshner’s Robot Ventures, according to a statement.&nbsp;","The funds will be used to bring Fhenix’s “confidential” smart contract platform into a public testnet, dubbed “Renaissance,” early next year and support ecosystem development following the launch of its private devnet in July.&nbsp;","“With Fhenix’s encrypted smart contracts, we can empower developers to use encrypted blockchain as an enabler for new business opportunities, including on-chain trustless gaming, private voting for DAOs, on-chain privacy-preserving AI and much more,\" Fhenix CEO and former blockchain division director at Intel Guy Itzhaki said.&nbsp;","“Fhenix addresses a huge problem in the Ethereum ecosystem: a lack of encryption for commercially sensitive data,” Fhenix and Secret Network founder Guy Zyskind added. \"Fhenix gives users the confidence to put sensitive data on public blockchains while also giving developers the tools to compute and transform that data for the first time.”","Fhenix’s smart contract platform uses a cryptographic technique called fully homomorphic encryption, allowing for the computation of encrypted data without exposing the underlying information. Fhenix said it aims to bring data encryption and encrypted data computation to smart contracts, transactions and on-chain assets to the Ethereum ecosystem.","“The acute need for data confidentiality is rapidly growing which is driving demand for innovative technologies like FHE and fostering collaborations between complementary blockchains such as Fhenix and Secret to ensure a more secure and privacy-centric future,” Zyskind said.","\"By harnessing the power of FHE, we can solve one of the last remaining challenges in web3 and allow users to not only own their data but also control who they share their data with,” Itzhaki added.&nbsp;","Fhenix is powered by the fhEVM, an extension suite for the Ethereum Virtual Machine. This allows Ethereum developers to incorporate FHE into their projects, crafting encrypted smart contracts without delving deep into cryptography, using the same Solidity programming language they are used to.","The fhEVM was originally developed by Zama, a cryptography company building open-source encryption solutions for blockchain and AI, and integrated with Fhenix Network following a strategic partnership.","“Having the ability to keep things private on-chain will go beyond solving privacy issues; it will pave the way for hundreds of new use cases — blind auctions, on-chain identity attestations and KYC, confidential real-world asset tokenization, private voting for DAOs and more,” Zama CEO Rand Hindi said.","“Similar to zero-knowledge proofs, FHE has always been a technology with a ton of promise; however, the challenge has always been how to bridge the requisite knowledge in hardcore cryptography and blockchain development,” Multicoin Capital Managing Partner Kyle Samani said. “Fhenix radically simplifies that problem and is making FHE accessible to Ethereum devs practically overnight.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Node Capital","content":"ORGANIZATION"},{"type":"Tarun Chitra’s","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$7 million","content":"MONEY"},{"type":"Zama","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Zama CEO Rand Hindi","content":"ORGANIZATION"},{"type":"Intel Guy Itzhaki","content":"ORGANIZATION"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"Collider Ventures","content":"ORGANIZATION"},{"type":"Bankless","content":"LOCATION"},{"type":"Fhenix Network","content":"ORGANIZATION"},{"type":"Multicoin Capital","content":"ORGANIZATION"},{"type":"Zyskind","content":"PERSON"},{"type":"Kyle Samani","content":"PERSON"},{"type":"Robert Leshner","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ETHEREUM","SEED &AMP; PRE-SEED"],"authors":["James Hunt","The Block"]}