{"summary":"KyberSwap exchange is moving out of Malta to the British Virgin Islands\nThe exchange said 5AMLD regulations “would put too high a barrier for the majority of traders, both – regulatory and cost-wise” \nJust last week, Deribit said it is leaving the Netherlands for Panama due to 5AMLD","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/53352\/another-crypto-firm-moving-out-of-the-eu-in-response-to-5amld-this-time-non-custodial-exchange-kyberswap","publishDate":"2020-01-17T07:45:26","id":3584,"type":null,"title":"Another crypto firm moving out of the EU in response to 5AMLD, this time non-custodial exchange KyberSwap","category":["Exchanges"],"content":["KyberSwap, currently the second-largest non-custodial cryptocurrency exchange by market share, is moving out of Malta to the British Virgin Islands (BVI), according to an email obtained by The Block.","The email, sent by KyberSwap to its registered users on Thursday, says that the exchange has taken the move in response to the Fifth Anti-Money Laundering Directive (5AMLD), which went into effect on January 10.&nbsp;","The <a href=\"https:\/\/www.theblockcrypto.com\/daily\/51782\/amld5-fills-regulatory-void-for-crypto-firms-but-state-by-state-rules-pose-challenges\" data-v-f87c67ca=\"\">directive requires<\/a> EU crypto firms to implement know-your-customer (KYC) measures and report any suspicious customer activity. This requires some degree of record keeping and obtaining information about the source of funds. Crypto firms will also have to appoint someone to oversee compliance and train staff members in anti-money-laundering (AML) requirements.","KyberSwap is currently operating in Malta and will move to the BVI on January 24, per the email. The exchange said that “the new regulations would put too high a barrier for the majority of traders, both - regulatory and cost-wise” and therefore, it has decided to operate the exchange from the BVI.&nbsp;","As a result, KyberSwap will no longer be operated by Malta-based Kyber Network International Limited and will be operated by KYRD International Limited, a sister company incorporated and based in the BVI, per the email.","KyberSwap said its team and leadership will remain the same.&nbsp;","The non-custodial exchange is currently the second-largest, and is in a neck-and-neck competition with rival Uniswap, according to <a href=\"https:\/\/www.theblockresearch.com\/non-custodial-volume-dwindles-as-uniswap-and-kyber-network-take-the-lead-in-market-share-52106\" data-v-f87c67ca=\"\">The Block’s research<\/a>.&nbsp;&nbsp;","","","Some crypto firms, on the other hand, have&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/post\/50613\/two-more-crypto-firms-shutting-down-over-impending-eu-money-laundering-rules?utm_source=newsletter&amp;utm_medium=email&amp;utm_campaign=2019-12-16\" data-v-f87c67ca=\"\">closed down<\/a>&nbsp;in response to the directive. These include crypto payments firm BottlePay, crypto mining pool Simplecoin and bitcoin gaming platform Chopcoin, among others."],"hashtag":[]}