{"summary":"Gemini and Colombian bank Bancolombia will launch a yearlong pilot project for cash-in and cash-out operations on Dec. 14.\nThe program is part of Colombia’s regulated sandbox for financial technology","author":["Kristin Majcher","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/126705\/gemini-and-bancolombia-to-launch-crypto-pilot-this-month","publishDate":"2021-12-07T18:30:32","id":3585,"type":null,"title":"Gemini and Bancolombia to launch crypto pilot this month","category":["Payments and Banking"],"content":["<span data-v-f87c67ca=\"\">Certain Bancolombia customers will soon be able to buy cryptocurrencies more easily, thanks to a pilot project launching next week that will allow users of the Colombian bank to link their accounts to New York-based exchange Gemini.<\/span>","<span data-v-f87c67ca=\"\">The project involves connecting selected Bancolombia accounts to Gemini to facilitate cash-in and cash-out operations. This will provide an on- and off-ramp for trading bitcoin (BTC), ether (ETH), Bitcoin Cash (BCH) and Litecoin (LTC).&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Our whole goal with this partnership is to make sure that we’re offering users seamless and secure access to crypto,” Gemini principal for strategy &amp; corporate development Cynthia Del Pozo García told The Block in an interview.<\/span>","<span data-v-f87c67ca=\"\">The yearlong pilot is one of <\/span><a href=\"https:\/\/www.superfinanciera.gov.co\/inicio\/innovasfc\/laarenera-10099575\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">several projects<\/span><\/a><span data-v-f87c67ca=\"\"> that Colombia’s financial regulator, Superintendencia Financiera de Colombia (SFC), has approved for its supervised sandbox “laArenera.” The goal is for Bancolombia to test cash-in and cash-out operations with a crypto exchange.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Gemini will start a four-phase rollout of the pilot on Dec. 14,&nbsp; Del Pozo García said. <\/span>","<span data-v-f87c67ca=\"\">The first step involves inviting Bancolombia employees to participate in the sandbox operations and then adding pre-selected customers to join until reaching an approved cap of 5,000 monthly active users. The program does not involve any deposit or withdrawal fees, a Gemini spokesperson said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Selected customers will get an email from Bancolombia saying they’re invited to participate in the sandbox program, which includes a registration link that takes them to Gemini’s website. Once the customers are formally onboarded, they’ll be able to link their bank accounts to Gemini’s platform to deposit Colombian pesos, Del Pozo García explained. She clarified that Bancolombia isn’t intervening in the process of buying and selling crypto, but rather acting as the channel that facilitates the transactions by inviting customers to participate.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bancolombia said in a press release that it will offset carbon emissions for the bitcoin operations completed during the program. It calculates this figure will reach 7,000 tons — which it describes as the equivalent of using 1,500 passenger vehicles in a year. The bank said it has already considered transactions using the other cryptocurrencies in its carbon neutrality program.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Gemini thinks Latin America is one of the most promising international markets for crypto adoption and has plans to grow in the region, Del Pozo García said. It sees remittance needs and currency devaluation as the main drivers.<\/span>","<span data-v-f87c67ca=\"\">“We see this partnership to mark the start of the expansion in Latin America for Gemini,” Del Pozo García said, noting that the firm will be looking at multiple countries in the region. “We see this as just being the beginning for us.”<\/span>"],"hashtag":["GEMINI"]}