{"summary":"Experts weighed on the SEC’s move to charge crypto exchange Kraken on Thursday and said it could have broader implications for the industry.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210408\/secs-targeting-of-kraken-staking-program-sends-shockwaves-through-industry","publishDate":"2023-02-09T19:39:07","id":3585,"type":null,"title":"SEC&#x27;s targeting of Kraken staking program sends shockwaves through industry","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Securities and Exchange Commission’s move to charge crypto exchange Kraken with failing to register the offer and sale of its <\/span><span class=\"s2\" data-v-f87c67ca=\"\">“crypto asset staking-as-a-service program” signals an aggressive new posture by the markets regulator over a key revenue stream for exchanges.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Kraken settled with the agency on Thursday afternoon, ending its staking program in the U.S. and agreeing to pay $30 million in disgorgement, prejudgment interest and civil penalties. But the move likely signals more headaches for crypto companies in the U.S. as the SEC looks to further crack down on the passive investment offering after several high-profile failures have left customers in court seeking pennies on the dollar — or satoshis on the bitcoin.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The settlement came a day after Coinbase CEO Brian Armstrong tweeted that he heard “rumors that the SEC would like to get rid of crypto staking in the U.S. for retail customers.\" Coinbase has its own staking program.&nbsp;<\/span>","Coinbase's staking program was not affected by Thursday's news, Coinbase Chief Legal Officer Paul Grewal said. Kraken was offering a yield product, Grewal said, defending Coinbase's staking services as \"fundamentally different\" and not securities.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">\"For example, our customers’ rewards depend on the rewards paid by the protocol, and commissions we disclose,\" Grewal told The Block. \"Ru<\/span><span class=\"s1\" data-v-f87c67ca=\"\">les making clear these distinctions would provide real clarity to consumers, investors, and the industry.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Aaron Kaplan, founder and co-CEO of Prometheum, Inc., a fintech company, called the news on Thursday a “<\/span><span class=\"s4\" data-v-f87c67ca=\"\">bad sign for ‘staking as a service’ as it’s currently offered in the United States.”&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“It appears that staking as a service is a regulated financial activity, and that the intermediaries providing such services have to register under the federal securities laws,” Kaplan said. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Kristin Smith, CEO of the Blockchain Association, an industry advocacy group, also weighed in, criticizing the agency over its “regulating by enforcement.”&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“Staking is an important part of the crypto ecosystem, allowing individuals to participate in decentralized networks and giving investors more options to earn passive income,” said Smith. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Smith said the settlement was “another example” highlighting the need for Congress to introduce legislation.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Rep. Tom Emmer, R-Minn., one of the more vocal supporters of digital assets in Congress, previewed the likely reaction from other industry supporters on Capitol Hill.&nbsp;<\/span>","<span class=\"s7\" data-v-f87c67ca=\"\">“@GaryGensler’s<\/span><span class=\"s1\" data-v-f87c67ca=\"\"> regulatory purgatory strategy hurts everyday Americans the most — leaving them in the dust while these opportunities are accessible offshore,” Emmer tweeted. &nbsp;<\/span>","Though Gensler has <a href=\"https:\/\/www.theblock.co\/post\/172097\/proof-of-security-gensler-eyes-proof-of-stake-after-the-merge\" data-v-f87c67ca=\"\">raised questions<\/a> about whether proof-of-stake might look like a common enterprise, which would require registration of tokens as securities, experts saw the consensus method that Ethereum and other projects rely on as safe, at least for now.&nbsp;","“Validators are not financial intermediaries; they provide technology services, not financial services,” said Alison Mangiero, executive director of industry group Proof of Stake Alliance.","But opinions differed as to whether it might more broadly put exchange staking programs into question.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC’s action is “<\/span><span class=\"s6\" data-v-f87c67ca=\"\">not a condemnation of staking writ large,” said <\/span><span class=\"s1\" data-v-f87c67ca=\"\">Zachary Fallon, partner at the law firm Ketsal and a former SEC attorney.&nbsp;<\/span><span class=\"s1\" data-v-f87c67ca=\"\">“This is regulatory condemnation of Kraken’s staking program specifically.\"<\/span>","Jennifer Schulp, <span class=\"s1\" data-v-f87c67ca=\"\">director of financial regulation studies at the Cato Institute, saw the action as muddying the waters for other companies offering their own staking programs.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“Piecemeal enforcement actions, like the one brought by the SEC against Kraken, are a poor substitute for providing guidance as to what characteristics of a program will trigger regulation by the securities laws,” said Schulp, who is the director of financial regulation studies at the libertarian think tank.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Agnes Gambill West, a visiting senior research fellow at the Mercatus Center, was also less than impressed with the SEC.&nbsp;&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“The bigger loss is that U.S.-based crypto businesses are being compelled to shutter or move offshore rather than operate compliantly within the U.S. or find market-based solutions that mitigate potential harms to investors, which is a huge loss for U.S.-based innovation and competition,” she said. &nbsp;<\/span>","She also noted that the $30 million fine was a<span class=\"s1\" data-v-f87c67ca=\"\">&nbsp;“drop in the bucket for Kraken.”&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Despite Grewal's claim that Coinbase's program would be unaffected, shares fell over 14% to below $60 at market close on Thursday. Coinbase reported nearly $63 million in \"blockchain rewards\" revenue in the third quarter of 2022.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">&nbsp;\"Investors now have to start pricing in the possibility that this future revenue vertical gets removed if regulation comes down strict enough to shut the product down,\" <a href=\"https:\/\/www.theblock.co\/post\/210162\/coinbase-drops-8-as-ceo-armstrong-calls-out-sec-silvergate-sinks-5\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">said<\/span><\/a>&nbsp;John Todaro analyst at Needham Co. \"While staking revenue is still a relatively small contributor today, there is high growth potential in this vertical,\" Todaro wrote in a note today. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The investment bank estimated hundreds of millions in industrywide revenue from staking-related programs.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">With additional reporting from Frank Chaparro, Adam Morgan McCarthy, Stephanie Murray and Jeremy Nation.&nbsp;<\/em><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Emmer","content":"PERSON"},{"type":"third quarter of 2022","content":"DATE"},{"type":"Stephanie Murray","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Kristin Smith","content":"PERSON"},{"type":"Kaplan","content":"PERSON"},{"type":"Grewal","content":"PERSON"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Smith","content":"PERSON"},{"type":"Proof of Stake Alliance","content":"ORGANIZATION"},{"type":"Gensler","content":"PERSON"},{"type":"Aaron Kaplan","content":"PERSON"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Mercatus Center","content":"ORGANIZATION"},{"type":"Prometheum, Inc.","content":"ORGANIZATION"},{"type":"\" Grewal","content":"PERSON"},{"type":"$60","content":"MONEY"},{"type":"Todaro","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Agnes Gambill West","content":"PERSON"},{"type":"afternoon","content":"TIME"},{"type":"Needham Co.","content":"ORGANIZATION"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"Alison Mangiero","content":"PERSON"},{"type":"Tom Emmer","content":"PERSON"},{"type":"$63 million","content":"MONEY"},{"type":"Adam Morgan McCarthy","content":"PERSON"},{"type":"Jeremy Nation","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Jennifer Schulp","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Ketsal","content":"PERSON"},{"type":"Schulp","content":"PERSON"},{"type":"$30 million","content":"MONEY"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"John Todaro","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Minn.","content":"LOCATION"},{"type":"14%","content":"PERCENT"},{"type":"Cato Institute","content":"ORGANIZATION"},{"type":"Paul Grewal","content":"PERSON"},{"type":"Zachary Fallon","content":"PERSON"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["COINBASE","CONGRESS","HOUSE FINANCIAL SERVICES COMMITTEE","KRAKEN"],"authors":["Sarah Wynn","The Block"]}