{"summary":"After a month of debating the issue, the Lido DAO is voting on whether to dilute its Ethereum staking dominance.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/154089\/lido-dao-begins-voting-on-whether-to-limit-its-ethereum-staking-dominance","publishDate":"2022-06-24T14:27:46","id":3586,"type":null,"title":"Lido DAO begins voting on whether to limit its Ethereum staking dominance","category":["DEFI"],"content":["Lido DAO members are currently <a href=\"https:\/\/snapshot.org\/#\/lido-snapshot.eth\/proposal\/0x10abedcc563b66b1adee60825e78c387105110fa4a1e7354ab57bc9cc1e675c2\" data-v-f87c67ca=\"\">voting<\/a> on whether the liquid staking protocol should take steps to reduce its dominance of its Ethereum 2.0 staking pool, the project <a href=\"https:\/\/twitter.com\/LidoFinance\/status\/1540258690942615555\" data-v-f87c67ca=\"\">announced<\/a> on Friday.","Lido Finance is a decentralized protocol that provides customers tradeable tokens, called staked ETH (stETH) in exchange for crypto assets, which Lido then stakes on the Ethereum Beacon chain — a precursor to Ethereum 2.0 (ETH2).","The popular service, called liquid staking, allows users to effectively unlock the value of their staked crypto, which must remain locked in the network for a set period of time. Lido users can deploy their stETH on other DeFi protocols like MakerDAO and Aave.","The vote, which began on Friday at 5:00 a.m. EDT, is coming after <a href=\"https:\/\/www.theblockcrypto.com\/news+\/152516\/why-ethereums-dominant-liquid-staking-protocol-is-debating-whether-to-reduce-its-influence\" data-v-f87c67ca=\"\">a month-long debate among community members<\/a> over the merits of reducing the community's staking influence. Data from <a href=\"https:\/\/dune.com\/hildobby\/ETH2-Deposits\" data-v-f87c67ca=\"\">this<\/a> Dune Analytics dashboard shows that Lido currently accounts for over 31% of all staked on the Ethereum Beacon chain.","The debate was triggered by concerns that Lido’s dominance of the ETH2 staking pool will pose a security risk to Ethereum after it transitions from proof of work to proof of stake. Critics, including Ethereum Foundation researcher Danny Ryan, have argued that Lido's staking dominance combined with its governance structure is a potentially dangerous point of centralization.&nbsp;","The voting process will end on July 1 at 5 AM ET. If the majority votes yes, there will be another governance vote on how the self-limiting process should work.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"31%","content":"PERCENT"},{"type":"5:00 a.m. EDT","content":"TIME"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Lido Finance","content":"ORGANIZATION"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"5 AM ET","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Danny Ryan","content":"PERSON"},{"type":"July 1","content":"DATE"},{"type":"Ethereum Beacon","content":"ORGANIZATION"}],"hashtag":["LIDO FINANCE","STAKING"],"authors":["Osato Avan-Nomayo","The Block"]}