{"summary":"CowSwap’s airdrop of governance tokens have now been unlocked and are available for trading on crypto exchanges.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/139832\/cowswap-unlocks-100-million-airdrop-for-its-early-supporters","publishDate":"2022-03-30T06:15:21","id":3591,"type":null,"title":"CowSwap unlocks $100 million airdrop for its early supporters","category":["DEX"],"content":["CowDAO allowed the recipients of its recent airdrop to start cashing in their tokens this week, as the token went live on exchanges.","Members of <a href=\"https:\/\/www.theblockresearch.com\/cowswap-gas-free-swaps-with-batch-settlement-127718\" data-v-f87c67ca=\"\">CowSwap<\/a>’s governing Decentralized Autonomous Organization (DAO) voted in favor of the switch on Monday, according to a <a href=\"https:\/\/cow-protocol.medium.com\/cow-token-is-moving-forward-at-full-speed-d9f047a23b57\" data-v-f87c67ca=\"\">post<\/a> on the protocol’s blog. The airdropped tokens were worth about $100 million at the time of publication.","In February, Gnosis DAO dropped untransferable vCOW tokens to early adopters on Ethereum and Gnosis Chain. The airdrop claiming process was closed on Monday (as defined in the initial smart contract deployment by Gnosis DAO) and required airdrop claimants to swap vCOW to COW, a brand new tradable token.&nbsp;","In total, CowSwap allocated 100 million tokens to the airdrop and those that made it to the airdrop list got anywhere between 99 to thousands of vCOW — depending on a trader’s total volume or the amount of staked Gnosis tokens.","At the time, while the vCOW tokens could be claimed they were not transferable. This meant the recipients of airdropped tokens could not immediately sell; the only use was for CowSwap governance.","After a couple of months, the CowSwap DAO has <a href=\"https:\/\/snapshot.org\/#\/cow.eth\/proposal\/0x7f2d0e26225fec1dd19ae4870532a09014a69f2d973dde0a7b8296d556f221df\" data-v-f87c67ca=\"\">voted<\/a> in favor of swapping vCOW to COW in a 1:1 ratio. These new tokens can be traded and used in liquidity incentives.","Per community members of Gnosis DAO, the original airdrop needed its own DAO vote from vCOW holders to convert it into another tradable token called COW, which replaced the former as the new governance token for CowSwap.","\"The community has decided to allow swapping of vCOW to COW tokens and update the DAO governance rules to allow also COW holders to participate in governance,\" Chen Magen, business development lead at the project, told The Block.","After Monday’s unlock, the airdrop turned out to be highly lucrative for some. One user under the pseudonym dnkta <a href=\"https:\/\/twitter.com\/dnkta\/status\/1508551495494643713\" data-v-f87c67ca=\"\">reported<\/a> making \"making six figures'' from the event. Other recipients may have pocketed more.","<em data-v-f87c67ca=\"\">Update: This article has been amended to clarify that CowDAO was behind the airdrop rather than a founding team.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gnosis","content":"PERSON"},{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Gnosis DAO","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Gnosis DAO","content":"PERSON"},{"type":"CowSwap governance","content":"ORGANIZATION"},{"type":"CowSwap","content":"ORGANIZATION"},{"type":"Chen Magen","content":"PERSON"},{"type":"Gnosis Chain","content":"ORGANIZATION"},{"type":"CowSwap DAO","content":"ORGANIZATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}