{"summary":"Crypto exchange unicorn published its estimated financial results for the first quarter of 2021 on Tuesday.\nThe data publication comes days before Coinbase’s expected direct listing on Nasdaq on April 14.\nCoinbase estimated that it generated $1.8 billion in total revenue during the first quarter of 2021.","author":["Michael McSweeney","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/100680\/coinbase-q1-results-april-direct-listing","publishDate":"2021-04-06T16:10:04","id":3594,"type":null,"title":"Coinbase reports an estimated $1.8 billion in total revenue for Q1 2021","category":["Startups"],"content":["Coinbase reported an estimated $1.8 billion in total revenue for the first quarter of 2021.","That figure was included in Coinbase's estimated financial results, published on Tuesday afternoon. The figures accounted for the three months ending March 31, 2021.","Among the other estimated numbers: $335 billion in trading volume. That's compared to the $89 billion in volume it posted for Q4 2020. Coinbase also reported net income of \"approximately $730 million to $800 million\" for the period.","Coinbase said it had an estimated 56 million verified customers and 6.1 million monthly transacting customers","<iframe title=\"Coinbase Monthly Transacting Users\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/public-companies\/coinbase-monthly-transacting-users\/embed\" width=\"100%\" height=\"420\" frameborder=\"0\" data-v-f87c67ca=\"\"><\/iframe>","Coinbase also reported $223 billion in assets on platform.","<iframe title=\"Cryptocurrencies held by Coinbase\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/public-companies\/cryptocurrencies-held-by-coinbase\/embed\" width=\"100%\" height=\"420\" frameborder=\"0\" data-v-f87c67ca=\"\"><\/iframe>","Of the data, Coinbase said that \"[t]his information is based on information available to the Company as of the date of this release and is subject to the completion of its quarterly financial closing procedures and review by the Company’s independent registered public accounting firm.\"","The financial results represent the last major step before its expected direct listing on April 14. Coinbase <a href=\"https:\/\/www.theblockcrypto.com\/linked\/100235\/coinbase-direct-listing-april-nasdaq\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">confirmed the date<\/a> last week, as previously reported. Earlier media reports indicated that Coinbase originally eyed a March direct listing but that target was ultimately missed.","Tuesday's release represents the latest look at Coinbase's financial performance, following the wide-ranging disclosures contained in its S-1 registration statement <a href=\"https:\/\/www.theblockcrypto.com\/post\/95921\/coinbases-s-1-public-filing-is-now-public-setting-stage-for-a-direct-listing-on-nasdaq\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">made public in February<\/a>.&nbsp;","Among the data points at the time: $322.3 million in 2020 profits versus a roughly $30 million loss in 2019.","Based on price data from crypto exchange FTX for its pre-IPO contract, Coinbase's current implied valuation is $121.7 billion, as shown in the daily graph below:","<iframe title=\"Coinbase Pre-Listing FTX Implied Valuation\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/public-companies\/coinbase-pre-ipo-stock-price\/embed\" width=\"100%\" height=\"420\" frameborder=\"0\" data-v-f87c67ca=\"\"><\/iframe>","Earlier Tuesday, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/100632\/fidelity-coinbase-square-crypto-council\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">news emerged<\/a> that Coinbase is a participant in a new Washington, D.C.-based lobbying organization focused on cryptocurrencies and digital assets. Square and Fidelity are also members of the organization.&nbsp;","<strong data-v-f87c67ca=\"\">2021 outlook<\/strong>","Looking to the remainder of 2021, Coinbase provided some estimates on where the coming year might take it performance-wise.","Perhaps most notably, Coinbase indicated that it may spend upwards of $1 billion over the course of 2021:","Coinbase also indicated that it will boost its marketing spend this year.","\"Additionally, we plan to augment our historically strong organic growth with customer acquisition and engagement by meaningfully increasing our investment in sales and marketing. We plan for sales and marketing to be between 12% and 15% of net revenue in 2021. Lastly, we anticipate transaction expenses will be in the low-to-mid teens as a percent of net revenue in 2021,\" the firm said.","Coinbase CFO Alesia Haas remarked during Tuesday's follow-up call that the firm expects its annual average revenue per user to rise during 2021.","\"Over the last 2 years, we have seen average annual net revenue per monthly transacting user (MTU) range between $34 -$45 per month, with the low end of this range occurring in 2019... and the high end of the range occurring in 2020. Given the strong performance of Q1 2021, it is likely that annual average net revenue per user will exceed this historical range.\"","<em data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThis news was updated to clarify Alesia Haas remark on average annual net revenue.<\/em>"],"hashtag":["BITCOIN","COINBASE"]}