{"summary":"The memecoin market cap has declined in the past 24 hours, underperforming the rest of the cryptocurrency market.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278563\/memecoins-underperforming-bitcoin-ether","publishDate":"2024-02-22T08:48:40","id":3596,"type":null,"title":"Memecoins underperforming as investors focus on bitcoin and ether: analysts","category":["MARKET UPDATES"],"content":["The memecoin market cap has declined in the past 24 hours, underperforming the rest of the cryptocurrency market, which posted gains during the same period.","According to CoinGecko <a href=\"https:\/\/www.coingecko.com\/en\/categories\/meme-token\" data-v-f87c67ca=\"\">data<\/a>, the market cap of memecoins currently stands at $22.6 billion — reflecting a decrease of 1.8%. Conversely, the global cryptocurrency market cap is now at $2.08 trillion after posting a 2.1% increase in the past 24 hours.","Most investor interest is focused on bitcoin and ether due to institutional inflows via approved and potential <a href=\"https:\/\/www.theblock.co\/post\/278345\/bitcoin-spot-etf-trading-volume-multiweek-high-bull-market\" data-v-f87c67ca=\"\">spot ETFs<\/a>, another analyst explains. \"Bitcoin ETFs and the possible approval of ether ETFs are stimulating capital inflow mostly into these two coins,\" YouHodler Chief of Markets Ruslan Lienkha told The Block.","Lienkha sees <a href=\"https:\/\/www.theblock.co\/learn\/245721\/what-are-memecoins\" data-v-f87c67ca=\"\">memecoins<\/a> as currently being \"highly illiquid and volatile.\" He added that a large part of the crypto market is still struggling with poor liquidity.","\"The recent bull run is structurally different from the crypto market hype in 2021. The market is segmented by smarter capital distribution, where memecoins are currently highly illiquid and volatile assets,\" Lienkha said.","The structurally different nature of the current market can be observed through the lower share of participants coming from the retail sector compared to past bull runs on <a href=\"https:\/\/www.theblock.co\/post\/277855\/bitcoin-price-should-be-well-supported-by-institutional-players-in-the-months-ahead-coinbase-report\" data-v-f87c67ca=\"\">Coinbase's<\/a> centralized exchange. Quarterly retail trading volume on Coinbase is significantly lower than the levels experienced during the late 2021 bull run — when bitcoin reached its all-time high of over $68,000.","<span data-v-f87c67ca=\"\">Coinbase retail trading volumes by quarter. Image: Coinbase.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$2.08 trillion","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"$22.6 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"1.8%","content":"PERCENT"},{"type":"Ruslan Lienkha","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"2.1%","content":"PERCENT"},{"type":"Lienkha","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"$68,000","content":"MONEY"}],"hashtag":["CRYPTO MOVERS"],"authors":["Brian McGleenon","The Block"]}