{"summary":"A momentary price increase in DAI earlier today led to massive liquidations at DeFi protocol Compound.\nThe protocol liquidated $88.4 million worth of collateral. \nMarket conditions also resulted in $8 million worth of liquidations at dYdX.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/85850\/dai-compound-dydx-liquidations-defi","publishDate":"2020-11-26T09:30:53","id":3596,"type":null,"title":"DAI price increase led to a massive $88 million worth of liquidations at DeFi protocol Compound","category":["DeFi"],"content":["A momentary price increase in the DAI stablecoin earlier today led to massive liquidations at decentralized finance (DeFi) protocol Compound.","The protocol witnessed $88.4 million worth of liquidations, according to on-chain data analyzed by The Block. Data from tracker LoanScan, however, shows the liquidations at $103 million, which isn't accurate. Market conditions also led to liquidations at DeFi protocol dYdX, worth about $8 million, according to both on-chain data and LoanScan. Together, both the protocols liquidated more than $96 million worth of collateral.","How exactly did <a href=\"https:\/\/in.tradingview.com\/symbols\/DAIUSD\/\" data-v-f87c67ca=\"\">DAI's price increase<\/a> lead to the liquidations? Compound allows users to borrow funds, including DAI. In all cases, a borrowed amount should always be lower than the collateral provided. In other words, all loans should be over-collateralized.","In today's case, the liquidations occurred because DAI's price momentarily increased by 30% on Coinbase Pro (source of Compound's price oracle), which led to under-collateralized loans on the protocol. In other words, the increased DAI price also increased the value of DAI borrowed on Compound, as compared to the collateral provided.","To put things in perspective, say, for example, a Compound user initially borrowed 1,000 DAI at $1 DAI, i.e., a total of $1,000. But the DAI price increased to $1.3 during a loan period, so the user's borrowed amount increased to $1,300. But if the user has less than $1,300 in collateral, Compound would consider this loan as under-collateralized and allow any other user to liquidate it.","","","Robert Leshner, founder of Compound, <a href=\"https:\/\/twitter.com\/rleshner\/status\/1332139014334287872\" data-v-f87c67ca=\"\">said<\/a> the liquidations impacted 124 users. \"I sympathize with users who might not have understood the risks, the liquidation mechanism, or the tail risks of a market dislocation, and encourage the community to find ways to mitigate the impact of this event for them,\" he said.","\"There's a vocal discussion in the community about risk, liquidation, and prices. Some see the protocol as having performed flawlessly; aggressively preventing under-collateralized accounts. Others see a system hostile to borrowers, designed poorly by relying on one exchange,\" said Leshner. Hopefully, the community can use this liquidation event as a catalyst to harden the protocol further, debate the trade-offs of aggressive or compassionate (e.g. @MakerDAO) liquidation systems, and add additional safeguards as needed.\"","The event also <a href=\"https:\/\/twitter.com\/ASvanevik\/status\/1331927372417921024\/photo\/2\" data-v-f87c67ca=\"\">ended up affecting<\/a> the so-called yield farmers of Compound's COMP token. Some farmers lost millions of dollars.&nbsp;","It is worth noting that such massive liquidations at Compound have occurred for the first time. In previous cases, the highest single-day liquidations at the protocol have been smaller. In July 2020, for example, Compound witnessed $6.3 million worth of liquidations, according to LoanScan. As for dYdx, it saw liquidations of about $8.6 million in November 2019, according to the tracker.&nbsp;","Previously, other DeFi protocols such as MakerDAO and Aave have also witnessed liquidations due to market conditions. MakerDAO, for instance, liquidated $15 million worth of DAI in March during the Black Thursday event, and Aave liquidated $20 million worth of Chainlink (LINK) tokens in August of this year.","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Update: This story has been updated to include an accurate amount of liquidations at Compound based on on-chain data and more information.<\/em><\/span>"],"hashtag":["DAI"]}