{"summary":"Ukrainian authorities have broken up what they say was a crypto trading desk that funneled money for Russians. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157400\/ukraine-seizes-3-million-in-cash-other-assets-from-crypto-traders-accused-of-funneling-russian-funds","publishDate":"2022-07-13T14:02:49","id":3597,"type":null,"title":"Ukraine seizes $3 million in cash, other assets from crypto traders accused of funneling Russian funds","category":["REGULATION"],"content":["Ukrainian authorities have broken up what they say was a crypto trading desk that illegally funneled money for Russians.&nbsp;","The Ukrainian Prosecutor General's office on July 12 <a href=\"https:\/\/www.gp.gov.ua\/ua\/posts\/prokuratura-peredala-arma-50-mln-grn-830-kg-sribla-ta-neruxomist-grupi-osib-pricetnix-do-maxinacii-na-rinku-kriptovalyut\" data-v-f87c67ca=\"\">announced<\/a> the seizure of over 50 million hryvnia ($1.6 million USD), 830 kilograms of silver, six plots of land and three apartments from the alleged money launderers.","The Prosecutor General's office said the crypto brokers were converting cash and non-cash assets into cryptocurrencies for Russian citizens as well as in the breakaway regions of Luhansk and Donetsk. Those brokers will face criminal proceedings.&nbsp;","The total value of the seized property is worth over $3.3 million, the prosecutors said. They do not mention any crypto assets or wallets seized. Most of the cash is in euros.","At the onset of the Russian invasion of Ukraine on February 24 and as a result of the widespread international sanctions that followed, many in US national security <a href=\"https:\/\/www.theblock.co\/linked\/136637\/us-fincen-russia-crypto-sanctions-alert\" data-v-f87c67ca=\"\">sounded the alarm<\/a> that Russia would use crypto to circumvent sanctions. This has seemingly not been occurring at a scale meaningful for the Russian economy, but the Russian government recently has indicated <a href=\"https:\/\/www.theblock.co\/post\/156560\/russian-lawmaker-proposes-adding-crypto-market-to-moscow-stock-exchange\" data-v-f87c67ca=\"\">heightened interest in crypto<\/a>.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$3.3 million","content":"MONEY"},{"type":"Luhansk","content":"LOCATION"},{"type":"July 12","content":"DATE"},{"type":"$1.6 million","content":"MONEY"},{"type":"February 24","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Russia","content":"LOCATION"},{"type":"Donetsk","content":"LOCATION"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["CRIME","SANCTIONS"],"authors":["Kollen Post","The Block"]}