{"summary":"Estate owner and digital real estate firm Republic Realm is turning an estate it recently acquired into a virtual shopping district. \nThe Metajuku shopping district is modeled after Japanese district Harajuku, which is known for its street fashion. It will house two brands that sell digital clothing items. ","author":["Saniya More","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/109960\/decentraland-estate-that-sold-for-913000-will-become-a-virtual-shopping-district","publishDate":"2021-06-29T08:27:11","id":3598,"type":null,"title":"Republic Realm is building a virtual shopping district in Decentraland","category":["NFTs"],"content":["<span data-v-f87c67ca=\"\">A piece of land in virtual world Decentraland — which was the highest sale yet in dollar value — will be turned into a virtual shopping district.<\/span>","<span data-v-f87c67ca=\"\">New York-based digital real estate firm Republic Realm acquired the estate on June 18 for a <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/108940\/an-estate-in-virtual-world-decentraland-just-sold-for-nearly-a-million-dollars\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">record-breaking<\/span><\/a><span data-v-f87c67ca=\"\"> $913,808 worth of MANA, the game’s Ethereum-based cryptocurrency.<\/span>","<span data-v-f87c67ca=\"\">Decentraland is a virtual reality game that allows users to <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/56656\/decentraland-ethereum-virtual-world-review\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">buy, sell and develop<\/span><\/a><span data-v-f87c67ca=\"\"> virtual land plots. Land, goods, and services come in the form of packages called LAND, which users can purchase with MANA.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The estate comes in the form of a non-fungible token (NFT). These are collectibles that exist on the blockchain and represent different types of digital files, such as audio or video files, or in this case even virtual land.<\/span>","<span data-v-f87c67ca=\"\">Republic Realm is calling the virtual shopping district Metajuku. It’s modeled after Harajuku, a district in Tokyo known for its street fashion. The district takes up 16,000 square feet and will have two main tenants that sell digital-only items: <\/span><a href=\"https:\/\/dressx.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Dress-X<\/span><\/a><span data-v-f87c67ca=\"\"> and <\/span><a href=\"https:\/\/tribute-brand.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Tribute Brand<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Digital wearables are items users can wear in the virtual world and also <a href=\"https:\/\/www.theblockcrypto.com\/post\/109655\/jay-z-puts-a-cryptopunk-nft-as-his-twitter-profile-picture\" data-v-f87c67ca=\"\">display on their social media<\/a>. The products are never actually physically created, but they are sold virtually. These wearables can include clothing, accessories, footwear, as well as customized items.<\/span>","<span data-v-f87c67ca=\"\">According to managing director at Republic Realm Janine Yorio, the pandemic accelerated the trend towards digital socialization that was already underway.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We saw the ways that people in the metaverse were interacting with other things like casino gambling and digital events,” Yorio told The Block. “We knew the next step was figuring out a way for people to do product discovery in the metaverse.”<\/span>","<span data-v-f87c67ca=\"\">“The same way that every consumer products company has a website today, they will all have virtual stores in 3D immersive environments in the future, and those stores will be in the metaverse,\" she added.<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Yorio, younger and newer users are drawn towards experiencing life online in a more 3D, immersive way, citing the rise of e-commerce and the popularity of games like Minecraft.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Yorio said the concept of digital wearables is appealing because according to her, consumerism is no longer just about owning the actual physical item, but being able to share the purchase with others.<\/span>","<span data-v-f87c67ca=\"\">“Not everyone needs the wearables for real life,” she said. “They may not want to buy the item to wear forever, just want to be seen wearing it a few times.”<\/span>","<span data-v-f87c67ca=\"\">Metajuku isn’t Republic Realm’s first real estate purchase on Decentraland. The company owns a plot of land <\/span><a href=\"https:\/\/market.decentraland.org\/contracts\/0x959e104e1a4db6317fa58f8295f586e1a978c297\/tokens\/1868\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">named after itself<\/span><\/a><span data-v-f87c67ca=\"\">, as well as several “parcel” properties. It also owns land in other virtual worlds. But its properties in Decentraland are the most developed, Yorio said.&nbsp;&nbsp;<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Image courtesy of Republic Realm<\/span><\/i>"],"hashtag":["DECENTRALAND","ETHEREUM"]}