{"summary":"On an episode of The Scoop, Fundstrat’s Tom Lee said that markets found some type of structural bottom last week \nBrutal economic data might be priced, which could play into a V-shaped recovery over the next three months\nStill, not everyone is on the same page with Lee","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/60675\/v-shape-recovery-is-likely-fundstrats-tom-lee","publishDate":"2020-04-02T16:12:05","id":3600,"type":null,"title":"V-shaped recovery is likely: Fundstrat&#x27;s Tom Lee","category":["The Block"],"content":["The number of Americans seeking jobless benefits hit an all-time record of 6.64 million, but equity and crypto analyst Tom Lee of research firm Fundstrat said the market might have clocked in a bottom ahead of the brutal economic data.&nbsp;","<span data-v-f87c67ca=\"\">In total, nearly 10 million Americans have applied for unemployment benefits in the two weeks leading up to March 28, a figure that strongly illustrates the impact that the coronavirus-tied shutdown of restaurants, hotels and retail stores is having on the economy.<\/span>","","","<span data-v-f87c67ca=\"\"> The <a href=\"https:\/\/www.nytimes.com\/2020\/03\/30\/business\/coronavirus-retail-furloughs-macys.html\" data-v-f87c67ca=\"\">retail sector<\/a>, one of the most impacted, has seen firms from Macy's to Kohl's furlough tens of thousands of employees, for instance. Meanwhile, investment banks such as Goldman Sachs are sounding the alarms about double-digit percent unemployment.&nbsp;<\/span>","During an interview on The Scoop, Lee said that while the economic data will continue to be brutal, last week’s stock market action indicates a possible bottom for the market. He added further bad data might be priced in if that's the case.&nbsp;","\"Stocks did something really important last week,\" Lee said. \"Equity market has found some stability.\"","The Dow Jones Industrial Average hit a low of 18,591 last Monday and has since picked up 13%. Despite this morning's unemployment data, stocks have rallied slightly, trading up 0.30% since Tuesday's close. Lee said that it is possible a V-shaped recovery is in the works.&nbsp;","\"Stock market bottom before economic data bottoms,\" Lee said. \"It isn't the day jobless claims peak of unemployment peaks.\"","Lee reemphasized his claim today on Twitter, noting, \"Something to keep in mind, in 2001-2003 and 2007-2009 bear market, stocks bottom before PEAK jobless claims.\"","","","On The Scoop, Lee said that it has typically taken markets about three times longer to recover than the time it took to draw down to the bottom. Looking at the past 10 major stock market declines of &gt;30%, the median time to new highs is 2.5x the time of the drawdown, with half of total losses recovered in only .5x the amount of time.","","","If that market truism holds, and March 23 is the true bottom, back of the envelope math suggests a three-month recovery — contingent on total case count peaking in April.","Still, this crisis is unique as it is just as much a health crisis as it is an economic crisis. As such, it is not clear whether the market is more concerned about economic indicators, such as unemployment and jobless claim, or health data, such as cases and mortalities, Lee conceded.","Not everyone is convinced of Lee's thesis, as shown by this handy report by <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2020-04-02\/economists-debate-shape-of-a-global-recovery-after-coronavirus\" data-v-f87c67ca=\"\">Bloomberg<\/a>. Many economists doubt that a V-shaped recovery will play out given the uncertainty around when lock-downs and social distancing rules will be in place.","Chong Hoon Park, head of Korea economic research at Standard Chartered Bank Korea, told Bloomberg he anticipates a more U-shaped recovery.&nbsp;","“I think the Chinese slowdown is going to drag on,” he said. “I’m not that optimistic we’re going to see a V-shaped recovery, with the Chinese recovery unclear.\"","There's also the risk of the virus making a comeback after the initial ongoing spread, which could result in a W shape, according to Bloomberg.&nbsp;","“The key risk to our baseline V forecast is a potential return of the virus in the third quarter,” Keith Wade, chief economist at Schroder Investment Management, told Bloomberg. “In economic terms this would lead to a double-dip recession with businesses closing again as restrictions on movement are re-imposed.”","&nbsp;","<iframe src=\"https:\/\/www.youtube.com\/embed\/fZfojuoxwhQ?start=6\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" data-v-f87c67ca=\"\"><\/iframe>"],"hashtag":[]}