{"summary":"Israel’s Ministry of Defense has ordered the seizure of a laundry list of crypto wallets that it associates with Hamas operatives.\nThe wallets include a number of altcoins, but most receipts came via Tether and Bitcoin.\nMany of the addresses remain unaffiliated with specific individuals. ","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/110725\/israeli-counterterror-authority-seizes-84-crypto-addresses-it-says-belong-to-hamas","publishDate":"2021-07-07T15:28:11","id":3602,"type":null,"title":"Israeli counterterror authority orders seizure of 84 crypto addresses it says belong to Hamas","category":["Bitcoin"],"content":["On July 7, Benjamin Gantz, Israel's minister of defense, signed a <a href=\"https:\/\/nbctf.mod.gov.il\/en\/seizures\/Pages\/Blockchain1.aspx\" data-v-f87c67ca=\"\">seizure order<\/a> for crypto wallets the governed says it linked to Hamas operatives.&nbsp;","The list includes 84 addresses for Bitcoin, Tether, Ether and Dogecoin, among others. The National Bureau for Counter Terror Financing attributes most of these wallets to seven Palestinian nationals it associates with Hamas.","A number of the wallets, however, remain anonymous. Several others are identified only by email addresses <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"3352595c4641515240525e73545e525a5f1d505c5e\">[email&nbsp;protected]<\/a> and <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"562f392338253b393e6466676216313b373f3a7835393b\">[email&nbsp;protected]<\/a>.&nbsp;","Blockchain analytics and forensics firm Elliptic <a href=\"https:\/\/www.elliptic.co\/blog\/hamas-linked-wallets-have-received-7.3-million-in-cryptoassets\" data-v-f87c67ca=\"\">found<\/a> that the sanctioned addresses had received $7.7 million in cryptocurrency, mostly in Tether and Bitcoin. The firm specified that:","Elliptic co-founder Tom Robinson told The Block that, while some of the wallets are self-hosted, \"some of the wallets are still active. A number of them are deposit addresses at exchanges, while others belong to brokers.\" Robinson declined to name the exchanges identified or specify whether Elliptic had worked with the Israeli government on tracing the wallets involved.&nbsp;","To the point of outside ownership, the Ministry of Defense's order says: \"Any individual who claims ownership of any or all of The Property, may make their claims and submit them in writing to the Head of the National Bureau for Counter Terror Financing.\"&nbsp;","Hamas is a militant Islamist political group that controls the Gaza Strip. The European Union, United States, and Israel have all designated Hamas or affiliates (especially its military wing, the Izz ad-Din al-Qassam Brigades) as terrorist organizations.","This is not the first time Hamas has been identified as using crypto to gather donations. An Israeli NGO <a href=\"https:\/\/www.theblockcrypto.com\/linked\/11484\/israeli-ngo-sues-to-take-down-hamas-crypto-donations-page\" data-v-f87c67ca=\"\">looked to stop Hamas' use of Coinbase<\/a> back in 2019. Last August, the U.S. Department of Defense and Department of Justice <a href=\"https:\/\/www.theblockcrypto.com\/post\/74837\/u-s-officials-unveil-wide-ranging-crackdown-on-terrorist-financing-networks-involving-bitcoin-and-ppe-sales?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">unveiled a massive seizure operation<\/a> that hit cryptocurrency wallets owned by Hamas, Al-Qaeda and ISIS.&nbsp;","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Correction:<\/strong> This report and its headline have been corrected. The Israeli government issued a seizure order for the addresses, but the funds have not been seized at this time.<\/em>"],"hashtag":["CRIME"]}