{"summary":"Bitcoin miner CleanSpark announced that it acquired 10,000 more ASICs, leveraging favorable market conditions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168193\/bitcoin-miner-cleanspark-bought-10000-asics-at-a-significantly-discounted-price","publishDate":"2022-09-07T09:03:11","id":3602,"type":null,"title":"Bitcoin miner CleanSpark bought 10,000 ASICs at a &#x27;significantly discounted&#x27; price","category":["THE BLOCK"],"content":["Bitcoin miner CleanSpark bought 10,000 Bitmain Antminer S19j Pro mining machines at a \"significantly discounted\" price of $28 million, adding to over 6,200 rigs it previously acquired from June to August.","The new miners will be delivered between October and early November, the company said on Wednesday.","CleanSpark has been able to leverage declining ASIC spot market prices. It bought the 10,000 miners at around $28 a terahash per second (TH\/s), which is significantly lower than what Bitmain was selling the same model for on its website in January (as much as $116 per TH\/s), the company said.","The $28 million price tag includes credits and discounts stemming from coupons to returning customers offered by Bitmain and the discounted pricing from current market conditions.","\"During the tail end of the bull market last year, we strategically focused on building infrastructure instead of following the then industry trend of pre-ordering equipment months in advance,” said CEO of CleanSpark Zach Bradford. “This strategy positioned us to make purchases of landed rigs at significantly lower prices, thus reducing the time between deploying capital and hashing,<br data-v-f87c67ca=\"\">\naccelerating our return on investment.”","CleanSpark <a href=\"https:\/\/www.theblock.co\/post\/162086\/bitcoin-miner-cleanspark-acquires-site-in-georgia-plans-to-scale-it-to-86-megawatts\" data-v-f87c67ca=\"\">acquired a site in Georgia last month<\/a>&nbsp;along with roughly 3,400 rigs that were already operating in the new Georgia location.&nbsp;","The company now has 37,000 operational bitcoin mining machines, producing as much as 14.9 BTC a day with a total hash rate of 3.8 EH\/s.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"$116","content":"MONEY"},{"type":"$28","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"early November","content":"DATE"},{"type":"Bitmain","content":"PERSON"},{"type":"Georgia","content":"LOCATION"},{"type":"June to August","content":"DATE"},{"type":"$28 million","content":"MONEY"},{"type":"Zach Bradford","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"October","content":"DATE"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}