{"summary":"The viral DeFi project Yam Finance’s YAM token has lost more than 90% of its market capitalization due to a bug \nYam Finance described the flaw in detail, which impacted the rebase logic of its protocol.\nThe bug resulted in a loss of funds worth $750,000.\nYam Finance said it would set up a Gitcoin grant to coordinate a community-funded audit of the YAM contracts to support the launch of YAM 2.0.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/74810\/yam-token-market-cap-collapses-by-more-than-90-flaw","publishDate":"2020-08-13T04:45:18","id":3604,"type":null,"title":"YAM token&#x27;s market cap collapses by more than 90% within minutes as a flaw gets uncovered","category":["DeFi"],"content":["The viral DeFi project Yam Finance's YAM token has lost more than 90% of its market capitalization within a few minutes as a \"potential flaw\" gets uncovered.","\"We are urgently investigating a potential flaw...We strongly advise exiting the Uniswap YAM\/yCRV pool prior to rebase at 8am UTC (35 mins),\" Yam.Finance <a href=\"https:\/\/twitter.com\/YamFinance\/status\/1293811276062380033\" data-v-f87c67ca=\"\">tweeted<\/a> today. yCRV is a basket of yield-generating stablecoins on the Curve protocol.","Within minutes of this tweet, the market capitalization of YAM <a href=\"https:\/\/www.dextools.io\/app\/uniswap\/pair-explorer\/0xc358001a71b3160b4b243d6e8c6f52579f82215e\" data-v-f87c67ca=\"\">plunged<\/a> to just about $19.5 million, from nearly $475 million earlier today. The price of YAM is currently trading at about $0.6 apiece.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nJames Prestwich, founder of blockchain project Summa, <a href=\"https:\/\/twitter.com\/_prestwich\/status\/1293826957335883776?s=20\" data-v-f87c67ca=\"\">said<\/a> there was a \"severe bug\" in the rebase logic of the Yam protocol. \"Specifically, the rebase bug led to the minting of decillions of YAM to the governance vault. This YAM exists and does not vote. This means that no votes can pass, because they can never reach a quorum,\" he explained.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nPrestwich advised users to withdraw Yam funds from Uniswap since governance of the tokens \"CANNOT HAPPEN anymore\" and \"$750,000 in Curve y tokens are locked in the governance,\" meaning these funds are now lost.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBrock Elmore, a creator of the Yam protocol, <a href=\"https:\/\/twitter.com\/brockjelmore\/status\/1293820056682377216\" data-v-f87c67ca=\"\">tweeted:<\/a> \"I'm sorry everyone. i've failed. thank you for the insane support today. i'm sick with grief.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The bug details&nbsp;<\/span><\/strong>","After the publication of this story, the Yam Finance team <a href=\"https:\/\/medium.com\/@yamfinance\/yam-post-rescue-attempt-update-c9c90c05953f\" data-v-f87c67ca=\"\">posted a blog,<\/a> describing the bug in detail. It said: \"At approximately 6PM UTC, on Wed August 12, we discovered a bug in the YAM rebasing contract that would mint far more YAM than intended to sell to the Uniswap YAM\/yCRV pool, sending a large amount of excess YAM to the protocol reserve. Given YAM's governance module, this bug would render it impossible to reach quorum, meaning no governance action would be possible and funds in the treasury would be locked.\"","Yam Finance went on to say that it believed achieving quorum for a bug-fix proposal would allow it to \"save the protocol,\" and \"quickly rallied the community to delegate their votes towards this end.\"","However, \"shortly thereafter, with help from security experts, we concluded that the rebaser bug would interact with the governance module and prevent this proposal from succeeding.\"","As a result, YAM token will now live on as long as Ethereum continues to operate with support for the contract as written, said Yam Finance. \"It can no longer be modified by governance, so on a technical level, it will behave in a similar fashion to other rebasing assets such as AMPL.\"","\"The YAM \/ yCRV Uniswap V2 pool will remain unsafe in perpetuity,\" said Yam Finance, adding that the YAM community managed to get 75% of liquidity out of the pool before the second rebase, and that any remaining liquidity \"should be removed ASAP.\"","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">What next?<\/strong><\/span><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe Yam project became instantly famous after its launch on Tuesday and at one point had surpassed around $600 million in total value locked (TVL. The current TVL is about $371 million, according to <a href=\"https:\/\/yam.zippo.io\/\" data-v-f87c67ca=\"\">Yam.Zippo<\/a>.<br data-v-f87c67ca=\"\">\n","","Similar to <a href=\"https:\/\/www.theblockcrypto.com\/post\/73394\/ampleforths-ampl-token-market-cap-declines\" data-v-f87c67ca=\"\">Ampleforth<\/a> protocol's AMPL token, Yam protocol's YAM token is price elastic, meaning its supply is adjusted based on price movement. When its price is above $1, the token's supply is increased until the desired price equilibrium of $1 is reached. If the price of goes below $1, the supply is decreased until the price parity has been restored. Accordingly, the market capitalization of such tokens fluctuates sharply based on their prices.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe sudden drop in YAM's market capitalization appears to have also affected prices of other tokens that were available to stake within the protocol, including WETH, LINK, YFI, AAVE, SNX, MKR and COMP. The price of ether (ETH) is also down at the time of writing.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAs for what's next for YAM, the project team said in the blog post that they would set up a Gitcoin grant to coordinate a community-funded audit of the YAM contracts. The project was unaudited and barely had a working site at launch. \"If the funding goal is reached, upon the completion of the audit, we plan to support the launch of YAM 2.0 via migration contract from YAM,\" the team concluded.","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Update: This story has been updated to include additional details from Yam Finance<\/em><\/span>"],"hashtag":[]}