{"summary":"Once seen as a sign Big Tech was embracing digital assets, X now appears to be removing the option to turn NFTs into profile pictures.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/271620\/x-appears-to-be-phasing-out-nft-profile-picture-support","publishDate":"2024-01-10T12:01:26","id":3605,"type":null,"title":"X appears to be phasing out NFT profile picture support","category":["NFT BRANDS"],"content":["Almost exactly two years since the social media platform formerly known as Twitter began <a href=\"https:\/\/www.theblock.co\/post\/131052\/twitter-begins-rolling-out-access-to-nft-profile-pictures\" data-v-f87c67ca=\"\">rolling out<\/a> a service that would let people use an NFT as their profile picture, the option now appears to be getting phased out.","Previously, users of X could turn their circular profile picture into a hexagon by linking an NFT they owned. While it appeared on Wednesday that many users still had NFTs for profile pictures, the shape of the display has now been modified back to the standard circle.","The apparent discontinuation of the service was first reported by <a href=\"https:\/\/techcrunch.com\/2024\/01\/10\/x-removes-support-for-nft-profile-pictures\/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAAJiAXaFqABNlFMlnHnAbo7EGggDy2P8QLrpAKfjND_-_giNJ5nYPVUA15TYC6f0RvE-oPObeuaS8J5LkrHskXu6rh9Z2qNkhC0ZsxIvzbScBQaf3AjKSMcsMyHmX76W8H48_YECOV78gWVEtT5rO5KiAleIx741JajBe_gsgKC_D\" data-v-f87c67ca=\"\">TechCrunch<\/a>, which noted that X has removed all mentions of NFT profile pictures from its X Premium support page. After The Block initially tested X's NFT support, and found it to still be functioning on early Wednesday, the service later ceased to work.","Not only did using NFTs as profile pictures provide X users with a way to express their interest in digital assets, the practice also became a kind of flexing of social and economic status as some non-fungible tokens, like CryptoPunks and Bored Apes, have sold for millions of dollars. With the service, only users who could prove ownership of an NFT could transform their profile picture from a circle into a hexagon.&nbsp;","If the service is in fact being sunset it's unclear what the impact might be on the platform. Some of the internet's most vocal advocates of crypto and NFTs are active on X and the integration proved to be for some a legitimization of digital assets and the utility in digital ownership.","\"<span class=\"css-1qaijid r-bcqeeo r-qvutc0 r-poiln3\" data-v-f87c67ca=\"\">Discontinued support for NFT profile pics on X <\/span>is a step back for the industry,\" Kraken co-founder Jesse Powell <a href=\"https:\/\/twitter.com\/jespow\/status\/1745136343796113429?t=8QnOZRXy3nulKMRDfsAxKw&amp;s=19\" data-v-f87c67ca=\"\">posted on the platform<\/a>. \"Reduced utility is always a loss. NFT PFPs weren't widely used, but it was an MVP and never got the treatment it deserved: communities, message signing and features built around proof of ownership.\"","Almost immediately after X rolled out the service in early 2022 Musk <a href=\"https:\/\/www.theblock.co\/linked\/131126\/elon-musk-dunks-on-twitters-integration-with-nfts\" data-v-f87c67ca=\"\">criticized the integration<\/a>. \"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">Twitter is spending engineering resources on this bs while crypto scammers are throwing a spambot block party in every thread,\" he posted at the time.<\/span>","<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">Later that year, Musk completed his acquisition of Twitter and then renamed it X in July 2023.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"early Wednesday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"MVP","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Jesse Powell","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Musk","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"millions of dollars","content":"MONEY"},{"type":"July 2023","content":"DATE"}],"hashtag":["BAYC","CRYPTOPUNKS"],"authors":["RT Watson","The Block"]}