{"summary":"The9 Limited and Blockcap have purchased a total of 36,000 bitcoin miners worth more than $150 million.\nBoth the purchases are for Bitmain’s bitcoin miners. ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/98796\/bitcoin-miners-150-million-the9-blockcap","publishDate":"2021-03-19T08:30:10","id":3605,"type":null,"title":"Bitcoin miners worth more than $150 million have just been bought up by two firms","category":["Mining"],"content":["Bitcoin mining machines continue to be in demand by institutions.","Two more firms — The9 Limited and Blockcap — have now purchased a total of 36,000 bitcoin miners worth more than $150 million from Bitmain.","Specifically, The9 Limited, a Nasdaq-listed Chinese gaming company, <a href=\"https:\/\/www.the9.com\/en\/newsListCon?id=526&amp;index=0\" data-v-f87c67ca=\"\">is buying 24,000 Antminer S19j<\/a> machines via its unit NBTC Limited. The total cost is estimated at around $120 million. One unit of S19j, Bitmain's latest model of bitcoin miner, <a href=\"https:\/\/m.bitmain.com\/\" data-v-f87c67ca=\"\">is priced at about $5,000<\/a>.","North American Blockcap, on the other hand, has purchased 12,000 Antminer S19 machines, according to an announcement shared with The Block exclusively. The total cost of the purchase is estimated at more than $33 million — one S19 costs around $2,800.","This is an additional major purchase by Blockcap, the bitcoin mining firm founded by Core Scientific veteran Darin Feinstein. Last month, the firm <a href=\"https:\/\/www.theblockcrypto.com\/linked\/95124\/blockcap-us-10000-bitcoin-miners\" data-v-f87c67ca=\"\">bought 10,000 S19 miners<\/a> in a bid to double its hashrate.","With the latest purchase, Blockcap's total number of miners to be deployed by Q4 2021 will increase to more than 40,000. And by that time, its hashrate is expected to exceed 3.5 exahash per second (EH\/s), more than three times its current hashrate of 0.95 EH\/s.","Feinstein said Blockcap aims to position the U.S. as a global player in the bitcoin mining space. Currently, China has a major share of around 65% in the space, while the U.S. has a share of about 7%, according to tracker <a href=\"https:\/\/cbeci.org\/mining_map\/\" data-v-f87c67ca=\"\">Cambridge Centre for Alternative Finance<\/a>.","The9 Limited's machines are scheduled to deliver starting from November 2021, and upon the completion of deliveries, the firm is expected to own an additional hash rate of approximately 2,160 petahash per second (PH\/S).","Institutions continue to grab bitcoin miners new and old amid the cryptocurrency's recent price rally. Earlier this week, Chinese firm <a href=\"https:\/\/www.theblockcrypto.com\/linked\/98474\/china-500-dot-com-bitcoin-miner-s9\" data-v-f87c67ca=\"\">500.com bought<\/a> years-old machines, including S9, to scale up its bitcoin mining operations. Publicly-traded bitcoin mining firm Bitfarms also <a href=\"https:\/\/www.theblockcrypto.com\/linked\/96801\/bitcoin-mining-firm-bitfarms-orders-48000-new-machines-expand-hashrate\" data-v-f87c67ca=\"\">recently ordered 48,000<\/a> new machines from MicroBT to expand its hashrate.","To date, more than ten firms have announced bulk pre-orders of bitcoin miners estimated at more than $500 million, <a href=\"https:\/\/www.theblockcrypto.com\/daily\/94836\/500-million-institution-bitcoin-mining\" data-v-f87c67ca=\"\">as The Block reported recently<\/a>."],"hashtag":["BITCOIN"]}