{"summary":"Tipalti has raised a $270 million Series F round led by G Squared, valuing the company at $8.3 billion. \nIt now claims to be the fifteenth most valuable private fintech company. ","author":["Tom Matsuda","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/126770\/b2b-fintech-tipalti-raises-270-million-as-it-prepares-to-go-public","publishDate":"2021-12-08T09:00:29","id":3606,"type":null,"title":"B2B fintech Tipalti raises $270 million as it prepares to go public","category":["Fintech"],"content":["<span data-v-f87c67ca=\"\">Payments firm Tipalti has closed a $270 million round led by G Squared, valuing the company at $8.3 billion. The company said its new valuation places it among the top 15 most highly valued privately owned fintechs in the world.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Tipalti, now just a few billion shy of decacorn status, automates the accounts payable process for mid-size, high-growth companies. It uses a localized cloud tool to address pain points from tax compliance, to supplier onboarding, to currency management.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For its Series F, Tipalti has retained existing investors such as Zeev Ventures and Durable Capital Partners along with attracting new investors such as Marshall Wace and Morgan Stanley’s Counterpoint Global Fund. The company sought those new backers to help realise its IPO ambitions on the New York Stock Exchange.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“So we're not rushing to go public, but we know that this is on the horizon,” says Chen Amit, co-founder and CEO of Tipalti. “We were looking for crossover investors, investors that like to invest just before going public, then invest in the IPO and continue investing after the IPO to have a smooth transition from public to private.”<\/span>","<span data-v-f87c67ca=\"\">The funding will be used to power its upcoming virtual and physical card products and integrations with expenses fintechs such as Expensify and Zenworks. Recently, the company acquired cloud procurement solutions provider Approve.com for an undisclosed amount.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The US-founded company opened a new office in London in October and will expand its headcount in the United Kingdom from 40 to 100 in the next year. Tipalti already has a presence in Canada, Israel and the Netherlands but isn’t currently looking at establishing a headquarters in the APAC region.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I think we need to first get the EU and the UK perfectly right and then when we see that we are on the right track, we can start exploring APAC,” said Amit.&nbsp;<\/span>"],"hashtag":["PAYMENTS"]}