{"summary":"Aptos-based DeFi project Arco Protocol has issued an ultimatum to its community: back it or it will shut down.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/181323\/aptos-defi-project-under-fire-community-confidence-vote","publishDate":"2022-10-31T07:00:03","id":3607,"type":null,"title":"Aptos DeFi project under fire, asks community for confidence vote","category":["DEFI"],"content":["Aptos-based DeFi project Arco Protocol has handed over a decision to its community: back it or let the whole thing shut down.","The project explained that it had come under heavy criticism after its token sale was struck by issues, leading to the loss of key partnerships with exchanges and other protocols. Among all these issues, the project faced accusations that it was a scam and that the team intended to run away with the funds, it <a href=\"https:\/\/twitter.com\/ArcoProtocol\/status\/1586452711314116608\" data-v-f87c67ca=\"\">said<\/a> on Twitter.","As a result, it has put out a Twitter poll asking for support in order to continue. It gave three options: back the project and keep it running; hand over control of the project to the community; or shut the whole thing down and issue a refund.","While the poll still has hours left, nearly half of the 9,000 votes — 48% — are in favor of a refund. This is followed by a third of votes backing the community and a remaining 20% that want it to be decentralized. While this does mean 52% of voters are in favor of the project continuing in some form, it will likely have to go with the most popular vote and shut down.","Arco claimed that \"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">ArcoFamily<\/span>\" was the largest community on Aptos and that it was \"unstoppable.\" Alas, if the vote continues on its current trajectory, that will no longer be the case.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Aptos","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"48%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"Arco Protocol","content":"ORGANIZATION"},{"type":"52%","content":"PERCENT"}],"hashtag":["APTOS"],"authors":["Tim Copeland","The Block"]}