{"summary":"Andreessen Horowitz is launching a crypto startup school\nThe program will kick off in February 2020 and will run for seven weeks \nGuest speakers at the startup school come from Paradigm, Union Square Ventures, Galaxy Digital, Facebook’s Calibra, and others ","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/46326\/a16z-crypto-discloses-details-about-its-startup-school-kicking-off-february-2020","publishDate":"2019-11-08T09:59:37","id":3607,"type":null,"title":"a16z discloses details about its crypto startup school, kicking off February 2020","category":["Cryptocurrency"],"content":["<span data-v-f87c67ca=\"\">Andreessen Horowitz announced on Friday a free seven-week educational program for crypto upstarts, inviting guest speakers from Paradigm, Union Square Ventures, Galaxy Digital, Facebook’s Calibra, and others.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In a company statement, Chris Dixon, a general partner at the venture capital heavyweight, revealed details about the startup school, which he mentioned for the first time at a conference last month. <\/span>","<span data-v-f87c67ca=\"\">According to Dixon, the program is intended to bootstrap entrepreneurs interested in entering the space. Spanning from Feb. to April 2020, the program covers topics such as crypto business models, crypto-economics, fundraising strategies, blockchain computing, and others.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Although participants do not need blockchain knowledge, they are required to have a technical background and be “comfortable learning Solidity,” Ethereum’s programming language. The lectures are given by guest speakers from prominent venture and tech firms, including Morgan Beller, head of strategy at Facebook’s digital wallet subsidiary Calibra, Paradigm research partner Dan Robinson, Scalar Capital co-founder Linda Xie, and others.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Andreessen Horowitz has been one of the most prominent VCs publicly voicing interest in the cryptocurrency space. According to Dixon, the firm has been backing startups such as Coinbase and Ripple since 2013. The firm also has a $350 million fund dedicated to cryptocurrency investment, counting Maker Dao, Libra, Compound as its portfolio companies.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We’ve been involved in crypto\/blockchains for almost seven years now, and as a team, have had the opportunity to learn from world-class entrepreneurs and technologists on topics like product and technology design, organization development, go-to-market strategy, and legal\/regulatory best practices. We think that sharing the most important lessons we’ve learned could accelerate the development of existing projects, and inspire more talented people to join the space,” said Dixon in the statement.&nbsp;<\/span>"],"hashtag":["ANDREESSEN HOROWITZ"]}