{"summary":"Test in Prod has launched OP Erigon, an adapted version of Ethereum’s Erigon client software.\nThe initial release of OP Erigon is accessible on the Optimistic Goerli test network.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/227593\/optimism-client-op-erigon-released","publishDate":"2023-04-21T10:04:55","id":361,"type":null,"title":"OP Erigon released as new client software for Optimism on testnet","category":["Crypto Ecosystems"],"content":["<a href=\"https:\/\/www.theblock.co\/linked\/138285\/ethereum-scaling-startup-optimism-raises-150-million-at-1-65-billion-valuation\" data-v-f87c67ca=\"\">Optimism<\/a> is an Optimistic rollup, a type of Layer 2 scaling solution designed to increase the throughput and efficiency of Ethereum (or other blockchain networks) by performing computations off-chain and only submitting the results to the main chain.","The Optimism architecture is designed to accommodate multiple clients operating on the Layer 2 network as well as other chains, such as Coinbase-backed <a href=\"https:\/\/www.theblock.co\/post\/214183\/coinbase-unveils-layer-2-network-and-developer-fund\" data-v-f87c67ca=\"\">Base<\/a>, within the Optimism ecosystem. Optimism contributors emphasize that client diversity can help improve the network's overall resilience.","The network's software architecture, known as the OP Stack, allows the network to split into a consensus layer, responsible for achieving consensus, and an execution layer, designated for smart contracts, similar to the Ethereum mainnet. This modular approach to software design allows for a more adaptable network infrastructure for developers involved in the ecosystem.","\"A fork of the L1 execution client Erigon, OP Erigon will strengthen network resilience, contribute to the decentralization of the OP Stack, and foster developer creativity and experimentation,\" OP Labs, Optimism's core developer, <a href=\"https:\/\/twitter.com\/OPLabsPBC\/status\/1649155125120843777\" data-v-f87c67ca=\"\">noted<\/a> in a tweet.","The initial release of OP Erigon can now be accessed on the Optimistic Goerli testnet.&nbsp;"],"hashtag":["OPTIMISM"]}