{"summary":"Sushiswap has voted and will reduce the total compensation for its new chief executive position.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/166078\/sushiswap-reduces-proposed-salary-for-its-head-chef-role-after-community-pushback","publishDate":"2022-08-26T18:40:15","id":3612,"type":null,"title":"SushiSwap reduces proposed salary for its &#x27;Head Chef&#x27; role after community pushback","category":["DEFI"],"content":["SushiSwap, a decentralized crypto exchange, has passed a vote to reduce the salary of its new CEO hire.","The proposal will reduce the base salary from 800,000 to 500,000 USDC and the total amount of SUSHI allocated to its bonus incentives.","The community will also revote on who will be hired as the Head Chef.","Decentralized crypto exchange SushiSwap’s governance community has voted to reduce the compensation for its chief executive position – or \"Head Chef,\" in its parlance.","In SushiSwap’s <a href=\"https:\/\/www.theblock.co\/post\/159818\/sushiswap-team-nominate-a-new-potential-head-chef\" data-v-f87c67ca=\"\">initial proposal,<\/a> the compensation for the Head Chef role was 800,000 USDC in base salary and 600,000 vested SUSHI tokens, among additional incentives.","The initial proposal and bonus incentives faced significant pushback from the community. This concern was made clear in the first line of the new proposal. \"The community has expressed concerns around incorporating both the compensation and the candidate together into one proposal,\" the text of the newer <a href=\"https:\/\/forum.sushi.com\/t\/head-chef-compensation-and-candidate-separation\/11016\" data-v-f87c67ca=\"\">proposal<\/a>, shared by community lead Tangle, states.&nbsp;","This separation would give the community more flexibility to align on the compensation without having to vote against the broader plan.","The incentives initially included price target incentives for the new hire, which, if maintained over a one-year period, would exceed over $10 million.","The new incentive structure passed today will reduce the base salary to 500,000 USDC. It also will reduce the total amount of SUSHI tokens for the incentive structure from 1.2 million to 1 million tokens.","A vote that would maintain the current price target ranges was the biggest point of contention but passed with a 53% to 47% split among the 40 voters.","In addition, the community will also revote on the previously confirmed new hire to ensure community alignment on the proposal.","Jon Howard, who was proposed as the new Head Chef in the initial proposal, won that previous vote. Now, SushiSwap will hold another poll to vote on Jon Howard’s appointment to the Head Chef role, potentially alongside other candidates.","SushiSwap’s search for a new leader followed the departure of former Head Chef Maki in September 2021. The exchange holds roughly $661 million in total locked value as of press time, according to <a href=\"https:\/\/defillama.com\/protocol\/sushiswap\" data-v-f87c67ca=\"\">DeFiLlama.<\/a>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DeFiLlama","content":"ORGANIZATION"},{"type":"Head Chef","content":"ORGANIZATION"},{"type":"1 million","content":"MONEY"},{"type":"Jon Howard’s","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"September 2021","content":"DATE"},{"type":"53%","content":"PERCENT"},{"type":"$661 million","content":"MONEY"},{"type":"Head Chef Maki","content":"ORGANIZATION"},{"type":"47%","content":"PERCENT"},{"type":"$10 million","content":"MONEY"},{"type":"Jon Howard","content":"PERSON"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}