{"summary":"The Digital Commodities Exchange Act has returned to Congress as a draft, with the member of Congress behind it hoping to solicit comment from industry stakeholders. \nBroadly, the DCEA would establish a voluntary regulatory regime for crypto exchanges under the auspices of the CFTC.\nA federal regulatory regime for crypto has become a subject of great interest in Congress, but lawmakers across the aisle seem to want something with more teeth. ","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/124547\/blueprint-for-cftc-regime-over-crypto-exchanges-enters-congress","publishDate":"2021-11-16T16:27:40","id":3615,"type":null,"title":"Blueprint for CFTC regime over crypto exchanges enters Congress","category":["Congress"],"content":["<span data-v-f87c67ca=\"\">Congressman Glenn Thompson has <\/span><a href=\"https:\/\/republicans-agriculture.house.gov\/uploadedfiles\/deca_discussion_draft_-_november_2021.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">released<\/span><\/a><span data-v-f87c67ca=\"\"> the Digital Commodities Exchange Act to the public.<\/span>","<span data-v-f87c67ca=\"\">Rather than introducing his bill on the floor, Thompson preferred to open a draft up to public comment, he told The Block in an interview.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“If I'd operated in a typical Congressional way, we would have dropped it and done a press release. But I want to make sure we get what's best,” said Thompson, the leading Republican on the House Agriculture Committee.<\/span>","<span data-v-f87c67ca=\"\">The draft bill would establish a new regulatory regime for cryptocurrency exchanges at the Commodity Futures Trading Commission. Currently, spot markets have no federal regulator in the U.S., though that is a contentious subject.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Gary Gensler, chairman of the Securities and Exchange Commission, has argued that custodial <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/114222\/gensler-asks-sen-warren-for-more-sec-authority-to-regulate-crypto-exchanges\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">crypto exchanges already fall under existing securities laws<\/span><\/a><span data-v-f87c67ca=\"\">, making them subject to securities exchange regulation — which features more stringent rules than CFTC oversight. Rostin Behnam, President Biden’s pick to lead the CFTC, has publicly indicated the desire for the CFTC to keep and even expand those authorities.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">However, the CFTC does not generally have a regulatory regime — with expectations for executions and reporting — for spot commodities markets. In spot markets, it is typically limited to enforcement against fraud and manipulation.<\/span>","<span data-v-f87c67ca=\"\">Central to the current version of the Digital Commodities Exchange Act is both its creation of a spot regime for crypto spot markets and its delegation of the lion’s share of those authorities to the CFTC:&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Per the bill, such a regime would be voluntary, but it would supersede state-by-state licensing. However, it does not expand the CFTC’s existing powers to pursue exchanges that serve U.S. customers.<\/span>","<span data-v-f87c67ca=\"\">“There are some initial offerings that certainly would be considered securities, and those are those are best left with the SEC,” Thompson told The Block. “But once those cryptocurrency are issued, the way they function, they are commodities and commodities are regulated in a very principle-based, effective way with the CFTC.”<\/span>","<span data-v-f87c67ca=\"\">However, the CFTC has not changed the types of services under its regulatory purview since the 2010 Dodd-Frank Act added <\/span><a href=\"https:\/\/www.cftc.gov\/IndustryOversight\/TradingOrganizations\/index.htm#:~:text=Designated%20contract%20markets%20(DCMs)%20are,of%20traders%2C%20including%20retail%20customers\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Swap Execution Facilities<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Thompson inherited a fair bit of the bill from his predecessor on the House Agriculture Committee, Mike Conaway, who <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/78723\/cftc-crypto-exchanges-congress-bill\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">introduced similar legislation<\/span><\/a><span data-v-f87c67ca=\"\"> at the end of 2020 — shortly before his own retirement from Congress to open a lobbying firm.<\/span>","<span data-v-f87c67ca=\"\">The new version does away with some of the ways with which the original looked to provide more financing for the CFTC’s regime. But the biggest change is the addition of an extensive section relating to stablecoin operators, which it refers to as “fixed-value digital commodity operators.”<\/span>","<span data-v-f87c67ca=\"\">A <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/122890\/us-treasury-releases-long-awaited-report-on-stablecoin-risk-features-request-for-new-laws\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">new report from the President’s Working Group<\/span><\/a><span data-v-f87c67ca=\"\">, led by the Treasury, called for quick congressional action to regulate stablecoins.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The regime for “fixed-value digital commodity operators” in the draft legislation seems to address a number of the common concerns for stablecoin issuers, especially the redemption of backing assets and information disclosures. <\/span>","<span data-v-f87c67ca=\"\">But, like the regime for exchanges, the regime for stablecoin operators would remain voluntary, with no punishment for failure to register. <\/span>"],"hashtag":["CFTC","CONGRESS","HOUSE AGRICULTURE COMMITTEE","SEC"]}