{"summary":"Paradigm is backing the work of Bitcoin Core developer Anthony Towns\nThe crypto investment firm joins the list of firms that provide grants to developers ","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/71452\/crypto-hedge-fund-paradigm-is-now-sponsoring-a-bitcoin-core-developer","publishDate":"2020-07-13T16:59:59","id":3616,"type":null,"title":"Crypto investment firm Paradigm is now sponsoring a Bitcoin Core developer","category":["The Block"],"content":["Crypto investment firm Paradigm is joining the list of digital asset companies that fund bitcoin development with a grant for Australian bitcoin core developer Anthony Towns.","The California-based crypto investment firm is known for backing the likes of Tagomi, Argent, and Uniswap. Co-founder Matt Huang told The Block its move to fund bitcoin development reflects the firm's view that bitcoin is \"the most important cryptocurrency\" and that Paradigm has a responsibility to support its improvement.&nbsp;","Firms like Square Crypto, OKCoin, and BitMEX have backed bitcoin developers in the past, with the latter two firms most recently <a href=\"https:\/\/cointelegraph.com\/news\/bitmex-parent-company-collaborates-with-okcoin-in-150-000-bitcoin-grant\" data-v-f87c67ca=\"\">partnering<\/a> to grant $150,000 to Bitcoin Core developer Amirit Uttarwar. Huang declined to share exactly how much Paradigm will pay Towns, whose work was previously financed by Xapo. Still, he described the grant as equivalent to an engineer's full salary. Towns has actively contributed to open-source development for more than two decades, contributing to bitcoin since 2017. He has worked on previous upgrades to the network such as Schnorr and Taproot.&nbsp;","\"Paradigm will be paying his salary, but he will have complete freedom to choose what he works on in terms of bitcoin open-source,\" Huang said in a phone interview with The Block.&nbsp;","The former Sequoia Capital partner said the grant is one way to give back to the bitcoin community but also brings Paradigm \"closer to the metal.\" The tie-up is unique to the crypto world inasmuch as Paradigm is an investment firm, rather than an exchange like BitMEX or a development company like Blockstream. The terms of the grant will require Towns to help in the due diligence of new opportunities in and around the bitcoin ecosystem, such as second-layer applications.&nbsp;","\"A second-order element of this is the fact that having him close to the firm will expose us to interesting opportunities,\" he said.&nbsp;\"Still, we are far-seeing enough to know that anything we could benefit from in the short term may not be aligned with what is beneficial in the long-run and so we won't have a role in directing what Towns does.\""],"hashtag":["PARADIGM"]}