{"summary":"Following in the footsteps of ConstitutionDAO, a DAO is raising funds to try to help free Julian Assange.\nSo far the DAO has raised $4 million but funds keep flowing in.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/132991\/a-dao-trying-to-free-julian-assange-has-raised-4-million-and-counting","publishDate":"2022-02-04T08:04:39","id":3617,"type":null,"title":"A DAO trying to free Julian Assange has raised $4 million and counting","category":["Governance"],"content":["A newly formed decentralized autonomous organization (DAO) called AssangeDAO, formed by \"a collective of cypherpunks,\" is raising funds to be used to fight for the freedom of WikiLeaks founder Julian Assange.","The DAO is currently raising funds to bid on an <a href=\"https:\/\/twitter.com\/muratpak\/status\/1487725541352484868\" data-v-f87c67ca=\"\">NFT by digital artist Pak<\/a> that was created in collaboration with Assange himself. Similar to <a href=\"https:\/\/www.theblockcrypto.com\/linked\/125269\/constitutiondao-is-coming-to-an-end\" data-v-f87c67ca=\"\">ConstitutionDAO<\/a>, anyone can donate to the pot of funds and contributors receive a proportionate amount of its governance token JUSTICE in response. And it’s certainly catching hold; so far AssangeDAO <a href=\"https:\/\/juicebox.money\/#\/p\/assangedao\" data-v-f87c67ca=\"\">has raised<\/a> 1,441 ether (worth $4 million).","\"This is a powerful movement showing we can organize in the cloud and make a difference on land,” a core contributor of AssangeDAO who goes by Crypto McKenna on Twitter told The Block. McKenna is a smart contract developer and a DeFi advisor, they said.","\"We are showing the power of leveraging permissionless, censorship-resistant digital currencies and zero-knowledge proof cryptography for retaining anonymity. We are working hard to ensure the DAO fulfills its mission,” said McKenna.","AssangeDAO <a href=\"https:\/\/assangedao.substack.com\/p\/assangedao-and-pak-nft-auction\" data-v-f87c67ca=\"\">was formed<\/a> on Thursday by ten core contributors, including McKenna. The other contributors include Assange’s brother Gabriel Shipton, his fiance Stella Morris, and Bitcoin core developer Amir Taaki.","“AssangeDAO is a line in the sand where DeFi takes a strategic step towards post-corporate democratic wealth,” Taaki told The Block. \"Cypherpunks around the world have heard Assange's call, and have rallied to stand in defense of the original cypherpunk.\"","Assange’s NFT, created by Pak, is going on auction on February 7. The NFT project is dubbed Censored and it will consist of two parts: a dynamic 1\/1 and a dynamic open edition.&nbsp;","McKenna said the NFT will be auctioned on a custom platform that Pak and Assange’s brother Shipton have arranged. “It has forked the contracts of Manifold,” they said, adding that more details about the auction will be announced via Pak's official Twitter account.&nbsp;","If AssangeDAO wins the bid for the NFT, the NFT will be held by the DAO, and its contributors will be given the DAO's governance token, JUSTICE, in proportion to their ETH contributions. Contributors will then decide via governance voting what to do with the NFT and the future roadmap of the DAO. McKenna said there was no initial target for the raise.","If the DAO loses the bid, the ETH contributed by people will then be redeemable via a multi-sig wallet. There are currently five people on the multi-sig wallet: McKenna, Taaki, Rachel Rose O'Leary, a former CoinDesk journalist and now co-founder and developer of DarkFi, Silke Noa Elrifai, chief legal officer at Gnosis, and \"Fiskantes\" of Zee Prime Capital.","Assange was arrested in 2019 in London and faces potential extradition to the US. Proceeds raised from the NFT sale will go toward Assange's legal fees.","\"Assange has spent 1,000 days in Belmarsh prison — the UK's equivalent of Guantanamo — where the hardest criminals and terrorists are detained,\" said Taaki. \"He suffers major health-related issues and stress, having recently had a stroke while awaiting trial.\"","AssangeDAO follows in the footsteps of ConstitutionDAO, a movement that almost managed to secure an early rare copy of the US Constitution. It was bested in the auction by Citadel CEO Kenneth Griffin. After the failed auction, owners of its governance token were able to redeem their tokens for the original amount of ETH paid —&nbsp;but the token ended up trading at much higher value on secondary markets.&nbsp;","Another DAO looking to achieve a similar goal is the FreeRossDAO, which raised funds in an attempt to free Ross Ulbricht, the founder of the Silk Road online marketplace. It raised over $12.5 million in ETH at the time to bid on a collection of Ulbricht’s artwork as a single NFT. The DAO won the auction and bought the NFT for over $6 million in ETH at the time. Other bidders included ​​the person who owns CryptoPunk 6529 (who<a href=\"https:\/\/twitter.com\/punk6529\" data-v-f87c67ca=\"\"> operates pseudonymously<\/a> under the Punk’s identity) and Kraken CEO Jesse Powell."],"hashtag":["DAOS"]}