{"summary":"DeFi liquidity aggregator Orion Protocol has raised $3.45 million in dynamic coin offering or DYCO\nDYCOs allow investors to claim refunds if projects fail to deliver\nOrion Protocol is being led by Alexey Koloskov, former chief architect and creator of decentralized exchange protocol Waves","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/72386\/defi-project-orion-protocol-raises-3-45-million-in-dynamic-coin-offering","publishDate":"2020-07-21T09:05:29","id":3619,"type":null,"title":"DeFi project Orion Protocol raises $3.45 million in &#x27;dynamic coin offering&#x27;","category":["ICO and IEO"],"content":["If initial coin offerings (ICOs) and initial exchange offerings (IEOs) weren't enough, the crypto world now has so-called \"dynamic coin offerings\" or \"DYCOs.\"","Decentralized finance (DeFi) project Orion Protocol has raised $3.45 million in DYCO, a fundraising method in which investors can claim a refund if projects fail to deliver or miss milestones.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAs for Orion Protocol, it guarantees up to 80% refunds to investors holding its native ORN tokens. \"The refund process starts at month 9 through month 16 and is USD backed throughout this process,\" Timothea Horwell, chief marketing officer at Orion Protocol, told The Block.","Founded in 2018, Orion Protocol is a DeFi liquidity aggregator. It offers a trading solution called Orion Terminal (currently in beta), which aggregates the crypto market's liquidity on a decentralized platform built on the Elrond blockchain network.","\"Pulling from every major centralized exchange, decentralized exchange, and swapping pool, Orion Terminal aggregates the liquidity, order book depth, and trade pairs of every digital asset market into one decentralized platform,\" Horwell told The Block.","The terminal would publicly launch in Q4, said Horwell, adding that some other planned products include lending, a price oracle, and a \"high-margin\" decentralized exchange. Orion Protocol is being led by <a href=\"https:\/\/ru.linkedin.com\/in\/alexey-koloskov\" data-v-f87c67ca=\"\">Alexey Koloskov<\/a>, former chief architect and creator of decentralized exchange protocol Waves.","Until now, the project had been operating with its own seed funds of about $300,000. The DYCO was \"oversubscribed by 300%,\" said the firm. The offering <a href=\"https:\/\/daomaker.com\/dyco\" data-v-f87c67ca=\"\">was conducted via<\/a> blockchain consulting agency DAO Maker.","Hassan \"Hatu\" Sheikh, CMO and COO at DAO Maker, <a href=\"https:\/\/medium.com\/daomaker\/dyco-buyback-system-explained-4b5b0da68a3f\" data-v-f87c67ca=\"\">said<\/a> DYCOs give projects \"enough time to prove the viability of their product and the product\/market fit.\"","\"If [token] holders believe [project] teams have done well in the first 9 months, they won’t claim a buyback and teams will be able to access some of the funds that had been set aside for buyback,\" said Sheikh, adding: \"If the holders are impressed with the performance (as in the token is doing really well), no buybacks will take place in any round and the team will be able to access even more funds to continue their work.\"","Orion essentially calls itself \"decentralized brokerage.\" Its ORN token is <a href=\"https:\/\/bitmaxhelp.zendesk.com\/hc\/en-us\/articles\/360051765413-Orion-Protocol-ORN-\" data-v-f87c67ca=\"\">listed<\/a> on Bitmax exchange and is <a href=\"https:\/\/www.coingecko.com\/en\/coins\/orion-protocol\" data-v-f87c67ca=\"\">currently priced<\/a> at $2.43 apiece, per CoinGecko.&nbsp;"],"hashtag":[]}