{"summary":"Eden Network has raised $17.4 million in a seed funding round. \nThe network plans to strengthen its infrastructure and grow its adoption further.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/116935\/eden-network-priority-transaction-ethereum-funding-token-sale","publishDate":"2021-09-08T10:00:13","id":3620,"type":null,"title":"Eden, priority transaction network for Ethereum, raises $17.4 million","category":["Venture Capital"],"content":["Eden Network, a priority transaction network for Ethereum that provides protection against miner extractable value (MEV) and arbitrary transaction reordering, has raised $17.4 million in a seed funding round.","The round was secured via selling EDEN tokens, Caleb Sheridan, a core developer of Eden Network, told The Block. Multicoin Capital led the round, with Jump Capital, Alameda Research, Wintermute, GSR, and DeFiance Capital also participating.","Angel investors, including Andre Cronje, founder of Yearn Finance, and Joshua Lim, head of derivatives at Genesis Capital, also backed the round.","The fresh capital injection will help Eden Network strengthen its infrastructure through research and development and further grow its adoption, said Sheridan. To that end, the project is also looking to triple its current team of 10 by hiring mostly engineers, he said.","Eden Network went live last month <a href=\"https:\/\/www.theblockcrypto.com\/post\/113595\/ethereums-london-hard-fork-what-it-is-and-why-it-matters\" data-v-f87c67ca=\"\">with Ethereum's London upgrade<\/a>. Since it is a transaction priority network for Ethereum, Eden helps users prioritize their transactions on the blockchain while providing protection against practices such as MEV or frontrunning. <a href=\"https:\/\/www.theblockcrypto.com\/daily\/111790\/will-ethereum-miners-become-time-bandits-and-reorganize-the-blockchain\" data-v-f87c67ca=\"\">As The Block reported recently, MEV refers to<\/a> certain kinds of profit-generating opportunities that miners could have by frontrunning their transactions, because they are the ones who choose the order of transactions in a block.","Sheridan said users who stake EDEN tokens get priority in Eden blocks with protection from MEV, improved trade privacy, and better price execution. Eden Network says it already <a href=\"https:\/\/app.edennetwork.io\/fountain\" data-v-f87c67ca=\"\">represents more than 50% of the Ethereum hashrate<\/a>, meaning more Eden blocks are now being produced on Ethereum than non-Eden blocks. But some market participants <a href=\"https:\/\/twitter.com\/bertcmiller\/status\/1435686485001449473?s=20\" data-v-f87c67ca=\"\">say<\/a> Eden's claims aren't publicly verifiable. Sheridan said Eden is working on a public dashboard to make this information public and available for \"deeper review.\"","Eden Network provides an additional revenue stream to Eden block producers or miners in the form of EDEN tokens, said Sheridan. Miners that are currently utilizing the Eden Network <a href=\"https:\/\/explorer.edennetwork.io\/\" data-v-f87c67ca=\"\">include<\/a> F2Pool, SparkPool, Nanopool, and 2Miners.","Eden Network rents prioritized block space in Eden blocks to so-called \"Slot Tenants.\" That means projects looking to become tenants have to participate in a slot auction where the highest EDEN staker wins. In return, the winning projects or tenants get access to Eden Network for processing their trades with protection from MEV or frontrunning.&nbsp;","Eden Network is a project initiated by the <a href=\"https:\/\/edennetwork.io\/EDEN_Network___Whitepaper___2021_07.pdf\" data-v-f87c67ca=\"\">Archer DAO<\/a> team. Sheridan said Archer DAO raised $1 million last year via an ARCH token sale. The EDEN token now represents a technical upgrade on the ARCH token, and ARCH holders are eligible to upgrade 1:1, he said.","<em data-v-f87c67ca=\"\">Update (Sep. 9): This story has been updated with additional information in the fourth last paragraph.<\/em>"],"hashtag":["ETHEREUM","MEV"]}