{"summary":"Swiss crypto bank SEBA has raised $120 million in a Series C funding round.\nSEBA plans to expand internationally and is also exploring providing NFT services, the bank’s CEO Guido Buehler told The Block.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/130055\/crypto-bank-seba-raises-120-million-series-c-funding","publishDate":"2022-01-12T08:00:18","id":3621,"type":null,"title":"Crypto bank SEBA raises $120 million in Series C funding","category":["Venture Capital"],"content":["SEBA — the Switzerland-based regulated crypto bank founded by former UBS employees — has raised 110 million Swiss francs (around $120 million) in a Series C funding round.","The round was co-led by a consortium of three investment firms — Altive, Ordway Selections, and Summer Capital — and DeFi Technologies. Alameda Research and SEBA's existing investor Julius Baer, a Swiss private bank, also participated in the round, among other investors.","The fresh capital will help SEBA expand internationally, increase its headcount and launch new products and services, the bank's CEO Guido Buehler told The Block in an interview. Buehler was formerly the head of asset servicing at UBS Wealth Management and founded SEBA in 2017 with Andreas Amschwand, former global head of foreign exchange at UBS, who left SEBA as its chairman in 2020.","SEBA is currently present in over 25 markets, and it is looking to expand in the UAE, Hong Kong, and Singapore. As for headcount expansion plans, Buehler said the bank looks to double its current team size of over 100 in the next 12 to 18 months.","SEBA is an institutional-focused crypto bank providing services such as custody, trading, lending, and investment management. Buehler said the bank is also exploring opportunities in the NFT market, such as lending and custody services, and the DeFi market, such as providing access to permissioned pools.","Earlier this month, SEBA was <a href=\"https:\/\/www.theblockcrypto.com\/post\/129277\/aave-arc-permissioned-defi-platform-fireblocks-first-whitelister\" data-v-f87c67ca=\"\">whitelisted<\/a> by Fireblocks to participate in Aave's permissioned protocol Arc. Now the bank is looking to be a <a href=\"https:\/\/governance.aave.com\/t\/arc-adding-seba-bank-as-a-whitelister-to-aave-arc\/6661\" data-v-f87c67ca=\"\">whitelister<\/a> of Aave Arc to onboard its customers.","Buehler said SEBA's business has grown significantly over the past year, with an almost tenfold increase in revenue and three times growth in client base. He declined to share absolute numbers but said the bank isn't profitable yet.","Buehler also declined to share SEBA's valuation. Last week, SEBA rival Sygnum <a href=\"https:\/\/www.theblockcrypto.com\/post\/129363\/crypto-bank-sygnum-raises-90-million-series-b-now-valued-800-million\" data-v-f87c67ca=\"\">raised<\/a> $90 million in a Series B funding round at a post-money valuation of $800 million.","The Series C round brings SEBA's total funding to date to around $295 million, said Buehler, adding that the round was oversubscribed by almost 100%."],"hashtag":["CRYPTO BANKS AND LENDERS"]}