{"summary":"Central banks should prepare for how stablecoins and CBDCs will change their balance sheets, argues the Bank of England&#x27;s Andrew Hauser.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/150181\/bank-of-england-exec-says-digital-currencies-could-be-important-for-central-bank-balance-sheets","publishDate":"2022-06-05T02:02:22","id":3623,"type":null,"title":"Why digital currencies could be &#x27;big deal&#x27; for central bank balance sheets ","category":["CENTRAL BANKS"],"content":["A combination of “systemic” central bank digital currencies and stablecoins could significantly alter central banks’ delivery and control of monetary policy and the size and composition of their assets and liabilities.&nbsp;","That’s according to Andrew Hauser, executive director for markets at the Bank of England. Hauser made the argument as part of a speech he delivered at the Federal Reserve Bank of New York on Wednesday.","The size of the effects will “depend heavily on the eventual design of any systemic digital currencies,” Hauser said. He also specified that digital currencies don’t present any “redline” risks for central bank balance sheets. Nonetheless, he argued that central bankers should start preparing for the “important implications” that central bank digital currencies (CBDCs) and stablecoins will have for their balance sheets by building responses to them into their operational toolkits.","Central banks — as the sole issuer of fiat currency — typically control the money supply of a national economy using three main devices: modifying interest rates, regulating commercial banks (by setting capital and reserve requirements), and acting as a lender of last resort. Money issued is considered a balance sheet liability, which can be bought back or sold to commercial banks as needed.&nbsp;","Hauser outlined how CBDCs and other digital currencies could upset this system by modifying the privileged relationship between central and commercial banks. Under certain conditions, digital currencies could increase competition for credit, reduce the sum of deposits sitting in commercial banks (and thus reserve rates), and challenge the central banks' ability to serve as the lender of last resort.&nbsp;&nbsp;","Set in the shadow of the TerraUSD stablecoin collapse, Hauser’s speech pointed to the way such systems might be regulated. He specified that in the UK the Bank of England is recommending that any stablecoin reaching systemic size — defined as one with the potential to scale rapidly and become widely used for payments — would need to meet the standards expected from a commercial bank, including rigorous central bank supervision, robust legal claims and transparency about the assets being used to back its currency.","This implies that stablecoins, even if they were operated by private companies, would be forced to fit within the monetary system governed by central banks, thus operating as a de facto form of state-backed liability.","If adopted, CBDCs would be the first new liability used by central banks for centuries. “The dog may be old,” Hauser said, “but it can still perform new tricks!”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve Bank of New York","content":"ORGANIZATION"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"Hauser","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Andrew Hauser","content":"PERSON"}],"hashtag":[],"authors":["Sam Venis","The Block"]}