{"summary":"Disclaimer: This post is provided for educational purposes only. It is not legal advice.  It is my opinion only and isn&#x27;t authorized by any past, present,","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/3930\/judgment-proof-bitcoin-not-in-new-york","publishDate":"2018-11-23T15:05:41","id":3624,"type":null,"title":"Judgment proof bitcoin? Not in New York","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: This post is provided for educational purposes only. It is not legal advice. &nbsp;It is my opinion only and isn't authorized by any past, present, or future client or employer. Also I might change my mind. I contain multitudes.<\/em>","Two weeks ago, <a href=\"https:\/\/www.theblockcrypto.com\/2018\/11\/09\/winklevoss-lawsuit-against-charlie-shrem-peeled-out-in-top-gear-but-now-may-be-stuck-in-neutral\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">we reported<\/a> on a setback for the Winkelvoss brothers in their lawsuit against Charlie Shrem. Recapping: They claim that he misappropriated $61,000 that he promised to use to buy 5,000 in 2012. In a lawsuit filed six years later, they've asked a court to require Shrem to transfer that bitcoin to them.","The lawsuit started out in high gear -- Winkelvoss convinced a judge to freeze Shrem's assets using the remedy of prejudgment attachment -- before Shrem was even aware he had been sued! This is a rare remedy and things didn't look great for the defendant. But the Order was reversed in a summary ruling from the Court, which means that no explanation was provided at the time. We now have a copy of the <a href=\"https:\/\/www.scribd.com\/document\/393961860\/shrem\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Court's order<\/a>, so can explain the Court's reasons for reversing this order.","[related id=1]First, plaintiff had pointed to Shrem's failure to pay the government monies he owed arising out his prior (unrelated) criminal conviction as showing an intent to evade creditors. But Shrem argued that in fact the Government hadn't yet set a schedule for repayment. The Court said that given this fact, no such intent could be implied.","Second, plaintiff also argued that the fact Shrem couldn't account for all of plaintiff's money also showed an attempt to evade creditors. The court rejected this circular argument and said that \"Plaintiff's imputations that fraudulent activity and intent explain defendant's financial success following his release from prison, his decision to move to Florida, and his decision to continue investing in cryptocurrency (as he has always done) are, at most, 'allegations raising a suspicion of intent to defraud.'\"","Third, plaintiff argued that \"Defendant's assets 'are largely beyond grasp,''as they are in cryptocurrency investments or in a primary residence in Florida, which may be judgment-proof.\" This didn't convince the Court either. Interestingly, the Court observes the fact Shrem invests some of his assets in cryptocurrency \"does not make them judgment proof.\" While there's no explanation for the Court's reasoning here, certainly the contempt power would be one remedy available to the Court in a post-judgment collection proceeding, and the Court is well aware of that fact.","In short, prejudgment interest is a severe remedy. Winklevoss made good enough arguments to get a court to enter an <em data-v-f87c67ca=\"\">ex parte<\/em> attachment order. But when faced with a credible response, the Court reversed course, and took the remedy away from the Plaintiff. The fact that some of Shrem's assets are controlled by private keys only known to him didn't, in the end, persuade the Court.","<i data-v-f87c67ca=\"\">Stephen D. Palley is a trial lawyer based in Washington, D.C. with whose practice focuses in part on cryptocurrency and blockchain<\/i><em data-v-f87c67ca=\"\">. His \"Crypto Caselaw Minute\" is re-published weekly on The Block. Palley can be found on <a href=\"https:\/\/www.linkedin.com\/in\/stephendpalley\/\" data-v-f87c67ca=\"\">LinkedIn<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Twitter<\/a>.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Court","content":"ORGANIZATION"},{"type":"the Court","content":"ORGANIZATION"},{"type":"Florida","content":"LOCATION"},{"type":"six years later","content":"DATE"},{"type":"2012","content":"DATE"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Shrem","content":"PERSON"},{"type":"Stephen D. Palley","content":"PERSON"},{"type":"Twitter","content":"DATE"},{"type":"$61,000","content":"MONEY"},{"type":"Government","content":"ORGANIZATION"},{"type":"the <a href=\"https:\/\/www.scribd.com\/document\/393961860\/shrem\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Court","content":"ORGANIZATION"},{"type":"Crypto Caselaw Minute\"","content":"ORGANIZATION"},{"type":"Charlie Shrem","content":"PERSON"},{"type":"D.C.","content":"LOCATION"}],"hashtag":[],"authors":["Stephen D. Palley","The Block"]}