{"summary":"Mexican crypto exchange Bitso has raised funds from Ripple, Coinbase, Pantera Capital and others \nBitso wants to expand into Argentina and Brazil, among other Latin American countries, with the fresh capital in place\nCrypto adoption in the LatAm region is rising as 70% of its population remains unbanked; Last month, Huobi also announced an exchange in Argentina","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/43176\/ripple-coinbase-invest-in-crypto-exchange-bitso-to-help-it-expand-beyond-mexico","publishDate":"2019-10-14T09:00:09","id":3624,"type":null,"title":"Ripple, Coinbase invest in crypto exchange Bitso to help it expand beyond Mexico","category":["Exchanges"],"content":["Bitso, one of Mexico’s largest cryptocurrency exchanges, has raised an undisclosed sum of money from notable investors to further expand into Latin America.","The investment was led by Ripple, with participation from Coinbase and Jump Capital. Existing investors - Digital Currency Group and Pantera Capital - also participated in the round, according to an announcement Monday.","Bitso, which has been operating in Mexico since 2014 and claiming to serve over 750,000 users in the country, now wants to expand into Argentina and Brazil, among other Latin American nations. “The region is ready for disruption and we want to be the ones to do so by radically advancing financial inclusion for everyone,” said Daniel Vogel, co-founder and CEO of Bitso.","Indeed, 70% of Latin America’s population (or 400 million people) don’t have a bank account, as <a href=\"https:\/\/www.theblockresearch.com\/mapping-out-the-blockchain-ecosystem-in-latin-america-33683\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The Block reported<\/span><\/a> in July. Moreover, several countries in the region have been experiencing macroeconomic challenges of their own.","Argentina, for instance, is facing <span data-v-f87c67ca=\"\">currency crises<\/span>, among other issues. Last month, the country’s central bank <a href=\"https:\/\/www.theblockcrypto.com\/linked\/38183\/argentina-restricts-us-dollar-purchases-as-its-currency-crisis-escalates\" data-v-f87c67ca=\"\">put restrictions<\/a> on US dollar purchases in an effort to revive its plunging peso. Brazil, on the other hand, recently entered into <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2019-08-12\/brazil-economic-activity-gauge-flashes-recession-as-woes-mount\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">recession <\/span><\/a>due to high unemployment, weak investments as well as a global slowdown.","Due to these issues, both countries have seen their cryptocurrency activity pick up in recent months. In Argentina, for instance, the latest weekly bitcoin volumes jumped to nearly $196,000 via peer-to-peer (P2P) exchange LocalBitcoins. While in Brazil, the figure touched around $307,000.&nbsp;","","","","","Bitso’s move comes at a time when other major exchanges, such as <a href=\"https:\/\/www.theblockcrypto.com\/linked\/39973\/huobi-to-launch-local-exchange-in-argentina\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Huobi<\/span><\/a> and <a href=\"https:\/\/www.theblockcrypto.com\/linked\/15183\/binance-ceo-confirms-an-upcoming-fiat-to-crypto-exchange-in-argentina\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Binance<\/span><\/a>, have also announced and hinted their plans of launching a platform in Argentina, respectively.","“We believe that regulatory compliant fiat-to-crypto gateways around the world are an essential element to digital assets becoming a new global money transfer rail,” said Peter Johnson, principal at Jump Capital, on participating in Bitso’s investment round.","In June, Ripple also <a href=\"https:\/\/www.businesswire.com\/news\/home\/20190611005269\/en\/Provider-Solutions-Global-Payments-Silicon-Valley-Officially\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">launched<\/span><\/a> its operations in Brazil to expand its footprint in South America and to help users make cheaper cross-border payments. “Bitso is a key infrastructure partner to Ripple, providing critical liquidity for payments in Mexico,” said Asheesh Birla, SVP of product management at Ripple, adding: “The team has built real products and amassed a huge customer base in Mexico, and we look forward to partnering with them in this next stage of growth into Latin America.”","Bitso also recently <a href=\"https:\/\/blog-en.bitso.com\/bitso-the-first-regulated-platform-in-latam-ae16416951d5\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">launched<\/span><\/a> its operations in Gibraltar after receiving a distributed ledger technology (DLT) license from the island's financial regulator, the Gibraltar Financial Services Commission (GFSC)."],"hashtag":["COINBASE","DIGITAL CURRENCY GROUP"]}