{"summary":"Speaking at Breakpoint, in Lisbon, FTX CEO Sam Bankman-Fried highlighted blockchain-based social media as a big opportunity.\n\nBankman-Fried said that it would require an encrypted messaging protocol.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/123558\/ftx-ceo-social-media-on-the-blockchain-could-be-absolutely-huge","publishDate":"2021-11-08T12:21:17","id":3625,"type":null,"title":"FTX CEO: Social media on the blockchain could be ‘absolutely huge’","category":["Cryptocurrency"],"content":["FTX CEO Sam Bankman-Fried thinks that applying blockchain technology to social media could be a big opportunity.&nbsp;","Speaking at Breakpoint, in Lisbon, the crypto billionaire said, “I think social media on the blockchain — I continue to think this could be absolutely huge. I think it solves a lot of existing pain points, which are really coming to the forefront of society right now.”","Bankman-Fried added that this would require a way to exchange messages in a secure and private way — one that could be accessible to multiple user-interfaces. He said this protocol would need to be composable and cross-platform.","As a big Solana-backer, it’s no surprise that he pointed to Solana to tackle this objective. He claimed that Solana would be able to handle such a task, since it can process a significant amount of transactions (currently <a href=\"https:\/\/explorer.solana.com\/\" data-v-f87c67ca=\"\">handling<\/a> around 2,300 transactions per second).&nbsp;","Bankman-Fried also discussed how DeFi could scale more rapidly, namely by integrating with pre-existing platforms — such as social media platforms.","\"One potential way to absolutely supercharge DeFi adoption is to first build a great product but then combine it with an already existing massive userbase. And many of these userbases are order of magnitude bigger than all of DeFi so far and you talk about the adoption so far that we've seen in the industry but that might just pale in comparison to what a single gigantic platform can bring forward,\" he said.","He added that he was excited to see whether it's maps, existing social media platforms, fintech platforms or natural growth that will do this and help scale DeFi to hundreds of millions of users, \"because that's where all the upside is.\"","Blockchain technology could be used within social media in many ways. It could be used to ensure that all content on the network is uncensorable through storage on a blockchain. Or it could be used to tokenize various elements, such as rewarding users for creating good content.","There are already some projects trying to achieve this goal. Hive is one blockchain platform that supports multiple social media blogging platforms. DeFi lending platform Aave <a href=\"https:\/\/www.theblockcrypto.com\/daily\/112792\/a-close-look-at-aaves-plan-to-build-a-protocol-for-decentralized-social-media\" data-v-f87c67ca=\"\">is working on<\/a> a protocol for decentralized social media. Social network Gab also has plans to adopt blockchain technology. Plus, Twitter is exploring how it could build its own protocol, which Twitter would then adopt — a project known as <a href=\"https:\/\/www.theblockcrypto.com\/linked\/114709\/twitter-taps-crypto-developer-to-lead-decentralized-social-media-initiative-bluesky\" data-v-f87c67ca=\"\">BlueSky<\/a>.","Prolific crypto project founder Dan Larimer — who built BitShares, Steemit (which later effectively became Hive) and EOS — is also building a new protocol for social media, called Clarion. Although unlike his previous projects, it seemingly won't have a blockchain or a token.","Reddit is also experimenting with blockchain technology. It has a couple of tokens for two of its subReddits — r\/Cryptocurrency and r\/Fortnite — although they are still running on testnets for now. <a href=\"https:\/\/twitter.com\/iamRahul20x\/status\/1455950491658117125\" data-v-f87c67ca=\"\">According to<\/a> a Reddit engineer called Rahul, the social network plans to keep experimenting with this technology so that when it's scalable, it can replace karma with tokens. This could bring tokenization to all of Reddit's 500 million monthly users.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>"],"hashtag":["FTX","SAM BANKMAN-FRIED","SOCIAL MEDIA"]}