{"summary":"Circle has raised $440 million in a new funding round\nThe firm — which is behind the fast-growing USDC stablecoin — could go public via a SPAC deal after the raise, according to sources.","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/106473\/after-440-million-fundraise-circle-is-said-to-be-considering-a-spac-deal","publishDate":"2021-05-28T14:12:02","id":3627,"type":null,"title":"After $440 million fundraise, Circle is said to be considering a SPAC deal","category":["The Block"],"content":["Circle, the company behind the fast-growing dollar-pegged coin USDC, has raised $440 million in fresh capital.","The sizeable funding deal comes ahead of a potential special purpose acquisition vehicle (SPAC) deal, according to two sources familiar with the matter. Among those taking part in the $440 million round were Fidelity, FTX, Digital Currency Group, Marshall Wace, Valor Capital Group, Pillar VC, Intersection Fintech Ventures, Atlas Merchant Capital and Willett Advisors, among others.","The firm's target valuation for the SPAC is said to be $4 billion. Companies have raised tens of billions of dollars via SPACs this year, but the market has come under recent pressure. As <a href=\"https:\/\/www.wsj.com\/articles\/spac-selloff-bruises-individual-investors-11621396808\" data-v-f87c67ca=\"\">reported<\/a> by The Wall Street Journal, the Defiance Next Gen SPAC Derived Exchange-Traded Fund, which tracks the performance of companies that have tapped the public markets via a SPAC, hit a six-month low earlier this month.&nbsp;","Circle's business has grown alongside the supply of USDC, having built out API services to help businesses engage with the stablecoin business. The total supply of USDC recently surpassed $20 billion. Circle makes money from the dollar reserves that underpin the stablecoin.&nbsp;","The new funding round follows a strategic <a href=\"https:\/\/www.coindesk.com\/circle-gets-25m-from-dcg-to-drive-usdc-mainstream\" data-v-f87c67ca=\"\">raise<\/a> of $25 million led by Digital Currency Group in 2020. Circle also raised $110 million in a 2018 round that valued the company at $3 billion. ","","Circle's funding round joins the growing list of big-ticket capital raises for 2021. These include Paxos's $300 million Series D funding round in April and BlockFi's $350 million round in March. Both raises gave these firms valuations above $1 billion. FTX is also <a href=\"https:\/\/www.theblockcrypto.com\/post\/105257\/ftx-funding-round-20-billion-valuation-sources\" data-v-f87c67ca=\"\">nearly finished<\/a> closing a funding round that is set to value the company at $20 billion.&nbsp;","Circle announced the fundraise completion a few hours after The Block reached out to the firm for comment.&nbsp;"],"hashtag":["USDC"]}