{"summary":"The event is being watched closely by ether traders, as Ether staking could see a huge increase after the Shanghai upgrade.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/207231\/ethereum-staking-withdrawal-testnet-for-shanghai-upgrade-goes-live-tomorrow","publishDate":"2023-01-31T14:59:38","id":3628,"type":null,"title":"Ethereum staking withdrawal testnet for Shanghai upgrade goes live tomorrow","category":["LAYER 1S"],"content":["Ethereum staking testnet Zhejiang is going live tomorrow and will give users the first preview of what the withdrawal process and functionality will be like after the Shanghai upgrade.","The testnet, which will go live at 10 a.m. EST on Wednesday, won’t immediately offer users the ability to try out any of the withdrawal features that will be implemented in the Shanghai and Capella testnet upgrades six days later. Users will be able try out depositing to validators and get a sense of how the user interface will behave.","The Ethereum developer operations team that built the testnet will make adjustments as needed to improve the overall experience, <a href=\"https:\/\/twitter.com\/BarnabasBusa\/status\/1620348081953980416?s=20&amp;t=SCRQgh8oHRD86f3z3HjnSw\" data-v-f87c67ca=\"\">tweeted<\/a> Ethereum Developer Barnabas Busa.","The Shanghai hard fork is a highly anticipated event for Ethereum, as it’s the first upgrade post-Merge that will allow ether stakers to withdraw their balances. The event is being watched closely by ether traders, as Ether staking could see a huge increase after the Shanghai upgrade, Selini Capital CIO Jordi Alexander <a href=\"https:\/\/twitter.com\/gametheorizing\/status\/1615674910717915138?s=20&amp;t=AAaSfRcuBPoGTeChKyQZ0Q\" data-v-f87c67ca=\"\">said<\/a> on Twitter.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ethereum Developer Barnabas Busa","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Selini Capital CIO Jordi Alexander","content":"ORGANIZATION"},{"type":"Shanghai","content":"LOCATION"},{"type":"10 a.m. EST","content":"TIME"},{"type":"Zhejiang","content":"LOCATION"}],"hashtag":["ETHEREUM"],"authors":["Mike Truppa","The Block"]}