{"summary":"China&#x27;s Zhejiang province has launched a probe into operations that are using public resources to mine cryptocurrencies.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/120601\/zhejiang-gpu-crypto-miners-public-utility","publishDate":"2021-10-14T04:07:20","id":363,"type":null,"title":"China&#x27;s Zhejiang busts GPU miners earning crypto in government agencies","category":["MINING"],"content":["Zhejiang, one of several coastal Chinese provinces that have been experiencing power shortages, has launched a probe into operations that are using public resources to mine cryptocurrencies.","The Zhejiang Cyberspace Administration said in a blog post on Thursday that it started an investigation last month targeting those who are mining cryptocurrencies inside government and the Communist Party agencies, state-owned enterprises as well as public high-education and research institutes.&nbsp;","The probe has screened through nearly 4,700 IP addresses in the province that are believed to be involved in cryptocurrency mining, the Zhejiang government said. It has located further 77 public entities through 184 IP addresses that are using government-funded utilities and facilities to mine crypto assets including BTC, ETH and others.","Multiple provincial agencies then launched on-site inspections of over 20 of those public entities based on 119 IP addresses and ordered the shutdown of these operations in addition to disciplinary penalties to staff held responsible.","Pictures from the on-site inspections show stacks of graphic processing units (GPUs) installed inside what appeared to be office areas.&nbsp;","The probe is the latest sign of an <a href=\"https:\/\/www.theblockcrypto.com\/news+\/120475\/china-crypto-mining-crackdown\" data-v-f87c67ca=\"\">ongoing cat and mouse<\/a> game between GPU miners in China and the authority.&nbsp;","<span data-v-f87c67ca=\"\">GPU miners busted on-site<\/span>","Indeed, the fact that Ethereum's network hash rate keeps reaching all-time highs indicates that Chinese ether miners are not giving up at all despite an escalated crackdown over the summer.&nbsp;","When Hangzhou-based Sparkpool, once the largest Ethereum mining pool in China and the world, announced its shutdown on September 27, it had about 160 TH\/s of hash rate. Europe-based Ethermine was trailing closely behind and another China-headquartered mining pool F2Pool was at the third with just 75 TH\/s.","Over the past two weeks, it appears the hash rate previously connected to Sparkpool has mostly flocked into F2Pool, since its hash rate has doubled to over 165 TH\/s. Ethermine's hash rate has also grown by over 15% to now more than 185 TH\/s.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/ethereums-hash-rate-daily\/embed\" title=\"Ethereum's Hash Rate (7DMA)\" width=\"100%\" data-mce-fragment=\"1\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Zhejiang Cyberspace Administration","content":"ORGANIZATION"},{"type":"GPU","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"Communist Party","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Hangzhou","content":"LOCATION"},{"type":"September 27","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"summer","content":"DATE"},{"type":"s. Ethermine","content":"ORGANIZATION"},{"type":"Zhejiang","content":"LOCATION"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Wolfie Zhao","The Block"]}