{"summary":"Robinhood Crypto is developing a slew of new products.\nRobinhood’s crypto unit also held “exploratory” talks with Uniswap.","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/112683\/uniswap-taking-products-robinhood-crypto","publishDate":"2021-07-28T15:51:26","id":3631,"type":null,"title":"Robinhood Crypto has held &#x27;exploratory&#x27; talks with Uniswap","category":["DeFi"],"content":["There's a lot going on inside Robinhood's dedicated crypto business unit: the development of new lending and staking products and meetings with Uniswap to start.&nbsp;","That's not surprising, given the sizeable role crypto has played in Robinhood's bottom line. In a prospectus filed ahead of the firm's much-anticipated IPO, Robinhood said that nearly one-fifth of its transaction-based revenue is derived from its crypto business. More than <a href=\"https:\/\/www.cnbc.com\/2021\/07\/01\/robinhood-says-dogecoin-accounted-for-34percent-of-crypto-revenue-in-q1.html\" data-v-f87c67ca=\"\">one-third<\/a> of that revenue came from the meme-themed cryptocurrency dogecoin. &nbsp;","During its IPO roadshow over the weekend, CFO Jason Warnick outlined a number of prospective products, including a new wallet, a lending product, debit rewards and staking. The company has also added staff to its crypto unit, including <a href=\"https:\/\/www.theblockcrypto.com\/daily\/112304\/here-are-the-12-biggest-crypto-hires-thus-far-in-2021\" data-v-f87c67ca=\"\">the hire of a new dedicated CFO<\/a>.&nbsp;","\"On the spending side there is more we can do with direct deposit and debit cards particularly giving the opportunity to connect rewards with our brokerage and crypto offerings,\" Warnick said. He added, \"In crypto, we are making a lot of investments in things we know our customers want, such as wallets, lending, and staking.\"","And in a nod to the growth happening around decentralized finance or DeFi, Robinhood is taking a look in that particular direction as well.&nbsp;","During an Ethereum-focused conference held last week in Paris, Uniswap Labs growth lead Ashleigh Schap <a href=\"https:\/\/twitter.com\/fintechfrank\/status\/1419090610317844482?s=20\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">said<\/a> that Robinhood has held talks with the development studio that supports the protocol. \"One of the cool things that we've actually been talking about with them is a way to use Uniswap to automatically settle a trade for example right when it happens with the user,\" she said during a panel.&nbsp;","After reaching out to Uniswap and Robinhood, Mary-Catherine Lader, COO for Uniswap Labs, said the two entities have held \"exploratory conversations.\"","In another message sent by Lader, she walked back on the presentation's \"comments on Robinhood,\" describing them as \"mistaken.\"","\"Uniswap has no current relationship with Robinhood,\" she added.&nbsp;","Robinhood, which is in a quiet period ahead of its public offering, declined to comment.&nbsp;","A source familiar with the situation told The Block that Uniswap Labs and Robinhood have held high-level talks centered around an exploration of Uniswap to provide liquidity on the platform alongside centralized market makers.&nbsp;","A market-making source, however, said that it would be surprising if Robinhood ends up integrating Uniswap given the strict approach to compliance and the onboarding of new market-making companies. Robinhood has drawn the attention of financial regulators and lawmakers in Congress and in June announced a combined $70 million payment to <a href=\"https:\/\/www.finra.org\/media-center\/newsreleases\/2021\/finra-orders-record-financial-penalties-against-robinhood-financial\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">FINRA<\/a> and customers affected by past outages.&nbsp;"],"hashtag":["CRYPTO","ROBINHOOD","STAKING","UNISWAP"]}