{"summary":"Reddit is deploying Layer 2 solution Arbitrum to scale Community Points, the two Ethereum-based tokens the popular online forum launched last year. \nThe upgrade will see the tokens, Moons and Bricks, transferred using the scaling solution Arbitrum.","author":["Saniya More","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/112250\/reddit-is-scaling-its-two-ethereum-based-tokens-using-layer-2-solution-arbitrum","publishDate":"2021-07-22T13:00:05","id":3632,"type":null,"title":"Reddit is scaling its two tokens using Layer 2 solution Arbitrum","category":["Ethereum"],"content":["<span data-v-f87c67ca=\"\">Reddit is deploying Layer 2 scaling solution Arbitrum in a bid to upgrade its Community Points — the crypto tokens used as rewards in two of its subreddits — the popular forum announced on Thursday.<\/span>","<span data-v-f87c67ca=\"\">Initially the integration will remain on testnet, but it's a step toward Reddit's plan to move the tokens from the testnet to the main Ethereum blockchain via Abritrum. It will enable more transactions while still at low costs.<\/span>","<span data-v-f87c67ca=\"\">“You’ll notice transactions happen much faster, and once you’ve created a Vault, you won’t have to keep claiming Moons\/Bricks every month,” the Reddit team said in a statement. “They’ll just show up in your Vault like magic!”<\/span>","<span data-v-f87c67ca=\"\">Last year, the popular online forum launched the two <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/65178\/reddit-launches-ethereum-based-tokens-for-cryptocurrency-and-fortnite-subreddits\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum-based tokens<\/span><\/a><span data-v-f87c67ca=\"\">, Moons ($MOONS) and Bricks ($BRICKS), as part of its Community Points program. Users in the \/r\/Cryptocurrency and \/r\/FortniteBR subreddits could earn the tokens for contributing quality content (in theory).<\/span>","<span data-v-f87c67ca=\"\">The tokens began on a testnet version of the Ethereum blockchain. This was to reduce fees and allow for a high number of transactions to take place — rather than put extra weight on the main blockchain.<\/span>","<span data-v-f87c67ca=\"\">Shortly after, Reddit began its “Scaling Bake-Off” initiative, <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/68880\/reddit-invites-developers-to-submit-ethereum-scaling-proposals-for-its-token-project\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">inviting developers<\/span><\/a><span data-v-f87c67ca=\"\"> to submit proposals for scaling their new tokens — with the hope of bringing them to the Ethereum mainnet, in some form or another. Over a year later, the platform has decided to scale with the competition winner, Arbitrum.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Arbitrum is known as a Layer 2 solution. This means that it takes the weight off the main (Layer 1) blockchain — in this case Ethereum — processing transactions on its behalf. This allows the blockchain to support a greater number of transactions, with lower fees.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to the Reddit team, Arbitrum stood out to them for several reasons.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The project, developed by Offchain Labs, is fully decentralized, deriving its security and finality from the main blockchain (transactions are essentially uploaded to the blockchain every so often, ensuring they eventually reach the mainnet). There are no centralized bridges meaning users will be in control of their Community Points and other digital assets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In addition to being fully decentralized, the Reddit team says Arbitrum is developer-friendly and has “broad ecosystem support,” with the potential to grow even further.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Users will not be able to use their tokens during the migration to the Arbitrum network, which the team says could take several hours.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Users are encouraged to use the Vault feature built into the Reddit app to store their tokens. However, if members are using other wallets for storage, they will be able to use a tool to transfer their tokens to the scaling network once the migration is complete.&nbsp;&nbsp;<\/span>","<em data-v-f87c67ca=\"\">Update: This article originally suggested the Layer 2 integration would be on the Ethereum mainnet, but it has been corrected to show the integration will initially be on testnet.<\/em>"],"hashtag":["ETHEREUM"]}