{"summary":"The US financial regulator has unveiled plans to grow its Crypto Assets and Cyber Unit to about 50 people.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/144809\/sec-plans-to-expand-cyber-fraud-unit-to-tackle-crypto-related-crime","publishDate":"2022-05-03T07:59:22","id":3634,"type":null,"title":"SEC plans to expand cyber fraud unit to tackle crypto-related crime","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">The Securities &amp; Exchange Commission <\/span><span data-v-f87c67ca=\"\">announced<\/span><span data-v-f87c67ca=\"\"> plans to increase the size of its cyber unit, which investigates cryptocurrency fraud and other misconduct, with the addition of 20 new hires.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"By nearly doubling the size of this key unit, the SEC will be better equipped to police wrongdoing in the crypto markets while continuing to identify disclosure and control issues with respect to cybersecurity,” SEC Chairman Gary Gensler said in a <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2022-78\" data-v-f87c67ca=\"\">release<\/a> on Tuesday.<\/span>","<span data-v-f87c67ca=\"\">The additional employees will see the unit's headcount grow to 50, including lawyers and investigators focused on cryptocurrency issuers and trading platforms, as well as NFTs, DeFi platforms and stablecoins.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The cyber unit was set up in September 2017 during the initial coin offering (ICO) boom to combat “the spread of false information through electronic and social media, hacking and threats to trading platforms,” <\/span><a href=\"https:\/\/www.sec.gov\/news\/press-release\/2017-219\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">according<\/span><\/a><span data-v-f87c67ca=\"\"> to the SEC.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Over the past five years it has brought more than 80 enforcement actions related to fraud and other misconducts, with the <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/88912\/sec-ripple-labs-lawsuit-filed-2\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">most high profile case involving Ripple Labs<\/span><\/a><span data-v-f87c67ca=\"\"> and two of its executives. The SEC first brought charges for this case in December 2020.<\/span>","<span data-v-f87c67ca=\"\">According to the Wall Street Journal, the new hires will be greeted by a change in leadership at the SEC’s cyber unit, as current chief Kristina Littman is set to step away from her role in June. Littman has been with the SEC since 2010, taking on her current role as cyber unit chief in December 2019.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"December 2020","content":"DATE"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"2010","content":"DATE"},{"type":"June","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Securities &amp; Exchange Commission","content":"ORGANIZATION"},{"type":"Kristina Littman","content":"PERSON"},{"type":"September 2017","content":"DATE"},{"type":"December 2019","content":"DATE"}],"hashtag":["GARY GENSLER"],"authors":["Adam Morgan McCarthy","The Block"]}