{"summary":"The SEC is reportedly investigating Uniswap Labs, developer of the decentralized exchange Uniswap.\nRegulators are attempting to catch up to DeFi — in the hopes of regulating what chair Gary Gensler has called the “Wild West.”\nThe investigation could herald a new era of crypto enforcement for the regulator.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/116633\/how-the-secs-reported-uniswap-labs-investigation-could-signal-a-new-era-of-enforcement","publishDate":"2021-09-04T12:29:14","id":3634,"type":null,"title":"How the SEC&#x27;s reported Uniswap Labs investigation could signal a new era of enforcement","category":["DeFi"],"content":["The U.S. securities watchdog is reportedly investigating the development firm behind the biggest decentralized cryptocurrency exchange (DEX).&nbsp;","The Wall Street Journal first <a href=\"https:\/\/www.theblockcrypto.com\/linked\/116535\/sec-investigating-uniswap-labs-report\" data-v-f87c67ca=\"\">reported<\/a> on Friday that the Securities and Exchange Commission (SEC) are conducting a civil investigation into Uniswap Labs. According to WSJ, \"people familiar with the matter\" say enforcement attorneys are seeking information on how Uniswap is used and how the team behind it markets the platform.","A Uniswap Labs rep told the Journal that the firm is “committed to complying with the laws and regulations governing our industry and to providing information to regulators that will assist them with any inquiry.”","More broadly, the news signals that the SEC's recent talk on decentralized finance or DeFi is translating into action -- and that a new era of enforcement is on the way.&nbsp;","General Counsel for Delphi Labs Gabriel Shapiro said crypto-focused lawyers have been waiting for the dam to break on DeFi enforcement.&nbsp;","\"Lawyers in the space have been aware and talking for about a month about how DeFi projects are starting to get letters from the SEC, inquiries from other regulators, and this is just it becoming more public,\" he said.&nbsp;","In addition to its inquiry into Uniswap, the SEC's division of enforcement recently sent letters to multiple startups as part of an effort to examine crypto lending services, according to the Journal.&nbsp;","Sarah Brennan, a blockchain-focused lawyer with Harter Secrest &amp; Emery LLP, said the new developments could signal the start of a larger theme of enforcement in this new era of the SEC.&nbsp;","\"My feeling is this is part of a broad sweep, similar to what happened with ICOs in 2018,\" said Brennan.","Regulators have yet to reckon with the decentralized finance (DeFi) space and how to regulate DEXs.","Last year, Commissioner Hester Peirce <a href=\"https:\/\/www.theblockcrypto.com\/daily\/76642\/sec-hester-peirce-defi-interview\" data-v-f87c67ca=\"\">told The Block<\/a> she expected DeFi would \"challenge\" the way the agency regulates, but it was unclear when the space would grow big enough to draw the attention of regulators.","“It's big, but it's still all relative,” she said at the time. “So if it got even bigger, then I think you'd see more regulatory attention, but that's not to say that there isn't any regulatory attention being paid.”","Peirce made those comments in September 2020, when DEX volume had broken records by topping $30 billion. By May, DEXs reached nearly $163 billion in volume. In short, DeFi has gotten bigger — and Uniswap leads the way.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/dex-non-custodial\/dex-volume-monthly\/embed\" title=\"DEX Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","As DeFi grew, Gary Gensler ascended to the head of the SEC. As a former lecturer on blockchain at MIT, many view Gensler as a more informed regulator, perhaps sympathetic to burgeoning technology — but it also means he knows where to look for activity lacking in investor protection.&nbsp;","Gensler's hinted that DeFi could be high on his list of priorities. At the start of last month, he delivered a <a href=\"https:\/\/www.theblockcrypto.com\/post\/113416\/gensler-speech-crypto-defi-lending-sec\" data-v-f87c67ca=\"\">speech<\/a> at the Aspen Security Forum in which he said investor protection in crypto is lacking, calling the space \"the Wild West.\" He took aim specifically at exchanges, both centralized and decentralized, saying the venues can implicate securities laws if they support tokens that could be considered securities.&nbsp;","The SEC then announced its <a href=\"https:\/\/www.theblockcrypto.com\/linked\/113755\/sec-settles-with-defi-operators-for-30-million-unregistered-securities-sale\" data-v-f87c67ca=\"\">first settlement with a DeFi project<\/a> in DeFi Money Market and operators Gregory Keough and Derek Acree.&nbsp;Days later, Gensler called for DeFi regulation in an <a href=\"https:\/\/www.theblockcrypto.com\/linked\/115016\/defi-projects-regulation-sec-chairman-gensler\" data-v-f87c67ca=\"\">interview<\/a> with the Wall Street Journal, saying DeFi projects that reward participants with valuable tokens or similar incentives could still be regulated since a core group of developers are often behind the project.&nbsp;","Brennan said the industry should take Gensler at his word, and the reported Uniswap investigation shows he means business.","\"Based on recent pronouncements, particularly Gensler’s remarks before the Aspen Security Forum, I do think this is a big deal,\" she told The Block. \"We should expect the SEC under Gensler to be an aggressive regulator, both in terms of their reach and their enforcement efforts.\"","But as Jake Chervinsky, General Counsel at Compound pointed out in a <a href=\"https:\/\/twitter.com\/jchervinsky\/status\/1433782778580119552?s=20\" data-v-f87c67ca=\"\">tweet<\/a>: \"An investigation is not an allegation of wrongdoing, it's just how the SEC gathers information.\"","The reported investigation into Uniswap is currently only a request for the developers to voluntarily supply the information. No subpoenas have been issued. Though it's coming from the enforcement division, it's not yet an enforcement action against the DEX.","\"It also shouldn't worry anyone too much (yet),\" Chervinsky tweeted.&nbsp;","Any movement could take a long time, according to Shapiro. Requests for information mean ensuing conversations on how the space works before getting to the question of whether wrongdoing may have occurred and furthermore in the event of a settlement.","If the SEC decides to pursue enforcement, settlement discussions take a long time. It could be months before a resolution — one that would set the tone for investigations into other DeFi projects — is reached.","The SEC also could mainly be looking to catch up to a space that's growing at a fast clip by soliciting information from one of its biggest players. But even if no enforcement comes, voluntary requests for information have costs.","As ShapeShift founder Erik Voorhees pointed out in a <a href=\"https:\/\/twitter.com\/ErikVoorhees\/status\/1433809782327033856?s=20\" data-v-f87c67ca=\"\">tweet<\/a>:"],"hashtag":["SEC"]}