{"summary":"2021 is in the past and in this past year, DeFi gradually became the &#x27;old story&#x27; in the blockchain world, and concepts such as NFT, GameFi, DAO and metaverse took turns to be the next new trend.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/130688\/mdex-one-year-anniversary-marching-forward-from-the-old-defi-story-into-the-new-chapters-of-metaverse-nft-and-dao","publishDate":"2022-01-19T08:00:57","id":3635,"type":null,"title":"MDEX One Year Anniversary: Marching forward from the “old” DeFi story into the new chapters of Metaverse, NFT and DAO","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">2021 is in the past and in this past year, DeFi gradually became the 'old story' in the blockchain world, and concepts such as NFT, GameFi, DAO and metaverse took turns to be the next new trend. With the rapid change in the industry, the development of the first generation of DeFi projects has attracted attention.<\/span>","<span data-v-f87c67ca=\"\">MDEX, which is about to celebrate its first anniversary, is a prime example of how the first generation of DeFi has evolved with the changing industry. It opened its DAO governance function before the concept of DAO was launched by ConstitutionDAO; between 30 September 2021 and the end of 2021, the community has completed more than 10 referendums on proposals, most of which address very practical issues. For example, some users propose to provide incentives for proposers so as to increase community members’ enthusiasm for DAO.<\/span>","<span data-v-f87c67ca=\"\">At the time of its 1 year birthday, MDEX has also followed up closely in the areas of NFT, GameFi and metaverse, by establishing a special fund for metaverse, collaborating deeply with several high-quality NFT projects and investing in the NFT incubation and trading platform Openmeta.<\/span>","<span data-v-f87c67ca=\"\">Looking back, MDEX has celebrated many milestones since its birth on January 19, 2021. One day after its establishment, MDEX 24H trading volume exceeded US$3.1 billion, topping the DEX ranking; on March 10, MDEX cumulative trading volume exceeded US$100 billion; on April 8, MDEX was launched on BSC and completed deployment on the Ethereum on October 8; on May 25, MDEX opened the IMO sector and launched the first IMO project; on October 30, MDEX launched the order book pending order function.<\/span>","<span data-v-f87c67ca=\"\">Turning the clock back to January 19, 2021, the fledgling MDEX just completed its deployment on the Heco chain. In addition to the classic liquidity farming rewards, it also added a trading reward mechanism. The “dual incentive” mechanism adopted gave MDEX a strong impetus to take off. On its first day of launch, MDEX became an instant hit, with a total lock-up value (TVL) of US$275 million and a single-day trading volume of US$521 million.<\/span>","<span data-v-f87c67ca=\"\">On September 2, 2021, MDEX launched the DAO governance function, with the aim of decentralizing power and giving users the authority to directly or indirectly lead the ecological development. According to the DAO rules set, users who hold the protocol governance token MDX can stake it's to the Boardroom and later receive the lock-in credential xMDX.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On 18 September, MDEX officially opened the first election of global board of directors and opened the DAO community proposal sector on 25 September. The basic autonomy function of DAO has been built since then.<\/span>","<span data-v-f87c67ca=\"\">Compared to other DeFi projects that lack in-depth practice and full participation in the governance, the MDEX community has developed a complete community voting scheme. According to the official website, the community will vote for nine directors each month, and one of the directors' tasks is to select community proposals. MDEX DAO greatly lowers the threshold for user participation and allows any xMDX user to submit a proposal to be elevated into a community referendum stage if it is supported by more than five directors.<\/span>","<span data-v-f87c67ca=\"\">While popular DAOs such as ConstitutionDAO have yet to enter the real collaborative governance process, the MDEX DAO Boardroom has already completed more than 10 “practical\" proposals for referendum.<\/span>","<span data-v-f87c67ca=\"\">Apart from DAO, MDEX is also closely following up on the deployment in metaverse and NFT. On 24 November, MDEX Foundation released a special fund for metaverse related projects. Earlier on, MDEX also entered into a partnership with MOBOX, a popular GameFi platform, to jointly explore the blockchain game sector.<\/span>","<span data-v-f87c67ca=\"\">What is striking is that on January 5, Meta-Elephant NFT, a series of NFTs based on the MDEX platform mascot, made its debut in the form of mystery boxes on the NFT distribution platform Element. The series of NFTs have 4 grades (N\/R\/SR\/SSR), and have a total of 10,000 units. Users holding Meta-Elephant NFTs can stake them for farming in the future to gain revenue. It is revealed that MDEX team will develop blockchain games based on this series of NFTs. The current Meta-Elephant NFT first edition (Interstellar Expedition) figures are four types: Cruise Repairer, Cruise Navigator, Cruise Specialists and Cruise Pilot, and the subsequent game play is expected based on these different character settings.<\/span>","<span data-v-f87c67ca=\"\">Having developed for nearly a year, MDEX, which started with trading, has never ceased to explore new fields. Its engagement in DAO, NFT and metaverse has outlined a roadmap for the DeFi protocol to keep pace with the times.<\/span>","<span data-v-f87c67ca=\"\">Initially, the most prominent features of MDEX were just token swap and liquidity rewards and trading rewards, and of these three functions, the liquidity rewards were considered a standard feature of DEX. From the beginning, MDEX set the goal of \"more than DEX\", i.e. to create a DeFi platform that combines DEX, IMO and DAO.<\/span>","<span data-v-f87c67ca=\"\">Half a month after its launch, MDEX began its exploration of DAO&nbsp; and launched the \"Boardroom\" section. On 4 February 2021, MDEX opened the Boardroom reward mechanism that allows users to stake MDX for token rewards; two days later, the MDEX Boardroom launched the repurchase and burn mechanism to reduce the inflation rate of MDX. As of December 28, 2021, MDEX had released 771 million MDXs and burned a total of 135 million MDXs.<\/span>","<span data-v-f87c67ca=\"\">On 8 April 2021, MDEX officially was launched on BSC, and became a dual-chain protocol. Its deployment on BSC was also well received by users, with a TVL of over $1.5 billion in 2 hours of launch.<\/span>","<span data-v-f87c67ca=\"\">The dual-chain deployment allowed MDEX to take a leap forward in terms of trading volume. By April 20, its cumulative dual-chain trading volume was close to US$200 billion, with 24H trading volume exceeding that of the top three DEXs, Uniswap, PancakeSwap and SushiSwap combined. Its extraordinary performance also placed it in the top 20 of the traditionally larger CEXs, surpassing well-known platforms such as ZB and FTX. According to KingData, in April 2021, MDEX had an average of 188,800 visitors per day and nearly 1 million views per day.<\/span>","<span data-v-f87c67ca=\"\">Besides trading, MDEX is striving to meet the goals it originally set out to achieve. On May 25, MDEX launched its first IMO program and saw a total asset swap of US$380 million. At this point, MDEX trading and IMO segments have been established, and with the completion of the deployment of its DAO governance in September, MDEX has officially reached its goal of becoming a “comprehensive DeFi platform\".<\/span>","<span data-v-f87c67ca=\"\">While diversifying its functions, MDEX also constantly upgrades its UI and filtering features. On 22 July, MDEX launched a new Chart function that allows users to check the price of each asset on the site at any time, and on 30 October, MDEX launched the Pending Order Book function to enable users to trade tokens at the desired price by means of limit pending orders.<\/span>","<span data-v-f87c67ca=\"\">The continuous iterations and upgrades have allowed MDEX to deliver a desirable business performance on its first anniversary. The data shows that MDX's annual transaction volume in 2021 exceeded US$458.8 billion; the total number of users exceeded 55 million; the highest TVL exceeded US$5.7 billion; the number of dual-chain interaction addresses exceeded 1.25 million on BSC and HECO; the cumulative number of all DEX interaction addresses on the network ranked sixth, the cumulative number of dual-chain transaction pairs exceeded 40,000; the combined dual-chain addresses holding MDX exceeded 310,000; the cumulative number of MDX mined exceeded 773 million; and the cumulative number of MDX repurchased and burned exceeded 136 million.<\/span>","<span data-v-f87c67ca=\"\">After experiencing the highs and lows, MDEX, which is about to turn one year old, is gradually moving from the 'old story' of DeFi to new chapters such as metaverse, NFT and DAO. To keep up with the rapid development of the crypto industry and achieve long-term growth, it is upgrading its products, expanding its business segments and rallying its community.<\/span>","<span data-v-f87c67ca=\"\">Blockchain technologies are just starting to transform our world and as a vanguard, MDEX boasts endless possibilities.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"May 25","content":"DATE"},{"type":"September 2021","content":"DATE"},{"type":"April 2021","content":"DATE"},{"type":"October 30","content":"DATE"},{"type":"October 8","content":"DATE"},{"type":"July","content":"DATE"},{"type":"US$5.7 billion","content":"MONEY"},{"type":"IMO","content":"ORGANIZATION"},{"type":"April 20","content":"DATE"},{"type":"November","content":"DATE"},{"type":"KingData","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"January 19, 2021","content":"DATE"},{"type":"February 2021","content":"DATE"},{"type":"US$200 billion","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"MDEX Foundation","content":"ORGANIZATION"},{"type":"BSC","content":"ORGANIZATION"},{"type":"MDX","content":"ORGANIZATION"},{"type":"September 2, 2021","content":"DATE"},{"type":"US$521 million","content":"MONEY"},{"type":"US$3.1 billion","content":"MONEY"},{"type":"US$380 million","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"1 year birthday","content":"DATE"},{"type":"vanguard","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Elephant NFT","content":"ORGANIZATION"},{"type":"January 5","content":"DATE"},{"type":"$1.5 billion","content":"MONEY"},{"type":"US$275 million","content":"MONEY"},{"type":"Uniswap","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"HECO","content":"ORGANIZATION"},{"type":"March 10","content":"DATE"},{"type":"MDEX DAO Boardroom","content":"ORGANIZATION"},{"type":"Meta","content":"LOCATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"December 28, 2021","content":"DATE"},{"type":"April 8","content":"DATE"},{"type":"US$100 billion","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"PancakeSwap","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}