{"summary":"The investment platform has now closed three rounds of financing in the past 12 months.\nBritish billionaire Alan Howard and REDO Ventures are the latest investors to back the business.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/114660\/crypto-bitpanda-263-million-series-c","publishDate":"2021-08-17T04:00:56","id":3636,"type":null,"title":"Austrian crypto unicorn Bitpanda raises another $263 million","category":["Fintech"],"content":["Vienna-based investment platform Bitpanda has closed a $263 million Series C round, giving the startup a valuation of $4.1 billion.","Peter Thiel’s venture capital firm Valar Ventures led the investment, with hedge fund heavyweight Alan Howard and REDO Ventures participating alongside existing backers LeadBlock Partners and Jump Capital.","The fundraise, announced this morning, comes just five months after Bitpanda’s $170 million Series B investment — a round enlarged by <a href=\"https:\/\/www.theblockcrypto.com\/linked\/104222\/crypto-market-makers-austrian-unicorn-bitpanda\" data-v-f87c67ca=\"\">a fresh $12 million<\/a> from Jump Capital and Wintermute Trading in May. Indeed, Bitpanda only closed its $52 million Series A as recently as September 2020.","Eric Demuth, co-founder and CEO of the Austrian business, has said previously that Bitpanda is profitable and doesn’t need external investment. The motive for fundraising, he said, is to drive the growth of the platform and to boost the brand — both in terms of its media appeal and for attracting top talent.","\"We have always focused on sustainable growth and, as a result, we’ve been profitable for 5 years and don’t have a ‘burn rate’. But, sustainable doesn’t mean slow. Fundraising lets us be aggressive without sacrificing our culture. This round is going to be used on three key things: product, people and expansion,\" Demuth told The Block.","Founded in 2014, Bitpanda began as a crypto trading outfit. More recently, it has started offering trading in stocks and precious metals. The platform has amassed 3 million users to date and is on track to boost its revenues sevenfold in 2021.","British billionaire Alan Howard, the co-founder of the hedge fund Brevan Howard, has made <a href=\"https:\/\/www.theblockcrypto.com\/daily\/108122\/billionaire-alan-howard-crypto-investments\" data-v-f87c67ca=\"\">a flurry of equity investments<\/a> in crypto infrastructure businesses over the past year.","In addition to Bitpanda, his investments include crypto exchanges Bullish Global and Kikitrade, custodians Komainu and Copper, and an array of other payments and investment firms.","Howard is also the majority shareholder in Elwood Technologies, which recently pivoted to focus on helping neobanks, fintech firms and asset manager access crypto liquidity providers."],"hashtag":[]}