{"summary":"Aave’s U.K. business entity, Aave Limited, was issued an Electronic Money Institution license in July.\nThe approval factors into the project’s broader adoption goals, Aave said Monday.","author":["Michael McSweeney","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/75845\/aave-uk-fca-emi-license-defi","publishDate":"2020-08-24T12:00:10","id":3637,"type":null,"title":"Aave has been granted an Electronic Money Institution license by the U.K. Financial Conduct Authority","category":["DeFi"],"content":["Non-custodial lending and borrowing protocol Aave's U.K. business entity has been issued&nbsp;an Electronic Money Institution (EMI) license.","Aave Limited was granted <a href=\"https:\/\/register.fca.org.uk\/s\/firm?id=0010X00004U9vVAQAZ\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">approval<\/a> on July 7, according to public information published by the U.K. Financial Conduct Authority (FCA), which issued the authorization. Such an authorization allows the recipient to offer services such as issuing digital cash alternatives and providing payment services.","According to founder and CEO Stani Kulechov, the application for the authorization was first submitted in 2018.","\"The objective was to help Aave Ecosystem to access payment accounts and on-board users into DeFi,\" he told The Block in an email. \"Electronic Money Institution is the same authorization that Coinbase and Revolut has in Europe. It will mostly support on-boarding new users into the Aave Ecosystem and to the decentralized protocol over time.\"","Given that the entity is based in the U.K., a pilot for its specific services will start in that country. Aave Limited has its own <a href=\"https:\/\/aave.co.uk\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">dedicated website<\/a> and is headquartered in London.","\"Aave will pilot in the U.K., before rolling out to cover the whole EEA and expanding globally,\" said Kulechov. Specifically, the service will allow users \"to go from Fiat to stablecoins and other assets natively in the Aave Ecosystem and then use these assets in the Aave Protocol.\"","When asked whether Aave will seek additional licensure within Europe, Kulechov said:","Aave has been gearing up for the launch of what it has dubbed Aavenomics, which will see the debut of a governance token amid <a href=\"https:\/\/www.theblockcrypto.com\/linked\/73336\/defi-lending-aave-token\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a broader decentralization bid<\/a>. The protocol has attracted significant attention in recent weeks, as available data published by <a href=\"https:\/\/defipulse.com\/aave\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">DeFi Pulse<\/a> shows, with the total amount of locked value <a href=\"https:\/\/www.theblockcrypto.com\/linked\/75003\/aave-becomes-second-defi-protocol-to-hit-1-billion-in-total-value-locked\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">rising past $1 billion<\/a> earlier this month, as The Block previously reported.","In comments, Kulechov spoke to the decentralization push and noted that work continues in that area. He explained that \"[o]ur governance smart contracts are now on test-net and currently our SM (Safety Module) smart contract that activates the staking incentives upon migration is under audit now.\"","\"After the audit is completed, a date can be proposed for the community which should be proposed any time now,\" he continued."],"hashtag":["AAVE"]}