{"summary":"While AI tokens outperformed the market this year, analysts forecast the AI cryptocurrency sector will make further ground in 2024.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/268038\/analysts-explore-how-ai-and-crypto-might-flourish-during-2024","publishDate":"2023-12-25T04:01:20","id":3640,"type":null,"title":"Analysts explore how AI and crypto might flourish during 2024","category":["COMPANIES"],"content":["The combination of innovations from both artificial intelligence (AI) and <a href=\"https:\/\/www.theblock.co\/post\/267603\/eigenlayer-modular\" data-v-f87c67ca=\"\">web3<\/a> could result in the emergence of a flourishing cryptocurrency subsector in 2024, according to analysts.","\"Both AI and crypto are quickly maturing, and while the potential of artificial intelligence and blockchain integration remains largely uncertain today, the emerging use-cases and possibility enabled by both technologies is massive,\" Nansen analyst Sandra Leow told The Block.","Leow emphasized the development of AI agents, a field that combines elements of <a href=\"https:\/\/www.theblock.co\/post\/265082\/emerging-trends-in-ai-the-convergence-with-web3-and-the-role-of-platforms-like-orbofi-ai\" data-v-f87c67ca=\"\">AI<\/a> and web3. She highlighted how these on-chain bots can assist in processing transactions and exchanging value on behalf of human users. \"We could foresee a world where AI agents become a primary category of users on the blockchain, and some examples include verification management applications that use zero-knowledge learning technologies like Modulus Labs,\" Leow added.","According to Gemini's <a href=\"https:\/\/www.gemini.com\/trend-report-2024\" data-v-f87c67ca=\"\">2024 Crypto Trend Report<\/a>, the integration of AI and web3 has the potential to improve privacy and data ownership, safeguard and identify human-generated content, and provide an alternative to large-scale cloud development.","The report identified opportunities for symbiosis between both technologies. \"The weaknesses of centralized AI can be mitigated by decentralized crypto, resulting in an AI that can evolve safely, providing powerful and beneficial features that serve humanity holistically without being dominated by special interests,\" the report said.","Gemini analysts added that web3 innovations rooted in the principles of <a href=\"https:\/\/www.theblock.co\/learn\/251476\/decentralization-in-the-metaverse-who-is-in-control\" data-v-f87c67ca=\"\">decentralization<\/a>, particularly zero-knowledge proofs, hold potential for enabling privacy-enhanced machine learning. \"AI could allow the cryptocurrency sector to transcend its niche status and realize its potential to be a practical everyday tool for equitable and democratic participation in technology, finance, and more,\" the report added.","<span data-v-f87c67ca=\"\">Gemini's Crypto-AI Index, based on the major artificial intelligence-related tokens.<\/span>","As generative AI becomes more sophisticated there will undoubtedly be a proliferation of deep fakes, identifying what is generated by humans rather than AI will be critical. In Gemini's report, Serotonin CEO Amanda Cassatt said her firm is observing an increase in projects involved in provenance tracking, and digital content attributions. \"The AI’s asymmetric ability to create content, more than humans can ever process, will soon see us default to assuming content is fake, relying on on-chain attestations for verification,\" Cassatt added.","London Real Ventures CEO Brian Rose forecasts a significant increase in AI-generated metaverse and web3 gaming content in 2024.","He told the Block that <a href=\"https:\/\/www.theblock.co\/post\/267456\/ai-related-tokens-rally-despite-crypto-market-caution-ahead-of-fed-rate-decision\" data-v-f87c67ca=\"\">generative AI<\/a> will have a critical role in shaping this digital frontier, adding that his venture capital firm has invested in over 20 metaverse-based startups, with over half of them heavily featuring a strong AI component.","\"At London Real Ventures we believe that web3 gaming will onboard the next one billion users onto the blockchain. And since AI will be responsible for building 99% of these metaverses, 2024 will not only bring the bull market, but the merge of AI and web3 will be a game changer,\" Rose added.","Leow pointed out that there was a \"strong outperformance of AI project tokens during the bear market as early as the beginning of 2023.\" She said that this has shown that there is enough belief and momentum in the burgeoning merge of artificial intelligence and blockchain.&nbsp;","<span data-v-03de5780=\"\" data-v-f87c67ca=\"\">Cryptocurrencies associated with recent developments in AI are entering the new year having already posted triple-digit gains throughout 2023. <\/span>\"The AI crypto sector's rally is influenced by several factors, including growing public interest in AI, technological advancements within the sector, and the ongoing development of AI-focused blockchain projects,\" Sei Labs Co-Founder Jeff Fang told The Block.","FET, the native cryptocurrency of Fetch.ai, <a href=\"https:\/\/www.theblock.co\/price\/248492\/fetch-ai-fet-usd\" data-v-f87c67ca=\"\">has gained over 590%<\/a> in the past year. <a href=\"https:\/\/www.theblock.pro\/research\/fetch-ai-autonomous-task-specific-artificial-intelligence-models-264987\" data-v-f87c67ca=\"\">Fetch.ai<\/a> focuses on automating business tasks, particularly in data processing and trading, using AI and machine learning.&nbsp;","<span data-v-03de5780=\"\" data-v-f87c67ca=\"\">Another AI-related crypto token that has outperformed the market is <a href=\"https:\/\/www.theblock.pro\/research\/render-network-democratizing-gpu-access-for-rendering-233226\" data-v-f87c67ca=\"\">Render<\/a>, a platform that helps artists access computing power for rendering generative AI artwork. RNDR<\/span><span data-v-03de5780=\"\" data-v-f87c67ca=\"\">, the native cryptocurrency, of the platform <a href=\"https:\/\/www.theblock.co\/price\/248420\/render-rndr-usd\" data-v-f87c67ca=\"\">has gained over 870%<\/a> in the past year.<\/span>","<span data-v-f87c67ca=\"\">The price of render has rallied during this year. Image: The Block's Price Page.<\/span>","Although many analysts see the collaboration between AI and web3 ushering in a new era of digital innovation, the market cap of the tokens associated with this subsector are still small compared to major digital assets. However, the recent promising performance of AI-related tokens suggests investor anticipation that the convergence of AI and blockchain technologies has the potential to be transformative for the entire industry.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gemini","content":"ORGANIZATION"},{"type":"Cassatt","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"99%","content":"PERCENT"},{"type":"Crypto Trend Report","content":"ORGANIZATION"},{"type":"Jeff Fang","content":"PERSON"},{"type":"Brian Rose","content":"PERSON"},{"type":"Leow","content":"PERSON"},{"type":"870%","content":"PERCENT"},{"type":"590%","content":"PERCENT"},{"type":"London","content":"LOCATION"},{"type":"Amanda Cassatt","content":"PERSON"},{"type":"Crypto","content":"LOCATION"},{"type":"London Real Ventures","content":"ORGANIZATION"},{"type":"Sandra Leow","content":"PERSON"}],"hashtag":["CRYPTO","DECENTRALIZED INFRASTRUCTURE","GAME DEVELOPERS","HARDWARE","IDENTITY","TOKENIZATION"],"authors":["Brian McGleenon","The Block"]}