{"summary":"Part IV: A look at Layer 2 Developments within gaming applications, enterprise initiatives, and speculating where the industry goes next","author":["Contributor Network","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/37362\/blockchain-gaming-part-iv-the-road-ahead","publishDate":"2019-08-22T19:59:30","id":3640,"type":null,"title":"Blockchain Gaming Part IV: The road ahead","category":["Ethereum"],"content":["<em data-v-f87c67ca=\"\">This is Part IV, the last in a multi-part comprehensive series on blockchain-based gaming by <a href=\"https:\/\/twitter.com\/jeffthedunker\" data-v-f87c67ca=\"\">Zane Huffman<\/a>: Twitter @jeffthedunker<\/em>","<em data-v-f87c67ca=\"\">The series is a culmination of historical accounts and interviews with a number of blockchain and crypto based game projects, sprinkled in with opinions on the current state and opportunities within gaming.<\/em>","Part III can be read <a href=\"https:\/\/www.theblockcrypto.com\/2019\/08\/14\/blockchain-gaming-part-iii-protocol-led-second-generation-games\/\" data-v-f87c67ca=\"\">here<\/a>.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nDisclaimer: One of the active clients Zane works with is XAYA.","<span data-v-f87c67ca=\"\">Despite the current shortcomings and inefficiencies in today’s blockchain gaming niche, there is an inherent value behind this emerging field of online gaming; companies and individuals are working day in and day out to build infrastructure that will hopefully enable blockchain games to take that next step to realize their potential.<\/span>","<strong data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\nLayer 2 Developments<\/strong>","<span data-v-f87c67ca=\"\">As is seen by gaming on Ethereum, mainnet blockchain gaming isn’t really practical on a global scale. Alternative chains, like EOS, Tron, and Steem do gaming better, but they’ve only eased the symptoms rather than struck at the cause. While these networks will continue to grow and improve alongside one another, others are looking into building out solutions on secondary layers better suited for the high-speed, high-frequency requirements of online gaming.<\/span>","&nbsp;","<strong data-v-f87c67ca=\"\">Lightning Network (Bitcoin)<\/strong>","<span data-v-f87c67ca=\"\">The average cost to send a Bitcoin transaction is currently more than US$1. High transaction fees make on-chain Bitcoin gaming impractical. Fortunately, alongside the ballooning transaction costs, Bitcoin’s second-layer scaling solution, Lightning Network, is attempting to grow and mature.<\/span>","<span data-v-f87c67ca=\"\">The Lightning Network is an ecosystem of interconnected payment channels. The organization can be visualized as similar to a spiderweb. Lightning Network users transfer funds into their Lightning wallets, then send on-chain transactions to form payment channels to-and-from other entities. Each payment channel requires a single BTC transaction to open and one more to close.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">When payment channels are established, Bitcoin can be sent back-and-forth in real-time at no cost. Users can all send and receive elsewhere in the network so long as a route can be formed from start to finish. In other words, if Node A is connected to Node B, and B is connected to Node C, then A can send BTC to C by routing through B. The fees for routing across multiple players is negligible- one US penny can fund hundreds of thousands of transactions.<\/span>","<span data-v-f87c67ca=\"\">In regards to gaming, these Lightning Network payment channels can be utilized by players to connect to one another and to online games in order to send and receive Bitcoin without the burden of transaction fees and confirmation times. Unfortunately, Lightning Network development is still limited by Bitcoin’s non-turing complete Script language, which makes 100% blockchain games still a ways off in a complex online game setting. As Lightning Network is still a new creation, there are also worthwhile concerns pertaining to the security of LN funds and activities.<\/span>","<span data-v-f87c67ca=\"\">Regardless, there are a number of games operating on the Lightning Network and in development that leverage the network in different capacities. The first game to go live was <\/span>Satoshi’s Place<span data-v-f87c67ca=\"\"> on Feb. 9 of this year. Satoshi’s Place is a pixelated canvas that anyone can paint on, in real-time, through LN payments of one satoshi per pixel. The rogue-like <\/span>Hammercoin <span data-v-f87c67ca=\"\">game that was created before the CryptoKitties craze is making a comeback with Lightning Network integration under the name <\/span>Hammerland.<b data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/b>","","","<span data-v-f87c67ca=\"\">Source: Satoshi's Place<\/span>","<span data-v-f87c67ca=\"\">Christian “Mandel Duck” Moss is a leading game developer on Lightning Network. He is a noted developer in the Bitcoin community for his lineup of <\/span>SaruTobi <span data-v-f87c67ca=\"\">games. At the Bitcoin 2019 conference, Moss was crowned victor of the LN hackathon for his LN game trilogy. These games include a two player arcade fighter <\/span>Blockchain Fighters, <span data-v-f87c67ca=\"\">a Pokemon GO-esque geocacher <\/span>Asgard, <span data-v-f87c67ca=\"\">and a local western dueler <\/span>Quick Draw.&nbsp;","<span data-v-f87c67ca=\"\">Moss explained that he chose to stick with Bitcoin because he didn’t see alternative chains as long-term solutions to scaling issues. “<\/span><span data-v-f87c67ca=\"\">Many other projects switched to other chains. However, I felt this was kicking the can down the road as these other chains seemed dubious or experimental and didn't solve the scaling issue other than through more centralization or less use.”<\/span>","<span data-v-f87c67ca=\"\">Now that Lightning Network is maturing and gaining steam, Moss is excited for the future of LN gaming. “I think [Lightning] allows new types of game play, particularly with micro payments and streaming… the open, permissionless nature of the Lightning Network allows this process to be trustless and also streamlined as anybody who is already on-boarded into the lightning network ecosystem can experience Bitcoin in a game without having to deposit or create an account.”<\/span>","<span data-v-f87c67ca=\"\">Looking ahead, Moss is anxious for the first solid, existing games that are enriched by adopting LN. Moss also alluded to some ideas he’s got in store, “ I do have ideas for several games that could only be made by lightning so perhaps we could get a new class of gaming all together!”<\/span>","<strong data-v-f87c67ca=\"\">Plasma (Ethereum)<br data-v-f87c67ca=\"\">\n<\/strong>","<span data-v-f87c67ca=\"\">Plasma is Ethereum’s next solution for throughput and scalability. Plasma is a mechanism through which child chains run parallel to the Ethereum mainnet. Funds are swapped on and off of these child chains and the operators have full control to specify and build out their chain as they see best fit. The goal for Plasma is to create a system through which the many Ethereum DApps can exist on independent child chains, leveraging the resources and security of Ethereum without burdening the network with the transaction volume and stress associated with the other network activity.<\/span>","<span data-v-f87c67ca=\"\">Of course, Plasma is the global alternative to Loom’s gamified DAppChain solution. Loom’s approach is great because its suite of tools and resources make building the chain and developing the game much more accessible for developers. However, Plasma has broader implications, as it gives complete control to the chain operator and leaves consensus and propagation in the hands of the user, whereas Loom Network is the sole validator and propagator of all DAppChains.<\/span>","<span data-v-f87c67ca=\"\">Plasma is still in development as part of the broader upgrade to “Ethereum 2.0”, which looks to arm Ethereum with a number of second-layer scaling solutions to better equip the network for worldwide adoption. In that regard, Loom still has the upper hand, as its DAppChains are live and games are already running as these side chains alongside Ethereum.<\/span>","<span data-v-f87c67ca=\"\">The role of Plasma in blockchain gaming on Ethereum is still very much speculative, though it is likely that a number of gaming DApps will make the switch when the infrastructure is in place to do so.<\/span>","<span data-v-f87c67ca=\"\">One shortcoming of these side chains, on Plasma as well as Loom, is the “wait period” required to move assets from child chains back to Ethereum mainnet. As a safeguard against users attempting to move assets to mainnet that they don’t own on the child chain, a lockup period of one to two weeks is established for validators to reject fault transaction requests. The Lightning Network is optimal here, as Bitcoin is moved on-and-off Lightning Network with one regular transaction in either direction.<\/span>","<strong data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\nGame Channels (XAYA)<\/strong>","<span data-v-f87c67ca=\"\">Relative to projects listed previously, XAYA is certainly a lesser known development. Regardless, the blockchain gaming tech introduced by this project competes with the best of the niche. As the evolution of the successful Huntercoin experiment, XAYA is a custom blockchain made specifically for gaming by some of the core team members and developers of both Huntercoin and Namecoin.<\/span>","<span data-v-f87c67ca=\"\">The philosophy behind XAYA is that in order to solve the issues associated with blockchain gaming of cost, speed, and scale, a network needs to be created specifically for the purpose of housing blockchain gaming activity. In July of 2018, alongside a $3 million ICO, the XAYA mainnet launched as an ecosystem geared to take blockchain gaming to the global masses.<\/span>","<span data-v-f87c67ca=\"\">There are several unique components of the blockchain that separate it from Ethereum, EOS, and others. Unlike most other blockchains, XAYA is language agnostic- there is no global contracting standard. Developers can build on the network in whichever coding language they prefer. By default, network transactions embody a gamestate \/ game input value pairing, so more nuanced game moves or logic create no larger network burden. A mechanism called “ephemeral timestamps” represents a trustless system for anti-cheat. XAYA utilizes a proof-of-work consensus mechanism through which the network is partially merge-mined against Bitcoin to leverage the resources and security of the Bitcoin network.<\/span>","<span data-v-f87c67ca=\"\">Beyond these peculiarities, XAYA also introduces a gamified state channel scaling solution coined “game channels”. Like payment channels on Lightning Network, any number of players can connect to a game channel as a peer-to-peer alternative to an online server with a single on-chain transaction. When connected to the game channel, players broadcast and take in dozens of transactions each second in real-time in the same manner they send and receive packets of information on traditional online games. Player inputs are bundled into their constant stream of transactions, and when no inputs are made, the transactions read empty.<\/span>","<span data-v-f87c67ca=\"\">Game channels are headed by Dr. Daniel Kraft, CTO of XAYA, Namecoin core developer, and leading contributor to Bitcoin Core. This tech was peer-reviewed and published in 2016 in Ledger Journal and currently operates in an early alpha, showcased by a proof-of-concept “XAYA Battleships” game.<\/span>","<span data-v-f87c67ca=\"\">While the game channels and XAYA tech appear to have potential, this network represents the most nascent of those listed, coming about more recently than even EOS. This blockchain has yet to go through the same “battle testing” as their counterparts and still must prove themselves in terms of security and reliability in production-ready gaming in mass capacity.<\/span>","<span data-v-f87c67ca=\"\">Initiatives regarding the improvement and evolution of network infrastructure to handle blockchain gaming is an invaluable endeavor, but equally important are the strides made in the business world of gaming. Players across the video game industry are beginning to appreciate the market that blockchain gaming will one day grow into, and several groups across the board are allocating resources in hopes of becoming among the first to capture the audience and market share of this budding niche.<\/span>","&nbsp;","<strong data-v-f87c67ca=\"\">Blockchain Gaming Alliance<\/strong>","<span data-v-f87c67ca=\"\">The Blockchain Gaming Alliance is a league of industry leaders in blockchain gaming and traditional gaming alike with the mission of aiding members in their development and growth in the aspirations of merging these two groups and introducing blockchain gaming to the global masses. Some of the board members include Enjin Coin, <\/span>Spells of Genesis <span data-v-f87c67ca=\"\">creators EverdreamSoft, and ConsenSys. Ubisoft represents the board as the primary interest from the traditional gaming space.<\/span>","<a href=\"https:\/\/medium.com\/@contact_39503\/introducing-the-blockchain-game-alliance-865a8097c947\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">From their introduction<\/span><\/a><span data-v-f87c67ca=\"\">, the Alliance fosters two primary missions:<\/span>","<span data-v-f87c67ca=\"\">These missions are categorized further as three priority objectives:<\/span>","<span data-v-f87c67ca=\"\">As the pioneer blockchain gaming groups from traditional and cryptocurrency backgrounds alike are all working to solve the same problems and build towards the same goals, the cooperation of players across the board into this coalition may help to accelerate development and fast-track blockchain gaming adoption in the coming years.<\/span>","&nbsp;","<strong data-v-f87c67ca=\"\">Soccer Manager<\/strong>","<span data-v-f87c67ca=\"\">Soccer Manager is a franchise of free-to-play football manager games based in Europe. Last year, they announced their plans to develop their next game, <\/span>Soccer Manager Elite<span data-v-f87c67ca=\"\">, as a 100% blockchain game on the XAYA network. Last month, Soccer Manager released a document that provides concrete information on the various gameplay and economic mechanics of Soccer Manager Elite in preparation for the upcoming beta.<\/span>","<span data-v-f87c67ca=\"\">At over 25 million downloads globally, this makes Soccer Manager the biggest player in video gaming to unveil a blockchain game. There are rumors of corporations like Ubisoft experimenting with the use of the Ethereum blockchain in some capacity, but no conclusive evidence that blockchain games are in development by these players.<\/span>","<span data-v-f87c67ca=\"\">In Soccer Manager Elite, there are a finite number of clubs that are directed by groups of user shareholders. Each club has a user manager, appointed by the shareholders, and football players signed by the club with cooperation from user agents. Well-performing clubs turn a real-world profit used to pay manager salaries, sign players, and profit shareholders.<\/span>","<span data-v-f87c67ca=\"\">The game is poised as an ultra-hardcore evolution of the football manager genre. Upon release, Soccer Manager Elite very well may become the first example of a complex blockchain game that pushes the bounds on its niche and expands the possibilities of the market it resides within. If successful, Soccer Manager Elite may encourage major games across other gaming genres to explore blockchain technology as a way to enrich the capacity of their offerings.<\/span>","&nbsp;","<strong data-v-f87c67ca=\"\">Cocos-BCX<\/strong>","<span data-v-f87c67ca=\"\">Cocos2d-x is arguably the most popular open source game development engine in the world. Cocos boasts more than one million developers and over a billion players on games powered by Cocos2d-x and Cocos Creator. Industry titans including Square Enix, Bandai Namco, and Nintendo have utilized the software for creation of games enjoyed by millions. Additionally, the comprehensive suite of tools and resources are poised to make game development in the Cocos ecosystem intuitive and accessible to all.<\/span>","<span data-v-f87c67ca=\"\">After raising $40 million in the second half of 2018, Cocos expanded into the world of blockchain with the Cocos Blockchain Expedition (Cocos-BCX). The purpose of Cocos-BCX is to build out the same tools and resources on their primary ecosystem for blockchain game developers on the Ethereum network.<\/span>","<span data-v-f87c67ca=\"\">More recently, Cocos-BCX has also expanded its goals to promote interoperability for blockchain games-&nbsp; enabling development and gameplay across different networks, Ethereum or otherwise. On June 6, Cocos-BCX also launched its own Cocos blockchain. Similarly to XAYA, the custom Cocos chain is built specifically with the goal to house highly scalable, highly efficient gaming DApps.<\/span>","<span data-v-f87c67ca=\"\">One of the major critiques of blockchain gaming is the difficulty for mainstream developers to get involved. Blockchains alone are a foreign concept to most, and developing games that can propagate on top of and interact with blockchains is an even greater battle. One of the largest projects in terms of accessible game development building out a platform to service blockchain game development speaks magnitudes in terms of attracting and encouraging future developers into the blockchain gaming space.<\/span>","&nbsp;","<strong data-v-f87c67ca=\"\">MLB Champions<\/strong>","<span data-v-f87c67ca=\"\">In the first quarter of 2018, near the height of the altcoin frenzy, Major League Baseball announced its intentions to build a crypto-collectible game on Ethereum called <\/span>MLB Champions<span data-v-f87c67ca=\"\">. Through a cooperation with blockchain game development studio Lucid Sight, Major League Baseball is looking to build a game around the minting and distribution of virtual bobbleheads represented as non-fungible ERC-721 tokens.<\/span>","<span data-v-f87c67ca=\"\">The first bobbleheads were minted near the end of the 2018 season. Although it was a short season, MLB Champions saw over $1 million in marketplace trades of digital bobbleheads. Headlines were made on September 21st, 2018 when the Los Angeles Dodgers held the first ever “crypto bobblehead” night, in which 40,000 NFT bobbleheads of fan favorite Dodgers were handed out.<\/span>","<span data-v-f87c67ca=\"\">This 2019 baseball season has seen a massive expansion in the offerings of MLB Champions. Now, users can set lineups and place predictions through bobbleheads and game cards in accordance to real world MLB games. The bobbleheads rank up and improve when they real world counterparts play well, and accurate game predictions earn in-game rewards that can be used to buy more cards and bobbleheads.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For many, the gameplay and offerings of MLB Champions are quite literally a dream come true. Sports fanatics of all ages have dreamed about a day when their collectible baseball cards and figurines had dynamic properties that corresponded to the players and teams they love and follow. In the future, gameplay may expand as an evolution of baseball manager games where players set lineups and buy packs of cards in hopes of building the best possible team and winning their leagues.<\/span>","<span data-v-f87c67ca=\"\">The security component of the Ethereum NFT’s also has massive implications for a collectibles industry that has been crippled by counterfeiting and scarcity concerns. Somehow, the “greats” always end up uncovered at garage sales for pennies. Provably scarce and guaranteed authentic MLB Champions NFT’s carry an intrinsic value that was previously not possible in the physical baseball card field.<\/span>","<span data-v-f87c67ca=\"\">Now that there are sports franchises in other professional leagues, like the NBA and NFL, it’ll be interesting to see if Lucid Sight or other game studios put out MLB Champions alternatives for other sports leagues. This could lead to an interesting interoperability across professional leagues. Just this past month the NBA, in partnership with <a href=\"https:\/\/www.dapperlabs.com\/#products\" data-v-f87c67ca=\"\">Dapper Labs<\/a>, announced the upcoming launch of a blockchain-based digital collectible platform called NBA Top Shot.<\/span>","<span data-v-f87c67ca=\"\">The fundamentals suggest that blockchain gaming has potential for radical real world impact, and groups across the board are working to build the tech that will allow this niche to realize that potential. Looking ahead, what blockchain gaming milestones should be followed closely, and what might a blockchain gaming future look like in a broader view?<\/span>","<b data-v-f87c67ca=\"\">Race to OASIS<\/b>","<span data-v-f87c67ca=\"\">The OASIS is a virtual reality universe set inside the best-selling <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ready Player One <\/span><\/i><span data-v-f87c67ca=\"\">novel and following Hollywood movie. Set in a dystopian future, the OASIS is an all encompassing VR experience where global citizens escape the dim prospects of reality while taking on whatever character and living out whatever adventures they like in the online world.<\/span>","<span data-v-f87c67ca=\"\">Gamers and sci-fi media alike have both fantasized and feared a future gaming universe similar to that which is presented through RPO. Thus far, ventures in this regard have fallen flat as the current scope of technology can’t quite handle a development in this magnitude in a manner that is still accessible for the average consumer on standard laptops and desktops.<\/span>","<span data-v-f87c67ca=\"\">Players in blockchain gaming suggest that blockchain technology is the missing link. The ability to offload costs to a global network while simultaneously maximizing the empowerment and autonomy of the player makes blockchain a potentially key ingredient in the OASIS recipe.<\/span>","<span data-v-f87c67ca=\"\">Several groups have already formulated their plans for bringing <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ready Player One <\/span><\/i><span data-v-f87c67ca=\"\">to reality (minus the dystopian future, hopefully). Enjin Coin plans to do so by building out an intricate “Enjin Multiverse” of games of all sorts using universal sets of Enjin Coin items and avatars. XAYA seeks to utilize game channels as shards in infinite VR universes coined “decentralized realities”. Decentraland is creating a world and providing the tools for players to build and play exactly how they want in a VR environment controlled by them.<\/span>","<span data-v-f87c67ca=\"\">Of course, as blockchain gaming continues to mature, these cryptocurrency startups will be joined and rivaled by enterprise counterparts, such as Ubisoft and others.&nbsp;<\/span>","&nbsp;","<b data-v-f87c67ca=\"\">Shifting the Paradigm of Gaming<\/b>","<span data-v-f87c67ca=\"\">The trend in video games over the past several years has been pay-to-win freemiums, early access cash grabs, and DLC normalization. Players are paying more and more for experiences that carry decreasing amounts of content and decreasing amounts of fun. Indie developers are forced to join the trend or be swallowed up along the way. Nobody is happy, and this trend is ultimately unsustainable.<\/span>","<span data-v-f87c67ca=\"\">Blockchain gaming gives players and developers a new, creative avenue for symbiotic interactions for the mutual benefits of creator and consumer. If Blockchain games become a legitimate alternative to freemium games, emphasis will shift away from addicting cash grabs back to exciting, fruitful, and fun games. As this shift takes place, studios all the way up will be see a greater push to adopt more modern game ecosystems or lose out on market share.<\/span>","<span data-v-f87c67ca=\"\">The core components of blockchain gaming, such as item ownership, interoperability, and real world value, shift the paradigm towards a value-oriented means of online gaming, where developers are encouraged to make gaming environments that create value, and players are rightfully rewarded for capturing that value. When gameplay and virtual assets are assigned real world value, everyone wins!<\/span>","&nbsp;","<b data-v-f87c67ca=\"\">New Gaming Genres<\/b>","<span data-v-f87c67ca=\"\">There have been allusions earlier in this document to new gaming genres that are being fleshed out, “human mining” gaming being one of them. Lightning Network developer Christian Moss believes he has some game ideas up his sleeve that were previously inconceivable before the advent of Lightning Network.<\/span>","<span data-v-f87c67ca=\"\">As the tech behind blockchain games continues to grow and mature, the scope and bounds of blockchain games will continue to expand, and increasingly exciting and unique gameplay genres will emerge. The “Race to OASIS” has only just began, but in the future there may be a whole new genre of “autonomous universe” games which all mimic experiences similar to OASIS.<\/span>","&nbsp;","<strong data-v-f87c67ca=\"\">Virtual Economy of Blockchain Gaming<\/strong>","<span data-v-f87c67ca=\"\">These potential blockchain games of the future are also interesting for the role their virtual economies will play. As gameplay and items will carry real world, non-zero values, emphasis in these games will inevitably place heightened interest on economic factors and activities. There are some niche examples of traditional games with thriving virtual economies, but the centralized authority of the developer in these situations is far from ideal.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In many cases, these economies exist as grey or black market endeavors through which participants risk having their accounts terminated. Even in games where the developers permit or even encourage real world value exchange, the role they must play as a facilitator or regulator makes it very difficult, even impossible, for potential virtual economies to take off.<\/span>","<span data-v-f87c67ca=\"\">In a future global economy that will certainly see radical shifts due to automation and AI, it will be interesting to see if different positions and activities in the “play-to-earn” economies of blockchain games may introduce a new class of virtual employment.&nbsp;<\/span>","&nbsp;","<b data-v-f87c67ca=\"\">Final Thoughts<\/b>","<span data-v-f87c67ca=\"\">This nascent industry of blockchain gaming has quietly been grinding momentum for almost a decade. With numerous heavyweight players in the blockchain space and video game industry alike beginning to seriously explore potential future applications of blockchain gaming, it becomes more evident that the question of mainstream blockchain games is a matter of when, not if.<\/span>","&nbsp;","<strong data-v-f87c67ca=\"\">About the Author<\/strong>","Zane was first exposed to Bitcoin in 2013 through a gaming community that utilized Bitcoin. Since then, he's followed gaming closely while immersing himself further in the cryptocurrency space. In 2015, he began working as a freelance writer for several crypto news blogs, and today continues to work as a freelance writer for various projects and websites in the space, primarily focusing on educational and technical content. His pinpoint area of focus within cryptocurrency continues to be gaming."],"hashtag":[]}