{"summary":"The Reserve Bank of Zimbabwe is set to regulate cryptocurrencies\nBack in 2018, the central bank banned local banks from processing payments for cryptocurrencies\nZimbabwe is on the verge of “deep” humanitarian and economic crises, according to the International Monetary Fund (IMF)","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/58807\/zimbabwes-central-bank-takes-a-u-turn-to-regulate-crypto-now","publishDate":"2020-03-16T04:45:29","id":3644,"type":null,"title":"Zimbabwe&#x27;s central bank takes a u-turn, to regulate crypto now","category":["Regulation"],"content":["The Reserve Bank of Zimbabwe, the country's central bank, is set to regulate cryptocurrencies after banning local banks from processing crypto payments in 2018.","The central bank has already started drafting a policy framework to guide operations of crypto firms, local newspaper The Chronicle <a href=\"https:\/\/www.chronicle.co.zw\/rbz-warms-up-to-cryptocurrencies\/\" data-v-f87c67ca=\"\">reported<\/a> on Monday. The RBZ has apparently admitted that the crypto trend is a reality.","\"We have already started to come up with a fintech framework because in regulation everything should be well structured. The framework, which is a regulatory sandbox, will be assessing the cryptocurrency companies as to how they are going to operate,\" said Josephat Mutepfa, deputy director of financial markets and national payment systems at the RBZ, while speaking during a Sound Prosperity Economic Forum in the Bulawayo city on Friday.","\"Once you enter the sandbox you either exist as a bonafide product to enter the market or you are guided to say that you need to partner a bank, a mobile money platform or your product needs to be licensed like a microfinance company,\" Mutepfa added.","The RBZ's move appears to be a significant one, as in May 2018, the central bank <a href=\"https:\/\/www.reuters.com\/article\/us-crypto-currencies-zimbabwe\/zimbabwe-bans-banks-from-processing-payments-for-cryptocurrencies-idUSKCN1IF0V4\" data-v-f87c67ca=\"\">banned<\/a> local banks from trading or processing payments linked to cryptocurrencies.","\"The Reserve Bank has directed all banking institutions not to provide banking services to facilitate any person or entity in dealing with or settling virtual currencies,\" RBZ governor John Mangudya said at the time.","Cryptocurrencies in Zimbabwe are currently unregulated. In December 2017, the central bank <a href=\"https:\/\/perma.cc\/SNX2-KM7V\" data-v-f87c67ca=\"\">issued<\/a> a statement, saying: \"Any person who invests in virtual currencies or participates in any transaction involving virtual currencies, does so at own risk and will not have legal protection from, or recourse against, any regulatory authority.\"","Zimbabwe is going through economic and humanitarian crises, according to the International Monetary Fund (IMF) said. Last month, <a href=\"https:\/\/www.imf.org\/en\/News\/Articles\/2020\/02\/26\/pr2072-zimbabwe-imf-executive-board-concludes-2020-article-iv-consultation\" data-v-f87c67ca=\"\">the IMF said<\/a>: \"Macroeconomic stability [in Zimbabwe] remains a challenge. [...] inflation is very high; and international reserves are very low. [...] With another poor harvest expected, growth in 2020 is projected at near zero, with food shortages continuing.\"","\"While the 2020 budget includes a significant increase in social spending, it is likely insufficient to meet the pressing social needs. Absent a scaling up of donor support, the risks of a deep humanitarian crisis are high,\" the IMF concluded.","It remains to be seen whether crypto regulations in place would help Zimbabwe revive its economic situation."],"hashtag":[]}