{"summary":"Bitcoin miner Aspen Creek Digital Corporation has opened a new facility in Colorado and plans to open more in Texas.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/153893\/bitcoin-miner-aspen-creek-digital-opens-6-megawatt-facility-in-colorado","publishDate":"2022-06-23T19:26:31","id":3644,"type":null,"title":"Bitcoin miner Aspen Creek Digital opens 6-megawatt facility in Colorado","category":["MINING"],"content":["The company has plans to open two more centers in Texas, a 30-megawatt and a 150-megawatt one.","Aspen Creek Digital Corporation (ACDC), a relative newcomer to the bitcoin mining industry, opened a 6-megawatt facility in Colorado, powered by solar panels.","The center is co-located behind the meter with a 10-megawatts solar farm, the company said Thursday.","ACDC is in the process of developing a few other projects across Texas, including a 30-megawatt center that is set to come online during the summer and host 10,000 ASIC miners and another 150-megawatt one.","\"Recent market volatility has demonstrated the importance of our core strategy: controlling power as the principal input in bitcoin mining,\" said the CEO of ACDC, Alexandra DaCosta. \"This design enables ACDC to withstand volatility in the bitcoin market and insulate our operations from power market fluctuations.\"","Besides self-mining at the new Colorado facility, the company is also hosting mining machines from Galaxy Digital.","\"We remain committed to working with ecosystem players that have a strong operational background to help us reach our mining goals,\" Galaxy's head of mining Amanda Fabiano said in a statement.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alexandra DaCosta","content":"PERSON"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"ACDC","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"Amanda Fabiano","content":"PERSON"},{"type":"Texas","content":"LOCATION"},{"type":"Aspen Creek Digital Corporation","content":"ORGANIZATION"},{"type":"Colorado","content":"LOCATION"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}