{"summary":"BlackRock’s spot bitcoin ETF led a crowded field of new issuers, as spot bitcoin funds began trading on Thursday.\nGrayscale’s ETF, which is a conversion and not new like rival funds, had more volume, but a lot of the trading is believed to be from investors selling. ","author":["RT Watson","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/272123\/blackrocks-new-spot-bitcoin-etf-tops-1-billion-in-big-first-day-of-trading","publishDate":"2024-01-11T16:46:19","id":365,"type":null,"title":"BlackRock&#x27;s new spot bitcoin ETF tops $1 billion in big first day of trading","category":["Markets"],"content":["It was a big day for spot bitcoin ETFs, and BlackRock appears to be the victor in the first day of trading.","On a day in which spot bitcoin ETF trading volumes reached nearly $4.6 billion, BlackRock's fund saw just over $1 billion, according to data from Yahoo Finance compiled by The Block. That made BlackRock's instrument the top-performer in terms of volume among new bitcoin funds.","Fidelity ranked as the second-best performing ETF among the new crypto-based funds, racking up $685 million in trading.","\"While it's premature to make final judgments, this significant trading volume indicates a considerable influx of investor funds into the spot-based bitcoin ETFs,\" said James Butterfill, head of research at CoinShares.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/structured-products\/bitcoin-spot-etf-volumes\/embed\" title=\"Bitcoin Spot ETF Volumes\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Thursday marked the first day of trading of spot bitcoin ETFs after the Securities and Exchange Commission approved the new product only yesterday.","While Grayscale's spot bitcoin ETF led all of the funds in trading volume on Thursday, with $2.3 billion, the institution's fund is a conversion of its flagship GBTC fund. Bloomberg Intelligence senior ETF Analyst Eric Balchunas <a href=\"https:\/\/twitter.com\/EricBalchunas\/status\/1745482003309363499\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">speculated<\/a> that most of Grayscale's volume is likely \"all selling\" as opposed to an inflow of fresh capital.","Bloomberg Intelligence Analyst James Seyffart posted a similar statement to the social media platform X.","\"Very easy argument to be made that a ton of this volume was selling of [Grayscale's fund] and buying of other ETFs for now,\" he said.","Balchunas also <a href=\"https:\/\/twitter.com\/EricBalchunas\/status\/1743392167446385066\" data-v-f87c67ca=\"\">posted a chart<\/a> on X showing BlackRock's spot bitcoin ETF as one of the top 25 day one performers in ETF history.","Spot bitcoin ETFs from ARK 21Shares and Bitwise's also generated significant trading, registering $278 million and $122 million, respectively.&nbsp;","Peter Smith, the CEO &amp; co-founder of Blockchain.com, heralded the launch in a <a href=\"https:\/\/twitter.com\/OneMorePeter\/status\/1745556743189332328?s=20\" data-v-f87c67ca=\"\">post on X<\/a>, even as some analysts have wondered what the new, cheap funds could mean for crypto exchanges and the revenue they generate from trading fees.","\"Perhaps the most interesting thing is the broad array of firms that have launched a product - the biggest tradfi players (Blackrock), the crypto native + tradfi JVs (Galaxy\/Invesco) and then the truly crypto natives like Greyscale and Bitwise,\" he wrote. \"This is how crypto goes forward - a big, diverse tent.\""],"hashtag":["SPOT BITCOIN ETF"]}