{"summary":"Ngrave, a crypto hardware wallet manufacturer, is looking to raise $15 million in a Series A funding round, according to a pitch deck obtained by The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/191744\/ngrave-looks-to-raise-15-million-series-a-at-60-million-pre-money-valuation","publishDate":"2022-12-02T11:27:46","id":3652,"type":null,"title":"Ngrave looks to raise $15 million Series A at $60 million pre-money valuation","category":["VENTURE CAPITAL"],"content":["Ngrave, a crypto hardware wallet manufacturer, is aiming to raise $15 million in a Series A funding round, according to a pitch deck obtained by The Block.","Binance Labs is leading the round, a source with direct knowledge of the matter said, adding that the pre-money valuation of the round was $60 million.&nbsp;Binance first <a href=\"https:\/\/www.binance.com\/en\/blog\/ecosystem\/binance-labs-makes-a-strategic-investment-in-hardware-wallet-maker-ngrave-to-boost-crypto-selfcustody-1033706612109803490\" data-v-f87c67ca=\"\">announced<\/a> last week that it had made a strategic investment in Ngrave and would be leading the startup's upcoming Series A round.","Ngrave declined to comment to The Block about the pitch deck, round and valuation.","Belgium-based Ngrave sells crypto hardware wallets that compete with those made by rivals Ledger and Trezor. Ngrave's flagship product, called zero, bills itself as \"the coldest wallet\" and features an operating system the company says has \"the world's highest security certification.\" Zero has been sold in 90 countries to date with total cumulative sales of $2.2 million, according to the pitch deck.&nbsp;","In the wake of collapse of the FTX crypto exchange, Ngrave's sales increased five-fold in November from the previous month, a person with direct knowledge of the information told The Block. The zero wallet currently shows as \"<a href=\"https:\/\/www.ngrave.io\/shop\" data-v-f87c67ca=\"\">sold out<\/a>\" on Ngrave's website. Its other product — Zero + Graphene (a stainless steel backup tool) — is also sold out. Both are expected to be back in stock soon, according to the website.","Ngrave rivals Ledger and Trezor have also seen a jump in sales recently. Ledger reportedly had the biggest sales day and week in November, and Trezor saw demand for its product jump by more than 300% in mid-November.","Ngrave projects its sales to reach $400 million in 2026 in a \"realistic scenario,\" according to the deck, and it aims to protect 500 million users by 2032.","With crypto heists continuing to plague the industry, over $2.6 billion worth of funds have been stolen from DeFi protocols alone to date, according to The Block's Data Dashboard. Ngrave expects more users to join the crypto space in the future, which could increase demand for its security products.","Ngrave co-founder and CEO Ruben Merre <a href=\"https:\/\/www.theblock.co\/post\/188754\/binance-labs-makes-strategic-investment-in-hardware-wallet-maker-ngrave\" data-v-f87c67ca=\"\">told The Block<\/a> last week that \"the market for hardware wallets is far from a saturated one,\" adding that \"there really is enough space for everyone\" given the growing demand of security products.","There are currently 25 people working for Ngrave, and the startup plans to more than double the team size next year, according to the deck.","As part of its growth plans, Ngrave also plans to focus on additional revenue streams with offerings including staking, token swaps and white labeling, according to the deck.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2026","content":"DATE"},{"type":"2032","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$2.2 million","content":"MONEY"},{"type":"Ruben Merre","content":"PERSON"},{"type":"300%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Ngrave","content":"ORGANIZATION"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"$15 million","content":"MONEY"},{"type":"$60 million","content":"MONEY"},{"type":"$400 million","content":"MONEY"},{"type":"mid-November","content":"DATE"},{"type":"Belgium","content":"LOCATION"},{"type":"$2.6 billion","content":"MONEY"}],"hashtag":["SERIES A"],"authors":["Yogita Khatri","The Block"]}