{"summary":"The Block reviews the Cryptosteel Capsule, the new flagship private key backup product from Cryptosteel\nThe Capsule is a cylindrical metal device designed to work under extreme conditions ","author":["Steven Zheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/45364\/the-block-review-cryptosteel-capsule","publishDate":"2019-10-31T14:33:43","id":3654,"type":null,"title":"The Block Review: Cryptosteel Capsule","category":["Cryptocurrency"],"content":["<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Disclosure: Cryptosteel sent The Block the Capsule unit that is reviewed in this article.<\/em>","This is the second edition of The Block’s new review series. Last time we reviewed the <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.theblockcrypto.com\/post\/43675\/the-block-review-bitbox02\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.theblockcrypto.com\/post\/43675\/the-block-review-bitbox02\" data-v-f87c67ca=\"\">BitBox02<\/a>, this time, we are taking a look at the <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/cryptosteel.com\/product\/cryptosteel-capsule\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/cryptosteel.com\/product\/cryptosteel-capsule\/\" data-v-f87c67ca=\"\">Cyptosteel Capsule<\/a> (the Capsule).","Before we get started, although one of Cryptosteel's stated selling points for the Capsule is that it's waterproof, fireproof and shockproof, this article is not about stress-testing the product, as I do not have access to acid, a blowtorch, or hydraulic press. Stress test reviews will be left to <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/twitter.com\/lopp\/status\/1186616033488130048\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/twitter.com\/lopp\/status\/1186616033488130048\" data-v-f87c67ca=\"\">those<\/a> better suited to write them. For The Block’s series of reviews, we will approach products from the perspective of an everyday consumer.","The Capsule came in a cardboard box with your typical plastic wrapping.","Upon unwrapping the box, we are presented with an instruction guide and a plastic case holding our Capsule and the tiles needed to record our private key.","Below is a picture of the items in the plastic case:","The numbered items include:","According to Cryptosteel, the Capsule holds up to 123 characters, including the separator and fastener. With your typical 24-word private keys, this means it is unlikely you would be able to record the entire seed phrase using the Capsule. This, however, does not matter. Because most hardware wallet manufacturers follow the <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/github.com\/bitcoin\/bips\/blob\/master\/bip-0039.mediawiki\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/github.com\/bitcoin\/bips\/blob\/master\/bip-0039.mediawiki\" data-v-f87c67ca=\"\">BIP39<\/a> standard, one would only need the first four letters of each word to recover their entire word and private keys. Users that are accustomed to manually writing down their full 24 words, however, might feel anxious recording their private keys with this process.","<span data-v-f87c67ca=\"\">From left to right: A quarter, the Capsule, Ledger Nano X<\/span>","Below is a GIF showing us recording our private keys using the Capsule’s tiles.","As mentioned earlier, the Capsule holds up to 123 characters. We did a test using private keys generated by our hardware wallet and found that we can record up to 128 characters. This limit, however, makes the fastener at the end a pain to take off and would make the lettered tiles difficult to read.","In total, we counted 877 tiles. Below is a table of the number of tiles we received with our order.","It is unclear whether the tile count is uniform in every shipment of the Capsule. If it is, it might be a smart idea for a user ordering the Capsule to throw away their remaining tiles after they have created their private keys to prevent an attacker from reverse-engineering the letters they used.","The Capsule’s cylindrical design makes it a pretty inconspicuous product. The process of recording the private keys might give users that are more comfortable with recording their full keys on paper some anxiety, as they can no longer read their full keys.","Because I was not able to stress-test this product, I would recommend users wait for a full stress-test review to determine if the Capsule lives up to its marketing promises. One thing I know, however, it a definite improvement over your run-of-the-mill paper card."],"hashtag":["HARDWARE"]}