{"summary":"Fidelity Digital Assets will leverage the web-based analytics dashboard to query on-chain data for risk management purposes.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/256709\/fidelity-digital-assets-becomes-first-enterprise-client-of-ey-blockchain-tool","publishDate":"2023-10-16T19:01:04","id":3655,"type":null,"title":"Fidelity Digital Assets becomes first enterprise client of EY&#x27;s blockchain tool","category":["COMPANIES"],"content":["EY, one of the \"big four\" global accounting firms, unveiled <a href=\"https:\/\/www.theblock.co\/post\/235889\/fidelity-files-for-spot-bitcoin-etf\" data-v-f87c67ca=\"\">Fidelity Digital Assets<\/a> as the first enterprise client to leverage its web-based, on-chain analytics tool available via EY Blockchain's SaaS platform.","The fourth generation tool known as \"EY Blockchain Analyzer: Reconciler\" is designed to help organizations independently source and query on-chain data to augment their internal risk management procedures, according to a statement.","\"As the global digital assets marketplace continues to grow rapidly, addressing operational excellence and robust internal risk management is paramount for cryptocurrency platforms to gain a competitive edge and instill trust among investors and regulators,\" EY Global blockchain lead Paul Brody said.&nbsp;","EY audit teams have used earlier versions of the dashboard for audit procedures since 2018, enabling the reconciliation of clients' off-chain records and on-chain data. Following six years of development as part of a multi-million dollar investment, the tool is now available for broader enterprise use.","Fidelity Digital Assets — the Fidelity Investments subsidiary that builds products and services geared toward the institutional adoption of digital assets — will tap into a select range of features offered by the tool. This includes analytical dashboards that highlight transaction inaccuracies, wallet address balances and digital signatures, according to the statement.","\"We are pleased to leverage the EY organization's industry-leading, web-based analyzer tool to supplement our internal risk management processes,\" Fidelity Digital Assets COO Michael O'Reilly said. \"The digital assets market demands stringent oversight, and by incorporating this technology for extracting data from the public blockchain for internal risk management processes, we continue to reinforce our commitment to providing a secure and transparent trading environment for our customers.\"","EY currently supports the Bitcoin, Bitcoin Cash, Litecoin, Ethereum, Ethereum Classic and Dogecoin blockchains. It is also working to expand support for blockchain data across additional chains, according to client demand, and other features such as address derivation, block explorers and staking.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Paul Brody","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"EY Blockchain","content":"ORGANIZATION"},{"type":"Michael O'Reilly","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"Fidelity Digital","content":"ORGANIZATION"},{"type":"Fidelity Investments","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Litecoin","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"Ethereum Classic","content":"ORGANIZATION"}],"hashtag":["DATA PROVIDERS","INVESTMENT FIRMS"],"authors":["James Hunt","The Block"]}