{"summary":"Asset management firm Grayscale reported record inflows in the first quarter of 2020\nThat’s despite a breakdown in the bitcoin is an uncorrelated asset narrative and a dip in crypto asset prices","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/62032\/grayscale-quarter-report-record-inflows-crypto","publishDate":"2020-04-16T09:00:16","id":3655,"type":null,"title":"Crypto asset manager Grayscale reports record inflows despite economic slump","category":["Institutional Investors"],"content":["Multi-billion dollar asset manager Grayscale reported the largest quarterly influx of inflows in its history on Thursday, a potential indicator that at least some corners of the investment community have looked to crypto during a tumultuous market period.","The $2.2 billion asset manager offers a series of investment products that provide indirect exposure to cryptocurrency assets. In the first quarter of 2020, Grayscale raised $503.7 million across its family of products, according to its quarterly report.","Grayscale's Bitcoin Trust (GBTC) led the pack with inflows topping $388.9 million. That's approximately double the previous quarter high of $254.8 million raised in the third quarter of 2019.","Grayscale's quarterly inflows are notable given the broader macro backdrop. The end of February saw the start of a coronavirus-triggered market rout that spared few assets. Cryptocurrency markets have not been immune, with bitcoin tumbling as much as 30% by mid-March. Still, inflows into ethereum began to outpace bitcoin following the week ending in March, indicating a shift in investor preference.","Inflows at Grayscale, meanwhile, remained steady up until March 20. A breakdown of weekly inflows across the firm's products suggests a slowing momentum at the end of March.&nbsp;","Still, Grayscale's Michael Sonnenshein said the firm would \"look to continue to build off the momentum.\"","He said the firm's results indicate an increase in interest among institutional investors in the digital asset space.&nbsp;","\"Inflows came from institutions,\" he said in an interview. Grayscale's report shows about 90% of inflows since inception came from what it categorizes as institutions, which span hedge funds, crypto-native investors, family offices, and other client types.","Other firms that cater to the institutional crowd supported similar levels of interest. Bitwise Asset Management has seen an uptick in flows and interest, according to chief operating officer Teddy Fusaro.","Fusaro said that independent financial advisors have become more engaged with the company during this period. In a phone interview with The Block, Fusaro said unprecedented financial conditions, including historic levels of Federal Reserve money-printing and aggressive economic stimulus from the U.S. government, are forcing people to rethink their current portfolio makeups.&nbsp;","\"RIAs in normal times are going out into the community and talking to rich lawyers and doctors to grow revenues,\" he said.","\"Now, there's money in motion,\" Fusaro continued. \"People are looking to shift things around.\"","The interest in crypto products among investors might come as a surprise to certain market observers. In a sense, bitcoin has not been living up to some of the characteristics that have drawn the attraction of certain market participants, including a lack of correlation to broader markets. Bitcoin has traded in lockstep with the S&amp;P 500, as indicated by The Block Research.&nbsp;","Bitcoin's correlation to the S&amp;P 500 index, measured as the correlation between the hourly returns of&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.tradingview.com\/symbols\/OANDA-SPX500USD\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.tradingview.com\/symbols\/OANDA-SPX500USD\/\" data-v-f87c67ca=\"\">SPX500USD<\/a>&nbsp;(S&amp;P 500 futures) and&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.tradingview.com\/symbols\/BTCUSD\/?exchange=COINBASE\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.tradingview.com\/symbols\/BTCUSD\/?exchange=COINBASE\" data-v-f87c67ca=\"\">BTC\/USD on Coinbase<\/a>, reached yearly highs in March during the crisis.","","","As for Grayscale, Sonnenshein said that the first quarter of 2020 was marked by an expansion of various client types. To date, more than 46.5% of inflows were brought in from multi-strat investors. Crypto-specific investors comprised just 11.2% of inflows, according to the report.&nbsp;","","","Speaking on background, one family office executive told The Block that his firm increased its exposure based on the most recent sell-off.&nbsp;","\"We are obviously living in a period of unparalleled uncertainty and we appreciate the fixed supply and defined, non-changeable monetary policy that bitcoin offers,\" the executive said, adding:"],"hashtag":[]}