{"summary":"Crypto asset manager Valkyrie Investments has raised $10 million in a Series A funding round.\nWith fresh capital at hand, Valkyrie plans to expand its team and build out a presence in Asia.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/110088\/bitcoin-etf-applicant-crypto-valkyrie-10-million-series-a","publishDate":"2021-06-30T09:00:55","id":3656,"type":null,"title":"Bitcoin ETF applicant Valkyrie raises $10 million in Series A funding","category":["Venture Capital"],"content":["Crypto asset manager Valkyrie Investments, which recently applied for a bitcoin exchange-traded fund (ETF), has raised $10 million in a Series A funding round.","There was no lead investor in the round, said Valkyrie, but it was backed by several venture funds and angel investors, including Precept Capital Management, 10X Capital, UTXO Management, Tron founder Justin Sun and Litecoin founder Charlie Lee.","With fresh capital at hand, Nashville, Tennessee-based Valkyrie plans to expand its team, build out a presence in Asia, and strengthen its product and distribution lines, CEO Leah Wald told The Block. Valkyrie's current headcount is 14 and it is looking to hire staff in research, trading, compliance, marketing, and sales functions, said Wald.","As for expanding its product line, Wald said Valkyrie plans to launch more digital asset trust products and ETFs, as well as a handful of specialized hedge fund strategies. The firm currently offers bitcoin and polkadot trusts. Its products could be compared to Grayscale, the world's largest crypto asset manager, <a href=\"https:\/\/twitter.com\/Grayscale\/status\/1409973894874906628?s=20\" data-v-f87c67ca=\"\">which has over $31 billion<\/a> worth of total assets under management (AUM).","Valkyrie's AUM, however, hasn't been disclosed. The firm declined to comment on it when contacted but said \"there have been significant inflows.\" When asked what Valkyrie's competitive edge is, Wald said the firm's team has over 40 years of combined experience in traditional asset management from firms like UBS and Guggenheim Partners.","Valkyrie applied for a bitcoin ETF in April, but the U.S. Securities and Exchange Commission (SEC) <a href=\"https:\/\/www.theblockcrypto.com\/linked\/98241\/valkyrie-sec-etf-bitcoin-companies\" data-v-f87c67ca=\"\">postponed<\/a> a decision on the fund to August. According to Wald, the SEC is \"mainly concerned about market manipulation and the reliability of pricing\/volume data.\"","Currently, there are a total of eight bitcoin ETF applications under the SEC's review and the regulator is yet to approve one. Asked if the SEC would approve a bitcoin ETF sometime this year, Wald said she would hesitate to put any timeline on the regulator's willingness to approve any investment vehicles.","The Series A brings Valkyrie's total funding to date to $12.2 million.&nbsp; The firm has previously raised $1.1 million in a seed funding round and $1 million from XBTO in strategic funding, said Wald."],"hashtag":["BITCOIN","SERIES A"]}