{"summary":"Less than a month since its formation, the Uniswap Foundation has announced its first round of grants.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/171967\/uniswap-foundation-splashes-1-8-million-in-first-round-of-grants","publishDate":"2022-09-22T06:04:34","id":3657,"type":null,"title":"Uniswap Foundation splashes $1.8 million in first round of grants","category":["DEX"],"content":["Uniswap Foundation, an organization created to promote the growth of the exchange’s ecosystem, has announced its first wave of grants.","According to the Foundation’s <a href=\"https:\/\/mirror.xyz\/devi731.eth\/Dy705L0V2MufftJ-x4zgAhfILw2yE18RY0lNsVN3mEA\" data-v-f87c67ca=\"\">announcement<\/a>, this grant sum totals $1.8 million across 14 recipients. It is the first round of grants from the <a href=\"https:\/\/www.theblock.co\/post\/161551\/uniswap-labs-alum-propose-creating-uniswap-foundation-to-boost-exchange\" data-v-f87c67ca=\"\">Uniswap Foundation<\/a> and it comes less than a month since the Uniswap community voted to establish it.","These grants will be awarded to projects and teams working on three main areas: protocol growth, community growth, and governance stewardship.","Uniswap Diamond is one of the grant recipients and will receive $808,725, the single largest for any project or team in this first wave. The project aims to help Uniswap to translate its dominance of the decentralized exchange market into the broader crypto trading arena. This is because, despite its dominance of the decentralized exchange market, Uniswap only accounts for about 1% of the entire crypto trading market — including centralized platform giants like Binance, FTX, and Coinbase, among others. Uniswap Diamond will use the grant to develop tools similar to those on offer on centralized exchanges.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/dex-non-custodial\/uniswap-vs-coinbase-and-binance-trade-volume-7dma\/embed\" title=\"Uniswap vs. Coinbase and Binance Trade Volume (7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Apart from Uniswap Diamond, other grant recipients in the protocol growth category include Uniswap.fish, Numoen, and projects working on data extraction and decentralized volatility oracle. In the community growth section, grants will go towards projects like Phi, DeFi LATAM, and DeFi Africa — the latter two supporting crypto communities in Latin America and Africa.","Devin Walsh, executive director of the Foundation, told The Block that funding for the grants will be disbursed according to agreed-upon milestones with the recipients.","“Additionally, because all grants work is open source, the Uniswap Foundation and everyone else in the community can track their progress over time. The Uniswap Foundation also schedules regular calls with some grantees to check in on their progress and offer assistance as they build, and has a Slack channel for grantees to support one another,” said Walsh.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Uniswap Foundation","content":"ORGANIZATION"},{"type":"Foundation","content":"ORGANIZATION"},{"type":"Uniswap Diamond","content":"ORGANIZATION"},{"type":"Devin Walsh","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Numoen","content":"PERSON"},{"type":"Latin America","content":"LOCATION"},{"type":"$1.8 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Walsh","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"$808,725","content":"MONEY"},{"type":"1%","content":"PERCENT"},{"type":"Africa","content":"LOCATION"}],"hashtag":["UNISWAP"],"authors":["Osato Avan-Nomayo","The Block"]}