{"summary":"The gaming veteran previously tested the proverbial NFT waters in January, when it sold a collection of NFTs via OpenSea.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176896\/konami-plots-nft-web3-and-metaverse-hiring-spree","publishDate":"2022-10-13T06:28:34","id":3658,"type":null,"title":"Konami plots NFT, web3 and metaverse hiring spree","category":["METAVERSE & NFT"],"content":["Konami Digital Entertainment is looking to <a href=\"https:\/\/www.konami.com\/games\/corporate\/en\/news\/release\/20221013\/\" data-v-f87c67ca=\"\">expand<\/a> into the web3 and metaverse space via new hires, according to a press release published on the Japanese entertainment conglomerate's official website.","The company — which is most famous outside of Japan as a video game developer and publisher — is currently recruiting \"a wide range of talent for \"system construction\" and \"service development\" to provide new experiences such as WEB3 and Metaverse.\"","The available positions, specifically, are for system engineering, programing, project management and business development in Konami's Infrastructure Development Division. Additionally, its Production and Operation Division is hiring for a producer, director, programmer, designer, planner and project manager. Finally, the company's Production Support Division is hiring related to legal, intellectual property, finance and accounting.","Though NFTs in traditional gaming have become a contentious topic over the past year, Konami has evidently shaken off critics and is ready to push forward with adoption. The company explicitly makes clear that it plans to \"launch a service where players can trade their in-game NFTs (digital items) through a unique distribution platform using blockchain.\"","A footnote in the official press release notes that Konami is \"developing a unique digital item distribution platform that conforms to the 'Guidelines for Blockchain Games' set forth by the Computer Entertainment Supplier's Association, Japan Online Game Association, and the Mobile Content Forum.\"","Konami previously tested the proverbial NFT waters in January, when it sold a collection of NFTs via OpenSea — earning more than $160,000, at the time. Some video game-focused media outlets, such as Kotaku, <a href=\"https:\/\/kotaku.com\/konami-sold-this-casltevania-nft-aka-jpeg-for-26-538-1848367096\" data-v-f87c67ca=\"\">lambasted<\/a> the effort, in line with many other video game industry pundits and critics.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Konami","content":"ORGANIZATION"},{"type":"Operation Division","content":"ORGANIZATION"},{"type":"Production Support Division","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Kotaku","content":"LOCATION"},{"type":"Japan","content":"LOCATION"},{"type":"$160,000","content":"MONEY"},{"type":"Mobile Content Forum","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Konami Digital Entertainment","content":"ORGANIZATION"},{"type":"Konami's Infrastructure Development Division","content":"ORGANIZATION"},{"type":"Computer Entertainment Supplier's Association, Japan Online Game Association","content":"ORGANIZATION"}],"hashtag":[],"authors":["Adam James","The Block"]}