{"summary":"BlockTV, a media venture of Moshe Hogeg, is hoping to raise $2M via a token listing on Bittrex exchange\n The firm’s BLTV tokens will be listed on Bittrex on Nov. 21 \nA BlockTV spokesperson told The Block: “Since the tokens are freely traded on the market after listing, no one knows how much will be raised”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/46604\/moshe-hogegs-media-venture-blocktv-plans-to-raise-6m-via-ico","publishDate":"2019-11-11T02:45:57","id":3659,"type":null,"title":"Moshe Hogeg’s media venture BlockTV hoping to raise $2M via token listing on Bittrex","category":["Layer 1s"],"content":["BlockTV, a media venture of controversial Israeli blockchain entrepreneur Moshe Hogeg, is hoping to raise $2 million via a token listing on cryptocurrency exchange <a href=\"https:\/\/www.theblockcrypto.com\/linked\/359\/bittrex-launches-international-arm-and-sets-up-trading-platform-in-malta\" data-v-f87c67ca=\"\">Bittrex Global<\/a>.","BlockTV’s owner Alignment Media is part of the Alignment Group, which is fully owned by Hogeg’s venture capital fund Singulariteam, Globes <a href=\"https:\/\/en.globes.co.il\/en\/article-moshe-hogeg-raising-$6m-for-blocktv-venture-through-ico-1001306538\" data-v-f87c67ca=\"\">reported<\/a> Sunday. Alignment Media will manage the token listing.","As part of the offering, BlockTV looks to offload 20% of its total 3 billion BLTV tokens, built on Ethereum’s ERC-20 standard. The listing price is set at $0.01 per unit, per the report. The listing will allow BLTV tokens to trade in the open market and if the price on the market stayed constant, BlockTV would raise $6 million.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"Since the tokens are freely traded on the market after listing, no one knows how much will be raised. If we manage to sell even $2 million worth of tokens in the month of the listing we will have met our goals,\" a BlockTV spokesperson told The Block.&nbsp;","The tokens will be <a href=\"https:\/\/bltvtoken.blocktv.com\/en\/\" data-v-f87c67ca=\"\">listed on<\/a>&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/linked\/15433\/bittrex-introduces-initial-exchange-offering-doesnt-explicitly-ban-chinese-citizens\" data-v-f87c67ca=\"\">Bittrex Global<\/a> on Nov. 21, according to BlockTV’s website. The remaining 80% of the BLTV tokens will be locked for 12 months, meaning no trading will be possible in them during the period.","With funding from the token listing, BlockTV plans to spend on its website’s needs and expand its coverage beyond blockchain and cryptocurrencies to include a broad range of technology industries, as well as to launch studios in New York and Asia next year, per the report.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThis is not <a href=\"https:\/\/www.theblockcrypto.com\/tag\/moshe-hogeg\" data-v-f87c67ca=\"\">Hogeg<\/a>'s first venture to hold a token sale. His previous ventures - blockchain prediction market platform <a href=\"https:\/\/www.theblockcrypto.com\/tag\/stox\" data-v-f87c67ca=\"\">Stox<\/a> and blockchain smartphone startup Sirin Labs - both have held token sales before and have seen their <a href=\"https:\/\/coinmarketcap.com\/currencies\/stox\/\" data-v-f87c67ca=\"\">tokens<\/a> <a href=\"https:\/\/coinmarketcap.com\/currencies\/sirin-labs-token\/\" data-v-f87c67ca=\"\">lose<\/a> over 99% of their peak value. Hogeg is also facing a number of<a href=\"https:\/\/www.theblockcrypto.com\/linked\/15783\/israeli-businessman-moshe-hogeg-faces-lawsuits-following-alleged-misappropriation-of-ico-proceeds\" data-v-f87c67ca=\"\"> lawsuits<\/a>.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nA BlockTV management source told Globes that several million dollars had been invested to date in founding and operating the website. The source added: \"We see great potential in the company's growth, which is also where the listing potential comes from.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe BlockTV spokesperson clarified to The Block that the firm is \"not conducting an ICO\" or initial coin offering. \"We are listing our new token on Bittrex Global without a pre-sale.\"","<em data-v-f87c67ca=\"\">UPDATE: This story has been updated to include comments from a BlockTV spokesperson.&nbsp;<\/em>"],"hashtag":[]}