{"summary":"The Bank of Korea, the country’s central bank, has launched a pilot program for testing digital won.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/60981\/south-koreas-central-bank-begins-pilot-program-for-testing-digital-currency","publishDate":"2020-04-06T03:45:26","id":366,"type":null,"title":"South Korea&#x27;s central bank begins pilot program for testing digital currency ","category":["PROJECTS"],"content":["The Bank of Korea, the country’s central bank, has launched a pilot program for testing digital won.","Announcing the news on Monday, the central bank <a href=\"http:\/\/www.bok.or.kr\/portal\/bbs\/P0000559\/view.do?nttId=10057475&amp;menuNo=200690\" data-v-f87c67ca=\"\">said<\/a> the program was launched last month and would run until December 2021. The 22-month program is aimed at identifying technical and legal provisions required to create and issue a digital currency. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nOn the technical side, it would define central bank digital currency (CBDC) design, an operation method of CBDC, and whether blockchain technology would be feasible to implement. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nOn the legal side, the program would analyze expected legal issues when introducing CBDC, and accordingly prepare a specific amendment plan for the Bank of Korea Act.","The pilot program schedule is set as follows:&nbsp;","It is worth noting that the Bank of Korea said, “it is not necessary to issue CBDC in the near future” because the demand for cash still exists, among other factors. However, it still needs to be prepared to respond “promptly” to future changes in the payments sector.","The Bank of Korea <a href=\"https:\/\/www.theblockcrypto.com\/linked\/51585\/koreas-central-bank-to-hire-additional-experts-to-research-digital-currencies\" data-v-f87c67ca=\"\">initially hinted<\/a> at conducting CBDC research in December 2019. The central bank was hiring experts at the time to study CBDCs and analyze other countries’ digital currency initiatives.","Central banks across the world appear to have accelerated their digital currency research efforts. Last week, the central bank of France also <a href=\"https:\/\/www.theblockcrypto.com\/post\/60490\/frances-central-bank-begins-experimenting-with-digital-euro\" data-v-f87c67ca=\"\">launched<\/a> an experimental program to test the integration of digital euro in settlement procedures.","The Bank of International Settlements (BIS), considered to be the central bank of central banks, recently <a href=\"https:\/\/www.theblockcrypto.com\/linked\/60963\/shift-in-payments-habits-because-of-coronavirus-fears-could-bolster-central-bank-digital-currencies-bis\" data-v-f87c67ca=\"\">said<\/a> that a shift in payments behavior brought on by the coronavirus pandemic, and concerns that physical cash might be a vector for the disease’s spread, could spur demand for digital methods like CBDCs.","“Resilient and accessible central bank operated payment infrastructures could quickly become more prominent, including retail central bank digital currencies (CBDCs),” said the BIS.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"December 2021","content":"DATE"},{"type":"Bank of International Settlements (BIS","content":"ORGANIZATION"},{"type":"Bank of Korea","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"France","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Bank of Korea Act","content":"ORGANIZATION"},{"type":"BIS","content":"ORGANIZATION"},{"type":"December 2019","content":"DATE"}],"hashtag":["CBDCS"],"authors":["Yogita Khatri","The Block"]}