{"summary":"EFRI claims Payvision helped facilitate fraudulent investment schemes\nThe not-for-profit is seeking restitution on behalf of hundreds of victims","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/83876\/efri-allegations-payvision-ing-crypto-scams","publishDate":"2020-11-06T14:13:13","id":3660,"type":null,"title":"EFRI threatens to sue Payvision, alleging that it facilitated fraud schemes","category":["Payments and Banking"],"content":["<span data-v-f87c67ca=\"\">An Austria-based not-for-profit organization has threatened legal action against a payments processor it has branded the “Dutch Wirecard.”<\/span>","<span data-v-f87c67ca=\"\">The European Funds Recovery Initiative (EFRI), whose mission is to help victims of online investment scams, claims that Payvision, a company once valued at €360 million and now majority-owned by the Dutch bank ING, helped facilitate fraudulent investment schemes that put investors more than €75 million out of pocket.<\/span>","<span data-v-f87c67ca=\"\">EFRI says it is seeking restitution on behalf of 232 European investors, all victims of boiler room schemes run by Israeli Gal Barak. Barak was <\/span><a href=\"https:\/\/efri.io\/gal-barak-former-ceo-of-a-bulgarian-boiler-room-and-beneficial-owner-of-a-major-international-binary-option-and-forex-fraud-scheme-sentenced-to-4-years-in-prison-in-vienna-austria\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">convicted of fraud and money laundering<\/span><\/a><span data-v-f87c67ca=\"\"> in September and sentenced to four years in prison.<\/span>","<span data-v-f87c67ca=\"\">ING and Payvision responded to requests for comment with near-identical statements, saying that they are aware of the allegations made by EFRI, that those claims are under legal merits assessment, and that they could not comment further.<\/span>","<span data-v-f87c67ca=\"\">Elfriede Sixt, co-founder of EFRI, has<\/span> <a href=\"https:\/\/www.riskcompliance.biz\/news\/accusations-against-payvision-supporting-fraud-and-massive-money-laundering\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">stated publicly<\/span><\/a><span data-v-f87c67ca=\"\"> that Payvision is a smaller-scale, Dutch version of Wirecard, the disgraced German payments firm which collapsed earlier this year after dogged reporting by the Financial Times exposed a $2 billion accounting scandal at the company.<\/span>","<span data-v-f87c67ca=\"\">It should be noted that while Payvision and Wirecard overlap in some business activities, Wirecard was a much bigger company at its peak.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Prior to its downfall, the Berlin-based Wirecard was seen as a pioneer in payments. As recently as August 2018, the company was valued at more than €24 billion. Its core business was to help merchants process payments online, but it was also an issuer of prepaid cards — a service many European fintech businesses had relied on it for. Wirecard counted various crypto companies among its clients, including crypto.com, TenX, cryptotopay.me and Wirex. <\/span>","<span data-v-f87c67ca=\"\">The Netherlands-based Payvision similarly helps businesses accept local payments online and in person. According to the firm’s website, its clients include the carmaker Mazda and Candy Crush, the mobile game.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The company appears also to have served at least one crypto firm. Based on documents shared with the Block by EFRI, one of the alleged fraudulent schemes appears to have included a crypto trading platform named Cryptopoint. One document entitled “Service Fees and Reporting” details the commercial terms agreed between Payvision and Cryptopoint for credit card processing. It’s not clear if Payvision has any other crypto firms as clients.<\/span>","<span data-v-f87c67ca=\"\">Cryptopoint has a checkered past. In May 2015, the UK financial services regulator<\/span><a href=\"https:\/\/www.fca.org.uk\/news\/warnings\/gpay-limited-trading-cryptopoint\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">issued a warning<\/span><\/a><span data-v-f87c67ca=\"\"> that the company was not authorized to provide financial services in the country, and that people should be “especially wary” of dealing with it. The platform had styled itself as a crypto and forex broker specializing in CFD trading.<\/span>","<span data-v-f87c67ca=\"\">On October 5, EFRI wrote to Payvision seeking more than €7 million in restitution payments. The letter, seen by the Block, gave Payvision until October 20 to make “a satisfying offer for reimbursement of Gal Barak’s victims”.<\/span>","<span data-v-f87c67ca=\"\">Now, the not-for-profit says it is preparing to take legal action against Payvision on behalf of the people it claims to represent. “We have a lot of material… If Payvision is not willing to talk to the victims, we have to take legal steps,” Sixt told the Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Sixt added that she also filed a money laundering complaint against Payvision with the Dutch central bank last year, but claims it fell on deaf ears.&nbsp;<\/span>"],"hashtag":[]}