{"summary":"Balestra v. ATBCoin LLC et al.\nCourt denies motion to dismiss on jurisdictional grounds noting, among other things, defendants’ attendance at NY conferences (Consensus?) in May 2017\nHowey Test satisfied for purposes of a Motion to Dismiss\nRelying on 2017 Consent Order in In Re Munchee, Court says fact that token holders not entitled to corporate profits wasn’t fatal to a securities act claim","author":["Stephen D. Palley","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/17769\/ico-token-didnt-entitle-buyers-to-profits-u-s-judge-says-it-sounds-like-a-security-anyway","publishDate":"2019-04-02T17:00:58","id":3661,"type":null,"title":"ICO token didn&#x27;t entitle buyers to profits: U.S. Judge says it sounds like a security anyway","category":["Legal"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".&nbsp;","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]Balestra v. ATBCoin LLC et al., 17-CV-10001 (VSB), S.D.N.Y., 3\/31\/2019[SDP]<br data-v-f87c67ca=\"\">\n<\/strong><\/em>","<a href=\"https:\/\/www.scribd.com\/document\/404093505\/ATBCoin-Opinion\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Link to opinion<\/a>","A new opinion in ATBCoin federal court securities class action provides further guidance on when a token might be considered a security under U.S. federal law.","A little background to start. This ICO commenced in June 2017 and apparently raised over $20 million in cryptocurrency. Per the Court, \"Defendants promoted the ATB Coin as 'an innovative decentralized cryptocurrency incorporating the advanced technologies that tailor the needs of primary market players—users, investors, and business owners...' According to Defendants, the ATB Blockchain would be 'the fastest blockchain- based cryptographic network in the Milky Way galaxy,' capable of delivering 'blazing fast, secure and near-zero cost payments to anyone in the world.'\"","The Defendants didn't file a registration statement before, during or after the ICO. Also, according to plaintiffs, while the Defendants did launch the ATB Blockchain on Sept. 14, 2017, it didn't deliver as promised and the value of the coins has gone down 85 percent from the sales prices.","Plaintiffs filed a (putative) class-action complaint pretty soon thereafter on Dec. 21, 2017, alleging two violations of the Securities Act -- first for selling unregistered securities in the form of the ATB coins, and second as \"control persons\" against two of the company’s principals.","Defendants filed a motion to dismiss for (1) lack of personal jurisdiction and (2) failure to state a claim, on the theory that the coin wasn't a security based on the pleadings.","The Court dispensed with the jurisdictional argument pretty quickly. Over-simplifying 70 years of jurisprudence, a U.S. Court looks to the amount of contact a person (natural or corporate) has had with the Court's forum state to make sure it would be fair to exercise authority over them. The Court pointed to a number of New York conferences that two of the principals had attended to show an effort to promote the sale to U.S. investors. Also, an \"ATB press release in fact claims that 'ATB Coin co-founder Herbert W. Hoover III is a member of America’s iconic manufacturing family' who 'resides in New York and travels worldwide.'\" Basically, there was more than enough evidence to show presence in and contact with New York.","The Court next looked at whether or not Plaintiff sufficiently alleged that the token sale was a securities offering.","There was no dispute that the Howey Test's investment of money prong was satisfied. Defendants argued that prongs two (\"common enterprise\") and three (\"profits from efforts of others\") weren't satisfied. The Court disagreed.","First, the Court found that \"Defendants encouraged investors to purchase ATB Coins based on the claim that the speed and efficiency of the ATB Blockchain would result in an increase in the coins’ value.\" Success or failure of the enterprise was directly tied to the product Defendants purported to develop.","The Court said it did not matter that ATB Coins didn't entitled purchaser to a pro rata share of ATB's profits. Relying on a Consent Order in the 2017 In Re Munchee SEC administrative proceeding, the Court agreed with the SEC that an ICO can be a securities offering even where the offer does not provide for a pro rata distribution of profits. Like the token in the Munchee case, the value of the ATB Coins was dictated by the success of the ATB enterprise, establishing \"horizontal commonality.\"","The Court also said that the complaint sufficiently alleged that buyers' profits were based on efforts of ATB. This was supported by language in press releases and FAQ's that literally used the word \"investment\": \"the first users of ATB Coin cryptocurrency can be compared to investors in a start-up, which can later acquire value, due to its usefulness and popularity. Thus, the acquisition of the first ATB Coin becomes a kind of investment with a long-term perspective.\"","It's interesting to see the Court rely on an SEC order as persuasive authority. The SEC is not part of the Judicial Branch -- this is a consent order (that is, something agreed to) by a part of the executive branch and the Court has, in effect, adopted the reasoning and it's now precedent. (As others have pointed out, this is not the first time that Courts have looked to SEC for guidance in the crypto space; the DAO Report has been cited many times).","Anyway -- no luck on the motions to dismiss (the Court also refused to dismiss the individuals, who were named as control persons). The Court selected Raymond Balestra as plaintiff counsel and agreed his law firm could serve as class counsel. This case is still in an early phase, believe it or not -- class discovery and class certification motions are significant upcoming milestones in the case. Given that it took 16 months from filing to a ruling on motions to dismiss, it's reasonable to predict another year or more before we see class certification motions. (It took almost a year from the time that the motion was fully briefed for this ruling to issue. There may be reasons but it's unclear from the court's docket why this is the case).","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They have given The Block permission to republish their commentary and analysis in full.&nbsp;<\/em>"],"hashtag":["SEC"]}