{"summary":"As the news gets no better for Kazakhstan&#x27;s miners, some are looking to relocate to the US or Russia.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/133366\/kazakhstan-floats-500-tax-increase-on-bitcoin-miners-leading-some-to-eye-relocation","publishDate":"2022-02-07T17:16:53","id":3662,"type":null,"title":"Kazakhstan floats 500% tax increase on Bitcoin miners, leading some to eye relocation","category":["MINING"],"content":["<span data-v-f87c67ca=\"\">Kazakh authorities have floated tighter regulatory conditions for bitcoin miners in recent days — a state of affairs that could spur some operations to leave the country for friendlier shores.<\/span>","<span data-v-f87c67ca=\"\">As local news outlet Kazinform <\/span><a href=\"https:\/\/www.inform.kz\/ru\/kakie-nalogi-budut-platit-maynery-v-kazahstane_a3895225\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reported<\/span><\/a><span data-v-f87c67ca=\"\"> on February 4, Kazakh authorities are looking into increasing the tax on electricity for cryptocurrency miners from one tenge to five tenge (USD$0.0023 to $0.012).&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Marat Sultangaziev, Kazakhstan’s first vice-minister of finance, further suggested requiring crypto miners to pay a monthly tax on equipment, whether or not they earn block rewards or even turn the ASICs on. The vice-minister compared the idea to a similar tax that casino operators pay on their machines.<\/span>","<span data-v-f87c67ca=\"\">The day before, Bagdat Musin, Kazakhstan’s minister of digital development, <\/span><a href=\"https:\/\/www.facebook.com\/BagdatMussin\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">posted<\/span><\/a><span data-v-f87c67ca=\"\"> on his personal Facebook to attack unregistered “gray” miners for consuming 1 gigawatt of the country’s electricity.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Gray miners are severely damaging our energy system. Now the energy costs of illegal mining are estimated to exceed 1 gigawatt,” wrote Musin, inviting those aware of unregistered mining operations to send reports to his office.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Current rules in Kazakhstan distinguish so-called “gray miners” from so-called “white miners.” White miners are those who have signed on to a <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/129152\/following-energy-shortage-kazakhstan-is-reining-in-2021s-stampede-of-crypto-miners\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">new registry at the ministry of digital development<\/span><\/a><span data-v-f87c67ca=\"\">. The ministry was working at speed to register miners throughout the end of 2021.<\/span>","<span data-v-f87c67ca=\"\">In keeping with that push for registration, Musin further advised unregistered gray cryptocurrency miners to come under the department’s new regime.<\/span>","<span data-v-f87c67ca=\"\">The news comes after the government cut off cryptocurrency miners from electricity for most of January, as the country faced widespread energy shortages and massive protests over rising fuel prices. As those protests raged, the government cut off electricity throughout the country, triggering <a href=\"https:\/\/www.theblockcrypto.com\/post\/129312\/bitcoin-mining-pool-hashrates-fall-amid-kazakhstan-internet-shutdown\" data-v-f87c67ca=\"\">hashrate declines<\/a> for major pools with exposure.<\/span>","<span data-v-f87c67ca=\"\">While internet access has returned, energy remains scarce. Though earlier <\/span><a href=\"https:\/\/www.coindesk.com\/business\/2022\/01\/25\/kazakh-crypto-miners-cut-off-from-electricity-supply-until-end-of-january\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reports<\/span><\/a><span data-v-f87c67ca=\"\"> said that Kazakh energy authorities were only planning on blocking electricity to miners until the end of January, multiple miners in the country told The Block that they were still waiting:<\/span>","<span data-v-f87c67ca=\"\">Makhat Serikuly, a consultant on mining for BlockchainKZ, told The Block, \"<\/span><span data-v-f87c67ca=\"\">We are back online, but electricity is still limited. We had a surplus, but now a deficit, so they are cutting off power to miners.”<\/span>","<span data-v-f87c67ca=\"\">Kanat Amren, a Kazakh miner, agreed that the situation was dire. “They can’t work without electricity, and for now, white miners have had their electricity shut off,” said Amren.<\/span>","<span data-v-f87c67ca=\"\">As China cracked down on cryptocurrency mining early in 2021, neighboring Kazakhstan, with its cheap electricity, welcomed a flood of miners. It quickly became the second-largest source of Bitcoin’s hashrate, after the US and ahead of Russia.<\/span>","<span data-v-f87c67ca=\"\">However, with the situation in Kazakhstan growing less certain, miners are increasingly looking to relocate to the US or Russia, as local miners indicated to The Block. <\/span>","<span data-v-f87c67ca=\"\">Didar Bekbau, founder of mining firm Xive.io, has recently <\/span><a href=\"https:\/\/twitter.com\/didar_bekbau\/status\/1486351796314464258\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">tweeted<\/span><\/a><span data-v-f87c67ca=\"\"> favorably of Russian President Vladimir Putin’s seeming <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/131731\/putin-pumps-the-brakes-on-russian-central-banks-push-to-ban-crypto-sees-future-in-mining\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">support for continued crypto mining in the country<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bagdat Musin","content":"PERSON"},{"type":"Vladimir Putin","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Marat Sultangaziev","content":"PERSON"},{"type":"Kazakh miner","content":"ORGANIZATION"},{"type":"Musin","content":"PERSON"},{"type":"Kazakhstan","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"February 4","content":"DATE"},{"type":"Russia","content":"LOCATION"},{"type":"Kanat Amren","content":"PERSON"},{"type":"Amren","content":"PERSON"},{"type":"$0.012","content":"MONEY"},{"type":"China","content":"LOCATION"}],"hashtag":["MINING"],"authors":["Kollen Post","The Block"]}