{"summary":"Blockchain detective ZachXBT claims crypto scammers targeted team members of projects like Orbiter Finance and Pika Protocol.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240016\/crypto-sleuth-zachxbt-alleges-scammer-stole-nfts-using-fake-discord-servers","publishDate":"2023-07-17T11:37:59","id":3664,"type":null,"title":"Crypto Sleuth ZachXBT alleges scammer stole assets using fake Discord servers","category":["PEOPLE"],"content":["Prolific blockchain sleuth ZachXBT is alleging that a Canadian phishing scammer called \"Soup\" has \"helped steal millions in assets\" using fake Discord servers.","ZachXBT <a href=\"https:\/\/twitter.com\/zachxbt\/status\/1680918931442368515\" data-v-f87c67ca=\"\">posted a Twitter thread<\/a> outlining some of Soup's exploits, including posing as an engineer that works for Decrypt in order to lure people to a fake Discord server. The online detective with roughly 425,000 Twitter followers claims Soup, working in conjunction with other \"scammers,\" have used phishing tactics to target people associated with crypto projects like Orbiter Finance and Pika Protocol.","Pika Protocol's Discord became \"compromised\" in May, according to ZachXBT, as part of scheme to steal digital assets. \"Scammers posted a malicious link in [Pika Protocol's] announcements channel, helping them steal\" more than $220,000, posted ZachXBT.","In the case of Orbiter Finance, ZachXBT said Soup and fellow culprits used a \"malicious link\" to make away with more than $760,000 worth of assets.","In ZachXBT's Twitter thread, they also alleged Soup used proceeds from online thefts to buy \"exclusive Roblox items.\"","Following online data, including on-chain data and social media posts, ZachXBT has built a reputation on Twitter as a crypto crime fighter of sorts. About a week ago they posted to Twitter an <a href=\"https:\/\/www.theblock.co\/post\/238647\/crypto-drainer-scam\" data-v-f87c67ca=\"\">allegation<\/a> that the YouTuber Blue had stolen more than $1.5 million in digital assets using phishing scams.","After publishing a lengthy Medium post that alleged Jeffrey Huang, aka Machi Big Brother, had orchestrated several \"pump and dump\" schemes, ZachXBT was <a href=\"https:\/\/www.theblock.co\/post\/235220\/crypto-sleuth-zachxbt-sued-for-defamation\" data-v-f87c67ca=\"\">sued<\/a> by Huang. Since then ZachXBT has received <a href=\"https:\/\/www.theblock.co\/post\/235260\/crypto-donors-raise-500000-to-support-zachxbt-in-lawsuit\" data-v-f87c67ca=\"\">significant amount of donations<\/a> to help with the online sleuth's legal defense.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$760,000","content":"MONEY"},{"type":"$220,000","content":"MONEY"},{"type":"$1.5 million","content":"MONEY"},{"type":"Orbiter Finance","content":"ORGANIZATION"},{"type":"Pika Protocol","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Jeffrey Huang","content":"PERSON"},{"type":"Machi Big Brother","content":"ORGANIZATION"},{"type":"Huang","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}