{"summary":"Pluto would become the latest in a spate of early-stage crypto investment vehicles to float in London\nExecutives from Argo Blockchain, the listed crypto miner, have already helped take several crypto investment firms public","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/102168\/crypto-investment-pluto-digital-assets-listing-aquis","publishDate":"2021-04-19T12:26:56","id":3664,"type":null,"title":"Crypto investment firm Pluto Digital Assets plots IPO on Aquis","category":["Cryptocurrency"],"content":["Pluto Digital Assets, an investment firm focused on decentralized technologies, is planning a stock market flotation on the Aquis Stock Exchange in London.","The company was only incorporated in January but <a href=\"https:\/\/www.businesswire.com\/news\/home\/20210310005398\/en\/Pluto-Digital-Assets-Raises-c.40m-to-Accelerate-Investment-in-Decentralised-Technologies\" data-v-f87c67ca=\"\">raised $40 million<\/a> in March in a round led by Argo Blockchain, a crypto mining company that's also listed in London. Pires Investments and Riverfort Global Opportunities also participated in the raise.","People familiar with the matter told The Block that Pluto is currently in discussions with Aquis about listing its shares on the exchange.","Peter Wall, CEO of Argo and a director of Pluto, confirmed that Pluto is “rocketing to its IPO on the London Aquis Exchange, with a target of late May 2021 for its admission.”","“There is a material lack of scalable crypto-oriented companies available on public stock markets in the UK. With the support of its strategic shareholder Argo Blockchain, Pluto is listing to address the gap between the massive growth in DeFi and the lack of equity investment capability available to UK stock exchange investors,” he added.","Argo holds a 25% stake in Pluto, according to <a href=\"https:\/\/www.businesswire.com\/news\/home\/20210310005398\/en\/Pluto-Digital-Assets-Raises-c.40m-to-Accelerate-Investment-in-Decentralised-Technologies\" data-v-f87c67ca=\"\">an announcement<\/a> in March. &nbsp;","Wall and his fellow executives at Argo – which has a market capitalization of $590 million – are making a habit of taking crypto investment vehicles public in London.","He is an adviser to NFT Investments, the non-fungible token investment firm which <a href=\"https:\/\/www.theblockcrypto.com\/linked\/101458\/nft-investments-raises-london-listing\" data-v-f87c67ca=\"\">raised £35 million<\/a> by listing on Aquis on April 13. Argo co-founders Jonathan Bixby and Mike Edwards also <a href=\"https:\/\/www.theblockcrypto.com\/post\/100114\/bitcoin-mining-executives-argo-ipo-nft-investments-london\" data-v-f87c67ca=\"\">sit on the board<\/a> of NFT Investments.","Argo’s Edwards set up Dispersion Holdings, a decentralized finance investment firm which on April 19 announced its intention to float on the Access segment of Aquis Stock Exchange Growth Market. The firm hopes to raise £10 million before expenses at a valuation of £25 million.","A person close to these companies said Pluto differed from NFT Investments and Dispersion in that it has already been in business for a few months, meaning it may take longer to complete checks and balances ahead of a listing. It is not yet clear, they added, how much money Pluto will look to raise or at what valuation. &nbsp;","Pluto would not be the first investment firm of its kind to come to market in London. KR1, a blockchain investment firm founded in 2016, also trades on Aquis. It currently has a market capitalization of £184 million – <a href=\"https:\/\/www.aquis.eu\/aquis-stock-exchange\/member?securityidaqse=KR1\" data-v-f87c67ca=\"\">up significantly<\/a> since the start of the year."],"hashtag":[]}