{"summary":"A stress test commissioned by DeFi lending protocol startup Compound indicated that it can scale its total borrowed value by 10x with less than 1% chance of going default, even when ETH is at its maximum historical volatility\nThis conclusion was reached by subjecting Compound’s protocol to various simulation-based stress tests \nThe study, done by Gauntlet Networks, could help guide users as they assess the financial security of different DeFi lending protocols","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/55304\/defi-startup-compound-commissions-stress-test-to-simulate-default-risks-of-its-lending-protocol","publishDate":"2020-02-07T14:11:30","id":3667,"type":null,"title":"DeFi startup Compound commissions stress test to simulate default risks of its lending protocol","category":["DeFi"],"content":["<span data-v-f87c67ca=\"\">A stress test commissioned by DeFi lending protocol startup Compound suggests that it can scale its total borrowed value by as much as 10x with a less-than-1% chance of going default – even when ETH is at its maximum historical volatility.<\/span>","<span data-v-f87c67ca=\"\"><a href=\"https:\/\/gauntlet.network\/reports\/CompoundMarketRiskAssessment.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">The stress test<\/a>, conducted by blockchain simulation platform Gauntlet Networks, subjects Compound’s protocol to various simulation-based stress tests that replicate how users interact with the lending platform in the live environment. The tests sought to establish whether Compound’s lending mechanism will fall into default risk, defined here as loans being under-collateralized, under extreme conditions.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On Compound, loans are usually over-collateralized, meaning that the value of the collaterals users put down when borrowing assets are greater than the value of the loans themselves. <\/span>","<span data-v-f87c67ca=\"\">However, various market risks, such as a large drop in ETH price, can suddenly render these loans under-collateralized and hence trigger liquidation, performed by <\/span><a href=\"https:\/\/medium.com\/dragonfly-research\/liquidators-the-secret-whales-helping-defi-function-acf132fbea5e\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">liquidators<\/span><\/a><span data-v-f87c67ca=\"\"> who are incentivized by Compound’s lending scheme to identify under-collateralized loans in the pool and liquidate them for profit.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Gauntlet’s study deploys various slippage models, projected price trajectories for different digital assets, liquidator strategies, borrower strategies, etc, and allows them to interact with each other under the simulation. The simulation sought to address three main questions:&nbsp;<\/span>","\"Our conclusions show that the Compound protocol can scale to a larger size and handle high volatility scenarios for a variety of collateral types,\" Gauntlet wrote. \"In particular, we find statistically significant evidence that even when Ether (ETH) realizes its maximum historical volatility, the Compound system is able to grow total borrowed value by more than 10x while having a sub1% chance of default.\"","<span data-v-f87c67ca=\"\">“Potential Compound users can view this report as defining a rigorous actuarial methodology for understanding potential risks, gains, and losses in a multi-agent decentralized system. As new collateral types are added, this can help guide whether their confidence in the choice of system parameters, given market conditions,” Gauntlet CEO Tarun Chitra told The Block.<\/span>","On Thursday, the DeFi community <a href=\"https:\/\/twitter.com\/defipulse\/status\/1225789743171981312?s=20\" data-v-f87c67ca=\"\">celebrated<\/a> crossing the milestone of having $1 billion worth of digital assets locked in DeFi protocols – although on Friday that figure&nbsp;<a href=\"https:\/\/defipulse.com\/\" data-v-f87c67ca=\"\">fell back<\/a> to $995.2 million, according to DeFi Pulse.&nbsp;","\"This allows us, and the community, to better understand what works, and what doesn’t, as the protocol scales,\" Compound CEO Robert Leshner said. \"This report will directly improve how we and eventually the community manage the risk levers (the collateral requirements, and liquidation incentives) to ensure stability.\""],"hashtag":[]}