{"summary":"The second week of November was one of the worst for art and collectibles NFTs sales this year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/124367\/art-collectibles-nft-sales-hit-lowest-point","publishDate":"2021-11-15T12:07:19","id":3668,"type":null,"title":"Weekly art and collectibles NFT sales hit lowest point since January as prices soar","category":["NFTS"],"content":["The second week of November was one of the worst for art and collectibles non-fungible token (NFT) sales this year.","The number of NFTs sold in these categories totaled just 86,870 last week, the lowest number of weekly sales since the first week of January this year, <a href=\"https:\/\/www.theblockcrypto.com\/data\/nft-non-fungible-tokens\/nft-overview\/weekly-nft-sales\" data-v-f87c67ca=\"\">according to The Block Research<\/a>.","&nbsp;<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/nft-overview\/weekly-nft-sales\/embed\" title=\"Weekly NFT Sales by Category\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The data may point to a dropping off in demand for digital art after it skyrocketed during the summer of 2021.","Weekly art and collectibles NFT sales consistently topped 250,000 in October. The highest weekly total for art and collectibles sales this year came in early June when 515,880 items were purchased.","It should also be noted, though, that the <a href=\"https:\/\/www.theblockcrypto.com\/data\/nft-non-fungible-tokens\/nft-overview\/average-price-of-an-nft-sale\" data-v-f87c67ca=\"\">average price of an art and collectibles NFT sale<\/a> has never been higher – topping $127,000 for the first time ever in the last week of October and still hovering around that mark.","&nbsp;<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/nft-overview\/average-price-of-an-nft-sale\/embed\" title=\"Average Price of an NFT Sale by Category (7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","This in part explains why trading volumes in art and collectibles NFTs have <a href=\"https:\/\/www.theblockcrypto.com\/data\/nft-non-fungible-tokens\/nft-overview\/weekly-trade-volume-of-nfts\" data-v-f87c67ca=\"\">remained fairly steady<\/a> at just over $200,000 for the past month; the vast amounts paid by collectors for the rarest items have compensated for the lower number of sales. Beeple’s latest work HUMAN ONE, for example, just <a href=\"https:\/\/decrypt.co\/85704\/nft-artist-beeple-sells-latest-work-29-million-auction\" data-v-f87c67ca=\"\">fetched a cool $29 million<\/a>.","NFT collector and commentator Jason Bailey, who goes by the pseudonym Artnome, suggested that festivities at the conference NFT.NYC may have distracted collectors last week.","“That said, I anticipate a cooling-off period at some point,” he said. “I often describe crypto and NFTs not as a bubble but more like a bubble gun, meaning it goes through ever-growing extreme peaks and valleys.”","Bailey added that he thinks NFTs based on the blockchains Tezos and Solana – which promise lower transaction fees – will eventually lower the barrier to entry for collectors.","Sales of gaming-related NFTs outstripped art and collectibles sales considerably last week, with 439,700 notched, although that too was the lowest number recorded for several months. The average price of gaming NFTs has stayed consistently low throughout the year at just a few hundred dollars.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bailey","content":"PERSON"},{"type":"second week of November","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"last week of October","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$29 million","content":"MONEY"},{"type":"January this year","content":"DATE"},{"type":"Jason Bailey","content":"PERSON"},{"type":"summer of 2021","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"$200,000","content":"MONEY"},{"type":"$127,000","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"Solana","content":"PERSON"}],"hashtag":["BEEPLE"],"authors":["Ryan Weeks","The Block"]}