{"summary":"A 110-year-old Montana powerhouse was recently approved by the Federal Energy Regulatory Commission (FERC) to become a cryptocurrency mining center\nThe powerhouse ceased operations in 2013 and its owner was asked by the commission to either repurpose or demolish it \nThe mining center is said to have minimal impact on the facility’s historic value","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/45116\/escaping-fate-of-demolition-a-century-old-powerhouse-in-us-will-become-crypto-mining-center","publishDate":"2019-10-30T02:45:14","id":3669,"type":null,"title":"Escaping fate of demolition, a century-old powerhouse in US will become crypto mining center","category":["Mining"],"content":["<span data-v-f87c67ca=\"\">A 110-year-old powerhouse in the U.S. state of Montana was recently approved by the Federal Energy Regulatory Commission (FERC) to become a cryptocurrency mining center, escaping the wrecking ball following a prolonged discussion of its fate after it stopped operating six years ago.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Old Rainbow powerhouse, which <\/span><a href=\"https:\/\/www.northwesternenergy.com\/our-company\/about-us\/electric-transmission\/hydroelectric-facilities\/historic-rainbow-powerhouse\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">is said to<\/span><\/a><span data-v-f87c67ca=\"\"> have historical value and to have made major contributions to Montana’s mining and railroad industries in the early 20th century, is a hydroelectric facility located on the Missouri River. In 2009, due to plans to construct a new powerhouse, the commission demanded the powerhouse owner, Northwestern Corporation, to either repurpose the old building or decommission it.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to a FERC document dated Oct. 24 (see below), the Old Rainbow powerhouse completely ceased operation in 2013, although the local community is reluctant to dismantle the facility. As such, Northwestern Corporation had been in search of an alternative use for the building over the past six years, according to the document. In July this year, the company finally proposed to lease the old powerhouse to California-based firm Susteen for cryptocurrency mining, saying that the mining center “would have minimal impact and maintain the historic character of the building.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The document stated that no structural modifications will be made to the building’s existing hoist, walls, and floor. The original generator control room, hydropower board, and murals will also be preserved.&nbsp;<\/span>","\"The proposed data center is supported by the (Old Rainbow powerhouse Repurposing) Committee and would preserve the building's historic character,\" the document states.&nbsp;","<span data-v-f87c67ca=\"\">Susteen is a design solution provider that appears to have just recently ventured into the blockchain space. As such, information about the company’s blockchain offerings is sparse. It is also not clear what kind of cryptocurrencies will be mined and what mining power this new facility will have.<\/span>","<a title=\"View FERC Opinion on Scribd\" href=\"https:\/\/www.scribd.com\/document\/432628782\/FERC-Opinion#from_embed\" data-v-f87c67ca=\"\">FERC Opinion<\/a> by <a title=\"View Celiawan's profile on Scribd\" href=\"https:\/\/www.scribd.com\/user\/474828696\/Celiawan#from_embed\" data-v-f87c67ca=\"\">Celiawan<\/a> on Scribd","<iframe id=\"doc_76034\" class=\"scribd_iframe_embed\" title=\"FERC Opinion\" src=\"https:\/\/www.scribd.com\/embeds\/432628782\/content?start_page=1&amp;view_mode=scroll&amp;access_key=key-8I0y2UN0XJPrMiXQtTwq&amp;show_recommendations=true\" width=\"100%\" height=\"600\" frameborder=\"0\" scrolling=\"no\" data-auto-height=\"false\" data-aspect-ratio=\"0.7729220222793488\" data-v-f87c67ca=\"\"><\/iframe>"],"hashtag":[]}