{"summary":"Aave founder Stani Kulechov has sold an NFT for $1.15 million to an anonymous bidder.\nBut the bidder is undergoing a social experiment, and has to choose one of two options.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/117366\/aave-co-founder-sells-yield-nft-for-1-15-million-with-a-twist","publishDate":"2021-09-10T13:13:54","id":367,"type":null,"title":"Aave founder sells &#x27;Yield&#x27; NFT for $1.15 million — with a twist","category":["NFTs"],"content":["Aave founder Stani Kulechov has sold an <a href=\"https:\/\/foundation.app\/@stani\/yield-by-stani-x-sven-eberwein-82738\" data-v-f87c67ca=\"\">NFT called \"Yield\"<\/a> for 350 ETH, worth $1.15 million, to an anonymous bidder.","But it's not just a short video. It's also a social experiment.","According to the artwork information, the buyer of the NFT faces a dilemma. Either they hold onto the NFT, perhaps wait to see if it rises in value, and then consider selling it to another buyer. Or, they are allowed to return it to Kulechov by October 31, and receive all of their funds back — along with 10% of the value of the NFT or 10 ETH ($33,000), whichever is cheaper.","Since the artwork sold for so much, the buyer would receive the 10 ETH back rather than the 10% of the sale price. But the question is: will they hold onto it, or take the $33,000?","\"The idea was to experiment whether the winner of the auction will go long on the artwork itself and not return it and value the artwork more than actually the transaction,\" Kulechov told The Block. \"It's very fascinating.\"","Kulechov said that he's excited to see whether people will trade it on secondary markets and how it will be priced there. He added, \"Essentially, it's an NFT, it's an art piece and it's just an interesting experiment.\"","The NFT is a video clip showing balloon-like letters of the word \"YIELD\" that expand, filling the screen, and then contract. In the background are silver versions of Kulechov himself. The artwork and social experiment are themed around yield, something that is earned via lending protocols, such as Aave.","The artwork was created by Sven Eberwein, an NFT artist with 48 artworks on <a href=\"https:\/\/superrare.com\/sveneberwein\" data-v-f87c67ca=\"\">SuperRare<\/a>. The bidding lasted one day and included bids from NFT artist pplpleasr, who designed Fortune's crypto cover, which was sold as NFTs for $1.3 million last month."],"hashtag":["AAVE"]}