{"summary":"Lightning Network has reached an all-time high in terms of capacity or the amount of Bitcoin locked in payment channels.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/208817\/lightning-network-reaches-all-time-high-in-bitcoin-capacity","publishDate":"2023-02-06T06:41:42","id":367,"type":null,"title":"Lightning Network reaches all-time high in bitcoin capacity","category":["CRYPTO ECOSYSTEMS"],"content":["Lightning Network, a Layer 2 payment network built on top of the Bitcoin blockchain, has reached an all-time high in terms of capacity, or the amount of bitcoin (BTC) locked in payment channels.","The payment channel capacity on the Lightning Network has grown 63% since the beginning of last year, according to <a href=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/lightning-networks-capacity-daily\" data-v-f87c67ca=\"\">data<\/a> from The Block Research. Currently, the network has over 5,490 BTC ($128 million) in capacity, up from 3,350 BTC on Jan. 1, 2022. This is being seen as a positive sign for the adoption of Bitcoin transactions.","The Lightning Network is a second-layer payment protocol built on top of the Bitcoin blockchain, designed to enable fast and cheap micropayments by allowing participants to transact directly without the need for immediate settlement on the blockchain. It operates as a network of bi-directional payment channels between participants, allowing for off-chain transactions that are eventually settled on the Bitcoin blockchain.","It was designed to mitigate the issues seen on the Bitcoin mainnet, such as slow transaction speeds and high fees. The network achieves this by enabling users to open payment channels between themselves, which allows it to handle high amounts of low-value transfers without having to broadcast every transaction to the Bitcoin main network.","The network's ability to mitigate the issues seen on the Bitcoin mainnet has made it an attractive option for both businesses and individuals. For example, the integration of Bitcoin payments in El Salvador was made possible by <a href=\"https:\/\/www.theblock.co\/post\/192445\/bitcoin-lightning-strike-payments-3-african-countries\" data-v-f87c67ca=\"\">Strike<\/a>, a payment service based on the Lightning Network. Similarly, Twitter <a href=\"https:\/\/www.theblock.co\/post\/118450\/twitter-rolls-out-bitcoin-tipping-for-ios-users-via-lightning-looks-to-nfts-for-the-future\" data-v-f87c67ca=\"\">adopted<\/a> the Lightning Network to enable Bitcoin tips on its platform in 2021.","The growth of the Lightning Network's capacity coincides with a short-term rally in Bitcoin's price. The cryptocurrency has increased by 38% since January 1, 2023, rising from $16,500 to $22,800 at the time of writing, per CoinGecko <a href=\"https:\/\/www.coingecko.com\/en\/coins\/bitcoin\" data-v-f87c67ca=\"\">data<\/a>. The price is still down 66% from an all-time high of $69,000 recorded in November 2021.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/lightning-networks-capacity-daily\/embed\" title=\"Lightning Network's Capacity\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"El Salvador","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Bitcoin blockchain","content":"PERSON"},{"type":"January 1, 2023","content":"DATE"},{"type":"66%","content":"PERCENT"},{"type":"$69,000","content":"MONEY"},{"type":"63%","content":"PERCENT"},{"type":"last year","content":"DATE"},{"type":"Jan. 1, 2022","content":"DATE"},{"type":"$128 million","content":"MONEY"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"38%","content":"PERCENT"},{"type":"$22,800","content":"MONEY"},{"type":"November 2021","content":"DATE"},{"type":"$16,500","content":"MONEY"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["BITCOIN"],"authors":["Vishal Chawla","The Block"]}