{"summary":"Silvergate’s Q4 earnings show the bank has kept up its momentum to close out 2020. \nCEO Alan Lane says 2021 plans include examining additional ways to monetize the bank’s payments network, especially through lending.\nWith the earnings report came an announcement of a follow-on public offering of $200 million in Class A shares.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/91887\/silvergate-q4-results-2020-offering","publishDate":"2021-01-20T18:00:38","id":3670,"type":null,"title":"Silvergate keeps momentum in 2020, and is exploring growth for 2021","category":["Startups"],"content":["Silvergate continued to see growth in Q4 of 2020, and CEO Alan Lane is looking to capitalize on it in 2021 with plans to monetize the bitcoin bank's payments platform.","Silvergate plans to build on its strong Q4 results by further exploring lending and custody opportunities related to its payments network — and has kicked of 2021 with a $200 million follow-on public offering to bolster its growth efforts.","The close of 2020 showed Silvergate kept its trending momentum, finishing out the year with considerable gains compared to 2019. The bank doubled its net income compared to Q4 2019, seeing an increase from $3.6 million at $0.19 per diluted share to $9.1 million at $0.47 per diluted share.","Still, total 2020 net income only slightly outperformed the previous year. It closed 2019 with a net income of $24.8 million, while 2020's net income was $26 million.","Noninterest bearing deposits saw an increase, which Silvergate attributed to crypto exchange deposits and institutional investments. Seventy-six exchanges accounted for 47.2% of the total deposits as of 2020, which reached $3.7 billion. That's an $800,000 increase from 2019, when 29.1% of total deposits were held by 60 exchanges.&nbsp;","Digital currency customer fee income jumped significantly in 2020, reaching $11.1 million compared to 2019's $4.9 million.","<iframe title=\"Silvergate Fee Income from Digital Currency Customers (Quarterly)\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/public-companies\/silvergate-fee-income-from-digital-currency-customers-quarterly\/embed\" width=\"100%\" height=\"420\" frameborder=\"0\" data-v-f87c67ca=\"\"><\/iframe>","The Silvergate Exchange Network (SEN), the bank's payments network, continues to be the backbone of the company, according to Lane. Transactions in Q4 reached over $59 billion in volume — a 62% increase from the previous quarter.&nbsp;","“Looking ahead to 2021, I am extremely excited about the multiple paths to continued growth and opportunities to monetize the SEN platform, such as digital asset lending and custodial services,\" said Lane.","<iframe title=\"Silvergate SEN Network Transfer Volume (Quarterly)\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/public-companies\/sen-transfer-volume\/embed\" width=\"100%\" height=\"420\" frameborder=\"0\" data-v-f87c67ca=\"\"><\/iframe>","This likely means further building out SEN Leverage, the bank's lending product. Silvergate launched a pilot in 2020 and has since become a \"core product,\" according to Lane. The product allows customers to receive dollar loans collateralized by bitcoin.","\"We anticipate increased demand for this offering over the next year,\" said Lane.","In addition to its plans for lending, the bank will launch <a href=\"https:\/\/ir.silvergatebank.com\/news\/news-details\/2021\/Silvergate-Launches-Follow-on-Public-Offering-of-Class-A-Common-Stock\/default.aspx\" data-v-f87c67ca=\"\">a follow-on public offering of Class A shares<\/a>, according to a new announcement. The bank filed an S-3 with the Securities and Exchange Commission (SEC) today which permits the public offering of $200 million of shares.","The net proceeds will go to keeping Silvergate's capital at a compliant level and support growth \"organically or through strategic acquisitions. Net proceeds also may support the SEN Leverage lending product or other services.&nbsp;","Silvergate's earnings were originally scheduled for Jan. 25 before the firm decided to push the announcement forward. Now, the accompanying earnings call will take place on Jan. 21 at 8:00AM EST.&nbsp;"],"hashtag":["EARNINGS"]}