{"summary":"CertiK, a blockchain and smart contract auditing firm, has raised another $80 million.\nThe firm is now valued at nearly $1 billion.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/125892\/blockchain-auditing-firm-certik-raises-another-80-million-in-series-b2-funding","publishDate":"2021-12-01T08:00:05","id":3677,"type":null,"title":"Blockchain auditing firm CertiK raises another $80M in Series B2 funding","category":["Venture Capital"],"content":["CertiK, a blockchain and smart contract auditing firm, has raised $80 million in a Series B2 funding round and is now valued at nearly $1 billion.","Sequoia Capital led the round, with existing investors, including Tiger Global, Coatue Management, and GL Ventures (Hillhouse Capital's VC arm) also participating.","The Series B2 round comes just three months after CertiK <a href=\"https:\/\/www.theblockcrypto.com\/post\/114769\/blockchain-security-firm-certik-raises-24-million-series-b\" data-v-f87c67ca=\"\">raised $24 million<\/a> in a Series B+ round in August. And in July, the firm <a href=\"https:\/\/www.theblockcrypto.com\/post\/111240\/blockchain-audit-certik-37-million-series-b-coatue-shunwei\" data-v-f87c67ca=\"\">raised $37 million<\/a> in a Series B round.","New York-based CertiK has now raised over $140 million in the last five months.","The firm continues to see a surge in demand for its products in the wake of crypto and DeFi hacks. This year, over $1 billion in crypto has been lost to hacks, exploits, and scams compared to over $500 million in 2020, said CertiK.","\"We are seeing demand from a mixed set of projects, both large and small,\" CertiK co-founder Ronghui Gu told The Block.\"We also have a global presence with projects across multiple countries.\"","CertiK audits smart contracts of blockchain projects to ensure they are secure to launch and use. To date, CertiK says it has provided services to over 1,800 clients, detected over 31,000 vulnerabilities in blockchain code, and protected over $310 billion worth of crypto assets. Its clients include Aave, Polygon, and Terra.","CertiK also runs an active blockchain transaction monitoring platform called Skynet. The platform detects and alerts suspicious on-chain activities such as flash loan attacks on a dashboard called Security Leaderboard. All of its products are revenue-generating, and the firm has been profitable since last year.","With fresh capital at hand, CertiK plans to continue developing more features for its security products. The firm employs over 130 people and is currently hiring for various roles.","\"CertiK is on a mission to secure the crypto world — end to end, throughout the lifecycle of smart contracts and blockchains,\" said Gu."],"hashtag":["SERIES B","SMART CONTRACTS"]}