{"summary":"Senators have reintroduced an amendment that failed to clear the Senate after the passage of the infrastructure bill last year.\nThe amendment would clarify the “broker” definition for crypto firms. ","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/161352\/us-senators-reintroduce-amendment-to-clarify-broker-definition-in-infrastructure-law","publishDate":"2022-08-03T20:50:04","id":368,"type":null,"title":"US Senators reintroduce amendment to clarify &#x27;broker&#x27; definition in infrastructure law","category":["Regulation"],"content":["A coalition of US senators have reintroduced a piece of legislation that would clarify reporting requirements for crypto firms set by last year's Infrastructure Investment and Jobs Act.","The amendment would exempt miners, network validators and other providers that don't conduct broker-like activity.&nbsp;","The passage of the infrastructure bill included a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/114079\/senate-passes-trillion-dollar-infrastructure-bill-with-unamended-crypto-tax-language\" data-v-f87c67ca=\"\">definition<\/a> for \"broker\" that could potentially encompass a variety of crypto entities that don't have access to the necessary information and would be unable to comply with the requirements, like miners or wallet providers. The definition was <a href=\"https:\/\/www.theblockcrypto.com\/post\/117800\/house-committee-approves-crypto-tax-provisions-as-budget-reconciliation-package-advances\" data-v-f87c67ca=\"\">hotly debated<\/a> by industry players and lawmakers during the passage of the bill, though the original language ultimately made it to the final version.&nbsp;","To fill in the gaps for firms caught in the middle, U.S. Senators Pat Toomey, R-Pa, Mark Warner, D-Va., Cynthia Lummis, R-Wyo., Kyrsten Sinema, D-Ariz., and Rob Portman, R-Ohio, introduced an amendment that would specifically exclude those entities. The text is identical to a <a href=\"https:\/\/www.theblock.co\/post\/113957\/senators-compromise-crypto-tax-infrastructure-bill\" data-v-f87c67ca=\"\">version<\/a> introduced last year, according to the group. The original submission never cleared the Senate due to a <a href=\"https:\/\/www.theblock.co\/linked\/113997\/crypto-infrastructure-bill-compromise-dies-senate\" data-v-f87c67ca=\"\">procedural issue<\/a>.&nbsp;","\"This amendment had strong bipartisan support last August, and there’s no reason it shouldn’t be signed into law,” Toomey said in a statement.&nbsp;","While Congress members attempt to provide clarity, the Treasury Department has plans to do the same. After the passage of the infrastructure bill, <a href=\"https:\/\/www.theblock.co\/linked\/114560\/treasury-preps-guidance-on-infrastructure-bills-crypto-tax-reporting-rules-report\" data-v-f87c67ca=\"\">reports<\/a> circulated that the Treasury was preparing guidance to define a digital asset \"broker.\" It also backed the amendment when lawmakers submitted it<a href=\"https:\/\/www.banking.senate.gov\/newsroom\/minority\/toomey-warner-lummis-sinema-portman-announce-agreement-on-digital-asset-reporting-requirements-in-infrastructure-bill\" data-v-f87c67ca=\"\"> last year<\/a>.&nbsp;"],"hashtag":["CONGRESS"]}