{"summary":"Binance and P2P trading platform Paxful have joined hands to bring bitcoin to masses\nPaxful supports over 300 payment methods, including gift cards and online wallets\nArtur Schaback, co-founder and COO of Paxful, told The Block: “This gives an opportunity for the unbanked and underbanked to be part of a new ecosystem”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/50281\/binance-paxful-partner-to-bring-bitcoin-to-masses-as-the-latter-supports-over-300-payment-methods","publishDate":"2019-12-12T07:10:08","id":3680,"type":null,"title":"Binance, Paxful partner to bring bitcoin to masses as the latter supports over 300 payment methods","category":["Bitcoin"],"content":["Cryptocurrency exchange Binance and peer-to-peer (P2P) trading platform Paxful have joined hands to bring bitcoin to the masses.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe partnership will allow Binance users to utilize Paxful’s platform to buy bitcoin (BTC) with 10 fiat currencies directly on Binance.com&nbsp; – Russian ruble (RUB), Vietnamese dong (VND), Indonesian rupiah (IDR), Nigerian naira (NGN), Colombian peso (COP), British pound (GBP), Mexican peso (MXN), Canadian dollar (CAD), euro (EUR) and Argentine peso (ARS).<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIn other words, Paxful is now another Binance fiat gateway partner,<a href=\"https:\/\/www.theblockcrypto.com\/linked\/46614\/binance-adds-support-for-euro-bringing-the-total-to-5-currencies-for-its-direct-fiat-to-crypto-trading-facility\" data-v-f87c67ca=\"\"> joining<\/a> the list of Koinal, Simplex, Paxos, TrustToken, Flutterwave and AdvCash. Binance already allows buying of bitcoin via these partners, but Paxful’s support of hundreds of payment methods is the key differentiator.&nbsp;","“Unlike other payment gateways, Paxful supports more than 300 payment methods including local currency bank transfers, gift cards, and online wallets,\" Artur Schaback,&nbsp; co-founder and COO of Paxful, told The Block. \"This gives an opportunity for the unbanked and underbanked to be part of a new ecosystem.\"","He further explained that Nigeria, for instance, has restrictive banking rules, so residents of this country can use gift cards to buy bitcoin via Paxful to fund their Binance accounts.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nPaxful said it currently supports 167 fiat currencies on its platform, but for Binance integration, it is supporting 10 fiat currencies for now and could add support for more “in the near future.”&nbsp; Paxful charges an escrow fee on the trades that go through its platform; the<a href=\"https:\/\/paxful.com\/support\/en-us\/articles\/360013609793-Paxful-fees\" data-v-f87c67ca=\"\"> fees<\/a> varies per payment method.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBinance continues to expand channels for its fiat gateway. Currently, there are seven such channels, apart from customer-to-customer (C2C) trading facility.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","Changpeng “CZ” Zhao, CEO of Binance, called the partnership with Paxful a “significant” one because “a new pool of users will have access to alternative fiat payment methods available on Paxful, including local currency bank transfers and some of the world’s most popular digital wallets.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nPaxful saw nearly $30 million in peer-to-peer bitcoin trades last month, per the announcement. While in the past 12 months, the platform has <a href=\"https:\/\/www.theblockcrypto.com\/post\/44475\/p2p-bitcoin-trading-platform-paxful-adds-800k-wallets-in-the-past-12-months-driven-by-growth-in-africa\" data-v-f87c67ca=\"\">added<\/a> over 800,000 wallets and now services a total of 3 million wallets.","The platform currently only supports bitcoin on its platform and wants to remain a bitcoin-only platform, Schaback told The Block recently, adding: “We believe that there should only be one cryptocurrency to make the financial revolution happen.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIn related news, Binance also <a href=\"https:\/\/binance.zendesk.com\/hc\/en-us\/articles\/360037850371-Binance-Opens-Brazilian-real-BRL-and-Argentine-peso-ARS-Fiat-Gateway-Through-Latamex\" data-v-f87c67ca=\"\">announced<\/a> a partnership with cryptocurrency exchange LatamEx today, allowing users to buy four cryptocurrencies - bitcoin (BTC), Binance coin (BNB), ether (ETH) and Binance stablecoin (BUSD) - using Brazilian real (BRL) and Argentine peso (ARS)."],"hashtag":["BINANCE"]}