{"summary":"Square and Twitter CEO Jack Dorsey took the stage at Bitcoin 2021 in Miami on Friday.\nHe discussed his views on bitcoin and at one point drew heckles from a right-wing activist.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/107341\/jack-dorsey-defends-his-decentralization-beliefs-during-bitcoin-conference-appearance","publishDate":"2021-06-04T16:05:55","id":3681,"type":null,"title":"Jack Dorsey defends his decentralization beliefs during bitcoin conference appearance","category":["The Block"],"content":["Twitter CEO Jack Dorsey reiterated his commitment to make bitcoin “the native currency for the internet\" on Friday.","During Bitcoin 2021 Dorsey touted the Bitcoin network as a means of fairer economic systems for all people during his fireside chat, Banking the Unbanked. Human Rights Foundation chief strategy officer Alex Gladstein led the conversation.","Dorsey is said to be considering whether to add bitcoin to social media giant <a href=\"https:\/\/www.theblockcrypto.com\/linked\/94459\/twitter-cfo-bitcoin-btc-balance-sheet-comments\" data-v-f87c67ca=\"\">Twitter’s balance sheet<\/a>, and his payments firm <a href=\"https:\/\/www.theblockcrypto.com\/post\/80196\/square-bitcoin-purchase-details-paper\" data-v-f87c67ca=\"\">Square<\/a> already holds bitcoin on its balance sheet. While other firms like Michael Saylor’s MicroStrategy have touted bitcoin as an inflation hedge and a store of value for companies, Dorsey said Square integrated crypto payments and holds crypto itself as part of a larger mission to make bitcoin a widely used means of payment for all.","“The only reason Square got into bitcoin was to that end,” he said.","Dorsey said he doesn’t see central bank digital currency (CBDC) as a viable solution given its centralization and lack of privacy. Bitcoin replaces any need for a CBDC, according to Dorsey.","“The more we and our governments realize that and get in the boat sooner, the better off we all are,” he said.","But regulators aren’t overly concerned with bitcoin’s “bad actor” narrative, according to Dorsey. Though some claim that bitcoin’s privacy-focused nature makes it a breeding ground for crime, such as repeated comments from Rep. Brad Sherman and other lawmakers, Dorsey said Square hasn’t heard that line much from its regulators.","“Square was one of the first companies that was a public company that talked with the [Securities and Exchange Commission] about bitcoin — that never came up,” he said.","At one point during the fireside chat, far-right activist and former Congressional candidate Laura Loomer interrupted Dorsey by shouting from the crowd, calling Dorsey the “king of censorship,” and accusing him of inconsistency in his stance towards decentralization in finance but not in speech. Twitter has moved to <a href=\"https:\/\/www.theblockcrypto.com\/linked\/97835\/twitter-suspension-crypto-influencers\" data-v-f87c67ca=\"\">suspend<\/a> the accounts of those it views as spreading misinformation or violating other terms of service on its platform, including Loomer.","“How can you say that this is a currency for everyone in the world when you are the king of censorship?” asked Loomer.","Loomer has been banned for her commentary on Twitter as well as Clubhouse, Facebook and other major platforms.","Dorsey sought to address Loomer’s comments by committing to integrating decentralization into his social media efforts, and pointed to Twitter’s forthcoming decentralized project BlueSky. BlueSky is a team of five open-source architects creating a decentralized standard for social media, according to Dorsey. Though in 2019 Dorsey <a href=\"https:\/\/twitter.com\/jack\/status\/1204766095246118912?s=20\" data-v-f87c67ca=\"\">said<\/a> the system wouldn’t be ready for “many years,” Dorsey doubled down on his commitment to see it through.","“I know you don’t believe me, I know you’re saying ‘liar,’” said Dorsey. “I’m going to prove it to you and then we can have another conversation later.”","Part of realizing a decentralized world is building noncustodial infrastructure, according to Dorsey. That’s why he <a href=\"https:\/\/www.theblockcrypto.com\/linked\/107250\/jack-dorsey-says-square-is-weighing-a-possible-bitcoin-hardware-wallet\" data-v-f87c67ca=\"\">announced<\/a> Square’s interest in building a noncustodial hardware wallet just minutes before he took the stage. The purpose, he said, was to solicit industry feedback on the design.","“We don’t want to compete with the hardware wallets out there, we just want to take it to the next level and get to a hundred more million people who have noncustodial solutions,” he said."],"hashtag":["BITCOIN"]}