{"summary":"A Chinese state-owned bank appears to have released a test app for mobile phones that supports the People’s Bank of China (PBoC)’s digital currency project\nThe test app was issued by the Agricultural Bank of China\n The Agricultural Bank of China was one of the companies tasked by the PBoC last year to run the pilot program","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/61819\/chinese-state-owned-bank-releases-test-app-for-central-banks-digital-currency","publishDate":"2020-04-14T14:25:03","id":3684,"type":null,"title":"Chinese state-owned bank releases test app for central bank&#x27;s digital currency","category":["Asia"],"content":["A Chinese state-owned bank appears to have released a mobile test app that supports the People's Bank of China (PBOC)'s digital currency project.","<a href=\"https:\/\/wxcredit.test.abchina.com\/MBRCard\/netBank\/zh_CN\/Entrance\/dcepapp.html\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">A web link<\/a> obtained by The Block directs users to download a payments app issued by the Agricultural Bank of China, as a dialogue box in the web link shows.","The app displays several features related to the new digital currency, including digital currency exchange, wallet management, transaction tracking, and connecting other wallets.&nbsp;","These features, however, appear to be unavailable to the general public for now. When The Block tried to register an account in the app to investigate these features, the system said that an account cannot be created because the personal information provided does not match with the \"white list\" – likely a list of approved users for the test.&nbsp;","The new app will likely be available via four cities' local branches of the Agricultural Bank of China, including Shenzhen, Xiong'An, Chengdu, and Suzhou.","","","&nbsp;","As The Block <a href=\"https:\/\/www.theblockcrypto.com\/post\/49659\/report-chinas-central-bank-to-test-digital-currency-in-two-cities-partnering-with-state-backed-commercial-banks-and-telecom-giants\" data-v-f87c67ca=\"\">reported<\/a> in December 2019, PBOC had partnered with seven state-owned companies, including four commercial banks and three telecom giants, to test the new digital currency. The Agricultural Bank of China was one of the companies tasked with running the pilot program.&nbsp;","In January, the central bank made several additional comments on the digital currency initiative, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/52092\/chinas-digital-currency-progressing-smoothly-says-central-bank\" data-v-f87c67ca=\"\">saying that<\/a> it was \"progressing smoothly\" and the \"top-level\" design <a href=\"https:\/\/www.theblockcrypto.com\/linked\/52616\/chinas-central-bank-says-it-has-completed-top-level-design-of-digital-currency\" data-v-f87c67ca=\"\">had been completed<\/a>.&nbsp;"],"hashtag":[]}