{"summary":"Binance has let go over 1.000 people in recent weeks, said The Wall Street Journal.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239695\/binance-dismissed-more-than-1000-employees-in-recent-weeks-wsj","publishDate":"2023-07-14T13:07:47","id":3684,"type":null,"title":"Binance dismissed more than 1,000 employees in recent weeks: WSJ","category":["COMPANIES"],"content":["Binance, the world's biggest cryptocurrency exchange, has laid off more than 1,000 employee in recent weeks, The Wall Street Journal <a href=\"https:\/\/www.wsj.com\/articles\/binance-lays-off-over-1-000-employees-d59ff6ad\" data-v-f87c67ca=\"\">reported<\/a>, citing a source.","Binance could continue to lay more people off, potentially dismissing \"more than a third of its staff,\" the person said.","Earlier this month, Binance chief strategy officer Patrick Hillman <a href=\"https:\/\/www.theblock.co\/post\/238245\/binance-strategy-chief-confirms-hes-leaving-company-amid-reports-of-departures\" data-v-f87c67ca=\"\">confirmed<\/a> he was departing the company, saying he was doing so on good terms. Fortune had reported that he, along with other top executives, were departing the company.","Last week, Binance CEO Changpeng \"CZ\" Zhao <a href=\"https:\/\/www.theblock.co\/post\/237907\/binance-cz-crypto-trading-volumes\" data-v-f87c67ca=\"\">painted<\/a> a somewhat optimistic picture, saying he was readying his platform for increased trading volume over the next six to 18 months. \"We're still very early. I think the industry still has a lot of room to grow,\" Zhao said. \"So I'm always bullish. I'm a builder, so I always have a positive outlook on things.\"","At the end May, Binance <a href=\"https:\/\/www.theblock.co\/post\/232696\/binance-layoffs-cuts-jobs\" data-v-f87c67ca=\"\">laid off<\/a> non-performers and non-culturally fit people, the exchange said. Before the move, the company's total headcount was around 8,000.","Although it has maintained its position as the top crypto exchange, Binance recently saw a 3% decrease in market share, according to a <a href=\"https:\/\/tokeninsight.com\/en\/research\/reports\/crypto-exchange-report-2023q2\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">report<\/a> from crypto research firm TokenInsight.","&nbsp;","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Patrick Hillman","content":"PERSON"},{"type":"3%","content":"PERCENT"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Zhao","content":"PERSON"}],"hashtag":["LAYOFFS"],"authors":["RT Watson","The Block"]}