{"summary":"The modular DeFi Layer 2 network will receive the grant of up to 2 million OP tokens ($5.3 million) to support user growth incentives.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274038\/mode-2-million-op-grant-optimism-foundation","publishDate":"2024-01-23T10:00:03","id":3685,"type":null,"title":"Mode to receive up to 2 million OP grant from the Optimism Foundation","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Modular DeFi Layer 2 network Mode is set to receive up to 2 million <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248388\/optimism-op-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/Optimism.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">OP<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.68%\n    <\/span><\/a> <!----><\/span> tokens — worth approximately $5.3 million at current prices — as a grant from the Optimism Foundation to support user growth incentives on the platform.<\/span>","Mode, built using Optimism's OP Stack, will commit a portion of its sequencer revenue to the Optimism Collective and opt into the Law of Chains — an open neutrality framework designed to govern the Superchain network — as part of the initiative.","In Layer 2 networks, sequencers are responsible for ordering transactions before they are batched and submitted to the main chain, in this case, Ethereum. The Optimism Collective is a community designed to reward public goods for Ethereum, according to its website.","The Superchain is Optimism’s network of multiple Layer 2 blockchains, designed to scale Ethereum. Other chains that are part of the Superchain ecosystem include OP Mainnet itself, the Coinbase-incubated Base network, Zora Network and Manta Pacific.","Mode’s objective is to become a DeFi hub for the Superchain, founder James Ross said in a statement — focusing on growing interoperable DeFi applications and infrastructure.","Mode said it will continue to develop open-source tools for the Superchain ecosystem, focusing on bringing native yield, smart treasuries and on-chain AI agents to the network, as well as committing resources to public goods.","Mode plans to launch its mainnet at the end of January.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"James Ross","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"-1.68%","content":"PERCENT"},{"type":"$5.3 million","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Manta Pacific","content":"LOCATION"},{"type":"Zora Network","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ETHEREUM","OPTIMISM"],"authors":["James Hunt","The Block"]}