{"summary":"Boxer Floyd Mayweather is releasing NFTs on May 26.\nThe NFTs will feature a limited-edition digital collection involving Mayweather’s life and career, including memorabilia.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/104428\/boxing-champion-floyd-mayweather-nfts-may","publishDate":"2021-05-11T09:03:24","id":3689,"type":null,"title":"Boxer Floyd Mayweather is releasing NFTs later this month","category":["NFTs"],"content":["Boxer Floyd Mayweather is releasing non-fungible tokens (NFTs) later this month.","Mayweather has partnered with three NFT firms — IronBend, Reality Gaming Group, and Zytara Labs — for the initiative. The NFTs will drop on May 26, ahead of Mayweather's fight with YouTuber-turned-boxer Logan Paul on June 6.","NFTs are blockchain tokens tied to unique digital things. They have soared in popularity in recent months. From Paris Hilton to Lindsay Lohan to Jack Dorsey, several celebrities and personalities have issued NFTs.","Mayweather's NFTs will feature a limited-edition digital collection involving his life and career, including animations, artwork, and memorabilia from his personal keepsakes. \"There will be a digital collection of 5 NFT pieces, including a rare 1 of 1,\" Al Burgio, founder and CEO of Zytara Labs, told The Block.","\"Right now, my career is over, but my name will always live on for the things that I did and for the legacy that I left and the mark that I left in sports,\" <a href=\"https:\/\/www.youtube.com\/watch?v=gGe92cH8UP4\" data-v-f87c67ca=\"\">said Mayweather.<\/a>","It is not clear on which blockchain network the NFTs will be based on and on which marketplace they will be sold, Burgio told The Block that those details would be disclosed before the May 26 sale.","Mayweather's NFT effort comes over two years after he settled with the U.S. Securities and Exchange Commission (SEC) over initial coin offering (ICO) promotions. Mayweather had to pay a fine of over $600,000 as he hadn't disclosed that he was getting paid for the ICO promotions."],"hashtag":[]}