{"summary":"Kraken is launching its own bank thanks to some help from Wyoming.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/77804\/kraken-crypto-bank-launch-wyoming","publishDate":"2020-09-16T10:26:14","id":369,"type":null,"title":"Kraken is launching a crypto bank in Wyoming, paving the way for possible stock offerings","category":["STARTUPS"],"content":["Cryptocurrency exchange Kraken is launching a bank under a new regulatory framework in Wyoming, a move that will expand its product suite, the firm said in an announcement Wednesday.&nbsp;","Headquartered in Wyoming, Kraken Financial will be regulated by the Wyoming Division of Banking under a so-called Special Purpose Depository Institution. The new structure was purpose-built for cryptocurrency companies and will allow Kraken to offer certain banking functions to clients and effectively serve as the exchange operator's primary banking relationship.&nbsp;Up until this point, Kraken has relied on third-party providers for wire transfers and other services that enable it to engage with the broader financial system.","Crypto firms have a history of challenging and precarious banking relationships.&nbsp;Most traditional banks have refused to offer services to such firms, while some offshore exchanges like Bitfinex have had trouble maintaining relationships with banking partners. To be sure, there are some small community banks aimed at the crypto market—such as Signature and Silvergate—but they have had issues with <a href=\"https:\/\/www.theblockcrypto.com\/post\/59457\/silvergates-clients-experience-outbound-wire-transfer-issues-tied-to-problems-with-fedwire-payments-processor\" data-v-f87c67ca=\"\">outbound wire transfers<\/a>&nbsp;in the past. Still, big banks are moving into the market with JPMorgan recently taking on exchanges Coinbase and Gemini as <a href=\"https:\/\/www.theblockcrypto.com\/post\/59457\/silvergates-clients-experience-outbound-wire-transfer-issues-tied-to-problems-with-fedwire-payments-processor\" data-v-f87c67ca=\"\">banking clients<\/a>.&nbsp;","\"For Kraken, this represents a better banking infrastructure,\" Dave Kinitsky, CEO of Kraken Financial, said in a phone interview with The Block. \"This will require less reliance on third-party providers and offers more certainty from a regulatory perspective and will allow us to launch new products for new customer segments.\"","\"Having an affiliate company allows us to more closely integrate this into our product experience,\" he said. For end clients, that could result in quicker transfers between their external accounts and their Kraken account, according to Kinitsky.&nbsp;","Clients will also be able to bank directly with Kraken Financial just as they would with their existing bank. To start, the firm will offer clients the ability to deposit USD and digital assets, which \"will be seamlessly integrated into the existing exchange services, providing clients better funding infrastructure, a better experience and enhanced regulatory clarity,\" as per a press release.&nbsp;","\"There's going to be a phased approach to this,\" said Kinitsky. \"In the first phase we expect to be the bank of choice for our clients and in phase two or three we will begin offering new services and products.\"","For instance, Kinitsky said the firm could launch a crypto debit card, a yield account product, or an IRA product. Its banking status could also allow it to offer services in stock, derivatives or commodities trading, he added.&nbsp;","\"<b data-v-f87c67ca=\"\"><\/b>Finally, we expect to be able to offer additional retail, wealth management and treasury services (and potentially other asset classes such as securities), so stay tuned!\" a press release said.&nbsp;","To be sure, Kraken isn't alone in its aspiration to be a crypto bank. Elsewhere, BlockFi is working on building out a suite of <a href=\"https:\/\/www.theblockcrypto.com\/post\/75338\/blockfi-raises-50-million-eyes-potential-spac\" data-v-f87c67ca=\"\">wealth-management products<\/a> for crypto, including an upcoming credit card. Meanwhile, Abra—which offers an interest-bearing account for crypto—also has its own ambitions to \"re-define\" the traditional banking stack, as noted by CEO Bill Barhydt in a recent phone conversation.&nbsp;","As for Kraken, it has to dot a few i's before it can officially launch its new bank. The firm is in the process of lining correspondent banking partners and opening an account with the Federal Reserve. It's also not clear if every state will respect the status of Kraken's new bank charter.","\"We are on route and we expect to get the charter approval on Wednesday and then we lock-up those relationships and move to launch,\" said Kinitsky.&nbsp;\"We expect reciprocity from other states and have talked with a number of them and expect the lion share to have reciprocity as they do for other out of state-chartered banking institutions.\"","New York, which Kraken has spared with in the past, could be one state that will require additional steps for reciprocity, Kinitsky said.&nbsp;","\"There would be a couple things we'd have to do for New York,\" he said. \"For instance, would have to have a physical bank branch and reconcile some things with the BitLicense.\"","<em data-v-f87c67ca=\"\">The Block's news director Frank Chaparro spoke with Kraken chief legal officer Marco Santori about the news. The interview audio can be found below:<\/em>","<iframe src=\"https:\/\/playlist.megaphone.fm?e=BLOCK7698290304\" width=\"100%\" height=\"200\" frameborder=\"0\" scrolling=\"no\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"Dave Kinitsky","content":"PERSON"},{"type":"Special Purpose Depository Institution","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Kinitsky","content":"PERSON"},{"type":"Wyoming Division of Banking","content":"ORGANIZATION"},{"type":"Bill Barhydt","content":"PERSON"},{"type":"Wyoming","content":"LOCATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Kraken Financial","content":"ORGANIZATION"},{"type":"IRA","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Marco Santori","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"}],"hashtag":["KRAKEN"],"authors":["Frank Chaparro","The Block"]}