{"summary":"10T Holdings CEO Dan Tapiero said bitcoin could easily rise to $200,000 based on previous market cycles.\nHe contrasted the exploding demand from the bitcoin ETFs with the upcoming supply shock of the halving to support his view.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283200\/10t-holdings-dan-tapiero-predicts-bitcoin-could-easily-hit-200000-amid-etfs-and-halving","publishDate":"2024-03-18T16:02:37","id":369,"type":null,"title":"10T Holdings’ Dan Tapiero predicts bitcoin could easily hit $200,000 amid ETFs and halving","category":["Markets"],"content":["With the combination of increased demand for bitcoin through ETFs and the upcoming supply shock of the halving, private equity firm 10T Holdings' CEO Dan Tapiero reckons there’s upside potential for the cryptocurrency.","<b data-v-f87c67ca=\"\">“<\/b>I think we could easily see a price close to $200,000,” Tapiero told The Block in an interview at the Digital Asset Summit in London. “I don't think it's so crazy.”","Tapiero explained that this would be an increase of around three times the current price, roughly matching the percentage difference between the 2017 and 2021 peaks. He added that bitcoin rose around 20 times from the lows of the bear market to the 2021 peak, meaning that were that to repeat, bitcoin could rise even higher toward the $300,000 mark.","“It’s hard to put a fine point on these things and also the timing is very difficult. I think broadly we'll get to that place over the next 18 to 24 months and it could be sooner,” he said.","As for the upcoming <a href=\"https:\/\/www.theblock.co\/halving\" data-v-f87c67ca=\"\">bitcoin halving<\/a>, Tapiero described it as another fundamental bullish factor on a macro level. “If you think about the supply being reduced at a time that the demand is exploding based on the ETF, it really points to a lot of upside for bitcoin. And I think bitcoin will drag everything else with it,” he said.","As for Ethereum, Tapiero reckons there’s a pretty good chance that there will be a spot Ethereum ETF as the underlying asset has become established and reached a network effect. However, he is unsure when they will be approved.","<span data-v-f87c67ca=\"\">\"<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.36%\n    <\/span><\/a> <!----><\/span><\/span> and Ethereum, to me, are the core assets. Everything else is a venture project. And Solana's sort of transitioning from a venture to maybe a core asset,” he said.<\/span>","Tapiero noted that solana has been outperforming the rest of the market recently. He said that there’s been an explosion of onchain activity recently, and while some of it may be memecoin related, that doesn’t particularly matter — it’s all part of a “massive bull trend.”","“I just believe that all of the value in space is going to go up multiples. Now and certainly over the next five years,” he added."],"hashtag":["BITCOIN","SPOT BITCOIN ETF"]}