{"summary":"In 2018, the Securities and Exchange Commission filed a preliminary injunction to freeze Longfin Corp.’s assets as the agency investigated whether the corporation violated securities laws\nNow, the SEC has filed a complaint alleging fraudulent activity by Longfin and those who ran it\nThe commission alleges Longfin engaged in fraud to meet requirements of listing on Nasdaq among other concerns","author":["Nelson Rosario","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/26383\/sec-pursues-concerns-of-fraudulent-activity-by-longfin-corp","publishDate":"2019-06-08T08:00:58","id":3690,"type":null,"title":"SEC pursues concerns of fraudulent activity by Longfin Corp.","category":["Legal"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","In many ways, the Crypto Bull Run of 2017™ was a once-in-a-lifetime period of Monty Python-esque financial absurdity. Anybody with a dream, the ability to copy\/paste, and a “team” could raise millions of dollars. Everyone wanted in on blockchain. Startups were launched, and existing companies pivoted; however, not all pivots are good ideas. This case involves a company that claimed to pivot, but maybe they didn’t and, well, allegedly not everything they were claiming was true. C’est la vie.","For those that don’t remember, Longfin Corp. was the company whose stock grabbed an exclusive ticket to the moon after they announced in Dec. 2017 that they had acquired a cryptocurrency company. Apparently, Longfin’s CEO owned at least 92% of the company they acquired. What did Longfin do that they were pivoting from? Good question! Longfin was a company incorporated in February 2017, that did, umm, well, they didn’t really do anything. As the complaint alleges, Longfin was a corporate shell that its owner, Meenavalli, was attempting to get listed on the NASDAQ, because reasons.","Back in May of 2018, the SEC secured a preliminary injunction against Longfin to freeze their assets while the SEC continued their investigation into whether Longfin had violated securities laws. Apparently, if this complaint is to be believed, there was a lot to investigate.","This newly filed complaint alleges a lot of fraudulent activity by Longfin and the people that ran it. In particular, the SEC is charging them with violations of the anti-fraud provisions of the securities laws for basically cooking their books to meet the requirements for being listed on the NASDAQ. That’s not great. Additionally, Longfin claimed to be a U.S. company, so that it could file for a Reg A securities offering, and it looks like it may have actually been an Indian company. As the complaint alleges “Longfin’s presence in the United States consisted of an office rented from WeWork, a provider of shared office space, which was staffed by a single 23-year-old individual.”","If you get yourself listed on a major stock exchange based off of misrepresentations related to your revenue, your corporate location, and whatever it is your company is doing, you’re going to have a bad time. Point in fact, there is a parallel criminal case against the CEO in the District of New Jersey. Having the SEC charge you with fraud and the U.S. Attorney’s office go after you is about as bad as it gets. It’s not looking up for Longfin. C’est la vie.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part II of this week's analysis, Crypto Caselaw Minute, is above.<\/em>"],"hashtag":["SEC"]}