{"summary":"A stablecoins bill expected to advance next month could be about to hit a speed bump.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235858\/fed-should-play-role-in-regulating-stablecoins-chair-powell-says","publishDate":"2023-06-21T11:25:23","id":3690,"type":null,"title":"Fed should play role in regulating stablecoins, Chair Powell says","category":["POLICY"],"content":["Legislation to create a comprehensive regulatory <a href=\"https:\/\/www.theblock.co\/post\/235852\/u-s-house-committee-to-vote-on-crypto-stablecoin-legislation-in-july\" data-v-f87c67ca=\"\">framework<\/a> for stablecoins in the U.S. could be approaching a speed bump, with Federal Reserve Chair Jerome Powell arguing for a robust federal role in the regulation of the sector.","“We do see payment stablecoins as money,” he said in testimony in front of the House Financial Services Committee on Wednesday, adding that&nbsp;the central bank should play a role in approving stablecoin issuance. “We believe that it would be appropriate to have a quite robust federal role in what happens in stablecoins going forward, and leaving us with a weak role and allowing a lot of private money creation at the state level would be a mistake.”","Powell sounded skeptical of state approval and preemption for stablecoin issuers, currently part a Republican-led proposal set for debate at the committee level.","The top Democrat on the House Financial Services Committee, Rep. Maxine Waters, also sounded critical of the proposal from her Republican counterparts to allow state regulators to approve stablecoin issuance.","“This proposal takes state preemption to a whole new level,” Waters said, referencing how a stablecoin approved in one state could then be sold across the country, whether or not other state regulators signed off. &nbsp;","Though Republicans can advance the bill out of committee and the House of Representatives on a party line vote, it needs support from Democrats in order to become law. Democrats hold a majority in the Senate and President Joe Biden would be loath to sign legislation that his own party does not support.","U.S. stablecoin giant Circle, among others, supports the creation of a new framework for stablecoin issuers. Fintech companies, especially payments providers, have long complained about their lack of access to a single registration to do business across the U.S., instead needing to register state-by-state as money service providers.","The bill aims to allow a simpler path for stablecoin providers, who would also be subject to disclosures and regulatory oversight. U.S. financial regulators have called on Congress to pass new <a href=\"https:\/\/www.theblock.co\/post\/174527\/senior-u-s-regulators-propose-new-legislation-increased-rules-around-digital-assets\" data-v-f87c67ca=\"\">regulations<\/a> for stablecoins, with more urgency to the matter since the Terra\/Luna collapse last year.&nbsp;","House Financial Services Committee Chair Patrick McHenry, R-N.C., said he expects a <a href=\"https:\/\/www.theblock.co\/post\/235852\/u-s-house-committee-to-vote-on-crypto-stablecoin-legislation-in-july\" data-v-f87c67ca=\"\">vote<\/a> on the stablecoin bill, along with a digital assets market structure bill, in the second week of July.","Powell also used his appearance before Congress to knock down the suggestion that the Fed might issue a digital dollar directly to Americans, or that a digital dollar was on the near-term horizon.&nbsp;","Asked whether a digital dollar could disrupt financial privacy, Powell responded, \"Potentially, and that's not something we would not support.\"","The Fed chair noted that the central bank is \"a long way\" from deciding whether to issue a CBDC, but noted again that if a digital dollar does happen, it would be issued in a way to maintain financial privacy and not displace the existing financial system.","\"We would not support accounts at the Federal Reserve by individuals,\" while adding that. \"if we were to support, at some point in the future, a CBDC, it would be one that would be intermediated through the banking system and not directly at the Fed,\" due in part to privacy concerns, Powell said.","<em data-v-f87c67ca=\"\">UPDATE: With additional Powell comments on central bank digital currency. <\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Maxine Waters","content":"PERSON"},{"type":"Fed","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Powell","content":"PERSON"},{"type":"House of Representatives","content":"ORGANIZATION"},{"type":"House Financial Services Committee Chair Patrick McHenry","content":"ORGANIZATION"},{"type":"Jerome Powell","content":"PERSON"},{"type":"second week of July","content":"DATE"},{"type":"Terra\/Luna","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"Joe Biden","content":"PERSON"},{"type":"Senate","content":"ORGANIZATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["CONGRESS","FEDERAL RESERVE","HOUSE FINANCIAL SERVICES COMMITTEE","JEROME POWELL","MAXINE WATERS","PATRICK MCHENRY"],"authors":["Colin Wilhelm","The Block"]}