{"summary":"Blockchain network NuCypher has raised $10 million in fresh funding, led by Polychain Capital, and with participation from over 10 other investors\n\nNuCypher co-founder and CEO, MacLane Wilkison, told The Block that the funding has brought the network’s valuation to $133 million\n\nThe network has launched its public testnet today, while mainnet is expected to launch by Q1 2020","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/42280\/y-combinator-bitmain-polychain-invest-over-10m-in-blockchain-network-nucypher-ahead-of-its-mainnet-launch","publishDate":"2019-10-07T08:00:40","id":3693,"type":null,"title":"Y Combinator, Bitmain, Polychain invest over $10M in blockchain network NuCypher ahead of its mainnet launch","category":["Investments"],"content":["NuCypher, a blockchain network that brings data privacy to decentralized applications (dApps) built on Ethereum and other public blockchains, has raised $10.67 million in new funding ahead of its mainnet launch.","The round is led by venture firm Polychain Capital, with participation from Y Combinator, Bitmain, Bitfury, Arrington XRP Capital, Notation Capital, and over 10 other firms, according to an announcement Monday.","NuCypher said the investors purchased its native tokens, NU, worth $10.675 million or 8% of the initial supply. The investos also agreed to stake-lock their tokens for two years, meaning they will stake and run nodes of the network for at least two years, the firm added.","MacLane Wilkison, co-founder and CEO of NuCypher, told The Block that the funding was raised via a SAFT (Simple Agreement for Future Tokens) Series 2 sale, bringing the firm’s total funding to date to $15.825 million and valuation at $133 million.","NuCypher hit the scene in 2015, aiming to help dApp developers to store, share and manage private data on public blockchains. For instance, if a developer is building a healthcare app on top of Ethereum and wants to store patient medical records in a decentralized storage system such as Protocol Labs’ InterPlanetary File System (IPFS), NuCypher helps keep those records private and confidential via its network using cryptographic techniques.","“Simply encrypting the records with the patient's key isn't quite enough since those records might need to be shared with doctors, hospitals, or insurance providers. The NuCypher network provides the functionality needed to keep data encrypted and also shareable with valid recipients under certain conditions, but protected from everyone else (including the network itself),” explained Wilkison.","He further said that while services like Amazon Web Services, Google Cloud and Microsoft Azure offer cloud-based key management technologies, these all are “centralized” solutions and don't protect the data from the cloud provider itself. “At NuCypher, we're explicitly focused on cryptographic approaches to data privacy with mathematically provable security.”","NuCypher has today also launched a public testnet of its network. It will allow developers to build applications as well as run nodes without NuCypher’s permission, Wilkison told The Block.","He added that the new capital will help NuCypher stress-test the network and support remaining development. While the network hasn't finalized a date for its mainnet launch yet, it estimates to go live by Q1 of 2020, Wilkison told The Block, adding that the network is \"fully implemented\" but bug fixes, user experience (UX) enhancements, and stability improvements are the \"bulk of the remaining work.”","When asked why NuCypher needs its native token NU, Wilkison told The Block that it is a “work token,\" which is used exclusively for staking as an <a href=\"https:\/\/en.wikipedia.org\/wiki\/Sybil_attack\" data-v-f87c67ca=\"\">anti-Sybil mechanism<\/a> and to coordinate the network. “Without Sybil protection, anyone can spin up limitless numbers of malicious nodes and wreak havoc on the network.”","NuCypher, however, is not focused on the liquidity of its tokens and is leaving it to the \"discretion of the market,” said Wilkison.","NuCypher, for now, is all geared for its mainnet launch via a team of 13, primarily into cryptography and engineering functions. While the firm is not actively looking to add new members to its team, Wilkison said it is open to “opportunistically” hire engineers if there's a good fit. The firm also doesn’t have plans to raise any more funds in the medium-term."],"hashtag":[]}