{"summary":"Arwen, a Layer 2 blockchain protocol startup, has secured $3.3 million in venture funding to streamline trade settlement between institutional investors. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/54977\/layer-2-blockchain-protocol-arwen-raises-3-3m-to-streamline-trade-settlement-with-atomic-swaps","publishDate":"2020-02-05T09:00:11","id":3695,"type":null,"title":"Layer 2 blockchain protocol Arwen raises $3.3M to streamline trade settlement with atomic swaps","category":["INVESTMENTS"],"content":["<span data-v-f87c67ca=\"\">Arwen, a Layer 2 blockchain protocol startup, has secured $3.3 million in venture funding to streamline trade settlement between institutional investors.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The round, led by Slow Ventures with participation from Coinshares, Collaborative Fund, Underscore VC, and DG Lab Fund, will help the Boston-based firm in its bid to capture institutional traders who are looking for secure solutions to transact large trades, according to an <a href=\"https:\/\/medium.com\/@arwensecure\/arwen-receives-3-3m-in-funding-to-develop-technology-for-digital-asset-trade-settlement-543ff5279383\" data-v-f87c67ca=\"\">announcement<\/a> on Wednesday.<\/span>","<span data-v-f87c67ca=\"\">Traditionally, investors conducting a large trade have to manually complete transactions while maintaining constant communication with the counterparties to ensure those transactions go through. Not only is this process \"cumbersome,\" but it can also expose investors to counterparty risk, Arwen CEO Sharon Goldberg told The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Arwen develops a <a href=\"https:\/\/www.arwen.io\/whitepaper.pdf\" data-v-f87c67ca=\"\">Layer 2 protocol<\/a> that is similar to the Lightning Network but works across different blockchains. Under the protocol, every trade will first require two escrows funded by the two counterparties. After the trade is finalized, an atomic swap will be performed, switching ownership of the escrowed funds and automatically completing the settlement process.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“That whole process of checking and manually doing a lot of these bilateral trades is very slow, cumbersome, and unautomated. That's where we are focusing on, to make sure the settlement is more efficient,” said Goldberg.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Arwen launched its mainnet in April 2019. At the time, the firm primarily catered to retail investors and partnered with centralized exchange KuCoin to allow users to trade on the platform without conceding autonomy over their private keys. The protocol currently supports trading of bitcoin (BTC), bitcoin cash (BCH), litecoin (LTC), and ether (ETH).&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Trading efficiency, liquidity, and ease of use are critical for markets to adopt new technologies and new processes. Arwen allows market participants to optimize for all of these factors while also maximizing asset security,” Coinshares chief investment officer Meltem Demirors told The Block. <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$3.3 million","content":"MONEY"},{"type":"BCH","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Boston","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"Arwen CEO Sharon Goldberg","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Goldberg","content":"PERSON"},{"type":"April 2019","content":"DATE"},{"type":"LTC","content":"ORGANIZATION"},{"type":"Meltem Demirors","content":"PERSON"}],"hashtag":[],"authors":["Celia Wan","The Block"]}