{"summary":"CyberConnect, a crypto startup developing tools for Web3 applications, has raised $10 million.\nCyberConnect is launching a “decentralized social graph protocol” that it says will help Web3 developers to build applications more easily.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/124510\/web3-social-infrastructure-startup-cyberconnect-raises-10-million-in-seed-funding","publishDate":"2021-11-16T13:30:15","id":3700,"type":null,"title":"Web3 infrastructure startup CyberConnect raises $10M in seed funding","category":["The Block"],"content":["CyberConnect, a crypto startup developing tools for Web3 social media, gaming, and metaverse applications, has raised $10 million in a seed funding round.","Sharing the news exclusively with The Block on Tuesday, CyberConnect said Multicoin Capital and Sky9 Capital co-led the round. Animoca Brands, Draper Dragon, Hashed, Zoo Capital, Smrti Lab, and Mask Network also participated in the round, among other investors.","This was an equity + SAFT (simple agreement for future tokens) round, CyberConnect founder Wilson Wei told The Block. It will help the firm double its current team of 15, grow the community of Web3 developers, and launch its protocol later this month, said Wei.","CyberConnect is launching a \"decentralized social graph protocol\" that it says will help Web3 developers to build applications such as social media, gaming, and metaverse more easily.","Social graphs are people’s social relations on platforms such as Twitter, Facebook, and Instagram. Wei said social graphs are one of the hardest aspects of developing Web3 applications. \"Cyberconnect streamlines the development process,\" he said. With CyberConnect, Web3 developers can mobilize social graphs data, such as following and followers lists, saving them the cost and difficulty rebuilding a social graph every time when launching a new app, explained Wei.","As for end users, they will be able to own their social graphs data and port that data to new applications, said Wei.","Letting users own their social graph and switch applications while taking their network with themselves is one of the core public services web3 can deliver, a16z general partner Chris Dixon <a href=\"https:\/\/twitter.com\/cdixon\/status\/1458785312231116802\" data-v-f87c67ca=\"\">tweeted<\/a> recently. \"This is how email works and there is no reason all social services can’t work this way,\" he wrote.","CyberConnect has also developed an app called CyberChat to demonstrate how social graph data can be utilized. The app will integrate with the CyberConnect protocol.","The protocol is scheduled to launch later this month with support for Ethereum. It plans to support other blockchain chains \"as early as later this year.\""],"hashtag":["SOCIAL MEDIA"]}