{"summary":"Jason Leung, Global Head at Cumberland – one of the U.S.’s biggest trading desks – has decided to leave the firm \nHis departure is the latest in a string of executive exits\nChris Zuehlke, Cumberland’s Chief Technology Officer, is set to replace him","author":["Isabel Woodford","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/26182\/cumberland-bids-farewell-to-its-global-head-and-final-og","publishDate":"2019-06-06T11:41:29","id":3705,"type":null,"title":"Cumberland bids farewell to its Global Head and final OG","category":["OTC"],"content":["Jason Leung, the man who has helmed DRW's crypto trading operation, has opted to leave the firm, The Block has learned.","It is the firm's second executive departure this month following Bobby Cho,<a href=\"https:\/\/www.theblockcrypto.com\/tiny\/bobby-cho-exits-drws-cumberland\/\" data-v-f87c67ca=\"\"> Cumberland's former COO.<\/a> Former Goldman Sachs exec James Radecki also left the firm after a one-year stint in March,<a href=\"https:\/\/www.theblockcrypto.com\/2019\/03\/20\/cumberlands-business-development-head-james-radecki-set-to-depart-firm\/\" data-v-f87c67ca=\"\"> as first reported by The Block.<\/a> The departure leaves the unit with a younger, more tech-centric staff,<a href=\"https:\/\/www.theblockcrypto.com\/2019\/05\/02\/new-tech-and-younger-faces-drws-cumberland-looks-different-its-counter-parties-say\/\" data-v-f87c67ca=\"\"> sources say.<\/a>","Leung, a former Bank of America principal and Citadel trader, joined Cumberland's parent company DRW in 2013, stepping into the executive role at its crypto operations in 2017. Launched in 2014, Cumberland was one of the first instances of mainstream financial services entering the digital currencies market. Recently, Cumberland rolled out a new electronic trading platform, dubbed Marea, to interact with its trading counter-parties.","Don Wilson, founder and CEO of <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">DRW, announced the news in a written statement to staff and counterparties today.&nbsp;<\/span><\/span>","\"Jason Leung, the Global Head of Cumberland, has made the decision to leave the firm. Jason brought his deep expertise in FX to this nascent asset class, helping us take important steps towards the level of sophistication I believe Cumberland needs to offer,\" it read.","Leung was one of the four old-guard execs at <a href=\"https:\/\/www.theblockcrypto.com\/post\/16676\/cumberlands-business-development-head-james-radecki-set-to-depart-firm\" data-v-f87c67ca=\"\">Cumberland<\/a>, having helped build out the desk. <span data-v-f87c67ca=\"\">Ac<\/span><span data-v-f87c67ca=\"\">cording to a memo sent earlier this year, he had recently been promoted to oversee business development and relationship management.<\/span>","Chris Zuehlke, Cumberland’s Chief Technology Officer, will replace Leung; an \"obvious move\" according to Wilson. Zuehlke joined DRW<span data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">nearly 15 years ago, and reportedly helped introduce \"<\/span><\/span>a more institutional focus at Cumberland.\"","It is unclear what Leung's next steps will be."],"hashtag":[]}