{"summary":"Iceland&#x27;s PM wants her country, the most energy rich in the world, per capita, to mine fewer Bitcoin and grow more corn.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284326\/icelands-pm-gives-cold-shoulder-to-crypto-as-miners-search-worldwide-for-cheap-electricity-reports","publishDate":"2024-03-23T14:38:41","id":3708,"type":null,"title":"Iceland&#x27;s PM gives cold shoulder to crypto as miners search worldwide for cheap electricity: Reports","category":["CRYPTO INFRASTRUCTURE"],"content":["Iceland's vast network of hydroelectric and geothermal plants have made the island nation the world's largest energy producer per capita. A robust crypto mining industry has also made it the world's foremost Bitcoin hashrate producer by the same metric. Yet when Prime Minister Katrín Jakobsdóttir looks to the future, she prefers to picture corn over crypto mining.&nbsp;","Jakobsdóttir, speaking to the Financial Times, outlined a goal of increased food production for the country alongside a transfer of renewable energy away from the crypto mining industry and towards's Iceland's households and other industries.&nbsp;“Bitcoin is an issue worldwide . . . but data centres in Iceland use a significant share of our green energy,” she reportedly <a href=\"https:\/\/www.ft.com\/content\/6432a24b-b7c4-4c2f-85a8-79108dbe0644\" data-v-f87c67ca=\"\">said<\/a>.&nbsp;","The price of Iceland's 100% renewable electricity is insulated from fluctuations in global fuel prices, making the country an attractive destination for crypto miners. However, with electricity growing scarcer under high demand and with few new power plants under construction, the crypto mining industry is not expected to grow in the country, <a href=\"https:\/\/hashrateindex.com\/blog\/bitcoin-mining-around-the-world-iceland\/\" data-v-f87c67ca=\"\">according<\/a> to research firm Luxor.&nbsp;","The Prime Minister, who once <a href=\"https:\/\/www.politico.eu\/article\/iceland-bitcoin-cryptocurrency-heist-suspect-may-have-fled-on-pm-katrin-jakobsdottir-plane\/\" data-v-f87c67ca=\"\">coincidentally<\/a> took the same flight as a man suspected of stealing $2 million in crypto miners from around the country before fleeing to Sweden, said her focus on agriculture comes from a desire to rely less on imported food.&nbsp;","<strong data-v-f87c67ca=\"\">Last-generation miners go global<\/strong>","Bitcoin's upcoming block reward halving, now <a href=\"https:\/\/www.theblock.co\/post\/283623\/bitcoin-halving-event-a-month-away\" data-v-f87c67ca=\"\">less than a month away<\/a>, has nonetheless spurred new worldwide demand for last generation crypto miners owned by U.S.-based companies, according to a recent report from Bloomberg.","Those machines, such as some 600,000 Bitmain Antminer s19 series miners which cost <a href=\"https:\/\/data.hashrateindex.com\/chart\/asic-prices-per-model\" data-v-f87c67ca=\"\">up to $11,500 each<\/a> at their peak, are on their way out of the U.S. and headed towards growing mining operations in Africa and South America where energy is cheaper, the <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2024-03-23\/bitcoin-halving-spurs-exodus-of-old-us-mining-computers-abroad\" data-v-f87c67ca=\"\">report<\/a> states. After the halving, each machine is estimated to fetch only around $350.&nbsp;","While China and Iceland were two of the first countries with significant crypto mining industries, this next wave is seeing more development in South America and Africa. Chinese miners are <a href=\"https:\/\/www.theblock.co\/post\/277007\/ethiopias-cheap-electricity-is-attracting-chinese-mining-companies-bloomberg\" data-v-f87c67ca=\"\">targeting Ethiopia<\/a> in particular, drawn by the low energy costs though wary of the area's political instability.&nbsp;&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ethiopia","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Sweden","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"$11,500","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$2 million","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"South America","content":"LOCATION"},{"type":"100%","content":"PERCENT"},{"type":"Iceland","content":"LOCATION"},{"type":"Financial Times","content":"ORGANIZATION"},{"type":"Luxor","content":"LOCATION"},{"type":"Africa","content":"LOCATION"},{"type":"China","content":"LOCATION"},{"type":"Katrín Jakobsdóttir","content":"PERSON"},{"type":"$350","content":"MONEY"}],"hashtag":["MINING COMPANIES"],"authors":["Zack Abrams","The Block"]}