{"summary":"Ethereum-based interoperability project Connext has raised $2.2 million in seed funding, led by Polychain Capital.\nWith fresh capital at hand, Connext looks to seed the early network liquidity and expand its team to launch the full network, founder Arjun Bhuptani told The Block.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/98961\/ethereum-based-interoperability-project-connext-raises-2-2-million-seed-round","publishDate":"2021-03-22T08:15:16","id":3709,"type":null,"title":"Ethereum-based interoperability project Connext raises $2.2 million in fresh funding","category":["Ethereum"],"content":["<a href=\"https:\/\/www.theblockcrypto.com\/linked\/38494\/an-ethereum-based-lottery-app-launches-updates-after-hitting-150000-dai-in-lottery-pool\" data-v-f87c67ca=\"\">Ethereum-based<\/a> interoperability project Connext has raised $2.2 million in seed funding, according to a statement shared with The Block on Monday.","The round was led by Polychain Capital, with participation from 1kx and Huobi Capital. With fresh capital at hand, Connext looks to seed the early network liquidity and expand its team to launch the full network, founder Arjun Bhuptani told The Block.","Connext is building a cross-chain liquidity network to enable fast and noncustodial swaps within the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/38548\/offchain-labs-announces-coinbase-investment-and-alpha-launch-of-ethereum-scaling-software\" data-v-f87c67ca=\"\">Ethereum<\/a> ecosystem, including Layer-2 scaling solutions. For example, if a user has funds on Arbitrum and wants to use an application on Optimism, with Connext, they will be able to directly call the contract on Optimism using funds they have on Arbitrum, bypassing the 1-week waiting period on Arbitrum and its Layer1 fees, Bhuptani told The Block.","\"There are several other approaches to interoperability out there. None of them really focus on Ethereum and the Ethereum scalability ecosystem like we do,\" said Bhuptani, adding that other approaches are either slow and expensive or difficult to use.","There are currently seven people working for Connext. The project is looking to hire five more people in the next three months — 3 developers, one product marketer, and one community\/communications person — said Bhuptani.","Connext, currently available in a limited version, expects to launch the whole network within the next 3-6 months, Bhuptani told The Block.","The seed round brings Connext total funding to date to over $3.7 million. The project, which was into payment channels infrastructure until last year, raised a little over $1 million in 2017 and subsequently raised a $500,000 bridge round in 2019 from Consensys Ventures.","Connext looks to raise more funds \"relatively soon,\" said Bhuptani, because that there is a \"clear market need\" for its network.","\"For fast, frequent cross-chain interactions that are baked natively into the user's experience, Connext is the only option out there at the moment, and we think it's a winner-take-all market,\" said Bhuptani."],"hashtag":["ETHEREUM"]}