{"summary":"The HBAR Foundation, the organization working on the Hedera blockchain, said that it had noticed network irregularities affecting various Hedera decentralized applications (dApps) and their users.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/218416\/hedera-blockchain-undergoing-technical-irregularities-hbar-foundation-says","publishDate":"2023-03-09T08:33:39","id":3712,"type":null,"title":"Hedera blockchain undergoing technical irregularities, HBAR Foundation says","category":["CRYPTO ECOSYSTEMS"],"content":["The HBAR Foundation, the organization behind the Hedera blockchain, <a href=\"https:\/\/twitter.com\/HBAR_foundation\/status\/1633803120328208386\" data-v-f87c67ca=\"\">said<\/a> network irregularities are affecting various Hedera decentralized applications (dApps) and their users.","Hashport, a bridge project, <a href=\"https:\/\/twitter.com\/HashportNetwork\/status\/1633771330280767488\" data-v-f87c67ca=\"\">said<\/a> it temporarily paused services due to the smart contract irregularities on Hedera. Yet another project, Pangolin, a decentralized exchange in the Hedera ecosystem, <a href=\"https:\/\/twitter.com\/Pangolin_Hedera\/status\/1633771791415132162\" data-v-f87c67ca=\"\">advised<\/a> users to withdraw liquidity from the platform.","\"Due to some Hedera network irregularities, Hashport has paused their bridge, and we'd encourage anyone with HTS tokens in Pangolin Pools and Farms to withdraw immediately. This is a time critical moment, so we'll update as soon as we have more information,\" Pangolin said in a tweet.","The HBAR Foundation said it's working with affected partners and monitoring the situation to resolve the issue.","SaucerSwap Labs, a DeFi project on Hedera, <a href=\"https:\/\/twitter.com\/SaucerSwapLabs\/status\/1633796307289505793\" data-v-f87c67ca=\"\">claimed<\/a> there may be an ongoing exploit currently impacting the network. The exploit, according to SaucerSwap, targets the decompiling process in smart contracts.","The HBAR Foundation didn't immediately respond to a request for comment on the possibility of an exploit.&nbsp;","SaucerSwap further <a href=\"https:\/\/twitter.com\/SaucerSwapLabs\/status\/1633796307289505793\" data-v-f87c67ca=\"\">alleged<\/a> that an unknown attacker has already targeted Pangolin and HeliSwap decentralized exchange pools containing wrapped assets, but it was not able to clarify if any tokens had been stolen.","<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">\"An ongoing exploit have hit the <\/span><span class=\"css-901oao css-16my406 r-poiln3 r-b88u0q r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Hedera<\/span><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\"> network this morning. The exploit is targeting the decompiling process in smart contracts. At time of writing attackers have hit Pangolin and HeliSwap pools containing wrapped assets,\" SaucerSwap <a href=\"https:\/\/twitter.com\/SaucerSwapLabs\/status\/1633796307289505793\" data-v-f87c67ca=\"\">noted<\/a>.<\/span>","In the context of smart contracts, decompiling is the process of converting compiled bytecode back into its original human-readable code.&nbsp;Decompiling can be used to analyze and understand the behavior of a smart contract. However, it can also be used by malicious actors to gain unauthorized access or manipulate the smart contract. Still, the exact nature of the alleged exploit remains unclear.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"HBAR Foundation","content":"ORGANIZATION"},{"type":"this morning","content":"TIME"},{"type":"Pangolin","content":"PERSON"},{"type":"Pangolin","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Hedera","content":"ORGANIZATION"},{"type":"Pangolin Pools","content":"ORGANIZATION"},{"type":"Hashport","content":"PERSON"},{"type":"Hedera","content":"LOCATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}