{"summary":"Berk v. Coinbase, Inc., “Order Denying Motion to Compel; Granting in Part and Denying in Part Motion to Dismiss”, Case No 18-cv-01364-V, N.D. Cal., August","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/35381\/fed-court-says-coinbase-can-be-held-negligent-for-allowing-dysfunctional-market-and-why-this-matters","publishDate":"2019-08-09T08:30:00","id":3715,"type":null,"title":"Fed Court says Coinbase can be held negligent for allowing &quot;dysfunctional market&quot; and why this matters","category":["LEGAL"],"content":["<strong class=\"lp mg\" data-v-f87c67ca=\"\">Berk v. Coinbase, Inc., “Order Denying Motion to Compel; Granting in Part and Denying in Part Motion to Dismiss”, Case No 18-cv-01364-V, N.D. Cal., August 6, 2019 [SDP]<\/strong>","<a href=\"https:\/\/www.scribd.com\/document\/421054454\/Berk-v-Coinbase\" data-v-f87c67ca=\"\">Link to opinion<\/a>","<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Disclaimer: Crypto Caselaw Minute is provided for educational purposes only by Nelson Rosario (@nelsonmrosario) and Stephen Palley (@stephendpalley). These summaries are not legal advice. They are our opinions only, aren’t authorized by any past, present or future client or employer. Also, we might change our minds. We contain multitudes. &nbsp;<\/em><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">As always, Rosario summaries are “NMR” and Palley summaries are “SDP”. &nbsp;<\/em>","Before we get to Berk v. Coinbase, how about first year law school in 30 seconds? Sounds like fun, doesn’t it? If you already finished law school you can skip ahead of course (or read so you can accuse me of over-simplifying several hundred years of jurisprudence).","Most first year law students in the United States take at least one contract law class and one tort law class. Tort and contract law are two fundamental building blocks of the legal system. They help define the legal obligations that people have to one another. In a very (VERY) broad brush fashion, you can distinguish between the two by saying that contracts are agreements between parties to perform obligations in exchange for some kind of “consideration” (money, for example). You don’t have a contractual duty to someone unless you enter into a contract. And the nice thing about contracts is that if you know what you are doing you can limit your liability to your counter-party.","Torts are a different animal. They are a category of causes of action that are implied or imposed by law, even where there is no contract. I have a feeling some law professor somewhere is going to quibble with that definition, so let me give an example. If I agree to cut your grass for 10 dollars a week and you agree to pay me 10 dollars, that’s a basic contract. (Yes, I am simplifying, I know, I know). But I didn’t have a duty to you to cut your grass a priori, right? Nor you to pay me 10 dollars for doing so. The reciprocal duties are created by a contract. A tort duty is something different and can be quite a bit more … mushy (a term of art, that). If I shovel my sidewalk, for example, and do a terrible job and you slip and fall on my negligently shoveled sidewalk, you might sue me for negligence (I’ll win, I’m sure, because you were obviously careless). I don’t have a contract with you, as a stranger, to shovel my own darn sidewalk. But courts have said that we have a duty to use reasonable care to prevent harm to foreseeable plaintiffs. And if the breach of that duty causes harm, whelp, you can sue for negligence. There are plenty of other torts besides negligence, by the way, but that’s a for example for you.","Contracts take a lot of forms. Website terms of services are an example, and that gets us back from first-year law school to the <a class=\"cj cf mc md me mf\" href=\"https:\/\/www.scribd.com\/document\/421054454\/Berk-v-Coinbase\" data-v-f87c67ca=\"\">Berk v. Coinbase<\/a> case. We first wrote about this one back in CCM in October and you can read a summary of the facts there. In short, this case has to do with the launch of Bitcoin Cash and its availability to Coinbase customers.","Coinbase previously asked the Court to require the parties arbitrate this dispute, based on an arbitration clause in their online terms of service. Coinbase asked again and the Court said no dice. The general rule in the 9th Circuit (which is where this case is being litigated) is that an arbitration clause that applies to all disputes “arising under” the parties’ agreement is interpreted narrowly, and only applies to claims that “refer to disputes or controversies relating to the interpretation and performance of the contract itself.” Those claims by plaintiffs that were “premised on Coinbase’s alleged facilitation of insider trading or alleged market manipulation” did not arise under the Coinbase terms of service, according to the Court, so the arbitration clause didn’t apply. So too is the plaintiff’s theory that “that Coinbase negligently launched a dysfunctional trading market for Bitcoin Cash.” The Court says this is “too collateral” to the user agreement. So the arbitration clause didn’t apply.","The Court then analyzed a motion to dismiss the negligence claims that Coinbase filed. Coinbase cited something called the economic loss rule, which says that “one does not possess a duty to exercise reasonable care against the economic loss of others.” The court rejected Coinbase’s argument and held that under California law it believed that","that Coinbase indeed had a duty to maintain a functional marketplace. First, Coinbase encouraged traders to enter the market following its launch of trading in Bitcoin Cash, so Coinbase’s actions were aimed at the traders as a class. Second, the negligent launch of a digital currency foreseeably impacts those who trade in the resulting dysfunctional market. Third, the buyers suffered an ascertainable pocketbook injury, and fourth, that injury is directly tied to the allegedly negligent launch. As to the fifth and sixth factors, California cases suggest that the defendant’s conduct is morally blameworthy, and a policy of preventing future harm is warranted, when the defendant holds a position of trust, such as Coinbase’s role in processing the transactions of traders on its exchange.","The Court said that for purposes of analyzing the motion to dismiss, in which the facts must be taken as true,","the complaint also lays out a plausible account that Coinbase breached its duty to maintain a functional market. For starters, the fact that Coinbase halted trading within three minutes of the launch is indicative of dysfunction. The buyers have also identified precautions Coinbase could have taken to avert the massive spike in the price of Bitcoin Cash on its exchange. Most prominently, Coinbase could have announced its launch of trading in Bitcoin Cash more than an hour in advance, which would have permitted more buyers and sellers to place limit orders. That way, Coinbase could have ensured the liquidity and market capitalization needed for an orderly market. Id. Coinbase instead launched trading while only purchase orders were pending. And the buyers have alleged a plausible motive for Coinbase’s seemingly rushed decision to launch under subpar conditions: The Chicago Mercantile Exchange opened trading in Bitcoin futures the day before the launch.","At the risk of being accused of being partisan — and I don’t think I am, this is just the most interesting part of the case to me — a bunch of other claims against Coinbase were dismissed, including a fraud aim and a statutory unfair business act claim. But this case is important because it is precedent for the notion that an exchange has tort obligations to users that may be outside of any contractual agreement. Given the state of some exchanges over the last few years — where some have alleged that wash trading, spoofing and all manner of hijinx have been allowed to flourish — we see a court recognizing that liability can’t be entirely limited by a user agreement\/click-through-terms-of-service. This means that the exchange can try its best to ring fence its liability in online terms of service but it still appears to have an independent duty in tort (at least under the facts of this case) to maintain a functional market, at least for a newly available asset.","The notion that tort law and its obligations can exist alongside of a contractual relationship isn’t really anew thing, to be clear. But a court saying that a crypto exchange has a duty to maintain a functional market does sound like at least new-ish law. My suspicion is that this is important enough that Coinbase will take the issue up on appeal. This is a federal court and it’s making what’s known in the business as an “Erie guess” about what the California Supreme Court would hold if presented with this issue. So it’s possible it’ll be reversed or modified if taken up. I don’t know. At the moment, though, it’s potentially significant precedent for the crypto exchange industry and a case that I’d expect to see cited in other litigation involving crypto-exchanges and customer losses.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Berk v. Coinbase","content":"ORGANIZATION"},{"type":"the Court","content":"ORGANIZATION"},{"type":"Nelson Rosario (","content":"PERSON"},{"type":"9th Circuit","content":"ORGANIZATION"},{"type":"Berk v. Coinbase, Inc.","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Berk v. Coinbase","content":"PERSON"},{"type":"CCM","content":"ORGANIZATION"},{"type":"Chicago Mercantile Exchange","content":"ORGANIZATION"},{"type":"August 6, 2019","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"California","content":"LOCATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"N.D. Cal.","content":"LOCATION"},{"type":"Palley","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"Stephen Palley","content":"PERSON"},{"type":"10 dollars","content":"MONEY"},{"type":"Rosario","content":"PERSON"},{"type":"California Supreme Court","content":"ORGANIZATION"}],"hashtag":["COINBASE"],"authors":["Stephen Palley","The Block"]}