{"summary":"Crypto lending desk Genesis Global Capital published its quarterly report today\nThe lender processed $2 billion in loan originations in Q1 2020, and its active outstanding loan hit an all-time high of $1 billion before the equity market sell-off in mid-March\nThe lending desk detailed the market events that led up to the Bitcoin’s price crash on March 12 and how it was able to be prepared for it","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/63516\/genesis-doubled-new-loan-issuance-to-2-billion-in-a-recording-breaking-q1","publishDate":"2020-04-30T09:00:02","id":3717,"type":null,"title":"Genesis doubled new loan issuance to $2 billion in a record Q1","category":["Capital Markets"],"content":["<span data-v-f87c67ca=\"\">Genesis Global Capital, one of the largest lenders in the crypto market, has had another good quarter.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The firm issued $2 billion new loans in the first quarter of 2020, doubling its previous record of $1 billion from Q4 2019, according to a <a href=\"https:\/\/genesiscap.co\/insights\/q1-insights-2020\/\" data-v-f87c67ca=\"\">report<\/a> shared with The Block. The active loan outstanding briefly hit the $1 billion all-time high before the March 12 equity market sell-off, and sat at $649 million at the end of March. Despite a 9.5% BTC price slide compared to the end of last quarter, active outstanding loans jumped by 19.1%.&nbsp;<\/span>","BTC lending still took up a large part of Genesis' total loan portfolio with 44.8%, followed by cash loans of 36.6%.&nbsp;","<span data-v-f87c67ca=\"\">Although the crypto market slid into chaos at the end of March as BTC price plummeted as much as 50% in one single day on March 12, Genesis said it was able to forge through the market tumult, originating “a significant portion of the entire quarter’s loans during the month of March and never once paused lending activity.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In early March, the firm noticed heightened demand for cash loans from trading desks, which looked to capture the large premium of BTC futures against the spot price by selling futures and buying BTC in the spot market, a trading strategy known as basis trading.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">If the premium collapses, however, traders would be looking to close their basis trade positions, which led to a return of cash and withdrawal of BTC from lenders. What’s more, if the premium turns into a discount, they would reverse the basis trading strategy to short sell BTC and purchase futures, adding to the demand for BTC from lenders like Genesis.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“What we expect is kind of this massive unwinding to happen as people taking off their long basis trade and then potentially go short basis, which requires you to do the exact reverse of borrowing cash. And so what we ended up doing was trying to make sure that, you know, we had enough bitcoin to be able to service all of this,” Genesis Global Capital CEO Michael Moro told The Block.<\/span>","<span data-v-f87c67ca=\"\">The lending desk did not see any default across its over 45 clients after the March 12 market sell-off, according to Moro, although it did temporarily <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/61305\/genesis-crypto-credit-suspends-extension-market\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">pause<\/span><\/a><span data-v-f87c67ca=\"\"> extending credit to borrowers as volatility in the market made it difficult to determine an interest rate.&nbsp;<\/span>"],"hashtag":["LENDING"]}