{"summary":"Cynthia Lummis, US Senator from the Wyoming state, said the Federal Reserve should hold bitcoin on its balance sheet.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/134725\/federal-reserve-bitcoin-senator-cynthia-lummis-comments","publishDate":"2022-02-18T06:44:47","id":3718,"type":null,"title":"Federal Reserve should buy bitcoin, says US senator Cynthia Lummis","category":["BITCOIN"],"content":["Cynthia Lummis, US Senator from the Wyoming state, has suggested that the Federal Reserve should hold bitcoin on its balance sheet.","Speaking on a panel hosted by the Orrin G. Hatch Foundation on Thursday, <a href=\"https:\/\/www.youtube.com\/watch?v=byRfAGyaFVc\" data-v-f87c67ca=\"\">Lummis said<\/a>, \"I think it's a great idea to be honest\" for the Fed to buy bitcoin as it holds <a href=\"https:\/\/www.federalreserve.gov\/data\/intlsumm\/current.htm\" data-v-f87c67ca=\"\">over $40 billion<\/a> in foreign currency reserves. Lummis was replying to a question by the panel moderator Matt Sandgren, executive director of the Hatch Foundation, who hosted the panel on the future of the crypto economy.","\"Once there is a statutory and regulatory framework, that will make a lot of sense,\" said Lummis. \"The fact that [bitcoin] is completely decentralized, is going to make it over time more ubiquitous, and I think it's going to be something that the Fed should hold on its balance sheet.\"","Randal Quarles, former vice chairman for supervision at the Fed, was also present on the panel, but he doesn't think that the central bank will add bitcoin to its balance sheet anytime soon.","\"For a lot of political, economic reasons, I think that it's best to keep the Fed's balance sheet, which it isn't currently, [but] it needs to move more in that direction — [that is] entirely treasuries,\" said Quarles.","As for Lummis, she has been pro-crypto and a vocal advocate for the crypto industry for a long time. The lawmaker, 67, first bought her bitcoin in 2013, when its price was about $350. Bitcoin's price today is around $41,000.","Lummis disclosed on the panel that her son-in-law taught her how to purchase bitcoin. As for how she first got involved in crypto, Lummis said her previous job as Wyoming treasurer made her explore a mix of assets — some that could have led to short-term income and others that represented a store of value — and that's when she learned more about bitcoin and viewed it as a store of value.","\"Bitcoin is digital gold. It's hard money. There will only be 21 million ever produced,\" she said on the panel.","Lummis also believes that traditional banks will eventually integrate bitcoin and other digital assets into their offerings and set up crypto divisions.","The senator has taken several crypto initiatives recently. In December, Lummis sent a draft bill \"quietly\" among regulators and the crypto industry. The bill looks to provide crypto regulatory clarity in various areas.","The bill, which was redrafted after feedback, is currently at the legislative council, said Lummis, adding that it should be made public \"very soon.\"","The bill has <a href=\"https:\/\/www.theblockcrypto.com\/linked\/128535\/sen-lummis-to-propose-new-us-crypto-market-overseer-next-year-report\" data-v-f87c67ca=\"\">proposed<\/a> a self-regulatory organization or SRO for crypto that would make some initial calls on whether a crypto is a commodity or a security. And if either of the CFTC or the SEC agencies disagrees with that assessment, they can have a mechanism to pull it in their direction from a regulatory framework perspective, explained Lummis.","\"This bill can be broken logically into about five or six pieces that are stand-alone, said Lummis. \"We're working with other senate offices in both parties to see who's interested in sponsoring the banking component, the privacy component, the consumer protection component of this legislation.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"$41,000","content":"MONEY"},{"type":"Fed","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"2013","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Orrin G. Hatch Foundation","content":"ORGANIZATION"},{"type":"Wyoming","content":"LOCATION"},{"type":"December","content":"DATE"},{"type":"Lummis","content":"LOCATION"},{"type":"Lummis","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"Quarles","content":"PERSON"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Hatch Foundation","content":"ORGANIZATION"},{"type":"Cynthia Lummis","content":"PERSON"},{"type":"Randal Quarles","content":"PERSON"},{"type":"Matt Sandgren","content":"PERSON"},{"type":"$350","content":"MONEY"}],"hashtag":["BITCOIN","CYNTHIA LUMMIS","FEDERAL RESERVE"],"authors":["Yogita Khatri","The Block"]}