{"summary":"Palm NFT Studio completed a $27 million Series B funding round led by Microsoft’s Venture Fund M12\nThe firm is known for previous projects with British contemporary artist Damien Hirst and DC Comics ","author":["Kristin Majcher","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/127032\/palm-nft-studio-raises-27-million-in-series-b-led-by-microsofts-m12","publishDate":"2021-12-09T16:12:40","id":3718,"type":null,"title":"Palm NFT Studio raises $27 million in Series B led by Microsoft&#x27;s M12","category":["Venture Capital"],"content":["<span data-v-f87c67ca=\"\">Palm NFT Studio announced the completion of a $27 million Series B funding round led by Microsoft’s M12 venture fund, which will help it expand its technology for large NFT drops to more creators.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Also contributing to the round were Warner Bros., Griffin Gaming Partners, RRE, Third Kind Venture Capital, Sfermion, the LAO, and SK Inc. The round follows a Series A from HENI Group that was not formally announced, a spokesperson confirmed.<\/span>","<span data-v-f87c67ca=\"\">Palm NFT Studio, which launched about eight months ago and in hiring mode, describes itself as a <\/span><span data-v-f87c67ca=\"\">“collective of technology, entertainment, cryptoart and art industry leaders.” <\/span><span data-v-f87c67ca=\"\">Several people had a hand in launching the firm, including<\/span><span data-v-f87c67ca=\"\"> ConsenSys CEO and Ethereum co-founder Joseph Lubin and PegaSys co-founder Daniel Heyman, who now serves as Palm NFT Studio co-founder and CEO. Film producer David Heyman and HENI Group founder Joe Hage also played a role.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“More than just the money for us, we set out to partner with companies who are philosophically and strategically aligned with us,” Daniel Heyman told The Block in an interview. “We couldn’t imagine a better partner with Microsoft in that vein,” he said, noting Microsoft’s previous Ethereum-based projects, clear NFT vision and sustainability goals among its reasons for partnering with the technology giant.<\/span>","<span data-v-f87c67ca=\"\">Palm NFT Studio has already orchestrated a few high-profile drops, ranging from collectibles to contemporary art. For example, Palm NFT Studio worked with British artist Damien Hirst to mint 10,000 NFTs based on original artworks for <\/span><a href=\"https:\/\/palm.io\/studio\/the-damien-hirst-currency-exchange-window-opens\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The Currency<\/span><\/a><span data-v-f87c67ca=\"\">, which requires NFT holders to decide within a year whether they want to keep the digital asset or burn it in exchange for a physical copy. It also dropped more than 800,000 free NFT with DC Comics for <\/span><a href=\"https:\/\/palm.io\/studio\/creating-a-sustainable-future-for-digital-fandoms\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">DC FanDome 2021<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">Palm NFT Studio handles these drops through an Ethereum sidechain it helped launch called Palm Network, which the company says is optimized for NFTs in addition to having low gas fees and environmental impact. The further funding will allow it to bring that technology to third-party artists and brands who want to use it for their own drops, in addition to those who partner directly with the studio for projects.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I think every major company in the world right now is planning its NFT strategy,” Heyman told The Block in an interview. In his view, most NFTs will be free or cheap in the next few years as companies and creators start realizing they have myriad benefits beyond just monetization.<\/span>","<span data-v-f87c67ca=\"\">“I think that’s just the tip of the iceberg,” Heyman said. “It’s new ways to interact, new ways to explore, new ways to communicate and new ways to bring fans into the creative process, to be involved.” For example, companies could send their fans NFTs as birthday gifts or other rewards.<\/span>","<span data-v-f87c67ca=\"\">Palm NFT Studio hopes to continue working with large companies, but also plans to focus on startups and individual creators as well. Heyman admits that figuring out which projects are worth investing in can be a challenge for firms in this space. Palm NFT Studio is looking at ideas that can push the boundaries of what NFTs can do from all sides, whether it be from a technological or experience perspective.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We really look at things that push the envelope and bring the experience and ecosystem forward.” <\/span>"],"hashtag":["ETHEREUM"]}