{"summary":"According to Wintermute Trading’s head of DeFi Freddie Farmer, despite Thursday’s sharp price swings and network congestion, the market maker saw one of its most profitable days due to its trading algorithms and infrastructure\nHowever, Farmer said, last week’s panic-driven market volatility was detrimental to the DeFi environment and has hurt investor confidence. ","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/58781\/crypto-market-maker-wintermute-trading-says-it-saw-its-best-performing-days-amid-last-weeks-turmoil","publishDate":"2020-03-15T12:18:44","id":3719,"type":null,"title":"Crypto market maker Wintermute Trading says it saw its &#x27;best performing days&#x27; amid last week&#x27;s turmoil","category":["DeFi"],"content":["<span data-v-f87c67ca=\"\">Amid last week’s sharp price swings and network congestion, crypto market maker Wintermute Trading nevertheless saw its most profitable days since its inception.<\/span>","<span data-v-f87c67ca=\"\">Founded in 2017, Wintermute crosses both decentralized and centralized platforms and is a major market maker on dYdX, a non-custodial exchange for margin trading. Last month, the firm <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/55373\/crypto-market-maker-wintermute-trading-raises-seven-figure-seed-funding-to-enhance-its-platform\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">raised<\/span><\/a><span data-v-f87c67ca=\"\"> a \"seven-figure\" sum in its seed funding round, which was led by Blockchain.com's venture arm.<\/span>","<span data-v-f87c67ca=\"\">Thursday's market madness hits decentralized finance (DeFi) markets particularly hard. With the price of ETH at one point <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/58653\/eth-price-drops-below-100-for-the-first-time-since-december-2018\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">falling below the $100 mark<\/span><\/a><span data-v-f87c67ca=\"\">, several pricing oracles had problems feeding accurate data into the network. As a result, the Ethereum network became overcrowded with transaction requests and many projects found themselves unable to execute trades without paying high fees.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"Issues were felt particularly with ETH network congestions resulting in centralized exchange withdrawal and deposit restrictions resulting in surprising strain on DeFi platforms and funding,\" Wintermute's head of DeFi, Freddie Farmer, told The Block. With DAI especially, he explained, there was a liquidity squeeze on available DAI to borrow due to liquidations of MakerDAO vaults, dYdX margin positions, and Compound borrows.<\/span>","<span data-v-f87c67ca=\"\">Despite the network congestion, however, Farmer claimed that Wintermute actually had one of its most profitable days on Thursday.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"The past few days have been our best performing days since Wintermute Trading's inception,” Farmer said. \"Generally, we were very well prepared for this. Not in a sense that we predicted the sharp move, but in a sense that we initially designed our trading infrastructure to be 'mission-critical' and have prepared our algorithms to be able to perform their best in the days like this.\"<\/span>","<span data-v-f87c67ca=\"\">On the other hand, however, Farmer argued that such market volatility is detrimental to the DeFi ecosystem as a whole and the wide-spread panic as seen on Thursday took a toll on the general investment environment.<\/span>","<span data-v-f87c67ca=\"\">\"Volatility like today is not beneficial for many retail and institutional investors, especially when it is panic driven by a negative economic and global health sentiment as seen recently,\" he said. \"T<\/span><span data-v-f87c67ca=\"\">here are some very real losses facing many investors and a lot may be reluctant to touch crypto for a while.\"<\/span>","<span data-v-f87c67ca=\"\">Although the DeFi market presents new opportunities for investors, Farmer said, many new projects did not perform well amid last week's market strains and do not seem particularly attractive for opportunistic traders right now.<\/span>","<span data-v-f87c67ca=\"\">\"We saw some fascinating tests of the DeFi space with MakerDAO flip auctions – auctions for the collateral used to mint DAI – coming under strain which resulted in debt in the overall system,\" he said. \"There's definitely a trade-off between supporting these young projects, which may yet grow into the foundations of a future financial landscape, and short term opportunism.\"<\/span>"],"hashtag":[]}