{"summary":"Bixin Ventures is allocating $100 million in proprietary capital to a new fund\nThe investment arm of the early bitcoin miner operator says the fund will focus on scaling up blockchain Open Finance \nThe new fund follows a $66 million fund of funds that was rolled in May","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/81790\/bixin-bitcoin-miner-fund-defi","publishDate":"2020-10-21T10:15:37","id":372,"type":null,"title":"Early bitcoin miner Bixin allocates $100 million proprietary fund for scaling DeFi projects","category":["DeFi"],"content":["The investment arm of Bixin, one of the earliest bitcoin miners and wallet providers in China, is allocating a new $100 million fund with all proprietary capital denominated in USDT.","Bixin Ventures, the Hong Kong-registered investment subsidiary, said Wednesday that the purpose of the fund is to foster infrastructure projects that aim to scale up decentralized finance (DeFi).","“We have been investing in DeFi since 2019 and believe this is the right direction. A lot of the projects back in 2017 and 2018 were on a wrong track with this pseudo proposition of blockchain+,\" Wang Xi, a partner of Bixin Ventures, said in an interview. \"Currently there are very few China's home-grown DeFi teams and we want to be the bridge to incubate and help grow them to a global scale.\"&nbsp;&nbsp;","The firm recently invested $2 million, as a lead investor together with Three Arrow Capital, in Mina Protocol, a blockchain Layer-1 project that uses zero-proof knowledge. Bixin also invested in bitcoin miner maker MicroBT and blockchain projects like Algorand, Nervos, Conflux and Certik, among others.&nbsp;","Bixin was founded in 2014, known as HaoBTC at the time, by Wu Gang, who started mining bitcoin since 2009. It has become one of the longest-running bitcoin miner operators and wallet service providers in China. Its mining business now operates at around 3,000 petahashes per second of computing power, accounting for about 2% of the Bitcoin network's total hashrate.","In May, Bixin rolled a fund of funds denominated in 6,600 bitcoin – worth around $66 million at the time – for trading desks to improve bitcoin market liquidity."],"hashtag":[]}