{"summary":"The Financial Action Task Force (FATF) released its finalized crypto guidance to the public today.\nThe finalized guidance contains clarifications to the standards found in its previous draft guidance, including how NFTs and DeFi should be viewed by regulators in relation to the standards.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/122372\/fatf-final-crypto-guidance-defi-nft","publishDate":"2021-10-28T05:30:41","id":3720,"type":null,"title":"FATF releases finalized crypto guidance with clarifications on DeFi, NFTs","category":["Regulation"],"content":["The Financial Action Task Force has released revised and finalized crypto guidance, containing clarifications on who falls under its recommended requirements.","The global anti-money laundering watchdog first issued its virtual asset guidance in 2019. That draft called for crypto exchanges and money transmitters — which it refers to as virtual asset service providers (VASPs) — to meet standards applied to traditional financial companies. Much of this proposed approach focused on a so-called travel rule, which asked VASPs to collect and transmit originator and beneficiary information on parties participating in a transaction.&nbsp;","Since then, some jurisdictions have begun the process of implementing these standards, and the FATF has continued to review and amend its draft guidance. The body has also conducted reviews of the implementation process in jurisdictions and absorbed industry feedback on its proposed standards.","Critics expressed concern over the technical challenges this approach posed since there was no way to transmit this information securely when the FATF first announced its intended standards. Since then, <a href=\"https:\/\/www.theblockcrypto.com\/news+\/72293\/coinbase-exchanges-fatf-travel-rule-solution\" data-v-f87c67ca=\"\">solutions<\/a> have <a href=\"https:\/\/www.theblockcrypto.com\/news+\/29958\/partnership-plans-to-solve-the-problems-of-fatfs-travel-rule-with-a-blockchain-and-encryption\" data-v-f87c67ca=\"\">emerged<\/a>, but the FATF continued to raise the bar in its reviews, making clear the dangers of so-called non-custodial wallets and proposing to apply travel rule standards to less-easily categorized entities within the realm of decentralized finance (DeFi).","This set off a flurry of feedback from the industry as many felt it was <a href=\"https:\/\/www.theblockcrypto.com\/post\/110506\/crypto-lobbyists-put-defi-proposals-to-fatf-in-open-letter\" data-v-f87c67ca=\"\">unclear<\/a> how the FATF would apply its VASP standards to DeFi. For this reason, the body <a href=\"https:\/\/www.theblockcrypto.com\/news+\/110746\/making-sense-of-fatfs-latest-12-month-crypto-review\" data-v-f87c67ca=\"\">punted<\/a> on finalizing the guidance at its July plenary meeting until October, taking the time to augment the draft guidance with additional clarifications.","Now, that guidance is finalized and those clarifications are in.&nbsp;","While the clarifications do hone in on what the FATF is looking for, it's important to note that the body reiterated in each case that it still intends for the definitions to be interpreted broadly and utilized as needed by jurisdictions to combat illicit finance activity.","The FATF acknowledges that understanding the function of a technology should be put above whether it fully adheres to the letter of the definition. Services should be analyzed based on what they provide rather than how they might fit into the nomenclature the FATF has provided.","\"Countries should not apply their definition based on the nomenclature or terminology which the entity adopts to describe itself or the technology it employs for its activities...The obligations in the FATF Standards stem from the underlying financial services offered without regard to an entity's operational model, technological tools, ledger design, or any other operating feature,\" said the guidance.","It began by clarifying what constitutes a virtual asset, or VA. For the FATF, VAs aren't merely the digital representation of value, they also have to have a tradable or exchangeable component. That value has to be able to be transferred rather than just a mode of record keeping.","It clarified that non-fungible tokens (NFTs) don't appear to constitute VAs, but if they are used in such a way that falls under FATF standards, they should be regulated as such, even if their general use doesn't fit the VA definition. The FATF recommends a \"functional approach\" to regulating these new types of assets that seem to straddle the line of the definition and regulate them on a case-by-case basis.","\"Some NFTs that on their face do not appear to constitute VAs may fall under the VA definition if they are to be used for payment or investment purposes in practice,\" said the guidance. \"Other NFTs are digital representations of other financial assets already covered by the FATF Standards. Such assets are therefore excluded from the FATF definition of VA, but would be covered by the FATF Standards as that type of financial asset.\"","The FATF's VASP definition covers \"any natural or legal person\" who is a business acting on behalf of another legal or natural person conducts the exchange of VAs to fiat or other VAs, the transfer of VAs, the \"safekeeping and administration of VAs or instruments enabling control over VAs\" and \"participation in and provision of financial services related to an issuer's offer and\/or sale\" of VAs.","For centralized entities, this is pretty clear-cut. If an entity is facilitating a transfer, exchange or custodial service, it's likely subject to VASP standards.","What's less clear is how it applies to blockchain-based services like decentralized applications (DApps).","The clarifications say DApps are not VASPs since the standards don't apply to the underlying software. However, creators, owners, operators or anyone maintaining \"control or sufficient influence in the DeFi arrangements\" likely are, even if portions of the protocol are decentralized or automated.","In brief, the FATF is asking countries to identify owner\/operators of protocols and hold them to the VASP standards:","Still the FATF is leaving a lot of room for countries to decide for themselves how they want to deal with DeFi. In a nod to the pace of development in the space, the FATF guidance acknowledges that jurisdictions will have to continually reassess new projects and how they relate to the guidance. However, it warns that many projects wield the word \"decentralized\" when there remains some natural or legal person that could be held accountable.","\"It seems quite common for DeFi arrangements to call themselves decentralized when they actually include a person with control or sufficient influence, and jurisdictions should apply the VASP definition without respect to self-description,\" said the guidance.&nbsp;","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>"],"hashtag":[]}