{"summary":"Crypto options exchange Sparrow has raised $3.5 million Series A\nThe round was led by BitMEX parent HDR, with participation from other VC firms\nSparrow’s Series A comes at a time when the crypto derivatives space is growing faster than the spot market","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/69279\/bitmex-parent-leads-3-5-million-series-a-for-crypto-options-exchange-sparrow","publishDate":"2020-06-23T05:50:38","id":3723,"type":null,"title":"BitMEX parent leads $3.5 million Series A for crypto options exchange Sparrow","category":["Cryptocurrency"],"content":["Crypto options trading platform Sparrow has raised $3.5 million in Series A funding.","The <a href=\"https:\/\/blog.sparrowexchange.com\/sparrow-raises-usd-3-5-mil-in-series-a-funding\/\" data-v-f87c67ca=\"\">round was led by<\/a> BitMEX's parent company HDR Group, with participation from venture firms Signum Capital, Du Capital and FinLab EOS VC.","Singapore-based Sparrow offers bitcoin (BTC) and ether (ETH) options, which are settled via smart contracts. The exchange <a href=\"https:\/\/sparrowexchange.com\/\" data-v-f87c67ca=\"\">said<\/a> its options are more liquid than over-the-counter (OTC) options and more customizable than exchange-traded options.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"Around 90% of our orders are filled within minutes, via a global liquidity book and an extensive network of liquidity providers and market makers,\" Sparrow CEO Kenneth Yeo told The Block.","\"Our options are settled on Ethereum smart contracts on the <a href=\"https:\/\/medium.com\/sparrowexchange\/nidus-risk-control-blockchain-designed-for-speed-transparency-and-reliability-c5953c317a99\" data-v-f87c67ca=\"\">NIDUS Chain<\/a>, enabling automated and transparent settlement of options contracts. Competing platforms are proprietary and closed systems that rely on trust rather than transparency,\" Yeo added.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Crypto derivatives market thriving&nbsp;<\/span><\/strong>","Sparrow’s Series A comes at an interesting time when the crypto derivatives market is <a href=\"https:\/\/www.theblockcrypto.com\/linked\/67497\/bitcoin-derivatives-market-is-growing-faster-than-spot-market-suggesting-rising-institutionalization-in-the-space\" data-v-f87c67ca=\"\">growing sharply<\/a>. Both bitcoin futures and options markets are growing faster than the bitcoin spot market, <a href=\"https:\/\/www.theblockresearch.com\/a-brief-look-at-the-growth-of-the-derivatives-67384\" data-v-f87c67ca=\"\">as The Block Research reported recently<\/a>.","Last month, bitcoin futures saw volumes of $558 billion, while bitcoin options saw $3.1 billion worth of trades. The options market is still tiny compared to both futures and spot markets, but it is growing fast. The ratio between spot volume and options volume has increased from less than 0.009 to 0.029, which indicates that options volume is growing more quickly relative to spot volume.","","","BitMEX CEO Arthur Hayes said the crypto options space is seeing “significant growth” and there are “a lot of untapped opportunities.” <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nNotably, BitMEX itself doesn’t offer crypto options trading even though it <a href=\"https:\/\/www.theblockcrypto.com\/linked\/19531\/bitmex-is-kicking-the-tires-on-options-launch-could-come-in-12-months\" data-v-f87c67ca=\"\">had such plans<\/a> last year. Earlier this year, Hayes <a href=\"https:\/\/www.theblockcrypto.com\/daily\/57287\/binance-is-preparing-to-launch-crypto-options-trading-later-this-year\" data-v-f87c67ca=\"\">said<\/a> crypto volatility is \"very high\" and the higher the volatility, the more expensive the call or put option is.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Looking ahead&nbsp;<\/span><\/strong>","With the fresh capital in place, Sparrow plans to offer more trading products and services. \"One key concern for users across the derivatives trading ecosystem has been around compliance and financial reporting and we intend to be at the forefront of serving these needs,\" Yeo told The Block.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSparrow is also looking to expand its team across platform development, sales, and marketing functions, said Yeo. The exchange's current headcount is 15 full-time employees.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSparrow is also applying for the Payments Services License in Singapore, and has filed a Notice of Exemption with the Monetary Authority of Singapore, Yeo told The Block.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Update: This story has been updated to include more information from Sparrow CEO Kenneth Yeo.<\/em><\/span>"],"hashtag":["BITMEX"]}