{"summary":"CME&#x27;s bitcoin futures market saw volumes for July top its previous high — clocking in volumes of $53.33 billion with one day left in the month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242023\/cme-bitcoin-futures-monthly-yearly-high","publishDate":"2023-07-29T08:33:35","id":3725,"type":null,"title":"CME bitcoin futures monthly volumes hit yearly high","category":["MARKETS"],"content":["Despite dwindling volumes across cryptocurrency trading venues and exchanges, CME Group clocked its highest monthly volumes of the year in July, according to data from The Block's data dashboard.&nbsp;","CME's bitcoin futures market saw volumes for July top its previous high in April, with the exchange clocking in volumes of $53.33 billion with one day left in the month. In April, the firm saw $53.06 billion worth of contracts trade hands.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/futures\/average-daily-volume-of-cme-bitcoin-futures-monthly\/embed\" title=\"Volume and OI of CME Bitcoin futures\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","As of July 29, open interest in the CME bitcoin futures market stood at $2.5 billion. The market — popular among institutional investors like hedge funds and large trading firms — stands out in the crypto industry. Exchanges across the space have been under pressure from low trading activity, which makes up the lion's share of their revenues.&nbsp;","Spot trading volumes are close to their lowest levels of the year, with The Block's data dashboard <a href=\"https:\/\/www.theblockcrypto.com\/data\/crypto-markets\/spot\/total-exchange-volume-daily\" data-v-f87c67ca=\"\">showing<\/a> the seven-day moving average for spot crypto trading at $11.1 billion. That's about a quarter of where it stood when it clocked in a year-high above $40 billion in March.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March","content":"DATE"},{"type":"$53.33 billion","content":"MONEY"},{"type":"$11.1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$2.5 billion","content":"MONEY"},{"type":"$40 billion","content":"MONEY"},{"type":"July 29","content":"DATE"},{"type":"CME Group","content":"ORGANIZATION"},{"type":"$53.06 billion","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"April","content":"DATE"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}