{"summary":"2020 is going to be a big year for crypto.  The “Crypto Winter” of 2018\/2019 flushed out much (but certainly not all) of the nonsense, and the market has","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/51876\/why-2020-will-be-a-big-year-for-crypto","publishDate":"2020-01-02T14:07:02","id":3726,"type":null,"title":"Why 2020 will be a big year for crypto","category":["CAPITAL MARKETS"],"content":["2020 is going to be a big year for crypto.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The “Crypto Winter” of 2018\/2019 flushed out much (but certainly not all) of the nonsense, and the market has significantly matured over the last few years.","In 2020, I expect accelerating crypto asset adoption, and key building blocks will come into place for crypto to achieve its long-term potential of revolutionizing how value is stored and transferred around the world.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","I think my <a href=\"https:\/\/medium.com\/@peter_10203\/the-end-of-crypto-winter-ce0703b13c92\" data-v-f87c67ca=\"\">85 theses<\/a> from ~7 months ago have aged pretty well. Here, I’ll focus on the 15 most impactful developments I expect to see in 2020.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp; &nbsp;<\/span>","Ray Dalio <a href=\"https:\/\/www.linkedin.com\/pulse\/paradigm-shifts-ray-dalio\/\" data-v-f87c67ca=\"\">clearly laid out<\/a> the global macro thesis for crypto when he said:","<i data-v-f87c67ca=\"\">“So, the big question worth pondering at this time is which investments will perform well in a reflationary environment accompanied by large liabilities coming due and with significant internal conflict between capitalists and socialists, as well as external conflicts. It is also a good time to ask what will be the next-best currency or storehold of wealth to have when most reserve currency central bankers want to devalue their currencies in a fiat currency system.”<\/i>","Ray's conclusion was to buy gold. In 2020, I believe large global macro hedge fund investors (potentially even Ray) will publicly take the position that bitcoin is a logical asset to hold if you believe this narrative. <span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","I am very encouraged by the <a href=\"https:\/\/www.coindesk.com\/state-street-38-of-clients-will-put-more-money-into-digital-assets-in-2020\" data-v-f87c67ca=\"\">State Street survey<\/a> indicating 94% of their clients hold digital assets or related products, and a <a href=\"https:\/\/www.globalcustodian.com\/wp-content\/uploads\/2019\/04\/The-institutional-crypto-backers-How-endowments-are-allocating-to-cryptocurrency-investments.pdf\" data-v-f87c67ca=\"\">survey of endowment funds<\/a> in which 94% of them stated that they invested in crypto assets over the last year.","I expect these types of traditional asset managers to continue to show strong interest in crypto in 2020, but do not expect massive inflows from this segment.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The primary reason for this is that portfolio manager incentives are not conducive to encouraging large crypto allocations.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp; <\/span>Currently, crypto is still a non-consensus investment. If a portfolio manager gets behind investing in crypto, and it does well, they probably get a nice bonus (but not the types of payouts available to those investing their own money or 2\/20 hedge funds); however, if it does poorly (or they lose money in an operational issue like an exchange hack), they get fired for losing client funds in “magical internet money.”","The portfolio manager who sticks with the consensus position of not taking a meaningful bet on crypto keeps their cushy job. Eventually, I believe the consensus will shift to the position that crypto has a role to play in a diversified portfolio, but not this year. <span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","For active retail traders looking for quick gains, long-tail altcoin trading was once the place to find the volatility and potential they sought.","Now, with altcoins down 90%+ from highs, active traders are increasingly moving to leveraged bitcoin derivatives trading, which offers the volatility they seek, in an asset that is not on its way to zero.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","I expect volumes on U.S. regulated crypto derivatives exchanges (e.g., CME, Bakkt) to grow strongly, but the center of activity this space will continue to come from exchanges that cater to non-U.S. retail traders (BitMEX and the like).","While derivatives are great for active traders, the more important developments for those accumulating crypto are those that enable them to easily grow their holdings.","In 2020, this will happen in two ways: 1) The ability to earn crypto for retail activity will accelerate as more ecommerce and payment companies integrate this into their offerings, and 2) Crypto holdings will increasingly migrate to places where they earn interest, such as BlockFi, Celsius, and Voyager.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Crypto taxes are a disaster not only due to the horrendous reporting from many exchanges but also because investors are missing out on the ability to significantly reduce their taxes via automated tax-loss harvesting.","Personal Capital and robo-advisors made tax-loss harvesting mainstream for traditional assets, and in 2020, this will finally come to crypto (along with better tax reporting). <span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The number of crypto exchanges exploded over the last few years. In 2020, I expect this to rationalize. Exchanges are inherently network effect businesses (liquidity begets liquidity), and smaller players will fall behind, and either be acquired, fold, or pivot their business models.","I expect those that excel at acquiring and servicing customers will become brokerages and source their liquidity from other exchanges or large liquidity providers. <span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Exchanges and brokerages will increasingly use third-party custodians as they focus on their core competencies. This will make the market safer (as assets are custodied with best-in-class providers) and will eventually increase capital efficiency, as assets held at major custodians will provide buying power across multiple exchanges. <span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The emergence of instant crypto settlement solutions (think Silvergate Exchange Network for crypto) from large crypto custodians will also be a major development in 2020, and further increase the utility of market participants holding their assets with these custodians.","Obtaining fiat banking accounts and payment services has been, and will continue to be, one of the biggest issues for crypto companies. Around the world, large risk adverse banks will continue to shy away from banking the crypto industry, providing an opening for new entrants and smaller players to fill the gap as technology-driven intermediaries, or full-stack de novo banks. In 2020, I expect some new entrants to run into significant issues with regulators, while those that are able to navigate regulatory pressures will scale impressively. <span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp; &nbsp;<\/span>","The crypto lending\/borrowing market flourished in 2019, let by companies such as Genesis, BlockFi, and Celsius.","I expect volumes will continue to significantly expand in 2020 across several vectors: 1) Traders borrowing crypto to short and overcome capital inefficiencies, 2) Investors borrowing dollars using their crypto as collateral (much more tax efficient then selling), and 3) Crypto companies becoming de facto banks by taking stablecoin deposits and making stablecoin loans.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The counterparty risks from holding assets with exchanges (e.g., hacks) and payment processors (e.g., Bitfinex \/ Crypto Capital debacle) have been the most notable to date.","This year, counterparty risk from defaults by uncollateralized crypto borrowers and from direct counterparties failing to deliver on trades (i.e., Herstatt Risk) could also come to light if we see significant downside volatility.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","These are likely to be smaller flare-ups vs. systematic blow-ups and will help the market mature as market participants become more discerning in selecting counterparties and using solutions to minimize these risks.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Tether’s remarkable resilience has demonstrated insatiable demand by market participants not directly served by U.S. banks to have USD denominated accounts to settle trades and store value. Despite significant regulatory uncertainty, I expect Tether’s market cap to continue to continue to grow in 2020.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The regulated fiat-backed USD stablecoin market (USDC, TUSD, PAX) will experience huge growth rates (off a relatively small base) as they become the money transfer rail for use cases the need a solution that 1) is regulated and 2) runs on a open network (anyone with a crypto wallet can send\/receive).","This will be a compelling position that sits between the Silvergate Exchange Network (regulated + closed network) and Tether (unregulated + open network).","I expect stablecoins for many other major currencies will also start to gain traction as a regulated, open money movement rail for those currencies.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Longer term, things get really interesting as liquid markets develop between stablecoins of various currencies and provide a 24\/7, global, highly efficient FX market that is accessible to everyone (and sidesteps the correspondent banking system). Eventually, I expect the market cap of stablecoins will surpass that of bitcoin.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Most contemplated CBDCs are significantly different than stablecoins such as USDC. With CBDCs, the recordkeeping of the value owned by individuals and businesses is centralized with a central bank. There are only a few situations where a central bank \/ government is likely to take over this recordkeeping function (e.g., China).","I do not expect any major CBDCs to be launched in 2020 (other than small scale PoCs) but do expect significant developments in 2021 and beyond.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The adoption of crypto assets in markets with hyperinflation has grown significantly and will continue to do so. The interesting question will be if bitcoin or stablecoins emerge as the primary winner in these regions.","My heart hopes that it’s bitcoin, but my head says it will be stablecoins.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The most innovative developments in crypto continue to be in DeFi (decentralized lending, derivatives, exchange, prediction markets, etc.), but 2020 breakout growth in this area is highly unlikely.","Currently, these solutions simply do not solve problems better than centralized options, and each of the smart contract platforms have issues that will complicate adoption (with ETH it is the complexity of their development roadmap).","Bullish on DeFi long-term, but not this year.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<i data-v-f87c67ca=\"\">Peter Johnson is a Principal at Jump Capital, where he leads their investments in the fintech and crypto sectors. Since joining Jump Capital in 2013 as their first employee, he has invested in 50+ companies, including many leading crypto companies. Jump Capital is affiliated with the Jump Trading Group, one of the largest proprietary trading firms in the traditional and crypto markets.<\/i>","<i data-v-f87c67ca=\"\">The opinions expressed herein are his own and do not represent the opinions or views of Jump Capital or the Jump Trading Group or its members.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Crypto Winter","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"Jump Trading Group","content":"ORGANIZATION"},{"type":"94%","content":"PERCENT"},{"type":"2019","content":"DATE"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Silvergate Exchange Network","content":"ORGANIZATION"},{"type":"Ray Dalio","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"ups","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"Peter Johnson","content":"PERSON"},{"type":"Bitfinex \/ Crypto Capital","content":"ORGANIZATION"}],"hashtag":[],"authors":["Contributor Network","The Block"]}