{"summary":"Chinese DeFi platform dForce has raised $1.5 million in fresh capital\nThe round was led by Multicoin Capital, with participation from Huobi Capital and China Merchants Bank International\nMulticoin principal Mable Jiang said: “dForce is building the first ‘super-network’ of DeFi protocols”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/61903\/chinese-defi-startup-dforce-raises-1-5m-in-funding-led-by-multicoin-capital","publishDate":"2020-04-15T04:15:56","id":3727,"type":null,"title":"Chinese DeFi startup dForce raises $1.5M in funding led by Multicoin Capital","category":["DeFi"],"content":["Chinese decentralized finance (DeFi) startup dForce has raised $1.5 million in fresh funding.","The <a href=\"https:\/\/multicoin.capital\/2020\/04\/14\/our-investment-in-dforce-the-defi-super-network\/\" data-v-f87c67ca=\"\">round was led<\/a> by Multicoin Capital, with participation from Huobi Capital and China Merchants Bank International (CMBI), the investment arm of one of the biggest banks in China.","“dForce is building the first ‘super-network’ of DeFi protocols,” said Multicoin Capital principal Mable Jiang, referring to consumer “super-apps” like WeChat and Kakao that people use every day because of their seamless experience.","“The dForce ecosystem is bound together by $DF, its native platform token. Using the token, users of the dForce ecosystem can seamlessly traverse several financial protocols that allow them to lend, borrow, or earn all without switching platforms or tokens,” said Jiang.","dForce maintains two key protocols - lending platform Lendf.Me and fiat-back synthetic stablecoin USDx.","Lendf.Me, <a href=\"https:\/\/www.theblockcrypto.com\/daily\/54389\/vc-backed-compound-is-alleging-that-a-fast-growing-defi-startup-stole-its-code-the-dispute-raises-questions-about-what-open-source-actually-means\" data-v-f87c67ca=\"\">launched<\/a> last September, has grown to become the seventh-largest DeFi market by value locked, according to <a href=\"https:\/\/defipulse.com\/\" data-v-f87c67ca=\"\">DeFi Pulse<\/a>. It has around $24 million in total value locked.","Earlier this year, dForce founder and CEO Mindao Yang told The Block that the growth on Lendf.Me followed as the platform added support for Tether (USDT) stablecoin and expanded its collateral options to include the interest-bearing Ethereum token imBTC.","For comparison, DeFi giants Maker and Compound have total value locked of ~$351 million and ~$91 million, respectively, according to DeFi Pulse.","Notably, earlier this year, Compound alleged that dForce stole its copyrighted code. After The Block reached out to dForce for comment, the company added an attribution to Compound on its website and GitHub page.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nYang told The Block at the time that he was surprised that Compound never reached out to dForce regarding the potential copyright infringement. Compound CEO Robert Leshner, on the other hand, told The Block that the company is evaluating its legal options on the matter.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBut that does not seem to be a concern for dForce's investors. Multicoin's Jiang believes dForce has established “meaningful unforkable” moat by focusing on China-first localization.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nLooking ahead, dForce will “soon” be launching yield-enhancing and trading protocols, she added. dForce's Yang did not respond to The Block's queries by press time."],"hashtag":[]}