{"summary":"Crypto Capital President Ivan Manuel Molina Lee was arrested by Polish authorities, accused of being part of an international drug cartel and involved in its money-laundering operations using Bitfinex.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/44591\/ceo-of-crypto-capital-arrested-in-alleged-money-laundering-operation","publishDate":"2019-10-24T18:10:15","id":3729,"type":null,"title":"President of Crypto Capital Arrested, Accused of Money Laundering","category":["HACKS"],"content":["Crypto Capital President Ivan Manuel Molina Lee was arrested by Polish authorities, accused of being part of an international drug cartel and involved in its money-laundering operations using Bitfinex, according to several <a href=\"https:\/\/wpolityce.pl\/kryminal\/470013-poszukiwany-ena-ivan-manuel-molina-lee-jest-juz-w-polsce\" data-v-f87c67ca=\"\">Polish news sites<\/a>.","Crypto Capital was a company with which Bitfinex <a href=\"https:\/\/www.theblockcrypto.com\/post\/22413\/the-bitfinex-ieo-how-did-we-get-here\" data-v-f87c67ca=\"\">allegedly<\/a> entrusted $850 million, money the exchange said it was unable to access later. To cover the loss, the exchange conducted a $1 billion token sale in May.","It was previously <a href=\"https:\/\/www.theblockcrypto.com\/post\/22413\/the-bitfinex-ieo-how-did-we-get-here\" data-v-f87c67ca=\"\">reported<\/a> that the Polish Ministry of Justice had seized bank accounts in name of Crypto SP. Z O.O. The seized funds, which amount to $350 million, reportedly belonged to Crypto SP. Z O.O. and NESP SP. Z O.O., two companies likely affiliated with Crypto Capital and Molina Lee, according to several financial documents. The seizure was a part of an anti-money laundering operation conducted by the Polish authority.","Polish Media RMF 24 said Molina Lee was sought by Polish authorities in connection with the seized funds, which was “about laundering money from Colombian drug cartels through the cryptocurrency exchange,” the article said.","According to the National Public Prosecutor’s Office, The money-laundering operation was “the largest security [seizure] in the history of the Polish prosecutor’s office against forfeiture.”","According to <a href=\"https:\/\/decrypt.co\/6824\/crypto-capital-follow-up-article\" data-v-f87c67ca=\"\">Decrypt<\/a>, several other major cryptocurrency exchanges, including Binance, Kraken, and BitMEX, have also <a href=\"https:\/\/decrypt.co\/6824\/crypto-capital-follow-up-article\" data-v-f87c67ca=\"\">used<\/a> Crypto Capital's banking services.&nbsp;Kraken terminated its relationship with Crypto Capital in early 2017, a spokeswoman said in an email to The Block.","In a blog <a href=\"https:\/\/www.bitfinex.com\/posts\/426\" data-v-f87c67ca=\"\">post<\/a> published on Friday, Bitfinex said it \"is the victim of a fraud and is making its position clear to the relevant authorities, including those in Poland and the United States.\"&nbsp;","The exchange stated that Crypto Capital has processed funds for and on behalf of Bitfinex for several years, during which time the firm provided the exchange with false information.&nbsp;&nbsp;","<em data-v-f87c67ca=\"\">Correction: an earlier version of this article incorrectly referred to Ivan Manuel Molina Lee as Crypto Capital's CEO. He is in fact its president.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$350 million","content":"MONEY"},{"type":"2017","content":"DATE"},{"type":"Bitfinex","content":"PERSON"},{"type":"$1 billion","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"Crypto SP","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Ivan Manuel Molina Lee","content":"PERSON"},{"type":"Crypto Capital","content":"ORGANIZATION"},{"type":"Molina Lee","content":"PERSON"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"$850 million","content":"MONEY"},{"type":"Polish Ministry of Justice","content":"ORGANIZATION"},{"type":"Poland","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"National Public Prosecutor’s Office","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"}],"hashtag":[],"authors":["The Block","The Block"]}