{"summary":"Bitfinex’s partner exchange, Ethfinex, is closing and relaunching as DeversiFi\nThe move, described as a “management buyout”, means the firm will now exist independently of Bitfinex as an entirely new entity; cutting ties before launching a new product\nDeversiFi CEO Will Harborne told The Block that he is excited to grow as a “small and lean team” and to see the decentralized exchange pursue regulatory approval","author":["Isabel Woodford","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/35585\/bitfinex-spinoff-parts-way-with-troubled-exchange-as-management-eyes-regulated-rebrand","publishDate":"2019-08-13T10:00:42","id":3729,"type":null,"title":"Bitfinex spinoff parts ways with troubled exchange as management eyes &#x27;regulated&#x27; rebrand","category":["Exchanges"],"content":["Bitfinex's sister exchange Ethfinex is flying the nest.","Ethfinex is relaunching as a separate entity under the name \"DeversiFi,\" and will shed Bitfinex as a major shareholder and controlling presence. DeversiFi will also no longer share management or resources with Bitfinex.","The rebrand coincides with ongoing controversy at Bitfinex, which is currently facing <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/nyag-says-information-bitfinex-was-asked-to-produce-should-be-at-its-fingertips\/\" data-v-f87c67ca=\"\">intense scrutiny<\/a> from the New York Attorney General's office over a $850 million fraud investigation.","Launched in mid-2018 as a decentralized, peer-to-peer exchange for ERC20 tokens, the rebranded spin-off firm is hoping to be \"much more competitive\" through the launch of \"an entire new exchange for settlement of funds between institutional traders\"; a pivot away from its traditionally retail customer base.","\"This is more than a rebrand; this is about needing more space to grow,\" DeversiFi CEO Will Harborne told The Block, adding that he was hoping to lure traders with a low fee, regulated product.","DeversiFi will also step back from overseeing Initial Exchange Offerings (IEOs) which it had done on Bitfinex's behalf via new platform <a href=\"https:\/\/www.theblockcrypto.com\/2019\/05\/21\/scandalized-bitfinex-plans-to-support-ieos-via-new-platform\/\" data-v-f87c67ca=\"\">Tokenix<\/a>.","DeversiFi's new team is made up of eight former Bitfinex and Ethfinex employees, who have coordinated a so-called \"management buy-out\" to cement the split.","\"I wouldn't call it a <span data-dobid=\"hdw\" data-v-f87c67ca=\"\">coup d'é·tat<\/span>,\" Harborne laughed. \"We've done this with Bitfinex's blessing.\"","Although the nature of the deal with Bitfinex cannot be disclosed, he hinted that it was mutually beneficial to the two parties.","Harborne also clarified that although Paolo Ardino, Bitfinex and former Ethfinex CTO, would no longer be involved in day-to-day operations, he had been brought on as a technical advisor.","\"We are very close to Paolo and I don't think there's anyone with his expertise in high-speed trading.\"","Prior to closing, Ethfinex had just under 10,000 users, largely concentrated in Europe. In <a href=\"https:\/\/www.theblockcrypto.com\/2019\/06\/03\/bitfinex-launches-peer-to-peer-otc-trading-on-ethereum-based-partner-platform\/\" data-v-f87c67ca=\"\">June<\/a>, it launched \"trustless\" over-the-counter (OTC) trading for large exchanges of ERC-20 tokens between users.","For now, DeversiFi will also absorb Etfhinex's existing cash assets earned in revenue, but will be newly registered in the British Virgin Islands.","As for next steps, Harborne said the plan was to get a regulated seal of approval from multiple authorities and to secure outside funding to support the upcoming product launch. It is also set to offer decentralized margin trading, using decentralized leverage tokens.","Still, DeversiFi's biggest hurdle will be establishing its presence alone, having once benefited from Bitfinex's global recognition, social media reach, and user-base.","DeversiFi is now hoping to offer users the security of trading from their private wallet and the liquidity of a large exchange, aiming for \"5-10 million in daily trading [volumes].\"","Certain centralized features will be absorbed into Bitfinex.","\"It was frustrating to work in a big company. But now we'll be smaller and leaner and work quickly. And make our own decisions,\" Harborne concluded.","DeversiFi is not the first major rebrand in crypto. Earlier this year, the company behind the Zcash network changed its name to the <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/zcash-company-rebrands-to-electric-coin-company\/\" data-v-f87c67ca=\"\">Electric Coin Company,<\/a> to differentiate between the Zcash foundation and the for-profit founding firm.&nbsp;Huobi Group also conducted a <a href=\"https:\/\/www.theblockcrypto.com\/2019\/01\/21\/huobi-aims-for-us-market-following-rebrand\/\" data-v-f87c67ca=\"\">major rebrand<\/a> earlier this year, agreeing that HBUS (its U.S. partner-firm) would use the Huobi name and website to help attract local traders."],"hashtag":[]}