{"summary":"Head Chef Jared Grey knows he faces an uphill battle to turn around SushiSwap’s fortunes but he’s working on a bold new plan.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179690\/sushiswaps-new-head-chef-describes-himself-as-a-wartime-ceo","publishDate":"2022-10-27T09:50:53","id":373,"type":null,"title":"SushiSwap&#x27;s new Head Chef describes himself as a &#x27;wartime CEO&#x27;","category":["DEFI"],"content":["Decentralized exchange SushiSwap Head Chef Jared Grey is certainly aware that he’s got a tough grind ahead.","Grey, who took on the role three weeks ago — after a lengthy search and public hiring process — has joined a team marred by controversy and personal disputes. The role has been occupied by three individuals in the past, one who <a href=\"https:\/\/www.theblock.co\/linked\/77587\/sushiswap-founder-eth-project-treasury\" data-v-f87c67ca=\"\">stole<\/a> $16 million from the project’s treasury, one who was ousted by the team, and one who <a href=\"https:\/\/twitter.com\/josephdelong\/status\/1467498477542379522?lang=en-GB\" data-v-f87c67ca=\"\">erupted<\/a> on Twitter blaming everyone but himself.&nbsp;","Amid these issues, SushiSwap has largely faded out of sight. While the exchange once nearly matched main competitor Uniswap’s volumes, last month it saw just 2.2% of the activity on Uniswap.","Yet Grey is optimistic that he can turn things around in the same way as a new CEO might revive a dying business.","“I would say that's exactly what I'm focused on doing — a kind of wartime CEO methodology right now. Like where can we cut? Where can we lean out?” he told The Block.","This mindset is going to come in handy as Grey faces three key battles. His first challenge is to heal the rifts and divisions among the SushiSwap team and its community. Then, he will need to turn the exchange’s fortunes around in time before it runs out of financial runway. Grey will need to do all of this under growing scrutiny from regulators who are eyeing the decentralized finance space.&nbsp;","To start with, Grey will need to begin by creating unity within the team and its community, where there has historically been a lot of infighting; when former CTO Joseph Delong left, he <a href=\"https:\/\/www.theblock.co\/linked\/126879\/sushiswaps-cto-resigns-amid-infighting\" data-v-f87c67ca=\"\">said<\/a> the project was \"imperiled within and without.\" That said, Grey claims that the team is already somewhat united and looking to move forward from its previous warring past.","“Everyone's really excited about what we can do. No one on the team is negative or down on the project. Everyone's really focused on their task and wants to see Sushi succeed and move to the next level and really thrive,” he said, hoping the exchange will, “Come out the other side of this bear market, fully positioned with a fresh product stack to capture back some of the marketshare that it has lost from its competitors and then, you know, innovate in some areas where it can.”","As for how he intends to provide leadership, Grey said that transparency will be key to his role — something that he hopes will lead to less drama and controversy. Beyond that, Grey wants to provide a clear vision and then hand out resources and autonomy to the team to deliver on that vision.","“If you're going to be in a leadership role, you're going to have to be open. You're going to have to hold yourself to those accountability standards. And that's how I plan to move forward,” he said.","Grey said that SushiSwap’s future will ultimately depend on its sustainability model. His goal is to make the exchange become profitable, without relying on token emissions, and fix the project’s token economics so it draws in value rather than being extractive.&nbsp;","“I think if we're able to do that on all three fronts and we're able to keep the team in alignment, which I'm confident that we can do, that we'll have a good opportunity to make Sushi a success,” he said.","<span data-v-f87c67ca=\"\">SushiSwap has lost a lot of market share against Uniswap over the last year. Image: The Block Research.<\/span>","The exchange currently passes most of the fees to its liquidity providers, taking just a fraction — some 0.005% of trades — to build up its treasury. Grey said the goal isn’t to redirect all the fees to the treasury but instead find new ways to generate revenue.&nbsp;","Grey said he’s working on a future product roadmap that will set out what the team will execute on in 2023. He intends to finish what he calls the \"Sushi Revitalization Plan\" in the next two months.&nbsp;","But he only has so long to turn the project around. The SushiSwap treasury has around 10 months of runway, he said, and it’s mostly denominated in the project’s native SUSHI token — meaning it could get cut short.&nbsp;","On top of SushiSwap’s challenges over internal team management and product market fit, the project has to wrestle with growing regulatory concerns.&nbsp;","The CFTC has gone after another DAO, Ooki DAO, claiming it to be an unincorporated association responsible for providing unlicensed trading services. If the agency gets its way, this will impact DAOs connected to projects that provide financial tools.","“I think that regulators are kind of in a phase where they're vying for priority for regulation. And so they're making moves to kind of establish their dominance,” Grey said, adding that this is playing out between the SEC and the CFTC in the courts.","SushiSwap is already making moves to protect itself. The DAO has just considered a <a href=\"https:\/\/snapshot.org\/#\/sushigov.eth\/proposal\/bafkreibawm6u4tsq4e5lqwz5yo3rg2k4p6upg5eqaeen33ghmuwxttiaqm\" data-v-f87c67ca=\"\">vote<\/a> in favor of a new structure that would require the team to create a Cayman Islands-based foundation, a Panamanian foundation and a Panamanian corporation. These legal entities will underpin various parts of the project, including its governance structure.","Grey said the structure was based on advice from Fenwick &amp; West, the law firm that represented WhatsApp during its acquisition by Meta. He said the firm had done a few of these structures with other projects and that, with all of this in mind, the team had put it to the community, which voted unanimously in favor — suggesting perhaps there's more unity there than it might seem.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cayman Islands","content":"LOCATION"},{"type":"Ooki DAO","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"2.2%","content":"PERCENT"},{"type":"Joseph Delong","content":"PERSON"},{"type":"Grey","content":"ORGANIZATION"},{"type":"Grey","content":"PERSON"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"SushiSwap","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Jared Grey","content":"PERSON"},{"type":"Fenwick &amp; West","content":"ORGANIZATION"},{"type":"0.005%","content":"PERCENT"},{"type":"$16 million","content":"MONEY"}],"hashtag":["UNISWAP"],"authors":["Tim Copeland","The Block"]}