{"summary":"Atachbarian v. Norwegian Cruise Lines is a new federal securities fraud lawsuit filed in Florida federal court on March 31, 2020.\nPlaintiff seeks class action status and says that Norwegian and its corporate management misled investors about the impact of COVID-19 on its business, which led to the stock price being artificially high and then dropping when the reality of the situation became known.\nThis is the tip of a massive iceberg of COVID-19 litigation, which may end up resulting in dedicated court dockets and even a separate compensation or dispute resolution process – depending on the scope of future claims which are likely to be in the trillions of dollars.","author":["Stephen Palley","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/60822\/securities-fraud-lawsuit-says-cruise-line-lied-about-covid-19s-impact-on-business-causing-stock-to-drop-in-price","publishDate":"2020-04-03T10:13:44","id":3731,"type":null,"title":"Securities fraud lawsuit says cruise line lied about COVID-19&#x27;s impact on business, causing stock to drop in price","category":["Legal"],"content":["A&nbsp;<a href=\"https:\/\/www.scribd.com\/document\/454806681\/Norwegian\" data-v-f87c67ca=\"\">new securities fraud lawsuit<\/a> filed in Florida federal court alleges that Norwegian Cruise Lines artificially inflated stock prices by making false and misleading statements about its business prospects for 2020 and the impact of COVID-19.","The lawsuit observes that on February 19, 2020 more than 621 people on the Diamond Princess tested positive for COVID-19. Notwithstanding this, and other knowledge of the \"devastating impact\" that this would have on the business, Plaintiff says that certain company managers \"took steps to falsely induce potential customers to book trips, by underplaying the danger of COVID_19, and the extent to which it had spread.\"","In addition to this, Plaintiffs point to an SEC filing made on February 20, 2020 that provided \"positive outlooks\" for the company in spite of COVID-19. It also notes that during an analyst call from the same day CEO Frank Del Rio underplayed the impact of COVID-19 on the company, emphasizing its \"strong book position\" and increased revenues outside of Asia.","Plaintiff alleges that \"when the truth was disclosed\" the price of Norwegian's shares dropped from $15.03 to $9.65 per share. In addition, the lawsuit points to leaked emails that show staff were directed to lie to customers about the impact of COVID-19.","These instructions allegedly included scripted lines such as a claim that \"coronavirus cannot live in the amazingly warm and tropical temperatures that your cruise will be sailing to.\"","Plaintiff is seeking class-action status and damages for securities fraud under Rule 10(b) of the Exchange Act of 1934 and the SEC's Rule 10b-5. In addition, Plaintiff seeks damages against Del Rio and other corporate officers as \"control persons\" under rule 20(a).","Oversimplifying slightly: under American securities law, someone with the requisite level of control or authority in a company can, under certain circumstances, be held personally liable for the company's fraud.","This lawsuit is the tip of the iceberg of what is likely to be a Cambrian explosion of COVID-19-related litigation. In this one industry alone, we are almost guaranteed to see numerous other 10b-5 lawsuits, personal lawsuits by people who were sickened, insurance coverage litigation by and between D &amp; O and other insurance companies over coverage for these lawsuits.","In addition, it's not just passengers who are or will be impacted. We are likely to see claims by third parties, including family members, and potential others who have had to bear the costs associated with medical treatment (and who are not subject to any limitations of liability in sales agreements with passengers). Given the volume of these claims, it's also quite likely that many will end up being resolved in bankruptcy court.","I am speculating here a little bit, but given the crush of lawsuits we are likely to see, it is entirely possible that courts will set up dedicated COVID-19 dockets, as has been the case in other mass-litigation – asbestos being one example. Depending on the number of cases, it's also possible that legislation could also be passed to set up a dedicated court and compensation system.","A recent historical analogy can be found with <a href=\"https:\/\/www.uscfc.uscourts.gov\/vaccine-programoffice-special-masters\" data-v-f87c67ca=\"\">the National Vaccine Injury Compensation Program<\/a> which is \"a no-fault compensation program whereby petitions for monetary compensation may be brought by or on behalf of persons allegedly suffering injury or death as a result of the administration of certain compulsory childhood vaccines.\"","How this would work in the context of COVID-19 remains to be seen, but given the scope of potentials losses – which will be measured in the trillions of dollars – a separate system outside of the ordinary litigation process may be necessary to allow other and ordinary litigation to proceed without overwhelming the U.S. judicial system."],"hashtag":[]}