{"summary":"Bakkt launched in 2018 with a lot of promises\nYes, we joke about “when Bakkt,” but don’t sleep on the venture\nIt could be the first real-deal custodian, and that could open some big doors","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/36531\/calling-bakkt-a-crypto-exchange-misses-the-mark-on-what-theyre-actually-doing","publishDate":"2019-08-19T11:40:23","id":3733,"type":null,"title":"Calling Bakkt a &#x27;crypto exchange&#x27; misses the mark on what they&#x27;re actually doing","category":["Custody"],"content":["Intercontinental Exchange (ICE) captivated the attention of the entire cryptocurrency market last August with the announcement of Bakkt, a new venture led by former ICE investor relations head Kelly Loeffler, which promised to usher bitcoin into the mainstream.&nbsp;","Then, Bakkt was presented in media reports, especially this <a href=\"https:\/\/fortune.com\/longform\/nyse-owner-bitcoin-exchange-startup\/\" data-v-f87c67ca=\"\">gushing Fortune profile<\/a>, as <em data-v-f87c67ca=\"\">the<\/em>&nbsp;panacea to the problems hanging over the nascent bitcoin market, which has been plagued by hacks and has struggled to attract the attention of professional money managers and investors.&nbsp;","\"The founding imperative for Bakkt will be to make Bitcoin a sound and secure offering for key constituents that now mostly shun it—the world’s big financial institutions,\" wrote Fortune's Shawn Tully.&nbsp;","\"The next step after that could be using Bitcoin to replace your credit card,\" he added, referring to big partnerships with Microsoft and Starbucks. Sparse details about the coffee-maker and tech firm's involvement in Bakkt have been released since August 2018.","As part of Bakkt's exit from stealth-mode, the firm also promised to launch a bitcoin futures contract in November 2018, which unlike others on the market at the time, would physically settle. On Friday, Bakkt said it would finally roll out the product to clients on Sept. 23. Indeed, the roll out would make it the first firm in the U.S. to offer regulated physically-delivered futures contracts tied to bitcoin — a development many in the market have described as a significant step in the cryptocurrency's maturation. Of course, provided neither ErisX or LedgerX goes first.&nbsp;","Still, two futures contract tied to bitcoin are a far, far cry from an \"open platform that helps unlock the transformative potential of digital assets\" described by Loeffler in 2018. At least at first glance.&nbsp;","If there's one thing worth considering — at least based off my conversations with market makers — betting against Intercontinental Exchange is a fool's errand. Indeed, Bakkt's slow and steady approach — an alien concept to the crypto natives among us — might actually turn out to be a winning strategy.&nbsp;","But let's start with the first point. As I noted in a semi-lucid <a href=\"https:\/\/twitter.com\/fintechfrank\/status\/1162389928010895360?s=21\" data-v-f87c67ca=\"\">Twitter thread<\/a> Friday, Intercontinental Exchange, founded by Loeffler's husband Jeffrey Sprecher, has been known for pulling off the impossible.","Founded in 2000, Intercontinental Exchange launched as an over-the-counter trading platform for energy, metals, and other commodities. Backed by Goldman Sachs, Morgan Stanley, and Deutsche Bank, it set out to leverage internet technology to ameliorate the experience of trading commodities — specifically, by making it cheaper and more transparent.&nbsp;","In 2013, Nathaniel Popper told the New York Times the story of ICE's journey from Sprecher's late nights on his sister's couch, ruminating over his inability to clinch investors for what was \"eating up his money and years of his life\" all the way to its mega-purchase of America's icon of capitalism, the New York Stock Exchange.&nbsp;","Indeed, it still sounds preposterous. Almost as preposterous as ICE's plan to build out Bakkt to serve as&nbsp;<em data-v-f87c67ca=\"\">the&nbsp;<\/em>backbone of the entire cryptocurrency ecosystem.&nbsp;","Don't sleep on ICE. In its earliest days ICE grew quickly, expanding with the acquisition of London-based International Petroleum Exchange in 2001, then the New York Board of Trade in 2005. In 2008, ICE launched a clearinghouse for credit default swaps following the financial crisis. Two years later, <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2010-07-29\/ices-jeffrey-sprecher-the-sultan-of-swaps\" data-v-f87c67ca=\"\">Bloomberg News<\/a> dubbed Sprecher \"The Sultan of Swaps\" for quickly growing the business to clear $10 trillion by 2010.&nbsp;","To be sure, in some respects, ICE has been a bit of a disappointment in recent years, acquiring more than creating.&nbsp;","\"They were excellent in their formative years and made a load of dollars,\" said Thomas G. Thompson, a derivatives expert and contributing editor for John Lothian News. \"Since then they have spent the shareholders' wealth on a raft of subs that have disappointed.\"","Hovering around 22%, according to data collected by The Wall Street Journal, NYSE's share of the total U.S. equities market following the acquisition has not benefited noticeably as a result of new ownership.","Still, as far as ICE's overall stock price is concerned, shareholders don't have a lot to cry about. It is up a whopping 1,200% since the company went public in 2005.&nbsp;","","","As for Bakkt, the backing of ICE is one of its main selling points, according to market makers who spoke under the condition of anonymity. But what exactly is Bakkt?&nbsp;","Its early marketing push really buried the lede on this, in my opinion. Putting aside the credit card ambitions and Starbucks partnership, what Bakkt brings to the table — and what it is now positioning itself strongly as — is its status as a qualified, institutional custodian business with the backing of a $51 billion publicly traded company. To start, the custody business will store the bitcoin that underpin its contracts, but it's safe to assume they will soon open their doors to hedge funds, asset managers, and other clients.&nbsp;","\"Wait, so it's not a crypto exchange?,\" you might be asking yourself. No, not really. At least, not yet.&nbsp;","Don't let the futures distract you. Custody is at the heart of Bakkt, several sources tell me. So to a degree it is competing with ErisX, Seed CX, and the litany of other derivatives platforms, on the futures side. But its real competitors are BitGo, Coinbase Custody, and Fidelity. The value proposition of using Bakkt as a custodian are clear. It's a truly institutional-grade offering with the blessing of the CFTC and New York State. (No offense, South Dakota registrants).&nbsp;","\"With state-of-the-art physical and cyber security, institutional grade technology and governance, and backed by insurance for digital assets held in frozen wallets, Bakkt is delivering a new standard in digital asset custody by leveraging the cybersecurity tools on which the NYSE relies,\" Bakkt's revamped website reads.&nbsp;","Coinbase and BitGo have their own strengths, to be sure. Namely, their respective sizable user bases.","Coinbase's acquisition of Xapo could bring the total amount of bitcoin under its control to approximately 4% of the total supply or 860,000 bitcoin. Currently, 2.5% of all bitcoin are under its custody. Grayscale, one of the largest cryptocurrency asset managers, has approximately $3 billion in assets managed by Coinbase.","BitGo reportedly has $2 billion in assets under its custody. Meanwhile, newbie Fidelity's custody business offers a complementary broker business to help clients route orders to exchanges when they want to make a trade. Custody is only a part of what these firms strive to do. Fees, which last summer hovered around 100 basis points, are now fast approaching zero. Coinbase already operates an exchange business, in addition to custody. BitGo is looking to launch a prime broker business, several sources tell The Block.&nbsp;","As for Bakkt, the futures contract is likely part of a broader effort to enable regulated price discovery. It's something chief operating officer Adam White hinted at during FIA Boca.&nbsp;","\"What Bakkt fundamentally believes is that price discovery is going to happen in an end-to-end regulated market,\" he said. \"Most of that price discovery is happening in the spot market, but it is going to switch to the futures markets.\"","As that shift could help remedy the concerns of regulators who have declined exchange-traded funds on the concerns that they would rely on prices from unregulated spot markets.&nbsp;","And Bakkt could play a role in the launch of new instruments, which would be tied to their \"end-to-end\" regulated market.&nbsp;","With the green light to operate as a trust in the state of New York, Bakkt has more free reign than other firms in the market to launch new business lines. As Arthur Long, a lawyer with Gibson Dunn told The Block in May, a trust is \"more expansive\" and allows firms to operate in a broader swath of services in finance.&nbsp;","So maybe an ETF. Perhaps, an asset manager. Maybe even that long-awaited 401(k) on-ramp.&nbsp;"],"hashtag":["COINBASE","DERIVATIVES"]}