{"summary":"Mining firm Bitkan, along with seven other crypto companies, were questioned by the local financial bureau in Shenzhen, China\nThe crackdown culture in Shenzhen and nationwide has intimidated a variety of crypto businesses.","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/51124\/crypto-companies-reportedly-face-questions-at-meeting-with-shenzhen-finance-regulator","publishDate":"2019-12-19T16:00:21","id":3735,"type":null,"title":"Crypto companies reportedly face questions at meeting with Shenzhen finance regulator","category":["China"],"content":["Eight crypto companies were questioned by local authorities in Shenzhen, China.","On Dec 18, Shenzhen Financial Bureau hosted a meeting on regulating illegal crypto-related business activities, Beijing media outlet BBT News <a href=\"http:\/\/www.bbtnews.com.cn\/2019\/1219\/329358.shtml\" data-v-f87c67ca=\"\">reported<\/a>, where authorities questioned representatives from the companies. According to the report, two of these businesses allegedly opened up trading venues and six of them have allegedly conducted initial coin offerings (ICO).","“We conducted our investigation through an initial online screening and subsequent offline questioning,” a Shenzhen bureau staff member <a href=\"https:\/\/finance.sina.cn\/blockchain\/2019-12-19\/detail-iihnzahi8545191.d.html?from=waphttps:\/\/www.chinastarmarket.cn\/detail\/419373\" data-v-f87c67ca=\"\">told<\/a> local media outlet China Star Market.","“Just because we haven’t questioned some companies doesn’t mean that they have no problems,” the staff member said. “The companies we questioned today are not necessarily problematic. We are still verifying their situations.”","Shenzhen-based BitKan, one of the firms mentioned by the report, was founded in 2012 with investment from Chinese mining giant Bitmain.","Originally a marketplace for over the counter (OTC) trading, the firm pivoted toward a paid platform that provides user-generated content and investment strategies in 2018 to avoid participating in an environment filled with “fake ICO white papers and scams,” as CoinDesk previously <a href=\"https:\/\/www.coindesk.com\/crypto-data-startup-bitkan-raises-10-million-new-funding\" data-v-f87c67ca=\"\">reported<\/a>.&nbsp;","BitKan claimed that it terminated its affiliation with AbleCloud, the operation in question, following China's ban on ICOs in September 2017 and now operates mainly in Japan and Singapore. Noticeably, sources told BBT News that many companies took their operations abroad on the book but are still targeting Chinese customers.","<strong data-v-f87c67ca=\"\">Crackdowns in Shenzhen<\/strong>","According to <a href=\"https:\/\/m.sohu.com\/a\/355351861_100117963\/?pvid=000115_3w_a\" data-v-f87c67ca=\"\">local reports<\/a>, by late November, Shenzhen’s finance bureau had identified 39 enterprises that were allegedly conducting illegal cryptocurrency-related businesses.","The ongoing investigation reportedly target three activities: trading, channeling assets to overseas trading places, and selling tokens or raising funds in the form of currencies like bitcoin and ethereum.","Daniel Bar, founder of Shenzhen-based blockchain venture network Bitfwd, told The Block that even though many businesses operating in Shenzhen are certainly scams, the culture of crackdown has also intimidated people who are working on legitimate crypto-related projects.","“Even for legitimate projects, there are many layers of people involved,” he said. “For people who conduct OTC deals, for example, if someone that they're receiving an Alipay, Wechat Pay, or bank transfer from got flagged because of the government’s suspicion, it means that they can also get flagged and have their bank accounts frozen.\"","\"These stories aren't unheard of,\" he added.&nbsp;","<strong data-v-f87c67ca=\"\">Regulation unclear<\/strong>","In October, President Xi Jinping&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/post\/44646\/xi-jinping-says-to-let-china-take-the-leading-position-in-blockchain\" data-v-f87c67ca=\"\">remarked<\/a> that the country should up its commitment to the development of blockchain technology and use it as a vehicle for innovative breakthroughs.","But despite Xi's welcoming announcement regarding blockchain, China's official position on cryptocurrency is still <a href=\"https:\/\/www.theblockcrypto.com\/daily\/46293\/chinas-president-xi-wants-the-nation-to-lead-on-blockchain-but-insiders-say-local-governments-might-get-in-the-way\" data-v-f87c67ca=\"\">unclear<\/a>. The government's crackdown on illegal token issuing and crypto-related in September 2017 further sparked anxieties among entrepreneurs in the field.&nbsp;","According to a <a href=\"https:\/\/www.theblockcrypto.com\/author\/yilun_tb\" data-v-f87c67ca=\"\">November episode<\/a> of \"Focus Report,\" a high-profile state-backed news program, there are 32,000 alleged blockchain companies in China but only less than 10 percent of them actually possess the technology.","The center has identified over 755 tokens on the market that are not backed by real initiatives or have hit zero-value after inception, as well as 102 coins that were allegedly used to swindle consumers via Ponzi schemes, the show reported.&nbsp;","In the meantime, Shanghai local authorities' investigation into crypto businesses, initially set to end on Nov. 22, has been <a href=\"https:\/\/www.theblockcrypto.com\/daily\/48628\/a-look-at-chinas-wild-month-in-crypto-after-president-xi-praised-blockchain\" data-v-f87c67ca=\"\">extended<\/a>.","Regulators <a href=\"https:\/\/www.theblockcrypto.com\/linked\/48079\/china-central-banks-shanghai-unit-officially-announces-to-crack-down-on-crypto-exchanges\" data-v-f87c67ca=\"\">said<\/a> they would “adopt monitoring measures such as interviews, inspections, and bans on the monitored entities involved in virtual currency activities to resolve related risks in a timely manner.”"],"hashtag":[]}