{"summary":"The U.K.’s Financial Conduct Authority (FCA) has ordered crypto exchange Binance to stop undertaking regulated activity in the country.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/109766\/uk-fca-bans-crypto-exchange-binance","publishDate":"2021-06-27T09:30:01","id":3736,"type":null,"title":"UK regulator bans Binance from regulated activities in the country","category":["REGULATION"],"content":["The U.K.’s Financial Conduct Authority (FCA) has ordered Binance Markets Limited — Binance's UK entity — to stop undertaking any regulated activity in the country. It is unclear whether the FCA ban will affect Binance's ability to offer spot trading to U.K. customers.","The FCA <a href=\"https:\/\/www.fca.org.uk\/news\/news-stories\/consumer-warning-binance-markets-limited-and-binance-group\" data-v-f87c67ca=\"\">announced<\/a> Saturday that Binance Markets Limited and the Binance Group do not hold any form of authorization to conduct regulated activities in the U.K., but still offer citizens a range of services online.","In the U.K., crypto-assets themselves, such as bitcoin and ether, are unregulated but certain trading products related to them, such as futures and options trading, are regulated.","In a statement to The Block on June 27, a Binance spokesperson said that the FCA’s notice “has no direct impact on the services provided on Binance.com.”","The spokesperson said that BML is a separate legal entity that does not offer products through the Binance.com website. “The Binance Group acquired BML [in] May 2020 and has not yet launched its U.K. business or used its FCA regulatory permissions,” they added.","<em data-v-f87c67ca=\"\">(For a more detailed look at the FCA's statement and what it really means for Binance, see The Block News Plus's <a href=\"https:\/\/www.theblockcrypto.com\/daily\/109841\/uk-fca-binance-ban-derivatives-spot-trading\" data-v-f87c67ca=\"\">latest article on the ban<\/a>.)<\/em>","Binance Markets Limited has been asked to stop undertaking any regulated activity in the U.K. <a href=\"https:\/\/register.fca.org.uk\/s\/firm?id=001b000000nojfNAAQ#what-can-this-firm-do-restrictions\" data-v-f87c67ca=\"\">by June 30.<\/a> The FCA has also ordered Binance to display a notice on its website and social media that it is not permitted to undertake any regulated activity in the country.","\"The Firm will remove, or where this is not practicable, give instructions for the removal of any advertising and financial promotions it currently has live, in whatever form they take by close of business on 30 June 2021,\" said the FCA.","Binance must also preserve all records relating to all its U.K. consumers and notify the FCA in writing by July 2, according to the watchdog.","In 2020, the U.K. established a registration regime for crypto exchanges, announcing that they must get approval in order to provide any crypto services in the country. But the deadline for exchanges to be registered has been pushed back multiple times since just a handful of companies have managed to get registered.","The FCA is known to drill crypto firms before offering registration. To date, the watchdog has only approved <a href=\"https:\/\/www.theblockcrypto.com\/post\/109479\/uk-regulator-approves-fifth-crypto-company\" data-v-f87c67ca=\"\">five crypto companies:<\/a> Two Gemini entities, Archax, Ziglu, Digivault, the custody business of Diginex, and Mode Global Holdings.","Binance announced the U.K. entity, Binance Markets Limited, in June 2020 after acquiring an FCA-registered firm called <a href=\"https:\/\/www.theblockcrypto.com\/daily\/69005\/crypto-exchanges-uk-aml-rules\" data-v-f87c67ca=\"\">EddieUK.<\/a> Later, Binance itself reportedly applied to become a registered crypto company with the FCA but <a href=\"https:\/\/www.ft.com\/content\/8bc0e5e0-2705-496d-a265-acccaffaee87\" data-v-f87c67ca=\"\">pulled that application<\/a> last month “following intensive engagement\" from the watchdog.","The current deadline for existing crypto exchanges to get FCA approval in the U.K. is March 31, 2022.","The news comes at a time when Binance is said to be under scrutiny by regulators in <a href=\"https:\/\/www.theblockcrypto.com\/linked\/104836\/binance-crypto-irs-us-government-investigation-report\" data-v-f87c67ca=\"\">the U.S.<\/a> and <a href=\"https:\/\/www.theblockcrypto.com\/post\/102563\/binance-european-regulators-stock-token-offering\" data-v-f87c67ca=\"\">Europe<\/a> and has received another <a href=\"https:\/\/www.theblockcrypto.com\/linked\/109623\/japan-fsa-another-warning-binance-unregistered-operations\" data-v-f87c67ca=\"\">warning from Japan<\/a> over its unregistered operations.","Binance did not immediately respond to The Block's request for comment but has previously said, \"we take a collaborative approach in working with regulators, and we take our compliance obligations very seriously.\"","Binance is the largest crypto exchange in the world by trading volumes. It recorded over $1.5 trillion worth of trading volumes last month, according to <a href=\"https:\/\/www.theblockcrypto.com\/data\/crypto-markets\/spot\" data-v-f87c67ca=\"\">The Block's Data Dashboard<\/a>.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/crypto-only-exchange-volume\/embed\" title=\"Crypto-only Exchange Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<em data-v-f87c67ca=\"\">Update: This article has been updated to provide clarity on which services the regulator has banned and whether it can still offer spot trading to U.K. users.<br data-v-f87c67ca=\"\">\n<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"FCA","content":"ORGANIZATION"},{"type":"Archax","content":"LOCATION"},{"type":"March 31, 2022","content":"DATE"},{"type":"Digivault","content":"PERSON"},{"type":"U.K.","content":"LOCATION"},{"type":"Mode Global Holdings","content":"ORGANIZATION"},{"type":"Ziglu","content":"LOCATION"},{"type":"Europe","content":"LOCATION"},{"type":"BML","content":"ORGANIZATION"},{"type":"July 2","content":"DATE"},{"type":"June 27","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"Saturday","content":"DATE"},{"type":"June 2021","content":"DATE"},{"type":"$1.5 trillion","content":"MONEY"},{"type":"May 2020","content":"DATE"},{"type":"June 2020","content":"DATE"},{"type":"June 30","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Japan","content":"LOCATION"},{"type":"The Binance Group","content":"ORGANIZATION"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"U.K.’s Financial Conduct Authority (FCA","content":"ORGANIZATION"},{"type":"Binance Group","content":"ORGANIZATION"},{"type":"Two Gemini entities","content":"ORGANIZATION"}],"hashtag":["BINANCE","CZ","FCA"],"authors":["Yogita Khatri","The Block"]}