{"summary":"FTX’s revenue in 2021 was 10 times what it was in 2020, according to a new report.\nCEO Sam Bankman-Fried confirmed on Twitter that the report’s numbers are in the “correct ballpark.”","author":["Mike Orcutt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/164680\/ftx-generated-more-than-a-billion-dollars-in-revenue-last-year-cnbc","publishDate":"2022-08-20T15:09:15","id":3738,"type":null,"title":"FTX generated more than a billion dollars in revenue last year: CNBC","category":["Exchanges"],"content":["Crypto exchange FTX generated more than $1 billion in 2021 revenue after making only $90 million the year before, according to a new report from <a href=\"https:\/\/www.cnbc.com\/2022\/08\/20\/ftx-grew-revenue-1000percent-during-the-crypto-craze-leaked-financials.html\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">CNBC<\/a>.","The growth was driven by its global trading business, according to the report, which cites internal documents. It also states that FTX raised its operating income from $14 million in 2021 to $272 million last year, and its net income rose from $388 million to $17 million in the same time period.&nbsp;","FTX generated $270 million in revenue in the first quarter of 2022 and was on track to generate $1.1 billion this year, according to an investor deck seen by CNBC, which notes that it is not clear how the market crash from earlier this year affected the firm.","Founded in 2019, FTX quickly rose to become a leading exchange under the leadership of CEO Sam Bankman-Fried.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/fiat-exchange-market-share\/embed\" title=\"Fiat Exchange Market Share\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Lately, Bankman-Fried has been pursuing acquisitions and has stepped in to lend money to crypto companies facing liquidity crises. In July, FTX US <a href=\"https:\/\/www.theblock.co\/post\/155516\/blockfi-strikes-680-million-credit-deal-with-ftx-us-outlines-acquisition-path\" data-v-f87c67ca=\"\">struck a deal<\/a> with crypto lender BlockFi that gives FTX an option to buy the firm and was <a href=\"https:\/\/www.theblock.co\/post\/159189\/ftx-in-talks-to-buy-south-korean-crypto-exchange-bithumb-bloomberg\" data-v-f87c67ca=\"\">in talks to buy<\/a> South Korean crypto exchange Bithumb. That followed the acquisitions in June of crypto trading firm Bitvo and the clearing firm Embed.","FTX declined to comment to CNBC on the leaked financials. But Bankman-Fried appeared to <a href=\"https:\/\/twitter.com\/SBF_FTX\/status\/1561053841696727045\" data-v-f87c67ca=\"\">confirm on Twitter<\/a> that the numbers in the report are in the \"correct ballpark.\""],"hashtag":["FTX"]}