{"summary":"Base&#x27;s wider network launch follows its testnet debut in February and the subsequent developer-only release in July","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/243899\/base-mainnet-onchain-summer","publishDate":"2023-08-09T12:01:10","id":374,"type":null,"title":"Coinbase&#x27;s Base mainnet officially opens to the general public","category":["CRYPTO ECOSYSTEMS"],"content":["Coinbase's Base mainnet has officially opened to the general public, featuring over 100 dapps and service providers as part of the Base ecosystem.","Users can explore these dapps and benefit from lower transaction fees and faster transaction speeds compared to Ethereum, said Jesse Pollak, the lead for protocols at Coinbase.","Since its testnet debut in <a href=\"https:\/\/www.theblock.co\/post\/214183\/coinbase-unveils-layer-2-network-and-developer-fund\" data-v-f87c67ca=\"\">February<\/a> and the subsequent developer-only <a href=\"https:\/\/www.theblock.co\/post\/239393\/coinbase-base-mainnet-developers?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">release<\/a> in July, Base has integrated with a myriad of crypto projects, including <a href=\"https:\/\/www.theblock.co\/post\/243721\/uniswap-gets-deployed-on-coinbases-layer-2-network-base\" data-v-f87c67ca=\"\">DeFi protocols<\/a>, wallets, bridges, <a href=\"https:\/\/www.theblock.co\/post\/243685\/chainlink-price-feeds-go-live-on-coinbases-base-l2-network\" data-v-f87c67ca=\"\">oracles<\/a>, and both analytics and infrastructure providers.","Base, developed on Optimism’s software stack known as the OP Stack, operates as a rollup network. Base is a scaling solution that processes transactions off the main Ethereum blockchain, thereby providing a more affordable network for dapps.","Moreover, this Layer 2 solution is anticipated to become the default network for Coinbase’s on-chain products. “We’re thrilled to announce that Base mainnet is now live and available for everyone. At launch, there are 100+ dapps and service providers available in the Base ecosystem, as well as deep integrations across the Coinbase product ecosystem,” said Pollak.","Coinciding with Base’s public mainnet rollout, it has started what it calls an “onchain summer” event. Spanning several weeks, this event emphasizes promoting Base’s mainnet partner dapps in the realms of digital art, music, and gaming. Notably, users will have the option to mint a unique “Base, Day One” NFT in celebration of the Base mainnet’s opening.","In the lead-up to this launch, both developers and users have already transferred assets valued at <a href=\"https:\/\/www.theblock.co\/post\/243379\/bridged-assets-to-coinbases-layer-2-top-100-million\" data-v-f87c67ca=\"\">over $100 million<\/a> to the network.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Coinbase","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Jesse Pollak","content":"PERSON"},{"type":"Pollak","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"July","content":"DATE"},{"type":"summer","content":"DATE"},{"type":"OP Stack","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["BASE"],"authors":["Vishal Chawla","The Block"]}