{"summary":"The supply of ether (ETH) seems on trend to deflate to pre-Merge levels because more coins are being burned than created.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179144\/ethereum-token-supply-on-trend-to-drop-below-pre-merge-levels","publishDate":"2022-10-22T09:02:57","id":3741,"type":null,"title":"Ethereum supply on trend to drop below pre-Merge levels","category":["TECHNOLOGY"],"content":["<span data-v-f87c67ca=\"\">The supply of Ethereum's native asset ether (ETH) appears on trend to deflate to pre-Merge levels as a result of more coins being burned than created for the last few weeks, on-chain data shows. <\/span>","<span data-v-f87c67ca=\"\">At the time of The Merge on Sept. 15, Ethereum's upgrade from proof-of-work to proof-of-stake consensus, the ETH supply was 120,520,000 coins. <\/span><span data-v-f87c67ca=\"\">After The Merge, the supply rose to 120,534,000 on Oct. 8, but has since fallen back to 120,522,000, now sitting just a couple of thousand coins more than the supply recorded at The Merge. This deflationary trend has occurred as more coins have been burned for transaction fees than were created as rewards for validators in recent weeks.<\/span>","<span data-v-f87c67ca=\"\">“Since issuance is significantly reduced now compared to pre-Merge, even a slight increase in burned ETH from recent levels would make daily net emission go negative,” said Kevin Peng, research analyst at The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">One of the many <a href=\"https:\/\/www.theblock.co\/post\/177704\/five-key-ways-the-merge-affected-the-ethereum-blockchain\" data-v-f87c67ca=\"\">changes<\/a> from The Merge is a 90% reduction in new token supply issuance amid the elimination of miner subsidies in the former proof-of-work blockchain. Combined with the EIP-1559 feature on Ethereum, where a portion of transaction, or gas, fees are \"burned,\" it's estimated that more ether is destroyed than added to supply whenever the transaction fees go above 16 gwei, the very trend being observed now. In fact, the supply is merely 1,700 ETH away from getting to pre-Merge level and continuously going down, according to <a href=\"https:\/\/ultrasound.money\/\" data-v-f87c67ca=\"\">data<\/a> from ultrasound.money.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">If this trend continues, and fee burns remain greater than new issuance, we may see supply growth drop below the level prior to The Merge in the next few days, <\/span><a href=\"https:\/\/twitter.com\/mhonkasalo\/status\/1582853040972787712?s=46&amp;t=31DMFFOXpPPLX3f7fxPWPw\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">noted<\/span><\/a><span data-v-f87c67ca=\"\"> DeFi researcher Mika Honkasalo. <\/span><span data-v-f87c67ca=\"\">\"Post-merge total supply change is about to turn negative in the next 5-7 days,\" Honkasalo<\/span> <a href=\"https:\/\/twitter.com\/mhonkasalo\/status\/1582853040972787712?s=46&amp;t=31DMFFOXpPPLX3f7fxPWPw\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">tweeted<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">ETH supply change since The Merge. Image: Ultrasound.money<\/span>","<span data-v-f87c67ca=\"\">While average transaction fees remained low for some time after The Merge, since Oct. 8 they have increased along with a spike in activity on Ethereum. The increased activity has been accounted for by the introduction of a freely claimable token called <a href=\"https:\/\/www.theblock.co\/post\/176923\/someone-abused-ftxs-withdrawal-fee-subsidy-to-mint-70000-of-xen\" data-v-f87c67ca=\"\">XEN<\/a>. This is a token that’s open to claim by anyone as long as claimants pay the Ethereum transaction fees, and it has effectively spammed the blockchain for a few weeks.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Later, big trading volumes around new memecoins also contributed to an expanding volume of transactions and an increase in fees, both normal validator rewards and miner extractable value, resulting in an expansion of ether burned. <\/span>","<span data-v-f87c67ca=\"\">Currently, the average fees are ranging anywhere between 20 to 30 gwei, a situation that is more than enough to burn a lot of ether every day and make the supply deflationary. <\/span><span data-v-f87c67ca=\"\">The amount of ETH burned on a given day is contingent on network activity, as the base fee adjusts according to how crowded blocks are, and more transactions overall just mean more fees burned.<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/net-eth-emission-after-eip-1559\/embed\" title=\"Net ETH Emission after EIP-1559\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Sept. 15","content":"DATE"},{"type":"The Merge","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"7 days","content":"DATE"},{"type":"Mika Honkasalo","content":"PERSON"},{"type":"Oct. 8","content":"DATE"},{"type":"Kevin Peng","content":"PERSON"},{"type":"1559","content":"DATE"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ETHEREUM"],"authors":["Vishal Chawla","The Block"]}