{"summary":"SC Ventures, the innovation arm of Standard Chartered, has partnered with Northern Trust, to launch a crypto custody business.\nDubbed Zodia Custody, the new business will launch in London next year.\nThe news confirms previous reports which said SC Ventures is building a crypto custody solution for institutional investors. ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/87097\/standard-chartered-northern-trust-crypto-custody-zodia","publishDate":"2020-12-09T01:15:20","id":3741,"type":null,"title":"Standard Chartered teams up with Northern Trust to launch crypto custody business &#x27;Zodia&#x27;","category":["Custody"],"content":["SC Ventures, the innovation and ventures arm of Standard Chartered, has partnered with Northern Trust, to launch a crypto custody business.","Dubbed Zodia Custody, <a href=\"https:\/\/www.businesswire.com\/news\/home\/20201208006211\/en\/Standard-Chartered-and-Northern-Trust-Partner-to-Launch-Zodia-a-Cryptocurrency-Custodian-for-Institutional-Investors\" data-v-f87c67ca=\"\">the new business<\/a> will launch in London, according to an announcement late Tuesday. Zodia is expected to begin operations next year, pending registration with the U.K. Financial Conduct Authority and other regulatory conditions.","The news <a href=\"https:\/\/www.theblockcrypto.com\/linked\/72238\/banking-giant-standard-chartered-is-building-a-crypto-custody-solution\" data-v-f87c67ca=\"\">confirms previous reports<\/a> which said SC Ventures is building a crypto custody solution for institutional investors. At the time, Northern Trust's participation wasn't known.","At launch, Zodia will provide custody services for bitcoin (BTC) and ether (ETH), and then support more cryptocurrencies in the future, including XRP, litecoin (LTC), and bitcoin cash (BCH), per the announcement.","“The introduction of digital custody backed by the know-how and experience of global banks is a breakthrough in the evolution and support of institutional cryptocurrency markets,\" said Pete Cherecwich, president of corporate and institutional services at Northern Trust. \"Zodia’s robust capabilities will make it possible for institutional asset owners, family offices and asset managers to invest in a range of cryptocurrencies as interest continues to grow in these emerging and innovative financial instruments.”","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Crypto trading as well?<\/strong><\/span>","A new report from CoinDesk on Tuesday <a href=\"https:\/\/www.coindesk.com\/standard-chartered-bank-to-launch-crypto-trading-for-institutional-investors-sources\" data-v-f87c67ca=\"\">said<\/a> that Standard Chartered is also launching a crypto trading service for institutional investors.","Citing \"two sources familiar with the plan,\" the report said that the bank is working with a group of crypto exchanges and over-the-counter trading desks for the new offering. These are said to include LMAX and ErisX. Standard Chartered will reportedly make the first test trade next month.","The bank is said to be also building an ERC-20 settlement token for its crypto trading platform. \"We are building our own token of fiat collateral and hoping that will become the equivalent of Tether, except that the tokenized collateral or money will be held in the trading bank account of a proper bank, like a Standard Chartered, a JPMorgan, a Deutsche Bank,\" one of the two sources told CoinDesk.","A number of established financial institutions and banks have been looking into offering crypto services, <a href=\"https:\/\/www.theblockcrypto.com\/post\/85896\/singapore-third-largest-bank-uob-crypto-custody\" data-v-f87c67ca=\"\">including<\/a> JPMorgan, DBS, and BBVA. The overall trend suggests that giants that once shied away from crypto are now embracing the nascent industry."],"hashtag":["XRP"]}