{"summary":"The U.S. Federal Reserve held its federal funds interest rate at 5.25%, following an extended period of consecutive rate hikes.","author":["Michael McSweeney","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234729\/bitcoin-price-swings-as-federal-reserve-opts-to-hold-interest-rates-in-place","publishDate":"2023-06-14T14:12:18","id":3742,"type":null,"title":"Bitcoin price falls as Federal Reserve opts to hold interest rates in place","category":["Markets"],"content":["The U.S. Federal Reserve held its federal funds interest rate at 5.25%, following an extended period of consecutive rate hikes.","Bitcoin's price gyrated in the aftermath of the <a href=\"https:\/\/www.federalreserve.gov\/newsevents\/pressreleases\/monetary20230614a.htm\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">announcement<\/a> and ended the day declining 3.4%, according to <a href=\"https:\/\/www.tradingview.com\/chart\/2ffUG7Za\/?symbol=COINBASE%3ABTCUSD\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">TradingView<\/a> data. Bitcoin is currently trading at around $25,063. Ether declined 5% to $1,652.","The top cryptocurrency by market capitalization had largely traded in a narrow range ahead of the announcement.","\"Inflation remains elevated,\" the Federal Reserve said in a statement. \"The Committee is strongly committed to returning inflation to its 2 percent objective.\"","\"This has little to do with the FOMC, and more to do with thinner liquidity and weak sentiment,\" Michael Safai at crypto trading firm Dexterity Capital said in an emailed statement, commenting on the crypto price declines later in the day. \"Crypto tracked in line with stocks after the Fed press release and conference, and there weren’t any surprises.\"&nbsp;&nbsp;","\"Where the selling is coming from will dictate whether this is just a tough afternoon, or that things might be challenging for a while,\" he continued. \"No full clarity on what that is just yet.","(<em data-v-f87c67ca=\"\">Updates prices and adds market commentary.<\/em>)","&nbsp;"],"hashtag":[]}