{"summary":"Robinhood will pay $10.2 million in penalties after its March 2020 platform outages.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225327\/robinhood-settlement","publishDate":"2023-04-06T17:41:29","id":3742,"type":null,"title":"Robinhood settles with state securities regulators for $10 million","category":["COMPANIES"],"content":["Robinhood will pay $10.2 million in penalties for harming “main street investors,” after the company’s platform outages in March 2020 sparked a probe by seven state securities regulators.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“Robinhood repeatedly failed to serve its clients, but this settlement makes clear that Robinhood must take its customer care obligations seriously and correct these deficiencies,” North American Securities Administrators Association President Andrew Hartnett said in a <a href=\"https:\/\/dfpi.ca.gov\/2023\/04\/06\/california-joins-multiple-states-in-10-million-settlement-with-robinhood-for-failing-investors\/\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">press release<\/span><\/a>.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The settlement comes after a North American Securities Administrators Association investigation, which was led by state securities regulators in Alabama, Colorado, California, Delaware, New Jersey, South Dakota, and Texas.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Robinhood did not immediately respond to a request for comment.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Robinhood’s operations came under scrutiny in March 2020, when its platform experienced outages while hundreds of thousands of investors were using the app to make trades. Before March 2021, regulators say Robinhood had “deficiencies” in its review and approval process for options and margin accounts. Some users were unable to process trades, even as some stock prices dropped, due to weaknesses in Robinhood’s customer service and escalation protocols.","Robinhood is <a href=\"https:\/\/dfpi.ca.gov\/wp-content\/uploads\/sites\/337\/2023\/04\/Consent-Order-Robinhood-Financial-LLC.pdf?emrc=d6bb57\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">accused<\/span><\/a> of “negligent dissemination of inaccurate information to customers,” along with failing to have a reasonably designed customer identification program.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The regulators also say Robinhood failed to supervise technology that was key to providing customers with core broker-dealer services and did not report all customer complaints to the Financial Industry Regulatory Authority and state regulators.","Robinhood did not admit or deny the allegations, according to the California Department of Financial Protection and Innovation. The company “fully cooperated” with the investigation, and the agency said it found no evidence of willful or fraudulent conduct.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“Platforms such as Robinhood must comply with common-sense protections for investors and consumers as required by law,” DFPI Commissioner Clothilde Hewlett said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Financial Industry Regulatory Authority","content":"ORGANIZATION"},{"type":"California Department of Financial Protection and Innovation","content":"ORGANIZATION"},{"type":"Clothilde Hewlett","content":"PERSON"},{"type":"Delaware","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"” North American Securities Administrators Association","content":"ORGANIZATION"},{"type":"New Jersey","content":"LOCATION"},{"type":"South Dakota","content":"LOCATION"},{"type":"Colorado","content":"LOCATION"},{"type":"Texas","content":"LOCATION"},{"type":"March 2021","content":"DATE"},{"type":"March 2020","content":"DATE"},{"type":"Andrew Hartnett","content":"PERSON"},{"type":"$10.2 million","content":"MONEY"},{"type":"Alabama","content":"LOCATION"},{"type":"California","content":"LOCATION"},{"type":"North American Securities Administrators Association","content":"ORGANIZATION"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}