{"summary":"Bulk preorders for the most powerful bitcoin miners from major manufactures are sold out until May 2021\nInstitutions outside China have been a notable buying force but some say this doesn’t necessarily equal to overseas hash rate growth\nMany Chinese retail bitcoin miner operators have turned to ethereum mining as bitcoin’s threshold is getting higher-than-ever.","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/84781\/bulk-preorders-bitcoin-miners-spring-2021","publishDate":"2020-11-17T13:22:32","id":3743,"type":null,"title":"Bulk preorders for the latest bitcoin ASIC miners are sold out until next spring","category":["Mining"],"content":["Bulk preorders for the most powerful bitcoin mining hardware from major manufacturers are already queued up until May next year, suggesting an increasing level of institutionalized demand for such equipment.","Bitmain's official website shows that preorders for its flagship AntMiner S19 Pro, S19 and T19 products will have to wait until May 2021 for delivery, which means the preorders with shipments before that have already been sold out at the bitcoin hardware giant.","Similarly, MicroBT — the top rival of Bitmain — is showing ”sold out\" for its flagship WhatsMiner M30 series on its website. A company spokesperson told The Block that the firm is already selling April to May future preorders and the capacity for months before that is essentially out of stock.","The overall supply shortage follows bitcoin's price jump since Q3 this year, and is due to both an increase in institutionalized demand for bitcoin mining equipment and the limited wafer capacity from Bitmain's and MicroBT's silicon providers.","“We are still working hard to try to get more chip capacity from Samsung to satisfy more preorders for future stocks,\" the MicroBT spokesperson said in a WeChat message. Bitmain, on the other hand, sources silicon chips from Taiwan Semiconductor Manufacturing Company (TSMC).","That said, orders for spot stocks in limited small quantity are still available at the manufacturers' distributors, albeit with a steep price premium.","Based on various quotes posted by mining equipment distributors on WeChat seen by The Block, orders for spot stocks of Bitmain's AntMiner S19 Pro are priced between $3,800 and $4,100 per unit.&nbsp;","For context, the quotes for the same model's spot stocks in just early November were around $3,300 per unit while the price for S19 Pro's future orders with an April shipment is at $2,684.&nbsp;","While a bitcoin miner supply shortage is fairly common following a bitcoin price surge – the same situation <a href=\"https:\/\/www.coindesk.com\/demand-for-new-bitcoin-miners-is-again-outstripping-supply\" data-v-f87c67ca=\"\">was also seen<\/a> in June 2019 and the 2017 bull market cycle – what appears to be different this year is that buying forces are even more consolidated, with heightened demand coming from institutions outside of China.","\"We have many customers looking to purchase more than 1,000 machines at a time,\" said Mike Colyer, CEO of Foundry, the subsidiary of Digital Currency Group that procures bitcoin mining equipment and offers financing services for North America operators.","Colyer said while there has been a lot of construction of mining farms in North America in recent years, the chip supply from fab semiconductors are not allocating the same capacity to miner makers as they did in the past.","\"The demand from Chinese miner operators for procuring ASICs has significantly dwindled in 2020. Basically miner manufacturers' production capacity since Q3 have been sold out to overseas buyers,\" said Kevin Dejun Ge, a Chinese bitcoin miner operator since 2017, who's also a managing partner at a mining fund called Miners.Fund.","\"MicroBT and Bitmain's capacities have been basically bought out by large-scale miner operators and funds, who either mine for themselves or resell at future dates if there's a significant price premium,\" Ge explained.","Based on his observation, the usual single order from these institutionalized forces could go up from $15 million with around 5,000 units as a start. But Ge said growth in overseas purchasing power does not necessarily translate to an increase in bitcoin hashing power outside of China proportionally.&nbsp;","\"The purchasing order only reflects a contract between party A and B. The eventual flow of the miners depend on the markets conditions,\" he said.","Many of the preorders are for future stocks and large institutions can enjoy a significant discount ahead of time. Hence, if bitcoin's price goes up significantly by the time of shipment, it would also be in the overseas institutions' interest to sell the machines back to Chinese investors in order to lock in a price premium.&nbsp;","Meanwhile, the higher threshold for entering or expanding bitcoin mining operations could be daunting for existing players, especially retail operators in China. Equipment shortages aside, bitcoin mining's block rewards <a href=\"https:\/\/www.theblockcrypto.com\/post\/61762\/the-bitcoin-halving-what-it-is-and-why-it-matters\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">were cut in half<\/a> earlier this year while the mining difficulty is trending at an all-time-high level.&nbsp;","That appears to have partially contributed to the growth of Ethereum's hash rate since Q3 as many bitcoin miner operators in China have moved into ETH mining, which right now has a payback period of around three months. A static payback period for new bitcoin mining entrants is around two years, at current prices.","Chinese crypto lender Babel Finance, for instance, said in July that it would allocate $50 million for crypto miner operators that want to borrow money, with their equipment pledged as collateral.&nbsp;","Flex Yang, CEO and co-founder of Babel, told The Block that the firm has $22 million in outstanding loans made to miner operators and 90% of the total collateral is in the form of either Graphic Unit Processors (GPUs) or Ethereum ASIC hardware.","\"A lot of the borrowers that have expanded to Ethereum are also existing bitcoin mining operators,\" Yang said.&nbsp;"],"hashtag":[]}