{"summary":"The proposal incorporates a revenue-sharing agreement between BitDAO and Lido DAO, creating more collaboration between them.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236188\/proposal-urges-mantle-to-allocate-72-million-to-lido-finance","publishDate":"2023-06-23T09:23:38","id":3744,"type":null,"title":"Proposal urges Mantle to allocate $72 million to Lido Finance","category":["CRYPTO ECOSYSTEMS"],"content":["Seraphim Czecker, a DeFi expansionist at Lido Finance, put forth a <a href=\"https:\/\/forum.mantle.xyz\/t\/discussion-mantle-x-lido-strategic-collaboration\/7151\" data-v-f87c67ca=\"\">proposal<\/a> asking Mantle, a notable Layer 2 project, to allocate 40,000 ether, ($72 million) to Lido’s liquid staking platform.","Mantle, which recently <a href=\"https:\/\/www.theblock.co\/post\/231557\/ethereum-layer-2-mantle-network-merges-with-backer-bitdao?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">merged<\/a> with BitDAO, a decentralized autonomous organization (DAO), maintains one of the largest community treasuries in the crypto ecosystem. This includes $500 million worth of ether (ETH) and $300 million in stablecoins, per <a href=\"https:\/\/deepdao.io\/organization\/30d12da9-5fd5-411a-8ca8-1422a4ce1373\/organization_data\/finance\" data-v-f87c67ca=\"\">data<\/a> from DeepDAO. Alongside these operations, the project’s core team is concurrently working on the development of an Ethereum Layer 2 network.","Should this proposal receive approval via a governance vote from the Mantle community, it would lead to a substantial allocation in Lido’s staking platform. Furthermore, it would create a strategic partnership between Lido and Mantle.","The proposed allocation of 40,000 ETH from Mantle’s treasury is intended to stimulate liquidity for the stETH ecosystem on Mantle’s Layer 2, it said. Additionally, the proposition aims to attract DeFi integrations, including Uniswap, Curve and other decentralized exchanges to the network.","Czecker, who formerly oversaw risk department at the lending protocol Euler, stated in the proposal, “While the final decision rests with the BitDAO community, I advocate for the relocation of DAO-owned stETH\/ETH liquidity into prominent DEXes on Mantle.”","The proposal goes beyond a considerable investment, incorporating a revenue-sharing agreement between BitDAO and Lido DAO. If ratified, this agreement would ensure that a portion of the revenue accrued by the Lido DAO treasury is redistributed to BitDAO over a period of 12 months.","Lido Finance, a frontrunner in decentralized liquid staking protocols, allows users to earn staking rewards from Ethereum and maintain access to their capital via a derivative token of ether known as staked ether (stETH).","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lido Finance","content":"ORGANIZATION"},{"type":"$500 million","content":"MONEY"},{"type":"$72 million","content":"MONEY"},{"type":"Mantle","content":"PERSON"},{"type":"Lido","content":"LOCATION"},{"type":"Lido DAO","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$300 million","content":"MONEY"},{"type":"Euler","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}