{"summary":"PancakeSwap proposed vote-escrowed CAKE (veCAKE) to enhance governance influence, boost pool liquidity and reward CAKE stakers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/263974\/pancakeswap-proposes-launching-vecake-system","publishDate":"2023-11-21T09:51:36","id":3747,"type":null,"title":"PancakeSwap proposes veCAKE launch to boost governance influence and liquidity","category":["GOVERNANCE"],"content":["<span data-v-f87c67ca=\"\">Multi-chain decentralized exchange PancakeSwap has proposed introducing vote-escrowed <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248465\/pancakeswap-cake-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/pancakeswap-cake-logo_28129.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">CAKE<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -2.96%\n    <\/span><\/a> <!----><\/span> (veCAKE) and voting gauges over the next few days, with over <\/span><a href=\"https:\/\/pancakeswap.finance\/voting\/proposal\/0x9602c8f56d01f239b88ecf914ee263cc9cdd75b8d10ae4d9536fc27b2680849c\" data-v-f87c67ca=\"\">98% of votes<\/a> currently in favor of the launch.","The move is “designed to empower CAKE holders with increased governance influence, boost liquidity across our pools and supercharge rewards for CAKE stakers,” according to the <a href=\"https:\/\/pancakeswap.finance\/voting\/proposal\/0x9602c8f56d01f239b88ecf914ee263cc9cdd75b8d10ae4d9536fc27b2680849c\" data-v-f87c67ca=\"\">proposal<\/a>.","As part of PancakeSwap’s Q4 roadmap, voting gauges enable veCAKE holders to vote on the distribution of CAKE farm emissions. This means that CAKE holders, stakers and protocols can start accumulating veCAKE and leverage their holdings to influence reward distributions in different liquidity pools on the decentralized exchange.","Specifically, holders could decide how CAKE emissions are allocated within each pool, with their voting power dependent on their veCAKE balance. Holders could also delegate their voting rights to external protocols and potentially earn additional rewards.","The vote-escrowed (ve) model was pioneered by Curve Finance and later adopted by many DEXs. It allows users to lock their tokens for a set period during which they can't be traded. In return, they receive \"ve\" tokens, granting them more substantial voting rights in governance decisions and often higher protocol rewards. It aims to promote long-term engagement and align user interests with a protocol's success, moving away from short-term speculation and toward sustained participation and decision-making.","The rollout of voting gauges will occur in phases, according to the proposal, initially covering liquidity pools on BNB Chain, Ethereum and Arbitrum, with approximately 0.99 CAKE per block in rewards. Later stages will see expansions to other chains.","The “Kitchen” team that manages the PancakeSwap platform proposes retaining a 40% voting share in the initial rollout, something it says is necessary to “ensure a smooth transition for liquidity providers from farms managed by the Kitchen to farms which are managed by veCAKE voting, without affecting their APRs significantly” and that “core liquidity pools continue to receive sufficient incentives, so that liquidity depth and fee generation are not significantly affected.”","The Kitchen's voting strategy would focus on sustaining competitive returns for major liquidity pools, ensuring existing partner arrangements are met and providing some allocation to smaller farms in a gradual shift to a new veCAKE gauge voting system, it said.","“If the gauge voting results will not affect any core liquidity pools and trading volumes significantly, the Kitchen will abstain from voting in that particular voting epoch or vote in alignment with existing votes,” the Kitchen team added. “Over time, the Kitchen aims to reduce the portion of CAKE emissions directly managed by the Kitchen as all veCAKE participants become familiar with the process.”","Voting on the proposal is set to end at 5:30 a.m. ET tomorrow. If approved, the proposal will be enacted and veCAKE launched shortly after the vote concludes.","PancakeSwap currently offers DEX trading on BNB Chain, Ethereum, Polygon, zkSync Era, <a href=\"https:\/\/www.theblock.co\/post\/244153\/pancakeswap-expands-to-ethereum-layer-2-arbitrum-one\" data-v-f87c67ca=\"\">Arbitrum<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/247197\/pancakeswap-ethereum-linea-consensys\" data-v-f87c67ca=\"\">Linea<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/248260\/pancakeswap-base\" data-v-f87c67ca=\"\">Base<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/178602\/pancakeswap-eyes-aptos-following-ethereum-integration\" data-v-f87c67ca=\"\">Aptos<\/a> and opBNB, according to its website.","This latest proposal follows PancakeSwap’s move to <a href=\"https:\/\/www.theblock.co\/post\/242187\/pancakeswap-trading-fee-revenue-share-cake-token-stakers\" data-v-f87c67ca=\"\">share trading-fee revenue<\/a> with CAKE token stakers in July. PancakeSwap also launched its own <a href=\"https:\/\/www.theblock.co\/post\/263010\/pancakeswap-launches-gaming-marketplace\" data-v-f87c67ca=\"\">gaming marketplace<\/a> last week.","<strong data-v-f87c67ca=\"\">Update on Nov. 22:<\/strong> Voting has now concluded and the proposal passed with over 99% support, seeing veCAKE and voting gauges officially <a href=\"https:\/\/blog.pancakeswap.finance\/articles\/introducing-gauges-voting-and-ve-cake-your-ownership-of-cake-emissions\" data-v-f87c67ca=\"\">introduced<\/a> to the platform.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Polygon","content":"LOCATION"},{"type":"Linea","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"5:30 a.m.","content":"TIME"},{"type":"98%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"99%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"Aptos","content":"LOCATION"},{"type":"-2.96%","content":"PERCENT"},{"type":"Curve Finance","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Arbitrum","content":"LOCATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Kitchen","content":"ORGANIZATION"},{"type":"Nov. 22","content":"DATE"},{"type":"Kitchen","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["DEXS","GOVERNANCE VOTES"],"authors":["James Hunt","The Block"]}