{"summary":"The Block’s Frank Chaparro gives his opinion on last week’s spot bitcoin ETF approvals.\nThis first appeared in Chaparro’s biweekly The Scoop Newsletter on Jan. 12. Sign up now.","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/272434\/launch-spot-bitcoin-etf-beginning","publishDate":"2024-01-13T08:01:57","id":3747,"type":null,"title":"The launch of the spot bitcoin ETF is just the beginning","category":["Companies"],"content":["Okay the bitcoin spot ETF is here. Now what?","The debut of the new funds was met with much fanfare and liquidity, with day two of trading seeing $3.1 billion in trading volumes, as <a href=\"https:\/\/www.theblock.co\/post\/272460\/day-two-of-spot-bitcoin-etf-trading-tops-3-1-billion-as-grayscale-and-blackrock-lead\" data-v-f87c67ca=\"\">noted<\/a> by my colleague RT Watson.&nbsp;","Among issuers of new spot bitcoin funds, BlackRock led the way with $564 million traded on Friday, while Fidelity saw $431 million of volume. That's according to data from Yahoo Finance compiled by The Block.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/structured-products\/bitcoin-spot-etf-volumes\/embed\" title=\"Spot Bitcoin ETF Volumes\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Liquidity during these early days is likely to be welcomed by issuers and market participants, adding further fuel to this significant milestone in the maturation of the asset class and gaining acceptance among Wall Street giants.","<span data-v-f87c67ca=\"\">Advocates for this financial instrument have anticipated that it could replicate the impact of the first gold spot ETF on the precious metal, opening <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.43%\n    <\/span><\/a> <!----><\/span><\/span> to a broader investor base and causing its price to surge.<\/span>","However, it's crucial to recognize that this change will unfold gradually. While the ETF represents a pivotal step, it's advised not to overly fixate on flows and volumes in these initial stages, given the deliberate – some might say painstakingly slow — pace of Wall Street.","The saying \"if you build it, they will come\" holds true, but it will require time.","Consider the fact that various market participants, notably Vanguard, currently prohibit their clients from purchasing spot Bitcoin ETFs on their platforms. Vanguard, being the world's largest retirement plan provider, exemplifies the cautious approach adopted by major players in the industry. Meanwhile, firms like UBS and Citi only plan to allow \"some\" customers to trade bitcoin ETFs, according to reporting out of <a href=\"https:\/\/www.coindesk.com\/business\/2024\/01\/11\/ubs-will-let-some-customers-trade-bitcoin-etfs-contrary-to-rumors-source\/\" data-v-f87c67ca=\"\">CoinDesk<\/a>.","Even clients of JPMorgan Chase and Fidelity, including myself, encounter a risk disclosure pop-up when placing an order. On the financial adviser front, barriers still exist. I've received messages from numerous individuals stating that their advisors are either unwilling to provide exposure to bitcoin ETFs or are entirely opposed to adding such exposure. This shouldn't be too surprising, given that such a product wasn't even on their radar, according to data compiled by issuer Bitwise. In fact, less than half of advisors anticipated an ETF in 2024. Even when they are ready to offer exposure, they are going to have to put in the work of reworking their portfolio methodologies, secure approvals from management, etc. These are months-long processes, not weeks long.&nbsp;","Let's celebrate the approval for the meaning, but realize that much of the hard work has only just begun.&nbsp;"],"hashtag":["BITCOIN","SPOT BITCOIN ETF"]}