{"summary":"Staking provider Figment has raised $110 million at a $1.4 billion valuation.\nDue to surging prices, Figment is currently seeing around $10 million a month in revenue.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/128058\/thoma-bravo-leads-110-million-funding-for-figment-at-1-4-billion-valuation","publishDate":"2021-12-20T08:00:25","id":3748,"type":null,"title":"Figment raises $110 million in middle of crypto staking boom","category":["Venture Capital"],"content":["Staking provider Figment has raised $110 million in a Series C funding round, with a $1.4 billion post-money valuation. This comes at a time when crypto staking firms <a href=\"https:\/\/www.theblockcrypto.com\/news+\/126250\/crypto-staking-businesses-are-making-an-absolute-fortune\" data-v-f87c67ca=\"\">are raking in the cash<\/a>, due to the boom in prices for staking-based coins.","The funding round was led by private equity firm Thoma Bravo, which manages more than $91 billion in assets and has started building a growth investing business aimed at crypto and fintech.","Other participants include Morgan Stanley’s Counterpoint Global, ParaFi Capital, Avon Ventures and crypto exchanges Binance, Bitstamp, and Binance.US.","The funding will help the company add support for staking across more proof-of-stake blockchains and hire more developers.","The proliferation of proof-of-stake blockchains, in combination with a big surge in prices this year, has resulted in a gold rush for crypto staking companies.&nbsp;","Figment itself is seeing $10 million in revenue per month, with a projected revenue of around $100 million this year. It runs validators on more than 50 blockchains and looks after $7.5 billion in assets — taking a cut from all staking revenue that gets generated.","\"The majority of our staking revenue comes from our institutional clients, with some earning from retail delegators as well since a lot of our validators are public. We do stake tokens that are on our balance sheet, but it is nowhere near the majority of our revenue,\" said Clayton Menzel, head of protocols and opportunities at Figment.","At the same time, costs are low. Menzel said the main costs are staffing, equipment and insurance premiums. \"It can be fairly profitable in terms of revenue in comparison to base cost. On some networks, you’ll see upwards of tens of millions of dollars a year if you’re doing well,\" he said.","Figment previously <a href=\"https:\/\/www.theblockcrypto.com\/post\/114696\/crypto-staking-firm-figment-raises-50-million-in-series-b-funding\" data-v-f87c67ca=\"\">raised $50 million<\/a> in a Series B funding round in August. That round was co-led by Senator Investment Group and Liberty City Ventures.","The staking provider has also launched an investment arm, Figment Capital, which will focus on investing in the crypto industry.&nbsp;"],"hashtag":["STAKING"]}