{"summary":"Binance announced a compensation plan for traders that bought the AEUR stablecoin&#x27;s unexpected price surge.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266254\/binance-compensation-aeur-stablecoin","publishDate":"2023-12-06T06:40:33","id":375,"type":null,"title":"Binance to compensate traders who bought a rally in AEUR stablecoin","category":["EXCHANGES"],"content":["Binance will compensate traders who may have mistakenly bought into the unusual price rally of the AEUR stablecoin, designed to mirror the euro’s value.","The newly launched AEUR stablecoin, issued by Swiss-based Anchored Coins, saw a 200% increase in price shortly after being listed on the spot market on Tuesday. The AEUR-USDT trading pair peaked at $3.25 on Tuesday, significantly higher than its expected value of around $1.07.","This deviation from the stablecoin’s intended value was attributed to a misunderstanding by some Binance traders, whom the exchange said seemed unaware of AEUR’s nature as a stablecoin. “As AEUR has been well-received by the community, including users who might not have realized its standing as a stablecoin, there was strong demand for AEUR, which resulted in its price deviation,” a Binance spokesperson told The Block.","Notably, the AEUR stablecoin had limited liquidity due to its supply of five million on the platform, as indicated on its <a href=\"https:\/\/www.binance.com\/en\/price\/anchored-coins-aeur\" data-v-f87c67ca=\"\">dedicated page<\/a>. Binance also offered a <a href=\"https:\/\/www.binance.com\/en\/support\/announcement\/binance-will-list-anchored-coins-eur-aeur-and-introduce-aeur-zero-trading-fee-promotions-e1f106b5767546faa4c16751d8410a89?ref=AZTKZ9XS&amp;utm_source=BinanceTwitter&amp;utm_medium=GlobalSocial&amp;utm_campaign=GlobalSocial\" data-v-f87c67ca=\"\">zero-fee promotion<\/a> to users for trading the stablecoin soon after its launch. AEUR recorded a volume of $34 million.","After observing the abnormal price of the stablecoin, Binance decided to <a href=\"https:\/\/www.binance.com\/en\/support\/announcement\/aeur-spot-trading-temporarily-suspended-fbde402883544a1d942e95505a84b122\" data-v-f87c67ca=\"\">suspend<\/a> spot trading for a range of AEUR trading pairs. This suspension affected AEUR\/USDT, BTC\/AEUR, ETH\/AEUR, and EUR\/AEUR pairs.","Today, the exchange has created a compensation plan for those who purchased the stablecoin above its intended value. Traders who bought AEUR between 12:41 p.m. EST and 1:31 p.m. EST on Tuesday and did not sell them on Binance will be eligible for compensation. This process is set to begin within the next three days.&nbsp;","The exchange didn't reveal the total amount given as compensation to traders.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$34 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"EUR\/AEUR","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"200%","content":"PERCENT"},{"type":"AEUR\/USDT","content":"ORGANIZATION"},{"type":"12:41 p.m. EST and 1:31 p.m. EST","content":"TIME"},{"type":"Tuesday","content":"DATE"},{"type":"$3.25","content":"MONEY"},{"type":"AEUR","content":"ORGANIZATION"},{"type":"$1.07","content":"MONEY"}],"hashtag":["BINANCE"],"authors":["Vishal Chawla","The Block"]}