{"summary":"Validators on The Open Network (TON) are considering the suspension of 195 inactive addresses on the proof-of-stake blockchain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/204554\/ton-validators-set-to-vote-on-suspending-2-5-billion-in-toncoin","publishDate":"2023-01-23T11:00:22","id":3750,"type":null,"title":"TON validators set to vote on suspending wallets holding $2.5 billion in toncoin","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Validators for The Open Network (TON) are considering the suspension of 195 inactive addresses on the proof-of-stake blockchain, with a vote scheduled to begin on Feb. 21. In total, these addresses currently <\/span><a href=\"https:\/\/tontech.io\/stats\/early-miners\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">hold<\/span><\/a><span data-v-f87c67ca=\"\"> just over 1 billion toncoin or 21.3% of the total supply, worth around <\/span><a href=\"https:\/\/www.coingecko.com\/en\/coins\/toncoin\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$2.5 billion<\/span><\/a><span data-v-f87c67ca=\"\"> at today’s valuation.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">At least 75% of validators must participate in several voting rounds for the vote to pass. If approved, the proposed suspension will last for four years, with the affected addresses not able to make any transactions for the duration of the freeze period. The “suspended list” would be visible on the public blockchain.<\/span>","<span data-v-f87c67ca=\"\">Wallet addresses are considered inactive if they took part in the token’s initial distribution phase between July 2020 and June 2022 but have never made an outgoing transaction. In December, the TON community asked the affected wallet owners to demonstrate their continued activity by making a transaction on TON. The remaining inactive wallets can avoid the potential suspension by making a transaction at any time before voting ends. It’s important to note that addresses not part of the initial distribution will not be affected.<\/span>","<span data-v-f87c67ca=\"\">The distribution of toncoin made 98.55% of its total supply available for an “initial proof-of-work” mechanism. In contrast to centralized distribution strategies often decided upon by crypto project development teams, TON’s mining strategy was designed to decentralize the distribution process while remaining a proof-of-stake blockchain.<\/span>","<span data-v-f87c67ca=\"\">The move was a “testament to the importance of transparency to the TON community,” the TON Foundation, a non-commercial group of supporters and contributors behind the blockchain, said in a statement. “Through the potential suspension of these wallets, there is a hope that clarity about the volume of toncoin currently circulating will be provided and that the active community participating in the open-source project will continue to grow and thrive,” it added.<\/span>","<span data-v-f87c67ca=\"\">The Open Network was originally designed in 2018 by the founders of Telegram Messenger and later handed over to the TON community to continue its development.<\/span>","<span data-v-f87c67ca=\"\">Earlier this month, TON <\/span><a href=\"https:\/\/www.theblock.co\/post\/199494\/telegram-linked-ton-blockchain-launches-decentralized-file-sharing-solution\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">launched<\/span><\/a><span data-v-f87c67ca=\"\"> a decentralized file-sharing and data storage solution called TON Storage, taking on similar projects like Filecoin and Storj.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 2022","content":"DATE"},{"type":"Feb. 21","content":"DATE"},{"type":"TON Foundation","content":"ORGANIZATION"},{"type":"1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"75%","content":"PERCENT"},{"type":"Storj","content":"ORGANIZATION"},{"type":"98.55%","content":"PERCENT"},{"type":"December","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"July 2020","content":"DATE"},{"type":"$2.5 billion","content":"MONEY"},{"type":"21.3%","content":"PERCENT"}],"hashtag":["GOVERNANCE VOTES"],"authors":["James Hunt","The Block"]}