{"summary":"Coinbase CEO Brian Armstrong said the crypto exchange&#x27;s revenue this year will likely be cut in half or more from last year&#x27;s sales number, blaming the state of the industry and shaken investor confidence in the wake of the recent collapse of rival FTX.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193021\/coinbases-armstrong-expects-revenue-to-fall-50-or-more-he-tells-bloomberg","publishDate":"2022-12-07T13:55:49","id":3753,"type":null,"title":"Coinbase&#x27;s Armstrong expects revenue to fall 50% or more, he tells Bloomberg","category":["EXCHANGES"],"content":["Coinbase CEO Brian Armstrong said the crypto exchange's revenue this year will likely be cut in half or more from 2021's sales number, blaming the state of the industry and shaken investor confidence in the wake of the recent collapse of rival FTX in an <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-12-07\/coinbase-crypto-ceo-brian-armstrong-sees-revenue-falling-by-half-in-2022\" data-v-f87c67ca=\"\">interview<\/a> with Bloomberg News.&nbsp;","Armstrong noted that Coinbase posted $7 billion of revenue in 2021, but said \"with everything coming down, it's looking, you know, about roughly half that or less,\" in a conversation with Bloomberg's <em data-v-f87c67ca=\"\">David Rubenstein Show<\/em>. The loss is in line with analysts' expectations.","Coinbase shares, which have already plunged more than 80% this year, were down 1% on the news.&nbsp;","Analysts were already expecting the lower top-line number from the exchange. Prior to their most recent earnings report, analysts surveyed by Factset were expecting Coinbase to post annual revenue of $3.3 billion.","Coinbase already forecast a possible loss of no more than $500 million based on adjusted EBITDA. That compares to about $4 billion of positive EBITDA last year.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"80%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"$4 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"David Rubenstein Show","content":"PERSON"},{"type":"$3.3 billion","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"$7 billion","content":"MONEY"},{"type":"$500 million","content":"MONEY"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"1%","content":"PERCENT"},{"type":"Bloomberg News","content":"ORGANIZATION"},{"type":"Factset","content":"ORGANIZATION"}],"hashtag":["COINBASE"],"authors":["Larry DiTore","The Block"]}