{"summary":"Crypto accounting, tax, and compliance platform Bitwave has raised $15m in a Series A funding round led by Hack VC and Blockchain Capital.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/192648\/bitwave-raises-15-million-for-crypto-focused-tax-and-accounting-platform","publishDate":"2022-12-06T14:30:10","id":3754,"type":null,"title":"Bitwave raises $15 million for crypto-focused tax and accounting platform","category":["VENTURE CAPITAL"],"content":["Crypto accounting, tax and compliance platform Bitwave raised $15m in a Series A funding round led by Hack VC and Blockchain Capital.","Other venture capital firms including SignalFire, Valor Equity Partners, Arca, Pulsar Trading and Alumni Ventures Blockchain Fund participated in the round, Bitwave said in a statement.","The funding will be used to launch a product called Bitwave Institutional, which aims to help institutions that custody, trade and use digital assets to improve processes around taxes, accounting, auditing and reporting. This new product builds directly on top of its current platform but provides more advanced features such as segregated balance sheet tracking and proof of liability and reserve publishing.","\"This funding round provides further evidence of the strength of our technology and speaks to how Bitwave has become a critical piece of infrastructure for businesses that adopt digital assets,\" said Bitwave's COO and co-founder Amy Kalnoki.","Opensea, Compound and Polygon are among the crypto companies and protocols that use Bitwave, the company said.&nbsp;&nbsp;","Features such as proof of reserves have gained <a href=\"https:\/\/www.theblock.co\/post\/192062\/kucoin-engages-auditor-mazars-to-provide-factual-findings-report\" data-v-f87c67ca=\"\">more attention<\/a> as the fallout of crypto exchange FTX highlighted <a href=\"https:\/\/www.theblock.co\/post\/192527\/regulatory-guardrails-crypto-confidence-coinbase\" data-v-f87c67ca=\"\">the need<\/a> for more transparency.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Arca","content":"LOCATION"},{"type":"Amy Kalnoki","content":"PERSON"},{"type":"$15m","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Blockchain Capital","content":"ORGANIZATION"},{"type":"Valor Equity Partners","content":"ORGANIZATION"},{"type":"Pulsar Trading","content":"ORGANIZATION"},{"type":"Bitwave","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}