{"summary":"Roman Storm, the cofounder of Tornado Cash who was charged with several crimes related to his role in writing code for the service, has filed a motion to dismiss the charges against him. \nThe motion outlines several possible legal justifications for dropping the charges, including a First Amendment defense.  ","author":["Zack Abrams","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285786\/arrested-tornado-cash-dev-roman-storm-motions-to-drop-fatally-flawed-charges","publishDate":"2024-03-30T16:27:29","id":3754,"type":null,"title":"Arrested Tornado Cash dev Roman Storm motions to drop &#x27;fatally flawed&#x27; charges","category":["Policy"],"content":["How could Roman Storm conspire with criminals if he relinquished control of Tornado Cash before the criminal conduct occurred? How could Tornado Cash be considered a money-transmitting business if it never charged a fee? And isn't writing code protected speech under the First Amendment anyway?","These are a few of the issues raised by lawyers on behalf of Roman Storm, the developer and co-founder of Tornado Cash, in a motion to dismiss the charges against him. Storm is one of two Tornado Cash cofounders who were <a href=\"https:\/\/www.justice.gov\/usao-sdny\/pr\/tornado-cash-founders-charged-money-laundering-and-sanctions-violations\" data-v-f87c67ca=\"\">indicted<\/a> by federal prosecutors in the Southern District of New York last August, alongside Roman Semenov, who remains at large. Alexey Pertsev, another developer, is currently on trial in the Netherlands.&nbsp;","Storm faces one count of conspiracy to commit money laundering and one count of conspiracy to violate the International Economic Emergency Powers Act, which each carry a maximum sentence of 20 years in prison, alongside a charge of conspiracy to operate an unlicensed money transmitting business, which carries a maximum sentence of five years in prison.","However, Storm's lawyers have argued in a <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.nysd.604938\/gov.uscourts.nysd.604938.30.0.pdf\" data-v-f87c67ca=\"\">new filing<\/a> that the charges in the \"fatally flawed\" indictment should be dismissed on several grounds, including a First Amendment defense that writing code can be considered free speech.&nbsp;","\"At its heart, this prosecution represents an unprecedented attempt to criminalize the development of software, which Mr. Storm and his colleagues had a First Amendment right to write,\" the motion reads in part. \"There are no allegations that Mr. Storm conspired with any bad actors who later chose to use the software for their own illicit purposes (nor could there be); thus, as a matter of law, he cannot be held responsible for their conduct.\"","The motion also took issue with specific arguments in the original indictment. For example, the motion contests the definition of Tornado Cash as a \"money transmitting business\" as users never relinquished control over their coins or paid a fee to Tornado Cash (some fees were paid to third-party relayers). The motion also questions how a conspiracy could have arisen given that the cofounders relinquished controls over Tornado's smart contracts in 2020, months before the alleged criminal conduct occurred, and no contact between Storm and any bad actors was ever identified or alleged in the indictment.&nbsp;","The case of Tornado Cash's arrested developers has become a cause célèbre in the decentralized finance community; to date, nearly <a href=\"https:\/\/juicebox.money\/v2\/p\/618?tabid=cycle_payouts\" data-v-f87c67ca=\"\">$1.5 million<\/a> has been raised for a legal defense fund.&nbsp;"],"hashtag":["CRIME","LAWSUITS"]}