{"summary":"The upcoming Bitcoin halving event could put miners to the test with lower rewards and higher costs, according to JPMorgan.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239581\/jpmorgan-bitcoin-halving-stress-test-miners","publishDate":"2023-07-14T04:20:40","id":3756,"type":null,"title":"JPMorgan says upcoming Bitcoin halving could be a stress test for miners","category":["MARKETS"],"content":["The upcoming Bitcoin halving event will form a crucial test for miners as they navigate reduced rewards and increased production costs, according to JPMorgan.","\"Miners with lower electricity costs would find it easier to cope after the halving event, while miners with higher electricity costs could struggle post halving event,\" JPMorgan strategists led by Nikolaos Panigirtzoglou wrote in a report on Thursday. Put simply, the halving event will determine miners' ability to adapt and remain profitable in a changing environment.","<a href=\"https:\/\/www.theblock.co\/post\/61762\/the-bitcoin-halving-what-it-is-and-why-it-matters\" data-v-f87c67ca=\"\">The Bitcoin halving<\/a> is an event that occurs approximately every four years, reducing the reward for mining new Bitcoin blocks by half, effectively decreasing the rate at which new bitcoins are created, in order to control inflation and maintain the scarcity of bitcoin over time. The upcoming Bitcoin halving will see the block reward halve from 6.25 bitcoin to 3.125 bitcoin.","While Bitcoin's halving is generally seen as having a positive impact on <a href=\"https:\/\/www.theblock.co\/post\/232334\/bitcoin-price-45k-jpmorgan-gold\" data-v-f87c67ca=\"\">the price of Bitcoin<\/a>, it poses challenges for Bitcoin miners, because the cost of&nbsp;production has historically acted as a floor price,&nbsp;according to JPMorgan analysts. \"According to our current bitcoin production cost model, one cent per kWh [kilowatt-hour] change in the electricity cost induce a $4,300 change in the bitcoin production cost. Post halving this sensitivity would double to $8,600 thus increasing the vulnerability of higher cost producers,\" the analysts said.","Competition among Bitcoin miners is also intensifying ahead of the halving event as the <a href=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoins-hash-rate-daily\" data-v-f87c67ca=\"\">Bitcoin hash rate<\/a>, or the total computational power to mine the cryptocurrency, is increasing, according to the analysts. Post the halving event, however, the Bitcoin hash rate may not continue to rise at the same pace without any sustained rise in the Bitcoin price above its production cost or a large increase in transaction fees that could offset the reduction in issuance rewards, the analysts said.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoins-hash-rate-daily\/embed\" title=\"Bitcoin's Hash Rate (EH\/s, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","\"And at the moment the decline in the hype around <a href=\"https:\/\/www.theblock.co\/post\/207086\/what-are-bitcoin-nfts-ordinals-and-how-do-they-work\" data-v-f87c67ca=\"\">ordinals<\/a> poses an additional challenge for bitcoin miners' revenues,\" the analysts concluded.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nikolaos Panigirtzoglou","content":"ORGANIZATION"},{"type":"$8,600","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$4,300","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["BITCOIN","TRADFI BANKS"],"authors":["Yogita Khatri","The Block"]}