{"summary":"Unocoin, one of India’s oldest cryptocurrency exchanges, has raised $3.5 million in Series A.\nUnocoin CEO Sathvik Vishwanath told The Block that the round is still ongoing, and the exchange is looking to raise an additional $1.5 million in the coming months.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/80158\/indian-crypto-exchange-unocoin-funding-draper-associates","publishDate":"2020-10-07T23:30:58","id":3757,"type":null,"title":"Indian crypto exchange Unocoin raises $3.5 million Series A led by Draper Associates","category":["Asia"],"content":["Unocoin, one of India’s oldest cryptocurrency exchanges, has raised $3.5 million in Series A, CEO Sathvik Vishwanath told The Block in an interview.","The round was led by Tim Draper’s Draper Associates, with participation from XBTO Ventures, 2020 Ventures, and others. Vishwanath said the round is still ongoing, and Unocoin is looking to raise an additional $1.5 million in the coming months.","The fresh capital has brought Unocoin’s valuation to $20 million, said Vishwanath. He added that it would be utilized for customer acquisition and growing Unocoin’s team.","But as Unocoin is already a revenue-generating company, the funding can be seen as more of a “kind of some insurance,” Vishwanath told The Block. “As we have money in the bank, it’ll help us grow faster with confidence when there is more demand,” said Vishwanath.","Founded in 2013, Unocoin currently has 1.3 million customers, and all of these are Indians, said Vishwanath. Out of these, about 250,000 are active customers, he said. As for Unocoin’s team size, Vishwanath said it is expected to grow to about 50 from the current 30 by mid next year, mainly by hiring customer service executives.","Unocoin clocks trading volumes of about $400,000 to $545,000 per day, said Vishwanath, adding that sometimes it goes up to $680,000 million a day. He noted that volumes have grown three times since March of this year after the Supreme Court of India <a href=\"https:\/\/www.theblockcrypto.com\/post\/57708\/indias-supreme-court-strikes-down-rbis-banking-ban-against-crypto\" data-v-f87c67ca=\"\">lifted<\/a> the crypto banking ban enacted by the Reserve Bank of India in April 2018.","The lifting of the ban has led to Indian crypto exchanges getting more venture support. Unocoin rival CoinDCX <a href=\"https:\/\/www.theblockcrypto.com\/post\/66369\/coinbase-ventures-polychain-capital-invest-2-5-million-in-indian-crypto-exchange-coindcx\" data-v-f87c67ca=\"\">raised<\/a> $5.5 million in two funding rounds, with backing from Coinbase Ventures, Polychain Capital, and others. WazirX was <a href=\"https:\/\/www.theblockcrypto.com\/post\/47852\/binance-acquires-indian-crypto-exchange-wazirx-to-serve-over-1-billion-people-of-the-country\" data-v-f87c67ca=\"\">acquired by<\/a> Binance late last year.&nbsp;","As for Unocoin’s competitive advantage, Vishwanath said exchanges like CoinDCX and WazirX are more like “pure exchanges.” In contrast, Unocoin also runs a brokerage service, which helps first-time customers to get started with crypto.","“In these cases, we become the counterparty. Customers just have to specify how much they want to buy and sell for. They don’t have to go through the bid-based and ask- based buy and sell orders,” said Vishwanath, adding that Unocoin also runs an exchange which is more suitable for experienced users.","Looking ahead, Unocoin plans to also provide decentralized, collateral-backed lending services, said Vishwanath. “Say, for example, you collateralize bitcoin and get Indian rupees in return. And then you pay back rupees with interest, and then get your bitcoin back,” he said.","Today’s Series A brings Unocoin’s total funding to date to $6.5 million. The exchange has previously raised $3 million from investors like Digital Currency Group and Adam Draper’s Boost VC."],"hashtag":[]}