{"summary":"A bug on the CoinMarketCap website makes it look like every cryptocurrency&#x27;s price has rocketed to unbelievable levels.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/127535\/coinmarketcap-bug-shows-bitcoins-price-at-an-absurd-789-billion","publishDate":"2021-12-14T17:21:09","id":3760,"type":null,"title":"CoinMarketCap bug shows Bitcoin&#x27;s price at an absurd $789 billion","category":["BITCOIN"],"content":["Crypto data aggregator CoinMarketCap turned heads on Tuesday evening with a website bug resulting in eye-popping figures for prices, market capitalizations and more.","The bug was live for about one hour and has now been fixed.","In a tweet at 5 p.m. ET, the site's operators acknowledged the pricing issues, saying that \"[t]he Engineering team is aware of incorrect price information appearing on [CoinMarketCap]. We are currently investigating and will update this status when we have more information.\"","<span data-v-f87c67ca=\"\">A bug on the CoinMarketCap website showed nearly every coin at skyhigh prices. Image: CoinMarketCap.<\/span>","According to the website, Bitcoin's market cap appears to be $14.7 quintillion. It also shows Cocos-BCX in first place on the list, despite a low market cap (even under normal circumstances).","\"How did it feel to be a trillionaire for a couple hours?\" the site, which is owned by crypto exchange Binance, said in a follow-up<a href=\"https:\/\/twitter.com\/CoinMarketCap\/status\/1470877760260345859\" data-v-f87c67ca=\"\"> tweet<\/a>.","As expected, the bug triggered a wave of social media attention. Some posts on Twitter indicated that TrustWallet, which offers a crypto wallet app, experienced issues in light of the CoinMarketCap bug. Bloomberg reported that Coinbase was affected too.","Some decentralized finance (DeFi) protocols also use CoinMarketCap as a <a href=\"https:\/\/medium.com\/dia-insights\/introducing-the-coinmarketcap-oracle-93ca1c3a909\" data-v-f87c67ca=\"\">source of price data<\/a>. DeFi protocol DeFiChain <a href=\"https:\/\/twitter.com\/defichain\/status\/1470872528386207750\" data-v-f87c67ca=\"\">tweeted<\/a>, \"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Due to an error with the<\/span><span class=\"r-18u37iz\" data-v-f87c67ca=\"\"> @CoinMarketCap<\/span><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\"> API, all DeFiChain Vaults have automatically been halted for now, ensuring the safety of your loans.<\/span>\" This implies that perhaps loans could have been liquidated based on the incorrect price data.","The bug likely also affected trading bots using the CoinMarketCap API, which would have responsed to the seemingly higher prices.","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Kind of interesting that this rally started exactly at the same time as Coinmarketcap having a pricing bug (roughly 4:25-4:35pm ET). Wonder how many bots are using their API and just started aggro buying on \"market movement,\" <a href=\"https:\/\/twitter.com\/adamscochran\/status\/1470877093458321417\" data-v-f87c67ca=\"\">tweeted<\/a> Adam Cochran, partner at Cinneamhain Ventures. \"Wow and look at that the first 4 ticks after the bug is fixed are all red and below the trend.\"<\/span>","<em data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on <a href=\"https:\/\/twitter.com\/TheBlock__\" data-v-f87c67ca=\"\">Twitter<\/a>.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Adam Cochran","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$14.7 quintillion","content":"MONEY"},{"type":"Cocos","content":"PERSON"},{"type":"Coinbase","content":"PERSON"},{"type":"5 p.m. ET","content":"TIME"},{"type":"Cinneamhain Ventures","content":"ORGANIZATION"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"CoinMarketCap API","content":"ORGANIZATION"}],"hashtag":["BITCOIN"],"authors":["Tim Copeland","Michael McSweeney","The Block"]}