{"summary":"Gas fees on the Ethereum blockchain have dropped nearly 90% over the past month.\nHere are some factors behind the fall.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/108471\/ethereum-eth-gas-fees-six-month-low-why","publishDate":"2021-06-15T13:41:34","id":3761,"type":null,"title":"Ethereum gas fees have plunged to a six-month low. Here&#x27;s why","category":["Ethereum"],"content":["Gas fees or transaction costs on the Ethereum blockchain have dropped significantly over the past month.","<a href=\"https:\/\/www.theblockcrypto.com\/data\/on-chain-metrics\/ethereum\" data-v-f87c67ca=\"\">According to The Block's Data Dashboard<\/a>, the average transaction fee on Ethereum is now around $4.5 from nearly $45 a month ago — a whopping 90% decline.","The average transaction fees are now at a six-month low, per the Data Dashboard. (The data is a 7-day moving average (7MDA), meaning it is the average of the last seven days and indicates a short-term trend).","<br data-v-f87c67ca=\"\">\n<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/average-transaction-fee-on-ethereum\/embed\" title=\"Average Transaction Fee on Ethereum (7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","So why have the gas fees declined from a record high just a month ago? There are several factors at play.","First, there has been a notable drop in Ethereum transactions in recent weeks. Both decentralized finance (DeFi) and non-fungible token (NFT) transactions have declined with the recent market crash.","Daily transactions on Ethereum, for instance, have fallen to about 1.2 million versus 1.65 million a month ago. NFT transactions and volumes have also declined, per <a href=\"https:\/\/www.theblockcrypto.com\/data\/nft-non-fungible-tokens\/nft-overview\" data-v-f87c67ca=\"\">The Block's Data Dashboard.<\/a>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/transactions-on-the-ethereum-network-daily\/embed\" title=\"Transactions on the Ethereum Network (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Another factor behind the lower gas fees is the growing usage of Layer 2 scaling solution Polygon (formerly Matic Network). The number of transactions on the Polygon network has increased by a notable amount in recent weeks.","From about 1.5 million, daily transactions on Polygon are now nearly 7.5 million, according to the <a href=\"https:\/\/polygonscan.com\/chart\/tx\" data-v-f87c67ca=\"\">tracker PolygonScan<\/a>. That is over five times more than the number of daily Ethereum transactions.","","","Polygon is a proof-of-stake (PoS) blockchain versus Ethereum, which is currently a proof-of-work (PoW) blockchain, although it is set to shift to a PoS model in the future. The PoW model's transaction processing capacity is limited, thus the higher fees in general. There are other pros and cons of both models.","One thing, however, is certain: the demand for scaling solutions is rising. Polygon remains one such popular solution. As The Block Research reported recently, <a href=\"https:\/\/www.theblockresearch.com\/mapping-out-polygons-ecosystem-105540\" data-v-f87c67ca=\"\">there are more than 350 DeFi projects in Polygon's ecosystem<\/a> alone.","Lastly, the increasing usage of flashbot transactions is another factor that has contributed to lower gas fees. Flashbots let traders communicate with Ethereum miners off-chain, like in a private channel, to execute transactions. This reduces the number of spam transactions on-chain and thus lowers gas fees. In other words, fewer bots try to bid the highest gas price for transaction priority.","","","Ethereum gas fees are expected to remain low as more scaling solutions go live, such as <a href=\"https:\/\/www.theblockcrypto.com\/post\/99511\/ethereum-scaling-solution-optimism-delays-mainnet-launch-estimates-july\" data-v-f87c67ca=\"\">Optimistic Rollups<\/a>, in the near future."],"hashtag":["ETHEREUM","POLYGON"]}