{"summary":"A Hangzhou city district court has started the trial of a criminal case against well-known crypto OTC trader Zhao Dong and several others.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/104550\/chinese-court-begins-trial-of-prominent-crypto-otc-trader-zhao-dong","publishDate":"2021-05-12T03:50:00","id":3762,"type":null,"title":"Chinese court begins trial of prominent crypto OTC trader Zhao Dong","category":["CHINA"],"content":["The Xihu District Court in the Chinese city of Hangzhou has started the trial of a criminal case against well-known crypto over-the-counter (OTC) trader Zhao Dong and several others.","According to the <a href=\"http:\/\/tingshen.court.gov.cn\/live\/19496221\" data-v-f87c67ca=\"\">live stream page<\/a> of the trial on Wednesday, Zhao was charged with a crime called \"assisting internet criminal activities.\"","Under China's codified laws, the crime is defined as providing someone with information technology, such as internet access, network storage, telecommunication, advertisement promotion and payment settlements, when they know that person is committing an internet-based crime. If convicted, the penalty is up to three years in jail depending on the severity as well as a monetary fine.","The nature of an \"assisting internet criminal activities\" crime is not the same as \"concealing and hiding criminal proceeds.\" In China, <a href=\"https:\/\/www.theblockcrypto.com\/daily\/98619\/china-court-rulings-tether-money-laundering-tool\" data-v-f87c67ca=\"\">more than 100 people<\/a> have been convicted for the latter, which involves directly laundering proceeds for criminals using crypto assets. Per China’s codified laws, the conviction of a crime for “concealing and hiding criminal proceeds” could see up to seven years behind bars.","But the case is part of a systematic crackdown by Chinese law enforcement on crimes such as telecommunication fraud, Ponzi schemes and cross-border gambling as well as any entity that may have facilitated the money laundering process for such criminals.","Zhao's case has drawn widespread attention given his prominent status as one of the most well-known figures in the Chinese crypto community since early 2010. For several years, Zhao was running one of the largest OTC desks in China. He is also known for his association with crypto exchange Bitfinex as a minor shareholder and for founding RenrenBit, a crypto lending startup.&nbsp;","The trial comes nearly a year after Zhao was taken into police custody and formally arrested amid a <a href=\"https:\/\/www.coindesk.com\/china-police-said-to-detain-crypto-otc-traders-amid-money-laundering-crackdown\" data-v-f87c67ca=\"\">wider probe by the Chinese police<\/a> into the involvement of some OTC desks in allegedly knowingly helping criminals launder illegal proceeds.&nbsp;","Although China's Court Trial Online website has a page to live stream the Wednesday hearing, the actual recording hasn't been uploaded as of press time. But a news team under the crypto exchange OKGroup appeared to be present in the court house on Wednesday and said in a <a href=\"https:\/\/m.weibo.cn\/detail\/4635985491263797#comment\" data-v-f87c67ca=\"\">news alert on Weibo<\/a> that the case against Zhao is tied to a 50 billion yuan ($7 billion) money laundering platform.","Per the Wednesday hearing, Zhao's case is due to him and his OTC team allegedly being a transactional counterparty for a money laundering scheme in Hangzhou called \"Day Day Up.\"&nbsp;","Day Day Up is one of many such schemes in China that's called a Paofen platform, which, in literal translation, means Point Scoring.","It works like this: a team behind a Paofei platform sets up an app. Users can join the app but will need to provide their AliPay, WeChat Pay and bank accounts. They can earn commissions by letting the platform use their accounts to send and receive fiat transactions and can also make additional rewards by inviting more people to the platform.","The purpose of such a scheme is to use lots of payment accounts to reshuffle transactions and launder money for criminal activities. Thus anyone who joins the app is potentially liable for providing assistance to an internet-based crime.","According to Xinhua's <a href=\"http:\/\/www.xinhuanet.com\/2021-02\/23\/c_1127126734.htm\" data-v-f87c67ca=\"\">report<\/a> in February, the team behind the Day Day Up scheme started the operation in 2019 and laundered more than $7 billion for its upstream activities like online gambling within five months through payment accounts provided by over 70,000 registered users.&nbsp;","In the second half of 2019, the team started using tether (USDT) to \"upgrade\" the reshuffling process in an attempt stay under the law enforcement's radar. But the report didn't specify who was the crypto counterparty or how many of the proceeds were laundered through USDT.&nbsp;","Overall, the report said the Day Day Up platform provided the \"Paofei\" service for 1,900 cases of online gambling and telecommunication fraud. In the process, 30 billion yuan ($4.6 billion) of proceeds were sent overseas. The Hangzhou police arrested 85 people in May 2020, including the team behind the Day Day Up platform and their crypto trading counterparties.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"China's Court Trial Online","content":"ORGANIZATION"},{"type":"50 billion yuan","content":"MONEY"},{"type":"USDT","content":"ORGANIZATION"},{"type":"May 2020","content":"DATE"},{"type":"2010","content":"DATE"},{"type":"second half of 2019","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Zhao","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"$7 billion","content":"MONEY"},{"type":"Xihu District Court","content":"ORGANIZATION"},{"type":"30 billion yuan","content":"MONEY"},{"type":"Hangzhou","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"$4.6 billion","content":"MONEY"},{"type":"Xinhua","content":"ORGANIZATION"},{"type":"Zhao Dong","content":"PERSON"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Wolfie Zhao","The Block"]}