{"summary":"Immutable, Polygon Labs and King River Capital aim to raise $100 million for a new gaming fund.\nThe fund has already completed its first close at $30 million, Immutable’s Brendan Ma told The Block.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283525\/immutable-polygon-king-river-100-million-web3-gaming-fund","publishDate":"2024-03-19T18:00:05","id":3764,"type":null,"title":"Immutable, Polygon and King River team up to raise $100 million for web3 gaming fund","category":["Deals"],"content":["<span data-v-f87c67ca=\"\">Immutable, <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Polygon <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248360\/polygon-matic-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/matic-token-icon.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">MATIC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.29%\n    <\/span><\/a> <!----><\/span><\/span> Labs and King River Capital have teamed up to raise $100 million for a new web3 gaming fund.<\/span>","The fund, dubbed Inevitable Games Fund (IGF), is \"ecosystem-agnostic\" and will invest in early-stage, high-growth web3 gaming startups, the three firms said Tuesday. Venture capital firm King River will lead the fund's investment process, while blockchain developers Immutable and Polygon Labs will provide deal sourcing and web3 gaming expertise.","Brendan Ma, head of investments at Immutable, told The Block that the fund has already completed its first close at $30 million from its targeted size of $100 million. He noted that discussions about forming the fund began in mid-last year.","The fund has secured an anchor commitment from Alpha Wave Ventures (backed by Alpha Wave Global and the Abu Dhabi Royal Group's Chimera Capital), along with other commitments from Merit Circle, Mike Arrington, Polygon Labs' Sandeep Nailwal and Immutable's co-founders and brothers, James and Robbie Ferguson.","When asked why the fund is being launched now, Ma said this year is significant for web3 gaming. \"Studios are now two to three years post-funding, meaning we are expected to see the culmination of years of curated development processes finally come to fruition and reach players,\" he said.","\"The expectation is that this will be a milestone year for web3 gaming, and we want to make sure the industry continues to move forward. The IGF exists to fund the next wave of projects that will follow this one, and advance the industry forward not just in the near-term, but the long-term as well,\" he added.","The fund has already warehoused seven early-stage investments, including Pixelmon, Metalcore, Guild of Guardians and My Pet Hooligan.","The three firms are no strangers to each other. Immutable's zkEVM mainnet, a gaming-focused blockchain, is <a href=\"https:\/\/www.theblock.co\/post\/274827\/immutable-zkevm-mainnet-polygon\" data-v-f87c67ca=\"\">powered by<\/a> Polygon, while King River is an investor in Immutable. In 2022, Immutable <a href=\"https:\/\/www.theblock.co\/linked\/152698\/immutable-launches-500-million-development-fund-for-web3-game-adoption\" data-v-f87c67ca=\"\">launched<\/a> its own $500 million developer and venture fund to support gaming and NFT startups building on its Layer 2 <a href=\"https:\/\/www.theblock.co\/post\/136548\/immutable-raises-200-million-nft-crypto\" data-v-f87c67ca=\"\">Immutable X<\/a> platform. Meanwhile, Polygon Labs has launched several funds and joint initiatives over the past few years to support startups across gaming and other sectors.","\"Just as mobile gaming went from virtually zero in 2008 to 79% of gamers playing mobile today, we believe a similar shift has only just begun to web3 technology,\" Zeb Rice, co-founder and managing partner at King River Capital, said in a statement. Rice added that the fund is \"designed to benefit from this multi-hundred billion dollar shift in spending to this disruptive new technology.\"","The fund's launch comes amid a booming crypto market and a recent resurgence in funding. Last week, Arbitrum Foundation also <a href=\"https:\/\/www.theblock.co\/post\/282651\/arbitrum-eyes-400-million-crypto-gaming-fund-with-proposal-to-dao\" data-v-f87c67ca=\"\">announced<\/a> a program designed to invest 200 million ARB tokens (about $400 million) in promoting gaming projects on its blockchain over a two-year period."],"hashtag":["NEW VC FUNDS","POLYGON","ZKEVM"]}