{"summary":"Ethereum developers released a &quot;devnet&quot; to test validator staking withdrawals, a feature currently missing on the network.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189496\/ethereum-client-teams-test-staking-withdrawals-on-devnet","publishDate":"2022-11-23T10:44:32","id":3765,"type":null,"title":"Ethereum client teams test staking withdrawals on devnet","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Ethereum developers have released a&nbsp;developer network to test validator staking withdrawals, a feature currently missing on the network.<\/span>","<span data-v-f87c67ca=\"\">Ethereum developer Marius Van Der Wijden said the devnet will help prepare Ethereum to open up validator staking withdrawals next year with a planned upgrade called Shanghai. The lack of the feature has raised some fears about centralization risks after Ethereum migrated to proof-of-stake consensus.<\/span>","<span data-v-f87c67ca=\"\">“It's the first devnet that enabled withdrawals on all of these implementations and is a big step forward,\" Van Der Wijden told The Block. \"It also helps other clients to test their implementations by joining the network.”<\/span>","<span data-v-f87c67ca=\"\">Ethereum clients, teams that build validator software, are testing staking withdrawals to prepare for Shanghai and find any potential bugs, Van Der Wijden said. He clarified that the ongoing devnet only focuses on withdrawals and separate Shanghai features have yet to be tested.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A necessary condition for Ethereum’s migration to proof-of-stake consensus, also called <a href=\"https:\/\/www.theblock.co\/post\/166708\/the-merge-everything-you-need-to-know-about-ethereums-big-upgrade\" data-v-f87c67ca=\"\">The Merge<\/a>, was that users had to stake or pool assets on the network.&nbsp;<\/span><span data-v-f87c67ca=\"\">They could stake themselves or delegate ether to firms offering staking services, the latter being the more convenient choice.<\/span>","<span data-v-f87c67ca=\"\">Once users staked enough ether, however, an issue came to light — users couldn’t withdraw from staking providers, as that mechanism remains to be implemented.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Ethereum Staking Depositors | Source: Dune Analytics <\/span>","<span data-v-f87c67ca=\"\">After The Merge, <a href=\"https:\/\/www.theblock.co\/post\/169508\/ethereum-is-grappling-with-the-risk-of-censorship-after-the-merge\" data-v-f87c67ca=\"\">staking entities<\/a> such as Coinbase, Kraken, Binance, Staked.us, Bitcoin Suisse, stakefish and Figment have come to control a significant portion of ether deposited in validator nodes and make decisions on behalf of stakers. <\/span><span data-v-f87c67ca=\"\">Since a large majority of network stake and validators are currently overseen by few entities, experts within the Ethereum community have previously expressed concerns that the network was now prone to centralization risks.<\/span>","<span data-v-f87c67ca=\"\">Some of these concerns can be alleviated when ether withdrawals are reopened, as that would allow users to remove their stake from validators they don’t agree with.&nbsp;<\/span><span data-v-f87c67ca=\"\">A total of six client teams are participating in the devnet including Lodestar, Teku, Lighthouse, Nethermind and Geth, Van Der Wijden said.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bitcoin Suisse","content":"PERSON"},{"type":"Binance","content":"LOCATION"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Teku","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Van Der Wijden","content":"ORGANIZATION"},{"type":"Der Wijden","content":"PERSON"},{"type":"Shanghai","content":"LOCATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Marius Van Der Wijden","content":"PERSON"},{"type":"Lighthouse","content":"ORGANIZATION"}],"hashtag":["ETHEREUM"],"authors":["Vishal Chawla","The Block"]}