{"summary":"Offchain Labs, the parent company of the Ethereum scaling solution Arbitrum, has acquired Prysmatic Labs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176548\/offchain-labs-acquires-ethereum-software-team-prysmatic-labs","publishDate":"2022-10-12T09:00:30","id":3767,"type":null,"title":"Offchain Labs acquires Ethereum software team Prysmatic Labs","category":["MERGERS & ACQUISITIONS"],"content":["Offchain Labs, the parent company of the Ethereum scaling solution Arbitrum, has acquired Prysmatic Labs.","Offchain Labs made the acquisition to further develop the Ethereum ecosystem. Prysmatic Labs developed and still operates the computer software Prysm, which over 43% of Ethereum nodes use to run the Ethereum network on proof-of-stake.&nbsp;&nbsp;","Prysmatic Labs will still focus on its Prysm computer software client under Offchain Labs, while the parent company will continue to build its Ethereum scaling solutions Arbitrum and Arbitrum Nova.&nbsp;&nbsp;","“Prysmatic Labs possesses an incredibly talented team of engineers, and their dedication to the Ethereum community shows via their best-in-class product that is used broadly in the Ethereum ecosystem,” Offchain Labs CEO Steven Goldfeder said.&nbsp;","Both companies remain focused and aligned on building infrastructure to scale the Ethereum network. It was one of the reasons Prysmastic Labs co-founder Raul Jordan stated that this acquisition “made perfect sense.\"","Both companies are “fully incentive-aligned with the success of Ethereum,” Jordan further stated. He believes that bringing both teams together under one roof will benefit the aligned mission of both teams in scaling Ethereum.&nbsp;&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Arbitrum Nova","content":"ORGANIZATION"},{"type":"Jordan","content":"PERSON"},{"type":"Prysmatic Labs","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"43%","content":"PERCENT"},{"type":"Steven Goldfeder","content":"PERSON"},{"type":"Offchain Labs","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"Raul Jordan","content":"PERSON"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}