{"summary":"Indian crypto exchange CoinSwitch Kuber has raised $15 million in Series A.\nThe round was led by Ribbit Capital and Paradigm, with participation from Sequoia Capital India and others.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/90983\/coinswitch-kuber-15-million-series-a-ribbit-capital-paradigm","publishDate":"2021-01-12T19:30:26","id":3767,"type":null,"title":"Ribbit Capital, Paradigm lead $15 million Series A for Indian crypto exchange CoinSwitch Kuber","category":["Exchanges"],"content":["Indian crypto exchange CoinSwitch Kuber has raised $15 million in Series A funding led by Ribbit Capital and Paradigm.","Announcing the news on Tuesday, CoinSwitch said this is the first crypto-related investment of Ribbit Capital in India and Paradigm's first in the country in general.","The Series A also saw participation from CoinSwitch's existing investor Sequoia Capital India and angel investor Kunal Shah, the founder of Indian credit card management startup CRED.","CoinSwitch said the funding would go towards expanding its product, security, compliance, and tech capabilities, without disclosing any specific details. CoinSwitch co-founder and CEO Ashish Singhal wasn't available for comments.","CoinSwitch was founded in 2017 as a global aggregator of crypto exchanges. Last June, it launched India-specific crypto trading platform CoinSwitch Kuber. Within seven months of the launch, the exchange operator claims to have over one million users. It expects to have 10 million users \"in the next one year.\"","Ribbit Capital's general partner Nick Shalek said CoinSwitch \"can become a generational technology brand in India.\" The venture capital firm's current crypto <a href=\"https:\/\/ribbitcap.com\/our-bets\/\" data-v-f87c67ca=\"\">portfolio includes<\/a> companies like Coinbase, Chainalysis, and Diem (formerly Libra).","Paradigm's Matt Huang and Arjun Balaji said, \"India could be one of the largest global crypto markets,\" and that CoinSwitch's team has \"potential to build a market leader in the years to come.\"","Funding activity in India's crypto space has picked up in recent months. Last month, crypto exchange CoinDCX <a href=\"https:\/\/www.theblockcrypto.com\/post\/88842\/indian-crypto-exchange-coindcx-raises-13-9-million-series-b\" data-v-f87c67ca=\"\">raised<\/a> $13.9 million in Series B. Crypto exchange Unocoin also recently <a href=\"https:\/\/www.theblockcrypto.com\/post\/80158\/indian-crypto-exchange-unocoin-funding-draper-associates\" data-v-f87c67ca=\"\">raised<\/a> $3.5 million in Series A.","Crypto in India is currently a grey area. The country's government hasn't released any legislation or guidance on the legal status of cryptocurrencies. Recently, there were reports that the government is looking to ban crypto trading. Legal and regulatory experts <a href=\"https:\/\/www.theblockcrypto.com\/daily\/68133\/india-crypto-ban-revived-report\" data-v-f87c67ca=\"\">have previously told The Block<\/a> that if ban discussions take place, the process would be long and time-consuming.","Crypto exchange operators, however, have appeared less concerned. They said at the time that they are confident the government would consult with relevant stakeholders prior to reaching a decision."],"hashtag":["PARADIGM","SERIES A"]}