{"summary":"Nexus Mutual founder Hugh Karp’s personal wallet address has just experienced an attack that resulted in a loss of more than $8 million.\nKarp told The Block that the attacker tricked him into approving one transaction, somehow gained access to his computer, and altered his MetaMask extension.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/87632\/nexus-mutual-founder-attack-funds-8-million-lost","publishDate":"2020-12-14T07:10:21","id":3769,"type":null,"title":"Nexus Mutual founder&#x27;s personal wallet address gets attacked, funds worth more than $8 million get drained","category":["DeFi"],"content":["Hugh Karp, the founder of DeFi insurance protocol Nexus Mutual, has just experienced an attack that resulted in a loss of more than $8 million.","Nexus Mutual <a href=\"https:\/\/twitter.com\/nexusmutual\/status\/1338441873560571906?s=21\" data-v-f87c67ca=\"\">announced<\/a> the news via a Twitter post on Monday, saying that Karp's personal wallet address was attacked and drained by a member of the protocol.","The <a href=\"https:\/\/etherscan.io\/tx\/0x4ddcc21c6de13b3cf472c8d4cdafd80593e0fc286c67ea144a76dbeddb7f3629\" data-v-f87c67ca=\"\">address<\/a> contained 370,000 NXM (Nexus Mutual) tokens, currently worth about $8.25 million.&nbsp;","Karp told The Block that the attacker tricked him into approving <a href=\"https:\/\/etherscan.io\/tx\/0x4ddcc21c6de13b3cf472c8d4cdafd80593e0fc286c67ea144a76dbeddb7f3629\" data-v-f87c67ca=\"\">one transaction<\/a>, somehow gained access to his computer, and altered his MetaMask extension.","\"Then when I was performing an unrelated transaction, MetaMask popped up with a spoof transaction, and I subsequently approved it, thinking it was the transaction I was intending to conduct. Instead, it was transferring NXM to their wallet,\" said Karp.","Nexus Mutual is unaffected and nobody else is impacted, he said. \"My private keys are still secure. The attacker didn't get access to them. They tricked me into signing a spoof transaction,\" said Karp.&nbsp;","He characterized the attack as a \"very nice trick\" and \"definitely next level stuff.\"&nbsp;","Nexus Mutual <a href=\"https:\/\/twitter.com\/nexusmutual\/status\/1338441873560571906?s=21\" data-v-f87c67ca=\"\">said<\/a> the attacker completed their know-your-customer (KYC) processes 11 days ago and then switched membership to a new address on December 3. The protocol developer added that an investigation is ongoing to identify the attacker and how they operated.","Karp asked the attacker <a href=\"https:\/\/twitter.com\/HughKarp\/status\/1338452087374553091\" data-v-f87c67ca=\"\">to return funds<\/a> to drop all investigations and get $300,000 in the bounty.&nbsp;","Some of the stolen funds are already on the move, said Nexus Mutual, adding that some are already being exchanged using decentralized exchange aggregator 1inch.Exchange.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<em data-v-f87c67ca=\"\">This is a developing story and will be updated as more details are known.<\/em>"],"hashtag":[]}