{"summary":"Crypto proponents are raising the alarm over broad tax reporting requirements in Congress’s new bipartisan infrastructure spending bill.\nZenledger is poised to reap the rewards, but despite the clear growth going into next tax season, it also wants better fitting requirements.\nThe firm just raised a $6 million Series A to help it build ahead of next tax season.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/113351\/crypto-tax-firm-zenledger-raises-6-million-amid-senate-infrastructure-bill-battle","publishDate":"2021-08-03T10:13:39","id":3770,"type":null,"title":"Crypto tax firm Zenledger raises $6 million amid Senate infrastructure bill battle","category":["Tax"],"content":["\"They're looking to collect $30 billion in crypto taxes — it's not the worst time to be a crypto tax provider.\"","That's Dan Hannum, COO for crypto tax accounting software company Zenledger, who says he has qualms with the U.S. Senate's bipartisan infrastructure bill despite the fact that it stands to accelerate the growth of his firm.","As the two-thousand-plus-page piece of legislation slowly moves through Congress, Zenledger is announcing a fresh injection of capital: $6 million in a Series A funding round led by Bloccelerate VC. Mark Cuban’s Radical Ventures, G1 VC, Borderless Capital, 4RC, Centrality, BIGG Digital Assets and CoinGecko, among others, also participated.","Between its <a href=\"https:\/\/www.theblockcrypto.com\/linked\/105543\/irs-biden-crypto-transactions-report-10000-tax-gap\" data-v-f87c67ca=\"\">tax gap proposal<\/a>, possible expansion of <a href=\"https:\/\/www.theblockcrypto.com\/post\/106596\/the-us-treasury-wants-to-expand-crypto-reporting-to-fight-offshore-tax-evasion\" data-v-f87c67ca=\"\">reporting requirements<\/a> and plans to <a href=\"https:\/\/www.theblockcrypto.com\/post\/107590\/irs-seeks-millions-in-fresh-funding-to-expand-crypto-tax-enforcement-and-hire-outside-experts\" data-v-f87c67ca=\"\">expand funding<\/a> for the Internal Revenue Service (IRS), the Biden Administration has made it clear that it's taking crypto tax evasion seriously.","Meanwhile, senators are openly criticizing what some have called <a href=\"https:\/\/www.theblockcrypto.com\/linked\/113052\/crypto-lobby-infrastructure-bill-washington\" data-v-f87c67ca=\"\">\"unworkable\"<\/a> crypto reporting language in the draft bill. And while it remains unclear if the contentious provisions will stand as written, heightened reporting requirements could be a boon for the crypto tax game.","\"Do I think that there's multiple issues with this bill that don't quite make sense? Yes. There is room for improvement 100 percent,\" said Hannum. \"But it just continues to show that the U.S. government specifically and globally are taking crypto taxes really seriously. They're going to be investing tens, if not hundreds of millions of dollars into crypto tax enforcement and software.\"","Crypto proponents are concerned over language that would potentially group miners, decentralized finance startups and others under the \"broker\" reporting requirements despite their lack of brokerage services. If the provision sticks, that could mean a wealth of entities would have a lot more reporting to do to U.S. tax authorities.","As the debate in Washington continues, Zenledger is getting ready for whatever may come.","Hannum said the IRS's decision to move its crypto question to the top of the 1040 form translated to an estimated 5x in customer growth heading into tax season. Regardless of the infrastructure bill, the base of people looking to report their crypto will get bigger, with coming <a href=\"https:\/\/www.theblockcrypto.com\/daily\/80139\/irs-ig-tax-reporting-crypto-exhanges\" data-v-f87c67ca=\"\">IRS guidance<\/a> and the overall tack of the Biden administration with respect to the technology.","Zenledger sees the wide-reaching implications of the infrastructure bill as a net negative, though. Rushing broad tax reporting requirements could lead to confusing standards that hurt taxpayers when forced to utilize solutions that aren't best fit for crypto.","The industry already saw this in some exchanges' use of 1099Ks to report users' capital gains. This led to confusion between the industry and the IRS that left some taxpayers with <a href=\"https:\/\/www.theblockcrypto.com\/linked\/85510\/the-irs-is-mistakenly-sending-warning-notices-to-coinbase-users\" data-v-f87c67ca=\"\">confusing mandates<\/a> to pay additional thousands of dollars despite good faith reporting. It's unclear what the form of best fit might be for the bill's broad brokerage reporting mandates, especially for many types of transactions between different types of entities like miners and DEXs.&nbsp;","<b data-v-f87c67ca=\"\">\"<\/b>It's just like a kind of a nightmare [to report],\" said Hannum. \"So I think we're still going to have really bad reporting requirements, even if they're mandated to report.\"","For that reason, Zenledger has been in contact with lobby groups about the support it can provide in advocating for better crypto provisions.","\"If we stifle innovation in the U.S., then that's one of the largest markets in the world gets shut off or brought down,\" he told The Block. \"We want to see a world where we go from 1.5 trillion to 25 trillion to 100trillion to 250 trillion (market cap). We want to see this asset class grow and expand over time with crypto tax reporting.\"","Still, the new funding will allow Zenledger to push global, and the U.S. bill doesn't stand to cause headaches overseas.&nbsp;","\"This is going to be worse for U.S.-based companies, but that doesn't mean crypto innovation is going to die out,\" said Hannum."],"hashtag":["CONGRESS","SERIES A"]}