{"summary":"It intends to use the funds to reduce friction of crypto payments between applications and to build out reputation-based reward programs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/159736\/unstoppable-domains-clinches-unicorn-status-in-65-million-series-a-round","publishDate":"2022-07-27T07:00:54","id":3770,"type":null,"title":"Unstoppable Domains raises $65 million in Series A funding","category":["VENTURE CAPITAL"],"content":["<span data-v-f87c67ca=\"\">Unstoppable Domains, a firm building out digital identity markers as non-fungible tokens (NFTs), announced Wednesday that it raised $65 million in Series A funding.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Pantera Capital led the funding round, with additional investments from Mayfield, Gaingels, Alchemy Ventures, Redbeard Ventures, Spartan Group, OKG Investments, Polygon, CoinDCX, CoinGecko and others. Prior investors in Unstoppable Domains, also participated in this newest funding round, according to a release shared with The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Unstoppable Domains, which now has a $1 billion valuation, intends to use the funds to reduce friction of crypto payments between applications and build out infrastructure for a loyalty reward program within the crypto ecosystem based on a user’s reputation. This new funding round also gives Unstoppable Domains more than three years of runway to build out its product, it said.<\/span>","<span data-v-f87c67ca=\"\">“We are on a mission to create user owned and controlled identity for everybody on the planet, we actually think that NFT domains are going to be the technology that makes this happen,” Unstoppable Domains co-founder and CEO Matthew Gould told The Block in an interview.<\/span>","<span data-v-f87c67ca=\"\">Unstoppable Domains allows users to register domain names for a one-time fee. These domains can then act as a personal identifier for a user among different crypto applications, helping users maintain a consistent online reputation using web3 technology.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">To verify that a user is who they say they are, Gould explains that Unstoppable Domains asks users to provide hundreds, if not thousands, of pieces of additional information about themselves so that “your identity is emergent.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Digital worlds miss a personal reputation element experienced in every life, Gould said. He explains in a hypothetical example that if a person were to sell fake items on Amazon and get caught, they could then move to a different platform such as eBay and commit the same scam. “But if you have a consistent reputation across these places, you can't do that.”<\/span>","<span data-v-f87c67ca=\"\">“We think that having a consistent name across the internet will be a way for you to plant your flag in the digital world and say who you are, and then also help you build a consistent reputation across all the different applications that you interact with.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“​Our vision is for the three billion people who have a cell phone to also have an NFT domain in the future,” Gould said. “Regardless of the short term hiccups in the space, that's ultimately what we're trying to get to.”<\/span>","Pantera had set out its plan to raise a $200 million fund <a href=\"https:\/\/www.theblock.co\/post\/140793\/pantera-capital-sets-out-stall-to-raise-new-200-million-fund\" data-v-f87c67ca=\"\">earlier this year<\/a>, dubbed the Pantera Select Fund. At the time it said it had invested in an \"unnamed company which produces NFT domain names.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Spartan Group","content":"ORGANIZATION"},{"type":"Pantera Select Fund","content":"ORGANIZATION"},{"type":"$65 million","content":"MONEY"},{"type":"Polygon","content":"LOCATION"},{"type":"Amazon","content":"LOCATION"},{"type":"Redbeard Ventures","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Gould","content":"PERSON"},{"type":"Unstoppable Domains","content":"LOCATION"},{"type":"Matthew Gould","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Alchemy Ventures","content":"ORGANIZATION"},{"type":"Mayfield","content":"PERSON"},{"type":"$200 million","content":"MONEY"},{"type":"OKG Investments","content":"ORGANIZATION"}],"hashtag":["IDENTITY"],"authors":["MK Manoylov","The Block"]}