{"summary":"As decentralized applications (dapps) continue to evolve, the tools needed by developers and users to make effective use of them have become more sophisticated.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/185429\/accessing-web3-developments-and-opportunities-commissioned-by-w3bcloud","publishDate":"2022-11-16T10:25:54","id":3772,"type":null,"title":"Accessing Web3: Developments and Opportunities - Commissioned by W3bCloud","category":["RESEARCH"],"content":["<b data-stringify-type=\"bold\" data-v-f87c67ca=\"\">The Block Research was commissioned by W3bCloud to create “Accessing Web3: Developments and Opportunities”. To access the full report in PDF format, please fill out the form below:&nbsp;<\/b>","As decentralized applications (dapps) continue to evolve, the tools needed by developers and users to make effective use of them have become more sophisticated.","Trends such as decentralized finance (DeFi), non-fungible tokens (NFTs), decentralized autonomous organizations (DAOs), play-and-earn (P&amp;E) gaming, and the metaverse are bringing new infrastructure requirements to the dapp development space. There is a new awareness and demand to access, operate, and store both on-chain and off-chain data in a decentralized and trustless way.","These dapp trends collectively define what “web3” is today. Web3 is an idea born out of the dapps it is composed of. What makes dapps special is their use of blockchains, which allows anyone to participate without monetizing their data. Moreover, blockchains allow something that web2 lost as it became dominated by companies providing services in exchange for your personal data: <em data-v-f87c67ca=\"\">decentralization<\/em>.","However, while decentralization infrastructure to support next-generation dapps is developing at a rapid clip, there is still an overreliance on centralized infrastructure. At one level or another of the web3 stack, this presents centralization concerns that proponents of web3 eschew in favor of decentralized and permissionless systems born from peer-to-peer and cryptographic technologies. It is only through these latter technologies that web3 can be built, operated, and owned by its users – the hallmark of decentralization.","In light of the current situation, we see many opportunities for infrastructure providers in the near future. It is currently a technical and financial burden for developers and users to set up and run their own blockchain infrastructure. Developers would rather focus on building and shipping their products and users seek out the best user experiences.","To illustrate how infrastructure providers can build a global infrastructure cooperative for web3, we present the doors-applications-primitives-protocols (DAPP). The DAPP framework is broken down into four major layers – starting from top to bottom:","In this report, we dive into each layer and focus on prominent projects building at each layer to highlight how web3 operates today, where the limitations and opportunities are for infrastructure providers, and what the web3 of tomorrow may look like.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Block Research","content":"ORGANIZATION"}],"hashtag":[],"authors":["Hiroki Kotabe","The Block"]}