{"summary":"Bitcoin and other cryptocurrencies are trading at a discount in India.\nCrypto bill listing in Parliament has caused panic selling, CoinSwitch Kuber’s Sharan Nair told The Block.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/125333\/bitcoin-trades-at-discount-in-india-after-crypto-bill-listing","publishDate":"2021-11-24T02:25:24","id":3772,"type":null,"title":"Bitcoin trades at over 3% discount in India","category":["Bitcoin"],"content":["Bitcoin and other cryptocurrencies are trading at a discount in India after the country's government listed a crypto bill in Parliament for discussion yesterday.","At the time of writing, <a href=\"https:\/\/wazirx.com\/exchange\/BTC-INR\" data-v-f87c67ca=\"\">bitcoin at WazirX<\/a> is trading at around 40,90,000 Indian rupees (around $54,900) compared to $56,750 on Binance — a difference of over 3%, which is significant.","The discount was over 15% last night and earlier this morning on various Indian crypto exchanges, but it appears to be narrowing now.","","","Some users are panic-selling their crypto holdings after the Lok Sabha — the lower house of India's bicameral Parliament — <a href=\"https:\/\/www.theblockcrypto.com\/post\/125171\/indian-government-is-expected-to-introduce-a-crypto-bill-in-parliament\" data-v-f87c67ca=\"\">published a bulletin listing a crypto bill<\/a> for discussion,&nbsp;Sharan Nair, chief business officer at CoinSwitch Kuber told The Block.","The bill's description in the bulletin says it \"seeks to prohibit all private cryptocurrencies in India, however, it allows for certain exceptions to promote the underlying technology of cryptocurrency and its uses.\"","The definition of private cryptocurrencies and the bill's contents aren't known yet.","There are some new <a href=\"https:\/\/www.livemint.com\/market\/cryptocurrency\/govt-to-move-bill-to-ban-all-privatecryptocurrencies-11637693131165.html\" data-v-f87c67ca=\"\">reports that say<\/a> private cryptocurrencies are privacy coins such as monero, and not broader coins such as bitcoin and ether. But an industry source told The Block that private cryptocurrencies are all cryptocurrencies that are not issued by governments, i.e., all coins except central bank digital currencies. This source said they have clarified that from government sources.","Earlier today, CNN-News18 reported citing \"sources in the security establishment,\" that the government will not ban crypto after all.","\"A regulation mechanism will be in place so that crypto is not misused,\" the sources told the publication. \"The government is concerned about the underground transactions happening against cryptocurrency — particularly its role in 'hawala' and terror funding.\"","\"A strict mechanism will be in place so that law enforcement agencies can trace the origin of cryptocurrency used for illegal or anti-national work,\" the sources added.","This is not the first time cryptocurrencies in India are trading at a discount, said CoinSwitch Kuber's Nair. Prices dropped significantly in 2017, when late Arun Jaitley, then India's finance minister, said that the government does not recognize bitcoin as legal tender, said Nair."],"hashtag":["BITCOIN"]}