{"summary":"Dapper Labs has sold $1.2 million worth of digital NBA cards on its native blockchain Flow, The Block has learned. The cards were sold via Dapper Labs&#x27; beta app NBA Top Shot, which was launched in May.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/74011\/dapper-labs-digital-nba-top-shot-cards-blockchain-flow","publishDate":"2020-08-05T06:15:08","id":3773,"type":null,"title":"Dapper Labs has sold $1.2 million worth of digital NBA cards on its native blockchain Flow","category":["LAYER 1S"],"content":["Dapper Labs, the creator of CryptoKitties, launched a beta version of its NBA Top Shot app in May of this year. That app has already sold NBA (the National Basketball Association) cards totalling $1.2 million, The Block has learned.","Dapper Labs sent an email to the app’s users on Wednesday, a copy of which is seen by The Block, saying that NBA Top Shot has sold more than 22,000 packs, and has transferred more than 14,000 cards or “moments.” The beta app had more than 900 active users, per the email.","NBA Top Shot is <a href=\"https:\/\/medium.com\/@hellodapper\/nba-top-shot-designs-drop-and-they-speak-for-themselves-d9cd550bf713#:~:text=NBA%20Top%20Shot%20is%20built,to%20play%20blockchain%20games%20today\" data-v-f87c67ca=\"\">built on<\/a> Dapper Labs’ native blockchain called Flow. Notably, it is not built on Ethereum, which charges transaction or gas fees. “Flow ensures scalability to the size of the NBA fanbase and removes the friction that makes it difficult for an average fan to play blockchain games today,” Dapper Labs said at the time of NBA Top Shot launch in May.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIt is, however, worth noting that since Flow is a new Layer 1 blockchain, it won’t be nearly as distributed and won’t have the same decentralization guarantees as Ethereum.&nbsp;","Top Shots are essentially digital collectibles tied to the NBA league. \"They’re multimedia and data smashed together into a token. That includes heroic photography and a video as well through a partnership with SportRadar,\" Caty Tedman, the vice president of partnerships at Dapper Labs, <a href=\"https:\/\/techcrunch.com\/2020\/05\/27\/cryptokitties-developer-launches-nba-top-shot-a-new-blockchain-based-collectible-collab-with-the-nba\/\" data-v-f87c67ca=\"\">told<\/a> TechCrunch in May.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">'The Marketplace'&nbsp;<\/strong><\/span>","The NBA Top Shot app has also come out of beta today, with the public launch of the “Marketplace.”","“The Marketplace is live,” reads the email, meaning users can now trade their cards. However, the site is still <a href=\"https:\/\/www.nbatopshot.com\/\" data-v-f87c67ca=\"\">invite-only<\/a>.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","Secondly, if multiple users attempt to purchase a card, only one will get through, the others will get stuck at “processing your order,” per the email. Finally, there might be an issue with purchasing cards priced at around $10,000, the email reads.","Dapper Labs said it is working to improve the Marketplace and that some changes will roll out “over the next days and weeks.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$10,000","content":"MONEY"},{"type":"NBA","content":"ORGANIZATION"},{"type":"NBA Top Shot app","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Caty Tedman","content":"PERSON"},{"type":"May of this year","content":"DATE"},{"type":"National Basketball Association","content":"ORGANIZATION"},{"type":"Dapper Labs","content":"ORGANIZATION"},{"type":"$1.2 million","content":"MONEY"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}