{"summary":"Circle is going public via a SPAC deal.\nIncluded in Thursday’s public filing were financial details from some of Circle’s headline-driving business unit sales from the past two years. ","author":["Michael McSweeney","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/110901\/circles-spac-filing-details-losses-and-gains-from-sales-of-poloniex-otc-desk","publishDate":"2021-07-08T18:08:20","id":3774,"type":null,"title":"Circle&#x27;s SPAC filing details losses and gains from sales of Poloniex, OTC desk","category":["Startups"],"content":["On Thursday, crypto startup Circle went public with its <a href=\"https:\/\/www.theblockcrypto.com\/post\/106473\/after-440-million-fundraise-circle-is-said-to-be-considering-a-spac-deal\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">previously reported<\/a> plans to go public via <a href=\"https:\/\/www.theblockcrypto.com\/post\/110806\/confirmed-stablecoin-firm-circle-public-spac-merger\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">a special-purpose acquisition company<\/a>, or SPAC, valuing the company at more than $4 billion in the process.&nbsp;","The publicly filed disclosures required as part of the deal provided a new window into the heart of Circle's operations, including the financial specifics of some of its past headline-driving deals.","Among those big figures: a $156 million loss on the sale of crypto exchange Poloniex, which it acquired in early 2018 and sold in November 2019. The sale was characterized in the filing as \"a strategic effort to better align our business with the products we offer to our customers.\"&nbsp;","As part of that deal, Circle received $33.15 million in cash and \"contingent consideration\" worth $15 million. As noted in the doc:","Circle's filing also made note of two previously reported corporate sales, both of which netted modest gains for the firm.","These include Circle Trade, the firm's long-running trading desk, which it <a href=\"https:\/\/www.theblockcrypto.com\/post\/50900\/circle-otc-trading-desk-crypto-exchange-kraken\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">sold to crypto exchange Kraken<\/a> in December 2019. Per the filing, Circle was paid $1.9 million in cash. Also part of the deal: \"Pursuant to the agreement, the Company can receive up to 252,017 and 100,807 shares of the Buyer at a contractual price of $19.84 per share if certain earnout and retention conditions, respectively, are satisfied within one year of the closing date. Additionally, the Company is entitled to receive referral payments from the Buyer based on 0.1% of gross OTC volume from new clients for the first year.\"","Finally, the document included the financial details of Circle's sales of its retail-focused <a href=\"https:\/\/www.prnewswire.com\/news-releases\/voyager-to-acquire-circle-invest-retail-digital-asset-business-from-circle-internet-financial-301003521.html\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Circle Invest<\/a> unit to Voyager Digital. Per the doc, Circle was paid $100,000 in cash and approximately $525,000 worth of Voyager Digital Shares.&nbsp;","\"In connection with the transaction the Company agreed to continue to operate the Circle Invest platform on behalf of prospective Voyager customers while Voyager acquires the appropriate licenses in three US states: New York, Alaska and North Carolina,\" Circle's filings noted."],"hashtag":[]}