{"summary":"Upstart exchange One Trading recently launched its upgraded venue, promising it would be the fastest on the market. \nLarge exchanges like Kraken have also been busy upgrading their technology to cut down latency, while cloud services giant AWS are offering colocation services for crypto outfits. \nSome players, however, are more concerned with trying to maintain a level playing field than getting premium trading speeds. ","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267317\/a-need-for-speed-how-major-traders-and-venues-think-about-latency-in-todays-crypto-market","publishDate":"2023-12-26T08:59:02","id":3775,"type":null,"title":"A need for speed? How major traders and venues think about latency in today’s crypto market","category":["Companies"],"content":["<span data-v-f87c67ca=\"\">One Trading, the crypto exchange that emerged as a spin-off from Bitpanda earlier this year, <\/span><a href=\"https:\/\/www.theblock.co\/post\/266449\/thiel-one-trading-launch-crypto\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">recently unveiled its upgraded platform for crypto traders<\/span><\/a><span data-v-f87c67ca=\"\">. Its key selling point? Speed.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On its website, One Trading boasts that it’s the “fastest trading venue in the world.” It had Amazon Web Services test the claim, comparing its round-trip of 112 microseconds favorably with CME and London Stock Exchange Group’s Turquoise venue. While all users can access One Trading’s APIs, institutions can go a step further by purchasing colocation services — accessing even faster trading speeds.&nbsp;<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Josh Barraclough, CEO of One Trading, said the idea is to empower customers “with unparalleled advantages in the competitive world of crypto trading.”&nbsp;<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Even after the cleansing effect of a year-long crypto winter, One Trading comes into a crowded market for crypto exchanges. The sector recorded $826 billion in monthly volume in November, according to <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/cryptocurrency-exchange-volume-monthly\" data-v-f87c67ca=\"\">The Block's Data Dashboard<\/a>. There is a clear need for newcomers to differentiate.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">One Trading has chosen to hang its hat on speed, but opinions differ among executives as to how critical a factor speed is in today’s more than decade-old crypto market.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Some of the oldest and largest players by volume still see speed as a key battlefield, while others are more concerned with ensuring the battlefield is even.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Kraken, launched in 2013 and very much part of the old guard in crypto, today accounts for <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/usd-support-exchange-volume-market-share\" data-v-f87c67ca=\"\">around a fifth of the market<\/a> for crypto exchanges supporting U.S. dollar transactions.<\/span><span data-v-f87c67ca=\"\"> This year, the company has embarked on a campaign to upgrade its technology — with latency front of mind.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A spokesperson for Kraken said that as the market has matured, so too have its traders, creating a need “for increasing speed to remain competitive and access liquidity.”&nbsp;<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Since 2011, Kraken’s engineering team has continued to enhance the scalability and overall performance of the exchange. We’ve managed to make further improvements to trading latency, reducing it by over 95% in the past 18 months,” they added.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In April, Kraken <\/span><a href=\"https:\/\/blog.kraken.com\/crypto-education\/performance-at-kraken\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">announced the impending launch of a new FIX API<\/span><\/a><span data-v-f87c67ca=\"\"> for spot market data and trading — which is now live. The idea was to give institutional traders an industry-standard API, making it quicker and easier for institutions to begin trading.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Investing in improvements across the tech stack enables Kraken to offer a faster, reliable, more liquid and fully featured trading experience for all our clients, fulfilling our role as a bridge to the crypto ecosystem. This has been particularly important in recent weeks with the increased market activity and volatility,” Kraken’s spokesperson said.&nbsp;<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Coinbase, Kraken’s great rival in the U.S. dollar market, did not dismiss the need for low latency — but placed a greater emphasis on creating a level playing field for all market participants.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Coinbase is still the 800-pound gorilla in the U.S., with around 40% of the market, <\/span><a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/usd-support-exchange-volume-market-share\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">per The Block’s Data Dashboard<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/usd-support-exchange-volume-market-share\/embed\" title=\"USD Support Exchange Volume Market Share\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<span data-v-f87c67ca=\"\">Harsha Bhat, a senior director in software engineering at the firm, said Coinbase gives a wide variety of clients “access to one of the deepest pools of liquidity of any regulated crypto spot exchange through low latency, high throughput APIs and an advanced trading interface.”<\/span>","<span data-v-f87c67ca=\"\">“As a centralized exchange built cloud native, we provide our clients with equal, fair, and transparent access to our matching technology, market data, and APIs and even publicly display our availability zones,” Bhat added.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">It’s a far cry from talk of carving out “advantages” for traders based on microsecond head-starts.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But while Coinbase and Kraken cater to institutions, they also have millions of retail customers to consider. Not so with newer entrants to the market — even if they do serve retail. The key question for such upstarts is whether institutional clients are hungry for an edge in terms of speed.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Max Boonen, founder of the market maker B2C2, sees pockets of demand for exchanges that offer low latency.&nbsp;<\/span><span data-v-f87c67ca=\"\">“When a market participant has a speed advantage, it can make more money than others,” he said.<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">He pointed out, however, that speed is not the only driver of price discrepancies that HFT firms might seek to exploit. Structural inefficiencies, such as the so-called Kimchi premium — which refers to when crypto prices are <\/span><a href=\"https:\/\/vegaxholdings.medium.com\/kimchi-premium-crypto-arbitrage-techniques-b780a45b6e76\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">quoted higher in Korean won<\/span><\/a><span data-v-f87c67ca=\"\"> than in other currencies — are another example.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Speed is one of those advantages that some firms are willing to pay a lot of money for, but for the market as a whole it doesn’t make a huge difference,” Boonen said. “Speed only matters to a handful of players.”&nbsp;<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Still, cloud servicing giants like AWS seem to be positioning themselves to win the business of that handful.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Mark Hingston, chief technology officer at Auros, an algorithmic trading and market making firm focused on crypto, said cloud providers are “always innovating in this area” — pointing to new services rolled out in the past year by AWS.&nbsp;<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">He said AWS recently launched PTP (Precision Time Protocol) for a subset of its EC2 machines — virtual servers — making it easier for both platforms and traders to access extremely accurate timing. Hingston also pointed out that, as of last year, AWS has allowed traders and venues to share an EC2 Cluster Placement, meaning their servers are located as close to each other as is physically possible within AWS facilities, minimizing the time it takes to insert and cancel orders.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Overall, cloud providers are becoming more aware of the benefits of working with HFT traders in crypto markets,” Hingston said. “As a result, they are willing to customize solutions or host deep dive sessions that help traders understand how to get the best possible latency on their connections to exchanges.”<\/span>","<span data-v-f87c67ca=\"\">A spokesperson for AWS declined to comment on these services.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For Hingston, lower latency systems allow traders to provide more competitive quotes, which will in turn narrow spreads. “It not only contributes to improved price discovery but also enhances market efficiency, ultimately reducing the overall cost of trading for all participants,” he said.<\/span>","<span data-v-f87c67ca=\"\">Some trading firms appear more concerned about the ways speed mismatches may disadvantage them, however.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Jordi Alexander, CIO of Selini Capital, said, “As a HFT market-making firm trying to provide deep liquidity, we ideally are looking for venues to provide a level-playing field when it comes to latency. This allows us to protect ourselves from toxic taking flow, and thus be able to quote large limit orders without constantly getting picked off.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Alexander said a toxic trading environment can emerge in two ways. The first is the result of networking.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Given most of the price discovery is happening in large hubs, especially Tokyo AWS, if the exchange matching engine is in a geographical location that gives 1 or 2 firms a specific networking advantage due to their private microwave routing, that creates toxicity. For example, if the venue is in London, if someone has a unique link for Tokyo-London that can overwhelm competitors,” he said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Alexander’s second example concerns exchanges giving certain players direct access to their trading engine. “If a firm that does a lot of liquidity removal is given advantageous access, that can imbalance the equilibrium and result in worse execution possible for everyone as the liquidity provided is having to be more defensive,” he said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Debates over how to balance traders’ demand for premium speeds with a fair market structure are not new, nor are they unique to crypto. They’ve been going on <\/span><a href=\"https:\/\/www.wsj.com\/articles\/BL-MB-44124\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">since before the publication of Michael Lewis’s Flash Boys<\/span><\/a><span data-v-f87c67ca=\"\">, a book about HFT outfits and dark pools on Wall Street, which debuted in 2014.&nbsp;<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Most crypto traders likely care far more about reliability than getting their orders filled faster than anyone else. As Bhat put it, latency is important, but Coinbase strives “to couple low latency with a deterministic experience to provide the best trading outcomes.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">There remain, however, enough HFT firms and cutting-edge venues to keep AWS interested in the speedier corners of the crypto sector.<\/span>"],"hashtag":["COINBASE","KRAKEN"]}