{"summary":"Crypto-friendly bank Silvergate has seen rapid growth of its payments platform, the Silvergate Exchange Network, since its introduction in 2017.\nToday the bank said its payments platform crossed the $100 billion mark in transfer volume.\nIn recent quarters, Silvergate has built on the network, enabling loan funding and repayment processing.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/79999\/silvergate-payments-platform-billion-volume","publishDate":"2020-10-06T15:22:29","id":3780,"type":null,"title":"Silvergate&#x27;s payments platform crosses $100B in transfer volume","category":["Payments and Banking"],"content":["Crypto-friendly bank Silvergate said it was particularly \"bullish\" on its payments platform during its Q2 earnings call.","Now it's announced the Silvergate Exchange Network (SEN) has exceeded $100 billion in transfer volumes.","The bank announced the milestone in a release today, addressing the rapid growth of the platform. The bank developed it in 2017 as a way for its institutional investor customers to send dollars to others on the platform around the clock, and has since introduced capabilities geared toward digital asset customers.","The Q3 volume, which has brought the platform across the $100 billion mark in transfers, builds on steady growth from previous quarters.","Q2 saw a 30% increase of SEN transfer volumes compared to the previous quarter, which was also <a href=\"https:\/\/www.theblockcrypto.com\/linked\/63396\/silvergates-payments-platform-sees-record-activity-totaling-17-4-billion-in-transfer-volumes\" data-v-f87c67ca=\"\">record-breaking<\/a> in its own right. During the Q2 earnings call, CEO Alan Lane said there were no signs of slowing down as the bank released its loan funding and repayment processing product SEN Leverage. In today's release, he again pointed to it as a strong growth area for the bank.","“When we created the SEN, we couldn’t have anticipated its rapid, broad adoption across the digital currency industry,” said Lane. “This milestone and broad adoption of the SEN further validates the platform’s competitive advantage and its growing network effects.\"","","","In addition to the growth of its payments platform, its digital-currency-related client base has also been a growth area for the bank. Lane <a href=\"https:\/\/www.theblockcrypto.com\/post\/73000\/bitcoin-banker-silvergate-earnings\" data-v-f87c67ca=\"\">said<\/a> clients could expect Silvergate to continue to grow offerings related to the SEN platform, especially its Bitcoin collateralized loans, which it plans to grow through the second half of the year.","With plans to continue to grow SEN offerings related to digital asset clients, the bank could be looking to build on existing growth. Q2 reports showed a 35% increase in digital asset clients from the previous year, totaling 880 digital currency customers.","Generated fee income from digital asset clients jumped 40% from the previous quarter, continuing the steady growth seen from previous quarters.&nbsp;"],"hashtag":[]}