{"summary":"Layer 1 blockchain Fantom has launched ecosystem vault, a decentralized funding mechanism aimed at financing blockchain projects.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/204100\/fantom-releases-decentralized-funding-system-called-ecosystem-vault","publishDate":"2023-01-20T07:23:36","id":3782,"type":null,"title":"Fantom releases decentralized funding system called ecosystem vault","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Layer 1 blockchain Fantom has launched a decentralized funding mechanism aimed at financing blockchain projects through a community-driven governance process.<\/span>","<span data-v-f87c67ca=\"\">Known as the \"ecosystem vault,\" the mechanism <\/span><span data-v-f87c67ca=\"\">provides an opportunity for projects to secure funding in their efforts to build dApps on Fantom, an official <a href=\"https:\/\/fantom.foundation\/blog\/ecosystem-vault-now-live\/\" data-v-f87c67ca=\"\">blog post<\/a> explained. It provides a way in which developers can obtain capital without relying on intermediaries or external sources of finance.<\/span>","<span data-v-f87c67ca=\"\">The ecosystem vault will get 10% of transaction fees paid on the blockchain in FTM — the blockchain’s native asset which is controlled exclusively by FTM stakers. The <a href=\"https:\/\/www.theblock.co\/post\/159803\/fantom-community-decides-to-use-burn-fee-to-fund-ecosystem-projects\" data-v-f87c67ca=\"\">decision<\/a> to fund this vault was passed in July 2022.<\/span>","<span data-v-f87c67ca=\"\">To apply for funding, projects will have to create both a forum post and governance proposal get approved via an on-chain vote. These proposals will then be voted on by members of the community, with at least 55% voting approval needed from voters for a successful grant.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The payments will be distributed using Llamapay — an automated crypto payments service. Only the wallet addresses provided in the application will be paid. The maximum amount that can be requested will be equal to the total supply of Fantom tokens in the vault at the time of the application. This vault currently <a href=\"https:\/\/vault.fantom.network\/\" data-v-f87c67ca=\"\">holds<\/a> about 69,000 FTM tokens (currently valued at about $20,000).<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Fantom","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"$20,000","content":"MONEY"},{"type":"FTM","content":"ORGANIZATION"},{"type":"55%","content":"PERCENT"},{"type":"July 2022","content":"DATE"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}