{"summary":"Jump Capital&#x27;s Peter Johnson offers his take on the year ahead for the bitcoin and crypto space.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/89756\/outlook-2021-peter-johnson-predictions","publishDate":"2020-12-31T10:57:45","id":3784,"type":null,"title":"M&amp;A mania and a central bank bitcoin buy: Peter Johnson of Jump Capital&#x27;s 2021 predictions","category":["OP-ED"],"content":["<em data-v-f87c67ca=\"\">Peter Johnson is a Partner at Jump Capital, where he leads their investments in the fintech and crypto sectors. The opinions expressed herein are his own and do not represent the opinions or views of Jump Capital or the Jump Trading Group or its members.<\/em>","2021 is going to be a seminal year for crypto. Having led crypto investments for Jump Capital since our work in the sector started in 2014, I have seen the waves of irrational exuberance and irrational despair go through the industry over the years. During this time, I have never been more bullish on the industry or more confident in how the space will develop than I am right now. &nbsp;","<a href=\"https:\/\/www.theblockcrypto.com\/post\/51876\/why-2020-will-be-a-big-year-for-crypto\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">At the beginning of 2020, I made 15 crypto predictions<\/a>, and by my assessment, <a href=\"https:\/\/jumpcap.com\/blog\/what-i-got-right-and-wrong-about-crypto-in-2020\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">got 12 of 15 either right or partially right<\/a>. A venture investor that is getting 80% of their calls right is probably not taking big enough swings, so for 2021, I am making some bolder predictions. While I believe all of these will happen, even if half of them do, it will be an amazing year. Without further ado, here are my 10 crypto predictions for 2021.","For years, many in the crypto community have been predicting that institutional investors were on the verge of allocating capital into bitcoin. In 2020, institutions finally started to make these allocations, with public announcements of bitcoin holdings by Paul Tudor Jones, Stanley Druckenmiller, MassMutual, and others. 2021 will be the year that bitcoin becomes a mainstream investment for large asset managers, pension funds, insurance companies, and sovereign wealth funds. We have passed the tipping point where the risk of not investing (and underperforming those that do invest) has surpassed the risk of investing, and in 2021 FOMO (Fear Of Missing Out) will push many institutional investors to buy bitcoin.","This influx of capital from institutional investors will have broad implications for the industry. The most visible implication will be the rapidly rising price of bitcoin. This will happen due to simple supply and demand economics. Increased investor demand will meet a very inelastic supply curve (from newly mined coins and bitcoin holders), causing prices to rise. I usually stay away of price predictions, but the rising bitcoin price will be the biggest story of 2021, and I believe it will easily surpass $50,000.","Another significant implication of institutional investors coming in will be that in 2021 at least one major global bank will offer true crypto prime brokerage – enabling their clients to interact with one counterparty, get leverage from the bank, trade across multiple trading venues and counterparties, and cross-margin their crypto and non-crypto holdings.&nbsp;","In addition to institutional investors, I also expect central banks to begin buying bitcoin in 2021. In 2020, the Central Bank of Iran was the first central bank to publicly announce bitcoin purchases. Unfortunately, but unsurprisingly, these purchases seemed aimed at avoiding sanctions.","In 2021, I expect at least one more central bank to add bitcoin to their reserves, and purchase bitcoin not for sanctions avoidance, but instead as a strategic store of value against depreciating fiat currencies.","In 2020, Michael Saylor and Jack Dorsey become crypto heroes when Microstrategy and Square added bitcoin to their corporate treasury holdings. This led some to predict that many companies will follow their lead in 2021.","I believe this is unlikely to happen, as corporate treasurers’ primary goal is short-term cash management, not long-term strategic investing. Few corporate treasuries include significant gold or venture capital holdings, and few will include bitcoin in the near-term, leaving Saylor and Dorsey as outliers. If any large corporates do buy bitcoin for their treasuries in 2021, it will likely come from unique CEOs looking to make a statement with the purchase (perhaps Elon Musk).","Currently, Greyscale has a highly lucrative near-monopoly on crypto products that can be traded in traditional brokerage accounts. This situation is not good for retail investors (who are paying huge premiums for these products) or the industry.","In 2021, I expect large asset managers to lobby the SEC to approve an ETF, and the SEC to realize their folly in continuing to hold back an approval. If an ETF is approved, this will add further fuel to the price run as more investors will be able to gain bitcoin exposure via an ETF structure they are comfortable with.","As prices surge, crypto millionaires are minted, and companies such as Square, PayPal, Silvergate, and Grayscale put up huge numbers from their crypto offerings, large financial insitutions and technology firms will scramble to build, partner, or buy to enter the market.","Building will be a slow process, exacerbated by the scarcity of available crypto talent. Partnerships will flourish and often quickly evolve into acquisitions as large companies seek to lock in a crypto dancing partner, lest they be left out of the crypto jamboree. The high number of potential acquirers and relatively limited number of attractive acquisition targets will lead to fierce bidding wars for the most attractive companies and a significant number of acqui-hires for companies with strong talent but limited commercial traction.&nbsp;&nbsp;","In addition to the M&amp;A wave, 2021 will also bring the first major crypto IPOs. Coinbase will be the first, and their successful IPO will open the door for others to follow - both via traditional IPOs, as well as direct listings and SPAC acquisitions. DCG \/ its subsidiaries and BlockFi are the most often mentioned candidates, but there are several others that could become public companies in 2021.","Massive demand for interest-bearing crypto accounts has powered the impressive growth of companies such as BlockFi, Celcius, and Voyager, and led to the launch of these products around the world from the likes of Luno and Zipmex. In 2021, earning interest on crypto holdings will become the norm as most major exchanges in the U.S. and around the world roll out these offerings.","This will further power cryptodollarization (more on that below), as it enables people around the world to hold not just digital dollars, but interest-bearing digital dollars.","The explosive growth of cryptodollars (stablecoins) will continue in 2021 due to the worlds’ insatiable demand for U.S. dollars. Demand will continue to come from USD denominated crypto trading and settlement (the primary current use case), as well as from the use of cryptodollars as an alternative global money movement rail, and from cryptodollarization in some countries.","Cryptodollarization will be one of the most globally significant developments of 2021, as residents of countries with unstable currencies increasingly use cryptodollars instead of their local currencies.","Tether will remain the cryptodollar king, but USDC will start to seriously compete for the crown.","Volumes on DeFi platforms exploded in 2020, but the number of DeFi users has remained relatively small, with some estimates pegging the total number at around 200,000 (after accounting for the fact that many users are responsible for multiple wallets). The number of DeFi users has been constrained by the risks and complexity of interacting with DeFi. In 2021, both issues will be addressed.","On of the most significant risk-reducing developments in DeFi will be that the “oracle problem” will be solved, as big-name companies and data providers roll out robust oracle solutions that overcome the reliability, latency, and security issues of today’s oracles, and power the next generation of decentralized applications.","Better user interfaces, particularly from DeFi aggregators, will also reduce the complexity of interacting with DeFi, and enable broader participation and exponential user growth.","The growth of DeFi volumes will be driven by both this increase in users, and increased trading of derivatives, traditional assets (e.g., equities), and prediction markets. DeFi lotteries may also begin to take-off in 2021, and I expect we will eventually see $1bn+ crypto lotteries. &nbsp;","Central bank digital currencies (CBDCs) were a hot discussion topic in 2020. Despite all this noise, no major central bank will fully launch a CBDC in 2021. According to a recent BIS survey, 80% of banks have no plans to issue a CBDC within the next 3 years.","Additionally, while CBDC designers claim that CBDCs would accommodate the existing role of commercial banks, the reality is that giving individuals digital currency that directly represents holdings at the central bank (the proposed structure of most CBDCs) will at least partially disintermediate commerical banks. This disintermediation would be unacceptable to the banking industry in all but the most authoritarian of countries, and I expect to see little meaningful CDBC action in 2021.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"Silvergate","content":"ORGANIZATION"},{"type":"DCG","content":"ORGANIZATION"},{"type":"80%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"$50,000","content":"MONEY"},{"type":"MassMutual","content":"ORGANIZATION"},{"type":"Jump Trading Group","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"BIS","content":"ORGANIZATION"},{"type":"$1bn","content":"MONEY"},{"type":"SPAC","content":"ORGANIZATION"},{"type":"Central Bank of Iran","content":"ORGANIZATION"},{"type":"Greyscale","content":"PERSON"},{"type":"Dorsey","content":"PERSON"},{"type":"Peter Johnson","content":"PERSON"},{"type":"Paul Tudor Jones","content":"PERSON"},{"type":"Michael Saylor","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"Stanley Druckenmiller","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Microstrategy","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Saylor","content":"PERSON"}],"hashtag":["BITCOIN"],"authors":["The Block"]}