{"summary":"Bitcoin miner Hive Blockchain said that revenues from GPU mining (a small portion of its business) were &quot;dramatically reduced&quot; after The Merge.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176738\/hive-blockchain-says-gpu-mining-revenues-plunged-in-september","publishDate":"2022-10-12T19:43:02","id":3785,"type":null,"title":"Hive Blockchain says GPU mining revenues plunged in September","category":["MINING"],"content":["Bitcoin miner Hive Blockchain said that profitability from GPU mining has plunged since shifting to altcoins after <a href=\"https:\/\/www.theblock.co\/post\/168380\/whats-left-for-ethereum-gpu-miners-after-the-merge\" data-v-f87c67ca=\"\">The Merge<\/a>.","\"Historically, Hive’s Ethereum GPU mining was generating 3x to 4x more revenue per MW (megawatt) of capacity than ASIC Bitcoin mining,\" the company said in a statement Wednesday.","After The Merge, as hashrate flowed from Ethereum into other coins, its revenues from GPU mining went from $120,000-$150,000 to $20,000-$30,000 per day, the company said.&nbsp;","However, since The Merge, poof-of-work mineable coins have \"experienced significant volatility,\" trending upwards and currently producing over $30,000 per day in revenue, the company said.","That same energy capacity deployed on ASICs mining bitcoin could produce around $41,000 at current difficulty levels, Hive also said.","The company has ASIC machines ready to make the switch if it decides to do so but it is currently assessing the revenues it could make \"once the ecosystem stabilizes and if it proves economically attractive.\"","Still, GPU mining is a relatively small portion of Hive's business (using 25 of the company's total 130 megawatts of power capacity), with the rest being bitcoin mining. The Ethereum mining business set the company up for success with bitcoin mining, as it now shifts focus to the latter, it said.","\"Hive has successfully used its Ethereum operations to fund and help build out our company’s global Bitcoin mining operations. Our plans are to continue expanding our sustainable green energy Bitcoin mining and seek out new growth opportunities throughout this bear cycle,\" said executive chairman Frank Holmes. \"The company has sold substantively all of its Ethereum.\"","As of Sept. 30, the Hive had a balance of 3,350 BTC and 356 ETH&nbsp; — down from 5,100 ETH at the end of August.","The company's GPU hashrate shifted to other mineable coins, setting up payouts in Bitcoin, as opposed to holding those coins. It produced an additional 15.8 BTC this way following The Merge.","Hive's total BTC equivalent produced from GPU mining fell 44% month-over-month — from 228.4 BTC strictly from Ethereum mining in August to 111.7 BTC from Ethereum and 15.8 BTC from other coins in September.","“As a testament to Hive’s industry-leading hashing uptime, and resilience to navigate new opportunities in proof-of-work mining, we have emerged with continued revenue earning payouts in Bitcoin from all of our GPU fleet thanks to our global technical team,\" said Hive President and COO&nbsp; Aydin Kilic.","Days before The Merge, Hive said that it was <a href=\"https:\/\/www.theblock.co\/post\/168044\/crypto-miner-hive-blockchain-testing-other-gpu-mineable-coins-ahead-of-the-merge\" data-v-f87c67ca=\"\">testing other GPU minable coins<\/a> as it strategized how to optimize the 6.5 TH\/s of Ethereum mining capacity it had (16% of its total energy capacity).","\"If it is clear that BTC mining earns substantially more $\/KWHR (dollars per kilowatt-hour) we would pursue expanding the BTC fleet,\" the company then told The Block.","Hive's bitcoin mining operational capacity was 2.28 EH\/s by September 30. IT plans to reach 2.7 EH\/s by the end of this month and add an additional 1 EH\/s in the next three to four months.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$41,000","content":"MONEY"},{"type":"Hive","content":"PERSON"},{"type":"Frank Holmes","content":"PERSON"},{"type":"$150,000","content":"MONEY"},{"type":"$30,000","content":"MONEY"},{"type":"$\/KWHR (dollars","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$20,000","content":"MONEY"},{"type":"44%","content":"PERCENT"},{"type":"GPU","content":"ORGANIZATION"},{"type":"September 30","content":"DATE"},{"type":"Sept. 30","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"COO&nbsp; Aydin Kilic","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"16%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"$120,000","content":"MONEY"},{"type":"Hive Blockchain","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"},{"type":"August","content":"DATE"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["ETHEREUM"],"authors":["Catarina Moura","The Block"]}