{"summary":"Bitcoin’s network difficulty is set to record double-digit growth as the hash rate continues its slow recovery.\nBut North American bitcoin mining firms are already poised to see new production records in Q3 — and we’re only halfway through.","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/115501\/bitcoin-mining-difficulty-us-miners-q3","publishDate":"2021-08-24T06:03:27","id":3786,"type":null,"title":"Bitcoin mining soon to be 12% harder but US miners have won big in Q3","category":["Mining"],"content":["Bitcoin's mining difficulty is set to record double digit-growth as the network's hash rate recovers. Based on the current block production intervals, the next mining difficulty adjustment is expected to incur in about 24 hours with a 12% increase.&nbsp;","This comes as bitcoin's hash rate recuperates following China's crypto mining shutdown. The seven-day average hashing power securing the world's largest blockchain is currently holding up at about 126 exahashes per second (EH\/s). That's more than 20% higher than it was at the end of July when the network <a href=\"https:\/\/www.theblockcrypto.com\/post\/112901\/bitcoin-ethereum-hashrate-recovery-chinese-miners\" data-v-f87c67ca=\"\">started to recover<\/a>, and 40% up from its recent bottom of 90 EH\/s in early July.","That said, bitcoin's seven-day average hash rate right now is still down 30% from its high of 180 EH\/s prior to China's crackdown in mid May.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoins-hash-rate-daily\/embed\" title=\"Bitcoin's Hash Rate (7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Following China's crypto mining crackdown and the drop in hash rate, bitcoin miners elsewhere in the world have enjoyed a much bigger share of the multi-billion dollar market.","Major North American bitcoin mining firms have published record earnings for Q2 last week and they are poised to continue breaking the quarterly production records in Q3 despite the network's mining difficulty jump.","The Block has previously reported that several largest bitcoin mining firms in the U.S. and Canada had on average <a href=\"https:\/\/www.theblockcrypto.com\/post\/113861\/american-public-bitcoin-miner-btc-july-china\" data-v-f87c67ca=\"\">mined 58% more bitcoin<\/a> in July than they did in June thanks to the shutdown of their China rivals.","But these firms are seeing even greater success. Public data shows the mined rewards of Riot Blockchain, Marathon, Bitfarm, Hut8, Argo and CleanSpark in July alone were already about half of their production in the entire second quarter this year.","Further, on-chain data shows that Mara Pool, the proprietary bitcoin mining pool owned by Marathon Digital Mining, one of the top two bitcoin miners in North America, has mined 51 blocks already in August so far. That means Marathon's block rewards this month have mounted to at least 324 bitcoin including both block subsidies and transaction fees. With 442 bitcoin mined in July, its Q3 production has surpassed that in Q2.","Meanwhile, the combined market share of the aforementioned six publicly listed bitcoin miners out of the total bitcoin rewards up for grab has increased from 2.51% in Q1 to 3.99% in Q2 and 6.93% in July.","<iframe frameborder=\"0\" height=\"371\" src=\"https:\/\/docs.google.com\/spreadsheets\/d\/e\/2PACX-1vTtJunzTggnr8A1fGflZkR_Y99XMrKVq1Yo8zLBupblo-9VAemOm__Re577lSJMfiaZ87A-i-aPoZq0\/pubchart?oid=558644935&amp;format=interactive\" width=\"600\" data-v-f87c67ca=\"\"><\/iframe>"],"hashtag":["BITCOIN"]}