{"summary":"Data compiled by 21.co shows more than $1 billion worth of U.S. Treasuries are now tokenized on public blockchains.\nFranklin Templeton’s BENJI leads with $360 million, while BlackRock’s new “BUIDL” tokenized fund has grown from $40 million to $245 million in just a week.","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285350\/tokenized-us-treasuries-public-blockchains-1-billion-usd-aum","publishDate":"2024-03-28T09:57:40","id":3787,"type":null,"title":"Tokenized US Treasuries on public blockchains surpass $1 billion in AUM","category":["Funds"],"content":["Data compiled by asset management firm 21.co, the parent company of bitcoin exchange-traded fund provider 21Shares, shows more than $1 billion worth of U.S. Treasuries are now tokenized on public blockchains, including Ethereum and Polygon.","“Just happened, $1 billion total tokenized U.S. Treasuries on public blockchains,” 21.co data analyst Tom Wan <a href=\"https:\/\/x.com\/tomwanhh\/status\/1773098494472925517?s=20\" data-v-f87c67ca=\"\">posted<\/a> late Wednesday. Tokenized government securities currently manage $1.07 billion in assets across 17 products, according to 21.co’s Dune Analytics <a href=\"https:\/\/dune.com\/21co\/tokenization-government-securities\" data-v-f87c67ca=\"\">dashboard<\/a> — up more than 20% over the past week.","Franklin Templeton’s tokenized U.S. Government Money Fund, represented by the BENJI token on Polygon and Stellar, leads the niche, with its 33.6% market share representing $360.2 million in assets. Franklin Templeton was also one of the first to market, <a href=\"https:\/\/www.theblock.co\/post\/228445\/franklin-templeton-fund-polygon\" data-v-f87c67ca=\"\">launching<\/a> its tokenized fund in 2021.","Meanwhile, BlackRock’s new “BUIDL” fund, tokenized in collaboration with Securitize on Ethereum, has grown to capture 22.8% of the market in just a week, managing <a href=\"https:\/\/www.theblock.co\/post\/285142\/new-blackrock-tokenized-fund-garners-160-million-in-deposits\" data-v-f87c67ca=\"\">$245 million<\/a> in assets. “BlackRock's BUIDL increased by 400% from $40 million to $240 million supply in a week,” Wan said.","According to a U.S. Securities and Exchange Commission filing, the BlackRock USD Institutional Digital Liquidity Fund (BUIDL) is a liquid fund investing in U.S. Treasury bills, repurchase agreements (short-term borrowing agreements for dealers in government securities) and cash. The BUIDL token is designed to offer a stable value of $1 per token, paying qualified investors dividends in the form of tokens representing U.S. dollar yield.","Earlier this week, analysts at research and brokerage firm Bernstein said that BlackRock’s tokenized fund “<a href=\"https:\/\/www.theblock.co\/post\/284735\/blackrock-tokenized-fund-legitimacy\" data-v-f87c67ca=\"\">brings legitimacy<\/a>” to public blockchains like Ethereum instead of using private chains like JPMorgan’s Onyx.","Tokenized funds from Mountain Protocol, Ondo Finance, Matrixdock, Hashnote and Backed Finance, among others, make up the remainder of the market. Ethereum is the most widely used public blockchain for the funds, with Stellar, Polygon, Avalanche, Gnosis and Base also utilized.","“OndoFinance is now the largest holder of BUIDL, holding 38% of the total supply’” Wan added. “Now Ondo's OUSG is fully backed by BUIDL.”","In collaboration with Ark Invest, 21Shares is among the now 11 spot Bitcoin exchange-traded fund providers in the United States.","The firms’ ARKB product currently ranks fourth among the ETFs, with around $3 billion in assets under management.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/bitcoin-etf\/spot-bitcoin-etf-assets\/embed\" title=\"Spot Bitcoin ETF AUM\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>"],"hashtag":["AVALANCHE","BASE","BLACKROCK","ETHEREUM","INVESTMENT FIRMS","SPOT BITCOIN ETF"]}