{"summary":"Court finds violations of the registration and anti-fraud provisions of U.S. securities law established, in default judgment posture. Court awards damages in U.S. dollars to plaintiffs tied to loss of bitcoin\/ether invested, using rapidly appreciated value in late 2017 award judgment in dollars to plaintiffs that gives them benefit of price appreciation at top of the market.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/50568\/court-in-centra-tech-case-explains-how-to-calculate-securities-fraud-damages-when-an-investment-was-made-in-crypto","publishDate":"2019-12-14T11:57:03","id":3788,"type":null,"title":"Court explains how to calculate securities fraud when an investment was made in crypto","category":["CRYPTOCURRENCY"],"content":["How do you calculate damages in a securities fraud case where the \"money\" invested was actually cryptocurrency, and said \"money\" has fluctuated in value in relation to the dollar?&nbsp;","A December 13, 2019 Order from the Southern District of Florida in the Centra Tech lawsuit offers an answer.","Centra Tech was one of many token sales of the short lived ICO craze that claimed to offer a product that would massively disrupt something, but it turned out that the only disruption was in litigation. The Court summarizes thus:","In December of 2017, the Plaintiffs in this case filed a class action complaint against Defendant Centra Tech and a number of related individuals. Defendant Centra Tech, a company founded in May 2016, purported to sell cryptocurrency, “Centra Tech Tokens” or “CTR Tokens,” in an initial coin offering (“ICO”). The ICO allegedly raised funds for, among other things, a debit card backed by Visa and Mastercard that would allow users to instantly use cryptocurrencies to make purchases. Between July 23, 2017 and April 20, 2018, Centra Tech’s ICO raised more than $32 million from thousands of investors. The founders of Centra Tech, Defendants Sharma, Farkas, and Trapani are currently the subjects of an SEC enforcement action for securities fraud (S.E.C. v. Sharma et al., No. 18-cv-2909-DLC (S.D.N.Y.) and are being criminally prosecuted in the Southern District of New York for the fraudulent Centra Tech scheme. United States v. Sharma et al., No. 18-cr-340-LGS (S.D.N.Y.).","(This case is also notable for having drawn rapper D.J. Khaled and boxer Floyd Mayweather in:&nbsp; <a href=\"https:\/\/www.theblockcrypto.com\/post\/4313\/sec-fines-boxer-and-dj-for-undisclosed-paid-promotion-of-icos\" data-v-f87c67ca=\"\">they ultimately entered into consent agreements with the SEC for violating anti-touting prohibitions.<\/a>)","Anyway, this particular Order deals with damages. The Court previously found that the plaintiffs were entitled to a default judgment because Centra Tech didn't answer the lawsuit on time after being properly served.&nbsp; If you don't respond, that's what happens. But the Court still has to decide damages before entering a final judgment.&nbsp; That's what this order deals with.","First, the Court found that Centra Tech violated the registration requirements of the Securities Act because the tokens were an investment contract and a security under the three part Howey Test and no registration statement was filed with the SEC. Second, 10b-5 securities fraud liability was also established because, among other things:","Centra Tech made numerous material misrepresentations. It claimed that the Centra Tech Debit Card would be able to operate on Visa and Mastercard networks and allow users to make transactions in digital currencies in “real time.” However, Centra Tech was never authorized to use the Visa or Mastercard networks and the Centra Tech Debit Card never allowed users to make digital currency transactions in real time. Centra Tech also fabricated fictional executives who they claimed were working with Centra Tech, touted Centra Tech’s nonexistent insurance policy, and made false claims regarding state licenses to increase investor confidence and solicit additional purchases of CTR Tokens.&nbsp; Centra Tech made these statements to induce Plaintiffs and the general public to invest in more unregistered CTR Token securities and as part of a scheme to artificially inflate the value of the patently worthless unregistered CTR Token securities.","Having established liability, the Court turned to damages. Damages for a registration violation \"are measured by the difference between (i) the amount of consideration the plaintiff originally paid for the security, plus prejudgment interest, less (ii) the amount for which the plaintiff sold the [security], together with any income the plaintiff received on the security.\" As a consequence, the Court said that because investors invested using BTC or ETH had to have their damages calculated in those terms. Thus, \"the proper computation of Plaintiffs’ damages is the value of the BTC or ETH consideration paid for CTR Tokens reduced by the amount realized through that sale of CTR Tokens on the date of sale, if any.\" The Court said that this is also consistent with the \"proper method of computing damages under 10(b)\" for a securities fraud claim.","Using this approach, the Court calculated damages for each of the plaintiffs, whose losses ranged from a high of $2,672,864.54 to a low of $350.10.&nbsp; Here's how the Court calculated the losses, using the largest plaintiff's loss as example:","Plaintiff He purchased 1,283,717 CTR Tokens in exchange for 203.0054 BTC and 511.35 ETH. When He sold those CTR Tokens, he received less than 66.7 BTC in exchange. He’s total losses as a result of his investment in CTR Tokens is 136.3069 BTC and 511.35 ETH. The dollar value of that BTC and ETH on the dates of He’s sales was $2,672,864.54. He is thus entitled to a judgment against Centra Tech in the amount of $2,672,864.54.","As set forth in <a href=\"https:\/\/www.scribd.com\/document\/439758734\/He-Declaration\" data-v-f87c67ca=\"\">this Plaintiff's declaration<\/a>, he uses CoinMarketCap.com as a canonical source for the value of the crypto on the dates of sale.","","","In short, this damages calculation ties the amount of loss to the rapid appreciation in value of the crypto that was used to invest in 2017. I am going to use some approximations here, but it appears that when this plaintiff made his purchases of bitcoin in the beginning of October 2017, the approximate dollar value was $4,300.&nbsp;","<strong data-v-f87c67ca=\"\">** Source: &nbsp;https:\/\/coinmarketcap.com (last visited, 12\/14\/2019).&nbsp;<\/strong>","When he sold a portion of his Centra Tokens in November, Bitcoin was trading at $6,153 (per the Plaintiff’s declaration) and in December it was trading for $19,319.&nbsp; So, the Court is doing two things here: it's (1) not allowing the defendant to keep the massively appreciated dollar value of the Bitcoin in that short period of time and it's (2) it's giving the plaintiff the theoretical benefit (from a damages calculation standpoint) of having sold at the top of the market. It's not entirely clear from this math what plaintiff's damages would be in a scenario where the spot price of bitcoin at the time of disposal of the Centra Tech was less than at the time of purchase. In other words, how would damages be calculated if the plaintiff had received more Bitcoin at the time of sale than at the time of purchase?","Still, this may be dangerous precedent for ICO issuers. If you bought XYZ token for 3 bitcoin when bitcoin was $2,000 and then liquidated when bitcoin was $20,000 and got .30 bitcoin, then your damages in a theoretical case could be 2.7 bitcoin at a spot price of $20,000, not $2,000.&nbsp;","I also couldn't help but notice that the plaintiff purchased some of his centra tokens directly from Centra Tech but also bought a bunch from Binance, which is not a defendant, even though (if you follow this court's logic) it was selling an unregistered security to American investors and doing so without any sort of broker dealer registration.&nbsp;","There aren't a ton of cases that deal with crypto securities losses yet but I expect we will see plenty more in the months and years to come. In this case, the defendant was at a real disadvantage because it had a default judgment already taken against them. In cases where a more aggressive defense is mounted earlier, it's possible other conclusions could be reached. It seems highly unlikely, however, that issuers will ever be left in a position where they are allowed to enjoy the benefit of appreciated value while a wronged investor is left holding an empty bag.","** Update -- Centra Tech filed a Motion to Reconsider the damages calculation, which was not mentioned when this article was originally published. &nbsp;While such motions are rarely granted, the motion makes some non-trivial arguments about flaws in the plaintiffs' damages calculations. &nbsp;A link to that Motion appears below.","<a href=\"https:\/\/www.scribd.com\/document\/439758572\/Rensel-Order\" data-v-f87c67ca=\"\">Link to opinion<\/a>","<a href=\"https:\/\/www.scribd.com\/document\/439758734\/He-Declaration\" data-v-f87c67ca=\"\">Link to He Declaration<\/a>","<a href=\"https:\/\/www.scribd.com\/document\/439771045\/Centra-MTR\" data-v-f87c67ca=\"\">Link to Motion to Reconsider<\/a>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Trapani","content":"PERSON"},{"type":"the Court","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"$19,319","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"S.E.C. v. Sharma","content":"ORGANIZATION"},{"type":"Centra Tech’s ICO","content":"ORGANIZATION"},{"type":"Farkas","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$6,153","content":"MONEY"},{"type":"$20,000","content":"MONEY"},{"type":"Centra","content":"ORGANIZATION"},{"type":"centra","content":"ORGANIZATION"},{"type":"Centra Tokens","content":"ORGANIZATION"},{"type":"$350.10","content":"MONEY"},{"type":"November","content":"DATE"},{"type":"D.J. Khaled","content":"PERSON"},{"type":"Centra Tech Debit Card","content":"ORGANIZATION"},{"type":"United States v. Sharma","content":"LOCATION"},{"type":"CTR Tokens","content":"LOCATION"},{"type":"Southern District of Florida","content":"LOCATION"},{"type":"$2,000","content":"MONEY"},{"type":"Defendants Sharma","content":"ORGANIZATION"},{"type":"December 13, 2019","content":"DATE"},{"type":"May 2016","content":"DATE"},{"type":"July 23, 2017","content":"DATE"},{"type":"$2,672,864.54","content":"MONEY"},{"type":"Court","content":"ORGANIZATION"},{"type":"Binance","content":"LOCATION"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"Floyd Mayweather","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"October 2017","content":"DATE"},{"type":"April 20, 2018","content":"DATE"},{"type":"December","content":"DATE"},{"type":"December of 2017","content":"DATE"},{"type":"ICO","content":"ORGANIZATION"},{"type":"Howey","content":"PERSON"},{"type":"CTR Tokens","content":"ORGANIZATION"},{"type":"Southern District of New York","content":"LOCATION"},{"type":"$32 million","content":"MONEY"},{"type":"$4,300","content":"MONEY"},{"type":"Centra Tech","content":"ORGANIZATION"},{"type":"XYZ","content":"ORGANIZATION"}],"hashtag":[],"authors":["Stephen Palley","The Block"]}