{"summary":"To finance his next step, Sethi minted his resignation letter as an NFT for 0.023 ETH. So far the mint netted him $624.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/208252\/mastercards-nft-product-lead-leaves-role-mints-resignation-letter-as-nft","publishDate":"2023-02-02T17:09:38","id":3790,"type":null,"title":"Mastercard&#x27;s NFT product lead leaves role, mints resignation letter as NFT","category":["PEOPLE"],"content":["Mastercard's former NFT product lead Satvik Sethi has resigned from his position — and minted his resignation letter as an NFT.&nbsp;","Sethi worked as the NFT product lead at Mastercard for the past two years. However, he noted that he left the company due to harassment, emotional distress and other poor working conditions in a multipart Twitter <a href=\"https:\/\/twitter.com\/sxtvik\/status\/1621210417686278145\" data-v-f87c67ca=\"\">thread<\/a>.&nbsp;","He minted his resignation letter as an NFT on the marketplace Manifold, stating, \"100% of this goes to survival. This isn’t gambling money.\"","The NFT of Sethi's resignation from Mastercard as NFT product lead.","The NFT costs 0.023 ETH to mint ($39). Sixteen of the NFTs have been minted so far, netting Sethi an estimated $624. He is now working on joincircle, a web3-focused social platform which Sethi founded and heads as CEO.&nbsp;","Mastercard has made several moves in the crypto space within the past two years. The firm partnered with leading crypto exchange Binance to release a <a href=\"https:\/\/www.theblock.co\/post\/161521\/binance-and-mastercard-launch-prepaid-crypto-to-fiat-card-in-argentina\" data-v-f87c67ca=\"\">crypto-to-fiat<\/a> card in Argentina in addition to launching tools to prevent crypto-based financial <a href=\"https:\/\/www.theblock.co\/post\/174610\/mastercard-to-combat-crypto-fraud-with-new-tool\" data-v-f87c67ca=\"\">crimes<\/a>.&nbsp;","Regarding Sethi's departure, a spokesperson from Mastercard told The Block, \"We are aware of the concerns raised by Mr. Sethi. We take them seriously and they will be looked into. We will do so with the continued respect for his privacy and will not have a further comment at this time.\"&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Satvik Sethi","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"$624","content":"MONEY"},{"type":"Argentina","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Sethi","content":"PERSON"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$39","content":"MONEY"}],"hashtag":["EXITS"],"authors":["MK Manoylov","The Block"]}