{"summary":"Last week, reports initially suggested that Yunnan was banning bitcoin mining. While that&#x27;s not the case (yet), it is inspecting miners.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/108278\/bitcoin-mining-yunnan-china","publishDate":"2021-06-14T04:56:04","id":3792,"type":null,"title":"Here&#x27;s what Yunnan is actually doing with bitcoin mining","category":["BITCOIN"],"content":["Last Friday, a screenshot of a presumed Chinese government document sparked confusion over a supposed bitcoin mining ban in the Chinese province of Yunnan.","Crypto news outlet Forkast first <a href=\"https:\/\/forkast.news\/china-yunnan-to-ban-cryptocurrency-mining-source\" data-v-f87c67ca=\"\">reported<\/a> that Yunnan was set to ban local bitcoin miners following moves from counterparts in Xinjiang and Inner Mongolia, citing the screenshot of a document that appeared to come from the Yunnan Energy Bureau. CoinDesk also <a href=\"https:\/\/www.coindesk.com\/chinas-yunnan-to-become-latest-province-to-ban-crypto-mining-report\" data-v-f87c67ca=\"\">reported<\/a> on the news, citing the Forkast article as a source.","Both media outlets later revised and corrected their initial reports due to the belief that the screenshot of the document was counterfeit because its format is not aligned with how authentic documents from the Chinese government typically look like. CoinDesk also did a follow-up post to clarify that Yunnan did not ban bitcoin mining.","But the reality appears to be more nuanced than that.","While the format of the supposed document screenshot may seem off, it is, however, not impossible that the essence of the screenshot speaks to what is happening in Yunnan.","China Star Market, a business outlet under the state-owned Shanghai United Media Group, said in a <a href=\"https:\/\/www.chinastarmarket.cn\/detail\/766572\" data-v-f87c67ca=\"\">news alert<\/a> on Saturday that the Yunnan Energy Bureau confirmed to the outlet that it is requiring subordinate energy departments in the province to fully inspect bitcoin mining farms by the end of June.","In fact, the China Star Market's news alert was also identical to the essence of the screenshot that was circulating on Friday but the media outlet didn't specify whether the screenshot was authentic.&nbsp;","Neither China Star Market nor the circulating screenshot exactly mentioned that the Yunnan province was set to impose a blanket ban on bitcoin mining.","The media report said the Yunnan Energy Bureau is requiring subordinate departments to inspect and then either shut down or rectify bitcoin mining farms that are using unauthorized hydroelectricity. This includes power stations that are directly supplying energy to bitcoin mining farms without paying a profit cut to the government.","This is a fairly common but grey area practice in Yunnan and Sichuan, where power stations <a href=\"https:\/\/www.theblockcrypto.com\/daily\/86520\/china-sichuan-hydropower-consumption-parks-bitcoin-mining\" data-v-f87c67ca=\"\">directly supply hydroelectricity<\/a> to mining farms without routing through the energy grid. It reduces the operating costs for mining farms by avoiding the need for them to share profits with the State Grid and the local government.","It remains to be seen what the next step is when the Energy Bureau completes its inspection of unauthorized energy use by bitcoin mining farms.","Yunnan, along with Sichuan, are the two main bitcoin mining hubs powered by hydroelectricity. But neither one has issued any concrete measures on the future of bitcoin mining in its region following the State Council's comment about cracking down on bitcoin trading and mining activities.","It has been <a href=\"https:\/\/www.theblockcrypto.com\/daily\/107104\/china-bitcoin-miners-state-council-crackdown\" data-v-f87c67ca=\"\">reported<\/a> that China's high-level carbon neutrality ambition was behind the State Council's comment. This likely led to the swift action seen in coal-based regions Xinjiang and Inner Mongolia. Xinjiang has <a href=\"https:\/\/www.theblockcrypto.com\/post\/107707\/xinjiang-bitcoin-miner-shut-crackdown-china\" data-v-f87c67ca=\"\">ordered miners<\/a> in its Zhundong Economic and Technology Development Zone to stop their operations. Inner Mongolia, which had already ordered miners to close, has <a href=\"https:\/\/www.theblockcrypto.com\/post\/105973\/china-inner-mongolia-crypto-bitcoin-mining-ban-measures\" data-v-f87c67ca=\"\">released a set of consequences<\/a> if they don't obey. ","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Zhundong Economic and Technology Development Zone","content":"ORGANIZATION"},{"type":"Sichuan","content":"LOCATION"},{"type":"Mongolia","content":"LOCATION"},{"type":"Xinjiang","content":"LOCATION"},{"type":"Shanghai United Media Group","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Yunnan","content":"PERSON"},{"type":"Yunnan Energy Bureau","content":"ORGANIZATION"},{"type":"State Grid","content":"ORGANIZATION"},{"type":"Energy Bureau","content":"ORGANIZATION"},{"type":"State Council","content":"ORGANIZATION"},{"type":"Yunnan","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Inner Mongolia","content":"LOCATION"},{"type":"China","content":"LOCATION"},{"type":"Saturday","content":"DATE"}],"hashtag":["BITCOIN"],"authors":["Wolfie Zhao","The Block"]}