{"summary":"Latin America-based fintech Mercado Pago is partnering with Paxos so that millions of Brazilian users can buy, sell and hold crypto in its popular app.\nThe new feature is rolling out this month and will support bitcoin, ethereum and the Pax Dollar (USDP) stablecoin.","author":["Kristin Majcher","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/126103\/users-of-brazilian-fintech-mercado-pago-can-now-buy-sell-and-hold-crypto-through-paxos-partnership","publishDate":"2021-12-02T11:06:23","id":3794,"type":null,"title":"Brazilian users of fintech Mercado Pago can now buy, sell and hold crypto through Paxos partnership","category":["Payments and Banking"],"content":["<span data-v-f87c67ca=\"\">Latin America fintech Mercado Pago has partnered with Paxos to allow its Brazil-based users to buy, hold and sell cryptocurrencies directly in the app they use to make payments and send money.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The app will initially support bitcoin, ethereum and Paxos’ dollar-pegged stablecoin, Pax Dollar (USDP). Paxos will be the custodian for the cryptocurrencies.<\/span>","<span data-v-f87c67ca=\"\">Mercado Pago is incrementally rolling out the feature to Brazilian users this month, starting with employees. These people will immediately have access to those cryptocurrencies if they wish to use them, without having to take any additional steps in the app. All Mercado Pago app users based in Brazil should have access to crypto by the end of the month.<\/span>","<span data-v-f87c67ca=\"\">“Mercado Pago has an installed base, as of the end of last quarter, of 28 million wallets in Brazil, Mercado Pago CEO Osvaldo Giménez told The Block in an interview. “So, 28 million people who don’t need to do anything to start buying crypto.”<\/span>","<span data-v-f87c67ca=\"\">Adding crypto to an existing payment app like Mercado Pago is significant for a few reasons, Giménez said. First, he says that having access to crypto directly in a popular payment app will make it easier for people to start trading, as they do not have to go through the process of opening a separate account at another exchange. Additionally, Mercado Pago users can buy crypto with their existing balance of fiat currency in the app, and invest as little as 1 Brazilian real to do so (about $0.18). Integrating the USDP stablecoin is also relevant because it is very difficult for Brazilians to open U.S. dollar-based bank accounts, Giménez pointed out.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Mercado Pago was <a href=\"https:\/\/investor.mercadolibre.com\/investor-faqs\" data-v-f87c67ca=\"\">originally launched<\/a> to handle transactions through the online marketplace Mercado Libre, a popular website and app for buying and selling new and used goods that operates in 18 countries. But now, many brick-and-mortar stores also use Mercado Pago to accept payments through QR codes as well as mobile point-of-sale systems. The payment system is also a popular way to pay bills.<\/span>","<span data-v-f87c67ca=\"\">“As we start to see stablecoins be integrated into mainstream platforms like Mercado Libre, I think we’re going to start to see new use cases of stablecoins beyond just crypto trading and DeFi, but payments for actual goods and services,” Paxos’ Head of Strategy Walter Hessert told The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For now, Mercado Pago users would have to sell their cryptocurrencies before using those funds to buy goods with their account balance on the Mercado Libre marketplace, or to pay transactions using Brazil’s instant payment system, Pix.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Along with Brazil, Mercado Pago offers services in Argentina, Chile, Colombia, Mexico, Peru and Uruguay. However, Giménez said that the company decided to roll out the crypto functionality in Brazil first due to the significance and size of the market there. With a population of about 212 million, Brazil is Mercado Pago’s largest market and represents about half of e-commerce in the region, Giménez said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Mercado Libre is not the only company looking to give Brazilian customers the opportunity to use crypto in the same apps they use for everyday transactions. Latin America investment bank BTG Pactual is also <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/118524\/why-btg-pactual-is-launching-a-crypto-platform\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">planning to launch<\/span><\/a><span data-v-f87c67ca=\"\"> a cryptocurrency platform for its app users in Brazil called Mynt. <\/span>"],"hashtag":["FINTECH"]}