{"summary":"Vitalik Buterin published a new blog post on the topic of memecoins.\nHe noted his general dislike for negative memecoins, adding that he would like to see more “good ones” make positive contributions.","author":["Adam James","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285587\/ethereum-vitalik-buterin-memecoins","publishDate":"2024-03-29T05:37:21","id":38,"type":null,"title":"Ethereum co-founder Vitalik Buterin would like to see &#x27;more good memecoins than bad ones&#x27;","category":["Crypto Ecosystems"],"content":["In a blog post published today, Ethereum co-founder Vitalik Buterin shared his ideas surrounding memecoins and their potential for a net-positive impact in the cryptocurrency space.","Citing one of his \"personal moral rules\" that \"if there is a class of people or groups you dislike, be willing to praise at least a few of them to do the best job of satisfying your values,\" Buterin <a href=\"https:\/\/vitalik.eth.limo\/general\/2024\/03\/29\/memecoins.html\" data-v-f87c67ca=\"\">stated<\/a> that he has \"zero enthusiasm for coins named after totalitarian political movements, scams, rugpulls or anything that feels exciting in month N but leaves everyone upset in month N+1.\"","While memecoins have generated a lot of hype in recent months — and even in years past, for that matter — some in the space have <a href=\"https:\/\/www.reddit.com\/r\/solana\/comments\/1bnj8yz\/solana_racist_memecoins_are_out_of_control\/\" data-v-f87c67ca=\"\">expressed<\/a> a distaste for a new wave of intentionally off-putting memecoins utilizing racial slurs, blaming specific religious groups for 9\/11 or referencing the Holocaust, among other similarly negative things.","Despite memecoins' potential for negativity and negative outcomes — such as racism and rugpulls — Buterin said that, at the same time, he values \"people's desire to have fun\" and \"would rather the crypto space somehow swim with this current rather than against it\" through \"high quality fun projects that contribute positively to the ecosystem and the world around them.\"","\"At the least, more good memecoins than bad ones, ideally those that support public goods instead of just enriching insiders and creators,\" he explained — using charity coins, \"coins where a large portion of the token supply (or some ongoing fee mechanism) is dedicated to some kind of charity,\" as an example of potential overlap.","Buterin's commentary comes after others in the industry recently expressed their general dislike for memecoins. For example, CryptoQuant founder and CEO Ki Young Ju recently <a href=\"https:\/\/www.theblock.co\/post\/283190\/solana-memecoin-presales-continue-to-see-interest-despite-industry-leaders-expressing-concerns\" data-v-f87c67ca=\"\">posted<\/a> on X that \"memecoins harm the industry,\" adding: \"It's frustrating to see billion-dollar-cap memecoins overshadow hardworking teams building legit products to advance this industry.\"","At the same time, memecoins have once again drawn the attention of regulators — particularly the Financial Conduct Authority in the U.K., which <a href=\"https:\/\/www.theblock.co\/post\/285019\/memecoin-finfluencers-are-falling-under-the-financial-conduct-authoritys-regulatory-spotlight\" data-v-f87c67ca=\"\">issued a warning<\/a> earlier this week explaining that so-called \"finfluencers\" on social media must have approval from an FCA-appointed representative prior to advertising or posting memes about financial products or services, including crypto."],"hashtag":["VITALIK BUTERIN"]}