{"summary":"Companies offering EU residents crypto services will need to report on transactions to tax authorities, per a new proposal from the European Commission.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193234\/eu-crypto-taxation-proposal-firms-global","publishDate":"2022-12-08T07:01:49","id":380,"type":null,"title":"EU crypto taxation proposal will target firms all over the world","category":["TAX"],"content":["<span data-v-f87c67ca=\"\">Companies offering crypto services to residents of the European Union will need to comply with tax reporting rules to close tax evasion gaps.<\/span>","<span data-v-f87c67ca=\"\">A new proposal from the European Commission will require crypto asset service providers of all sizes and geographical locations to report on the transactions of EU-based clients to tax authorities.<\/span>","<span data-v-f87c67ca=\"\">“Tax authorities currently lack the necessary information to monitor proceeds obtained by using crypto-assets, which are easily traded across borders,” the European Commission wrote in a statement. “This severely limits their ability to ensure that taxes are effectively paid, which means European citizens lose important tax revenues.”<\/span>","<span data-v-f87c67ca=\"\">The gap in expected and collected tax on taxable goods and services within the bloc was €93 billion ($98 billion) in 2020, according to statistics released by the Commission. That makes up 9.1% of the total expected revenue. Collecting taxation on crypto activity in the EU could bolster an additional €2.4 billion ($2.5 billion) of revenue, The Block <\/span><a href=\"https:\/\/www.theblock.co\/post\/192150\/eu-crypto-taxation-leaked-proposal\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reported<\/span><\/a><span data-v-f87c67ca=\"\"> earlier this week.<\/span>","<span data-v-f87c67ca=\"\">The scope of the legislation covers crypto assets “issued in a decentralized manner,” including stablecoins and non-fungible tokens<\/span><span data-v-f87c67ca=\"\">.<\/span><span data-v-f87c67ca=\"\"> The Commission also suggested monitoring the cross-border activity of high-net-worth individuals as means to expand the data used by tax authorities to prevent opportunities to hide wealth from tax officials.<\/span>","<span data-v-f87c67ca=\"\">Now, the proposal will make its way onto the desks of policymakers in the European Parliament. A stamp of unanimous approval from state representatives in the European Council will also be needed before new rules come into force. The European Commission is hoping for enforcement starting in 2026.<\/span>","<span data-v-f87c67ca=\"\">The crypto tax reporting proposal, formally the eighth in a series of directives on administrative cooperation, sits in the EU’s 2020 package of 25 initiatives to adapt the process of taxation to new technologies. DAC8 forms another pillar of the EU’s growing crypto-asset legislation, alongside the framework in the Markets in Crypto-Assets regulation and anti-money laundering rules.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"9.1%","content":"PERCENT"},{"type":"2026","content":"DATE"},{"type":"Commission","content":"ORGANIZATION"},{"type":"93 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"European Commission","content":"ORGANIZATION"},{"type":"European Union","content":"ORGANIZATION"},{"type":"European Parliament","content":"LOCATION"},{"type":"$2.5 billion","content":"MONEY"},{"type":"European Council","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"$98 billion","content":"MONEY"},{"type":"Crypto","content":"LOCATION"}],"hashtag":["EUROPEAN COMMISSION"],"authors":["Inbar Preiss","The Block"]}