{"summary":"Congress collected feedback from legal minds on how fintech firms may use or abuse banking licenses\nThe hearing, entitled “Banking Innovation or Regulatory Evasion? Exploring Trends in Financial Institution Charters,” included former Comptroller of the Currency Brian Brooks\nMany panelists condemned the OCC for “overreaching” in its dealings with fintech. ","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/101848\/at-congressional-hearing-panelists-question-why-crypto-and-fintech-firms-need-bank-licenses","publishDate":"2021-04-15T18:55:35","id":3802,"type":null,"title":"At Congressional hearing, panelists question why crypto and fintech firms need bank licenses","category":["Regulation"],"content":["Congress gathered a group of legal experts Thursday for a hearing on fintech's use of bank licenses.","Ultimately, much of the dialogue centered on one particular subject: if a crypto firm wants to offer certain banking services, is the OCC in charge of giving the green light?","The hearing featured three law professors, a representative of the National Association of Federally-Insured Credit Unions (NAFCU) and former U.S. Comptroller of the Currency Brian Brooks at a hearing entitled \"Banking Innovation or Regulatory Evasion? Exploring Trends in Financial Institution Charters.\"","Most of the gathered panelists criticized Brooks' work to issue <a href=\"https:\/\/www.theblockcrypto.com\/linked\/93928\/occ-grants-conditional-charter-blockchain-bank\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">bank<\/a> <a href=\"https:\/\/www.consumerfinancemonitor.com\/2020\/08\/07\/varo-is-first-fintech-to-receive-full-service-charter-from-the-occ\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">charters<\/a> to fintech companies during his time as head of the Office of the Comptroller of the Currency (OCC). Though policy-watchers in crypto circles praised the OCC's work at the time, Brooks <a href=\"https:\/\/www.theblockcrypto.com\/linked\/84298\/congress-democrats-occ-crypto-criticism\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">drew the ire<\/a> of Congressional Democrats before he left office.&nbsp;","Erik Gelding, a professor at University of Colorado's law school, directly urged Congress to take action to keep the OCC from issuing any new charters to entities that don't plan to accept deposits.","In the view of some panelists, entities that only engage with some activities regulated by a bank license, but not all or most of the activities that fall under that purview, shouldn't be regulated as national banks. As Kristin Johnson, a professor of law at Emory University, put it: \"A non-deposit national bank is an oxymoron.\"&nbsp;","The nature of cryptocurrency is presenting an old problem for policymakers in this context: the inability to peg what such firms are exactly doing. As Rep. Sean Casten (IL) put it:","The first step to clarity from regulators, according to Johnson, is clarity from businesses themselves as to how they define their own operations.","Georgia Quinn, general counsel for Anchorage -- the first operational, federally chartered crypto-focused bank, said a license has proven to be the right structure for the firm.&nbsp;","\"It is unreasonable to say that if you don’t provide every service a bank is allowed to provide then you are not a bank,\" she told The Block. \"Many, if not most, banks would not qualify under this condition as banks must get permission for each service they offer from their regulator, and only a small handful of the very largest banks, if any, offer every possible banking service from a single entity.\"","The idea that fintech-focused companies can provide banking services to the unbanked, particularly in rural areas where traditional bank branches may be a long way off, drew some interest during the hearing.","As Brooks also pointed out, fintechs connect people with new sources of capital. Connecting underrepresented pockets of the nation with financial services is a mandate Congress has taken seriously in recent years.","But to do that, Brooks said, some firms might require federal bank licenses. Federal bank licenses cut down on the onerous and costly process regardless of what type of service a firm is focused on.&nbsp; For example, having to obtain a money transmitter license from each state as an upstart payments firm could be enough to snuff a new player out.&nbsp;","Brooks thinks the OCC's mandate solves that, but others disagree. Gelding asserted that Congress should provide the uniformity that crypto needs through statutes rather than have the OCC do that in what he characterized as a \"back door manner.\"","Anchorage, for its part, said it encouraged regulators like the OCC to \"exercise their jurisdiction\" to monitor burgeoning firms.","\"At Anchorage, we believe bank-like products should be regulated by bank regulators,\" said Quinn. \"This creates a level playing field where all banking institutions are evaluated under the same regulations.\"","Much of the concern stems from the fear that bigger firms could abuse the opportunities a bank license affords.","Gelding cited concerns that conglomerates could use federal deposit insurance money for \"games\" that the Federal Deposit Insurance Commission (FDIC) would be unable to oversee, or worse, would be used to back up any undue risk that the FDIC may not know about until it becomes a wider issue.","There's precedent for this line of reasoning: during the 2008 crisis, according to Gelding, when Goldman Sachs and Merril Lynch, among others, used government money rather than prop up their industrial loan companies (ILCs). This is why some are pushing for a bill entitled \"Close the ILC Loophole Act.\"","There's also the worry that firms like Facebook and Amazon could seek banking licenses to conduct some of these activities on their own, leading to bigger data privacy concerns and fears of anti-competitive practices.","What's more, some Congressional representatives are still getting a handle on how crypto itself works and others are still adhering to the narrative that bitcoin and other cryptocurrencies enable broad illicit activity.&nbsp;","\"Bitcoin is not just for terrorists, it's for tax evaders too,\" said Rep. Brad Sherman (D-CA).","Others vocally assumed that many of the crypto firms seeking to obtain bank licenses use bitcoin for required safeguards, like reserves for deposits or net capital requirements. Some also raised concerns about such firms having bitcoin on the balance sheet, which often isn't the case.&nbsp;","Still, the companies now facing scrutiny from Congress may have a chance to set the record straight themselves. From the outset, Rep. Ed Perlmutter (CO) set the stage for further hearings and expressed hope that industry players would work directly with Congress on the issue."],"hashtag":["CONGRESS","OCC"]}