{"summary":"El Salvador will be handing out $30 in bitcoin to its adult citizens.\nThat roughly works out to an upper bound of $117 million of bitcoin — around 3,440 BTC.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/109603\/el-salvador-is-handing-out-up-to-117-million-in-bitcoin-to-its-citizens","publishDate":"2021-06-25T05:30:01","id":3807,"type":null,"title":"El Salvador is handing out up to $117 million in Bitcoin to its citizens","category":["Bitcoin"],"content":["El Salvador will be giving out $30 in bitcoin to any of its adult citizens that download a specific app and become verified on it.","The population of El Salvador is 6.5 million, with <a href=\"https:\/\/countrymeters.info\/en\/El_Salvador#age_structure\" data-v-f87c67ca=\"\">estimates<\/a> suggesting that 70% of the population is over the age of 15. As a result, adults likely make up around 60% of the population. This places the upper bound at roughly $117 million of bitcoin, which would currently total around 3,440 BTC.","El Salvador's President Nayib Bukele <a href=\"https:\/\/www.youtube.com\/watch?v=E77xEF-E2hs\" data-v-f87c67ca=\"\">addressed the nation<\/a> last night, revealing the impending airdrop of sorts and detailing that bitcoin will become legal tender on September 7.","The President said that adult citizens who download the Chivo e-wallet and go through the facial recognition process, will each receive $30 in bitcoin.","On June 8, El Salvador <a href=\"https:\/\/www.theblockcrypto.com\/linked\/107675\/el-salvador-bitcoin-legal-tender-law\" data-v-f87c67ca=\"\">approved its bitcoin bill<\/a>, stating the cryptocurrency will become legal tender in the country. It also committed to providing exchange services for merchants, while also requiring that they accept bitcoin.","While this latter requirement was somewhat controversial, Bukele argued on the <a href=\"https:\/\/www.youtube.com\/watch?v=qdx_alPrmVY\" data-v-f87c67ca=\"\">What Bitcoin Did<\/a> podcast that the law was designed to protect the unbanked. He claimed it would be <span data-dobid=\"hdw\" data-v-f87c67ca=\"\">discriminatory<\/span> if businesses weren't forced to accept bitcoin because the unbanked wouldn't necessarily have another means of payment.","In terms of why the country has put bitcoin at the forefront of its thinking, Bukele said on the podcast, \"Sometimes you also have to take forward thinking decisions and try not to foresee the future but at least know where the world is going and try to get there first — so your people will get some benefit out of it.\"","On mining bitcoin with geothermal energy from volcanos, Bukele said the country has found new wells that will provide a further 95 megawatts. He said this will be used for bitcoin mining and there has already been a lot of interest.","\"We have had interest in probably 2 gigawatts, which is 2,000 megawatts and we only have 95 so they're going to go like this. And they're going to provide a lot of income to the country,\" he said.","Bukele added that this income will fuel infrastructure developments in the country. In the future, he said he would like to see schools and pharmacies built with the resources that come as a result of the bitcoin law.","While El Salvador has little in the way of bitcoin infrastructure currently set up — just two bitcoin ATMs — it is working with Athena Bitcoin to change that. The company intends to invest $1 million to introduce up to 1,500 bitcoin ATMs in the region, per <a href=\"https:\/\/www.reuters.com\/article\/idUSL2N2O700C\" data-v-f87c67ca=\"\">Reuters<\/a>."],"hashtag":["AIRDROP","BITCOIN"]}