{"summary":"Meitu, a Chinese photo retouching app listed in Hong Kong, announced it has purchased $40 million worth-of BTC and ETH\nOne of the most popular mobile apps in China, Meitu has nearly 300 million in self-reported monthly active users as of June 2020\nMeitu is also evaluating the feasibility of launching Ethereum-based decentralized application","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/97477\/meitu-40-million-btc-eth","publishDate":"2021-03-07T09:07:21","id":3809,"type":null,"title":"Publicly-listed beauty apps maker Meitu buys $40 million in BTC, ETH","category":["Bitcoin"],"content":["Meitu, a Chinese photo retouching app listed in Hong Kong, has announced it purchased $40 million worth-of bitcoin and ethereum.","The firm said in disclosure Sunday on the Hong Kong Stock Exchange that it has bought <a href=\"https:\/\/www1.hkexnews.hk\/listedco\/listconews\/sehk\/2021\/0307\/2021030700045.pdf\" data-v-f87c67ca=\"\">15,000 units of ETH and 379.12 units of BTC<\/a> in open market transactions at an average cost of $22.1 million and $17.9 million, respectively, on Friday.","\"These purchases were made pursuant to a cryptocurrency investment plan previously approved by the board of directors, under which the Group may make a net purchase of up to US$100 million worth of cryptocurrencies, financed by its existing cash reserves other than any remaining proceeds from the Company’s initial public offering,\" Meitu said in the announcement.","Founded in 2008, Meitu is one of the most popular mobile apps in China with a market capitalization of HK$11.7 billion ($1.5 billion). <a href=\"https:\/\/www1.hkexnews.hk\/listedco\/listconews\/sehk\/2020\/0924\/2020092401068.pdf\" data-v-f87c67ca=\"\">As of June 2020<\/a>, Meitu held 2.5 billion yuan ($384 million) in cash and liquid financial reserve and had 295 million self-reported monthly active users.","Its chairman and founder Cai Wensheng is also a known pro-bitcoin figure who said in 2018 in an interview that he <a href=\"https:\/\/www.coindesk.com\/chinese-angel-investor-amassed-10000-bitcoins-amid-q1-price-slump\" data-v-f87c67ca=\"\">personally amassed 10,000 BTC<\/a> at the time.","The Sunday announcement, with a signature penned by Cai, said Meitu's board believes that blockchain technology has the potential to disrupt the existing financial and technology industries, similar to what the mobile internet has done to the PC internet and many other offline businesses.","In this context, the firm believes that \"cryptocurrencies have ample room for appreciation in value and by allocating part of its treasury in cryptocurrencies can also serve as a diversification to holding cash (which is subject to depreciation pressure due to aggressive increases in money supply by central banks globally) in treasury management.\"","Meitu is also one of the first Chinese publicly listed companies that have joined the ranks of Square, Tesla and MicroStrategy in holding bitcoin as part of its treasury management strategy.&nbsp;","\"[Bitcoin] has several features that enable it to be a good alternative store of value, such as being limited in supply, its exchangeability into fiat money or goods and services, portability, and its potential to act as an effective hedge against depreciation of fiat currencies due to aggressive increase in money supply by central banks globally,\" Cai penned in the release, adding:","As regard to its investment in ETH, Meitu outlined to its shareholders various application activities including finance, games, social media and art and collectibles that have been built on top of the Ethereum protocol.","\"The Group is currently evaluating the feasibility of integrating blockchain technologies to its various overseas businesses, including but not limited to launching Ethereum-based dApps, as well as identifying suitable overseas blockchain-based projects for potential investments,\" Meitu said and hence \"purchasing Ether is therefore a logical preparation for both initiatives.\""],"hashtag":["BITCOIN"]}