{"summary":"A number of indications exist that suggest the individual or group behind the shut-down Blender crypto mixer set up Sinbad, said Elliptic.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/211225\/sinbad-crypto-mixing-service-may-be-blender-in-disguise-elliptic","publishDate":"2023-02-13T16:30:33","id":3811,"type":null,"title":"Sinbad crypto mixing service may be Blender in disguise: Elliptic","category":["LEGAL"],"content":["<span data-v-f87c67ca=\"\">On-chain analytics firm Elliptic suspects a sanctioned and shuttered crypto mixer, Blender, may have resurfaced in the form of Sinbad, as a number of factors indicate the two services are operated by the same individual or group.<\/span>","A shuttered crypto transaction mixer once sanctioned by U.S. regulators may have returned under a new name, according to an analysis by crypto firm Elliptic.","Elliptic <span data-v-f87c67ca=\"\"><a href=\"https:\/\/hub.elliptic.co\/analysis\/has-a-sanctioned-bitcoin-mixer-been-resurrected-to-aid-north-korea-s-lazarus-group\/\" data-v-f87c67ca=\"\">said<\/a> that on-chain data show a likely connection between Blender, which was sanctioned by the Office of Foreign Assets Control (OFAC) in August, and a service called Sinbad.<\/span>","<span data-v-f87c67ca=\"\">Blender <a href=\"https:\/\/www.theblock.co\/post\/145478\/us-adds-blender-io-crypto-mixing-service-to-north-korean-sanctions-list\" data-v-f87c67ca=\"\">shut down<\/a> in Dec. 2022 after being linked to money laundering activity by Lazarus, a North Korean hacking syndicate suspected of stealing billions in crypto.<\/span>","<span data-v-f87c67ca=\"\">“Analysis indicates that Sinbad is in fact highly likely to be a rebrand of Blender, with the same individual or group responsible for it,” said Elliptic.<\/span>","<span data-v-f87c67ca=\"\">“Blender may have been motivated to re-brand in order to avoid sanctions, and OFAC could now seek to impose further sanctions on Sinbad,” Tom Robinson, chief scientist at Elliptic, told The Block, adding that the measure may have been taken to restore trust in users “following Blender’s abrupt closure last year, and the disappearance of significant amounts of funds from the mixer.”<\/span>","<span data-v-f87c67ca=\"\">In several ways, Blender and Sinbad are nearly identical, according to Elliptic. <\/span>","<span data-v-f87c67ca=\"\">As with Blender, Sinbad is a custodial mixer, meaning its operator or operators maintain complete control of any assets the service is handling until transferring them out. Both mixers feature 10-digit mixer codes, guarantee letters signed by the service address, and a transaction delay no greater than seven days.<\/span>","<span data-v-f87c67ca=\"\">Prior to Sinbad’s launch, one of the site’s service addresses “received Bitcoin from a wallet believed to be controlled by the operator of Blender\" according to Elliptic, which added that the suspected Blender wallet also issued payments to those who promoted Sinbad.<\/span>","<span data-v-f87c67ca=\"\">Roughly $22 million in early transactions were routed through Sinbad from the suspected Blender operator, according to Elliptic.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sinbad","content":"LOCATION"},{"type":"Office of Foreign Assets Control (OFAC","content":"ORGANIZATION"},{"type":"Lazarus","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Dec. 2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Tom Robinson","content":"PERSON"},{"type":"Sinbad","content":"ORGANIZATION"},{"type":"$22 million","content":"MONEY"},{"type":"Elliptic","content":"LOCATION"},{"type":"OFAC","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":["ANTI-MONEY LAUNDERING","CRIME","SANCTIONS"],"authors":["Jeremy Nation","The Block"]}