{"summary":"Greenidge Generation, known for its bitcoin mining farm in upstate New York, is expanding to a new location in South Carolina.\nThe new site formerly drew 80 megawatts of power, which Greenidge expects to be able to expand upon. ","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/110434\/greenidge-is-setting-up-a-new-bitcoin-mine-in-south-carolina","publishDate":"2021-07-02T14:02:17","id":3814,"type":null,"title":"Greenidge is setting up a new bitcoin mine in South Carolina","category":["Bitcoin"],"content":["On July 2, Greenidge Generation announced that it will be setting up a new bitcoin mining operation in Spartanburg, South Carolina. Per an announcement shared with The Block, the firm expects the mine to be operational by the end of 2021 or early 2022.","Greenidge is planning its new mine in partnership with LSC Communications, which, like Greenidge, has received investment from Atlas Holdings. Unlike its first bitcoin mine in Dresden, New York, Greenidge will not own this location, but will operate based on a 10-year lease.&nbsp;","A representative for Greenidge declined to specify how much the firm is paying for the lease in Spartanburg. As to whether the Dresden plant's expansion will continue, the representative answered: \"Our activities in Dresden, where we continue to supply power to the Grid and have a fully carbon neutral bitcoin mining operation, are not impacted by this announcement.\"&nbsp;","The LSC location is a retired printing plant, which previously drew 80 megawatts of power, a figure that Greenidge expects to be able to increase. As of March, the Dresden plant was using 15 megawatts to mine a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/57943\/a-power-plant-in-new-york-is-reportedly-mining-roughly-50000-in-bitcoin-each-day\" data-v-f87c67ca=\"\">reported $50,000 worth of bitcoin<\/a> daily.&nbsp;","Per the announcement, the LSC location already runs on electricity that is two-thirds carbon-zero — especially sourced from nuclear power. Greenidge plans to compensate for remaining emissions from the new mine, as it does with its New York mine, carbon offsets. Per a representative, the firm purchases offsets certified by either the American Carbon Registry (ACR), the Climate Action Reserve (CAR) and Verra, which ensure that \"any projects funded by Greenidge reduce emissions or increase sequestration of greenhouse gas in a manner that is real, permanent, and verifiable.\"","Greenidge has, however, been the subject of some controversy as the most public of a number of new bitcoin mining farms in upstate New York that <a href=\"https:\/\/www.theblockcrypto.com\/daily\/105260\/new-york-lawmaker-bitcoin-mining-q-a\" data-v-f87c67ca=\"\">state lawmakers targeted<\/a> earlier this year. When it <a href=\"https:\/\/www.theblockcrypto.com\/linked\/104940\/greenidge-bitcoin-mining-carbon-offsets\" data-v-f87c67ca=\"\">announced its carbon offsets program<\/a>, it was among an group of miners to do so.&nbsp;","Bitcoin miners have been expanding operations in the U.S. and elsewhere as China cracks down on its local industry. The <a href=\"https:\/\/www.theblockcrypto.com\/daily\/108098\/energy-politics-are-shaping-americas-growing-bitcoin-mining-sector-heres-how\" data-v-f87c67ca=\"\">regulatory expectations of U.S. authorities<\/a> have become more critical to mining firms, with <a href=\"https:\/\/www.theblockcrypto.com\/linked\/110335\/bitcoin-mining-council-sustainable-energy-survey\" data-v-f87c67ca=\"\">many North America-based miners banding together<\/a> to assemble new standards for energy mix reporting."],"hashtag":["MINING"]}