{"summary":"The US Senate heard testimony on stablecoins Tuesday morning. \nFollowing a rise in market cap and a recent report from leading U.S. financial regulators urging action, stablecoins have taken center stage in discussions of new laws touching on crypto.\nWhile legislators agreed on the need for new reporting requirements for asset backings, there was a clear party divide as to the core utility of stablecoins. ","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/127515\/senate-hearing-on-stablecoins-forecasts-new-regulations-but-from-where","publishDate":"2021-12-14T16:03:40","id":3817,"type":null,"title":"Senate hearing on stablecoins forecasts new regulations, but from where?","category":["Congress"],"content":["<span data-v-f87c67ca=\"\">The Senate is busy setting the stage for new regulations on stablecoins, but exactly what they will look like remains to be seen.<\/span>","<span data-v-f87c67ca=\"\">As Sen. Sherrod Brown, who chairs the Senate Banking Committee, told The Block: “It's not going to remain unregulated. Regardless of what we do.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Congress has been remarkably slow to pass much substantive crypto policy into law, regardless of its political persuasion.&nbsp;<\/span><span data-v-f87c67ca=\"\">Brown pointed to a range of regulators who are already laying the political groundwork to preside over stablecoins and their issuance even in the absence of statute — whether that’s the Securities and Exchange Commission, the Federal Reserve, the Treasury Department.<\/span>","<span data-v-f87c67ca=\"\">The Financial Stability Oversight Council is even aiming to get emergency authorities over stablecoins if congressional action is not forthcoming.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, Brown’s counterpart across the aisle, Sen. Pat Toomey, maintained in his opening comments that the allocation of authority over stablecoins “is a question that rests with Congress.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Indeed, the witnesses agreed on the need for a new regulatory regime. The Republican-selected witnesses, however, were adamantly opposed to the central proposition from the President’s Working Group’s <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/122890\/us-treasury-releases-long-awaited-report-on-stablecoin-risk-features-request-for-new-laws\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">report on stablecoins<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">That report advocated for Congress to limit stablecoin issuance to insured depository institutions — essentially, banks. Brown would not wholeheartedly endorse that proposal, but he told The Block “that's part of what we consider at the same time that we consider the Fed looking to do a central bank digital currency.”<\/span>","<span data-v-f87c67ca=\"\">Tuesday morning, Toomey <\/span><a href=\"https:\/\/www.banking.senate.gov\/newsroom\/minority\/toomey-outlines-stablecoin-principles-to-guide-future-legislation\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">released<\/span><\/a><span data-v-f87c67ca=\"\"> general principles for stablecoin regulation centered around the opposite notion: “Stablecoin issuance should not be limited to insured depository institutions.”<\/span>","<span data-v-f87c67ca=\"\">Instead, the developing Republican vision seems to be a multi-pronged regime for stablecoins operating under different business models. It was a vision that appealed to, for example, Dante Disparte. Disparte is the chief strategy officer and head of global policy for Circle, which issues USDC and is already working to get a banking license.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Along with attorney Jai Massari, Disparte endorsed a regulatory framework that would limit the types of assets a stablecoin issuer can hold and would set up a common system of reporting and redeeming those assets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The other two witnesses, Alexis Goldstein of the Open Markets Institute and Hilary Allen, a professor at American University’s law school, broadly denied the utility of stablecoins beyond their usage in speculative trading and decentralized finance.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Referring to her experience in finance in 2007 and 2008, Goldstein said: “I do think the secondary markets, especially DeFi, remind me of the over-the-counter derivatives market in the financial crisis.”<\/span>","<span data-v-f87c67ca=\"\">As <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/126866\/what-we-learned-at-congress-much-anticipated-summit-of-crypto-execs\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The Block reported last week<\/span><\/a> following<span data-v-f87c67ca=\"\"> a hearing before the House of Representatives, stablecoins seem to be at the top of Congress’ agenda when it comes to cryptocurrency, particularly the fiat-backed variety. This is likely because fiat-backed stablecoins both play a key role across crypto markets and because, with clear third parties to target, they are closer analogs to traditional financial regulations compared to areas like decentralized finance.<\/span>"],"hashtag":["SEC"]}