{"summary":"MoonPay’s clients can use the tool to offer users ways to buy NFTs without using cryptocurrency.\nThe move follows a recent announcement from Coinbase that its upcoming NFT platform will support card purchases.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/131912\/moonpay-rolls-out-credit-card-checkout-tool-for-nft-purchases","publishDate":"2022-01-27T00:00:06","id":3818,"type":null,"title":"MoonPay rolls out credit card checkout tool for NFT purchases","category":["NFTs"],"content":["MoonPay, the crypto unicorn fuelling NFT mania, is now offering a service that will allow punters to buy digital art and collectibles with cash.","MoonPay’s clients — which span big brands to NFT marketplaces — can now use a new checkout tool to give users the option of buying NFTs using debit and credit cards, as well as payments made through Apple Pay, Samsung Pay, Google Pay, SEPA, Faster Payments, wire transfers, open banking payments and ACH transfers.","Announced this morning, MoonPay’s launch comes shortly after Coinbase, the leading crypto exchange,&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/linked\/130596\/coinbase-mastercard-partnership-nft-cards\" data-v-f87c67ca=\"\">signed a partnership<\/a>&nbsp;with Mastercard that will allow users of its planned NFT marketplace to pay using cards.","Ordinarily, customers of platforms like OpenSea must load a blockchain wallet such as MetaMask with cryptocurrency to buy NFTs. MoonPay figures its new product, which is&nbsp;<a href=\"https:\/\/www.moonpay.com\/business\/nfts\" data-v-f87c67ca=\"\">already live<\/a>, could triple sales for NFT sellers while making the checkout process significantly faster.","“Right now, the NFT market is limited to the hundreds of millions of people who own cryptocurrency,” said MoonPay CEO Ivan Soto-Wright in a statement. “MoonPay’s NFT Checkout has just opened the door to billions more who own credit cards by making ownership both simple and fast.”","The new checkout tool supports NFT purchases across any blockchain, including Ethereum, Flow, Solana and Polygon. The link between NFTs and their corresponding blockchain is how buyers and sellers keep tabs on ownership. Once purchased with a card using MoonPay, NFTs will be sent directly to a customer’s crypto wallet.","When purchasing an NFT, customers typically incur charges known in crypto parlance as&nbsp;‘gas fees.’ Those fees will be baked into the cost of NFTs for users of the checkout tool, except for items linked to more efficient blockchains like Polygon, for which MoonPay will pay the gas fees itself.","The checkout option can be used either for primary or secondary NFT sales. The former involves ‘minting’ a piece from a new collection, which MoonPay takes care of on behalf of customers.","In terms of charges, MoonPay will levy a processing fee of 3.5% or $3.99 — whichever is larger — to the person buying NFTs.&nbsp;","It is already up and running as a payment option for&nbsp;<a href=\"https:\/\/www.wwf-nfa.com\/en\" data-v-f87c67ca=\"\">an NFT collection<\/a>&nbsp;created by the World Wildlife Fund. Several other partners are running pilot versions of the product — including NFL quarterback Tom Brady’s NFT platform Autograph.","Founded in 2019, as an ‘on-ramp’ for crypto purchases, MoonPay has quickly amassed more than 250 clients and is active across more than 160 countries. In October 2021, the startup&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/post\/124980\/moonpay-raise\" data-v-f87c67ca=\"\">closed a $555 million fundraise<\/a>&nbsp;that valued it at $3.4 billion.","Recently, MoonPay has taken an active role in NFT markets through&nbsp;<a href=\"https:\/\/www.google.com\/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=2ahUKEwj9kbC-9dD1AhWc_XMBHabkCgwQFnoECAsQAQ&amp;url=https%3A%2F%2Fwww.theblockcrypto.com%2Fpost%2F125483%2Fmoonpay-concierge-celebrities-nft&amp;usg=AOvVaw0i7uAAgbHl7hao5cAvnldJ\" data-v-f87c67ca=\"\">the launch of a concierge service<\/a>&nbsp;that helps the rich and famous purchase high-end crypto collectibles. The startup has brokered big-ticket buys for a host of celebrities including Paris Hilton, Jimmy Fallon and Snoop Dogg.","In an email sent to staff this morning announcing the launch of its new checkout tool, Soto-Wright wrote: “NFTs represent the future, not just of our company, but of the entire crypto community. NFTs enable digital ownership of collectibles in the form of art, fashion, music and beyond. The addressable market segment expands dramatically beyond cryptocurrencies as a new form of money.”"],"hashtag":["COINBASE"]}