{"summary":"One rather lucky miner only had a 1-in-1.36 million chance of mining a block at the current hash rate and difficulty.\nThe miner also secured the 0.1 BTC fee reward.","author":["Osato Avan-Nomayo","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/129894\/bitcoin-miner-beats-1-in-1-3-million-odds-to-mine-a-btc-block","publishDate":"2022-01-11T11:32:47","id":3819,"type":null,"title":"Bitcoin miner beats 1 in 1.3 million odds to mine a BTC block","category":["Bitcoin"],"content":["A solo bitcoin (BTC) miner with only 126 terahashes per second (TH\/s) of computing power has become the unlikely <a href=\"https:\/\/twitter.com\/ckpooldev\/status\/1480843321043865602\" data-v-f87c67ca=\"\">winner<\/a> of a block race on the Bitcoin network.","By successfully mining block <a href=\"https:\/\/www.btc.com\/btc\/block\/718124\" data-v-f87c67ca=\"\">718,124<\/a>, the lucky miner secured the 6.25 BTC block reward, which is about $260,000 at the current bitcoin price.","With only 126 TH\/s in computing power, the lucky miner controlled only 0.000073% of the total bitcoin hash rate, which is over 170 exahashes per second (EH\/s). 1 EH\/s is equal to 1 million TH\/s. As such, the miner only had a 1-in-1.36 million chance of ever successfully finding a block.","All of the major bitcoin mining pools <a href=\"https:\/\/btc.com\/stats\/pool\" data-v-f87c67ca=\"\">boast<\/a> hashing potential in the EH\/s range with the likes of AntPool and Poolin controlling 26.30 EH\/s and 22.19 EH\/s as of the time of writing. While it is not known how long the mining node has been on the network, if it was plugged today, it would have taken over 9,500 days for a miner with only 126 TH in hashing power to statistically win the block race based on the current hash rate and difficulty.","Describing the feat, The Block Research’s Wolfie Zhao <a href=\"https:\/\/twitter.com\/wolfiezhao\/status\/1480915319887704070?s=21\" data-v-f87c67ca=\"\">tweeted<\/a>:","The lucky miner in question is part of a solo mining pool operated by ckpool, which means 2% (0.125 BTC or $5,200) will go to the platform’s coffers. The miner will also earn the transaction fee reward for the block which is about 0.1 BTC, according to data from BTC.com.","The solo mining pool allows operations to use their own mining equipment to mine new blocks. But it provides a service for them that offers functions such as running the Bitcoin blockchain on their behalf. Hence, it rewards those mining with all of their rewards — minus a fee — rather than sharing all of the rewards proportionally between those using the pool.","The last time a ckpool miner won the block race was on December 2, 2021, at block height 712,217. According to BTC.com data, ckpool ranks number 15 on the list of bitcoin mining pools based on hash rate share with a total computing power of 410.96 petahash per second (PH\/s)","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">For the miner involved it's a once in a lifetime chance. Last time a miner this small solved a block on my pool was only a year ago though. It's usually larger miners that solve blocks statistically but there is no reason even the smallest miner can't solve one,\" tweeted Dr. Con Kolivas, an admin of ckpool.<\/span>","While major bitcoin miners <a href=\"https:\/\/www.theblockcrypto.com\/post\/128728\/bitcoin-mining-firm-marathon-order-nearly-900-million-machines\" data-v-f87c67ca=\"\">continue to increase<\/a> their hashing potential, Tuesday’s events show that it is still statistically possible for even smaller entities to win the mining race for a transaction block on the network."],"hashtag":[]}