{"summary":"SEC Chair Gary Gensler warned of multiple bad actors involved with cryptocurrency and said sector is &quot;rife with fraud and manipulation.&quot; ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262245\/crypto-has-more-than-one-fraudster-sec-chair-gary-gary-gensler-says","publishDate":"2023-11-08T13:51:34","id":382,"type":null,"title":"Crypto has more than one fraudster, SEC Chair Gary Gensler says","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Securities and Exchange Commission Chair Gary Gensler warned of multiple bad actors involved with cryptocurrency and reiterated that the sector faces widespread fraud.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"It's not just about one circumstance and one notorious fraudster, it's multiple notorious fraudsters,\" Gensler said on Wednesday during DC Fintech Week.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Gensler's comments come a week <\/span><span class=\"s3\" data-v-f87c67ca=\"\">after former FTX CEO Sam Bankman-Fried's criminal trial came to an end after he was found <a href=\"https:\/\/www.theblock.co\/post\/261240\/sam-bankman-fried-convicted-on-all-counts-report\" data-v-f87c67ca=\"\"><span class=\"s4\" data-v-f87c67ca=\"\">guilty<\/span><\/a> on all counts for defrauding investors. The SEC sued Bankman-Fried late last year and has since brought other charges against crypto firms and individuals.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">Gensler was separately asked about how his agency decides whether or not, in general, to pursue certain enforcement actions and how potential court involvement has an impact.<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">\"We have to think through our resources because unfortunately, there are a lot of complaints and not all of them are this way, but there are a lot of bad actors out there,\" Gensler said. \"We think about accountability and holding people accountable. We think about high impact cases. We do think about the gatekeepers and how we pursue enforcement actions around that as well.\"&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">The SEC brought 760 enforcement actions in fiscal year 2022 and doubled its Crypto Assets and Cyber Unit. A report on fiscal year 2023 numbers could come out as early as this month.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Gensler also spoke about the use case of cryptocurrency and investor protection on Wednesday.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"It also comes back to what is the darn use case of this stuff. We're merit neutral, but the investors need to understand, what is the use case for these 15 to 20,000 tokens each individually,\" Gensler said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Gensler has repeatedly <a href=\"https:\/\/www.theblock.co\/post\/259473\/secs-gensler-stays-true-to-form-uses-wednesday-speech-to-say-crypto-is-full-of-fraud-scams-bankruptcies-and-money-laundering\" data-v-f87c67ca=\"\"><span class=\"s5\" data-v-f87c67ca=\"\">warned<\/span><\/a> of the crypto industry's noncompliance and has called on crypto firms to register with the SEC. The chair has also said that <\/span><span class=\"s6\" data-v-f87c67ca=\"\">crypto firms are subject to the same rules as traditional finance.&nbsp;<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DC Fintech Week","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Alameda","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"Exchange Commission","content":"ORGANIZATION"},{"type":"fiscal year 2022","content":"DATE"}],"hashtag":["FTX","SEC"],"authors":["Sarah Wynn","The Block"]}