{"summary":"Most bitcoin mining stocks tracked by The Block increased on Tuesday. Core Scientific rose by over 69% after announcing a new injection of liquidity.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195133\/bitcoin-mining-report-core-scientific-rallies-alongside-other-industry-stocks","publishDate":"2022-12-14T17:44:04","id":3821,"type":null,"title":"Bitcoin mining report: Core Scientific rallies alongside other industry stocks","category":["CRYPTO INFRASTRUCTURE"],"content":["Most bitcoin mining stocks tracked by The Block saw price increases on Wednesday.","Bitcoin was trading at around $17,800 by market close, according to data from TradingView, after spiking to $18,300 around 1:30 pm EST.","","","<a href=\"https:\/\/www.tradingview.com\/chart\/?symbol=COINBASE%3ABTCUSD\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">BTCUSD Chart by TradingView<\/em><\/a>","Core Scientific's share price rose by over 69% after one of its core creditors, B.Riley, released an open letter to shareholders announcing that it will help the miner restructure its debt and provide it with liquidity.&nbsp;","The letter comes after weeks of fear about the future of Core Scientific.","On Oct. 26, the firm filed an SEC statement saying it would run out of cash by the end of the year, adding that it was seeking additional sources of equity or debt financing. Since then, the firm's common shares have declined 86%, and there has been ongoing fear of impending bankruptcy.","The shareholder letter states that \"bankruptcy is not necessary at all.\" B.Riley has proposed to provide the firm with <span class=\"xn-money\" data-v-f87c67ca=\"\">$72 million<\/span> in new, non-cash pay financing on \"favorable terms\" to provide more than two years of runway.&nbsp;","<em data-v-f87c67ca=\"\">Here's how crypto mining companies performed on Wednesday, Dec. 14:<\/em>","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$72 million","content":"MONEY"},{"type":"TradingView","content":"ORGANIZATION"},{"type":"69%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Oct. 26","content":"DATE"},{"type":"$18,300","content":"MONEY"},{"type":"86%","content":"PERCENT"},{"type":"$17,800","content":"MONEY"},{"type":"Dec. 14","content":"DATE"}],"hashtag":["DEBT FINANCING","MINING COMPANIES"],"authors":["Sam Venis","The Block"]}