{"summary":"Blockchain.com, a crypto services provider, has added a former aide to President Barack Obama to its board of directors.\nJim Messina, long known as a powerful figure in Washington, D.C., is set to help the firm navigate the Biden administration’s nascent approach to crypto regulation.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/97953\/blockchain-dot-com-jim-messina-board-biden","publishDate":"2021-03-10T15:48:06","id":3821,"type":null,"title":"Crypto startup Blockchain.com adds former Obama aide to its board","category":["Startups"],"content":["A key aide to President Barack Obama and famed political fixer now wants to shape the future of crypto regulation.","Jim Messina joined the board of Blockchain.com this week to help the crypto wallet services firm navigate coming standards from the Biden administration.","Messina served as deputy chief of staff during the Obama Administration and headed the president's 2012 reelection campaign. After his time in the White House, he formed his own consulting firm, The Messina Group, which has since worked with the British Conservative Party and the government of Italy.","Now, Messina's been hired by crypto wallet provider Blockchain.com. Messina brings a wealth of career influence to the startup since his contacts include President Biden, with whom he worked during the Obama presidency when Biden was vice president. Messina was integral to Obama's transition efforts, meaning he's interacted with the agencies now at the forefront of the U.S. government's crypto efforts.","He's been dubbed <a href=\"https:\/\/www.gq.com\/gallery\/50-most-powerful-people-in-washington-dc\" data-v-f87c67ca=\"\">one<\/a> of the most <a href=\"https:\/\/theintercept.com\/2014\/12\/23\/how-jim-messina-moved-from-idaho-to-2-million-dollar-washington-estate\/\" data-v-f87c67ca=\"\">powerful<\/a> <a href=\"https:\/\/www.independent.co.uk\/news\/people\/profiles\/jim-messina-most-powerful-person-washington-you-ve-never-heard-8278039.html\" data-v-f87c67ca=\"\">men<\/a> in Washington D.C. by multiple publications.&nbsp;","The developments follow Blockchain.com's hire of another member of the Messina Group, Lane Kasselman. Kasselman worked on Hillary Clinton's campaign before joining the Messina Group as a partner. He currently works as Blockchain.com's chief business officer.&nbsp;","Messina has said he plans to focus his efforts on the tech sector in this political era, penning a piece on the importance of the Biden administration's approach to regulating the gig economy for <a href=\"https:\/\/techcrunch.com\/2021\/01\/20\/joe-bidens-new-gig\/\" data-v-f87c67ca=\"\">TechCrunch<\/a>.&nbsp;","\"I really believe in my world the most interesting question of the next decade is: has regulation helped or stifled innovation?\" he said in an interview with The Block. Crypto, he says, lies at the center of that question.","Part of answering the question, Messina said, involves listening before he goes to work on individual issues in his new role. Messina said he hopes regulators continue to take that same approach since the right regulation — the kind that promotes innovation and protects consumers — will take time to develop.&nbsp;","The patchwork nature of crypto regulation, both at the state and federal level, is one such focus. Part of the burden on the Biden administration is figuring out who has what job, according to Messina.","\"When I was in the White House, part of what you realize is you really need a strong White House or strong theory of the case on some of these things on who's actually going to lead because you have so many agencies who have pieces of some of these things,\" he said.","Legislation in this area is coming, though, according to Messina. There's been meaningful progress in consensus around the need for unified regulation. He cited how Congressional members from both parties are growing increasingly focused on crypto and digital assets.","\"The only two or three things in Washington right now that are nonpartisan are free beer and that innovation and crypto are interesting,\" he said.&nbsp;"],"hashtag":[]}