{"summary":"Lightning Network data analytics provider Amboss has launched Hydro — an auto-sourcing liquidity solution for the Bitcoin Layer 2.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/251079\/amboss-hydro-automated-liquidity-bitcoin-lightning-network-ambucks","publishDate":"2023-09-14T12:01:02","id":3822,"type":null,"title":"Amboss launches Hydro to quench liquidity demand on Lightning Network","category":["LAYER 2S AND SCALING"],"content":["<span data-v-f87c67ca=\"\">Lightning Network data analytics provider Amboss has launched Hydro — a subscription-based auto-sourcing liquidity solution for the <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.64%\n    <\/span><\/a> <!----><\/span><\/span> Layer 2.<\/span>","Hydro aims to enable businesses to receive payments over Lightning without the complexities of channel management or requiring centralized custodial intermediaries, according to a statement.","The solution allows users to automatically access liquidity from decentralized sources to their Lightning node on demand, with fees from 3.5% for the initial setup to as low as 0.003% for payments, Amboss stated.","\"Hydro is a game changer for businesses to get the benefits of the Lightning Network without trusted custodians, intermediaries or the headache of channel management,\" Amboss co-founder and CEO Jesse Shrader said. \"As the Lightning Network welcomes global participation, Hydro simplifies real-time payment infrastructure to bootstrap global circular economies like we’ve seen in Costa Rica's ‘<a href=\"https:\/\/bitcoinist.com\/costa-rica-bitcoin-jungle-is-building\/\" data-v-f87c67ca=\"\">Bitcoin Jungle.'<\/a>\"","Hydro is powered by Magma, Amboss's marketplace for buying and selling Lightning channels, sourcing liquidity from the open market. Sellers can earn a bitcoin yield to provide liquidity on Magma, opening Lightning channels to online stores, wallets and other Lightning users without the custodial risk of centralized yield-generating platforms.","Hydro works by purchasing Lightning channel leases from those sellers that meet its quality criteria for the lowest price. Users can customize their Lightning node payment capacity and automatically purchase channels using Amboss's prepaid credits \"ambucks.\"","Businesses can also set target inbound liquidity — the total value of bitcoin payments it can receive — enabling tailored, cost-effective channel management without the opportunity cost of locking up significant amounts of their own capital or the technical expertise required for manual channel management.","The Lightning Network is a second-layer solution of payment channels built on top of the Bitcoin blockchain, designed to enable fast and low-cost transactions.&nbsp;","Businesses have previously faced challenges in sourcing liquidity and managing Lightning channels, hindering enterprise adoption and fueling use of centralized custodial solutions.","Overall Lightning Network adoption has continued to grow over the past year, however, with a current total capacity of nearly 5,000 bitcoin ($129 million), according to The Block's data dashboard. Although, this is down 12.5% from a peak of 5,640 bitcoin in July.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/lightning-networks-capacity-daily\/embed\" title=\"Lightning Network's Capacity\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","In July, Shrader told The Block in an interview that <a href=\"https:\/\/www.theblock.co\/post\/235056\/blackrock-takes-giant-leap-toward-spot-bitcoin-etf-with-sec-filing\" data-v-f87c67ca=\"\">BlackRock's proposed spot bitcoin ETF<\/a> misses the opportunity to deploy those funds on the Lighting Network and earn non-custodial yield by providing payments infrastructure, <a href=\"https:\/\/www.theblock.co\/post\/240048\/blackrock-disrupt-visa-mastercard-lightning-network-amboss\" data-v-f87c67ca=\"\">disrupting payment processors like Visa, Mastercard and American Express<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jesse Shrader","content":"PERSON"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"3.5%","content":"PERCENT"},{"type":"Costa Rica","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"July","content":"DATE"},{"type":"12.5%","content":"PERCENT"},{"type":"Lightning","content":"LOCATION"},{"type":"Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC","content":"ORGANIZATION"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"Magma","content":"LOCATION"},{"type":"Shrader","content":"PERSON"},{"type":"$129 million","content":"MONEY"},{"type":"American Express","content":"ORGANIZATION"},{"type":"Amboss","content":"ORGANIZATION"},{"type":"Hydro","content":"ORGANIZATION"},{"type":"0.003%","content":"PERCENT"},{"type":"+0.64%","content":"PERCENT"}],"hashtag":["BITCOIN"],"authors":["James Hunt","The Block"]}