{"summary":"Luno has been forced to amend a controversial advertising campaign in the United Kingdom capital after regulators stepped in.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/106078\/crypto-luno-amends-london-ads","publishDate":"2021-05-26T04:50:05","id":3823,"type":null,"title":"Crypto app Luno forced to amend Bitcoin ads in London","category":["REGULATION"],"content":["Regulators in the U.K. have forced Luno, a crypto exchange based in London, to amend its bitcoin-focused advertising campaign.","The ads started appearing across the London Underground and on the side of buses in February. They featured a cartoon image of a bitcoin with the message, “If you’re seeing bitcoin on the Underground, it’s time to buy.”","On May 26, the Advertising Standards Authority, the U.K.'s advertising watchdog, <a href=\"https:\/\/www.asa.org.uk\/rulings\/luno-money-ltd-g21-1101558-luno-pte-ltd.html\" data-v-f87c67ca=\"\">published a ruling<\/a> on Luno’s ads. It found that the placement of the ads meant they were untargeted and “likely to have been seen by consumers who did not have extensive financial knowledge and experience of bitcoin.”","The regulator also stated that bitcoin is a complex investment that is unregulated in the U.K. and prone to high levels of volatility.","“We concluded that the ad irresponsibly suggested that engaging in bitcoin investment through Luno was straightforward and easy, particularly given that the audience it addressed, the general public, were likely to be inexperienced in their understanding of cryptocurrencies, and was therefore in breach of the Code,” the ASA stated.","In consequence, the watchdog ruled that the ads must not appear again in their current form. Further, Luno must ensure that its next set of ads clarify that the value of bitcoin is variable, that neither Luno nor bitcoin is regulated, and that it does not seek to exploit consumers’ lack of experience by oversimplifying the process of investing in cryptocurrency.","“While we welcomed Luno’s assurance that their future ads would feature risk warnings to consumers, at the time the ad appeared it had not featured any risk warning making sufficiently clear to consumers that the value of bitcoin could go down as well as up, or that the bitcoin market was unregulated in the U.K. We therefore concluded that the ad was misleading,” said the ASA in its statement.","Luno was <a href=\"https:\/\/www.theblockcrypto.com\/linked\/77244\/digital-currency-group-acquires-luno-crypto-exchange\" data-v-f87c67ca=\"\">acquired by Digital Currency Group<\/a> (DCG) in September, 2020, for an undisclosed sum. At the time DCG said it would make a “significant financial commitment” to the exchange.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DCG","content":"ORGANIZATION"},{"type":"May 26","content":"DATE"},{"type":"Advertising Standards Authority","content":"ORGANIZATION"},{"type":"U.K","content":"LOCATION"},{"type":"September, 2020","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"London","content":"LOCATION"},{"type":"February","content":"DATE"},{"type":"Digital Currency Group<\/a> (DCG","content":"ORGANIZATION"},{"type":"ASA","content":"ORGANIZATION"},{"type":"U.K.","content":"LOCATION"}],"hashtag":["BITCOIN"],"authors":["Ryan Weeks","The Block"]}