{"summary":"German art forger Wolfgang Beltracchi, who has served prison time, has entered the world of NFTs. \nBeltracchi is recreating the most expensive painting in the world, Salvator Mundi, in the form of 4,608 NFTs on Ethereum.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/119834\/notorious-art-forger-wolfgang-beltracchi-nft-ethereum","publishDate":"2021-10-08T03:00:22","id":3824,"type":null,"title":"Notorious art forger Wolfgang Beltracchi enters the NFT world","category":["NFTs"],"content":["Wolfgang Beltracchi, one of the most infamous art forgers of all time, has entered the unforgeable world of non-fungible tokens (NFTs).","Beltracchi has set up a new project, dubbed \"<a href=\"https:\/\/www.greats.art\/\" data-v-f87c67ca=\"\">The Greats<\/a>,\" a collection of 4,608 NFTs on the Ethereum blockchain.","The artworks are re-creations of <a href=\"https:\/\/en.wikipedia.org\/wiki\/Salvator_Mundi_(Leonardo)contro\" data-v-f87c67ca=\"\">Salvator Mundi<\/a>, the world's most expensive painting and one of the most controversial ones. The painting, believed to have been made by Leonardo da Vinci (circa 1490–1500), was sold for a record price of $450 million at Christie's 2017 auction. It was sold to a proxy for Mohammed bin Salman, Saudi Arabia's Crown Prince.","Beltracchi has re-created Salvator Mundi based on seven different eras in art history — High Renaissance (c. 1400–1550, began with the works of Leonardo da Vinci); Post-Impressionism (c. 1885–1910, Vincent van Gogh); Surrealism (c. 1917–1950, Salvador Dali); Cubism (c. 1907-1914, Pablo Picasso); Pop Art (c. 1950-1970; Roy Lichtenstein); Factory Art (c. 1962-1984, Andy Warhol) and Beltracchi — according to the Greats website.","The forger has remade famous paintings throughout his career of over three decades, but in the form of forgery, meaning he refurbished works of famous artists and sold them in their names as original paintings when they were fake.","Beltracchi conned the art world out of an estimated €35 million between 1980 and 2011. He was <a href=\"https:\/\/en.wikipedia.org\/wiki\/Wolfgang_Beltracchi\" data-v-f87c67ca=\"\">sentenced<\/a> to six years in jail in 2011 by German authorities but was freed in early 2015, having served just over three years in prison. His wife Helene was also sentenced as an accomplice to four years in jail.","Since his arrest, art museums, galleries, and auction houses have barred Beltracchi from exhibiting and selling his art. The 70-year old artist has now turned to the NFT space.","\"The NFT market offers artists a platform to market themselves independently and makes them independent from traditional art market mechanisms,\" Beltracchi said in a statement shared with The Block on Friday.","As part of his NFT collection, Beltracchi has redesigned Salvator Mundi as 4,608 copies in his style and the styles of the six old masters listed above.","When asked why he chose Salvator Mundi for his NFT collection, a spokesperson for Beltracchi told The Block: \"Beltracchi is the only person with the necessary skills to implement it. He has managed to fool the 'art experts' hundreds of times with his re-creations of famous painters' work.\"","But why would someone buy NFTs of the notorious art forger? Because \"he is a highly skilled artist,\" and \"the art looks fantastic,\" said the spokesperson.","","","Not all of the 4,608 NFTs are currently on display on The Greats website. All pieces will only be revealed when the sale starts in \"8-10 days,\" said the spokesperson.","The Greats will be making a \"hidden sale,\" they said. That means buyers won't know what NFT they are minting. To ensure the highest level of arbitrariness, The Greats says it is using Chainlink's Verifiable Random Function (VRF), a verifiable source of randomness designed for smart contracts. The purpose of using the Chainlink VRF is to ensure that NFTs don't get \"exploited\" by parties such as a miner, said the spokesperson.","The project further said that it will also integrate The Graph's tool for live infographics on its platform. Users can query live sales data, getting an experience of an actual auction, according to the spokesperson.","\"This is what is possible today with digital art,\" they said. \"What you see on the canvas is not the only important thing. Everything around it, such as the sales mechanism, the record of each owner and sale, the technical implementation, are also part of the art.\""],"hashtag":["ETHEREUM"]}