{"summary":"The UK Gambling Commission cautioned consumers that NFT fantasy soccer platform Sorare isn’t licensed by the gambling regulator.\nThe commission is making inquiries into whether Sorare offers services that fall under its purview.\nSorare says it has been assured by legal experts that it does not offer any forms of regulated gambling.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/120096\/uk-gambling-regulator-is-looking-into-nft-fantasy-soccer-league-sorare","publishDate":"2021-10-11T14:02:59","id":3825,"type":null,"title":"UK gambling regulator is looking into NFT fantasy soccer league Sorare","category":["Regulation"],"content":["Sorare, a fantasy soccer platform dealing in non-fungible tokens (NFTs), is facing scrutiny from the United Kingdom's gambling watchdog.&nbsp;","A consumer information <a href=\"https:\/\/www.gamblingcommission.gov.uk\/news\/article\/consumer-information-notice-sorare-com\" data-v-f87c67ca=\"\">notice<\/a> from the UK Gambling Commission clarified that the platform is not licensed by the regulator.","\"This means that any activity completed on the site by consumers in Great Britain is outside of the gambling regulations that a licensed operator should comply with,\" said the notice.&nbsp;","The regulator also revealed that it is currently \"carrying out enquiries\" into the firm to determine whether its services fall under the Gambling Commission's purview.&nbsp;","\"The Gambling Commission is currently carrying out enquiries into the company to establish whether Sorare.com requires an operating licence or whether the services it provides do not constitute gambling,\" said the notice.","Sorare has grown at a fast clip with the explosion of the NFT space. By 2021, it said it was already profitable. In 2020, the firm raised $4 million in <a href=\"https:\/\/www.theblockcrypto.com\/linked\/71863\/ethereum-based-gaming-startup-sorare-raises-4-million-in-seed-funding\" data-v-f87c67ca=\"\">seed funding<\/a> before going on to raise a $5o million <a href=\"https:\/\/www.theblockcrypto.com\/post\/96034\/nft-marketplace-sorare-raises-50-million-series-a-led-benchmark\" data-v-f87c67ca=\"\">series A<\/a> and a <a href=\"https:\/\/www.theblockcrypto.com\/post\/118094\/fantasy-soccer-nft-sorare-scores-680-million-raise-softbank\" data-v-f87c67ca=\"\">$680 million series B round<\/a> led by SoftBank in 2021.&nbsp;","The platform enables soccer fans to trade NFT cards of popular players powered by the Ethereum blockchain. It operates much like other fantasy sports websites. More than 120 football clubs have launched player NFTs on the platform.","While the platform does not have any clear gambling functionalities, the price of player NFTs can be driven by a team's performance. In that way, users can engage in speculation based on game performance.","It is unclear if this amounts to gambling in the eyes of the Gambling Commission. In 2017, the Gambling Commission <a href=\"https:\/\/www.gamblingcommission.gov.uk\/news\/article\/gambling-commission-warns-fantasy-football-organisers-to-not-get-caught-out\" data-v-f87c67ca=\"\">warned<\/a> fantasy soccer organizers that they could require a pool betting license from the regulator. In this case, private pools and pools not run in the course of a business were exempt. According to the commission's website, that notice was updated on Feb. 8, 2021, though it isn't clear what changes were made to the content.&nbsp;","Sorare told The Block in a statement that due to the nascent nature of the technology, regulatory questions are expected. It is \"very confident\" that it does not offer any forms of regulated gambling, said Sorare.","\"This has been confirmed by expert legal opinions at every stage since the company was founded, including during a number of fundraising rounds,\" a representative for Sorare told The Block in a statement. \"We will always engage and have an open dialogue with authorities who reach out to us to learn more about our game.\""],"hashtag":["SORARE"]}