{"summary":"The Sandbox has regained control of its Instagram account following a hack in the early hours of Thursday morning, the company said in a blog post.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/161761\/the-sandbox-instagram-back-online-following-hack","publishDate":"2022-08-05T12:25:25","id":3825,"type":null,"title":"The Sandbox Instagram back online following hack","category":["GAMING AND METAVERSE"],"content":["The Sandbox has regained control of its Instagram account following a hack in the early hours of Thursday morning, the company said <a href=\"https:\/\/sandboxgame.medium.com\/update-on-the-instagram-breach-2f1fe5ffeadb\" data-v-f87c67ca=\"\">in a blog post<\/a>.","Hackers accessed the metaverse platform's official account, which has 184,000 followers, and posted a phishing link. It is not yet clear how they were able to gain control of the account. It was promptly deactivated once the breach was discovered and is now back online.","The Sandbox told The Block that to their knowledge only one user was scammed and that they were working with him to \"solve his situation.\"","\"The trust of our community is paramount for us and we are taking steps to further secure our social accounts. We are currently reviewing our security logs and internal processes to reinforce security across all of our platforms,\" the company said.","The <a href=\"https:\/\/etherscan.io\/address\/0xd6daa97d455d67e1f786429bd130db56de2ed479#tokentxnsErc721\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">hackers’ wallet<\/a> shows it holds four NFTs transferred from two wallets following the Instagram breach. Among them is one World of Women Galaxy NFT.","NFT phishing scams are common on social media. In April, the <a href=\"https:\/\/www.theblock.co\/post\/143328\/bored-ape-instagram-account-hacked-nfts-worth-2-8-million-stolen\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">official Instagram of BAYC was attacked<\/a> and hackers made off with $2.8 million in NFTs.","In other cases, hackers have approached holders via social media for private trades. After agreeing on a price, they convince their target to link their wallet to a scam trading site that then relieves them of its contents. In May, <a href=\"https:\/\/www.theblock.co\/post\/148750\/hackers-steal-29-moonbirds-valued-at-1-5-million-in-nft-phishing-attack\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">29 Moonbirds worth $1.5 million were taken<\/a> in this way.","Blue tick accounts are a particularly attractive&nbsp; for hackers in the hopes that the appearance of being official will trick more people.","“This event serves as a reminder that we must never let our guard down. Because of our profile, hackers and phishers will constantly try to test us. However hard they try, we’ll work even harder to keep your accounts — and ours — secure,” said The Sandbox.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1.5 million","content":"MONEY"},{"type":"morning","content":"TIME"},{"type":"Thursday","content":"DATE"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$2.8 million","content":"MONEY"},{"type":"World of Women Galaxy NFT","content":"ORGANIZATION"},{"type":"April","content":"DATE"}],"hashtag":["THE SANDBOX"],"authors":["Callan Quinn","The Block"]}