{"summary":"Blockchain data provider Arkham Intelligence appears to have made some customer emails publicly available through decodable referral links that were being shared by users in the runup to a token airdrop. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/238764\/arkham-referral-links-appear-to-reveal-user-email-addresses","publishDate":"2023-07-10T16:24:23","id":383,"type":null,"title":"Arkham referral links appear to reveal user email addresses","category":["COMPANIES"],"content":["Blockchain data provider <a href=\"https:\/\/www.arkhamintelligence.com\/\" data-v-f87c67ca=\"\">Arkham Intelligence<\/a> appears to have made some customer emails publicly available through decodable referral links that were being shared by users in the runup to a token airdrop.&nbsp;","Arkham, which announced an on-chain intelligence <a href=\"https:\/\/twitter.com\/ArkhamIntel\/status\/1678339355314900992\" data-v-f87c67ca=\"\">exchange<\/a> on Monday, will see Binance conduct the <a href=\"https:\/\/www.theblock.co\/post\/238596\/binance-arkham-token\" data-v-f87c67ca=\"\">public token sale<\/a> of the new token dubbed ARKM. The company tweeted out instructions for an <a href=\"https:\/\/twitter.com\/ArkhamIntel\/status\/1678422907821887488\" data-v-f87c67ca=\"\">airdrop<\/a>, which is due to go live on July 18.","Some users who shared referral codes for the program to garner more points quickly found out that sleuths were able to decode their email address from the links. Arkham's growth has been fueled in part by referring links because it's typically been a closed platform.","\"The referral program is still live and according to previous mail, the points collected will directly be converted to $ARKM tokens and will be airdropped to your wallet,\" one user on Twitter <a href=\"https:\/\/twitter.com\/GlitzzInfo9ja\/status\/1678447462615326733\" data-v-f87c67ca=\"\">wrote<\/a>, providing a link containing a referral code that can be easily decoded into an email address with online <a href=\"https:\/\/www.base64decode.org\/\" data-v-f87c67ca=\"\">tools<\/a>.&nbsp;&nbsp;","Crypto Twitter was quick to discover the issue, with some users going on doxing sprees, taking screenshots and <a href=\"https:\/\/twitter.com\/m4gicpotato\/status\/1678462923319177217\" data-v-f87c67ca=\"\">posting emails<\/a> associated with the decoded links. Email addresses are a valuable piece of information for hackers that can be used in phishing attacks, and the issue could possibly be used to identity previously anonymous crypto users.","Arkham Intelligence did not immediately respond to a request for comment from The Block. In January, the company reportedly told one user on Twitter that it was <a href=\"https:\/\/twitter.com\/Tree_of_Alpha\/status\/1678475809344856086\" data-v-f87c67ca=\"\">aware of the issue<\/a>.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Arkham Intelligence","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"$ARKM","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"July 18","content":"DATE"},{"type":"January","content":"DATE"}],"hashtag":["DATA PROVIDERS"],"authors":["MK Manoylov","The Block"]}