{"summary":"Sam Bankman-Fried media appearances. Could more job cuts be on the way? Seoul prosecutors are coming for Terraform Labs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/191975\/here-are-the-biggest-stories-in-crypto-to-look-out-for-this-coming-week","publishDate":"2022-12-04T08:12:53","id":3830,"type":null,"title":"Here are the biggest stories in crypto to look out for this coming week","category":["COMPANIES"],"content":["A crazy November has finally come to an end, but the fallout from the collapse of FTX will continue into the festive season and beyond. Legal action is continuing from the collapse of Terra in May, or about a million years ago in crypto-time, and will likely grab headlines for years to come as prosectors in South Korea try to untangle what happened.","FTX hasn't quite hit that stage yet. Sam Bankman-Fried continues his bizarre media offensive, with more appearances scheduled for this week. Still, some of the interviewers people would most like to see him up against are struggling to get him to commit.","Here are the main stories and events to keep an eye on in the coming week.&nbsp;","Disgraced FTX founder Sam Bankman-Fried has more interviews set up for the coming week as he makes the media rounds apologizing for his company's failure while claiming to know nothing about the internal mismanagement that caused it.","It’s not quite clear what’s driving him to seek out the spotlight, but it doesn’t appear to be letting up, much to the chagrin of many former FTX customers, who'd rather see him talking in court instead of on another Twitter space.","Nevertheless, he is scheduled to appear in an episode of The Scoop on Monday, a Rekt Twitter space on Tuesday as well as another Twitter space by Unusual Whales the following Monday.","He’s also been invited by U.S. House Financial Services Committee Chair Maxine Waters to a hearing the following week, on Nov 13. It’s not clear if he’s going to show.","It may appear Bankman-Fried is willing to talk with anyone, but some people are not having much luck getting him to agree to a date. UpOnly co-host Cobie has been trying to get him on the show. Bankman-Fried has agreed, but refused to do it this week and said “it only makes sense to do it in a week or so.”","Last week, crypto lender BlockFi filed for Chapter 11 bankruptcy protection. It claimed more than 100,000 creditors, including Ankura Trust, FTX US and the Securities and Exchange Commission, with between $1 billion and $10 billion in both assets and liabilities, according to its petition.","Its first day Chapter 11 hearing took place on Nov. 29, but don't expect further updates soon: The next hearing is currently scheduled for Jan. 9, 2023.","Crypto exchange <a href=\"https:\/\/www.theblock.co\/post\/191969\/bybit-reducing-workforce-bear-market\" data-v-f87c67ca=\"\">Bybit<\/a> is reducing its workforce as a result of the “deepening bear market,” it announced on Sunday. It will downsize across the board.","It’s not alone. <a href=\"https:\/\/www.theblock.co\/post\/191023\/kraken-cuts-30-of-staff-to-weather-crypto-winter\" data-v-f87c67ca=\"\">Kraken<\/a> cut 1,100 staff, or 30% of its workforce due to current market conditions on Nov. 30. Coinbase laid off more than 60 employees from its human resource department earlier in the month, while <a href=\"https:\/\/www.theblock.co\/post\/188357\/solana-based-metaplex-lays-off-staff-following-ftx-collapse\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Metaplex<\/a> also announced layoffs in the wake of the FTX collapse.","Amid fears that the bear market could worsen, more firms may follow suit.","Last week the Seoul Southern District Court <a href=\"https:\/\/www.theblock.co\/post\/191842\/seoul-court-rejects-prosecutions-move-to-detain-terraform-labs-execs-yonhap\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">dismissed<\/a> prosecutors’ warrants for the arrest of several leading Terraform Labs figures, including co-founder and current CEO of Chai Corp. Daniel Shin. This doesn’t mean they’re off the hook, only that they won’t remain in custody during proceedings.","Expect more developments from Seoul as investigators attempt to understand how Terra’s collapse in May wiped $50 billion in value from the ecosystem and who is responsible.","The location of Terra’s other founder, Do Kwon, remains a mystery.","This isn’t the only crypto case making its way through South Korean courts. Last week, web3 gaming company Wemade filed an injunction to prevent a planned delisting of its Wemix token from local exchanges Upbit, Bithumb, Coinone and Korbit.","It's part of an ongoing battle between Wemade and South Korean crypto exchange organization DAXA, which has accused the company of circulating inaccurate information about their token.","We should find out the court's decision on Dec. 7.&nbsp;","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nov. 29","content":"DATE"},{"type":"Cobie","content":"PERSON"},{"type":"South Korea","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Kwon","content":"PERSON"},{"type":"Nov 13","content":"DATE"},{"type":"Chai Corp","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"$50 billion","content":"MONEY"},{"type":"November","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"Dec. 7","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Nov. 30","content":"DATE"},{"type":"Daniel Shin","content":"PERSON"},{"type":"Sunday","content":"DATE"},{"type":"Bithumb","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Jan. 9, 2023","content":"DATE"},{"type":"U.S. House Financial Services Committee Chair Maxine Waters","content":"ORGANIZATION"},{"type":"$10 billion","content":"MONEY"},{"type":"Wemade and South Korean crypto exchange organization DAXA","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Seoul Southern District Court","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"Seoul","content":"LOCATION"}],"hashtag":["COINBASE","CRIME","SAM BANKMAN-FRIED"],"authors":["Callan Quinn","The Block"]}