{"summary":"Coinbase is set to acquired crypto infrastructure provider Bison Trails for an undisclosed sum. \nThe acquisition — which is said to be one of Coinbase’s largest — will set the foundation for the firm’s push into infrastructure-as-a-service\nIn a recent episode of The Scoop, Coinbase chief product officer, Surojit Chatterjee and Bison Trails founder Joe Lallouz break down the deal’s significance ","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/91684\/coinbase-aquisition-bison-trails-infrastucture","publishDate":"2021-01-19T15:00:04","id":3832,"type":null,"title":"Coinbase expands into infrastucture-as a service by acquiring Bison Trails","category":["Layer 1s"],"content":["Coinbase is acquiring crypto infrastructure provider Bison Trails in a move that the San Francisco-based exchange-operator says will help it expand into an unsexy but growing corner of the crypto market: infrastructure as a service.","Coinbase did not respond to questions pertaining to the financials of the deal, whose transaction value has been speculated to be in the same vicinity of the acquisitions of <a href=\"https:\/\/www.theblockcrypto.com\/post\/66479\/coinbase-tagomi-acquisition\" data-v-f87c67ca=\"\">Tagomi<\/a> and Earn — each of which have been reported to come in around $100 million. But the firm said that Bison Trails will serve as the foundation of its infrastructure as a service business operation.&nbsp;","The announcement comes just weeks after Coinbase announced the acquisition of Routefire, an execution services startup. Meanwhile, Coinbase's competitors are also snapping up companies. NYDIG, which provides institutional trading services, acquired data provider Digital Assets Data, while Gemini acquired Blockrize in a bid to launch a credit card product.&nbsp;","Bison Trails — which raised $25 million from investors including Coinbase in November 2019 — already powers Coinbase's staking service. According to the exchange operator's <a href=\"https:\/\/blog.coinbase.com\/welcome-surojit-chatterjee-coinbases-chief-product-officer-c611d156610a\" data-v-f87c67ca=\"\">chief product officer<\/a> Surojit Chatterjee, the tie-up could help the exchange monetize some of its existing internal systems.","\"We've been thinking about for a while how do we make it easier for participants of the crypto economy develop faster, develop better, how do we get more builders, entrepreneurs, how do we unleash more innovation in the space,\" he said. \"Over time, we will extend additional infrastructure and API services, many of which have been developed to power our internal Coinbase product.\"","In a sense, Coinbase has already been doing this. The firm originally built out its custody infrastructure to store the crypto held by its retail clientele. Then it made the service available to other institutions. Elsewhere, the firm open-sourced a project called <a href=\"https:\/\/blog.coinbase.com\/introducing-rosetta-build-once-integrate-your-blockchain-everywhere-9b97d284f5b9\" data-v-f87c67ca=\"\">Rosetta<\/a> — a set of internal tools it used to integrate blockchains onto its platform.&nbsp;","Coinbase said its approach is analogous to how Amazon spun out its internal cloud operations — Amazon Web Services — as a business aimed at simplifying the complexities of running internet infrastructure. Chatterjee said that the firm could explore new external API services spanning several segments including security, identity, payments.&nbsp;","Initially, however, Bison Trails will continue to operate as a stand-alone company and offer its existing products, which include staking and node services, to clients including exchanges, brokers, and custodians. Coinbase is one of its key clients.&nbsp;","\"Our plan is to continue to build the product suite, the infrastructure platform that we've been building and continue to expand our impact in the blockchain space and make it easier for folks to participate in blockchains,\" Bison Trails CEO Joe Lallouz told The Block.","The deal's announcement comes ahead of Coinbase's much-talked-about public markets debut. The firm <a href=\"https:\/\/www.theblockcrypto.com\/linked\/88293\/coinbase-s-1-potential-ipo-filing\" data-v-f87c67ca=\"\">filed a confidential S-1<\/a> for an initial public offering in December, but has not commented publicly on such a transaction. It's not clear if the acquisition deal will close before an IPO.&nbsp;","In any case, observers of the market say that this could be the first of many transactions for Coinbase this year as an IPO gives companies a more liquid currency for acquisitions.","\"This is exciting,\" said Casper Johansen, CEO of Spartan Group, a crypto-focused financial advisory firm. \"First domino to fall and allow Coinbase to expand in a thoughtful manner in its product offering and capabilities.\"","<iframe src=\"https:\/\/playlist.megaphone.fm?e=BLOCK8843114176\" width=\"100%\" height=\"200\" frameborder=\"0\" scrolling=\"no\" data-v-f87c67ca=\"\"><\/iframe>"],"hashtag":["COINBASE"]}