{"summary":"SubQuery Network, a data indexing protocol for the Polkadot ecosystem, has raised $9 million.\nSubQuery plans to decentralize its network and launch a token by early next year, CEO Sam Zou told The Block.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/116915\/subquery-indexing-protocol-polkadot-funding-saft","publishDate":"2021-09-08T04:21:20","id":3833,"type":null,"title":"SubQuery, indexing protocol for Polkadot ecosystem, raises $9 million","category":["Venture Capital"],"content":["SubQuery Network, a data indexing protocol for the Polkadot and Kusama ecosystems, has raised $9 million in a new funding round.","This was a Series A round and was secured via a simple agreement for future tokens (SAFT) sale, SubQuery CEO Sam Zou told The Block. Digital Currency Group, Arrington Capital, and Stratos Technologies co-led the round, with Hypersphere Ventures, NGC Ventures, Wintermute, and Skynet Trading also participating.","With fresh capital at hand, SubQuery plans to decentralize its network and launch a token by early next year, said Zou. SubQuery also intends to support more Layer 1 blockchains, including Solana and Terra.","SubQuery currently supports <a href=\"https:\/\/www.theblockresearch.com\/mapping-out-polkadots-ecosystem-91104\" data-v-f87c67ca=\"\">Polkadot<\/a> and Kusama parachains and applications, meaning it helps them query blockchain data to build those applications. SubQuery says it eliminates the need for custom data processing servers and lets developers focus on product development and user experience rather than building their own querying systems.","The project can be seen as similar to <a href=\"https:\/\/www.theblockcrypto.com\/linked\/88243\/blockchain-indexing-graph-mainnet-launch\" data-v-f87c67ca=\"\">The Graph<\/a> in the Ethereum ecosystem, but it is yet to be decentralized. SubQuery currently offers managed services and says over 60 projects are using its services, including Acala and Moonbeam.","\"SubQuery is a critical part of the Polkadot stack, and its deep relationships with leading Polkadot projects prove it,\" said Matt Beck, director of investments at Digital Currency Group. \"As an active investor in the Polkadot ecosystem, we are impressed by the team's passion, knowledge, and dedication towards their work and are very excited to back them.\"","There are currently 15 people working for SubQuery, and the project plans to hire more people in the near future, especially engineers, said Zou. Most of SubQuery's staff is based in Auckland, New Zealand, he said.","The Series A round brings SubQuery's total funding to date to $10.8 million. Earlier this year, the project <a href=\"https:\/\/subquery.medium.com\/subquery-raises-1-8m-seed-round-for-future-expansion-3348c1f2a931\" data-v-f87c67ca=\"\">raised<\/a> $1.8 million in a seed funding round backed by DeFi Alliance, D1 Ventures, Hypersphere Ventures, Digital Finance Group,&nbsp; and The Lao.&nbsp;"],"hashtag":[]}