{"summary":"The crypto exchange announced Tuesday the release of its waitlist for Coinbase NFT\nTo start, it will offer users the ability to mint, purchase, and showcase their NFTs","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/120223\/coinbase-announces-nft-waitlist-following-lead-of-rivals-binance-and-ftx","publishDate":"2021-10-12T13:00:14","id":3839,"type":null,"title":"Coinbase announces NFT waitlist, following lead of rivals Binance and FTX","category":["NFTs"],"content":["Coinbase is breaking into the market for non-fungible tokens, announcing Tuesday the waitlist for access to Coinbase NFT — making it the latest crypto firm to dive into the speculative frenzy.&nbsp;","The new offering — which is being spearheaded by Coinbase's VP of Product, Sanchan Saxena — will allow users to mint, purchase, and showcase NFTs. To start it will support Ethereum-based NFTs, but it has plans to expand to other chains after it launches.&nbsp;&nbsp;","","","<em data-v-f87c67ca=\"\">Coinbase NFT<\/em>","\"Our ambition with <span class=\"il\" data-v-f87c67ca=\"\">Coinbase<\/span> NFT is to allow everyone to benefit from their creative spark; to contribute to a future where the 'creator economy' isn’t a small subset of the 'real' economy, but a central driver,\" Coinbase said in marketing materials. &nbsp;","According to a spokeswoman, the platform will utilize self-custody wallets, and as a result will not require users to go through KYC checks with the exchange in the same way that its brokerage clients need to in order to trade crypto. The firm would not disclose fees, but plans to share those details closer to the official launch of the platform.&nbsp;","NFTs have become the zeitgeist of the crypto market, with headline-making NFTs like Beeple selling for tens of millions of dollars. That excitement has cooled recently, with weekly NFT trade volumes coming down significantly from their peak, data from The Block shows.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/nft-overview\/weekly-trade-volume-of-nfts\/embed\" title=\"Weekly Trade Volume of NFTs by Category\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<strong data-v-f87c67ca=\"\">Competition is heating up<\/strong>","Coinbase is throwing its hat into a ring that's growing more competitive. Crypto exchange&nbsp;FTX.US&nbsp;announced on Monday the fully fledged launch of its marketplace for Solana-based NFTs, as The Block&nbsp;reported.","Binance also has its own offering named Binance NFT, which the firm aims to build into \"the largest NFT trading platform in the world.\"","It makes sense that exchanges want a piece of the non-fungible action. OpenSea, which clinched unicorn status in a recent funding round, has seen its volumes surge as users have flocked to its platform to flip CryptoPunks and Pudgy Penguins.&nbsp;","Data from The Block shows OpenSea saw more than $2.7 billion in NFT trading volumes last month. While that's a fraction of the $129 billion Coinbase saw in crypto spot trading in September, OpenSea's volumes have increased more than 30 times.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/marketplaces\/nft-marketplace-monthly-volume\/embed\" title=\"NFT Marketplace Monthly Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","FTX.US' Brett Harrison thinks the NFT marketplace will have a meaningful impact to the firm's bottom line.","<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">\"We think it will make a meaningful impact on our bottom line over time as volume picks up on FTX US and in Solana NFTs in general, and especially when we add support for Ethereum NFTs,\" he said in a message to The Block.&nbsp;<\/span>"],"hashtag":["COINBASE"]}