{"summary":"After the high-profile implosion of FTX, crypto skeptics and digital currency advocates have both asked the question: could the Securities and Exchange Commission have done more?","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189351\/sec-facing-rising-scrutiny-after-ftxs-epic-implosion","publishDate":"2022-11-23T05:30:07","id":384,"type":null,"title":"SEC facing rising scrutiny after FTX’s epic implosion ","category":["POLICY"],"content":["After the high-profile implosion of FTX, crypto skeptics and digital currency advocates have both asked the question: Could the Securities and Exchange Commission have done more?","Expect to hear that question more from Congress.&nbsp;&nbsp;","Asked if the SEC could have been more aggressive in investigating FTX prior to a bankruptcy process that could potentially affect hundreds of thousands of consumers, New Jersey Sen. Bob Menendez, a senior Democrat on the Senate Banking Committee, replied simply, “Yes.” Asked if he planned to question SEC Chair Gary Gensler about that, Menendez replied, “I am.” &nbsp;","On the other side of the Capitol, Rep. Tom Emmer, R-Minn., the soon-to-be number-three Republican in the House of Representatives, has echoed criticism from members of the decentralized finance community over Sam Bankman-Fried’s lobbying of the SEC for a <a href=\"https:\/\/www.theblock.co\/post\/186908\/ftx-asked-about-but-did-not-receive-special-exemption-from-sec\" data-v-f87c67ca=\"\">no-action letter request<\/a> that was not granted.&nbsp;&nbsp;","“What involvement did he have with the SEC and others? I think we’ve got a lot of questions,” Emmer told The Block.&nbsp;&nbsp;","Gensler has become a lightning rod for criticism from digital asset advocates, making him an easy target for them as accusations of massive malfeasance against FTX build. Industry lawyers have been quick to blame the SEC.&nbsp;","“I simply don’t think you would have ended up with such a disaster if uncertainty and lack of engagement had not driven so much market activity outside of the U.S. in the first place,” said Alex Lindgren, partner at LLOY Law, a law firm focused around a securities practice.&nbsp;&nbsp;","&nbsp;“I want to know why our ‘cop on the beat’ was blind to this,”<a href=\"https:\/\/twitter.com\/jchervinsky\/status\/1592521220213583873?s=20&amp;t=TNUIoc5rNE-978J2aRwLPg\" data-v-f87c67ca=\"\"> wrote<\/a> Jake Chervinsky, an attorney for crypto trade group the Blockchain Association.&nbsp;  &nbsp;","Coy Garrison, an attorney with Steptoe and Johnson said the case called into question the agency’s priorities.&nbsp;&nbsp;","“Obviously the SEC’s not to blame for what happened but there’s some valid questions being raised about where the SEC has been allocating its resources,” said Garrison, formerly a counsel to pro-crypto SEC Commissioner Hester Peirce.&nbsp;&nbsp;&nbsp;","But some of Gensler’s loudest critics in Congress held their fire in this instance.&nbsp;&nbsp;","“I’m not sure that there’s an SEC issue here. Let’s remember, most of the problems originated with an offshore exchange and I’m not sure the SEC jurisdiction reaches there,” said Pennsylvania Sen. Pat Toomey, the retiring top Republican on the Senate Banking Committee. “There’s a lot of facts and circumstances that I would need to know before I could answer that question” of whether the SEC should have been more aggressive towards FTX.&nbsp;&nbsp;","Noting the 130 legal entities tied to FTX in various countries, Sen. Cynthia Lummis, R-Wyo., also hesitated to blame the SEC for not taking action.&nbsp;&nbsp;","“Knowing that it takes anywhere from one to three years to develop an enforcement action or an action for fraud against a company as complicated as FTX, it would have been really challenging to do it in the timeframe that FTX has been up and running,” she said. &nbsp;&nbsp;","Gensler recently defended his agency’s priorities when asked why the agency pursued enforcement actions against celebrities like Kim Kardashian but not FTX.&nbsp;&nbsp;","“Building the evidence, building the facts, often takes time,” Gensler <a href=\"https:\/\/www.theblock.co\/post\/185310\/gensler-pressed-on-ftx-failure-warns-investors-to-be-careful-beware\" data-v-f87c67ca=\"\">told CNBC<\/a>.&nbsp;&nbsp;","The perception of the SEC’s powers versus the reality of its limits explains part of why the agency has not taken legal action against yet, according to some of the agency’s defenders. Gensler himself has consistently pushed for more companies to come forward and register their tokens as securities offerings, or themselves as securities exchanges, which may explain part of why he and senior SEC staff met with FTX earlier this year. &nbsp;","“Everybody wants to turn to the SEC and say it's their fault,” said Lisa Braganca, a former branch chief at the enforcement division of the SEC’s Chicago office. “And I would say that the SEC has been saying for a long time that they think these digital coins are securities. That's the first thing. And so I think if they had their druthers, they would have had FTX housed in the U.S. and operating under the rules of a regular security exchange.” &nbsp;","Ty Gellasch, a one-time counsel to former SEC Commissioner Kara Stein, now president and CEO of the Healthy Markets Association, argued that the industry’s lack of cooperation with inquiries from the regulator, and political complications, slow down the SEC’s work. &nbsp;","“The SEC has the authority to regulate the securities business, but they and their allies in Congress have argued that these aren’t securities,” Gellasch said. “That puts regulators in a very high-stakes game of chicken.”&nbsp;&nbsp;","Still, not everyone was convinced the SEC has done enough in the FTX case. &nbsp;","“The average SEC investigation takes about two years, but that is under ordinary conditions where customer funds are safe and the possible defendant is not a flight risk. When customer funds are at risk, the calculus changes entirely,” said Phil Moustakis, former senior counsel in the SEC’s enforcement division and current attorney at Seward &amp; Kissel. “In fact, the SEC was already investigating intermediaries in the crypto market, so with FTX they should have had a head start.”&nbsp;","The point could be moot. The Justice Department is investigating, and FTX’s lawyers told a federal bankruptcy judge on Tuesday that they are cooperating with federal law enforcement as well as regulators. That could lead to other enforcement cases, noted John Reed Stark, founding head of the SEC’s office of internet enforcement. &nbsp;","“My guess is that search warrants, grand jury subpoenas and arrests are all ongoing and imminent,” Stark, now a law professor at Duke University, said via online message.&nbsp;","Regulators including the SEC and FINRA are likely to perform examinations of any firm with contact to the fallout of FTX’s collapse, Stark continued.&nbsp;&nbsp;","He also predicted that cooperation from FTX insiders could lead to more investigations by law enforcement and the SEC, since scrutiny at one firm could lead to tip-offs on dealings by others as those close to the situation grow more willing to talk. Stark noted, “gregarious informants and immunity-seeking witnesses undoubtedly abound.”&nbsp;&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Emmer","content":"PERSON"},{"type":"Garrison","content":"PERSON"},{"type":"Menendez","content":"PERSON"},{"type":"Pat Toomey","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"New Jersey","content":"LOCATION"},{"type":"Jake Chervinsky","content":"PERSON"},{"type":"Kara Stein","content":"PERSON"},{"type":"House of Representatives","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Pennsylvania","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Bob Menendez","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Duke University","content":"ORGANIZATION"},{"type":"Senate Banking Committee","content":"ORGANIZATION"},{"type":"Kim Kardashian","content":"PERSON"},{"type":"Chicago","content":"LOCATION"},{"type":"Cynthia Lummis","content":"PERSON"},{"type":"FINRA","content":"ORGANIZATION"},{"type":"Alex Lindgren","content":"PERSON"},{"type":"Hester Peirce","content":"PERSON"},{"type":"CEO of the Healthy Markets Association","content":"ORGANIZATION"},{"type":"Ty Gellasch","content":"PERSON"},{"type":"Tom Emmer","content":"PERSON"},{"type":"Phil Moustakis","content":"PERSON"},{"type":"Justice Department","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wyo.","content":"LOCATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"John Reed Stark","content":"PERSON"},{"type":"Johnson","content":"PERSON"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"Lisa Braganca","content":"PERSON"},{"type":"Gellasch","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Seward &amp; Kissel","content":"ORGANIZATION"},{"type":"Minn.","content":"LOCATION"},{"type":"Capitol","content":"LOCATION"},{"type":"Steptoe","content":"ORGANIZATION"}],"hashtag":["CONGRESS","HOUSE FINANCIAL SERVICES COMMITTEE","SEC","SENATE BANKING COMMITTEE"],"authors":["Colin Wilhelm","Kollen Post","Stephanie Murray","The Block"]}