{"summary":"The total supply of dollar-pegged stablecoins has surged past $100 billion.\nMost of that growth has been driven by the two largest stablecoins: USDT and USDC.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/106082\/total-stablecoin-supply-100-billion-mark","publishDate":"2021-05-26T06:15:56","id":384,"type":null,"title":"Total stablecoin supply crosses the $100 billion mark","category":["Stablecoins"],"content":["The total supply of dollar-pegged stablecoins has risen past the $100 billion mark, according to <a href=\"https:\/\/www.theblockcrypto.com\/data\/crypto-markets\/spot\" data-v-f87c67ca=\"\">The Block's Data Dashboard<\/a>.","At the time of writing, the <a href=\"https:\/\/www.theblockcrypto.com\/data\/decentralized-finance\/stablecoins\" data-v-f87c67ca=\"\">total supply of stablecoins<\/a> stands at $100.33 billion. Most of that growth has been driven by the two largest stablecoins: Tether's USDT and the Centre consortium's USD Coin (USDC).","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-stablecoin-supply-daily\/embed\" title=\"Total Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Tether has a 62% market share, while USDC has a 21% share, although USDC's market share has been increasing at a faster clip in recent weeks. Late last year, USDC's market share was less than 10%.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/share-of-total-stablecoin-supply\/embed\" title=\"Share of Total Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Most of the stablecoin growth has happened in recent months as can be seen from the charts above. At the beginning of this year, for instance, the total supply of stablecoins was only around $30 billion.","The sharp growth in stablecoins suggests that crypto market participants are increasingly deploying funds, including in areas such as derivatives and decentralized finance (DeFi). Derivatives traders often use stablecoins for collateral, whereas DeFi users utilize stablecoins to trade and lend funds to earn yields.","Stablecoins allow crypto market participants to move faster between trades without having to wait days compared to fiat money transfers. Also, not all crypto exchanges support fiat on-ramps, leaving stablecoins and other cryptocurrencies the only solution to trade crypto.","The growing use of <a href=\"https:\/\/www.theblockcrypto.com\/promotions\/report-stablecoins?utm_source=research&amp;utm_medium=email&amp;utm_campaign=2021-03-11\" data-v-f87c67ca=\"\">stablecoins<\/a> has caught the attention of global regulators, including the U.S. Last December for instance, members of the U.S. Congress proposed the Stablecoin Tethering and Bank Licensing Enforcement <a href=\"https:\/\/www.theblockcrypto.com\/linked\/86460\/congress-stablecoin-legislation\" data-v-f87c67ca=\"\">(STABLE) Act.<\/a> If the act proposal were to become law in its current form, it would require all stablecoin issuers to have bank licenses. The proposal effectively declares that stablecoins are a kind of deposit under federal law."],"hashtag":["TETHER","USDC"]}