{"summary":"Incentives prove successful for rapidly scaling the testnet of this full stack privacy system","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/110179\/nym-testnet-grows-larger-than-tor-next-step-is-to-decentralise-a-critical-centralised-chokepoint-of-tor-using-tendermint","publishDate":"2021-07-01T08:41:10","id":3843,"type":null,"title":"Nym testnet grows larger than Tor, next step is to decentralise a critical centralised chokepoint of Tor using Tendermint","category":["SPONSORED"],"content":["<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Incentives prove successful for rapidly scaling the testnet of this full stack privacy system<\/span><\/i>","<b data-v-f87c67ca=\"\">Neuchatel, Switzerland— 1st&nbsp; July 2021 —<\/b><a href=\"https:\/\/nymtech.net\/about\/\" data-v-f87c67ca=\"\"> <b data-v-f87c67ca=\"\">Nym<\/b><\/a><b data-v-f87c67ca=\"\">, <\/b><span data-v-f87c67ca=\"\">the next generation of privacy infrastructure, announces that its “<\/span><a href=\"https:\/\/testnet-finney-explorer.nymtech.net\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Finney<\/span><\/a><span data-v-f87c67ca=\"\">” testnet has grown to over 8,000 Mix Nodes with a massive surge in nodes around the Miami Bitcoin conference.&nbsp; The success of the testnet makes it larger in terms of nodes than the Tor network, the most popular anonymous communication system, often used in Bitcoin wallets.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Nym incorporates economic incentives as a means to scale and ensure the long term sustainability of the privacy network. This is an improvement on established privacy networks. Tor in particular relies primarily on donations, government funding, non-profit grants, and contracts. There is no economic incentive for operators which means volunteers have to cover the cost of running and maintaining the privacy system. In contrast, the Nym incentive scheme rewards mixnodes and validators that provide good quality of service, while encouraging the network to scale in response to demand.<\/span>","<span data-v-f87c67ca=\"\">The next step for Nym’s “Finney” testnet will be to implement the reward-sharing and proof of mixing algorithm into their <\/span><a href=\"https:\/\/nymtech.net\/nym-whitepaper.pdf)\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">whitepaper<\/span><\/a><span data-v-f87c67ca=\"\">. In later releases Nym will make the validators completely permissionless. But first they need to make sure Nym’s giant mixnet contains only nodes providing the highest-quality of service and uptime. This will likely cause the testnet to shrink to a smaller number of high capacity nodes that can ensure a high quality of service. Participants will then be allowed to use delegated staking in order to vote for the best performing nodes.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Delegated staking allows people who hold testnet token HAL, but who might not have the technical capacity to run a good mixnode, to participate by staking HALs on other mixnodes of their preference. The delegated stake represents reputation in the network and contributes to determining&nbsp; whether the node will be selected to perform the work of mixing packets and providing privacy.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Nym is further improving privacy systems by decentralising the usage of semi-centralised directory authorities.&nbsp; In the case of Tor, the entire network can be taken offline if these <\/span><a href=\"https:\/\/blog.torproject.org\/comment\/83781\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">directory authorities are seized or even fall victim to a DDoS attack<\/span><\/a><span data-v-f87c67ca=\"\">. And while <\/span><a href=\"https:\/\/www.reuters.com\/world\/china\/apples-new-private-relay-feature-will-not-be-available-china-2021-06-07\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Apple have recently launched a Tor-like relay system for privacy<\/span><\/a><span data-v-f87c67ca=\"\">, their system also presents serious issues of centralisation, will not be available in many countries and is limited to web browsing. Unlike Tor and VPNs, Nym offers mixing packets on the individual level for all traffic, offering improved privacy by hiding the timing and volume of packets and so thwarting meta-data surveillance by even the most advanced adversaries.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Andrés Solanot of Figment stated that: “<\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Figment is proud to support the launch of Nym by contributing nodes to the network. We believe that protecting user data at the protocol level through privacy preserving technologies is an important step in the transition to a free and user owned internet<\/span><\/i><span data-v-f87c67ca=\"\">.” (<\/span><a href=\"https:\/\/figment.io\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/figment.io\/<\/span><\/a><span data-v-f87c67ca=\"\">)<\/span>","<span data-v-f87c67ca=\"\">Nym is using a blockchain rather than a semi-centralised directory authority to keep track of the state of the Nym network. They have launched its blockchain using the Tendermint blockchain and Cosmos libraries as validators.&nbsp; Not only backed by the Interchain Foundation, the non-profit behind Cosmos, several large Tendermint validators like Dokia Capital, P2P.org, Hashquark, HuobiPool, and Figment, have joined, contributing validators to the Nym testnet.&nbsp; These Tendermint validators are the next stage in the evolution of the Nym mixnet, decentralising the Nym blockchain directory authority keeping track of mixnode reputation (delegated stake tracked by HAL testnet tokens).<\/span>","<span data-v-f87c67ca=\"\">Sam Hart of the Interchain Foundation states: “<\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Nym brings together state of the art anonymity research and distributed systems engineering to create technology that empowers civil society. The Interchain Foundation anticipates many Cosmos projects will integrate Nym’s network-level anonymity capabilities, but Nym also represents a milestone for private peer-to-peer communications and an opportunity for mix networks to finally enter the mainstream.<\/span><\/i><span data-v-f87c67ca=\"\">” (<\/span><a href=\"https:\/\/interchain.io\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/interchain.io\/<\/span><\/a><span data-v-f87c67ca=\"\">).<\/span><b data-v-f87c67ca=\"\">&nbsp;<\/b>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Dave Hrycyszyn, CTO of Nym, and Sam Hart, Grants Manager of the Interchain Foundation, are available for interview.<\/span><\/i>","<b data-v-f87c67ca=\"\">About Nym<\/b>","<span data-v-f87c67ca=\"\">Nym is an open-source, decentralized, permissionless and incentivized system that provides full-stack privacy, allowing developers to build applications that provide users with strong guarantees against metadata surveillance, at both the level of network traffic, and the level of authentication and payments. Nym’s team is composed of leading research scientists and developers at world-class universities <\/span><a href=\"https:\/\/www.mit.edu\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Massachusetts Institute of Technology<\/span><\/a><span data-v-f87c67ca=\"\">,&nbsp; <\/span><a href=\"https:\/\/www.kuleuven.be\/kuleuven\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">KU Leuven<\/span><\/a> <span data-v-f87c67ca=\"\">and <\/span><a href=\"https:\/\/www.ucl.ac.uk\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">University College London<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">Stay updated with NYM’s latest news, follow them at social networks:<\/span>","<span data-v-f87c67ca=\"\">For more information visit: <\/span><a href=\"https:\/\/nymtech.net\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/nymtech.net\/<\/span><\/a><span data-v-f87c67ca=\"\"> or&nbsp; write to:&nbsp; <\/span><a href=\"\/cdn-cgi\/l\/email-protection#1675797b7b6556786f7b6273757e38787362\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"385b5755554b785641554c5d5b5016565d4c\">[email&nbsp;protected]<\/span><\/span><\/a><span data-v-f87c67ca=\"\">&nbsp;<\/span>"],"entity":[{"type":"1st&nbsp; July 2021","content":"DATE"},{"type":"Dave Hrycyszyn","content":"PERSON"},{"type":"HAL","content":"PERSON"},{"type":"Switzerland","content":"LOCATION"},{"type":"Massachusetts Institute of Technology","content":"ORGANIZATION"},{"type":"Nym","content":"ORGANIZATION"},{"type":"Finney","content":"PERSON"},{"type":"Interchain Foundation","content":"ORGANIZATION"},{"type":"Miami Bitcoin","content":"LOCATION"},{"type":"Cosmos","content":"LOCATION"},{"type":"Hashquark","content":"LOCATION"},{"type":"Dokia Capital","content":"ORGANIZATION"},{"type":"HAL","content":"ORGANIZATION"},{"type":"Sam Hart","content":"PERSON"},{"type":"CTO of Nym","content":"ORGANIZATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"KU Leuven<\/span><\/a> <span data-v-f87c67ca=\"\">and <\/span><a href=\"https:\/\/www.ucl.ac.uk\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">University College","content":"ORGANIZATION"},{"type":"London","content":"LOCATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}