{"summary":"Twitter began rolling out NFT profile pictures this week via its Blue subscription offering.\nYet the event sparked debate over Twitter’s ultimate goals with NFTs and what the site’s userbase views as its most critical needs. ","author":["Anushree Dave","MK Manoylov","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/131235\/twitters-roll-out-of-nft-profile-pictures-offers-insight-into-what-users-really-want","publishDate":"2022-01-21T18:51:37","id":3843,"type":null,"title":"Twitter’s roll-out of NFT profile pictures offers insight into what users really want","category":["Web3"],"content":["Twitter Blue, a paid subscription offering from Twitter, rolled out a new feature for its subscribers to upload non-fungible tokens (NFTs) as profile pictures on Thursday.","The company is one of the first major traditional Web2 companies to incorporate NFT features, in a race to become the defining social media hub of Web3. But following the announcement, there was a strong backlash from some quarters of Twitter’s NFT community and broader user base about what this means for the platform and for NFT art owners going forward.","Crypto enthusiasts and influencers — including<a href=\"https:\/\/www.theblockcrypto.com\/linked\/131126\/elon-musk-dunks-on-twitters-integration-with-nfts\" data-v-f87c67ca=\"\"> Elon Musk<\/a> — expressed concerns that Twitter isn’t doing enough when it comes to preventing scams and protecting stolen NFTs. On Friday, Musk accused Twitter of spending engineering resources on integrating NFTs rather than focusing on pre-existing problems like spam and fake accounts.","Yet the situation undoubtedly provided some insight into what users really want when it comes to the intersection between web3 constructs and platforms like Twitter that have amassed huge numbers of users.","Twitter Blue is the upgraded version to Twitter that gives members premium features, such as the ability to undo tweets, remove ads and create folders for bookmarked Tweets for $2.99 USD a month.","On January 20, Twitter Blue decided to add another feature for its users: the ability to connect a crypto wallet and upload an NFT as a profile picture for mobile iOS users, which it added to accommodate as a result of high-user demand, according to a Twitter&nbsp;<a href=\"https:\/\/twitter.com\/TwitterBlue\/status\/1484226494708662273\" data-v-f87c67ca=\"\">thread<\/a>.","Twitter received mixed reactions from users about these new NFT profile picture features. Some view the development as a positive step forward for the NFT community, such as <a href=\"https:\/\/twitter.com\/spencernoon\" data-v-f87c67ca=\"\">Spencer Noon<\/a>, the creator of the crypto-focused venture fund Variant.","“Given Twitter's distribution and audience, this is truly a mainstream moment for profile picture NFTs, which are emerging as an increasingly important identity primitive in Web3,” Noon told The Block. “I suspect we'll look back on this as a major turning point for NFTs becoming ingrained in broader culture and society.”","Others pointed to issues with the implementation and questioned Twitter’s end goal. NFT community member <a href=\"https:\/\/twitter.com\/mecdot\" data-v-f87c67ca=\"\">Mec.eth<\/a> said in a Twitter Spaces session this week that the company appears primarily focused on selling Blue memberships.","“They’re paying attention to what we’re doing, but we aren’t considered the influencers of those executions,” Mec.eth said. “I don’t know any of us in pilot programs, and maybe I just haven’t been informed, but the things that I know are happening happen around what their interest is — to sell Blue, their product.”","Twitter Blue users with the iOS Twitter mobile app can opt to use an NFT that they already own to set a new profile picture. The user must then connect their crypto wallet and have the choice to use a Coinbase, Rainbow, MetaMask, Trust, Argent or Ledger Live wallet. After selecting an NFT in their wallet, the image associated with the NFT appears as a hexagon on the Twitter Blue user’s profile.","Other NFT holders think the move is the right direction, but more could be done to better verify who has access to a hexagonal profile picture – which Twitter is using to identify NFTs from regular profile pictures.","\"What I was really hoping this feature would do is give people the ability – at a very quick glance, when they see a tweet going down their timeline and they're scrolling and they see somebody with a hexagon – they're going to know that that person simply owns that NFT,\" said Adam Hollander, owner of Bored Ape #3987 and founder of <a href=\"https:\/\/hungrywolvesnft.com\" data-v-f87c67ca=\"\">Hungry Wolves NFTs<\/a>, in an interview with The Block.","Hollander points to the existing verification system Twitter has in place for certain users with the blue checkmark. If the same sort of verification were applied to NFTs, it would make fakes easier to spot, he says.","\"This is a big problem. There are thousands and thousands of accounts with just fake Bored Apes, let alone the other thousands of accounts with fake punks, and fake doodles and everything else,\" he said. \"Because these NFTs cost a lot of money, in some cases, hundreds of thousands or millions of dollars. And there's a lot of people out there that would love to be able to associate themselves digitally as owning an asset that has that level of prestige behind it.\"","Twitter appears to have expected some of the community’s critiques.","The company’s head of consumer product marketing Justin Taylor wrote on <a href=\"https:\/\/twitter.com\/TheSmarmyBum\/status\/1484249741667889152\" data-v-f87c67ca=\"\">Twitter<\/a>: “We don’t want to limit this to just verified collections, that would be wrong, and non-supportive of the broader NFT movement. Anyone SHOULD be able to mint anything and make it their nft. We do show if a collection is verified in the detail page though!”","Based on the feedback on the platform, Twitter may have to focus on authenticating connected NFTs.","Some have suggested Twitter could collaborate with the NFT marketplaces such as OpenSea – currently the largest NFT marketplace by volume. While OpenSea itself is not free from fraudulent uploads, marketplace-verified NFTs add a level of legitimacy that, as of publication, does not exist for Twitter Blue users.","The move is an experiment for Twitter, as they incorporate feedback from users to further build out and improve the feature, a rep from the company confirmed with The Block.","“We’re providing access to NFT Profile Pictures via our early access Labs feature in Twitter Blue to monitor and learn about people’s feedback as we continue to iterate,” said a Twitter spokesperson to The Block. “Based on feedback, we’ll be providing updates as to anything forthcoming.”"],"hashtag":["SOCIAL MEDIA","TWITTER"]}