{"summary":"eToro has warned customers that it may limit bitcoin and crypto buying over this weekend if demand and volatility continue.\nWhile the notice relates to this coming weekend, it may also be applied to “the following weekends” if a similar situation continues, an eToro spokeswoman told The Block.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/91221\/etoro-bitcoin-btc-limit-buying-weekends-notice-demand-volatility","publishDate":"2021-01-14T04:45:42","id":3845,"type":null,"title":"eToro may limit bitcoin buying on weekends if demand and volatility continue","category":["Bitcoin"],"content":["Online brokerage eToro has warned customers that it may limit bitcoin and crypto buying over this weekend if demand and volatility continue.","\"The unprecedented demand for crypto, coupled with limited liquidity, presents challenges to our ability to support BUY orders over the weekend,\" the company said in an email to customers. \"In light of this, it may be necessary for us to place limitations on crypto BUY orders over the weekend.\"","While the notice relates to this coming weekend, it may also be applied to “the following weekends\" if a similar situation continues, an eToro spokeswoman told The Block.","Crypto markets are open 24\/7, and investor participation could increase on weekends, especially during bull runs like the current one. Bitcoin has <a href=\"https:\/\/www.theblockcrypto.com\/data\/crypto-markets\/prices\" data-v-f87c67ca=\"\">doubled<\/a> in value within the last one month, from around $19,000 to about $38,000.","<iframe title=\"BTC Price\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/btc-price\/embed\" width=\"100%\" height=\"420\" frameborder=\"0\" data-v-f87c67ca=\"\"><\/iframe>","If eToro implements the restrictions, it may set a temporary maximum exposure amount per crypto-asset for each client and temporarily suspend the ability to place new crypto buy orders, according to the email.","\"There is no certainty that we will have to implement these changes this weekend, but we wanted to ensure our clients were aware of the possibility,\" the spokeswoman told The Block.","Last week, eToro <a href=\"https:\/\/www.wsj.com\/articles\/online-platform-etoro-called-in-leveraged-crypto-trades-when-bitcoin-price-peaked-11610389892\" data-v-f87c67ca=\"\">gave a four-hour notice<\/a> to European customers and abruptly closed all crypto margin trades when bitcoin hit an all-time high of around $42,000.","“Please be informed that we may have to make further changes to our crypto offering at very short notice,” eToro warned customers in the latest notice."],"hashtag":["BITCOIN","CRYPTO"]}