{"summary":"Equifax&#x27;s identity, fraud, and compliance data will be used by Oasis Labs to build decentralized identity management and KYC for Web3 firms.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179999\/privacy-focused-oasis-labs-partners-with-equifax-for-on-chain-kyc","publishDate":"2022-10-26T10:39:24","id":3846,"type":null,"title":"Privacy-focused Oasis Labs partners with Equifax for on-chain KYC","category":["COMPANIES"],"content":["Oasis Labs, the privacy-focused cloud computing firm and Equifax <a href=\"https:\/\/www.prnewswire.com\/news-releases\/oasis-labs-partners-with-equifax-to-power-on-chain-kyc-solution-for-the-web3-economy-301659732.html\" data-v-f87c67ca=\"\">announced<\/a> a new partnership on Wednesday.&nbsp;","Equifax's identity, fraud, and compliance data — which powers its consumer credit reports software — will be used by Oasis Labs to power its decentralized identity management and KYC product. Today's partnership will allow the Oasis Network to carry out KYC due diligence and monitoring.","Equifax has highly credible and reliable data as well as being an innovator in the financial service space, Professor <span class=\"xn-person\" data-v-f87c67ca=\"\">Dawn Song<\/span>, founder of Oasis Labs, said, before adding, \"that will help drive more trust in using blockchain technology for real use cases.\"","As the world of web3 continues to evolve, so does the need for identity management and KYC solutions to help reduce risk and instill confidence in on-chain transactions, <span class=\"xn-person\" data-v-f87c67ca=\"\">Joy Wilder, <\/span>U.S. information solutions CRO and senior VP of global partnerships at Equifax, said.&nbsp;","While Equifax is one of the most well-known consumer credit reporting firms in the U.S., it has come under scrutiny in the past. In 2019 the firm was <a href=\"https:\/\/www.theblock.co\/linked\/32906\/credit-rating-agency-equifax-to-pay-up-to-600-million-in-largest-ever-data-breach-settlement\" data-v-f87c67ca=\"\">ordered<\/a> to pay up to $600 million to settle federal and state investigations into a 2017 data breach of personal information that affected almost half the country's population.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Equifax","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"KYC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Joy Wilder","content":"PERSON"},{"type":"$600 million","content":"MONEY"},{"type":"2019","content":"DATE"}],"hashtag":[],"authors":["Adam Morgan McCarthy","The Block"]}