{"summary":"As Chinese retail investors flock into Chia mining, the prices of various hard drive models have been surging in recent days with some by as much as 100%\nChia’s mainnet for mining went online in March and the storage power farming on the network has four-folded since then to 450 pebibytes","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/102430\/chia-crypto-miner-china-price-hard-drive","publishDate":"2021-04-21T16:53:13","id":3847,"type":null,"title":"Hard drive prices surge as Chinese investors flock to Chia mining","category":["Mining"],"content":["Forget about the ASICs or GPUs: <a href=\"https:\/\/www.theblockcrypto.com\/linked\/50591\/tiktok-owner-works-with-chinese-media-outlet-to-register-new-blockchain-ai-company\" data-v-f87c67ca=\"\">Chinese<\/a> crypto miners are now aiming their speculative forces at hard drives.","<a href=\"https:\/\/uk.pcmag.com\/old-cryptocurrency\/132912\/chia-cryptocurrency-expected-to-cause-hard-drive-and-ssd-shortages\" data-v-f87c67ca=\"\">Multiple<\/a> <a href=\"https:\/\/www.tomshardware.com\/news\/hard-drive-ssd-shortages-imminent-if-new-cryptocurrency-blooms\" data-v-f87c67ca=\"\">hardware<\/a> news outlets have reported recently that the rise of investment by Chinese users into the Chia network mining has led to a price surge of hard drives, especially ones that are enterprise-grade with large storage volume.","Data from Manmanbuy.com, a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/41398\/us-treasury-denies-that-it-plans-to-block-chinese-companies-from-us-stock-exchanges\" data-v-f87c67ca=\"\">Chinese<\/a> mobile app that tracks historical prices of goods sold on e-commerce sites such as Taobao or JD.com, shows that the prices of various models of hard drives have been flipped by as much as 100% since early this month.","For instance, the screenshot below shows how the price for Western Digital's 12 terabyte (TB) hard drive has gone up from 2,499 yuan ($372) to 3,599 yuan ($537) on JD.com in the past few days. The same model (WD120EFAX) on <a href=\"https:\/\/www.amazon.com\/Red-12TB-Internal-Hard-Drive\/dp\/B07RQ99XJH\/ref=sr_1_1?crid=3V4VAY37THH07&amp;dchild=1&amp;keywords=wd120efax&amp;qid=1618977535&amp;sprefix=WD120%2Caps%2C726&amp;sr=8-1\" data-v-f87c67ca=\"\">Amazon.com<\/a>, is still at $347.","Meanwhile, enterprise-grade hard drives with 12 terabyte storage made by Seagate, another major manufacturer, are being quoted at $835 on JD.com, which has almost doubled within just days.","Other electronic device dealers are also showing \"sold out\" for the same Western Digital model on their JD.com online shops. But according to reports by Chinese crypto media <a href=\"https:\/\/mp.weixin.qq.com\/s\/jPs0bwKvwCO3O5K6sEREdA\" data-v-f87c67ca=\"\">BlockBeats<\/a> and business publication <a href=\"https:\/\/www.tfcaijing.com\/article\/page\/544e615344546750584a2b41506b5a646647635747773d3d\" data-v-f87c67ca=\"\">Time Finance<\/a>, it appears that there are plenty of hard drives on the market but dealers are just hoarding the stocks in order to flip the prices.","In a sign of the times, \"hard drive price surge\" has already become a topical search item on <a href=\"https:\/\/s.weibo.com\/weibo\/%25E7%25A1%25AC%25E7%259B%2598%25E6%25B6%25A8%25E4%25BB%25B7?topnav=1&amp;wvr=6&amp;b=1\" data-v-f87c67ca=\"\">Chinese social media Weibo<\/a>. Based on Weibo user comments seen by The Block, non-crypto users are complaining that crypto miners already drove up the prices of GPUs — and are now moving into the hard drive market.","","","Chia is a decentralized storage network founded in 2017 by Bram Cohen, who's also behind the peer-to-peer BitTorrent protocol. The network launched the mainnet for mining on March 19 but on-chain transactions won't be enabled until May 3, the project's website shows.&nbsp;","As such, there's no liquidity of XCH, Chia's native cryptocurrency, on centralized exchanges but that hasn't stopped miners from changing hands through over-the-counter desks in China. Bids and asks seen by The Block on chat groups show XCH's OTC price has gone up to around $200.","The idea behind Chia is similar to that of Filecoin, which uses the so-called proof-of-space and proof-of-time to replace the proof-of-work consensus that‘s under bitcoin so that mining on Chia or Filecoin is not energy-intensive.","Similar to sealing data on <a href=\"https:\/\/www.theblockcrypto.com\/daily\/101465\/china-new-infrastructure-filecoin-ipfs\" data-v-f87c67ca=\"\">Filecoin<\/a>, Chia mining also has two steps: plotting and farming. It works like this: investors need to plot a minimal file size of 101 gigabyte (GB) by using a hard drive, ideally a solid-state drive (SSD), to read and write about 2 terabyte of data and then save the file's final directory at a normal hard disk drive (HDD); after that, a plot is created and can then be used to farm XCH.&nbsp;","It may vary for different models, but SSDs typically have a so-called <a href=\"https:\/\/en.wikipedia.org\/wiki\/Wear_leveling\" data-v-f87c67ca=\"\">wear life<\/a> in that they can only perform a limited number of erase cycles before becoming unreliable. That means they can only perform the plotting process for certain times since it involves rewriting data for new plots.","And since it takes at least hours to plot a plot, the early-mover advantage becomes obvious, which led to participants to buy more hard drives sooner than later.","Indeed, Chia blockchain explorer <a href=\"https:\/\/www.chiaexplorer.com\/charts\/netspace\" data-v-f87c67ca=\"\">shows<\/a> that since the mining mainnet launched in March, the space allocated to the network has more than four-folded to over 450 pebibyte (PiB) as of writing. Due to the increasing level of competition, the theoretical farming rewards per day for 1 tebibyte of plots have dropped from 0.03 earlier this month to now 0.019 XCH.","",""],"hashtag":[]}