{"summary":"Jay Clayton, chairman of the U.S. Securities and Exchange Commission (SEC), is stepping down at the end of this year.\nClayton’s departure comes months ahead of his scheduled release in June 2021.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/84713\/sec-chairman-jay-clayton-stepping-down","publishDate":"2020-11-16T07:43:08","id":3849,"type":null,"title":"SEC chairman Jay Clayton is stepping down, months ahead of his scheduled departure ","category":["Regulation"],"content":["Jay Clayton, chairman of the U.S. Securities and Exchange Commission (SEC), is stepping down from the agency at the end of this year.","Clayton's <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2020-284\" data-v-f87c67ca=\"\">departure comes<\/a> months ahead of his scheduled release in June 2021. Clayton was sworn in as the SEC chairman in May 2017 after being appointed by President Donald Trump. Now that Joe Biden has been elected as the new U.S. President, it remains to be seen who replaces Clayton.","“I would like to thank President Trump for the opportunity, and the support and freedom, to lead the women and men of the SEC,” said Clayton. “In addition, the cooperation and assistance of Secretary Mnuchin and his team at the Department of the Treasury, Chair Powell and Vice Chair Quarles and their colleagues at the Federal Reserve, Chairmen Giancarlo and Tarbert and the CFTC, Chairman McWilliams and the FDIC, and our other fellow federal financial regulatory agencies have been remarkable. ... I am also grateful to my fellow Commissioners and the SEC staff for their dedication. Through their continued service, I know the SEC is well-positioned for prolonged success.\"","The SEC said, under Clayton’s leadership, it enhanced the ability of businesses of all sizes to raise capital and also strengthened its enforcement programs. \"The Commission obtained orders for over $14 billion in monetary remedies, including a record $4.68 billion in fiscal year 2020, and returned approximately $3.5 billion to harmed investors,\" said the SEC. \"In addition, during Chairman Clayton’s tenure, the Commission paid approximately $565 million to whistleblowers, including the largest single award in the program’s history ($114 million).\"","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Crypto connection&nbsp;<\/strong><\/span>","The SEC also mentioned Clayton's enforcement efforts in the crypto space. In 2017, the initial coin offering (ICO) boom attracted the SEC's attention due to \"substantial fraudulent activity\" involved in these schemes. Under Clayton's chairmanship, the SEC said it acted \"quickly and decisively to combat fraud and pave the way for innovation.\"","In the crypto community, Clayton is also known for his cautious stance on bitcoin exchange-traded funds (ETFs).","Several bitcoin ETFs were filed with the SEC for approval under Clayton's leadership, but none received the green light. Clayton has expressed several concerns, including bitcoin price manipulation on unregulated crypto exchanges as well as lack of proper crypto custody providers, for not approving any bitcoin ETF to date.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nXRP's status also remains unclear. Clayton once said, \"some of these questions require a lot of information,\" referring to a question of whether XRP is a security or a utility token.","The crypto market could see some clarity around these issues if SEC Commissioner, Hester Peirce (aka Crypto Mom), replaces Clayton and takes the agency's helm."],"hashtag":["SEC"]}