{"summary":"Well-known crypto trader Jordan Fish, also known as Cobie, has started beta-testing his newly created crypto angel investor platform.\nThe platform, called Echo, is only available to self-certified and qualified investors.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285756\/crypto-vc-cobie-echo-beta","publishDate":"2024-03-30T06:11:12","id":3852,"type":null,"title":"Crypto trader Cobie launches beta version of angel investor platform Echo","category":["Venture Capital"],"content":["Well-known crypto trader Jordan Fish, known online under the pseudonym Cobie, has started beta testing Echo, his newly created crypto angel investor platform.","The platform is a way for crypto investors to join together in groups and make collective investments in crypto projects. The idea is to provide a unified network supporting angel investments in the crypto space, which has traditionally been fragmented.","\"Echo is brand new and probably not going to work. But any effort to level the playing field and increase access to early stage crypto investing seems like it’s worth a shot. So maybe we will fail but hopefully it will be an admirable failure. Cheers Tim,\" said Cobie over Telegram. \"It’s important to me you include 'cheers Tim' in the article.\"","According to Fish, Echo is \"only available to self-certified qualified\/sophisticated investors,\" and regional rules may apply. \"For example, Singapore residents will be subject to different rules to Japan residents and so on,\" he <a href=\"https:\/\/twitter.com\/cobie\/status\/1773427132976501237\" data-v-f87c67ca=\"\">explained<\/a> on X.","When users sign up, they must answer a \"very long\" questionnaire about their investing history. \"We rely on those answers and your self-certifications to understand if Echo is right for you,\" Fish noted.","The platform is currently in invite-only mode. Emails started getting sent to early adaptors on March 28."],"hashtag":[]}