{"summary":"The Red Cross is working on a blockchain project to help distribute tokenized aid to those in conflict zones. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/191686\/red-cross-unveils-prototype-for-blockchain-aid-distribution-project","publishDate":"2022-12-02T10:36:22","id":3861,"type":null,"title":"Red Cross to reveal prototype for blockchain-based aid distribution project","category":["THE BLOCK"],"content":["The International Committee of the Red Cross (ICRC) is testing concepts for distributing aid to people in conflict zones through blockchain technology.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The charity organization is in the prototype stages of developing a crypto alternative to cash-and-voucher assistance through a partnership with layer one network Partisia Blockchain that began earlier this year. <span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">If successful, it could result in the ICRC providing assistance via a \"stable utility token,\" the value of which would be pegged to the price of an asset in a manner similar to that of a stablecoin.&nbsp;<\/span>","The project's development has been funded both internally by the ICRC and by Partisia Blockchain, whose CEO Kurt Nielsen told The Block that it has raised $55 million to date through selling its native tokens.&nbsp;","Vincent Graf Narbel, head of the ICRC data protection office's tech hub, said in an interview with The Block: \"Our activity in a humanitarian context is what we call assistance, and over the 20 years or so, a growing part of our assistance is what we call cash-and-voucher assistance. ... Instead of giving goods to an affected population, we give the means by which they can decide themselves.\"&nbsp;","Currently, this is distributed through paper vouchers or cash. To complement these existing measures, the ICRC is developing a solution where recipients may receive aid via tokens in jurisdictions with the necessary internet and smartphone infrastructure.","The advantage over cash or vouchers is that the ICRC would be able to better manage the inflow and outflow, Graf Narbel said.&nbsp;","The project is still in development and it's not clear what asset would back the tokens&nbsp; — local currency, the U.S. dollar and even gold have been floated as possibilities by Graf Narbel and the Partisia Blockchain team. The Red Cross stressed that it would be the sole provider and redeemer of the tokens.&nbsp;","In practice, they would be sent to a wallet app held by beneficiaries assigned as redeemers of tokens. They could be transferred to others via QR codes, with the possibility of being cashed out by certain individuals.&nbsp;","\"It's really the option of redeeming these tokens that creates the value,\" said Partisia Blockchain's Nielsen. \"I could go to the bank and cash out, so I can see this is real money and not just numbers.\"&nbsp;","The organization decided to use blockchain technology because it wouldn't have to share personal data with third parties, and it found Partisia Blockchain's privacy focus appealing.","Partisia Blockchain uses a protocol based on multiparty computation (MPC) technology, which enables assessments and evaluations based on a group of users' private data — without revealing that data — to deposit and withdraw the tokens.&nbsp;","Nielsen plans to develop the project by using a combination of public and private smart contract tools. He said this would also ensure transparency, meaning that the ICRC could be aware of the transactions while disguising patterns of recognition that might otherwise be discerned from on-chain transaction data.","While the prototype project will be presented on Saturday at a Partisia Blockchain event, it's likely to be a long road ahead until it is deployed. It may take years, Graf Narbel said.&nbsp;","There are regulatory issues, he noted, as certain countries ban cryptocurrencies. A timeline for deployment also must take into account the ICRC's responsibility as a humanitarian aid provider.&nbsp;","\"We have a moral obligation to not be totally closed to new technologies, as there's always going to be more need than resources in humanitarian [work],\" he said. \"But firstly, we have to have a very cautious approach. We cannot have a mantra that says move fast and break things, because these are vulnerable people that we have to protect.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"ICRC","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"International Committee of the Red Cross (ICRC","content":"ORGANIZATION"},{"type":"Kurt Nielsen","content":"PERSON"},{"type":"Vincent Graf Narbel","content":"PERSON"},{"type":"Graf Narbel","content":"PERSON"},{"type":"Red Cross","content":"ORGANIZATION"},{"type":"Nielsen","content":"LOCATION"},{"type":"$55 million","content":"MONEY"},{"type":"MPC","content":"ORGANIZATION"},{"type":"Partisia Blockchain","content":"ORGANIZATION"},{"type":"Partisia Blockchain","content":"PERSON"},{"type":"Saturday","content":"DATE"}],"hashtag":[],"authors":["Tom Matsuda","The Block"]}