{"summary":"The proposed merger would see the respective tokens combined to create ASI with a fully diluted value of around $7.5 billion.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285020\/fetch-ai-singularitynet-and-ocean-protocol-tokens-surge-amid-merger-plans","publishDate":"2024-03-27T07:07:13","id":3863,"type":null,"title":"Fetch.ai, SingularityNET and Ocean Protocol tokens surge amid proposed merger plans","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Three blockchain-based data and AI projects, <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Fetch.ai <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248492\/fetch-ai-fet-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/Fetch.jpg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">FET<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.96%\n    <\/span><\/a> <!----><\/span><\/span>, <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">SingularityNET <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248489\/singularitynet-agix-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/singularitynet.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">AGIX<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.20%\n    <\/span><\/a> <!----><\/span><\/span>, and <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ocean Protocol <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/256935\/ocean-protocol-ocean-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ocean-protocol-logo.jpg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">OCEAN<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.96%\n    <\/span><\/a> <!----><\/span><\/span>, have entered into a proposed agreement to merge tokens.<\/span>","The proposed merger, dubbed the “Artificial Superintelligence Alliance,” would see the projects’ respective tokens become Artificial Superintelligence (ASI).","The projects’ existing tokens have surged amid the news, with Fetch.ai (FET) gaining 15% and SingularityNET (AGIX) gaining 12% over the past 24 hours. Ocean Protocol’s token, OCEAN, has seen the biggest rise, up more than 36% over the past 24 hours, according to The Block’s <a href=\"https:\/\/www.theblock.co\/price\/256935\/ocean-protocol-ocean-usd\" data-v-f87c67ca=\"\">price page<\/a>.","<span data-v-f87c67ca=\"\">OCEAN\/USD price chart. Image: <a href=\"https:\/\/www.theblock.co\/price\/256935\/ocean-protocol-ocean-usd\" data-v-f87c67ca=\"\">The Block\/TradingView<\/a>.<\/span>","The deal aims to create the largest open-sourced, independent player in AI research and development, according to a statement shared with The Block. The teams said the rationale for the move was to capitalize on the rise of AI and growth of the three AI projects, create a decentralized infrastructure at scale and accelerate investment into AI.","“We can deliver on the promise of a vertically integrated stack of decentralized technologies while gaining scale to compete globally. The combination of our technologies creates a leader in R&amp;D, applications and commercialization of AGI,” Bruce Pon, Ocean Protocol CEO and co-founder, said. “The unified ASI token is the glue to orchestrate all actors with common incentives. ASI tokens are used to secure the public network, as data access tokens and to unlock computation without needing traditional banking and payment rails. It’s the native currency for the machine economy.”","The three projects are due to submit integration proposals to the respective governance communities today for a 14-day consultation period. Voting on the proposal is then anticipated to take place between April 2 and April 16.","If the proposals are approved by each community, FET will become ASI with a total supply of 2.63 billion tokens and a starting price of $2.82. AGIX and OCEAN will migrate to ASI at a conversion rate of 0.43335 to 1 and 0.433226 to 1, respectively. The newly merged ASI token would have a fully diluted value of $7.5 billion at current prices.","“In a world of exploding AI innovation, the giants of Big Tech dominate the headlines and conversations. We’re forging a different path. Our mission is to combine our platforms to ensure ethical and transparent artificial intelligence to decentralize AI,” Humayun Sheikh, Fetch.ai CEO and Founder and early DeepMind investor, said. “Decentralized AI facilitates direct interactions between developers and users, bypassing the traditional gatekeepers of centralized authorities. This enhances data privacy and paves the way for a more democratic and trustworthy AI ecosystem and encourages global participants to contribute.”","A governing council for the “Superintelligence Collective” would be established to “monitor and guide the operations of the merged tokenomic network.” The Superintelligence Collective would be led by SingularityNET founder Dr. Ben Goertzel as CEO, with Fetch.ai founder Humayun Sheikh taking on the role of Chairman and Bruce Pon and Trent McConaghy representing Ocean Protocol.","“The organizations helping guide the development of the three merging networks, Fetch.ai, Ocean Protocol Foundation and SingularityNET Foundation, will continue to operate as separate entities but will collaborate closely in the shared ASI tokenomic ecosystem and the operation of the Superintelligence Collective,” the teams said.","“It is imperative, as the AI revolution intensifies, to ensure that AGI and ASI as they develop are not owned and controlled by any particular party with its biased interests. They should be rolled out in an open, democratic and decentralized way,” Dr. Ben Goertzel, Founder and CEO of SingularityNET added. “This has been the joint vision of SingularityNET, Fetch.ai and Ocean Protocol from their inception, and for this reason, it makes total sense that our three projects come together to form a tokenomic network that has greater power to take on Big Tech and shift the center of gravity of the AI world into the decentralized ecosystem.”","A community joint call is scheduled to take place on an X Spaces tomorrow at 4 p.m. ET to discuss the pending merger.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"AGI","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"12%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$7.5 billion","content":"MONEY"},{"type":"USD","content":"ORGANIZATION"},{"type":"$2.82","content":"MONEY"},{"type":"Bruce Pon","content":"PERSON"},{"type":"15%","content":"PERCENT"},{"type":"Ocean Protocol","content":"ORGANIZATION"},{"type":"Ben Goertzel","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"April 2","content":"DATE"},{"type":"Big Tech","content":"ORGANIZATION"},{"type":"SingularityNET Foundation","content":"ORGANIZATION"},{"type":"-1.96%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Humayun Sheikh","content":"PERSON"},{"type":"4 p.m.","content":"TIME"},{"type":"Ocean Protocol Foundation","content":"ORGANIZATION"},{"type":"Artificial Superintelligence Alliance","content":"ORGANIZATION"},{"type":"The Block\/TradingView","content":"ORGANIZATION"},{"type":"36%","content":"PERCENT"},{"type":"FET","content":"ORGANIZATION"},{"type":"-0.20%","content":"PERCENT"},{"type":"April 16","content":"DATE"},{"type":"Superintelligence Collective","content":"ORGANIZATION"},{"type":"2.63 billion","content":"MONEY"},{"type":"Trent McConaghy representing Ocean Protocol","content":"ORGANIZATION"}],"hashtag":["GOVERNANCE VOTES"],"authors":["James Hunt","The Block"]}