{"summary":"CFTC Commissioner Caroline Pham’s profile has grown in the crypto space – to the chagrin of some critics.\nHer ascent to the spotlight came as the CFTC grows has tried to increase its power over the crypto industry – and FTX imploded. ","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/207626\/pham-club-a-cftc-commissioners-enthusiasm-for-crypto-draws-attention","publishDate":"2023-02-03T05:30:20","id":3864,"type":null,"title":"Pham Club: A CFTC commissioner’s enthusiasm for crypto draws attention","category":["Policy"],"content":["The courtship between the crypto industry and Washington, D.C. captivated the financial policy world over the past year.","As that saga has played out, Caroline Pham emerged as something of a celebrity in the industry.","In the nine months since her confirmation as commissioner at the Commodity Futures Trading Commission, Pham has firmly established a brand based on her interest in – and some critics say advocacy for – the crypto industry.","The past three months have shifted that legacy, particularly given the CFTC’s interactions with FTX, which is now facing enforcement actions from the regulator. But the commission still wants more power to take point on crypto exchange regulation.","“Digital assets are important right now,” she said shortly before FTX’s collapse. “You can’t open up a newspaper without seeing crypto assets somewhere in there.”","Early in her term Pham became a headliner at crypto industry events and is, by the number of public appearances, the most visible member of the commission other than Chairman Rostin Behnam.","Pham rode that wave of publicity. An analysis of Pham’s Twitter feed turns up 89 mentions of “crypto” and 26 mentions of “web3” since taking office. That compares to eight for “ag,” four for “cotton,” three for “corn,” and one each for “beef,” “soybeans” and “oil,” though the last was from 2013.","In conversation, she is keen to reference her work with traditional commodities, as well as her meetings with central bankers internationally. At the time of FTX’s collapse, Pham tallied 25 public appearances, statements, or op-eds focused on crypto regulation. FOIA requests showed over 60 more meetings with private entities focusing on crypto policy from April through the end of November.","“Crypto events — as well as lots of others like regulators and think tanks — invite me to come and speak. And I have a responsible message. It’s not like, ‘to the moon,’ but it’s also not like terrible and evil. We need to take a balanced approach and look at each issue,” said Pham.","Not everyone has appreciated the CFTC's embrace of new technology. The reputational meltdown of FTX and criminal charges against CEO Sam Bankman-Fried, including questions over the legality of his political maneuvering, has had many in Washington, D.C. vocally disowning ties to the firm. Regulators are no exception, with Behnam and Pham, among others, suddenly playing defense about meetings with the leaders of FTX after the crypto firm's epic collapse.&nbsp;","Former Securities and Exchange Commission enforcement head John Reed Stark, a frequent crypto critic, saw Pham’s approach as a symptom of “regulatory capture.”","Stark, a critic of digital assets, criticized industry conference appearances and pictures posted by regulators, adding “the way they scurry around town for these photo-ops in these really disturbing situations.”","Some longtime Washington observers see the CFTC’s relationship with the industry as suspect, and Pham especially as compromised. Progressives are typically more suspicious of relationships between regulators and private industry – often sounding the alarm on <a href=\"https:\/\/www.theblock.co\/post\/179692\/warren-aoc-lead-progressive-letter-to-regulators-on-crypto-industry-revolving-door\" data-v-f87c67ca=\"\">the revolving door<\/a> between the two.","“With Pham specifically, I think she has positioned herself to get a very good job for herself after she leaves,” said Timi Iwayemi, of the Center for Economic and Policy Research’s Revolving Door Project. “If she continues making these overtures, I don’t imagine her keeping her position very long.”","&nbsp;But others argue engagement's important to functional economic oversight.","“I personally wouldn’t want to live in a world where industry was never able to make its concerns known to a regulator,” says Jack Solowey, a fintech policy analyst at libertarian think tank the Cato Institute. “You have issues of regulatory capture, but restricting free speech is not the right way to address regulatory capture.”","Never far from the push to give the CFTC more power was FTX.","Pham met on four separate occasions with FTX.US, according to official calendar information obtained through the Freedom of Information Act. The last meeting was on November 11, the day that FTX would declare bankruptcy and just three days before the firm withdrew its application with the CFTC to offer derivatives trading without an intervening merchant, though that videoconference was apparently not about the application, staff told The Block.","Pham says she wouldn't change those meetings, given the chance to go back.","“I asked them a bunch of questions,” she explained.","Pham also isn't the only regulator to garner attention for engagement with the scandal-ridden fallen crypto giant. Crypto industry lightning rod Securities and Exchange Commission Chair Gary Gensler, among many others in Washington, <a href=\"https:\/\/www.google.com\/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=2ahUKEwjE2ZXc1vX8AhVvkokEHXH1AScQFnoECBYQAQ&amp;url=https%3A%2F%2Fwww.theblock.co%2Fpost%2F186908%2Fftx-asked-about-but-did-not-receive-special-exemption-from-sec&amp;usg=AOvVaw0GR8kTvMKK0lUg4h9r7ISg\" data-v-f87c67ca=\"\">met with FTX executives last year<\/a>.","But unlike Gensler, Pham posted about it. in her first week in office, Pham tweeted a picture of her meeting with Sam Bankman-Fried and Mark Wetjen, the head of policy and regulatory strategy at FTX.US and a former CFTC commissioner himself.","Despite taking it down, Pham received a new wave of criticism in the aftermath of FTX going under. She pushed back to questions about the optics on <a href=\"https:\/\/twitter.com\/CarolineDPham\/status\/1591444874523545603\" data-v-f87c67ca=\"\">Twitter<\/a>, calling the meetings \"old news\" and saying she \"posted pictures of my meetings with ag, energy &amp; digital asset sectors during my first week as a Commissioner in April.\"&nbsp;","Pham first took an interest in financial regulation during law school; prior to working in the private sector, Pham spent time in the enforcement divisions of the CFTC, SEC, and the Office of the Comptroller of the Currency between 2009 and 2014. Those roles put her close to the implementation of Dodd-Frank, which she calls “a moment to be in the room while history is being made.”","Pham eventually ended up at Citibank. In the span of seven years of putting in “countless hours and sleepless nights,” she made her way to a managing directorship.","Her term at the CFTC coincides with a push for a new national regulatory regime for crypto exchanges. It would be the biggest expansion of the commission’s role since Dodd-Frank.","Pham, for her part, notes that she left a high-paying finance job to take her current role at the CFTC, describing her pursuit of a regulatory position as coming from, “a deep sense of civic duty,” during Senate testimony.","“From the beginning I’ve talked about all of the risks that are out there,” Pham said of cryptocurrencies in the aftermath of the FTX fallout. “They need to be held to the same standards as any other type of financial activity.”","Pham may be especially noticeable among the crypto industry's inhabitants, but she is far from alone among the commission in terms of engagement on digital assets. In addition to Behnam, who has pushed relentlessly for a CFTC regime for exchanges, both his fellow Democrats on the Commission, Kristin Johnson and Christy Goldsmith Romero, tout that they taught classes on digital assets, at Emory and the University of Virginia, respectively.","And beyond cynical notions of publicity, regulators want to have an impact on emergent issues. Crypto market regulation is far more malleable than the rest of the CFTC’s portfolio right now. It’s a point in time when careers and reputations are made. And given the CFTC’s tradition of naming chairs from within the agency, Pham could be a likely candidate to head the agency should Republicans win the U.S. presidency in 2024.","Since FTX’s epic meltdown, Pham has expressed less enthusiasm in public statements about crypto.","But she hasn’t stopped her engagement with the industry.","On Jan. 12, she <a href=\"https:\/\/www.cftc.gov\/PressRoom\/PressReleases\/8648-23\" data-v-f87c67ca=\"\">named<\/a> crypto industry representatives, including Chamber of Digital Commerce CEO Perianne Boring and Uniswap Labs COO Mary-Catherine Lader to the CFTC’S Global Markets Advisory Committee, a panel meant to advise the commission on U.S. market competitiveness in comparison to other countries."],"hashtag":["CFTC","GARY GENSLER","SAM BANKMAN-FRIED","SENATE AGRICULTURE COMMITTEE"]}