{"summary":"The Azuki team also provided further details on a forthcoming animated series and other tokenized projects.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237275\/azuki-addresses-missteps-in-elementals-mint-notes-plans-for-animated-series","publishDate":"2023-06-30T14:51:18","id":3865,"type":null,"title":"Azuki addresses missteps in Elementals mint, notes plans for animated series","category":["METAVERSE & NFT"],"content":["The team behind the blue-chip NFT project Azuki addressed community concerns regarding the Elementals drop this week.&nbsp;","\"The team stated that the core focus of Azuki is to not only deliver a product, but to also deliver an experience,\" Azuki member Arcanic wrote in a&nbsp;<a href=\"https:\/\/twitter.com\/ArcanicNFT\/status\/1674609957356855296?s=20\" data-v-f87c67ca=\"\">summary<\/a> of a Q&amp;A with the team. \"Many iterations and body-types were created while experimenting. But the team wanted to capture the same feeling that people got when browsing through the OG Azuki collection. This was their intent, but they missed the mark here.\"","The team also addressed the mint mechanics, in which minters saw the true Azuki artwork after the mint finished. The hit NFT project <a href=\"https:\/\/www.theblock.co\/linked\/99824\/dapper-labs-nba-top-shot-new-funding-305-million\" data-v-f87c67ca=\"\">NBA Top Shot<\/a> inspired the Azuki team to go for a live reveal fo the artwork, integrating AI and social media to augment the minting process. \"They agree they missed the mark here too,\" Arcanic notes.","To prevent what occurred with the Elementals drop, the Azuki team will allow community members to vote on new moves. This entails updating the background of the Elementals artwork that the community has \"full say\" over.","The Azuki Elementals mint occurred on June 27, with the first 10 minutes reserved for Azuki NFT holders and the subsequent 10 minutes for Beanz Official holders. After those 20 minutes, the public was then set to have a chance to grab an Azuki NFT, which the team noted was an attempt to grow the community.","However, the mint sold out after just 15 minutes, netting Azuki <a href=\"https:\/\/www.theblock.co\/post\/236681\/azuki-nft-collections-ends-elemental-mint-with-37-5-million-before-it-was-ever-open-to-the-public\" data-v-f87c67ca=\"\">$37.5 million<\/a>.&nbsp;","The community raised <a href=\"https:\/\/www.theblock.co\/post\/236923\/azuki-elementals-nft\" data-v-f87c67ca=\"\">concerns<\/a> regarding the mint, stating that it failed to bring in new members as promised. What's more, they claimed the Elementals art style appeared too similar to the original Azuki collection.","<span data-v-f87c67ca=\"\">Azuki #1898. Image: OpenSea<\/span>","<span data-v-f87c67ca=\"\">Elemental #18705. Image: OpenSea<\/span>","Long-term holders sold off their Azuki NFTs en masse after the Elementals mint, with sell-offs spiking <a href=\"https:\/\/www.theblock.co\/post\/237081\/long-term-azuki-holders-selling-jumps-817-after-elemental-drop-nansen\" data-v-f87c67ca=\"\">817%<\/a>, The Block previously reported.","The Azuki team, meanwhile, has an animated series underway, which they will fully self-fund and release as shorts. \"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">The team believes that the anime industry can be disrupted using decentralized IP\/Web3 tech,\" Arcanic wrote.<\/span>","Azuki already published an animated <a href=\"https:\/\/twitter.com\/Azuki\/status\/1672502507963023360\" data-v-f87c67ca=\"\">teaser<\/a> depicting Azuki Elemental avatars showing off powerful control over water, fire, lighting and earth.&nbsp;","\"Imagine watching an anime, and afterwards you can interact with an NPC in the anime, whether that's via Twitter or a web-app, and the NPC can issue you tokens with which you can interact,\" Azuki team member Zagabond was quoted as saying.","Zagabond also teased at a second project in the works that tokenizes Azuki culture. \"Nothing else is known about this,\" Arcanic wrote. \"So we will have to wait and see.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"OG Azuki","content":"ORGANIZATION"},{"type":"Azuki Elementals mint","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"817%","content":"PERCENT"},{"type":"NPC","content":"ORGANIZATION"},{"type":"Azuki NFT","content":"ORGANIZATION"},{"type":"Beanz Official","content":"ORGANIZATION"},{"type":"June 27","content":"DATE"},{"type":"$37.5 million","content":"MONEY"},{"type":"1898","content":"DATE"}],"hashtag":["AZUKI"],"authors":["MK Manoylov","The Block"]}