{"summary":"The Block&#x27;s Research Analysts make their predictions on the biggest trends and changes that might happen over the next year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/270037\/the-block-researchs-analysts-2024-predictions","publishDate":"2024-01-02T17:08:15","id":3866,"type":null,"title":"The Block Research’s Analysts: 2024 Predictions","category":["MARKET RECAP"],"content":["<span data-v-f87c67ca=\"\">Every year, The Block Pro Research's team of analysts make predictions on what we think will be the new trends, narratives, and expectations for the new year. This year's predictions include our thoughts on how artificial intelligence will play into crypto, whether we believe the bitcoin ETF will be approved, and much more.<\/span>","<b data-v-f87c67ca=\"\">George Calle<\/b>","<span data-v-f87c67ca=\"\">Total crypto market cap, along with key large caps (BTC, ETH and SOL), will appreciate amid a generally risk-on environment in 2024. Crypto will broadly outperform broader equities and tech sector indices. A cash-settled BTC ETF happens in early Q1, but BTC dominance will falter through most of the year as investors turn to alternatives with greater potential upside.<\/span>","<span data-v-f87c67ca=\"\">The Dencun Upgrade, which introduces proto-danksharding, will occur in late Q1 or early Q2 2024. This will result in a fundamentals-driven rally across L2 tokens and their ecosystems as net profit margins grow. This will also drive a speculative cycle around platforms that service the broader modular blockchain stack.<\/span>","<span data-v-f87c67ca=\"\">The DeFi sector will benefit from both financial and technical innovation sowed in 2023. Regarding the former, the growth of liquid staking protocols in 2023 will allow for staking yields to permeate into broader types of DeFi products, such as interest-bearing stablecoins, pushing up ‘risk free rates’ across the sector. Regarding the latter, new yield-optimizing DeFi products will start to leverage account abstraction and multichain protocols to pass on multi-loop and cross-chain strategies to users.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The DePIN sector will experience a renaissance amid the growth in either real or perceived utility of decentralized infrastructure for AI. Given AI needs compute, datasets, storage, and potentially a common unit of exchange, this rally will likely touch many existing players within the DePIN sector while also catalyzing the development of new players.<\/span>","<span data-v-f87c67ca=\"\">In public markets, COIN will continue to be the crypto equity that performs the strongest given its (i) role as custodian for multiple approved ETFs, (ii) growth in international markets and launch of adjacent exchange products in the US, and (iii) potential upside from developing an L2. Circle may IPO, but performance will be comparatively lackluster amid shrinking stablecoin market share and risk of reduced profits due to potential rate cuts.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Steven Zheng<\/b>","<span data-v-f87c67ca=\"\">2024 is the year we see modularity vs integrated approaches finally play out. Ethereum will ship proto-danksharding and, alongside modular protocols like EigenLayer and Celestia, really kick off a wave of appchain rollups, which we’ve already seen versions of with OP Stack. I predict we will see at least 20 “Ethereum-aligned” appchains with $1B TVL or more. On the integrated side, the resurgence of Solana and Sei Network, plus the anticipated launch of Monad, will show the industry how powerful parallel processing\/execution can become. I expect the top 10 market cap will include two layer 1 blockchains primarily focused on parallelization.<\/span>","<span data-v-f87c67ca=\"\">Coinbase will become a half-trillion-dollar company. The first Bitcoin ETF will break inflow records for ETF launches. No Ethereum ETF approval. Decentralized computing becomes a refreshed narrative on the back of the AI hype. The top 10 coins by market cap (not counting stablecoins and wrapped assets) will include two memecoins. NFT season will see a resurgence of activity induced by a handful of airdrops from major marketplaces and projects. Ordinals make up 25% of Bitcoin miner fee revenue in 2024.<\/span>","<b data-v-f87c67ca=\"\">Eden Au<\/b>","<span data-v-f87c67ca=\"\">In terms of price action, spot BTC ETF approval is a “sell the news” event. Still, BTC sets a new all-time high. ETH outperforms BTC amid spot ETF speculation. Likewise, COIN outperforms BTC as Coinbase becomes the go-to custodian for major spot ETFs. TIA emerges as an outperformer, capitalizing on community discussions surrounding (over-)extreme blockchain modularization, unfazed by a “bullish unlock” event in Q4. Tokens related to non-EVM layer-2s (e.g., Eclipse and Starknet) and decentralized computing get bids.<\/span>","<span data-v-f87c67ca=\"\">Regarding scaling, the successful implementation of EIP-4844 has no significant short-term impact on L2 adoption. Arbiturm One and OP Mainnet remain the most popular L2 by some margin. Application-specific L3s are launched. On the other hand, certain Cosmos sidechains generate organic traffic facilitated by the adoption of native USDC via Noble.<\/span>","<span data-v-f87c67ca=\"\">In the realms of DeFi, (re)staking ignites a liquidity black hole that sucks in so much ETH.<\/span>","<span data-v-f87c67ca=\"\">Derivatives DEXs emerge as top performers due to UX improvement and recovering market conditions. Tokenized securities and private credit see sustained growth, propelled by the emergence of RWA-focused lending protocols. Prediction markets experience a resurgence ahead of the US presidential election.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">NFT trading volume gradually recovers, but OG collections such as CryptoPunks and BAYC do not set new all-time highs in floor price. Ordinals haters attempt to fork Bitcoin but fail. In the arena of AAA games, Parallel and Illuvium witness explosive adoption among crypto natives which catalyze a “GameFi season.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Conversely, social, privacy, and insurance sectors undergo a phase of stagnation. AI-related products struggle to find product-market fit despite narrative-driven speculation.<\/span>","<b data-v-f87c67ca=\"\">Brandon Kae<\/b>","<span data-v-f87c67ca=\"\">The AI sub-sector of the crypto industry will likely be one of the best-performing sectors of the year. Key issues with traditional models, such as centralization and regulatory challenges, will likely prompt growing interest in open-source, “decentralized” AI\/ML developments. Moreover, the crypto industry’s enablement for market participants to invest and speculate on AI-related opportunities that are otherwise unavailable in traditional markets will only add fuel to the narrative fire.<\/span>","<span data-v-f87c67ca=\"\">At least 1 AI-related project enters the top 10 by market capitalization by the end of the year, and many more reach multi-billion dollar valuations.<\/span>","<span data-v-f87c67ca=\"\">ETHBTC ends the year higher than it started, but “the flippening” does not happen.<\/span>","<span data-v-f87c67ca=\"\">Telegram trading bots will experience product developments that enhances their UX and will maintain their popularity among market participants despite inherent security risks.<\/span>","<span data-v-f87c67ca=\"\">At least one NFT collection will surpass the market capitalization of BAYC, as well as launch their own token and achieve mass recognition among non-crypto natives.<\/span>","<b data-v-f87c67ca=\"\">Abraham Eid<\/b>","<span data-v-f87c67ca=\"\">With an increased focus on tokenizing securities in traditional finance, we’ll see a larger number of acquisitions of crypto-native infrastructure platforms to enable investment firms, banks, and financial market infrastructure players to more quickly solidify their digital asset product portfolios. We’ll also see more large-scale investment firms tokenize ETFs &amp; Money market funds on-chain, similar to Franklin Templeton’s approach with their Benji Investments FOBXX fund.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Web3 gaming will continue to struggle to find product-market fit despite receiving more positive speculation aided by exponential advances in generative AI.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">DeFi will experience its largest sources of product innovation from new real-world asset tokenization platforms, expanding beyond the primary existing areas of private credit and US treasuries.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Special-purpose DePIN networks for digital commodities like compute, storage, and bandwidth will continue to emerge, becoming more competitive in hyper-local markets than some traditional infrastructure providers.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Tech application categories, such as zero-knowledge machine learning, that combine the benefits of cryptography and AI will receive heavy speculation &amp; venture investment yet still not be at a technological maturity level for wide-scale usage.<\/span>","<b data-v-f87c67ca=\"\">Carlos Guzman<\/b>","<span data-v-f87c67ca=\"\">The general theme for 2024 will be one of resurgence for crypto and digital assets. Bullish sentiment early in the year will be driven by the expectation of a Bitcoin ETF approval, which will finally happen in Q1. However, the approval itself will be more of a ‘sell-the-news’ event without a sustained positive impact on Bitcoin prices in the short term. ETF inflows, while respectable, will not initially be massive in size.<\/span>","<span data-v-f87c67ca=\"\">Overall crypto market-cap will continue to be driven by macro and liquidity conditions, with all eyes placed on the movements of the U.S. Fed. Initial crypto excitement in Q1 will likely subside in the wake of a broader economic slowdown driven by the lagged effect of a higher interest rate environment on household and enterprise debt. The U.S. may tip into recession – or, even if a soft landing is achieved, macroeconomic indicators will be anemic early in the year. On the flip side, weak macroeconomic indicators may push the U.S. Fed to finally signal rate cuts, leading crypto to rally in the second half of the year.<\/span>","<span data-v-f87c67ca=\"\">Current excitement around Solana will subside somewhat early in the year and Bitcoin will dominate narratives in advance of the halving. Post-halving, however, we’ll see Bitcoin lose dominance in the face of broad-based alt outperformance. ETH and L2 tokens will rally on the back of EIP-4844’s implementation due to lower fees and renewed narratives around the ecosystem’s scalability. Alt-L1s will also rally as the market also bets on integrated approaches to scaling smart contract platforms. Platforms like Aptos, Sui, Sei, Solana, Monad and NEAR will be subjects of focus as this narrative gains steam.<\/span>","<span data-v-f87c67ca=\"\">Privacy-enabled smart contract platforms will be a major narrative throughout the year as platforms like Aztec, Aleo and Mina, among others, launch their fully featured smart-contract-enabled mainnets. There will be continued discussion and controversy regarding the tension between transactional data privacy and compliance in privacy-centric chains, which will be addressed through novel solutions in privacy-preserving proof of identity and proof of innocence protocols.<\/span>","<span data-v-f87c67ca=\"\">Total stablecoin market cap will continue to grow, but the top incumbents USDT and USDC will lose market share in the face of growing competition from yield-bearing stablecoins. TRON will lose dominance as the leading platform for low-cost stablecoin transfers as awareness of other low-fee, low-latency chains grows and as other centralized exchanges gain market share from Binance. This trend will also negatively affect USDT in favor of its competitors.&nbsp;&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">2024 will be a record year for institutional adoption due to more mature infrastructure and new opportunities for yield. More crypto-savvy institutions will leverage app-specific rollups\/chains\/subnets to create walled-garden environments with public chain interoperability and will also take advantage of innovations like smart contract hooks to interact with the counterparties of their choice. With TradFi yields potentially falling in the second half of the year,&nbsp; there will be renewed interest in institutional-grade staking products, and we’ll see a revival of CeFi lending, this time incorporating DeFi elements to enhance transparency and trustlessness. We’ll see continued growth in RWAs, with the interest in tokenized treasuries further expanding to other, higher-yielding assets like enterprise and consumer debt.<\/span>","<span data-v-f87c67ca=\"\">2024 will also be another record year for smart contract hacks and exploits. We’ll see the first major L2 exploit, along with possibly the first L2 rug pull, as deploying L2s and L3s becomes easier and more commonplace. Security will become the biggest remaining roadblock to mass adoption, leading the industry to gain renewed concern in solving it.<\/span>","<b data-v-f87c67ca=\"\">Jaiden Percheson<\/b>","<span data-v-f87c67ca=\"\">There will likely be another sovereign state adopting Bitcoin as legal tender, possibly in Africa or Latin America. The intersection of Artificial Intelligence and Blockchain will be one of the most hyped themes of 2024, and the Crypto Total Market Cap, excluding BTC and ETH, will reach at least $1T.<\/span>","<span data-v-f87c67ca=\"\">Many crypto equities perform well, with a focus on Coinbase and Bitcoin miners. Coinbase hits a new all-time high, and the approval of a Bitcoin ETF solidifies institutional interest with strong initial inflows.<\/span>","<span data-v-f87c67ca=\"\">ETHBTC does not make a new high, but ETH still catches a significant bid due to flows generated from the anticipated upgrades (i.e. EIP-4844) as well as the high potential for an ETF approval. The restaking narrative becomes another hot topic where Eigenlayer breaches $10B TVL.<\/span>","<b data-v-f87c67ca=\"\">Simon Cousaert<\/b>","<span data-v-f87c67ca=\"\">Zero-knowledge proof (ZKP) technology will get more widely adopted by numerous projects. This will lead to more private transactions, efficient scalability solutions like zk-rollups, and improved interoperability across blockchain networks. The adoption of ZKP technology paves the way for more advanced data-heavy, on-chain applications, although not yet in 2024.<\/span>","<span data-v-f87c67ca=\"\">Following the initial frenzy of the “DeFi Summer” in 2020, a phase marked by experimentation and heightened excitement, a more mature landscape for yield-generating opportunities will arise. This evolution will largely stem from the transition to a proof-of-stake consensus model, particularly post-merge, offering yield potentials on established assets such as ETH, its staking and re-staking models.<\/span>","<span data-v-f87c67ca=\"\">As the industry evolves and the legal framework matures, applications involving real-world assets (RWAs) are expected to gain popularity, albeit to a lesser extent than many anticipate.<\/span>","<b data-v-f87c67ca=\"\">Arnold Toh<\/b>","<span data-v-f87c67ca=\"\">Cosmos finally sees adoption rivaling larger L1s like Ethereum and Solana. Osmosis and Celestia will lead this wave of adoption.<\/span>","<span data-v-f87c67ca=\"\">L2s continue to proliferate; some will start merging or sunsetting. zkEVM will not prove to be advantageous over zkVM (i.e. Starknet will remain top 3 ZKRs amidst the many other zkEVMs). ZKRs release their governance token, kick-starting another wave of airdrop farming and bringing significant on-chain activity to ZKRs.<\/span>","<span data-v-f87c67ca=\"\">Restaking becomes Ethereum’s main narrative as there will be a lack of new DeFi narratives on Ethereum. EigenLayer will be the center of this narrative.<\/span>","<span data-v-f87c67ca=\"\">Web3 games will take off, potentially led by the likes of Illuvium and Parallel. Play-to-earn will not be a thing but rather, players will be incentivized to trade in-game NFTs. (i.e., trading game assets will give users in-game bonuses)<\/span>","<b data-v-f87c67ca=\"\">Marcel Bluhm<\/b>","<span data-v-f87c67ca=\"\">2024 will see a further increase in institutional engagement within the crypto space. This is driven by, firstly, institutional involvement with spot U.S. ETFs that will be greenlighted and an influx of complex derivative products that are anchored to them. Secondly, the massive adoption of real-world assets involving established institutional players will benefit tailor-made infrastructures, particularly app chains that will capitalize on this trend by offering customized solutions that maintain connectivity to public blockchain rails.<\/span>","<span data-v-f87c67ca=\"\">Bitcoin is set to uphold its supremacy in market capitalization, while the Ethereum ecosystem will continue to dominate as the principal smart contract platform. Meanwhile, Solana will intensify the competition, ascending to the third rank in market cap and challenging Ethereum's position. The aggregate crypto marketcap continues to be macro\/liquidity-driven and, after seeing new all-time highs in 2024, will end the year lower than it began.<\/span>","<span data-v-f87c67ca=\"\">2024 will be the year of the first on-chain game that is loved by actual gamers despite its crypto elements, merging captivating gameplay with innovative crypto tokenomics to fuel its on-chain economy.<\/span>","<span data-v-f87c67ca=\"\">&nbsp;<\/span><span data-v-f87c67ca=\"\">The U.S. president will make use of his executive control over appointed officials and fire Gary Gensler in Summer ‘24. On that occasion, he will also issue a presidential Gens-Rekt NFT collection to commemorate the event.<\/span>","<b data-v-f87c67ca=\"\">Mohamed Ayadi&nbsp;<\/b>","<span data-v-f87c67ca=\"\">In 2024, the rollup war will intensify, and the Ethereum ecosystem will witness a significant boom in the number of layer-2s being created and developed, primarily focused on zero-knowledge powered rollups and dApp rollups. The growth will be so substantial that the number of rollups deployed on Ethereum will likely exceed the total number of active dApps on some of these rollups. We will see current dApps developing their own rollups and bridging infrastructure, leading to a crowded space (and confusing for newbies) where only a few rollups truly succeed and achieve user activity levels comparable to that of major layer-1s. The typical infrastructure for a “non-major” rollup will be to opt to utilize currently available implementations of zero-knowledge proofs (such as Polygon’s Chain Development Kit - CDK) and Celestia’s data availability rather than developing their own zkEVM or zkVM. However, despite the rollup craze, the surge in activity will be mostly driven by airdrop farmers rather than long-term users, while the influx of rollup creation and the necessity of bridging will further degrade and exacerbate the user experience on Ethereum and also lead to more bridge-related hacks, underscoring the importance for more robust wallet solutions and infrastructure improvements to facilitate mass user adoption on modular blockchains.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">With the anticipated approval of the Bitcoin (and likely Ethereum) Spot ETFs, there will be increased activity and growth in real-world assets (RWAs) and related protocols. However, due to fear of regulatory scrutiny and legal action from the Securities and Exchange Commission, many teams will opt to wait for clarity rather than rush to innovation, hampering the speed of growth in the sector. The Spot ETF approval will give the go-ahead signal for traditional finance and tech companies to ramp up their blockchain research and development initiatives, both on public and private blockchains, by the end of 2024 and 2025. Another large beneficiary of the ETF move will be Coinbase, which will continue to grow its international outreach and likely make new ATHs in revenue and profits by late 2024 and 2025, leading it to become a popular topic on Wall Street.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In another Universe, Layer-0 networks such as Polkadot and Cosmos will continue their growth and development, but they may also continue receiving less attention compared to the newer, less modular but shiny Layer-1s, and Layer-2s. On the other hand, Solana will significantly grow both in its ecosystem and market capitalization (cementing itself as the new number 3 instead of BNB Chain), and host new types of dApps and trends that are more retail-focused and not possible on Ethereum. With its low transaction cost and user-friendly wallets, Solana will alter the common newbie investment narrative to include Solana alongside Bitcoin and Ethereum as the primary ‘safer’ cryptocurrency investments.<\/span>","<b data-v-f87c67ca=\"\">Rebecca Stevens<\/b>","<span data-v-f87c67ca=\"\">The approval of a spot bitcoin ETF helps boost crypto adoption and also helps many large cap crypto assets outperform more traditional assets throughout the year.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The bitcoin spot ETF sparks a surge of institutional interest, and the bridge between DeFi and TradFi continues to grow. In turn, tokenized real-world assets see more adoption as a wider variety of traditional finance elements make their way to an on-chain environment.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While Ethereum continues to dominate the smart contract space, other networks (both alternative layer 1s and layer 2s for Ethereum itself) begin to eat heavily into its market share as excitement into newer protocols and new narratives increases amidst more bullish market conditions. All in all, DeFi shows a strong recovery and monthly DEX volumes hit a new all time high.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Ordinals continue to drive the NFT scene and the infrastructure for Ordinals and BRC-20 tokens continues to evolve. While the market largely recovers, many of the originally popular PFP NFT collections do not see hype return to 2021 levels. Gaming NFTs will come to be more popular than art and collectibles.<\/span>","<b data-v-f87c67ca=\"\">Jae Oh Song<\/b>","<span data-v-f87c67ca=\"\">With Bitcoin ETF and halving approaching, Bitcoin would likely be showing robust performance. There may exist a sell-the-event type of price action, but it is highly unlikely that a bearish trend would continue throughout the entire Q1 as it is evident that institutional fund inflow will start to begin in scale.<\/span>","<span data-v-f87c67ca=\"\">Venture capital funding for Web3 startups is expected to rebound, reaching all-time highs throughout the year. VCs will show interest in new narratives, such as decentralized AI. However, a significant portion of the funding is likely to flow towards NFT gaming and infrastructure as these sectors offer more tangible references and a clearer business development stage for VCs.<\/span>","<span data-v-f87c67ca=\"\">The crypto options volume is projected to reach an all-time high due to the growing demand for hedging spot exposures by institutions implementing ETFs. Beyond VCs and ETF-based institutions, traditional hedge funds and quant-based funds are expected to expand into the crypto industry, driven by substantial capital inflows.<\/span>","<span data-v-f87c67ca=\"\">In the competitive landscape of Layer 1\/2 projects, Solana is anticipated to outperform existing Layer 1s, maintaining its status as the primary narrative throughout the cycle. Other Layer 1s will need to showcase their competitive strengths or may choose to acknowledge Solana's dominance, focusing on interoperability with Solana as a selling point and positioning themselves as beta plays within the market.<\/span>","<span data-v-f87c67ca=\"\">Existing Layer 2 projects such as Optimism, Arbitrum, and Polygon may show parabolic growth as market participants start to speculate on Ethereum Spot ETF approval. When such a narrative is formed, tokenless projects such as Manta, Scroll, and Starknet will show a huge boost in TVL and the ecosystem as retailers start to speculate about the potential airdrop.<\/span>","<b data-v-f87c67ca=\"\">Edvin Memet<\/b>","<span data-v-f87c67ca=\"\">As the market heats up, participants will allocate an increasing amount of time searching for alpha (near-immediate gratification\/feedback) rather than engaging in airdrop farming. To address this shift, users may turn to airdrop farming-as-a-service providers. This could lead to a speculative increase in the market cap of this category (~10x?), especially if\/when the first successful proof of concept emerges (i.e. avoiding detection and successfully farming a substantial airdrop).<\/span>","<span data-v-f87c67ca=\"\">Memecoin market cap will reach at least $75B, up from almost $25B currently. As the landscape becomes more saturated, \"meta-memecoins'' such as $BITCOIN (HarryPotterObamaSonic10Inu) will outperform due to clearer differentiation from other memecoins. A meta-memecoin will break $1B in market cap and\/or breach top 5 memecoins by market cap.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">ETH staking percentage will continue to steadily increase at a rate of around 1% per month. Consequently, LDO\/ETH will break ATHs. ETH performs well, possibly better than BTC. However, L2s might not outperform ETH as the space becomes increasingly crowded. In any case, many of the top L1s from the previous cycle will outperform L2s. Solana-killer narrative emerges, with the likes of Sei, Aptos, NEAR, Sui among the candidates. Sei and NEAR will outperform all of them, including Solana.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The approval of a Bitcoin spot ETF will have a positive impact on price but will not significantly affect on-chain activity. Therefore, onboarding and educating new users become key focus points, whether through NFTs\/Ordinals, games, social platforms, trading bots, or educational and credential initiatives. The \"Telegram bot\" category will continue being disrupted and fragmented by new entrants without meaningfully driving adoption from normies yet. However, Arkham or another unexpected contender might eye entry into the space. NEAR is expected to do well due to its focus on user experience and onboarding strategies. NFT projects with a credible chance of entering mainstream awareness à la Pudgy Penguins are also predicted to thrive. The floor price of low-inscription-number Ordinals (e.g. &lt;10k) will at least double.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Florence Kuria<\/b>","<span data-v-f87c67ca=\"\">In 2024, memecoins like Shiba Inu are expected to thrive, propelled by their large communities and transition from Ethereum to their own blockchains, promising more growth. The Shibarium blockchain, for example, a layer-2 network using SHIB tokens for transaction fees, is expected to boost Shiba Inu's credibility in the DeFi sector. However, traditional memecoins like Doge might lose some market share to newer memecoins, such as the rapidly popular BONK coin built on the Solana blockchain, as investors increasingly focus on these novel coins.<\/span>","<b data-v-f87c67ca=\"\">Atharv Deshpande<\/b>","<span data-v-f87c67ca=\"\">In 2024, the cryptocurrency markets are expected to outperform broader equity markets, with the notable exception of COIN. Despite predictions, ETH will not surpass BTC in market value, and similarly, SOL will not overtake ETH. Launching a Bitcoin ETF will initially calm the markets, followed by a significant influx of liquidity into BTC. This surge will initially favor Bitcoin, but the anticipated Ethereum ETF will trigger a bullish trend for ETH. Ethereum's liquid staking, currently the ecosystem's strongest narrative, is expected to gain substantial traction.<\/span>","<span data-v-f87c67ca=\"\">As Ethereum introduces dank sharding and emphasizes modularity, the appchain thesis will strengthen, reinforcing the potential of application-specific blockchains. Additionally, 2024 will see an increase in layer-2 adoption, with notable price movements in Arbitrum (ARB) and Optimism (OP).<\/span>","<span data-v-f87c67ca=\"\">The collective market capitalization of memecoin tokens is projected to exceed $50 billion by the end of 2024. Following the trend set in 2023 by BONK, another memecoin is expected to achieve unicorn status in 2024.<\/span>","<span data-v-f87c67ca=\"\">Layer-1 blockchains will continue to dominate the Top 100 cryptocurrencies by market capitalization. However, there will be an increasing share of Layer-2 solutions and memecoins, indicating a diversifying and evolving crypto landscape.<\/span>","<b data-v-f87c67ca=\"\">Kevin Peng<\/b>","<span data-v-f87c67ca=\"\">2024 will be a transformative year for the crypto industry, with the approval of Blackrock’s Bitcoin ETF jump-starting a new wave of institutional and subsequent retail flow. Lingering PTSD from 2022 and increasingly fragmented market attention will make it difficult for underdeveloped narratives to achieve escape velocity. Improved on-chain tooling will give rise to all-time highs in on-chain activity, enabling more memes and grassroots tokens to launch than ever before. Most will burn out quickly, but a very small handful of these will survive the year and break into the top 25 by market cap.<\/span>","<span data-v-f87c67ca=\"\">Surging on-chain activity will push blockchains to their limits and converge market attention around the ongoing integrated vs modular systems debate. Disagreement between proponents of these two approaches will become more extreme but will benefit both sides in terms of investor capital allocation. Integrated blockchains that support parallel execution will become rapidly more popular, while the deployment of functional data availability and zk-rollup scaling solutions will revive attention and support for L2s as well. Multichain protocols will also benefit from these narratives, with existing Cosmos chains becoming more vertically integrated and more interoperable at the same time. Solana will continue its resurgence and become the third-largest blockchain by market cap.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">AI will grow into a strong narrative, spawning countless new protocols that attempt to capture retail attention in this sector. Crypto will see a new use-case as the decentralized exchange of value for a wide range of AI-based services, but the cross between AI x crypto will ultimately fail to produce a protocol or company that can achieve long-term product-market fit in 2024. The crypto gaming sector will continue to mature, flirting with mainstream attention at times but mostly seeing increased acceptance from hardcore gamers, setting the stage for future growth.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Lars Hoffmann<\/b>","<span data-v-f87c67ca=\"\">2024 is the year the crypto industry finally gets its first US Bitcoin ETF. Multiple ETFs will be approved at the same time and further structured Bitcoin products will emerge in TradFi over the course of 2024. While a big win for the industry, it's a terrible look for Gensler and the SEC, which effectively had to be forced by court decisions to finally allow for a Bitcoin ETF. Post approvals, attention will shift to the first US Ethereum ETF and help the Ethereum ecosystem to finally catch a bid. The Nakamoto upgrade for Stacks in Q1 coupled with the Bitcoin halving in April\/May will lead to further attention for Bitcoin and a memecoin\/DeFi attention season on Bitcoin.<\/span>","<span data-v-f87c67ca=\"\">US-wise, both SBF and CZ will be found guilty and both will do jail time, albeit much more for SBF. Q4 2023 market performance made the FTX estate whole. Nonetheless, FTX customers won't see their assets anytime soon. Increasing attention will be drawn to how the bankruptcy estate is not acting in the best interest of FTX retail customers, both in terms of the high fees billed as well as in terms of cash vs. in-kind redemptions. The US election in September 2024 will prove pivotal for the further treatment of crypto in the US. Hong Kong, Singapore, Japan and South Korea will keep making small steps on their currently friendly crypto policy path, with Hong Kong getting increasingly bold in order to try to overcome the serious loss of business to Singapore during the lockdown years.<\/span>","<span data-v-f87c67ca=\"\">While 2023 activity has been mostly driven by institutions and incumbents, 2024 will bring back more genuine retail users. Surging on-chain activity will once more increase fees, push blockchains to their limits, and make the alt L1 narrative blossom once more. New ecosystem participants will onboard rather on Solana and other alt L1s than on Ethereum. The modular vs. monolithic question will ring once more through the Ethereum ecosystem, as many L2s fail to draw meaningful economic activity. Coupled, these two trends will lead to serious questions being asking within the Ethereum ecosystem about where to go from here. Moreover, new ecosystem participants will push both Gaming projects and memecoins to new heights. NFTs will also catch a serious bid once more, with legacy media putting renewed attention on pfps.<\/span>","<b data-v-f87c67ca=\"\">Edvinas Rupkus<\/b>","<span data-v-f87c67ca=\"\">2024 will be another memorable year in the crypto timeline, mostly from a positive perspective. Prospects of the global and primarily the US economy bringing inflation down without a major recession and a long-awaited ETF approval will increase risk appetite for many institutional and retail investors.<\/span>","<span data-v-f87c67ca=\"\">In general, 2024 will be similar to 2021 in terms of price action and overall activity onchain. If 2021 was about Layer-1 chains and the chase to be the “Eth killer,” the narrative in 2024 will be about Layer-2 rollups and modular blockchain solutions.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The chase for airdrops will lead to users trying out newer bridges, ending in a major bridge exploit. I expect many pump-and-dump schemes, especially on newly released rollups, which will be a major talking point for blockchain skeptics in Congress.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Since it will be an election year, crypto may become a partisan issue, with Democrats taking the anti- and Republicans taking the pro-crypto side. In the end, it will be just political signaling without serious legislation being passed towards crypto in 2024. We will, however, see more productive conversations and legislation passed in other parts of the world. One more country will follow El Salvador’s example and accept Bitcoin as legal tender.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">I am most excited about the dePIN sector of crypto and the potential projects such as Helium have for real-world applications. Token prices will still drive its application, requiring project founders to be creative and intelligent about tokenomics to ensure the project is sustainable throughout crypto cycles.<\/span>","<b data-v-f87c67ca=\"\">Ian Devendorf<\/b>","<span data-v-f87c67ca=\"\">In 2024, BTC dominance will continue to climb to reach roughly 70% in the first half of the year, driven by the approval of spot bitcoin ETF applications in Q1 and the Bitcoin halving event in Q2. If macro and liquidity conditions allow, BTC dominance will fade in the second half of the year as altcoins outperform with narratives around ETH scaling and Alt-L1’s such as Solana, Near, Aptos, Sui, and others.<\/span>","<span data-v-f87c67ca=\"\">Lending protocols and stablecoins will continue to benefit from incorporating real-world assets amid a high interest-rate environment. Corporate stablecoin launches will continue in 2024, as the ability to leverage short-term treasuries as collateral presents an attractive business model, though unique demand drivers will need to be established to gain meaningful market share. USDT will remain the dominant stablecoin by market share as its higher liquidity and entrenchment in various markets will prove difficult to overcome.<\/span>","<span data-v-f87c67ca=\"\">Ethereum’s Cancun\/Deneb upgrade will happen sometime in Q2 2024, which will result in positive price action for Ethereum L2s, including Optimism, Base, and Arbitrum, as profit margins improve. Although Ethereum’s fee revenue from L2s will diminish in 2024, Ethereum’s total fee revenue will be impacted only slightly as the bulk of revenue will continue to come from transactions directly on Ethereum. Rollups will continue to deal with ongoing technical challenges throughout 2024, limiting their adoption and the percentage of fee revenue contributed to Ethereum.<\/span>","<b data-v-f87c67ca=\"\">Afif Bandak<\/b>","<span data-v-f87c67ca=\"\">Spot BTC ETFs are launched in the US and see $10B of inflows this year. An ETH spot ETF is also approved in the US by Q4. The modular thesis continues to strengthen, ushering in a rollup Renaissance. EIP-4844 is deployed on mainnet; blob data accounts for 10-20% of ETH fees by EoY. Parallelized EVM chains will become a moderately popular narrative in 2024. LSDfi and staking continue to be the main DeFi narrative drivers.<\/span>","<b data-v-f87c67ca=\"\">Shamel Tejani<\/b>","<span data-v-f87c67ca=\"\">2024 will prove to be a more bullish year than 2023 for crypto participants. This will be the largest year for crypto airdrops. The main driver for retail adoption this year will not be the approval of the spot Bitcoin ETF or price appreciation in major crypto assets but rather the ‘fomo’ induced by airdrops. Big names such as zkSync, Starknet, Linea, LayerZero, and many projects in the Cosmos and Solana ecosystem are all due to launch their tokens, with many having made announcements of doing so before Q3. This will inject billions of dollars in liquidity into their respective ecosystems, allowing for rotations into native memes and NFTs, creating a wealth effect. Speculation around the Ethereum ETF and the Dencun upgrade mixed with the launch of EigenLayer, will bring attention back to ETH, giving ETH\/BTC some relief. DEX volumes increase against CEX’s, with new projects taking over. Bitcoin will drop 25% sometime during the first half of 2024. GCR starts tweeting again.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Brad Kay<\/b>","<span data-v-f87c67ca=\"\">In 2024, Ethereum will maintain its position as the leader in NFT volume, followed closely by Bitcoin and Solana. A notable development in the Bitcoin network will be the successful launch of a decentralized exchange (DEX) for BRC20 tokens. This advancement, akin to the transformative impact of Blur on NFTs, will revolutionize the way BRC20 tokens are traded, enhancing price discovery and substantially increasing trading volumes. Furthermore, we will observe a continued decline in royalty earnings on the Ethereum network. This trend will be driven by competitive pressures among marketplaces as they struggle to enforce royalty agreements.<\/span>","<b data-v-f87c67ca=\"\">John Dantoni<\/b>","<span data-v-f87c67ca=\"\">In 2024, we are poised to witness a groundbreaking year for digital assets, characterized by pivotal moments that will redefine the landscape and drive new growth. The highly anticipated approval of a Bitcoin ETF promises to inject new vitality into the sector, unlocking new liquidity.<\/span>","<span data-v-f87c67ca=\"\">Amidst this backdrop, two dominant investment philosophies, the modular and integrated approaches, will shape the investment landscape. Ethereum, bolstered by roll apps and modular protocols like Celestia, is set to lead the modular thesis. Simultaneously, Solana’s unwavering dominance in the integrated space will attract a wave of venture capital, positioning itself as the primary alternative to Ethereum and securing substantial financing.<\/span>","<span data-v-f87c67ca=\"\">Emerging narratives such as RWAs, DePin, and SocialFi will vie for market share, with Solana’s ecosystem emerging as the incubator for these early protocols that gain traction. The bulk of venture funding in this space will gravitate toward these types of applications, reinforcing Solana’s role in shaping the future of digital assets.<\/span>","<span data-v-f87c67ca=\"\">In the realm of Bitcoin, 2024 marks a resurgence of experimentation, with DeFi, Memecoins, and NFTs flourishing within its ecosystem. Solutions like Ordinals, Stacks, and BRC20 will serve as the catalysts for this experimentation. Discussions on inhibiting this growing ecosystem may arise, but the undeniable forces of the market and increased mining revenue will prevail, compelling proponents to embrace the evolving narratives within the Bitcoin ecosystem.<\/span>","<span data-v-f87c67ca=\"\">Venture funding is poised to undergo a noteworthy surge in 2024, acting as a lagging yet substantial indicator of the escalating market capitalization of digital assets. The first half of the year will witness venture funding reflecting the price appreciation already experienced, receiving in aggregate $6.5 billion. As euphoria permeates the funding markets in the second half, monthly funding will soar to an average of $3 billion, reminiscent of the fervor witnessed during the 2021\/22 run-up. By the end of 2024, the total venture funding will reach $24.5 billion, marking a 130% year-over-year increase in private funding.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mina","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Steven Zheng","content":"PERSON"},{"type":"Carlos Guzman","content":"PERSON"},{"type":"Brandon Kae","content":"PERSON"},{"type":"AAA","content":"ORGANIZATION"},{"type":"2025","content":"DATE"},{"type":"Shiba Inu","content":"ORGANIZATION"},{"type":"4844","content":"DATE"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"$24.5 billion","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Latin America","content":"LOCATION"},{"type":"$25B","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Gens","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"ZKP","content":"ORGANIZATION"},{"type":"Aleo","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Africa","content":"LOCATION"},{"type":"Deneb","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"George Calle","content":"PERSON"},{"type":"$BITCOIN","content":"MONEY"},{"type":"billions of dollars","content":"MONEY"},{"type":"$3 billion","content":"MONEY"},{"type":"Artificial Intelligence","content":"ORGANIZATION"},{"type":"John Dantoni","content":"PERSON"},{"type":"Blackrock","content":"ORGANIZATION"},{"type":"Kevin Peng","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"$75B","content":"MONEY"},{"type":"Arnold Toh","content":"ORGANIZATION"},{"type":"Linea","content":"LOCATION"},{"type":"$6.5 billion","content":"MONEY"},{"type":"$1T","content":"MONEY"},{"type":"Japan","content":"LOCATION"},{"type":"Sui","content":"PERSON"},{"type":"Celestia","content":"LOCATION"},{"type":"Memecoins","content":"PERSON"},{"type":"BNB","content":"ORGANIZATION"},{"type":"$10B","content":"MONEY"},{"type":"PFP NFT","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"Devendorf","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Summer","content":"DATE"},{"type":"South Korea","content":"LOCATION"},{"type":"70%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"BONK","content":"ORGANIZATION"},{"type":"Blockchain","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"130%","content":"PERCENT"},{"type":"$1B","content":"MONEY"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"Ethereum ETF","content":"ORGANIZATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"Rebecca Stevens","content":"PERSON"},{"type":"Cancun","content":"LOCATION"},{"type":"Florence Kuria","content":"LOCATION"},{"type":"Lars Hoffmann","content":"PERSON"},{"type":"Ethereum Spot ETF","content":"ORGANIZATION"},{"type":"second half of the year","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"The Block Pro Research","content":"ORGANIZATION"},{"type":"September 2024","content":"DATE"},{"type":"Pudgy Penguins","content":"ORGANIZATION"},{"type":"Solana","content":"LOCATION"},{"type":"OP Stack","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Brad Kay","content":"PERSON"},{"type":"Jaiden Percheson","content":"PERSON"},{"type":"LDO\/ETH","content":"ORGANIZATION"},{"type":"Nakamoto","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"Celestia","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Marcel Bluhm","content":"PERSON"},{"type":"20","content":"DATE"},{"type":"$50 billion","content":"MONEY"},{"type":"Aptos","content":"LOCATION"},{"type":"2024 marks","content":"MONEY"},{"type":"Gensler","content":"PERSON"},{"type":"U.S. Fed","content":"ORGANIZATION"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"SBF","content":"ORGANIZATION"},{"type":"TVL","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"the first half of 2024","content":"DATE"},{"type":"Universe","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"GCR","content":"ORGANIZATION"},{"type":"Manta","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"BRC","content":"ORGANIZATION"},{"type":"Dencun Upgrade","content":"ORGANIZATION"}],"hashtag":[],"authors":["The Block Research","The Block"]}