{"summary":"This new low could be due to a resurgence in on-chain activity.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/207871\/ether-supply-reaches-all-time-low-after-the-merge","publishDate":"2023-02-01T18:32:33","id":3868,"type":null,"title":"Ether supply reaches all-time low after The Merge","category":["LAYER 1S"],"content":["Ethereum's total circulating supply reached a post-Merge low today at approximately <a href=\"https:\/\/ultrasound.money\/\" data-v-f87c67ca=\"\">120.5 million<\/a> tokens.&nbsp;","The Merge, one of the biggest technical changes in the network's history that significantly modified its economics, switched Ethereum from proof-of-work to proof-of-stake and significantly decreased the total net issuance of ether.","The decreasing supply could be linked to the increasing price of Bitcoin and rising equity markets, as traders will often respond by buying higher-risk tokens that are only available on-chain. The demand for the network, or how many users are trying to create new transactions, causes the average ether burned from each transaction to rise, further reducing supply.","The total cost for transactions on Ethereum has steadily <a href=\"https:\/\/dune.com\/drethereum\/Gas-Fees\" data-v-f87c67ca=\"\">increased<\/a> since the beginning of 2023. It briefly was at the levels experienced in the third quarter of 2021, when bitcoin and ether prices were much higher.","NFT activity on Ethereum has also seen a small resurgence, <a href=\"https:\/\/dune.com\/rchen8\/opensea\" data-v-f87c67ca=\"\">according<\/a> to Dune Analytics. This activity isn't close to 2021 when volume set an all-time high, but it is another indication on-chain activity is coming back.&nbsp;","The circulating supply of ether is an important fundamental variable many analysts and traders look at when analyzing ether price, with the rationale being that less tokens circulating is good for the price.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"third quarter of 2021","content":"DATE"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}