{"summary":"The Court ruled that bZx DAO is plausibly a general partnership.\nAs such defendants who hold the DAO’s governance plausibly owe a duty of care to investors.","author":["Osato Avan-Nomayo","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/223237\/bzx-dao-liability-class-action","publishDate":"2023-03-28T08:16:55","id":3869,"type":null,"title":"DAO token holders are plausibly liable, judge rules in bZx class action","category":["Governance"],"content":["A U.S. judge denied a motion to bZx DAO token holders as defendants in a class action lawsuit filed by some victims of the protocol’s $55 million hack from November 2021.","The Court’s <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.casd.732409\/gov.uscourts.casd.732409.49.0.pdf\" data-v-f87c67ca=\"\">ruling<\/a> classified bZx DAO as a general partnership. It stated that the plaintiffs provided sufficient facts to qualify defendants who hold the DAO’s governance tokens as members of the general partnership. As such, they are plausibly liable for the group's obligations, according to California partnership law.","bZx is a DeFi margin trading protocol. The platform’s creators transitioned the protocol to a DAO controlled by bZx DAO in August 2021. Another community called Ooki DAO soon succeeded bZx DAO, taking ownership of the protocol. Members of Ooki DAO moved their assets to this new community. Ooki DAO is currently the <a href=\"https:\/\/www.theblock.co\/post\/172274\/cftc-files-lawsuit-against-decentralized-autonomous-organization\" data-v-f87c67ca=\"\">subject of a lawsuit<\/a> by the U.S. Commodity Futures Trading Commission.","The court cited comments issued by the project team when transitioning to a DAO structure as grounds for its ruling. At the time, the bZx protocol founders stated that the move to a DAO would insulate the project from regulatory issues. The Court also cited a conclusion by the U.S. Commodity Futures Trading Commission that bZx transitioned to a DAO to insulate the project from regulatory oversight and liability based on U.S. laws.","Monday’s ruling saw the court agree with the plaintiff’s position that DAO token holders owed “a duty of care” to protocol investors. The ruling agreed that they failed to ensure adequate security that would have prevented the hack in 2021. This is despite numerous claims on the protocol’s website about the security of the project.","bZx lost $55 million in <a href=\"https:\/\/www.theblock.co\/linked\/123429\/defi-protocol-bzx-compromised-again-55-million-stolen-in-private-key-leak\" data-v-f87c67ca=\"\">a phishing attack<\/a> in 2021. The hack occurred when a team member fell victim to a phishing exploit. This allowed the hacker access to the private keys of the project’s wallet, which allowed them to steal the funds. This attack was not the first hack suffered by bZx, as the platform had been targeted the year before. The protocol <a href=\"https:\/\/www.theblock.co\/post\/77656\/defi-protocol-bzx-attacked-lost-8-million-faulty-code\" data-v-f87c67ca=\"\">lost<\/a> about $9 million in <a href=\"https:\/\/www.theblock.co\/post\/56207\/bzx-attacked-again-645k-in-eth-estimated-to-be-lost\" data-v-f87c67ca=\"\">several other attacks<\/a>.","The plaintiffs say they lost $1.7 million in the November 2021 attack. These losses range from $800 to $450,000 among 19 users, including Christian Sarcuni, the lead complainant.","The court dismissed claims against those who did not hold governance tokens as part of its ruling on Monday. The plaintiffs have until April 10 to file a second amended complaint."],"hashtag":["COURT HEARINGS","DAOS","LAWSUITS"]}