{"summary":"Bitcoin holds above the $52,000 mark as the market enters conditions indicative of a pre-halving rally, according to an analyst.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277697\/bitcoin-price-action-is-aligning-with-pre-halving-rally-conditions-analyst-says","publishDate":"2024-02-15T13:37:45","id":3869,"type":null,"title":"Bitcoin price action is aligning with pre-halving rally conditions, analyst says","category":["MARKETS"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.90%\n    <\/span><\/a> <!----><\/span><\/span>'s price surpassed the $52,000 mark in the past 24 hours, indicating that the market is entering conditions indicative of a pre-halving rally, according to an analyst.<\/span>","\"The current market movement aligns with a pre-halving rally, a trend observed in previous bitcoin cycles,\" Bitfinex Head of Derivatives Jag Kooner said in an email sent to The Block.","Kooner added that historically, these rallies have commenced approximately eight weeks prior to the halving event.","\"This rally has the potential to push prices beyond previous cycle highs, as notably, the past week marked bitcoin's re-emergence as a trillion-dollar asset, largely driven by spot bitcoin ETF inflows,\" the Bitfinex analyst said.","Kooner added that diminishing selling pressure related to Grayscale's converted GBTC fund and consistent daily inflows into other ETFs, averaging $300 to $400 million, have significantly contributed to supporting bitcoin's price.","However, the analyst cautioned that there could still be some uncertainty.","\"While historical patterns may provide insights, it's crucial to understand that they do not always guarantee repetition,\" he said.","He highlighted that the altcoin market has become particularly interesting in the present environment.","\"There has been a gradual flow of capital towards the alt coin market which is common once bitcoin records significant highs in the middle of a bull market. Due to the large number of crypto projects this cycle, however, there has been a flow of capital into specific sectors like the Solana ecosystem and AI based projects rather than a gradual spreading of capital into all alt coin markets,\" Kooner added.","The next bitcoin halving will likely occur in April of this year, and the event will reduce the reward that miners receive for validating and adding new blocks to the blockchain by 50%.","The halving occurs approximately every four years, or after every 210,000 blocks are mined. The last halving occurred in 2020, when the block reward was reduced from 12.5 bitcoin to 6.25 bitcoin.","The next halving will occur after the mining of approximately 840,000 blocks, leading to a further reduction in the block reward from the current 6.25 BTC to 3.125 BTC per block. This mechanism is programmed into the bitcoin protocol and is intended to control the supply of new bitcoins, making it more scarce over time.","The world's largest cryptocurrency by market capitalization decreased by over 1% in the past 24 hours to $52,056 at 1:19 p.m. ET, according to <a href=\"https:\/\/www.theblock.co\/price\/248348\/bitcoin-btc-usd\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">The Block's Price Page<\/a>.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"$300","content":"MONEY"},{"type":"+0.90%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"1:19 p.m. ET","content":"TIME"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"$52,056","content":"MONEY"},{"type":"$52,000","content":"MONEY"},{"type":"$400 million","content":"MONEY"},{"type":"1%","content":"PERCENT"},{"type":"Bitfinex Head of Derivatives Jag Kooner","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"April","content":"DATE"}],"hashtag":["CRYPTO MOVERS","SPOT BITCOIN ETF"],"authors":["Brian McGleenon","The Block"]}