{"summary":"Would-be AAA first-person-shooter &quot;Shrapnel&quot; aspires to become first blockchain-powered game to break into the mainstream.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275776\/epic-games-is-listing-call-of-duty-style-crypto-video-game-shrapnel","publishDate":"2024-02-02T19:01:56","id":3873,"type":null,"title":"Epic Games is listing Call of Duty-style crypto video game &#x27;Shrapnel&#x27;","category":["GAMING"],"content":["<span data-v-f87c67ca=\"\">The competition among bigger-budget, web3 video games vying to be that first title to truly break into the mainstream could finally be intensifying with the launching of the <\/span><span data-v-f87c67ca=\"\">Call of Duty-style crypto game “Shrapnel” on the Epic Games Store.<\/span>","<span data-v-f87c67ca=\"\">The online gaming store boasts a PC user base of more than 230 million gamers.<\/span>","\"Shrapnel\" will compete alongside other high-profile, blockchain-powered video games like \"<a href=\"https:\/\/www.theblock.co\/post\/241558\/star-atlas-pitches-harvesting-cash-from-mobile-gamers-golden-tickets-in-fight-for-survival\" data-v-f87c67ca=\"\">Star Atlas<\/a>\" and \"<a href=\"https:\/\/www.theblock.co\/post\/199387\/illuvium-release-third-blockchain-game\" data-v-f87c67ca=\"\">Illuvium<\/a>,\" which are also available on the store in \"early-access\" form. First iterations of games are often released under the \"early-access gameplay\" classification so companies can release a version that allows for building a community around a title while simultaneously continuing to develop and tweak the gaming experience.","<span data-v-f87c67ca=\"\">Neon Machine, the gaming studio developing \"Shrapnel,\" has billed the game set in a dystopian world as an “AAA first-person extraction shooter.” The team behind the title includes former employees of high-profile companies like Xbox and Electronic Arts, the company said in a statement.<\/span>","<span data-v-f87c67ca=\"\">The developers consider their approach to early-access gaming unique. <\/span><span data-v-f87c67ca=\"\">“In contrast to traditional AAA game release schedules, wherein studios keep their communities in the dark about gameplay and design until it is completely finalized, 'Shrapnel' is ... involving its community at every stage of development until the launch of its free-to-play game in 2025,” Neon Machine said in a statement.<\/span>","<span data-v-f87c67ca=\"\">As the game evolves, Neon Machine is betting players will embrace <\/span><span data-v-f87c67ca=\"\">customizing \"every aspect of the game, from its characters and weapons to in-game maps.\"<\/span>","\"O<span data-v-f87c67ca=\"\">ur execution of early access gameplay puts players right in the driver's seat, helping us steer toward a blockbuster-quality AAA first-person shooter game,\" said Mark Long, who serves as CEO of \"Shrapnel\" after previously heading HBO's digital products group.<\/span>","<span data-v-f87c67ca=\"\">While no blockchain game has managed to establish a foothold in the world of mainstream gaming, a multi-billion dollar a year business, Neon Machine views early interest in “Shrapnel” as robust, considering the game's stage of development. The company said its online community on Discord has more than 100,000 members.<\/span>","<span data-v-f87c67ca=\"\">Although measuring online communities is not necessarily clear-cut indicator of enthusiasm or gaming activity, it's worth noting that \"<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Illuvium <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248472\/illuvium-ilv-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/logo-200x200-1.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ILV<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.55%\n    <\/span><\/a> <!----><\/span><\/span>\" and \"Star Atlas\" each have more than 170,000 members signed up to their Discord servers.<\/span>","<span data-v-f87c67ca=\"\">Last October, the “Shrapnel” team <a href=\"https:\/\/www.theblock.co\/post\/259283\/call-of-duty-style-crypto-video-game-shrapnel-raises-20-million\" data-v-f87c67ca=\"\">raised $20 million <\/a><\/span><span data-v-f87c67ca=\"\">in Series A financing with Polychain Capital leading the round. Griffin Gaming Partners, Franklin Templeton and Brevan Howard Digital are also investors. The project has raised a total of $37.5 million, according to a statement.<\/span>","The native token for \"Shrapnel,\" Shrap has a market capitalization of about $68 million, according to CoinGecko.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2025","content":"DATE"},{"type":"Brevan Howard Digital","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Neon Machine","content":"ORGANIZATION"},{"type":"$37.5 million","content":"MONEY"},{"type":"$68 million","content":"MONEY"},{"type":"HBO","content":"ORGANIZATION"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"$20 million","content":"MONEY"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"+0.55%","content":"PERCENT"},{"type":"October","content":"DATE"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"Mark Long","content":"PERSON"},{"type":"multi-billion dollar","content":"MONEY"},{"type":"Griffin Gaming Partners","content":"ORGANIZATION"}],"hashtag":["PLAY2EARN"],"authors":["RT Watson","The Block"]}