{"summary":"Cega announced Thursday the launch of its Dual Current Product, which offers 22% APY for staked ether (stETH) and ETH holders.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265431\/dragonfly-backed-project-rolls-out-structured-product-to-enhance-lido-yield","publishDate":"2023-11-30T10:19:15","id":3874,"type":null,"title":"Dragonfly-backed project rolls out structured product to enhance Lido yield","category":["CRYPTO INFRASTRUCTURE"],"content":["A team specializing in building structured products for the volatile cryptocurrency market has rolled out a new yield strategy for traders to earn additional returns for staking participants.&nbsp;","Cega announced Thursday the launch of its Dual Currency Product, which offers 22% APY for staked ether (stETH) and ETH holders. The product provides enhanced yields through options trading.&nbsp;","Staking ether currently offers a yield of around 3%.&nbsp;","The new strategy comes to market as value locked staking via Lido reaches new highs. But it's also a quieter time for ether relative to the broader market.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/total-value-locked-tvl\/value-locked-in-liquid-staking\/embed\" title=\"Value Locked in Liquid Staking\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","\"This is the perfect type of product for when the market is just not moving that much,\" Cega CEO Arisa Toyosaki said in an interview with The Block.&nbsp;","The increased boost could be a welcomed development for holders of ether, which has underperformed compared to other less prominent assets.&nbsp;","\"Innovative yields are coming from re-staking solutions and chains, real yields are coming from structured investment solutions and strategies that are based on actual trades and derivatives,\" she added.","That has been evident in the growth of the cryptocurrency options market, which saw aggregate open interest for bitcoin options top $16.5 billion this month.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/options\/aggregated-open-interest-of-bitcoin-options\/embed\" title=\"Aggregated Open Interest of Bitcoin Options\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Cega raised $9.3 million in seed funding in a round led by Dragonfly.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Arisa Toyosaki","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"3%","content":"PERCENT"},{"type":"Lido","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$16.5 billion","content":"MONEY"},{"type":"Dragonfly","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"22%","content":"PERCENT"},{"type":"$9.3 million","content":"MONEY"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}