{"summary":"Cryptocurrency exchange OKEx has launched a new platform for minting and trading non-fungible tokens (NFTs).","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/116428\/crypto-exchange-okex-launches-nft-marketplace","publishDate":"2021-09-02T05:24:37","id":3875,"type":null,"title":"Crypto exchange OKEx launches challenger NFT marketplace","category":["NFTS"],"content":["Cryptocurrency exchange OKEx has launched a new platform for minting and trading non-fungible tokens (NFTs).","The <a href=\"https:\/\/www.okex.com\/defi\/nft\" data-v-f87c67ca=\"\">platform<\/a> will allow users to mint and trade NFTs created on OKExChain and Ethereum blockchains, said OKEx. But it will also allow users to import NFTs created on other platforms.","Lennix Lai, director of financial markets at OKEx, told The Block that you can currently only import OKExChain-based NFTs but Ethereum-based NFTs will also be supported \"at a later stage.\"","OKEx added that NFT creators can also set their own royalty fees on the platform, meaning they can receive commissions at percentages they set for any subsequent transactions of their work.","\"For example, if a creator wants to receive 20% in royalty fees and one buyer wants to sell that NFT in a secondary market sale for $100, then the creator will receive $20, and the seller will receive $80,\" said Lai. OpenSea allows NFT creators to set a royalty fee of up to 10%, according to its <a href=\"https:\/\/support.opensea.io\/hc\/en-us\/articles\/1500009575482-How-do-royalties-work-on-OpenSea-\" data-v-f87c67ca=\"\">website<\/a>. OKEx doesn’t have a limit of royalty fees, said Lai.","Crypto exchange <a href=\"https:\/\/www.theblockcrypto.com\/linked\/109312\/binance-nft-marketplace-warhol-dali\" data-v-f87c67ca=\"\">Binance also operates an NFT marketplace<\/a>, but it doesn't seem to have gained much traction compared to popular NFT platforms like OpenSea and Rarible. When asked why OKEx has launched an NFT platform, Lai said the NFT market has \"huge potential,\" and the exchange wants to serve its users who are \"NFT enthusiasts\" and want to keep assets in one place.","OKEx has today also launched a dashboard for decentralized finance (DeFi), which allows users to view their full portfolio in one place, including NFTs. Both the NFT marketplace and the DeFi dashboard are part of OKEx's newly launched project \"DeFi Hub.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$20","content":"MONEY"},{"type":"Rarible","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Lennix Lai","content":"PERSON"},{"type":"10%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"$100","content":"MONEY"},{"type":"Lai","content":"PERSON"},{"type":"Binance","content":"PERSON"},{"type":"$80","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}