{"summary":"Company&#x27;s CEO Alex Blania said Worldcoin will roll out a new version of the Orb during the first half of this year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274478\/worldcoins-eyeball-scanning-orb-is-getting-an-apple-style-makeover-report","publishDate":"2024-01-25T10:29:44","id":3878,"type":null,"title":"Worldcoin&#x27;s eyeball scanning Orb is getting an Apple-style makeover: report","category":["COMPANIES"],"content":["Tools for Humanity CEO Alex Blania said the company plans to update its iris-scanning Orb to make the device look more like \"an Apple product,\" according to a report by <a href=\"https:\/\/techcrunch.com\/2024\/01\/24\/worldcoin-to-launch-new-orb-to-make-its-eyeball-scanning-device-look-more-friendly\/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly90LmNvLw&amp;guce_referrer_sig=AQAAAHTYnr6ImHW8gbOXLZ5OnC3FZyXxUhPBasZVeqB9lL6h54sJ6B8LdRrb9JKwoLREzIRnzzcm3-f3xMoJV_ptjxQhsKyCB_jJvCB4gNfESib3w2YLQl3Dr0L0b3AHeIHrZ-C-2WP0Yj3AI7JYkvVGoWN5fNHQuo_DBZfXyShJGnyC\" data-v-f87c67ca=\"\">TechCrunch<\/a>.&nbsp;","\"The new Orb is coming and the next iterations will look quite different,” said Blania, while admitting &nbsp;people either \"hate\" or \"love\" the device.","Blania teased the introduction of a new version of the Orb during the first half of this year, one that he characterized as \"much more friendly\" and possibly similar to \"an Apple product.\"","The Worldcoin project made headlines <a href=\"https:\/\/www.theblock.co\/post\/265939\/looking-back-at-eyeball-scanner-worldcoins-tumultuous-year\" data-v-f87c67ca=\"\">last year<\/a> thanks to its unique, and sometimes controversial, strategy to scan people's irises in exchange for cryptocurrency. Tools of Humanity was co-founded by Sam Altman, CEO of the high-profile tech company OpenAI.","Scrutiny of Worldcoin's ambitions have led to some government agencies launching inquiries. Agencies in France, Germany and the UK all moved to investigate whether Worldcoin is at risk of violating data privacy guidelines.","Worldcoin launched in Singapore at the end of last year. The move followed the project both pausing in India and ending registration services in Brazil and France.","&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Blania","content":"LOCATION"},{"type":"Alex Blania","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"France","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Brazil","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Sam Altman","content":"PERSON"},{"type":"Worldcoin","content":"LOCATION"},{"type":"last year","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"Germany","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"India","content":"LOCATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}