{"summary":"Lex Sokolin, CMO and global co-head of fintech at Consensys, recently chatted Libra on The Scoop podcast\n“Libra is essentially fighting against bitcoin on behalf of the Western World, or constituted as nationstate,” he said in the interview.","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/65064\/lex-sokolin-libra-governments-bitcoin","publishDate":"2020-05-13T12:48:49","id":388,"type":null,"title":"Lex Sokolin on how Libra could be a tool for governments to fight back against bitcoin","category":["Podcasts"],"content":["It's a crime most of us have committed and aren't ashamed to admit.&nbsp;","Before the rise of music-streaming services like Spotify and (remember?) Pandora, burning CDs from YouTube to enjoy in your car or downloading music files to load up onto your iPod Nano were all the rage.","Services like Napster – which shut down following several legal actions against the company from the Recording Industry Association of America – ultimately gave way to platforms like Spotify, which operate within the parameters of the law and, honestly, are simpler to use. Napster shut down in 2001.","Last month, Lex Sokolin, CMO and global co-head of fintech at Consensys, said on an episode of The Scoop that the crypto ecosystem might follow a similar path as the music industry. And that could mean the dominance of bitcoin gives way to a more regulated alternative.&nbsp;","\"I am a little bit worried,\" he said. Here's Sokolin:","\"I go back to the analogy of what Napster did to Music. In 2001, Napster allowed for peer-to-peer sharing of music files. And so the music labels all had their hair on fire and tried to sue teenagers for having Napster and shut it down and so on. There was a response from the music industry but in the longer term they were overrun by demand for digital services. Money is very different. Money is not just the economy. In many ways, it is an appendage of the state. So the state has sovereignty, which really means it has the sword, the ability to jail people and compel them.\"","The power of the state, in Sokolin's view, will make it even more difficult for the shift from the current state of money to peer-to-peer money to transpire. While bitcoin will continue to serve as an important attempt at a \"permission-less economy,\" governments will ultimately fight back to maintain their dominance and control.","In a sense, Libra represents one vehicle through which they can do this, according to Sokolin. The ambitious project, bootstrapped by Facebook and its Calibra blockchain unit, announced last month its shift to <a href=\"https:\/\/www.theblockcrypto.com\/post\/62095\/libra-multi-currency-shift-central-bank-digital-currencies\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a multi-currency model<\/a> of stablecoins backed by fiat currencies. Indeed, it was a move many in the industry interpreted as the project kowtowing to the will of regulators and lawmakers across the globe, from whom the project originally drew ire.","\"<span data-v-f87c67ca=\"\">I always thought it meant governments would have to create the thing that fights back: they'd had to try to shut things down, or get the miners, or target the on and off-ramps,\" Sokolin said.<\/span>","\"In this case, when I look at Libra paper and I look at the language and I like at how it is really just about tokenized fiat moving around and it is going to have regulated dealers,\" he added. \"Libra is essentially fighting against bitcoin on behalf of the Western World, or constituted as nation-state.\"","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Listen to the full episode with Lex Sokolin&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/post\/64995\/consensys-fintech-executive-dissects-facebooks-libra-project-the-growth-of-the-stablecoin-market-and-how-fintech-and-crypto-can-work-together\" data-v-f87c67ca=\"\">here<\/a>.<\/strong><\/em>"],"hashtag":["BITCOIN"]}