{"summary":"GSR Markets Limited v. Diana McDonald, et al., №1:19-cv-1005-MLB, D.D.Ga, 6\/13\/2019 Link to opinion: https:\/\/www.scribd.com\/document\/428789914\/Gsr Back in","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/42191\/plaintiff-says-lawyers-failure-to-deliver-bitcoin-was-securities-fraud-because-escrow-contract-was-an-investment-contract-under-howey-test","publishDate":"2019-10-06T19:00:29","id":388,"type":null,"title":"Plaintiff says lawyer&#x27;s failure to deliver bitcoin was securities fraud because escrow contract was an &quot;investment contract&quot; under Howey test","category":["LEGAL"],"content":["Link to opinion: <a class=\"bs cz ly lz ma mb\" href=\"https:\/\/www.scribd.com\/document\/428789914\/Gsr\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">https:\/\/www.scribd.com\/document\/428789914\/Gsr<\/a>","Back in March <a href=\"https:\/\/www.theblockcrypto.com\/post\/15155\/gsr-markets-missing-2m-in-bitcoin-after-poor-escrow-tricks\" data-v-f87c67ca=\"\">we wrote about one of a number of bitcoin escrow deals that went completely south<\/a>. The thing that caught my eye was that it involved a lawyer who (judging from the pleadings and exhibits) maybe was in slightly deeper waters than she should have been. &nbsp;In short, she was supposed to be an intermediary for a bitcoin transaction and got sent cash, which she forwarded to a third party, but … never … got … the bitcoin. This of course made the buyer really not very happy, and they filed a not very happy lawsuit in federal court in Georgia.","It's been a few months, so I thought I’d check back with our friends and see where, if anything this case had gotten and as far as I can tell it’s still winding its way through the litigation process. &nbsp;There have been multiple discovery fights and there’s a motion to dismiss that is pending. Now what caught my eye about this case is one of the arguments in the motion to dismiss pleadings where I think the plaintiff (that is, the people who paid their money but got no bitoin) made an argument about why their securities fraud claim shouldn’t be dismissed.","They argue that their contract to purchase bitcoin was an investment contract under the Howey Test in part because it “was based on the efforts of Valkyrie to mine or otherwise obtain the Bitcoin for sale to GSR Markets for investment purposes.” They aso note that “Bitcoin” changes in value quickly, “unlike a commodity such as money” (which doesn’t actually make sense, I don’t think).","The facts are bad enough in this case that if they’re as alleged I imagine that the Court will find the defendants liable without having to fit a bitcoin escrow contract gone bad into an investment contract. &nbsp;Still, there’s a saying among lawyers that bad cases make bad law — one hopes that the waters don’t get so muddy that the Court here decides that bitcoin is an investment contract or that a bitcoin escrow is an investment contract but, whelp, one of the funny things about a common law system of judge made law is … sometimes you never know until the motion is decided.","<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Disclaimer: Crypto Caselaw Minute is provided for educational purposes only by Stephen Palley (@stephendpalley) and Nelson Rosario (@nelsonmrosario). &nbsp;These summaries are not legal advice. They are our opinions only, aren’t authorized by any past, present or future client or employer. Also, we might change our minds. We contain multitudes. &nbsp;<\/em><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">As always, Rosario summaries are “NMR” and Palley summaries are “SDP”.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March","content":"DATE"},{"type":"GSR","content":"ORGANIZATION"},{"type":"Nelson Rosario (","content":"PERSON"},{"type":"SDP","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Palley","content":"PERSON"},{"type":"Georgia","content":"LOCATION"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"}],"hashtag":[],"authors":["Stephen Palley","The Block"]}