{"summary":"Cosmos developer All in Bits will introduce a new blockchain network called GovGen ahead of AtomOne, a proposed fork of the Cosmos Hub.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279033\/jae-kwon-govgen-atom-one","publishDate":"2024-02-26T06:42:58","id":3881,"type":null,"title":"Jae Kwon to lead community GovGen initiative as prelude to controversial AtomOne fork","category":["CRYPTO ECOSYSTEMS"],"content":["Cosmos developer All in Bits (AiB) will introduce a new blockchain network called GovGen ahead of <a href=\"https:\/\/www.theblock.co\/post\/264717\/cosmos-founder-to-airdrop-forked-atom1-tokens-to-voters-against-reducing-hub-inflation\" data-v-f87c67ca=\"\">AtomOne<\/a>, a proposed controversial fork of the Cosmos Hub.","Scheduled to go live on Tuesday at 9 am ET, GovGen’s development is led by All in Bits, a firm that Cosmos co-founder Jae Kwon owns. Kwon has had significant disagreements with the wider Cosmos community in recent years.","The network’s native token, GovGen, will be distributed to ATOM holders who either voted “no” or were automatically assigned a no vote due to their delegation status on the Cosmos Hub proposal 848. This particular proposal — aimed at capping the maximum inflation rate at 10% — was <a href=\"https:\/\/www.theblock.co\/post\/264683\/cosmos-community-approves-capping-atom-inflation-rate-at-10?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">approved<\/a> despite Kwon’s objections, contrasting with the stance of numerous other contributors within the ecosystem.","Kwon, who played a pivotal role in developing the Cosmos’s Tendermint consensus algorithm and co-founding the Cosmos Hub, had earlier expressed concerns regarding the 848 proposal’s implications for network security.","“The objective of GovGen is to provide a forum to facilitate the forking and splitting of blockchains based on governance activity, or in other words 'smart chain reproduction'. GovGen is a forum that incubates a fork, while AtomOne is the fork,” Kwon told The Block in a statement.","The Cosmos Hub, released in 2019, has seen the founders Kwon and Ethan Buchman take separate paths over time. Both remain active within the Cosmos ecosystem, albeit through different entities. Kwon leads AiB, while Buchman is at the helm of Informal Systems, which supported proposal 848.","Kwon’s new project with GovGen — and, subsequently, AtomOne — represents an effort to rebuild the Hub under a governance model aligning with his and his followers’ visions. The primary objective of GovGen will be to gauge community sentiment regarding various proposals related to AtomOne’s foundational constitution.","Notably, the GovGen token is designed solely for voting purposes within this context and will not be transferable or tradable. Once the GovGen holders decide on AtomOne’s design, it’s expected to go live soon after.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"GovGen","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Cosmos","content":"ORGANIZATION"},{"type":"Informal Systems","content":"ORGANIZATION"},{"type":"Jae Kwon","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Kwon","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Ethan Buchman","content":"PERSON"},{"type":"Buchman","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Cosmos Hub","content":"ORGANIZATION"},{"type":"Cosmos","content":"LOCATION"},{"type":"AiB","content":"ORGANIZATION"}],"hashtag":["COSMOS"],"authors":["Vishal Chawla","The Block"]}