{"summary":"Ethereum Layer 2 Base is expected to support the Dencun upgrade from day one, including EIP-4844, to reduce network fees.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281258\/base-to-support-eip-4844-from-day-1-following-dencun-upgrade","publishDate":"2024-03-08T00:47:37","id":3883,"type":null,"title":"Base says it will support EIP-4844 from &#x27;day 1&#x27; following Dencun upgrade","category":["CRYPTO ECOSYSTEMS"],"content":["The team at Ethereum Layer 2 Base stated it will provide support for the upcoming Dencun upgrade from day 1 — including the much-anticipated <a href=\"https:\/\/www.theblock.co\/post\/279461\/polygon-zkevm-prepares-for-ethereums-dencun-upgrade-eyes-major-fee-reductions-with-eip-4844\" data-v-f87c67ca=\"\">EIP-4844<\/a> — aiming to reduce fees on the network.","The implementation of Dencun on Ethereum is expected to significantly lower fees for users of Layer 2s. Estimates from Base suggest a reduction of over ten times, particularly benefiting rollups.","<a href=\"https:\/\/www.theblock.co\/post\/276747\/dencun-upgrade-expected-on-march-13-to-bring-blobs-to-ethereum-mainnet\" data-v-f87c67ca=\"\">Slated for March 13<\/a>, the Dencun upgrade will introduce changes that enhance data availability. This upgrade on the mainnet will be closely followed by the <a href=\"https:\/\/docs.optimism.io\/builders\/notices\/ecotone-changes\" data-v-f87c67ca=\"\">Ecotone OP Stack upgrade<\/a>, which is set to extend its benefits to the Optimism <a href=\"https:\/\/www.theblock.co\/post\/236277\/optimism-changes-name-to-op-mainnet-in-line-with-superchain-vision\" data-v-f87c67ca=\"\">Superchain<\/a> ecosystem, of which Base is a part, along with others like Mode, Zora, Aevo and Fraxtal.","\"Base will have Day 1 support for the Dencun upgrade, which is expected to drive down fees for users by 10-100x through increased data availability for rollups,\" it <a href=\"https:\/\/base.mirror.xyz\/pVPbs2mSR_eZCpy4PVnY0sNJrK2KGOVtSuU_TO7LLc0\" data-v-f87c67ca=\"\">wrote<\/a>.&nbsp;","EIP-4844 introduces a novel concept of “blobs” within Layer 1 blocks. These blobs are designed to be an additive feature, increasing Ethereum’s data availability without impacting the existing infrastructure, resulting in cheaper transactions across Layer 2s. An independent fee market for blobs ensures that costs remain low, even during periods of high network congestion.","The team also noted that the upgrade would help make transactions faster and cheaper, thereby making decentralized applications in areas like on-chain gaming and limit order book exchanges more accessible. Meanwhile, other Layer 2 projects including <a href=\"https:\/\/www.theblock.co\/post\/279461\/polygon-zkevm-prepares-for-ethereums-dencun-upgrade-eyes-major-fee-reductions-with-eip-4844\" data-v-f87c67ca=\"\">Polygon<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/275767\/zksync-eyes-lower-fees-bigger-batches-after-ethereums-dencun-upgrade\" data-v-f87c67ca=\"\">zkSync<\/a> and Arbitrum have made similar projections related to reduced fees after Dencun.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"4844","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Dencun","content":"PERSON"},{"type":"Dencun on Ethereum","content":"ORGANIZATION"},{"type":"March 13","content":"DATE"}],"hashtag":["BASE"],"authors":["Vishal Chawla","The Block"]}