{"summary":"While Ripple Chief Technology Officer David Schwartz says he still gets most excited about payments, he’s also got his eye on carbon credits and gaming NFTs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193898\/ripple-sees-promise-in-carbon-credit-and-gaming-nfts-despite-market-downturn","publishDate":"2022-12-10T17:27:27","id":3884,"type":null,"title":"Ripple sees promise in carbon credit and gaming NFTs despite market downturn","category":["CRYPTO INFRASTRUCTURE"],"content":["While Ripple Chief Technology Officer David Schwartz says he still gets most excited about payments, he’s also got his eye on carbon credits and gaming NFTs.","“We’re really excited about carbon credits,” he said in a Nov. 29 interview in Miami after speaking at the <a href=\"https:\/\/www.theblock.co\/post\/189245\/art-basel-doodleputt-pussy-riot-the-blocks-guide-for-the-crazy-web3-week-ahead-in-miami\" data-v-f87c67ca=\"\">Decentral conference<\/a>. “I think just because the fit seems to be really good. There's a real problem in the carbon credit space right now of provenance and making sure that things aren't issued, like there aren't two sets of carbon credits.”","Gaming, meanwhile, is another area ripe for development, as Schwartz said non-fungible tokens can help studios more easily bring users along to their <a href=\"https:\/\/www.theblock.co\/post\/190559\/mobile-game-maker-aeria-canada-studio-to-migrate-products-to-web3-exclusive\" data-v-f87c67ca=\"\">newest products<\/a>.","“There are real problems in the gaming space that NFTs solve,” he said, noting that gamers tend to get comfortable in older games and can be hesitant to follow developers into newer products. “You have to start over from scratch, and there's this feeling of loss. If you could take NFTs with you, then you wouldn't have that feeling of loss, and you'd be more likely to migrate to the game that the game studio wants you on.”","Ripple doesn’t currently build consumer applications directly, but it looks for partners that can leverage the XRP ledger for its low cost and high-speed capabilities. It also has a <a href=\"https:\/\/ripple.com\/creatorfund\/\" data-v-f87c67ca=\"\">$250 million creator fund<\/a> that Schwartz said is being deployed carefully after some initial hesitancy.","“If I give you enough money, you'll do something that makes no sense at all, right?” he said. “There's no reason for you to jump up and down and cluck like a chicken, and if I give you $1,000 you might do it and I might say ‘look, look, this is a real use case. This is a real solution.’ And actually, what's happening is I'm paying you to do something.”","Ripple went ahead with its own fund in an attempt to promote the development of realistic projects in ecosystems that make sense, Schwartz said, adding that Ripple usually requires developers to first raise outside cash and build a minimum viable product before Ripple creator funds are dispersed.","“There are people paying people to do stupid things,” Schwartz said. “And so if you want to get people to build projects that are going to be successful and steer them away from locking themselves into blockchains that have high fees and low throughput, or locking themselves into issuing a token that makes no sense for their project, money has to be part. You have to be smart about it … You have to be really careful that you’re not creating the illusion of success and progress.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nov. 29","content":"DATE"},{"type":"$250 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Miami","content":"LOCATION"},{"type":"Schwartz","content":"PERSON"},{"type":"$1,000","content":"MONEY"},{"type":"David Schwartz","content":"PERSON"},{"type":"XRP","content":"ORGANIZATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}