{"summary":"A Rhode Island green housing bill introduced last week includes a proposal for a crypto &quot;green coin.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/142378\/rhode-island-lawmakers-introduce-green-coin-in-housing-bill","publishDate":"2022-04-18T15:58:56","id":389,"type":null,"title":"Rhode Island lawmakers introduce &#x27;green coin&#x27; in housing bill","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">Lawmakers in Rhode Island are looking at crypto tokens as part of a comprehensive <a href=\"https:\/\/legiscan.com\/RI\/bill\/H8152\/2022\" data-v-f87c67ca=\"\">green housing bill<\/a> that would tackle both the climate crisis and housing shortage in the state.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Introduced last week, the bill would create an incentive for lower carbon emissions with a “green coin” issued by the state.<\/span>","<span data-v-f87c67ca=\"\">At its core, the bill is aimed at providing state-backed funding for new housing projects that meet certain sustainability standards.<\/span>","<span data-v-f87c67ca=\"\">“We have about a shortage of <\/span><span data-v-f87c67ca=\"\">25,000<\/span><span data-v-f87c67ca=\"\"> units,” said Representative Carlos Tobon, who introduced the bill, co-sponsored by nine other representatives.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In part due to the pandemic, Rhode Island saw a “serious” influx of people from the Boston and New York areas in the past two years. The state also passed an act on climate last year to reduce greenhouse gas emissions.<\/span>","<span data-v-f87c67ca=\"\">While there are many ways to make housing green, Tobon pointed out self-sustaining energy sources such as solar panels or geothermal.<\/span>","<span data-v-f87c67ca=\"\">“That will essentially decentralize the property’s utilities, like the blockchain and crypto have done to finance,” he said. “That means that we're empowering individuals to have more control and, while they're still going to be tied to the grid, the grid will be secondary.”<\/span>","<span data-v-f87c67ca=\"\">The lawmaker is betting on the idea that being net zero or net negative is going to have an inherent value. Properties following these guidelines could be sort of a “factory of credits.”<\/span>","<span data-v-f87c67ca=\"\">“There will be a calculation to say ‘if you cooled or heated your home for so many hours that's equivalent to this,'” he explained. “So early on it will be a reward, but then it's gonna become a way of life. As more people have it then it's just the norm. One day, my kids won't even know that people were incentivized to do this.”<\/span>","<span data-v-f87c67ca=\"\">While the proposed “green coins” would draw some similarities to green energy incentives commonly provided by governments, Tobon's vision goes beyond that.<\/span>","<span data-v-f87c67ca=\"\">“Instead of you getting a check or a direct deposit of like a dollar a week in your bank account, I'm saying let's create this instrument, the coin, to do this. And then the more outlets that we create for the use of it then the value of the coin is gonna start going up.”<\/span>","<span data-v-f87c67ca=\"\">While the concept of this “green coin” system is still at a very early stage, Tobon said possible real-world applications could include paying for public transportation and for charging your electric car with these tokens.<\/span>","<span data-v-f87c67ca=\"\">“We're just projecting ourselves into the future,” the representative said. “The bottom line is crypto is here to stay. (...) I'm not excited about trying to figure out what crypto does for my state when it's smooth sailing. That means we missed the boat. I want to get in early and I want to create innovative concepts that again create a sustainable approach.”<\/span>","<span data-v-f87c67ca=\"\">Many details are yet to be worked out. Tobon said that the bill needs a few tweaks and that it will be amended before it has its first hearing. The representative expects to get the bill to the finish line before the end of the current legislative session in mid-June.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York","content":"LOCATION"},{"type":"Rhode Island","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Boston","content":"LOCATION"},{"type":"Carlos Tobon","content":"PERSON"},{"type":"Tobon","content":"PERSON"}],"hashtag":["TOKENS"],"authors":["Catarina Moura","The Block"]}