{"summary":"Celsius custody account holders could see nearly three-quarters of the cryptocurrency in their custody accounts.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/221642\/judge-approves-celsius-custody-settlement-account-holders","publishDate":"2023-03-21T12:26:42","id":3891,"type":null,"title":"Celsius custody account holders to get 72.5% of their crypto in settlement","category":["COMPANIES"],"content":["Celsius custody account holders can receive 72.5% of the cryptocurrency in their custody accounts after a federal judge approved a settlement in the defunct crypto lender's bankruptcy case.","Judge Martin Glenn gave the green light to a <a href=\"https:\/\/cases.stretto.com\/public\/x191\/11749\/PLEADINGS\/1174903012380000000070.pdf\" data-v-f87c67ca=\"\">settlement<\/a> between the Celsius debtors, the unsecured creditors committee and an ad hoc group of custodial account holders during a hearing on Tuesday in the U.S. Bankruptcy Court for the Southern District of New York.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Individual custody account holders must opt into the settlement. In turn, the Celsius debtors will agree to settle all causes of action against custody account holders with respect to their custody assets, according to the terms of the deal.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“Because custody holders have the right to opt in, nobody is being forced to accept this settlement. I think that’s quite important here,” Glenn said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The 72.5% return would come over time and does not include transaction fees, according to the settlement. Customer assets have often been an issue in the Celsius bankruptcy case. Glenn ruled in January that assets in Celsius Earn accounts belong to the company, not customers. The settlement approved on Tuesday does not release any rights or causes of action related to assets held in the Earn program.","Bryan Kotliar, a lawyer for the ad hoc group of custodial holders, described a lengthy process to come to Tuesday’s agreement.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“Even beyond what's described in the pleadings, behind the scenes has really been a rollercoaster ride ... There's been a lot of ups and downs,” Kotliar said. “It's a settlement where I think everyone is just a little bit unhappy with it.”","“That’s usually the best settlement,” Glenn replied.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Martin Glenn","content":"PERSON"},{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"Southern District of New York","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"72.5%","content":"PERCENT"},{"type":"Kotliar","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"Glenn","content":"PERSON"},{"type":"Bryan Kotliar","content":"PERSON"}],"hashtag":["BANKRUPTCY FILINGS","COURT HEARINGS"],"authors":["Stephanie Murray","The Block"]}