{"summary":"Data warehousing platform Space and Time has joined startup program Nvidia Inception just over a month after raising a $20 million strategic funding round backed by Microsoft’s venture arm M12.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/185224\/space-and-time-nvidia-startup-program","publishDate":"2022-11-10T11:00:46","id":3892,"type":null,"title":"Microsoft-backed Space and Time joins Nvidia startup program: Exclusive","category":["COMPANIES"],"content":["&nbsp;","Data warehousing platform Space and Time has joined chipmaker Nvidia's startup program just over a month after <a href=\"https:\/\/www.theblock.co\/post\/172780\/microsofts-m12-leads-space-and-times-20-million-raise-to-bring-sql-to-web3\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">raising<\/a> a $20 million strategic funding round backed by Microsoft’s venture arm M12.","Nvidia Inception helps startups at the cutting edge of technological development in fields such as artificial intelligence, healthcare and smart cities <span data-v-f87c67ca=\"\">to accelerate product adoption, as well as give them the opportunity to collaborate with industry-leading experts and AI-driven organizations.<\/span>","Its member startups run the gamut from video editing software to a company that's trying to build a 3D digital replica of the entire planet.","Space and Time aims to combine on-chain and off-chain data into a single platform to enable businesses to do enterprise-scale analytics and make fast transactions.","To do this, it uses a proprietary technology called Proof of SQL, for which it currently has a patent pending. SQL is a popular database programming language and the company’s technology allows users to run an SQL query on blockchain data.","Users and developers are able to&nbsp;<span data-v-f87c67ca=\"\">connect analytics directly to smart contracts, opening up a new set of use cases and business logic for smart contracts.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Time","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"$20 million","content":"MONEY"},{"type":"Nvidia","content":"ORGANIZATION"},{"type":"Nvidia Inception","content":"ORGANIZATION"}],"hashtag":["DECENTRALIZED INFRASTRUCTURE","FILE STORAGE","INTERNET"],"authors":["Callan Quinn","The Block"]}