{"summary":"North American bitcoin miners have seen a big increase in the amount of BTC mined per month, as they profit from the lull left by China&#x27;s ban.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/117053\/north-american-bitcoin-miners-see-record-months-as-they-stockpile-18000-btc","publishDate":"2021-09-09T04:03:00","id":3896,"type":null,"title":"US Bitcoin miners see record months as they stockpile 18,000 BTC","category":["BITCOIN"],"content":["Several largest U.S.-listed bitcoin mining firms with operations predominantly in North America have collectively mined over 10,500 BTC year to date with nearly 40% of the output coming from the past two months.","Public data complied by The Block shows that Riot, Marathon, Bitfarm, Hut8 and Argo have mined a total of 1,796 BTC during August. That was slightly less than their collective productions in July but their individual output for Q3 so far has either matched with or already exceeded the production records during the second quarter.&nbsp;","The increase of their outputs are due to the reduced competition from Chinese miners as well as the gradual expansion of their installed mining fleets as a result of the billions of dollars of investment put into bitcoin mining equipment since late last year.","As such, their collective output accounted for nearly five percent on average of the total bitcoin mining revenue year to date. This doesn't include other notable private North American mining firms that are going through a U.S. listing process, such as Core Scientific, Greenidge Generation and Stronghold Digital.","","","Bit Digital is the only U.S.-headquartered bitcoin mining firm that saw a sharp decline of its quarterly production as it shut down its China operations in Q2 and is in the process of transmitting over 14,500 machines to North America. The firm has not updated its numbers for July and August. The current estimated data in the chart is based on Bit Digital's mining results for Q2.","Except Bit Digital, the other five large bitcoin mining firms have been adding almost all of their mined bitcoin onto their balance sheets, which added up to 17,960 BTC as of August, worth around $820 million. But that does include 4,812 BTC that Marathon Digital purchased through the secondary market during Q1.","All told, the total amount of bitcoin that these five mining firms held as of August has more than four-folded since December 31 when they collectively held just 4,176 BTC.","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"Greenidge Generation","content":"ORGANIZATION"},{"type":"North America","content":"LOCATION"},{"type":"December 31","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Stronghold Digital","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Marathon","content":"LOCATION"},{"type":"July","content":"DATE"},{"type":"40%","content":"PERCENT"},{"type":"$820 million","content":"MONEY"},{"type":"Bitfarm","content":"LOCATION"},{"type":"second quarter","content":"DATE"},{"type":"Marathon Digital","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"August","content":"DATE"}],"hashtag":["BITCOIN"],"authors":["Wolfie Zhao","The Block"]}