{"summary":"The cuts will come from its marketing, business development and community teams, according to Near Foundation CEO Illia Polosukhin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/271858\/near-foundation-staff-cut-treasury","publishDate":"2024-01-11T06:06:19","id":390,"type":null,"title":"Near Foundation to cut staff by 40%, says treasury &#x27;remains strong&#x27;","category":["RESTRUCTURING"],"content":["The Near Foundation, the non-profit organization that supports the Near ecosystem, said it will reduce its team by approximately 40%. The cuts are set to impact 35 employees, primarily across its marketing, business development and community teams, Near Protocol co-founder and Near Foundation CEO Illia Polosukhin said in a <a href=\"https:\/\/pages.near.org\/blog\/an-update-from-the-near-foundation\/\" data-v-f87c67ca=\"\">statement<\/a> today.","The Near Protocol engineering team at Near contributor Pagoda will continue to operate unaffected, and the Near Foundation will help impacted staff to find new opportunities in the Near ecosystem or the broader crypto industry, Polosukhin added.","The team’s reduction comes after a recent review, with feedback suggesting the foundation’s activities were not as effective as they could be, moving too slowly or trying to do too many things at once, according to Polosukhin. “Following this review, we have decided to significantly consolidate the core Foundation team to focus on a narrower and higher-impact set of activities,” he said.","Despite the cuts, the Near Foundation treasury “remains strong and well-managed,” Polosukhin said — encompassing $285 million in cash, 305 million Near tokens ($1.1 billion) and $70 million of investments and loans.","“The Foundation is well-placed to continue to support the ongoing growth, development, and further decentralization of the Near Protocol and ecosystem,” Polosukhin added.","The cuts also come despite a strong year for the Near ecosystem, with the Near Protocol now home to some of the top apps in web3 and a record number of daily users, according to the Near Foundation CEO. In a previous <a href=\"https:\/\/near.org\/blog\/2023-near-in-review\" data-v-f87c67ca=\"\">post<\/a> on Dec. 20, Polosukhin noted that four of DappRadar’s top ten <a href=\"https:\/\/dappradar.com\/rankings\" data-v-f87c67ca=\"\">apps<\/a> in web3 are built on the Near Protocol, with its daily active users often exceeding one million per day. \"With 7 million monthly active accounts, 35 million total accounts overall, and an average of over 2 million transactions per day, the Near ecosystem has seen substantial growth in usage this year,\" Polosukhin said at the time.","Data from The Block’s dashboard shows that daily average transactions on Near rose around 15 times throughout 2023, from 312,000 to 4.9 million.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/non-evm-chains-stats\/transactions-on-near-daily-7dma\/embed\" title=\"Transactions on NEAR (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The number of daily average new addresses on Near witnessed a similar increase over the same period, though the biggest proportion of this spike occurred in December — largely attributed to a surge in the popularity of inscriptions, as BRC-20-style tokens began <a href=\"https:\/\/www.theblock.co\/post\/266272\/brc-20-style-tokens-are-spreading-to-chains-beyond-bitcoin-but-why?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">spreading<\/a> to other chains beyond Bitcoin.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/non-evm-chains-stats\/number-of-new-addresses-on-near-daily-7dma\/embed\" title=\"Number of New Addresses on NEAR (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","However, Polosukhin suggested that the staff reductions were part of a longer-term decentralization plan. “Over time, Foundation’s footprint will continue to contract as the ecosystem further decentralizes and various nodes drive more activity in the network and across the ecosystem,” he said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Foundation","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Dec. 20","content":"DATE"},{"type":"Pagoda","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Near Foundation","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$70 million","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"40%","content":"PERCENT"},{"type":"Near Foundation CEO","content":"ORGANIZATION"},{"type":"BRC","content":"ORGANIZATION"},{"type":"Near Protocol","content":"ORGANIZATION"},{"type":"Illia Polosukhin","content":"PERSON"},{"type":"$285 million","content":"MONEY"},{"type":"$1.1 billion","content":"MONEY"},{"type":"The Foundation","content":"ORGANIZATION"},{"type":"Polosukhin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["LAYOFFS"],"authors":["James Hunt","The Block"]}