{"summary":"Core developers for the 0x protocol have released a new product for aggregating liquidity across different decentralized exchange (DEX) networks.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/54217\/0x-developers-release-liquidity-aggregation-tool-for-ethereum-based-exchange-protocol","publishDate":"2020-01-28T12:30:52","id":3901,"type":null,"title":"0x developers release liquidity aggregation tool for Ethereum-based exchange protocol","category":["DEX"],"content":["<span data-v-f87c67ca=\"\">The key development team behind 0x, the ethereum-based decentralized exchange protocol, has launched a new product for aggregating liquidity across different decentralized exchange (DEX) networks.<\/span>","<span data-v-f87c67ca=\"\">Established in 2016, the 0x protocol allows for the peer-to-peer exchange of assets on the Ethereum network. To date, the protocol has seen approximately $750 million in total volume and over 30 projects built upon it, according to its <\/span><a href=\"https:\/\/0x.org\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">website<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">In Dec. 2019, the 0x Core Team <\/span><a href=\"https:\/\/blog.0xproject.com\/0x-v3-tokentroves-explosive-growth-and-an-interview-with-tokenlon-7862b4785842\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">upgraded<\/span><\/a><span data-v-f87c67ca=\"\"> the protocol to Version 3, which included a set of bridge contracts that would enable liquidity aggregation from 0x as well as other DEX networks.<\/span>","<span data-v-f87c67ca=\"\">The new product utilizes these bridge contracts to tap into the liquidity pools of <\/span><span data-v-f87c67ca=\"\">both on-chain DEX networks like Kyber, Uniswap, and MakerDAO’s Oasis, as well as off-chain DEX networks like 0x, the company's marketing lead Matt Taylor told The Block.<\/span>","<span data-v-f87c67ca=\"\">“There are tons of projects that use the liquidity from individual DEX networks, but the liquidity isn’t connected,” Matt said. “Our goal is to provide the best price for any token trading pair on the market...it’s pretty much guaranteed with 0x API because we’re just pulling from networks that have the best prices.”<\/span>","<span data-v-f87c67ca=\"\">For instance, while 0x is liquid when it comes to popular trading pairs like DAI to ETh or USDC to DAI, he said, it lacks liquidity on other coins like Augur (REP) that might be more liquid on another network.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">0x API aims to solve this problem by creating an order that is split between all DEX networks and returning back the best price possible.&nbsp;<\/span><span data-v-f87c67ca=\"\">With a few lines of code, developers can now connect to the API, get a quote in the back end, and execute the transaction at the best price.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We want to be the most liquid decentralized exchange, but we also want to provide developers the best price,” he said. “If that’s not on 0x native liquidity, we’re happy to give them on Kyber, for example, because that’s a better developer experience.&nbsp;<\/span>","Notably, 0x API currently does not have a bridge with dYdX, a margin lending exchange that started sourcing liquidity from 0x in June 2019. dYdX has a closed pool, Matt explained, so while a maker using 0x API could potentially make an order on margin trade on dYdX, there is no way on the taker side to fill dYdX trades via 0x API.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DEX","content":"ORGANIZATION"},{"type":"2016","content":"DATE"},{"type":"$750 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"June 2019","content":"DATE"},{"type":"Matt Taylor","content":"PERSON"},{"type":"DAI","content":"ORGANIZATION"},{"type":"Dec. 2019","content":"DATE"},{"type":"Uniswap","content":"LOCATION"},{"type":"Matt","content":"PERSON"},{"type":"API","content":"ORGANIZATION"}],"hashtag":["UNISWAP"],"authors":["Yilun Cheng","The Block"]}