{"summary":"FTX is reportedly making a final push for its revival plans as it seeks submissions this week from interested parties.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236885\/ftx-restart-final-submissions-this-week-wsj","publishDate":"2023-06-28T07:27:13","id":3907,"type":null,"title":"FTX seeks final submissions this week for revival plans: WSJ","category":["COMPANIES"],"content":["Bankrupt crypto exchange FTX is reportedly making a final push for its revival plans as it seeks submissions this week from interested parties.","Any party that wants to help finance or participate in the restart of FTX must submit initial indications of interest this week to the company and its advisers, the Wall Street Journal <a href=\"https:\/\/www.wsj.com\/articles\/ftx-begins-talks-on-reboot-as-managers-uncover-past-misconduct-38ad7e3c\" data-v-f87c67ca=\"\">reported<\/a> Wednesday, citing people familiar with the matter.","The restart could happen through structures including a joint venture, the report said, quoting unnamed sources. FTX would also likely rebrand as part of any restart, and certain existing users could get stakes in any reorganized entity, per the report.","FTX, which filed for bankruptcy last November, has been looking to reboot its flagship international crypto exchange, FTX.com. Earlier this month, Kevin Cofsky, partner at investment bank Perella Weinberg Partners — which is tasked with exploring restructuring and capital market opportunities for FTX Group — <a href=\"https:\/\/www.theblock.co\/post\/233899\/ftx-bankers-want-to-keep-extraordinarily-valuable-customer-list-sealed\" data-v-f87c67ca=\"\">said<\/a> that the bank has reached out to a number of third parties about the idea of acquiring, investing into or reorganizing the FTX exchange.","\"We have also already engaged in a significant outreach process with respect to solicitation of third party interest in participating in a process to either acquire, invest into or reorganize the FTX exchange and based on those conversations, again it's our understanding that the existing customers are extremely valuable and valued by folks who would be interested in investing into a reorganized business,\" Cofsky said at the time.","He added that the exchange would be regulatory compliant and that creditors would end up as equity owners of a significant portion — or all — of the exchange.","Earlier this year, over 100 parties were interested in buying FTX units, court documents at the time showed. <a href=\"https:\/\/www.theblock.co\/linked\/105538\/blockchain-lending-figure-200-million-series-d-valuation-3-2-billion\" data-v-f87c67ca=\"\">Mike Cagney's Figure<\/a>, a blockchain technology company, has also indicated its interest in helping back a restart of FTX, per the WSJ report.","While FTX aims to revive its international exchange, it is reportedly uncertain whether its U.S. exchange, which represented a smaller part of its business, will resume operations. The revival efforts come at a time when regulators are scrutinizing the crypto sector, and recovering misspent customer funds has proven challenging for FTX.","FTX <a href=\"https:\/\/www.theblock.co\/post\/236474\/ftx-com-exchange-owed-customers-8-7-billion-debtors-say?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">owed<\/a> customers around $8.7 billion when it filed for bankruptcy last year, according to a new report from the FTX team released earlier this week. The team said it has made “substantial progress” in securing assets and has recovered about $7 billion in liquid assets so far.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"earlier this week","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Kevin Cofsky","content":"PERSON"},{"type":"WSJ","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Cofsky","content":"PERSON"},{"type":"FTX Group —","content":"ORGANIZATION"},{"type":"$7 billion","content":"MONEY"},{"type":"Alameda","content":"LOCATION"},{"type":"Mike Cagney","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"$8.7 billion","content":"MONEY"},{"type":"last November","content":"DATE"},{"type":"Perella Weinberg Partners","content":"ORGANIZATION"}],"hashtag":["FTX"],"authors":["Yogita Khatri","The Block"]}