{"summary":"Anthropic’s potential $30 billion valuation could help FTX achieve 100% recovery given Sam Bankman-Fried&#x27;s stake, a bankruptcy lawyer said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/254667\/anthropics-new-raise-could-mean-full-payout-for-ftx-creditors-lawyer","publishDate":"2023-10-04T06:32:49","id":3910,"type":null,"title":"Anthropic’s new raise could mean full payout for FTX creditors: lawyer","category":["BANKRUPTCY"],"content":["<span data-v-f87c67ca=\"\">Artificial intelligence firm Anthropic has reportedly raised fresh funds from Google and other investors that could potentially boost its valuation to as much as $30 billion — and that’s a “good sign” for FTX creditors given Sam Bankman-Fried’s earlier investment, a crypto bankruptcy lawyer said.<\/span>","<span data-v-f87c67ca=\"\">Anthropic is looking to raise at least $2 billion in new funding after Amazon, just last week, poured a $1.25 billion investment into the major rival of OpenAI, The Information <\/span><a href=\"https:\/\/www.theinformation.com\/articles\/openai-rival-anthropic-in-talks-to-raise-2-billion-from-google-others-as-ai-arms-race-accelerates\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reported<\/span><\/a><span data-v-f87c67ca=\"\"> Tuesday. Anthropic said in a <\/span><a href=\"https:\/\/www.anthropic.com\/index\/anthropic-amazon\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">blog post<\/span><\/a><span data-v-f87c67ca=\"\"> last week that Amazon will invest up to $4 billion in the company.<\/span>","<span data-v-f87c67ca=\"\">Google, which had already acquired about 10% stake in the company in 2022, may invest in the new round, according to the media report, citing two sources familiar with the matter. With the new funds, the company valuation could climb to somewhere between $20 billion and $30 billion, the report said.<\/span>","<span data-v-f87c67ca=\"\">In April 2022, Anthropic <\/span><a href=\"https:\/\/www.anthropic.com\/index\/anthropic-raises-series-b-to-build-safe-reliable-ai\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">raised $580 million in its series B funding round led by Sam Bankman-Fried<\/span><\/a><span data-v-f87c67ca=\"\">, founder of now-bankrupt FTX.<\/span>","<span data-v-f87c67ca=\"\">The latest new funds and the potential increase in company valuation could “make it possible” for FTX to log a “100% recovery rate” in assets as part of the failed crypto exchange’s bankruptcy proceeding, Kunchou Tsai, managing partner of Taiwan-based Enlighten Law Group, told The Block.<\/span>","<span data-v-f87c67ca=\"\">Tsai, who has helped over 100 clients file their FTX claims, said there should be a lock-up period for Anthropic investors to dispose of their holdings for startup investments like this. “It remains uncertain when the FTX bankruptcy restructuring team would be able to sell off its [stake in Anthropic],” he added. “They might have to wait until Anthropic once goes public unless there are any special occurrences.”<\/span>","<span data-v-f87c67ca=\"\">FTX 2.0 Coalition, a group of FTX creditors, said in a <\/span><a href=\"https:\/\/x.com\/AFTXcreditor\/status\/1709345555971707368?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">post<\/span><\/a><span data-v-f87c67ca=\"\"> on X (formerly Twitter) that the potential Anthropic’s increased valuation could put FTX's stake at around $3 billion to $4.5 billion and that “FTX customers now stand to be made whole.”<\/span>","<span data-v-f87c67ca=\"\">Given that Bankman-Fried is facing multiple lawsuits from various entities, creditors, former FTX employees and government agencies, it’d be another point of argument as to who gets the priority in claiming Anthropic stake, according to Tsai. <\/span><span data-v-f87c67ca=\"\">“If Bankman-Fried invested in Athropic personally — not through FTX — then those who sued him separately may argue for priority in paying them first,” Tsai added.<\/span>","Thomas Braziel, partner at 117 Partners and 507 Capital — two firms that specialize in purchasing bankruptcy claims and distressed debt — told The Block that the Anthropic raise is great news for creditors. <span data-v-f87c67ca=\"\">​​“If there’s $10 billion of liabilities, just to keep the math simple, and this is $3 billion, that’s 30 cents. I mean that’s huge. That’s absolutely huge,” Braziel said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“This is on paper. People need to remember that it is on paper,” Braziel added. “Coinbase and other people, Kraken, raised money at some crazy valuation and now you can buy secondary for like a tenth of that. So that doesn’t mean this isn’t super valuable and clearly a big home run, but it just needs to be tempered with, ‘We’re not liquid.’”<\/span>","<span data-v-f87c67ca=\"\">The optimistic outlook in potentially improved recovery has led to <\/span><a href=\"https:\/\/www.coindesk.com\/markets\/2023\/09\/28\/ftx-bankruptcy-claims-soar-in-value-in-over-the-counter-markets-as-estate-recovers-73b\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">active trading<\/span><\/a><span data-v-f87c67ca=\"\"> of FTX bankruptcy claims in the over-the-counter market. <\/span><span data-v-f87c67ca=\"\">Tsai told The Block that he has helped a few clients in Chinese-speaking regions to sell their FTX claims in the U.S. as “some hedge funds are getting more interested.”<\/span>","<span data-v-f87c67ca=\"\">“Usually those Wall Street buyers would prefer claims worth over $5 million, but I’ve handled a case that successfully disposed of claims worth a bit over $2 million,” Tsai said, adding that one of his clients had secured a 35% rate in selling their claims.<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$3 billion","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Amazon","content":"LOCATION"},{"type":"$4 billion","content":"MONEY"},{"type":"April 2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"Tsai","content":"ORGANIZATION"},{"type":"30 cents","content":"MONEY"},{"type":"Taiwan","content":"LOCATION"},{"type":"100%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"35%","content":"PERCENT"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$20 billion","content":"MONEY"},{"type":"Braziel","content":"PERSON"},{"type":"$2 billion","content":"MONEY"},{"type":"$5 million","content":"MONEY"},{"type":"$1.25 billion","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$2 million","content":"MONEY"},{"type":"Kraken","content":"LOCATION"},{"type":"$10 billion","content":"MONEY"},{"type":"$580 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$4.5 billion","content":"MONEY"},{"type":"Alameda","content":"LOCATION"},{"type":"Kunchou Tsai","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Thomas Braziel","content":"PERSON"},{"type":"Enlighten Law Group","content":"ORGANIZATION"},{"type":"$30 billion","content":"MONEY"}],"hashtag":["BANKRUPTCY FILINGS","FTX","SAM BANKMAN-FRIED"],"authors":["Timmy Shen","Ryan Weeks","The Block"]}