{"summary":"Ava Labs provided details about its scaling solution Vryx as part of plans to enable Avalanche to support 100,000 transactions per second.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274683\/ava-labs-outlines-scaling-solution-vryx-in-plan-for-avalanche-to-reach-100000-tps","publishDate":"2024-01-26T13:05:02","id":3912,"type":null,"title":"Ava Labs outlines scaling solution Vryx in plan for Avalanche to reach 100,000 TPS","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Blockchain builder Ava Labs has laid out details for its scaling solution Vryx as part of plans to get the <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Avalanche <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248368\/avalanche-avax-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/Avalanche_Circle_RedWhite_Trans.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">AVAX<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.90%\n    <\/span><\/a> <!----><\/span><\/span> blockchain to support speeds of around 100,000 transactions per second.<\/span>","Ava Labs is already implementing the scaling approach, which was detailed in a <a href=\"https:\/\/hackmd.io\/@patrickogrady\/rys8mdl5p\" data-v-f87c67ca=\"\">research post<\/a> published today. It plans to have benchmarks in the next few weeks.","The scaling approach will be enabled on the first HyperSDK testnet, which is targeted for the middle of Q2. HyperSDK is the framework for building high-performance blockchains that have virtual machines, enabling them to offer smart contracts. Vryx will be used to support such blockchains built using the HyperSDK — known as hyperchains —&nbsp;and the idea is that this technology will trickle down to the main blockchain platform over time.","\"From the inception of the HyperSDK over a year and a half ago, Ava Labs has been obsessed with providing best-in-class scalability for anyone building their own blockchain on Avalanche. Today, we are moving one large step closer to this target with the release of Vryx,\" a spokesperson for Ava Labs said.","\"Many have reached out asking how the Avalanche HyperSDK will achieve the lofty throughput goals set out when originally launched. Vryx is the primary mechanism that we believe will allow us to deliver on best-in-class performance,\" they added.","The core idea behind Vryx is the notion of splitting up parts of the transaction process and having them run in a pipelined fashion. That means a block of transactions may be getting verified while the next block is already in development.&nbsp;This type of strategy has already been employed by blockchain platforms such as Aptos and Sui.&nbsp;","\"It is expected that Vryx will perform as well as other constructions that replicate transactions prior to their full verification in benign environments and will outperform them in adversarial environments,\" the spokesperson said.","<em data-v-f87c67ca=\"\">Update: Added quotation in final paragraph.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Aptos","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Vryx","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Ava Labs","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"-1.90%","content":"PERCENT"},{"type":"Sui","content":"PERSON"}],"hashtag":["AVALANCHE"],"authors":["Tim Copeland","The Block"]}