{"summary":"Kazakhstan’s government is cracking down on protests sparked by fuel costs, with the country’s internet access cut off on Wednesday.\nThe situation appears to have impacted some major bitcoin mining pools.\nAs previously reported, mining companies flocked to Kazakhstan after a crackdown in China, seeking cheap energy.","author":["Michael McSweeney","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/129312\/bitcoin-mining-pool-hashrates-fall-amid-kazakhstan-internet-shutdown","publishDate":"2022-01-05T12:20:36","id":392,"type":null,"title":"Bitcoin mining pool hashrates fall amid Kazakhstan internet shutdown","category":["Mining"],"content":["Kazakhstan's government has cut off internet access amid escalating protests, and the country's bitcoin mining operations appear to be caught up in the fray.","A <a href=\"https:\/\/twitter.com\/lawmaster\/status\/1478764142957846531\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">comparison of mining pool hashrates<\/a> from half a day ago — preceding the broader internet crackdown, as reported by multiple news outlets— and now indicates a decline in rates for numerous mining pools. The most significantly impacted are 1THash (82% decline), OKExPool (46.3% decline) and KuCoinPool (22.7% decline).","The situation is notable given that Kazakhstan is home to as much as 18% of the world's bitcoin hashrate, as estimated last fall by the Cambridge Centre for Alternative Finance. Major pools including F2Pool, AntPool and ViaBTC also saw declines, of 12.8%, 11.6% and 19.2%, respectively.&nbsp;","A three-day chart of mining pool activity also illustrates the decline occurring in the past day:","Word emerged early Wednesday that the Kazakh government moved to halt the country's internet access. Per The Guardian, this followed tightened access to mobile messaging platforms.&nbsp;","<script async=\"async\" src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\" data-v-f87c67ca=\"\"><\/script>","Even so, the hashrate impact is far from <a href=\"https:\/\/www.theblockcrypto.com\/data\/on-chain-metrics\/bitcoin\/bitcoins-hash-rate-daily\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">the dramatic drop<\/a> seen last year when China moved to ban the country's bitcoin mining ecosystem, which had long been the world's largest and most technologically dominant.&nbsp;","Still, the ongoing crisis in Kazakhstan, which appears far from resolving — Kazakhstan president Kassym-Jomart Tokayev has pledged a harsh crackdown on <a href=\"https:\/\/meduza.io\/live\/2022\/01\/05\/protesty-v-kazahstane-demonstranty-zahvatili-zdanie-administratsii-almaty-onlayn\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">the protests<\/a> and, as of press time, has declared a country-wide state of emergency — is the latest headache for miners who hoped for proverbially greener pastures away from China.","As <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2021-12-09\/bitcoin-btc-miners-who-flocked-to-kazakhstan-now-see-zero-potential\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Bloomberg<\/a> reported in early December, tightened energy supplies in the country led to restrictions for power-seeking miners. Yet efforts to formalize the industry within Kazakhstan were taking shape, as The Block reported, with <a href=\"https:\/\/www.theblockcrypto.com\/post\/129152\/following-energy-shortage-kazakhstan-is-reining-in-2021s-stampede-of-crypto-miners\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">more than 100 mining<\/a> businesses registered with the government as of this month.&nbsp;"],"hashtag":[]}