{"summary":"Luxury carmaker Bugatti and Adidas have joined forces to auction off 99 pairs of shoes that come with a digital twin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/260409\/adidas-web3-platform-auctioning-off-limited-edition-bugatti-inspired-shoes","publishDate":"2023-11-01T09:36:59","id":3920,"type":null,"title":"Adidas web3 platform auctioning off limited-edition Bugatti-inspired shoes","category":["ART AND COLLECTIBLES"],"content":["Adidas and Bugatti have joined forces to auction off a limited number of soccer \"boots\" via the shoemakers' web3 platform, the companies announced.","The 99 pairs of shoes inspired by Bugatti's car design come with a digital twin and will be listed for sale between Nov. 8 - 11. Would-be collectors will be able to place their bids using MoonPay, the companies said. The limited-edition shoes come in black and a shade of blue inspired by early Bugatti Grand Prix cars.","\"The exclusive new collection draws upon the characteristics that have come to define Bugatti, not only engineered for speed but created with a ‘Form Follows Performance’ design philosophy for the ultimate in ability,\" the companies <a href=\"https:\/\/newsroom.bugatti.com\/press-releases\/bugatti-and-adidas-create-limited-edition-football-boot-crafted-for-maximum-speed-and-style\" data-v-f87c67ca=\"\">said in a statement<\/a>. \"As with every Bugatti, they will remain rare and sought after by devoted collectors for years to come.\"","The announcement comes on the heels of Nike-RTFKT's recent \"forging\" <a href=\"https:\/\/twitter.com\/RTFKT\/status\/1715015744436543903\" data-v-f87c67ca=\"\">event<\/a>, which allowed NFT owners to order physical shoes. Large brands tapping into highly-engaged crypto consumers by offering limited editions of physical products that are paired with digital assets — often referred to as <em data-v-f87c67ca=\"\">phygitals<\/em> — is becoming <a href=\"https:\/\/www.theblock.co\/post\/192634\/nike-rtfkt-unveils-web3-sneakers\" data-v-f87c67ca=\"\">increasingly prevalent<\/a>.","Consumers wishing to place bids will have to do so in cryptocurrency, but that doesn't mean bidders have to own any. \"Although conducted using cryptocurrency, users have a direct on-ramp from traditional currency in the auction using MoonPay,\" according to the announcement.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bugatti","content":"ORGANIZATION"},{"type":"Bugatti Grand Prix","content":"ORGANIZATION"},{"type":"Nike","content":"ORGANIZATION"},{"type":"Nov. 8","content":"DATE"},{"type":"11","content":"DATE"}],"hashtag":[],"authors":["RT Watson","The Block"]}