{"summary":"SOMA Finance plans to issue a legally structured digital security token accessible to U.S. and global retail investors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/249433\/soma-finance-digital-security-token","publishDate":"2023-09-06T08:47:29","id":3924,"type":null,"title":"SOMA Finance plans to launch retail-compliant digital security token","category":["COMPANIES"],"content":["SOMA Finance, a collaborative venture between DeFi product provider MANTRA and registered broker-dealer Tritaurian Capital, is planning to introduce the SOMA token — which it claims will be the first legally issued and compliant digital security for U.S. and global retail investors.","The SOMA token is the first Regulation Crowdfunding issuance on the U.S.-compliant hybrid decentralized marketplace, adding digital securities to its crypto asset and NFT platform rollout, according to a statement today. “Regulation Crowdfunding opens up entirely new access to capital and compliant digital assets to companies seeking to benefit from DeFi without violating securities law and regulations,” the company said.","Contrasting crypto tokens that don’t represent equity in the issuer, the SOMA token offers a financial stake in SOMA Finance, functioning as a non-cumulative, participating preferred stock, the company said. SOMA plans to sell tokens worth up to $5 million across multiple tranches in the coming months, initially priced at $2.50 per token. Token holder benefits include dividends of up to 10% from SOMA's profits, the company added.&nbsp;","“We have been working quietly but diligently to develop the necessary technology world’s first hybrid decentralized marketplace for digital assets, compliant digital securities and NFTs while liaising with regulators to provide a highly regulated decentralized financial platform,” SOMA Finance co-founder and CEO of Tritaurian William B. Heyn said.","The phased launch of the SOMA Finance marketplace is underway, with its SOMAguard onboarding platform currently operational. The upcoming SOMA token sale will mark the debut of its SOMAstarter launchpad, followed by the decentralized exchange SOMAswap, with additional products to follow.","“Offering a compliant bridge between DeFi and traditional financial systems was no simple feat, but we are confident in our secure onboarding process and comprehensive encryption protocols.” SOMA Finance co-founder and CEO of MANTRA John Patrick Mullin added.","In addition to Regulation CF, digital asset and NFT offerings, SOMA Finance said it would also enable Regulation D, Regulation S and Regulation A listings while facilitating the compliant trading and issuance of tokenized equities and security token offerings.","Regulated activity on the platform will be managed by Tritaurian, leveraging SOMA Finance’s technology.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"SOMA","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"William B. Heyn","content":"PERSON"},{"type":"SOMA Finance","content":"ORGANIZATION"},{"type":"John Patrick Mullin","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"$2.50","content":"MONEY"},{"type":"$5 million","content":"MONEY"}],"hashtag":["DEXS"],"authors":["James Hunt","The Block"]}