{"summary":"Regulators in the Philippines are taking steps toward blocking local traders’ access to Binance. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284507\/phillipines-blocks-binance-crypto-regulations-trading","publishDate":"2024-03-25T14:08:26","id":3926,"type":null,"title":"Phillipines regulators take steps to block Binance","category":["ASIA"],"content":["<span data-v-f87c67ca=\"\">Regulators in the Philippines are taking steps toward blocking local traders’ access to Binance.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Philippines Securities and Exchange Commission (SEC) said Monday in a <\/span><a href=\"https:\/\/www.sec.gov.ph\/pr-2024\/sec-proceeds-with-blocking-of-binance\/#gsc.tab=0\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">statement<\/span><\/a><span data-v-f87c67ca=\"\"> that it has worked on obstructing access to the world’s largest crypto exchange by daily trading volumes because the platform does not have the required regulatory license to operate within its jurisdiction. The agency two weeks ago asked the National&nbsp; Telecommunications&nbsp; Commission (NTC) to help block Binance-linked web pages.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"The group has been actively employing promotional campaigns on social media to attract Filipinos to engage in investment and trading activities using its platforms,\" but Binance “has not secured from [regulators] a license to solicit investments from the public, nor to create or operate an exchange for the buying and selling of securities,\" the agency said in the statement.&nbsp; <\/span>","<span data-v-f87c67ca=\"\">Moves by regulators in the Philippines to restrict access to the trading platform don’t come as much of a surprise. Last fall, the country's SEC warned it was planning to block the platform because it had not secured approval to offer investment products to the nation's residents.&nbsp;<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"the Philippines","content":"LOCATION"},{"type":"Philippines Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"National&nbsp; Telecommunications&nbsp; Commission (NTC","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"}],"hashtag":[],"authors":["Elizabeth Napolitano","The Block"]}