{"summary":"Binance will stop accepting new UK customers from today while it seeks a new financial promotions approver in the country.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/257721\/binance-to-temporarily-stop-accepting-new-uk-users-after-fca-restriction","publishDate":"2023-10-16T12:22:51","id":393,"type":null,"title":"Binance to temporarily stop accepting new UK users after FCA restriction","category":["EXCHANGES"],"content":["Binance, the world's largest crypto exchange, said it would temporarily stop accepting new UK users from today, in an interim measure taken after its UK promotions approver Rebuilding Society was hit by a restriction from the country's Financial Conduct Authority regulator last week regarding new crypto promotions rules.","Binance said in an <a href=\"https:\/\/www.binance.com\/en-GB\/blog\/all\/update-on-binance-for-uk-users-937596818854026589\" data-v-f87c67ca=\"\">announcement<\/a> it was currently looking for a new FCA-authorized partner in the UK but that there would be some temporary restrictions to its platform and mobile app for UK users until a new partner is found and its financial promotions reapproved.","Existing users will retain current services — if they have completed an \"Investor Declaration\" and \"Appropriateness Test\" connected to the new rules — but any new products or services will not be available during this period, Binance said.","Binance added that it is working closely with the FCA to ensure users \"are not harmed by these developments.\" It will continue to ensure that risk warnings remain in place and will encourage UK users to read its \"info\" tab before investing in specific crypto assets.","Binance only <a href=\"https:\/\/www.theblock.co\/post\/255431\/coinbase-okx-and-binance-partner-with-uk-firms-as-regulations-come-into-force\" data-v-f87c67ca=\"\">announced its partnership<\/a> with the decade-old peer-to-peer lending firm on Oct. 8 but, just two days later, the FCA imposed <a href=\"https:\/\/www.theblock.co\/post\/255619\/binances-uk-approver-hit-with-fca-restrictions-days-after-partnership-announced\" data-v-f87c67ca=\"\">legally-binding restrictions<\/a> on Rebuilding Society, meaning it could no longer approve financial promotions with effect from Oct. 11 and must withdraw any prior financial promotion approvals it had granted to unauthorized entities.&nbsp;","\"The firm must not approve the content of any financial promotion for a qualifying cryptoasset for communication by an unauthorized person,\" the FCA's OIREQ requirement <a href=\"https:\/\/register.fca.org.uk\/s\/firm?id=001b000000h3VbpAAE#what-can-this-firm-do-restrictions\" data-v-f87c67ca=\"\">stated<\/a> at the time.","When The Block reached out to Binance last week regarding that news, a spokesperson for the company said, \"Binance has invested an enormous amount of time and resources in ensuring that Binance.com\/en-GB is positioned to comply with the detailed requirements of the UK’s Financial Promotions Regime. We have implemented all necessary restrictions for UK users and partnered with an FCA authorized firm, <a href=\"http:\/\/rebuildingsociety.com\/\" data-v-f87c67ca=\"\">Rebuildingsociety.com<\/a> Limited, in order to meet our obligations.\"","\"We shared our agreement with <a href=\"http:\/\/rebuildingsociety.com\/\" data-v-f87c67ca=\"\">Rebuildingsociety.com<\/a> with the FCA on Oct. 2, almost a full week before the requirements of the updated Financial Promotions Regime came into effect,\" the spokesperson continued. \"The FCA issued warnings against more than 140 firms for breaches of the Financial Promotions Regime since it was updated on Oct. 8. That Binance is not among these firms is testament to the processes and procedures it has implemented to comply with requirements.\"","The FCA's new regime for crypto asset financial promotions took effect on Oct. 8. Entities already registered or authorized by the FCA can approve financial promotions on behalf of unregulated firms, like Binance.","The regulator said unregistered crypto asset firms who fail to comply with the new financial promotions guidelines are likely to be in breach of section 21 of the UK's Financial Services and Markets Act 2000. This would be a criminal offense, punishable by up to two years imprisonment, an unlimited fine, or both.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"\"Binance","content":"ORGANIZATION"},{"type":"FCA","content":"ORGANIZATION"},{"type":"2000","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Financial Conduct Authority","content":"ORGANIZATION"},{"type":"Oct. 2","content":"DATE"},{"type":"Oct. 8","content":"DATE"},{"type":"Oct. 11","content":"DATE"},{"type":"UK’s Financial Promotions Regime","content":"ORGANIZATION"},{"type":"Financial Promotions Regime","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"UK's Financial Services","content":"ORGANIZATION"},{"type":"two days later","content":"DATE"}],"hashtag":["BINANCE","FCA"],"authors":["James Hunt","The Block"]}