{"summary":"Crypto-friendly investing app provider Revolut has raised $500 million in a Series D round that values it at $5.5 billion\nWith the fresh capital in place, London-based Revolut plans to improve its product and revenue","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/56873\/crypto-friendly-fintech-firm-revolut-raises-500m-at-a-5-5b-valuation","publishDate":"2020-02-25T05:40:25","id":393,"type":null,"title":"Revolut Raises $500M in a Series D that values it at $5.5B","category":["Investments"],"content":["Crypto-friendly investing app provider Revolut has raised $500 million in a Series D round that values it at $5.5 billion.","Venture capital firm TCV led the round - an early investor in companies like Facebook and Netflix, TechCrunch <a href=\"https:\/\/techcrunch.com\/2020\/02\/24\/revolut-raises-500-million-at-5-5-billion-valuation\/\" data-v-f87c67ca=\"\">reported<\/a> Tuesday. Existing investors DST Global, Index Ventures and many others also participated.","With the fresh capital in place, London-based Revolut plans to improve its product and revenue. Specifically, retail and business users can expect new lending services. They can also expect full bank accounts in Europe in the future.","“We’re on a mission to build a global financial platform — a single app where our customers can manage all of their daily finances, and this investment demonstrates investor confidence in our business model,” said Revolut founder and CEO, Nik Storonsky. “Going forward, our focus is on rolling-out banking operations in Europe, increasing the number of people who use Revolut as their daily account, and striving towards profitability.”&nbsp;","Revolut’s plan to raise $500 million was <a href=\"https:\/\/www.theblockcrypto.com\/linked\/46958\/crypto-friendly-investing-app-revolut-in-talks-to-raise-500m-for-global-expansion\" data-v-f87c67ca=\"\">first revealed<\/a> in November. At the time, the company said it wants to expand globally, including the U.S. and Japan.","Launched in 2015, Revolut has now raised $836 million in total. It claims to serve over 10 million customers, but is still a loss-making firm. It had a net loss of ~$42 million in 2018, while its revenue increased to ~$74 million from ~$17 million a year earlier.","Revolut offers both&nbsp;cryptocurrency&nbsp;and&nbsp;stock trading&nbsp;services via its apps. The firm recently also partnered with payments giant&nbsp;Visa&nbsp;and&nbsp;Mastercard&nbsp;to launch debit cards in the U.S. and other markets."],"hashtag":[]}