{"summary":"The Jack Dorsey-led payments company said that for the fourth quarter of 2020, it sold $1.76 billion in bitcoin via its Cash App.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/95882\/square-bitcoin-2020-cash-app-results","publishDate":"2021-02-23T16:17:16","id":3930,"type":null,"title":"Square reports $4.57 billion in bitcoin sales for 2020 via Cash App","category":["BITCOIN"],"content":["Square said Tuesday that it conducted $1.76 billion in bitcoin sales during the fourth quarter of 2020, with $4.57 billion sold for the entirety of last year.","Accounting for the money spent to acquire the bitcoin it sold, Square said in its report, as <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1512673\/000119312521052320\/d128971dex991.htm\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">filed with the SEC<\/a>, that it generated $97 million in gross profits during 2020 from its bitcoin sales. Square said fourth-quarter gross profits were $41 million.","\"During the full year 2020, we saw significant growth in bitcoin revenue year over year. While bitcoin revenue was $4.57 billion in 2020, up approximately 9x year over year, bitcoin gross profit was only $97 million, or approximately 2% of bitcoin revenue,\" Square said.","","","\"Bitcoin revenue and gross profit benefited from an increase in bitcoin actives and growth in customer demand, as well as a significant year-over-year increase in the market price of bitcoin,\" the firm said.","Square noted in its report that Cash App's active user ranks have swelled because of its bitcoin offering, accounting for some three million customers who purchased or sold bitcoin in 2020:","\"In 2020, more than three million customers purchased or sold bitcoin on Cash App, and, in January 2021, more than one million customers purchased bitcoin for the first time. Furthermore, in the fourth quarter of 2020, bitcoin volumes per customer were up more than 2.5x year over year, primarily driven by buying activity, as existing customers continued to buy bitcoin and new adopters bought even greater volumes of bitcoin. Bitcoin has helped increase gross profit per active customer and engagement in our broader ecosystem as bitcoin actives use other products, such as Cash Card and direct deposit, more frequently compared to the average Cash App customer.\"","Square also said that it expanded its bitcoin holdings beyond the <a href=\"https:\/\/www.theblockcrypto.com\/post\/80175\/jack-dorsey-square-purchases-50-million-worth-of-bitcoin\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">$50 million<\/a> worth it purchased in October:","\"Square also announced today that it has purchased approximately 3,318 bitcoins at an aggregate purchase price of $170 million. Combined with Square’s previous purchase of $50 million in bitcoin, this represents approximately five percent of Square’s total cash, cash equivalents and marketable securities as of December 31, 2020.\"","As shown in the chart above, Square's bitcoin offering has come a long way since its inception in early 2018 in terms of volume as well as public visibility. Beyond the Cash App service, Square has devoted resources to bitcoin development.","CEO Jack Dorsey has become an advocate for bitcoin in the business world, and most recently unveiled a bitcoin development fund, in partnership with hip-hop artist and producer Jay-Z, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/94732\/twitter-dorsey-500-btc-developer\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">backed by 500 BTC<\/a>.&nbsp;","Dorsey said during Tuesday's earnings call: \"We're also going to double down on our commitment to Bitcoin and continue to look for new ways to connect our product lines within the Cash App.\"","Nor is Square alone in seeking to offer consumer-facing crypto services via the traditional payments realm.","Last year, PayPal went public with its crypto offering in partnership with industry startup Paxos. PayPal has said it is investing in <a href=\"https:\/\/www.theblockcrypto.com\/post\/93668\/paypal-crypto-business\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a new unit<\/a> focused on crypto and digital currencies, with a long-horizon view to support <a href=\"https:\/\/www.theblockcrypto.com\/post\/94687\/paypal-ceo-central-bank-digital-currencies\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">central bank digital currencies<\/a> should those gain traction in the world of payments.&nbsp;","For PayPal, the benefits are particularly visible in the form of user engagement, according to one of its executives.","\"Every day we're seeing an incredibly healthy influx of first-time users. An increased engagement once they've made their first crypto purchases. Customers who have purchased crypto have been logging into PayPal at roughly twice their log-in frequency prior to actually having purchased crypto which is amazing,\" chief strategy officer Jonathan Auerbach said recently.","Payments giants Visa and Mastercard have both highlighted their growing crypto footprints as well. Earlier this month, Mastercard revealed that it would support payments made with stablecoins as part of <a href=\"https:\/\/www.theblockcrypto.com\/post\/94669\/mastercard-cfo-cryptocurrencies-stablecoins-central-banks\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a broader, three-pronged strategy<\/a> focused on cryptocurrencies, stablecoins and CBDCs.","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Editor's Note: <\/strong>This story has been updated with additional information. The headline has also been updated for clarity.<\/em>","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$41 million","content":"MONEY"},{"type":"2%","content":"PERCENT"},{"type":"SEC","content":"ORGANIZATION"},{"type":"January 2021","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Jay","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Dorsey","content":"PERSON"},{"type":"December 31, 2020","content":"DATE"},{"type":"$4.57 billion","content":"MONEY"},{"type":"Square","content":"LOCATION"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Cash App","content":"ORGANIZATION"},{"type":"$170 million","content":"MONEY"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"the fourth quarter of 2020","content":"DATE"},{"type":"$97 million","content":"MONEY"},{"type":"$1.76 billion","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"October","content":"DATE"},{"type":"$50 million","content":"MONEY"},{"type":"Jonathan Auerbach","content":"PERSON"}],"hashtag":["BITCOIN"],"authors":["Michael McSweeney","The Block"]}