{"summary":"BlockFi raised $30 million in a Series B round led by Valar Ventures.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/55812\/blockfi-raises-30-million-as-it-looks-to-become-more-than-just-a-lender","publishDate":"2020-02-13T08:36:55","id":3931,"type":null,"title":"BlockFi raises $30 million as it looks to become more than just a lender","category":["LENDING"],"content":["BlockFi is building the go-to crypto bank. Just don't call them that.&nbsp;","The New York-based firm gatecrashed the cryptocurrency landscape in 2018 with little fanfare and a modest $1.55 million fundraise. At the time, the firm positioned itself as a retail lender — a platform on which users could store their bitcoin or ethereum and ascertain a high-yield.&nbsp;","But the firm has grown up a lot since then, locking down $18.3 million in venture capital in August and then another $30 million, announced on Thursday. Flush with cash, the firm is eyeing new opportunities including the build out of its institutional lending operations, retail brokerage, and a new bitcoin rewards credit card.&nbsp;","In sum: familiar lines of businesses for Wall Street's storied banks.&nbsp;","<span data-v-f87c67ca=\"\">Participants in the round included previous investors like Morgan Creek Digital, Akuna Capital, Fidelity's Avon, Kenetic Capital and CMT Digital as well as new investors such as Hong Kong-based HashKey Capital and Castle Island Ventures. Valar, a Fintech focused investor which counts Stash, TransferWise, and N26 among its portfolio, is leading the round after leading its August raise.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Andrew McCormack, general partner at Valar Ventures said in a released statement, “BlockFi has been one of the most successful companies we've invested in right out of the gate.”<\/span>","<span data-v-f87c67ca=\"\">The company now boasts more than $650 million in assets on the platform, with a 0% loss rate across its entire loan portfolio since the company began lending in January 2018. BlockFi grew revenue more than 20x in 2019.<\/span>","<strong data-v-f87c67ca=\"\">\"Diversified financial services entity\"<\/strong>","In a sense, BlockFi is more Fintech than it is crypto, following in the path of firms like SoFi and Robinhood, which come to market with one initial product that aims to unbundle a traditional financial services function and then expand into new product offerings bundled within the same platform.","","","\"We will be associated less and less with the crypto lending category and more and more be identified as a diversified financial-services entity,\" chief executive office Zac Prince said in a phone interview with The Block.&nbsp;","As mentioned, BlockFi has already launched its own retail broker to offer similar services to powerhouses like Coinbase. The new offering makes sense for consumers, who then wouldn't have to move their funds off BlockFi in order to trade. And that stickiness keeps more funds under the firm's management, which makes it a more attractive partner to high-frequency trading firms who want access to retail flow and to strike up lending deals.&nbsp;","Thus far the business, which launched last year, supports bitcoin, litecoin, and ether. In its first month it saw $10 million in volume — a fraction of Coinbase. The firm is planning to roll-out its own native app in 2020.&nbsp;","The success of the trading function, in part, played into the fundraise, according to Prince. Such a business requires a higher reserve of capital.&nbsp;","Still, the firm isn't necessarily trying to go head to head with exchanges as they want to leave the core liquidity matching function to \"the experts.\"&nbsp;","<span data-v-f87c67ca=\"\">Elsewhere, the firm is gearing up to expand its total addressable market by going after customers that currently don’t already own crypto with a plan to offer a bitcoin-rewards credit card, a normal credit card that pays cash-back in bitcoin, a first of its kind. The firm is working with incumbent banking and credit card firms on a credit card product and could explore other robo-advising like offerings such as tax-loss harvesting, retirement account support, and auto investing functions.&nbsp;<\/span>","The company has a current job listing for a <a href=\"https:\/\/boards.greenhouse.io\/blockfi\" data-v-f87c67ca=\"\">payments product lead<\/a> to oversee a go-to-market strategy and to develop payment products in the BlockFi ecosystem, including a credit card, debit card and fiat on and off-ramps.","Indeed, a credit card product would require a war chest of cash for marketing and to de-risk the business.","\"We want to be able to do this with confidence from a financing and marketing perspective,\" Prince said.&nbsp;","\"As we dug into the credit card more we thought we could bring this to a more mainstream audience.\"","To that end, the firm expects to expand its marketing budget by a factor of 30x.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Castle Island Ventures","content":"ORGANIZATION"},{"type":"$1.55 million","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"Kenetic Capital","content":"ORGANIZATION"},{"type":"Akuna Capital","content":"ORGANIZATION"},{"type":"Fintech","content":"ORGANIZATION"},{"type":"$18.3 million","content":"MONEY"},{"type":"0%","content":"PERCENT"},{"type":"Hong Kong","content":"LOCATION"},{"type":"TransferWise","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"},{"type":"Valar Ventures","content":"ORGANIZATION"},{"type":"August","content":"DATE"},{"type":"HashKey Capital","content":"ORGANIZATION"},{"type":"Morgan Creek Digital","content":"ORGANIZATION"},{"type":"CMT Digital","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Zac Prince","content":"PERSON"},{"type":"$30 million","content":"MONEY"},{"type":"Andrew McCormack","content":"PERSON"},{"type":"January 2018","content":"DATE"},{"type":"$650 million","content":"MONEY"},{"type":"2020","content":"DATE"}],"hashtag":["BLOCKFI","FINTECH"],"authors":["Frank Chaparro","Ryan Todd","The Block"]}