{"summary":"Binance&#x27;s latest report on institutional crypto sentiment found 63.5% of respondents expressed a positive outlook for the sector in the next 12 months, and 88% held the same view for the next decade.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237284\/over-60-of-institutional-investors-positive-about-crypto-over-the-next-year-says-binance","publishDate":"2023-06-30T11:16:20","id":3944,"type":null,"title":"Over 60% of institutional investors positive about crypto over the next year, says Binance","category":["COMPANIES"],"content":["A new Binance report finds 63.5% of investors had a positive outlook for crypto assets over next 12 months.","The vast majority (88%) of institutional respondents expressed positive sentiment towards crypto assets for next decade.","A new Binance report on institutional crypto sentiment found 63.5% of respondents expressed a positive outlook for the sector in the next 12 months, while 88% held the same view for the next decade.","Perversely, the&nbsp;<a href=\"https:\/\/research.binance.com\/static\/pdf\/institutional-crypto-outlook-survey-2023.pdf\" data-v-f87c67ca=\"\">'Institutional Crypto Outlook Survey'<\/a> from Binance Research also found that just 26.9% of institutional users believe that more real-world use cases will drive adoption of the sector.","The respondents, it should be noted, are already investing in the industry.&nbsp;The survey was based on responses from 208 of&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/237036\/binance-setbacks-europe\" data-v-f87c67ca=\"\">Binance's<\/a> institutional clients and VIP users, and ran from March 31 to May 15, 2023.&nbsp;","Released on Friday, the report's authors said that 25.3% of respondents said regulatory clarity would stand out as a major driver of crypto adoption. Another big driver, according to respondents, would be more institutional involvement in the form of crypto-friendly banks and other financial institutions entering the space.&nbsp;","The report further claimed 47.1% of institutional investors maintained their crypto allocation over the past year and that over a third, 35.6%, increased their allocation in the same period. When planning for the future, 50% of investors said they expected to increase their allocation, with just 4.3% stating they would reduce allocation to crypto in the next 12 months.","Of the&nbsp;institutional investors who responded to the survey, 44.7% utilized crypto for intraday strategies, with the next most commonly cited use case, at 23.1%, being for market-making and arbitrage activities. Over half the respondents managed under $25 million in crypto, while 22.6% had a crypto allocation of over $100 million. \"Interestingly, for funds with an AUM above $75 million, portfolio diversification surfaced as an additional motivation to invest in cryptocurrencies,\" the report stated.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"35.6%","content":"PERCENT"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"63.5%","content":"PERCENT"},{"type":"44.7%","content":"PERCENT"},{"type":"4.3%","content":"PERCENT"},{"type":"88%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"May 15, 2023","content":"DATE"},{"type":"AUM","content":"ORGANIZATION"},{"type":"26.9%","content":"PERCENT"},{"type":"March 31","content":"DATE"},{"type":"Binance Research","content":"ORGANIZATION"},{"type":"VIP","content":"ORGANIZATION"},{"type":"$75 million","content":"MONEY"},{"type":"$25 million","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"25.3%","content":"PERCENT"},{"type":"47.1%","content":"PERCENT"},{"type":"22.6%","content":"PERCENT"},{"type":"Binance","content":"ORGANIZATION"},{"type":"23.1%","content":"PERCENT"}],"hashtag":["BINANCE","CRYPTO"],"authors":["Brian McGleenon","The Block"]}