{"summary":"The total supply of the USDC stablecoin on the Ethereum blockchain has surpassed that of USDT&#x27;s for the first time.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/130342\/usdc-supply-on-ethereum-surpasses-usdt-first-time","publishDate":"2022-01-14T12:30:27","id":3948,"type":null,"title":"USDC&#x27;s supply on Ethereum surpasses that of USDT&#x27;s for the first time","category":["STABLECOINS"],"content":["The total supply of the USDC stablecoin on the Ethereum blockchain has surpassed that of rival Tether's (USDT) for the first time.","The current total supply of USDC on Ethereum stands at <a href=\"https:\/\/etherscan.io\/token\/0xa0b86991c6218b36c1d19d4a2e9eb0ce3606eb48\" data-v-f87c67ca=\"\">39.92 billion<\/a>, whereas USDT's total supply on the blockchain stands at <a href=\"https:\/\/etherscan.io\/token\/0xdac17f958d2ee523a2206206994597c13d831ec7\" data-v-f87c67ca=\"\">39.82 billion<\/a>, according to Etherscan.","USDC's supply beating USDT's on Ethereum is significant since the blockchain remains a major contributor of growth for both stablecoins. USDC and USDT are available on several blockchains, including Solana and Algorand.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/usdt-supply-by-blockchain-daily\/embed\" title=\"USDT Supply by Blockchain\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/usdc-supply-by-blockchain\/embed\" title=\"USDC Supply by Blockchain\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","One of the main reasons for USDC's recent growth has been its increased usage in the decentralized finance (DeFi) market. Stablecoins are used for trading on decentralized exchanges and for various purposes within DeFi protocols.","Recent significant market moves also drove USDC’s growth, a Circle spokesperson told The Block.","\"As digital asset markets trend up or down, both scenarios tend to generate increased demand for USDC — especially during significant market moves,” said the spokesperson.","When markets move up, increased interest from investors causes an increased demand for USDC as a way to bring fiat currency into crypto trading platforms. On the contrary, when markets go down, more traders are selling volatile assets into stablecoins like USDC, said the spokesperson.","USDT is different from its competitors \"that rely mainly on DeFi platforms to boost their supply,\" Tether CTO Paolo Ardoino told The Block. USDT's demand is mainly driven by centralized exchange users and institutions, he said.","But with the recent bearish crypto market sentiment, USDT's demand from institutions has decreased, said Ardoino, adding that demand from retail investors, however, is growing from Turkey and several countries in Latin America.","Looking at the bigger picture, USDT's total supply across blockchain continues to remain higher than that of USDC's. The former's current total supply stands at over 82 billion, and the latter's stands at around 45 billion.","USDC's supply has been consistently increasing over the past several months, whereas USDT's supply has remained somewhat stagnant.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-stablecoin-supply-daily\/embed\" title=\"Total Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Ardoino said there is a \"sufficient amount\" of USDT in circulation.","Tether has been increasingly freezing funds recently. Earlier this week, the stablecoin issuer <a href=\"https:\/\/dune.xyz\/phabc\/usdt---banned-addresses\" data-v-f87c67ca=\"\">blocked<\/a> three Ethereum addresses holding over $160 million worth of USDT.","Regarding the freeze, Ardoino said, \"Tether is cooperating with a law enforcement request, imposing a temporary freeze to allow the investigation to proceed.\"","Last month, Tether <a href=\"https:\/\/www.theblockcrypto.com\/post\/129133\/tether-freezes-over-1-million-usdt-single-address\" data-v-f87c67ca=\"\">froze<\/a> over $1 million worth of USDT belonging to a single blockchain address.","<em data-v-f87c67ca=\"\">Update (Jan. 14, 1 pm EST): This story has been updated to include comments from a Circle spokesperson.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$160 million","content":"MONEY"},{"type":"USDT","content":"ORGANIZATION"},{"type":"Turkey","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Latin America","content":"LOCATION"},{"type":"Jan. 14","content":"DATE"},{"type":"39.82 billion","content":"MONEY"},{"type":"Tether CTO","content":"ORGANIZATION"},{"type":"45 billion","content":"MONEY"},{"type":"Ardoino","content":"PERSON"},{"type":"$1 million","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"39.92 billion","content":"MONEY"},{"type":"82 billion","content":"MONEY"},{"type":"Solana","content":"PERSON"}],"hashtag":["ETHEREUM","USDC"],"authors":["Yogita Khatri","The Block"]}