{"summary":"The CEO of Celsius just shared that the team is working &quot;non-stop&quot; to address the lender&#x27;s withdrawal freeze.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/152317\/celsius-is-working-non-stop-according-to-its-ceo-but-has-yet-to-share-action-steps-post-withdrawal-freeze","publishDate":"2022-06-15T16:00:52","id":3949,"type":null,"title":"Celsius is working &#x27;non-stop&#x27; according to its CEO but has yet to share action steps post-withdrawal freeze","category":["LENDING"],"content":["The CEO of Celsius just shared that the team is working \"non-stop\" to address the lender's withdrawal freeze, but the firm has yet to share a path forward from recent turmoil.","\"We’re focused on your concerns and thankful to have heard from so many,\" <a href=\"https:\/\/twitter.com\/Mashinsky\/status\/1537147449088872449?s=20&amp;t=Qj9POdExuVMtbkI6GS1aoA\" data-v-f87c67ca=\"\">tweeted<\/a> CEO Alex Mashinsky. \"To see you come together is a clear sign our community is the strongest in the world. This is a difficult moment; your patience and support mean the world to us.\"","Indeed, it's been a challenging few days for the lender, which began when it <a href=\"https:\/\/www.theblock.co\/linked\/151522\/crypto-lending-firm-celsius-pauses-withdrawals-and-transfers-citing-market-conditions\" data-v-f87c67ca=\"\">paused withdrawals<\/a> late Sunday night to stabilize its liquidity position. It took to Twitter to announce the suspension of withdrawals, transfers and swaps, citing market conditions as crypto prices cratered. The platform's native token, CEL, <a href=\"https:\/\/www.theblock.co\/linked\/152019\/celsius-crypto-token-price-spikes-before-falling-again\" data-v-f87c67ca=\"\">dropped<\/a> with the news.","Since the announcement, other lenders have sought to<a href=\"https:\/\/www.theblock.co\/post\/151624\/celsius-rivals-move-to-distance-themselves-from-its-staked-ether-woes\" data-v-f87c67ca=\"\"> distance themselves<\/a> from staked ether (stETH), the main culprit behind Celsius's liquidity crunch. As The Block reported, stETH is traded with ETH on decentralized exchange Curve Finance at a usual 1:1 ratio, but that ratio has recently become unbalanced due in part to the dip in ETH price, spelling liquidity troubles for stETH holders. Celsius held a considerable amount of stETH tokens that became near impossible to convert back in the unbalanced market.","Amid the fallout, Celsius has reportedly <a href=\"https:\/\/www.theblock.co\/linked\/152084\/crypto-lender-celsius-mulls-possible-restructuring-amid-financial-woes-wsj\" data-v-f87c67ca=\"\">hired<\/a> a team of restructuring lawyers from Akin Gum Strauss Hauer &amp; Feld LLP. It's also <a href=\"https:\/\/www.theblock.co\/post\/152230\/citigroup-celsius-advising-after-withdrawal-freeze\" data-v-f87c67ca=\"\">appointed<\/a> Citigroup to advise it on possible solutions and potential financing options. The bank previously advised the lender on its mining subsidiary and initial public offering plans.&nbsp;","Still, this has yet to transform into a tangible plan for the firm. Withdrawals remain paused and it's unclear when that will change. Mashinsky's message is similar to the one the Celsius account <a href=\"https:\/\/twitter.com\/CelsiusNetwork\/status\/1536770444140810242?s=20&amp;t=Qj9POdExuVMtbkI6GS1aoA\" data-v-f87c67ca=\"\">tweeted<\/a> yesterday:","\"@CelsiusNetwork is working around the clock for our community. It’s all hands on deck, so there will be no Twitter Spaces this week.\"","Earlier that day the firm's account said it was \"working as quickly as possible and will share information when it becomes appropriate.\"","Meanwhile, policymakers are <a href=\"https:\/\/www.theblock.co\/post\/152262\/following-celsius-freeze-us-policymakers-are-on-high-alert-for-crypto-systemic-contagion\" data-v-f87c67ca=\"\">monitoring the situation<\/a>. The Securities and Exchange Commission (SEC) has made it clear that it's wary of crypto lenders, taking action against BlockFi's high yield product and standing in the way of Coinbase's planned Lend platform. Chair Gary Gensler referenced the fallout on Tuesday, though he did not name Celsius, comparing the halted withdrawals to the paused withdrawals during the meme stock scandal of January 2021.","“Many of the crypto lending platforms, they actually own your asset in some joint omnibus account,” said Gensler. “Then you see things like this weekend and Monday where there's one crypto exchange, one crypto lending platform said ‘You can't withdraw. Not now.’\"","Gensler said regulators should be able to bring the same protections in crypto than it brought in traditional finance.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"Akin Gum Strauss Hauer &amp; Feld LLP","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January 2021","content":"DATE"},{"type":"weekend","content":"DATE"},{"type":"Citigroup","content":"ORGANIZATION"},{"type":"Alex Mashinsky","content":"PERSON"},{"type":"night","content":"TIME"},{"type":"Curve Finance","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"}],"hashtag":["LENDING"],"authors":["Aislinn Keely","The Block"]}