{"summary":"Tether says the NYAG handed over documents to CoinDesk from its 2021 settlement, including bank statements.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234966\/tether-says-new-york-handed-over-financial-documents-to-coindesk","publishDate":"2023-06-15T12:56:05","id":3956,"type":null,"title":"Tether says New York handed over financial documents to CoinDesk","category":["COMPANIES"],"content":["Stablecoin issuer Tether said Thursday that New York's Attorney General has provided information about the company's business that was gathered in the course of a 2021 <a href=\"https:\/\/www.theblock.co\/post\/95207\/bitfinex-tether-new-york-ag-settlement-lawsuit\" data-v-f87c67ca=\"\">settlement<\/a> with the state to crypto media publication CoinDesk.","In February 2021, the NYAG agreed with Tether to cease activity with those living in New York and pay $18.5 million in fines. The investigation found that Tether at times lacked banking access and that its stablecoin was not always backed 1:1 with cash.","Shortly after, CoinDesk filed a <span class=\"ILfuVd\" lang=\"en\" data-v-f87c67ca=\"\"><span class=\"hgKElc\" data-v-f87c67ca=\"\">Freedom of Information Law request with the NYAG for the documents gathered during the investigation. Initially Tether fought the request but it said today that it dropped its opposition.<\/span><\/span>","The documents include statements from Tether's banks, which Tether argued are out of date — having changed the core makeup of the stablecoin's backing over the last two years.","The documents include a lot of names of private individuals who were Tether's customers at the time, according to a source familiar with the matter.","\"The published information, if properly read and interpreted, only demonstrates publicly the legitimacy of Tether’s business and the existence of its reserves,\" Tether said in a <a href=\"https:\/\/tether.to\/en\/tether-on-FOIL-and-continued-commitment-to-transparency\/\" data-v-f87c67ca=\"\">blog post<\/a>.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"NYAG","content":"ORGANIZATION"},{"type":"February 2021","content":"DATE"},{"type":"Tether","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"$18.5 million","content":"MONEY"},{"type":"last two years","content":"DATE"}],"hashtag":["TETHER"],"authors":["Tim Copeland","The Block"]}