{"summary":"Crypto veterans are angry about the way Worldcoin, the crypto project co-created by Sam Altman, managed the release of its token last week. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242109\/worldcoin-ceo-defends-token-launch-after-criticism-over-unfair-distribution","publishDate":"2023-08-03T11:01:29","id":3964,"type":null,"title":"Worldcoin CEO defends token launch after criticism over unfair distribution","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Crypto veterans are angry about the way Worldcoin, the crypto project co-created by Sam Altman, managed the release of its long-awaited token last week.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The identity-focused crypto project&nbsp;<\/span><a href=\"https:\/\/www.theblock.co\/post\/241074\/sam-altman-worldcoin-launches-token\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">launched its WLD token on July 24<\/span><\/a><span data-v-f87c67ca=\"\"> — with more than 2 million people signed up to receive their share. But Worldcoin, its market making partners and exchanges listing WLD have all come in for criticism over the airdrop.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Matt Batsinelas, founder of Glass Markets, told The Block, “Roughly 95% of circulating tokens were in the hands of market makers, which have much shorter term incentives than team members, venture capitalists and other stakeholders.”<\/span>","<span data-v-f87c67ca=\"\">Critics have focused on the “low float” structure of the token launch, which they worry creates an artificially high price at launch that may later crash when insiders’ tokens — given to&nbsp;team members and investors —&nbsp;unlock.&nbsp;<\/span>","<a href=\"https:\/\/whitepaper.worldcoin.org\/tokenomics\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Worldcoin’s whitepaper<\/span><\/a><span data-v-f87c67ca=\"\"> states that there will be a maximum of 143 million WLD tokens in circulation at launch — out of a total supply of 10 billion. Infrastructure issues throughout the opening week meant that, in fact, considerably less tokens were distributed to begin with. <\/span>The whitepaper states that of the initial 143 million tokens, 43 million went to verified users, while 100 million were lent to five market makers operating outside of the U.S. for a term of three months.","<span data-v-f87c67ca=\"\">Alex Blania, CEO of Worldcoin’s main developer Tools for Humanity, defended the rollout of WLD in an episode of <a href=\"https:\/\/youtu.be\/RrF2LbuSYoA\" data-v-f87c67ca=\"\">The Scoop podcast<\/a>. He said the team expected to take some heat over the low float, but felt it was necessary.<\/span>","<span data-v-f87c67ca=\"\">“Worldcoin is just by design very different because the whole point is that we actually want to get this to billions of people and we are very determined to do that,” Blania said. “And that means that we cannot hand out 10% of the circulating supply. It would be ridiculous. It would be very unfair.”<\/span>","<span data-v-f87c67ca=\"\">Worldcoin did not respond to separate requests for comment on the WLD launch.&nbsp;<\/span>","At launch, Worldcoin’s token WLD rocketed to a fully diluted valuation of $28 billion — though that number has now fallen to $23 billion. The price of WLD <a href=\"https:\/\/www.theblock.co\/post\/241081\/worldcoins-wld-token-surges-88-after-listing-on-multiple-exchanges?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">shot straight to more than $3<\/a> before falling below $2 after a day of trading. It’s now at $2.30, <a href=\"https:\/\/www.coingecko.com\/en\/coins\/worldcoin\" data-v-f87c67ca=\"\">according to CoinGecko<\/a>.&nbsp;","<span data-v-f87c67ca=\"\">Concerns were also raised about the role of market makers — which provide liquidity to facilitate trading in new tokens.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“No view on Worldcoin $WLD the project, but I hate the public token launch,” said Jeff Dorman, CIO of the crypto asset manager Arca, <\/span><a href=\"https:\/\/twitter.com\/jdorman81\/status\/1683522456122974210?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">in a tweet on July 25<\/span><\/a><span data-v-f87c67ca=\"\">. “Once again, market makers, exchanges &amp; VCs should be held accountable for these actions. They are effectively the investment bankers, &amp; should list new tokens at a ‘Fair price’. This is NOT a fair price.” He added that the strategy is “short-sighted and unethical.”&nbsp;<\/span>Ari Paul, CIO and co-founder of crypto investment firm BlockTower Capital, <a href=\"https:\/\/twitter.com\/AriDavidPaul\/status\/1683625896899407875?s=20\" data-v-f87c67ca=\"\">held a similar view<\/a>.&nbsp;","After three months, Worldcoin's market making partners must either repay the WLD loans or purchase the token they were lent at a price set at “$2.00 + ($0.04 * X), with X being equal to (i) the amount of tokens being purchased, divided by (ii) one million,” according to the project's whitepaper.&nbsp;","<span data-v-f87c67ca=\"\">Matt Batsinelas, founder of Glass Markets, told The Block, “Since the market makers received WLD token options with a buyback clause between a $2.48 and $3.12 price, according to on-chain data and the strike price formula at launch, they had an incentive to open with the price of WLD in the money at launch, leading to a high FDV coin.”<\/span>","<span data-v-f87c67ca=\"\">He continued, “Low float high FDV launch creates misalignment between the projects, retail participants and market makers.”<\/span>","<span data-v-f87c67ca=\"\">On The Scoop, Blania said the idea that market makers were incentivized to maintain a certain price for WLD is “just not true” and pointed out that the Worldcoin Foundation has published the contracts it forged with market making partners online.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The thing that the foundation wanted to achieve here is that — essentially short-term liquidity provisioning,” he said. “So you have a spike of interest and you want to make sure that the token price doesn’t spike to $10 or something then it crashes down again, because you have a lot of unhappy people that lost money. Which is something that we’ve seen historically with a lot of projects.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The aim, at launch, was to have market makers “damp” large spikes in interest, Blania added.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Matt Batsinelas","content":"PERSON"},{"type":"CIO","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"July 25","content":"DATE"},{"type":"July 24","content":"DATE"},{"type":"$10","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"Jeff Dorman","content":"PERSON"},{"type":"BlockTower Capital","content":"ORGANIZATION"},{"type":"$2 after","content":"MONEY"},{"type":"Worldcoin","content":"ORGANIZATION"},{"type":"$3","content":"MONEY"},{"type":"Alex Blania","content":"PERSON"},{"type":"Blania","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$23 billion","content":"MONEY"},{"type":"$2.30","content":"MONEY"},{"type":"Sam Altman","content":"PERSON"},{"type":"95%","content":"PERCENT"},{"type":"$2.48","content":"MONEY"},{"type":"$0.04","content":"MONEY"},{"type":"$2.00","content":"MONEY"},{"type":"$3.12","content":"MONEY"},{"type":"Worldcoin Foundation","content":"ORGANIZATION"},{"type":"$WLD","content":"MONEY"},{"type":"$28 billion","content":"MONEY"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"Ari Paul","content":"PERSON"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}