{"summary":"Details from the SEC&#x27;s enforcement complaint against Richard Heart — the man behind Hex, PulseChain, and PulseX.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242288\/rolexes-luxury-cars-and-uniswap-the-secs-case-against-richard-heart","publishDate":"2023-07-31T12:23:01","id":397,"type":null,"title":"Rolexes, luxury cars, and Uniswap: the SEC’s case against Richard Heart","category":["COMPANIES"],"content":["The Securities and Exchange Commission <a href=\"https:\/\/www.theblock.co\/post\/242266\/sec-sues-richard-heart-of-hex-and-pulsechain-for-allegedly-selling-unregistered-securities\" data-v-f87c67ca=\"\">sued<\/a> Richard Scheuler — the operator behind Hex token, PulseChain and PulseX also known as Richard Heart — with raising over $1 billion in unregistered securities offerings since the end of 2019.","“Heart called on investors to buy crypto asset securities in offerings that he failed to register. He then defrauded those investors by spending some of their crypto assets on exorbitant luxury goods,” Eric Werner, director of the SEC's Fort Worth regional office, said in <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2023-143\" data-v-f87c67ca=\"\">a statement<\/a> touting <a href=\"https:\/\/www.sec.gov\/files\/litigation\/complaints\/2023\/comp-pr2023-143.pdf\" data-v-f87c67ca=\"\">the suit<\/a>. “This action seeks to protect the investing public and hold Heart accountable for his actions.”","Here are some additional details from the SEC’s initial enforcement complaint against Heart:","According to regulators, Heart misdirected much of what he raised for Hex and his other projects to his own pockets.","“Although Heart claimed these investments were for the vague purpose of supporting free speech, he did not disclose that he used millions of dollars of PulseChain investor funds to buy luxury goods for himself,” SEC lawyers claimed in Monday’s filing.","Between August 3, 2021 and Sept. 22, 2022 alone, the SEC alleges that Heart used $12.1 million of investor assets to purchase luxury cars and watches.","Heart’s auto purchases included a McLaren and a white Ferarri Roma, while his watch buys included $1.38 million spent on one Rolex, among the four Heart purchased during that time, according to a list included in the SEC’s initial lawsuit.","Heart also allegedly spent $4.28 million of PulseChain investor assets on a black diamond called “The Enigma,” supposedly the largest in the world, according to the SEC. He used a combination of ether and fiat to buy the diamond from Sotheby’s, agency lawyers said.","Luxury items weren’t the only thing Heart used investor assets to buy, the SEC’s civil complaint claimed. Heart sold Hex through a wallet on the Ethereum blockchain, raising more than 2.3 million in ether through over 1.3 million transactions.","But according to the SEC, much of the supposed demand for Hex was artificial, with “94-97% of the ETH deposited” into that wallet “recycled through the so-called crypto asset trading platform.”","The goal was to fake trading volume to create the false impression of demand for Hex, the complaint alleged, while giving Heart and accomplices control of a large number of the tokens.","In a hallmark of unregistered securities offerings, the SEC said that Heart marketed his token as an investment, despite not registering it as one.","The complaint quoted Heart from a Nov. 8, 2019 YouTube livestream saying “if you want to get rich, [Hex is] built for that,” and later claiming that “Hex is designed to surpass ETH,” while stating that Hex’s value organically multiplied by 115 times in 129 days.","Heart also claimed on a Dec. 2019 livestream that Hex “was built to outperform Ethereum and Bitcoin and all other cryptocurrencies” and “[Hex] was built to be the highest appreciating asset that has ever existed in the history of man. That’s the design intention.”","In 2020, Heart hocked a reward program he called \"BigPayDay,\" in which investors would stake Hex tokens for yield, which the SEC argues also created a \"reasonable expectation for profit,\" a hallmark of defining a security in the U.S.","According to the SEC’s filing, the agency chose the U.S. District Court for the Eastern District of New York as its venue because many of the transactions took place on Uniswap, which has developers located in Brooklyn.","“Venue is proper in this District because many of the crypto asset transactions described herein took place on Uniswap, a so-called decentralized crypto asset trading platform whose developers are headquartered in Brooklyn. Heart specifically designed PulseX as a fork of Uniswap,” the SEC’s complaint read. “Additionally, at least one investor of PulseChain and PulseX resides in this District.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sotheby’s","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"$1 billion","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Fort Worth","content":"LOCATION"},{"type":"District","content":"LOCATION"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Dec. 2019","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"$1.38 million","content":"MONEY"},{"type":"millions of dollars","content":"MONEY"},{"type":"Richard Heart","content":"ORGANIZATION"},{"type":"$4.28 million","content":"MONEY"},{"type":"Sept. 22, 2022","content":"DATE"},{"type":"Nov. 8, 2019","content":"DATE"},{"type":"Richard Scheuler","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Eric Werner","content":"PERSON"},{"type":"Heart","content":"ORGANIZATION"},{"type":"97%","content":"PERCENT"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"Ferarri Roma","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"$12.1 million","content":"MONEY"},{"type":"Eastern District of New York","content":"ORGANIZATION"},{"type":"Brooklyn","content":"LOCATION"},{"type":"August 3, 2021","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"McLaren","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["SEC"],"authors":["Colin Wilhelm","The Block"]}