{"summary":"Christie’s Noah Davis chats with host Frank Chaparro about the rise of the NFT art market.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/118967\/christies-nft-business-is-booming-despite-a-market-lull","publishDate":"2021-09-29T12:02:37","id":3973,"type":null,"title":"Christie&#x27;s NFT business is booming despite a market lull","category":["THE BLOCK"],"content":["Episode <strong data-v-f87c67ca=\"\">60<\/strong>&nbsp;of Season 3 of The Scoop was recorded remotely with The Block’s Frank Chaparro and Noah Davis, Associate Vice President &amp; Head of Digital Sales at Christie’s.","<i data-v-f87c67ca=\"\">Listen below, and subscribe to The Scoop on&nbsp;<\/i><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Apple<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Spotify<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5tZWdhcGhvbmUuZm0vdGhlYmxvY2stdGhlc2Nvb3A?sa=X&amp;ved=0CAMQ4aUDahcKEwionbSO9fbxAhUAAAAAHQAAAAAQAg\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Google Podcasts<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Stitcher<\/i><\/a><i data-v-f87c67ca=\"\">&nbsp;or wherever you listen to podcasts. Email feedback and revision requests to <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"a9d9c6cdcac8dadde9ddc1cccbc5c6cac2cadbd0d9ddc687cac6c4\">[email&nbsp;protected]<\/a>.<\/i>","<strong data-v-f87c67ca=\"\">This episode is brought to you by our sponsors <a href=\"http:\/\/Bakkt.com\" data-v-f87c67ca=\"\">Bakkt<\/a>,&nbsp;<a href=\"http:\/\/kraken.com\/scoop\" data-v-f87c67ca=\"\">Kraken<\/a>, and&nbsp;<a href=\"https:\/\/www.exodus.com\/\" data-v-f87c67ca=\"\">Exodus<\/a><\/strong>","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bakkt® unlocks the $1.2+ trillion of digital assets that is currently held in cryptocurrencies, rewards and loyalty points, gaming assets and merchant stored value. We began in 2018 with the vision to bring trust and transparency to digital assets. Through the Bakkt Warehouse and Bakkt Bitcoin Futures and Options contracts, we serve institutional clients in an end-to-end regulated market with true price transparency. For consumers, Bakkt aggregates digital assets to enable instant liquidity and to empower users to trade, transfer and pay however they want. Visit <a href=\"http:\/\/Bakkt.com\" data-v-f87c67ca=\"\">Bakkt.com<\/a> for more information<\/span><\/em>","<strong data-v-f87c67ca=\"\">About Kraken<br data-v-f87c67ca=\"\">\n<\/strong><em data-v-f87c67ca=\"\">Whether you’re an experienced crypto trader or just starting out, Kraken has the tools to help you achieve financial freedom. With 50+ cryptocurrencies to choose from, industry-leading security and a wide variety of features to suit any investing strategy, Kraken puts the power in your hands to buy, sell and trade digital assets. Visit&nbsp;<\/em><a href=\"http:\/\/kraken.com\/scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Kraken.com<\/em><\/a><em data-v-f87c67ca=\"\">&nbsp;to get started today.<\/em>","<strong data-v-f87c67ca=\"\">About Exodus<br data-v-f87c67ca=\"\">\n<\/strong><em data-v-f87c67ca=\"\">Exodus is leading the world out of traditional finance by building beautiful and user-friendly crypto products. Forget having to learn the nuances of different cryptocurrencies. Exodus is designed for everyone and hides the complex details behind a beautiful and intuitive interface.<\/em>","&nbsp;","<span data-v-f87c67ca=\"\">This week, the world's largest auction house cracked $100 million in NFT sales. Christie’s Noah Davis says they’re just getting started.<\/span>","<span data-v-f87c67ca=\"\">On this episode of The Scoop, Davis, an associate vice president and head of digital sales at the auction house, joined Frank Chaparro to discuss Christie’s view of the 2021 rise in NFT sales and how the traditional art market and this brave new one are converging and bolstering adoption of a possible blockchain future.<\/span>","<span data-v-f87c67ca=\"\">“It's incredible that it continues to gather speed and that interest continues to pour in from new corners of the world,” said Davis, a Specialist in post-war and contemporary art. <\/span><span data-v-f87c67ca=\"\">He highlighted a recent uptick in interest in NFT sales with buyers in Asia.<\/span>","\"Like that traditional art market that I talked about they’re starting to line up on the sidelines if not dive in,\" he added.&nbsp;","Still, that is running up against what could be described as a lull in the NFT market. As per data from The Block, weekly NFT transactions have fallen from highs near 2 million to 315,000 last week.&nbsp;","<span data-v-f87c67ca=\"\">Davis even observed an inverse correlation to NFTs and Ethereum’s price movements. “A lot of people will panic, sell their NFT’s when ETH is mooning and then they collect when ETH is kind of in a lull,\" he remarked.<\/span>","<span data-v-f87c67ca=\"\">NFT sales are just the first taste for auction houses like Christie's to possibly one day also move onto the blockchain, which Davis believes could have specific applications for the company. “It would solve for authenticity testing, keeping track of exhibition history, literature references, title disputes, restoration, you name it.” Said Davis, “As far as financials are concerned and deals are concerned, it just is such a better, more democratic way to do business.”<\/span>","<span data-v-f87c67ca=\"\">Christie’s recently announced that on October 1st they will auction off an NFT set of CurioCards that it is putting up in what will be the world’s first major auction with live bids taken in the form of ETH. Christie's has planned more such NFT auctions in the coming months.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2 million","content":"MONEY"},{"type":"Associate Vice President &amp; Head of Digital Sales","content":"ORGANIZATION"},{"type":"Bakkt Warehouse","content":"ORGANIZATION"},{"type":"Christie’s","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"$1.2+ trillion","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Davis","content":"PERSON"},{"type":"The Scoop","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Spotify","content":"LOCATION"},{"type":"Christie","content":"ORGANIZATION"},{"type":"last week","content":"DATE"},{"type":"Apple","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Noah Davis","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}