{"summary":"The New York State Attorney General (NYSAG) is suing Bitfinex, the cryptocurrency exchange, and affiliated firm Tether, the company behind the stablecoin","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/20978\/ny-attorney-general-sues-bitfinex-and-tether","publishDate":"2019-04-25T17:05:45","id":3974,"type":null,"title":"NY Attorney General sues Bitfinex and Tether to unearth &quot;fraud being carried out&quot; by the firms","category":["TETHER"],"content":["The New York State Attorney General (NYSAG) is suing Bitfinex, the cryptocurrency exchange, and affiliated firm Tether, the company behind the stablecoin of the same name.","<a href=\"https:\/\/iapps.courts.state.ny.us\/fbem\/DocumentDisplayServlet?documentId=vIexA1b0spKOnK_PLUS_ZUGTJ3A==&amp;system=prod\" data-v-f87c67ca=\"\">The 23-page document<\/a>, dated April 24, states that the NYAG's office has reason to believe several New York-based traders transact on the firm's platform, despite Bitfinex saying it would no longer cater to clients there in 2018. It said the AG has an investigation underway to expose \"ongoing fraud being carried out by Bitfinex and Tether,\" and has issued a request for any documentation tied to Bitfinex users in the State of New York.","Details from the suit paint a picture of Bitfinex and Tether engaging in \"undisclosed, conflicted transactions to cover Bitfinex's losses by transferring money out of tether reserve funds.\" According to the Attorney General’s office (OAG) at least $700 million was drained from Tether's reserves.","The lawsuit also claims Bitfinex partnered with Panama-based payment processor Crypto Capital to handle customer withdrawals after struggling to find a reputable bank to work with. Despite the significant amount of money at stake, Bitfinex did not sign a contract or formal agreement with Crypto Capital.","According to the lawsuit, Bitfinex also commingled client funds through Crypto Capital, meaning the firm mixed funds held on behalf of clients with its own capital. \"According to documents provided to OAG by Respondents, by 2018, Bitfinex had placed over one billion dollars of co-mingled customer and corporate funds with Crypto Capital,\" the suit notes.","\"As explained to OAG attorneys by Respondents' counsel, Bitfinex and Tether have also used a number of other third party payment processors to handle client withdrawal requests including various companies owned by Bitfinex\/Tether executives, as well as other friends of Bitfinex ... OAG believes that Bitfinex required the service of third party payment processors like Crypto Capital because, at the time, Bitfinex had no reliable bank that could or would work with it.\"","In October 2018, Bitfinex began to struggle with client withdrawal requests. Per the NY State Attorney General, this was due to the loss or theft of ~$851 million in funds by Crypto Capital. To date, Bitfinex has not publicly disclosed the loss of funds","<strong data-v-f87c67ca=\"\">Update:<\/strong> Bitfinex has issued an <a href=\"https:\/\/www.bitfinex.com\/posts\/356\" data-v-f87c67ca=\"\">official response,<\/a> saying the \"court filings were written in bad faith and are riddled with false assertions.\" They further deny the loss of $850 million from Crypto Capital and instead claim the funds have been \"seized and safeguarded.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"AG","content":"ORGANIZATION"},{"type":"NYAG","content":"ORGANIZATION"},{"type":"Bitfinex","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"October 2018","content":"DATE"},{"type":"April 24","content":"DATE"},{"type":"Crypto Capital","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Bitfinex","content":"ORGANIZATION"},{"type":"$851 million","content":"MONEY"},{"type":"NY State Attorney General","content":"ORGANIZATION"},{"type":"Panama","content":"LOCATION"},{"type":"one billion dollars","content":"MONEY"},{"type":"State of New York","content":"LOCATION"},{"type":"Bitfinex\/Tether","content":"ORGANIZATION"},{"type":"New York State","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"$850 million","content":"MONEY"},{"type":"$700 million","content":"MONEY"},{"type":"OAG","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}