{"summary":"The BIS warned in a Tuesday report that crypto market vulnerabilities could pose broader financial stability risks.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246734\/bis-warns-emerging-economies-of-financial-stability-risk-from-crypto","publishDate":"2023-08-22T12:31:01","id":3976,"type":null,"title":"BIS warns emerging economies of financial stability risk from crypto","category":["POLICY"],"content":["The Bank of International Settlements warned in a Tuesday <a href=\"https:\/\/www.bis.org\/publ\/bppdf\/bispap138.pdf\" data-v-f87c67ca=\"\">report<\/a> that crypto market vulnerabilities could pose financial stability risks in emerging economies.","\"There are serious concerns about the ability of emerging market economies to monitor cryptoasset markets and to assess the financial stability risks from cryptoassets,\" the report said.","The report touched on liquidity, credit, operational, bank disintermediation and capital flow risks.","\"One way in which price volatility propagates into market risk is through direct holdings of cryptoassets by institutions or households. As the price of the cryptoasset fluctuates, holders risk incurring losses,\" the report added.","Risk vectors could emerge through specific regulatory conditions within emerging economies, the document added.","The BIS encouraged local regulators to consider selective bans, containment and regulation of specific <a href=\"https:\/\/www.theblock.co\/post\/246580\/crypto-funds-outflows-market-crash-bitcoin-etf\" data-v-f87c67ca=\"\">crypto-assets<\/a>. It advised the establishment of clear regulatory mandates that differentiate between \"activity-based and entity-based regulation.\"","The report said many emerging market participants see cryptoassets as \"a safe haven against volatile domestic currencies,\" a dynamic developing in <a href=\"https:\/\/www.theblock.co\/post\/228294\/argentina-inflation-crypto\" data-v-f87c67ca=\"\">Argentina<\/a>, where on August 13 bitcoin-friendly presidential candidate Javier Milei won a presidential primary vote.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Argentina","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Javier Milei","content":"PERSON"},{"type":"August 13","content":"DATE"},{"type":"BIS","content":"ORGANIZATION"},{"type":"Bank of International Settlements","content":"ORGANIZATION"}],"hashtag":[],"authors":["Brian McGleenon","The Block"]}