{"summary":"As of July 27, Optimism logged 944,000 daily transactions. This surpasses its competitor, Arbitrum, which registered 660,000 transactions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241893\/optimism-arbitrum-transactions-worldcoin","publishDate":"2023-07-28T08:10:50","id":3979,"type":null,"title":"Optimism flips Arbitrum in daily transactions following Worldcoin launch","category":["LAYER 2S AND SCALING"],"content":["In the domain of Ethereum’s Layer 2 scaling solutions, recent figures signal a significant shift.","As of July 27, Optimism — a Layer 2 network emphasizing scaling applications using Optimistic Rollups —&nbsp;<a href=\"https:\/\/optimistic.etherscan.io\/chart\/tx\" data-v-f87c67ca=\"\">logged<\/a> 944,000 daily transactions. This surpasses its competitor, Arbitrum, which <a href=\"https:\/\/arbiscan.io\/chart\/tx\" data-v-f87c67ca=\"\">registered<\/a> 660,000 transactions, as per data from Blockscan. Notably, this is the first instance since January 2023 where Optimism has taken the lead in daily transaction volume.","This shift, deviating from a six-month trend, is attributed mainly to the introduction of Worldcoin on the Optimism network. Worldcoin — a crypto identity project linked to Sam Altman, co-founder of ChatGPT creator OpenAI — was recently launched on Optimism, fueling the network’s activity.","From the onset of June 2023, when the Worldcoin team <a href=\"https:\/\/twitter.com\/wilburforce_\/status\/1673711984485777408\" data-v-f87c67ca=\"\">began<\/a> deploying user accounts on Optimism, the network has witnessed a remarkable boost in activity. The daily transaction tally has <a href=\"https:\/\/optimistic.etherscan.io\/chart\/tx\" data-v-f87c67ca=\"\">risen<\/a> by 240%, escalating from just below 277,000 to 944,000 transactions since June 1. Conversely, Arbitrum’s daily transaction count has seen a marginal dip, <a href=\"https:\/\/arbiscan.io\/chart\/tx\" data-v-f87c67ca=\"\">declining<\/a> from 745,000 transactions to 660,000 during the same period.","Dune Analytics <a href=\"https:\/\/dune.com\/worldcoin\/worldcoin\" data-v-f87c67ca=\"\">data<\/a> highlights Optimism’s growing traction, particularly the evident interest in Worldcoin on the network. The count of Worldcoin wallets on the Optimism chain, indicative of engagement with the protocol, is nearing the 1 million mark, currently at 961,000. It’s important to note that this number excludes pre-release wallets that users have yet to migrate to the Optimism chain.","Nevertheless, Arbitrum still has the lead in other metrics. The total value locked on Arbitrum remains the highest among all Layer 2 solutions, standing at <a href=\"https:\/\/defillama.com\/chain\/Arbitrum\" data-v-f87c67ca=\"\">$2.1 billion<\/a>, followed by Optimism with <a href=\"https:\/\/defillama.com\/chain\/Optimism\" data-v-f87c67ca=\"\">$917 million<\/a>, according to DeFiLlama. Furthermore, Arbitrum leads daily active users, with 123,000 compared to Optimism’s 89,000, further on-chain <a href=\"https:\/\/dune.com\/evulutionary\/arbitrum-vs-optimism\" data-v-f87c67ca=\"\">data<\/a> shows.","Optimism and Arbitrum are the top two Layer 2 solutions by adoption. Utilizing Optimistic rollup technologies, they afford users the ability to process transactions off the main Ethereum blockchain, presenting a more cost-effective method than mainnet transaction processing.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/optimistic-rollups\/transaction-count-daily-7dma\/embed\" title=\"Transaction Count on Optimistic Rollups (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 1","content":"DATE"},{"type":"$917 million","content":"MONEY"},{"type":"DeFiLlama","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January 2023","content":"DATE"},{"type":"Sam Altman","content":"PERSON"},{"type":"Worldcoin","content":"LOCATION"},{"type":"Arbitrum","content":"LOCATION"},{"type":"240%","content":"PERCENT"},{"type":"July 27","content":"DATE"},{"type":"Arbitrum","content":"PERSON"},{"type":"$2.1 billion","content":"MONEY"},{"type":"June 2023","content":"DATE"}],"hashtag":["ARBITRUM","OPTIMISM"],"authors":["Vishal Chawla","The Block"]}