{"summary":"Michael Mosier has worked in numerous government positions combating financial malfeasance, but as Chainalysis’ newly minted Chief Technical Counsel, the","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/29176\/chainalysis-brings-in-former-leader-at-fincen-to-balance-compliance-with-innovation","publishDate":"2019-06-26T18:29:16","id":3983,"type":null,"title":"Chainalysis brings in former leader at FinCEN to balance compliance with innovation","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">Michael Mosier has worked in numerous government positions combating financial malfeasance, but as Chainalysis’ newly minted Chief Technical Counsel, the company announced today, he’ll be helping the blockchain investigations firm navigate the ever-changing regulatory minefield.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">His primary concern in the wake of recently released Financial Action Task Force (FATF) guidance, which includes the much-debated travel rule, is ensuring solutions don’t come at the price of innovation.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We need to have solutions that have a technical aspect that are going to maintain the positive advances of cryptocurrency, like the censorship resistance and financial inclusion,” said Mosier.<\/span>","<span data-v-f87c67ca=\"\">Mosier worked with U.S. Government regulatory bodies like the Department of Justice and the Financial Crimes Enforcement Network (FinCEN), as well as the Office of Foreign Assets Control (OFAC) and the National Security Council before heading to Chainalysis. Within the government, he said Chainalysis is seen as a body working to map out risks and take in blockchain data while maintaining privacy.<\/span>","<span data-v-f87c67ca=\"\">But FATF’s inclusion of the travel rule poses some problems to maintaining that privacy, since it requires exchanges to collect and share customer information during transactions. While cryptocurrency is by design faster and more private than traditional banking, Mosier said maintaining these advantages while sharing the required information is not as simple as sending a separate message.<\/span>","<span data-v-f87c67ca=\"\">While it will be challenging, according to Mosier, the present difficulties are similar to what traditional banks experienced when FinCEN issued its travel rule in the 1990s, forcing banks to share such information. It took time for all to get on board and implement a technologically feasible solution.<\/span>","<span data-v-f87c67ca=\"\">“I think this is going to take time as well because the point is that this isn't the traditional banking sector and we can't just go back to that,” he said. “We want to maintain these advances.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Banks solved this problem with the Society for Worldwide Interbank Financial Telecommunications (SWIFT) system, which allows banks to securely transmit transaction information. However, Mosier said this likely won’t be the answer for crypto.<\/span>","<span data-v-f87c67ca=\"\">“That may not be technically feasible or it might be in a way that we lose a lot of the advances of cryptocurrencies,” he said.<\/span>","<span data-v-f87c67ca=\"\">Exchanges are tinkering with solutions of how to collect and share that information securely, and Mosier said he’s in discussions daily with customers and other industry leaders on how to implement a solution and what it might look like, but an effective, low cost, quickly implementable solution will take a lot of brainstorming.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Indeed, while the answer needs to not only be secure and technologically feasible without compromising crypto’s virtues, it also needs to come fast. While there is a grace period for players to comply, countries will soon have to begin holding their virtual asset providers (VASPs) compliant to FATF regulations.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I think this is something that the industry as a whole, as including Chainalysis, is coming together quickly on,” said Mosier. “So I'm hoping that by sort of crowdsourcing the thinking on this, that it'll be as quick as possible.”<\/span>","<span data-v-f87c67ca=\"\">One place this information will be crowdsourced is at the V20 Summit in Osaka, Japan, in the shadow of the G20. Exchange leaders are slated to discuss the possibility of an overarching solution. However, Chainalysis won’t be in attendance. The company said it was already in talks about a technical solution with the majority of those attending.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Office of Foreign Assets Control (OFAC","content":"ORGANIZATION"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"Mosier","content":"PERSON"},{"type":"G20","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"FinCEN","content":"ORGANIZATION"},{"type":"FATF","content":"ORGANIZATION"},{"type":"1990s","content":"DATE"},{"type":"Society for Worldwide Interbank Financial Telecommunications","content":"ORGANIZATION"},{"type":"Japan","content":"LOCATION"},{"type":"Chainalysis","content":"PERSON"},{"type":"Michael Mosier","content":"PERSON"},{"type":"Osaka","content":"LOCATION"},{"type":"Financial Crimes Enforcement Network (FinCEN","content":"ORGANIZATION"},{"type":"National Security Council","content":"ORGANIZATION"},{"type":"U.S. Government","content":"ORGANIZATION"},{"type":"Financial Action Task Force (FATF","content":"ORGANIZATION"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}