{"summary":"An SEC official said two of the proposals wouldn&#x27;t necessarily be a carve-in or carve-out of crypto. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/219930\/sec-to-vote-on-cybersecurity-consumer-privacy-rule-proposals","publishDate":"2023-03-15T10:00:38","id":3984,"type":null,"title":"SEC advances new cybersecurity, consumer privacy rule proposals","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Securities and Exchange Commission advanced new rule proposals and changes to bolster requirements for cybersecurity, privacy and tech infrastructure that officials said could encompass cryptocurrencies.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span><\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The five-member commission met on Wednesday morning on issues relating to cybersecurity, the privacy of consumer financial information and technology infrastructure, such as cloud services. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">If the rules go forward without significant changes from adoption, they would require brokers-dealers, investment companies, registered investment advisers and transfer agents to tell people when they have been affected by data breaches. A current rule requires “covered firms” to let customers know about how they use their financial information, but there is no requirement now to let them know about breaches, SEC Chair Gary Gensler said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“Critically, firms would need to help customers understand how to protect themselves from harm that might result from the breach,” Gensler said. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC also will vote on whether to propose a new rule requiring broker-dealers, clearinghouses and other entities to have written policies to address their cybersecurity risks. It would require market entities, excluding smaller broker-dealers to disclose to the public a description summarizing cybersecurity risks that could “materially affect the entity” and also “significant cybersecurity incidents in the current or previous calendar year,” Gensler said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“I believe such disclosure would help investors make informed decisions when deciding to which firms they might entrust their finances, data, and personal information,” Gensler said. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Market entities and capital markets rely on “complex and ever-evolving information systems,” Gensler said, adding that they are systems owned or used by the entity.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Those two proposals don't include a special carve-in or carve-out for crypto, according to an SEC official. To the extent that information systems interact with crypto, that would be covered by the cybersecurity changes, the official said. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The last proposal would broaden Reg SCI to include the largest broker dealers, swap data repositories and certain exempt clearinghouses while bulking up policies.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Regulation SCI was adopted in 2014 to strengthen the tech infrastructure of U.S. securities markets.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span><\/span><span class=\"s1\" data-v-f87c67ca=\"\">The rule currently applies to national securities exchanges, among others. <\/span><span class=\"s1\" data-v-f87c67ca=\"\">An SEC official said if a national securities exchange is trading crypto securities, then the rule would apply. &nbsp;<\/span>","<em data-v-f87c67ca=\"\">UPDATE: With information on the vote.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"morning","content":"TIME"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}