{"summary":"Crypto exchange Binance.US has hired Lesley O&#x27;Neill, formerly of Prove Identity, as its new chief compliance officer.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/270388\/binance-us-new-chief-compliance-officer-lesley-oneill","publishDate":"2024-01-04T10:00:04","id":3987,"type":null,"title":"Crypto exchange Binance.US hires new chief compliance officer","category":["COMPANIES"],"content":["Binance.US, the American arm of the world's largest cryptocurrency exchange by trading volume, has named a new chief compliance officer.","Binance.US said it hired Lesley O'Neill, who most recently served as chief compliance officer at Prove Identity, a digital identity verification platform that serves banks, financial services companies, and e-commerce merchants, among others.","In her role at Binance.US, O'Neill will lead the company's compliance efforts, including its know your customer, anti-money laundering and sanctions programs, Binance.US said.","O'Neill joined Binance.US this week and replaced Binance.US's previous compliance chief, Tammy Weinrib, a company spokesperson told The Block. Weinrib left Binance.US in November, according to her LinkedIn <a href=\"https:\/\/www.linkedin.com\/in\/tammyweinrib\/\" data-v-f87c67ca=\"\">profile<\/a>. In that month, Binance and its founder Changpeng \"CZ\" Zhao <a href=\"https:\/\/www.theblock.co\/post\/264272\/how-czs-exit-and-binances-4-billion-fine-could-shape-the-future-of-crypto\" data-v-f87c67ca=\"\">pleaded guilty<\/a> to anti-money laundering and sanctions violations and agreed to pay $4.3 billion and $50 million in fines, respectively. While Binance.US was not part of Binance's settlement, it faces an <a href=\"https:\/\/www.theblock.co\/post\/235310\/binance-uss-market-share-nosedives-after-sec-lawsuit\" data-v-f87c67ca=\"\">enforcement action<\/a> by the Securities and Exchange Commission for allegedly offering unregistered securities to U.S. investors. The case, involving Binance and Zhao, is ongoing. Additionally, the SEC is <a href=\"https:\/\/www.wsj.com\/livecoverage\/stock-market-today-dow-jones-11-27-2023\/card\/sec-keeps-pressing-for-evidence-of-potential-fraud-at-binance-us-FteJJJqSg6PWXrwquJul\" data-v-f87c67ca=\"\">reportedly<\/a> still also investigating whether Binance and Zhao may have a backdoor to control assets stored on Binance.US.","O'Neill brings to her new role more than 15 years of experience related to regulatory and privacy compliance, information security, and identity verification and authentication to Binance.US., the company said. Before Prove, O'Neill worked at Ernst &amp; Young, Milbank and Bloomberg.","O'Neill's experience \"partnering with crypto companies to enhance their AML and KYC processes at Prove, as well as her work in traditional financial services at Ernst &amp; Young, will be exceptionally valuable as we continue to uphold the highest standards of compliance, safety, and security on our platform,\" Norman Reed, Binance.US's interim CEO said in a statement.","In November, Binance.US also lost its chief risk officer, Sidney Majalya, according to his LinkedIn <a href=\"https:\/\/www.linkedin.com\/in\/sidney-majalya-0593ba30\/\" data-v-f87c67ca=\"\">profile<\/a>. Whether the company is actively seeking a replacement for this role remains unclear. When asked about various questions concerning Binance.US's leadership and general teams, the spokesperson for Binance.US declined to provide comments.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sidney Majalya","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Norman Reed","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Ernst &amp; Young","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"O'Neill","content":"PERSON"},{"type":"Prove Identity","content":"ORGANIZATION"},{"type":"Weinrib","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Tammy Weinrib","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"KYC","content":"ORGANIZATION"},{"type":"Lesley O'Neill","content":"PERSON"},{"type":"$4.3 billion","content":"MONEY"},{"type":"Milbank","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":["BINANCE","HIRING"],"authors":["Yogita Khatri","The Block"]}