{"summary":"Stephen Goldfeder said miscommunication regarding an Arbitrum proposal earlier this month was a mistake and unfortunate.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228717\/arbitrum-goldfeder-vote-aftermath-comments","publishDate":"2023-04-27T19:21:23","id":3988,"type":null,"title":"Arbitrum co-founder says DAO vote communication was &#x27;unfortunate&#x27;","category":["COMPANIES"],"content":["Arbitrum Co-Founder and Offchain Labs CEO Stephen Goldfeder said that communication in the lead up to a <a href=\"https:\/\/www.theblock.co\/post\/226561\/arbitrum-proposal-return-funds-failed\" data-v-f87c67ca=\"\">failed proposal<\/a> earlier this month that aimed to return 700 million ARB governance tokens had been less than ideal.","\"There was an unfortunate miscommunication, and it was definitely a mistake,\" he said at CoinDesk's <a href=\"https:\/\/consensus.coindesk.com\/agenda\/event\/-the-drop-heard-round-the-world-277\" data-v-f87c67ca=\"\">Consensus conference<\/a> on Thursday. \"If you're looking back in hindsight, it's obvious, but it wasn't obvious at the time.\"","The Ethereum Layer 2 scaling project was <a href=\"https:\/\/www.theblock.co\/post\/224459\/arbitrum-proposal-backlash-response\" data-v-f87c67ca=\"\">forced to backtrack<\/a> on a proposal in early April after token holders who control the protocol's decentralized autonomous organization staged a revolt by voting to stop the planned transfer of ARB tokens worth about $1 billion meant to capitalize the Arbitrum Foundation. The move <a href=\"https:\/\/www.theblock.co\/post\/224829\/arbitrum-backtrack-dao-governance\" data-v-f87c67ca=\"\">raised questions about the nature of DAOs<\/a>, and whether or not they could every truly be decentralized.","Arbitrum developers initially called it \"ratification\" instead of what many thought should have been a more of a consultation. Goldfeder said the information hadn't been clear.","\"The DAO is the most decentralized DAO that exists,\" Goldfeder said. \"I, as a community member, actually think that the place where this ended is even better, and and the community seems happy ... the community ended up in an even stronger place from that incident.\"","Goldfeder said that it was harder to build a community than technology.&nbsp;","\"We know how to build technology,\" he said. \"But then there's the question of building the community and people that actually care about it...there's a massive community with many different interests and companies and protocols and projects that care deeply about this. And that's critical, because all technology can be there, but if there's no one that actually wants to partake and offer their opinion and vote and argue and debate. That's bad. We want all this discussion, and I'm glad that it's there.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Stephen Goldfeder","content":"PERSON"},{"type":"Arbitrum Foundation","content":"ORGANIZATION"},{"type":"Goldfeder","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"CoinDesk's <a href=\"https:\/\/consensus.coindesk.com\/agenda\/event\/-the-drop-heard-round-the-world-277\" data-v-f87c67ca=\"\">Consensus","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"hindsight","content":"LOCATION"},{"type":"Offchain Labs","content":"ORGANIZATION"}],"hashtag":["DAOS"],"authors":["Nathan Crooks","The Block"]}