{"summary":"Aside from price action, it&#x27;s increasingly clear that the crypto market has indeed made a comeback. Watch this space. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267292\/cryptos-secretive-corner-is-heating-up","publishDate":"2023-12-13T16:07:24","id":3992,"type":null,"title":"Crypto&#x27;s secretive corner is heating up","category":["COMPANIES"],"content":["Aside from price action, it's increasingly clear that the crypto market has indeed made a comeback.&nbsp;","The seven-day moving average for spot exchange volumes is nearing $40 billion for the first time since March. Additionally, on-chain data indicates a rebound, with the seven-day moving average for transactions on the Ethereum network reaching its peak for the year, currently at 1.14 million. In the realm of futures trading, CME's bitcoin futures market experienced its highest monthly volumes just last month.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/total-exchange-volume-daily\/embed\" title=\"Daily Exchange Volume (7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Still, there's a segment within the crypto market that remains more opaque due to limited data availability: off-exchange trading among major market-making entities and over-the-counter trading firms. These firms, encompassing crypto-native firms such as GSR and Wintermute, as well as traditional finance firms like Jump Trading, purportedly reduced their involvement in crypto amidst a wider liquidity shortage. Following FTX's collapse, market participants expressed concerns about the apparent Alameda liquidity gap, creating markets where maneuvering in and out of positions in specific coins became more challenging.","Keyrock, a company within the token market-making realm, stands out as an entity experiencing increased activity. While not as prominently recognized as competitors such as Wintermute and GRS, Keyrock has maintained a presence in the crypto sphere across multiple cycles. Kevin de Patoul, its co-founder who initiated the firm in 2017, conveyed in a recent interview with The Block that the company has unsurprisingly observed heightened activity in recent months.","\"We have been increasing our volume and are more or less looking to triple our revenue this year, with a further acceleration over the last seven months,\" he said.","\"Even after 7 years in crypto the market has managed to catch me by surprise,\" he said.&nbsp;","The firm has hired more than 100 people in the last 12 months.&nbsp;","Elsewhere, rivals appear to be keen to expand. GSR, for instance, has an open job ad for a US OTC Sales role, which would be responsible for growing out its \"US OTC derivatives business\" and \"seek out new opportunities, in parallel to further developing existing client relationships that will ultimately drive activity and trade volume to the OTC desk.\"","Keyrock also sees derivatives as an opportunity, with de Patoul noting that \"options are going to be a very exciting front.\"","Wintermute also has a job ad hunting for a new sales trader to \"play a crucial role in executing trades, managing client portfolios and contributing to the growth of our OTC Options business.\"","Watch this space.&nbsp;","<strong data-v-03de5780=\"\" data-v-f87c67ca=\"\"><em data-v-03de5780=\"\" data-v-f87c67ca=\"\">This first appeared in Frank Chaparro's biweekly The Scoop Newsletter.&nbsp;<a href=\"https:\/\/www.theblock.co\/newsletters\/\" target=\"_blank\" rel=\"noopener\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">Sign up<\/a> now.<\/em><\/strong>","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">Disclaimer: Evgeny Gaevoy, the founder and CEO of Wintermute, previously sat on The Block's board of directors from April 2023 to early November 2023 and remains a minority shareholder.<\/i>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Wintermute","content":"LOCATION"},{"type":"last 12 months","content":"DATE"},{"type":"GRS","content":"ORGANIZATION"},{"type":"April 2023","content":"DATE"},{"type":"1.14 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"GSR","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Kevin de Patoul","content":"PERSON"},{"type":"US OTC","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Evgeny Gaevoy","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Keyrock","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"CME","content":"ORGANIZATION"},{"type":"Frank Chaparro","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}