{"summary":"The messaging app is soon to launch a username auction platform on The Open Network (TON) blockchain, the company said in an official channel on Thursday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/178877\/telegram-to-auction-off-usernames-via-blockchain-based-platform","publishDate":"2022-10-21T06:31:28","id":3996,"type":null,"title":"Telegram to auction off usernames via blockchain-based platform","category":["NFTS"],"content":["Would you pay for a username on social media? Telegram is hoping yes.","The messaging app is soon to launch a username auction platform on The Open Network (TON) blockchain, the company said in an <a href=\"https:\/\/t.me\/s\/username\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">official channel<\/a> on Thursday.","Telegram founder Pavel Durov <a href=\"https:\/\/www.theblock.co\/post\/164883\/telegram-founder-floats-new-auction-marketplace\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">revealed<\/a> the project in August, citing inspiration from the success of a recent TON auction for their wallet usernames. Some, including “casino.ton,” sold for over $200,000.","“If TON has been able to achieve these results, imagine how successful Telegram with its 700 million users could be if we put reserved @ usernames, group and channel links for auction,” he said.","But Durov isn’t stopping there. “Other elements of the Telegram ecosystem, including channels, stickers or emoji, could later also become part of this marketplace,” he added.","Paying for usernames isn't new. Over half a million people have paid for usernames on Ethereum through the Ethereum Name Service (ENS), according to <a href=\"https:\/\/nonfungible.com\/market-tracker\/ethereumnameservice\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Non Fungible's<\/a> market tracker.","It's not just a web3 phenomenon either. It's becoming harder and harder to get the desired username on platforms like Twitter and Instagram and some people are going to great lengths to obtain them. Tips and tricks online suggest everything from asking the platforms to reassign unused usernames to elaborate copyright schemes.","Others goes even further. Some services will even obtain social media names through hacking the original owner.","Telegram began exploring blockchain solutions and working on the then-named Telegram Open Network in 2018. Later that year, it raised $1.7 billion in a private sale of TON tokens.","In October 2019 the U.S. Securities and Exchange Commission accused it of conducting an unregistered securities offering and sued Telegram. In 2020, under pressure from regulators, Telegram abandoned the project.","Open source developers continued to work on the project. In 2022, it rebranded as The Open Network with a live, fully operational mainnet.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Durov","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"October 2019","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"Ethereum Name Service","content":"ORGANIZATION"},{"type":"Telegram Open Network","content":"ORGANIZATION"},{"type":"$200,000","content":"MONEY"},{"type":"Pavel Durov","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"$1.7 billion","content":"MONEY"},{"type":"August","content":"DATE"}],"hashtag":["SOCIAL MEDIA"],"authors":["Callan Quinn","The Block"]}