{"summary":"Bitcoin remained above $29,000 despite the U.S. Federal Reserve&#x27;s recent rate hike, stimulated by better-than-expected inflation data.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241684\/bitcoin-stimulated-fed-inflation-data","publishDate":"2023-07-27T07:10:01","id":3998,"type":null,"title":"Bitcoin &#x27;stimulated&#x27; by the Fed&#x27;s cooler-than-expected inflation data","category":["MACRO"],"content":["Bitcoin remained above $29,000 despite the U.S. Federal Reserve's recent rate hike — stimulated by better-than-expected inflation data — an analyst claimed.","The world's largest cryptocurrency by market capitalization rose 1.0% to $29,503 at 6:45 a.m. ET. The digital asset has stayed within a narrow range between around $29,000 and $31,500 for over a month.&nbsp;","Post the Federal Open Market Committee's&nbsp;<a href=\"https:\/\/www.federalreserve.gov\/newsevents\/pressreleases\/monetary20230726a.htm\" data-v-f87c67ca=\"\">announcement<\/a>, Bitcoin and major altcoins traded flat. The decision to raise rates to between 5.25% and 5.50% resulted in a subdued crypto market performance. The total cryptocurrency market cap stands at $1.24 trillion — up by 1.6% in the last 24 hours — according to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/bitcoin\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">CoinGecko<\/a>.","Fed officials announced inflation data is below expectations after June’s yearly CPI declined to 3%.","Chief economist at BTCM Youwei Yang said this makes a September interest rate hike much less probable and that overall rate hikes may become less aggressive. \"However, the Fed is cautious enough and still kept the door open for some possible additional interest rate hikes, aiming to maintain the current high rate for a longer period, stating that future decisions will highly depend on economic data,\" he told The Block","Yang sees the inflation reading as encouraging in the short term and \"already stimulating emerging assets, including crypto.\"","However, he argued the impact of Fed rate decisions on the crypto market has decayed incrementally. \"The market is now looking for new exciting or worrying indicators to move, and I suspect earnings, regulations, or banking credit liquidity might be the next movers,\" he added.","Fed Chair Jerome Powell said at&nbsp;<a href=\"https:\/\/www.federalreserve.gov\/newsevents.htm\" data-v-f87c67ca=\"\">a press conference<\/a> following the FOMC meeting that further rate hikes could come in September if warranted. \"I would also say it's possible that we would choose to hold steady at that meeting. We're going to be making careful assessments, as I said, meeting by meeting,” he said.","Co-founder of Sei Labs Jeff Feng said risk-on assets like cryptocurrencies could face increased volatility after more monetary tightening measures from the U.S. Central Bank. \"Despite the market having largely priced in these interest hikes, this does not negate the possibility of further turbulence,\" he told The Block.","Feng said the fundamental drivers of cryptocurrency demand remain in place, \"decentralization, transparency, and the potential for risk-adjusted growth,\" adding that the market should brace itself for increased short-term volatility — but the long-term outlook for the cryptocurrency market continues to be strong.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jeff Feng","content":"PERSON"},{"type":"3%","content":"PERCENT"},{"type":"Fed","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"5.50%","content":"PERCENT"},{"type":"Federal Open Market Committee","content":"ORGANIZATION"},{"type":"1.6%","content":"PERCENT"},{"type":"U.S. Central Bank","content":"ORGANIZATION"},{"type":"$1.24 trillion","content":"MONEY"},{"type":"6:45 a.m. ET","content":"TIME"},{"type":"1.0%","content":"PERCENT"},{"type":"5.25%","content":"PERCENT"},{"type":"Jerome Powell","content":"PERSON"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"$29,503","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"September","content":"DATE"},{"type":"BTCM Youwei Yang","content":"ORGANIZATION"},{"type":"FOMC","content":"ORGANIZATION"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"$29,000","content":"MONEY"},{"type":"$31,500","content":"MONEY"}],"hashtag":["CRYPTO"],"authors":["Brian McGleenon","The Block"]}