{"summary":"The rising gold price implies a bitcoin price of $45,000, according to JPMorgan strategists led by Nikolaos Panigirtzoglou.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232334\/bitcoin-price-45k-jpmorgan-gold","publishDate":"2023-05-26T08:52:49","id":3999,"type":null,"title":"Bitcoin price could reach $45,000 due to rising gold price, says JPMorgan","category":["COMPANIES"],"content":["The current gold price of nearly $2,000 per ounce would imply a bitcoin price of $45,000, according to JPMorgan analysts, as the two assets tend to move in tandem and are seen as alternatives by investors.","\"With the gold price rising above $2,000, the value of gold held for investment purposes outside central banks is currently valued at around [$3 trillion]. In turn, this implies a $45,000 price for bitcoin under the assumption that bitcoin equalizes gold in private investors' portfolios in risk capital or [volume]-adjusted terms,\" JPMorgan strategists led by Nikolaos Panigirtzoglou wrote in a note on Wednesday.","JPMorgan considers the $45,000 bitcoin price as an upper limit, indicating limited potential for the asset beyond the increase driven by the doubling of mining or production costs. The upcoming Bitcoin halving in April or May 2024 would mechanically double Bitcoin's production cost to around $40,000, according to JPMorgan. \"This is because bitcoin's production cost has historically acted as an effective lower bound,\" JPMorgan strategists said. \"Indeed, the previous halving events of 2016 and 2020 were accompanied by a bullish trajectory for bitcoin prices that had accelerated post the halving event.\"","<a href=\"https:\/\/www.theblock.co\/post\/61762\/the-bitcoin-halving-what-it-is-and-why-it-matters\" data-v-f87c67ca=\"\">The Bitcoin halving<\/a> is an event that occurs approximately every four years, reducing the reward for mining new Bitcoin blocks by half, effectively decreasing the rate at which new bitcoins are created, in order to control inflation and maintain the scarcity of bitcoin over time. The upcoming Bitcoin halving will see the block reward halve from 6.25 bitcoin to 3.125 bitcoin.","JPMorgan assumes a 25% return on bitcoin over the next 12 months, as this timeframe captures the halving event expected in 2024.","Ether (ETH) may continue to face some selling pressure in the near term beyond the Shanghai upgrade till mid-year or so, according to <a href=\"https:\/\/www.theblock.co\/post\/225701\/jpmorgan-fidelity-ethereum-eth-shapella-upgrade\" data-v-f87c67ca=\"\">JPMorgan<\/a>. \"We thus expect Ethereum to somewhat underperform bitcoin over the near term,\" the bank said.","Overall, JPMorgan retains its cautious stance on digital assets as headwinds from the U.S. regulatory crackdown, disruptions to crypto banking networks and the ongoing repercussions from the FTX exchange collapse are likely to limit any potential gains.","Bitcoin is currently trading at around $26,500 and ether at about $1,800, <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\" data-v-f87c67ca=\"\">according to The Block's Data Dashboard<\/a>.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/btc-price\/embed\" title=\"BTC Price\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe><iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/eth-price\/embed\" title=\"ETH Price\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2016","content":"DATE"},{"type":"$1,800","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"May 2024","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$26,500","content":"MONEY"},{"type":"Nikolaos Panigirtzoglou","content":"ORGANIZATION"},{"type":"$45,000","content":"MONEY"},{"type":"$3 trillion","content":"MONEY"},{"type":"25%","content":"PERCENT"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"$2,000","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"April","content":"DATE"},{"type":"$40,000","content":"MONEY"},{"type":"Shanghai","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["BITCOIN","ETHEREUM","TRADFI BANKS"],"authors":["Yogita Khatri","The Block"]}