{"summary":"While Bitcoin&#x27;s network difficulty and hash rate increased, so has Bitcoin miner revenue — though profitability remains below all-time highs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225359\/bitcoin-difficulty-hashrate-miner-revenue","publishDate":"2023-04-07T03:33:50","id":4002,"type":null,"title":"Bitcoin difficulty and hash rate hit new all-time highs","category":["INFRASTRUCTURE"],"content":["Bitcoin's mining difficulty — how hard and time-consuming it is to find a suitable hash for each block on the blockchain — <a href=\"https:\/\/btc.com\/stats\/diff\" data-v-f87c67ca=\"\">increased<\/a> by 2.23% at block height 784,224 yesterday.","The mining difficulty changes roughly every two weeks as the network automatically adjusts to changes in its hash rate. The difficulty changes to ensure that the network keeps processing blocks roughly every 10 minutes, rather than slowing down or increasing over time.","The increase in Bitcoin mining difficulty is the fourth in a row. March 23 saw a more-substantial increase of 7.56%, while the prior two increases went up by 1.16% and 9.95%. This shows that the network has been reacting to gradual increases in hash rate.","The latest block difficulty adjustment pushes the difficulty metric to 47.89 trillion — another record high. As a result, it's harder than ever to mine a Bitcoin block.","The next difficulty adjustment will likely occur in 13 days.","The average hash rate — or computation power — of the entire Bitcoin network is also at a record high of 342.16 EH\/s, while average block times — how long it takes miners to verify transactions and produce a block in the blockchain — remain under ten minutes.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoins-hash-rate-daily\/embed\" title=\"Bitcoin's Hash Rate (EH\/s, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","According to The Block's Data Dashboard, Bitcoin's daily real-time hash rate — divided by mining pool — is dominated by Foundry USA and Antpool, with Binance Pool coming in third.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoins-daily-real-time-hashrate-by-pool\/embed\" title=\"Bitcoin's Daily Real-time Hashrate by Pool\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","While Bitcoin's network difficulty and hash rate increased — making the network more expensive to mine — so has miner revenue.","Miners are rewarded in the blockchain's native currency, bitcoins, for producing valid blocks and processing transactions.&nbsp;Miner revenue considers inflation rewards (block subsidies) and transaction fees.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoin-miner-revenue-daily\/embed\" title=\"Bitcoin Miner Revenue (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Bitcoin miners made just under $732 million in March from block subsidies, the primary source of revenue. When combined with transaction fees, they made $755 million. While this has risen, profitability remains well below all-time highs.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoin-miner-revenue-monthly\/embed\" title=\"Bitcoin Miner Revenue (Monthly)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The increased revenue for miners correlates to the price of what they are mining: bitcoins. The cryptocurrency's price has <a href=\"https:\/\/www.theblock.co\/post\/224556\/bitcoin-miner-revenue-march-2023\" data-v-f87c67ca=\"\">increased<\/a> by 69% since Jan. 1, and nearly 26% over the past month, more than enough to counteract the increased mining costs.","<span data-v-f87c67ca=\"\">The price of Bitcoin has increased substantially in 2023. Source: TradingView<\/span>","\"Most revenue comes from the block subsidy — 6.25 BTC per block right now — which is a constant in BTC terms, but goes up in USD terms as the price of Bitcoin increases,\" The Block's Director of Research Simon Cousaert explains, adding: \"Increased network activity might also account for this (more transaction fees) — but that’s pretty much negligible compared to the price increase effect.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$732 million","content":"MONEY"},{"type":"2.23%","content":"PERCENT"},{"type":"TradingView","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Foundry USA","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"1.16%","content":"PERCENT"},{"type":"March 23","content":"DATE"},{"type":"7.56%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"9.95%","content":"PERCENT"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"69%","content":"PERCENT"},{"type":"Director of Research Simon Cousaert","content":"ORGANIZATION"},{"type":"Jan. 1","content":"DATE"},{"type":"26%","content":"PERCENT"},{"type":"Bitcoin","content":"PERSON"},{"type":"$755 million","content":"MONEY"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["BITCOIN","MINING","MINING COMPANIES"],"authors":["Adam James","The Block"]}