{"summary":"Decentralized exchange Uniswap provided data breaking down which addresses it has blocked so far and why. The data was later removed.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/164626\/uniswap-has-blocked-253-crypto-addresses-related-to-stolen-funds-or-sanctions","publishDate":"2022-08-20T05:33:30","id":4007,"type":null,"title":"Uniswap has blocked 253 crypto addresses related to stolen funds or sanctions","category":["DEX"],"content":["Decentralized exchange Uniswap has blocked 253 crypto addresses in its four months of working with blockchain analytics firm TRM Labs.","It was the first time Uniswap had revealed data on wallet blacklisting.&nbsp;","The addresses were mostly blocked because of connections with stolen funds or transaction mixing services like Tornado Cash, which was recently sanctioned by the US Treasury.&nbsp;","The data was published on GitHub by Uniswap software engineer Jordan Frankfurt, according to Yearn Finance core developer Banteg, who saved the data in a <a href=\"https:\/\/twitter.com\/bantg\/status\/1560711564801544193\" data-v-f87c67ca=\"\">tweet thread<\/a> and on <a href=\"https:\/\/gist.github.com\/banteg\/1657d4778eb86c460e03bc58b99970c0\" data-v-f87c67ca=\"\">GitHub<\/a>. We reached out to Frankfurt and Uniswap for comment and will update this article should we hear back.&nbsp;","There are three core things that make up Uniswap: code running on the blockchain that anyone can interact with, a front-end website that provides one way for users to interact with the code and a US-based company that develops the protocol and runs the front-end website. Blocking crypto addresses happens on the front-end level.&nbsp;","Uniswap <a href=\"https:\/\/www.theblock.co\/post\/143036\/uniswap-labs-now-blocks-crypto-wallets-frontend\" data-v-f87c67ca=\"\">partnered<\/a> with TRM Labs in April. When someone interacts with the Uniswap website, their address is sent to TRM Labs, which will assign it a risk level. It’s up to Uniswap to decide what risk levels it’s comfortable with.&nbsp;","According to Frankfurt’s comments on GitHub, Uniswap initially blocked addresses that were indirectly related to sanctioned addresses, but has since scaled that back. Now it only blocks addresses that were sanctioned or have directly received hacked or stolen funds.&nbsp;","TRM Labs checks the addresses for seven categories of illegal activity, according to a chart shared on GitHub. The main four that are commonly flagged are stolen funds, funds from a transaction mixer, sanctioned addresses and funds from a known scam. The remaining categories are child sexual abuse material, funds from known hacker groups and funds used for terrorist financing.&nbsp;&nbsp;","Banteg noted that 30 of the addresses were associated with ENS names, which are human readable names used to make it easier to send crypto payments to those wallets. Banteg reckoned most of them were probably legitimate users.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"US Treasury","content":"ORGANIZATION"},{"type":"TRM Labs","content":"ORGANIZATION"},{"type":"Frankfurt","content":"LOCATION"},{"type":"Banteg","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Yearn Finance","content":"ORGANIZATION"},{"type":"Jordan Frankfurt","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"GitHub","content":"ORGANIZATION"},{"type":"ENS","content":"ORGANIZATION"}],"hashtag":["CENSORSHIP","UNISWAP"],"authors":["Tim Copeland","The Block"]}