{"summary":"DCS Card Centre (DCS) recently announced the official launch of its payment token DCS Tokens (DUS), which will be first deployed and issued on PlatON network.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/248759\/dcs-card-centre-launches-payment-token-dus-to-be-first-deployed-and-issued-on-platon-network","publishDate":"2023-09-04T09:01:02","id":4008,"type":null,"title":"DCS Card Centre Launches Payment Token DUS, to Be First Deployed and Issued on PlatON Network","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">DCS Card Centre (DCS) recently announced the official launch of its payment token DCS Tokens (DUS), which will be first deployed and issued on PlatON network.<\/span>","<span data-v-f87c67ca=\"\">This issuance marks a major breakthrough in the field of blockchain payments, demonstrating the determination of PlatON and DCS to use advanced technology to drive innovation in the payment industry. DCS has also become the first financial institution in Singapore to launch an initiative aimed at bridging the transitions between Web2 and Web3 ecosystems after the Monetary Authority of Singapore (MAS) introduced the Single-Currency Stablecoin (SCS) Regulatory Framework.<\/span>","<span data-v-f87c67ca=\"\">DCS is a financial institution governed by the Monetary Authority of Singapore (MAS) under the Banking Act and licensed to issue credit and charge cards. DCS will continue to lead the revolutionary innovation and integration in the next-generation digital payment field.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">DCS Tokens (DUS) represent a unique convergence of digital assets and traditional finance. DCS Tokens are tokenized from credit card transactions processed by DCS and can only be returned to DCS for redemption as card spend limits. These tokens are designed to provide value stability (1USD: 1DUS) and act as a trusted connection between Web3 and card payments globally in Web2.<\/span>","<span data-v-f87c67ca=\"\">PlatON Network, known for its high security and scalability, will provide a solid technical foundation for the issuance of DUS, ensuring that users can conduct transactions in a fast and secure network environment without worrying about privacy and data security issues.<\/span>","<span data-v-f87c67ca=\"\">The redemption of DUS for conversion into increasing a DCS cardholders’ spend limit or paying outstanding balances back to fiat is fast and seamless, as the transaction is executed instantly on D-Vault. D-Vault, a feature within the DCS Cards app, also allows bank transfers and conversion of digital assets. This innovation empowers users to seamlessly optimise and toggle between the convenience and efficiencies of Web2 and Web3.<\/span>","<span data-v-f87c67ca=\"\">In addition to co-issuing DUS, DCS will also explore a new ecosystem of financial services on Web3.0 with PlatON based on blockchain, privacy-preserving computation, artificial intelligence (AI), and other technologies, promoting innovation and development of blockchain technology in the field of payment and clearing. At the same time, DCS became the first heavyweight financial institution to sign up for TOPOS (an encrypted payment and clearing operation system based on PlatON), initiating and building the TOPOS ecosystem together with PlatON.<\/span>","<span data-v-f87c67ca=\"\">PlatON is an open financial infrastructure with privacy-preserving computation as its technical feature. Initiated and promoted by LatticeX Foundation, PlatON aims to become a major blockchain platform in the era of Web 3. It secures stability and performance on a par with that of the financial system, and provides privacy-enhanced compliant digital asset management, multi-scenario encrypted payment and clearing solutions, as well as smooth and user-friendly experience for various types of Web3 native applications and applications\/users migrating from Web2 to Web3.<\/span>","<span data-v-f87c67ca=\"\">TOPOS is an open payment and clearing operation system based on blockchain, adhering to an OPEN LOOP multi-party architecture. With the underlying payment logic based on Tokenized Money, TOPOS enables users to self-mint \"money\" in the Web3 era and transfer value in a secure, controlled way. TOPOS will gradually build an open clearing and settlement system for Web3.0 in a compliant, secure, open, and convenient manner.<\/span>","<span data-v-f87c67ca=\"\">This historic collaboration between the two parties is grounded in their shared vision and value judgment for the future of global digital payment and clearing. The TOPOS network offers DCS a complete underlying solution for issuing Tokenized Money compliant within the PlatON network, assisting DCS in securely, stably, and transparently managing the minting, burning, and scenario-based use of tokens.<\/span>","<span data-v-f87c67ca=\"\">Through this partnership, the industry is presented with PlatON's comprehensive strength and ambitious vision in Web3.0 open financial infrastructure and its ecosystem. It marks the initiation of TOPOS's business strategy as the global digital currency payment and clearing network for the Web3.0 era. This proves that TOPOS is poised to thoroughly and deeply support various traditional financial institutions in their strategic transition to open finance under the Web3.0\/digital currency system. Moreover, it is ready to serve more financial institutions committed to the construction of the new TOPOS clearing network.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Winkrypto <\/i><i data-v-f87c67ca=\"\">and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"fiat","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"SCS) Regulatory Framework","content":"ORGANIZATION"},{"type":"LatticeX Foundation","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"DUS","content":"ORGANIZATION"},{"type":"Vault","content":"LOCATION"},{"type":"Monetary Authority of Singapore (MAS","content":"ORGANIZATION"},{"type":"Winkrypto","content":"PERSON"}],"hashtag":[],"authors":["Sponsored","The Block"]}