{"summary":"Crypto exchange OKEx’s Korea unit is delisting all five privacy coins \nThese include monero (XMR), dash (DASH), zcash (ZEC), horizen (ZEN) and super bitcoin (SBTC)\nThe decision has been taken as these coins “violate” the FATF’s “travel rule” ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/39724\/okex-korea-delisting-all-privacy-coins-including-monero-zcash-and-dash-as-these-violate-fatfs-travel-rule","publishDate":"2019-09-16T02:55:20","id":401,"type":null,"title":"OKEx Korea delisting all privacy coins, including Monero, Zcash and Dash, as these ‘violate’ FATF’s &#x27;travel rule&#x27;","category":["Exchanges"],"content":["Cryptocurrency exchange OKEx’s Korea unit is delisting all five privacy coins - monero (XMR), dash (DASH), zcash (ZEC), horizen (ZEN) and super bitcoin (SBTC).<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe transaction support for the five coins will end on Oct. 10, while withdrawal services will stop on Dec. 10, OKEx Korea <a href=\"https:\/\/support.okex.co.kr\/hc\/ko\/articles\/360033580551\" data-v-f87c67ca=\"\">announced<\/a> Monday. The exchange said the decision has been taken as these coins “violate” the Financial Action Task Force (FATF’s) \"travel rule.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIn June, the FATF, the global money-laundering watchdog,<a href=\"https:\/\/www.theblockcrypto.com\/post\/28521\/fatf-retains-travel-rule-in-new-guidance-compelling-exchanges-to-share-customer-data\" data-v-f87c67ca=\"\"> issued<\/a> its final crypto guidelines, retaining “travel rule,” which requires exchanges to collect and transfer customer information during transactions. The information includes originator’s name, his account number and location information, as well as beneficiary's name and his account number.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nOKEx Korea said privacy-oriented coins do not allow collecting such information, hence the end of the support for the five coins. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAn OKEx spokesperson told The Block that the decision applies only for its Korea unit and not globally. This likely indicates that the Korean government has asked cryptocurrency exchanges to implement the FATF’s guidelines.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIt is possible that other crypto exchanges with fiat on-ramps will follow suit.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nLast month, U.K.-based crypto exchange CEX.io also <a href=\"https:\/\/t.me\/CEX_IO\/21230\" data-v-f87c67ca=\"\">announced<\/a> that it is delisting privacy coins zcash and dash taking into account \"global regulatory and compliance developments.\"&nbsp; It <a href=\"https:\/\/t.me\/CEX_IO\/21239\" data-v-f87c67ca=\"\">explained<\/a> at the time: \"Considering the forthcoming implementation of the Fifth AML Directive and the underlying requirements imposed on virtual currency exchanges in the UK, it was decided to reassess the company’s risk appetite to privacy-enhanced cryptocurrencies. For now, there is no available instruments for tracing and monitoring privacy-enhanced coins on the market.\" Trading support for the two coins ended Sept. 15, while free custody support ends on Dec. 31; post that a storage fee will apply.","Coinbase U.K. also recently <a href=\"https:\/\/www.theblockcrypto.com\/linked\/35506\/coinbase-removing-zcash-support-for-uk-customers\" data-v-f87c67ca=\"\">removed<\/a> the support for zcash. The move, however, was reportedly <a href=\"https:\/\/www.theblockcrypto.com\/linked\/35904\/barclays-cancels-banking-deal-with-coinbase-report\" data-v-f87c67ca=\"\">to do with<\/a> Coinbase U.K.'s new banking partner ClearBank.","<em data-v-f87c67ca=\"\">This story has been updated to include a reply from an OKEx spokesperson.<\/em>"],"hashtag":[]}