{"summary":"Not even Pepe mania can provide relief for beleaguered crypto exchange volumes. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231284\/crypto-exchange-volumes-sink","publishDate":"2023-05-18T07:27:50","id":4013,"type":null,"title":"Crypto exchange volumes sink after Jump, Jane Street pull back","category":["COMPANIES"],"content":["Not even pepe mania can provide relief for beleaguered crypto exchange volumes.&nbsp;","Daily trading volumes are lower across the board as crypto finds itself stuck in a relatively sleepy market. The Block's data dashboard indicates that the 7-day-moving average for crypto exchange volumes has hit its lowest level since the beginning of the year, clocking in at $12.84 billion on May 17 — down steeply from March's peak of over $46 billion.&nbsp;","","","The decline in trading volumes has been underpinned by a surge in bitcoin's dominance in the market, which currently stands at about 45%. That's an increase from a low of 37.5% at the beginning of the year.&nbsp;","Volatility has also compressed, with the Bitcoin Volatility Index (BVIN) declining from 96 on April 14 to 58.5 on May 17.&nbsp;","The decline in volumes follows news that major trading firms are scaling back their activity in the market. On May 9, Bloomberg reported that Jump and Jane Street have pulled back from crypto trading because of regulatory uncertainty in the U.S. Jane Street, for its part, is scaling back globally, according to the report.&nbsp;","\"Options implied volatility is extremely compressed, falling to around 40% for both BTC and ETH, which is the lowest we have seen in many years,\" said Jason Atkins, head of business development and partnerships at Auros.&nbsp;","\"Far from being a reflection of maturation and stability, this fall in implied volatility is largely the combined result of the abrupt reduction in the number of large, sophisticated market participants and the increased hurdles to fiat on\/off-ramps, leading to significantly lower volumes and higher volatility across all major coins.\"","Still, the decline in the number of market participants presents an opportunity for players sticking around.&nbsp;","\"For participants that remain, the inefficiencies created by the retreat of some of the larger players might offer more opportunities to fill the vacuum, which is a small silver lining amidst the drastic reduction in volumes and volatility,\" Atkins added.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"May 17","content":"DATE"},{"type":"37.5%","content":"PERCENT"},{"type":"$12.84 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$46 billion","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Jason Atkins","content":"PERSON"},{"type":"45%","content":"PERCENT"},{"type":"Jane Street","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"April 14","content":"DATE"},{"type":"May 9","content":"DATE"},{"type":"Atkins","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}