{"summary":"The SEC&#x27;s top enforcer condemned the crypto industry over its &quot;significant noncompliance,&quot; and addressed criticism lodged at the agency.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286279\/secs-gurbir-grewal-criticizes-crypto-industrys-noncompliance-creative-attempts-to-avoid-rules","publishDate":"2024-04-03T10:41:24","id":4014,"type":null,"title":"SEC&#x27;s Gurbir Grewal criticizes crypto industry&#x27;s noncompliance, &#x27;creative attempts&#x27; to avoid rules","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Securities and Exchange Commission's top enforcer, Gurbir Grewal, condemned the crypto industry over its \"significant noncompliance\" and addressed criticism lodged at the agency over the years.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Grewal, the director of the agency's Division of Enforcement, laid into the crypto industry on Wednesday morning for about 15 minutes during a t<\/span><span class=\"s2\" data-v-f87c67ca=\"\">wo-day \"SEC Speaks\" event sponsored by the Practicing Law Institute.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Over this past decade, we have confronted significant noncompliance and many, many creative attempts by market participants to avoid our jurisdiction, with some claiming that we're making it up as we go, that we are regulating by enforcement and others arguing that we are somehow recklessly exceeding our authorities,\" Grewal said. Grewal also noted that his views don't necessarily reflect the agency's.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The crypto industry has criticized the SEC for what many call \"regulation by enforcement,\" while SEC Chair Gary Gensler has argued that most cryptocurrencies are securities and should be regulated similarly to other investments. Cases have been taken to the courts, with some firms, such as Coinbase, arguing that crypto is similar to Beanie Babies and others calling for clarity on how securities laws apply.&nbsp;<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">Grewal said the test to determine whether crypto is a security is the Howey Test, referring to a 1946 U.S. Supreme Court case frequently cited by the SEC to determine whether an asset qualifies as an investment contract and, therefore, a security.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"It's not the essential ingredients test or the Beanie Babies test or some other tests that industry folks might like to create for themselves,\" Grewal said on Wednesday.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC has been clear and consistent about Howey — there are \"no secret analyses,\" Grewal added<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"At the same time, we've been accused of picking winners and losers, stifling innovation, and driving crypto businesses to some more favorable foreign jurisdictions wherever they may exist,\" Grewal said, taking a shot at the crypto industry for what he described as, \"a decade's worth of verbal gymnastics that are just a backhanded way of saying that 'we want a different set of rules that apply to everyone else.'\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The predatory inclusion tactics that certain crypto entities are directing at Black, Brown and other marginalized communities are extremely troubling,\" Grewal said. \"Here, I'm talking about the familiar but so far unsupported narratives that crypto will somehow increase financial inclusion, that it will uplift the unbanked or the underbanked, and that it will help them build wealth and increase upward mobility.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">A Pew Research Center <a href=\"https:\/\/www.pewresearch.org\/short-reads\/2023\/04\/10\/majority-of-americans-arent-confident-in-the-safety-and-reliability-of-cryptocurrency\/\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">study<\/span><\/a> from last year found that 24 percent of Asian adults and 21 percent of Black or Hispanic adults say they have invested or used crypto, compared to 14 percent of white adults.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Crypto assets are the only major financial products that Black Americans are more likely to own than white Americans,\" Grewal said. \"There's some evidence that Black and Brown investors were disproportionately harmed during the downturn of crypto markets over the last few years.\"<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"U.S. Supreme Court","content":"ORGANIZATION"},{"type":"1946","content":"DATE"},{"type":"21 percent","content":"PERCENT"},{"type":"14 percent","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Grewal","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Howey Test","content":"PERSON"},{"type":"Practicing Law Institute","content":"ORGANIZATION"},{"type":"Brown","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"last year","content":"DATE"},{"type":"morning","content":"TIME"},{"type":"24 percent","content":"PERCENT"},{"type":"Howey","content":"PERSON"},{"type":"Pew Research Center","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Gurbir Grewal","content":"PERSON"},{"type":"Division of Enforcement","content":"ORGANIZATION"}],"hashtag":["SEC"],"authors":["Sarah Wynn","The Block"]}