{"summary":"The service lets users connect to Lido and Rocket Pool and stake ETH to receive liquid staking tokens directly from the staking providers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/201767\/metamask-staking-beta-now-live-with-lido-and-rocket-pool-consensys-says","publishDate":"2023-01-13T12:00:03","id":4018,"type":null,"title":"MetaMask Staking beta now live with Lido and Rocket Pool, ConsenSys says","category":["WEB3"],"content":["<span data-v-f87c67ca=\"\">With the new service, users can connect to Lido and Rocket Pool to stake their ETH and receive liquid staking tokens directly from the staking provider within the web3 app.<\/span>","<span data-v-f87c67ca=\"\">Crypto wallet provider MetaMask will now support liquid staking through Lido and Rocket Pool, ConsenSys announced today.<\/span>","<span data-v-f87c67ca=\"\">In a public beta for the protocol, users that want to stake ETH, and earn rewards for contributing to network consensus, may do so directly within MetaMask’s web3 application by selecting a desired staking provider and confirming the amount of ETH to be allocated with a signed transaction.<\/span>","<span data-v-f87c67ca=\"\">“It is important to note that MetaMask Staking isn't providing staking services,” MetaMask senior product manager Abad Mian told The Block in an email. “We simply connect users to Lido and Rocket Pool to stake their ETH and receive liquid staking tokens directly from the staking provider.”<\/span>","<span data-v-f87c67ca=\"\">Lido and Rocket Pool were chosen based on user feedback and “are among the most popular options for Ethereum liquid staking,” according to Mian.<\/span>","<span data-v-f87c67ca=\"\">Interest in staking has been on the rise since the launch of the Ethereum Beacon chain and The Merge, according to Mian. However, despite its surge in popularity, staking suffers from convoluted interfaces that may present a barrier to adoption.<\/span>","<span data-v-f87c67ca=\"\">“We believe staking is a core component of web3,”Mian said. “Clean, convenient, and comprehensible user interfaces are critical for driving the adoption of web3 products and services.”<\/span>","<span data-v-f87c67ca=\"\">Those who wish to swap from stETH or rETH received for staking on Lido or Rocket Pool back to ETH may do so within MetaMask for a fee.<\/span>","<span data-v-f87c67ca=\"\">“MetaMask Staking users can direct themselves to MetaMask Swaps from the Staking interface if they want to make a swap. Swaps aggregate data from decentralized exchange aggregators, market makers and DEXs, to help you compare prices for your swap,” Mian said.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lido","content":"LOCATION"},{"type":"Abad Mian","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"MetaMask Staking","content":"ORGANIZATION"},{"type":"Ethereum Beacon","content":"ORGANIZATION"}],"hashtag":[],"authors":["Jeremy Nation","The Block"]}