{"summary":"Crypto revenue extorted by ransomware attackers fell significantly in 2022, down 40.3% to $456.8 million from $765.6 million the previous year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/204471\/ransomware-crypto-revenue-declines-as-victims-refuse-to-pay-chainalysis","publishDate":"2023-01-22T10:36:57","id":4019,"type":null,"title":"Ransomware crypto revenue declines as victims refuse to pay: Chainalysis","category":["SECURITY"],"content":["<span data-v-f87c67ca=\"\">Crypto revenue extorted by ransomware attackers fell significantly in 2022, down 40.3% to $456.8 million from $765.6 million the previous year.<\/span>","<span data-v-f87c67ca=\"\">The trend in reduced ransomware payments was clear, as blockchain data platform Chainalysis highlighted in a new <\/span><a href=\"https:\/\/blog.chainalysis.com\/reports\/crypto-ransomware-revenue-down-as-victims-refuse-to-pay\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">report<\/span><\/a><span data-v-f87c67ca=\"\">. Still, the actual totals are likely higher as many cryptocurrency addresses controlled by attackers are yet to be identified on blockchain networks and incorporated into Chainalysis’ data.<\/span>","<span data-v-f87c67ca=\"\">Unfortunately, the decline in revenue did not correspond to fewer attempted attacks. Cybersecurity firm Fortinet <\/span><a href=\"https:\/\/www.fortinet.com\/blog\/threat-research\/fortiguard-labs-threat-report-key-findings\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reported<\/span><\/a><span data-v-f87c67ca=\"\"> more than 10,000 unique ransomware strains in the first half of 2022, almost doubling those of the prior six months. On-chain data also confirmed that the number of active types of ransomware has increased dramatically in recent years. Still, the average lifespan of each type dropped by more than half to 70 days in 2022 as attackers tried to obfuscate their activities by utilizing various strains.<\/span>","<span data-v-f87c67ca=\"\">While numerous strains remain active, Chainalysis said the number of individuals in the ransomware ecosystem is probably small. This is because affiliates carry out attacks over multiple strains, creating the illusion of many different attackers despite re-using the same wallet addresses.<\/span>","<span data-v-f87c67ca=\"\">Ultimately, Chainalysis said, evidence suggests the drop in payments may be attributed to more victims refusing to pay ransomware attackers.<\/span>","<span data-v-f87c67ca=\"\">On the money laundering front, Chainalysis said most ransomware attackers were increasingly sending victims’ funds to mainstream, centralized crypto exchanges. The share of ransomware funds going to such platforms increased to 48.3% in 2022 from 39.3% in 2021. Meanwhile, those sent to high-risk exchanges fell to 6.7% from 10.9%. Money laundering of ransomware funds through illicit services such as darknet markets also declined, while crypto mixers including Tornado Cash proved more popular, increasing to 15% from 11.6%.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"6.7%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"10.9%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"39.3%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"the first half of 2022","content":"DATE"},{"type":"11.6%","content":"PERCENT"},{"type":"$765.6 million","content":"MONEY"},{"type":"Chainalysis","content":"PERSON"},{"type":"$456.8 million","content":"MONEY"},{"type":"15%","content":"PERCENT"},{"type":"48.3%","content":"PERCENT"},{"type":"40.3%","content":"PERCENT"}],"hashtag":["CRIME","HACKS","INTERNET","MIXERS","WALLETS"],"authors":["James Hunt","The Block"]}