{"summary":"Robinhood, a darling of millennial stock traders, has slashed the percentage of trades it sends to one of the largest high-frequency firms, a move that","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/8855\/robinhood-has-slashed-the-percentage-of-orders-it-sends-to-high-speed-trading-firm-citadel-securities","publishDate":"2019-01-25T16:31:58","id":4020,"type":null,"title":"Robinhood has slashed the percentage of orders it sends to Citadel Securities as competition among HFTs heats up","category":["MARKETS"],"content":["Robinhood, a darling of millennial stock traders, has slashed the percentage of trades it sends to one of the largest high-frequency firms, a move that might reflect competition for Robinhood's order flow among high-frequency trading firms is heating up.&nbsp;","The firm, which is <a href=\"https:\/\/blog.robinhood.com\/news\/2018\/10\/12\/a-letter-from-robinhood-co-founder-amp-co-ceo-vlad-tenev?mod=article_inline\" data-v-f87c67ca=\"\">valued at $5.6 billion<\/a>, makes 40% of its revenues by routing its clients' orders to firms like Virtu Financial and Citadel Securities, according to estimates by Bloomberg. To be sure, almost every single one of Robinhood's broker rivals — including TDAmeritrade and E*Trade — engages in the practice, <a href=\"https:\/\/www.investopedia.com\/terms\/p\/paymentoforderflow.asp\" data-v-f87c67ca=\"\">referred to as payment for order flow<\/a>. TDAmeritrade clients, for instance, <a href=\"https:\/\/www.wsj.com\/articles\/judge-oks-class-action-lawsuit-against-td-ameritrade-1537559644\" data-v-f87c67ca=\"\">alleged in a class-action lawsuit that the firm's PFOF set-up prioritized HFTs over their best interests — charges TD disagreed with<\/a>.&nbsp;","Still, critics pointed out frequently at the end of 2018 that Robinhood has been unique inasmuch as it sent, at one point, the majority of its flow to one firm, Citadel Securities, and it makes far more than its rivals in <a href=\"https:\/\/seekingalpha.com\/article\/4205379-robinhood-making-millions-selling-millennial-customers-high-frequency-traders\" data-v-f87c67ca=\"\">payment for certain flows, as noted by The Wall Street Journal<\/a>. This has raised questions about the execution-quality Robinhood is achieving for its clients. Brokers are required to achieve <a href=\"https:\/\/www.investopedia.com\/terms\/b\/bestexecution.asp\" data-v-f87c67ca=\"\">best-execution<\/a>. CEO Vlad Tenev <a href=\"https:\/\/blog.robinhood.com\/news\/2018\/10\/12\/a-letter-from-robinhood-co-founder-amp-co-ceo-vlad-tenev?mod=article_inline\" data-v-f87c67ca=\"\">has defended<\/a> the way his firm makes money, saying once in a blog post \"we send your orders to the market maker that's most likely to give you the best execution quality.\"","Still, in both Q2 and Q3 of 2018, Robinhood routed&nbsp;<a href=\"https:\/\/d2ue93q3u507c2.cloudfront.net\/assets\/robinhood\/legal\/RHF%20PFO%20Disclosure.pdf\" data-v-f87c67ca=\"\">60% of its flow for NYSE-listed securities to Citadel — far more than its rivals<\/a>. That almost halved in Q4, to&nbsp;35%, <a href=\"https:\/\/d2ue93q3u507c2.cloudfront.net\/assets\/robinhood\/legal\/RHF%20PFO%20Disclosure.pdf\" data-v-f87c67ca=\"\">according to a 606 report for the quarter<\/a>. Now it is on par with firms such as E*Trade, which sent about <a href=\"https:\/\/content.etrade.com\/etrade\/powerpage\/pdf\/OrderRouting11AC6.pdf\" data-v-f87c67ca=\"\">33% of its client orders of NYSE-listed stocks to Citadel in Q4<\/a>, whereas Ameritrade sent <a href=\"https:\/\/www.tdameritrade.com\/retail-en_us\/resources\/pdf\/AMTD2054.pdf\" data-v-f87c67ca=\"\">approximately 43% of its flow to the firm in Q3<\/a>. Notably, TDAmeritrade and E*Trade route a small percentage of their client orders to exchange venues, including Nasdaq and Cboe, whereas Robinhood is not a member of any exchange group.","","","<strong data-v-f87c67ca=\"\">Competition heating up? Or Robinhood saving face?<\/strong>","\"Visually, this looks better for Robinhood since they are spreading it out,\" Joe Saluzzi, a market structure commentator and head of institutional broker Themis Trading told The Block. According to Saluzzi, Robinhood might be trying to diversify its flows to mollify critiques that it's playing favorites with Citadel. \"Looks like the payment for order flow talk and best ex talk has caused Robinhood to change some of the spots where they route their flow.\"","To be sure, it might be something far less calculated, other insiders say. Competition for Robinhood's prized retail orders might also be behind its moving flow from Citadel to its rivals. High-speed traders such as Citadel and Virtu make more money by capturing the spread — the price between a bid and offer — from retail trades, than they do institutional-sized ones.&nbsp;\"Can't make money on institutional flow — you get run over,\" a former NYSE executive told The Block as market makers would much rather be on the other side of a retail trade than a large institution like a Goldman Sachs or JPMorgan. There's \"more competition for [Robinhood's] flow,\" one exec at an HFT firm noted in a conversation with The Block.&nbsp;","\"Competition among HFTs for retail order flow is increasing,\" a source familiar with Robinhood's business said, declining to comment further.&nbsp;","Saluzzi said that this could be the case, but he added, \"Why was Citadel getting so much flow? Was there a side deal that is not disclosed? Either way, once the microscope was turned on, Robinhood shifted flow.\" At the same time, FINRA looks like it is preparing to put more pressure on brokers to prove their clients' trades are being executed at the best price. \"In particular, FINRA will review firms’ best execution decision-making where the firm routed all or substantially all customer orders to a small number of wholesale market makers from which they received payment for order flow,\" <a href=\"http:\/\/www.finra.org\/industry\/2019-annual-risk-monitoring-and-examination-priorities-letter\" data-v-f87c67ca=\"\">the regulatory body said earlier this year<\/a>.&nbsp;","Robinhood declined to comment.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Vlad Tenev","content":"PERSON"},{"type":"Ameritrade","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$5.6 billion","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"60%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"35%","content":"PERCENT"},{"type":"Joe Saluzzi","content":"PERSON"},{"type":"earlier this year","content":"DATE"},{"type":"FINRA","content":"ORGANIZATION"},{"type":"Citadel","content":"LOCATION"},{"type":"Virtu Financial","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"43%","content":"PERCENT"},{"type":"33%","content":"PERCENT"},{"type":"Saluzzi","content":"LOCATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"NYSE","content":"ORGANIZATION"},{"type":"Citadel","content":"ORGANIZATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Cboe","content":"ORGANIZATION"},{"type":"Citadel Securities","content":"ORGANIZATION"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}