{"summary":"Mantle Network launched its mainnet alpha at EthCC, alongside a $200 million ecosystem fund, following six months of testnet development.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239904\/ethereum-layer-2-mantle-network-mainnet-alpha-ethcc","publishDate":"2023-07-17T05:00:56","id":4022,"type":null,"title":"Ethereum Layer 2 Mantle Network unveils mainnet alpha at EthCC","category":["LAYER 2S AND SCALING"],"content":["Ethereum Layer 2 blockchain Mantle Network has officially launched its mainnet alpha at the Ethereum Community Conference (EthCC) in Paris.&nbsp;","The launch follows six months of development and testing, during which the network processed over 14 million on-chain transactions, according to a statement. “The testnet phase concluded following multiple security audits that helped remove potential risks and vulnerabilities,” Mantle said.","Following its merger with backer <a href=\"https:\/\/www.theblock.co\/post\/231557\/ethereum-layer-2-mantle-network-merges-with-backer-bitdao\" data-v-f87c67ca=\"\">BitDAO<\/a> in May, which amalgamated BitDAO’s governance framework and treasury with the network, Mantle is now backed by one of the largest treasuries in crypto — worth over <a href=\"https:\/\/etherscan.io\/address\/0x78605Df79524164911C144801f41e9811B7DB73D\" data-v-f87c67ca=\"\">$2.4 billion<\/a>.","Unlike monolithic blockchains that funnel all transactions through the same layer, the Ethereum-compatible Mantle Network takes a modular chain approach, separating execution, data availability, consensus and settlement into distinct layers, Mantle said.","Mantle’s modular architecture, Optimistic Rollup design and availability of data in collaboration with the ether restaking protocol EigenLayer, aims to combine high performance with low costs while retaining Ethereum’s decentralization and security, it added.","Arbitrum and Optimism currently dominate the Ethereum Layer 2 Optimistic Rollup landscape, with more than $5.9 billion in combined value locked, according to The Block’s <a href=\"https:\/\/www.theblockcrypto.com\/data\/scaling-solutions\/scaling-overview\/value-locked-of-ethereum-optimistic-rollups\" data-v-f87c67ca=\"\">data dashboard<\/a>.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/scaling-overview\/value-locked-of-ethereum-optimistic-rollups\/embed\" title=\"Value Locked in Ethereum Optimistic Rollups (Escrow Contracts)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Mantle said this design meant upgrades could be implemented swiftly by swapping modular components in and out, potentially paving the way for the adoption of the latest Ethereum improvements like account abstraction. Account abstraction allows wallets to work similarly to smart contracts and handle more complex tasks automatically.","“Mantle Network is the first among the L2 blockchains currently in testnet to hit mainnet, and the only modular chain amongst a forest of monoliths,” Mantle strategic advisor Jordi Alexander said. “As this burgeoning space sizzles on the eve of ‘L2 Summer’, the agility enabled by Mantle Network's adaptive and iterative design will keep it at the bleeding edge of the latest technological breakthroughs for years to come.”","The scalability of the Layer 2 opens up use cases like more advanced blockchain gaming, DeFi and social protocols without incurring high fees, Mantle added.","Mantle’s mainnet alpha launches with partners including blockchain gaming accelerator Game7, web3 game launcher HyperPlay and blockchain education initiative EduDAO. Infrastructure providers and dApps like Ankr, Bullieverse, Covalent, LayerZero and The Graph also contribute to the network.","The DAO-led ecosystem recently approved a <a href=\"https:\/\/www.theblock.co\/post\/238570\/mantle-network-is-voting-to-form-a-200-million-ecosystem-fund\" data-v-f87c67ca=\"\">$200 million<\/a> ecosystem fund to support the development of early-stage dApps on the Ethereum Layer 2, which it proposed last week.","The fund launched in collaboration with venture partners including Animoca Ventures, Dragonfly Capital, Figment Capital, Hashkey Capital, Pantera Capital, QCP Capital and SevenX Ventures and is operated by Mirana Ventures.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$5.9 billion","content":"MONEY"},{"type":"Bullieverse","content":"LOCATION"},{"type":"Paris","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Hashkey Capital","content":"ORGANIZATION"},{"type":"Jordi Alexander","content":"PERSON"},{"type":"Mantle Network","content":"ORGANIZATION"},{"type":"$2.4 billion","content":"MONEY"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"SevenX Ventures","content":"ORGANIZATION"},{"type":"Mantle","content":"PERSON"},{"type":"Mirana Ventures","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Animoca Ventures","content":"ORGANIZATION"},{"type":"Ethereum Community Conference","content":"ORGANIZATION"},{"type":"$200 million","content":"MONEY"},{"type":"Dragonfly Capital","content":"ORGANIZATION"}],"hashtag":["ARBITRUM","OPTIMISM"],"authors":["James Hunt","The Block"]}