{"summary":"The Federal Deposit Insurance Corporation (FDIC) said Friday that it has sent cease-and-desist letters to five crypto companies, including FTX US, over alleged misrepresentations regarding deposit insurance.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/164553\/fdic-issues-cease-and-desist-letters-to-ftx-us-other-crypto-firms-over-deposit-insurance","publishDate":"2022-08-19T14:13:50","id":4027,"type":null,"title":"FDIC issues cease-and-desist letters to FTX US, other crypto firms over deposit insurance","category":["LEGAL"],"content":["The Federal Deposit Insurance Corporation (FDIC) has issued cease-and-desist letters to FTX US and four other crypto companies for allegedly making \"false and misleading statements\" about federal deposit insurance.","<a href=\"https:\/\/www.fdic.gov\/news\/press-releases\/2022\/ftx-harrison-letter.pdf\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">FTX US<\/a>, <a href=\"https:\/\/www.fdic.gov\/news\/press-releases\/2022\/cryptonews-letter.pdf?source=govdelivery&amp;utm_medium=email&amp;utm_source=govdelivery\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Cryptonews.com<\/a>, <a href=\"https:\/\/www.fdic.gov\/news\/press-releases\/2022\/cryptosec-info-letter.pdf?source=govdelivery&amp;utm_medium=email&amp;utm_source=govdelivery\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Cryptosec.info<\/a>, <a href=\"https:\/\/www.fdic.gov\/news\/press-releases\/2022\/smart-asset-letter.pdf?source=govdelivery&amp;utm_medium=email&amp;utm_source=govdelivery\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">SmartAsset.com<\/a> and <a href=\"https:\/\/www.fdic.gov\/news\/press-releases\/2022\/fdic-crypto-com-letter.pdf?source=govdelivery&amp;utm_medium=email&amp;utm_source=govdelivery\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">FDICCrypto.com<\/a> have been directed to \"take immediate corrective action to address these false or misleading statements,\" the FDIC announced.","\"The Federal Deposit Insurance Act (FDI Act) prohibits any person from representing or implying that an uninsured product is FDIC-insured or from knowingly misrepresenting the extent and manner of deposit insurance,\" said the regulator. \"The FDI Act further prohibits companies from implying that their products are FDIC-insured by using 'FDIC' in the company’s name, advertisements, or other documents.\"","The move represents the latest public action by the FDIC regarding depository insurance claims. Late last month, the FDIC issued a statement declaring that crypto companies are not covered by federal depository insurance. That development came in the wake of the bankruptcy filing by crypto firm Voyager.","The FDIC later issued a cease-and-desist letter to Voyager, demanding “that the crypto brokerage firm Voyager Digital cease and desist from making false and misleading statements regarding its FDIC deposit insurance status and take immediate action to correct any such prior statements.\"","In the case of FTX US, the cease-and-desist letter cites a tweet from FTX US&nbsp; President Brett Harrison that claims direct deposits from employers to FTX and stocks are held in FDIC-insured accounts. It also calls out that <a class=\"c-link\" tabindex=\"-1\" href=\"http:\/\/smartasset.com\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"http:\/\/SmartAsset.com\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">SmartAsset.com<\/a> identifies FTX as an FDIC-insured exchange. The regulator says these statements appear to contain false and misleading representations that uninsured products are FDIC-insured.","\"These false and misleading statements represent or imply that FTX US is FDIC-insured, that funds deposited with FTX US are placed, and at all times remain, in accounts at unnamed FDIC-insured banks, that brokerage accounts at FTX US are FDIC-insured, and that FDIC insurance is available for cryptocurrency or stocks,\" the letter said. \"In fact, FTX US is not FDIC-insured, the FDIC does not insure any brokerage accounts, and FDIC insurance does not cover stocks or cryptocurrency.\"","The letter directs the firm to immediately remove any and all statements that suggest FTX US and any firms deposited with it are FDIC-insured. FTX.US has 15 days to provide written confirmation that it has complied with the requests, the FDIC's statement said.","Harrison <a href=\"https:\/\/twitter.com\/Brett_FTX\/status\/1560701320717369349\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">tweeted<\/a> following the announcement that \"[p]er the FDIC’s instruction I deleted the tweet. The tweet was written in response to questions raised on twitter regarding whether direct USD deposits from employers were held at insured banks (i.e. Evolve Bank).\"","\"We really didn’t mean to mislead anyone, and we didn’t suggest that FTX US itself, or that crypto\/non-fiat assets, benefit from FDIC insurance,\" Harrison continued. \"I hope this provides clarity on our intentions. Happy to work directly with the FDIC on these important topics.\"","\"We do not anticipate that there will be any impact on the business plans of FTX US as the cease and desist was limited to statements about FDIC insurance in a prior tweet that has since been deleted per FDIC request. We have notified the FDIC accordingly,\" a spokesperson for the firm later told The Block.","When reached for comment, SmartAsset CEO and co-founder Michael Carvin said: \"We are in communication with the FDIC to assess the matter and have removed the content at issue in the meantime.\"","The FDIC previously <a class=\"c-link\" href=\"https:\/\/www.theblock.co\/linked\/133406\/fdic-includes-evaluating-crypto-risks-on-2022-priorities-list\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.theblock.co\/linked\/133406\/fdic-includes-evaluating-crypto-risks-on-2022-priorities-list\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">included<\/a> evaluating crypto risks on its 2022 priorities list, and in October of last year, former chair Jelena McWilliams said the agency was focused on creating \"clear guidance\" for the intersection of crypto and banking.","However, the road has been rocky, according to accusations recently lobbed by US Senator Pat Toomey, R-Pa.","In an August 17 <a class=\"c-link\" href=\"https:\/\/www.theblock.co\/post\/164082\/senator-claims-the-fdic-is-stonewalling-banks-that-try-to-work-with-crypto?utm_source=rss&amp;utm_medium=rss\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.theblock.co\/post\/164082\/senator-claims-the-fdic-is-stonewalling-banks-that-try-to-work-with-crypto?utm_source=rss&amp;utm_medium=rss\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">letter<\/a> to acting FDIC chair Martin Gruenberg, Toomey said the agency \"may be improperly taking action to deter banks from doing business with lawful cryptocurrency-related (crypto-related) companies.\"","<em data-v-f87c67ca=\"\">This story is has been updated with body text and additional information.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Pa","content":"LOCATION"},{"type":"Harrison","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Pat Toomey","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Michael Carvin","content":"PERSON"},{"type":"Federal Deposit Insurance Corporation (FDIC","content":"ORGANIZATION"},{"type":"Voyager","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"August 17","content":"DATE"},{"type":"FDIC","content":"ORGANIZATION"},{"type":"Martin Gruenberg","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"i.e. Evolve Bank)","content":"ORGANIZATION"},{"type":"Brett Harrison","content":"PERSON"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"Toomey","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Jelena McWilliams","content":"PERSON"}],"hashtag":["FDIC"],"authors":["Michael McSweeney","Aislinn Keely","The Block"]}