{"summary":"Vitalik Buterin, the co-founder of Ethereum, has proposed a roadmap consisting of three transitions: Layer 2 scaling, wallet security enhancement, and privacy measures.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/233969\/vitalik-buterin-calls-for-three-mandatory-transitions-for-ethereum","publishDate":"2023-06-09T10:14:28","id":4029,"type":null,"title":"Buterin calls for three Ethereum &#x27;transitions&#x27;: L2 scaling, wallet security, and privacy","category":["CRYPTO ECOSYSTEMS"],"content":["Ethereum co-founder Vitalik Buterin laid out a <a href=\"https:\/\/vitalik.eth.limo\/general\/2023\/06\/09\/three_transitions.html\" data-v-f87c67ca=\"\">roadmap<\/a> in a blog post comprising three major technical transitions that he believes are needed to ensure the success of the Ethereum blockchain.","Buterin contends that these transitions – Layer 2 scaling, wallet security enhancement, and privacy measures – will be pivotal in preserving Ethereum’s decentralization and assuring its open and permissionless nature for all users.","According to Buterin, if these transitions fail to occur, the sustainability of Ethereum could be undermined.","The first one is scaling Layer 2s. In the last couple of years, Ethereum has rapidly witnessed the emergence of a Layer 2 ecosystem consisting of Optimistic Rollup and <a href=\"https:\/\/www.theblock.co\/post\/162098\/zk-rollups-likely-to-be-main-layer-2-solution-for-ethereum-says-vitalik-buterin\" data-v-f87c67ca=\"\">Zero Knowledge-Rollup solutions<\/a>. These solutions have helped reduce the cost of transactions, but since most activity still takes place on the main network, the L2 space still needs to mature and scale further.&nbsp;","Buterin warned that without Layer 2 scaling, Ethereum could face escalating transaction fees, particularly during market expansion phases or “bull runs.” This could push users towards centralized alternatives, he warned.","“Without the first [L2 scaling], Ethereum fails because each transaction costs $3.75 ($82.48 if we have another bull run), and every product aiming for the mass market inevitably forgets about the chain and adopts centralized workarounds for everything,” Buterin stated.","In his blog, Buterin further highlighted the importance of wallet security. He contended that potential security concerns could deter users from storing their funds on the Ethereum network, forcing them to opt for centralized exchanges instead.","\"Without the second [wallet security], Ethereum fails because users are uncomfortable storing their funds (and non-financial assets), and everyone moves onto centralized exchanges,\" Buterin said.","He suggested transitioning to smart contract wallets that support complex features like social recovery, similar to <a href=\"https:\/\/www.theblock.co\/post\/231411\/visa-taps-ethereums-goerli-testnet-to-experiment-with-account-abstraction\" data-v-f87c67ca=\"\">account abstraction<\/a>. According to Buterin, social recovery wallets would be necessary for improved security and user experience.","The Ethereum co-founder also emphasized the importance of privacy as the third transition. He expressed concern that without robust data privacy measures in place, users could be discouraged from using Ethereum. Buterin suggested implementing <a href=\"https:\/\/www.theblock.co\/post\/204524\/vitalik-buterin-proposes-stealth-addresses-to-enhance-ethereum-privacy\" data-v-f87c67ca=\"\">stealth address protocols<\/a> to provide privacy features for Ethereum users.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Buterin","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"$3.75","content":"MONEY"},{"type":"$82.48","content":"MONEY"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Buterin","content":"LOCATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}