{"summary":"Jump Crypto is using its high-frequency trading expertise to build a new open-source validator client for Solana known as Firedancer.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/204495\/jump-crypto-firedancer-project-optimize-solana-hft","publishDate":"2023-01-23T06:30:04","id":4035,"type":null,"title":"Here&#x27;s how Jump Crypto&#x27;s Firedancer project aims to optimize Solana for HFT","category":["LAYER 1S"],"content":["<span data-v-f87c67ca=\"\">Jump Crypto is using its high-frequency trading expertise to build a new open-source validator client for Solana known as <\/span><a href=\"https:\/\/jumpcrypto.com\/firedancer\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Firedancer<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">In a recent <\/span><a href=\"https:\/\/www.theblock.co\/post\/203199\/jump-crypto-president-unpacks-the-industrys-broken-capital-markets\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">episode<\/span><\/a><span data-v-f87c67ca=\"\"> of The Scoop podcast, Jump Crypto President Kanav Kariya explained Jump decided to build infrastructure on Solana because of the network's emphasis on performance.<\/span>","\"Given Solana's success, our participation in the ecosystem over a couple years, and the very specific technical challenges that they wanted to solve as it pertains to optimizing their network and runtime, it felt like a really great opportunity for us to come in and contribute,\" Kariya said.","<span data-v-f87c67ca=\"\">While Solana touts itself as a high-performance blockchain, over the last year it has suffered numerous outages that could have been prevented if there was a backup validator client such as Firedancer, according to Kariya.<\/span>","<span data-v-f87c67ca=\"\">In addition to improving Solana's resiliency, Firedancer is implemented in C\/C++ which optimizes the client for on-chain high-frequency trading (HFT) activity.<\/span>","While Solana's primary validator client is written in Rust, C and C++ are the most commonly used software languages in high-frequency trading because they are \"lower-level\" languages.","Because C and C++ have low-level access to the computer's hardware, it allows for more fine-tuned control and optimization of the client's performance. Additionally, C\/C++ allow for more efficient memory management and faster execution of code, which are crucial for high-frequency trading.","According to Kariya, Solana's high-performance design combined with the experience Jump's engineers have in building highly efficient systems made Firedancer an attractive opportunity for the firm.","\"Most folks don't understand this about high-frequency trading firms, but they're fundamentally great at a couple of different things: one is high-performance computing at scale… and then, 'how do we optimize our environment overall such that we can we can get as much juice for the squeeze?' — and the confluence of those two factors made it such that Firedancer was a pretty awesome opportunity for us.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kanav Kariya","content":"PERSON"},{"type":"Kariya","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Solana","content":"PERSON"}],"hashtag":["INVESTMENT FIRMS","SOLANA"],"authors":["Davis Quinton","Vishal Chawla","The Block"]}