{"summary":"As scrutiny on the crypto industry intensifies, boutique lobbying firms are influencing legislation and regulation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241239\/meet-9-under-the-radar-lobby-firms-fighting-for-crypto-on-the-hill-in-2023","publishDate":"2023-07-29T10:05:32","id":4036,"type":null,"title":"Meet nine under-the-radar lobbying firms fighting for crypto in Washington in 2023","category":["POLICY"],"content":["Crypto companies are preparing for a showdown in Washington as regulatory agencies such as the Securities and Exchange Commission and the Commodities Futures Trading Commission <a href=\"https:\/\/www.theblock.co\/post\/229070\/crypto-regulatory-crackdown-bloomberg\" data-v-f87c67ca=\"\">crack down<\/a> on crypto companies — while policymakers <a href=\"https:\/\/www.theblock.co\/post\/239210\/lummis-gillibrand-to-introduce-revised-comprehensive-crypto-bill\" data-v-f87c67ca=\"\">propose<\/a> competing ways to regulate the asset class.&nbsp;","Helping crypto companies to get what they want in this battle are lobbying and government affairs firms, which try to influence legislation, regulation and other government affairs on behalf of companies.","Last year was a banner year for crypto industry lobbying with total federal lobbying spending more than double that of 2021, according <a href=\"https:\/\/www.opensecrets.org\/news\/2023\/07\/crypto-industry-influence-on-regulation\" data-v-f87c67ca=\"\">to OpenSecrets<\/a>. This year the stakes are even higher as leading crypto exchanges Binance and Coinbase <a href=\"https:\/\/www.theblock.co\/post\/233270\/sec-sues-coinbase-binance\" data-v-f87c67ca=\"\">face<\/a> lawsuits from the SEC for the violation of securities laws. At the same time, the U.S. is <a href=\"https:\/\/www.theblock.co\/post\/236441\/meet-the-9-power-players-shaping-the-uks-growing-crypto-agenda\" data-v-f87c67ca=\"\">falling<\/a> behind other countries and regions such as the U.K. and the European Union, which are already making headway with the implementation of regulatory guidelines for crypto companies. Lobbying firms are looking to secure seats at the table for crypto companies to discuss these kinds of issues.","Meet the nine under-the-radar lobbying firms that have been working with digital assets firms this year. The list is based on publicly available lobbying disclosures but the data does not reflect the full extent of lobbying activity within the industry, as the <a href=\"https:\/\/lobbyingdisclosure.house.gov\/amended_lda_guide.html\" data-v-f87c67ca=\"\">Lobbying Disclosure Act<\/a> only classifies a small set of activities as lobbying. The dollar amounts displayed do not always reflect the total size of the contracts and the crypto client lists may include relationships that are no longer active.","<b data-v-f87c67ca=\"\">Lobbying spend by crypto clients in Q1 2023: <\/b>$70,000","<b data-v-f87c67ca=\"\">Crypto clients since 2021: <\/b>Chainalysis, Uniswap, FTX.US","<b data-v-f87c67ca=\"\">Total lobbying spend in Q1 2023:<\/b> $260,000","T Cap Solutions is a lobbying group led by Charlie Thornton, the <a href=\"https:\/\/www.cftc.gov\/PressRoom\/PressReleases\/8357-21\" data-v-f87c67ca=\"\">former<\/a> chief of staff and chief operating officer at the CFTC. Thornton worked under CFTC chairman Heath Tarbert, who <a href=\"https:\/\/www.theblock.co\/post\/233752\/circle-clo-cftc\" data-v-f87c67ca=\"\">recently<\/a> joined stablecoin provider Circle as its chief legal officer. Thornton <a href=\"https:\/\/www.cftc.gov\/PressRoom\/PressReleases\/8357-21\" data-v-f87c67ca=\"\">left<\/a> the regulatory agency in January 2021 and founded T Cap Solutions a month later.","The CFTC is a regulatory agency that’s been angling for more oversight of digital assets. The CFTC’s current chairman Rostin Behnam <a href=\"https:\/\/unchainedcrypto.com\/cftc-chair-behnam-tells-congress-implementing-new-crypto-rules-could-take-years\/\" data-v-f87c67ca=\"\">recently said<\/a> he supported efforts by the House of Representatives’ agriculture committee to provide the agency with additional authority to oversee digital assets.","Financial services industry watchdog Better Markets <a href=\"https:\/\/bettermarkets.org\/newsroom\/ftxs-penetration-of-the-cftc-by-a-revolving-door-hiring-spree-of-former-cftc-officials\/\" data-v-f87c67ca=\"\">criticized<\/a> the cozy relationship between the digital assets industry and the CFTC highlighting a “revolving door” hiring spree that took place between former CFTC officials and collapsed crypto exchange FTX, which was once a client of T Cap Solutions.","Thornton is the only individual listed as a lobbyist for T Cap Solutions on OpenSecrets and the firm has limited online presence. The lobby group’s <a href=\"https:\/\/www.linkedin.com\/in\/charlie-thornton-71515547\/\" data-v-f87c67ca=\"\">LinkedIn page<\/a> describes itself as a “full-service, financial services-focused government affairs firm.” Thornton also provided counsel services to Delta Strategy Group, another lobby group on this list, from 2013 to 2015, <a href=\"https:\/\/www.linkedin.com\/in\/charlie-thornton-71515547\/\" data-v-f87c67ca=\"\">per LinkedIn<\/a>.","<i data-v-f87c67ca=\"\">Data provided by <\/i><a href=\"https:\/\/www.opensecrets.org\/federal-lobbying\/firms\/summary?id=F323823&amp;year=2022\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">OpenSecrets<\/i><\/a><i data-v-f87c67ca=\"\"> and <\/i><a href=\"https:\/\/projects.propublica.org\/represent\/lobbying\/search?utf8=%E2%9C%93&amp;search=T+Cap+Solutions&amp;commit=Search&amp;firmonly=1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">ProPublica<\/i><\/a>.","<b data-v-f87c67ca=\"\">Lobbying spend by crypto clients in Q1 2023: <\/b>$50,000","<b data-v-f87c67ca=\"\">Crypto clients since 2020: <\/b>Crypto.com, Chamber of Digital Commerce","<b data-v-f87c67ca=\"\">Total lobbying spend in Q1 2023:<\/b> $120,000","Delta Strategy Group is a government affairs firm that is also made up of former CFTC heavyweights. The firm was founded in 2010 by James Newsome, a former chairman of the CFTC, and Scott Parsons, a former chief operating officer of the CFTC and the CEO of NYMEX. The firm’s partners Kevin Batteh and James Overdahl both served in roles at the CFTC as well as for other regulatory agencies such as the UK’s Financial Conduct Authority and the SEC respectively.","“I think the big differentiator for us is that in 2013 no one in DC really knew what this stuff was,” Batteh, who started following bitcoin in 2012, said in an email. “We had already gotten our hands dirty using it, and (relative to others in the regulatory strategy and lobbying space) had a deep understanding of the technology. We have grown up with the industry and worked hand and hand with clients as they have built their companies from the ground up.”","The group also has a long track record serving as advisors to traditional exchanges and funds, Batteh said. Two of Delta Strategy Group’s traditional clients, <a href=\"https:\/\/www.coindesk.com\/business\/2022\/06\/07\/citadel-is-building-a-crypto-trading-marketplace-with-virtu-financial-sources\/\" data-v-f87c67ca=\"\">Citadel<\/a> and <a href=\"https:\/\/www.coindesk.com\/business\/2022\/09\/16\/two-sigma-ventures-raises-400m-for-two-funds-plans-crypto-investments\/\" data-v-f87c67ca=\"\">Two Sigma<\/a>, have made forays into the digital assets world through investments.","“Every year we see an increasing sophistication in our clients’ approach to DC and lobbying,” Batteh said. One of the top agenda issues for their firms this year is getting digital asset market structure legislation across the finish line, he added.","“Today many companies in the space have lobbying efforts and resources that are comparable to large traditional corporations,” he said.","<i data-v-f87c67ca=\"\">Data provided by <\/i><a href=\"https:\/\/www.opensecrets.org\/federal-lobbying\/firms\/summary?id=D000064231\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">OpenSecrets<\/i><\/a><i data-v-f87c67ca=\"\"> and <\/i><a href=\"https:\/\/projects.propublica.org\/represent\/lobbying\/search?utf8=%E2%9C%93&amp;search=delta+strategy+group&amp;commit=Search&amp;firmonly=1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">ProPublica<\/i><\/a>.","<b data-v-f87c67ca=\"\">Lobbying spend by crypto clients in Q1 2023:&nbsp; <\/b>$280,000","<b data-v-f87c67ca=\"\">Crypto clients since 2020:<\/b> Ava Labs, Anchorage Digital, BankWyse, BAM Trading Services (Binance.US), Block Inc, Chamber of Digital Commerce, Dapper Labs, Ripple, Orchid Labs, Meta (Facebook)","<b data-v-f87c67ca=\"\">Total lobbying spend in Q1 2023: <\/b>$1 million","Just like Delta Strategy Group, FS Vector is another OG in the crypto lobbying space. In 2019, Meta <a href=\"https:\/\/cointelegraph.com\/app\/public\/index.php\/news\/facebook-hires-lobbying-firm-to-ease-regulatory-pressure-on-libra\/amp\" data-v-f87c67ca=\"\">hired<\/a> FS Vector to lobby for its now disbanded stablecoin project Libra. FS Vector has a strong understanding of the stablecoin landscape in the U.S. as its co-founder and CEO John Beccia previously worked as the general counsel and chief compliance officer for leading stablecoin provider Circle.","Since 2019, FS Vector has quietly built out an impressive roster of crypto clients as well as clients in the fintech space. In a statement to The Block, it describes itself as being “at the forefront of novel public policy issues stemming from applications of cutting edge technologies in financial services.”","<i data-v-f87c67ca=\"\">Data provided by <\/i><a href=\"https:\/\/www.opensecrets.org\/federal-lobbying\/firms\/summary?cycle=2023&amp;id=D000095111\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">OpenSecrets<\/i><\/a><i data-v-f87c67ca=\"\"> and <\/i><a href=\"https:\/\/projects.propublica.org\/represent\/lobbying\/search?utf8=%E2%9C%93&amp;search=fs+vector&amp;commit=Search&amp;firmonly=1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">ProPublica<\/i><\/a><i data-v-f87c67ca=\"\">.&nbsp;<\/i>","<b data-v-f87c67ca=\"\">Lobbying spend by crypto clients in Q1 2023: <\/b>$435,000","<b data-v-f87c67ca=\"\">Crypto clients since 2020:<\/b> Crypto Council for Innovation, Dapper Labs, Gemini Trust Co, Robinhood Markets, Silvergate Bank, NYDIG, Meta (Facebook), Coin Center","<b data-v-f87c67ca=\"\">Total lobbying spend in Q1 2023: <\/b>$1.23 million","Sternhell Group is another firm that lobbied for Meta’s Libra project in 2019 and continues to maintain a relationship with the social network on digital assets policy to this day. Founded in 2009, Sternhell Group is a firm that has its roots in traditional finance and then developed a speciality in crypto, said Alexander Sternhell, who founded the firm and previously worked as a staffer on the Senate Banking Committee.","The firm was an early adopter of digital assets in Washington, helping to contribute to the setup of advocacy non-profit Coin Center in 2014.","“My shop is an established financial services policy shop,” Sternhell said. “And as more and more legislative and regulatory issues started to emerge with respect to crypto, I had developed an area of expertise with respect to bitcoin and crypto and as a result that's why I think we were a logical choice [for clients].”","In recent years, there’s been a significant uptick in activity around digital assets policy issues, Sternhell said. This year there has been a really hard push to enact legislation, he added.&nbsp;","“I think the arguments that have been made regarding a lack of clarity have resonated with a lot of legislators,” Sternhell said. “There really is a significant amount of activity and focus on creating a new set of laws that would impact the industry and the ecosystem in general.”","<i data-v-f87c67ca=\"\">Data provided by <\/i><a href=\"https:\/\/www.opensecrets.org\/federal-lobbying\/firms\/summary?id=D000057188\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">OpenSecrets<\/i><\/a><i data-v-f87c67ca=\"\"> and <\/i><a href=\"https:\/\/projects.propublica.org\/represent\/lobbying\/search?utf8=%E2%9C%93&amp;search=sternhell+group&amp;commit=Search&amp;firmonly=1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">ProPublica<\/i><\/a>.&nbsp;","<span data-v-f87c67ca=\"\">Tiger Hill Partners team photo. Image: Tiger Hill Partners.<\/span>","<b data-v-f87c67ca=\"\">Lobbying spend by crypto clients in Q1 2023: <\/b>$190,000<b data-v-f87c67ca=\"\">&nbsp;<\/b>","<b data-v-f87c67ca=\"\">Crypto clients since 2020:<\/b> Bitwise, Coinbase, Polygon Labs, Proof of Stake Alliance, Figure Technologies, Alternative Investment Management Association","<b data-v-f87c67ca=\"\">Total lobbying spend in Q1 2023: <\/b>$610,000","Tiger Hill Partners is relatively new on the lobbying scene, having been founded in 2019. Its first digital asset client came in 2021 when the company was retained by Coinbase. It’s become known on the Hill for its “hands-on approach, federal securities laws expertise, and relationships with the leadership at the SEC, CFTC, and other Biden Administration agencies,” said Milan Dalal, the firm’s co-founder in an email to The Block.","Dalal, who previously worked as staff director of the Senate Banking Subcommittee on Securities, Insurance, and Investment, co-founded Tiger Hill Partners with James Maloney, who worked as a senior member of the financial communications and capital markets practice at public relations firm Edelman. Dalal organized the first hearing that the Senate Banking Committee held on digital assets in 2013 while serving as senior Senate staffer.","“Our technical proficiency and forward-thinking approaches have also allowed us to become trusted advisors to policymakers in Congress, at the SEC, and at the CFTC,” Dalal said.","Over the years clients have become increasingly sophisticated and grounded in the reality of Washington, which often requires incremental progress, Dalal said. A key priority for digital assets firms this year is seeking clarity either through the regulatory or legislative process, he added.","“The industry has a desire to comply with the law, but they need to know how the law applies,” he said.","<i data-v-f87c67ca=\"\">Data provided by <\/i><a href=\"https:\/\/www.opensecrets.org\/federal-lobbying\/firms\/summary?id=D000095114\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">OpenSecrets<\/i><\/a><i data-v-f87c67ca=\"\"> and <\/i><a href=\"https:\/\/projects.propublica.org\/represent\/lobbying\/search?utf8=%E2%9C%93&amp;search=tiger+hill+partners&amp;commit=Search&amp;firmonly=1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">ProPublica<\/i><\/a>.&nbsp;","<b data-v-f87c67ca=\"\">Lobbying spend by crypto clients in Q1 2023: <\/b>$190,000","<b data-v-f87c67ca=\"\">Crypto clients since 2020: <\/b>&nbsp;Algorand, Coinbase, Opensea, Block Inc, Solve.care","<b data-v-f87c67ca=\"\">Total lobbying spend in Q1 2023: <\/b>$1.24 million","Lobby firm Franklin Square Group has been a favorite amongst big technology players such as Apple and Alphabet but in recent years it has also acquired a subset of crypto clients.","Founded in 2008 by Josh Ackil and Matt Tanielian, who both started their careers in the technology industry, Franklin Square Group is designed with the same startup culture and mentality that its clients operate with. It looks to address policy issues and manage the disruption often caused by innovative startups and multinational technology companies, according to its <a href=\"https:\/\/franklinsquaregroup.com\/team\/josh-ackil\/\" data-v-f87c67ca=\"\">website<\/a>.","<i data-v-f87c67ca=\"\">Data provided by <\/i><a href=\"https:\/\/www.opensecrets.org\/federal-lobbying\/firms\/summary?id=D000051077\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">OpenSecrets<\/i><\/a><i data-v-f87c67ca=\"\"> and <\/i><a href=\"https:\/\/projects.propublica.org\/represent\/lobbying\/search?utf8=%E2%9C%93&amp;search=franklin+square+group&amp;commit=Search&amp;firmonly=1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">ProPublica<\/i><\/a><i data-v-f87c67ca=\"\">.&nbsp;<\/i>","<span data-v-f87c67ca=\"\">Quincy Enoch, who co-leads Invariant's financial service and tax practice. Image: Invariant.<\/span>","<b data-v-f87c67ca=\"\">Lobbying spend by crypto clients in Q1 2023:<\/b> $420,000&nbsp;","<b data-v-f87c67ca=\"\">Crypto clients since 2020: <\/b>Kraken (Payward), Circle, Web 3 Technology Fund, Taxbit, Coinflip, Flexa Network","<b data-v-f87c67ca=\"\">Total lobbying spend in Q1 2023: <\/b>$9.65 million","Provocative is one of the many adjectives that lobby group Invariant uses to describe itself on its website. It tells prospective clients that “in DC, you are either at the table or on the menu.”&nbsp;","Founded in 2007 by former congressional aide Heather Podesta, Invariant is a lobby group that serves the widest range of clients out of the firms on this list. Podesta has frequently been named one of Washington’s most powerful players and despite her fierce reputation, her firm still retains a sense of humor with phrases on its website such as “Think you have the stomach for Washington?” <a href=\"http:\/\/www.invariantgr.com\/connect.html\" data-v-f87c67ca=\"\">overlaid<\/a> on a picture of an indigestion shelf at a pharmacy.","The firm started looking at crypto in 2020, building upon an already “very robust fintech practice,” and then started its policy work for crypto clients in January 2021, said Quincy Enoch, who co-leads Invariant's financial service and tax practice. He added that crypto clients come to Invariant because it offers a turnkey government relations function immediately as well as being&nbsp; able to counsel clients on everything from tax to privacy to trade issues and communication strategies.","Over the past year, the education level around digital assets in Congress has accelerated, Enoch said. “In the past, like the general public, Congress gathered much of its information about crypto from news headlines,” he added.","“Now Congress is debating the regulatory framework that will provide rules of the road, protect consumers, and help the innovations brought by blockchain reach their full potential,” he said.","<i data-v-f87c67ca=\"\">Data provided by <\/i><a href=\"https:\/\/www.opensecrets.org\/federal-lobbying\/firms\/summary?cycle=2023&amp;id=d000034396\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">OpenSecrets<\/i><\/a><i data-v-f87c67ca=\"\"> and <\/i><a href=\"https:\/\/projects.propublica.org\/represent\/lobbying\/search?commit=Search&amp;fields%5B%5D=lobbying_registrant_name&amp;firmonly=1&amp;page=6&amp;search=invariant+llc&amp;utf8=%E2%9C%93\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">ProPublica<\/i><\/a><i data-v-f87c67ca=\"\">.&nbsp;<\/i><b data-v-f87c67ca=\"\"><\/b>","<span data-v-f87c67ca=\"\">Co-founders Andrew Eck, on the left, and Michael DiRoma, on the right. Image: DiRoma, Eck &amp; Co.<\/span>","<b data-v-f87c67ca=\"\">Lobbying spend by crypto clients in Q1 2023: <\/b>$90,000","<b data-v-f87c67ca=\"\">Crypto clients since 2020:<\/b> Chainalysis, Marathon Digital Holdings, Uniswap Labs","<b data-v-f87c67ca=\"\">Total lobbying spend in Q1 2023:<\/b> $190,000","DiRoma, Eck &amp; Co is a boutique government affairs firm founded by Michael DiRoma and Andrew Eck. Despite being one of the newer firms on the Hill, the organization has already accumulated several crypto clients, which Eck attributes to the unique political analysis and policy perspectives gained from the founders’ time holding senior positions in the House and Senate, and at the Treasury Department.&nbsp;","In recent years, the digital assets policy space has shifted dramatically, said Eck in an email to The Block. Primary committees on the Hill are now focused on providing clarity for the industry and its consumers through legislation, he added.","“FTX quite obviously did a lot of damage to the reputation of an industry that had advanced rather quickly in ‘Washington time,’” Eck said. “But this year could have been a lot worse than it actually is so far in terms of legislative progress.”","“The opportunity for credible actors to make the case on the Hill still exists, albeit with much more scrutiny, and for that we should be grateful,” he added.","<i data-v-f87c67ca=\"\">Data provided by <\/i><a href=\"https:\/\/www.opensecrets.org\/federal-lobbying\/firms\/summary?id=F321551\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">OpenSecrets<\/i><\/a><i data-v-f87c67ca=\"\"> and <\/i><a href=\"https:\/\/projects.propublica.org\/represent\/lobbying\/search?utf8=%E2%9C%93&amp;search=DiRoma%2C+Eck+%26+Co&amp;commit=Search&amp;firmonly=1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">ProPublica<\/i><\/a>.&nbsp;<b data-v-f87c67ca=\"\"><\/b>","<b data-v-f87c67ca=\"\">Lobbying spend by crypto clients in Q1 2023: <\/b>$270,000","<b data-v-f87c67ca=\"\">Crypto clients since 2020:<\/b> Aave, Block Inc, ConsenSys, Defi Education Fund, Dydx, Grayscale Investments, Polygon Labs, Paradigm Operations","<b data-v-f87c67ca=\"\">Total lobbying spend in Q1 2023: <\/b>$4.78 million","Subject Matter describes itself as “a creative advocacy agency.” It has become a favorite amongst crypto companies in the decentralized finance space. The lobby firm recently <a href=\"https:\/\/www.prnewswire.com\/news-releases\/subject-matter-and-kivvit-combine-to-create-national-communications-and-advocacy-powerhouse-301811678.html#:~:text=WASHINGTON%2C%20May%201%2C%202023%20%2F,services%20into%20a%20single%20integrated\" data-v-f87c67ca=\"\">joined<\/a> forces with Kivvit to create a national agency focused on strategic communications, data insights, government relations, digital strategy, creative content and advertising services.","Subject Matter itself was the result of <a href=\"https:\/\/www.politico.com\/story\/2015\/09\/elmendorf-ryan-home-front-communications-213832\" data-v-f87c67ca=\"\">a merger<\/a> between lobbying powerhouse Elmendorf Ryan and communications firm Home Front Communications. The founding partners of Subject Matter are Steve Elmendorf, Jimmy Ryan, Paul Frick and Dan Sallick.","<i data-v-f87c67ca=\"\">Data provided by<\/i><a href=\"https:\/\/www.opensecrets.org\/federal-lobbying\/firms\/summary?cycle=2023&amp;id=D000067802\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\"> OpenSecrets<\/i><\/a><i data-v-f87c67ca=\"\"> and <\/i><a href=\"https:\/\/projects.propublica.org\/represent\/lobbying\/search?utf8=%E2%9C%93&amp;search=subject+matter&amp;commit=Search&amp;firmonly=1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">ProPublica<\/i><\/a>.<i data-v-f87c67ca=\"\">&nbsp;<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Steve Elmendorf","content":"PERSON"},{"type":"Franklin Square Group","content":"ORGANIZATION"},{"type":"Commodities Futures Trading Commission","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"January 2021","content":"DATE"},{"type":"Block Inc","content":"ORGANIZATION"},{"type":"Dan Sallick","content":"PERSON"},{"type":"$260,000","content":"MONEY"},{"type":"FS Vector","content":"ORGANIZATION"},{"type":"Uniswap Labs","content":"ORGANIZATION"},{"type":"$270,000","content":"MONEY"},{"type":"$120,000","content":"MONEY"},{"type":"” Batteh","content":"PERSON"},{"type":"” Dalal","content":"ORGANIZATION"},{"type":"$90,000","content":"MONEY"},{"type":"Kivvit","content":"PERSON"},{"type":"Elmendorf Ryan","content":"PERSON"},{"type":"$610,000","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"Eck","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Eck &amp; Co","content":"ORGANIZATION"},{"type":"Marathon Digital Holdings","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$420,000","content":"MONEY"},{"type":"Alexander Sternhell","content":"PERSON"},{"type":"$1 million","content":"MONEY"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"$9.65 million","content":"MONEY"},{"type":"Paradigm Operations","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"2014","content":"DATE"},{"type":"2015","content":"DATE"},{"type":"Silvergate Bank","content":"ORGANIZATION"},{"type":"2010","content":"DATE"},{"type":"Robinhood Markets","content":"ORGANIZATION"},{"type":"2012","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"Crypto Council for Innovation","content":"ORGANIZATION"},{"type":"Dapper Labs","content":"ORGANIZATION"},{"type":"Coinbase","content":"LOCATION"},{"type":"Michael DiRoma","content":"ORGANIZATION"},{"type":"Tiger Hill Partners","content":"ORGANIZATION"},{"type":"James Overdahl","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"$1.23 million","content":"MONEY"},{"type":"Figure Technologies","content":"ORGANIZATION"},{"type":"Senate Banking Subcommittee on Securities","content":"ORGANIZATION"},{"type":"$280,000","content":"MONEY"},{"type":"UK’s Financial Conduct Authority","content":"ORGANIZATION"},{"type":"Dydx","content":"LOCATION"},{"type":"Rostin Behnam","content":"PERSON"},{"type":"Gemini Trust Co","content":"ORGANIZATION"},{"type":"Biden Administration","content":"ORGANIZATION"},{"type":"2007","content":"DATE"},{"type":"2008","content":"DATE"},{"type":"2009","content":"DATE"},{"type":"Home Front Communications","content":"ORGANIZATION"},{"type":"Heather Podesta","content":"PERSON"},{"type":"Josh Ackil","content":"PERSON"},{"type":"Anchorage Digital","content":"ORGANIZATION"},{"type":"Thornton","content":"PERSON"},{"type":"House of Representatives’","content":"ORGANIZATION"},{"type":"Batteh","content":"PERSON"},{"type":"NYMEX","content":"ORGANIZATION"},{"type":"$50,000","content":"MONEY"},{"type":"Paul Frick","content":"PERSON"},{"type":"James Newsome","content":"PERSON"},{"type":"Proof of Stake Alliance","content":"ORGANIZATION"},{"type":"Sternhell Group","content":"ORGANIZATION"},{"type":"$190,000","content":"MONEY"},{"type":"Charlie Thornton","content":"PERSON"},{"type":"$1.24 million","content":"MONEY"},{"type":"Alternative Investment Management Association","content":"ORGANIZATION"},{"type":"Dalal","content":"PERSON"},{"type":"Coinflip","content":"LOCATION"},{"type":"Chamber of Digital Commerce","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"James Maloney","content":"PERSON"},{"type":"House","content":"ORGANIZATION"},{"type":"Ava Labs","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Citadel","content":"ORGANIZATION"},{"type":"Circle","content":"ORGANIZATION"},{"type":"Sternhell","content":"PERSON"},{"type":"Andrew Eck","content":"PERSON"},{"type":"Heath Tarbert","content":"PERSON"},{"type":"DiRoma, Eck &amp; Co.","content":"ORGANIZATION"},{"type":"Senate","content":"ORGANIZATION"},{"type":"Matt Tanielian","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Vector","content":"ORGANIZATION"},{"type":"Bitwise","content":"ORGANIZATION"},{"type":"Coin Center","content":"ORGANIZATION"},{"type":"Grayscale Investments","content":"ORGANIZATION"},{"type":"U.K.","content":"LOCATION"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"$435,000","content":"MONEY"},{"type":"Edelman","content":"PERSON"},{"type":"Jimmy Ryan","content":"PERSON"},{"type":"$4.78 million","content":"MONEY"},{"type":"BAM Trading Services","content":"ORGANIZATION"},{"type":"Senate Banking Committee","content":"ORGANIZATION"},{"type":"Scott Parsons","content":"PERSON"},{"type":"Milan Dalal","content":"ORGANIZATION"},{"type":"European Union","content":"LOCATION"},{"type":"Washington","content":"LOCATION"},{"type":"Michael DiRoma","content":"PERSON"},{"type":"Quincy Enoch","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Defi Education Fund","content":"ORGANIZATION"},{"type":"Taxbit","content":"LOCATION"},{"type":"Enoch","content":"PERSON"},{"type":"Uniswap","content":"LOCATION"},{"type":"Kevin Batteh","content":"PERSON"},{"type":"Delta Strategy Group","content":"ORGANIZATION"},{"type":"$70,000","content":"MONEY"},{"type":"Flexa Network","content":"ORGANIZATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Polygon Labs","content":"ORGANIZATION"},{"type":"Opensea","content":"LOCATION"},{"type":"John Beccia","content":"PERSON"}],"hashtag":[],"authors":["Kari McMahon","The Block"]}