{"summary":"The Commodity Futures Trading Commission charged Voyager co-founder Stephen Ehrlich with fraud and failing to register with the agency.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/256200\/cftc-charges-voyager-co-founder-stephen-ehrlich-with-fraud","publishDate":"2023-10-12T13:29:36","id":4041,"type":null,"title":"CFTC charges Voyager co-founder Stephen Ehrlich with fraud","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Commodity Futures Trading Commission charged Voyager Digital co-founder Stephen Ehrlich with fraud and for failing to register with the agency.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Ehrlich and his firm lied to customers, and then, when Voyager began to collapse, kept lying in an effort to hide the crypto lender's true financial health, the CFTC said.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">\"While representing they would treat customers’ digital asset commodities safely and responsibly, behind the scenes, they took shockingly reckless risks with their customers’ assets, leading to Voyager's bankruptcy and huge customer losses,\" CFTC Enforcement Director Ian McGinley in a <a href=\"http:\/\/statement\/\" data-v-f87c67ca=\"\"><span class=\"s4\" data-v-f87c67ca=\"\">statement<\/span><\/a> on Thursday.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">From February 2022 to July 2022, Ehrlich and Voyager \"engaged in a scheme to defraud customers by misrepresenting the safety and financial health of the Voyager digital asset platform,\" the agency said.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">Ehrlich promised customers high-yield returns, sometimes as much as 12 percent, and in an effort to generate that income to pay customers the returns, Ehrlich and Voyager pooled together customer funds and transferred \"billions of dollars’ worth of customers’ digital asset commodities as 'loans' to high-risk third parties,\" the CFTC alleged.<\/span>","In a parallel <a href=\"https:\/\/www.ftc.gov\/news-events\/news\/press-releases\/2023\/10\/ftc-reaches-settlement-crypto-company-voyager-digital-charges-former-executive-falsely-claiming\" data-v-f87c67ca=\"\">action<\/a>, the Federal Trade Commission announced a settlement with Voyager on Thursday, permanently banning it from handling consumer assets.","The FTC also charged Ehrlich for lying about whether customer accounts were insured by the Federal Deposit Insurance Corporation when they were not.","Ehrlich has not agreed to a settlement with the FTC, so that case against him will go forward in federal court.&nbsp;","Ehrlich said the government's claims left him feeling outraged and dismayed.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">\"I am profoundly upset by the losses suffered by Voyager’s customers and creditors due to the conduct of others in the crypto industry,\" Ehrlich said in an emailed statement. \"I am currently reviewing the government’s claims, but it is clear I am being used as a scapegoat for the bad actions of others. I look forward to vindication in court.\"<\/span>","CFTC Commissioners also weighed in on Thursday on the lawsuit against Ehrlich.&nbsp;","Commissioner Caroline Pham warned of a possible overreach.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">\"However, I caution that the CFTC’s interpretation of a commodity pool operator in this enforcement action would seem to include commonplace lending activity—like taking deposits and providing loans,\" Pham said in a statement. \"Such an interpretation is an overreach beyond our statutory authority and would disrupt well-established legal and regulatory frameworks for lending to institutions and consumer finance.\"<\/span>","Commissioner Kristin Johnson said the case embodied risks for customers, including \"asymmetries of information.\"","<span class=\"s1\" data-v-f87c67ca=\"\">\"Digital assets are currently in a uniquely opaque market with inherently more information asymmetries,\" Johnson said. \"Customers entering digital asset transactions in the current market have exceptionally limited information about the assets that they purchase or the individuals and firms that customers may rely on to offer advice or execute transactions.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The CFTC action comes a week after <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-10-06\/us-cftc-weighs-penalizing-bankrupt-crypto-lender-voyager-s-ex-ceo?srnd=markets-vp&amp;sref=y3YMCJ4e\" data-v-f87c67ca=\"\"><span class=\"s4\" data-v-f87c67ca=\"\">Bloomberg News<\/span><\/a> reported that investigators at the agency had <a href=\"https:\/\/www.theblock.co\/post\/255226\/cftc-weighs-enforcement-actions-against-voyager-ex-ceo-bloomberg\" data-v-f87c67ca=\"\"><span class=\"s4\" data-v-f87c67ca=\"\">concluded<\/span><\/a> that Ehrlich broke rules ahead of the crypto lender's bankruptcy last week.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">CFTC staff in its enforcement division recommended internally that the agency accuse Ehrlich of breaking derivatives rules by misleading customers about the safety of their assets following an investigation, according to Bloomberg.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Last week, Ehrlich said that the Voyager team worked hard with integrity and within the regulatory framework in place at the time.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"I am profoundly upset by the losses suffered by Voyager’s customers and creditors due to the actions of others in the crypto industry. Plainly said, we were all scammed together,\" Ehrlich said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The crypto lender filed for Chapter 11 <a href=\"https:\/\/www.theblock.co\/post\/155990\/crypto-broker-voyager-digital-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\"><span class=\"s4\" data-v-f87c67ca=\"\">bankruptcy<\/span><\/a> protection over a year ago following an extended period of volatility in the industry. The downturn was sparked in May 2022 with the collapse of the Terra blockchain — which wiped $40 billion in value off the market.&nbsp;<\/span>","<em data-v-f87c67ca=\"\">Updated at 10 a.m. ET to include quotes from CFTC commissioners and Ehrlich<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"12 percent","content":"PERCENT"},{"type":"CFTC Commissioners","content":"ORGANIZATION"},{"type":"Ian McGinley","content":"PERSON"},{"type":"Pham","content":"PERSON"},{"type":"Stephen Ehrlich","content":"PERSON"},{"type":"February 2022","content":"DATE"},{"type":"Federal Trade Commission","content":"ORGANIZATION"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"Kristin Johnson","content":"PERSON"},{"type":"May 2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Ehrlich","content":"PERSON"},{"type":"\"billions of dollars","content":"MONEY"},{"type":"$40 billion","content":"MONEY"},{"type":"10 a.m.","content":"TIME"},{"type":"Federal Deposit Insurance Corporation","content":"ORGANIZATION"},{"type":"Johnson","content":"PERSON"},{"type":"Caroline Pham","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"FTC","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Terra","content":"ORGANIZATION"},{"type":"July 2022","content":"DATE"},{"type":"Bloomberg News","content":"ORGANIZATION"}],"hashtag":["CFTC","FTC"],"authors":["Sarah Wynn","The Block"]}