{"summary":"The Proof of Stake Alliance has added Coinbase Custody and Bison Trails to its members’ list\nThe alliance aims to educate lawmakers and bring regulatory and tax clarity for PoS tokens\nMatt Perona, COO of Polychain Capital and board member of POSA, told The Block: “Our main focus currently is on the tax treatment of staking rewards for token holders.”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/54511\/coinbase-custody-and-bison-trails-join-proof-of-stake-alliance-seeking-to-bring-tax-clarity","publishDate":"2020-01-30T09:01:11","id":405,"type":null,"title":"Coinbase Custody and Bison Trails join Proof of Stake Alliance, seeking to bring tax clarity","category":["Layer 1s"],"content":["The Proof of Stake Alliance (POSA) - a group of organizations dedicated to educating U.S. regulators on blockchains - has expanded its membership.","Coinbase Custody and Libra Association member Bison Trails have joined POSA, bringing the total number of members at the alliance to <a href=\"https:\/\/www.proofofstakealliance.org\/#home-about\" data-v-f87c67ca=\"\">18<\/a>. Other members include Tezos, Polychain Capital, Cardano Foundation and more.","They all hope to bring regulatory and tax clarity for Proof of Stake blockchains such as Tezos and Cosmos. <a href=\"https:\/\/www.theblockcrypto.com\/linked\/20435\/vitalik-upcoming-eth-pos-algorithm-will-adopt-higher-staking-rewards\" data-v-f87c67ca=\"\">Ethereum<\/a> is also planned to transit from a proof-of-work mechanism to a proof-of-stake system later this year.","“Proof of Stake is an increasingly important innovation that the crypto space as a whole is rapidly trending toward,” said Sam Mcingvale, CEO of Coinbase Custody. “It’s our hope that through the work of organizations like POSA, we’ll start to see meaningful conversations and, in time, clarity when it comes to POS and its applications.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nCoinbase Custody <a href=\"https:\/\/www.theblockresearch.com\/a-look-at-coinbase-custody-and-its-staking-service-30401\" data-v-f87c67ca=\"\">launched<\/a> staking services for Tezos last April for institutional clients and recently <a href=\"https:\/\/www.theblockcrypto.com\/linked\/48086\/coinbase-custody-expands-tezos-staking-service-to-all-global-clients\" data-v-f87c67ca=\"\">expanded<\/a> the service to all global clients. Just yesterday, Coinbase Custody also launched a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/54416\/coinbase-spins-up-new-custody-business-in-ireland-to-service-european-clients\" data-v-f87c67ca=\"\">new unit<\/a> in Ireland to better meet the needs of clients based in Europe.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">Educating lawmakers and bringing clarity&nbsp;<\/strong>","<a href=\"https:\/\/www.theblockcrypto.com\/post\/34280\/blockchain-projects-form-association-to-demystify-the-technology-for-us-lawmakers\" data-v-f87c67ca=\"\">Founded<\/a> last August, POSA has so far engaged with over 20 congressional offices educating them on proof-of-stake systems and their potential use cases, Matt Perona, COO of Polychain Capital and board member of POSA, told The Block.","The alliance's first priority is to have tax clarity for PoS tokens, such as their staking rewards. “Our main focus currently is on the tax treatment of staking rewards for token holders,” Perona told The Block.","POSA is advocating for a taxable event when PoS tokens are sold or exchanged and not when they are created. POSA worked with Abraham Sutherland, an adjunct professor at the University of Virginia School of Law, to prepare <a href=\"https:\/\/poseidon01.ssrn.com\/delivery.php?ID=550083013021095028092126088110121109019053019081050000104122065004027104095114099007032035042036057108108082067126115005116007107011054000040116112104122125110031087001059076065074107004121094026064066016002107082000001024088011065122065100108077121127&amp;EXT=pdf\" data-v-f87c67ca=\"\">tax notes<\/a>.","“Including proof-of-stake cryptocurrency block rewards in gross income when the reward tokens are first created results in inequitable taxation and would discourage U.S. taxpayers from participating in this new technology,” said Sutherland in the notes. \"The better approach is to tax reward tokens when they are sold or exchanged.”","As for regulatory clarity, POSA is looking for guidance from the U.S. Securities and Exchange Commission (SEC) that a “delegation relationship (if structured correctly) between a token holder and a validator is not considered a securities offering,” Perona told The Block.","The alliance has also had initial meetings with the SEC, the Internal Revenue Service (IRS), the Department of Treasury and the Commodity Futures Trading Commission (CFTC), said Perona.","He concluded that tax and regulatory clarities are “critical” to the success of the staking industry."],"hashtag":["STAKING"]}