{"summary":"Securities and Exchange Commission Chair Gary Gensler has a few tips for crypto investors, offering up &quot;some things to keep in mind.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/270925\/gary-gensler-warns-of-volatile-risky-crypto-assets-as-industry-waits-for-potential-spot-bitcoin-etf-approval","publishDate":"2024-01-08T11:16:10","id":4052,"type":null,"title":"Gary Gensler warns of volatile, risky crypto assets as industry waits for potential spot bitcoin ETF approval","category":["COMPANIES"],"content":["Securities and Exchange Commission Chair Gary Gensler has a few tips for crypto investors, offering up \"some things to keep in mind\" as the broader market eagerly awaits any news from the regulator about whether or not it will approve the dozen applications its received for the first spot bitcoin ETF.&nbsp;","\"Investments in crypto assets also can be exceptionally risky &amp; are often volatile,\" he <a href=\"https:\/\/twitter.com\/GaryGensler\/status\/1744383655999385967\" data-v-f87c67ca=\"\">wrote in a post<\/a> on X. \"A number of major platforms &amp; crypto assets have become insolvent and\/or lost value. Investments in crypto assets continue to be subject to significant risk.\"","While Gensler didn't mention any of the proposed ETFs, the timing of his thread on X quickly raised eyebrows in crypto circles as his comments came <a href=\"https:\/\/www.theblock.co\/post\/270834\/spot-bitcoin-etf-applicants-file-amended-s-1-forms-in-final-step-toward-approval\" data-v-f87c67ca=\"\">just hours<\/a> after asset managers including BlackRock, Ark Invest\/21Shares, VanEck, WisdomTree, Invesco, Fidelity and Valkyrie filed amended S-1 forms for their proposed funds in what was widely seen as a final move ahead of possible approval.&nbsp;","After exchanges including Nasdaq, the NYSE and Cboe filed amended 19b-4 forms on Friday, the ball is now in the SEC's court. If those forms are approved, trading can begin once the S-1 forms become \"effective\" in a <a href=\"https:\/\/www.theblock.co\/post\/270765\/heres-how-to-know-if-a-spot-bitcoin-etf-has-been-approved\" data-v-f87c67ca=\"\">parallel process<\/a>.&nbsp;","A decision is broadly expected in the coming days, in part because of the Jan. 10 deadline for the SEC to respond to the first in the pack of the latest wave of applications, Cathie Wood’s ARK Investment and 21Shares. However, some analysts have noted that the SEC has wide-ranging authority in the process and could possibly try and delay a decision again.","Gensler didn't appear to hint one way or another about what he might be thinking. His Monday comments were largely in line with <a href=\"https:\/\/www.theblock.co\/post\/267516\/sec-chair-gary-gensler-doesnt-want-to-talk-about-crypto-securities\" data-v-f87c67ca=\"\">past warnings<\/a> he's offered to crypto investors.","In late November, Gensler was <a href=\"https:\/\/www.theblock.co\/post\/265315\/sec-chair-gary-gensler-stays-mum-on-prospects-for-a-spot-bitcoin-etf-says-he-wont-pre-judge-matter\" data-v-f87c67ca=\"\">mostly mum<\/a> when asked about the ongoing review process for the spot bitcoin finds, saying he didn't want to \"pre-judge\" the matter. He's previously called the agency's review process a \"time-tested\" process.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Cathie Wood’s ARK Investment","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"WisdomTree","content":"ORGANIZATION"},{"type":"Jan. 10","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"VanEck","content":"PERSON"},{"type":"NYSE","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Cboe","content":"ORGANIZATION"},{"type":"Invesco","content":"ORGANIZATION"},{"type":"Exchange Commission","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["SEC","SPOT BITCOIN ETF"],"authors":["Nathan Crooks","The Block"]}