{"summary":"Coinbase has developed an encrypted messaging experience in its Wallet offering, in collaboration with XMTP.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/238651\/coinbase-unveils-decentralized-messaging-in-wallets-with-xmtp","publishDate":"2023-07-12T10:17:58","id":4057,"type":null,"title":"Coinbase unveils decentralized messaging in wallets with XMTP","category":["CRYPTO ECOSYSTEMS"],"content":["Crypto exchange Coinbase has introduced an encrypted messaging feature in its wallet offering, in collaboration with the Extensible Message Transport Protocol project, known as <a href=\"https:\/\/xmtp.org\/docs\/introduction\" data-v-f87c67ca=\"\">XMTP.<\/a>","Coinbase Wallet’s messaging will enable crypto users to establish secure communication channels between Ethereum Layer 1 and Layer 2 accounts, using crypto domain names provided by cb.id, Ethereum Name Service and Lens profiles for identification.","According to official <a href=\"https:\/\/xmtp.org\/docs\/build\/messages\" data-v-f87c67ca=\"\">documentation<\/a>, XMTP’s design makes it compatible with any identity solution associated with blockchain accounts, without necessitating changes at the blockchain level.","Messages tied to a Coinbase user’s wallet can be securely ported to any other decentralized social media apps on <a href=\"https:\/\/www.theblock.co\/post\/234928\/lens-protocol-introduces-community-led-governance-for-social-media-platform\" data-v-f87c67ca=\"\">Lens Protocol<\/a> and other platforms that integrate with XMTP, such as Lenster, Orb, and Converse.xyz, without requiring any additional steps.","That means conversations can seamlessly continue across different platforms, underscoring the service’s flexibility. Moreover, the messages are encrypted with security keys exclusively shared between the conversation participants, adding an extra layer of security.","Coinbase stated that the update will also let users send payments to others using the <a href=\"https:\/\/www.theblock.co\/post\/228407\/circle-protocol-stablecoin-transfers-ethereum-avalanche\" data-v-f87c67ca=\"\">USD Coin<\/a>&nbsp;without incurring any gas fees, all within the messaging interface. This integration simplifies the transaction process, removing the usual complications associated with address input, and merges the convenience of messaging with the functionality of payments, the exchange noted.","Coinbase Wallet will be the first and only self-custodial wallet to feature integrated messaging on XMTP, providing users with ownership of their cryptocurrency, identity, and communications. The messaging feature will go live today and be accessible to users receiving an invitational QR code from the company.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ethereum Name Service","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Extensible Message Transport Protocol","content":"ORGANIZATION"}],"hashtag":["DECENTRALIZED INFRASTRUCTURE"],"authors":["Vishal Chawla","The Block"]}