{"summary":"Crypto exchange Bitso captured just over 2% of the remittance market from the U.S. to Mexico last year and has thus set a lofty goal for itself: to achieve a 20% market share by the end of 2020.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/56566\/crypto-exchange-bitso-aims-to-capture-20-of-the-u-s-to-mexico-remittance-corridor-by-the-end-of-2020","publishDate":"2020-02-21T11:33:38","id":4058,"type":null,"title":"Crypto exchange Bitso aims to capture 20% of the U.S.-to-Mexico remittance corridor by the end of 2020","category":["EXCHANGES"],"content":["<span data-v-f87c67ca=\"\">Crypto exchange Bitso captured just over 2% of the remittance market from the U.S. to Mexico last year and has thus set a lofty goal for itself: to achieve a 20% market share by the end of 2020.<\/span>","<span data-v-f87c67ca=\"\">Founded in 2014, Bitso saw&nbsp;<\/span><a href=\"https:\/\/www.theblockcrypto.com\/daily\/53384\/using-xrp-bitso-captured-a-slice-of-the-u-s-mexico-remittance-market-in-2019-its-eyeing-much-more-in-2020\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">rapid growth<\/span><\/a><span data-v-f87c67ca=\"\"> in its XRP\/Peso volume in the past year, from less than $500,000 at the beginning of 2019 to nearly $3.5 million.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In a recent&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/post\/56399\/ceo-of-mexicos-largest-crypto-exchange-explains-why-cryptocurrency-trading-is-more-popular-than-stocks\" data-v-f87c67ca=\"\">episode<\/a> of The Scoop podcast, Bitso CEO Daniel Vogel told The Block that the exchange is gaining traction in the U.S. to Mexico remittance market. According to Vogel, that market represents one of the world’s busiest remittance corridors with approximately $35 billion in yearly transaction flow.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In 2019, Bitso's volume on average accounted for over 2% of the U.S. to Mexico remittance market, he said. And that number continues to grow. In the fourth week of 2020, the exchange experienced its most active week, transacting around $24 million in remittances – about 3.5% of the total market, he said.<\/span>","<span data-v-f87c67ca=\"\">\"Since the beginning of Bitso, we always wanted to make sure that cryptocurrencies were used for something more than just speculation,\" Vogel said. \"We've lived abroad and we had the opportunity to see the high costs involved in sending money back home. When we learned about Bitcoin, one of the things that got us very exciting is eliminating those costs.\"<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Conventionally, he explained, if someone in the U.S. wants to send money back to their families in Mexico, they have to go through a series of intermediaries before the recipient gets to pick up the cash. The process usually takes a long time. As a result, the money transmitter often has to take out loans to cover its liabilities in Mexico, which incurs a high cost of capital.<\/span>","<span data-v-f87c67ca=\"\">Bitso, on the other hand, has built a bridge that allows it to connect to the interbank payment system in Mexico, Vogel said, which enables real-time settlement of funds. A money transmitter can deposit XRP onto Bitso, exchange the funds for Mexican pesos, and have Bitso deliver the pesos to the recipient's bank account in Mexico. In the case that the recipient doesn’t have a bank account, Bitso can deliver the funds to a partner cash operator in Mexico and have the recipient pick up the money there.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"You can move that money so quickly from the U.S. to Mexico,\" he said. \"It removes the huge costs of capital that some of these money transmitters hold. The solution is a lot better than the traditional financial system.\"<\/span>","<span data-v-f87c67ca=\"\">Going forward, Bitso's goal is to capture at least 20% of the remittance corridor by the end of 2020. However, according to Vogel, there is still significant work to be done in terms of building the infrastructure, garnering liquidity, working with different stakeholders to achieve regulatory clarity, etc.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"We're pushing full steam ahead to make that a reality,\" Vogel said. \"It would be a huge win for the ecosystem because we would have a very clear and very strong value proposition for the technology. That would be an incredible way to continue to lobby our industry's efforts across the board.\"<\/span>","<iframe src=\"https:\/\/playlist.megaphone.fm?e=BLOCK8638894587\" width=\"100%\" height=\"200\" frameborder=\"0\" scrolling=\"no\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2%","content":"PERCENT"},{"type":"3.5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Mexico","content":"LOCATION"},{"type":"20%","content":"PERCENT"},{"type":"$3.5 million","content":"MONEY"},{"type":"Vogel","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"$500,000","content":"MONEY"},{"type":"fourth week of 2020","content":"DATE"},{"type":"last year","content":"DATE"},{"type":"Daniel Vogel","content":"PERSON"},{"type":"$35 billion","content":"MONEY"},{"type":"$24 million","content":"MONEY"},{"type":"Bitso","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"Bitso","content":"PERSON"},{"type":"Bitso","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":[],"authors":["Yilun Cheng","The Block"]}