{"summary":"After filing for bankruptcy last week, Compute North got the green light to maintain a series of regular operations.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/172865\/court-approves-more-first-day-motions-in-compute-north-bankruptcy-case","publishDate":"2022-09-26T13:50:26","id":4060,"type":null,"title":"Court approves more first-day motions in Compute North bankruptcy case","category":["LEGAL"],"content":["Bankrupt bitcoin mining hosting provider Compute North received approval today to operate its cash management system, pay insurance obligations and file a list of its creditors.","Judge Marvin Isgur of the U.S. Bankruptcy Court for the Southern District of Texas (Houston) signed three more orders enabling the firm to continue key operations amid the Chapter 11 process. The approvals came after a hearing on Friday rolled over certain first-day motions in the wake of Compute North's bankruptcy declaration.&nbsp;","The company received approval to maintain its existing bank accounts and business forms, with banks permitted to honor checks written before the firm entered bankruptcy when directed by Compute North and the bankruptcy court.","The firm is also approved “but not directed,” to continue intercompany transactions, according to the documents. That includes transactions within the company that would have been usual prior to filing for Chapter 11 protection.","Isgur also approved a revised order directing Compute North to file a list of its top 30 creditors. The firm is also approved to redact the address information of its employees, directors, and contractors. The subsequent filings will also set key dates for the case and start the firm on a path to considering how to repay certain debts.&nbsp;","Compute North <a href=\"https:\/\/www.theblock.co\/post\/172246\/compute-north-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">filed for Chapter 11 bankruptcy<\/a> last Thursday, stating in a document that “after any administrative expenses are paid, no funds will be available for distribution to unsecured creditors.”","The company's Chief Financial Officer Harold Coulby explained in his <a href=\"https:\/\/www.theblock.co\/post\/172574\/compute-norths-cfo-details-the-firms-collapse-amid-first-day-filings\" data-v-f87c67ca=\"\">declaration<\/a> that the crypto market downturn impaired the firm's liquidity in addition to a soured relationship with its largest funding source, infrastructure investment firm Generate Capital.","The company<a href=\"https:\/\/www.theblock.co\/post\/133602\/compute-north-raises-385-million-bitcoin-mining-infrastructure\" data-v-f87c67ca=\"\"> raised $385 million<\/a> earlier this year and an additional <a href=\"https:\/\/www.theblock.co\/linked\/94746\/bitcoin-mining-infra-provider-compute-north-raises-25-million\" data-v-f87c67ca=\"\">$25 million<\/a> last year. According to bankruptcy documents, just over $100 million of the $300 million line of credit extended by Generate Capital remains outstanding.","Compute North has between $100 million-$500 million both in estimated liabilities and estimated assets, according to the initial bankruptcy filing.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"Southern District of Texas (Houston)","content":"ORGANIZATION"},{"type":"Compute North","content":"ORGANIZATION"},{"type":"last Thursday","content":"DATE"},{"type":"Generate Capital","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Marvin Isgur","content":"PERSON"},{"type":"Harold Coulby","content":"PERSON"},{"type":"$500 million","content":"MONEY"},{"type":"$25 million","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"$300 million","content":"MONEY"},{"type":"$385 million","content":"MONEY"}],"hashtag":[],"authors":["Catarina Moura","Aislinn Keely","The Block"]}