{"summary":"Kraken Ventures is raising $100 million for its second fund amid a challenging climate for crypto VC, sources tell The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244616\/kraken-ventures-second-fund","publishDate":"2023-08-14T09:43:30","id":4061,"type":null,"title":"Kraken Ventures seeks to raise $100 million for second fund","category":["COMPANIES"],"content":["Kraken Ventures, the venture capital unit of crypto exchange operator Kraken, is raising its second fund amid a challenging climate and is actively engaging with potential investors,&nbsp;three sources with knowledge of the matter told The Block.","The firm aims to raise $100 million for the second fund, one of the three sources said. That would exceed the $65 million war chest <a href=\"https:\/\/www.theblock.co\/linked\/94605\/kraken-crypto-exchange-venture-arm\" data-v-f87c67ca=\"\">Kraken Ventures<\/a>&nbsp;amassed for its first fund, which&nbsp;<a href=\"https:\/\/www.businesswire.com\/news\/home\/20211217005208\/en\/Kraken-Ventures-Raises-65-Million-for-Early-Stage-Fund-to-Invest-Across-the-Crypto-Fintech-Ecosystem\" data-v-f87c67ca=\"\">closed<\/a> in 2021.","Brandon Gath, managing partner of Kraken Ventures, confirmed that the unit is trying to raise another fund, stating that it will “double down” on the firm’s existing thesis and continue to support founders “through their full journey from initial capital to IPO [initial public offering].”","“The Kraken Ventures team has significant experience in early-stage investing, having completed hundreds of early-stage investments across blockchain, fintech and deep tech,” Gath said. “We also believe that smaller funds best serve entrepreneurs and investors, as the entrepreneur gets a more hands-on partner, and data overwhelmingly shows that small funds outperform large funds.”","While Kraken Ventures is an independent entity with outside capital, it enjoys “a strong relationship” with Kraken, Gath added.","The firm’s fundraising effort comes amid a challenging crypto venture capital landscape, characterized by a downturn in investment volumes and bearish market sentiment.","The collapses and bankruptcies of major crypto firms last year, including Terraform Labs, Three Arrows Capital and FTX, have dented investor confidence and cooled investment in the sector.","Investment in crypto startups has declined for five consecutive quarters and is expected to continue falling in the current quarter, according to The Block Research Pro. With one and a half months remaining, the third quarter is on pace for <a href=\"https:\/\/www.theblock.pro\/research\/july-blockchain-funding-recap-2-243007\" data-v-f87c67ca=\"\">nearly<\/a> $2.5 billion of total investment. By comparison, over $6 billion was invested in crypto startups in the third quarter of last year.","Some startups have nonetheless been able to land significant later-stage capital. Worldcoin developer Tools for Humanity recently raised $115 million, blockchain infrastructure provider LayerZero Labs announced a $120 million round recently and crypto hardware wallet maker Ledger raised $108 million.","As for Kraken Ventures, it will look to support similar startups with the second fund as it did with its first. Its previous investments include staking infrastructure firm Blockdaemon, liquid staking platform Kiln, custody firm Anchorage and Ethereum scaling network LayerN.","“We reserve a significant portion of our fund for follow-on investments as we view our relationship with our founders as a long-term journey together,” Gath said. “This contrasts with many strategic investors that do not reserve a dedicated pool of capital.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$115 million","content":"MONEY"},{"type":"$108 million","content":"MONEY"},{"type":"$65 million","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"Anchorage","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Gath","content":"PERSON"},{"type":"Brandon Gath","content":"PERSON"},{"type":"third quarter of last year","content":"DATE"},{"type":"LayerZero Labs","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Blockdaemon","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$6 billion","content":"MONEY"},{"type":"$2.5 billion","content":"MONEY"},{"type":"$120 million","content":"MONEY"},{"type":"third quarter","content":"DATE"},{"type":"Kraken Ventures","content":"ORGANIZATION"}],"hashtag":["KRAKEN","NEW VC FUNDS"],"authors":["Yogita Khatri","Ryan Weeks","The Block"]}