{"summary":"Vitalik Buterin said that rollups will need to &quot;scale internally&quot; to handle increased activity via strategies like parallelization.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285539\/vitalik-buterin-emphasizes-need-for-parallelization-internal-scaling-in-ethereum-rollups","publishDate":"2024-03-29T02:39:56","id":4065,"type":null,"title":"Vitalik Buterin emphasizes need for parallelization in Ethereum rollups","category":["CRYPTO ECOSYSTEMS"],"content":["Ethereum co-founder Vitalik Buterin has put a spotlight on the need for internal scaling and parallelization within Layer 2 rollups.","This call to action from Buterin in his Thursday <a href=\"https:\/\/vitalik.eth.limo\/general\/2024\/03\/28\/blobs.html\" data-v-f87c67ca=\"\">blog post<\/a> comes after the <a href=\"https:\/\/www.theblock.co\/post\/282236\/ethereum-dencun-upgrade-blobs#:~:text=Ethereum%20ETH%20%2B2.61%25%20core%20developers,at%20around%2010%20am%20ET.\" data-v-f87c67ca=\"\">Dencun<\/a> hard fork took place earlier this month, which introduced a crucial improvement known as EIP-4844 aimed at drastically reducing transaction fees for Layer 2s.","While the hard fork has been successful in terms of reducing transaction costs for rollups, it has also resulted in some challenges, Buterin noted.","He highlighted an incident where the Base rollup experienced a <a href=\"https:\/\/www.theblock.co\/post\/283056\/base-dencun-transactions-users-surge\" data-v-f87c67ca=\"\">surge in usage<\/a> post-Dencun, hitting its internal gas limit and triggering a spike in fees.","According to Buterin, this underscores a need for change: beyond optimizing data handling, rollups should also scale internally to sustainably manage increased activity.","“This [gas fee spike] has led to a more widespread realization that the Ethereum data space is not the only thing that needs to be scaled: rollups need to be scaled internally as well,” Buterin said.","One of Buterin’s solutions centers on the concept of parallelization, which would involve allowing these Layer 2 solutions to process multiple transactions or computational tasks at the same time, rather than sequentially.","He further suggested that rollups could benefit from implementing parallelization strategies like those proposed in <a href=\"https:\/\/github.com\/ethereum\/EIPs\/issues\/648\" data-v-f87c67ca=\"\">EIP-648<\/a>, which would allow multiple transactions in the EVM to be processed in parallel, increasing scalability.","Parallelization was listed by Buterin among other ways in which Ethereum Layer 2s could improve, including data compression and optimistic data techniques like Plasma and Validiums.","Buterin added that the development emphasis on Ethereum is set to transition gradually from Layer 1 concerns to the application layer. A future improvement involves data availability sampling (DAS), potentially expanding the data space per slot to 16 MB. At the same time, the network is poised to continue its Layer 2-centric scaling strategy.&nbsp;","Scaling has been an issue for Ethereum for several years now. Hence development teams and startups have put forward a smorgasbord of approaches to tackling the issue, at both the protocol level and through a system of layers.","Major scaling upgrades are being developed in parallel. First up is EIP-4844 or proto-danksharding, a precursor to sharding, that was recently implemented. It introduced <a href=\"https:\/\/www.theblock.co\/post\/285236\/inscriptions-push-blobs-to-reach-set-utilization-limit-on-ethereum\" data-v-f87c67ca=\"\">data blobs<\/a>, which increase the amount of data Ethereum blocks can hold. By increasing the amount of data each block can hold, it has helped reduce costs for Layer 2s.","Next up is sharding, which has been in development since Vitalik Buterin <a href=\"https:\/\/medium.com\/@socialmedia_63108\/vitalik-buterin-lays-roadmap-for-ethereum-visa-levels-quadratic-sharding-7478e769808f\" data-v-f87c67ca=\"\">introduced<\/a> it in 2017 and will be implemented in future. It involves splitting the Ethereum blockchain so that subsets of validators are only responsible for a fraction of the total data.","Yet another proposed development introduces <a href=\"https:\/\/www.alchemy.com\/overviews\/proposer-builder-separation\" data-v-f87c67ca=\"\">proposer builder separation (PBS)<\/a>. This concept could separate the highly intensive work of block building from more passive block validation. Proposer builder separation will ensure an adequate number of validators for decentralization and data availability sampling on the post-sharded Ethereum network.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Buterin","content":"PERSON"},{"type":"4844","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"earlier this month","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Validiums","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Buterin","content":"LOCATION"}],"hashtag":["ETHEREUM","VITALIK BUTERIN"],"authors":["Vishal Chawla","The Block"]}