{"summary":"Ripple seeks to leverage its growing presence in London with a regulatory white paper for UK policymakers.\nThe recommendations especially target the Financial Markets and Services Bill, which is set to become the national crypto regulation framework.","author":["Inbar Preiss","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/186892\/ripple-publishes-proposed-guidelines-for-uk-regulators","publishDate":"2022-11-15T03:00:15","id":407,"type":null,"title":"Ripple publishes proposed guidelines for UK regulators","category":["Policy"],"content":["<span data-v-f87c67ca=\"\">Ripple, the company running a B2B blockchain payment system that uses XRP to facilitate cross-border payments, has released a \"regulatory white paper\" with recommendations for UK policymakers and regulators drafting laws on crypto policy.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“In order to be able to operate most effectively here, in order to continue to grow our business, it matters what the regulatory framework looks like,” Susan Friedman, head of public policy at Ripple, told The Block in an interview. “And so we are invested in trying to ensure the best outcomes.”<\/span>","<span data-v-f87c67ca=\"\">The report’s recommendations draw inspiration from other jurisdictions — such as Dubai, Singapore and the EU — which are further ahead in enforcing crypto regulation. Recommendations include distinguishing between different types of crypto for bespoke regulation, coordinating between the crypto industry and the public sector, and the educating of lawmakers.<\/span>","<span data-v-f87c67ca=\"\">“We appreciate that the UK may not be the first mover in all of these and we think there's an advantage to that,” Friedman said. “There is value in seeing how different frameworks unfold and adopting best practices.”<\/span>","<span data-v-f87c67ca=\"\">The regulatory paper is published in the midst of a downward spiral for the crypto industry following the shocking meltdown of the second-largest exchange, FTX. Leaked reports that came out earlier in November about the mishandling of the exchange’s funds led to a domino of events that have <\/span><a href=\"https:\/\/www.theblock.co\/post\/186520\/pissed-pessimistic-and-paranoid-ftx-clients-panic-money-likely-gone\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">left<\/span><\/a><span data-v-f87c67ca=\"\"> millions of users devoid of their funds.<\/span>","<span data-v-f87c67ca=\"\">For Friedman, this underscores the urgency to push for regulation. <\/span>","<span data-v-f87c67ca=\"\">“When you look at the past week, what we've seen is that absent a regulatory framework, what happens is providers will drive liquidity offshore,” she said, referring to the FTX headquarters in the Bahamas while it provided its services globally. “There is no separate mechanism for UK authorities like the Financial Conduct Authority to provide protections for consumers.”<\/span>","<span data-v-f87c67ca=\"\">The Financial Markets and Services Bill is currently the main vessel for a comprehensive legislative framework for crypto in the UK, after amendments to include crypto in its scope <\/span><a href=\"https:\/\/www.theblock.co\/post\/179906\/uk-lawmakers-voted-to-include-crypto-rules-in-finance-regulation-bill\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">passed<\/span><\/a><span data-v-f87c67ca=\"\"> a parliamentary vote in October.<\/span>","<span data-v-f87c67ca=\"\">Andrew Whitworth, Ripple’s policy director, hopes that Ripple’s guidance will make its way to the rule-writing process that the FCA will be mandated if the bill passes. Once the bill goes through the hands of policymakers, UK regulators will then have the chance to iron out the actionable components of the new laws.<\/span>","<span data-v-f87c67ca=\"\">“The FCA has the power to then go through and actually create the details of the provision,\" <\/span>Whitworth said in the same interview with The Block. \"It should work since it is the <span data-v-f87c67ca=\"\">same bill which creates an institutional framework and also includes crypto assets within the financial regulatory space.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Ripple’s main recommendation is to bring a comprehensive legal framework into force, which assesses crypto assets according to distinct risk profiles.<\/span>","<span data-v-f87c67ca=\"\">“There are different business models, different technologies, different blockchains. We're not talking about one single thing called crypto, which should be regulated,” said Whitworth. A crypto regulatory framework should “recognize the different risk profiles and provide them with different regulatory treatments,” he added. “It's something the regulators know already about the traditional regulatory frameworks, but often when the policy discussion around crypto happens, that distinction gets forgotten.”<\/span>","<span data-v-f87c67ca=\"\">Ripple has been battling a lawsuit with the U.S. Securities and Exchange Commission, which in 2020 <\/span><a href=\"https:\/\/www.theblock.co\/linked\/88912\/sec-ripple-labs-lawsuit-filed-2\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">filed<\/span><\/a><span data-v-f87c67ca=\"\"> against CEO Brad Garlinghouse and co-founder Chris Larsen, citing a $1.3 billion unregistered securities sale.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“It goes to the core question of how different crypto should be treated,” Friedman said. “There is no question that XRP is not a security in the UK. Rather, the FCA has described XRP as a hybrid exchange utility token.”<\/span>","<span data-v-f87c67ca=\"\">“There needs to be some coherence globally,” Friedman added, “so that you're not creating walled garden so that the company operating in the UK can operate and the U.S. can operate in Singapore.”<\/span>","<span data-v-f87c67ca=\"\">Ripple is currently in the process of filing a reply brief to summary judgment, according to Friedman. They are expecting the judge to rule in 2023.&nbsp;<\/span>"],"hashtag":["FCA","UK PARLIAMENT"]}