{"summary":"The Ethscriptions protocol allows users to create tokens using calldata on the Ethereum blockchain — instead of using the ERC-721 standard.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236632\/ordinals-like-tokens-on-ethereum-surge-past-1-million-in-volume","publishDate":"2023-06-27T09:05:53","id":4072,"type":null,"title":"Ordinals-like tokens on Ethereum surge past $1 million in volume","category":["METAVERSE & NFT"],"content":["Tokens issued using a new protocol known as Ethscriptions, which draws inspiration from Bitcoin Ordinals, have exceeded 560 ether ($1 million) in trading volume since their launch in mid-June, according to <a href=\"https:\/\/opensea.io\/collection\/ethscriptions\" data-v-f87c67ca=\"\">data<\/a> from OpenSea.","<a href=\"https:\/\/ethscriptions.com\/\" data-v-f87c67ca=\"\">Ethscriptions<\/a>, also referred to as the ESC-20 token standard by its users, provides a way for users to create unique tokens leveraging transactional calldata on the Ethereum blockchain. The protocol was launched in mid-June by Ethereum developer Tom Lehman.&nbsp;","Ethscriptions draws inspiration from Bitcoin Ordinals, which leverages a process known as “inscription” to assign image data to individual satoshis across the Bitcoin network. However, Ethscriptions adopts a different strategy, utilizing transaction calldata to generate unique NFT-like image artifacts that are embedded within Ethereum transactions.","As an open-source project, Ethscriptions has sparked interest among traders, given the surge in trading volume to more than $1 million within just a few weeks. One of the most prominent Ethscriptions that’s being actively traded is a <a href=\"https:\/\/twitter.com\/EthscribedPunks\" data-v-f87c67ca=\"\">copy<\/a> of the notable CryptoPunks NFT collection, among others.","Still, the protocol is currently in a highly speculative phase, lacking a clear value proposition. This uncertainty may be due to the existing acceptance of NFTs leveraging the ERC-721 token standard, often considered the default mechanism to generate and trade image-based collectibles on the Ethereum blockchain. Despite this, its creator Tom Lehman asserts that Ethscriptions presents a cost-effective alternative to Ethereum NFTs.","Lehman <a href=\"https:\/\/twitter.com\/dumbnamenumbers\/status\/1671174104383193089\" data-v-f87c67ca=\"\">stated<\/a> that Ethscriptions has a focus on the use of calldata as a data store for exchanging things like image art. This can be an affordable alternative to the high computational costs associated with running complex smart contracts on Ethereum, especially for projects without immediate financial returns like trading \"JPEGs.\"&nbsp;","“Why do I believe Ethscriptions will eclipse NFTs? Because NFTs are only for rich people and Ethscriptions are for everyone.” Lehman <a href=\"https:\/\/twitter.com\/dumbnamenumbers\/status\/1673347621526683649\" data-v-f87c67ca=\"\">asserted<\/a>.","In Ethereum, calldata refers to a field in a transaction that contains the function signature and encoded logic necessary to call a specific function in a smart contract.&nbsp;","This calldata is traditionally used to specify the instructions to the smart contract about what function to execute and with what parameters immutably recorded on the blockchain with the transaction. However, Ethscriptions uses calldata in a new way to create art collectibles.","In Ethscriptions, an image or other data is converted into a hexadecimal format, and then this converted data is put into the calldata field of a 0 ETH transaction.&nbsp;Once the data is recorded on the blockchain, an “Ethscription,” similar to an NFT is effectively created.","The data can then be indexed for easy retrieval and viewed by anyone who can access the blockchain. It’s important to note that while this method allows for the creation of unique digital artifacts, the Ethscriptions don’t behave exactly like traditional NFTs. They don’t adhere to the ERC-721 standard (the standard most commonly associated with NFTs on Ethereum) and can’t be transferred or sold in the same way. Instead, they are unique representations of data permanently recorded on the Ethereum blockchain.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"ESC","content":"ORGANIZATION"},{"type":"Ethscriptions","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Ethscriptions","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"Bitcoin Ordinals","content":"ORGANIZATION"},{"type":"Tom Lehman","content":"PERSON"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}