{"summary":"A Twitter thread promising an airdrop from the account of Circle&#x27;s Chief Strategy Officer and Global Head of Policy, Dante Disparte, is not real.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/221956\/circle-usdc-twitter-hacked","publishDate":"2023-03-22T09:27:54","id":4075,"type":null,"title":"Circle confirms chief strategy officer&#x27;s account was hacked, airdrop thread is &#x27;not legitimate&#x27;","category":["COMPANIES"],"content":["Circle chief executive officer Jeremy Allaire confirmed that a Twitter thread promising USDC holders a one-time bonus in the form of an airdrop was bogus.&nbsp;","Allaire took to Twitter to say the account of the company's chief strategy officer and head of policy had been hacked. A spokesman for the Boston-based company said in an email to The Block that the thread is \"not legitimate.\"&nbsp;","The tweets came from the account of Circle's Dante Disparte and claimed USDC holders would get a bonus after the stablecoin's depeg earlier this month. The \"one-time bonus\" for USDC users would come in the form of an airdrop, according to the hacked account.","One tweet in the thread pointed to a URL that wasn't on Circle's domain.","Circle's USDC stablecoin depegged the weekend of March 6 following the collapse of Silvergate and Silicon Valley Bank.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jeremy Allaire","content":"PERSON"},{"type":"USDC","content":"ORGANIZATION"},{"type":"earlier this month","content":"DATE"},{"type":"Circle","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Boston","content":"LOCATION"},{"type":"Dante Disparte","content":"ORGANIZATION"},{"type":"weekend","content":"DATE"},{"type":"Silvergate and Silicon Valley Bank","content":"ORGANIZATION"},{"type":"March 6","content":"DATE"}],"hashtag":["USDC"],"authors":["Adam Morgan McCarthy","The Block"]}