{"summary":"Moody&#x27;s downgraded Silvergate for the second time in less than two weeks, citing lack of capitalization as well as &quot;governance deficiencies.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/217061\/moodys-sees-significant-governance-deficiencies-in-silvergate","publishDate":"2023-03-03T17:19:45","id":4076,"type":null,"title":"Moody&#x27;s sees &#x27;significant governance deficiencies&#x27; in Silvergate","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Moody's downgraded Silvergate for the second time in less than two weeks, citing a lack of capitalization as well as \"governance deficiencies,\" after the company Wednesday told the U.S. Securities and Exchange Commission it may be \"less than well-capitalized\" and delayed filing its annual financial report.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The actions \"highlight significant governance deficiencies in terms of the bank's risk management and its ability to properly assess and respond to abruptly changing operating conditions for its specialized business model, increasing the institution's exposure to adverse developments,\" Moody's said. \"The bank's negative governance risk has a discernible negative impact on Silvergate's credit ratings.\"&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Moody's dropped the bank's long-term issuer rating to Ca from B3, or near default, and its non-cumulative preferred stock to C from Caa3, or high credit risk, less than two weeks after its Baseline Credit Assessment was lowered.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Silvergate also said that it has sold additional investment securities to fully repay its outstanding Federal Home Loan Bank advances, realizing additional investment losses, which had previously been recorded as other-than-temporary impairment of securities, Moody's said.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Silvergate","content":"ORGANIZATION"},{"type":"Moody's","content":"ORGANIZATION"},{"type":"Federal Home Loan Bank","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Moody","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}