{"summary":"Goldman Sachs is launching a data service for institutional investors called Datonomy.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/182674\/goldman-sachs-developing-crypto-classification-system-with-msci-and-coin-metrics-cnbc","publishDate":"2022-11-03T10:20:23","id":4078,"type":null,"title":"Goldman Sachs developing crypto classification system with MSCI and Coin Metrics","category":["COMPANIES"],"content":["Goldman Sachs is working with index provider MSCI and crypto data firm Coin Metrics to develop a crypto classification service.","The investment bank's crypto classification service will target institutional investors. The bank wants to help investors make sense of crypto, executives at the firms said.&nbsp;","\"We're trying to create a framework for the digital asset ecosystem that our clients can understand,\" said Anne Marie Darling, head of client strategy at Goldman's Marquee platform. Darling added, \"they increasingly need to think about performance tracking and risk management in digital assets.\"","The service will be known as Datonomy, a play on the scientific term for naming and classifying the natural world — taxonomy.","Darling said that Goldman, MSCI, and Coin metrics split the digital asset space into classes, sectors, and subsectors. She added that money managers at hedge funds and asset management companies will be able to think about crypto in a more granular way now.","“We firmly believe a consistent and standardized framework for the classification of digital assets is essential to support investors’ ability to evaluate the market,” said Stéphane Mattatia, managing director, global head of derivatives licensing and thematic indexes at MSCI. “","The data feed aims to help with analysis and research. As well as this, it can be used to benchmark performance, manage portfolios, or even create investment products based on the different sectors in the digital asset space.","Coin Metrics CEO Tim Rice added that this represented a \"significant leap forward for the industry as a whole, establishing a coherent and future-proof structure to monitor and analyze the digital assets ecosystem.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Stéphane Mattatia","content":"PERSON"},{"type":"Anne Marie Darling","content":"PERSON"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Goldman","content":"ORGANIZATION"},{"type":"Datonomy","content":"ORGANIZATION"},{"type":"Goldman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Tim Rice","content":"PERSON"}],"hashtag":["GOLDMAN SACHS"],"authors":["Adam Morgan McCarthy","The Block"]}