{"summary":"In Re Ripple Labs Inc. Litigation, Case №18-cv-06753-PJH, N.D. Cal, “Motion to Dismiss”, 9\/19\/2019 Link to Motion The Ripple class action continues to","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/40548\/ripple-moves-to-dismiss-class-action-complaint-says-claims-are-time-barred","publishDate":"2019-09-21T05:00:17","id":408,"type":null,"title":"Ripple moves to dismiss class action complaint, says claims are time-barred","category":["LEGAL"],"content":["<strong class=\"lf mr\" data-v-f87c67ca=\"\">In Re Ripple Labs Inc. Litigation, Case №18-cv-06753-PJH, N.D. Cal, “Motion to Dismiss”, 9\/19\/2019 [SDP]<\/strong>","<a class=\"br cx ls lt lu lv\" href=\"https:\/\/www.scribd.com\/document\/426719748\/MTD-Ripple\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Link to Motion<\/a>","The Ripple class action continues to poodle forward. The most recent development is a Motion to Dismiss filed on September 19 by the Defendants.","The procedural history to this case is already labyrinthine and involves multiple lawsuits combined into one and several trips back and forth between state and federal court, where this case now resides after an attempt to “remand” it was denied earlier this year and a “Consolidated Class Action Complaint” (“Complaint”) was filed on August 5, 2019. The Complaint caught some news attention and some people made A Really Big Deal about it because it cited the SEC’s Digital Asset Framework, though some commentators (waves) didn’t think it mattered all that much.","So, anyhow, lawsuits in federal court are called “Complaints” and after one of these bad boys gets filed a defendant has a couple of options, one of which is to file a Motion to Dismiss, which is exactly what happened here and is not much of a surprise tactically.","The particular type of Motion filed here is a 12(b)(6) motion for “failure to state a claim.” This means, with apologies to my civ pro professor, the allegations in the lawsuit can’t possibly give rise to any legal liability on behalf of the defendants. That’s the gist. So if I sued Nelson because I didn’t like the way I eat herring he would file a 12(b)(6) motion because, well, my lawsuit is total rubbish and doesn’t state a legal claim.","Here, Ripple and its CEO Brad Garlinghouse (“the Defendants”) argue in their motion that the lawsuit doesn’t state a claim for a couple of reasons.","First, the Defendants argue that the federal securities laws claims in the lawsuit are barred by a three year “statute of repose” that applies to claims involving the unregistered sale of securities (which is part of what the lawsuit involves.) Interestingly (ish) Defendants don't actually argue that XRP isn't a security in the argument section of their brief, though they do have a throwaway line in the introduction where they say it's a currency not a security. &nbsp;If the claim is time barred you don't even have to go to the issue of whether or not the thing is a security. &nbsp;As a matter of stra-ter-gy, why take on an argument you don't need to address, is probably the thinking.","Under federal law, defendants argue that the statute of repose — which is an outside limit on the time in which a claim can be filed, regardless of the plaintiff’s knowledge of the claim — is three years. Because XRP was first offered to the public in 2013, plaintiffs reason that a claim based on the alleged failure to register XRP as a security is barred:","“[U]nder Plaintiff’s own allegations, Defendants offered XRP to the public throughout 2013 through 2015. Accordingly, the three-year statute of repose expired as of 2016 (three years after the sales cited in the May 2015 settlement) and in no case later than May 2018 (three years after the May 2015 settlement agreement in which “Defendants acknowledged that they had sold XRP to the general public,” Complaint ¶ 25). The Securities Act claims in the Complaint, filed August 5, 2019, are therefore untimely and barred by the statute of repose.”","Plaintiffs attempt to get around this limitation period in their Complaint by arguing that the XRP was and is a “continuing ICO,\" so the violation of securities laws is continuing. Defendants argue that this dog doesn’t hunt because under a bunch of cases “slow offerings” — “sales of the same security in one offering over an extended period” are still subject to the rule that the statute begins to run as of the date of the first sale.","Defendants also argue that the securities law claims fail because plaintiff (1) doesn’t allege that he bought his XRP in the initial sale from the defendants but instead (2) may have done so on the secondary market and (3) in any event did not solicit his purchase. For these reasons, they say the securities law claim should be thrown out.","The lawsuit also includes California state law claims. Defendants makes some similar arguments here — they say that there’s no contractual relationship (“privity”) between them and the plaintiff and also that there’s no allegation that the XRP transactions at issue took place in California. Related to these points is an argument that no misstatements were made by the defendants to the plaintiff and that alleged misrepresentations aren’t detailed with the kind of specificity required by law.","It’s hard to know how a court will rule until we see the response to this motion, but so far Ripple has done pretty well — keeping the case in federal court was slick, procedurally. And whether you are or are not an XRP fan, this motion makes a number of credible substantive arguments that will require skill to defeat. An outright loss for the plaintiffs isn’t out of the realm of possibility, particularly on the federal securities claims.","<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Disclaimer: Crypto Caselaw Minute is provided for educational purposes only by Nelson Rosario (@nelsonmrosario) and Stephen Palley (@stephendpalley). These summaries are not legal advice. They are our opinions only, aren’t authorized by any past, present or future client or employer. Also, we might change our minds. We contain multitudes. &nbsp;<\/em><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">As always, Rosario summaries are “NMR” and Palley summaries are “SDP”. &nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Re Ripple Labs Inc","content":"ORGANIZATION"},{"type":"2015","content":"DATE"},{"type":"2016","content":"DATE"},{"type":"Nelson Rosario (","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"2013","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"August 5, 2019","content":"DATE"},{"type":"Brad Garlinghouse","content":"PERSON"},{"type":"California","content":"LOCATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"Consolidated Class Action Complaint","content":"ORGANIZATION"},{"type":"May 2015","content":"DATE"},{"type":"Nelson","content":"ORGANIZATION"},{"type":"Palley","content":"PERSON"},{"type":"September 19","content":"DATE"},{"type":"May 2018","content":"DATE"},{"type":"N.D. Cal","content":"LOCATION"},{"type":"XRP","content":"ORGANIZATION"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"}],"hashtag":["XRP"],"authors":["Stephen Palley","The Block"]}