{"summary":"Israeli payments startup First DAG has built a solution for merchants to accept Diem stablecoin when it goes live sometime later this year.\nFirst CEO Ran Goldi told The Block that Diem would be the “easiest” payment method for end-users. ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/95008\/diem-merchants-solution-stablecoin-first-fireblocks","publishDate":"2021-02-16T09:00:23","id":408,"type":null,"title":"First has built a solution for merchants to accept Diem stablecoin","category":["Facebook"],"content":["Israeli payments startup First DAG has built a solution for merchants to accept Diem stablecoin when it goes live sometime later this year.","<a href=\"https:\/\/www.firstdag.com\/solution\/\" data-v-f87c67ca=\"\">The API solution<\/a> will connect merchants to the Diem network to facilitate transactions, enabling their clients to utilize the Diem stablecoin as a payment method.","\"We want merchants to be able to accept Diem,\" First CEO Ran Goldi told The Block. \"So if you are a merchant and you are already working with a payment service provider (PSP) that we have integrated with, you will able to accept Diem without any integrations.\"","First will announce the supported PSPs \"in the next several months,\" said Goldi. As for Diem, Goldi said it should launch \"in the next six months.\"","To accept Diem, merchants won't have to know about crypto or blockchain, said Goldi, because First will handle the related processes. Merchants will get paid in their native fiat currencies, he said. As for end-users, Diem will be just another payment method.","\"Diem is going to be huge\" since Facebook has roughly 2.8 billion monthly active users, said Goldi. Diem, formerly known as Libra, is led by Facebook, and the project has been delayed due to significant regulatory scrutiny worldwide.","Goldi said Diem would be the \"easiest\" payment method integrated on Facebook's several platforms such as Instagram and WhatsApp. \"You could just click a button and pay with Diem.\"","The first version of Diem would be similar to other payment solutions such as PayPal, Goldi told The Block. But in the future, the Diem Association could add more features such as connecting the Diem network with other blockchain networks and a central bank digital currency (CBDC). \"Then we will see the real value and benefits from Diem,\" he said.","Besides Diem, Goldi said First will also support other stablecoins and a CBDC in the future.&nbsp;","As for the Diem solution, First has partnered with digital security startup Fireblocks to help safely keep the stablecoins.&nbsp;","\"Diem, through its digital currencies, is set to empower a wider adoption of cryptocurrency and will require the highest levels of security for real-time payments and ensure the safety of funds and financial data of its users,\" said Michael Shaulov, CEO of Fireblocks. \"To accelerate the adoption of Diem payments, Fireblocks has partnered with First, to provide an easy-to-use platform for licensed providers to launch services supporting Diem.\""],"hashtag":[]}