{"summary":"Haun Ventures, founded by former prosecutor Katie Haun, has about $1 billion left to deploy into crypto startups.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/243479\/haun-ventures-has-more-than-half-of-the-1-5-billion-it-raised-left-to-deploy","publishDate":"2023-08-07T10:00:05","id":4082,"type":null,"title":"Haun Ventures has more than half of the $1.5 billion it raised left to deploy","category":["COMPANIES"],"content":["Haun Ventures, the eponymous investment firm founded by former federal prosecutor Katie Haun, has deployed about 40% of the $1.5 billion it raised last year, according to a source familiar with the situation.&nbsp;","Haun, who previously co-led a16z's crypto investment arm with Chris Dixon, left Sand Hill Road's storied capital allocator in 2022 to launch her own venture capital firm to back companies operating in the cryptocurrency and web3 space. At the time of the launch, the firm planned to dedicate about a third of the funds raised to early-stage startups with the remaining capital dedicated to an \"acceleration fund,\" as Wired <a href=\"https:\/\/www.wired.com\/story\/katie-haun-haun-ventures-cryptocurrency-vc\/\" data-v-f87c67ca=\"\">reported<\/a> at the time.&nbsp;","As a profile in <a href=\"https:\/\/fortune.com\/2023\/08\/02\/katie-haun-crypto-venture-capital-downturn\/\" data-v-f87c67ca=\"\">Fortune Magazine<\/a> indicated earlier this month, the fund continues to deploy cautiously in the wake of last year's market meltdown. Fortune reported that it had deployed about 30% of the total fund since inception through the end of June. A source close to the firm says that figure has crept closer to 40%, meaning the firm has less than $1 billion left to deploy.&nbsp;","The firm is still taking a slower approach relative to its competitors, opting to take advantage of a wide-range opportunities including staking, bidding for depressed equity in the secondary market, and scooping up tokens over-the-counter. It's a continuation of its approach throughout last year, which is in contrast to the breakneck speed at which deals were executed prior to the bankruptcy of FTX.&nbsp;","Last year was a brutal year for investors, specifically new investors to the crypto market, who rushed to join the cap tables of high flying unicorns. Many of those investors got stung by the bankruptcies of firms ranging from FTX to BlockFi, but also from declining valuations. In the secondary market many 2022 unicorns are trading hands at steep discounts, topping 70% in some instances, according to data reviewed by The Block.&nbsp;","As for Haun Ventures, the company has backed a wide-range of firms in the crypto ecosystem with bets that span scaling and middleware, smart contract platforms, and so-called picks and shovels players. Portfolio companies include Layer 1 blockchain Aptos, tax and accounting software firm Taxbit and NFT platform Zora.&nbsp;","It has been brutal for venture capital investing, with funding levels plunging globally by almost half during the first six months of the year, according to <a href=\"https:\/\/www.reuters.com\/business\/finance\/venture-capital-funding-plunges-globally-first-half-despite-ai-frenzy-2023-07-06\/\" data-v-f87c67ca=\"\">PitchBook<\/a> data. As for crypto specifically, blockchain venture funding has been on the decline since the first quarter of 2022. Blockchain venture funding for the most recent quarter came in at $3.2 billion, a dramatic decline from the Q1 2022 height of $12.5 billion, according to <a href=\"https:\/\/www.theblock.pro\/research\/q223-blockchain-venture-funding-and-ma-recap-238354\" data-v-f87c67ca=\"\">The Block Pro<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"70%","content":"PERCENT"},{"type":"$3.2 billion","content":"MONEY"},{"type":"Haun","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Katie Haun","content":"PERSON"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Fortune Magazine","content":"ORGANIZATION"},{"type":"$1.5 billion","content":"MONEY"},{"type":"Chris Dixon","content":"PERSON"},{"type":"30%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"the first quarter of 2022","content":"DATE"},{"type":"Aptos","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"end of June","content":"DATE"},{"type":"Haun Ventures","content":"ORGANIZATION"},{"type":"$12.5 billion","content":"MONEY"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}