{"summary":"DeFi puts complex financial products into the hands of users and protocols, enabling them to execute simple transactions like a swap - to more complex","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278666\/what-are-intent-based-architectures","publishDate":"2024-02-26T09:01:07","id":4085,"type":null,"title":"What are Intent Based Architectures?","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">DeFi puts complex financial products into the hands of users and protocols, enabling them to execute simple transactions like a swap - to more complex strategies like a delta neutral stablecoin based on staking yield and funding rate arbitrage (<\/span><a href=\"https:\/\/www.theblock.co\/post\/277565\/ethena-usde-stablecoin-funding-valuation-paypal-brevan-howard-others\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">as was recently done by the USDe developer Ethena<\/span><\/a><span data-v-f87c67ca=\"\">).<\/span>","<span data-v-f87c67ca=\"\">The problem for many users is that there exists no perfect protocol or tool to help them execute their specific strategy or workflow. Some users may take to Twitter to ask “Is anyone building the thing I need?”. The very brave may even try to manually cobble together their strategy by clicking buttons and signing Tx’s across multiple protocols; monitoring everything in a spreadsheet. This is the manual, transactional approach to DeFi. It’s spurned a cottage industry of YouTubers like <\/span><a href=\"https:\/\/www.youtube.com\/@TheCalculatorGuy\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The Calculator Guy<\/span><\/a><span data-v-f87c67ca=\"\"> and Taiki Maeda who’ve garnered a following by making the technically overwhelming approachable through shareable spreadsheets and click by click guides.&nbsp;&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This is where Intents come in. “Intent based products are a move away from the transactional approach to DeFi,” Aperture’s McDavid Stoddard told <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The Block<\/span><\/i><span data-v-f87c67ca=\"\">. In the transactional model, the transaction is “typically too complicated for the end user to fully understand what’s happening,” he said.<\/span>","<span data-v-f87c67ca=\"\">Intent based architectures enable the average DeFi user to gain access to “the types of execution and pricing that previously were only accessible to well capitalized prop shops operating with an in-house developer team. Even a devoted DeFi user armed with YouTube premium and tracking spreadsheets would fail to get the level of execution and expressibility that is possible with an Intent based DeFi UX.”<\/span>","<span data-v-f87c67ca=\"\">With <\/span><a href=\"https:\/\/app.aperture.finance\/?source=PR&amp;category=Article&amp;tag=Intents&amp;title=Block\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Aperture’s Liquidity Intents solution<\/span><\/a><span data-v-f87c67ca=\"\">, built atop Uniswap V3, the user declares an end goal for their LP position and the transaction is only executed if it matches the user’s desired outcome. A user can, for example, declare that they want their liquidity position to rebalance once ETH hits 3,500 USDC per ETH, rebalance to a 50:50 ratio at a range of 3,400 to 3,600 USDC, and specify the acceptable range of price impact from swaps and gas fees.<\/span>","<span data-v-f87c67ca=\"\">A decentralized network of solvers then works out possible transaction flows which are then simulated and ranked. Aperture has launched with one centralized solver, with third-party solvers including one from<\/span><a href=\"https:\/\/www.propellerheads.xyz\/\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">Propeller Heads<\/span><\/a><span data-v-f87c67ca=\"\"> joining the network in Q2.<\/span>","<span data-v-f87c67ca=\"\">As well as building out its network of third-party solvers, <\/span><a href=\"https:\/\/www.aperture.finance\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Aperture’s future roadmap<\/span><\/a><span data-v-f87c67ca=\"\"> includes several more key components to a fully fledged Intent based DeFi UX. A Large Language Model (LLM) will enable users to express their intent in natural language and have it mirrored back to them in a highly readable Domain Specific Language (DSL) created by Aperture, which can then be delivered to solvers as the user’s “declaration of truth.”<\/span>","<span data-v-f87c67ca=\"\">Stoddard likens the UX to ordering a pizza. “You tell the operator, ‘I want whatever your biggest meatiest pizza is.’ The operator will mirror back to you, ‘Okay, you want our XL meat lovers’ pizza?’ And then the user says, ‘Yes, that one!’” Aperture’s UX will enable the user to declare their DeFi Intents in similar terms. “The user will say, ‘I want you to rebalance me to the highest yielding pool,’ and then the Intents chatbot will mirror back to them the highly readable DSL output which the user will be able to eye-ball and confirm.”<\/span>","<em data-v-f87c67ca=\"\">This post is commissioned by Aperture and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"delta","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"McDavid Stoddard","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Taiki Maeda","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}