{"summary":"Jeanine Hightower-Sellitto, managing director of operations for crypto exchange Gemini, believes that institutional investors will spend 2020 continuing","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/49246\/catching-up-with-gemini-managing-director-jeanine-hightower-sellito","publishDate":"2019-12-16T11:15:19","id":4086,"type":null,"title":"Institutions will continue exploring crypto in 2020, says Gemini managing director Jeanine Hightower-Sellito","category":["EXCHANGES"],"content":["<iframe loading=\"lazy\" src=\"https:\/\/www.youtube.com\/embed\/XL0-3QoF77Y\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" data-v-f87c67ca=\"\"><\/iframe>","Jeanine Hightower-Sellitto, managing director of operations for crypto exchange Gemini, believes that institutional investors will spend 2020 continuing to learn the ins and outs of investing in crypto.&nbsp;","The Block recently spoke with Hightower-Sellitto <a href=\"https:\/\/www.youtube.com\/watch?v=XL0-3QoF77Y&amp;feature=emb_title\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">on the sidelines<\/a> of the Digital Asset Summit in New York in late November. During the interview, she touched on&nbsp;the company’s newly launched custody and settlement products, its position in an increasingly crowded market, and her vision for the upcoming year.","Founded in 2014 by investors Tyler and Cameron Winklevoss, Gemini allows customers to buy, sell, and store a variety of coins including bitcoin, ether, and litecoin and zcash. In September, the company rolled out <a href=\"https:\/\/medium.com\/gemini\/introducing-gemini-custody-936c77977de1\" data-v-f87c67ca=\"\">Gemini Custody<\/a>, a cold storage custody solution targeted at institutional investors, and <a href=\"https:\/\/medium.com\/gemini\/introducing-gemini-clearing-7f54f01e6f89\" data-v-f87c67ca=\"\">Gemini Clearing<\/a>, a regulated clearing and settlement platform that allows for OTC transactions either directly between two entities or brokered by a third party.","Hightower-Sellitto believes that the key to working with institutional customers is to “meet them where they are at” and deliver to them the kind of institutional services they are used to in traditional markets, like options and equities.","In Hightower-Sellitto's view, 2020 will see institutions spending time to figure out the nuts-and-bolts aspects of investing in cryptocurrency, dealing with issues such as asset management, trading and wider strategy.","<b data-v-f87c67ca=\"\">Frank: <\/b>Thank you so much for joining us. We are here at the Digital Assets Summit superiority in Lower Manhattan. I'm pleased we're joined by Jeanine Hightower-Selitto. She just got off her panel with Tim McCourt at CME. They were talking institutionalization of the crypto market. She joins us from Gemini, the cryptocurrency exchange where you're managing director. It's been a year, &nbsp;it's been a fair amount of time. How's it going?","<b data-v-f87c67ca=\"\">Jeanine: <\/b>It's going really well. We're working on a lot of new products. We recently launched a custody solution, so a completely cold storage custody solution, as well as a clearing solution for institutional customers. So we've been working on a lot of new things.","<b data-v-f87c67ca=\"\">Frank: <\/b>So everybody knows Gemini from the Winklevoss, brothers, twins and for the exchange and for the taxicab marketing you guys have going around the city and in many other cities in the country. But you are trying to branch out with the revamped custody solution with settlement. You have deep market structure, markets, background building, International Securities Exchange, ISE, which then sold to Nasdaq. Tell us a little bit about how you're bringing the old world to the new world in your new seat at Gemini.","<b data-v-f87c67ca=\"\">Jeanine: <\/b>A lot of the things I think about are how do you bring services to the institutional customer to meet them where they're at? Because institutional customers in any other asset class in particular options and equities where I came from, expect the same types of markets that they would in any other service offering. So from the perspective of Gemini, we're looking to deliver to them all the institutional services that they expect already and help ease their transition into crypto.","<b data-v-f87c67ca=\"\">Frank: <\/b>The one aspect, the one thing we were talking about before we turned the video recording on was settlement and clearing. It's a thorny topic. A lot of people don't understand it when they think about trading in this market. They think OTC they think Skype and interacting on a bilateral basis between two counterparties. Why do we need a third party like Gemini to sit behind the trade? And what are they doing in the background? Exactly.","<b data-v-f87c67ca=\"\">Jeanine: <\/b>Gemini offers a third party clearing and settlement service for OTC transactions so it can be traded between two people or two entities as well as trades that are brokered by a third party. We don't actually offer any of the brokerage services. We're not doing the price discovery. These are trades that are completely negotiated off our exchange platform, but it uses the exchange accounts of our customers to basically be able to clear and settle those transactions so they're fully on-boarded, they meet all our KYC obligations. All of the firms have pretty much integrated Gemini into their back-office from a fixed connectivity perspective for trade reporting. And what the clearing and settlement solution does is allow you to use the assets that are already in your account because you're trading on Gemini is fully funded to instantaneously clear and settle OTC trades. So rather than engaging in a transaction and having to wire funds or receive coin from another entity, those assets can be immediately made available to you so you can just move on to the next transaction.","<b data-v-f87c67ca=\"\">Frank: <\/b>And so trading group A or entity A they want to buy a certain amount of coin. Trader from B quotes a price and then you take both of those assets.","<b data-v-f87c67ca=\"\">Jeanine: <\/b>So trading firm A trading firm, B agree on a price, they enter the quantity, the price they've agreed upon. And each of their sides, the trade goes out for confirmation. So we have an API that's available to those customers or the front end. They can confirm both sides of the trade and they decide on a settlement window. Is it fully funded? So it's an immediate settlement? Or do they need a delayed settlement because someone needs to move additional assets into the platform for clearing?","<b data-v-f87c67ca=\"\">Frank: <\/b>What are the benefits of trading on a bilateral basis OTC with Gemini sitting in the background as the clearing settlement entity, versus tapping the exchange directly for liquidity?","<b data-v-f87c67ca=\"\"><\/b>Well, there's a different market for both. So we recognize that a lot of institutional customers use the OTC markets because they have size trades. They don't want to leave a footprint in the marketplace. So any trade that's done and settled through Gemini clearing isn't reported to the tape. It's still anonymous. It's still not even reported to the market in terms of a trade. And that's something that a lot of institutional customers need in terms of their trading style.","<b data-v-f87c67ca=\"\">Frank: <\/b>Do you see the fact that, you know, Gemini, although it has a great brand and is well respected, especially among the regulators I talked to, still hasn't been able to capture all that much market share on the exchange side compared to others, is OTC and settlement a avenue to capture and grow market share in other areas of the market.","<b data-v-f87c67ca=\"\">Jeanine: <\/b>I think that clearing and settlement platform as well as custody are unique businesses to Gemini. And while it'd be great if they had influence on the overall market and because assets are there, people maybe are more likely to trade. But they are unique and independent business on their own that are meant to provide services to our institutional customers in a way that's not really being met in the marketplace today.","<b data-v-f87c67ca=\"\">Frank: <\/b>When you think about custody, it's a really crowded space. You have firms like Bakkt just outside institutional offering. Fidelity has as well, but they're still just bitcoin, right? Gemini is offering custody for a vast array of coins. When we think about the differentiator when you're out selling to hedge fund clients or other types of clients, what do you pitch as the differentiator?","<b data-v-f87c67ca=\"\">Jeanine: <\/b>I think a lot of it is really in the details. And it's something that really can't be stated enough in this market. Understanding the security profile, the operational security and for example, we have Deloitte doing an audit for our SOC 2. Our hardware is seemingly superior to everyone else is out there. Our operational processes obviously have been vetted by Deloitte. And so making sure you understand the nuts and bolts, because ultimately as an investor and representing investors, you're responsible for their assets and choosing a custodian and making sure you're really doing all your due diligence. I think when people really come into our office and vet us, it's been pretty clear in terms who provides the best service.","<b data-v-f87c67ca=\"\">Frank: <\/b>Interesting. What are the trends you're seeing or thinking about as we enter 2020? When it comes to the institutionalization of the market.","<b data-v-f87c67ca=\"\">Jeanine: <\/b>I think we're seeing a lot of interest. We continue to see interest from different types of institutions, some of the banks, some of the buy-side shops that are sort of dipping their toes in the water a little bit. Recently, you know, Harvard announced they put some money in crypto a little bit, not a lot, but people are starting to dive into it and do sort of their evaluations of how do they store the assets? How do they trade? Where they need be connected? What does it mean to be in crypto? I think that trend will continue to grow over the next year.","<b data-v-f87c67ca=\"\">Frank: <\/b>Great. Well, we'll talk next year. We'll see what happens.","<b data-v-f87c67ca=\"\">Jeanine: <\/b>Thanks Frank.","<b data-v-f87c67ca=\"\">Frank: <\/b>Thanks Jeanine.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"Sellitto","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"Selitto","content":"PERSON"},{"type":"Tyler","content":"PERSON"},{"type":"crypto exchange Gemini","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"CME","content":"ORGANIZATION"},{"type":"Digital Asset Summit","content":"ORGANIZATION"},{"type":"Harvard","content":"ORGANIZATION"},{"type":"Gemini Custody","content":"ORGANIZATION"},{"type":"Lower Manhattan","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Gemini","content":"LOCATION"},{"type":"Jeanine","content":"PERSON"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"International Securities Exchange","content":"ORGANIZATION"},{"type":"Gemini Clearing","content":"ORGANIZATION"},{"type":"Jeanine Hightower","content":"PERSON"},{"type":"OTC","content":"ORGANIZATION"},{"type":"Hightower","content":"PERSON"},{"type":"Cameron Winklevoss","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Tim McCourt","content":"PERSON"},{"type":"Deloitte","content":"ORGANIZATION"},{"type":"Winklevoss","content":"LOCATION"},{"type":"Skype","content":"ORGANIZATION"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["GEMINI"],"authors":["Frank Chaparro","Yilun Cheng","The Block"]}