{"summary":"DeBridge has announced deSwap Liquidity Network (DLN) which aims to make bridging more secure by no longer locking assets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/174913\/debridge-announces-deswap-liquidity-network","publishDate":"2022-10-05T07:01:35","id":4087,"type":null,"title":"DeBridge announces deSwap Liquidity Network for more secure bridging","category":["THE BLOCK"],"content":["DeBridge, a cross-chain bridging platform that pioneered the popular “locked liquidity” bridging model, has announced deSwap Liquidity Network (DLN), which aims to make cross-chain transfers and applications more secure by no longer locking assets.","DLN is expected to go live by November, and currently has integrations with Ethereum, Arbitrum, Solana, Avalanche, and Optimism, among others.","DeBridge claims that DLN will enable zero slippage transfers of any size and that it will have the lowest fees across all bridges. It also claims that DLN transferring liquidity instead of locking it avoids the risk of Maximum Extractable Value, Automated Market Maker (AMM) fees for wrapped assets, and the creation of honeypots from hackers.","DLN differs from the current popular bridging model in which users lock a token and receive a wrapped asset. This has been one of the <a href=\"https:\/\/www.theblock.co\/post\/163612\/why-are-cross-chain-bridges-prime-targets-for-hackers-and-what-can-we-do-about-it\" data-v-f87c67ca=\"\">largest bridge vulnerabilities<\/a> exploited this past year. Instead, DLN transfers the liquidity between chains, which removes the need to lock assets.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Arbitrum","content":"LOCATION"},{"type":"DLN","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"November","content":"DATE"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}