{"summary":"Curve Finance will redeploy code for its crypto-backed stablecoin, a day after the stablecoin&#x27;s smart contracts were deployed on Ethereum.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229469\/curve-redeploys-crvusd-stablecoin-ethereum-mistake","publishDate":"2023-05-04T08:02:48","id":4089,"type":null,"title":"Curve Finance to redeploy crvUSD stablecoin on Ethereum","category":["CRYPTO ECOSYSTEMS"],"content":["Curve Finance will rerelease code for its crypto-backed stablecoin following \"a mistake in the deployment script,\" a day after the stablecoin's smart contracts were deployed on the Ethereum mainnet.&nbsp;","This comes after the team <a href=\"https:\/\/twitter.com\/CurveFinance\/status\/1654060295835246592\" data-v-f87c67ca=\"\">identified<\/a> a problem with the initial deployment that would prevent vote-escrowed Curve (veCRV) token holders from earning rewards from liquidity pools containing its new crvUSD stablecoin. To resolve this issue, the team said it would need to redeploy the stablecoin.","This announcement follows the team's <a href=\"https:\/\/www.theblock.co\/post\/229436\/curve-finance-deploys-crvusd-stablecoin-on-ethereum-mainnet\" data-v-f87c67ca=\"\">confirmation<\/a> yesterday that the smart contracts for crvUSD had been deployed. However, they also noted that the final launch was not yet complete as a user interface — a frontend for interacting with the crvUSD smart contracts — remained under development.","Curve uses a vote-escrowed model, allowing CRV holders to stake their tokens in exchange for another token, veCRV, which includes staking rewards and incentives. The initial version of crvUSD contained an issue to properly distribute rewards to veCRV holders due to an error in the deployment script, per the team.&nbsp;","\"After some peer review of deployments, it was found that the current version of crvUSD needs redeployment, which will follow shortly today. veCRV wouldn't receive fees with this one due to a mistake in the deployment script,\" Curve Finance <a href=\"https:\/\/twitter.com\/CurveFinance\/status\/1654060295835246592\" data-v-f87c67ca=\"\">tweeted<\/a>.","The team <a href=\"https:\/\/twitter.com\/CurveFinance\/status\/1654060295835246592\" data-v-f87c67ca=\"\">requested<\/a> that a DeFi user with a specific <a href=\"https:\/\/etherscan.io\/address\/0x38abab9766e0b27d2912718a884292b8e7eb2803\" data-v-f87c67ca=\"\">address<\/a> (0x38) contact them since a fresh deployment could potentially render the existing version of the stablecoin useless in the future. The owner of that address had <a href=\"https:\/\/etherscan.io\/tx\/0x6b426a2b911df09e97f9a555e90ae493625a029d1099c57cc357a6e37bbb47b1\" data-v-f87c67ca=\"\">purchased<\/a> 49,970 crvUSD stablecoins earlier from Curve's liquidity pool.","The Curve developers also left an <a href=\"https:\/\/etherscan.io\/tx\/0x13d4162a4fb62c7b65fec6b59afe5bfc3d3ba3b44fd36a8c65ff382bc84fb1d4\" data-v-f87c67ca=\"\">on-chain message<\/a> for the user stating: \"Please contact @CurveFinance on Twitter or @michwill on Telegram to swap back crvUSD to USDC OTC. crvUSD is getting redeployed.\"","In response, the user <a href=\"https:\/\/etherscan.io\/tx\/0x0c34f0a218ea2dc74a5d73a417a0ba82cd8474a7ed67067b9a179d9bd8b2a08f\" data-v-f87c67ca=\"\">sent back<\/a> the tokens and <a href=\"https:\/\/etherscan.io\/tx\/0x6077aa7e593e8c97502ddfee5c46e9f3928e0193b4642668b089a3b0f8dcd613\" data-v-f87c67ca=\"\">received<\/a> 49,965 USDC in exchange via an apparent over-the-counter swap, on-chain data show.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USDC OTC","content":"ORGANIZATION"},{"type":"Curve Finance","content":"ORGANIZATION"},{"type":"CRV","content":"ORGANIZATION"},{"type":"2023","content":"DATE"}],"hashtag":["ASSETS"],"authors":["Vishal Chawla","The Block"]}