{"summary":"The outrageous demands left many Prisma Finance users skeptical, especially since the hacker has already hidden millions of dollars.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285776\/prisma-finance-hacker-defends-exploit-demands-public-apology","publishDate":"2024-03-30T12:43:52","id":4092,"type":null,"title":"Prisma Finance hacker defends exploit, demands public apology","category":["CRYPTO ECOSYSTEMS"],"content":["One of the wallets tied to the hack of Prisma Finance, a liquid staking protocol that was exploited for $11 million by multiple attackers on Mar. 28, has claimed to be a \"white-hat\" hacker interested in returning funds to the protocol, rather than a \"black-hat\" hacker who would keep the funds for themself.&nbsp;","Before considering returning the funds, the hacker has demanded that the Prisma Finance team hold an online press conference, identify themselves publicly, and apologize to users, investors, and praise the hacker for working with them to solve the issue.","In an on-chain <a href=\"https:\/\/etherscan.io\/idm?addresses=0x2d413803a6ec3cb1ed1a93bf90608f63b157507a,0xd8531a94100f15af7521a7b6e724ac4959e0a025&amp;type=1\" data-v-f87c67ca=\"\">message<\/a> to Prisma Finance, the hacker criticizes the Prisma team for not catching the mistake, and claims that the press conference would help send a message to the entire decentralized finance space. \"I hope this would help ppl be more careful participating in defi, the teams would be more responsible, and everyone would change their minds about things like this,\" the hacker wrote in an <a href=\"https:\/\/etherscan.io\/idm?addresses=0x2d413803a6ec3cb1ed1a93bf90608f63b157507a,0xd8531a94100f15af7521a7b6e724ac4959e0a025&amp;type=1\" data-v-f87c67ca=\"\">on-chain message<\/a> to Prisma Finance.","\"After it happens, the amount I would keep, and the amount that I can send to you would be discussed (stay assured, most of it would be returned),\" the hacker concluded.&nbsp;","Occasionally, hacked protocols are able to recover funds by negotiating with attackers. However, the hacker's unusual demands, coupled with their <a href=\"https:\/\/www.theblock.co\/post\/285590\/prismafi-hacker-moves-stolen-eth-tornado\" data-v-f87c67ca=\"\">transfers<\/a> of over $2.5 million in ether to blockchain mixing service Tornado Cash, have left many Prisma Finance users skeptical of the hacker's true motives.&nbsp;","\"This guy seems like he's playing around and deciding whether to play white hat with these public communications,\" one user on Prisma Finance's Discord server wrote. \"He's doing a 'trust me bro' with millions of dollars in [Tornado Cash].\"","Prisma Finance has paused the protocol and published a <a href=\"https:\/\/hackmd.io\/@PrismaRisk\/PostMortem0328\" data-v-f87c67ca=\"\">post-mortem<\/a> on the attack, describing the vulnerability as a lack of input validation on a certain smart contract function. \"While retrieving all users funds is our main focus right now, unpausing the protocol will be part of the next steps once we are sure that all positions are safe,\" the team wrote.&nbsp;","Prisma Finance has yet to respond to the hacker and did not immediately respond to a request for comment from The Block.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"$11 million","content":"MONEY"},{"type":"Prisma Finance","content":"ORGANIZATION"},{"type":"$2.5 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Mar. 28","content":"DATE"},{"type":"millions of dollars","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Prisma","content":"ORGANIZATION"}],"hashtag":["EXPLOITS","HACKS"],"authors":["Zack Abrams","The Block"]}