{"summary":"Polkadot’s DeFi-focused parachain Acala has reopened its services to users, three weeks after a major security incident.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/174981\/acala-restores-full-operations-after-users-error-minted-3-billion-ausd","publishDate":"2022-10-05T07:37:23","id":4096,"type":null,"title":"Acala restores full operations after users &#x27;error minted&#x27; 3 billion aUSD","category":["DEFI"],"content":["<span data-v-f87c67ca=\"\">Polkadot’s DeFi-focused parachain Acala announced on Wednesday that it has fully reopened its services to users three weeks after a major security incident. This comes after <\/span><span data-v-f87c67ca=\"\">its governance body approved the third and final vote to do so.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">“The community referendum for stage 3\/3 of resuming Acala operations has been executed. All functionalities on Acala are now live,” the project <\/span><a href=\"https:\/\/twitter.com\/AcalaNetwork\/status\/1577472328929116160\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">tweeted<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">Acala works as an app-specific parachain that aims to be a finance hub on Polkadot. It offers a native decentralized stablecoin called Acala USD (aUSD) that can be minted using collateral tokens — including polkadot (DOT), kusama (KSM), acala (ACA) and karura (KAR) — and then be staked for yield.<\/span>","<span data-v-f87c67ca=\"\">On 13 August, Acala suffered a security exploit as a result of a code misconfiguration in a smart contract that controlled a&nbsp; liquidity pool. The misconfiguration led liquidity providers (LPs) to “error mint” nearly 3 billion of aUSD when they withdrew their assets. The LPs then repeatedly added more liquidity to receive more aUSD in a loop.&nbsp;<\/span><span data-v-f87c67ca=\"\">In total, about 300 addresses had illegitimately taken out 3.02 billion aUSD in their wallets. Only a a small portion was transferred out to other parachains. The incident resulted in aUSD <a href=\"https:\/\/www.theblock.co\/post\/163467\/polkadot-based-stablecoin-ausd-depegs-after-acala-network-breach\" data-v-f87c67ca=\"\">losing its peg<\/a> with the US dollar.<\/span>","<span data-v-f87c67ca=\"\">After this was detected, the team quickly suspended the network through an emergency governance vote. Subsequently, the team <\/span><a href=\"https:\/\/www.theblock.co\/post\/164095\/acala-recovers-2-97-billion-of-ausd-stablecoin-minted-during-exploit\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">froze<\/span><\/a><span data-v-f87c67ca=\"\"> the large majority of exploited funds traced on the Acala network and burned them.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Following the token burn, it planned a phased approach to resuming the operations with each phase getting approved with a governance vote. <\/span><span data-v-f87c67ca=\"\">In the first phase, the Acala governance body voted to turn on the network on Sept. 26 in the <a href=\"https:\/\/twitter.com\/AcalaNetwork\/status\/1574248749265829889\" data-v-f87c67ca=\"\">initial phase<\/a>, letting users manage or close their positions while advanced services like oracles, and collateralized lending remained shut. These services have now been turned on in an effort to bring the DeFi chain back to pre-exploit state. <\/span>","<span data-v-f87c67ca=\"\">The team told The Block that all of the 10.9 million aUSD stablecoin in present circulating supply across user wallets and Acala’s liquidity pools remain fully backed 1:1 by crypto assets. It added all of the aUSD error mints were recovered in value except 5.8 million. This amount has been re-collateralized by the team using its own funds.<\/span>","<span data-v-f87c67ca=\"\">“A series of community governance votes have been passed, such that all liquidity pools are now re-capitalized and rebalanced, and all aUSD in circulation are now fully collateralized,” Bette Chen, co-founder of Acala told The Block in a statement.<\/span>","Despite this, the aUSD stablecoin currently trades at just $0.96, according to Karura Swap via <a href=\"https:\/\/www.coingecko.com\/en\/coins\/acala-dollar\" data-v-f87c67ca=\"\">CoinGecko<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Acala USD","content":"ORGANIZATION"},{"type":"3.02 billion","content":"MONEY"},{"type":"$0.96","content":"MONEY"},{"type":"Sept. 26","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Bette Chen","content":"PERSON"},{"type":"3 billion","content":"MONEY"},{"type":"KSM","content":"LOCATION"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}