{"summary":"Fantom (FTM) token emissions may continue beyond 2024 based on the outcome an ongoing governance vote that seeks to cut staking rewards.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/162506\/fantom-community-voting-on-a-proposal-to-reduce-staking-rewards","publishDate":"2022-08-09T14:00:47","id":4097,"type":null,"title":"Fantom community voting on a proposal to reduce staking rewards","category":["GOVERNANCE"],"content":["The Fantom community is currently voting on a governance <a href=\"https:\/\/forum.fantom.network\/t\/reducing-validator-rewards\/86\" data-v-f87c67ca=\"\">proposal<\/a> that seeks to reduce the rewards paid to network validators.","Fantom rewards users for staking their FTM — the blockchain’s native asset — on the network. Users with 50,000 staked FTM can also run validator nodes to process transactions on the network and earn rewards as well. Fantom’s staking reward is currently at 13% for staked tokens with a one-year vesting period. These rewards are from <a href=\"https:\/\/www.theblock.co\/post\/156122\/fantom-community-voting-on-whether-to-use-burn-fee-to-fund-projects\" data-v-f87c67ca=\"\">transaction fees paid on the network<\/a> and are scheduled to be distributed up until 2024.","This new Fantom proposal argues for a reduction of the 13% staking reward rate so as to be in line with the market average.&nbsp;According to the proposal authored by Fantom Foundation business development director Sam Harcourt, Fantom’s rate is higher than other major “notable” Layer 1 networks including Ethereum, Solana, Avalanche, and Binance Smart Chain (BNB).","The proposal also argued in favor of reducing the rate given the increase in the volume of Fantom staking rewards for validators. Data from FTMScan shows that there was a 120,000% increase in earnings for validators between January 2021 and January 2022.","By reducing the reward rate for validators, Harcourt’s proposal could extend FTM emissions beyond 2024. The proposal has five voting choices, four of which give the option for reduced rates of 3% up to 6%. These rates will extend FTM emissions by between four to nine years (2026 to 2031). The fifth voting choice is to not change the reward rate which will see Fantom emissions end in 2024.","Voting on the proposal began on Monday and can run until February 4, 2023. The vote may end on August 15 if the polls have reached the 67% quorum mark. Quorum is currently only at 1.8% as of the time of publishing. Data from the <a href=\"https:\/\/beta.fwallet.fantom.network\/governance\/proposal\/0x17\" data-v-f87c67ca=\"\">voting page<\/a> shows 99% of voters in favor of a 6% staking reward rate on the network. Fantom emissions will continue for another four years if this reward rate emerges as the winner of the vote.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"6%","content":"PERCENT"},{"type":"2026","content":"DATE"},{"type":"Binance Smart Chain (BNB","content":"ORGANIZATION"},{"type":"3%","content":"PERCENT"},{"type":"January 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"January 2021","content":"DATE"},{"type":"1.8%","content":"PERCENT"},{"type":"120,000%","content":"PERCENT"},{"type":"67%","content":"PERCENT"},{"type":"Fantom Foundation","content":"ORGANIZATION"},{"type":"99%","content":"PERCENT"},{"type":"August 15","content":"DATE"},{"type":"Sam Harcourt","content":"PERSON"},{"type":"Fantom","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"February 4, 2023","content":"DATE"},{"type":"13%","content":"PERCENT"},{"type":"FTM","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}