{"summary":"UK’s tax authority HMRC is looking to deploy a blockchain analytics tool to catch crypto cybercriminals\nHMRC wants to track crypto transactions of coins including BTC, ETH and XRP\nLast August, HMRC was demanding customer and transaction information from crypto exchanges Coinbase, eToro, and CEX.IO.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/53473\/uks-tax-authority-wants-to-deploy-a-blockchain-analytics-tool-to-catch-crypto-cybercriminals","publishDate":"2020-01-20T11:00:45","id":410,"type":null,"title":"UK’s tax authority wants to deploy a blockchain analytics tool to catch crypto cybercriminals","category":["Cryptocurrency"],"content":["HM Revenue and Customs (HMRC), the U.K.’s tax authority, is looking to deploy a blockchain analytics tool that could help it identify cybercriminals trading in cryptocurrencies.","The tax agency wants to analyze cryptocurrency transactions, such as for bitcoin and ether, which are being used for “tax evasion and money-laundering,” news outlet PublicTechnology <a href=\"https:\/\/www.publictechnology.net\/articles\/news\/hmrc-seeks-tech-unearth-cryptocurrency-cybercriminals\" data-v-f87c67ca=\"\">reported<\/a> Monday, citing HMRC’s request for proposal document.","Specifically, HMRC is looking for a tool which, at a minimum, would help track seven digital assets - bitcoin (BTC), bitcoin cash (BTC), ether (ETH), ether classic (ETC), XRP, litecoin (LTC) and Tether (USDT) stablecoin.","HMRC would also prefer a tool that could develop the ability to track privacy-oriented coins such as Monero (XMR), Zcash (ZEC), and Dash (DASH), per the report.","The tax agency is ready to spend £100,000 ($130,000) toward licensing for the chosen tool. It is inviting proposals from potential suppliers until January 31 and looking to start a contract on February 17.","Blockchain analytics firms Chainalysis, Elliptic and CipherTrace could be some of the potential suppliers as these firms help track crypto transactions. U.K.-based Elliptic, for instance, recently <a href=\"https:\/\/www.theblockcrypto.com\/post\/47675\/blockchain-analytics-firm-elliptic-finds-over-400m-xrp-tied-to-illegal-activities\" data-v-f87c67ca=\"\">found<\/a> over $400 million worth of XRP transactions related to illegal activities such as scams and Ponzi schemes.","“Many of these crypto-asset transactions are recorded publicly in a ledger known as a blockchain. Whilst the transactions are typically public, the participants undertaking them are not,” HMRC was quoted as saying in Monday’s report.","The tax agency is, therefore, seeking the “provision of a tool that will support intelligence-gathering methods to identify and cluster crypto-asset transactions into linked transactions and identify those linked to crypto-asset service providers.”","Last August, HMRC was also <a href=\"https:\/\/www.theblockcrypto.com\/linked\/34934\/british-tax-agency-demands-customer-information-from-exchanges-including-coinbase\" data-v-f87c67ca=\"\">demanding<\/a> customer and transaction information from crypto exchanges Coinbase, eToro, and CEX.IO. The tax agency had sent out letters to these exchanges requesting customers' names and transaction histories, stating that “these transactions may result in potential tax charges and HMRC has the power to issue notices requiring exchanges to provide this information.”"],"hashtag":["HMRC","XRP"]}