{"summary":"Zerion has started a closed beta for its in-browser wallet, which shows token balances across more than 10 blockchains in one place.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/183304\/zerion-prepares-to-take-on-metamask-with-in-browser-wallet","publishDate":"2022-11-04T16:22:38","id":4102,"type":null,"title":"Zerion prepares to take on MetaMask with in-browser wallet","category":["WALLETS"],"content":["Crypto wallet Zerion is gearing up to launch an in-browser web extension as it prepares to take on industry leader MetaMask. The web extension is now in a closed beta and is expected to go live by the end of November.","The web extension supports multiple seed phrases and has gone through audits with three security companies, according to an announcement at Breakpoint in Lisbon, Portugal.","Zerion takes a fundamentally different approach to its wallet user experience. It lets users see their token balances across multiple blockchains in one place. This is different from MetaMask, which shows token balances on each blockchain at a time, which means users have to switch between networks to see all their tokens.","The wallet also shows NFTs within the extension, similar to the Phantom wallet on the Solana blockchain. It takes NFTs on multiple blockchains and presents them in one place, in the same way as normal tokens.","When it comes to making transactions on different blockchains, the wallet automatically switches networks on behalf of the user. For security reasons, it lets users know what networks they are using. This is intended to make using cross-chain applications much easier.","“Transactions are essential web3 actions that every user makes but current wallets make the signing process slow, unclear and create anxiety,\" Zerion Chief Operating Officer Vadim Koleoshkin said. \"Our extension targets this moment specifically to make transactions smoother, secure and more transparent.\"","The crypto industry has grown across more blockchains over the last few years. Many blockchains now have their own set of applications and scaling layers. With this, users are holding their tokens in different applications on different layers on different blockchains, making it tricky to keep track of all their funds. That's the problem Zerion — and rivals like Zapper and DeBank — are trying to solve.","Zerion started as a portfolio tracker before launching a non-custodial wallet app on mobile devices. The extension will look like the mobile app and function in the same way.","The app supports more than 10 blockchain networks, including Ethereum-compatible blockchains like Avalanche and Polygon; Ethereum scaling solutions, like Abritrum and Optimism; as well as Solana. Trading is not yet enabled on Solana.","Zerion has integrated other crypto projects into the mobile app. It has integrated the Lens network, which was launched by DeFi app Aave — letting users send tokens to Lens addresses (similar to using the Ethereum Name Service). Lens is an experimental decentralized social graph used to create social networks. Zerion also uses the 1inch API to let users make swaps using various decentralized exchanges.","Looking ahead, Zerion is planning to add a browser for decentralized applications into its mobile app. This will let users browse applications, create transactions and sign them within the app. Zerion is also introducing a multi-chain transaction history, letting users see what transactions they have made, across all chains, in one place.","Zerion raised $12 million in a Series B fundraise in October. The application has more than 200,000 users and has seen more than $1.5 billion in trading volume for token swaps, it said at the time. The company is now based in Lisbon.","<em data-v-f87c67ca=\"\">Update: This story has been updated with comment from Zerion Chief Operating Officer Vadim Koleoshkin.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$12 million","content":"MONEY"},{"type":"Portugal","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"$1.5 billion","content":"MONEY"},{"type":"November","content":"DATE"},{"type":"Ethereum Name Service","content":"ORGANIZATION"},{"type":"Vadim Koleoshkin","content":"PERSON"},{"type":"Ethereum","content":"PERSON"},{"type":"DeBank —","content":"ORGANIZATION"},{"type":"Zerion","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Lisbon","content":"LOCATION"},{"type":"Solana","content":"LOCATION"}],"hashtag":["TOKENS"],"authors":["Tim Copeland","The Block"]}