{"summary":"ProShares and Bitwise have filed applications with the U.S. Securities and Exchange Commission for bitcoin and ether exchange-traded funds.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/243157\/proshares-bitwise-bitcoin-ether-etf-applications","publishDate":"2023-08-04T04:49:20","id":4103,"type":null,"title":"ProShares and Bitwise file for more bitcoin and ether ETFs","category":["MARKETS"],"content":["ProShares and Bitwise both have applications with the U.S. Securities and Exchange Commission for exchange traded funds to offer exposure to both bitcoin and ether.&nbsp;","ProShares' filing <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1174610\/000168386323005834\/f26041d1.htm\" data-v-f87c67ca=\"\">states<\/a> that its Bitcoin and Ether Equal Weight Strategy ETF \"seeks investment results, before fees and expenses, that track the performance of the Bitcoin and Ether Equal Weight Index.\"","ProShares currently boasts several crypto-related funds, including a bitcoin futures ETF. It also <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1174610\/000168386321007439\/f10626d1.htm\" data-v-f87c67ca=\"\">filed<\/a> an application with the SEC for a metaverse-focused ETF late last year.","Meanwhile, Bitwise’s Bitcoin and Ether Market Weight ETF—which would offer exposure matching the market cap of the two crypto currencies—filing <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1928561\/000138713123009271\/btcmarket-485apos_080323.htm\" data-v-f87c67ca=\"\">claims<\/a> it \"seeks to provide investors with capital appreciation.\"","Additionally, Bloomberg analyst James Seyffart tweeted that Bitwise also filed for an equal weight version of its dual bitcoin and ether futures ETF. \"We're up to a full dozen ether futures ETF filings now,\" he <a href=\"https:\/\/twitter.com\/JSeyff\/status\/1687307603922055168\" data-v-f87c67ca=\"\">noted<\/a>.","In recent months, the crypto industry and market participants have been buzzing over the prospect of a spot bitcoin ETF finally garnering approval from the SEC — which, so far, only has gave the green light for derivative-tied bitcoin futures ETFs.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"James Seyffart","content":"PERSON"},{"type":"Bitwise","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Bitwise’s Bitcoin","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":["SEC"],"authors":["Adam James","The Block"]}