{"summary":"Espresso is building a marketplace for shared sequencing, enhancing interoperability among Layer 2 rollups.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283558\/espresso-raises-28-million-in-series-b-round-for-shared-sequencing-marketplace","publishDate":"2024-03-21T12:00:03","id":4107,"type":null,"title":"Espresso raises $28 million in series B round led by a16z crypto","category":["CRYPTO ECOSYSTEMS"],"content":["Blockchain project Espresso Systems closed a $28 million Series B funding round led by a16z crypto.","After <a href=\"https:\/\/www.theblock.co\/post\/136623\/stanford-researchers-raise-32-million-as-they-build-a-privacy-focused-blockchain\" data-v-f87c67ca=\"\">raising<\/a> $30 million during a Series A round in 2022 and $2 million in seed funding in 2020, the latest round brings Espresso’s total funds to over $60 million. The firm did not disclose its latest valuation.","The round was opened for negotiation in early Q4 2023 and closed with a16z in early 2024, Espresso said. The project is currently in the process of closing with additional strategic investors.","<a href=\"https:\/\/www.theblock.co\/post\/203571\/zksync-integrating-espresso-systems-technology-to-enable-private-transactions\" data-v-f87c67ca=\"\">Espresso<\/a> is building a marketplace for shared sequencing, allowing rollups to auction the rights to build their blocks. According to Espresso, this setup facilitates interoperability among rollups and offers opportunities for various stakeholders, including Layer 1 block proposers (such as on Ethereum), to participate.","“Anyone can participate in this marketplace, including L1 proposers and rollups themselves. Rollups that don’t want to worry about sequencing can entirely rely on Espresso with full confidence that they are fully compensated for the value they create, while maintaining their sovereignty,” CEO Ben Fisch told The Block.","A shared sequencer is a party or protocol that produces blocks for multiple rollups simultaneously. A marketplace in this setup will enable rollups to sell shared sequencing rights by the timeslot to third-party bidders.","Espresso is creating a marketplace that enables rollups to designate a default sequencer and establish a minimum price for transferring sequencing rights from the default sequencer to an external entity. If rollups prefer not to manage sequencing, the marketplace can manage it on their behalf, Fisch explained.","“The evolution from Espresso as a single decentralized shared sequencer to a marketplace for shared sequencing is critical to rollup sovereignty and value capture,” Ben Fisch said.","In the end, Espresso aims to enable rollup users to gain the experience of being on one Ethereum chain with improved composability. All this while turning their project into a decentralized marketplace for shared sequencing that preserves the sovereignty and value capture of individual rollups, according to the project.","Espresso integrates a finality tool called HotShot, which ensures quick finalization of blocks. In other words, HotShot serves as the consensus protocol for Espresso’s shared sequencer ecosystem. The project also has a data availability layer for sovereign rollups called Tiramisu.","“Espresso brings faster shared confirmations of transactions to all its integrated rollups, which, among other benefits, drastically lowers the risk for cross-chain liquidity providers, enabling faster bridging among rollups,” Fisch added.","In April, Espresso will be releasing its fifth testnet — Cappuccino. Compared to its current testnet, Cappuccino will be further decentralized and include various enhancements, setting the stage for the launch of the Espresso marketplace. The team is targeting a mainnet launch later in 2024.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Fisch","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"Ben Fisch","content":"PERSON"},{"type":"Espresso Systems","content":"ORGANIZATION"},{"type":"$2 million","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$28 million","content":"MONEY"},{"type":"$30 million","content":"MONEY"},{"type":"$60 million","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"April","content":"DATE"},{"type":"HotShot","content":"ORGANIZATION"}],"hashtag":["MODULAR","PROTOCOLS","ROLLUPS","SERIES B","SMART CONTRACTS"],"authors":["Vishal Chawla","The Block"]}