{"summary":"Alameda liquidators were liquidated for $73,000 on Aave as they attempted to withdraw funds from the platform by removing the collateral first.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/201674\/alameda-liquidators-get-liquidated-on-aave-as-they-try-to-consolidate-funds","publishDate":"2023-01-12T13:24:31","id":4112,"type":null,"title":"Alameda liquidators get liquidated on Aave as they try to consolidate funds","category":["COMPANIES"],"content":["Alameda liquidators lost $72,000 on DeFi lending platform Aave after getting liquidated themselves while attempting to recover funds for creditors.","The liquidators were trying to close the position and in the process first removed the extra collateral used for the position, putting it at risk of liquidation. Crypto data platform <a href=\"https:\/\/www.arkhamintelligence.com\/\" data-v-f87c67ca=\"\">Arkham<\/a> noted in a report shared with The Block that over the course of nine days, the position was <a href=\"https:\/\/etherscan.io\/token\/0x9ff58f4ffb29fa2266ab25e75e2a8b3503311656?a=0x712d0f306956a6a4b4f9319ad9b9de48c5345996\" data-v-f87c67ca=\"\">liquidated twice<\/a> for a total of 4.05 aWBTC, a token used on Aave that is backed by bitcoin. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThese funds will no longer be recoverable for creditors.&nbsp;","The data is based on wallets that have been tagged as relating to Alameda by The Block’s Vice President of Research Larry Cermak and used to label wallets on Ethereum block explorer Etherscan. Funds from these wallets have been swept into a <a href=\"https:\/\/etherscan.io\/address\/0xf02e86d9e0efd57ad034faf52201b79917fe0713\" data-v-f87c67ca=\"\">single wallet<\/a> controlled by a multi-sig, which now holds $19.6 million of ether and $140 million of various tokens on Ethereum.","The liquidators also tried and failed to remove large amounts of LDO tokens from one of the wallets, apparently not noticing that many of the tokens were still being vested, Arkham noted. They made nine failed transactions before successfully making withdrawals using smaller amounts.","Over the last two weeks, around $1.4 million has been returned to this wallet from various other wallets associated with Alameda. Prior to that, around 11,350 ether ($15.9 million) was sent to it from a wallet associated with crypto exchange Deribit.","The liquidators started consolidating the tokens after <a href=\"https:\/\/twitter.com\/ArkhamIntel\/status\/1608204990581202946?s=20&amp;t=sApd0A4nVXpeGcaIChHQGg\" data-v-f87c67ca=\"\">seemingly losing<\/a> $1.7 million in an attack in December. These tokens were moved to crypto mixing services, presumably in an attempt to launder the funds.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$1.7 million","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Larry Cermak","content":"PERSON"},{"type":"Arkham","content":"ORGANIZATION"},{"type":"$140 million","content":"MONEY"},{"type":"$15.9 million","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$72,000","content":"MONEY"},{"type":"$1.4 million","content":"MONEY"},{"type":"$19.6 million","content":"MONEY"}],"hashtag":["SMART CONTRACTS"],"authors":["Tim Copeland","The Block"]}