{"summary":"Increases in deposits have been observed in protocols like Etherfi, Renzo, Kelp, and Puffer, attributed to the integration with EigenLayer.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285822\/liquid-restaking-platforms-jump-to-near-8-billion-in-total-value-locked","publishDate":"2024-04-01T02:29:06","id":4114,"type":null,"title":"Liquid restaking platforms jump to near $8 billion in total value locked","category":["CRYPTO ECOSYSTEMS"],"content":["The total value locked in liquid restaking tokens has approached nearly <a href=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/restaking\" data-v-f87c67ca=\"\">$8 billion<\/a>.","Protocols such as Etherfi, Renzo, Kelp, Puffer, and others have seen a dramatic <a href=\"https:\/\/www.theblock.co\/post\/276919\/eigenlayer-tvl-uncapped-deposits-window\" data-v-f87c67ca=\"\">increase in deposits<\/a> over the past few months. This increase is due to users opting to utilize EigenLayer through these platforms, which allows them to maintain access to their funds.","Etherfi has the highest TVL among these LRTs, exceeding $3.2 billion, followed by Renzo at $2 billion and <a href=\"https:\/\/www.theblock.co\/post\/277137\/puffer-finance-hits-850-million-in-tvl-now-second-largest-liquid-restaking-protocol\" data-v-f87c67ca=\"\">Puffer<\/a> at $1.3 billion. Kelp has over $740 million in user deposits, while EigenPie has a TVL of $328 million, and Swell at $265 million.","Other smaller LRT protocols include Bedrock with a TVL of $145 million, Prime at $42 million, and ClayStack at $10 million.","Liquid restaking allows liquid-staking token holders to stake their tokens on EigenLayer, thereby contributing to its economic security. This is distinct from traditional liquid staking, which involves staking assets through a staking service provider and receiving receipt tokens in return.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/restaking\/ethereum-liquid-restaking-total-value-locked\/embed\" title=\"Ethereum Liquid Restaking Total Value Locked\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","EigenLayer’s contribution to the growth in TVL of these protocols is noteworthy. It lets users deposit and “restake” ether from various liquid staking tokens.","EigenLayer allows for the deposit and “re-staking” of ether from various liquid staking tokens, aiming to allocate these funds to <a href=\"https:\/\/www.theblock.co\/post\/273732\/eigenlayer-plans-shared-security-model-for-dapps\" data-v-f87c67ca=\"\">secure third-party protocols.<\/a>","The total value locked in EigenLayer now exceeds $13 billion, according to <a href=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/restaking\" data-v-f87c67ca=\"\">The Block's data dashboard<\/a>. The project's objective is to use these funds to enhance the security of other networks like rollups, oracles, data availability platforms, or similar services.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/restaking\/eigenlayer-daily-total-value-locked\/embed\" title=\"EigenLayer Daily Total Value Locked\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","In February, the window for restaking deposits on EigenLayer with liquid staking tokens was briefly opened but has since been <a href=\"https:\/\/www.theblock.co\/post\/276919\/eigenlayer-tvl-uncapped-deposits-window\" data-v-f87c67ca=\"\">closed<\/a>. In this context, LRTs serve as an alternative, enabling users to deposit funds on Eigen when limits are almost reached, given that direct restaking on EigenLayer using ether validator stakes is not subject to any caps.","Hence, LRT protocols like EtherFi, Renzo, and Kelp are still accepting deposits of ether, restaking them for users, and issuing a derivative token while promising to distribute any points earned from Eigen.","EigenLayer rewards users with points for their ether deposits, which could improve their chances of obtaining a token from EigenLayer. Currently, a significant number of users are leveraging LRTs to make deposits on Eigen, aiming to secure rewards from both the LRTs and potential dual airdrops.","Additionally, these protocols provide extra incentives by awarding two types of points – one set from Eigen and another from the respective protocol. For instance, when users restake an LST like stETH through Kelp, they gain points from both EigenLayer and KelpDAO, enhancing their opportunity to receive rewards from each entity.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Eigen","content":"PERSON"},{"type":"$3.2 billion","content":"MONEY"},{"type":"$740 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"$145 million","content":"MONEY"},{"type":"$1.3 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"$265 million","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"LRT","content":"ORGANIZATION"},{"type":"Etherfi","content":"LOCATION"},{"type":"Renzo","content":"LOCATION"},{"type":"EigenPie","content":"ORGANIZATION"},{"type":"Puffer","content":"ORGANIZATION"},{"type":"$42 million","content":"MONEY"},{"type":"$10 million","content":"MONEY"},{"type":"$8 billion","content":"MONEY"},{"type":"Puffer","content":"LOCATION"},{"type":"$2 billion","content":"MONEY"},{"type":"$328 million","content":"MONEY"},{"type":"$13 billion","content":"MONEY"}],"hashtag":["RESTAKING"],"authors":["Vishal Chawla","The Block"]}