{"summary":"As big investors back the latest wave of Layer 1 blockchains, Blockchain.com’s Peter Smith questions whether it&#x27;s the best use of capital for the industry.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/162931\/ethereum-killers-are-great-for-investors-but-little-else-blockchain-coms-smith-says","publishDate":"2022-08-13T04:00:01","id":4116,"type":null,"title":"Ethereum killers are great for investors but little else, Blockchain.com&#x27;s Smith says","category":["LAYER 1S"],"content":["Backing Layer 1 blockchains has proven an incredibly successful bet in the past and may remain so — despite none of them truly threatening Ethereum's crown — according to Blockchain.com co-founder and CEO Peter Smith.","If the likes of Solana, Avalanche and Near Protocol were the first wave of so-called Ethereum killers, Aptos and Sui — brand spanking new Layer 1 blockchains based on Move, a programming language originally developed by Facebook engineers — are the second.","Sui developer Mysten Labs is <a href=\"https:\/\/www.theblock.co\/post\/157007\/former-meta-execs-seek-2-billion-valuation-for-crypto-venture-mysten-labs-the-information\" data-v-f87c67ca=\"\">reportedly in talks<\/a> to raise hundreds of millions of dollars from investors, while the team behind Aptos has already <a href=\"https:\/\/www.theblock.co\/post\/159439\/aptos-closes-150-million-round-led-by-ftx-ventures-jump-crypto\" data-v-f87c67ca=\"\">banked $350 million<\/a>&nbsp;across two raises this year.","Yet Ethereum remains very much alive — and the dominant protocol on which to conduct decentralized business. Indeed, it's in the final stages of switching to <a href=\"https:\/\/www.theblock.co\/post\/162913\/ethereums-final-proof-of-stake-test-merge-is-live-on-goerli\" data-v-f87c67ca=\"\">a proof-of-stake model<\/a> in an effort to make the network cheaper to use and more energy efficient.","Yet despite the growing competition, it's little surprise that investors continue to plow into base layer blockchains, according to Smith — because they can still prove incredibly profitable.&nbsp;","“None of these alternative Layer 1s have come close to beating Ethereum, but they have made investors a lot of money,” he told The Block in an interview. “If you’re an early investor in a Layer 1 that gets some kind of scale, even if it’s small scale, that’s generated phenomenal returns for you.”","“That’s where it becomes necessary in this conversation to differentiate between 'is this stuff going to have a huge and meaningful impact on users and daily lives and building the future of finance?' from 'can we make money?' Because the two things are not always one-to-one.”","In the wider world of venture capital, it's unusual to see investors backing multiple startups within one niche — in part because they run the risk of conflicts of interest between companies that may become competitors. Not so in crypto. Some venture capitalists have backed multiple projects whose mission is to take down Ethereum. Solana and Aptos, for instance, both count Andreessen Horowitz, Multicoin Capital, Jump Crypto, BlockTower Capital, ParaFi Capital and others as backers. &nbsp;","For Smith, the rationale for backing Layer 1 blockchains is clear: they are capable of delivering eye-watering returns in relatively short order, irrespective of whether they succeed in challenging Ethereum.&nbsp;","“We’re seeing a lot of investors cycle out of successful Layer 1 bets from the last cycle — Solana, Avalanche, Near — and into new Facebook-related Layer 1 bets,” he says.","Between the start of 2021 and November that year, the market capitalization of SOL — Solana’s native token — shot from less than $100 million to nearly $80 billion, per <a href=\"https:\/\/www.coingecko.com\/en\/coins\/solana\" data-v-f87c67ca=\"\">CoinGecko data<\/a>. It has since dropped back to around $15 billion. Were early backers of the project, who would typically have acquired tokens instead of equity, to have cashed out even a fraction of their holdings at the top, they would be supremely in the black.","“I think there’s some capital reflexivity at play where there’s a lot of incentive to keep betting on Layer 1s to take down Ethereum, because you’re very in the money on that strategy already. Even though, ironically, no Layer 1 has ever come close to taking down Ethereum,” says Smith.","There is nothing ostensibly wrong with such thinking. It is, as Smith points out, a free market. Indeed, he thinks it likely that a lot of the capital for backing the first wave of Ethereum challengers came from successful bets on bitcoin and ether — or at least the knowledge, among investors’ limited partners, of how successfully such bets panned out. The question Smith poses is instead whether successive Layer 1 investments are a productive use of capital.","“The thing that I find kind of hard to take seriously with some of the Layer 1s being launched now is: what are you bringing to the market that is that much better than Solana, Avalanche, Near, as a backup to Ethereum?” says Smith. “And each one of these chains would have their answer, but at the end of the day all users care about is stability and how much it costs to transact. And so I think that’s where it gets kind of complicated for me to see — is this the best application of capital, both human and financial at the time?\"","A sizable slug of the money poured into new wave Layer 1s thus far has gone to incentive schemes, which were <a href=\"https:\/\/www.theblockcrypto.com\/news+\/118150\/ethereum-challengers-are-dangling-token-rewards-to-attract-big-name-defi-projects-and-its-working\" data-v-f87c67ca=\"\">all the rage<\/a> late last year.","Avalanche set aside close to half a billion dollars in its native AVAX tokens across two incentive programs in August 2021 and March this year, all in an effort to lure developers and projects into its ecosystem. The total value locked (TVL) on the blockchain surged from around $160 million in early August 2021 to a high of over $12 billion by December, according to <a href=\"https:\/\/defillama.com\/chain\/Avalanche\" data-v-f87c67ca=\"\">DeFi Llama data<\/a>. TVL had dipped to roughly $10 billion by mid-April this year, before nosediving to the current level of $2.5 billion.","The health of the wider crypto market is also a factor here. Solana, which has not rolled out a landmark incentive package, has experienced <a href=\"https:\/\/defillama.com\/chain\/Solana\" data-v-f87c67ca=\"\">a decline in TVL<\/a> that is similar to Avalanche’s across the same period.","“So far, it’s not clear that any of these chains have really had staying power,” Smith says. Ethereum’s TVL has also declined, according to DeFi Llama’s data, albeit less dramatically — falling from around $160 billion in November last year to $84 billion today.","Despite his scepticism, Smith concedes that any issues with Ethereum’s much-anticipated switch to proof-of-stake consensus — known as \"the merge\" among the crypto cognoscenti — will mean it's once again \"game on\" for rival blockchains. That includes both Solana and the first wave and the new Move-based protocols.","“The challenge for all of those blockchains is that you really have to hope that something goes wrong for them to be successful,” says Smith. “If Ethereum delivers on the merge and on the sharding roadmap, there isn’t going to be a huge reason for a lot of those chains to exist.”","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/total-value-locked-tvl\/value-locked-by-blockchain\/embed\" title=\"Value Locked by Blockchain\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"a billion dollars","content":"MONEY"},{"type":"$160 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"August 2021","content":"DATE"},{"type":"Smith","content":"ORGANIZATION"},{"type":"BlockTower Capital","content":"ORGANIZATION"},{"type":"Smith","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"Aptos","content":"LOCATION"},{"type":"Mysten Labs","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Multicoin Capital","content":"ORGANIZATION"},{"type":"” Smith","content":"PERSON"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"$84 billion","content":"MONEY"},{"type":"TVL","content":"ORGANIZATION"},{"type":"$350 million","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"December","content":"DATE"},{"type":"$10 billion","content":"MONEY"},{"type":"AVAX","content":"ORGANIZATION"},{"type":"hundreds of millions of dollars","content":"MONEY"},{"type":"Jump Crypto","content":"LOCATION"},{"type":"$80 billion","content":"MONEY"},{"type":"$15 billion","content":"MONEY"},{"type":"$12 billion","content":"MONEY"},{"type":"Peter Smith","content":"PERSON"},{"type":"$2.5 billion","content":"MONEY"},{"type":"$160 billion","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"March this year","content":"DATE"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["APTOS","ETHEREUM","SUI"],"authors":["Ryan Weeks","The Block"]}