{"summary":"An appeals court should direct the SEC to begin a &quot;long-overdue rulemaking process,&quot; Coinbase argued on Monday. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281815\/coinbase-asks-appeals-court-to-direct-sec-to-begin-writing-rules-for-crypto","publishDate":"2024-03-11T18:02:10","id":4125,"type":null,"title":"Coinbase asks appeals court to direct SEC to begin writing rules for crypto","category":["EXCHANGES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">An appeals court should direct the Securities and Exchange Commission to begin a \"long-overdue rulemaking process,\" Coinbase argued on Monday.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The Securities and Exchange Commission violated the Administrative Procedures Act by not engaging in rulemaking and for not providing a detailed reason why it denied Coinbase's rulemaking petition, Coinbase said in its opening brief filed on Monday in the Court of Appeals for the Third Circuit. The act governs how federal agencies develop and issue rules.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The SEC lacks statutory authority to extend the existing securities regime to digital assets. But if the SEC insists on plowing ahead without congressional authorization, that decision must be made and implemented through prospective rulemaking,\" Coinbase said.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The two have argued for years over the need for rulemaking. Coinbase first asked the SEC to issue a formal rulemaking process to \"provide guidance for the crypto industry\" in July 2022. <\/span>Although the SEC has not introduced crypto-specific regulations, it has proposed rules in the past year that apply to crypto. For instance, the SEC revisited a custody rule, mandating that registered investment advisors store crypto with a qualified custodian, who must adhere to specific requirements.","<span class=\"s2\" data-v-f87c67ca=\"\">Coinbase ultimately tried to force the agency to say yes or no to its rulemaking petition and sued the SEC in April 2023. The SEC later <a href=\"https:\/\/www.theblock.co\/post\/267840\/sec-denies-coinbase-petition-for-new-crypto-rulemaking-gensler-says\" data-v-f87c67ca=\"\"><span class=\"s4\" data-v-f87c67ca=\"\">denied<\/span><\/a> the request for new rules, and Chair Gary Gensler said that existing rules already apply to crypto. Gensler also said at the time that an important part of the SEC's responsibility is figuring out how to divvy resources. He emphasized that the crypto market is small compared to the rest of the capital markets, which the agency oversees.&nbsp;<\/span>","In the 78-page brief, Coinbase argued that the SEC has preferred to initiate numerous enforcement actions against crypto entities over the years rather than establish regulations for the industry. The SEC has actively pursued charges in recent years, encompassing issues from fraud to failure to register appropriately with the regulatory body.","<span class=\"s1\" data-v-f87c67ca=\"\">\"The Securities and Exchange Commission (SEC) is asserting sweeping new authority over a vibrant, rapidly expanding industry—digital assets. But the SEC is pursuing this power grab through enforcement actions, and it has refused to set forth its new interpretation of its enabling statutes in a rulemaking, where the lack of legal basis for its self-aggrandizement would be laid bare,\" Coinbase said in its introduction.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC's stance that it has jurisdiction over digital assets needs to be tested through rulemaking, Coinbase argued.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The SEC is seeking to effect dramatic changes to industry-wide policy that would undermine reliance interests and impose severe retroactive penalties, contrary to the requirements of the APA,\" the exchange said.&nbsp;&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Rulemaking is also needed to give fair notice, Coinbase added.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The digital asset industry—now valued at more than two trillion dollars—has been built in reliance on the SEC’s prior position that it had at most limited jurisdiction over digital assets,\" Coinbase said. \"Entire business models were designed on that premise.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Coinbase said existing securities rules are incompatible with digital assets for several reasons, including the fact that there is often no one to register the asset and make required disclosures. As for exchanges needing to register with the SEC, Coinbase said that would limit them to allowing only digital asset transactions.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Transactions in digital assets that are commodities, including Bitcoin and Ethereum, could no longer be offered, because current rules prohibit an exchange from offering both securities and commodities,\" Coinbase said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Coinbase also argued in its brief that the SEC didn't explain thoroughly why it denied the request for rulemaking.&nbsp;<\/span>","An SEC spokesperson said the agency declined to comment beyond public filings, in an emailed statement to The Block.&nbsp;","<span class=\"s5\" data-v-f87c67ca=\"\">In a separate case, Coinbase is being sued by the SEC fo<\/span><span class=\"s2\" data-v-f87c67ca=\"\">r operating as an unregistered exchange, which is ongoing.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Next, the SEC will file an opposing brief in April, and then Coinbase will have a few weeks to reply. If the third circuit decides to hold oral arguments, that would not take place until late summer or early fall. According to a person familiar with the matter, a decision from the Third Circuit could come towards the end of 2024 or into 2025.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span><\/span>","<em data-v-f87c67ca=\"\">Updated at 5:55 p.m. ET to include details throughout&nbsp;<\/em>","<em data-v-f87c67ca=\"\">Updated at noon on March 12 to include SEC comment&nbsp;<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"April 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"The Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Third Circuit","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"two trillion dollars","content":"MONEY"},{"type":"2025","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"5:55 p.m.","content":"TIME"},{"type":"March 12","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"APA","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"July 2022","content":"DATE"},{"type":"Bitcoin","content":"PERSON"},{"type":"Court of Appeals","content":"ORGANIZATION"}],"hashtag":["COINBASE","SEC"],"authors":["Sarah Wynn","The Block"]}