{"summary":"The global cryptocurrency market has nearly doubled in the time since FTX filed for bankruptcy, but creditors could miss out.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267979\/ftxs-revised-reorganization-plan-values-crypto-claims-at-time-of-bankruptcy","publishDate":"2023-12-16T16:56:17","id":4127,"type":null,"title":"FTX&#x27;s revised reorganization plan values crypto claims at time of bankruptcy","category":["COMPANIES"],"content":["The FTX Debtors estate, led by CEO John Ray III and the lawyers of Sullivan &amp; Cromwell, has filed its amended Chapter 11 plan of reorganization today, laying out precisely how bankruptcy claims will be treated in the case.&nbsp;","Notably, the plan contains a provision that would value claimants' digital assets in cash at the time of the date of the bankruptcy filing, Nov. 11, 2022.&nbsp;","The collapse of FTX caused a notable dip in the market that has since healthily recovered, with the global crypto market cap increasing from about $856 billion to 1.6 trillion today. Even FTX's own token has nearly doubled in that time. That means creditors could stand to lose out on millions in potential gains should the plan be approved.&nbsp;","Sunil Kavuri, an outspoken FTX creditor, says the reorganization plan goes against FTX's Terms of Service, which stated that the titles to digital assets belonged with customers and not the exchange. \"The reason SBF was convicted beyond reasonable doubt on all 7 counts was that he stole digital assets that were owned by FTX customers,\" Kavuri said.&nbsp;","Creditors belonging to certain classes will have the opportunity to vote on the amended reorganization plan, the plan <a href=\"https:\/\/restructuring.ra.kroll.com\/FTX\/Home-DownloadPDF?id1=MjYxMDM2Mw==&amp;id2=-1\" data-v-f87c67ca=\"\">clarifies<\/a>. In a <a href=\"https:\/\/restructuring.ra.kroll.com\/FTX\/Home-DownloadPDF?id1=MjYxMDM2NA==&amp;id2=-1\" data-v-f87c67ca=\"\">statement<\/a>, the Debtors emphasize the pains taken to get to this point, writing, \"the Plan and this Disclosure Statement reflect many compromises to create the best, most equitable and economical outcome for all creditors and stakeholders in these Chapter 11 Cases.\"","Various thresholds of approval in both dollar amount and claimant numbers will be required for the plan to go into effect. In certain circumstances known as a \"cram-down,\" however, classes of creditors who did not agree to the plan can still be forced to accept it, as long as the solution is \"fair and equitable,\" according to the Debtors' statement.","FTX did not reply immediately to a request for comment from The Block.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunil Kavuri","content":"PERSON"},{"type":"Terms of Service","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Sullivan &amp; Cromwell","content":"ORGANIZATION"},{"type":"John Ray III","content":"PERSON"},{"type":"$856 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Nov. 11, 2022","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Kavuri","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FTX"],"authors":["Zack Abrams","The Block"]}