{"summary":"Total cryptocurrency market capitalization soared past $2 trillion as of August 2021, driven in part by companies and investment firms exploring the space.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/121987\/institutions-invest-in-fixed-rate-crypto-yield","publishDate":"2021-10-26T09:00:01","id":4129,"type":null,"title":"Institutions invest in fixed-rate crypto yield","category":["SPONSORED"],"content":["<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Rachel Mayer<br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">VP of Product <br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Circle<\/span><\/em>","","","<span data-v-f87c67ca=\"\">Corporate treasurers and institutional fund managers face a unique challenge. On one hand, they’ve amassed large cash balances. On the other hand, persistent low interest rates give them very few options for generating meaningful returns on that cash, with 10-year Treasuries¹<\/span><span data-v-f87c67ca=\"\">&nbsp;and Aaa-rated 10-year corporate bonds²&nbsp;<\/span><span data-v-f87c67ca=\"\"> yielding less than half of their historical average as of October 1, 2021.<\/span>","<span data-v-f87c67ca=\"\">At the same time, institutional interest in crypto is growing. Total cryptocurrency market capitalization soared past $2 trillion as of August 2021, driven in part by companies and investment firms exploring the space. But many institutions still remain on the sidelines, either because they don’t know how to invest in crypto, or because they aren’t comfortable with the risks and volatility typically associated with Bitcoin and DeFi.<\/span>","<span data-v-f87c67ca=\"\">Circle Yield is designed to address all of that. It’s a new investment that’s built to help institutions allocate into crypto lending markets without the uncertainty and opacity. It’s a fixed-term investment issued within a clear regulatory framework, and it offers returns that are much higher than what’s available from banks and many fixed income markets, with terms from one month up to a year.*&nbsp; It’s also fully secured and overcollateralized with Bitcoin, with all collateral held by a third-party custodian that serves more than 400 institutional clients.&nbsp;<br data-v-f87c67ca=\"\">\n<\/span>_____________________________________","¹<span data-v-f87c67ca=\"\"><a href=\"https:\/\/ycharts.com\/indicators\/10_year_treasury_rate\" data-v-f87c67ca=\"\">https:\/\/ycharts.com\/indicators\/10_year_treasury_rate <\/a><br data-v-f87c67ca=\"\">\n<\/span>²<span data-v-f87c67ca=\"\"><a href=\"https:\/\/ycharts.com\/indicators\/moodys_seasoned_aaa_corporate_bond_yield\" data-v-f87c67ca=\"\">https:\/\/ycharts.com\/indicators\/moodys_seasoned_aaa_corporate_bond_yield<\/a><\/span>","<span data-v-f87c67ca=\"\">Circle Yield is built with USDC, a full-reserve dollar digital currency. <\/span><span data-v-f87c67ca=\"\">USDC is fully backed by cash and equivalents and short-duration U.S. Treasuries, so that it is always redeemable 1:1 for U.S. dollars. Each month, Circle publishes attestation reports by Grant Thornton regarding the reserve balances backing USDC. Total USDC in circulation has grown past $32 billion as more companies and investors recognize the value of its stability and transparency.<\/span>","<span data-v-f87c67ca=\"\">Circle Yield is also drawing interest among crypto organizations, as blockchain foundations, NFT platforms and others seek to diversify their treasuries. Allocating into Circle Yield can help balance growth and security while keeping funds on the blockchain. Circle Yield’s fixed rates and clear regulatory framework can offer greater certainty compared to storing funds in native tokens or investing in DeFi.<\/span>","<span data-v-f87c67ca=\"\">Visit <\/span><a href=\"https:\/\/www.circle.com\/en\/products\/yield?utm_campaign=Campaign%20%7C%20Yield%20GTM&amp;utm_source=The%20Block%20Sponsored%20Post&amp;utm_medium=Referral&amp;utm_term=The%20Block&amp;utm_content=The%20Block%20sponsored%20post%2010-26-21\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">circle.com\/yield<\/span><\/a><span data-v-f87c67ca=\"\"> today to book a meeting with an expert.<\/span>","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">O<\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">ffering subject to business approval, geographical availability**, and regulatory authorization, and there is no guarantee that the product will become available in a specific timeframe or to a specific customer or geography. Circle Yield offered by Circle International Bermuda Limited (“Circle Bermuda”).<br data-v-f87c67ca=\"\">\n<\/span><\/i><\/span><span data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Circle Account and money transmission services are provided by Circle Internet Financial, LLC or, for customers using Circle Account services located in the United Kingdom, Circle UK Trading Company Limited. Circle Internet Financial, LLC, NMLS # 1201441, is a licensed provider of money transmission services. Circle Payments, LLC, DFPI Money Transmitter License # 2549, is registered under the California Department of Financial Protection &amp; Innovation. A full list of Circle’s licenses can be found <\/span><\/i><a href=\"https:\/\/www.circle.com\/en\/legal\/us-licenses\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">here<\/span><\/i><\/a><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">.&nbsp;<br data-v-f87c67ca=\"\">\n<\/span><\/i><\/span><span data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Circle is not a bank; your Circle Account is not a bank account, and any funds are not insured by the Federal Deposit Insurance Corporation, the Securities Investor Protection Corporation or by any US or foreign government agency, insurance fund, person or entity. For investors in the United States, investments described in this communication are offered by Circle Bermuda to “accredited investors” only in accordance with Regulation D, Rule 506(c) of the Securities Action of 1933, as amended. While Circle Bermuda is regulated by the Bermuda Monetary Authority for digital asset business, Circle Bermuda is not engaged in banking and deposit taking activities and is not regulated for these purposes. You should carefully conduct your own investigations and analyses in connection with any participation in this product, including its objectives, risk factors, fees and expenses and the information set forth in these materials. All prospective participants in the products described herein are advised to consult with their legal, accounting and tax advisers regarding any potential participation. Please read the offering documents carefully before you invest. Additional information is available upon request.&nbsp;<\/span><\/i><\/span>","<span data-v-f87c67ca=\"\">*Available rates are subject to change pending availability, approval and market conditions<br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">** Not currently available in the following U.S. states: Alaska, Minnesota, New York and Hawaii.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$32 billion","content":"MONEY"},{"type":"Circle International Bermuda Limited (“Circle Bermuda”)","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Grant Thornton","content":"ORGANIZATION"},{"type":"Bermuda Monetary Authority","content":"ORGANIZATION"},{"type":"August 2021","content":"DATE"},{"type":"Hawaii","content":"LOCATION"},{"type":"Minnesota","content":"LOCATION"},{"type":"Rachel Mayer<br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">VP of Product <br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Circle","content":"ORGANIZATION"},{"type":"Securities Investor Protection Corporation","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Circle Internet Financial","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"United Kingdom","content":"LOCATION"},{"type":"$2 trillion","content":"MONEY"},{"type":"Securities Action of","content":"ORGANIZATION"},{"type":"LLC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"DFPI Money Transmitter License","content":"ORGANIZATION"},{"type":"Federal Deposit Insurance Corporation","content":"ORGANIZATION"},{"type":"Bermuda","content":"LOCATION"},{"type":"Circle UK Trading Company Limited","content":"ORGANIZATION"},{"type":"Circle Bermuda","content":"ORGANIZATION"},{"type":"2549","content":"DATE"},{"type":"1933","content":"DATE"},{"type":"Circle Bermuda","content":"LOCATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"October 1, 2021","content":"DATE"},{"type":"Circle","content":"ORGANIZATION"},{"type":"California Department of Financial Protection &amp; Innovation","content":"ORGANIZATION"},{"type":"Alaska","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":[],"authors":["Sponsored","The Block"]}