{"summary":"Bitwise has listed the shares of its index fund on over-the-counter (OTC) markets. \nThe shares are now available to trade via traditional brokerage accounts such as Fidelity.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/87110\/bitwise-crypto-index-fund-otc-shares-tradeable-brokerage-accounts","publishDate":"2020-12-09T07:00:19","id":413,"type":null,"title":"Bitwise lists its crypto index fund on OTC markets, shares tradeable via brokerage accounts","category":["Cryptocurrency"],"content":["Cryptocurrency asset manager Bitwise has listed the shares of its index fund on over-the-counter (OTC) markets, making them tradeable via traditional brokerage accounts.","Until now, the Bitwise 10 Crypto Index Fund was available to buy via private placements, at net asset value. Now the fund's listing on OTCQX, a market offered by OTC Markets Group, will make its shares publicly traded.","Bitwise is a bit late to the scene. Rival Grayscale's funds have since long been available on OTC markets. When asked why the delay, Bitwise's global head of research, Matthew Hougan, told The Block that the firm's primary clients are \"just now starting to allocate to crypto in a major way.\"","Bitwise's main clients are financial advisors and investment professionals. Hougan said these clients found the private placement method complicated, involving accreditation, signatures, and wires. \"It was making things incredibly difficult, especially those who wanted to allocate 2% across 100 clients...We listened to clients...We then spent a year working with regulators to make it happen.\"","The index fund's shares will be listed under the ticker symbol \"BITW,\" and will be available for investors through traditional brokerage accounts such as Fidelity, Charles Schwab, E*Trade, and TD Ameritrade.","BITW tracks the Bitwise 10 Large Cap Crypto Index and therefore it will give investors exposure to the ten largest crypto-assets. As of November 30, the fund held approximately 75% bitcoin and 13% ether, with the remaining 12% allocated across XRP, litecoin, chainlink, tezos, and other cryptocurrencies. The index's constituents are screened for liquidity, custody, and other risks, and are rebalanced monthly.&nbsp;","\"Index funds have become the dominant way that investors gain exposure to the stock market, and we think that will happen in crypto too,\" Hougan told The Block.","Grayscale also offers an index-like fund, called Digital Large Cap Fund (GLDC). When asked how BITW is different from GLDC, Hougan said: \"GLDC is not an index fund. It holds a basket of five crypto assets, but does not track an index.\"","He went on to say that BITW is cheaper at 2.5% vs. 3% management fee of GLDC and that it is a U.S. security vs. foreign security. \"BITW is a U.S. trust, whereas GDLC is a Cayman Islands LLC.\"","Grayscale is the leading crypto asset manager in the market, with <a href=\"https:\/\/twitter.com\/Grayscale\/status\/1336431565069545472?s=20\" data-v-f87c67ca=\"\">more than $12 billion<\/a> in total assets under management (AUM). Bitwise's total AUM stands at <a href=\"https:\/\/www.prnewswire.com\/news-releases\/bitwise-surpasses-100-million-in-assets-under-management-due-to-rising-demand-for-crypto-from-hedge-funds-and-financial-advisors-301161317.html#:~:text=28%2C%202020%20%2FPRNewswire%2F%20%2D%2D,assets%20under%20management%20(AUM).\" data-v-f87c67ca=\"\">more than $100 million.<\/a> When asked how Bitwise plans to grow its AUM, Hougan said the firm would continue educating financial advisors and other investment professionals about crypto and its funds."],"hashtag":[]}