{"summary":"Meta CEO Zuckerberg has said his ambition to become a prime player in the emerging metaverse will likely cause Reality Labs to lose more than $10 billion annually for multiple years. He appears to be right.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/207779\/metas-metaverse-losses-hit-4-3-billion-in-fourth-quarter-of-2022","publishDate":"2023-02-01T16:25:45","id":4131,"type":null,"title":"Meta’s Zuckerberg calls AR &#x27;a research problem&#x27; as metaverse losses jump to $4.3 billion in fourth quarter","category":["COMPANIES"],"content":["Tech giant Meta’s metaverse spending spree continues as the company's Reality Labs division posted a fourth-quarter loss of $4.3 billion. The division lost $3.3 billion in the same quarter a year ago.","Reality Labs is tasked with spearheading the company’s push into the metaverse with the development of virtual and augmented reality technologies. The division lost $13.7 billion for the entire year.&nbsp;","While both figures are bigger than a year ago, they were both slightly better than <a href=\"https:\/\/www.theblock.co\/post\/206819\/nearing-14-billion-metas-2022-metaverse-losses-piling-up\" data-v-f87c67ca=\"\">analyst predictions<\/a> that Meta’s Reality Labs would hemorrhage $4.4 billion during the fourth quarter and $13.8 billion for the year.","Meta CEO Mark Zuckerberg <a href=\"https:\/\/www.theblock.co\/post\/204535\/while-apple-and-meta-forge-ahead-microsoft-sunsets-some-vr-products\" data-v-f87c67ca=\"\">has remained steadfast<\/a> in his dedication to pivot and invest heavily in metaverse technologies. Meta’s core business has long been dependent on advertising revenue generated from the billions of users that use its social media platforms like Facebook and Instagram.","The company's Family of Apps division, which includes Facebook and Instagram, continues to be Meta's strongest driver of profit, generating $10.7 billion of income during the fourth quarter. But that was a significant decline when compared to the $15.9 billion Meta earned during the same three-month period in 2021.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nDespite the significant drop in profits for Meta's app business, the division's revenue clocked in at $31.4 billion for the fourth quarter. In contrast, Reality Labs brought in $727 million in revenue. Meta's share price jumped almost 20% after the company reported its quarterly earnings.&nbsp;","Meta lowered its forecast for full-year 2023 expenses, saying they will be in the range of $89 billion-$95 billion. That’s down from a prior outlook of $94 billion-$100 billion, due to slower anticipated growth in payroll expenses and cost of revenue.","Capital expenditures jumped to $32 billion in 2022 from $19,2 billion a year earlier.","Zuckerberg <a href=\"https:\/\/www.theblock.co\/post\/203164\/in-apple-and-metas-fight-for-vr-ar-dominance-an-open-metaverse-may-be-collateral-damage\" data-v-f87c67ca=\"\">has said<\/a> his ambition to become a prime player in the emerging metaverse will likely cause Reality Labs to lose more than $10 billion annually for multiple years.","\"Facebook just reached the milestone of 2 billion daily actives,\" Zuckerberg said in a statement. \"Our management theme for 2023 is the “Year of Efficiency' and we're focused on becoming a stronger and more nimble organization.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe comments come after Meta laid off about 11,000 employees in an effort to cut costs.&nbsp;","Meta is the market's&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/176358\/meta-prioritizes-work-over-play-when-showcasing-new-vr-headset\" data-v-f87c67ca=\"\">leading producer<\/a>&nbsp;of virtual-reality headsets. Zuckerberg considers VR a cornerstone metaverse technology. During the earning call Meta's CEO said there are currently \"over 200 apps\" available on the company's VR devices and they have generated more than $1 million in revenue.","Zuckerberg did not specify over what period Meta VR apps produced the revenue.&nbsp;","When asked during an earnings call with analysts about how intensely Meta will continue to invest in Reality Labs, Zuckerberg tried to describe the different verticals the division is focused on and their importance.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“It’s important to not just think about Reality Labs as one thing,” he said, adding that the division is composed of three segments including augmented reality, virtual reality and metaverse software. “[Augmented reality] is actually the biggest area but is still a large research problem [and] … we haven’t actually shipped a product yet.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nMeta&nbsp;<a href=\"https:\/\/www.theverge.com\/23022611\/meta-facebook-nazare-ar-glasses-roadmap-2024\" data-v-f87c67ca=\"\">hopes to release<\/a> a pair of AR glasses by next year but many experts believe it could take longer. Both Meta and Apple have expressed their believe that AR will be a revolutionary technology that will eventually become ubiquitous.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">Updated with details on Reality Labs and comments from Meta's fourth-quarter earnings call.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$32 billion","content":"MONEY"},{"type":"$31.4 billion","content":"MONEY"},{"type":"$15.9 billion","content":"MONEY"},{"type":"$94 billion","content":"MONEY"},{"type":"$95 billion","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"Mark Zuckerberg","content":"PERSON"},{"type":"$727 million","content":"MONEY"},{"type":"quarter","content":"DATE"},{"type":"$13.7 billion","content":"MONEY"},{"type":"$13.8 billion","content":"MONEY"},{"type":"Meta’s Reality Labs","content":"ORGANIZATION"},{"type":"fourth quarter","content":"DATE"},{"type":"$10.7 billion","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Zuckerberg","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$19,2 billion","content":"MONEY"},{"type":"Meta","content":"ORGANIZATION"},{"type":"$10 billion","content":"MONEY"},{"type":"$3.3 billion","content":"MONEY"},{"type":"$89 billion","content":"MONEY"},{"type":"$1 million","content":"MONEY"},{"type":"$4.3 billion","content":"MONEY"},{"type":"$100 billion","content":"MONEY"},{"type":"Apple","content":"ORGANIZATION"},{"type":"$4.4 billion","content":"MONEY"},{"type":"Reality Labs","content":"ORGANIZATION"}],"hashtag":["EARNINGS"],"authors":["RT Watson","The Block"]}