{"summary":"The European Commission has today officially proposed a regulatory framework for crypto-assets and stablecoins after a leaked draft proposal went viral last week.\nThe official proposal recommends a “bespoke” regime for crypto-assets and stablecoins. ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/78713\/european-commission-official-proposal-regulation-crypto-assets-stablecoins","publishDate":"2020-09-24T08:50:06","id":415,"type":null,"title":"European Commission officially proposes regulatory framework for crypto-assets and stablecoins","category":["Regulation"],"content":["The European Commission has today officially proposed a regulatory framework for crypto-assets and stablecoins after a leaked draft proposal went viral last week.","The <a href=\"https:\/\/ec.europa.eu\/finance\/docs\/law\/200924-crypto-assets-proposal_en.pdf\" data-v-f87c67ca=\"\">168-page official draft proposal (provisional)<\/a>, published Thursday, highlights the need for a \"sound\" legal framework, clearly defining the regulatory treatment of all crypto-assets that are not covered by existing EU financial services legislation.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nCrypto assets, especially stablecoins, have the potential to become widely accepted, said the commission. Hence, they would be subject to \"more stringent requirements\" regarding capital, investor rights, and supervision. The proposal is in line with the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/77858\/european-commission-draft-proposal-on-crypto-assets-has-stablecoins-in-its-crosshairs\" data-v-f87c67ca=\"\">leaked version<\/a> from last week.","The commission has today proposed a \"bespoke\" regime for crypto-assets and stablecoins. \"The bespoke regime for crypto-assets will ensure a high level of consumer and investor protection and market integrity, by regulating the main activities related to crypto-assets,\" said the commission. The main activities include such as crypto exchange and wallet services.","\"By imposing requirements (such as governance, operational requirements) on the main crypto-asset service providers and issuers operating in the EU, the proposal is likely to reduce the amounts of fraud and theft of crypto-assets,\" said the commission, adding:","The commission has today also proposed a regulatory sandbox to allow companies to test blockchain technology in trade and settlement processes.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe proposals are part of the commission's newly adopted Digital Finance Package. The package will \"boost Europe's competitiveness and innovation in the financial sector, paving the way for Europe to become a global standard-setter,\" said the commission. \"It will give consumers more choice and opportunities in financial services and modern payments, while at the same time ensuring consumer protection and financial stability.\""],"hashtag":["EUROPEAN COMMISSION"]}