{"summary":"Decentralization has been a buzzword dominating the blockchain industry, which has driven many to ask, “What does decentralization do and mean?” Decentralization has been an essential element of many blockchain technologies","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/159840\/defining-trons-mission-to-decentralize-the-web","publishDate":"2022-07-27T09:00:57","id":4151,"type":null,"title":"Defining TRON&#x27;s Mission to Decentralize the Web","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">Decentralization has been a buzzword dominating the blockchain industry, which has driven many to ask, “What does decentralization do and mean?” Decentralization has been an essential element of many blockchain technologies. At its essence, decentralization is a bottom-up style of running an organization in which authority is delegated amongst individuals resulting in users being empowered to contribute to the network.<\/span>","<span data-v-f87c67ca=\"\">Since its founding in 2017, it has been <\/span><a href=\"https:\/\/trondao.org\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">TRON<\/span><\/a><span data-v-f87c67ca=\"\">’s core vision to decentralize the internet, and they’re structured from the ground up to operate following that vision. In addition to becoming a purely community-governed Decentralized Autonomous Organization (DAO) in December 2021, TRON has also applied decentralization through four major components: the protocol, nodes, assets, and dApps. Since peer-to-peer communication is considerably more difficult to censor, decentralization promotes a culture of meritocracy; in essence, decentralization is democratizing the web.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">TRON is building the infrastructure for a decentralized web that will empower developers and users to create and share content without any interference. It relies on the Delegated Proof-of-Stake (DPoS) consensus mechanism to manage the blockchain. Unlike a Proof-of-Stake (PoS) system, only elected nodes can approve blocks of transactions. This delegation structure incentivizes users to protect the network with their staked assets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Every blockchain network operates using a consensus algorithm. DPoS is among the most effective consensus systems around. DPoS reduces energy consumption and transaction times while using less power than PoW (Proof-of-Work) or traditional PoS systems. In the TRON ecosystem, the community elects 27 block validators to serve as “Super Representatives” (SR) every six hours. Each validator has the same voting power on TRON, regardless of how much TRX staked or how many votes they receive. This helps balance the governance percentage per SR. Because of their numerous benefits, several blockchains have now employed a DPoS mechanism to power their networks.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Every blockchain network is composed of nodes, which form the network’s infrastructure. Consequently, they are critical to consider in any exploration of decentralization. TRON’s advantage is its geographical variety in nodes, which makes for a secure and robust network.<\/span>","<span data-v-f87c67ca=\"\">Native asset distribution also plays a significant role in the decentralization of a blockchain. The number of unique wallets holding TRX has been increasing at an astounding rate, from around 26 million wallets in July 2021 to over 61 million wallets by July 2022, a 134% increase in just one year. With TRON wallet holders growing, this brings more voters and users to the TRON network.<\/span>","<span data-v-f87c67ca=\"\">Another key indicator of a network’s decentralization is its volume of dApps and overall smart contract activity. TRON has continued to see a healthy growth activity and an influx of new dApps launched on chain. <\/span><a href=\"https:\/\/trondao.org\/hackathon\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The TRON Grand Hackathon<\/span><\/a><span data-v-f87c67ca=\"\"> has been an excellent way for new ideas, projects, and solutions to develop their communities on the TRON network. The unique submissions into the Hackathon bring a variety of dApps, which carry their users along with them, continuing to expand TRON’s ecosystem.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">With the increasing number of TRON users, registered wallets have grown to over 100 million accounts. All those holders are also potential voters in TRON’s governance system, which positions TRON in the right direction toward creating a decentralized Web.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by TRON <\/i><i data-v-f87c67ca=\"\">and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","&nbsp;"],"entity":[{"type":"December 2021","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"Hackathon","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"TRON Grand Hackathon","content":"ORGANIZATION"},{"type":"July 2021","content":"DATE"},{"type":"July 2022","content":"DATE"},{"type":"134%","content":"PERCENT"}],"hashtag":[],"authors":["Sponsored","The Block"]}