{"summary":"Just when you thought you had wrapped your head around the wonky digital asset space, along comes a new seemingly esoteric crypto project.  This time,","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/2290\/a-bitcoin-backed-ethereum-token-is-coming-to-market-in-2019-and-it-could-help-a-struggling-corner-of-the-crypto-market","publishDate":"2018-10-26T11:03:13","id":4153,"type":null,"title":"A bitcoin-backed ethereum token is coming in 2019, and it could help a struggling corner of the crypto market","category":["BITCOIN"],"content":["Just when you thought you had wrapped your head around the wonky digital asset space, along comes a new seemingly esoteric crypto project.&nbsp;","This time, it's a bitcoin\/ethereum cross-breed. The so-called <a href=\"https:\/\/www.wbtc.network\/\" data-v-f87c67ca=\"\">Wrapped Bitcoin<\/a>, announced Friday by a group of industry participants including custody solutions provider BitGo, aims to bridge the gap between the two largest cryptocurrencies by market capitalization: bitcoin and ethereum.&nbsp;","As the first coin to market, bitcoin benefits from deep liquidity and more price stability than its smaller rivals. Still, it lacks some of the functionality of ethereum tokens, including smart contracts and interoperability with certain ethereum-based applications. The new WBTC token, which is set to launch in 2019, will be an ether token backed 1:1 by bitcoin.&nbsp;","In a sense, it'll work similarly to stablecoins which are tokens that offer the benefits of cryptos and are backed by fiat currencies, such as the USD.&nbsp;","<strong data-v-f87c67ca=\"\">A DEX Dream<\/strong>","Let’s say you only hold bitcoin, but you want to use an ethereum-based app that requires ERC-20 tokens. You could convert your BTC to WBTC to use the application.&nbsp;","For example, there's&nbsp;a new app that requires you to purchase XYZ token. You want to use the app but don’t want to purchase the token because it is illiquid or because you don’t trust the security of the token, then you could convert your BTC to WBTC and have that app accept your WBTC as payment to use their app.&nbsp;","\"The largest market participants to see benefits are probably traders on decentralized exchanges,\" Ben Chan, chief technology officer of BitGo, told&nbsp;<em data-v-f87c67ca=\"\">The Block.<\/em>","Decentralized exchanges, unlike the Coinbases of the world, do not match up buyers and sellers. There are close to <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/github.com\/distribuyed\/index\" rel=\"noopener nofollow\" data-href=\"https:\/\/github.com\/distribuyed\/index\" data-v-f87c67ca=\"\">250<\/a> projects attempting to build DEXs, but few have attracted significant volumes. Many decentralized exchanges are based on ethereum and do not facilitate trading pairs with bitcoin. WBTC would provide a way for folks to trade their bitcoin on such venues via the bitcoin-backed ethereum tokens.","\"DEXs that did not have the ability to represent Bitcoin pairs (they can only do ETH\/XYZ right now) can then do ETH\/WBTC or WBTC\/USDT etc., something they haven't been able to do before,\" Chan said.","That could be a boon for decentralized exchanges because it would, in theory, open them to the capital in bitcoin markets, which stands at more than 50% of the entire crypto market.&nbsp;","BitGo will function as a custodian of the new token.&nbsp;<span data-v-f87c67ca=\"\">BitGo also worked on the smart contract that is part of the tokenization efforts for minting and burning.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DEX Dream","content":"ORGANIZATION"},{"type":"Ben Chan","content":"PERSON"},{"type":"Chan","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"2019","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Bitcoin","content":"PERSON"},{"type":"XYZ","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}