{"summary":"StarkWare, an Ethereum Layer 2 developer, has raised $50 million in a Series C funding round and is now valued at $2 billion.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/124479\/ethereum-layer-2-developer-starkware-raises-50-million-now-valued-at-2-billion","publishDate":"2021-11-16T10:00:40","id":4155,"type":null,"title":"Ethereum Layer 2 developer StarkWare raises $50M, now valued at $2B","category":["VENTURE CAPITAL"],"content":["StarkWare, an Ethereum Layer 2 developer using ZK-rollups technology, has raised $50 million in a Series C funding round and is now valued at $2 billion.","Sharing the news exclusively with The Block on Tuesday, Israel-based StarkWare said the round was led by Sequoia Capital, with participation from existing investors, including Paradigm, Three Arrows Capital, Alameda Research, and Founders Fund.","This was an \"opportunistic\" fundraise, StarkWare co-founder and CEO Uri Kolodny told The Block in an interview, meaning that the company is already profitable but secured new funds to grow its team and ecosystem as fast as possible.","StarkWare is one of a few blockchain startups that have built Ethereum scaling products using rollups technology.","There are mainly two types of rollups — ZK-rollups and Optimistic rollups — that allow executing Ethereum transactions off-chain and storing only transaction data on-chain, thereby reducing the network congestion, increasing its speed, and reducing gas fees.","StarkWare uses ZK-rollups for its scaling technology. As opposed to Optimistic rollups, ZK-rollups generate zero-knowledge proofs for validating transactions.","StarkWare's Ethereum scaling engine StarkEx is used by several crypto projects, including <a href=\"https:\/\/www.theblockcrypto.com\/news+\/119710\/whats-behind-dydxs-explosive-growth-and-skyrocketing-revenue\" data-v-f87c67ca=\"\">dYdX<\/a>, Sorare, and Immutable. Kolodny said StarkEx has settled over $200 billion worth of trades, facilitating about 50 million transactions and serving hundreds of thousands of users at \"dramatically cheaper\" gas costs.","StarkWare is now set to launch StarkNet Alpha on mainnet Ethereum by the end of this month, said Kolodny. The key difference between StarkEx and StarkNet is that the former is a permissioned tailor-made scaling engine, while the latter is a permissionless decentralized ZK-rollup that supports independent deployment of smart contracts. That means with StarkNet, any developer can write and deploy their smart contracts permissionlessly, like on Ethereum.","StarkWare hopes to bring \"crypto apps for all\" with StarkNet. StarkWare's another co-founder Eli Ben-Sasson said in the interview that StarkNet will help make blockchain technology \"usable by a much wider population.\"","Several projects have committed to building on StarkNet, including MakerDAO, Aave, and Argent, said Kolodny.","When asked whether Uniswap is looking to partner with StarkWare, Ben-Sasson said, \"we're very hopeful that Uniswap will join us, but that's up to their governance process to do that.\" <a href=\"https:\/\/www.theblockcrypto.com\/linked\/111194\/uniswap-takes-next-step-toward-adopting-layer-2-tech-with-alpha-launch-on-optimism\" data-v-f87c67ca=\"\">Uniswap<\/a> currently uses Ethereum Layer 2 scaling solutions from Optimism and Arbitrum that use Optimistic rollups.","StarkWare's Series C round comes just seven months after its <a href=\"https:\/\/www.theblockcrypto.com\/post\/99211\/starkware-funding-round-ethereum-paradigm\" data-v-f87c67ca=\"\">$75 million Series B round<\/a> in March. The firm did not share its valuation then, but Kolodny said all rounds to date have been equity rounds.","He declined to comment when asked if StarkWare is looking to launch its own token.","The Series C round brings StarkWare's total funding to date to $162 million. Kolodny said the firm could raise more funds in the near future if opportunities arise.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"StarkWare","content":"ORGANIZATION"},{"type":"Sequoia Capital","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$162 million","content":"MONEY"},{"type":"Kolodny","content":"PERSON"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"Ben","content":"PERSON"},{"type":"$200 billion","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"Eli Ben","content":"PERSON"},{"type":"Sasson","content":"PERSON"},{"type":"$75 million","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"Israel","content":"LOCATION"},{"type":"Uri Kolodny","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"$2 billion","content":"MONEY"},{"type":"$50 million","content":"MONEY"}],"hashtag":["ETHEREUM"],"authors":["Yogita Khatri","The Block"]}