{"summary":"&quot;I know there are a lot of people who are very critical of the SEC and I&#x27;m quite critical often of my own agency as well,&quot; Peirce said in an interview with Coinage&#x27;s Zack Guzman.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237988\/regulatory-ambiguity-hurts-americans-says-sec-commissioner-hester-peirce","publishDate":"2023-07-05T16:48:07","id":416,"type":null,"title":"Regulatory ambiguity hurts Americans, says SEC Commissioner Hester Peirce","category":["POLICY"],"content":["U.S. Securities and Exchange Commissioner Hester Peirce thinks that regulatory ambiguity is harming American investors, according to a wide-ranging <a href=\"https:\/\/www.coinage.media\/s2\/bitcoin-etf-applications-arent-being-judged-fairly-sec-commissioner-peirce\" data-v-f87c67ca=\"\">interview<\/a> with Coinage Media.&nbsp;","Speaking to Coinage founder and former Yahoo Finance reporter Zack Guzman, the Republican commissioner weighed in on the ongoing race to launch a spot bitcoin exchange-traded fund, noting that standards applied to such a product have been \"a moving target\" and \"not consistent with how we've treated other products.\"","The SEC, which approved a futures-based exchange-traded fund for bitcoin, has a flurry of new spot bitcoin ETF applications to sift through, with companies ranging from BlackRock to Bitwise recently submitting filings. The agency has yet to approve a spot product, and has in the past cited concerns of manipulation in the underlying spot market.&nbsp;","Advocates for a spot ETF have argued that futures-based ETFs also relies on pricing from underlying spot exchange venues. The recent round of filings identify partnerships with Coinbase for market surveillance to potentially mollify that concern.&nbsp;","\"In other countries there are spot products that have been approved for a long time and there's a lot of demand for spot products and I think if you look at the rationale for approving a futures product, it would seem that you could apply that same rationale and apply it a spot product,\" Peirce commented.&nbsp;","Furthermore, the Commissioner added that \"regulatory ambiguity\" stemming from the SEC is not beneficial to Americans.&nbsp;","\"I know there are a lot of people who are very critical of the SEC, and I'm quite critical often of my own agency as well,\" she said. \"And I think one of the reasons that I've been critical and that some others have been critical is that in the absence of a regulatory framework that makes sense.\"","That ambiguity might force companies or projects to spend unnecessary timing weighing options to leave the U.S., comply, or shut down entirely.&nbsp;","\"I don't think that it serves the American public to keep this sort of regulatory ambiguity so that you can come in after the fact with enforcement,\" she said. \"Why not have some regulatory clarity?\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S. Securities and Exchange Commissioner Hester Peirce","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Peirce","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinage Media","content":"ORGANIZATION"},{"type":"Yahoo Finance","content":"ORGANIZATION"},{"type":"Zack Guzman","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}