{"summary":"Ethos is being developed as a &quot;validated service&quot; on EigenLayer — focusing on security for the Cosmos chains by utilizing ether stakes.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284119\/ethos-works-with-liquid-restaking-protocols-to-secure-cosmos-chains-via-eigenlayer","publishDate":"2024-03-22T12:05:03","id":4160,"type":null,"title":"Ethos works with liquid restaking protocols to secure Cosmos chains via EigenLayer","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Ethos, a blockchain project under development as a \"validated service\" on EigenLayer, is working with various <a href=\"https:\/\/www.theblock.co\/post\/278135\/liquid-restaking-protocols-tvl-3b\" data-v-f87c67ca=\"\">liquid restaking protocols<\/a> to allocate ether stakes for the security of Cosmos chains, accumulating commitments of $4 billion.<\/span>","<span data-v-f87c67ca=\"\">Protocols such as EtherFi, Puffer, Renzo, Swell and Kelp have committed to allocating ether under their control to Ethos via EigenLayer — showcasing an early use case for the EigenLayer ecosystem's development.<\/span>","<span data-v-f87c67ca=\"\">As one of the initial actively validated services on EigenLayer, <a href=\"https:\/\/www.theblock.co\/post\/268470\/ethos-leverages-eigenlayer-to-introduce-validator-protocol-for-cosmos-chains\" data-v-f87c67ca=\"\">Ethos<\/a> will leverage re-staking and validation via EigenLayer to <a href=\"https:\/\/www.theblock.co\/post\/273732\/eigenlayer-plans-shared-security-model-for-dapps\" data-v-f87c67ca=\"\">secure<\/a> Cosmos ecosystem chains using existing ether stakes.<\/span>","<span data-v-f87c67ca=\"\">Ethos's launch is scheduled to coincide with the EigenLayer mainnet launch, which is expected in the second quarter of this year and is currently in the testnet phase.<\/span>","<span data-v-f87c67ca=\"\">\"Ethos is a security coordination layer that enables Cosmos chains to easily bootstrap a validator network, leveraging the economic security of restaked ETH,\" a spokesperson from Ethos told The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">EigenLayer allows for the deposit and \"re-staking\" of ether from various liquid staking tokens, with the aim to allocate these funds to secure third-party protocols like rollups, oracles, data availability platforms or similar services. Ethos will be one of the beneficiaries of this restaking process.<\/span>","<span data-v-f87c67ca=\"\">In the Eigen ecosystem, upon its launch, EigenLayer will repurpose ether deposits from stakers and restake them to bolster other protocols. This re-staked ether can be delegated to AVS operators supporting Ethos, who then assign this stake to a chosen group of guardians within the Cosmos ecosystem to validate the Ethos Layer 1 chain, referred to as the \"Guardian chain.\" Stakers, in this case, are LRTs providing their ether stakes and receiving rewards in native tokens of Ethos-secured chains.<\/span>","Ethos broke down stake commitments — now totaling $4.7 billion. The breakdown of these commitments includes $2 billion from <a href=\"https:\/\/www.theblock.co\/post\/282962\/ether-fi-announces-airdrop-will-adjust-token-allocation-following-community-complaints\" data-v-f87c67ca=\"\">EtherFi<\/a>, $1.2 billion from Puffer, $1 billion from Renzo, $400 million from Kelp and $100 million from Swell.","<span data-v-f87c67ca=\"\">With over <a href=\"https:\/\/www.theblock.co\/post\/280310\/eigenlayers-total-value-locked-surpasses-10-billion?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">$12 billion<\/a> in ether received from stakers, EigenLayer's considerable stake contributions primarily come from liquid staking providers. These can be reallocated to actively validated services like Ethos, enhancing the common security framework or restaking, thereby deterring potential attacks through economic security.<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/restaking\/eigenlayer-total-value-locked-per-staking-type\/embed\" title=\"EigenLayer Total Value Locked Per Staking Type\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<span data-v-f87c67ca=\"\">Opt-in shared security allows Guardians to co-validate or delegate to secure various Cosmos chains, spreading the security of re-staked ether throughout the ecosystem. Chains powered by Ethos — utilizing the Guardians — can either establish a decentralized trust network or augment their economic security.<\/span>","<span data-v-f87c67ca=\"\">Ethos users include projects like Sommelier, a DeFi app chain in the Cosmos ecosystem, which intends to use Ethos for security purposes. Sommelier mainly engages in dynamic DeFi vaults, boasting nearly $70M in total value locked. Infinity Chain, another user, is a general-purpose blockchain with an EVM execution environment developed on the Cosmos SDK.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Eigen","content":"PERSON"},{"type":"second quarter of this year","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"$4 billion","content":"MONEY"},{"type":"$70M","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$4.7 billion","content":"MONEY"},{"type":"Cosmos SDK","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Renzo","content":"LOCATION"},{"type":"$12 billion","content":"MONEY"},{"type":"Cosmos","content":"LOCATION"},{"type":"$400 million","content":"MONEY"},{"type":"Infinity Chain","content":"ORGANIZATION"},{"type":"AVS","content":"ORGANIZATION"},{"type":"$1.2 billion","content":"MONEY"},{"type":"EVM","content":"ORGANIZATION"},{"type":"Puffer","content":"LOCATION"},{"type":"$2 billion","content":"MONEY"}],"hashtag":["COSMOS","DEVELOPER TOOLS","ETHEREUM","PROTOCOLS","RESTAKING","ROLLUPS","VALIDATORS"],"authors":["Vishal Chawla","The Block"]}