{"summary":"The Block’s Frank Chaparro chats with Jake Dwyer, Head of DeFi at GSR.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/123921\/one-of-cryptos-biggest-trading-firms-is-betting-defi-will-be-as-large-as-the-centralized-crypto-market","publishDate":"2021-11-10T15:15:13","id":4167,"type":null,"title":"One of crypto&#x27;s biggest trading firms is betting DeFi will be as large as the centralized crypto market","category":["PODCASTS"],"content":["<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Episode <strong data-v-f87c67ca=\"\">74 <\/strong>of Season 3 of The Scoop was recorded remotely with The Block’s Frank Chaparro and Jake Dwyer, Head of DeFi at GSR.<\/em><\/span>","<span data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Listen below, and subscribe to The Scoop on&nbsp;<\/i><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Apple<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Spotify<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5tZWdhcGhvbmUuZm0vdGhlYmxvY2stdGhlc2Nvb3A?sa=X&amp;ved=0CAMQ4aUDahcKEwionbSO9fbxAhUAAAAAHQAAAAAQAg\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Google Podcasts<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Stitcher<\/i><\/a><i data-v-f87c67ca=\"\">&nbsp;or wherever you listen to podcasts. Email feedback and revision requests to <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"01716e656260727541756964636d6e626a62737871756e2f626e6c\">[email&nbsp;protected]<\/a>.<\/i><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">This episode is brought to you by our sponsors <a href=\"http:\/\/Bakkt.com\" data-v-f87c67ca=\"\">Bakkt<\/a>,&nbsp;<a href=\"http:\/\/kraken.com\/scoop\" data-v-f87c67ca=\"\">Kraken<\/a>&nbsp;and&nbsp;<a href=\"http:\/\/masterworks.io\/scoop\" data-v-f87c67ca=\"\">Masterworks<\/a><\/strong><\/span>","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bakkt® unlocks the $1.2+ trillion of digital assets that is currently held in cryptocurrencies, rewards and loyalty points, gaming assets and merchant stored value. We began in 2018 with the vision to bring trust and transparency to digital assets. Through the Bakkt Warehouse and Bakkt Bitcoin Futures and Options contracts, we serve institutional clients in an end-to-end regulated market with true price transparency. For consumers, Bakkt aggregates digital assets to enable instant liquidity and to empower users to trade, transfer and pay however they want. Visit <a href=\"http:\/\/Bakkt.com\" data-v-f87c67ca=\"\">Bakkt.com<\/a> for more information<\/span><\/em><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">About Kraken<br data-v-f87c67ca=\"\">\n<\/strong><\/span><span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Whether you’re an experienced crypto trader or just starting out, Kraken has the tools to help you achieve financial freedom. With 50+ cryptocurrencies to choose from, industry-leading security and a wide variety of features to suit any investing strategy, Kraken puts the power in your hands to buy, sell and trade digital assets. Visit&nbsp;<\/em><a href=\"http:\/\/kraken.com\/scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Kraken.com<\/em><\/a><em data-v-f87c67ca=\"\">&nbsp;to get started today.<\/em><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">About Masterworks<br data-v-f87c67ca=\"\">\n<\/strong><\/span><em data-v-f87c67ca=\"\">Masterworks is democratizing the exclusive multi-trillion-dollar art world. Instead of needing to write a $10 million dollar check to buy one Picasso painting, you can buy shares of masterpiece paintings. Masterworks has securitized over $250 million worth of art for their 235,000 members and was recently valued at over $1 billion, making them the first and only unicorn in the alternative investing space. Invest like a billionaire today with a few easy clicks at&nbsp;<a class=\"c-link\" tabindex=\"-1\" href=\"http:\/\/masterworks.io\/scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"http:\/\/masterworks.io\/scoop\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">masterworks.io\/scoop<\/a><br data-v-f87c67ca=\"\">\n<iframe loading=\"lazy\" frameborder=\"0\" height=\"200\" src=\"https:\/\/playlist.megaphone.fm?e=BLOCK4519605118\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe><br data-v-f87c67ca=\"\">\n<\/em>","<br data-v-f87c67ca=\"\">\nGSR is building out a space for itself at the intersection of traditional and decentralized finance worlds, according to its newly-minted head of DeFi, Jake Dwyer.&nbsp;","During the latest episode of The Scoop podcast, Dwyer explained that the firm is building out the capacity to both create new trading products as well as provide liquidity to DeFi protocols in a way that's more familiar to the traditional finance players who want to become more closely involved.&nbsp;","With these plans in hand, GSR expects to contribute more than $1 billion in total value locked over the next year — fueled in no small part by the increase in interest from traditional finance sources.&nbsp;","<span data-v-f87c67ca=\"\">\"People are sitting on pretty substantial positions just by being early users in these protocols,” said Dwyer. “There's still this big position that people are accruing and they want to be able to manage those things while holding on to those positions.\"<\/span>","<strong data-v-f87c67ca=\"\">DeFi vs CeFi<\/strong>","In the last six months, GSR has expanded its venture investment activity in DeFi as a more central component of the business, with an eye on fixed income protocols and credit.","\"You've got things like Aave and Compound and others on other chains for borrow and lend. But we've seen numerous innovations around the second-order derivatives of Swivel and Tempest on the fixed and floating rate interest side of things,\" Dwyer explained.","Dwyer is excited about the collateral and interest rate segment of the market, which he sees as innovating at a fast pace. \"I think that a lot of these different sorts of fixed income derivatives protocols that are out there are going to evolve in really exciting ways over the next the next couple of months.\"","He believes that DeFi will eventually match more centralized activities as the market will see increased innovation.","\"What DeFi offers is in some instances, just sort of a new set of venues that look a lot like the centralized exchange venues that we're accustomed to trading on.<i data-v-f87c67ca=\"\">\"&nbsp;<\/i>He cited GSR's recent investments into Dydx and HashFlow, the latter of which Dwyer said recently reported a billion dollars worth of trading volume.","<b data-v-f87c67ca=\"\">Eyeing a multi-chain future<\/b>","Looking to the future, Dwyer said he believes that it will be one marked by a variety of networks that serve different purposes — and in the background, in some cases.","<span data-v-f87c67ca=\"\">\"We believe that in the future you're not going to know what chain you're interacting with necessarily or care,\" he said.<\/span>","<span data-v-f87c67ca=\"\">These different chains will have varying kinds of specialization, such as high speed, high settlement, and the ability to create a central limit order book, according to Dwyer.<\/span>","<span data-v-f87c67ca=\"\">As he put it: “It's almost like if you wanted to use Uber and Lyft, you had to have two different phones, and that doesn't seem like a sustainable way of the future.\"<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"GSR","content":"ORGANIZATION"},{"type":"Bakkt Warehouse","content":"ORGANIZATION"},{"type":"$1.2+ trillion","content":"MONEY"},{"type":"$250 million","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Dwyer","content":"PERSON"},{"type":"last six months","content":"DATE"},{"type":"Spotify","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Jake Dwyer","content":"PERSON"},{"type":"billion dollars","content":"MONEY"},{"type":"$10 million dollar","content":"MONEY"},{"type":"Frank Chaparro","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}