{"summary":"The Velo Protocol is a financial protocol that issues digital credits pegged to any fiat currency. It ensures that these digital credits are always properly collateralized to maintain a 1:1 digital credit to fiat currency value ratio","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/85526\/velo-protocol-powering-the-worlds-premiere-federated-credit-exchange-network","publishDate":"2020-11-28T11:40:49","id":4169,"type":null,"title":"Velo Protocol powering the world’s premiere Federated Credit Exchange Network","category":["SPONSORED"],"content":["Imagine a network where partners – stemming from legacy finance, CeFi, and DeFi industries – are all created equal. This network has no central nodes and all data is sent from one node to another via the shortest, most efficient route available. In this network, all participants agree to a set of core conceits – be they policies, algorithms, a governance hierarchy, or otherwise – for the benefit of the network as a whole. Beyond these core conceits, network participants maintain their autonomy.","This is the vision that Velo Labs is pursuing with its <a href=\"https:\/\/medium.com\/veloprotocol\/building-the-worlds-premiere-federated-credit-exchange-network-ab212ab378ce\" data-v-f87c67ca=\"\">Federated Credit Exchange Network<\/a>. This network, powered by the Velo Protocol, enables network participants to freely issue digital credits pegged to any stable currency by staking VELO tokens. Network participants can then use these digital credits in their day-to-day business operations.","To participate in Velo Labs’ Federated Credit Exchange Network, there are several stipulations to which all network participants must abide. These include:","Behaviours outside these stipulations are left to the network participants.","<strong data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">The Velo Protocol<\/em><\/strong>","The Velo Protocol is a financial protocol that issues digital credits pegged to any fiat currency. It ensures that these digital credits are always properly collateralized to maintain a 1:1 digital credit to fiat currency value ratio. There are two primary components to the Velo Protocol. A Digital Credit Issuance Mechanism and a Digital Reserve System.","The Digital Credit Issuance Mechanism is the part of the Velo Protocol that issues digital credits pegged to any fiat currency. The Digital Reserve System automatically rebalances these collateral pools to maintain a 1:1 value ratio between the digital credits and their related fiat currency. In other words, as the price of the collateralized tokens increases on the open market, the Digital Reserve System automatically removes said tokens from the individual collateral pools and adds them to the system’s reserve pool. Similarly, when the price of the collateralized tokens falls on the open market, said tokens will be automatically removed from the system’s reserve pool and added to each individual collateral pool.","Issuing digital credits and balancing collateral pools in this way requires Turing-complete smart contracts – something that the Stellar Network does not support. As VELO is Stellar-based, a bit of cross-chain wizardry is required. Enter the Hermes Warp Protocol.","<strong data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">The Hermes Warp Protocol<\/em><\/strong>","The Hermes Warp Protocol is a cross-chain protocol that bridges Stellar and other chains such as Evrynet.","When smart contract functions are needed, the relevant Stellar-based tokens are locked in a custodian multi-signature address and Evrynet-based tokens – corresponding to each individual Stellar-based token – are released. When a network participant needs to convert their digital credits back into Stellar-based tokens, the Evrynet-based tokens are removed from circulation. The original Stellar-based tokens are then unlocked from their custodial accounts. On a related note, Velo Labs recently <a href=\"https:\/\/medium.com\/veloprotocol\/velo-labs-partners-with-matrixport-and-cactus-custody-19e912e043aa\" data-v-f87c67ca=\"\">announced a partnership<\/a> with Matrixport Cactus to provide cutting-edge custodial services.","The Hermes Warp Protocol also enables Ethereum-based tokens to be converted to-and-from Evrynet- and Stellar-based tokens. This paves the way for all Ethereum-based projects to connect to Velo Labs’ Federated Credit Exchange Network.","<strong data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Velo Labs’ Federated Credit Exchange Network<\/em><\/strong>","Backed by the Stellar Network and the CP Group – one of the biggest conglomerates in the world – Velo Labs is currently serving business partners in Southeast Asia. By connecting the legacy finance, CeFi and DeFi industries, Velo Labs’ Federated Credit Exchange Network positions Velo Labs to be one of few blockchain projects with a clear path towards mass adoption.","<a href=\"https:\/\/velo.org\/\" data-v-f87c67ca=\"\">Learn More about Velo.<\/a>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Digital Reserve System","content":"ORGANIZATION"},{"type":"Velo Labs’ Federated Credit Exchange Network","content":"ORGANIZATION"},{"type":"Southeast Asia","content":"LOCATION"},{"type":"Velo Protocol","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"CP Group","content":"ORGANIZATION"},{"type":"Digital Credit Issuance Mechanism","content":"ORGANIZATION"},{"type":"Hermes Warp Protocol","content":"ORGANIZATION"},{"type":"Evrynet","content":"LOCATION"},{"type":"Stellar Network","content":"ORGANIZATION"},{"type":"Evrynet","content":"PERSON"},{"type":"Ethereum","content":"PERSON"},{"type":"Federated Credit Exchange Network","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}