{"summary":"The exchange suspended all trading and withdrawals after a security breach which resulted in client fund loss.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/269590\/canada-catalyx-ceases-trading-security-breach","publishDate":"2023-12-28T20:57:35","id":4172,"type":null,"title":"Catalyx crypto exchange ceases all trading after security breach","category":["EXCHANGES"],"content":["CataX CTS Ltd., the Calgary-based company operating cryptocurrency trading platform Catalyx, has suspended trading and fund withdrawals at the exchange which was recently affected by a security breach, the company <a href=\"https:\/\/www.newswire.ca\/news-releases\/catalx-cts-ltd-announces-security-breach-loss-of-crypto-assets-and-ongoing-investigation-805146446.html\" data-v-f87c67ca=\"\">said<\/a> on Thursday.","The suspension follows a cease trade <a href=\"https:\/\/www.asc.ca\/-\/media\/ASC-Documents-part-1\/Notices-Decisions-Orders-Rulings\/Enforcement\/2023\/12\/CatalX-CTS-Ltd-ORDER-2023-12-21-61310061.ashx\" data-v-f87c67ca=\"\">order<\/a> issued on Dec. 21 by the Alberta Securities Commission against the company and co-founder Jae Ho Lee.","As the security breach resulted in a loss in some of Catalyx customers’ crypto assets, the company launched an investigation with suspicion that an employee was involved in the incident.","CataX did not disclose the exact amount of losses, and did not immediately respond to The Block’s email enquiry for further details.","Global financial auditing firm Deloitte LLP will “provide forensic and investigative services to the company” in examining the incident, CataX said. The firm plans on updating its users after Deloitte finishes the investigation, the company noted in the statement.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dec. 21","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"CTS Ltd.","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Deloitte LLP","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Alberta Securities Commission","content":"ORGANIZATION"},{"type":"Jae Ho Lee","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Deloitte","content":"ORGANIZATION"},{"type":"Calgary","content":"LOCATION"}],"hashtag":["CRYPTO"],"authors":["Danny Park","The Block"]}