{"summary":"After the collapse of FTX, Sam Bankman-Fried has now been sentenced for 25 years. Here’s how the crypto community took the news.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285468\/not-nearly-long-enough-world-reacts-to-sbfs-25-year-prison-sentence","publishDate":"2024-03-28T13:12:30","id":4177,"type":null,"title":"&#x27;Not nearly long enough&#x27;: World reacts to SBF&#x27;s 25-year prison sentence","category":["PEOPLE"],"content":["Former FTX CEO Sam Bankman-Fried was sentenced on Thursday to 25 years in prison for his role in the FTX fraud case. He has also been ordered to forfeit $11 billion, meaning he is on the hook for any unrecovered funds in the bankruptcy process.","Yet, among the crypto community, there was widespread sentiment that the sentence was on the low end.&nbsp;","Dan Held, a general partner at Asymmetric, <a href=\"https:\/\/twitter.com\/danheld\/status\/1773377661470982456\" data-v-f87c67ca=\"\">said<\/a> the judgment was “Not nearly long enough given his actions, feelings around his actions, and actual damage caused.”","The collapse of FTX resulted in a roughly $8 billion hole. The estate is trying to recover as much of these funds as possible, including through <a href=\"https:\/\/www.theblock.co\/post\/285269\/galaxy-locked-sol-sale-ftx-estate\" data-v-f87c67ca=\"\">the sale of locked solana<\/a>. It is anticipating a 100% recovery in dollar terms — although this still leaves many creditors with significant losses in crypto terms.","Variant Fund Chief Legal Officer Jake Chervinsky pointed out that Bankman-Fried’s sentence was much lower than Ross Ulbricht, who got two life sentences plus forty years for his role in orchestrating the Silk Road. “This is not justice,” he <a href=\"https:\/\/twitter.com\/jchervinsky\/status\/1773379331240194069\" data-v-f87c67ca=\"\">posted<\/a> on X.&nbsp;","Nic Carter, a partner at Castle Island Ventures, <a href=\"https:\/\/twitter.com\/nic__carter\/status\/1773381240764113246\" data-v-f87c67ca=\"\">added<\/a>, “I just feel tremendous pain and sympathy for Ross Ulbricht.”","Whistleblower Edward Snowden was surprised that Bankman-Fried got a lower sentence than fellow whistleblower Chelsea Manning. “holy shit he gave him less than Chelsea Manning (35 years) for a waaaaay worse crime,” he <a href=\"https:\/\/twitter.com\/Snowden\/status\/1773376645161730378\" data-v-f87c67ca=\"\">said<\/a>.","Others compared the sentencing to the current trial of Alexey Pertsev, who is facing a 5-year sentence regarding his involvement with Tornado Cash. “Doesn’t it drive you mad SBF defrauds the whole world and gets 25 (will probs get out early) Pertsev on trial for writing a smart contract and is treated the same way or worse,” <a href=\"https:\/\/twitter.com\/MacroMate8\/status\/1773381245830942911\" data-v-f87c67ca=\"\">said<\/a> Seraphim Czecker, head of growth at Ethena Labs.","Bankman-Fried's sentencing may be the end of this chapter for the crypto industry, said multiple pundits.","\"We are focused on the crypto market, and this trial is the conclusion of a sorry episode that the market has moved on from. Enron was not a demonstration that all energy markets were fraudulent, nor was Madoff an indicator of all hedge funds. We believe in the crypto market’s robustness and support the prosecution of bad actors,\" said Michael Silberberg, head of investor relations at Alt Tab Capital.","Crypto exchange Kraken added that the industry needs to learn its lessons as it moves forward.","\"Sam Bankman-Fried founded his empire on false promises and stolen client funds. SBF now faces consequences, but this does not undo the immense harm he has caused to millions of people and the crypto industry,\" said a spokesperson for the exchange. \"Good crypto actors must set the tone by improving education, calling out bad actors, and adhering to crypto’s founding principles of personal ownership and public verifiability.\"","Crypto influencer Sisyphus, however, <a href=\"https:\/\/twitter.com\/0xSisyphus\/status\/1773380542098002063\" data-v-f87c67ca=\"\">observed<\/a>, “SBF’s sentencing time is ‘short’ but still meaningfully longer than the amount of time the crypto industry has existed for.”","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Enron","content":"ORGANIZATION"},{"type":"Ross Ulbricht","content":"PERSON"},{"type":"Carter","content":"PERSON"},{"type":"Castle Island Ventures","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Jake Chervinsky","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Madoff","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"Ethena Labs","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Michael Silberberg","content":"PERSON"},{"type":"Edward Snowden","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$11 billion","content":"MONEY"},{"type":"Chelsea Manning","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Dan Held","content":"PERSON"},{"type":"Seraphim Czecker","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Alexey Pertsev","content":"PERSON"},{"type":"$8 billion","content":"MONEY"},{"type":"Alt Tab Capital","content":"ORGANIZATION"}],"hashtag":["SAM BANKMAN-FRIED"],"authors":["Tim Copeland","The Block"]}