{"summary":"Financial statements for one of Binance UK&#x27;s subsidiaries are “grossly inaccurate,&quot; the directors of Dimplx say.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176781\/binance-partners-say-it-made-grossly-inaccurate-filings-in-the-uk-ft","publishDate":"2022-10-12T16:17:19","id":4180,"type":null,"title":"Binance joint venture partners allege inaccurate UK filings: FT","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">The world’s largest crypto exchange has been accused of filing a “grossly inaccurate” annual report in 2020 by the co-owner of a Binance UK subsidiary called Dimplx. The Financial Times first reported the story.<\/span>","<span data-v-f87c67ca=\"\">Financial statements for one of Binance’s UK companies “do not accurately report” the nature of its business, the directors of Dimplx said, nor do they reflect its assets and liabilities, \"including potential tax liabilities” and turnover.<\/span>","<span data-v-f87c67ca=\"\">Dimplx, which was formed as part of a joint venture with Binance in 2019, made the allegation in its own filings this month, raising questions about the role that UK companies played in Binance’s global operations in the period before its warning from the Financial Conduct Authority (FCA), a UK financial regulatory body.<\/span>","<span data-v-f87c67ca=\"\">In June 2021, the FCA issued a consumer warning against Binance Markets Ltd, a UK subsidiary of the Binance group, which banned it from engaging in any regulated activities in the UK. Binance had failed to provide basic information about its operations, such as “trading names and functions for all group entities globally,” the agency said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Dimplx’s claims center on another UK entity, Binance Digital, which was incorporated in the UK in November 2019 as a “payment processing facilitator” according to its annual reports, and was “responsible for transactions” between crypto and all national currencies except the Turkish lira, according to archived copies of Binance’s terms and conditions.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In Dimplx’s annual report for the year to February 2021, company directors Simon Dingle and Joshin Raghubar allege that there were a spate of inaccuracies in Binance Digital’s accounts for 2020.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Binance’s filing suggests that <\/span><span data-v-f87c67ca=\"\">at the end <\/span><span data-v-f87c67ca=\"\">Binance Digital had roughly <\/span><span data-v-f87c67ca=\"\">£100 million ($100 million) in “cash and\/or bank balances” in 2020, and that the same sum was owed to “creditors.” The Dimplx directors said they believe the £100 million represented balances held “on behalf of Binance Digital customers who had visited binance.com,” who would be “liable to pay transaction fees.”<\/span>","<span data-v-f87c67ca=\"\">The financial statements, however, recorded “zero turnover or fees,” on any transactions recorded by customers during the financial year, Dimplx said. Binance Digital’s 2020 accounts say that no turnover or revenue was recognised during the year, and the company paid no UK tax.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Dimplx said that it plans to pursue litigation against Binance over disputes arising from their business relationship, but it did not provide details about its claims. Binance stated that in light of the threat of litigation, it would not be able to “respond fully to the allegations,” and added that <\/span><span data-v-f87c67ca=\"\">“we understand that the minority shareholders are disappointed that the joint venture did not bear fruit.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 2021","content":"DATE"},{"type":"Binance Digital","content":"ORGANIZATION"},{"type":"100 million ($100 million","content":"MONEY"},{"type":"Binance UK","content":"ORGANIZATION"},{"type":"FCA","content":"ORGANIZATION"},{"type":"November 2019","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Simon Dingle","content":"PERSON"},{"type":"UK","content":"ORGANIZATION"},{"type":"Joshin Raghubar","content":"ORGANIZATION"},{"type":"February 2021","content":"DATE"},{"type":"Binance Markets Ltd","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Financial Times","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Financial Conduct Authority (FCA","content":"ORGANIZATION"},{"type":"Binance","content":"ORGANIZATION"},{"type":"Dimplx","content":"PERSON"}],"hashtag":[],"authors":["Sam Venis","The Block"]}