{"summary":"Crypto payments company and USDC issuer Circle will launch a cross-chain transfer protocol to support USDC interoperability.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173529\/circle-introduces-bridging-protocol-focused-on-usdc-payments","publishDate":"2022-09-28T16:41:35","id":4181,"type":null,"title":"Circle introduces bridging protocol focused on USDC payments","category":["STABLECOINS"],"content":["Crypto payments company and USDC issuer Circle is launching a cross-chain transfer protocol to support USDC interoperability.","The product was announced during the company's inaugural crypto conference in San Francisco on Wednesday. It is expected to go live on Ethereum and Avalanche mainnet later this year.","The new product is permissionless and allows for USDC to be sent natively across ecosystems, in an effort to improve liquidity and reduce fragmentation of bridged assets.","\"Users today have limitations when transferring USDC across blockchain ecosystems,\" the company said. \"Existing solutions typically require locking up USDC on one chain and creating a synthetic 'bridged' version of USDC on another – creating fragmented liquidity and a complicated user experience.\"","The company also announced that it intends to make USDC available on five additional blockchain ecosystems in the next few months: Arbitrum, Cosmos, NEAR, Optimism and Polkadot.","“The multi-chain expansion is intended to increase USDC’s native availability from eight ecosystems to thirteen, and enables blockchain developers building on USDC and their users to experience greater liquidity and interoperability within the crypto economy,” said Joao Reginatto, VP of Product at Circle. “Extending multi-chain support for USDC opens the door for institutions, exchanges, developers and more to innovate and have easier access to a trusted and stable digital dollar.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Cosmos","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Joao Reginatto","content":"PERSON"},{"type":"VP of Product at Circle","content":"ORGANIZATION"}],"hashtag":["USDC"],"authors":["Catarina Moura","The Block"]}