{"summary":"A Royal Bank of Canada analyst said multiple risks make it unlikely the U.S. Federal Reserve will issue a CBDC anytime soon.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/248250\/fed-likely-to-take-incremental-approach-to-cbdc-development-rbc-says","publishDate":"2023-08-31T11:13:23","id":4183,"type":null,"title":"Fed likely to take incremental approach to CBDC development, RBC says","category":["POLICY"],"content":["<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">A Royal Bank of Canada analyst expects the U.S. Federal Reserve to take an incremental approach when it comes to developing a CBDC, or digital dollar.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">In a&nbsp;<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.rbcwealthmanagement.com\/en-ca\/insights\/central-bank-digital-currency-and-the-future-of-money\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">report<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;published this week, RBC analyst Atul Bhatia believes that instead of issuing a fully-fledged retail and wholesale CBDC, the&nbsp;<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.theblock.co\/post\/243813\/federal-reserve-increases-oversight-of-banking-crypto-ties\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Federal Reserve<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\"> is likely to take a more measured approach.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"We think the Federal Reserve will continue to emphasize incremental technology improvements versus a risky push to transform the payments infrastructure,\" he said.<\/span>","CBDCs have the potential to offer efficiencies beyond what can be achieved using current payment systems, streamlining the interplay between multiple intermediaries into a single, central-bank-controlled database that could directly issue digital currency to individual wallets. But the technology comes with certain risks.&nbsp;","\"We think having a single point of failure for dollar payments in a world that uses the greenback for all manner of trade is a terrible idea,\" Bhatia said. \"In one move, the U.S. would create an unparalleled target for hackers and thieves, not to mention terrorists or geopolitical rivals.\"","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Bhatia said that \"despite the hype around CBDCs, we see a host of security, privacy, and governance concerns that we believe outweigh the theoretical gains on efficiency.\" He added that \"commercial bank accounts and physical cash are likely to remain at the center of U.S. financial architecture for the foreseeable future.\"&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The Fed has been evaluating the potential impact of issuing a CBDC, conducting several studies, pilot tests and experiments to evaluate the technology and its limitations.&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The U.S. central bank, meanwhile, has already developed a real-time payment system called <\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.frbservices.org\/financial-services\/fednow\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">FedNow.<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\"> Like a CBDC, it allows for immediate, digital settlement, although it operates only between depository institutions and doesn't use blockchain technology.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Bhatia called prevailing systems of financial settlement \"gloriously inefficient\" and <\/span><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">highlighted specific efficiencies that a digital dollar could bring.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"Ownership records would be fully electronic and consolidated, making movements between accounts simple and instantaneous,\" he said. \"In practice, individuals and businesses would likely have accounts directly at the Fed, and buying groceries, for instance, would simply involve a customer moving CBDC from its Fed account to the grocer's.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The analyst also argued that a CBDC could bring faster transactions for large companies, onboard more people into the banking system and reduce counterparty risk.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"CBDCs offer faster and cheaper payments, allow people currently outside the traditional banking system access to financial infrastructure, and could reduce settlement risk and delays on international trade,\" he said.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Royal Bank of Canada","content":"ORGANIZATION"},{"type":"RBC","content":"ORGANIZATION"},{"type":"Atul Bhatia","content":"PERSON"},{"type":"Bhatia","content":"PERSON"}],"hashtag":["CBDCS","FEDERAL RESERVE","TREASURY DEPARTMENT"],"authors":["Brian McGleenon","The Block"]}