{"summary":"The Block is delighted to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley (@stephendpalley) and Nelson M.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/6495\/suggestions-of-20x-returns-leads-to-allegations-of-fraudulent-inducement-and-conspiracy","publishDate":"2019-01-05T13:50:22","id":4185,"type":null,"title":"Suggestions of 20x returns leads to allegations of fraudulent inducement and conspiracy","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">The Block is delighted to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part II of this week's analysis,&nbsp;Crypto Caselaw Minute, is below.<\/em>","There are four billion reasons to read this week’s CCM. Palley looks at a Florida case that deals with the alleged misappropriation of $4 Billion USD in bitcoin, Rosario writes up a new lawsuit filed in federal court in NY that concerns a crypto investment scheme gone wrong, and finally we are lucky to have another guest post from attorney Andrés Chomczyk who gives us the 411 on a bad case for crypto from the Chilean Supreme Court. (As always, Rosario summaries are “NMR” and Palley summaries are “SDP”, and for this week our guest summary is labeled “ACH.”)","<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario [twitter: <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>] and Stephen Palley [twitter: <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>]. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes. (Picture credit: <a href=\"https:\/\/pixabay.com\/en\/adirondack-adirondack-chair-3814584\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Pixabay<\/a>; CC0 Creative Commons)<\/em>","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]Lagemann et al. v. Spence et al., № 1:18-CV-12218, (S.D. NY Dec. 26, 2018) [NMR]<\/strong><\/em>","<a href=\"https:\/\/www.scribd.com\/document\/396682321\/Silver-Suit\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Link to complaint<\/a>","Picture this. It’s December 2017 and the Great Crypto Bull Run of 2017™ is at its peak. Naturally, with nothing but blue skies ahead this is the perfect time to start a crypto hedge fund. So, you take to Telegram and start advertising your great new investment opportunity. People contribute, you set out with your plan of making money, and then, things change. The market tanks. Investors get jumpy. They want their money back. They don’t receive it. Now it turns out there may have never been a hedge fund. A lawsuit is filed. This story format is not unique to crypto, but stories like this may become more common in this space. So, what happened to prompt this lawsuit?","As alleged in the complaint on or about December 2017, Jeremy Spence created a group on Telegram to solicit investment in a company he was allegedly operating called Coin Signals. In particular, Spence represented that Coin Signals “utilized trading algorithms and unique models to process cryptocurrency trading data and exploit trading opportunities in such a way that would generate significant investment returns for the company’s investors.” Apparently, in one particular post Spence stated “[i]f you guys stick with me in 2018[,] you have no excuse not to 20x your money. <em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">If you don’t[,] you will get a full group refund<\/strong><\/em> . . . .” (emphasis added). People were interested, and Spence was off to the races.","The plaintiffs allege that much of what Spence was representing about himself, and what he was promising in terms of returns, was simply not true. In addition, Spence allegedly had some help. Enter CryptoSpaceGuy and BlackXantus.","CryptoSpaceGuy is the alleged screen-name of one of the co-defendants in this case Jamie Cruz-Herrera. BlackXantus’s real name is at the moment unknown. These two allegedly assisted Spence with his endeavours with Cruz-Herrera functioning as a hype-man in Discord chat rooms setup for investors, and BlackXantus operating the “trading algorithm” for the fund and serving as intake for cryptocurrency investments from the plaintiffs. Incidentally, Cruz-Herrera and Spence were allegedly roommates and business partners from their time together at NYU.","All told, during 2018 the plaintiffs invested 116.5 bitcoin and 28 ether. Making poor investment choices happens all the time, but you may have a cause of action if you can show that you were induced to make those choices based off of lies and other such nefarious activity. Lies, misrepresentations, fraudulent inducement and a conspiracy are what is generally alleged here, and serves as the basis for multiple causes of action in the lawsuit.","Two more points are worth covering in this case. The first is that the plaintiffs are seeking return of the specific cryptoassets they invested in the fund from Spence. This may difficult; however, because the plaintiffs claim that Spence roped in his parents to hold some of the assets themselves in wallets or trading accounts in their names. If this is true wallet services or crypto exchanges may be hearing from plaintiffs soon for information concerning the Spences.","The second point is the plaintiffs allege a civil conspiracy between Spence, Cruz-Herrera, and BlackXantus to solicit funds from the plaintiffs on the basis of false statements to enrich themselves in what amounted to a traditional Ponzi scheme. Recently, the plaintiffs discovered a private chatroom message that simply must be included in this post:","<a href=\"https:\/\/www.theblockcrypto.com\/2019\/01\/05\/suggestions-of-20x-returns-leads-to-allegations-of-fraudulent-inducement-and-conspiracy\/1_hbt4-b1iuwqpgnycsndlpw\/\" rel=\"attachment wp-att-6496\" data-v-f87c67ca=\"\"><img class=\"size-full wp-image-6496 aligncenter\" src=\"https:\/\/www.theblockcrypto.com\/wp-content\/uploads\/2019\/01\/1_hBt4-b1IUwQpGnyCSndLpw.png\" alt=\"\" width=\"704\" height=\"173\" data-v-f87c67ca=\"\"><\/a><br data-v-f87c67ca=\"\">\nBlackXantus is apparently the bigfoot looking “BX” in the above image. The complaint has this to say about the above image “[a]s BLACKXANTUS admitted, investors’ deposits did not go toward an investment program; rather, the funds were taken by the CSM FUND Defendants to, inter alia, pay off their own debts.” As always, everything you put in writing on any platform can be evidence.","It will be interesting to follow this case to see if: 1) the cryptoassets can actually be recovered; and 2) anyone knows who Big Foot, I’m sorry, BlackXantus actually is. Assuming the allegations in the lawsuit are true, of course.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NYU","content":"ORGANIZATION"},{"type":"Jamie Cruz","content":"PERSON"},{"type":"Spence","content":"PERSON"},{"type":"2017","content":"DATE"},{"type":"Chilean Supreme Court","content":"ORGANIZATION"},{"type":"December 2017","content":"DATE"},{"type":"CCM","content":"ORGANIZATION"},{"type":"Nelson Rosario [","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"Jeremy Spence","content":"PERSON"},{"type":"Herrera","content":"PERSON"},{"type":"SDP","content":"ORGANIZATION"},{"type":"Andrés Chomczyk","content":"PERSON"},{"type":"CSM","content":"ORGANIZATION"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"},{"type":"CC0 Creative Commons)","content":"ORGANIZATION"},{"type":"Florida","content":"LOCATION"},{"type":"Lagemann","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Dec. 26, 2018","content":"DATE"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"S.D.","content":"LOCATION"},{"type":"Palley","content":"PERSON"},{"type":"Cruz","content":"PERSON"},{"type":"$4 Billion","content":"MONEY"}],"hashtag":[],"authors":["Contributor Network","The Block"]}