{"summary":"TRM Labs’ latest report revealed a diversification in illicit crypto activities, with Bitcoin now being used in just 19% of these cases.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236908\/bitcoin-accounted-for-just-19-of-illicit-crypto-activity-in-2022-trm-labs","publishDate":"2023-06-28T08:48:10","id":4193,"type":null,"title":"Bitcoin accounted for just 19% of illicit crypto activity in 2022: TRM Labs","category":["CRYPTO ECOSYSTEMS"],"content":["Illicit activities involving cryptocurrency are diversifying, with Bitcoin being used in only 19% of these cases. This is according to a <a href=\"https:\/\/www.trmlabs.com\/illicit-crypto-ecosystem-report-2023\" data-v-f87c67ca=\"\">report<\/a> released today by TRM Labs, a blockchain intelligence firm that works with law enforcement agencies.","In 2016, Bitcoin accounted for a staggering 97% of the total illicit crypto volume, demonstrating its previous dominance. This figure has since decreased significantly, with Bitcoin now representing just 19% of all illicit crypto activities in 2022.","The report titled \"Illicit Crypto Ecosystem Report\" revealed a significant shift in criminal behavior, marked by a diversification towards other chains such as Ethereum, Tron, and Binance Smart Chain. Tactics like “chain-hopping” — the act of moving crypto assets between different chains — was also noted by TRM as an increasingly used method by criminals to launder stolen crypto assets and evade detection.","“The shift away from the Bitcoin blockchain towards other blockchains and tactics underscores the importance of our mission to build the industry’s most comprehensive map of illicit financial flows on-chain,” said Esteban Castaño, co-founder and CEO of TRM Labs.","The report further specified that overall, approximately $7.8 billion was funneled into various crypto-related fraud schemes in 2022. Roughly $2 billion was stolen through <a href=\"https:\/\/www.theblock.co\/post\/196941\/the-biggest-crypto-hacks-of-2022\" data-v-f87c67ca=\"\">hacks<\/a> on cross-chain bridges, mechanisms that enable the transfer of cryptocurrency between different blockchains.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"TRM Labs","content":"ORGANIZATION"},{"type":"2016","content":"DATE"},{"type":"19%","content":"PERCENT"},{"type":"Binance Smart Chain","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"97%","content":"PERCENT"},{"type":"Esteban Castaño","content":"PERSON"},{"type":"$7.8 billion","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"$2 billion","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["EXPLOITS","HACKS","MIXERS"],"authors":["Vishal Chawla","The Block"]}