{"summary":"Moody&#x27;s downgraded the ratings of Silvergate Capital and its bank subsidiary Silvergate Bank following the downgrade of the bank&#x27;s standalone Baseline Credit Assessment to b2 from ba3.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/213634\/moodys-downgrades-silvergate-with-outlook-still-negative-even-as-big-firms-buy-shares","publishDate":"2023-02-21T09:51:13","id":4197,"type":null,"title":"Moody&#x27;s downgrades Silvergate, with outlook still negative even as big firms buy shares","category":["FINANCE FIRMS"],"content":["Moody's downgraded the ratings of Silvergate Capital and its bank subsidiary Silvergate Bank following the downgrade of its standalone Baseline Credit Assessment to b2 from ba3.","Silvergate Capital's long-term issuer rating was downgraded to B3 from B1, and the outlook remains negative. The downgrade was driven by the substantial decline in capital following the company's $1 billion loss in the fourth quarter and&nbsp;comes as Susquehanna Advisors Group and Citadel Securities have been buying substantial stakes in the bank, <a href=\"https:\/\/www.theblock.co\/post\/211577\/susquehanna-advisors-group-buys-7-5-stake-in-silvergate-following-citadel-securities\" data-v-f87c67ca=\"\">driving<\/a> shares higher.&nbsp;","\"While the company has reduced its workforce by around 40%, given the substantial decline in deposits from crypto centric firms, we anticipate profitability will be heavily challenged in coming quarters,\" Moody's said in a report.","Silvergate Capital continues to be well capitalized, but the company faces the potential for further unanticipated shocks to erode capital given elevated regulatory and legal risks and constrained profitability, the ratings agency said. The company is also facing challenges in preserving its funding and liquidity profile as it looks to reduce its reliance on brokered deposits and Federal Home Loan Bank funding.&nbsp;&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Baseline Credit Assessment","content":"ORGANIZATION"},{"type":"Moody's","content":"ORGANIZATION"},{"type":"Silvergate Bank","content":"ORGANIZATION"},{"type":"Federal Home Loan Bank","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Susquehanna Advisors Group","content":"ORGANIZATION"},{"type":"Moody","content":"ORGANIZATION"},{"type":"Silvergate Capital","content":"ORGANIZATION"},{"type":"fourth quarter","content":"DATE"},{"type":"Citadel Securities","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}