{"summary":"Decentralized trading platform AirSwap unveiled a new data aggregator product today, a move that shows the firm is looking to stand out in the market for","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/9802\/airswap-is-betting-on-open-source-as-decentralized-exchange-volumes-hit-all-time-lows","publishDate":"2019-01-31T13:32:10","id":4199,"type":null,"title":"AirSwap is betting on open source as decentralized exchange volumes hit all-time lows","category":["MARKETS"],"content":["Decentralized trading platform AirSwap unveiled a new data aggregator product today, a move that shows the firm is looking to stand out in the market for so-called decentralized exchanges.&nbsp;","The new product, dubbed DexIndex, provides an overview of how different ERC20 tokens are trading across a number of decentralized exchanges, including AirSwap's market. The tool could be useful for a number of participants across the Ethereum ecosystem, Graham Perich, a developer at AirSwap, told The Block.","\"If you are working on a trading desk, you might use this data to inform your trading algorithms,\" he said as an example. Elsewhere in the market, Totle provides a platform that allows traders to trade and view pricing data across multiple markets. AirSwap, however, is making the product's code open-source, meaning anyone can use it for free. It could also be used by developers looking to build applications that would need real-time pricing data, such as a wallet.&nbsp;","","","It's a bold move for a firm in the decentralized exchange space, which is known for its paltry volumes. In total, volumes for decentralized exchanges have collapsed by 95% year-to-date. AirSwap sees just $20,000 trade hands on its platform per day, according to data provided by <a href=\"https:\/\/coinmarketcap.com\/exchanges\/airswap\/\" data-v-f87c67ca=\"\">CoinMarketCap<\/a>.","Still, Perich told The Block the product could add transparency to the decentralized exchange market inasmuch as it will make it easier for traders and developers to find the venue where they can get the best price — something that could benefit all DEXs. Perich said the firm will continue to roll-out more open-source products to be used by other players as a way to grow the market.","","","\"When you are able to share software within the community it creates beneficial relationships,\" he said. \"If you have something that works, an infrastructure stack, and you can help other organizations keep their nodes updated with it, then that's good for everyone.\"","Sharing code is commonplace in Silicon Valley, but novel in the Wall Street world. Deutsche Bank, for instance, made some of its code available <a href=\"https:\/\/www.db.com\/newsroom_news\/2017\/deutsche-bank-makes-its-computer-code-publicly-available-for-the-first-time-en-11674.htm\" data-v-f87c67ca=\"\">to the public for the first time just two years ago<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Deutsche Bank","content":"ORGANIZATION"},{"type":"Graham Perich","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$20,000","content":"MONEY"},{"type":"Totle","content":"ORGANIZATION"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"AirSwap","content":"ORGANIZATION"},{"type":"CoinMarketCap","content":"ORGANIZATION"},{"type":"Perich","content":"PERSON"},{"type":"95%","content":"PERCENT"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}