{"summary":"HashKey Group said it plans to launch the network on testnet within the next six months, and on mainnet within a year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287214\/hashkey-ethereum-layer-2","publishDate":"2024-04-09T06:10:58","id":42,"type":null,"title":"Hong Kong’s HashKey Group unveils Ethereum Layer-2 chain","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">HashKey Group, a Hong Kong-headquartered digital asset services provider, announced the upcoming launch of its Ethereum Layer-2 network HashKey Chain on Tuesday at the 2024 Hong Kong Web3 Festival.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The network, which adopts zero knowledge-proof technology, aims to expand HashKey's Web3 ecosystem by offering users low-cost, efficient and developer-friendly on-chain services, the company said in a statement. HashKey expects to carry out a testnet launch within the next six months, followed by the mainnet launch within a year.<\/span>","<span data-v-f87c67ca=\"\">The group said zero knowledge-proof technology enables the chain to achieve higher scalability and cost efficiency, along with a comprehensive developer toolset and user-friendly blockchain browser.<\/span>","<span data-v-f87c67ca=\"\">Security will remain a priority with third-party code audits and community participation in security testing planned, the company added. According to the release, the network will aim to provide a safe and self-controllable environment for developers, incentivized by HSK, HashKey's platform token.<\/span>","<span data-v-f87c67ca=\"\">HashKey Cloud, a web3 infrastructure provider and a unit of the HashKey Group, is set to power HashKey Chain. It has provided node validation services for over 80 public chains since 2018, the company said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On Monday, HashKey launched a new crypto exchange, <\/span><a href=\"https:\/\/www.theblock.co\/post\/286859\/hashkey-launches-global-crypto-exchange-after-bermuda-license\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">HashKey Global<\/span><\/a><span data-v-f87c67ca=\"\">, after gaining a relevant license in Bermuda. It is reportedly planning another funding round later this year, after completing a <\/span><a href=\"https:\/\/www.theblock.co\/post\/272745\/hong-kongs-hashkey-secures-100-million-in-series-a-round-at-1-2-billion-valuation\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Series A round<\/span><\/a><span data-v-f87c67ca=\"\"> in January that secured nearly $100 million.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Hong Kong Web3 Festival","content":"ORGANIZATION"},{"type":"Bermuda","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"HSK","content":"ORGANIZATION"},{"type":"HashKey Global","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"HashKey","content":"ORGANIZATION"},{"type":"HashKey Group","content":"ORGANIZATION"}],"hashtag":["HASHKEY"],"authors":["Danny Park","The Block"]}