{"summary":"Crypto market maker GSR has reduced its estimate of a spot ether ETF approval in May to 20%.\nIn January, GSR held a more optimistic stance, putting the chances of a May spot ether ETF approval at 75%.","author":["Brian McGleenon","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285100\/ether-spot-etfs-chance-of-may-approval-dropped-to-20-by-gsr","publishDate":"2024-03-27T12:30:45","id":42,"type":null,"title":"Ether spot ETF&#x27;s chance of May approval dropped to 20% by GSR","category":["Markets"],"content":["Crypto market maker GSR has lowered its estimate of the likelihood of a spot Ether ETF approval in May to 20%.","<span data-v-f87c67ca=\"\">\"We now believe there is a 20% chance the SEC approves a spot <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +3.34%\n    <\/span><\/a> <!----><\/span><\/span> ETF in May,\" GSR analyst Brian Rudick said in a note on Wednesday.<\/span>","This is a drop from <a href=\"https:\/\/www.theblock.co\/post\/275414\/gsr-hires-former-jpmorgan-executive-andreas-koukorinis-as-new-trading-head\" data-v-f87c67ca=\"\">GSR's<\/a> January estimate of a 75% likelihood of a May spot ether ETF approval. GSR Research Analyst Matt Kunke had <a href=\"https:\/\/www.theblock.co\/post\/274312\/crypto-experts-predict-whether-a-spot-ethereum-etf-will-get-approved-in-2024\" data-v-f87c67ca=\"\">attributed<\/a> the former optimistic outlook to Grayscale's Court of Appeals victory and the approval of Ethereum Futures ETFs in October.&nbsp;","Rudick added that similarities between the conditions leading up to the potential approval of a spot ether ETF and those preceding the approval of spot bitcoin ETFs, including the presence of a futures-based ETF and significant correlation between spot and futures markets, had influenced January's optimistic outlook.","However, the GSR analyst has now changed his stance and adopted a much more conservative view on the potential for spot ether ETF approvals. \"There has reportedly been very little engagement from the SEC, which is also receiving at least some political pressure not to approve additional digital asset ETFs. And, the SEC’s alleged investigation into whether ether is a security likely materially diminishes approval odds,\" he added.","Speculating on the SEC's internal workings, he added that the regulatory body could be seeking to avoid turning the potential approval of a spot ether ETF into another giant spectacle.","The GSR analyst now forecasts that any approval process of spot ether ETFs could take much longer. \"Our best guess is that the process will take much longer, likely involving litigation, and we now believe it’s most likely spot Ethereum ETFs are approved in 2025-2026,\" he added.","Additionally, according to Rudick, several issuers have recently amended their ETF applications to include ether staking. \"While there are certainly competitive dynamics as an ETF with staking yield is likely more attractive than one without, it's hard to know why the issuers would materially complicate approval when it's already seemingly tenuous,\" he added.","Rudick speculated that this could be because issuers are seeking to elicit a reaction from an unresponsive SEC or perhaps they are conceding a defeat in May and simply aiming to lay the groundwork for future staking.&nbsp;","\"Either of these reasons, if true, also point to lower approval odds for May,\" he added.","<span data-v-f87c67ca=\"\">Earlier this month, Bloomberg ETF analysts lowered their estimates of a spot ether <\/span>ETF being approved in May to 30%. \"We are [at] 30% odds,\" Bloomberg Senior ETF Analyst Eric Balchunas told The Block.&nbsp;","In January, Balchunas said there was a&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/271874\/ethereum-etf-approval-may-ether-price-surge\" data-v-f87c67ca=\"\">70% chance of approval<\/a>&nbsp;by May, while his colleague James Seyffart had given a&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/274312\/crypto-experts-predict-whether-a-spot-ethereum-etf-will-get-approved-in-2024\" data-v-f87c67ca=\"\">60-65% estimate<\/a>.&nbsp;"],"hashtag":["CRYPTO MOVERS","SEC"]}