{"summary":"Layer 1 blockchain Aleo will launch the Aleo Virtual Machine (AVM) on its testnet next week.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/160545\/aleo-to-test-virtual-machine-ahead-of-mainnet-launch","publishDate":"2022-08-01T10:30:07","id":4204,"type":null,"title":"Aleo to test Virtual Machine ahead of mainnet launch","category":["TECHNOLOGY"],"content":["<span data-v-f87c67ca=\"\">Layer 1 blockchain Aleo will launch the Aleo Virtual Machine (AVM), a computational platform to run privacy-focused apps on its network, as it looks to attract developers to its ecosystem.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While Aleo is still in the testnet phase, next week it will introduce the AVM as part of its upcoming \"testnet 3\" launch scheduled between August and October. <\/span><span data-v-f87c67ca=\"\">According to a note shared with The Block, the team sees the testnet as an opportunity to onboard new Aleo developers ahead of its mainnet launch in the fourth quarter of 2022.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Our focus is to build the absolute best developer framework for decentralized private applications,” Aleo co-founder and CEO Howard Wu said on the testnet 3 plan.<\/span>","<span data-v-f87c67ca=\"\">The testnet is incentivized and will reward developers with token incentives for running applications. Similarly, it will also allocate bounty rewards for bug hunters during the testnet period.<\/span>","<span data-v-f87c67ca=\"\">Aleo leverages zero-knowledge proofs, a cryptographic technology that can verify data while it remains encrypted and hidden from the verifying party. Per the team, Aleo wants to offer applications in areas like payments, decentralized finance, identification management and gaming.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In February 2022, Aleo raised<\/span> <a href=\"https:\/\/www.theblock.co\/post\/133218\/aleo-raises-200-million-softbank-tiger-others-blockchain\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$200 million<\/span><\/a><span data-v-f87c67ca=\"\"> in a Series B funding round co-led by SoftBank's Vision Fund 2 and Kora Management.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"AVM","content":"ORGANIZATION"},{"type":"fourth quarter of 2022","content":"DATE"},{"type":"February 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Aleo Virtual Machine (AVM","content":"ORGANIZATION"},{"type":"SoftBank","content":"ORGANIZATION"},{"type":"Howard Wu","content":"PERSON"},{"type":"$200 million","content":"MONEY"},{"type":"Aleo","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Kora Management","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}