{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley. They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/14130\/defendants-allegedly-lie-about-merger-during-litigation","publishDate":"2019-03-02T10:00:44","id":4206,"type":null,"title":"Defendants allegedly lie about merger during litigation","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]Ball and Toth v. DG Rollins, et al., 3:19-cv-00242 (D. Ore., C19–92-RAJ, 2\/18\/2019) [NMR]<br data-v-f87c67ca=\"\">\n<\/strong><\/em>","Lying is bad. Everyone knows it, and we talk about lying here all the time, but the context surrounding your lies can be very important. For example, you really do not, under any circumstances whatsoever, unless you’ve lost your mind, want to lie during litigation. And yet…","This lawsuit involves some alleged lies in litigation to get a defendant dismissed from a lawsuit. There are a lot of players in this lawsuit, but thankfully it is not super necessary to lay out all of the various actors in this drama. What you should know is that the plaintiffs, Ball and Toth, pre-ordered 43 bitcoin miners in 2014 from a now defunct crypto mining company, Miner Hosting, for $200,000. Those miners were never delivered, because Miner Hosting encountered funding problems. As part of the purchase agreement the plaintiffs were due a full refund, which was, no surprise, never honored.","Consequently, the plaintiffs filed a lawsuit in 2016 to get compensated for the pre-ordered miners that never arrived. That lawsuit was resolved with the plaintiffs “obtain[ing] a judgment against Miner Hosting in the amount of $263,504.62.” Since Miner Hosting was declared bankrupt the plaintiffs were unable to collect that judgment.","During the previous litigation, the plaintiffs dismissed another company, DG Rollins, from the lawsuit. That dismissal was predicated on the defendants, the owners of Miner Hosting (the Carsons) and DG Rollins (the Murthas), denying that they had merged Miner Hosting with DG Rollins. Turns out that denial may have been a lie.","The plaintiffs allege in this current lawsuit that in 2017 a third party provided them with documentation showing that the original owners of Miner Hosting had in fact “entered a formal, but secret, agreement to merge [with DG Rollins].” That is a pretty serious allegation. The plaintiffs “after investigating these documents, realized DG Rollins’ Dismissal had been fraudulently obtained.” The plaintiffs approached DG Rollins with settlement offers to try and collect their judgment, which were ignored, and eventually the plaintiffs filed this second lawsuit.","The present suit lays out five claims for relief seeking a declaratory judgment against the successors in interest of Miner Hosting (i.e. the Carsons, the Murthas, DG Rollins and others) related to alleged fraudulent transfers, civil conspiracy, and misuse of the corporate form. An example of those fraudulent actions is that the Carsons and Murthas allegedly put together a straw buyer, the deliciously named Snickers #1, LLC, to attempt to hide their corporate merger. I mean.","Now, dear reader, you may wonder why would hiding those things during litigation be so bad? Well, you see judges have a lot of power, and they exert a lot of control and influence over the litigation process. Do you think a judge is going to look kindly upon these allegations if proven? I think not.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part II of this week's analysis,&nbsp;Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"2016","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"DG Rollins","content":"ORGANIZATION"},{"type":"LLC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Miner Hosting","content":"ORGANIZATION"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"DG Rollins’ Dismissal","content":"ORGANIZATION"},{"type":"DG Rollins]","content":"ORGANIZATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"$200,000","content":"MONEY"},{"type":"Toth","content":"PERSON"},{"type":"Palley","content":"PERSON"},{"type":"Ore.","content":"LOCATION"},{"type":"RAJ","content":"LOCATION"},{"type":"Toth v. DG Rollins","content":"PERSON"},{"type":"$263,504.62","content":"MONEY"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Miner Hosting (","content":"ORGANIZATION"},{"type":"Rosario","content":"PERSON"}],"hashtag":[],"authors":["Nelson Rosario","The Block"]}