{"summary":"Illuvium community members are rallying to block the project’s CEO from participating in a gaming session with the Three Arrows Capital co-founder.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215647\/illuvium-dao-voting-to-nix-game-with-su-zhu-to-avoid-scam-by-association","publishDate":"2023-02-28T06:55:36","id":4216,"type":null,"title":"Illuvium DAO voting to nix game with Su Zhu to avoid &#x27;scam by association&#x27;","category":["METAVERSE & NFT"],"content":["Illuvium DAO, the community behind the NFT gaming project Illuvium, is voting to block a planned crypto gaming session between its CEO Kieran Warwick and Su Zhu, co-founder of the <a href=\"https:\/\/www.theblock.co\/post\/192540\/judge-signs-off-on-subpoenas-to-3acs-su-zhu-and-kyle-davies\" data-v-f87c67ca=\"\">bankrupt crypto hedge fund<\/a> Three Arrows Capital.","Data from Snapshot show <a href=\"https:\/\/snapshot.org\/#\/ilvgov.eth\/proposal\/0x9d97cdf0caca8fc3adf80f6a464703686b89e86ad1619afff202b7a6d7a6bb87\" data-v-f87c67ca=\"\">unanimous support<\/a> for the proposal, with four wallets so far casting their lots in favor. Voting began on Feb. 26 and will end on March 1.","An Illuvium council member known as Deraji submitted the <a href=\"https:\/\/github.com\/IlluviumGame\/IIPs\/pull\/38\/commits\/e9f46a1b385ecf4b9e79358dc2d9397e86568c77\" data-v-f87c67ca=\"\">proposal<\/a>, arguing against the project having any dealings with Zhu.","“While Zhu Su is a well-known figure in the web3 community and does have a larger follower count than Illuvium, direct association with him risks the reputation that the DAO has worked to curate,” the proposal stated.","Canceling the gaming session would help the project avoid the risk of “scam by association,” Deraji argued. Zhu didn't immediately respond to a request for comment.&nbsp;","Three Arrows Capital, the high-flying crypto investment firm also known as 3AC, <a href=\"https:\/\/www.theblock.co\/post\/155578\/three-arrows-capital-files-for-chapter-15-bankruptcy-in-new-york\" data-v-f87c67ca=\"\">filed<\/a> for Chapter 15 bankruptcy protection in July after its bets turned sour. It owes billions of dollars to creditors. While Zhu and his co-founder Kyle Davies initially went to ground following the collapse, they have recently emerged with <a href=\"https:\/\/www.theblock.co\/post\/202589\/3ac-zhu-davies-new-crypto-exchange\" data-v-f87c67ca=\"\">plans<\/a> for a new marketplace to trade claims on bankrupt crypto firms.&nbsp;&nbsp;","The Illuvium game under debate, dubbed Illuvitars D1sk Battles, functions as an NFT-style one-on-one contest. It involves crypto personalities opening special NFT packs called d1sks which are used to do battle in the game.","The contest between Warwick and Zhu is billed to take place on March 8. Several Illuvium community members faulted the advertised gaming session even before the creation of the DAO poll, citing similar reasoning to Deraji.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kieran Warwick","content":"PERSON"},{"type":"billions of dollars","content":"MONEY"},{"type":"Kyle Davies","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Feb. 26","content":"DATE"},{"type":"Su Zhu","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"March 1","content":"DATE"},{"type":"Deraji","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Warwick","content":"PERSON"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Zhu Su","content":"PERSON"},{"type":"March 8","content":"DATE"}],"hashtag":["BANKRUPTCY FILINGS","DAOS","GAMING DAOS","GOVERNANCE VOTES"],"authors":["Osato Avan-Nomayo","The Block"]}