{"summary":"Seed CX, the institutional crypto exchange, has shifted its focus to settlement. Settlement is a post-trade process by which an asset (in this case cryptocurrency) transfers to the buyer&#x27;s account and cash transfers to the seller&#x27;s account.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/54672\/seed-cx-is-adding-dai-and-tether-support-as-it-looks-to-double-down-on-settlement","publishDate":"2020-02-05T09:00:27","id":4217,"type":null,"title":"Seed CX is adding DAI and Tether Support","category":["INFRASTRUCTURE"],"content":["2018 appeared to be the year of institutional exchanges.&nbsp;","Bakkt – which soon became a darling of the crypto market – announced it would launch a bitcoin future. Elsewhere, Chicago-based ErisX and Seed CX announced respective funding rounds aimed at building out their own cryptocurrency spot and derivatives markets.&nbsp;","But two years later, all three firms have struggled to take on their crypto-currency native rivals when it comes to volumes.","Seed CX, for instance, trades between $4 million to $8 million in crypto on a given trading day – a fraction of &nbsp;$243 million that trades on Coinbase Pro over a 24-hour period.&nbsp;","Indeed, ErisX's new bitcoin futures product, which launched in December, is essentially inactive, trading only one lot on its first day. Bakkt's new options and cash-settled futures have also seen light trading.","Still, Seed CX chief executive Edward Woodford is bullish for 2020, noting that the firm's focus is on building a business around its settlement infrastructure, which it licenses to third-party firms. Settlement is a post-trade process by which an asset (in this case cryptocurrency) transfers to the buyer's account and cash transfers to the seller's account.&nbsp;","The heightened focus on settlement compared to the exchange should come as no surprise to market observers. Exchange volumes hit a nine-month low in December, according to <a href=\"https:\/\/www.theblockresearch.com\/a-look-back-at-2019-by-the-numbers-52834\" data-v-f87c67ca=\"\">data compiled by The Block<\/a>. At the same time, the market for crypto exchanges has never been more crowded.&nbsp;","","","<span data-v-f87c67ca=\"\">Source: The Block, CryptoCompare, CoinGecko<\/span>","Indeed, the crowded market played a role in Seed CX's push into offering up its technology as a service.&nbsp;","\"We realized that Zero Hash was one of a kind in that it could settle all sorts of flow,\" Adam Leaman, the firm's chief client officer, noted in a message to The Block. \"Nobody else has built this while at the same time having 40 state MTL licenses and federal regulation approval.\"","By plugging into Seed CX's platform, clients don't need to go through the technical trouble of building out their own settlement infrastructure and ascertaining the necessary regulatory licenses, according to the firm. So far, 15 clients — spanning payments and brokerage — have signed up leverage Seed's backend technology. In total, 200 clients are connected to trade across those platforms.","Many of those clients, Woodford says, see a big business opportunity in crypto but don't have the engineering wherewithal to build it themselves.&nbsp;","\"They say a big portion of their business, one to ten percent, could come from crypto,\" Woodford said. \"We help them monetize these clients.\"","At this point, flows through the exchange have been a minority relative to the flows going through its infrastructure.&nbsp;","\"We have closed recently some of the best known OTC, largest Japanese conglomerates, and famous payment [firms],\" Woodford said.&nbsp;","Interestingly, Seed CX sees an opportunity in servicing other exchanges. It counts, for instance, AIX as a client. AIX utilizes Seed CX's \"technology, custody, and regulatory&nbsp;achievements to settle the trades that are match on their platform,\" Leaman said.&nbsp;","In a sense, Seed CX is taking a page out of Nasdaq's book.&nbsp;In addition to operating one of the largest equities exchanges in the world, the $19 billion firm offers its trading and matching technologies to <a href=\"https:\/\/www.nasdaq.com\/solutions\/trading-and-matching-technology\" data-v-f87c67ca=\"\">70 marketplaces around the world<\/a>. Indeed, its market technology businesses made up 15% of its total net revenues in the fourth quarter of 2019.&nbsp;","The model makes sense to one insider, who declined to speak on the record.&nbsp;","\"Generally speaking, I think overall this is a great position,\" the person said.&nbsp;\"A lot of people are realizing that it takes a lot of effort to build and productize in crypto so this is attractive for a firm that wants to add bitcoin buy and selling but don't want to fully dive in.\"","To gain further market share among traders, Seed CX has expanded its platform to support Dai and USDT. In total, the company now supports 20 fiat currencies as well as five stablecoins.&nbsp;","The diversity of assets on the platform gives traders more optionality, according to Woodford.&nbsp;","\"If you want to convert JPY to Pax, then you can do that,\" he said.&nbsp;\"If you want to convert Mexican peso into USDT, then you can do that too.\"","For traders who actively trade certain assets between each other, Seed CX's platform supports netting – a commonplace risk-managing process by which multiple financial transactions are aggregated and settled at the end of a given trading session.","\"If I am a big Pax trader and you are a big Mexican peso trader and we are trading all day we can net those trades and streamline them throughout the day,\" Woodford explained.&nbsp;","That approach also gives traders more options for when they might need to post collateral for a given trade.&nbsp;","\"If we are trading Pax against bitcoin I could collateralize with Mexican peso,\" Woodford said.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"AIX","content":"LOCATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"Zero Hash","content":"PERSON"},{"type":"Woodford","content":"PERSON"},{"type":"ten percent","content":"PERCENT"},{"type":"Woodford","content":"LOCATION"},{"type":"$4 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"the fourth quarter of 2019","content":"DATE"},{"type":"$8 million","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"$243 million","content":"MONEY"},{"type":"Adam Leaman","content":"PERSON"},{"type":"two years later","content":"DATE"},{"type":"Leaman","content":"PERSON"},{"type":"15%","content":"PERCENT"},{"type":"Chicago","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"Edward Woodford","content":"PERSON"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"$19 billion","content":"MONEY"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}