{"summary":"Verify tracks cryptographically signed media and negotiates content licensing deals with artificial intelligence firms.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/271288\/fox-corporation-polygon-labs-verify","publishDate":"2024-01-09T11:31:19","id":4218,"type":null,"title":"Fox Corporation collaborates with Polygon Labs to launch blockchain-based media platform Verify: Axios","category":["COMPANIES"],"content":["Fox Corporation, a media corporation managing brands such as Fox News, Fox Sports and Tubi Media Group, has <a href=\"https:\/\/polygon.technology\/blog\/fox-corporation-taps-polygon-pos-to-power-verify-an-open-protocol-for-content-and-image-verification\" data-v-f87c67ca=\"\">launched<\/a> a blockchain-based platform called Verify.","Verify will negotiate content licensing deals with AI firms as to how Fox Corporation’s intellectual property is used. Verify will also track this content by cryptographically signing the media in a database.","<a href=\"https:\/\/www.theblock.co\/linked\/105171\/fox-nft-company-blockchain-based-animated-series\" data-v-f87c67ca=\"\">Fox<\/a> Corporation collaborated with the software development firm <a href=\"https:\/\/www.theblock.co\/post\/247873\/polygon-labs-chain-development-kit\" data-v-f87c67ca=\"\">Polygon Labs<\/a> to launch Verify. \"With the rise of AI tools and AI-generated media, distinguishing truth from lies is difficult. Proving provenance and authenticity of any given piece of content is now more important than ever. That’s where Verify, by Fox Corporation (built on Polygon PoS), comes in,\" Polygon Labs <a href=\"https:\/\/twitter.com\/0xPolygonLabs\/status\/1744735793661567246\" data-v-f87c67ca=\"\">wrote<\/a> on the social media platform X.","With the public beta launch of Verify on Jan. 8, \"any media company can register content, from articles to audio to images and grant usage rights to AI platforms. Using the Verify tool, individual pieces of content are cryptographically signed on Polygon PoS, allowing consumers to identify content from trusted sources,\" Polygon Labs continued, adding that Verify has since amassed 89,000 pieces of content across the corporation's brands.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Fox Sports","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Fox News","content":"ORGANIZATION"},{"type":"Polygon Labs","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Verify","content":"ORGANIZATION"},{"type":"Fox Corporation","content":"ORGANIZATION"},{"type":"Tubi Media Group","content":"ORGANIZATION"},{"type":"Fox<\/a> Corporation","content":"ORGANIZATION"},{"type":"Jan. 8","content":"DATE"}],"hashtag":["INTERNET"],"authors":["MK Manoylov","The Block"]}