{"summary":"Lightspeed Venture Partners led a $6.4 million seed funding round into web3 observability platform Sentio. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/213429\/lightspeed-observability","publishDate":"2023-02-21T09:30:07","id":4223,"type":null,"title":"Lightspeed leads $6.4 million seed round into web3 observability platform","category":["VENTURE CAPITAL"],"content":["Venture capital firm Lightspeed Venture Partners led a $6.4 million seed funding round into web3 observability platform Sentio.&nbsp;","The equity deal, which closed in September of last year, according to founder Fuyao Zhao in an interview with The Block, also saw participation from Hashkey Capital, Canonical Crypto, Essence VC and GSR Ventures. The startup clinched a $32 million post-money valuation through the funding round, said Zhao.&nbsp;","Zhao used to be a software engineer at Google. He founded an enterprise code search engine named Insight with ex-LinkedIn engineer Chongzhe Li, now his fellow founder at Sentio. The startup's other co-founder Kan Qiao was an engineering exec at TikTok who spearheaded the social media giant's initiative for blockchain, said Zhao.&nbsp;","Observability measures a system's current state based on the data it generates. In crypto, where applications are built on top of smart contracts, there currently doesn't exist a uniform process to do this, meaning that many either develop an in-house solution taped together from fragmented third-party tools or operate without such monitoring.&nbsp;","Through Sentio's software development kit, users can collect metrics and event logs based on smart contracts' events, transactions, traces and states across blockchains, including Ethereum, Aptos, Polygon and Avalanche. Sentio handles the indexing process for this information, but users can then build dashboards that visualize such data. This allows them to monitor for possible breaches or issues and receive alerts for certain activities on the blockchain.&nbsp;","\"Say if the total amount of money transferred by [a user] is great than $100 or...&nbsp; if the rate of transfers from a person is higher than $100 per day, you can trigger an alert,\" explained Zhao.&nbsp;","While small teams are offered a free tier, customers are charged monthly, depending on what features they opt into. This could range anywhere from $50 to $2000 per month.&nbsp;","The seed-stage company already has customers, including Goldfinch, PancakeSwap and Wormhole, among other decentralized organizations. Still, Zhao admitted that selling to these companies differs from web2.&nbsp; Many web3 organizations are much smaller than their web2 counterparts, meaning they're less siloed off, with staff fulfilling various roles.&nbsp;","\"In web2, the people who look at operations or business analytics might be two different groups,\" said Zhao. \"But in web3, it might be the same person.\"&nbsp;","The firm will use the funding to run its built infrastructure and expand its team.&nbsp;","Infrastructure firms such as Sentio <a href=\"https:\/\/www.theblock.pro\/research\/january-blockchain-funding-recap-209442\" data-v-f87c67ca=\"\">made up<\/a> 22% of blockchain seed and pre-series A deals in January, according to data from The Block Research. Only the NFTs\/Gaming subsector bested infrastructure, coming in at 25%.&nbsp;","\"In past cycles, the infrastructure category has attracted interest and investment, as active investors who remained looked to discover foundational companies and projects,\" said John Dantoni, research director at The Block Research, in the January report. \"Over the past 6 months, infrastructure projects have accounted for roughly 20% of all seed deals.\"&nbsp;","","","<em data-v-f87c67ca=\"\">This story has been updated with additional details on the founding team provided by Sentio.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"September of last year","content":"DATE"},{"type":"$50","content":"MONEY"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Chongzhe Li","content":"PERSON"},{"type":"Google","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Fuyao Zhao","content":"PERSON"},{"type":"Hashkey Capital","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"John Dantoni","content":"PERSON"},{"type":"22%","content":"PERCENT"},{"type":"Zhao","content":"PERSON"},{"type":"TikTok","content":"ORGANIZATION"},{"type":"Aptos","content":"LOCATION"},{"type":"Kan Qiao","content":"PERSON"},{"type":"25%","content":"PERCENT"},{"type":"Lightspeed Venture Partners","content":"ORGANIZATION"},{"type":"$6.4 million","content":"MONEY"},{"type":"GSR Ventures","content":"ORGANIZATION"},{"type":"$2000","content":"MONEY"},{"type":"$32 million","content":"MONEY"},{"type":"$100","content":"MONEY"}],"hashtag":["DATA PROVIDERS","SEED &AMP; PRE-SEED"],"authors":["Tom Matsuda","The Block"]}