{"summary":"After Orthogonal did its diligence in risk management, it claimed today that it spotted certain &quot;weaknesses&quot; in Alameda&#x27;s business.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/184808\/maple-finance-halted-alameda-loans-in-may-after-seeing-key-weaknesses","publishDate":"2022-11-09T10:42:32","id":4229,"type":null,"title":"Maple Finance halted Alameda loans in May after seeing &#x27;key weaknesses&#x27;","category":["FINANCE FIRMS"],"content":["<span data-v-f87c67ca=\"\">Orthogonal Credit, a delegate firm that manages lending pools on Maple Finance, said that earlier this year, it made a decision to not lend to Alameda Research, FTX exchange's sister trading firm that's now reeling under a&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/184354\/ftx-implosion-has-u-s-regulators-on-watch\" data-v-f87c67ca=\"\">liquidity crisis<\/a>.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">After Orthogonal did its diligence in risk management, it spotted certain \"weaknesses\" in Alameda ahead of its ongoing crisis, it claimed today without going into specific details. <\/span>","<span data-v-f87c67ca=\"\">Orthogonal had previously <a href=\"https:\/\/app.maple.finance\/#\/earn\/pool\/0x3e701d29fcb8747b5c3f88649397d88fff9bd3e9\" data-v-f87c67ca=\"\">issued<\/a> $288 million in loans with a specific pool dedicated to Alameda which started in November 2021 and closed in May 2022. In another pool called USDC01, Orthogonal hasn't underwritten a loan to Alameda since February 2022.<\/span>","<span data-v-f87c67ca=\"\">These so-called weaknesses relate to Alameda's business practices, the quality of assets it held on its balance sheet as well as the corporate structure of the firm, Orthogonal said. These factors pushed Orthogonal to end its lending ties with Alameda.<\/span>","<span data-v-f87c67ca=\"\">Maple is an uncollateralized lending protocol that provides loans to parties without upfront collateral. The loans are managed with pool delegates who check borrowers’ credit worthiness via off-chain metrics to make sure that they are in a good position to repay funds.<\/span>","<span data-v-f87c67ca=\"\">“During our Alameda due diligence earlier this year, the team identified a number of key weaknesses: a) declining asset quality, b) unclear capital policy, c) less than robust operational and business practices, and d) an increasingly byzantine corporate structure,” Orthogonal <a href=\"https:\/\/twitter.com\/OrthoCredit\/status\/1590328422542495744\" data-v-f87c67ca=\"\">said<\/a> in a tweet post.<\/span>","<span data-v-f87c67ca=\"\">Another Maple Finance delegate Maven 11 also<\/span> <a href=\"https:\/\/twitter.com\/M11Credit\/status\/1590130069078388736\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">came out<\/span><\/a><span data-v-f87c67ca=\"\"> saying that it also does not have existing loans to Alameda Research. As the the largest pool delegate, Maven 11 took the initial action to not approve further loans after which other delegates took the same decision. Both Orthogonal and Maven 11 said while they don’t have pending loans with Alameda, they have limited exposure to FTX via counterparties.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"Orthogonal","content":"ORGANIZATION"},{"type":"May 2022","content":"DATE"},{"type":"February 2022","content":"DATE"},{"type":"Maple Finance","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Maven 11","content":"ORGANIZATION"},{"type":"$288 million","content":"MONEY"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"November 2021","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["INVESTMENT FIRMS","LENDING"],"authors":["Vishal Chawla","The Block"]}