{"summary":"The crypto exchange said it will list any hard forks of Ethereum — so long as they meet five requirements.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/161913\/huobi-to-list-post-merge-ethereum-forks-that-meet-security-requirements","publishDate":"2022-08-06T09:40:56","id":4231,"type":null,"title":"Huobi plans to list post-merge Ethereum forks that meet its security requirements","category":["LAYER 1S"],"content":["Crypto exchange Huobi said it will list any hard forks of Ethereum following the network’s planned switch to proof-of-stake (PoS) consensus —&nbsp;so long as they meet five requirements.","“As long as the forked assets meet our security requirements, we will take the first move to support users to hold the assets and earn rewards,” Huobi wrote in a <a href=\"https:\/\/www.huobi.com\/support\/en-us\/detail\/94914028834041\" data-v-f87c67ca=\"\">blog post<\/a> on Friday. “Trading services for those coins under the spotlight will be available as soon as possible per our rules after we get an overall picture of users' opinions.”","Ethereum is inching closer to a switch to PoS from energy-intensive proof-of-work (PoW) consensus, a long-awaited shift known as \"the merge\" that might come as soon as September. The change could, however, meet resistance from Ethereum miners who have spent billions on equipment that will no longer be needed to run the network.","While miners can’t stop the merge, they can clone Ethereum and create their own version of the network where the transition never takes place.","The possibility of a miner-led fork of Ethereum has gained impetus after Chandler Guo, an influential Chinese crypto miner and investor, last month&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/160462\/as-the-ethereum-merge-approaches-a-key-miner-is-pushing-a-proof-of-work-fork\" data-v-f87c67ca=\"\">declared<\/a>&nbsp;he would fork the network to create a PoW-based chain he called “ETH POW.”","Now Huobi, a crypto exchange founded in China in 2013 but currently based in the Seychelles, says it will list forked tokens if they meet five criteria.","Getting listed on an exchange allows speculators to buy and sell a crypto token and creates more legitimacy in the eyes of some investors.","A prior hard fork of Ethereum created what’s now known as Ethereum Classic, a token that’s still among the <a href=\"https:\/\/coinmarketcap.com\/\" data-v-f87c67ca=\"\">top 20<\/a> largest crypto assets by value.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"September","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Chandler Guo","content":"PERSON"},{"type":"2013","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Huobi","content":"PERSON"},{"type":"China","content":"LOCATION"},{"type":"Seychelles","content":"LOCATION"},{"type":"Ethereum Classic","content":"ORGANIZATION"}],"hashtag":["ETHEREUM","HTX"],"authors":["Andrew Rummer","The Block"]}