{"summary":"Crypto lending firm BlockFi says all of its products are &quot;fully functional&quot; following Binance&#x27;s announcement that it plans to acquire crypto firm FTX. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/184312\/crypto-lender-blockfi-says-products-are-fully-functional-in-wake-of-binance-ftx-deal","publishDate":"2022-11-08T12:49:07","id":4233,"type":null,"title":"Crypto lender BlockFi says products are &#x27;fully functional&#x27; in wake of Binance, FTX deal","category":["THE BLOCK"],"content":["Crypto lending firm BlockFi says all of its products are \"fully functional\" following Binance's announcement that it plans to acquire crypto firm FTX.&nbsp;","FTX, which had been navigating a precipitous drop of its native token FTT, announced its intension to acquire BlockFi following a credit crunch earlier this year that resulted in the bankruptcy of several lending firms in the crypto market. In the wake of the meltdown of Three Arrows Capital, BlockFi agreed to a potential acquisition deal with FTX, which extended a $400 million line of credit to the firm.&nbsp;","BlockFi founder Flori Marquez said on Twitter that the company currently is an independent business entity from FTX and \"will remain independent entity until at least 2023.\"","\"We are processing all client withdrawals in line with our Terms of Service. To date, BlockFi has aimed to deliver all client withdrawals faster than our Terms of Service,\" she said. \"We run a pragmatic and diversified lending business and hold risk capital reserves to help protect against potential loan defaults.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Terms of Service","content":"ORGANIZATION"},{"type":"Flori Marquez","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$400 million","content":"MONEY"},{"type":"Binance","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}