{"summary":"Web3 software technology firm Aave Companies launched Lens protocol V2 on Polygon during the Devconnect event in Istanbul.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262819\/aave-companies-launches-lens-v2-on-polygon","publishDate":"2023-11-13T08:43:33","id":4235,"type":null,"title":"Aave Companies launches decentralized social graph Lens V2 on Polygon","category":["SOCIAL PLATFORMS"],"content":["Web3 software technology firm Aave Companies launched the second version of social protocol Lens on mainnet during the Devconnect event in Istanbul today.","The update features enhanced composability and other upgrades to enable developers to build new social experiences and monetize faster, according to a statement. All applications and Lens V1 profiles have been migrated to V2, including 11 million social connections and over 34 million social interactions, the team said.","“Lens V2 is the next chapter in the evolution of Lens,” Lens Protocol founder and CEO Stani Kulechov said. “The goal of V1 was to bootstrap early web3 social networks, resulting in creativity, experimentation and new discovery tools that benefited the Lens ecosystem. With V2, we are moving progressively towards a more modular Lens design, providing social primitives giving builders greater autonomy and flexibility to integrate web3 social, propelling the next wave of innovation.”","Launched on Polygon in May 2022, Lens Protocol is a decentralized social graph used to construct social media platforms. It facilitates the storage of social media activity via NFTs and on-chain data. Plans for Lens V2 were initially <a href=\"https:\/\/www.theblock.co\/post\/239858\/lens-protocol-version-2-open-actions-erc-6551\" data-v-f87c67ca=\"\">unveiled<\/a> in July.","Still in beta, the launch of Lens V2 on the Polygon mainnet introduces a suite of web3-native independent social primitives, offering builders new tools to incorporate web3-powered features into any existing app.","One of the key features of V2 is its enhanced composability, enabling developers to create social experiences and monetization methods more efficiently. Users can now transfer handles independently of profiles and delegate social actions to different wallets. Profiles can be managed by one or more persons, multisigs or DAOs, enhancing security by allowing users to store their handle on a cold wallet while using their day-to-day wallet to use Lens.","Developers can also create \"Smart Posts\" supporting actions including renting publication space for ads, pay-to-read options, tipping, voting, verifying, subscribing and donating.","Web2 to web3 bridging enables solutions like those from Chainlink Functions to integrate web2 data and events into Lens and cross-chain functionality features like minting a music NFT on Ethereum, bridging to Solana via Uniswap, or using Aave Liquidity Pools are now also possible, the team added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"May 2022","content":"DATE"},{"type":"Istanbul","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Aave Companies","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Aave Liquidity Pools","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Stani Kulechov","content":"PERSON"}],"hashtag":["LENS"],"authors":["James Hunt","The Block"]}