{"summary":"Riot Platforms said its facilities do not emit greenhouse gas emissions after the Times reported the bitcoin mining industry is responsible for emitting carbon dioxide.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/226033\/riot-platforms-bitcoin-miner-new-york-times-greenhouse-gas-co2","publishDate":"2023-04-12T16:59:19","id":4236,"type":null,"title":"Riot Platforms responds to NYT with cheeky video on CO2 emissions","category":["COMPANIES"],"content":["Bitcoin miner Riot Platforms <a href=\"https:\/\/twitter.com\/RiotPlatforms\/status\/1645473961004892162\" data-v-f87c67ca=\"\">posted a tongue-in-cheek video<\/a> and a written statement defending itself after The New York Times published a story about the \"enormous carbon pollution\" and high electricity costs created by the mining industry.","\"We were especially disappointed to read a false and distorted view of our company and our industry in the article published by The NYT. Worse still, The NYT chose to publish the article with information its authors knew to be false and misleading, ignoring the factual information that we provided to them,\" the company said in the <a href=\"http:\/\/riotplatforms.com\/news-media\/press-releases\/detail\/150\/riot-platforms-inc-statement-the-new-york-times\" data-v-f87c67ca=\"\">statement<\/a>. \"Our Bitcoin mining operations do not generate any greenhouse gas emissions, similar to any other data center for Facebook, Amazon or Google.\"","<a href=\"https:\/\/www.nytimes.com\/2023\/04\/09\/business\/bitcoin-mining-electricity-pollution.html?searchResultPosition=1\" data-v-f87c67ca=\"\">The Times<\/a> estimated that 96% of the power used by Riot comes from fossil fuels and found that in Texas, increased demand from mining resulted in electric bills nearly 5% higher, another $1.8 billion a year. The additional use of power causes as much carbon pollution as adding 3.5 million gas-powered cars to America’s roads. The Times reported that Riot's mine in Rockdale, Texas, \"uses about the same amount of electricity as the nearest 300,000 homes, making it the most power-intensive Bitcoin mining operation in America.\"","Riot Platforms, the largest bitcoin miner by market cap, said its data center uses electricity from the Texas grid, which it claimed is the cleanest and most renewable energy-sourced grid in the United States.","In a tongue-in-cheek response video posted on Twitter, a Riot official dressed in a safety gear walks around a semi-grassy area, measuring the low level of CO2 and noting the plants around him consuming. \"Rockdale has some of the freshest air I've ever breathed,\" the person, who appears to be Riot's head of research Pierre Rochard, says. He then goes inside the mining facility and measures an even lower level of CO2 within the largest bitcoin mining facility in the U.S.","\"The science is conclusive,\" the bearded man representing Riot said in the video. \"The data shows Bitcoin mining does not emit any CO2.\"","Twitter users, naturally, piled on, roasting the bitcoin miner&nbsp;for its comically literal interpretation of mining and greenhouse gases. \"Somebody please explain to them where carbon emissions come from,\" said one.","&nbsp;","","","\"Is this a parody?\" said another.","","","&nbsp;","The head of public policy at Riot later noted that the video is a \"tongue-in-cheek\" take on the \"flawed &amp; unscientific reporting of the @nytimes.\"","\"As anyone can see, accurate information was blatantly ignored because it did not fit the narrative the NYT was trying to spin,\" the company said in a statement to The Block.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","A Cambridge University research project has estimated that <a href=\"https:\/\/www.newscientist.com\/article\/2339629-bitcoin-has-emitted-200-million-tonnes-of-co2-since-its-launch\/\" data-v-f87c67ca=\"\">Bitcoin miners' electricity usage has produced 200 million tonnes of CO2<\/a> since bitcoin was invented.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"Amazon","content":"LOCATION"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Pierre Rochard","content":"PERSON"},{"type":"America","content":"LOCATION"},{"type":"96%","content":"PERCENT"},{"type":"Texas","content":"LOCATION"},{"type":"NYT","content":"ORGANIZATION"},{"type":"The NYT","content":"ORGANIZATION"},{"type":"$1.8 billion","content":"MONEY"},{"type":"Rockdale","content":"LOCATION"},{"type":"Riot Platforms","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Cambridge University","content":"ORGANIZATION"}],"hashtag":[],"authors":["Christiana Loureiro","Adam Morgan McCarthy","The Block"]}