{"summary":"Harbor, the firm that aims to be the “one-stop shop” for security token issuers, has inched closer to that goal after obtaining a transfer agent license","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/45288\/harbor-acquires-transfer-agent-license-from-sec-to-help-security-token-issuers-pay-out-dividends","publishDate":"2019-10-31T16:16:56","id":4238,"type":null,"title":"Harbor receives transfer agent license from SEC to help security token issuers pay out dividends","category":["SECURITY TOKEN"],"content":["<span data-v-f87c67ca=\"\">Harbor, the firm that aims to be the “one-stop shop” for security token issuers, has inched closer to that goal after obtaining a transfer agent license from the Securities and Exchange Commission (SEC).&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Notified by the SEC on Thursday, the security token platform is now the first blockchain company to receive both a transfer agent license and a broker-dealer license, Harbor CEO Joshua Stein told The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A transfer agent helps companies keep records of their stock ownership and pay out dividends to investors. Importantly, The SEC requires companies to engage with transfer agents for Reg A+ offering, a less burdensome route to raise public funds that hold appeal to many blockchain companies, according to Stein. With the license and its blockchain native platform, Harbor is hoping to target a growing group of blockchain companies looking to conduct Reg A+, said Stein.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">However, both Blockstack and YouNow, the only two blockchain companies that have won SEC approval to conduct a Reg A+, don't think it's necessary to have a transfer agent. The two companies <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1719379\/000110465919020748\/a18-15736_1partiiandiii.htm\" data-v-f87c67ca=\"\">state<\/a> in their offering circulars that their tokens are not “not currently securities” and some activities that a regular transfer agent would perform is done automatically on the blockchain. As such, since the license is meant to regulate persons that act as transfer agents for securities, Blockstack and YouNow are exempt from the requirement, according to the circulars.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For Harbor, however, being a transfer agent also complements the broker-dealer license it received in September. According to Stein, the two licenses enable it to facilitate the full life cycle of security token issuance as well as regulated trading, thus <\/span><span data-v-f87c67ca=\"\">strengthening its appeal to companies seeking to do security token offerings.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Think of the entire life cycle of this, there is… selling the investors into the investment, maintaining the investment while they are in, and controlling how they are traded. The broker-dealer is mostly involved in gaining the investors into the investment. The transfer agent maintains the records while they are in and pays out dividends, and the transfer agent controls when they pay out,” said Stein.&nbsp;&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Blockstack","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Stein","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Joshua Stein","content":"PERSON"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"YouNow","content":"PERSON"}],"hashtag":["TOKENIZATION"],"authors":["Celia Wan","The Block"]}