{"summary":"With over $1 billion in exploits so far in 2022, bridges between blockchains are proving to be a thorn in the side of decentralized finance.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/142856\/tarun-chitra-explains-cryptos-billion-dollar-problem-cross-chain-bridging","publishDate":"2022-04-25T11:00:03","id":4244,"type":null,"title":"Tarun Chitra explains crypto&#x27;s billion-dollar problem: cross-chain bridging","category":["PODCASTS"],"content":["<span data-v-f87c67ca=\"\">With over $1 billion in exploits so far in 2022, bridges between blockchains are proving to be a thorn in the side of the $200 billion market for decentralized finance.<\/span>","<span data-v-f87c67ca=\"\">Despite the headlines, Tarun Chitra — founder and CEO of Gauntlet, a <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/137710\/crypto-startup-gauntlet-raises-23-8-million-at-1-billion-valuation\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">unicorn<\/span><\/a><span data-v-f87c67ca=\"\"> risk-modeling platform — <a href=\"https:\/\/www.theblockcrypto.com\/post\/142552\/gauntlets-tarun-chitra-explains-the-keys-to-building-a-successful-defi-project\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">outlined the tradeoffs<\/a> that exist between various bridging solutions. <\/span>","<span data-v-f87c67ca=\"\">In Chitra’s view, each currently has its own positives and drawbacks. Moving forward, crypto market participants will have to engage with bridges based on their own risk tolerance:<\/span>","<span data-v-f87c67ca=\"\">“I think we'll end up in a world where the end-user will have a lot of choices and it will end up being like choosing your risk tolerance, matching the bridge to your risk tolerance.”<\/span>","<span data-v-f87c67ca=\"\">Unlike traditional finance, in which banks must use designated payment channels such as SWIFT for international transfers, there is no industry-standard method of <\/span><a href=\"https:\/\/www.theblockcrypto.com\/news+\/127771\/what-the-heck-is-a-cross-chain-swap\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">cross-chain<\/span><\/a><span data-v-f87c67ca=\"\"> asset transfer between blockchains.<\/span>","<span data-v-f87c67ca=\"\">While each of the current bridging solutions between blockchains has its own shortcomings, Chitra believes these shortcomings will ultimately be acceptable to different categories of users depending on their needs.<\/span>","<span data-v-f87c67ca=\"\">“I suspect the market will develop in a way where there's a segment of the market that's willing to tolerate way more risk, but they're also going to do very small transactions, and there's a segment of the market that's like we're OTC brokers, and we only trade sizes of a million dollars or more, and we only use the slower bridges,\" Chitra said. \"We're going to have this kind of ‘quality of service’ stratification, of the people choosing what their risk tradeoff is.”<\/span>","<span data-v-f87c67ca=\"\">Synthetic assets are one method of bridging that offers users fast transaction times, but as Chitra points out, one of the problems with this solution is “what happens if the synthetic price is not equal to the real price?”<\/span>","<span data-v-f87c67ca=\"\">This happened earlier this year when the Wormhole bridge <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/132909\/wormhole-replenishes-its-blockchain-bridge-after-325-million-exploit\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">was exploited<\/span><\/a><span data-v-f87c67ca=\"\"> by an attacker who minted 120,000 synthetic ETH on the Solana blockchain out of thin air and then bridged the freshly minted synthetic assets back to the Ethereum blockchain for native ETH.<\/span>","<span data-v-f87c67ca=\"\">In addition to synthetic assets, Chitra describes two other methods of bridging between blockchains: bridges run by select validators — such as the bridge to Axie Infinity's Ronin sidechain which <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/139761\/axie-infinitys-ethereum-sidechain-ronin-hit-by-600-million-exploit\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">was hacked<\/span><\/a><span data-v-f87c67ca=\"\"> for $600 million earlier this year — and ‘atomic swaps,’ which allow for the direct transfer of native assets between blockchains but are often capital inefficient and typically sacrifice speed.<\/span>","<span data-v-f87c67ca=\"\">Despite these exploits, Chitra thinks these three existing bridge technologies have a place in the future:<\/span>","<span data-v-f87c67ca=\"\">“My suspicion is that all three will survive but for different reasons. They'll all give you a slightly different quality risk\/reward tradeoff. The higher risk ones will be the ones that give you low latency and very good UX, and then the lowest risk ones will be the ones you have to wait a while and take forever, but actually you have very high guarantees.”<\/span>","To be sure, not everyone is as optimistic about current forms of bridges sticking around as Chitra.","Bryan Pellegrino co-founder and CEO of LayerZero Labs—a bridging project backed by the likes of FTX and Sequoia—believes he has come up with an innovative way to enable cross-chain value transfer that could render existing bridging methods obsolete.","<span data-v-f87c67ca=\"\">\"We designed a modular system where you have this sort of configurable layer of security\/trustlessness because we’re not at all convinced that ANY methodology that exists today will be the de-facto, or even used at all 5-10 years from now,\"&nbsp;Pellegrino recently explained to The Block.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tarun Chitra —","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"million dollars","content":"MONEY"},{"type":"$600 million","content":"MONEY"},{"type":"$200 billion","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Chitra","content":"PERSON"},{"type":"Gauntlet","content":"LOCATION"},{"type":"Pellegrino","content":"PERSON"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"Chitra","content":"LOCATION"},{"type":"Bryan Pellegrino","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"10 years","content":"DATE"}],"hashtag":["HACKS"],"authors":["Davis Quinton","The Block"]}