{"summary":"The Australian crypto exchange’s planned merger with superannuation fund Superhero has collapsed due to regulatory hostility.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/196939\/swyftx-crypto-exchange-exits-1-billion-merger-amid-regulatory-scrutiny-afr","publishDate":"2022-12-21T07:06:32","id":4245,"type":null,"title":"Swyftx crypto exchange exits $1 billion merger amid regulatory scrutiny: AFR","category":["DEALS"],"content":["Swyftx, a crypto exchange based in Australia, has been forced to pull out of a planned 1.5 billion Australian dollar ($1 billion) merger deal with superannuation fund platform Superhero, the Australian Financial Review reported on Tuesday.","Both parties first <a href=\"https:\/\/swyftx.com\/news\/swyftx-merges-with-superhero\/\" data-v-f87c67ca=\"\">announced<\/a> the merger in June. The deal was to create a wealth management behemoth that would administer $1 billion in crypto, superannuation and direct equities investments, for up to one million customers in Australia.","Now, the deal is <a href=\"https:\/\/www.afr.com\/technology\/superhero-and-swyftx-walk-away-from-1-5b-merger-20221220-p5c7nv\" data-v-f87c67ca=\"\">off<\/a> and the regulatory climate for crypto in Australia is reportedly to blame. AFR quoted Superhero co-founder John Winters as saying that investor sentiment for crypto products had declined in the country. Winters also linked the failure of the merger to the fallout of the recent FTX collapse. The Superhero co-founder added that the firm was turning its attention to “long-term traditional investments” that had “more transparency.”","AFR also quoted sources close to Superhero who offered more context for the collapse of the merger. These sources say Superhero was concerned about Swyftx’s exposure to the Binance crypto exchange. Binance continues to come under scrutiny from regulators, especially in the U.S. where the platform is being investigated for alleged money laundering.","The Block contacted Swyftx, Superhero and Binance for comment but did not hear back before publication time.&nbsp;","The demerger news is the latest business failure for Swyftx. The Australian crypto exchange <a href=\"https:\/\/www.theblock.co\/post\/192060\/australia-crypto-exchange-swyftx-layoffs\" data-v-f87c67ca=\"\">laid off 90 employees<\/a> from its workforce earlier in the month. This was the second round of employee redundancies after the crypto exchange laid off 74 employees in the summer.","The collapse of the deal is also the latest crypto-related merger to <a href=\"https:\/\/www.theblock.co\/post\/155271\/etoro-abandons-spac-deal-the-information\" data-v-f87c67ca=\"\">fall through<\/a> this year. The likes of <a href=\"https:\/\/www.theblock.co\/post\/192090\/circle-ends-deal-to-merge-with-spac-concord\" data-v-f87c67ca=\"\">Circle<\/a>, crypto miner <a href=\"https:\/\/www.theblock.co\/post\/163746\/crypto-miner-prime-blockchain-and-10x-spac-cancel-1-25-billion-merger-deal\" data-v-f87c67ca=\"\">Prime Brokerage<\/a>, and Binance have seen SPAC deals fail to materialize in 2022.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Australian Financial Review","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"SPAC","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"John Winters","content":"PERSON"},{"type":"Australia","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"Superhero","content":"ORGANIZATION"},{"type":"summer","content":"DATE"}],"hashtag":["BINANCE","PRIVATE COMPANY M&AMP;A"],"authors":["Osato Avan-Nomayo","The Block"]}