{"summary":"Implied volatility for bitcoin has been soaring – and it&#x27;s a boon for some of the market&#x27;s biggest traders.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/58132\/bitcoins-implied-volatility-is-surging-and-its-a-cash-grab-for-big-traders","publishDate":"2020-03-09T11:29:45","id":4248,"type":null,"title":"Bitcoin&#x27;s implied volatility is surging, and it&#x27;s a cash grab for big traders","category":["MARKETS"],"content":["Implied volatility for bitcoin has been soaring – and it's a boon for some of the market's biggest traders.","One-month implied volatility for the digital asset has increased from 55% to 65% since Sunday at midnight, according to data provided by <a href=\"https:\/\/skew.com\/\" data-v-f87c67ca=\"\">Skew<\/a>.&nbsp;Implied volatility gauges a market's expectation for volatility in a given asset over the next month.&nbsp;","","","As traders brace for rocky markets ahead, bitcoin continues to see its price fall.&nbsp;During the last 24-hours, bitcoin has shed more than 4% and is currently trading above $7,700 per coin.","Elsewhere, U.S. equities are seeing further losses amid the growing coronavirus outbreak and mounting fears about its economic impact. Adding to the concerns: conversations between OPEC and Russia broke down over the weekend, a development which precipitated a 30% drop in the price of crude. At last check, Dow Jones Industrial Average was trading down more than 1,400 points this morning.","Indeed, the VIX index – which measures 30-day implied volatility – soared to 62 during this morning's session, which is close to where it stood during the financial crisis.&nbsp;","","","Still, some crypto traders are surprised that there isn't more panic in the market.&nbsp;","\"It's a casual slide down,\" Darius Sit of crypto derivatives trader QCP told The Block. \"Which is strange.\"","Max Boonen, co-founder of B2C2, said revised growth expectations would have more of an impact on equities relative to bitcoin, which might be playing into the more sanguine sentiment.&nbsp;","\"Stocks are down big time because the growth expectations have been revised much lower,\" he said. \"Bitcoin does not really depend on economic growth. It's not a stock with dividends.\"","Regardless of the asset class, an increase in volatility is a good thing for some traders and brokers who thrive during these kinds of market conditions. High-frequency traders like Virtu Financial make markets during these conditions and earn money on the spread between the price investors want to buy or sell a stock. When volatility increases, that spread widens and firms generally can make more money.","Virtu is one of the few stocks in the green today, trading up 1.9% at time of writing.","The same logic goes for crypto market-making firms, industry sources say.","\"I suspect everyone in a similar business benefits to varying degrees based on the exact strategy,\" Boonen said, adding:&nbsp;\"We had a big February.\"&nbsp;Since the beginning of March, Boonen said the firm has raked in as much profit as it did in December.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"this morning","content":"TIME"},{"type":"U.S.","content":"LOCATION"},{"type":"1.9%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Virtu Financial","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"weekend","content":"DATE"},{"type":"65%","content":"PERCENT"},{"type":"February","content":"DATE"},{"type":"Boonen","content":"PERSON"},{"type":"55%","content":"PERCENT"},{"type":"VIX","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"midnight","content":"TIME"},{"type":"March","content":"DATE"},{"type":"last 24","content":"DATE"},{"type":"$7,700","content":"MONEY"},{"type":"OPEC","content":"ORGANIZATION"},{"type":"Russia","content":"LOCATION"},{"type":"Max Boonen","content":"PERSON"},{"type":"Dow Jones","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}