{"summary":"Roughly 2,500 ether ($4 million) connected to last year’s FTX exploit have been moved in multiple privacy-focused transactions.","author":["Adam James","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/253716\/ftx-drainer-moves-millions-in-ether-for-first-time-in-nearly-a-year","publishDate":"2023-09-30T05:17:14","id":425,"type":null,"title":"FTX drainer moves millions in ether for first time in nearly a year","category":["Exchanges"],"content":["Roughly 2,500 ether ($4 million) connected to the apparent exploit of FTX during last year's debacle is on the move for the first time in nearly one year, publicly available blockchain data indicates.","The funds were divided via multiple transactions. 700 ether was <a href=\"https:\/\/etherscan.io\/address\/0xc94bd11bbfa1d518f7c456b8cfe73fd1c498f87f\" data-v-f87c67ca=\"\">transferred<\/a> using the Thorchain Router, a cross-chain bridge with a focus on privacy. 1,200 ether was <a href=\"https:\/\/etherscan.io\/address\/0xc1177360283cbbfed9dfa6eb5430663a643566f5\" data-v-f87c67ca=\"\">transferred<\/a> through Railgun, a privacy-focused DeFi wallet that allows for shielded transactions. 550 ether <a href=\"https:\/\/etherscan.io\/address\/0xc94bd11bbfa1d518f7c456b8cfe73fd1c498f87f\" data-v-f87c67ca=\"\">remains<\/a> in another wallet.","The exploiter still has 12,500 ether ($21 million) in its original wallet.","How exactly the funds were drained from FTX and who did it still remains a mystery.","Accounts tied to the collapsed exchange and its U.S. affiliate were drained on Nov. 11, 2022, almost immediately after the company filed for Chapter 11 bankruptcy protection and disgraced founder Sam Bankman-Fried resigned.","Shortly after the exploit took place, roughly 21,500 ether ($27 million, at the time) was <a href=\"https:\/\/www.theblock.co\/post\/187027\/wallet-that-drained-ftx-accounts-starts-swapping-millions-of-dai-for-ether\" data-v-f87c67ca=\"\">converted into stablecoin DAI<\/a>.","Bankman-Fried is scheduled to go on trial next week. He has pleaded not guilty to all charges."],"hashtag":["EXPLOITS","FTX","HACKS","SAM BANKMAN-FRIED"]}