{"summary":"Gemini, the crypto exchange business run by the Winklevoss twins, is hoping mediation will produce a swift resolution to negotiations with Digital Currency Group.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228894\/gemini-earn-mediation-dcg","publishDate":"2023-05-01T02:18:36","id":4250,"type":null,"title":"Gemini looks to mediation in hope of swift resolution to Earn debacle","category":["COMPANIES"],"content":["Gemini, the crypto exchange business run by the Winklevoss twins, is hoping mediation will produce a swift resolution to negotiations with Digital Currency Group about returning funds to customers.","In an <a href=\"https:\/\/www.gemini.com\/earn\" data-v-f87c67ca=\"\">update<\/a> on April 28, Gemini said that DCG, DCG’s bankrupt lending arm Genesis Global, the Unsecured Creditors Committee (UCC), the Creditor Committee and Gemini itself had “agreed to start a 30-day mediation process to drive to a final resolution as soon as possible,” adding that “an order from Bankruptcy Judge Lane directing the mediation is expected to be entered as early as Monday.”","Some 340,000 customers of Gemini Earn, the now-terminated yield generating product, have been stuck in limbo since late last year after DCG’s Genesis Global paused withdrawals in November. Genesis Global later <a href=\"https:\/\/www.theblock.co\/post\/204035\/genesis-owes-more-than-3-6-billion-to-top-50-creditors\" data-v-f87c67ca=\"\">filed for Chapter 11 bankruptcy<\/a> with more than $3.5 billion owed to creditors. By far the largest claim belonged to Gemini Trust Company, which was owed $766 million in funds that had been lent out through the Gemini Earn program.","Gemini and DCG <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-02-06\/dcg-bankrupt-crypto-firm-genesis-in-credit-accord-with-gemini-others\" data-v-f87c67ca=\"\">reached an agreement<\/a> in February that would see DCG restructuring debts, as well as contributing equity in Genesis Global Trading, another unit, to its bankrupt lending arm, with Gemini contributing up to $100 million.","But there are still details to hash out. On April 21, the UCC presented a revised term sheet to DCG after an investigation.","In Friday’s update, Gemini said the agreed-to mediation “will be narrowly focused on DCG’s economic contribution to the bankruptcy estate for the benefit of all creditors, including Earn users, and is designed to bring resolution to the Genesis bankruptcy plan.”","Gemini said the mediation process will involve two meetings before May 8, adding that $630 million owed to Gemini by DCG is due by May 9-11. “If DCG is unable to pay and\/or restructure its debt, DCG risks defaulting on its obligations. So while the mediation is scheduled for up to 30 days, the parties are expected to work expeditiously towards agreement in the immediate window,” Gemini said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DCG","content":"ORGANIZATION"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"Creditor Committee","content":"ORGANIZATION"},{"type":"April 21","content":"DATE"},{"type":"$630 million","content":"MONEY"},{"type":"November","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"April 28","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"$3.5 billion","content":"MONEY"},{"type":"Gemini Trust Company","content":"ORGANIZATION"},{"type":"Gemini","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Lane","content":"PERSON"},{"type":"Winklevoss twins","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Genesis Global Trading","content":"ORGANIZATION"},{"type":"$766 million","content":"MONEY"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"11","content":"DATE"},{"type":"Unsecured Creditors Committee (UCC","content":"ORGANIZATION"},{"type":"May 8","content":"DATE"},{"type":"May 9","content":"DATE"},{"type":"UCC","content":"ORGANIZATION"}],"hashtag":["GEMINI"],"authors":["Ryan Weeks","The Block"]}