{"summary":"MakerDAO has issued a warning after a flash loan was used to pass a governance vote on its stablecoin platform.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/82721\/makerdao-issues-warning-after-a-flash-loan-is-used-to-pass-a-governance-vote","publishDate":"2020-10-28T16:35:43","id":4251,"type":null,"title":"MakerDAO issues warning after a flash loan is used to pass a governance vote","category":["DEFI"],"content":["The team behind a DeFi protocol wanted white-list access to MakerDAO’s price oracle. And to make it happen, they used a flash loan to manipulate a vote in a process that has triggered questions about the stablecoin platform’s governance apparatus.","The complicated nature of the situation was detailed in a forum <a href=\"https:\/\/forum.makerdao.com\/t\/urgent-flash-loans-and-securing-the-maker-protocol\/4901\/7\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">post<\/a> on Wednesday. It’s a notable example of flash loans, or lending arrangements that play out across a single Ethereum transaction, can lead to unexpected outcomes and create security quandaries across the largely experimental DeFi landscape.","Readers might remember flash loans as the central piece in a series of <a href=\"https:\/\/www.theblockcrypto.com\/post\/56171\/bzx-exploit-former-google-engineer-explains-how-an-attacker-made-350k-in-single-transaction\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">protocol<\/a> <a href=\"https:\/\/www.theblockcrypto.com\/daily\/56413\/experts-weigh-in-on-bzx-attacks-flash-loans-highlight-the-need-to-improve-defi-security-models\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">exploits<\/a> earlier this year. Ultimately, those exploits forced ecosystem participants to rethink their security practices in a fast-moving space.","Essentially, B Protocol’s team wanted to be white-listed in order to access the MakerDAO’s price oracle. So, they submitted a <a href=\"https:\/\/vote.makerdao.com\/executive\/increase-the-surplus-buffer-oracle-whitelisting-october-23-2020?network=mainnet#proposal-detail\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">proposal<\/a> to Maker’s governance structure in order to receive that approval on October 23.","Three days later, a multi-step transaction was created and processed that began with a borrowing of synthetic Ether, which was then used as collateral to borrow $7 million worth of MKR tokens, which are used to vote on proposals. The newly-borrowed MKR was used to pass the vote and then returned to the markets from which they were lent.","At this point, it doesn’t appear that what occurred with Maker and B Protocol was malicious in nature, and the post states that B Protocol has been fully transparent in communicating their actions once the Foundation became aware of the voting irregularities.","Still, as the post noted: “Their actions are a practical example for the community that flash loans can and may impact system governance and highlight that MKR market liquidity needs to be actively monitored.”","What comes next is discussion and action on possible countermeasures to a future event in which flash loans are used in a more malicious fashion against Maker. The post also outlined some more immediate steps to reduce the risk to Maker’s governance architecture. This includes extra time for MKR holders to react to a governance attack and disabling some functions for governance participants.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Foundation","content":"ORGANIZATION"},{"type":"MKR","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"$7 million","content":"MONEY"},{"type":"Three days later","content":"DATE"},{"type":"October 23","content":"DATE"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}