{"summary":"To celebrate the upcoming launch of Kava 9 and incentivize users to test the new features, Kava is hosting a 2-week testnet event with $150K in prizes up for grabs. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/126651\/kava-hosts-150k-testnet-competition-the-loan-wars","publishDate":"2021-12-09T09:00:11","id":4252,"type":null,"title":"Kava Hosts $150K Testnet Competition: The Loan Wars","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">To celebrate the upcoming launch of <\/span><a href=\"https:\/\/medium.com\/kava-labs\/kava-9-is-coming-ibc-and-more-882bd4aedb72\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Kava 9<\/span><\/a><span data-v-f87c67ca=\"\"> and incentivize users to test the new features, Kava is hosting a 2-week testnet event with $150K in prizes up for grabs.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Kava 9, is bringing a number of major upgrades to the Kava network. The most exciting of these is the integration of the Inter-Blockchain Communication Protocol (IBC), which will connect Kava to the Cosmos ecosystem and enable holders of ATOM, OSMO, LUNA, AKT, and many other IBC-enabled assets to earn high yields with them on the Kava Platform.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As Kava prepares to connect to the IBC, the citizens of the network have offered a handsome bounty to anyone willing to help them secure it. Intrepid explorers from across the Cosmos are gathering to do battle in the hopes of claiming the top prize: $10K in ATOM and $10K in KAVA.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">During the event, competitors will use a mixture of IBC assets on the testnet to earn and claim rewards on the Kava Platform. Whoever claims the most rewards by the end of the event will be crowned Loan Wars Champion!<\/span>","<span data-v-f87c67ca=\"\">Learn more and register for <\/span><a href=\"https:\/\/kava.io\/loanwars\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The Loan Wars here.&nbsp;<\/span><\/a>","<span data-v-f87c67ca=\"\">Since the launch of IBC earlier this year, Kava has been working to integrate it and unlock Kava’s earning power for the Cosmos ecosystem. As with all things that Kava does, ensuring the security and stability of any major change is the top priority. With Kava 9, the infrastructure will be in place to integrate safely and begin connecting to the Cosmos ecosystem without putting users at risk.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This is a huge step for Kava’s interoperability. IBC will make moving assets from IBC-enabled chains onto Kava effortless. ATOM holders, for instance, will be able to immediately begin leveraging up their positions using Kava Mint and earning with Kava Lend and Swap. KAVA, HARD, SWP, and USDX holders will also be able to use them on other chains in the Cosmos ecosystem, giving them new utility.<\/span>","<span data-v-f87c67ca=\"\">Kava is taking a huge step toward an interoperable future with the launch of Kava 9 and IBC. To ensure its stability and welcome the communities of the Cosmos to Kava, they are hosting a $150K testnet competition: The Loan Wars. <\/span><a href=\"https:\/\/kava.io\/loanwars\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Register now<\/span><\/a><span data-v-f87c67ca=\"\"> to join the battle and claim your share of the prizes!&nbsp;&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$150K","content":"MONEY"},{"type":"SWP","content":"ORGANIZATION"},{"type":"Kava","content":"PERSON"},{"type":"The Loan Wars","content":"ORGANIZATION"},{"type":"Inter-Blockchain Communication Protocol (IBC","content":"ORGANIZATION"},{"type":"Cosmos","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"$10K","content":"MONEY"},{"type":"Kava Lend","content":"ORGANIZATION"},{"type":"USDX","content":"ORGANIZATION"},{"type":"IBC","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}