{"summary":"Metis has launched an alpha version of its decentralized sequencer as part of the Layer 2’s plans to fully decentralize its infrastructure.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282515\/metis-decentralized-sequencer-alpha-version","publishDate":"2024-03-14T12:00:03","id":4256,"type":null,"title":"Metis launches alpha version of its decentralized sequencer","category":["LAYER 2S AND SCALING"],"content":["<span data-v-f87c67ca=\"\">Ethereum scaling solution <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Metis <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/257081\/metis-metis-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/metis.jpeg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">METIS<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -2.76%\n    <\/span><\/a> <!----><\/span><\/span> has launched an alpha version of its decentralized sequencer — a step beyond the current centralized single-sequencer model used by Layer 2 rollups.<\/span>","While rollups are a promising scaling solution for Ethereum, helping to increase transaction throughput and <a href=\"https:\/\/www.theblock.co\/post\/282417\/ethereum-layer-2s-show-dramatic-drop-in-transaction-fees-after-dencun\" data-v-f87c67ca=\"\">reduce fees<\/a> — especially following Ethereum’s <a href=\"https:\/\/www.theblock.co\/post\/282236\/ethereum-dencun-upgrade-blobs\" data-v-f87c67ca=\"\">Dencun upgrade<\/a> yesterday — they introduce elements of centralization, such as relying on sequencers and provers controlled by the projects’ teams who also retain any revenue the sequencer generates.","A sequencer is a component that orders and batches multiple off-chain transactions before submitting them to the Ethereum blockchain. A prover is a mechanism that generates cryptographic proofs to validate transactions without processing them on the main chain. These currently create single points of failure and potential censorship risks that could have a significant impact on users.","The development team behind Metis argues that today’s launch makes the EVM-compatible solution the first Ethereum rollup to decentralize its sequencer. The only way rollups can fully inherit Ethereum’s underlying security is by having a decentralized fraud-proof system and a decentralized sequencer, the team added.","However, alpha versions in the crypto space are only available to a small group of users — allowing developers to test features in a controlled environment, gather feedback, fix bugs and ensure stability before a wider release.","The development will enable multiple parties to run sequencers and participate in the consensus process, designed to enhance Metis’ security and decentralization while sharing its revenue. It also paves the way for sequencer rotation, making it more difficult for malicious actors to compromise the system, and improved network stability, according to the team.","Sequencer nodes earn METIS token rewards to incentivize their participation in producing blocks and processing transactions on the network. During the first year, there will be a 20% Mining Rewards Rate (MRR) for all sequencer nodes — the rate at which smart contracts reward lockers (participants that lock governance tokens) for block production.","Adoption of Layer 2 solutions has grown significantly over the past year, with combined daily transaction averages on networks like Arbitrum, Base and Optimism (OP Mainnet) exceeding those on the Ethereum main chain.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/optimistic-rollups\/transaction-count-daily-7dma\/embed\" title=\"Transaction Count on Optimistic Rollups (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/transactions-on-the-ethereum-network-daily\/embed\" title=\"Transactions on the Ethereum Network (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Throughput and fees are part of the driver behind this trend, with Layer 2s processing more than <a href=\"https:\/\/l2beat.com\/scaling\/activity\" data-v-f87c67ca=\"\">eight times<\/a> the amount of transactions per second on average, according to L2BEAT, at a significantly lower cost compared to the base layer.","Metis co-founder Elena Sinelnikova <a href=\"https:\/\/www.theblock.co\/post\/251235\/metis-first-ethereum-decentralized-layer-2-2023\" data-v-f87c67ca=\"\">told<\/a> The Block in an interview last year that the network distinguishes itself from other Layer 2 solutions through its alignment with the MetisDAO Foundation — ultimately aiming to provide fully decentralized network infrastructure operated by the community.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"-2.76%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Elena Sinelnikova","content":"PERSON"}],"hashtag":["ETHEREUM","ROLLUPS"],"authors":["James Hunt","The Block"]}