{"summary":"A malicious proposal passed by the Tornado Cash DAO gave an attacker complete control over its governance system.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231637\/attacker-uses-malicious-proposal-to-take-over-tornado-cash-governance","publishDate":"2023-05-21T05:05:43","id":4259,"type":null,"title":"Attacker uses malicious proposal to take over Tornado Cash governance","category":["CRYPTO ECOSYSTEMS"],"content":["An attacker managed to get a malicious proposal passed by the Tornado Cash DAO, one that handed them complete control over its governance system.","Tornado Cash is the crypto mixing service that runs on Ethereum and was sanctioned by the U.S. Treasury. Its governance system controls upgrades to the protocol and is run by those holding the project's native TORN tokens.","The governance system approved on May 20 an upgrade that was purportedly the same as a previous upgrade that had passed. Yet that wasn't true as the attacker had added an extra function, <a href=\"https:\/\/twitter.com\/samczsun\/status\/1660012956632104960?s=46\" data-v-f87c67ca=\"\">according<\/a> to a pseudonymous security researcher known as Samczsun on Twitter. Once the upgrade was passed, the attacker used this function to hand themselves an extra 1.2 million votes, giving them effective control over the entire governance system.","The attacker has already used this control to their advantage. Straight away, they withdrew 10,000 votes in the form of TORN tokens and <a href=\"https:\/\/openchain.xyz\/trace\/ethereum\/0x65fa5b475f34a954a10f88f2c84f316a048a0e67d273c7abb098717b1a4a46a3\" data-v-f87c67ca=\"\">sold them<\/a> all for $25,600. Then they <a href=\"https:\/\/twitter.com\/samczsun\/status\/1660094606019825664\" data-v-f87c67ca=\"\">drained<\/a> the remainder of the locked votes, Samczsun said.","In total, 483,000 TORN was taken from the vault, <a href=\"https:\/\/twitter.com\/EmberCN\/status\/1660113442056081408\" data-v-f87c67ca=\"\">according<\/a> to on-chain analyst EmberCN. They claimed 6,000 TORN was deposited on crypto exchange Bitrue, that 379,000 was sold on-chain for $680,000 of ether and just under 100,000 TORN remains under the attacker's control.","Binance said it would stop deposits and withdrawals of TORN, <a href=\"https:\/\/twitter.com\/WuBlockchain\/status\/1660130921885106176\" data-v-f87c67ca=\"\">according<\/a> to Wu Blockchain, while Justin Sun <a href=\"https:\/\/twitter.com\/justinsuntron\/status\/1660139594216779782\" data-v-f87c67ca=\"\">said<\/a> on Twitter that deposits and withdrawals of the token remain open on Huobi.","Samczsun noted that with the control over the governance system, the attacker can drain all of the tokens in the governance contract and <a href=\"https:\/\/twitter.com\/CConnorMahoney\/status\/1660141733554823169\" data-v-f87c67ca=\"\">effectively<\/a> stop the router from working, a core part of how the protocol operates. On the flip side, the reseacher noted that the attacker isn't able to drain the funds that are held within the protocol — such as ether that's being used for mixing — <a href=\"https:\/\/twitter.com\/samczsun\/status\/1660042906500214784\" data-v-f87c67ca=\"\">except<\/a> for one pool on Gnosis Chain, which is upgradeable.","The price of TORN fell from a high of $7.3 yesterday to as low as $3.75 today. It has since rebounded to $4.60.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"Samczsun","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"$25,600","content":"MONEY"},{"type":"Samczsun","content":"PERSON"},{"type":"Justin Sun","content":"PERSON"},{"type":"$3.75","content":"MONEY"},{"type":"$680,000","content":"MONEY"},{"type":"$7.3","content":"MONEY"},{"type":"$4.60","content":"MONEY"},{"type":"May 20","content":"DATE"},{"type":"Gnosis Chain","content":"ORGANIZATION"},{"type":"Wu Blockchain","content":"PERSON"}],"hashtag":["EXPLOITS","MIXERS","SMART CONTRACTS"],"authors":["Tim Copeland","The Block"]}