{"summary":"MakerDAO has begun the process that could see the protocol limit the DAI’s exposure to Gemini’s stablecoin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/203307\/makerdao-voting-to-limit-dai-exposure-to-gemini-amid-insolvency-fears","publishDate":"2023-01-18T10:38:08","id":4261,"type":null,"title":"MakerDAO voting to limit DAI exposure to Gemini amid insolvency fears","category":["CRYPTO ECOSYSTEMS"],"content":["MakerDAO has begun voting on a pair of governance polls designed to limit exposure of the DAI stablecoin to Gemini as a result of the current liquidity crisis facing the exchange's lending platform called Earn.","The Gemini dollar, or GUSD, is one of the collateral assets used for minting the DAI stablecoin issued by the Maker protocol. Gemini and Maker entered into a <a href=\"https:\/\/www.theblock.co\/post\/173757\/gemini-wants-to-boost-gusd-stablecoin-volume-in-makerdao\" data-v-f87c67ca=\"\">partnership last year<\/a> that saw the latter earn 1.5% when GUSD collateral in the Maker PSM exceeds $100 million. PSM stands for peg stability module and is the mechanism by which users can mint DAI in exchange for any Maker-accepted collateral. The PSM also maintains DAI’s parity with the U.S. dollar.","The GUSD collateral in the Maker protocol is now $489 million against a $500 million debt ceiling — the maximum amount of DAI that can be minted from Gemini dollar. MakerDAO participants have raised concerns about DAI’s exposure to Gemini and the potential insolvency risks associated with the Earn program's $900 million locked in the troubled crypto lender Genesis Global Capital.","Gemini CEO Tyler Winklevoss has moved to allay such fears, saying in a post on the <a href=\"https:\/\/forum.makerdao.com\/t\/gusd-makerdao-partnership-update\/19428\" data-v-f87c67ca=\"\">Maker forum<\/a> that MakerDAO’s exposure to Gemini was limited to the GUSD in the PSM. Winklevoss added that the GUSD reserve backing DAI was not the property of the company and hence would not be part of any bankruptcy proceedings.","These concerns have prompted two governance polls on MakerDAO. The <a href=\"https:\/\/vote.makerdao.com\/polling\/QmRRceEo#vote-breakdown\" data-v-f87c67ca=\"\">first<\/a> poll is to set the tout — the percentage fee charged for swapping DAI back to the collateral asset —for the GUSD vault to zero, which would effectively mean that users can swap DAI back to GUSD at no cost.","The <a href=\"https:\/\/vote.makerdao.com\/polling\/QmZs1EMK#vote-breakdown\" data-v-f87c67ca=\"\">second<\/a> poll is to reduce the debt ceiling currently at $500 million.","Both polls will end on Jan. 19. The current voting figures for the first poll show the DAO is in support of setting the tout to zero. However, the second poll is still a much closer contest between those who favor maintaining the current debt ceiling and those who want it reduced to zero.","Governance polls are the first step in the MakerDAO voting process. Polls that scale this step will move to an executive vote before being implemented on the Maker protocol.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"PSM","content":"ORGANIZATION"},{"type":"$489 million","content":"MONEY"},{"type":"$900 million","content":"MONEY"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Gemini","content":"LOCATION"},{"type":"1.5%","content":"PERCENT"},{"type":"Tyler Winklevoss","content":"PERSON"},{"type":"$500 million","content":"MONEY"},{"type":"Maker","content":"ORGANIZATION"},{"type":"Maker PSM","content":"ORGANIZATION"},{"type":"GUSD","content":"ORGANIZATION"},{"type":"Jan. 19","content":"DATE"}],"hashtag":["CAMERON &AMP; TYLER WINKELVOSS","DAI","DAOS","GEMINI","GOVERNANCE VOTES"],"authors":["Osato Avan-Nomayo","The Block"]}