{"summary":"A crypto project known as VanityBlocks is dedicating whole Ethereum blocks to a single purpose.\nIt’s using them to mint NFTs that are forever tied to the block.","author":["Tim Copeland","MK Manoylov","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/133278\/a-crypto-project-is-using-up-whole-ethereum-blocks-and-turning-them-into-nfts","publishDate":"2022-02-07T16:05:48","id":427,"type":null,"title":"A crypto project is turning whole Ethereum blocks into NFTs","category":["NFTs"],"content":["<span data-v-f87c67ca=\"\">A crypto project, known as <\/span><a href=\"https:\/\/opensea.io\/collection\/vanityblocks\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">VanityBlocks<\/span><\/a><span data-v-f87c67ca=\"\">, has started turning whole Ethereum transaction blocks into non-fungible tokens (NFTs) — preventing anyone else from having space in that block.<\/span>","<span data-v-f87c67ca=\"\">The first Genesis NFT was created on January 16. It was in <a href=\"https:\/\/etherscan.io\/block\/14017777\" data-v-f87c67ca=\"\">block 14017777<\/a> and the transaction to create the NFT took up the entire block, costing about 5.31 ETH ($16,600 USD). A more recent mint on January 31 for <a href=\"https:\/\/etherscan.io\/block\/14114114\" data-v-f87c67ca=\"\">block 14114114<\/a> cost over 3.42 ETH ($10,700 USD) in transaction fees. As of publication, VanityBlocks has minted only these two blocks.&nbsp;<\/span>","The second NFT minted has already been sold to an interested buyer. It was sold for 7 ETH ($21,000) on the same day it was minted.","<span data-v-f87c67ca=\"\">One Ethereum block can hold between a few to several hundred transactions depending on the size of each transaction. Transactions on Ethereum are designed to cost more if they contain more code, which is used to deter spam. In this case, the code was designed to keep performing operations until it hits a certain amount of gas used (the term used for measuring the weight of a transaction and how much its transaction fee should therefore be). <\/span>","<span data-v-f87c67ca=\"\">As a result, the transaction for each NFT maxed out the 30 million gas limit, meaning that no other transactions could fit in each block.<br data-v-f87c67ca=\"\">\n<\/span>","The only transaction in each block is the one minting the NFT. The NFTs show the same image of a pair of eyes on a black background. In the NFT's metadata, it contains the block number that it was mined in. The concept is that each NFT represents the block that it was mined in, somehow making it represent a part of the Ethereum blockchain.","","","The transactions minting the NFTs were also submitted through flashbots, a messaging app that lets Ethereum users connect with miners and have transactions included directly in a block (as opposed to broadcast publicly to the network). They may have agreed with the miner to only process this one transaction in the block.","<span data-v-f87c67ca=\"\">VanityBlocks taking up entire blocks on the Ethereum blockchain in one go uses of some of the scant space available for other crypto users. As a result, it may have resulted in increased short-term transaction costs for anyone else trying to make transactions at the same time. And due to the way Ethereum transaction fees <a href=\"https:\/\/www.theblockcrypto.com\/news+\/114474\/how-do-ethereum-transaction-fees-work-now-that-eip-1559-is-live\" data-v-f87c67ca=\"\">now work following EIP-1559<\/a>, it would have also temporarily raised the amount of fees that must be burned in the following block.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">This follows a trend of NFT projects purposely <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/130797\/what-is-it-with-nfts-and-destroying-real-world-items\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">wasting<\/span><\/a><span data-v-f87c67ca=\"\"> resources or rare items in order to create NFTs of value.&nbsp;<\/span><span data-v-f87c67ca=\"\">Other wasteful projects include one that burned a Banksy painting after minting it as an NFT (although this may be justified as it's the kind of thing Banksy may have done — he did shred a painting after all). Another proposed the idea of destroying a rare original copy of the hit science fiction novel <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Dune. <\/span><\/i>","<em data-v-f87c67ca=\"\">H\/T to Flashbots product lead Bert Miller and The Block Research analyst Simon Cousaert for helping with checking the transaction code for this story.<\/em>"],"hashtag":["ETHEREUM"]}