{"summary":"Users of Cryptopia exchange, which suffered a hack and went into liquidation last year, are entitled to their funds, according to a court judgment. The ruling appears to be a precedent-setting court decision. Cryptopia owes over 800,000 users, who are holding a positive coin balance on the platform.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/61233\/cryptopia-users-are-entitled-to-their-funds-court-rules-in-a-landmark-judgment","publishDate":"2020-04-08T06:55:27","id":4278,"type":null,"title":"Cryptopia users are now legally entitled to their funds","category":["LEGAL"],"content":["Users of Cryptopia exchange, which suffered a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/7408\/new-zealand-exchange-reports-significant-losses-following-hack\" data-v-f87c67ca=\"\">hack<\/a> and went into <a href=\"https:\/\/www.theblockcrypto.com\/linked\/23453\/cryptocurrency-exchange-cryptopia-halts-trading-and-announces-it-is-in-the-process-of-liquidation\" data-v-f87c67ca=\"\">liquidation<\/a> last year, are entitled to their funds, according to a court judgment.","In the <a href=\"https:\/\/www.grantthornton.co.nz\/globalassets\/1.-member-firms\/new-zealand\/pdfs\/cryptopia\/civ-2019-409-000544---ruscoe-and-moore-v-cryptopia-limited-in-liquidation.pdf\" data-v-f87c67ca=\"\">74-page landmark judgment<\/a> issued Wednesday, Justice Gendall J at the High Court in Christchurch, New Zealand, said cryptocurrencies are “property” under Schedule 2 of the country’s Companies Act of 1993.","“I reach the conclusion that the cryptocurrencies here situated in Cryptopia’s exchange are a species of intangible personal property and clearly an identifiable thing of value,” said Justice Gendall. \"The argument that cryptocurrency is mere information and therefore it is not property is a simplistic one and, in my view, it is wrong in the present context. I dismiss it.\"","Cryptopia today <a href=\"https:\/\/twitter.com\/Cryptopia_NZ\/status\/1247765372444409859\" data-v-f87c67ca=\"\">tweeted<\/a> that the ruling means “cryptocurrencies are beneficially owned by the account holders and are not assets of the company.”","The tussle before the High Court was either to side with creditors of Cryptopia or users of the exchange. Justice Gendall sided with the latter, as he classified crypto as property and not as simple debt.","The ruling appears to be a precedent-setting court decision. “This is the first occasion on which issues of this type concerning cryptocurrency have been before the courts in New Zealand,” according to the judgment.","As a result of this ruling, Cryptopia liquidators, overseen by Grant Thornton New Zealand, now know how they can distribute user funds. The liquidators have estimated Cryptopia currently holds cryptocurrency worth about NZ$ 170 million (~US$101 million), per the judgment.","Cryptopia owes over 800,000 users, who are holding a positive coin balance on the platform. The exchange’s 37 creditors and 90 shareholders have also been seeking reimbursements.","It remains to be seen how and when the funds get distributed. The Block has reached out to both Cryptopia and Grant Thornton New Zealand for comments and will update this story should we hear back.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New Zealand","content":"LOCATION"},{"type":"Cryptopia","content":"LOCATION"},{"type":"1993","content":"DATE"},{"type":"Grant Thornton New Zealand","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"High Court","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"Christchurch","content":"LOCATION"},{"type":"Justice Gendall J","content":"ORGANIZATION"},{"type":"Gendall","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"NZ$ 170 million","content":"MONEY"},{"type":"US$101 million","content":"MONEY"},{"type":"Cryptopia liquidators","content":"ORGANIZATION"},{"type":"Grant Thornton New Zealand","content":"LOCATION"},{"type":"Justice Gendall","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}