{"summary":"An examiner investigating the FTX collapse could cost the bankruptcy estate up to $100 million, lawyers argued in a new court filing.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/205712\/court-docs-ftx-debtors-bahamian-liquidators-object-to-u-s-trustees-examiner-request","publishDate":"2023-01-25T17:44:37","id":428,"type":null,"title":"Court docs: FTX debtors, Bahamian liquidators object to U.S. Trustee’s examiner request","category":["COMPANIES"],"content":["Allowing an examiner to investigate the FTX bankruptcy would “come at an enormous cost” and “provide no benefit” to creditors, lawyers for the troubled crypto exchange said in a court filing.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The U.S. Trustee overseeing the FTX case asked a Delaware bankruptcy court to allow the appointment of a third-party examiner to look into the finances of FTX and its family of companies. Judge John Dorsey will consider the motion at a hearing on Feb. 6.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Lawyers for the FTX debtors and joint provisional liquidators in the Bahamas filed court documents on Wednesday objecting to the appointment of an examiner. Lawyers claim hiring an examiner could cost the bankruptcy estates nearly $100 million.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“This sort of exercise is neither appropriate, nor beneficial to the debtors’ creditors, shareholders or estates in general,” the FTX debtors said in a filing. “The appointment of an examiner, with a mandate to be determined, can be expected to cost these estates in the tens of millions of dollars. Indeed, if history is a guide, the cost could near or exceed $100 million.”","The U.S. Trustee, however, argued that an examiner will increase transparency in the case. FTX filed for bankruptcy protection in November after a run on its utility token, and could owe $3.1 billion to its top 50 creditors.","“An examination is preferable to an internal investigation under the facts of these cases because the findings and conclusions of the examination will be public and transparent, which is especially important because of the wider implications that FTX’s collapse may have for the crypto industry,” the U.S. Trustee wrote in a December court filing.","Lawyers for the joint provision liquidators pushed back on that argument, pointing to investigations into FTX that are already underway. New FTX CEO John Ray III is reporting the firm's finances to court, along with the official committee of unsecured creditors and several government agencies including the Department of Justice.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"John Dorsey","content":"PERSON"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Delaware","content":"LOCATION"},{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$3.1 billion","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"tens of millions of dollars","content":"MONEY"},{"type":"Alameda","content":"LOCATION"},{"type":"John Ray III","content":"PERSON"},{"type":"Bahamas","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Feb. 6","content":"DATE"},{"type":"U.S. Trustee","content":"ORGANIZATION"}],"hashtag":["BANKRUPTCY FILINGS","FTX"],"authors":["Stephanie Murray","The Block"]}