{"summary":"Investment brokerage Charles Schwab is set to launch its first crypto-related ETF next week.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/160262\/schwab-set-to-launch-its-first-crypto-linked-etf","publishDate":"2022-07-29T12:46:18","id":4281,"type":null,"title":"Schwab set to launch its first crypto-linked ETF","category":["MARKETS"],"content":["Investment brokerage Charles Schwab has launched its first crypto-related ETF, with trading set to begin on or around August 4.","The asset manager made the <a href=\"https:\/\/www.businesswire.com\/news\/home\/20220728006119\/en\/Schwab-Launches-Its-First-Crypto-related-ETF%E2%80%94the-Schwab-Crypto-Thematic-ETF\" data-v-f87c67ca=\"\">announcement<\/a> on Friday, sharing that the fund will track the Schwab Crypto Thematic Index. This new fund will give investors exposure to companies that may benefit from the development or growing utilization of cryptocurrencies and digital assets.","Managing director and head of equity product management and innovation at Schwab David Botset said the ETF seeks to \"provide access to the growing global crypto ecosystem along with the benefits of transparency and low cost that investors and advisors expect from Schwab ETFs.”","The Schwab Crypto Thematic Index, which the ETF will track, was developed by the firm's research team and uses a combination of human insight, artificial intelligence technology and systematic models to track companies based on their relevance to cryptocurrencies. This index does not directly track or invest in any cryptocurrencies.","According to the announcement the ETFs annual operating expense ratio will be just 0.30%, making it the lowest cost crypto-related ETF on the market. However, some issuers outside the US offer zero fees on products with direct exposure to cryptocurrencies.&nbsp;","The company previously <a href=\"https:\/\/www.theblock.co\/linked\/136116\/schwab-files-with-sec-to-create-crypto-economy-etf\" data-v-f87c67ca=\"\">filed<\/a> an application with the SEC for a crypto economy ETF in March having changed its tune on crypto over the past few years. Despite previously saying the asset class was purely speculative it is now following other institutional heavy weights into the sector.","The firm's CEO, Walt Bettinger, said in an interview with Bloomberg in January that crypto is \"hard to ignore.\"&nbsp;","According to Friday's announcement, the firm managed over&nbsp; $570 billion on a discretionary basis – and $34.4 billion on a non-discretionary basis – as of the end of June.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$570 billion","content":"MONEY"},{"type":"Schwab David Botset","content":"PERSON"},{"type":"0.30%","content":"PERCENT"},{"type":"August 4","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Schwab","content":"LOCATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Charles Schwab","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"ETF","content":"ORGANIZATION"},{"type":"Schwab Crypto Thematic Index","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Walt Bettinger","content":"PERSON"},{"type":"$34.4 billion","content":"MONEY"},{"type":"Friday","content":"DATE"}],"hashtag":[],"authors":["Adam Morgan McCarthy","The Block"]}