{"summary":"Blockchain analytics firm TRM Labs explains why the Tornado Cash sanctions are different and details how it is dealing with them — despite a lack of guidance.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/163728\/trm-labs-says-tornado-cash-action-is-a-new-challenge-for-sanctions-compliance","publishDate":"2022-08-16T06:01:54","id":4288,"type":null,"title":"TRM Labs says Tornado Cash action is a ‘new challenge for sanctions compliance’","category":["TECHNOLOGY"],"content":["Blockchain analytics firm TRM Labs says that the Tornado Cash sanctions present new problems for crypto firms trying to comply with US regulations.","TRM Labs provides information to crypto entities such as Uniswap, Aave and Circle which helps them comply with various regulations and track criminal activity. It monitors crypto addresses and categorizes them by their level of risk, enabling crypto entities to avoid dealing with laundered funds or bad actors. It also assesses whether addresses are compliant with US sanctions.","The firm issued a <a href=\"https:\/\/www.trmlabs.com\/post\/how-defi-platforms-are-using-data-from-trm-labs-to-respond-to-tornado-cash-sanctions\" data-v-f87c67ca=\"\">statement<\/a> on August 15 that broke down how it works with DeFi protocols to help them try to stay compliant. Yet the firm highlighted that these sanctions are different from previous rules in a way that makes it more ambiguous in how to adhere to them.","TRM Labs noted that this is the first time the Office of Foreign Assets Control (OFAC) has sanctioned a set of smart contracts instead of normal blockchain wallets. With wallets, it’s generally easy to identify if someone has interacted with the wallet either by sending or receiving funds from them. But smart contracts are more complicated.","“What makes the Tornado Cash designation challenging from a compliance and enforcement perspective is that any person who deposits funds into Tornado Cash can trigger the Tornado Cash smart contracts to send funds to any other Ethereum address(es),” said TRM Labs. “Theoretically, someone could send funds to Tornado Cash and then specify that those funds be deposited into a totally unrelated cryptocurrency address belonging to a random, unsuspecting, or even unwilling person.”","As TRM Labs noted, this has <a href=\"https:\/\/www.theblock.co\/post\/162465\/crypto-notables-are-being-sent-eth-from-sanctioned-tornado-cash-wallets?utm_source=onecryptofeed&amp;utm_medium=social\" data-v-f87c67ca=\"\">already happened<\/a>. One user sent small amounts of ETH from the sanctioned Tornado Cash smart contract to a range of well-known crypto and mainstream individuals (including Coinbase CEO Brian Armstrong, talk show host Jimmy Fallon and former basketball player Shaquille O'Neal).","Due to the uncertainty, TRM Labs explained that it provides three levels of risk data. When a crypto firm pings it with an address (to check whether the address is compliant), TRM Labs provides data on whether the address is a sanctioned address, and whether it has direct or indirect exposure to sanctioned addresses.&nbsp;","Yet TRM Labs highlighted that so-called dusting attacks are a particular problem. Since they are technically an interaction with a sanctioned entity, the firm is unable to dismiss them — especially without any guidance from regulators.","The result is that this pushes the onus onto crypto entities, which will be forced to individually decide whether to allow wallets that have been hit by dusting attacks.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Office of Foreign Assets Control (OFAC","content":"ORGANIZATION"},{"type":"TRM Labs","content":"ORGANIZATION"},{"type":"Jimmy Fallon","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"August 15","content":"DATE"},{"type":"Shaquille O'Neal)","content":"ORGANIZATION"},{"type":"Uniswap","content":"LOCATION"}],"hashtag":["SANCTIONS"],"authors":["Tim Copeland","The Block"]}