{"summary":"Weekly global World ID verifications increased by more than 100% in the week following Worldcoin&#x27;s launch from beta, the project claims.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/243461\/worldcoin-activity-launch-week","publishDate":"2023-08-06T20:45:34","id":429,"type":null,"title":"Worldcoin activity surges in week following launch, project claims","category":["CRYPTO ECOSYSTEMS"],"content":["Weekly global World ID verifications increased by more than 100% in the week following Worldcoin's launch out of beta — signaling a dramatic increase in demand — according to the identity protocol's official blog.","\"What’s noteworthy here is that the rate of World ID verifications had already doubled once in 2023,\" Worldcoin <a href=\"https:\/\/worldcoin.org\/blog\/announcements\/launch-week-sets-records-worldcoin-community-world-id-sign-ups\" data-v-f87c67ca=\"\">notes<\/a>, explaining: \"Between January and July, World ID sign-ups went from one million to two million in less than half the time it took to reach the first million. Last week's 2X growth in weekly World ID sign-ups demonstrates a sustained increase in global demand for World ID as a standalone product.\"","Coinciding with the increase in World ID verifications was a three-fold increase in weekly active World App users and a more-than-ten-fold increase in weekly account creations, according to the project. World App is a Worldcoin network wallet built by Tools for Humanity.","Worldcoin — \"intended to be the world’s largest identity and financial public network,\" according to its official website — has faced increased criticism and scrutiny since its launch roughly one week ago.","Some crypto veterans have <a href=\"https:\/\/www.theblock.co\/post\/242109\/worldcoin-ceo-defends-token-launch-after-criticism-over-unfair-distribution\" data-v-f87c67ca=\"\">expressed<\/a> discontent about how Sam Altman's project managed the release of its long-awaited token last week — with roughly 95% of the circulating supply going to market makers.","Others have shared concerns with the manufacturing and operation of Worldcoin's iris-scanning orbs potentially becoming decentralized — <a href=\"https:\/\/www.theblock.co\/post\/241871\/worldcoins-plan-to-decentralize-orb-production-sparks-illicit-data-harvesting-concerns\" data-v-f87c67ca=\"\">arguing<\/a> that Bitcoin-mining-type incentivization could see the proliferation of illegitimate devices and pose a security risk.","Meanwhile, the project has drawn the attention of state regulators. Last week, Kenya's Ministry of the Interior said Worldcoin activities had been <a href=\"https:\/\/www.theblock.co\/post\/242885\/after-suspension-worldcoin-says-it-will-temporarily-pause-kenya-services\" data-v-f87c67ca=\"\">suspended<\/a> until it can assess the associated risks. German regulators — as well as regulators in France and the UK — are also <a href=\"https:\/\/www.theblock.co\/post\/242287\/german-authorities-probe-worldcoin-project-over-privacy-reuters\" data-v-f87c67ca=\"\">probing<\/a> the protocol's handling of sensitive biometric data.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"100%","content":"PERCENT"},{"type":"Kenya","content":"LOCATION"},{"type":"France","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"July","content":"DATE"},{"type":"Sam Altman","content":"PERSON"},{"type":"Worldcoin","content":"LOCATION"},{"type":"Ministry of the Interior","content":"ORGANIZATION"},{"type":"ups","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"95%","content":"PERCENT"}],"hashtag":[],"authors":["Adam James","The Block"]}