{"summary":"Lolli, which is a rewards application that gives you bitcoin when you shop at your favorite stores. Frank Chaparro and Steven Zheng discuss e-commerce and crypto, the power of memes in regards to marketing Lolli in the space, how the firm lures Fortune 500 companies to it’s platform and more.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/33099\/alex-adelman-lolli","publishDate":"2019-07-23T16:15:49","id":4291,"type":null,"title":"A Conversation with Alex Adelman, CEO, Co-founder of Lolli","category":["PODCASTS"],"content":["<em data-v-f87c67ca=\"\">The following transcript is taken from The Scoop, The Block's podcast. Listen below and subscribe to The Scoop on <a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Apple<\/a>, <a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Spotify<\/a>, <a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Google Play<\/a>, <a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\">Stitcher<\/a>, or wherever you listen to podcasts. Email feedback to <a href=\"\/cdn-cgi\/l\/email-protection#0e7e616a6d6f7d7a4e7a666b6c62616d656d7c777e7a61206d6163\" data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"7909161d1a180a0d390d111c1b15161a121a0b00090d16571a1614\">[email&nbsp;protected]<\/span><\/a>.<\/em>","<a href=\"https:\/\/twitter.com\/alexadelman?lang=en\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Alex Adelman<\/a> is CEO and Co-Founder of Lolli, which is a rewards application that gives you bitcoin when you shop at your favorite stores. Frank Chaparro and Steven Zheng discuss e-commerce and crypto, the power of memes in regards to marketing Lolli in the space, how the firm lures Fortune 500 companies to it’s platform and why it could one day offer services like lending and possibly a credit card.","<iframe src=\"https:\/\/playlist.megaphone.fm?e=BLOCK4630992737\" width=\"100%\" height=\"200\" frameborder=\"0\" scrolling=\"no\" data-v-f87c67ca=\"\"><\/iframe>","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Lolli is a rewards site that gives its users bitcoin for shopping at just under a thousand retail partners like Walmart, Hotels.com and Macy's. The startup was founded by Alex Adelman and Matt Senter -- second time founders whose previous e-commerce startup was acquired by rewards giant Rakuten. Adelman joined myself and my colleague Steven Zheng on this episode of The Scoop to talk about e-commerce and crypto, how the firm lures Fortune 500 companies to it's platform and why it could one day offer services like lending and possibly a credit card. I hope you enjoy the episode. Ladies and gentlemen thank you so much. We have a very very special episode of The Scoop coming from New York in our offices at 11 Park Place. You can send me gifts. I got Steven Zheng for the first time I've convinced him to co-host an episode with me for our incredibly special guest Alex Adelman he's the CEO of Lolli. Steven for our listeners who may not be aware, Steven is in love with Lolli because every time he buys his graphic tees that he wears he gets money back in bitcoin when he does that and that's what Lolli is all about they are an e-commerce platform that allows I think at this point users to earn bitcoin when they shop at 500 stores. How many are we at?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> We're up to 960 stores right now and counting.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> That's a scoop if I've ever heard one","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Steven Zheng<\/span><\/strong> Wow. Almost double","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Almost double from what you sent me in my email this morning or maybe you were just wrong.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> We're growing fast.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> It seems like a simple concept it seems very straightforward. How did you come up with the idea to do this and what has the growth of the business looked like since launch which was a year ago?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> We launched about 10 months ago and the whole idea is like how do we make it easier for people to earn and own bitcoin. And that's where the concept started. It was very convenient that my last company and our team's last company was acquired by Ebates. And so we got to learn and understand the the best cashback company in the U.S. and we got to understand their model and how it works. And basically how it works is we partner with merchants and those merchants pay us when our users shop their site. We then take that fiat that we're earning and then we pay people in bitcoin sending bitcoin to their Lolli wallet. It's a very simple model and yeah we have gotten to know a lot of these merchants over the last seven years from our last company and now this company and we're making it really really easy for people to earn bitcoin and own bitcoin. And I think more importantly which you guys are doing as well is teach people about Bitcoin over time.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So I think when we talked in the past. One of the questions I had for you is that you need both sides of the equation: without the merchants you're not going to have something for the customers, without the customers you're not going to have merchants who are interested in doing the leg work of integrating. We can get into how that works but how do you create a platform that's two sided like that? How do you get both sides interested enough?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> Yeah the art of the two sided marketplace. I think it's something I've studied and we powered it, we were a middleman with our last company and so we powered a lot of two sided market places getting merchants to sell their products directly in publishers in different channels and and so part of it was the fact that we we knew a lot of these merchants. They trusted us. We made them a lot of money over the last seven years with our last company. So I called a lot of them back up when we first started it about a year and a half ago. Building these partnerships and I said look you know the bitcoin market is really exciting. There's a whole group of customers that are already invested in bitcoin that want more of it. And then there's also people that would rather have five dollars in bitcoin than they would rather have five dollars in cash. There's just whole new market. They would rather earn Bitcoin back instead of cash back. And the current process for getting bitcoin was very cumbersome. I mean we've all at some point signed up for Coinbase it takes seven days to get approved, you have to do extensive KYC onboarding like if I'm getting my sister and my friends from back home to go get onto Coinbase -- it's a lot to ask of them. Not only do they have to take those seven days to get onboarded but they also have to invest their hard earned money into this volatile asset. Then you have to convince them why it's more important, why it's better than any stock, any other investment. We wanted to create a very easy way for both sides of the market, the merchants and the consumers to get onboarded into bitcoin. The sales process for the merchant is positioning and finding out what they were optimizing for. And one of the things that they were optimizing for is sales and how we positioned it as a point system. So I went in and talked to a lot of these merchants and I said this is no different than any point reward system but the only difference of points and Bitcoin is that this is not centrally controlled. Chase controls Chase reserve points, they control how much each point is worth and they control how you spend it. Bitcoin clearly nobody controls and it's just this point system that is universally recognized then I can exchange anywhere in the world and that excited a lot of merchants. So that was how we got a lot of the initial merchants onboard and that was probably how that was how we launched with the first 500. We've since onboarded over 450 merchants since our launch and a lot of those merchants have come onboard because their competitors have made a lot of money and have attracted a whole new group of customers from customers that have started to use Lolli for the rewards platform.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> How much money do you think some of these folks have made?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> We have some power users that have heard thousands of dollars of Bitcoin. There are people like if you use it for work purchases like flights travel, if you're an active shopper online you can earn a lot of Bitcoin like the maximum amout of bitcoin back is I think 45 percent right now on Lolli.com And then the average is 7 percent. So you know do the math.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> How does somebody get 45 percent? Steven how how did you find Lolli like from your experience, you've been a bitcoin fanatic for a while. What made you decide just to get that perspective, I think it'd be interesting.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Steven Zheng<\/span><\/strong> I mean I think I heard of Lolli at Bitcoin meetups. I think I first heard of Lolli at probably Pierre's Bitcoin meetup and the people are just like talking about cool Bitcoin startups and someone mentioned Lolli and they mentioned that Lolli was, I mean you guys launched with Everlane as a partnership. I've always been an Everlane shopper so I checked their site and I realized I can be getting like 9% back.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> How much have you made do you think? [laughs] What about the merchants? What does it look like to convince, what was the company you said?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> Everlane's a great example.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> What does that process look like? How do you explain the value prop of being on a platform like this?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> So Everlane's a really good example for a number of reasons: 1, it's a young cool millennial brand. They really fit actually the ethos of bitcoin because they are all about transparency. You know their entire supply chain you know the marketing dollars that they put in it really gives you transparency into the products like the clothes that you're wearing. You know Steven has some really nice Everlane pants right now. I'm wearing an Everlane shirt you know not to not to shill Everlane too much but...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> This episode's brought to you by Everlane.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> They're a unique partner because they came onboard super early, I think before we even launched and they're not on eBates, they're not on any of these other cashback providers because they don't want to cheapen their brand with coupons but they looked at Bitcoin as fitting the ethos of the future of fashion with transparency and giving the consumer this like elevated experience by earning Bitcoin by learning about financial literacy of this new way of this financial future. So they're very much in line with us and how we convince them is probably just like that brand alignment. I knew that our customer was going to be a much younger customer than an eBates its customer when I was at Ebates their customer has gotten much older it's like the coupon clippers. I think that the younger millennial would rather earn five dollars in bitcoin than five dollars in cash and so they're choosing us over Ebates.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> You really think that? You really think the average millennial would rather get bitcoin than cash?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> I think so yeah.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Steven Zheng<\/span><\/strong> Now you always mention that like education is like the biggest problem in this space right? So how do you convince the average millennial that they should be earning magical digital currencies vs. cashback using one of Ebates Chrome extensions or something?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> Their interest is piqued by by Bitcoin like they've seen on the news they've heard their friends talk about it. It's difficult for them to go you know KYC and go own it but if they can just buy the clothes that they were going to go buy anyway at Everlane or you know choose to buy some clothing and earn bitcoin it makes it a very simple solution for them to choose us over someone else. We're taking the scarce digital asset this you know magic Internet money and giving it to them. And so far since we launched bitcoin has tripled in that time period. So our early users have been rewarded for it. And I think that price is a really interesting aspect of Bitcoin that we can't discount. While I do not think that price is always a good way of educating people because clearly you know it's very a very volatile asset. A lot of people are first attracted to bitcoin because they think oh I can make money. Oh you know you know price goes up, Orange coin goes up and and while that Orange coin goes up it also can go down. But I think a lot of people who are naturally curious they want to know why it's going up why it's going down. And so it is long as they have that twenty five dollars in their Lolli wallet they're like OK well that 25 dollars is now seventy five dollars and that seventy five dollars they ask well why why is it seventy five dollars now? Now we've piqued their interest. And so now they start to pay attention to Bitcoin more and they start to ask more questions and then it's our it's then our duty our responsibility to educate them on why bitcoin is going up or down and why it's important to society.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> That's interesting. And in addition to education I mean we were going through your Twitter before you came here. There's a lot of marketing that goes into it too.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> Marketing, memes -- same thing.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Steven Zheng<\/span><\/strong> Lolli has some of the best memes in this space.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Who's behind the memes?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> I am.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Really? Are you the Tweeter?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Steven Zheng<\/span><\/strong> That's a scoop.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> That is the scoop. I don't think I've shared that yet. I'm surprised no one's asked that.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> How do you come up with memes?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> I've been a you know a curator of dank memes for a while now. So I I feel like it's just you know it's it's part of who I am and that it's part of the culture.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Steven Zheng<\/span><\/strong> On that point the stacking stack's meme has been going around and like Lolli at this point it is almost like synonymous with stacking sats -- that's culture right? When you think of stacking sats you think of Cash App and then you think of Lolli. Has that has helped boost usage?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> Yeah. And I want to give a special shout out to Matt Odell. He came up with that around what we were doing and you know I think I went on Marty and Matt's podcast and I think it might have been it was one of my first podcasts I went on and I think shortly after that he started sharing like stack and sats and our community just like absolutely loved it. And so yeah we you know I feel like I have really owned stack and sats and you know a few have followed that Cash App included. And yeah I love it. I think it creates this meme around what you're doing, it makes it fun. Earning Bitcoin is you know sounds cool but stacking sats sounds way cooler. So yeah we make it really easy to stack sats.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So what percentage of your users I mean obviously you know stacking sats is very much you know part of the native bitcoin community culture if you will but what about new folks. What percentage of users are new to crypto new to Bitcoin and are being introduced to it. Do you have metrics on that?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> We do. And because we are a very privacy focused company we do not track our customers data with like age demographics anything like that we don't request that. And so a lot of it is qualitative. And what we're seeing and like customer support when when people reach out to us and what we're seeing like on other channels outside of twitter or twitter is very much like bitcoin Twitter is a very active part of our user base. But I think like our estimates is it's about it's around 40% of our customers right now are new to Bitcoin. When we first started it was only about 10% of people that were new to Bitcoin. Now we're getting to a point where we are people's first interaction with bitcoin we're their first bitcoin wallet. And that's a really important metric for us very important KPI for us to go from that 10% where we started and ideally I would like it to be 99 percent of our users are new to Bitcoin that's when we're making the market bigger and we're expanding the market to new people. So on bitcoin Twitter we don't need to explain every time we post stacking stas. In other channels we need to explain like stacking sats a.k.a. earning bitcoin to really explain what's Satoshi's are to new users.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> How do you keep people on the wallet that you guys have? That's a very crowded market and there's money to be made. Well not that much money but there's at least some money to be made in the wallet business. What sort of features and services around the wallet do you have so that folks as soon as they earn that 7% or 8% they don't just send it off to somewhere else.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> Yeah. So I think being the the entry point the funnel for a lot of newcomers is really important. So right now you know we are a custodial and while there's a very small percentage of our users are like the bitcoin maximalists that want to transfer money off like right now you know we're holding. Like I can't give an exact amount but like we're holding a small amount of bitcoin for a lot of people. And so a lot of people trust us with their knowledge of say fifty dollars in bitcoin that they've earned from their Everlane purchases from their Hotels.com purchases, travel. And so as they stack sats a lot of people are comfortable. Some of the Bitcoin maximalists they want to transfer out after they've hit that 15 dollar threshold and they want to move it to Wasabi wallet or you know these these non-custodial solutions.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Does that impact your business your bottom line?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> No because if you look at what companies are optimizing for which is I try to do with what people are optimizing for what companies are optimizing for, most wallet providers are optimizing for you to buy bitcoin like Coinbase is optimizing for you to buy. That's why they've optimized for all of these different tokens all these different coins you know quote unquote Shitcoins. And every time that they're optimizing because they want you to transfer in and out of new coins new tokens because they make a transaction fee every time you get into a new token. We're not optimizing for any new tokens. We're just optimizing for you to like make purchases at new retailers that we bring on. I want someone who came to our site and said I want to earn for my trip to California. I want you to stack sats and we make money every time you stack sats. I don't care if you earn in Ethereum or earn in new tokens I want you to like really focus on learning about bitcoin and wanting to value Bitcoin over cash. So we're not really concerned I would say with new tokens whereas other exchanges are. We want to be like the earning rewards wallet we want to be the most active Bitcoin wallet in the space. And that's where that's where our positioning is. How we keep those users over time as we create abstraction layers of banking. How does a bank keep consumers engaged? They offer rewards over time they offer higher interest rates. Right now bitcoin because it's such a volatile asset and because it's an asset that is in such high demand we're in the future able to offer lending to our consumers and abstraction layers of banking that can offer people more ways to stack sats. So you know the next couple months...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So this is just the start because I was going to say it seems more like a service than an actual company right? I mean anyone can get like if Coinbase wallet tomorrow want to implement the same sort of thing they have all these merchant relationships through Coinbase commerce they could say.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> They don't actually, we have more Fortune 1000 merchants than any other Bitcoin company and you can hold me to that","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Fair enough but just the idea that you know it wouldn't be all that difficult to you know not overnight get to 950 but if a wallet provider like a blockchain.com or Coinbase wanted to offer a similar sort of bitcoin earn setup wouldn't that be bad for you?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> Not bad. I mean I think I think more the more people that offer more ways for people to earn and more people to get into the space that fit the same ethos that are focused on Bitcoin. I think is is net good for for the world. We're going to have plenty of competitors any any company that does well is going to have competitors. And I think I know how to execute on this space and I know our product roadmap pretty well that we're just going to keep being the best rewards company and we're generating the most GMV and so merchants are gonna give us the highest percent back.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> What is GMV?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> Sorry. Gross Merchandise Volume.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Steven Zheng<\/span><\/strong> Well it's kind of weird right. Lolli has been pretty successful right now and we haven't really seen any competitors pop up -- not even Ethereum or something like we haven't seen a Lolli version of ether and the Ethereum community seems to be a decent chunk of the crypto community right now.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> We've seen it we've seen a few but...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Bitcoin is 70 percent of the market right now Steven.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> We've seen a few competitors in the Ethereum space and the like alt coin space that have popped up but you can't like the best example I give is like I go back home to North Carolina and I'm like what is Ripple what is Eos what are all these you know coins what did you know. And they don't know what that is. And so if they don't know what that is then then who's going to click on an ad that says earn free Ripple? No one knows what that is. What people do know is they know Bitcoin. And so Bitcoin is the best brand in the space. And I also personally think it's the best asset in the space. That is not U.S. dollar. And so you have to give somebody something of value and you have to hold that standard and you have to build trust with the consumer. If you're going off and giving like you know ether or you know some shitcoin to people and then that shitcoin goes and decreases in value and is like a fifth of what it's worth, the Lolli brand is associated with that whatever you're giving. So far like you know we made a really big bet in saying we're gonna be Bitcoin only. And we've had so many coins that have tried to offer us money to like to go shill their coin.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> What's the most that they've offered?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> A lot. I don't, no comment. Hundreds of thousands of dollars.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Let's talk the product roadmap you mentioned that we're going to go into lending. I didn't know that. Did we talk about that before?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> I haven't talked about that. No.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> How do you plan on going into these different bank services?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> So I personally think it's like whether we do it whether other people do it. What. Well I think the future of Bitcoin is in the need for a cryptocurrency is people taking having this sort of understanding of what a bank is and what money is and the route of money. And if you understand what a bank is you understand that you're giving them a bunch of money and they're making a lot of money off of that money. And so if we sort of take a step back and say well I am my own bank and thus I can be. I can have it be I have an abstraction layer of all of these banking services. How does a bank make money they offer lending they offer loans and so as like if the company that represents the individual being the bank of the future we have to give people an abstraction of those services and then share that with the consumer because we can operate way more efficiently than a bank. You know we're just you know we're we're a small team. We can say let's let's help you lend out money like I think it sells with Celsius network is you know doing is really interesting. I think if you can create abstraction layers of banking we've had several hedge funds reach out to us saying Hey we'll go lend out we'll pool your money and we'll go lend out the bitcoin and we'll give you 8% back. That gets really interesting to our users when we can go create an abstraction layer of their money and then then they start to think well maybe I want more than $50 in my Lolli account maybe I want $5,000 in my Lolli account because I can go earn 5% interest on that as opposed to my .5% interest that I get from my Marcus account my Chase account my Wells Fargo account that's when Bitcoin becomes even more interesting.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Steven Zheng<\/span><\/strong> At this point I guess Lolli is not a faux Custodial Service right?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> We were PCI Level 1 compliant. We we would work with Fortune 100 companies that would trust us with their data, their payments. So we were taking a lot of those same protocols that we learned and became experts in in the payment world, security world with enterprise grade software and applying a lot of those to the Bitcoin world.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Steven Zheng<\/span><\/strong> Just signing onto the Lolli's account doesn't really make you might even prompt it's like to add it to a FA, right. And like you said like 60 or 70 percent of your customers hold bitcoins on Lolli like it's at a current point it's not as secure as let's say holding my bitcoins on Coinbase as a wallet","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> If someone were to log on they can't transfer out your account. We do 2FA on transfers right. Yeah. So there is 2FA but we also want to make it really easy and most you know a lot of people don't realize like you know you can't, someone can like log into someone's account I guess if they got their password got their computer there's like a lot that someone would have to do in order to like actually take somebodies.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Steven Zheng<\/span><\/strong> So if I had got Frank's Lolli account username and password and I log in on my laptop instead of his I can't log into my Lolli account?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> If you could if you hacked Frank's account you can't withdraw the bitcoin you would need a 2FA through your email. Right. Right. Yeah.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Interesting. How do you how do you imagine the app changing. I mean it's obviously going to change the experience but what do you think it could mean tangibly for the business?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> Yes so we're really excited for four to launch our mobile app. What it's gonna do is it's going to take right right now like we've been very focused on providing the best web experience because people spend more on web and there's more trust associated with our wallet because we're holding more when you have higher GMV. You have higher rewards and so people are earning more because they're earning on web and with with mobile it's going to be less about the amount that you're going to be earning and more about daily activities. So creating rituals around stacking sats around Bitcoin. And so it's more like delivery services earning when you go get gas when you go pick up your coffee every morning. I want to create make Bitcoin a part of everybody's daily life and. Right now spending Bitcoin is not part of everyone's daily life but earning Bitcoin could be.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Well you got to get one of those partners where the people use every day like a lyft or an Uber or something.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> That's what we're working on now.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> That would be huge.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> That's what we're focused on now.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> How do you land a big deal like that?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> The same way we've landed over 960 deals like we hustle we get we've known a lot of these partners for a long time and so we know the right people internally at these organizations we've been selling enterprise to you know top merchants for eight years now. And so we're just it's just a new company doing it and a little bit different way.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> And you mentioned you sometimes can leverage the competitive nature between firms to get more out of them in terms of that the amount that they'll give as the read. What's the word. It's not award a reward as reward.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> Yeah. So I mean the way that we got booking.com And we got hotels.com Is because Priceline was doing such an incredible job of attracting new customers and people like all of our users were using Priceline. So then booking.com saw that sort of activity in the cloud that's associated with it and then they joined us and then hotel and booking.com is the number one travel site in the world. And then hotels.com which is the number three travel site in the entire world. They they were interested and then they finally came on board and then they just joined us a few weeks ago. We had a big announcement around it. And then the next you know the next one is we hopefully want to get Airbnb B and vrbo V.R.B.O. dot com and HomeAway same company. They joined our platform very early on and have been extremely successful and they're really competing with themselves. They're like they're saying look like you know we know Airbnb is not onboard but we've seen that this is such a great customer that Lolli is bringing that they want to give us higher rates and so they just went from I think 3 percent to four and a half percent where that's a rate that we've negotiate with them to end up paying our customers more when they shop their site.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Steven Zheng<\/span><\/strong> I'm surprised them. Your partners aren't like using Bitcoin as a marketing tool like like publicly I haven't seen like Everlane or like hotels.com publicly tweet like hey earn bitcoins by shopping at on our site.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> They haven't yet but then you keep in mind they don't advertise Ebates either. So there is Ebates is a five billion dollar company and I don't think almost any merchant has really like advertise it because it cuts into their margin. They're happy to give us these deals when we send them a unique customer but every time that they promote us they're not it's coming out of their margin like ideally they would like to earn 100 percent by bring these customers in. But when they when they you say Everlane were to promote Lolli every single time they're cutting in like you know 10-15% into their margin whereas when we go to bring a customer to them they're willing to give us that 10% 10-15-20% for us to go share that with our consumer","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> The credit card. How how do you get to that point is it through partnerships or is it. Is it something you can go on your own on. Why why not. Why not call up some of these banks J.P. Morgan City and say Hey for your Chase Sapphire we partner with us. And instead of you know for certain users you want to opt into bitcoin instead of cash they could they could do that?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> Yeah we'll probably partner with some sort of bank in order to offer like a secure way of people spending fiat and earning Bitcoin. And it's really about like our whole thing is bringing on new people into the Bitcoin ecosystem. And it's a lot to ask if we were to just launch you know we considered launching you know a year ago with a bitcoin credit card and there have been Bitcoin Credit cards that have come out to my knowledge that have not done super well because they're only serving a bitcoin customer. And if you think about it if I like right now people love their chase reserve card. So you need to offer a best in class solution that is going to be better than their chase reserve card. So the reason why we are waiting to launch that is because we need leverage over merchants to offer to have better deals and to earn more when they use a card. So the next phase is launching a mobile application when we've launched the mobile application we'll be driving GMV to merchants on both web and mobile. Thus like being the best in class reward solution for the merchant. And then we go to all of our users that have now adopted Bitcoin as the best reward system because it's gone up in value or because they've learned about sound money and they really they love it. Then we can go sell internally to go say hey Lolli users like do you guys want a a credit card. Lolli credit card and we're selling to users that have already adopted Bitcoin as the reward. If you just go flat out like a lot of companies have done and be like Oh we're a bitcoin rewards credit card. I'm not giving up my my points like if I'm an average consumer. And also the merchants aren't gonna give you competitive rates to chase because why. Why would they?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> That's interesting. Now that's a great point. When you think about you know you Ebates and and Lolli what what are some of the things about doing this type of business in crypto that's different than in the traditional world of finance and rewards?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> So there's a lot of economies of scale that start to come about like later on. And then there's also ways in which there's just ways in which you can operate more efficiently. Like Ebates literally sends out a big fat check every quarter and you have to wait on it on your cash to get to your front door in a big fat check. That like comes every quarter. And so we can send money seamlessly over the Internet micro transactions for next to nothing. And especially when we start to integrate things like lightning network and we can send transactions anywhere for very low cost. So there's a common scale that happened there. And then when you start to go internationally think about how Ebates has to scale internationally if they want to go to Spain they have to go spin up a bit of a partnership with a Spanish bank to go send a check or to send money to your your account in a locale. Bitcoin is universal I can go send a Spanish customer Bitcoin very very seamlessly. If I had those Spanish partnerships with those Spanish merchants. So it gets really exciting at scale because we basically operate as a very efficient platform for rewards.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> This is this is a question that pertains to to both. You know I'm not 100 percent both traditional rewards and the crypto rewards I'm not super familiar with the space or e-commerce. What happens when you have all of the same companies in an industry on the platform doesn't that remove the value prop if you have you know let's say you know you've got Banana Republic J.Crew and you know the maiden like a main group of competitors on which they all have access to the same customer so what's the benefit at that point of...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> They get to compete of who offers the best rates to for where the consumers want to shop. So if everyone's offering 9% and then gap is offering 12% you might consider getting a black shirt from gap over Everlane. Now you know you do that across like travel and grocery and food delivery and uber verse Lyft and you start to make decisions and in a free market system across the world like most people have choice. You know some people would argue that like this is an incredible way to drive traffic away from from Amazon a lot of merchants look like they are trying to compete with Amazon the entire e-commerce world is trying to compete with Amazon and they're looking at Lolli as a way to compete with Amazon.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Steven Zheng<\/span><\/strong> I mean I already I already canceled my Amazon Prime account because they don't support Lolli.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> And Steven is like a lot of our users like so many of our users have left Prime because Walmart will offer free shipping over thirty five dollars and you get three and a half percent back for your purchase. And so why have prime.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Do merchants in and I keep saying traditional I want to like make that word illegal and in traditional rewards is that the way that companies and merchants who come on those types of platforms view. Do they view them as a weapon against Amazon?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> Yes. So Ebates is an incredible tool for people to compete with Amazon but Ebates is one of the only cashback companies that actually can work with Amazon because of their scale. I email Amazon every single month. We have a good relationship with them and I say how how many how how much revenue we're sending all of their competitors aggregate of course to say like you're losing revenue from this millennial audience that wants Bitcoin. And so eventually they'll join us.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> It can't be that much.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> Millions of dollars.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Millions of dollars.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> Yeah.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Wow. So what did they say?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> We got to get the tens of millions of dollars going I think like you know I tweet Jeff just about you know every every week I feel like I think my last tweet was Jeff you up. He didn't respond.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So that's really interesting. No I appreciate the sort of background into you know that that world. You know at the block and I feel like just crypto in general we're so focused on what Wall Street is doing what you know the big banks are doing. But at the end of the day and I think Steven holds this view it's really companies like Lolli and consumer facing brands that are going to actually drive adoption right as opposed to you know if I'm JP MORGAN We see this or Goldman Sachs and I'm issuing an equity derivative on bitcoin that no one is going to trade. It doesn't really move the needle on anything but if you're getting people to save what you're saying millions of dollars then that that can be impactful to to getting the word out. Do you think it's it's not a smart business move to those all these businesses running out like Flexa I think and others that I think allow you to spend your Bitcoin which is something that you know Steven would never do. What are some of the other businesses that do that, that pay as well. Does that make sense to you?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> No it doesn't.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Is that because you don't view Bitcoin as money. You view it more as.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> Right now Bitcoin is a store of value.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> But it's not a medium exchange.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> It's not yet in the next five to 10 years. I hope that it will be. And and you know maybe there will be something like Libra that will be more of a medium of exchange that will be interoperable with Bitcoin. But as a store of value people want to earn stores of value. They want to earn Bitcoin. And so for that for the foreseeable future we are all about earning because you're earning something that has more value than what you're used to earning. And so that's more exciting to most people. What I think we become is like once we've like let's just put the scenario in five years and you know big pay has been at it for years. There's like tons of payment providers. You know you mentioned flexa. I just don't believe like you know we built a payments company with our last company. That's not the move you in order to convince like I pitched bitcoin to merchants four or five years ago when I first learned about it. They didn't want it. No one. It's not bringing new customers and the it's not bringing enough users that it would affect their credit card fees. When I when when we have when we have millions of users spending tens of millions of dollars hundreds of millions of dollars and I go to Wal-Mart and I say hey Wal-Mart we've driven 100 million dollars in sales. I want to reduce credit card fees and charge backs to zero and that's when they get excited about accepting bitcoin and pay with a Lolli like that's where you have real leverage over merchants. And when you can take a Lolli wallet and you can pay with bitcoin and they're they're excited because they can reduce cross-border charge backs from 10 percent to 0 percent because of immutability of bitcoin that's when they get excited when you can reduce their five billion dollars in credit card fees from five 4 from. Sorry. One point five percent two percent down to next to zero percent. That's when they get excited to accept Bitcoin. And if they can pass those savings back off to the consumer. Imagine like you know Steven knows experience well when you get to Everlane and it says Hey do you wanna earn 9 percent Bitcoin you're like hell yeah of course I do. Imagine when you got to check out at Wal-Mart and it said want to earn an extra 1 percent when you pay with Bitcoin. That's when both parties are incentivized because Wal-Mart's reducing their charge backs reducing their credit card fees down to zero and then Lolli's. You know happy to give more bitcoin back. You've earned bitcoin because you're paying with Lolli because you're paying with bitcoin. That's when the world's shifts from just earning bitcoin to paying with bitcoin.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> And how. That's that's. You're talking about five years out.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> I think it's five years out. I mean you know just yesterday we're seeing congressional hearings and it's looking pretty good it's looking pretty exciting. And so maybe it's sooner than five years were the team to build that. That's that's very similar to the last company we built. We were you know we are part payment gateway part e-commerce gateway. That's going to be a really exciting like a I think product to build with with all.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> And if so you're going into e-commerce you're going into payments you're going into potential banking services what from a regulatory perspective do you have to do to comply only offer those different ranges of business.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> So right now we're technically we we legally do not have to be a money transmitter. We're just earn. We're just in the earning space as soon as people start to buy and sell bitcoin then we become a money transmitter. We were intentionally not getting into that space. We want to grow as fast as possible and we want as many users to earn as much Bitcoin as possible in the easiest way. So as soon as we become a money transmitter we have to add KYC. That's when it becomes more difficult. But for the foreseeable future we just want people to have the easiest app that they can share with their family and friends with minimal to no KYC.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Which business do you think is more profitable between rewards and payments?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> Visa is what a hundred and fifty billion dollar company in Ebates is a five billion dollar company. Well I want to be visa.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Yeah well you want to be both.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> Yeah but yeah you could make a strong argument that Visa's a bigger and better company than Ebates it's I want to be I'd rather be visa but instead of being on fiat rails I'd rather be on a visa on bitcoin rails giving rewards anywhere in the entire world in bitcoin and eventually using Bitcoin as a payment network anywhere in the world. I think that's a more beautiful world. I think that's a better world.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Steven Zheng<\/span><\/strong> Why did Lolli start with on the Rewards front versus like being someone like BlockFi start on the lending where you already are kind of embedded in to that finance world.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> Because of merchant adoption. I love BlockFi I think BlockFi is a great company. I think there's a strong team. I'm totally okay with giving up assets under management that's not important for me. I would rather have 10 million 20 dollar wallets over 20 million dollars in assets for 5000 users. The way that bitcoin is going to take off is when is when we reach hyper Bitcoinization and you have more users that have adopted Bitcoin as their preferred store of value and the next preferred medium of exchange. And you only get that when you have the like a easy to use app like my mom is not going to go put there her money in a like in BlockFi. Like I just do not think that's going to happen yet. So I think BlockFI is awesome. I think they're doing the right things. We're just going after very different a very different customer.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Steven Zheng<\/span><\/strong> So it's almost like a square move, square started off with their swiping credit card thing where merchants get all those merchants on their platform and now they're doing it like lending we're going to lend to small businesses.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> Cash App and Squares like I think one of most brilliant companies I mean it's my favorite stock I own.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> They're also the sponsor of this podcast.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> Oh no. So Cash App yeah really great way to stack sats right behind Lolli. Great way to stack sats.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> What what's what's the impediment towards allowing Eth heads to get some eth rewards when they shop at Wal-Mart etc..","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> I totally believe in a free market. I want people to be able to earn whatever they want. And if you want to use bitcoin to go you can do anything you want with your bitcoin you can go buy eth if you want it. I think that the most important thing in this space is bringing new people into crypto in general and the way to do that is not to offer them a thousand coins. It's to offer them one coin. Like one thing that makes sense to them and that's very easy for them to understand. And right now the thing that's like on the news and the thing that has served society already has with immense value is Bitcoin. Everything else is like up for debate if it's going to be around in the next five to 10 years. And if it's going to serve society ask is this is going to add value to society.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Well thank you. I think Steven agrees.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Steven Zheng<\/span><\/strong> Trump didn't tweet ethereum or other cryptocurrencies he tweeted bitcoin.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> Very true.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Well thank you Alex so much for coming on. We appreciate your time and we hope to have you again soon.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Alex Adelman<\/span><\/strong> Thanks for having me."," 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"20 million dollars","content":"MONEY"},{"type":"8%","content":"PERCENT"},{"type":"$50","content":"MONEY"},{"type":"Rakuten","content":"ORGANIZATION"},{"type":"Amazon","content":"LOCATION"},{"type":"Ebates","content":"LOCATION"},{"type":"10%","content":"PERCENT"},{"type":"Steven Zheng","content":"PERSON"},{"type":"45 percent","content":"PERCENT"},{"type":"Lolli","content":"LOCATION"},{"type":"New York","content":"LOCATION"},{"type":"7 percent","content":"PERCENT"},{"type":"to four and a half","content":"DATE"},{"type":"Jeff","content":"PERSON"},{"type":"Alex Adelman","content":"PERSON"},{"type":"Chaparro","content":"PERSON"},{"type":"Alex Adelman<\/span><\/strong> Marketing","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"five dollars","content":"MONEY"},{"type":"7%","content":"PERCENT"},{"type":"Ebates","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"hotels.com","content":"LOCATION"},{"type":"Steven Zheng<\/span><\/strong> Wow","content":"PERSON"},{"type":"Alex","content":"PERSON"},{"type":"Frank Chaparro<\/span><\/strong> Interesting","content":"ORGANIZATION"},{"type":"California","content":"LOCATION"},{"type":"Gross Merchandise Volume","content":"ORGANIZATION"},{"type":"10 percent","content":"PERCENT"},{"type":"0 percent","content":"PERCENT"},{"type":"Matt","content":"PERSON"},{"type":"Frank","content":"ORGANIZATION"},{"type":"100 million dollars","content":"MONEY"},{"type":"12%","content":"PERCENT"},{"type":"Chaparro<\/span><\/strong> Bitcoin","content":"PERSON"},{"type":"70 percent","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":".5%","content":"PERCENT"},{"type":"J.P. Morgan City","content":"ORGANIZATION"},{"type":"Priceline","content":"ORGANIZATION"},{"type":"fifty dollars","content":"MONEY"},{"type":"10 million 20 dollar","content":"MONEY"},{"type":"millions of dollars","content":"MONEY"},{"type":"5000","content":"DATE"},{"type":"10% 10-15-20%","content":"PERCENT"},{"type":"9%","content":"PERCENT"},{"type":"1 percent","content":"PERCENT"},{"type":"KPI","content":"ORGANIZATION"},{"type":"100 percent","content":"PERCENT"},{"type":"Steven Zheng<\/span><\/strong> Lolli","content":"PERSON"},{"type":"Matt Odell","content":"PERSON"},{"type":"North Carolina","content":"LOCATION"},{"type":"25 dollars","content":"MONEY"},{"type":"Walmart","content":"ORGANIZATION"},{"type":"Frank Chaparro<\/span><\/strong> Wow","content":"ORGANIZATION"},{"type":"last seven years","content":"DATE"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"},{"type":"fifty billion dollar","content":"MONEY"},{"type":"Everlane","content":"LOCATION"},{"type":"Chaparro<\/span><\/strong> Lolli","content":"PERSON"},{"type":"seventy five dollars","content":"MONEY"},{"type":"Banana Republic J.Crew","content":"ORGANIZATION"},{"type":"9 percent","content":"PERCENT"},{"type":"Park Place","content":"ORGANIZATION"},{"type":"Pierre","content":"PERSON"},{"type":"Spotify","content":"LOCATION"},{"type":"15%","content":"PERCENT"},{"type":"tens of millions of dollars hundreds of millions of dollars","content":"MONEY"},{"type":"Everlane","content":"ORGANIZATION"},{"type":"Steven","content":"PERSON"},{"type":"Satoshi","content":"PERSON"},{"type":"Marty","content":"ORGANIZATION"},{"type":"tens of millions of dollars","content":"MONEY"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Custodial Service","content":"ORGANIZATION"},{"type":"Alex Adelman<\/span><\/strong> Everlane","content":"PERSON"},{"type":"Hotels.com","content":"LOCATION"},{"type":"FA","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Wells Fargo","content":"ORGANIZATION"},{"type":"Macy's","content":"ORGANIZATION"},{"type":"Ebates","content":"PERSON"},{"type":"Google","content":"ORGANIZATION"},{"type":"Lolli","content":"PERSON"},{"type":"Steven Zheng<\/span><\/strong> Trump","content":"PERSON"},{"type":"Spain","content":"LOCATION"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"Airbnb","content":"ORGANIZATION"},{"type":"$5,000","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"five percent two percent","content":"PERCENT"},{"type":"Millions of dollars","content":"MONEY"},{"type":"Matt Senter","content":"PERSON"},{"type":"Airbnb B","content":"ORGANIZATION"},{"type":"3 percent","content":"PERCENT"},{"type":"99 percent","content":"PERCENT"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"twenty five dollars","content":"MONEY"},{"type":"five billion dollars","content":"MONEY"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Alex Adelman<\/span><\/strong> Visa","content":"PERSON"},{"type":"Steven Zheng<\/span><\/strong> Well","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","Steven Zheng","The Block"]}