{"summary":"Forta launched delegated staking of its token forta (FORT) to incentivize more participants to contribute to its threat monitoring services.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215692\/forta-network-adds-token-staking-to-boost-blockchain-security-monitoring","publishDate":"2023-02-28T09:50:02","id":4298,"type":null,"title":"Forta network adds token staking to boost blockchain security monitoring","category":["CRYPTO ECOSYSTEMS"],"content":["Security protocol Forta launched delegated staking of its native ERC-20 token forta (FORT) to incentivize more participants to contribute to its threat monitoring services.","The move allows any FORT holder to delegate their stake to node operators on the threat monitoring network and earn rewards. Previously, only node operators could earn rewards for staking their FORT tokens, which they were required to put up as collateral to run the node.","This change is aimed at strengthening the incentives of Forta Network's monitoring network, which is used to automatically detect vulnerabilities in smart contracts. Forta has an automation network leveraging data analytics models to look for vulnerabilities across thousands of smart contracts.","The network provides real-time detection services and security monitoring across multiple blockchains, including DeFi and NFT-based apps. Forta is community-run and supervises over $36 billion of total value locked across major DeFi protocols for anomalous on-chain activity.","Forta's move to enhance its security monitoring services is a timely one. The total amount of funds lost in crypto in 2022 has exceeded <a href=\"https:\/\/www.theblock.co\/post\/196941\/the-biggest-crypto-hacks-of-2022\" data-v-f87c67ca=\"\">$3 billion<\/a>, with over 95% of that amount lost through smart contract hacks. A spokesperson for Forta said, \"As more users stake and its number of nodes and node pools actively scanning blockchain networks for security threats increase, Forta’s monitoring network grows even smarter and stronger.\"","Launched in 2021 and backed by a16z, Forta protects the critical infrastructure of Web3 through a decentralized and community-run network, which serves as an early warning system to projects and protocols across the ecosystem. Forta's delegated staking feature is expected to further improve the network's capabilities and incentivize more participants to contribute to the safety and security of the crypto space.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Forta","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$3 billion","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"20","content":"DATE"},{"type":"FORT","content":"ORGANIZATION"},{"type":"Forta Network","content":"ORGANIZATION"},{"type":"$36 billion","content":"MONEY"},{"type":"95%","content":"PERCENT"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}