{"summary":"Sherlock is raising $100 million in USDC tokens through a five-day event set to premiere on March 7th at 4 pm UTC.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/136200\/defi-security-provider-sherlock-aims-to-raise-100-million-in-token-round","publishDate":"2022-03-03T07:39:45","id":4299,"type":null,"title":"DeFi security provider Sherlock aims to raise $100 million in token round","category":["DEFI"],"content":["Sherlock, a startup that promises to protect crypto projects from smart contract hacks, is looking to raise $100 million in a public funding round next week.&nbsp;","The project will open its six-day fundraising window on March 7 at 4 pm UTC, according to <a href=\"https:\/\/mirror.xyz\/0xE400820f3D60d77a3EC8018d44366ed0d334f93C\/gGYTGbtXzvBEjpzIazcw6aZL1X2P_Id2pje7B7eCX-Q\" data-v-f87c67ca=\"\">an announcement.<\/a> This follows a previous $30 million guarded launch through a whitelisted round.","Sherlock is a security solution for protocols. It connects crypto projects with external audit firms and Sherlock's own security teams, nicknamed Watsons — along with providing tools for smart contract coverage for exploits and bounties on bugs.","Sherlock's token round will operate on a first-come, first-served basis. It will see the total USDC be split between the Sherlock staking pool and the Sherlock treasury, with 90% going to the former. After six months, funds in the staking pool will be rewarded with 1 SHER token for every 10 USDC staked. The remaining 10% in USDC is locked in Sherlock's treasury and cannot be returned to investors.&nbsp;","The protocol says that this token-based round will allow not only venture capitalists and angel investors to participate in the governance of the Sherlock system but also theoretically allow anybody to invest in Sherlock. As long as a user has a WalletConnect-compatible Wallet and at least $250 in ETH as a reserve, they can participate in the round. The specific individuals and investment firms who might invest in the round, however, are yet to be announced.&nbsp;","The fundraising follows a spree of similar token-based rounds. The non-profit Luna Foundation Guard, for example, <a href=\"https:\/\/www.theblockcrypto.com\/post\/134871\/luna-founation-guard-token-sale\" data-v-f87c67ca=\"\">raised $1 billion<\/a> last month through a sale of its native token LUNA in a round led by Jump Crypto and Three Arrows Capital.&nbsp;","Sherlock didn't immediately reply to a request from The Block for further details on the fundraising.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Sherlock","content":"LOCATION"},{"type":"Luna Foundation Guard","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$30 million","content":"MONEY"},{"type":"Sherlock","content":"PERSON"},{"type":"Three Arrows Capital","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"March 7","content":"DATE"},{"type":"$250","content":"MONEY"}],"hashtag":["PROTOCOLS"],"authors":["Tom Matsuda","The Block"]}