{"summary":"TNSR enables Tensor fee discounts, allows holders to submit governance proposals and provides payment for independent security reviews. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287028\/tensor-foundation-launches-governance-token-tnsr","publishDate":"2024-04-08T12:32:06","id":43,"type":null,"title":"Tensor Foundation launches governance token TNSR","category":["WEB3"],"content":["The Tensor Foundation, the organization developing the Solana NFT marketplace Tensor, launched its governance token TNSR.&nbsp;&nbsp;","The move helps implement community governance, giving TNSR holders control over Tensor's parameters and fee discounts when using TNSR in transactions on Tensor, the foundation <a href=\"https:\/\/twitter.com\/TensorFdn\/status\/1777350389911736590\" data-v-f87c67ca=\"\">wrote<\/a> on the social media platform X. Specifically, listings created in TNSR will have their protocol fee lowered by 25%. Users have until Oct. 5, 2024, to claim their tokens.&nbsp;","TNSR has a 1 billion token supply. The initial airdrop comprises 12.5% of the token supply, with 55% or 550,000,000 TNSR allocated for the community. Core contributors will get 27% of the total supply. The remaining 18% is split between future fundraising endeavors as well as investors and advisors.&nbsp;","Tensor teased that it would <a href=\"https:\/\/www.theblock.co\/post\/282066\/solana-nft-marketplace-tensor-issuing-tnsr-governance-token\" data-v-f87c67ca=\"\">launch<\/a> its token nearly a month prior but provided few details at the time. The token can be used throughout Tensor protocols, including the Tensor NFT marketplace, Tensor automated market maker, Tensor escrow and others.","Governance token ownership determines how users submit Tensor governance proposals for community input on Realms, a Solana-based platform that helps organizations manage their DAOs.&nbsp;","\"Once the proposal has been sufficiently discussed on the forum, addressing all questions and concerns, it can be submitted for voting on Realms. Any community member with a sufficient quantity of delegated tokens is able to submit the proposal,\" the Tensor Foundation wrote in a <a href=\"https:\/\/docs.tensor.foundation\/governance\" data-v-f87c67ca=\"\">post<\/a> explaining its governance. \"Voting is proportional to the TNSR balance that a wallet holds. In order to vote, a token holder must deposit their tokens into Realms, or receive delegated tokens from another wallet.\"","Users need 250,000 TNSR to create a proposal, which must accrue 10 million to pass.&nbsp;","In addition to proposals, TNSR also facilitates payments for seven third-party, \"prominent\" Solana developers to review Tensor protocols for malicious proposals or other harmful governance attacks. Each security council member receives $1,000 worth of the governance token monthly for their security review.&nbsp;","Tensor is an NFT marketplace that aims to be the \"Blur of Solana\" and prioritizes <a href=\"https:\/\/www.theblock.co\/post\/217651\/tensor-the-blur-of-solana-raises-3-million-in-seed-funding\" data-v-f87c67ca=\"\">pro traders<\/a>.&nbsp;Tensor amassed $2.08 million in daily trading volume on April 5, <a href=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/nft-overview\" data-v-f87c67ca=\"\">The Block's Data Dashboard shows.<\/a>&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/marketplaces\/solana-nft-marketplace-volume\/embed?granularity=daily\" title=\"Solana NFT Marketplace Volume\" width=\"100%\" data-mce-fragment=\"1\" data-v-f87c67ca=\"\"><\/iframe>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"$2.08 million","content":"MONEY"},{"type":"1 billion","content":"MONEY"},{"type":"April 5","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Solana NFT","content":"ORGANIZATION"},{"type":"$1,000","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"55%","content":"PERCENT"},{"type":"12.5%","content":"PERCENT"},{"type":"18%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"27%","content":"PERCENT"},{"type":"Tensor","content":"ORGANIZATION"},{"type":"Oct. 5, 2024","content":"DATE"},{"type":"TNSR","content":"ORGANIZATION"},{"type":"Tensor Foundation","content":"ORGANIZATION"},{"type":"Solana","content":"LOCATION"},{"type":"Tensor NFT","content":"ORGANIZATION"}],"hashtag":["SOLANA","TOKENIZATION"],"authors":["MK Manoylov","The Block"]}