{"summary":"BitDAO had asked Alameda Research to provide on-chain proof that it had not sold the 100 million bit tokens it received last year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/184120\/alameda-provides-proof-it-holds-100-million-bit-tokens-after-bitdao-query","publishDate":"2022-11-08T07:33:07","id":4301,"type":null,"title":"Alameda provides proof it holds 100 million bit tokens after BitDAO query","category":["THE BLOCK"],"content":["Under pressure crypto trading firm Alameda Research provided proof it still holds 100 million bit tokens it received in a swap agreement with BitDAO after a request for clarification from the one of the world's largest investment DAOs.","The tokens — worth about $39 million at current prices — have been moved to a designated wallet, BitDAO <a href=\"https:\/\/twitter.com\/BitDAO_Official\/status\/1589929568613597185?t=Qnphn8hcNZ8c1yiyK3V1tA&amp;s=19\" data-v-f87c67ca=\"\">tweeted<\/a>,&nbsp;backtracking from an earlier allegation that Alameda&nbsp;had sold in contravention of a three-year lock-up.","Alameda and FTX, a trading firm and crypto exchange both founded by Sam Bankman-Fried, have come under pressure this week after Binance CEO Changpeng Zhao tweeted that Binance would beginning selling its holdings of FTT, FTX's token. Zhao cited “recent revelations” for the decision — seemingly a reference to a CoinDesk report that revealed details of Alameda’s balance sheet.&nbsp;","The swap agreement from 2021 saw BitDAO receive almost 3.4 million FTT in exchange for 100 million of its bit tokens. Both parties agreed that they would not sell the tokens for three years.","BitDAO issued a proposal earlier on Tuesday asking that Alameda provide on-chain proof it had not sold the bit tokens. This request came after the price of bit declined by over 20% in less than an hour. BitDAO gave Alameda 24 hours to respond after which the DAO would decide what to do with the FTT tokens.","Alameda CEO Caroline Ellison responded to the query on Twitter, stating that Alameda was not responsible for the token sale and promising it would provide proof of funds to allay fears.","On-chain <a href=\"https:\/\/etherscan.io\/address\/0x84d34f4f83a87596cd3fb6887cff8f17bf5a7b83#tokentxns\" data-v-f87c67ca=\"\">data<\/a> from Etherscan show multiple bit token inflows from sources including FTX and Coinbase. These inflows are to a wallet address linked to Alameda and they total 100 million bit tokens.","“For community confidence, we recommend that the swapped bit and FTT remain held in our respective on-chain addresses until the end of the no-sale commitment period,” BitDAO tweeted today, while thanking Alameda for its \"prompt response.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"FTT","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Twitter","content":"DATE"},{"type":"Alameda","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Binance","content":"ORGANIZATION"},{"type":"100 million","content":"MONEY"},{"type":"$39 million","content":"MONEY"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}