{"summary":"Digital Distro will focus on film, music and brand consulting. It may add back web3 consulting services if the industry becomes more stable.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/205081\/web3-media-consultant-digital-distro-removes-web3-from-services-as-bear-market-trudges-on","publishDate":"2023-01-24T11:03:53","id":4302,"type":null,"title":"Media consulting firm Digital Distro removes web3 from its services","category":["COMPANIES"],"content":["Digital Distro, which describes itself as a full service web3 consulting company, intends to remove web3 from its roster of consulting services.&nbsp;","The web3 services Digital Distro offered included education on the crypto market and ways for clients to incorporate blockchain-based products into their projects to create a \"digital media experience.\" However, the firm will not pursue any projects that incorporate NFTs, blockchain or crypto until the industry becomes more stable. It's one of the first firms to cut web3 products after the bear market and legal maelstrom of 2022.&nbsp;","\"Given that the NFT and crypto space is still early on its development and has been filled with uncertainty, we feel that it is in the best interest of our shareholders to focus on film, music, and brand influence,\" Digital Distro CEO Andrew Lane said in a release.&nbsp;","Digital Distro provides full suite of pre- and post-production services for media professionals, including sets, casting, music production and branding strategies. The firm did not immediately respond to The Block's request for comment.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Andrew Lane","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Digital Distro","content":"ORGANIZATION"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}