{"summary":"Following Ethereum&#x27;s Shapella upgrade, the price of ether is only increasing — but $2.2 billion in ETH awaits withdrawal.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/226356\/ethereum-pending-withdrawals-2-billion","publishDate":"2023-04-14T01:39:01","id":4306,"type":null,"title":"Ether price tops $2,100 as Ethereum&#x27;s pending withdrawals hit $2.2 billion","category":["LAYER 1S"],"content":["The price of Ethereum's native coin, ether, is up roughly 10% over the past 24 hours and is trading above $2100 on various crypto exchanges.","At the same time, the total amount of ether (including rewards) that has been confirmed to withdraw — meaning its&nbsp;status changed to 0x01 — has <a href=\"https:\/\/token.unlocks.app\/ethereum-shanghai\" data-v-f87c67ca=\"\">surpassed<\/a> $2 billion. As of 1 a.m. EDT, 1.07 million ETH, worth $2.27 billion, is pending withdrawal, per data tracking application tokens.unlock.","Over the next 11 hours, an estimated 53,050 ether, totalling $111.81 million, is slated to be withdrawn — creating an average of $223.54 million ETH withdrawn daily.","<span data-v-f87c67ca=\"\">The price of ether has increased to over $2100. Source: TradingView<\/span>","17.39 million ether (excluding earned rewards) remains deposited — worth $36.54 billion. This deposited ETH accounts for 15.42% of the total supply.","The net staking balance yesterday — calculated by subtracting the total amount of ether withdrawn from the total amount of Ether deposited — is actually positive. Partial withdrawals amount to 14,300 and deposits amount to 18,370. This means that some 4,070 more ETH was deposited than withdrawn.","The net staking balance since the Shapella hard fork went live is nearly -140,000. Withdrawn ether amounts to 247,820, while deposited ETH is less than half of the withdrawn amount at 107,790 coins.","<span data-v-f87c67ca=\"\">The amount of ether withdrawn hourly has slightly decreased at a steady rate. Source: token.unlocks.app<\/span>","The most-notable unstaker of ether is likely the centralized exchange Kraken, which <a href=\"https:\/\/www.theblock.co\/post\/226292\/kraken-set-to-unstake-more-than-1-billion-worth-of-eth-after-shapella-upgrade\" data-v-f87c67ca=\"\">initiated<\/a> withdrawal requests totaling over 551,000 ETH ($1 billion).&nbsp;Driving Kraken's unstaking efforts is its settlement of charges from the U.S. Securities and Exchange Commission for allegedly failing to register its staking program in the country — for which Kraken agreed to pay a $30 million fine.","On the other end of the spectrum, one peer-to-peer staking pool <a href=\"https:\/\/twitter.com\/ArkhamIntel\/status\/1646817566810165248\" data-v-f87c67ca=\"\">deposited<\/a> nearly 50,200 ether yesterday.","Ethereum's Shapella upgrade — the first major change since last year's Merge transitioned the protocol to a proof-of-stake consensus mechanism — went live just before 6:30 p.m. EDT on April 12 at block height 6209536.","The Shapella hard fork <a href=\"https:\/\/www.theblock.co\/post\/226036\/ethereum-shapella-upgrade-goes-live\" data-v-f87c67ca=\"\">implemented<\/a> Ethereum Improvement Proposal 4895 — effectively allowing users and validators to withdraw their staked ether.","Secondarily, the Shapella upgrade also optimizes Ethereum gas fees on certain transactions.","<i data-v-f87c67ca=\"\">Updated with an additional price chart, information about Kraken's unstaking efforts and a large peer-to-peer staking pool&nbsp;depositor.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"1 a.m. EDT","content":"TIME"},{"type":"$111.81 million","content":"MONEY"},{"type":"TradingView","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"6:30 p.m. EDT","content":"TIME"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"April 12","content":"DATE"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"$30 million","content":"MONEY"},{"type":"$223.54 million","content":"MONEY"},{"type":"$2100","content":"MONEY"},{"type":"15.42%","content":"PERCENT"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"$2.27 billion","content":"MONEY"},{"type":"$36.54 billion","content":"MONEY"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"$2 billion","content":"MONEY"}],"hashtag":["ETHEREUM"],"authors":["Adam James","The Block"]}