{"summary":"Nishad Singh was charged Tuesday by the SEC for “his role in a multiyear scheme” to defraud investors in the crypto exchange FTX.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215880\/ftx-nishad-singh-charged-by-sec","publishDate":"2023-02-28T13:28:25","id":4308,"type":null,"title":"Former FTX exec Nishad Singh charged by the SEC for defrauding investors","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">A former director of engineering at FTX was “an active participant” in a plan to deceive FTX’s investors and went so far as to withdraw millions from FTX for his personal use, the Securities and Exchange Commission alleged. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Nishad Singh was charged Tuesday for “his role in a multiyear scheme” to defraud investors on the crypto exchange FTX, according to an SEC statement. That exchange filed for bankruptcy protection in November and its former CEO Sam Bankman-Fried is facing criminal and civil charges. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">According to the SEC, Singh was “an active participant” in a plan to deceive FTX’s investors. Singh went so far as to withdraw about $6 million from FTX for his personal use including a “multi-million dollar house and donations to charitable causes.”&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Singh consented to a “bifurcated settlement” regarding the SEC charges, which awaits a court’s approval. Earlier on Tuesday Singh reportedly pleaded guilty to separate criminal charges brought by federal prosecutors.&nbsp;<\/span>","The Commodity Futures Trading Commission also charged Singh with “fraud by misappropriation and aiding and abetting fraud.” Singh did not contest the agency’s claims and “agreed to the entry of a proposed consent order of judgment as to his liability on the charges in the complaint,” per a statement from the commodities regulator.","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC said Singh also created software code that allowed FTX customer funds to go to Alameda Research, a crypto hedge fund founded by Bankman-Fried and Gary Wang. That was done “despite false assurances by Bankman-Fried to investors that FTX was a safe crypto asset trading platform with sophisticated risk mitigation measures to protect customer assets and that Alameda was just another customer with no special privileges,” a statement from the SEC said. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Singh knew or should have known that those statements were misleading, the agency said. &nbsp;<\/span>","At one point in 2021, Bankman-Fried noticed that FTX was $50 million short of his $1 billion annual revenue goal and so told Singh to “transfer funds from another entity that he controlled, and to falsely characterize the $50 million as revenue that FTX earned throughout 2021,” the SEC said in its complaint. “Singh then backdated a series of fraudulent transfers, and later lied to auditors about the transfers and created false documentation to support those lies,” the SEC claims.","Singh also became concerned about Alameda’s liability to FTX, among other factors that would jeopardize both firms’ financial stability. Singh opposed some of the exchanges “ambitious” projects that didn’t have enough resources, money spent extravagantly on marketing and the firm’s acquisitions, the SEC said.","“Nevertheless, despite these concerns, Singh continued to work at FTX and to support Bankman-Fried,” the SEC's filing reads.&nbsp;","Alameda and FTX shared office space, personnel, technology, intellectual property and other resources, including some personnel and resources that Singh supervised, the CFTC claimed. This was all despite assurances that Alameda and FTX were separate entities.","When FTX began to collapse, Ellison held a meeting with Alameda staff and said she, Bankman-Fried and others had decided to use FTX customer assets to pay Alameda’s debts and that Singh and Wang knew about that. Most Alameda employees resigned soon after the meeting, according to the CFTC’s complaint.","Singh's cooperation is another major coup for regulators and prosecutors in their ongoing cases against Bankman-Fried. Ellison and Wang have already pleaded guilty or settled in their respect criminal and civil cases.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">“We allege that this was fraud, pure and simple: while on the one hand FTX touted its supposed effective risk mitigation measures to investors, on the other Mr. Singh and his co-defendants were stealing customer funds using software code Mr. Singh helped create,” said Gurbir Grewal, director of the SEC’s Division of Enforcement, in a statement released with news of the complaint.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The U.S. Attorney’s Office for the Southern District of New York also announced charges against Singh in parallel actions. Singh pleaded guilty to six criminal charges brought by SDNY prosecutors in a court hearing on Tuesday, according to Reuters.<\/span>","<em data-v-f87c67ca=\"\">Updated with additional information on CFTC and SEC charges and complaint details.&nbsp;<\/em>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ellison","content":"PERSON"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"U.S. Attorney’s Office","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Gurbir Grewal","content":"PERSON"},{"type":"$6 million","content":"MONEY"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Nishad Singh","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Alameda","content":"PERSON"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Bankman","content":"PERSON"},{"type":"SDNY","content":"ORGANIZATION"},{"type":"Gary Wang","content":"PERSON"},{"type":"the Southern District of New York","content":"ORGANIZATION"},{"type":"Singh","content":"PERSON"},{"type":"SEC’s Division of Enforcement","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":["FTX","LAWSUITS","SEC"],"authors":["Sarah Wynn","The Block"]}