{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley. They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/23825\/garrison-v-ringgold-case-continues-as-judge-denies-defendants-motion-to-dismiss","publishDate":"2019-05-19T08:00:21","id":4309,"type":null,"title":"Garrison v. Ringgold case continues as judge denies defendant&#x27;s motion to dismiss","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/law.justia.com\/cases\/federal\/district-courts\/california\/casdce\/3:2019cv00244\/614098\/16\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\" data-href=\"https:\/\/law.justia.com\/cases\/federal\/district-courts\/california\/casdce\/3:2019cv00244\/614098\/16\/\" data-v-f87c67ca=\"\">Link to order<\/a>","We have a new order in the Garrison v. Ringgold case. If you do not recall, this case was&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/medium.com\/crypto-caselaw-minute\/crypto-caselaw-minute-22-2-7-2019-58b1353dc6b0\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/medium.com\/crypto-caselaw-minute\/crypto-caselaw-minute-22-2-7-2019-58b1353dc6b0\" data-v-f87c67ca=\"\">covered<\/a>&nbsp;in the Crypto Caselaw Minute back in February where I revealed that I was a Grandparent Maximalist. That is still true. My grandparent maximalism that is. Okay, what are we talking about? A yes, a new order from the judge in the case.","A quick refresher of some of the relevant allegations in this case. In no particular order, the Garrisons allegedly lost over $800k that they had invested with Ringgold in his venture based on promises and representations he made to them. After the lawsuit was filed the defendants understandably filed a motion to dismiss the case, the plaintiffs filed an opposition, and the defendants filed a reply. The judge has now ruled on the motion to dismiss and grants it in part and denies it in part. Why?","A defendant may argue to a court that what they are being sued for in essence doesn’t make sense, because they claim that the plaintiffs failed state adequate reasons for the suit, or the plaintiffs didn’t meet the particular requirements under their legal theory of the case.","Here, the Court dismissed the parts of the motion to dismiss which claimed that the plaintiffs didn’t supply adequate factual allegations concerning the alleged securities violations as well as the financial abuse of an elder allegation. The Court also ruled on whether the plaintiffs failed to join a necessary party to the lawsuit in this case to enable complete relief. Who is the necessary party you ask? BitcoNNNNNNNNNNEEEEECCCTTTTTT!","Basically, the defendants tried to claim that because Bitconnect was not a party to the lawsuit the lawsuit should be dismissed. The Court was having none of that and dismissed that part of the motion as well. So, what did the Court grant? Well, the Court, in accordance with established federal law, on its own has decided that the plaintiffs may amend their initial complaint against the defendants. The plaintiffs did not seek leave to amend, but now they may if they wish to change the lawsuit. This is not the end of this lawsuit.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part III of this week's analysis, Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$800k","content":"MONEY"},{"type":"the Court","content":"ORGANIZATION"},{"type":"Garrison v. Ringgold","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Ringgold","content":"PERSON"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"Bitconnect","content":"PERSON"},{"type":"SDP","content":"ORGANIZATION"},{"type":"Palley","content":"PERSON"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"}],"hashtag":[],"authors":["Nelson Rosario","The Block"]}