{"summary":"Rep. Patrick McHenry, R-N.C., is urging Treasury Secretary Janet Yellen to issue clearer digital asset reporting rules in a major infrastructure law that passed last year.\nMcHenry, the incoming chair of the House Financial Services Committee, called on Yellen to issue rules around the “poorly drafted” section of the law and delay any compliance requirements.","author":["Stephanie Murray","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195554\/key-republican-presses-yellen-to-issue-digital-asset-reporting-rules","publishDate":"2022-12-15T17:50:36","id":431,"type":null,"title":"Key Republican presses Yellen to issue digital asset reporting rules ","category":["Policy"],"content":["Rep. Patrick McHenry is urging the Treasury Department to issue clearer digital asset reporting rules as part of last year’s infrastructure bill and delay compliance requirements for the new rules.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The North Carolina Republican called the section of the Infrastructure Investment and Jobs Act that broadly defined brokers of digital assets to increase tax collection from crypto transactions “poorly drafted” and warned it could be “wrongly interpreted as expanding the definition of a ‘broker’ beyond custodial digital asset intermediaries.” He filed his own bill last year to change digital asset reporting provisions in the infrastructure package.","“These provisions were the subject of much debate. Any rulemaking or guidance that fails to appropriately interpret these provisions will damage the privacy of American taxpayers and stifle innovation through rising compliance costs and unnecessary regulatory burdens,” McHenry, the <a href=\"https:\/\/www.theblock.co\/post\/193123\/pro-fintech-republican-mchenry-officially-named-next-house-financial-services-chair\" data-v-f87c67ca=\"\">incoming<\/a> chair of the House Financial Services Committee, wrote in a <a href=\"https:\/\/republicans-financialservices.house.gov\/uploadedfiles\/2022-12-14_rm_mchenry_letter_to_yellen_final.pdf\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">letter<\/span><\/a> addressed to Treasury Secretary Janet Yellen.","The crypto industry lobbied unsuccessfully to tweak the definition of a broker in the infrastructure bill&nbsp;President Joe Biden signed last year, <a href=\"https:\/\/www.theblock.co\/linked\/114079\/senate-passes-trillion-dollar-infrastructure-bill-with-unamended-crypto-tax-language\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">arguing<\/span><\/a> that it could encompass a variety of digital asset-related entities that would struggle to comply with the law. Treasury has committed to not applying the legal language as broadly as it could, in order to assuage industry fears of onerous requirements for miners or other ecosystem participants. But interpretations can change when departmental leadership turns over.&nbsp;","“We urge Treasury to immediately publish the rules directed under Section 80603 and delay the effective date of Section 80603 to allow market participants to conform to any new requirements,” McHenry, the incoming chair of the House Financial Services Committee, wrote in a letter addressed to Treasury Secretary Janet Yellen.","The new law also directs the Treasury Department to incorporate digital assets into the definition of tax collection and reporting purposes, which McHenry says is a privacy concern. The Treasury Department did not immediately respond to a request for comment.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“Given the significance of these issues, Treasury cannot evade the formal rulemaking process by issuing an interpretive final rule or merely issuing guidance,” McHenry wrote."],"hashtag":[]}