{"summary":"Binance CEO Changpeng Zhao has clarified that the exchange did not intentionally delegate 13 million UNI tokens to itself.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/178588\/binance-didnt-intend-to-delegate-13-million-uni-tokens-says-ceo","publishDate":"2022-10-20T06:06:39","id":4313,"type":null,"title":"Binance didn&#x27;t intend to delegate 13 million UNI tokens, says CEO","category":["GOVERNANCE"],"content":["Binance CEO Changpeng Zhao has clarified that the exchange did not intentionally delegate a large amount of UNI tokens to itself, claiming it was a quirk of the Uniswap system. This has eased concerns that the exchange may have been making a move into the governance process of the Uniswap exchange.","Uniswap founder Hayden Adams noted on Twitter yesterday that the exchange had <a href=\"https:\/\/www.theblock.co\/post\/178326\/binance-now-second-largest-entity-by-voting-power-in-uniswap-dao\" data-v-f87c67ca=\"\">delegated<\/a> 13 million UNI ($83.5 million) to itself. This made it the second-largest entity by voting power in the Uniswap DAO — the decentralized exchange's governance forum — second only to VC firm a16z.","Zhao said today that the exchange was merely transferring tokens between its wallets but that, due to the way Uniswap tokens work, this caused the tokens to get automatically delegated.&nbsp;\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">UNI transferred between internal Binance wallets, causing the UNI to be automatically delegated. This is part of their protocol, not \"we intended,\" he <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1582975267907153920?s=20&amp;t=MNEMn3JiZvSs6b__dcPeIA\" data-v-f87c67ca=\"\">said<\/a> on Twitter. \"Binance [doesn't] vote with user’s tokens.\"<\/span>","Adams noted that this happens when Uniswap tokens are sent to an address that is already delegating some tokens. \"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">So the transfers just increased the amount delegated - there was already a binance address that had delegated a smaller amount,\" he said.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Hayden Adams","content":"PERSON"},{"type":"$83.5 million","content":"MONEY"},{"type":"UNI","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Changpeng Zhao","content":"PERSON"}],"hashtag":["BINANCE","UNISWAP"],"authors":["Tim Copeland","The Block"]}