{"summary":"The largest decentralized stablecoin exchange Curve Finance will be deploying on zkSync&#x27;s mainnet, marking its first deployment on a new technology for Ethereum scaling and privacy called a ZK-rollup. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/194998\/curve-finance-to-deploy-on-zksyncs-mainnet-next-year","publishDate":"2022-12-14T15:28:46","id":4314,"type":null,"title":"Curve Finance to deploy on zkSync&#x27;s mainnet next year","category":["THE BLOCK"],"content":["&nbsp;","The largest decentralized stablecoin exchange Curve Finance will deploy on zkSync's mainnet, marking its first deployment on a new technology for Ethereum scaling and privacy called a ZK-rollup.&nbsp;","Curve has played an integral role in many of the decentralized finance (DeFi) innovations this past year which centered around <a href=\"https:\/\/www.theblockresearch.com\/rapid-insights-curves-stablecoin-protocol-192380\" data-v-f87c67ca=\"\">The Curve Wars<\/a>. It has created, up to this point, a sustainable way to incentivize liquidity to various ecosystems and protocols. It currently ranks second overall across all of DeFi for trading volume, behind only Uniswap, <a href=\"https:\/\/defillama.com\/dexs\" data-v-f87c67ca=\"\">according to DeFiLlama.<\/a><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"ZkSync have cracked the problem of Ethereum scaling with their EVM-compatible Layer 2 solution,\"<a href=\"https:\/\/blog.matter-labs.io\/deep-on-chain-liquidity-with-curve-3758cf7210a0\" data-v-f87c67ca=\"\"> said Curve CEO Michael Egorov.&nbsp;<\/a>","In addition to Curve's liquidity incentivization benefits, Egorov <a href=\"https:\/\/blog.matter-labs.io\/deep-on-chain-liquidity-with-curve-3758cf7210a0\" data-v-f87c67ca=\"\">said<\/a> this deployment could open the door for builders to create more trustless, lower cost and user-friendly applications on zkSync.&nbsp;","Curve will start building on zkSync during its <a href=\"https:\/\/www.theblock.co\/post\/180846\/matter-labs-releases-first-phase-of-zksync-2-0-mainnet-called-baby-alpha\" data-v-f87c67ca=\"\">Fair Onboarding Alpha phase<\/a>, which is when protocols can start building on the network.&nbsp;","A ZK-rollup is a new technology that user zero-knowledge proofs for scalability and privacy. <a href=\"https:\/\/blog.matter-labs.io\/optimistic-vs-zk-rollup-deep-dive-ea141e71e075\" data-v-f87c67ca=\"\">Compared<\/a> to other Ethereum scaling technologies, zero-knowledge proofs rely on cryptographic math for security, instead of third-parties in the Optimistic rollup model.&nbsp;","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Curve Finance","content":"ORGANIZATION"},{"type":"Egorov","content":"PERSON"},{"type":"DeFiLlama","content":"ORGANIZATION"},{"type":"Michael Egorov","content":"PERSON"},{"type":"2023","content":"DATE"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}