{"summary":"Kraken co-founder Jesse Powell has questioned the viability of FTX 2.0&#x27;s revival plans, citing several concerns.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242734\/ftx-2-0-kraken-jesse-powell","publishDate":"2023-08-02T08:33:25","id":4316,"type":null,"title":"FTX 2.0 would be a bad idea, says Kraken co-founder Jesse Powell","category":["COMPANIES"],"content":["Crypto exchange Kraken's co-founder Jesse Powell questioned the viability of FTX 2.0's revival plans, citing several concerns about the now-bankrupt crypto exchange.","\"FTX 2.0 would be worse than starting from scratch. No team, no tech, no licenses, no banking, tarnished brand,\" Powell <a href=\"https:\/\/twitter.com\/jespow\/status\/1686610969454342144?s=20\" data-v-f87c67ca=\"\">said<\/a> in a tweet today. \"The trustee should just auction off the domain and trademark to the highest bidder. Anything beyond that is simply a fee extraction attack on delusional creditors.\"","In June, FTX CEO John J. Ray III <a href=\"https:\/\/www.theblock.co\/post\/236885\/ftx-restart-final-submissions-this-week-wsj\" data-v-f87c67ca=\"\">told<\/a> the Wall Street Journal that the company has \"begun the process of soliciting interested parties to the reboot of the FTX.com exchange.\" FTX would likely rebrand as part of any restart, the news outlet said at the time, citing people familiar with the discussions.","Earlier this week, FTX <a href=\"https:\/\/www.theblock.co\/post\/242414\/ftx-proposes-to-reboot-offshore-exchange-as-part-of-reorganization-plan\" data-v-f87c67ca=\"\">filed<\/a> a draft plan of reorganization in which it proposed the establishment of a \"rebooted\" offshore exchange available to non-U.S. users. But the official committee of FTX's unsecured creditors <a href=\"https:\/\/www.theblock.co\/post\/242575\/ftxs-creditors-say-they-werent-looped-in-on-plan-to-recoup-funds\" data-v-f87c67ca=\"\">said<\/a> it wasn't looped in on the draft plan. It also described the plan as just \"ideas\" and said there had been no formal talks to discuss it, indicating that an FTX reboot is far from becoming a reality.","But according to Kraken's Powell, lawyers aren't going to build a secure and performant crypto exchange. \"People with the skill have better offers,\" he said. \"To replicate the competitive advantages offered by FTX might not even be possible for a legit operation. Active traders moved on to other exchanges months ago.\"","\"FTX 2.0 Coalition,\" an alliance of FTX users hoping for a reboot, criticized Powell for his comments. It <a href=\"https:\/\/twitter.com\/AFTXcreditor\/status\/1686678029634822144?s=20\" data-v-f87c67ca=\"\">said<\/a> the idea of FTX 2.0 is to put the exchange into the hands of a competent operator with the necessary experience, resources and creditor alignment. The alliance said, \"1.8 million creditor-customers turned owners are hugely valuable for bootstrapping.\"","The void left by FTX in the market remains and could grow further, according to FTX 2.0 Coalition, who said, \"the current #1 exchange is increasingly in trouble and alternatives are lacking,\" likely referring to Binance, which is currently in a legal battle with the United States Securities and Exchange Commission.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"United States Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"John J. Ray III","content":"PERSON"},{"type":"Powell","content":"PERSON"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Jesse Powell","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FTX","JESSE POWELL","KRAKEN"],"authors":["Yogita Khatri","The Block"]}