{"summary":"Gnosis Chain has followed in Ethereum’s footsteps by activating The Merge to become a proof-of-stake network.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193375\/gnosis-chain-activates-its-own-version-of-the-merge-transitions-to-proof-of-stake-network","publishDate":"2022-12-08T13:47:20","id":4319,"type":null,"title":"Gnosis Chain activates its own version of The Merge, transitions to proof-of-stake network","category":["CRYPTO ECOSYSTEMS"],"content":["Gnosis Chain, a privacy-focused blockchain, has activated its own version of The Merge, and transactions on the network are now being processed under a proof-of-stake consensus in a process similar to what <a href=\"https:\/\/www.theblock.co\/post\/169299\/ethereum-activates-the-merge-as-it-shifts-to-proof-of-stake\" data-v-f87c67ca=\"\">happened<\/a> on Ethereum on Sept. 15.","The Gnosis Chain underwent an upgrade that saw the network merge its previous execution layer with the Gnosis Beacon Chain launched last year. This process happened at the <a href=\"https:\/\/docs.gnosischain.com\/specs\/hard-forks\/merge\" data-v-f87c67ca=\"\">agreed-upon<\/a> total terminal difficulty (TTD) on the Gnosis legacy chain at 01:47 PM EST on Thursday, and Gnosis paid homage to Ethereum by including Ethereum’s TTD in its own Merge TTD.","Gnosis Chain now becomes the second network after Ethereum to transition to PoS from a different consensus architecture. The team says The Merge now makes the chain the third-most decentralized network in the crypto space after Bitcoin and Ethereum. Gnosis Chain’s validator count has subsequently increased from 20 to 100,000.","Gnosis Co-founder Martin Köppelmann told The Block that The Merge is only the first step in a flurry of developmental changes for the network. Following The Merge, the team will work on making its bridges trustless, Köppelmann said, referring to the tools that allow users to send crypto tokens from one network to another.","“The Merge will allow us to upgrade the security of our bridges enormously. Currently — it is more or less like many other chains — controlled by a multisig,\" Köppelmann said. “In the future thanks to zK-proof of consensus we will be able to have the bridges secured by the full validator set.”","Köppelmann also said that The Merge will lay the groundwork to enable EIP-4844 on the Gnosis Chain. EIP-4844 introduces “blob-carrying transactions” into the Ethereum ecosystem. This upgrade is billed to introduce significant cost reductions for on-chain activity on Ethereum.","EIP-4844 is also the first Ethereum upgrade that will not be compatible with EVM networks that have not undergone a Merge event, as recently <a href=\"https:\/\/twitter.com\/peter_szilagyi\/status\/1600432272389263361\" data-v-f87c67ca=\"\">pointed<\/a> out by Ethereum Developer Péter Szilágyi. This is because the upgrade does not support networks without a beacon chain. Gnosis Chain will be the only other EVM chain apart from Ethereum that will be compatible with this upgrade, Köppelmann pointed out.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Merge TTD","content":"ORGANIZATION"},{"type":"4844","content":"DATE"},{"type":"Gnosis","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"TTD","content":"ORGANIZATION"},{"type":"Ethereum’s TTD","content":"ORGANIZATION"},{"type":"Köppelmann","content":"PERSON"},{"type":"Gnosis Beacon Chain","content":"ORGANIZATION"},{"type":"Martin Köppelmann","content":"PERSON"},{"type":"Sept. 15","content":"DATE"},{"type":"Ethereum Developer Péter Szilágyi","content":"ORGANIZATION"},{"type":"EVM","content":"ORGANIZATION"},{"type":"Gnosis Chain","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["ETHEREUM","VALIDATORS"],"authors":["Osato Avan-Nomayo","The Block"]}