{"summary":"Bcause Mining LLC, Voluntary Bankruptcy Proceeding\nBcause Mining LLC purports to be a full-stack crypto company that can handle things like mining, spot trading, derivatives and more\nThis filing includes the list of creditors Bcause is indebted to\nLenders include Dominion Energy Virginia and the US Customs and Border Protection agency","author":["Nelson Rosario","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/20287\/mining-company-files-bankruptcy-and-reveals-interesting-debtors","publishDate":"2019-04-21T12:35:31","id":432,"type":null,"title":"Mining company files bankruptcy and reveals interesting debtors","category":["Legal"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]Bcause Mining LLC, Voluntary Bankruptcy Proceeding (ND Ill. filed April 11, 2019)[NMR]<\/strong><\/em>","This is not so much a case, as a plea for help. This filing is a voluntary bankruptcy filing in the Northern District of Illinois bankruptcy court as a Chapter 11 bankruptcy for Bcause Mining LLC. This is one of the first such filings in the crypto space.","Bcause Mining LLC purports to be a full-stack crypto company that can handle things like mining, spot trading, derivatives and more. They are based in Virginia Beach, VA, but also have contacts in Chicago. The goal is that after securing the necessary regulatory licenses Bcause would become “a digital mining facility, spot market, regulated derivatives exchange and clearing house.” Lofty goals, which so far have appeared to fall short, hence the bankruptcy filing.","It’s worth discussing the two main flavors of bankruptcy filings: voluntary and involuntary. A voluntary proceeding is initiated by the company in question. They usually are heavily in debt and seek bankruptcy protection to restructure that debt and potentially emerge as a stronger company to fight another day. Involuntary bankruptcy is a proceeding that may be started by a creditor of a company to try and recoup some of their value in the company. In both cases, there are established rules as to who gets paid first among the list of creditors in the company.","What is really going on here then? Well, it seems that Bcause looked at their books, looked at its assets, looked at its liabilities, and realized it would likely not be able to pay. In many cases, and in contrast to much of what we see at the Crytpo Caselaw Minute, this may be a prudent decision. In the filing the estimated assets of Bcause are between $1-$10 million, and its estimated liabilities are between $1-$10 million. If those numbers are accurate it's hard to look at your books and not be concerned, and\/or take action. The likely next steps are that Bcause will likely put forward plans for the reorganization\/restructuring of their debt within the necessary time period afforded them under Chapter 11. Then the court will decided whether or not to approve said plans.","What is perhaps most interesting about this filing is that it contains the list of creditors Bcause is indebted to. These creditors may have claims that are “secured,” or “unsecured,” with the secured claims taking precedence. A secured claim involves collateral and unsecured claim does not. Some of the creditors in this case are names you know. For example, Fidelity Labs has a secured claim to Bcause, Amazon Web Services has an unsecured claim, but there are two very interesting claims on Bcause’s liabilities that are unsecured.","Dominion Energy Virginia has an unsecured claim of $1,459,267.38 unsecured claim on Bcause’s assets. For those that don’t know Dominion is a massive energy and power company in Virginia. The other claim is from US Customs and Border Protection for $737,041.90. How does a crypto company focused on mining and trading end up owing CBP almost $750k? The story behind that claim does not shine through in this filing.","Bcause will now work to submit the plan to reorganize their debts and attempt to move forward and still succeed as a business. That might work, it might not, but it is another data point in the maturation of the blockchain industry. Leveraging the exists tools of the legal system instead of eschewing government all together.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part II of this week's analysis, Crypto Caselaw Minute, is above.<\/em>"],"hashtag":[]}