{"summary":"Blobstream is set to enable developers to create customizable chains known as Orbit using Celestia for data availability.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285984\/celestia-blobstream-arbitrum","publishDate":"2024-04-02T12:30:04","id":4320,"type":null,"title":"Celestia brings Blobstream solution to Arbitrum Orbit chains","category":["CRYPTO ECOSYSTEMS"],"content":["Modular blockchain project Celestia has introduced Blobstream for the Arbitrum ecosystem, enabling developers to create customizable chains (called Orbit) using Celestia for data availability.","<a href=\"https:\/\/www.theblock.co\/post\/235980\/offchain-labs-unveils-tool-to-build-layer-3-orbit-chains-on-arbitrum\" data-v-f87c67ca=\"\">Orbit Chains<\/a> can either be Layer 2 chain that settle directly to Ethereum or as a Layer 3 chains that can settle to Arbitrum’s own Layer 2: Arbitrum One.","The deployment of Blobstream in this context allows L2 and L3 rollups to utilize Celestia light clients for data availability sampling (DAS) — a technique to ensure that data pertaining to transactions and state changes is accessible to all network participants.","This integration will provide Arbitrum’s Orbit chains with the ability to publish data to Celestia in addition to their existing setups, which can be costlier or overly complex for many developers.","Therefore, Blobstream aims to simplify the process for Arbitrum developers to leverage DAS and eliminate the need for establishing a data availability “committee” to launch their own chain. This requirement previously necessitated an independent <a href=\"https:\/\/docs.arbitrum.io\/node-running\/how-tos\/data-availability-committee\/introduction\" data-v-f87c67ca=\"\">data availability committee<\/a> capable of storing data and supplying it on demand.","“Before Celestia, throughput limitations forced developers building expressive onchain applications to migrate to alt-L1s or required the overhead of recruiting a committee to deploy their own chain,” Celestia stated. “With Blobstream, developers can keep building in the Ethereum ecosystem.\"","Celestia developed Blobstream in collaboration with <a href=\"https:\/\/www.theblock.co\/post\/284002\/paradigm-leads-55-million-round-in-zk-proofs-startup-succinct-lab-alongside-polygon-founders\" data-v-f87c67ca=\"\">Succinct Labs<\/a>. The solution will utilize Succinct Labs’ zero-knowledge light client to convey attestations of Celestia’s data root to Orbit smart contracts.","Blobstream’s latest deployment follows its <a href=\"https:\/\/twitter.com\/CelestiaOrg\/status\/1773036676413292963\" data-v-f87c67ca=\"\">release<\/a> in the Base ecosystem last week.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Celestia","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Blobstream","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Before Celestia","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ARBITRUM","DEVELOPER TOOLS","MODULAR","PROTOCOLS","ROLLUPS","SMART CONTRACTS"],"authors":["Vishal Chawla","The Block"]}