{"summary":"Distributed Global leads 3RM&#x27;s $3 million raise to build tools to help web3 companies better manage relationships with customers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/213238\/3rm-raises-from-distributed-global","publishDate":"2023-02-21T09:05:07","id":4321,"type":null,"title":"3RM raises $3 million to streamline customer relationship building in web3","category":["DEALS"],"content":["Tech startup <a href=\"https:\/\/www.3rm.co\/\" data-v-f87c67ca=\"\">3RM<\/a> raised $3 million to build tools that will help web3 companies better manage their relationships with customers.","The round was led by Distributed Global and also saw participation from investors including Shima Global, Big Brain Holdings, Metareal and 3SE Holdings, the company said in a release.","3RM's CEO and founder Jackson Rodriguez formulated the idea for the startup after spending time trying become \"the best person in business development in web3.\" After months of speaking to crypto startups about their sales processes, he decided to focus on building a customer relationship management (CRM) tool that would center on where the web3 industry is heading.","\"Right now with everything crashing, sales operations are more important than ever before,\" said Rodriguez in an interview with The Block. \"All the teams that I've reached out to are now circling around saying 'We're losing track of our Telegram messages' [or] 'We know there were deals back in July that we didn't follow up on' [or] 'Do you know anyone here at this project?'\"","Rodriguez started raising funds to build a CRM product that would solve these problems in the middle of summer 2022. The round closed around 40 days later, he said. The startup currently has 14 staff and will use the funds to build out its platform.","\"I've got this Google sheet of 300 VCs that I cold outreached, whether it was a Twitter DM, whether it was an email, and I just was relentless and I would just not leave them alone,\" Rodriguez said. \"And when I got one offer, I would ask for an intro someone else and they would intro me and that made it a ton easier.\"","Rodriguez says he didn't want to just duplicate the traditional CRM tool for the crypto industry. Instead he focused on making a crypto-native tool that is Telegram-enabled and has features that cater to the pseudonymous nature of the industry.&nbsp;","\"The [Telegram] bot will actually send you updates as an assistant,\" Rodriguez said. \"Every day an update is due at 9 a.m., it says, 'good morning here are your follow ups,' it will give you a link to the Telegram chat, so you can jump right in to it or it will give you a link to open it in 3RM in case you need more context.\"","More than 1,200 organizations have signed up to use 3RM's CRM tooling, including Magic Eden, Fuel Labs and Lens Protocol, according to the company's <a href=\"https:\/\/www.3rm.co\/\" data-v-f87c67ca=\"\">website<\/a>. The CRM platform is built using technologies such as React, Postgres and Typescript, Rodriguez said.&nbsp;","\"In order to get the products out and really test very quickly, we started with a very web2 route.\" Rodriguez said. \" Now, we've gotten enough feedback and enough customer testimonial insights that we're starting to dig into that more of those web3 directions.\"","The initial product will remain free to companies, Rodriguez said. Eventually it will roll out enterprise-level features that it will charge for, he added.","“Web3 has grown from a small sandbox where everyone knew each other to a colossal network of ecosystems across various chains, verticals and communities,\" said Yida Gao, general partner at Shima Capital, in the release. \"With this exponential expansion, projects now direly need a CRM system that is not only web3 native (e.g. deep Telegram support) but also built by crypto-native founders.\"","<em data-v-f87c67ca=\"\">Correction: story updated after 3RM corrected the size of their fundraise.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"summer 2022","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Shima","content":"PERSON"},{"type":"$3 million","content":"MONEY"},{"type":"Big Brain Holdings","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Yida Gao","content":"PERSON"},{"type":"Rodriguez","content":"PERSON"},{"type":"Shima Capital","content":"ORGANIZATION"},{"type":"3SE Holdings","content":"ORGANIZATION"},{"type":"Jackson Rodriguez","content":"PERSON"},{"type":"9 a.m.","content":"TIME"}],"hashtag":["SEED &AMP; PRE-SEED"],"authors":["Kari McMahon","The Block"]}