{"summary":"A consultation paper published by the Australian government looks to apply some existing financial frameworks to regulate its crypto sector.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/208367\/australia-reveals-its-plans-for-crypto-regulation","publishDate":"2023-02-03T05:15:25","id":4328,"type":null,"title":"Australia reveals its plans for crypto regulation","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">Australia took a step toward regulating its crypto sector with a consultation paper providing more clarity on the direction it will take.<\/span>","<span data-v-f87c67ca=\"\">The Australian government steered away from an “exhaustive, bespoke taxonomy\" for crypto. Instead, it opted for a framework that groups crypto into intermediaries or service providers on one hand and public networks or smart contracts on the other. For these categories, officials want to know if some existing financial regulations will suffice.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Office of the Treasurer of Australia, following the footsteps of the UK’s Treasury, which published a crypto consultation on Thursday morning, is looking to receive feedback from stakeholders from now until March 3.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Particularly, officials want to flesh out answers on topics like whether crypto should be regulated separately or within existing financial rules, how to protect investors and the role of smart contracts.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The consultation cites a 1997 financial systems inquiry to argue that \"functionally-equivalent products should be treated equivalently.\" The same approach can be traced back to the Financial Stability Board’s \"same activity, same risk, same regulation\" prescription in the global watchdog’s proposed framework for crypto regulation <\/span><a href=\"https:\/\/www.theblock.co\/post\/176025\/g20-central-bankers-warn-stablecoins-arent-stable-recommend-action-around-crypto-assets\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">published<\/span><\/a><span data-v-f87c67ca=\"\"> in October.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Australian government delivered on a promise <\/span><a href=\"https:\/\/www.theblock.co\/post\/194848\/australia-crypto-service-provider-regulation-2023\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">made<\/span><\/a><span data-v-f87c67ca=\"\"> in December to produce plans for licensing and regulating crypto service providers, following the dramatic collapse of crypto giant FTX.<\/span>","<span data-v-f87c67ca=\"\">Next, officials plan to release a consultation proposing a licensing and custody framework for crypto asset service providers in mid-2023, and note that the ''logical next step'' is introducing a licensing regime with minimum standards for crypto asset service providers, including secure custody.<\/span>","<span data-v-f87c67ca=\"\">In a separate announcement released in tandem with the consultation paper, the Albanese government said it <\/span><a href=\"https:\/\/ministers.treasury.gov.au\/ministers\/jim-chalmers-2022\/media-releases\/making-crypto-safer-consumers\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">plans<\/span><\/a><span data-v-f87c67ca=\"\"> to boost the size of the Australian Securities and Investments Commission’s crypto enforcement team. ASIC is a regulatory body overseeing crypto service providers through its licensing regime.<\/span>","<span data-v-f87c67ca=\"\">The Treasury is also looking to address “unsustainable business models used by some companies dealing in crypto assets (that) have left consumers exposed,” and to lay out requirements for crypto firms to “ensure they adequately safe-keep assets for customers.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Thursday","content":"DATE"},{"type":"Australian Securities and Investments Commission","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"December","content":"DATE"},{"type":"UK’s Treasury","content":"ORGANIZATION"},{"type":"1997","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Albanese","content":"PERSON"},{"type":"Australia","content":"LOCATION"},{"type":"morning","content":"TIME"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"March 3","content":"DATE"},{"type":"Financial Stability Board","content":"ORGANIZATION"}],"hashtag":[],"authors":["Inbar Preiss","The Block"]}