{"summary":"Developers merged Ropsten&#x27;s proof-of-work chain with its beacon chain. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/150864\/ethereums-ropsten-proof-of-stake-test-merge-goes-live","publishDate":"2022-06-08T12:13:02","id":4331,"type":null,"title":"Ethereum&#x27;s Ropsten proof-of-stake &#x27;test merge&#x27; goes live","category":["ETHEREUM"],"content":["In preparation for the Ethereum merge happening later this year, developers have activated the merge on the Ropsten test network.","The merge took place on Wednesday afternoon after <a href=\"https:\/\/blog.ethereum.org\/2022\/06\/03\/ropsten-merge-ttd\/\" data-v-f87c67ca=\"\">the move was first announced<\/a> on June 3.","Ropsten’s proof-of-work chain was merged with its proof-of-stake beacon chain by combining their codes into one. Today’s merge is critical to check if client software using Ethereum nodes performs without any glitches. Client software teams participated in the merge including Lighthouse, Lodestar, Prysm, Teku, Besu, Erigon, go-ethereum (geth) and Nethermind.","The same process is set to happen later this year with the Ethereum mainnet merge, for which a date has not yet been set.&nbsp;In effect, today's event was intended to serve as a major practice session for the mainnet merge, which will see Ethereum transition from proof-of-work consensus to proof-of-stake.","\"I mean of course, the merge working well for 6 hours isn’t evidence of complete success,\" said Vitalik Buterin, co-founder of Ethereum, in the livestream earlier today. \"There are all of these kind of longer term issues around MEV and staking centralization and protection against DOS attacks and things that could potentially bite us 3 weeks after the merge instead of 2 minutes during the process.\"","Previous tests included 10 <a href=\"https:\/\/www.theblockcrypto.com\/post\/141609\/ethereum-largely-passes-first-major-test-for-proof-of-stake\" data-v-f87c67ca=\"\">shadow<\/a><a href=\"https:\/\/www.theblockcrypto.com\/post\/141609\/ethereum-largely-passes-first-major-test-for-proof-of-stake\" data-v-f87c67ca=\"\"> fork<\/a><a href=\"https:\/\/www.theblockcrypto.com\/post\/141609\/ethereum-largely-passes-first-major-test-for-proof-of-stake\" data-v-f87c67ca=\"\">s<\/a> on the main network in April and another merge on Kiln, another testnet.&nbsp;","Today's test is measured by a metric called terminal total difficulty. The merge is considered activated once this level of block difficulty is reached on the proof of work version. The proof-of-work version of Ropsten crossed a pre-set 50 quadrillion measure to protect the merge from any malicious activity by artificially acquiring the hashrate.","Before the activation of the merge, node operators had to manually configure their clients to override the Ropsten Terminal Total Difficulty for both the proof-of-stake version and proof-of-stake clients, as explained by The Block’s Vishal Chawla in an explainer published <a href=\"https:\/\/www.theblockcrypto.com\/post\/150450\/ethereums-ropsten-test-merge-expected-to-initiate-in-next-48-hours\" data-v-f87c67ca=\"\">Tuesday<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nethermind","content":"ORGANIZATION"},{"type":"Teku","content":"LOCATION"},{"type":"Prysm","content":"LOCATION"},{"type":"Erigon","content":"LOCATION"},{"type":"earlier today","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Besu","content":"LOCATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"June 3","content":"DATE"},{"type":"Lodestar","content":"LOCATION"},{"type":"Ropsten Terminal Total Difficulty","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Vishal Chawla","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"April","content":"DATE"},{"type":"afternoon","content":"TIME"}],"hashtag":[],"authors":["Anushree Dave","The Block"]}