{"summary":"BlackRock&#x27;s ETF also made it into the top three biggest debuts for ETFs on Wall Street of all time, based on first-day volume.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/272522\/blackrocks-spot-bitcoin-etf-saw-half-a-billion-dollars-in-inflows-in-first-two-days","publishDate":"2024-01-13T17:04:58","id":4333,"type":null,"title":"BlackRock&#x27;s spot bitcoin ETF saw half a billion dollars in inflows in first two days","category":["LAYER 1S"],"content":["After months of hype and uncertainty surrounding the SEC's approval of spot bitcoin exchange traded products on Wall Street, crypto investors' hopes appear to have been vindicated.","The nine bitcoin ETFs that <a href=\"https:\/\/www.theblock.co\/post\/272434\/launch-spot-bitcoin-etf-beginning\" data-v-f87c67ca=\"\">debuted<\/a> on the stock market, out of the eleven total that were approved, (Grayscale's ETF is a conversion, while Hashdex is still converting its bitcoin futures fund) took in nearly $1.5 billion in new capital over the first two days of trading, according to preliminary data shared by Bloomberg senior ETF analyst Eric Balchunas.&nbsp;","In a <a href=\"https:\/\/twitter.com\/EricBalchunas\/status\/1746145426229669972\/photo\/1\" data-v-f87c67ca=\"\">post<\/a> on X, Balchunas shared updated numbers for the inflows and volume of the nine ETFs. At the top of the pack is BlackRock's iShares ETF, which took in nearly half a billion dollars of capital in the first two days of trading, presumably due to its <a href=\"https:\/\/www.theblock.co\/post\/271553\/heres-how-the-slashed-fees-for-spot-bitcoin-etfs-compare-to-traditional-funds\" data-v-f87c67ca=\"\">slashed fees<\/a>. Fidelity's ETF saw over $422 million in inflows as well, with Bitwise in third place with $237 million. WisdomTree's ETF brought up the rear with only $1 million in inflows.&nbsp;","BlackRock's ETF also debuted with over one billion dollars of volume on its first day of trading, making it the <a href=\"https:\/\/www.wsj.com\/finance\/investing\/blackrocks-new-bitcoin-etf-off-to-a-monster-start-5d816b7e\" data-v-f87c67ca=\"\">second or third<\/a> biggest debut for an ETF in history. The nine ETFs saw over $3.6 billion in volume in the first two days, much of it again from BlackRock and Fidelity. The preliminary data marks a \"monster start\" for spot bitcoin ETFs, according to the Wall Street Journal.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"a billion dollars","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"$237 million","content":"MONEY"},{"type":"Bitwise","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"WisdomTree","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$1.5 billion","content":"MONEY"},{"type":"one billion dollars","content":"MONEY"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"$3.6 billion","content":"MONEY"},{"type":"$1 million","content":"MONEY"},{"type":"$422 million","content":"MONEY"},{"type":"Eric Balchunas","content":"PERSON"}],"hashtag":["BITCOIN","INVESTMENT FIRMS","TRADFI BANKS"],"authors":["Zack Abrams","The Block"]}