{"summary":"Analysts are noting a lack of signs — such as filings — that would indicate the SEC is gearing up to let in more crypto ETFs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281714\/bloomberg-analysts-substantially-lower-likelihood-of-spot-ethereum-etf-approval-in-may-to-30","publishDate":"2024-03-11T11:09:00","id":4336,"type":null,"title":"Bloomberg analysts substantially lower likelihood of spot Ethereum ETF approval in May to 30%","category":["MARKETS"],"content":["<span data-v-f87c67ca=\"\">Bloomberg ETF analysts have dropped their chances of a spot <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.038%\n    <\/span><\/a> <!----><\/span><\/span> ETF approval in May to 30%.<\/span>","“We are [at] 30% odds,” Bloomberg Senior ETF Analyst Eric Balchunas told The Block.&nbsp;","In January, Balchunas said there was a <a href=\"https:\/\/www.theblock.co\/post\/271874\/ethereum-etf-approval-may-ether-price-surge\" data-v-f87c67ca=\"\">70% chance of approval<\/a> by May, while his colleague James Seyffart had given a <a href=\"https:\/\/www.theblock.co\/post\/274312\/crypto-experts-predict-whether-a-spot-ethereum-etf-will-get-approved-in-2024\" data-v-f87c67ca=\"\">60-65% estimate<\/a>.&nbsp;","On March 8, Coinbase and Grayscale met with the SEC about potentially converting Grayscale’s Ethereum Trust into an ETF. At the time, Balchunas <a href=\"https:\/\/twitter.com\/EricBalchunas\/status\/1766132086589841424\" data-v-f87c67ca=\"\">said<\/a> that this would normally be a good sign—except that, as far as he knew, the SEC had not yet commented on the issuers.&nbsp;","The past couple of months have dampened expectations from those most confident that an approval could be imminent. The key reason appears to be a lack of filing changes for such products, which came ahead of the bitcoin ETF approvals.","In January, crypto market-making firm GSR estimated the chances of approval at 70%. While the firm is still leaning this way — and sees approval as more likely than not — research analyst Brian Rudick noted that its estimates might be about to change.","“The one caveat is that we started to see movement with the spot Bitcoin ETF applications in October for their January 10 approval (e.g. issuers seeding the ETFs; DTCC listing the ETFs, etc), and we haven't seen that with the spot Ethereum ETFs yet,” he said. “Perhaps the SEC and issuers have the playbook from Bitcoin, truncating the process, but if we don't start to see positive progress over the next month, we will lower our approval odds.”","Rudick noted that GSR still sees the Ethereum ETF applications playing out similarly to Bitcoin because of the requirement for similar treatment of spot and futures-based applications.","Nate Geraci, president of The ETF Store, took a similar view.","\"<span class=\"css-1qaijid r-bcqeeo r-qvutc0 r-poiln3\" data-v-f87c67ca=\"\">All indications are the agency has yet to meaningfully engage with issuers, which is clearly a negative sign,\" he told The Block. \"<\/span><span class=\"css-1qaijid r-bcqeeo r-qvutc0 r-poiln3\" data-v-f87c67ca=\"\">That said, I’m not quite sure what the SEC’s rationale for disapproval would be. I keep coming back to the core issue, which is that the SEC approved ether futures ETFs. If the SEC believes ether futures ETFs are sufficient for investors, then I’m not sure how they argue against spot ether ETFs.\" <\/span>","<span class=\"css-1qaijid r-bcqeeo r-qvutc0 r-poiln3\" data-v-f87c67ca=\"\">\"In my opinion, the SEC expended a significant amount of political capital unsuccessfully preventing spot bitcoin ETFs from coming to market,\" he added. \"Do they really want to risk further reputational damage and lose another lawsuit over spot ether ETFs?\"<\/span>","Variant Fund Chief Legal Officer Jake Chervinsky echoed these concerns about a lack of progress and <a href=\"https:\/\/www.theblock.co\/post\/280434\/spot-ether-etf-approvals-remain-uncertain\" data-v-f87c67ca=\"\">maintained<\/a> his skeptical view.&nbsp;","“To be clear, I’m not saying there’s *no* chance for a spot ETH ETF to be approved this year. I’m just saying that general sentiment in this early-mid bull market is overestimating the chance of approval given all of the political and strategic factors weighing against,” <a href=\"https:\/\/twitter.com\/jchervinsky\/status\/1767175990285857006\" data-v-f87c67ca=\"\">Chervinsky posted on X<\/a>. “The good news is that we’ll likely get more signal about which direction the SEC is leaning over the coming weeks.”","“Recall that the SEC foreshadowed spot BTC approval with all the work it did on the details in the days leading up to the January deadline. If we don’t start seeing those signs and hearing those reports as the May 23 deadline approaches, that silence will speak volumes,” he added.","Similarly, investment banks <a href=\"https:\/\/www.theblock.co\/post\/272417\/spot-ethereum-etf-approval-chance-jpmorgan\" data-v-f87c67ca=\"\">JPMorgan<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/274853\/spot-ethereum-etf-approval-2025-2026-td-cowen\" data-v-f87c67ca=\"\">TD Cowen<\/a> estimate that spot Ethereum ETFs won’t be approved by May.","<em data-v-f87c67ca=\"\">Update: Added comment from James Seyffart and Nate Geraci.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"70%","content":"PERCENT"},{"type":"GSR","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Jake Chervinsky","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"January 10","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"Nate Geraci","content":"PERSON"},{"type":"” <a href=\"https:\/\/twitter.com\/jchervinsky\/status\/1767175990285857006\" data-v-f87c67ca=\"\">Chervinsky","content":"ORGANIZATION"},{"type":"March 8","content":"DATE"},{"type":"Ethereum ETF","content":"ORGANIZATION"},{"type":"Eric Balchunas","content":"PERSON"},{"type":"May 23","content":"DATE"},{"type":"James Seyffart","content":"PERSON"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"65%","content":"PERCENT"},{"type":"DTCC","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"TD Cowen","content":"ORGANIZATION"},{"type":"Grayscale’s Ethereum Trust","content":"ORGANIZATION"},{"type":"Brian Rudick","content":"PERSON"},{"type":"Rudick","content":"PERSON"},{"type":"Balchunas","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"-0.038%","content":"PERCENT"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["SPOT ETHEREUM ETF"],"authors":["Tim Copeland","The Block"]}