{"summary":"Coinbase users may trade ARB-USD pairs on March 23, once sufficient liquidity and asset supplies are established, the exchange said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/222022\/coinbase-will-soon-support-the-arbitrum-arb-usd-trading-pair","publishDate":"2023-03-22T13:35:12","id":4337,"type":null,"title":"Coinbase will soon support the ARB-USD trading pair","category":["CRYPTO ECOSYSTEMS"],"content":["In advance of the Arbitrum airdrop, Coinbase <a href=\"https:\/\/twitter.com\/CoinbaseAssets\/status\/1638571300464500739\" data-v-f87c67ca=\"\">tweeted<\/a> that it will support trading for the governance token on March 23.","“Once sufficient supply of this asset is established, we will announce the impending launch of trading on our ARB-USD pair in phases,” Coinbase said, adding that support may be restricted in some jurisdictions. Coinbase warned users to avoid sending the token to a network other than Arbitrum, as it will result in the loss of tokens.","Arbitrum will trade on Coinbase with the “experimental asset label” that the exchange assigns to new assets or those with low performance relative to the trading volume of other supported trading pairs.","Coinbase noted that it is aware of an issue in which “some users may see a delay in depositing on the Arbitrum network” and said its team is working to resolve the issue. It will update the site's <a href=\"https:\/\/status.exchange.coinbase.com\/incidents\/5k56y54w6d8f\" data-v-f87c67ca=\"\">status<\/a> page once the issue is resolved, Coinbase said.&nbsp;&nbsp;","The long-awaited <a href=\"https:\/\/www.theblock.co\/post\/220486\/arbitrums-long-awaited-airdrop-to-go-live-next-week-with-self-executing-dao\" data-v-f87c67ca=\"\">airdrop<\/a> of ARB will see 11.6% of the total supply fall into the hands of users, while 1.1% goes to DAOs on the Layer 2 platform. The lion’s share of ARB, some 42.8%, is earmarked for the Arbitrum Foundation.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Arbitrum Foundation","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"42.8%","content":"PERCENT"},{"type":"Coinbase","content":"PERSON"},{"type":"11.6%","content":"PERCENT"},{"type":"1.1%","content":"PERCENT"},{"type":"March 23","content":"DATE"}],"hashtag":["ARBITRUM","COINBASE"],"authors":["Jeremy Nation","The Block"]}