{"summary":"BlockFi said Tuesday that it has officially emerged from bankruptcy in a move that will allow it to start repaying creditors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/259262\/blockfi-can-begin-repaying-creditors-after-emerging-from-bankruptcy","publishDate":"2023-10-24T14:06:25","id":4338,"type":null,"title":"BlockFi can begin repaying creditors after emerging from bankruptcy","category":["BANKRUPTCY"],"content":["Crypto lending firm BlockFi, which was forced to <a href=\"https:\/\/www.theblock.co\/post\/234316\/blockfi-says-customer-withdrawals-could-start-this-summer\" data-v-f87c67ca=\"\">halt withdrawals<\/a> last year after the collapse of the FTX exchange, said Tuesday that it has officially emerged from bankruptcy in a move that will allow it to start repaying creditors.&nbsp;","\"BlockFi’s management, advisors and other stakeholders worked diligently over the past 11 months to reach this critical milestone,\" the company said in a <a href=\"https:\/\/blockfi.com\/blockfi-emerges-from-bankruptcy\/\" data-v-f87c67ca=\"\">blog post<\/a>. \"We are proud to say that BlockFi reached its Effective Date more quickly and efficiently than many other retail crypto companies.\"","BlockFi, which has been working on the <a href=\"https:\/\/www.theblock.co\/post\/242922\/blockfi-moves-one-step-closer-to-refunding-creditors\" data-v-f87c67ca=\"\">bankruptcy plan<\/a> for months, said it can now begin a planned wind-down and attempt to recover assets from companies including FTX and Three Arrows Capital. It will continue to distribute digital assets back to clients, and withdrawals are currently available to \"nearly all Wallet customers.\"","Users that had interest-yielding accounts on BlockFi will receive emails prompting them to withdraw available funds in the next few months, the company said.","\"The company expects that this will be the first wave of distributions, which will be followed by additional distributions. The amount of subsequent distributions is subject to many factors, but primarily BlockFi’s treatment in the FTX bankruptcy cases,\" it added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tuesday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["BANKRUPTCY FILINGS","THREE ARROWS CAPITAL"],"authors":["Anna Baydakova","The Block"]}