{"summary":"Draft legislation to create a U.S. federal framework around stablecoins would temporarily ban the types of payment coins that are not backed by outside assets, similar to the now-defunct UST.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/171565\/draft-stablecoin-bill-in-congress-to-require-fed-state-regulator-approval","publishDate":"2022-09-20T19:20:57","id":434,"type":null,"title":"Draft stablecoin bill in Congress to require Fed, state regulator approval","category":["POLICY"],"content":["Draft legislation to create a U.S. federal framework around stablecoins would temporarily ban the types of payment coins that are not backed by outside assets — similar to TerraUSD, an algorithmic stablecoin that collapsed earlier this year.","&nbsp;Nonbank issuers of stablecoins backed by fiat currency would also be overseen by state banking regulators and the Federal Reserve, according to a source familiar with discussions and draft text obtained by The Block.&nbsp;","Banks or credit unions could issue their own stablecoins, which would be overseen by the Office of the Comptroller of the Currency and the Federal Deposit Insurance Corp., both of which serve as federal bank regulators in the United States.","Issuing a stablecoin without approval from those regulators could be punishable by up to five years in prison and a $1 million fine.","The current draft bill, under negotiation between House Financial Services Committee Chair Maxine Waters (D-Calif.) and the committee’s top Republican, Rep. Patrick McHenry (R-N.C.), would create a two-year ban on stablecoins that aren’t fully backed by cash or highly liquid assets, like U.S. Treasury bonds. The bill would also create a two-year grace period for operators with coins that aren’t currently collateralized by those assets to change their business model and receive approval.&nbsp;","The Federal Reserve would also be directed to study the economic impact of a U.S. digital dollar, a process the central bank has already begun.","Multiple sources familiar with talks, speaking on condition of anonymity due to the closed-door nature of discussions, said that McHenry had yet to sign off on the legislation. The draft is meant for negotiations and still subject to possible change.&nbsp;Spokespeople for Waters and McHenry did not immediately respond to requests for comment.&nbsp;","Bloomberg News was first to report news of the proposed temporary ban on certain stablecoins.&nbsp;","McHenry told a Washington audience earlier today that <a href=\"https:\/\/www.theblock.co\/post\/171497\/senior-republican-stablecoins-bill-will-have-multiple-authors\" data-v-f87c67ca=\"\">any stablecoin bill will be collaborative<\/a>, rather than drafted by one side, and that a comprehensive bill around the technology is a top priority for him. McHenry, the ranking Republican on the Financial Services Committee, is up to take the chair's gavel should control of the House of Representatives change after the November midterm elections.&nbsp;","The bill would also allow U.S. federal banking regulators and state regulators to create their own set of standards for interoperability around stablecoins. The legislation aims to create asset and accounting standards similar to banks and credit unions.&nbsp;","Under the bill’s current form, it would prohibit the comingling of customer funds and keys with the stablecoins and other assets of an issuer. In theory, this would allow customers to more easily recoup their money if a stablecoin issuer fails.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Washington","content":"LOCATION"},{"type":"Financial Services Committee","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Patrick McHenry","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"House of Representatives","content":"ORGANIZATION"},{"type":"House Financial Services Committee Chair Maxine Waters","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"Calif.","content":"LOCATION"},{"type":"Federal Deposit Insurance Corp.","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Bloomberg News","content":"ORGANIZATION"},{"type":"McHenry","content":"PERSON"}],"hashtag":["CONGRESS","MAXINE WATERS","PATRICK MCHENRY"],"authors":["Colin Wilhelm","Stephanie Murray","The Block"]}