{"summary":"The SEC on Thursday said it is instituting additional proceedings to determine whether the proposed Valkyrie Bitcoin Fund ETF should be approved or disapproved.\nSimilar proposed funds from BlackRock, Bitwise and Invesco were also delayed.","author":["Nathan Crooks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/253506\/sec-moves-to-again-delay-decision-on-valkyrie-spot-bitcoin-etf","publishDate":"2023-09-28T16:24:02","id":434,"type":null,"title":"SEC moves to delay spot bitcoin ETFs from BlackRock, Valkyrie, Bitwise","category":["Companies"],"content":["The Securities and Exchange Commission on Thursday said it is instituting additional proceedings to determine whether proposed spot bitcoin ETFs from BlackRock, Invesco, Valkyrie and Bitwise should be approved or disapproved, in apparent additional delays to the ongoing review processes underway.&nbsp;","\"Institution of proceedings is appropriate at this time in view of the legal and policy issues raised by the proposed rule change,\" the regulator said in a <a href=\"https:\/\/www.sec.gov\/files\/rules\/sro\/nasdaq\/2023\/34-98606.pdf\" data-v-f87c67ca=\"\">filing<\/a><span data-v-f87c67ca=\"\">&nbsp;for the Valkyrie <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.30%\n    <\/span><\/a> <!----><\/span><\/span> Fund.<\/span>","\"Institution of proceedings does not indicate that the Commission has reached any conclusions with respect to any of the issues involved,\" it continued.&nbsp;","Valkyrie Funds, which already offers a Bitcoin Strategy ETF and a Bitcoin Miners ETF, first <a href=\"https:\/\/www.theblock.co\/post\/235921\/valkyrie-joins-race-for-spot-bitcoin-etf-with-wednesday-sec-filing\" data-v-f87c67ca=\"\">filed<\/a> for the spot fund in June. The proposed ETF will hold bitcoin to reflect the performance of the CME CF Bitcoin Reference Rate, New York Variant, and intends to list shares on the Nasdaq exchange under the ticker BRRR.","In the Thursday Valkyrie filing, the SEC asked for input from commentators.","\"What are commenters’ views generally on whether the Exchange’s proposal is designed to prevent fraudulent and manipulative acts and practices?\" it wrote. \"What are commenters’ views generally with respect to the liquidity and transparency of the bitcoin markets and the bitcoin markets’ susceptibility to manipulation?\"","It also wants to know if a proposed a surveillance-sharing agreement with crypto exchange Coinbase would be helpful in \"in detecting, investigating, and deterring fraud and manipulation.\"","Commentators have 21 days to submit written data, views and arguments, and then there's another 35-day period for rebuttals, which suggests the approval process will drag on for at least a few more months.","It filed for separate proceedings on the Bitwise Bitcoin ETP Trust, the <a href=\"https:\/\/www.sec.gov\/files\/rules\/sro\/cboebzx\/2023\/34-98613.pdf\" data-v-f87c67ca=\"\">Invesco Galaxy Bitcoin ETF<\/a> and BlackRock's <a href=\"https:\/\/www.sec.gov\/files\/rules\/sro\/nasdaq\/2023\/34-98610.pdf\" data-v-f87c67ca=\"\">iShares Bitcoin Trust,<\/a> with similar periods for comments and rebuttals.&nbsp;","The regulator <a href=\"https:\/\/www.theblock.co\/post\/248595\/sec-moves-to-delay-decisions-on-spot-bitcoin-etfs-from-wisdomtree-invesco-and-valkyrie\" data-v-f87c67ca=\"\">first delayed<\/a> the proposed spot bitcoin funds in late August, when it also announced delays for Fidelity's Wise Origin Bitcoin Trust, the VanEck Bitcoin Trust and the WisdomTree Bitcoin Trust.","Ahead of a possible government shutdown, the SEC <a href=\"https:\/\/www.theblock.co\/post\/253108\/sec-moves-to-delay-decision-on-ark-21shares-bitcoin-etf-into-next-year\" data-v-f87c67ca=\"\">earlier this week<\/a> delayed a decision on the proposed ARK 21Shares Bitcoin ETF into next year, with a new deadline of Jan. 10.","(<em data-v-f87c67ca=\"\">Updates with additional details throughout.<\/em>)"],"hashtag":["SEC"]}