{"summary":"The man behind the much-maligned crypto exchange Mt. Gox is throwing cold water on one crypto billionaire&#x27;s plan to revive the company.  Last week crypto","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/11144\/former-mt-gox-ceo-throws-cold-water-on-brock-pierces-plan-to-relaunch-the-infamous-exchange","publishDate":"2019-02-11T14:31:38","id":4340,"type":null,"title":"Former Mt. Gox CEO throws cold water on Brock Pierce&#x27;s plan to relaunch the infamous exchange","category":["EXCHANGES"],"content":["The man behind the much-maligned crypto exchange Mt. Gox is throwing cold water on one crypto billionaire's plan to revive the company.&nbsp;","Last week crypto investor Brock Pierce went on a <a href=\"https:\/\/www.theblockcrypto.com\/2019\/02\/09\/brock-pierce-is-looking-to-launch-a-5-million-vc-fund-to-invest-in-puerto-rico-based-entrepeneurs\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">media blitz<\/a>&nbsp;to share his plan to reboot of Mt. Gox, the proto-exchange that shut down after 650,000 bitcoin disappeared from the site's coffers. Pierce, who claims to own the majority of the defunct firm, is heading a “Gox Rising” movement with the goal to maximize creditor recovery though a quick payout. The next step would be to set up a new exchange in which all of the victims of the original Mt. Gox scam have an ownership stake represented by a token.&nbsp;","\"H<span class=\"s1\" data-v-f87c67ca=\"\">opefully we can all come together and agree that creditors deserve all the money,\" Pierce said in an interview with <a href=\"https:\/\/www.theblockcrypto.com\/2019\/02\/09\/brock-pierce-is-looking-to-launch-a-5-million-vc-fund-to-invest-in-puerto-rico-based-entrepeneurs\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">The Block<\/a>. \"That shouldn't be too hard a sell. Everyone should be in agreement regarding that fact. That's the main piece of it. So just trying to make sure that that happens, number one.\"<\/span>","But Mark Karpeles, Mt. Gox's former CEO, isn't buying Pierce's plan. Japanese authorities charged Karpeles with manipulation and embezzlement for his involvement in the demise of the exchange. He faces a potential verdict from a <a href=\"https:\/\/www.coindesk.com\/former-mt-gox-ceo-mark-karpeles-claims-innocence-as-trial-nears-end\" data-v-f87c67ca=\"\">Japanese court on March 15.<\/a> Further, he believes Mt. Gox isn't Pierce's to resurrect.","<iframe src=\"\/\/html5-player.libsyn.com\/embed\/episode\/id\/8562914\/height\/90\/theme\/custom\/thumbnail\/yes\/direction\/backward\/render-playlist\/no\/custom-color\/3a78a9\/\" width=\"100%\" height=\"90\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\" data-v-f87c67ca=\"\"><\/iframe>","Pierce claims that he entered a deal with Karpeles to purchase the firm from him in 2014.","\"<span class=\"s1\" data-v-f87c67ca=\"\">The buyout was 88%, and then I bought the 12% from Jed McCaleb for another Bitcoin, and it was my focus to go fix this on behalf of the industry,\" Pierce said.<\/span>","Karpeles told The Block in a phone interview that he only received a&nbsp;<a href=\"https:\/\/www.scribd.com\/document\/399259886\/SunLot-MtGox-LOI\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Letter of Intent to acquire Mt. Gox<\/a>. Karpeles said he forgot about it because Pierce never followed up on the purchase. The Letter of Intent said that in order for the acquisition to move forward, Karpeles needed court approval for the deal. Moreover, it also said that the definitive agreement would have to take place in less than 45 days. According to&nbsp;Karpeles, the court didn't approve the acquisition and there was no agreement within the 45 day period. The result? The letter \"doesn't have any value right now,\" said Karpeles.","In November 2017, <a href=\"https:\/\/www.reuters.com\/article\/us-bitcoin-gox-specialreport\/special-report-twice-burned-how-mt-goxs-bitcoin-customers-could-lose-again-idUSKBN1DG1UC\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Reuters reported<\/a> that Jeb McCaleb, co-founder of Mt. Gox, signed an agreement to sell a 12% stake to Sunlot Holdings for one bitcoin. Then, McCaleb told Reuters that he never received the bitcoin and that it's&nbsp;unclear to him whether the sale was actually completed.&nbsp;Karpeles told The Block that Pierce can’t be a shareholder because one of the rules in Mt. Gox's shareholders agreement was that any transfer of shares needed to be approved by all the shareholders. So in order to transfer the ownership of shares, there needed to be a call for a shareholder meeting, Karpeles said, which never happened.","Karpeles said that he is unsure why Pierce would even want to be a shareholder since they \"will receive absolutely nothing and there is no right at all.\"","\"Brock probably believes that the shareholders will receive the entire surplus, which was indeed the case when in bankruptcy but it’s not the case anymore with Civil Rehabilitation,\" Karpeles said.","Karpeles thinks that Pierce simply has outdated information.","\"Pierce's narrative is that he’s going to be kind enough to give the surplus to creditors but there is no surplus anyway,\" he said. \"Even if there was, he is not the shareholder of Mt. Gox so this is baseless.\"","Karpeles said&nbsp;the reason why Pierce would want to convince everyone he owns&nbsp;Mt. Gox could be that&nbsp;he wants to launch an ICO project around Mt. Gox. All the assets, including the name will be sold, to profit the creditors.&nbsp;Karpeles thinks relaunching Mt. Gox could be challenging. Even if someone still owns the Mt. Gox domain name, it’s possible that some trademarks have expired already.","Ultimately, Karpeles refused to accept that anyone would trust an exchange called Mt. Gox in the future.","\"In the case he somehow managed to launch a new exchange called Mt. Gox, which would take anywhere from six months to a year to get the necessary licenses, I don’t see any people using the exchange. No one wants to see something called Mt. Gox anymore,\" he said.","Pierce did not immediately respond to a request for comment.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gox","content":"PERSON"},{"type":"2014","content":"DATE"},{"type":"Brock","content":"PERSON"},{"type":"Pierce","content":"PERSON"},{"type":"Brock Pierce","content":"PERSON"},{"type":"Sunlot Holdings","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Karpeles","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Pierce","content":"ORGANIZATION"},{"type":"Karpeles","content":"PERSON"},{"type":"November 2017","content":"DATE"},{"type":"Letter of Intent","content":"ORGANIZATION"},{"type":"McCaleb","content":"PERSON"},{"type":"Mark Karpeles","content":"PERSON"},{"type":"12%","content":"PERCENT"},{"type":"March 15","content":"DATE"},{"type":"88%","content":"PERCENT"},{"type":"Civil Rehabilitation","content":"ORGANIZATION"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"Jed McCaleb","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Jeb McCaleb","content":"PERSON"}],"hashtag":[],"authors":["Larry Cermak","Frank Chaparro","The Block"]}