{"summary":"Three European fintech firms focused on facilitating investment in stocks and shares are hiring teams to build new crypto trading tools.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/95439\/european-investment-freetrade-plum-crypto-launches-bitcoin-surge","publishDate":"2021-02-19T12:20:26","id":4341,"type":null,"title":"European investment apps Freetrade and Plum plot crypto launches amid bitcoin&#x27;s surge","category":["BITCOIN"],"content":["Two European fintech firms focused on facilitating investments are hiring teams to build new crypto trading tools, The Block has learned.","London-headquartered Freetrade and Plum both have crypto products in the works. The former’s core business is to enable users to invest in individual stocks, while Plum currently offers baskets of stocks that vary by theme and risk.","Freetrade, which is backed by the venture capital firm Draper Esprit, is currently seeking a principal product manager for its crypto offering. The person will be tasked with “devising and owning” Freetrade’s crypto strategy and will be given “a blank sheet of paper,\" suggesting the specifics of the product are still to be fleshed out.","“This role will lead the scoping and implementation of an institutional-grade crypto offering on Freetrade,” a spokesperson told The Block, adding: \"This move into crypto has been in the works for some time now. Crypto assets are highly requested by our customers and are increasingly being acknowledged as a key part of long term, diversified portfolios.\"","Plum’s co-founder and CEO Victor Trokoudes, a TransferWise alumnus, recently posted on LinkedIn that the company is seeking product managers to help with “adding stocks and crypto” in the UK and Europe.","Trokoudes told The Block that Plum currently offers a selection of hand-picked mutual funds but plans to expand on this significantly this year by launching stocks, ETFs and, later, crypto.","“A significant percentage (30%) of our investors told us they wanted to explore crypto, and that was before the recent bull run that put crypto firmly in the headlines. It's a natural addition to our investment offering,” he added.","Meanwhile, Berlin-based neo-broker Trade Republic has recently hired Bryce Ferguson, former senior product manager at Coinbase.&nbsp;&nbsp;","A spokesperson for the company said “crypto is an exciting area we are constantly monitoring”, but clarified that Trade Republic has not committed to entering the market. Ferguson will be joining the general product team to work on the company's trading product, they added.&nbsp;","Trade Republic, which has been characterized as German's Robinhood, raised €62 million in April 2020 in a round led by Accel and Founders Fund.&nbsp;","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Correction:&nbsp;<\/strong><\/em><em data-v-f87c67ca=\"\">This report has been updated to correct the spelling of Victor Trokoudes's first name.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"April 2020","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Victor Trokoudes","content":"PERSON"},{"type":"30%","content":"PERCENT"},{"type":"Berlin","content":"LOCATION"},{"type":"Europe","content":"LOCATION"},{"type":"Accel","content":"ORGANIZATION"},{"type":"Trade Republic","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Bryce Ferguson","content":"PERSON"},{"type":"London","content":"LOCATION"},{"type":"Draper Esprit","content":"PERSON"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}