{"summary":"Rostin Behnam is continuing the CFTC&#x27;s push to widen its regulatory net into crypto spot markets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/177111\/crypto-spot-market-regulation-a-big-step-for-us-says-cftc-chair-amid-push-for-new-law","publishDate":"2022-10-13T15:55:44","id":4345,"type":null,"title":"Crypto spot market regulation a &#x27;big step for us&#x27; says CFTC chair, amid push for new law","category":["POLICY"],"content":["A U.S. markets regulator is continuing a very public push for expanded authority in crypto, with its leader acknowledging that it is \"a big step\" for the commodity derivatives agency.&nbsp;&nbsp;","The Commodity Futures Trading Commission has traditionally regulated derivatives on physical goods — from pork options to energy futures. But CFTC Chairman Rostin Behnam and his colleagues have pushed before both Congress and the public to expand their agency's authority to spot markets for cryptocurrency they consider commodities, because of the unusual nature of digital assets, which can be delivered near instantly.&nbsp;","“This is a big step for us,\" said Behnam before the Institute of International Finance on Thursday. \"But I've made the case, and the argument is, unlike traditional commodity markets, which are largely institutional and wholesale markets, we've seen commodity digital markets emerge that are retail oriented and speculative.\"","<a href=\"https:\/\/www.theblock.co\/post\/174527\/senior-u-s-regulators-propose-new-legislation-increased-rules-around-digital-assets\" data-v-f87c67ca=\"\">A council of U.S. financial regulators<\/a> recently recommended that Congress grant rulemaking authority to regulators for digital asset spot markets, which currently would include bitcoin and ether. The report does not specify an agency to hold that power, though the Senate Agriculture Committee has held a <a href=\"https:\/\/www.theblock.co\/post\/170439\/cftc-chair-asks-senators-for-more-authority-in-crypto-markets\" data-v-f87c67ca=\"\">hearing<\/a> on bipartisan legislation to grant the CFTC that power.&nbsp;","Just two days ago, Behnam <a href=\"https:\/\/www.theblock.co\/post\/176261\/cftc-chair-dont-expect-crypto-tech-to-be-a-free-pass-from-regulation\" data-v-f87c67ca=\"\">appeared at another event<\/a> promoting his agency's ability to handle the new regulatory perimeter.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"two days ago","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Rostin Behnam","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Behnam","content":"PERSON"},{"type":"Senate Agriculture Committee","content":"ORGANIZATION"},{"type":"Institute of International Finance","content":"ORGANIZATION"}],"hashtag":["CFTC","SEC"],"authors":["Kollen Post","The Block"]}