{"summary":"Beacon, the web3 startup accelerator launched by Polygon co-founder Sandeep Nailwal, has expanded with ten new startups in its third cohort.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274367\/sandeep-nailwal-web3-accelerator-beacon-third-cohort","publishDate":"2024-01-24T15:31:19","id":4348,"type":null,"title":"Sandeep Nailwal&#x27;s web3 accelerator Beacon unveils ten new startups from the latest cohort","category":["COMPANIES"],"content":["Beacon, the web3 startup accelerator launched by Polygon co-founder Sandeep Nailwal, has expanded with ten new startups in its third cohort.","The demo day for the graduating startups took place today, with founders presenting their pitches to investors, Beacon said. The startup accelerator runs two sessions each year, and this is its third batch since starting in January 2023.","\"This marks the one-year anniversary of Beacon,\" Nailwal told The Block. \"We've accelerated 33 startups, grown our investor network to over 500, and our companies have raised more than $150 million collectively.\"","<a href=\"https:\/\/www.theblock.co\/post\/196492\/polygon-co-founder-launches-web3-startup-accelerator-beacon\" data-v-f87c67ca=\"\">Beacon<\/a> is part of Nailwal's crypto venture firm <a href=\"https:\/\/www.theblock.co\/post\/165671\/polygon-and-cere-network-founders-launch-50-million-web3-fund\" data-v-f87c67ca=\"\">Symbolic Capital<\/a> and supports early-stage startups through mentorship and financing. Mentors include SoftBank director Neil Cunha-Gomes, Coinbase vice president of business development Dan Kim, EigenLayer founder Sreeram Kannan, and Pantera Capital managing partner Paul Veradittakit.","Beacon was founded with the goal of creating the next web3 100 unicorns. Nailwal expects \"multiple\" unicorns to emerge from the latest third cohort of ten startups.","The ten startups part of the latest cohort are Zero Gravity, a web3 modular infrastructure developer; Range Protocol, a DeFi asset management protocol; Fraction AI, a decentralized human-powered data labeling platform for training AI models; Sending Labs, a web3 communications platform; Fluent, an Ethereum Layer 2 developer; Mizu, a crypto payments platform; Maru, a blockchain scaling infrastructure developer; Moso, a crypto rewards provider; Inco Network, a Layer 1 blockchain developer; and HyperOracle, which aims to redefine smart contracts for AI-powered blockchains.","Now that these startups have graduated from Beacon, the accelerator is preparing to launch its fourth cohort, S24, in the coming days.","Applications for S24 will open shortly and will be available for around two months, said Sam Lehman, a core contributor at Beacon and principal at Symbolic Capital.","\"Then we'll spend a couple of months doing our interviews, selecting the new cohort, and aiming for the program to commence from May and extend into late August,\" Lehman said.","Beacon receives over 1,000 applications for its cohorts, Lehman said, adding that the accelerator selects 10 to 20 startups in each cohort after various rounds of interviews.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Neil Cunha","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"January 2023","content":"DATE"},{"type":"Beacon","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"Polygon","content":"ORGANIZATION"},{"type":"Inco Network","content":"ORGANIZATION"},{"type":"Lehman","content":"PERSON"},{"type":"Mizu","content":"ORGANIZATION"},{"type":"Maru","content":"ORGANIZATION"},{"type":"August","content":"DATE"},{"type":"Beacon","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Nailwal","content":"ORGANIZATION"},{"type":"EigenLayer","content":"ORGANIZATION"},{"type":"Symbolic Capital","content":"ORGANIZATION"},{"type":"SoftBank","content":"ORGANIZATION"},{"type":"Gomes","content":"PERSON"},{"type":"Sam Lehman","content":"PERSON"},{"type":"Dan Kim","content":"PERSON"},{"type":"Sreeram Kannan","content":"PERSON"},{"type":"Sandeep Nailwal","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Paul Veradittakit","content":"PERSON"},{"type":"$150 million","content":"MONEY"},{"type":"Lehman","content":"ORGANIZATION"}],"hashtag":["POLYGON","STARTUP ACCELERATORS"],"authors":["Yogita Khatri","The Block"]}