{"summary":"Paxos received two in-principle approvals in Abu Dhabi and is set to issue new stablecoins and offer crypto services from the ADGM.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265174\/paxos-stablecoin-abu-dhabi-expansion","publishDate":"2023-11-29T10:01:06","id":435,"type":null,"title":"Paxos expands to Abu Dhabi with two new in-principle approvals","category":["COMPANIES"],"content":["<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Crypto firm Paxos continues its international expansion, now snagging two preliminary approvals in Abu Dhabi.&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Paxos has received two in-principle approvals from the Financial Services Regulatory Authority in the Abu Dhabi Global Market to issue stablecoins and offer crypto brokerage and custody services, the company said Wednesday. The preliminary approvals are for two new entities of Paxos within the ADGM.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The full approvals are expected in the first half of next year, a Paxos spokesperson told The Block, adding that those will allow the company to issue new USD-backed as well as other currency-backed stablecoins from Abu Dhabi, although Paxos is currently focused on a new USD-backed stablecoin.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The Abu Dhabi expansion plan comes two weeks after Paxos <a href=\"https:\/\/www.theblock.co\/post\/263216\/paxos-new-usd-backed-stablecoin-singapore\" data-v-f87c67ca=\"\">received<\/a> in-principle approval from the Monetary Authority of Singapore for its new local entity that will launch a new USD-backed stablecoin in the country.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"Our IPAs from the FSRA, on the heels of our IPA from the Monetary Authority of Singapore, solidify our commitment to pursuing international growth through regulated frameworks,\" Walter Hessert, head of strategy at Paxos, said in a statement. \"We will continue expanding our regulatory licensing to serve global enterprises as a trusted, innovative partner.\"<\/span>","Paxos' ADGM unit, like its Singapore entity, will enable the company to establish partnerships similar to PayPal in the U.S., the spokesperson said. It will also be able to onboard Abu Dhabi-based customers for its crypto brokerage and custody services.","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Paxos was founded in 2012 and is backed by high-profile investors, including Bank of America, Peter Thiel's Founders Fund and Coinbase Ventures. The firm has raised over $540 million in total funding to date and was&nbsp;<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.theblock.co\/post\/103142\/paxos-raises-300-million-as-it-looks-to-onboard-more-paypal-sized-clients\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">valued at $2.4 billion<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;during its latest Series D round in 2021.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Peter Thiel","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"Walter Hessert","content":"PERSON"},{"type":"Paxos","content":"LOCATION"},{"type":"2012","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bank of America","content":"ORGANIZATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$2.4 billion","content":"MONEY"},{"type":"$540 million","content":"MONEY"},{"type":"Singapore","content":"LOCATION"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"Financial Services Regulatory Authority","content":"ORGANIZATION"},{"type":"Abu Dhabi Global Market","content":"ORGANIZATION"},{"type":"Abu Dhabi","content":"PERSON"},{"type":"Paxos","content":"ORGANIZATION"},{"type":"Abu Dhabi","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"IPA","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}