{"summary":"The SEC says Diana Mae Fernandez told customers she would invest in crypto, companies and real estate, and instead pocketed the money.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/269562\/sec-charges-self-styled-entrepreneur-with-fraud-after-promising-investments-in-crypto-and-pocketing-the-money","publishDate":"2023-12-28T12:32:24","id":4354,"type":null,"title":"SEC charges &#x27;self-styled entrepreneur&#x27; with fraud after promising investments in crypto and pocketing the money","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Securities and Exchange Commission says \"self-styled entrepreneur\" Diana Mae Fernandez conducted a \"fraudulent securities offering\" by saying she would use customer money to invest in crypto, among other things, and instead pocketed the money.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Fernandez, 37,&nbsp; promised guaranteed returns as high as 63% by claiming to invest customer money in crypto, private and publicly traded companies and luxury real estate, the SEC said in a litigation release posted on Thursday.&nbsp; She<\/span><span class=\"s1\" data-v-f87c67ca=\"\"> raised about $364,000 from at least 20 investors through two \"alter ego entities\" called \"The Self-Made Success\" and \"Diana Mae K., LLC,\" the agency said in a complaint filed on Dec. 21 in the Northern District of West Virginia.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Fernandez&nbsp; recruited many investors through church groups and social networking focused on entrepreneurs, the SEC added.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Instead of investing investor funds as promised, Fernandez commingled them with her own, using investor money to pay for her day-to-day living expenses and lavish hotel stays, fund numerous cash withdrawals, and make Ponzi-like payments to earlier investors,\" the SEC said in the complaint.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The former New Jersey resident told potential investors she had over 15 years of experience in investing and had raised $100 million across 25 countries, which the SEC said was false. She also told investors to wire money directly to her bank account or to send funds through PayPal, the SEC said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Fernandez exercised sole control over these accounts, but instead of using such funds as promised, she used the vast majority of investor proceeds for her personal benefit and the remainder to make Ponzi payments to investors to allow the fraud to continue,\" the agency said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Fernandez also spent investors' money on a trip to Barcelona and Paris, including a $2,000 purchase at an Apple Store, the agency said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Fernandez was charged for investment fraud in July by U.S. prosecutors, according to a <a href=\"http:\/\/statement\/\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">statement<\/span><\/a> from the Justice Department.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Multiple victims, including one from Marion County, West Virginia, invested an aggregate amount of over $300,000,\" the DOJ said. \"When it was time to deliver returns on the investments, Fernandez made false claims as to why dividends couldn't be paid and then used investors’ money for her own benefit.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Prosecutors say Fernandez was arrested in Serbia and faces up to 20 years in prison for each of the five counts.&nbsp;<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dec. 21","content":"DATE"},{"type":"West Virginia","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Serbia","content":"LOCATION"},{"type":"$100 million","content":"MONEY"},{"type":"Paris","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"New Jersey","content":"LOCATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Northern District of West Virginia","content":"LOCATION"},{"type":"Diana Mae Fernandez","content":"PERSON"},{"type":"$2,000","content":"MONEY"},{"type":"Diana Mae K.","content":"PERSON"},{"type":"the Justice Department","content":"ORGANIZATION"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"Barcelona","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Marion County","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"LLC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"63%","content":"PERCENT"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"$364,000","content":"MONEY"},{"type":"Fernandez","content":"PERSON"},{"type":"Apple Store","content":"ORGANIZATION"},{"type":"$300,000","content":"MONEY"}],"hashtag":["SEC"],"authors":["Sarah Wynn","The Block"]}