{"summary":"To mitigate the issue, one major mining firm said it intends to continue chartering flights to ensure their deliveries are on-time.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/123133\/supply-chain-crisis-bitcoin-mining-shipments","publishDate":"2021-11-03T11:33:04","id":4359,"type":null,"title":"The global supply chain crisis is disrupting bitcoin miner shipments","category":["MINING"],"content":["U.S. Bitcoin mining firms are experiencing delays for their equipment on order from China amid a global supply chain crisis.","Several large Bitcoin mining operations listed in North America, including Riot Blockchain, Bitfarms and Marathon Digital, have revealed shipment disruption in their recent production updates as a result of the <a href=\"https:\/\/www.cbsnews.com\/news\/supply-chain-issues-us-china\/\" data-v-f87c67ca=\"\">ongoing global logistics issue<\/a> over the past two months.","Texas-based Riot Blockchain said in early October that as of the end of September, its operating mining fleet had about 25,646 miners. It said that 2,000 units of Bitmain's AntMiner S19J Pro were shipped in late September and another 4,000 units were scheduled to be shipped from Bitmain's factory in Malaysia in early October.&nbsp;","But per Riot's update on Wednesday, its deployed mining fleet has only increased by 1,624 units in October. It said now 11,500 units of AntMiner S19J Pro under previous purchase orders are expected to be shipped to its Texas facility in November. But it remains to be seen how many of the pending amounts can be delivered by the end of this month.","Riot said although the global logistics problems have disrupted some miner shipment schedules, the impacts to date \"have not been material\" and it's working with Bitmain and logistics providers to mitigate the issue where possible.&nbsp;","Canada-headquartered Bitfarms, on the other hand, already experienced shipments disruption in September. It was originally scheduled to receive 7,230 units of Bitmain's AntMiner S19J Pro from September to December. The first batch of 2,200 units was supposed to arrive by the end of September but it only received 540 units.&nbsp;","\"Due to supply chain and shipping delays, the other 1,660 Bitmain S19j Pro miners originally scheduled for September delivery are en route and expected to be received in October,\" Bitfarms said in early October.","By the end of October, Bitfarms received and deployed 2,869 units of the S19j Pro, about 40% of the pending batch. \"The remaining 4,361 Bitmain S19j Pro and 400 MicroBT M30S miners scheduled for delivery this year are en route and are expected to be received in multiple batches in November,\" Bitfarm said.","Marathon Digital also anticipated potential logistics disruption two months ago. As of September 1, it had 111,416 units of AntMiners on order scheduled to be fully delivered by the end of June 2022. That means it needs to receive, on average, about 11,000 units every month to eventuallyachieve its expected growth rate.","Marathon received about 5,400 units throughout September. \"In September, global logistics issues began to impact shipments, elongate delivery times, and affect the original deployment schedule of miners,\" Marathon said in an update in early October.","But it appears the firm has managed to somewhat mitigate the logistics issue last month by paying up premiums. Marathon said on Tuesday that it received over 15,000 units of the pending orders in October alone.","\"We also began chartering planes in October to expedite the delivery of our miners and to mitigate the adverse effects of global logistics issues on our growth. By chartering planes, we decreased the average time it took for miners to be shipped and delivered by approximately 50% from September to October,\" Marathon said on Tuesday, adding:","\"Providing it remains economically viable to do so, it is our intention to continue chartering flights to ensure the on time delivery of our miners.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"AntMiner S19J","content":"ORGANIZATION"},{"type":"Marathon","content":"ORGANIZATION"},{"type":"Malaysia","content":"LOCATION"},{"type":"September 1","content":"DATE"},{"type":"Bitmain","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"November","content":"DATE"},{"type":"40%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"September","content":"DATE"},{"type":"Riot Blockchain","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Bitfarm","content":"PERSON"},{"type":"Bitmain","content":"ORGANIZATION"},{"type":"June 2022","content":"DATE"},{"type":"North America","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Bitfarms","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"Texas","content":"LOCATION"},{"type":"October","content":"DATE"},{"type":"Marathon Digital","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Wolfie Zhao","The Block"]}