{"summary":"Argentina is moving to tighten its grip on crypto in the inflation-rattled country, having issued guidance that prohibits some companies from certain activities.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230262\/argentina-tightens-grip-crypto","publishDate":"2023-05-10T13:21:54","id":4361,"type":null,"title":"Argentina is trying to tighten its grip on crypto","category":["COMPANIES"],"content":["Argentina's central bank is moving to tighten its grip on <a href=\"https:\/\/www.theblock.co\/post\/226106\/argentina-crypto-currency\" data-v-f87c67ca=\"\">crypto transactions in the inflation-rattled country<\/a>, having last week issued <a href=\"https:\/\/bcra.gob.ar\/Noticias\/proveedores-servicio-pago-no-pueden-operar-criptoactivos.asp\" data-v-f87c67ca=\"\">new guidance<\/a> that prohibits some companies from certain activities.","Specifically, registered payment service providers <a href=\"https:\/\/chambers.com\/content\/item\/4726\" data-v-f87c67ca=\"\">known locally as PSPCPs<\/a> may not carry out or facilitate operations with digital assets that are not regulated and authorized by the central bank. The notice, dated May 4, says that the providers won't be able to carry out the transactions on their own, or initiate them on their apps or web platforms.&nbsp;","Companies <a href=\"https:\/\/www.bcra.gob.ar\/SistemasFinancierosYdePagos\/Proveedores-servicios-de-pago-ofrecen-cuentas-de-pago.asp\" data-v-f87c67ca=\"\">formally registered<\/a> with the central bank as payment service providers include large players in the space such as MercadoLibre, Bind Pago, Mobbex, Nubi and Pomelo. The rules appear to target \"automatic purchase buttons,\" and interested users who want to conduct such transactions \"should do it on their own accord.\"","The central bank said that the new measure aimed to \"mitigate the risks that operations with these assets could generate for users of financial services and the national payment system.\"","Crypto use in the country has been rising, especially as Argentines rush to protect their savings in the face of annual inflation above 100%, multiple exchange rates and capital controls. Still, widespread adoption has faced obstacles, especially with fear of volatility and widespread skepticism about possible scams.&nbsp; &nbsp;&nbsp;","Bitcoin Argentina, an NGO that works to promote the use of cryptocurrency and decentralized technology in the country, called the measure surprising and arbitrary.&nbsp;","\"It's not understood what objective the central bank is seeking by prohibiting an activity that is entirely satisfactory and useful for the clients of the local exchanges,\" it said in an emailed statement. \"This will have the immediate effect of making it difficult for Argentine workers and savers to access savings alternatives that protect them from inflation.\"","The NGO also said it would promote informal solutions, \"where the risks and costs are much greater for the saver.\"","Marcos Zocaro, an accountant and spokesperson for the group, said the central bank move was reminiscent of actions it took last year to prohibit crypto transactions after a local bank had&nbsp;started offering retail customers the ability to purchase crypto from a third party on its platform.&nbsp;","\"In less than 48 after that, rules came out that prohibited Argentine banks from facilitating the purchase of cryptocurrencies,\" he said, adding that registered payment companies were now facing the same restriction. Of that group, Zocaro said MercadoLibre's MercadoPago service was by far the largest in the country.&nbsp;","\"The rules are very grey, though,\" he said, noting that there were still different interpretations about how much payment service providers would be able to work with crypto exchanges. He said they would appear to impede MercadoPago from offering more expansive crypto services in Argentina like it does in Brazil.&nbsp;","MercadoLibre didn't respond to requests for comment.","Argentine officials caught the attention of some in the sector earlier in the year, <a href=\"https:\/\/www.imf.org\/-\/media\/files\/publications\/loi\/2022\/arg030322.ashx\" data-v-f87c67ca=\"\">when they told<\/a> the International Monetary Fund that the country was taking \"important steps\" to \"discourage the use of crypto-currencies with a view to preventing money laundering, informality and disintermediation.\"","The IMF didn't respond to a request for comment on whether or not it had wanted Argentina to restrict crypto in the country as part of an economic support plan.&nbsp;","Binance, which launched a prepaid crypto card in the country last year with Mastercard, said it had not been impacted by the new regulations.&nbsp;","\"Our fiat ramp, as well as&nbsp;<span class=\"il\" data-v-f87c67ca=\"\">Binance<\/span>&nbsp;Card and&nbsp;<span class=\"il\" data-v-f87c67ca=\"\">Binance<\/span> Pay, continue to operate normally,\" a company spokesperson said in an emailed response to questions.&nbsp;","Bitso, a Latin American-focused crypto exchange that operations in the country, said it was also not affected by the new rules and noted that it was regulated by European authorities.&nbsp;","\"Our entire team is working to understand the reach and implementation of the rules,\" <a href=\"https:\/\/twitter.com\/BitsoArg\/status\/1654480471026196483\" data-v-f87c67ca=\"\">the company said on Twitter<\/a>, adding that it was not registered as a payment service provider in Argentina.&nbsp;","More Reading: <a href=\"https:\/\/www.theblock.co\/post\/226106\/argentina-crypto-currency\" data-v-f87c67ca=\"\">Crypto should be perfect for Argentina's currency nightmare. So why aren't more people using it?<\/a>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"May 4","content":"DATE"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"Zocaro","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"IMF","content":"ORGANIZATION"},{"type":"Brazil","content":"LOCATION"},{"type":"Mobbex","content":"LOCATION"},{"type":"Argentina","content":"LOCATION"},{"type":"100%","content":"PERCENT"},{"type":"Twitter","content":"DATE"},{"type":"Marcos Zocaro","content":"PERSON"},{"type":"Nubi","content":"PERSON"},{"type":"Binance<\/span>&nbsp;Card","content":"ORGANIZATION"},{"type":"NGO","content":"ORGANIZATION"},{"type":"Bind Pago","content":"LOCATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}