{"summary":"Interbank messaging service SWIFT has linked up with Chainlink Labs on a cross-chain interoperability proof-of-concept project.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173516\/swift-chainlink-labs-reveal-work-on-cross-chain-proof-of-concept","publishDate":"2022-09-28T15:28:17","id":4363,"type":null,"title":"SWIFT, Chainlink Labs reveal work on cross-chain proof-of-concept","category":["DEFI"],"content":["Interbank messaging service SWIFT has linked up with Chainlink Labs on a cross-chain interoperability proof-of-concept project.","The proof-of-concept involves Chainlink's Cross-Chain Interoperability Protocol, which allows for token transfers across blockchains as well as the development of cross-chain applications.&nbsp;","The tie-up was announced during an event in New York on Wednesday. During the panel, Chainlink co-founder and Sergey Nazarov and SWIFT strategy director Jonathan Ehrenfeld Solé framed the project with a focus on the difficulties in bridging the worlds of traditional and decentralized finance.&nbsp;","SWIFT is no stranger to blockchain experiments. The messaging network operator <a href=\"https:\/\/www.theblock.co\/linked\/128478\/swift-will-test-how-it-might-play-a-role-in-asset-tokenization-next-year\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">announced<\/a> a bid last year to test the tokenization of real-world assets, and the Chainlink Labs partnership fits within that framework.&nbsp;","<a href=\"https:\/\/www.theblockcrypto.com\/news+\/127771\/what-the-heck-is-a-cross-chain-swap\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Cross-chain capabilities<\/a> have been the focus of numerous projects in the past year, with development teams focused on developing secure ways to move assets from one chain to the next. But cross-chain mechanisms have proven to be a significant security challenge, with so-called bridges being <a href=\"https:\/\/www.theblock.co\/post\/160731\/nomad-cross-chain-crypto-bridge-suffers-possible-exploit\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">targeted<\/a> by hackers and code exploiters.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Jonathan Ehrenfeld Solé","content":"PERSON"},{"type":"Sergey Nazarov","content":"PERSON"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}