{"summary":"The head of the Monetary Authority of Singapore spoke about digital assets and crypto on Monday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/166290\/singapore-may-adopt-tougher-rules-for-retail-crypto-market","publishDate":"2022-08-29T13:10:33","id":4370,"type":null,"title":"Singapore may adopt tougher rules for retail crypto market","category":["POLICY"],"content":["The Monetary Authority of Singapore may adopt stricter rules for retail crypto market participants, managing director Ravi Menon said Monday.","The city-state's <em data-v-f87c67ca=\"\">de facto<\/em> central bank sought to differentiate how MAS has supported work on distributed ledger tech and areas such as tokenization while warning about speculative market activities, speaking during the Green Shoots Seminar, a fintech-focused event the MAS co-organized.","Singapore is often seen as being at the forefront of the crypto industry, with licensing and regulatory framework, but the regulations are focused on money laundering and terrorist financing risks rather than consumer protection. Reviews and public consultations are underway to strengthen regulation in for consumers and MAS is targeting to consult on proposed measures in the next few months, Menon said last month.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"Adding frictions on retail access to cryptocurrencies is an area we are contemplating,\" Menon said, according to <a href=\"https:\/\/www.mas.gov.sg\/news\/speeches\/2022\/yes-to-digital-asset-innovation-no-to-cryptocurrency-speculation\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">a published copy<\/a> of his remarks.&nbsp; \"These may include customer suitability tests and restricting the use of leverage and credit facilities for cryptocurrency trading.\"","Banning retail access to cryptocurrencies is not likely to work as access is easy and crypto is borderless, Menon said.&nbsp;","\"Cryptocurrencies have taken a life of their own outside of the distributed ledger – and this is the source of the crypto world’s problems,\" Menon said. \"Cryptocurrencies are actively traded and heavily speculated upon, with prices that have nothing to do with any underlying economic value related to their use on the distributed ledger. The extreme price volatility of cryptocurrencies rules them out as a viable form of money or investment asset.\"&nbsp;","The MAS doesn't want to chase away initiatives, however.","\"The most promising use cases of digital assets in financial services are in cross-border payment and settlement, trade finance, and pre-and post-trade capital market activities,\" he said, and the authority seeks \"to anchor in Singapore crypto players who can value add to our digital asset ecosystem and have strong risk management capabilities.\"","Menon also appeared to rule out any near-term prospects for a Singapore-based retail central bank digital currency (CBDC), though the MAS has conducted research and development in this area.","\"The case for a retail CBDC in Singapore is not compelling for now, given well-functioning payment systems and broad financial inclusion,\" he said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Monday","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"Ravi Menon","content":"PERSON"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Menon","content":"PERSON"},{"type":"last month","content":"DATE"},{"type":"MAS","content":"ORGANIZATION"},{"type":"fintech","content":"ORGANIZATION"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}