{"summary":"The Australian Securities and Investment Commission temporarily suspended the offering and distributing of bitcoin, ether and filecoin in Holon Investments.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/177615\/australian-authority-temporarily-suspends-three-holon-investments-crypto-funds","publishDate":"2022-10-17T07:03:15","id":4375,"type":null,"title":"Australian authority temporarily suspends three Holon Investments crypto funds","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">The Australian Securities and Investment Commission (ASIC)&nbsp;temporarily suspended crypto asset manager Holon Investments from its retail services for three crypto funds, citing non-compliant target market determinations in an <\/span><a href=\"https:\/\/asic.gov.au\/about-asic\/news-centre\/find-a-media-release\/2022-releases\/22-278mr-asic-places-interim-stop-orders-on-holon-crypto-funds\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">official statement<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">Holon Investments is suspended from offering or distributing bitcoin, ether and filecoin for 21 days — unless revoked earlier.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Australian financial regulator did not agree with Holon Investments opening up “very risky and speculative” assets to an audience of lower-certainty profiles.&nbsp;<\/span><span data-v-f87c67ca=\"\">ASIC made this order “to protect retail investors from potentially investing in funds that may not be suitable for their financial objectives, situation or needs,” the statement reads.<\/span>","<span data-v-f87c67ca=\"\">Specifically, ASIC targeted the three cryptocurrencies for their complexity and volatility — and expressed concern that the Sydney-based asset manager did not appropriately consider those features. All three funds are managed by crypto exchange Gemini, CoinDesk <\/span><a href=\"https:\/\/www.coindesk.com\/policy\/2022\/10\/17\/australian-regulator-suspends-holons-crypto-funds-managed-by-gemini\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reported<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">If the regulator’s concerns are not adequately addressed, ASIC will put down final stop orders. <\/span><span data-v-f87c67ca=\"\">\"Holon will have an opportunity to make submissions to ASIC before any final stop order is made,\" the statement says.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Holon","content":"DATE"},{"type":"Australian Securities and Investment Commission (ASIC","content":"ORGANIZATION"},{"type":"Sydney","content":"LOCATION"},{"type":"crypto exchange Gemini","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Holon Investments","content":"ORGANIZATION"}],"hashtag":["BITCOIN","GEMINI"],"authors":["Inbar Preiss","The Block"]}