{"summary":"GBTC is a closed-end fund with a 2% annual fee and is trading at a nearly 50% discount compared to the bitcoin price.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/196193\/grayscale-gbtc-etf-return-capital","publishDate":"2022-12-19T06:55:46","id":4379,"type":null,"title":"Grayscale may return some capital to investors if GBTC&#x27;s ETF dreams fail","category":["FINANCE FIRMS"],"content":["Grayscale Investments will explore how to return up to 20% of its Grayscale Bitcoin Trust's capital to shareholders if it cannot turn the product into an exchange-traded fund (ETF).","A tender offer of no more than 20% of the outstanding shares could be on the table, according to a letter from the firm's chief executive Michael Sonnenshein <a href=\"https:\/\/grayscale.com\/end-of-year-ceo-letter-to-investors-2022\/\" data-v-f87c67ca=\"\">sent<\/a> to shareholders. A timeline still needed to be clarified and two separate approvals would be required.","The Wall Street Journal first <a href=\"https:\/\/www.wsj.com\/articles\/if-grayscales-bitcoin-etf-dreams-fail-firm-may-try-a-tender-offer-ceo-says-11671428078\" data-v-f87c67ca=\"\">reported<\/a> the letter that showed Grayscale's intention to try a tender offer if the firm's could not turn the product into an ETF.","The Grayscale Bitcoin Trust carries the ticker GBTC and is a closed-end fund, with a 2% annual fee. It's currently trading at a nearly 50% discount compared to the bitcoin price.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/structured-products\/premium-of-gbtc\/embed\" title=\"Daily GBTC Premium\/Discount to NAV\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","\"If GBTC is able to conduct a tender offer for a portion of the GBTC shares, following the tender offer, we currently expect that we would continue operating GBTC without an ongoing redemption program until we are successful in converting it to a spot bitcoin ETF, although we may consider doing additional tender offers thereafter, subject to obtaining SEC relief,\" said Sonnenshein in the letter.","There are no plans to dissolve GBTC completely in the event that some portion of capital cannot be returned to shareholders, Sonnenshein said. Instead, Grayscale would continue to operate GBTC without a redemption program until they successfully covert it to a spot bitcoin ETF.","Shares in GBTC cannot currently be redeemed, which forces sellers to part with their holdings at a discount. Converting GBTC into an exchange-traded fund could resolve this.","However, the U.S. Securities and Exchange Commission (SEC) has thus far proven harshly critical of spot bitcoin ETFs — having rejected every application for years. Grayscale is currently involved in a lawsuit against the SEC.","As part of the lawsuit, Grayscale is currently in the process of the drafting a response to the SEC's reply brief, which is due by Jan. 13, 2023. Final written briefs are due on Feb. 3, 2023 then shortly thereafter a three judge panel will be selected to hear oral arguments and rule on the case, Sonnenshein clarified in the letter.","\"We remain steadfast in our belief that the conversion of GBTC to an ETF is in the best interest of investors, and we remain 100% committed to that endeavor,\" said Sonnenshein. \"This is and always has been the business priority for the Grayscale team.\"","<em data-v-f87c67ca=\"\"><span class=\"TextRun SCXW77471392 BCX0\" lang=\"EN-US\" xml:lang=\"EN-US\" data-contrast=\"auto\" data-v-f87c67ca=\"\"><span class=\"NormalTextRun SCXW77471392 BCX0\" data-v-f87c67ca=\"\">Update: This story has been updated with more details from Grayscale's letter to shareholders.<\/span><\/span><\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"GBTC","content":"ORGANIZATION"},{"type":"Feb. 3, 2023","content":"DATE"},{"type":"Grayscale Bitcoin Trust","content":"ORGANIZATION"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"2%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"Jan. 13, 2023","content":"DATE"},{"type":"Grayscale Investments","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"Sonnenshein","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Michael Sonnenshein","content":"PERSON"}],"hashtag":["HEDGE FUNDS"],"authors":["Adam James","Kari McMahon","The Block"]}