{"summary":"Marinade Finance will reward users with a total of 160 million marinade tokens for depositing SOL over the next 12 months.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/205374\/marinade-finance-announces-rewards-to-boost-liquid-staking-on-solana","publishDate":"2023-01-25T07:29:28","id":4381,"type":null,"title":"Marinade Finance announces rewards to boost liquid staking on Solana","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Marinade Finance, a liquid staking protocol for the Solana blockchain, has announced a token incentive program to reward users who deposit their solana (SOL) coins in exchange for a liquid staking derivative, mSOL.<\/span>","The program, called \"Open Doors,\" will give out up to 160 million marinade tokens (worth some $9.6 million) as rewards to users over the next 12 months. The goal is to grow the amount of solana locked on the Marinade platform by 40 million SOL, the team <a href=\"https:\/\/twitter.com\/MarinadeFinance\/status\/1617944711154794496\" data-v-f87c67ca=\"\">said<\/a> on Twitter.&nbsp;","<span data-v-f87c67ca=\"\">Liquid staking allows users to receive a token that represents their staked assets. These tokens, in this case mSOL, can then be used in other decentralized finance (DeFi) protocols or for trading, but must be returned to unlock the original staked assets. This approach to staking allows users to free up liquidity and generate extra yield on assets that are being staked.<\/span>","<span data-v-f87c67ca=\"\">Currently, less than 3% of all SOL is used for liquid staking, according to Marinade's <a href=\"https:\/\/twitter.com\/MarinadeFinance\/status\/1617944715403603975\" data-v-f87c67ca=\"\">estimates<\/a>. However, as more users make use of liquid staking, this is expected to change. The team behind Marinade believes that a growth in liquid staking will have a significant impact to boost liquidity across various protocols in the Solana ecosystem.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$9.6 million","content":"MONEY"},{"type":"3%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Marinade","content":"ORGANIZATION"},{"type":"Marinade Finance","content":"ORGANIZATION"},{"type":"Solana","content":"LOCATION"}],"hashtag":["STAKING"],"authors":["Vishal Chawla","The Block"]}