{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley. They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/16951\/bitcoin-mining-hardware-delivery-mishap-leads-to-breach-of-contract-claim","publishDate":"2019-03-22T13:58:30","id":4382,"type":null,"title":"Bitcoin mining hardware delivery mishap leads to breach of contract claim","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\". This week’s guest post by <a href=\"https:\/\/twitter.com\/FinTechAttorney\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Justin Steffen<\/a> is “JCS”","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]Timefire, Inc. v. Aqs Eng’G, 2019 Cal. App. Unpub. LEXIS 1809 (Cal. App. 1st, March 18, 2019) [SDP]<br data-v-f87c67ca=\"\">\n<\/strong><\/em>","New money, old law. This is a breach of contract case involving mining hardware (not coal mining or gold mining). The issue before the court was whether there was sufficient evidence to support the jury’s damages award for the plaintiff. Citing an 1897 opinion that had nothing to do with bitcoin, the Court said there was.","Plaintiff sued defendant for $550,000 for failing to deliver 222 of 300 circuit boards it had agreed to assemble and deliver. The defendant was a company that specialized in designing printed circuit boards (“PCBs”) for hardware designers. Plaintiff entered into a contract with the defendant to manufacture a PCB to be used for Bitcoin mining.","As part of the contractual arrangement, a third party called HashFast was to present at the manufacturing site and assist with any needed modifications of the boards and final performance testing. Following assembly (and successful testing) the boards were to be delivered to the plaintiff.","Things apparently didn’t go according to plan. Instead of delivering a final batch of 222 PCBs to plaintiff, it delivered them to HashFast which … “sold the boards, kept the profit, and went bankrupt.” (Those are bad facts, as a lawyer I used to work with liked to say).","Plaintiff sued for breach of contract seeking damages equal to the sale price of the boards delivered to HashFast. Instead, the jury entered a verdict of $337,000, awarding Plaintiff an amounts slightly more than HashFast had charged and received (a discounted price of $1,500 per board) but less than the amount Plaintiff claimed it could have sold the boards for ($2,500) per board.","Now you might ask yourself how exactly it is that the Plaintiff is sued the manufacturer for money someone else was paid and here is where contract law and remedies come into play. The Court said that the evidence showed that the Plaintiff had pre-paid for 300 PCBs at a total cost $28,950. 222 of them were delivered to someone else, who sold them for $1,500 per PCB. The court said this calculation was supported by evidence of prior sales, making the lost profits claim not at all speculative, and quoted a late 19th century case to buttress this point: “One of the oldest precepts in damages law in this state applies well here. Where AQS “by [its] own wrong forced [TimeFire] into the strait of proving damages, [it] cannot complain that the latter used the best methods left” to make itself whole.”","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part I of this week's analysis, Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Justin Steffen","content":"PERSON"},{"type":"the Court","content":"ORGANIZATION"},{"type":"PCB","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Cal","content":"LOCATION"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"19th century","content":"DATE"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"1897","content":"DATE"},{"type":"$28,950","content":"MONEY"},{"type":"$1,500","content":"MONEY"},{"type":"$550,000","content":"MONEY"},{"type":"2019 Cal","content":"LOCATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"$337,000","content":"MONEY"},{"type":"Timefire, Inc.","content":"ORGANIZATION"},{"type":"1809","content":"DATE"},{"type":"Palley","content":"PERSON"},{"type":"Stephen Palley","content":"PERSON"},{"type":"$2,500","content":"MONEY"},{"type":"Rosario","content":"PERSON"},{"type":"JCS","content":"ORGANIZATION"},{"type":"March 18, 2019","content":"DATE"}],"hashtag":["HARDWARE"],"authors":["Stephen D. Palley","The Block"]}