{"summary":"Royalties earned for NFT creators hit a two-year low, according to crypto data firm Nansen.\nThe diminished residual returns for NFT creators comes amid lowest-ever floor prices among blue-chip NFT projects. ","author":["MK Manoylov","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237830\/earnings-from-nft-royalties-hits-two-year-low-nansen","publishDate":"2023-07-05T11:27:01","id":439,"type":null,"title":"Earnings from NFT royalties hits two-year low: Nansen","category":["NFT Collections"],"content":["Earnings from NFT royalties hit their lowest volume since 2021, according to crypto data firm Nansen.","\"OpenSea had been the dominant platform for distributing royalties to NFT projects until February 2023,\" Nansen stated in a new report on NFT royalties. It added that the landshape shifted when Blur introduced requirements for royalties and OpenSea adapted its policies.","\"Currently, OpenSea and Blur are on par with each other when it comes to the royalties paid through their respective marketplaces, with more royalties paid on Blur when the trading volume surges,\" it noted.","While NFT earnings have declined, some top projects have still earned a lot from them. <a href=\"https:\/\/www.theblock.co\/post\/237602\/bored-ape-nft-pricing-nears-two-year-low\" data-v-f87c67ca=\"\">Bored Ape Yacht Club<\/a> (BAYC) has seen a total of 22,288 ETH ($42.2 million) in all-time royalties, per Nansen data. <a href=\"https:\/\/www.theblock.co\/post\/237484\/azuki-floor-price-crumbles-with-holders-down-21500-per-nft\" data-v-f87c67ca=\"\">Azuki<\/a>, which has been under a lot of controversy recently, has recorded 17,362 ETH ($33 million) in all-time royalties.","BAYC NFTs reached its lowest floor price in over a year this week. The minimum cost of this blue-chip NFT hit a low of 27.03 ETH (around $51,500) before rising to 29 ETH as of publication, The Block's data shows. The price of other popular NFT projects fell as well, with CryptoPunks hitting a 41 ETH ($78,000) minimum cost and Azuki plummeting to a 8 ETH ($15,000) floor price.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/art-collectibles\/floor-price-of-art-and-collectibles-nfts\/embed\" title=\"Floor Price of Popular NFTs\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","In 2022, NFT creators earned <a href=\"https:\/\/www.theblock.co\/post\/179004\/nft-royalties-have-generated-1-8-billion-with-nike-bayc-coming-out-top-galaxy\" data-v-f87c67ca=\"\">$1.8 billion<\/a> in royalties, with the top 10 projects netting $489 million in residual earnings."],"hashtag":["AZUKI","BAYC","BLUR","OPENSEA"]}