{"summary":"The CFTC chair outlined his vision for increased guardrails around digital assets, including whether companies listing crypto derivatives need tighter rules on employee trading, and continued his push to give the agency more authority over spot markets. CFTC&#x27;s Behnam says the agency ready to step in to fill the regulatory gap in cryptocurrency, while predicting another strong year of enforcement cases in the industry.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/208587\/cftc-well-positioned-to-fill-regulatory-gap-in-crypto-behnam","publishDate":"2023-02-03T14:48:36","id":4390,"type":null,"title":"CFTC &#x27;well-positioned&#x27; to fill regulatory gap in crypto: Behnam","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Turmoil in the cryptocurrency markets shows action is needed and the Commodity Futures Trading Commission is “well-positioned” to fill a regulatory gap in cryptocurrency markets if Congress chooses, the agency’s chair said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The agency is also “working towards another strong year of precedent setting cases,” following the spectacular fall of crypto exchange FTX and other companies’ failures over the past few months, CFTC Chair Rostin Behnam said.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“The bankruptcies, failures, and runs only validate that action is needed,” Behnam said at an American Bar Association meeting. “The ecosystem is vast, will not vanish, and needs comprehensive legislation.” &nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Lawmakers introduced bills last year to regulate crypto including the Digital Commodities Consumer Protection Act, or DCCPA. That bill <\/span><span class=\"s1\" data-v-f87c67ca=\"\">had support from former FTX CEO Sam Bankman-Fried and would give the commodities agency the authority to regulate digital assets. The bill would need to be reintroduced this year. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Behnam said the CFTC will continue to work with new stakeholders.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">To date the agency has brought 69 enforcement actions involving digital assets, which Behnam said shows the “outstanding capacity” of its staff. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Some of the prominent cases included a first for the agency, such as <a href=\"https:\/\/www.theblock.co\/post\/172274\/cftc-files-lawsuit-against-decentralized-autonomous-organization\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">a complaint<\/span><\/a> filed against Ooki DAO in September alleging that it has been illegally running a futures exchange. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Along with the Securities and Exchange Commission, the agency also brought civil charges in December against FTX, Bankman-Fried and Alameda Research for misappropriating customer funds. The Justice Department is separately pursuing a criminal case against Bankman-Fried.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Behnam said the agency’s Division of Market Oversight is considering whether designated contract markets that list crypto-based derivatives contracts, or are affiliated with crypto spot markets, should adopt policies to restrict trading by certain employees. Designated contract markets, or DCMs, are companies that allow the trading of derivatives. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Cyber risk will get its own rulemaking, Behnam said. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“The growth of cybersecurity threats to financial institutions is well-documented and widely recognized as an important and increasingly urgent problem,” Behnam said. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The agency too has brought cases against firms for not following certain cybersecurity policies. In 2019, a firm settled charges with the CFTC after the agency said the firm&nbsp;allowed cyber criminals to breach email systems and&nbsp;did not disclose the breach to customers in a timely manner. &nbsp;<\/span>","Behnam's remarks come after the derivatives trading arm of financial company Ion Markets was hit by a hack earlier this week, affecting its activity.","<span class=\"s1\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Justice Department","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Rostin Behnam","content":"PERSON"},{"type":"Ooki DAO","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"’s Division of Market Oversight","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"Behnam","content":"PERSON"},{"type":"American Bar Association","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"}],"hashtag":["CFTC"],"authors":["Sarah Wynn","The Block"]}