{"summary":"Crypto derivatives exchange BitMEX has announced it will begin requiring users to verify their identities at the end of the month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/74871\/bitmex-kyc-bitcoin-derivatives","publishDate":"2020-08-13T21:00:10","id":4396,"type":null,"title":"Crypto derivatives exchange BitMEX is set to implement know-your-customer procedures","category":["EXCHANGES"],"content":["Crypto derivatives exchange BitMEX announced Thursday it would start asking users to verify their identities at the end of the month.","Known for being a pioneer in crypto derivatives and high-leverage trading, BitMEX typically facilitates the trading of $1 billion worth of crypto a day, per data provided by Skew. In a <a href=\"https:\/\/blog.bitmex.com\/announcing-the-bitmex-user-verification-programme\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">blog post<\/a>, the firm said it would launch its new User Verification Program on August 28. BitMEX said that \"all customers will be asked to complete ID checks within the next 6 months.\"","The exchange will require users to upload documents confirming their identity and location. In a sense, it is a departure from the crypto-native, libertarian brand the firm has been known for, but it could help BitMEX expand into new jurisdictions and avoid the ire of regulators. The U.S. Commodity Futures Trading Commission launched an investigation into the Seychelles-registered firm for allowing Americans to trade on the exchange, a source told <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2019-07-19\/u-s-regulator-probing-crypto-exchange-bitmex-over-client-trades\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Bloomberg News<\/a> in July 2019.&nbsp;","In an interview with The Block, BitMEX's Ben Radclyffe said the firm's goal in adding new know-your-customer (KYC) procedures would help in the long-term by making things \"more transparent, accurate when discussing things with regulators and supporting those regulators.\"&nbsp;","To be sure, it could serve as a headwind in the short-term, Radclyffe admitted. A number of new trading venues have sprung up in recent months that don't require the type of verification process BitMEX will now implement. Already, such venues have seized market share from BitMEX and the move could accelerate that, industry insiders say.&nbsp;","<em data-v-f87c67ca=\"\">Source: The Block Research<\/em>","Still, Radclyffe says that certain clients have asked the exchange to roll out these procedures. He added that \"a decent proportion of our volumes is verified.\"","As for the specifics of the program, the blog post said that users across the platform would have to go through a four-step process:","\"Individual users will be prompted to upload a photo ID and proof of address, take a selfie, as well as answer a few multiple choice questions about source of funds and trading experience. It should take about five minutes to complete from start to finish.&nbsp;Corporate accounts will continue to go through the existing verification process, with our team ready to guide them through as quickly and efficiently as possible.\"","The roll-out of KYC follows an earlier announcement this year that BitMEX would restructure its parent company. The new entity, 100x Group, sits on top of the firm's existing operations and appears to be looking to \"pursue a broader vision to reshape the modern digital financial system into one which is inclusive and empowering,\" as The Block first&nbsp;<a href=\"https:\/\/www.yahoo.com\/news\/parent-company-bitmex-restructured-points-030543689.html\" data-v-f87c67ca=\"\">reported<\/a>.&nbsp;","Radclyffe said that 100x's ambitions for BitMEX go beyond the listing additional cryptocurrencies.&nbsp;","\"Expansion of our product has always been part of our strategy,\" he said. \"I think understanding our customer base better will allow us to be able to better tailor those product offerings.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"100x Group","content":"ORGANIZATION"},{"type":"July 2019","content":"DATE"},{"type":"Radclyffe","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Seychelles","content":"LOCATION"},{"type":"August 28","content":"DATE"},{"type":"Ben Radclyffe","content":"PERSON"},{"type":"KYC","content":"ORGANIZATION"},{"type":"U.S. Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Bloomberg News","content":"ORGANIZATION"}],"hashtag":["BITMEX"],"authors":["Frank Chaparro","The Block"]}