{"summary":"Bybit is proactively suspending its services in the UK ahead of new crypto marketing rules set to be enforced from next month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/252526\/bybit-suspends-services-uk-after-ceo-ben-zhou-said-exit-likely","publishDate":"2023-09-22T07:09:43","id":4398,"type":null,"title":"Bybit suspends services in the UK after CEO Zhou said exit was likely","category":["EXCHANGES"],"content":["Crypto exchange Bybit is exiting the UK market ahead of <a href=\"https:\/\/www.fca.org.uk\/news\/press-releases\/fca-sets-expectations-ahead-incoming-crypto-marketing-rules#:~:text=From%208%20October%2C%20UK%20consumers,inappropriately%20incentivise%20people%20to%20invest.\" data-v-f87c67ca=\"\">new crypto marketing rules<\/a> set to be enforced by the country’s financial regulator, the Financial Conduct Authority, next month.","\"In light of the UK Financial Conduct Authority’s introduction of new rules regarding marketing and communications by crypto businesses as outlined in the June 2023 Policy Statement (PS23\/6) entitled 'Financial Promotion Rules for Crypto assets,' Bybit has made a choice to embrace the regulation proactively and pause our services in this market,\" Bybit stated in an <a href=\"https:\/\/announcements.bybit.com\/en-US\/article\/announcement-bybit-to-suspend-services-in-the-uk-blt286daa9208c8f3aa\/\" data-v-f87c67ca=\"\">announcement<\/a> today.","The confirmation comes after Bybit CEO Ben Zhou told The Block that the rule change meant the crypto exchange's <a href=\"https:\/\/www.theblock.co\/post\/251007\/bybit-expects-to-exit-uk-market-as-new-regulations-loom\" data-v-f87c67ca=\"\">exit from the country was likely<\/a>.","The new rules, which include a cooling-off period for first-time investors, are being rolled out in the hope it will make marketing of crypto products more transparent and accurate.","Bybit said it will no longer accept new UK user account applications from Oct. 1. From Oct. 8, the date when the new rules come into force, existing UK users can no longer \"make any new deposits, create new contracts or increase any of their existing positions for all products and services,\" the firm added. Users will be able to reduce or close their positions and withdraw their funds from the platform.","Bybit set a final deadline of Jan. 8, 2024, for UK customers to manage and wind down their remaining positions. Any positions left open after this date will be automatically liquidated, with the resulting funds made available for withdrawal, the firm stated.","It's not clear how long the suspension will last and if Bybit will return to the UK market. However, the crypto exchange did note that \"the suspension will allow the company to focus its efforts and resources on being able to best meet the regulations outlined by the UK authorities in the future.\"","\"We apologize for any inconvenience caused to our UK clients, and we appreciate your continued support for our efforts to make crypto trading safer and more sustainable for the future of the industry,\" Bybit added.","Bybit did not immediately respond to a request for comment from The Block.","Bybit is not the only crypto exchange impacted by the UK's rule change, with other major platforms, including OKX and Binance, reevaluating their strategies in light of the FCA's strict guidelines, Zhou told The Block last week. The new rules could mean that just having a website that's accessible to UK customers could be construed as a promotion, Zhou added.","\"We do see regulation becoming more strict. Most likely, we’ll have to retreat in many countries. I think the UK — we’ll have to exit very soon,\" Zhou said at the time.","Zhou said the new rules will change the way solicitation works. Although crypto derivative products have been banned in the UK since 2021, some exchanges have still been able to serve UK customers via reverse solicitation.","\"The new law is that if you use English as a language, they will see you as trying to solicit their users, so you cannot claim that you are in reverse solicitation,\" Zhou said. \"Everyone is in trouble. So everyone is thinking of plans for how to deal with this new law.\"","For Bybit, the most likely consequence was that the exchange simply cut ties with the UK altogether, he concluded at the time.","Bitcoin-focused crypto exchange CoinCorner is also ending its affiliate program for UK customers on Oct. 1 in response to the new rules, according to an email to its users seen by The Block.","Yesterday, the <a href=\"https:\/\/www.theblock.co\/post\/252341\/uk-regulator-warns-crypto-firms-over-lack-of-engagement-with-new-rules\" data-v-f87c67ca=\"\">FCA warned crypto firms<\/a> over a \"lack of engagement\" with the new rules, with the regulator adding it harbored the most concern for overseas crypto asset firms with UK customers.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"UK Financial Conduct Authority","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"FCA","content":"ORGANIZATION"},{"type":"Zhou","content":"PERSON"},{"type":"Oct. 1","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Financial Conduct Authority","content":"ORGANIZATION"},{"type":"Oct. 8","content":"DATE"},{"type":"UK","content":"ORGANIZATION"},{"type":"Ben Zhou","content":"PERSON"},{"type":"Bybit","content":"ORGANIZATION"},{"type":"Jan. 8, 2024","content":"DATE"},{"type":"June 2023","content":"DATE"}],"hashtag":["FCA"],"authors":["James Hunt","The Block"]}