{"summary":"Chainlink&#x27;s cross-chain interoperability protocol has entered its early access phase on Avalanche, Ethereum, Optimism, and Polygon.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239936\/chainlink-rolls-out-cross-chain-interoperability-protocol-on-five-networks","publishDate":"2023-07-17T12:00:22","id":44,"type":null,"title":"Chainlink rolls out cross-chain interoperability protocol on multiple networks","category":["COMPANIES"],"content":["Chainlink has launched its cross-chain interoperability protocol (CCIP) — a technology designed to link applications across both public and private blockchains — in its “early access” phase.","\"This will offer a unified interface for seamless interaction,\" Chainlink <a href=\"https:\/\/chain.link\/cross-chain\" data-v-f87c67ca=\"\">said<\/a>. Notably, CCIP has already been adopted by decentralized finance protocol <a href=\"https:\/\/www.theblock.co\/post\/239654\/synthetix-is-building-a-perpetuals-trading-platform-to-rival-cexs\" data-v-f87c67ca=\"\">Synthetix<\/a> on mainnet to power its cross-chain transfers between Ethereum, Optimism and other chains.","While CCIP is already being used by Synthetix, it will become available to other developers from July 20 across five testnets: Arbitrum Goerli, Avalanche Fuji, Ethereum Sepolia, Optimism Goerli, and Polygon Mumbai.","Differing from typical cross-chain bridges that use wrapping mechanisms, Chainlink’s CCIP leverages smart contract-enabled mechanisms between “audited token pools” across different chains. This approach allows more seamless interactions between various blockchain networks, the team explained.","Additionally, CCIP includes an active risk management (ARM) Network. The ARM Network provides an additional layer of security by continually monitoring and validating the CCIP network’s behavior, independently checking cross-chain operations for possible errors.","<span data-v-f87c67ca=\"\">Source: Chainlink<\/span>","The CCIP system, according to the team, can benefit cross-chain lending applications, allowing users to deposit collateral on one blockchain and borrow assets on another. It could also assist with cross-chain data storage, liquid staking, and gaming apps between multiple chains.","\"Just like Web2 needed TCP\/IP to connect isolated islands of computer networks, web3 needs an interoperability standard to connect islands of blockchain networks,\" the Chainlink team said in a statement.","The use cases may go beyond just decentralized apps and extend to traditional finance. Swift, the global inter-bank messaging network, and over a dozen financial institutions have been <a href=\"https:\/\/www.swift.com\/news-events\/news\/swift-explores-blockchain-interoperability-remove-friction-tokenised-asset-settlement\" data-v-f87c67ca=\"\">exploring<\/a> CCIP for instructing token transfers across public and private chains through the existing Swift messaging infrastructure.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Arbitrum Goerli","content":"PERSON"},{"type":"July 20","content":"DATE"},{"type":"Polygon Mumbai","content":"ORGANIZATION"},{"type":"Avalanche Fuji","content":"ORGANIZATION"},{"type":"Synthetix","content":"ORGANIZATION"},{"type":"Ethereum Sepolia","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"TCP","content":"ORGANIZATION"},{"type":"ARM Network","content":"ORGANIZATION"}],"hashtag":["AAVE","ASSETS","CROSS-CHAIN SWAPS","DATA PROVIDERS","DECENTRALIZED INFRASTRUCTURE","DERIVATIVES","DEXS","SMART CONTRACTS"],"authors":["Brian McGleenon","The Block"]}