{"summary":"Saying that millions of investors had been hurt by crypto, Gensler said that troubles could spill into the broader financial system. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/250869\/secs-gensler-slams-crypto-again-says-troubles-can-spill-into-broader-economy","publishDate":"2023-09-13T13:53:48","id":4404,"type":null,"title":"Gensler slams crypto again, says troubles can spill into broader economy","category":["COMPANIES"],"content":["Securities and Exchange Commission Chair <a href=\"https:\/\/www.theblock.co\/post\/250526\/gensler-says-sec-is-reviewing-grayscale-ruling-spot-bitcoin-etf-applications\" data-v-f87c67ca=\"\">Gary Gensler<\/a> renewed his hardline stance against the crypto industry on Wednesday in comments made at a <a href=\"https:\/\/www.youtube.com\/watch?v=-t9YghlG_mo\" data-v-f87c67ca=\"\">conference<\/a> hosted by Better Markets to mark the 15th anniversary of the collapse of Lehman Brothers at the peak of the 2008 financial crisis.&nbsp;","\"This crypto space that much of it, without prejudging any one token, much of it is under the securities laws, but unfortunately, much of it is also non-compliant,\" he said.","Saying that millions of investors had been hurt by crypto, Gensler said that troubles in the industry could spill into the broader financial system.&nbsp;","\"Millions of investors have been hurt in this field,\" he said. \"It's an area that can hurt investors, but it can also hurt the broader economy because it can hurt investor confidence, and finance is ultimately built on trust.\"","Gensler said the overall crypto economy was \"kind of small\" compared to the \"100-plus trillion dollar capital market.\"","\"It's relatively small, but it can really hurt investor confidence,\" he continued, pointing to what he said were direct links between some f<a href=\"https:\/\/www.theblock.co\/post\/219391\/barney-frank-regulators-shuttered-signature-bank-to-show-crypto-is-toxic\" data-v-f87c67ca=\"\">ailed regional banks<\/a> earlier this year and the crypto field.&nbsp;","\"I've been around finance a lot of decades,\" he said. \"I've never seen a field so rife with misconduct, and people trying to run outside of the law.\"","Gensler also criticized celebrity endorsements and legal efforts to arbitrage rules and laws across various jurisdictions. He added, however, that&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/250344\/sec-chair-gensler-stays-the-course-in-push-for-crypto-compliance-ahead-of-tuesday-hearing\" data-v-f87c67ca=\"\">new rules and legislation<\/a> are not needed.","\"We have rules. We have rules,\" Gensler continued. \"They're called the laws that Congress passed, whether it's in the anti-money laundering and the sanction space, or whether its in the securities laws, or whether it's in the commodities exchange act. We have laws as Congress has passed.\"","He didn't respond to a statement from the moderator about \"<a href=\"https:\/\/www.theblock.co\/post\/250526\/gensler-says-sec-is-reviewing-grayscale-ruling-spot-bitcoin-etf-applications\" data-v-f87c67ca=\"\">some sympathetic judges<\/a>\" in recent court cases.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Lehman Brothers","content":"ORGANIZATION"},{"type":"Exchange Commission","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"2008","content":"DATE"}],"hashtag":["SEC"],"authors":["Nathan Crooks","The Block"]}