{"summary":"The London-based blockchain firm processed the first live payments through its Sterling Fnality Payment System.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267563\/fnality-starts-first-phase-of-payment-operations-using-funds-at-bank-of-england","publishDate":"2023-12-14T07:00:05","id":4405,"type":null,"title":"Fnality starts first phase of payment operations using funds at Bank of England","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Fnality, a London-based blockchain payments firm, today officially kicked off the first phase of live transactions using a digital representation of funds held at the Bank of England.<\/span>","<span data-v-f87c67ca=\"\">In a statement shared with The Block, Fnality said it has commenced its Sterling Fnality Payment System with participation from Lloyds Banking Group, Banco Santander and UBS.<\/span>","<span data-v-f87c67ca=\"\">The system “brings together for the first time the safety and institutional quality of central bank funds in a systemic wholesale payment system with the innovative functionality and resilience of blockchain technology,” the company said.<\/span>","<span data-v-f87c67ca=\"\">The initial live transaction “evidences the first foundations of a broader multi-jurisdictional vision,” enabling a global liquidity management ecosystem in both wholesale financial markets and emerging tokenized asset markets, Fnality added. However, the initial phase, focused on ensuring system resilience and functionality in a live environment, is subject to limits set by the Bank of England.<\/span>","<span data-v-f87c67ca=\"\">“As we step into 2024, our focus sharpens on scaling up operations within a managed and approved framework as set out by the Bank of England, and steadily progressing towards unlocking new market use cases,” Angus Fletcher, CEO of Fnality UK, said in the statement.<\/span>","<span data-v-f87c67ca=\"\">Fnality <\/span><a href=\"https:\/\/www.theblock.co\/post\/262961\/fnality-raises-95-million-in-round-led-by-goldman-bnp-paribas\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">raised $95 million last month<\/span><\/a><span data-v-f87c67ca=\"\"> in a round led by Goldman Sachs and BNP Paribas. DTCC, Euroclear, Nomura, WisdomTree and a bevy of existing bank-backers also participated.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Fnality","content":"ORGANIZATION"},{"type":"$95 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"Lloyds Banking Group","content":"ORGANIZATION"},{"type":"Fnality UK","content":"ORGANIZATION"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Euroclear","content":"ORGANIZATION"},{"type":"Nomura","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"WisdomTree","content":"ORGANIZATION"},{"type":"DTCC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Banco Santander","content":"ORGANIZATION"},{"type":"UBS","content":"ORGANIZATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"London","content":"LOCATION"},{"type":"Angus Fletcher","content":"PERSON"},{"type":"BNP Paribas","content":"ORGANIZATION"}],"hashtag":[],"authors":["Timmy Shen","The Block"]}