{"summary":"Arbitrum has paid a code bounty hunter 400 ETH for finding a bridge vulnerability.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/171585\/arbitrum-announces-400-eth-bug-bounty-payout","publishDate":"2022-09-20T19:55:20","id":4408,"type":null,"title":"Arbitrum announces 400 ETH bug bounty payout","category":["THE BLOCK"],"content":["Details emerged this morning of a vulnerability and bounty paid by Arbitrum. The patched exploit could have compromised more than $250 million.","The vulnerability was discovered by pseudonymous solidity bounty hunter “0xriptide.” It could have affected any user who attempted to bridge funds from Ethereum to Arbitrum Nitro, 0xriptide said.","Arbitrum has paid 0xriptide 400 ETH (about $520,000) as compensation for alerting it to the vulnerability.","<a href=\"https:\/\/twitter.com\/0xriptide\" data-v-f87c67ca=\"\">0xriptide’s<\/a> day-to-day is comprised of scouring ImmuneFi, a bug bounty platform that has prevented hacks of more than $20 billion. His primary focus lately has been centered on preventing cross-chain exploits, as they pose a sizably larger amount of funds at risk due to the “honeypot” structure of most bridge protocols, he said in <a href=\"https:\/\/medium.com\/@0xriptide\/hackers-in-arbitrums-inbox-ca23272641a2\" data-v-f87c67ca=\"\">the report.<\/a>","His initial search for the Arbitrum exploit began a few weeks ago ahead of the Arbitrum Nitro upgrade. Upon his initial investigation, he found a vulnerability where the bridging contract was able to accept deposits, even though the contract was initialized previously.","0xriptide said,","<span class=\"TextRun SCXW198857047 BCX0\" lang=\"EN-US\" xml:lang=\"EN-US\" data-contrast=\"none\" data-v-f87c67ca=\"\"><span class=\"NormalTextRun SCXW198857047 BCX0\" data-v-f87c67ca=\"\">“When you stumble upon <\/span><span class=\"NormalTextRun SCXW198857047 BCX0\" data-v-f87c67ca=\"\">an<\/span><span class=\"NormalTextRun SCXW198857047 BCX0\" data-v-f87c67ca=\"\"> uninitialized address variable in Solidity — you should always take a moment to pause and investigate further because you never know if it was purposefully left uninitialized or by accident<\/span><span class=\"NormalTextRun SCXW198857047 BCX0\" data-v-f87c67ca=\"\">.<\/span><span class=\"NormalTextRun SCXW198857047 BCX0\" data-v-f87c67ca=\"\">” <\/span><\/span>","After digging into the uninitialized address, 0xriptide found that a hacker would be able to set their own address as the bridge, mimicking the actual contract, and steal all the incoming ETH deposits from Etheruem to Arbitrum Nitro.","The hacker would have had the flexibility of either targeting larger ETH deposits in order to obscure the their actions, or begin a guerrilla-type of attack and siphon all the funds coming in.","The largest deposit during the period when the exploit could have occurred was roughly 168,000 ETH, or $250 million. The average deposits in any 24-hour time period when the vulnerability could have been exploited was anywhere from 1,000 to 5,000 ETH.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Arbitrum Nitro","content":"ORGANIZATION"},{"type":"$250 million","content":"MONEY"},{"type":"$520,000","content":"MONEY"},{"type":"$20 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Arbitrum Nitro","content":"LOCATION"},{"type":"Etheruem","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ARBITRUM","ETHEREUM"],"authors":["Mike Truppa","The Block"]}