{"summary":"Matter Labs, the company behind zkSync, will launch a public testnet for an Ethereum scaling prototype called ‘Pathfinder’ in Q1 2023.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175823\/zksync-says-layer-3-testnet-pathfinder-will-launch-in-q1-2023","publishDate":"2022-10-10T08:00:05","id":4410,"type":null,"title":"Makers of zkSync to launch Layer 3 testnet ‘Pathfinder’ in Q1 2023","category":["CRYPTOCURRENCY"],"content":["Matter Labs will launch a public testnet for an Ethereum scaling prototype called ‘Pathfinder’ in Q1 2023, which might turn out to be the first Layer 3 network built on top of Ethereum.","Matter Labs is the Ethereum development company behind zkSync, a Layer 2 network on Ethereum that is set to launch this month. A Layer 2 network is one that runs on top of the main Ethereum blockchain and provides a boost to scalability, allowing it to process more transactions at a lower cost. Once this is in place, the company hopes to launch its testing environment for the Layer 3 network Pathfinder — which aims to provide even further benefits to Ethereum.","“Pathfinder represents a special moment for Ethereum. Not one that’s only experienced by the few, but one where we get to see history being made together as an ecosystem on a public testnet,” zkSync Chief Product Officer Steve Newcomb told The Block.","Layer 3s enhance all the benefits of Layer 2s, while adding significant leaps in other key scaling areas, Newcomb said, adding that this boost will enable wider adoption of cryptocurrency technology.","Upon launch, Pathfinder will be in a prototype stage open to the public in a testing environment. This will enable anyone to publicly experiment, research, and participate in the development of its new scaling solution. It will also allow input from other members in the Ethereum and crypto ecosystem.","“For us on the engineering team, Pathfinder gives us the ability to really understand the shape these systems are likely to take in the future, and to tackle some of the hardest problems early on. We believe that when it comes to engineering complex systems the best way to make progress is to aggressively build, test, and iterate with feedback from the real world,” zkSync Head of Engineering Anthony Rose told The Block.","Another key benefit of Layer 3 networks, according to Newcomb, is that they enable native bridging between blockchains.","Native bridging is when a user wants to move tokens or money from one blockchain to another, without having to lock or give their tokens to a third-party ‘escrow’ bridging service. Native bridging enabled by Layer 3s could solve one of the industry's main pain points, as billions of dollars have been stolen through exploits of non-native bridges between Layer 1 and Layer 2 blockchains this past year.","Once zkSync fully launches its Layer 3 network, “we won’t have non-native bridges, hopefully, in the future,” Newcomb added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ethereum","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Steve Newcomb","content":"PERSON"},{"type":"Newcomb","content":"PERSON"},{"type":"zkSync Head of Engineering Anthony Rose","content":"ORGANIZATION"},{"type":"Q1 2023","content":"DATE"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ETHEREUM","ZKSYNC"],"authors":["Mike Truppa","The Block"]}