{"summary":"The project aims to &#x27;democratize IP creation&#x27; with a funding round contributed to by Hashed, Endeavor and Samsung Next.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/249401\/story-protocol-launches-with-54-million-round-led-by-a16z-to-tap-ip-ownership","publishDate":"2023-09-06T03:23:59","id":4412,"type":null,"title":"Story Protocol launches with $54 million round led by a16z to tap IP ownership","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Story Protocol, which aims to develop an open-source platform for intellectual property ownership, announced its launch today in tandem with a $54 million funding round led by a16z crypto.<\/span>","<span data-v-f87c67ca=\"\">The project said in a <\/span><a href=\"https:\/\/www.businesswire.com\/news\/home\/20230905638262\/en\/Story-Protocol-Launches-With-Over-54M-in-Funding-Led-by-Andreessen-Horowitz\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">statement<\/span><\/a><span data-v-f87c67ca=\"\"> that it is creating a new IP protocol optimized for the internet era, aiming to <\/span><span data-v-f87c67ca=\"\">\"<\/span><span data-v-f87c67ca=\"\">democratize IP creation through a global and extensible IP repository.<\/span><span data-v-f87c67ca=\"\">\"<\/span>","<span data-v-f87c67ca=\"\">The funding round included participation from Hashed, Endeavor, Samsung Next and a number of prominent business figures such as Si-hyuk Bang, chairman of South Korea’s HYBE, which represents K-pop boy groups BTS and Seventeen.<\/span>","<span data-v-f87c67ca=\"\">Sanghun Kim, former CEO of Korean internet giant Naver, and <\/span><span data-v-f87c67ca=\"\">Roham Gharegozlou, founder and CEO of Dapper Labs, also participated in the funding round.<\/span>","<span data-v-f87c67ca=\"\">Story Protocol said that it plans to provide a streamlined framework to manage the entire lifecycle of IP development, enabling features like provenance tracking, frictionless licensing and revenue sharing.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"In a world of total abundance catalyzed by generative AI, blockchain technology presents the perfect solution for transparent provenance tracking and fair attribution,\" Seung Yoon Lee, co-founder of Story Protocol, said in the statement.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Sriram Krishnan, general partner at a16z crypto, said that web3 has the promise to help solve some of the longest-standing problems in the media and entertainment industries, adding that the project \"has the opportunity to revolutionize the future of IP for artists, fans, and developers by empowering creativity at the speed of the internet.\"<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Naver","content":"ORGANIZATION"},{"type":"South Korea","content":"LOCATION"},{"type":"Roham Gharegozlou","content":"PERSON"},{"type":"$54 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Sanghun Kim","content":"PERSON"},{"type":"Seung Yoon Lee","content":"PERSON"},{"type":"Samsung Next","content":"ORGANIZATION"},{"type":"Sriram Krishnan","content":"PERSON"}],"hashtag":["ANDREESSEN HOROWITZ","INTERNET","INVESTMENT FIRMS"],"authors":["Timmy Shen","The Block"]}