{"summary":"Digital asset custodian BitGo announced Wednesday that it has secured a total of $700 million in insurance coverage for the assets in custody in cold storage.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/102420\/bitgo-700-million-insurance-crypto-custody","publishDate":"2021-04-21T09:01:01","id":4422,"type":null,"title":"BitGo&#x27;s $700 million crypto custody insurance program: what it means and why it matters","category":["STARTUPS"],"content":["<span data-v-f87c67ca=\"\">Digital asset custodian BitGo announced Wednesday that it has secured a total of $700 million in insurance coverage for the assets in custody in cold storage. This is an important milestone in the continued mainstream adoption of bitcoin and other digital assets.&nbsp;&nbsp;<\/span>","That top-line figure represents an addition of $600 million in capacity to the $100 million <a href=\"https:\/\/www.theblockcrypto.com\/linked\/12391\/bitgo-offers-100m-insurance-protection-for-crypto-assets-under-custody\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">it debuted in early 2019<\/a>.&nbsp;","<span data-v-f87c67ca=\"\">To understand the significance of this development, a little bit of historical context is helpful, as well as a discussion on some of the nuts and bolts of the insurance program and how it will work for BitGo customers.<\/span>","<b data-v-f87c67ca=\"\">How insurance works and where it came from<\/b>","<span data-v-f87c67ca=\"\">Let's start with a very broad question: what, exactly, is insurance?&nbsp; <\/span>","<span data-v-f87c67ca=\"\">At its most basic, insurance is a financial instrument -- a way to finance the cost of future risk. It’s pretty simple. On the one hand, you can self-insure risk, holding onto it yourself and bearing the full cost of a loss (unless you have transferred it contractually in an indemnity agreement with a counterparty). Or you can pay an insurance company a premium to take some or all of that risk from you.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Insurance companies make their money by choosing risks carefully and then generating earnings in a tax-advantaged way on investments of pooled premium dollars. I am over-simplifying here, yes, but this is the fundamental model.<\/span>","<span data-v-f87c67ca=\"\">There's nothing new about this. Insurance in one form or another has been around for a very long time, predating Satoshi's bitcoin whitepaper by about 4,000 years. Indeed, the first insurance-like contracts in recorded history were in the form of marine loans used by Phoenician traders. The Greeks, and the Romans later on, learned about this proto-insurance, and examples of Roman marine loans can be found in the writings of Demosthenes.<span data-v-f87c67ca=\"\">[1]<\/span><\/span>","<span data-v-f87c67ca=\"\">Maritime traders from what is now Italy are usually credited with creating the first true insurance policies in the 14th century, whereby risk is laid off to a third party whose business is principally in underwriting risks and making money from pooled premium dollars.&nbsp;&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Insurance for shipping makes a lot of sense. It protects not only the boat’s owner(s) but also the people with an interest in the cargo. By spreading the risk of loss over a group, one can protect against the risk of loss by paying a percentage of the value of the total property at risk, and benefit from economies of scale when others do the same.<\/span>","<span data-v-f87c67ca=\"\">That maritime insurance model was taken up by Lloyds in the 17th century, and its underwriters were instrumental in insuring maritime traffic and American trade in the 17th and 18th centuries -- underwriting both commodity goods like sugar, coffee, and tobacco as well as having a now <\/span><a href=\"https:\/\/www.theguardian.com\/world\/2020\/jun\/18\/lloyds-of-london-and-greene-king-to-make-slave-trade-reparations\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">well-acknowledged role in providing insurance for the slave trade<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Insurance made building skyscrapers and interstates possible and most modern commerce would grind to a halt, at least temporarily, if insurance was no longer available. Indeed, after 9\/11, questions about the availability to cover property in the event of a terror event could easily have led to technical defaults of a significant chunk of the real estate loans for property in large cities if insurance requirements could not be met. In response to these concerns, Congress passed the Terrorism Risk Insurance Act, which created a federal backstop for terror risk (a similar law, socializing nuclear risk, predated this by 40+ years, in the form of the Price Anderson Act).&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Like any financial instrument, insurance can be used for good or evil, as in the case of the slave trade. In short, a credible argument can be made that modern industrial capitalism -- for good and for bad -- would not have been possible without the ability to pool and share risk through the use of insurance policies as a core financing model.<\/span>","<span data-v-f87c67ca=\"\">Insurance underwriters are also, by nature, conservative. Their job, after all, is to make sure that they recognize the right risks and calculate the likelihood that a bucket of those risks will result in claims and payments. And in the United States, at least, it is a very heavily regulated and scrutinized industry, subject to oversight by insurance commissioners in every state and territory.<\/span>","<span data-v-f87c67ca=\"\">It's one thing to underwrite life insurance policies, given that you know for a fact that everyone eventually dies and where actuarial tables can guide you. The same goes for fire insurance policies, where 150 years of underwriting information is available, or auto, workers compensation and other goods and services for which significant underwriting data is available. <\/span>","<span data-v-f87c67ca=\"\">It becomes much harder to insure newer risks often tied to new technology, products and business sectors. Examples like drones, biometric data loss, cryptocurrency theft pose novel challenges because you don’t have actuarial or other loss history on which to price premiums. That, and\/or there a full understanding of the technology is lacking.<\/span>","<b data-v-f87c67ca=\"\">BitGo’s insurance program and how it works<\/b>","<span data-v-f87c67ca=\"\">All of which leads us back to cryptocurrency, insurance for cryptocurrency risks, and why the news of BitGo's $700 million dollars in cryptocurrency coverage capacity is a big, big deal.<\/span>","<span data-v-f87c67ca=\"\">You may think that the words bitcoin or cryptocurrency and “mainstream” don’t fit together. However, I have long held the view that bitcoin (and other digital assets) won't be mainstream until insurance is readily available to holders. It's also a necessity for certain types of regulated intermediaries and businesses that might wish to work with crypto but are mindful of their legal obligations. The news from BitGo represents a step toward bitcoin going mainstream and evidence of further acceptance by the naturally conservative insurance industry.<\/span>","<span data-v-f87c67ca=\"\">A brief note on BitGo, if you’re not familiar with it. The company describes itself as an \"[i]nstutional digital asset custody, trading and finance platform.\" It provides hot, warm and cold wallet custody for institutional clients with substantial digital assets. BitGo has also received a New York Trust Charter and a South Dakota Trust Charter, has been in the institutional space for digital assets since 2013.<\/span>","<span data-v-f87c67ca=\"\">As noted above, BitGo was one of the first companies to secure insurance coverage for digital assets, which required working with underwriters to educate them about the risks. <\/span><span data-v-f87c67ca=\"\">Because cryptocurrency assets like bitcoin are bearer instruments, loss or theft of them at any point in the transfer or custody presents a significant risk.&nbsp; <\/span>","<span data-v-f87c67ca=\"\">While this risk can be handled by and through a variety of security measures, using insurance as a hedge against loss provides an additional and significant layer of protection where available and can be attractive to institutional clients for a variety of reasons.<\/span>","<span data-v-f87c67ca=\"\">Until recently, the challenge in securing substantial insurance coverage was due to limited market capacity, combined with a lack of understanding of the risks by insurance company underwriters. The reality is that well-designed cold storage solutions do not require a leap of faith by an underwriter, but rather an education and confidence in technical measures used to provide security.<\/span>","<span data-v-f87c67ca=\"\">I spoke with BitGo chief revenue officer Pete Najarian about this new offering, which is being underwritten by Lloyds and certain European markets, along with the company's broker Jacob Decker at the Woodruff Sawyer insurance brokerage firm.<\/span>","<span data-v-f87c67ca=\"\">Najarian correctly noted that cryptocurrencies were “considered uninsurable assets for quite some time”, which is why it is particularly newsworthy that BitGo is now offering this $700 million insurance tower for digital assets held in custody.&nbsp; <\/span>","<span data-v-f87c67ca=\"\">Of this, $100 million is solely in BitGo's name, and available to all customers. $600 million in excess of that coverage is available to customers on a \"loss payee\" basis and tied to dedicated customer limits. The coverage is only available for cold storage, but \"anything in cold storage is contemplated by the program\" according to Decker.<\/span>","<span data-v-f87c67ca=\"\">The coverage is provided using what is known as a “specie” coverage form. This is a type of “first party” insurance coverage, which is a shorthand way of saying insurance for property you own or that is in your care, custody and control. <\/span><span data-v-f87c67ca=\"\">(An aside: third-party policies -- general liability, directors officers, etc. -- cover the risk of claims\/suits by third parties against the insured. This is not third-party coverage).<\/span>","<span data-v-f87c67ca=\"\">Specie coverage has traditionally been used for valuable items such as precious metals, securities, cash and\/or things typically held in a bank vault. Jewelers and armored car service companies sometimes also have coverage using this type of form. It has been adopted to the digital asset industry, and when you hear someone talking about cold storage coverage they are almost certainly talking about a specie policy form.<\/span>","<span data-v-f87c67ca=\"\">A loss payee is not an insured on the policy but is entitled to payment in the event of a loss for which the insured makes a claim. The loss payee coverage is specific to the customer's own wallet. Using a perhaps more common example, if you have a mortgage or a car loan, your lender is most likely a loss payee on your homeowners or auto policy.<\/span>","<span data-v-f87c67ca=\"\">The reason for the loss payee status, as opposed to having insured status, according to Najarian, is that BitGo is the only party with enough information and knowledge to prepare a \"proof of loss\" document (which describes to the insurance company what happened and why there is insurance). However, in the event that a “proof of loss” is submitted and payment issued, Najarian says that payment would be made directly to the customer.<\/span>","<span data-v-f87c67ca=\"\">I also asked why the additional $600 million in limits might matter to a customer. Najarian explained that this is \"attractive for institutional customers\" because their own wallet is covered, in the event that the underlying $100 million in coverage for all customers was eroded by payment of claims. It also reflects the fact that it can be challenging for an institutional client to procure direct coverage for losses when their assets are no longer in their control but have been transferred to BitGo.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">It would be really easy (for me, at least) to get lost in the weeds here and talk about coverage details. I also have not seen the actual policy forms, where the devil is truly in the details.<\/span>","<span data-v-f87c67ca=\"\">To me, the story is this: when very conservative insurance underwriters are willing to write this much insurance for digital asset risks, cryptocurrency has gone mainstream. It also makes it much easier for regulated institutions, like trust companies, to hold digital assets for their customers and comply with applicable regulatory and fiduciary obligations. These are necessary rails to make digital assets like bitcoin usable on both Wall Street and Main Street.<\/span>","<span data-v-f87c67ca=\"\">Interestingly, while $700 million is a milestone and seems like a lot in terms of volume and assets at risk, this is nowhere near the amount of capacity that would be taken up if available. Such a figure really is a drop in the bucket in a $1 trillion-plus market.&nbsp; <\/span>","<span data-v-f87c67ca=\"\">But it's also one more sign that bitcoin and other digital assets are here to stay.<\/span>","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">[1] See \"The Earliest Insurance Contract: A New Discovery\", by Humbert Nelli, The Journal of Risk and Insurance Vol. 39, No. 2 (Jun., 1972), pp. 215-220 (6 pages)<\/span><\/em>","About the Author: &nbsp;Stephen Palley is partner in the Washington, D.C. of Anderson Kill, where he founded and chairs the firm's virtual currency practice. &nbsp;He is also a member of the firm's nationally recognized insurance recovery practice. &nbsp;The views expressed herein are his alone, and may not reflect the views of his law partners, or past, present and future clients. &nbsp;His opinions may change. &nbsp;He contains multitudes.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"17th century","content":"DATE"},{"type":"Najarian","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"Pete Najarian","content":"PERSON"},{"type":"2013","content":"DATE"},{"type":"South Dakota","content":"LOCATION"},{"type":"$600 million","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"Humbert Nelli","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"$700 million","content":"MONEY"},{"type":"Italy","content":"LOCATION"},{"type":"Woodruff Sawyer","content":"ORGANIZATION"},{"type":"$1 trillion","content":"MONEY"},{"type":"Najarian","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Stephen Palley","content":"PERSON"},{"type":"New York Trust Charter","content":"ORGANIZATION"},{"type":"1972","content":"DATE"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Anderson Kill","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Satoshi","content":"PERSON"},{"type":"Lloyds","content":"ORGANIZATION"},{"type":"$700 million dollars","content":"MONEY"},{"type":"14th century","content":"DATE"},{"type":"Jacob Decker","content":"PERSON"},{"type":"Decker","content":"ORGANIZATION"},{"type":"D.C.","content":"LOCATION"},{"type":"Price Anderson Act)","content":"ORGANIZATION"}],"hashtag":[],"authors":["Stephen Palley","The Block"]}