{"summary":"The court has approved Lucy Thomson as consumer privacy ombudsman to protect consumer data in the Celsius bankruptcy case. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/180682\/court-approves-officer-for-customer-privacy-in-potential-celsius-sale","publishDate":"2022-10-27T17:51:42","id":4424,"type":null,"title":"Court approves officer for customer privacy in potential Celsius sale","category":["LEGAL"],"content":["The court has approved Lucy Thomson as consumer privacy ombudsman to the Celsius bankruptcy case to protect customer data in the event of a sale.&nbsp;","Thomson has acted as a consumer privacy ombudsman in 25 federal bankruptcy cases since 2008, according to her LinkedIn page. She has evaluated more than 250 million electronic consumer records in the sales of assets that include personal information, according to the LinkedIn page . She is a founding principal of Livingston PLLC, where she focuses her practice on cybersecurity among other intersections of tech and the law.&nbsp;","Celsius <a href=\"https:\/\/www.theblock.co\/post\/179529\/judge-approves-celsius-schedule-for-a-possible-sale\" data-v-f87c67ca=\"\">received approval<\/a> for its bidding at the start of this week, which set the dates and deadlines for a potential sale. That process could include the sale of customer lists and information. The government's representative in the case, the U.S. Trustee, requested the court appoint a consumer privacy ombudsman to ensure customer information is adequately protected throughout the process.&nbsp;","Celsius had initially pushed back on the request since it said its own privacy policy already covered the issue.&nbsp;","Celsius entered the Chapter 11 bankruptcy process this July, and already some creditors have expressed concern over data protection. Recently published financial schedules included customer names and transactions, a normal stipulation of bankruptcy procedure that counsel for Celsius and the creditor committee objected to.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Livingston PLLC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Thomson","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"2008","content":"DATE"},{"type":"Lucy Thomson","content":"PERSON"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}