{"summary":"Paxos CEO Charles Cascarilla told employees the firm is in &quot;constructive discussions with the SEC&quot; over the Binance USD stablecoin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/213663\/paxos-in-constructive-discussions-with-the-sec-ends-relationship-with-binance","publishDate":"2023-02-21T11:33:59","id":443,"type":null,"title":"Paxos in &#x27;constructive discussions with the SEC,&#x27; ends relationship with Binance","category":["STABLECOINS"],"content":["Stablecoin issuer Paxos told employees it's in \"constructive discussions\" with the U.S. Securities and Exchange Commission (SEC) after getting a Wells notice about the Binance USD stablecoin coin.","\"We look forward to continuing that dialogue in private. Of course, if necessary, we will defend our position in litigation,\" CEO Charles Cascarilla said in an email to employees. The company said last week that it <a href=\"https:\/\/www.theblock.co\/post\/211242\/paxos-categorically-disagrees-with-sec-in-calling-busd-a-security\" data-v-f87c67ca=\"\">categorically disagreed<\/a> with the SEC's categorization of BUSD as a security.","Cascarilla also said the company would end its relationship with Binance, in what he said was a separate decision from the SEC Wells notice and the directive from the New York Department of Financial Services.","\"The market has evolved and the Binance relationship no longer aligns with our current strategic priorities,\" he said.","The firm has facilitated more than $2.8B in BUSD redemptions since announcing that it would stop issuing the stablecoin.","\"We remain fully focused on serving the end holders of BUSD and protecting them from undo harm. Paxos will continue to support BUSD through at least February 2024 and maintain the highest standards of security and soundness in the stablecoin market,\" Cascarilla said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Cascarilla","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Binance USD","content":"ORGANIZATION"},{"type":"February 2024","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"$2.8","content":"MONEY"},{"type":"Charles Cascarilla","content":"PERSON"}],"hashtag":["BUSD"],"authors":["Catarina Moura","The Block"]}