{"summary":"Standard financial policies are not sufficient for regulating decentralized finance, according to a research report funded by the EU Commission.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/178922\/tradfi-policies-inadequate-for-treating-defi-claims-eu-commission-study","publishDate":"2022-10-21T08:22:32","id":4432,"type":null,"title":"TradFi policies ‘inadequate’ for treating DeFi, claims EU Commission study","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">Standard financial policies are not sufficient for regulating decentralized finance, according to a research report funded by the European Commission <\/span><a href=\"https:\/\/op.europa.eu\/en\/publication-detail\/-\/publication\/f689e5b2-4f55-11ed-92ed-01aa75ed71a1\/language-en\/format-PDF\/source-272370364\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">published<\/span><\/a><span data-v-f87c67ca=\"\"> this week.<\/span>","\"This report is part of our ambition to understand DeFi further, to inform our thinking about how to address any concern potential public public policy consequences,” <span data-v-f87c67ca=\"\">Mattias Levin of the European Commission's department for digital finance, said in a webinar outlining the report on Friday.<\/span>","<span data-v-f87c67ca=\"\">Recognizing the difference in the way DeFi structures information compared to traditional finance, the report<\/span><span data-v-f87c67ca=\"\"> on approaches to the regulation and supervision of decentralized finance says that \"<\/span><span data-v-f87c67ca=\"\">standard policies [are] inadequate to the treatment of DeFi services.\" As a response, it <\/span><span data-v-f87c67ca=\"\">breaks down a taxonomy of policy proposals.<\/span>","<span data-v-f87c67ca=\"\">Firstly, the report proposes to have a separate policy to regulate the activity of legal entities based on micro-prudential requirements. This would apply to “entities that were legally subjected to the authority of standard public institutions,” according to the report.<\/span>","<span data-v-f87c67ca=\"\">Secondly, a voluntary compliance framework would cover both protocols and legal entities. Here, “protocols and users freely choose to adhere to some policy requirements in order to obtain different forms of public support and guarantee such as a stamp of public approval,” the report reads.<\/span>","<span data-v-f87c67ca=\"\">The third is a public observatory based on public opinions and on-chain data. “Such an institution would deploy public investigations and issue opinions and warnings publicly about specific DeFi protocols, practices and public address activities,” according to the report.<\/span>","<span data-v-f87c67ca=\"\">Finally, the study recommends building an approach for off-chain markets — like oracles, which connect on-chain and off-chain data. Oracles are key for connecting DeFi with traditional economies. The report gives preliminary routes for this but admits that “the optimal design for oracle markets remains largely under-developed.”<\/span>","<span data-v-f87c67ca=\"\">The report, written by an academic linked to KU Leuven, will inform the debate on DeFi within the EU institutions and upcoming EU Commission proposals.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The European Commission is gaining traction with studies on how to regulate DeFi, with a tender for a study on “embedded supervision” of Ethereum <\/span><a href=\"https:\/\/www.theblock.co\/post\/175920\/eu-commission-seeks-automated-ethereum-defi-monitoring\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">released<\/span><\/a><span data-v-f87c67ca=\"\"> earlier in October.<\/span>","<span data-v-f87c67ca=\"\">The EU’s comprehensive Markets in Crypto-Assets regulation, set for a final Parliamentary vote in November, is focused greatly on centralized entities of crypto — such as service providers — and stablecoin regulation. With no clear-cut framework for regulating decentralized entities, the institutions are pulling resources into bridging that gap.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mattias Levin","content":"PERSON"},{"type":"EU Commission","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"European Commission","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Leuven","content":"LOCATION"},{"type":"Crypto","content":"LOCATION"},{"type":"November","content":"DATE"}],"hashtag":[],"authors":["Inbar Preiss","The Block"]}