{"summary":"Pimlico aims to make Ethereum easier to use by leveraging smart accounts through the ERC-4337 token standard. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/261983\/a16z-crypto-leads-4-2-million-seed-investment-in-uk-web3-infrastructure-firm-pimlico","publishDate":"2023-11-07T11:03:49","id":4435,"type":null,"title":"A16z crypto leads $4.2 million seed investment in UK web3 infrastructure firm Pimlico","category":["VENTURE CAPITAL"],"content":["UK web3 infrastructure firm Pimlico raised $4.2 million in a seed financing round led by a16z crypto. The company said it intends to use the funding to expand operations.","Pimlico aims to augment Ethereum through smart accounts via ERC-4337, a token standard that allows for account abstraction, with the ultimate goal of making Ethereum easier to use and add more ways to execute transactions on the network.&nbsp;","\"Smart accounts tackle many limitations the Ethereum protocol has hardcoded, namely that each native account is linked to a single private key. Smart accounts introduce completely customizable logic, unlocking capabilities such as gas sponsorship, gas payments with ERC-20 tokens, better account recovery, spending thresholds, FaceID or passkey verification, among many other use-cases we expect from our accounts,\" Pimlico CEO Kristoff Gazso said in a <a href=\"https:\/\/blog.pimlico.io\/posts\/seed\" data-v-f87c67ca=\"\">statement<\/a>.&nbsp;","Pimlico raised <a href=\"https:\/\/blog.pimlico.io\/posts\/pre-seed\" data-v-f87c67ca=\"\">$1.6 million <\/a>in pre-seed funding led by 1confirmation, with additional participation from Safe, Consensys and over 10 others on Sept. 24.&nbsp;","\"We raised this capital because we feel Ethereum is at a pivotal point,\" Gazso wrote. \"Pimlico was founded to make using Ethereum easier by providing the infrastructure for the new generation of smart accounts.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$4.2 million","content":"MONEY"},{"type":"Pimlico","content":"ORGANIZATION"},{"type":"4337","content":"DATE"},{"type":"$1.6 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Sept. 24","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Kristoff Gazso","content":"PERSON"},{"type":"20","content":"DATE"}],"hashtag":["SEED &AMP; PRE-SEED"],"authors":["MK Manoylov","The Block"]}