{"summary":"1inch founder Sergej Kunz told The Block that the transfer tested the transaction features for its protocol upgrade Fusion.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237891\/1inch-sold-11000-eth-to-test-fusion-transaction-features","publishDate":"2023-07-05T12:50:17","id":4439,"type":null,"title":"1inch sold 11,000 ETH to test Fusion transaction features","category":["DEFI"],"content":["DEX aggregator 1inch sold 11,000 ETH worth around $21 million to test out new features of a protocol upgrade.&nbsp;","Users had puzzled over the transaction on Twitter, noticing the <a href=\"https:\/\/etherscan.io\/tx\/0xa63c32e3cda611df55f887eb2f7da6f1841586b6db38faf4eab3fe1c1d9a134f\" data-v-f87c67ca=\"\">transfer<\/a> on blockchain tracking tool Etherscan.","\"Our team is testing the new feature in Fusion mode,\" 1inch co-founder Sergej Kunz told The Block. \"It’s possible to use custom preset to set duration, start and end auction amount. This kind of strategy is very helpful for rebalancing assets (for DAOs, Hedge and Investment Funds). Based on the results, the trade was executed with better average rate compared to just a market swap.\"","1inch has been testing various features for the <a href=\"https:\/\/www.theblock.co\/post\/197968\/1inch-upgrades-to-offer-gasless-custom-swaps\" data-v-f87c67ca=\"\">Fusion<\/a> update, which augments the exchange's Swap Engine for connecting users to liquidity providing professional market makers. Launched in December, the upgrade allowed for more cost-efficient transactions with added security on top, The Block previously reported.&nbsp;&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$21 million","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"Sergej Kunz","content":"PERSON"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}