{"summary":"A local justice bureau in Beijing has sided with Bitmain&#x27;s ousted co-founder Micree Zhan in a dispute over the company&#x27;s legal representation. The Beijing Haidian District Justice Bureau overturned an earlier decision that had approved Bitmain’s decision to name its former CFO the legal representative for its Beijing subsidiary.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/63443\/local-government-sides-with-bitmain-co-founder-micree-zhan-in-a-dispute-over-his-former-position","publishDate":"2020-04-29T16:05:43","id":4440,"type":null,"title":"Government sides with Bitmain co-founder in a dispute over former position","category":["ASIA"],"content":["A local justice bureau in Beijing has sided with Bitmain's ousted co-founder Micree Zhan in a dispute over the company's legal representation, a ruling that may open the door for Zhan to reclaim some influence over the firm.","According to a <a href=\"https:\/\/mp.weixin.qq.com\/s\/ZCn3UIZjZ_5vny-rCSe2jw\" data-v-f87c67ca=\"\">statement from Bitmain<\/a> published on Wednesday, The Beijing Haidian District Justice Bureau has ruled to reverse a January 2 decision made by the district's market regulation bureau, which had approved of Bitmain's decision, made sometime last year, to name the company's CFO, Luyao Liu, the legal representative for its Beijing subsidiary. The company had previously <a href=\"https:\/\/www.theblockcrypto.com\/linked\/52012\/jihan-wu-is-no-longer-bitmains-legal-representative-public-records-show\" data-v-f87c67ca=\"\">removed<\/a> Zhan from that position amid a struggle for power between him and fellow co-founder Jihan Wu. Wu is currently the company's CEO.","Liu, who had been Bitmain's chief financial officer since 2018, had been moved into the legal representative role to \"improve internal management efficiency,\" according to the statement.&nbsp;","Wu abruptly <a href=\"https:\/\/www.theblockcrypto.com\/linked\/44989\/bitmain-co-founder-and-executive-director-micree-zhan-is-out-abruptly\" data-v-f87c67ca=\"\">took over<\/a> Zhan's role as the CEO and legal representative in October 2019, and in the process relieved Zhan of all his responsibilities at the company. Since then, Zhan has made various efforts to reclaim control. In December last year, he <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2020-01-03\/ousted-bitmain-co-founder-wages-battle-for-control-in-court?sref=w3vFo7gi\" data-v-f87c67ca=\"\">filed a summons<\/a> that asked a Cayman Islands court to reverse a shareholder decision that reduced his voting right of the company. The latest justice bureau ruling came in response to a request Zhan made in February for an administrative review of the market regulation bureau's decision. As a government agency, the local market regulation bureaus is subject to the local justice bureau's oversight.","Zhan <a href=\"http:\/\/www.bjcourt.gov.cn\/cpws\/paperView.htm?id=100901906155&amp;n=1\" data-v-f87c67ca=\"\">also filed a similar complaint<\/a> to the Haidian district court against the market regulation bureau on November 14, 2019, although he withdrew the complaint the next day.&nbsp;","Although the latest ruling means Liu will no longer fill the role of legal representative, it will not change the fact that Zhan is no longer with Bitmain, the company said in a statement. Bitmain said it is \"disappointed\" in the justice bureau's decision, and criticized the bureau for interfering with the company's internal management processes.&nbsp;","\"Bitmain Beijing is only one of the more than ten subsidiaries of Bitmain. Even if Micree Zhan is mistakenly registered as the legal representative of Bitmain Bejing, it will not have a significant impact on the normal operation of Bitmain inside and outside of China,\" it said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Beijing","content":"LOCATION"},{"type":"Bitmain","content":"ORGANIZATION"},{"type":"Cayman Islands","content":"LOCATION"},{"type":"Micree Zhan","content":"PERSON"},{"type":"Zhan","content":"PERSON"},{"type":"October 2019","content":"DATE"},{"type":"December last year","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Micree Zhan","content":"ORGANIZATION"},{"type":"November 14, 2019","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Bitmain","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"The Beijing Haidian District Justice Bureau","content":"ORGANIZATION"},{"type":"Jihan Wu","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"January 2","content":"DATE"},{"type":"Bitmain Bejing","content":"LOCATION"},{"type":"Bitmain Beijing","content":"LOCATION"},{"type":"Luyao Liu","content":"PERSON"},{"type":"China","content":"LOCATION"}],"hashtag":["MINING"],"authors":["Celia Wan","The Block"]}