{"summary":"Web3 ticketing company YellowHeart has launched a metaverse music venue that it hopes will drive changes in how artists, teams and event organizers release tickets and engage with fans.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179632\/creator-of-kings-of-leons-nft-album-now-has-a-metaverse-music-venue-exclusive","publishDate":"2022-10-25T09:00:34","id":4441,"type":null,"title":"Kings of Leon&#x27;s NFT album creator now has a metaverse music venue: Exclusive","category":["GAMING AND METAVERSE"],"content":["Web3 ticketing company YellowHeart is launching a metaverse music venue – a move it hopes will drive changes in how artists, teams and event organizers release tickets and engage with fans.","Built on Spatial, the venue is set to host Grammy-nominated blues artist G.Love as its first performer later this year. Fans will be able to use multiple screens to see what is happening in different parts of the venue at once, talk with each other and take part in meet-and-greets before and after shows.","In the future, they will also be able to purchase food and drinks ahead of the show that will also appear as digital objects.","So far it's been the gaming giants that have really pulled people into the idea of an online concert. The most popular virtual events have been held on platforms like Fortnite and Roblox. In August 2021, Ariana Grande’s concert on Fortnite drew 78 million players. Decentraland will hold its second <a href=\"https:\/\/www.theblock.co\/post\/177891\/ozzy-osbourne-soulja-boy-to-join-decentraland-metaverse-music-festival\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Metaverse Music Festival<\/a> next month. Its line-up includes big names like Ozzy Osbourne and Soulja Boy, as well as over 100 artists.","YellowHeart, which helped Kings of Leon release an NFT version of their latest album, said it hopes to achieve something more than just hosting an event. Founded in 2017, it has a grand mission to change the music ticketing industry at large, which has traditionally been dominated by exclusive ticketing partnerships and reselling giants. Often times, these partnerships can put restrictions on what buyers can and can't do with their tickets. Trying to resell a ticket for a concert you can't attend can be a nightmare.&nbsp;","YellowHeart thinks giving control back to artists and fans through web3 technology can address these pain points. It can also offer benefits that can't be programmed into traditional tickets.","“These include everything from full albums, to custom vinyl records, to exclusive merch, to immersive visual art. Web3 tickets also give artists the ability to share updates with fans about upcoming tour dates, music releases, giveaway opportunities and much more,” the company said.","It's already worked with some big names such as MGM Resorts, Maroon 5 and Julian Lennon. Unlike non-NFT versions available on Spotify, iTunes and other platforms, those purchased through YellowHeart entitled customers to special perks.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Roblox","content":"ORGANIZATION"},{"type":"Soulja Boy","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"MGM","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"August 2021","content":"DATE"},{"type":"Ariana Grande","content":"ORGANIZATION"},{"type":"Ozzy Osbourne","content":"ORGANIZATION"},{"type":"Metaverse Music Festival","content":"ORGANIZATION"},{"type":"Kings of Leon","content":"ORGANIZATION"},{"type":"Julian Lennon","content":"PERSON"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}