{"summary":"The new guidance responds to a number of questions that have been racking the crypto world for the past month. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/169688\/treasury-says-sanctions-on-tornado-cash-dont-stop-people-from-sharing-code","publishDate":"2022-09-13T12:19:50","id":4453,"type":null,"title":"Treasury says sanctions on Tornado Cash don&#x27;t stop people from sharing code","category":["REGULATION"],"content":["The U.S. Treasury is clarifying some of the details of its sanctions on decentralized crypto mixer Tornado Cash, including the right to disseminate the code involved.&nbsp;","\"U.S. persons would not be prohibited by U.S. sanctions regulations from copying the open-source code and making it available online for others to view, as well as discussing, teaching about, or including open-source code in written publications, such as textbooks, absent additional facts,\" FAQs <a href=\"https:\/\/home.treasury.gov\/policy-issues\/financial-sanctions\/faqs\/added\/2022-09-13\" data-v-f87c67ca=\"\">posted<\/a> on September 13 say.&nbsp;&nbsp;","The new guidance further outlines a process for applications from users with crypto stranded in Tornado Cash's mixing pools.&nbsp;","\"OFAC would have a favorable licensing policy towards such applications, provided that the transaction did not involve other sanctionable conduct,\" the FAQs say of Treasury's Office of Foreign Asset Control.","After OFAC put sanctions on Tornado Cash last month, the crypto industry has pushed back on both the public relations and legal fronts.&nbsp;","The most notable example has been a <a href=\"https:\/\/www.theblock.co\/post\/168502\/backed-by-coinbase-employees-sue-treasury-to-roll-back-tornado-cash-sanctions\" data-v-f87c67ca=\"\">lawsuit against the Treasury<\/a> with financial backing from Coinbase. That lawsuit includes plaintiffs who claim the sanctions violated their due process rights by freezing their assets in Tornado Cash, which the licensing regime may alleviate.&nbsp;","<strong data-v-f87c67ca=\"\">Correction:&nbsp;<\/strong><em data-v-f87c67ca=\"\">The Quick Take has been corrected to reflect that the FAQs were published Tuesday, not Monday.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"September 13","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"last month","content":"DATE"},{"type":"OFAC","content":"ORGANIZATION"},{"type":"Treasury's Office of Foreign Asset Control","content":"ORGANIZATION"}],"hashtag":["SANCTIONS"],"authors":["Kollen Post","The Block"]}