{"summary":"The bank looking into a potential sale of the FTX exchange claims that the customer list is a key bargaining chip.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/233899\/ftx-bankers-want-to-keep-extraordinarily-valuable-customer-list-sealed","publishDate":"2023-06-08T18:33:00","id":4457,"type":null,"title":"FTX bankers want to keep ‘extraordinarily valuable’ customer list sealed","category":["COMPANIES"],"content":["Bankrupt crypto exchange FTX has one thing going for it in the aftermath of the meltdown that shuttered the multi-billion dollar trading firm: its clients.&nbsp;","Kevin Cofsky, partner at investment bank Perella Weinberg Partners — which is tasked with exploring restructuring and capital market opportunities for FTX Group — outlined the value of the customer list for potential buyers, as per court documents released Thursday. And that value is the reason it should remain private.&nbsp;","“The estate has approximately 9 million customers and as we evaluate the potential for the treatment of that exchange going forward we believe that the existing customer base is extraordinarily valuable and our understanding is based on our research and having looked at the cost incurred by other crypto companies, specifically to solicit customers,\" said Cofsky.","The customer list is currently sealed but those citing bankruptcy precedence and a group of <a href=\"https:\/\/www.theblock.co\/post\/229448\/ftx-customer-creditor-names-chatgpt-scams\" data-v-f87c67ca=\"\">media outlets<\/a> argue that it should be released.","Cofsky said the bank has reached out to a number of third parties about the idea of acquiring, investing into or reorganizing the FTX exchange. He argued that, based on these conversations, the list would be valuable to prospective buyers or investors.","He added that if the customer list was released then it would damage the value that could be recovered for creditors. “I believe that information is valuable, as I said and I think that releasing that information would impair the debtor's ability to maximize the value that it currently possesses.”","Cofsky added that the existing customers are also valuable. If the exchange is reorganized and creditors end up owning a portion of it, he said, then they would be inclined to trade on the exchange —&nbsp;since their fees would go toward the business that they partially own.","He noted that if the exchange is reorganized, it would be done in a regulatory compliant way, with secure custody and a first-class trading platform.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"Kevin Cofsky","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"FTX Group","content":"ORGANIZATION"},{"type":"Perella Weinberg Partners","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Cofsky","content":"PERSON"}],"hashtag":["FTX"],"authors":["Tim Copeland","The Block"]}