{"summary":"Optimism contributors emphasize with the launch of OP Erigon that multiple clients can help prevent a single point of failure, bolstering the network&#x27;s resilience.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/227593\/optimism-client-op-erigon-released","publishDate":"2023-04-21T10:04:55","id":446,"type":null,"title":"OP Erigon released as new client software for Optimism on testnet","category":["CRYPTO ECOSYSTEMS"],"content":["Test in Prod, a contributor to the Optimism blockchain, has <a href=\"https:\/\/github.com\/testinprod-io\/op-erigon\" data-v-f87c67ca=\"\">released OP Erigon<\/a>, a version of the Erigon client software adapted from Ethereum's mainnet execution layer, as the ongoing push for multiple client software used within blockchains continues.","The client, announced in a blog post yesterday, is anticipated to operate in conjunction with \"OP-Geth,\" another client software specifically created for Optimism.&nbsp;","A client is an application that facilitates user interaction with a blockchain network by verifying transactions and preserving a local version of the network. The OP Erigon release, still in the testing phase, contributes to the efforts to achieve \"client diversity\" within the Optimism blockchain.&nbsp;OP Erigon's launch came a day after venture capital giant <a href=\"https:\/\/www.theblock.co\/post\/227136\/a16z-crypto-andreessen-horowitz-optimism-magi-orange-ball\" data-v-f87c67ca=\"\">Andreessen Horowitz introduced its own consensus client for Optimism<\/a>, called Magi.&nbsp;","<a href=\"https:\/\/www.theblock.co\/linked\/138285\/ethereum-scaling-startup-optimism-raises-150-million-at-1-65-billion-valuation\" data-v-f87c67ca=\"\">Optimism<\/a> is an Optimistic rollup, a type of Layer 2 scaling solution designed to increase the throughput and efficiency of Ethereum (or other blockchain networks) by performing computations off-chain and only submitting the results to the main chain.","The Optimism architecture is designed to accommodate multiple clients operating on the Layer 2 network as well as other chains, such as Coinbase-backed <a href=\"https:\/\/www.theblock.co\/post\/214183\/coinbase-unveils-layer-2-network-and-developer-fund\" data-v-f87c67ca=\"\">Base<\/a>, within the Optimism ecosystem. Optimism contributors emphasize that client diversity can help improve the network's overall resilience.","The network's software architecture, known as the OP Stack, allows the network to split into a consensus layer, responsible for achieving consensus, and an execution layer, designated for smart contracts, similar to the Ethereum mainnet. This modular approach to software design allows for a more adaptable network infrastructure for developers involved in the ecosystem.","\"A fork of the L1 execution client Erigon, OP Erigon will strengthen network resilience, contribute to the decentralization of the OP Stack, and foster developer creativity and experimentation,\" OP Labs, Optimism's core developer, <a href=\"https:\/\/twitter.com\/OPLabsPBC\/status\/1649155125120843777\" data-v-f87c67ca=\"\">noted<\/a> in a tweet.","The initial release of OP Erigon can now be accessed on the Optimistic Goerli testnet.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Geth","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"OP Erigon","content":"ORGANIZATION"},{"type":"Erigon","content":"PERSON"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Coinbase","content":"PERSON"},{"type":"OP Stack","content":"ORGANIZATION"}],"hashtag":["OPTIMISM"],"authors":["Vishal Chawla","The Block"]}