{"summary":"Fidelity Investments CEO Abigail Johnson has said that the firm’s bitcoin custody business has been “incredibly successful.”\nFidelity began offering bitcoin custody services in March 2019 through a separate subsidiary called Fidelity Digital Assets.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/87624\/fidelity-bitcoin-custody-incredibly-successful-ceo-interview","publishDate":"2020-12-14T04:15:45","id":446,"type":null,"title":"Fidelity&#x27;s bitcoin custody business has been &#x27;incredibly successful,&#x27; says CEO","category":["Custody"],"content":["Fidelity Investments chairman and CEO Abigail Johnson has said that the firm's bitcoin custody business has been \"incredibly successful\" and has a \"tremendous pipeline.\"","While Johnson did not provide specific details, she said Fidelity is putting a lot of effort into connecting the legacy world with the future of digital currencies. \"Building those on and off ramps around facilitating the trading between fiat currencies and cryptocurrencies is something that's happening now, and I'm glad it's moving along,\" Johnson <a href=\"https:\/\/www.barrons.com\/video\/fidelity-abigail-johnson-on-managing-disruption-and-bitcoin\/7C9967F5-E701-48C0-8A1D-9B8D537D5AEC.html\" data-v-f87c67ca=\"\">said in an interview<\/a> with Barron's last week.","As for Fidelity's bitcoin custody business, Johnson said it was needed, given the consumer demand. \"If you had asked me in the beginning if we or anybody was going to be prioritizing custody of bitcoin, I would have said 'no way, I mean that's kind of the opposite of what it's all about' but the reality is that you do need it because if you're an individual who engages an advisor and you want to make an estate plan, you actually need somebody to custody your bitcoin,\" she said.","Fidelity <a href=\"https:\/\/www.theblockresearch.com\/fidelitys-bitcoin-custody-business-is-live-a-conversation-with-fidelity-digital-assets-head-tom-jessop-15048\" data-v-f87c67ca=\"\">began offering bitcoin custody services<\/a> in March 2019 through a separate subsidiary called Fidelity Digital Assets, which was set up in October 2018.&nbsp; The entity <a href=\"https:\/\/www.theblockcrypto.com\/linked\/50576\/fidelity-digital-assets-intends-to-support-ethereum-in-2020\" data-v-f87c67ca=\"\">was also looking to add support for ether<\/a> (ETH), but no official announcement has been made yet on that front. Besides bitcoin custody, Fidelity Digital Assets also provides crypto trading and execution services.","Johnson personally finds the crypto industry \"fascinating\" and \"super exciting,\" she said in the interview. Noting rapid developments in the sector, she said distributed finance capabilities, such as Bitcoin's Lightning Network, are \"starting to become a reality.\"","Overall, Johnson suggested that Fidelity's crypto business is going on the right path. \"We've got a lot of good momentum as a business, which is really exciting, and that's really what I sought to achieve when we moved into [crypto], so I'm really happy about that,\" she said.","Fidelity <a href=\"https:\/\/www.fidelitydigitalassets.com\/about-us\" data-v-f87c67ca=\"\">moved into<\/a> the crypto space in 2014. At the time, it began research and development efforts. A year later, the firm started mining bitcoin, and it then tested its first wallet and storage solution with employees in 2016.","Over the years, Fidelity has expanded its crypto services. Last week, the firm partnered with crypto lender BlockFi to custody pledged bitcoin. That means Fidelity's clients can now commit their custodied bitcoin as collateral against USD loans financed by BlockFi. The service is aimed at giving Fidelity's clients access to liquidity while holding their bitcoin."],"hashtag":[]}