{"summary":"Though mostly known for viral short-form videos, TikTok partnered with web3 firms and even launched NFT collections in the past.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236054\/tiktok-coo-steps-down-notes-blockchain-as-incredible-innovation-that-can-change-the-future","publishDate":"2023-06-22T14:42:23","id":4460,"type":null,"title":"TikTok COO steps down, notes blockchain as &#x27;incredible innovation&#x27; that can change the future","category":["COMPANIES"],"content":["V Pappas, Chief Operating Officer of the video sharing platform TikTok, announced that they are stepping down from the role in an internal memo to employees that was later <a href=\"https:\/\/twitter.com\/v_ness\/status\/1671930315781328896\" data-v-f87c67ca=\"\">shared<\/a> on Twitter.&nbsp;","Pappas intends to focus on more entrepreneurial endeavors after parting from the company. In the farewell letter, they noted the innovation happening across multiple technologies that included blockchain.","\"Given all the successes reached at TikTok, I finally feel the time is right to move on and refocus on my entrepreneurial passions. Few had imagined what the last five years would look like and with all the incredible innovation happening now with generative AI, robotics, renewable energy, genomics, blockchain and the IoT, clearly the future will again look much different,\" Pappas wrote.&nbsp;","Though mostly known for viral dances and short-form content, TikTok dabbled with web3 projects over the past few years. In Sept. 2021, TikTok <a href=\"https:\/\/www.theblock.co\/linked\/119181\/tiktok-announces-nft-collection-led-by-top-creators\" data-v-f87c67ca=\"\">released<\/a> an NFT collection of videos from the platform's most popular creators, and the firm also integrated the blockchain-based music platform <a href=\"https:\/\/www.theblock.co\/linked\/117946\/blockchain-based-music-platform-audius-raises-5-million-from-music-industry-giants\" data-v-f87c67ca=\"\">Audius<\/a> in mid-August of 2021.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Sept. 2021","content":"DATE"},{"type":"Pappas","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"mid-August of 2021","content":"DATE"},{"type":"IoT","content":"ORGANIZATION"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}