{"summary":"The LFG refuted claims from a CoinDesk report that indicated a wallet was set up for the LFG on Binance this month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173269\/luna-foundation-guard-denies-reports-it-moved-bitcoin","publishDate":"2022-09-27T18:51:08","id":4461,"type":null,"title":"Luna Foundation Guard denies reports it moved bitcoin","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">The Twitter <a href=\"https:\/\/twitter.com\/LFG_org\/status\/1574882188075606059?s=20&amp;t=s27DARAeDjUGAgGc059zLA\" data-v-f87c67ca=\"\">account<\/a> for Singapore-based non-profit Luna Foundation Guard (LFG) refuted a CoinDesk <a href=\"https:\/\/www.coindesk.com\/policy\/2022\/09\/27\/s-korean-authorities-look-to-freeze-67m-bitcoin-tied-to-terras-do-kwon\/\" data-v-f87c67ca=\"\">report<\/a> and denied the creation of wallets after May 2022.<\/span>","<span data-v-f87c67ca=\"\">“LFG hasn’t created any new wallets or moved $BTC or other tokens held by LFG since May 2022,” LFG tweeted, along with the treasury’s BTC address that showed no activity beyond the indicated timeframe.<\/span>","<span data-v-f87c67ca=\"\">LFG refuted a report in which CoinDesk cited analytics platform CryptoQuant and claimed a wallet created for LFG on the Binance exchange on Sept. 15. In the following days 3,313 BTC were transferred to crypto exchanges, KuCoin and OKX, CoinDesk reported.<\/span>","<span data-v-f87c67ca=\"\">South Korean authorities reached out to exchanges OKX and Kucoin in an effort to freeze the 3,313 BTC in question, according to Coinbase.<\/span>","<span data-v-f87c67ca=\"\">The news comes as Terraform Labs founder Do Kwon, continues to defy South Korean courts that have issued a <\/span><a href=\"https:\/\/www.theblock.co\/post\/172886\/terraform-labs-founder-do-kwon-says-hes-making-zero-effort-to-hide\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">warrant<\/span><\/a><span data-v-f87c67ca=\"\"> for his arrest. Interpol yesterday issued a Red Notice for Kwon, but he appears to remain at large.&nbsp;<\/span>","Kwon later took to Twitter to complain about the reports of moved bitcoin.","\"What has been probably the most surprising in all this is the amount of misinformation that gets spread,\" he said. \"There is no 'cashout' as alleged, I haven't used Kucoin or Okex in at least the last year, and no funds of TFL, LFG or any other entities have been frozen.\"","<em data-v-f87c67ca=\"\">Update: This story has been updated with the tweeted comments from Do Kwon.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"TFL","content":"ORGANIZATION"},{"type":"Kucoin","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"Luna Foundation Guard","content":"ORGANIZATION"},{"type":"May 2022","content":"DATE"},{"type":"Sept. 15","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$BTC","content":"MONEY"},{"type":"LFG","content":"ORGANIZATION"},{"type":"Interpol","content":"ORGANIZATION"}],"hashtag":[],"authors":["Jeremy Nation","The Block"]}