{"summary":"The People&#x27;s Bank of China is seeking public feedback to revise the current central banking law, which aims to legalize digital yuan but prohibit circulation of any yuan-pegged crypto tokens.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/82149\/pboc-seeks-to-revise-banking-law-to-legalize-digital-yuan-and-ban-yuan-pegged-tokens","publishDate":"2020-10-23T08:57:13","id":4463,"type":null,"title":"PBoC seeks to revise banking law to legalize digital yuan and ban yuan-pegged tokens","category":["CENTRAL BANKS"],"content":["The People's Bank of China (PBoC) is seeking public feedback to revise the current central banking law, which aims to legalize digital yuan but prohibit circulation of yuan-pegged digital tokens.","The central bank <a href=\"http:\/\/www.pbc.gov.cn\/goutongjiaoliu\/113456\/113469\/4115077\/index.html\" data-v-f87c67ca=\"\">published<\/a> a notice late Friday China time that it is accepting public feedback for a revision draft until November 23. In Article 19 under Section 3, the draft revision proposes to include the wording that \"Renminbi includes both a physical form and a digital form.\"","The proposed revision appears to be paving a legal path for a wider rollout of China's long-anticipated central bank digital yuan initiative.","In addition, Article 22 under Section 3 in the revision draft also states that \"any individual or entity shall not make or issue any tokenized note or digital tokens that replace Renminbi's circulation in the market.\"","\"For anyone that violates such regulation, the PBoC will halt such activities and forfeit any proceed from the making and selling of yuan-backed digital tokens and issue a fine that is up to five times of the involved proceeds,\" the proposed revision states.&nbsp;","The current edition of China's central banking law has been effective since 2003, which outlines the role of the PBoC in issuing sovereign fiat currency as well as drafting and executing monetary polices to maintain financial stability.&nbsp;","The proposed revision comes amid the PBoC is expanding the trial of China's digital yuan in major domestic cities. The Block recently <a href=\"https:\/\/www.theblockcrypto.com\/daily\/81710\/china-digital-currency-patents\" data-v-f87c67ca=\"\">reported<\/a> that the central bank has been authorized with 15 patent applications for the central bank digital currency that shed lights on the system's financial surveillance capability.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"People's Bank of China (PBoC","content":"ORGANIZATION"},{"type":"Friday China","content":"LOCATION"},{"type":"2003","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"PBoC","content":"ORGANIZATION"},{"type":"November 23","content":"DATE"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Wolfie Zhao","The Block"]}