{"summary":"dYdX will not operate and earn trading fee revenue from its upcoming v4 platform as it has moved to become a public benefit corporation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/257984\/dydx-public-benefit-corporation-v4","publishDate":"2023-10-17T13:50:43","id":4472,"type":null,"title":"dYdX won&#x27;t profit from v4 as it becomes public benefit corporation","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">dYdX <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248448\/dydx-dydx-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/hjnIm9bV.jpg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">DYDX<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.64%\n    <\/span><\/a> <!----><\/span><\/span> Trading, the company behind one of the largest decentralized exchanges, will not earn trading fee revenue from its upcoming v4 platform as it has moved to become a public benefit corporation.<\/span>","\"dYdX Trading Inc. has officially updated its charter to become a Public Benefit Corporation,\" Antonio Juliano, founder and CEO of dYdX, <a href=\"https:\/\/twitter.com\/AntonioMJuliano\/status\/1714251418675155435\" data-v-f87c67ca=\"\">said<\/a> on X. \"As open-source software developers, we will not operate or generate trading fee revenue from <a href=\"https:\/\/www.theblock.co\/post\/153478\/dydx-to-expand-to-its-own-blockchain-in-the-cosmos-ecosystem\" data-v-f87c67ca=\"\">dYdX v4<\/a>. We are serious about being as aligned as possible with the community.\"","dYdX's new legal structure comes just a day after rival <a href=\"https:\/\/www.theblock.co\/post\/257798\/uniswap-to-charge-0-15-to-swap-certain-tokens-on-web-interface-and-wallet?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">Uniswap said<\/a> it will start charging a fee of 0.15% to swap certain tokens on its web interface and wallet. Juliano told The Block in an interview that dYdX had already received its updated charter approval on Sept. 15, with the company having worked on the move for a while now.","\"It is just another step on our path towards full decentralization,\" he said. \"And the biggest step on that path is going to be the full production release of dYdX Chain, and we're getting really close to that.\"","dYdX's previous legal structure was as a C Corporation (C Corp) in Delaware, Juliano said. The new public benefit corporation structure still allows it to make a profit, but the firm is legally committed to not just maximizing shareholder value.","While dYdX won't earn from its v4 platform, it will continue to generate trading fee revenue from previous versions of its protocol, including v3, Juliano said. But he expects most, if not all, of the trading activity to move to the new version over time after it launches.","dYdX's v4 platform is currently functioning on testnet and it is expected to go live on mainnet in the next few weeks, Juliano said. dYdX v4 will be deployed on dYdx's own Cosmos-based blockchain called dYdX Chain.","dYdX has made money from running some parts of its decentralized exchange, such as managing the order book, determining what new features to add, and managing the front end of its platform. With v4, the company will no longer manage these functions, as the dYdX Chain will be run by third-party validators and entities, Juliano said.","The dYdX Chain launch will see user trading fees going to node operators and token stakers on the network, he added.","On losing potential trading fee revenue from v4, Juliano said dYdX has been \"very profitable over the past couple of years to the point where we have over six years of runway at this point.\" And that it is now focused on full decentralization of its platform.","\"Effectively now we can operate in the public interest, and that public interest is what we've said in our missions for a while now, to democratize access to financial opportunity, specifically through open source software,\" Juliano said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Uniswap","content":"PERSON"},{"type":"Antonio Juliano","content":"PERSON"},{"type":"Delaware","content":"LOCATION"},{"type":"Juliano","content":"PERSON"},{"type":"-1.64%","content":"PERCENT"},{"type":"Sept. 15","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"dYdX Trading Inc.","content":"ORGANIZATION"},{"type":"0.15%","content":"PERCENT"},{"type":"Public Benefit Corporation","content":"ORGANIZATION"},{"type":"C Corporation (C Corp","content":"ORGANIZATION"}],"hashtag":["DEXS"],"authors":["Yogita Khatri","The Block"]}