{"summary":"Zhao met with a group of policy experts including officials from Downing Street and the Treasury. \nIn a speech, he said Binance had made mistakes in the past but wants to engage with regulators in the UK going forward. ","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/136768\/binance-ceo-uk-government-charm-offensive","publishDate":"2022-03-08T10:25:25","id":448,"type":null,"title":"Binance boss met with UK government officials last week in Westminster ‘charm offensive’","category":["Exchanges"],"content":["<span data-v-f87c67ca=\"\">Binance CEO Changpeng Zhao, the high-profile crypto billionaire universally known as CZ, spent last Wednesday night wooing an influential gathering of UK government officials in Westminster.<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Zhao delivered a speech at a dinner on March 2 for guests from 10 Downing Street and the Treasury, as well as MPs and Lords, according to people who attended the event. The evening was organized by the Centre for Policy Studies, a conservative think tank.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In his speech, Zhao conceded that mistakes had been made building the crypto exchange into the behemoth it is today — but stressed that he now wants to engage more proactively with regulators.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“It felt like he was here doing a charm offensive,” said one source. Another said that the presence of advisors from Downing Street and the Treasury “indicates how seriously the government is taking this.”<\/span>","<span data-v-f87c67ca=\"\">Binance has a checkered history in the UK. In June last year, the Financial Conduct Authority (FCA) ordered Binance Markets Limited, the firm’s UK entity, <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/109766\/uk-fca-bans-crypto-exchange-binance\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">to halt all regulated activity<\/span><\/a><span data-v-f87c67ca=\"\"> in the country. The FCA later said it’s “not capable” of supervising Binance — adding that the firm had refused to answer questions.<\/span>","<span data-v-f87c67ca=\"\">Only yesterday, after Binance <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/136609\/binance-eqonex-deal-uk-fca-bifinity\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">announced a deal<\/span><\/a><span data-v-f87c67ca=\"\"> with Nasdaq-listed crypto firm Eqonex that appears to give it control of an FCA-registered crypto custodian named Digivault, the FCA issued a statement warning that it could withdraw the registered status “if it is not satisfied the firm or its beneficial owner is fit and proper.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">One person at the event said Zhao’s speech gave the impression that Binance is now pursuing compliance “in a much more serious way than they have before.”<\/span>","<span data-v-f87c67ca=\"\">A spokesperson for Binance declined to comment on what was discussed at the dinner, but said Zhao “has been quite clear on the record that we are fully compliant globally and we want to get every license and registration that we can.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Conservative MP Matt Warman and Ed Vaizey, the former minister for culture, communications and creative industries, were among those who attended the dinner.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A spokesperson for the Centre for Policy Studies said of the event: “We hosted a private dinner with the Binance CEO last week, to discuss cryptocurrency with a group of interested policy experts.”&nbsp;<\/span>","<em data-v-f87c67ca=\"\">Update: This article was update at 19:45 ET to reflect the fact that the dinner took place on March 2, not March 3 as originally stated. &nbsp;<\/em>"],"hashtag":["BINANCE"]}