{"summary":"Shanghai municipal government today released an action plan that aims to achieve blockchain breakthroughs by 2025.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/253134\/shanghai-publishes-blockchain-plan-to-support-trade-metaverse-government-affairs","publishDate":"2023-09-27T02:50:52","id":4488,"type":null,"title":"Shanghai publishes blockchain plan to support trade, metaverse, government affairs","category":["ASIA"],"content":["<span data-v-f87c67ca=\"\">Shanghai today published an action plan to boost the technical development of blockchain in the city up to 2025, as the Chinese city continues its web3 drive.<\/span>","<span data-v-f87c67ca=\"\">Under the plan, Shanghai intends to achieve breakthroughs in the fields of blockchain system security, cryptographic algorithms, blockchain-specific processors, smart contracts, cross-chain, storage, privacy computing and regulation, the Shanghai municipal government said in a <\/span><a href=\"https:\/\/www.shanghai.gov.cn\/nw12344\/20230927\/a6a5403e111641a590212cf649ff23b7.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">statement<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">Such technological developments can offer support for the construction of the municipal blockchain basic service platform and the development of key areas such as government affairs, cross-border trade, supply chain, finance, metaverse and data element circulation, the statement continued.<\/span>","<span data-v-f87c67ca=\"\">The Shanghai government will also look to support the development of zero-knowledge proofs. To address the need for improving the efficiency and usability in the space, the city aims to enhance the performance of general zero-knowledge proof protocols, the statement said.<\/span>","<span data-v-f87c67ca=\"\">“By 2025, the efficiency of zero-knowledge proof algorithm proof generation would be improved by 2 times compared to similar international protocols like Plonk,” the Shanghai government said.<\/span>","The government further hopes to nurture talent specifically for the blockchain industry. In the plan, the government said it encourages research institutes and companies to \"make good use\" of the country's foreign talent recognition standards to hire blockchain professionals in Shanghai.","\"[We] will also guide universities, research institutes and companies to step up their efforts in cultivating young blockchain talents, creating interdisciplinary and cross-industry platforms for exchange and development opportunities, and supporting young talents to take on significant roles and become key figures,\" the plan said.","<span data-v-f87c67ca=\"\">This is not the first time Shanghai has outlined plans for blockchain development. In June, the city government <\/span><a href=\"https:\/\/www.shanghai.gov.cn\/nw12344\/20230731\/74d21b6a0d7e4f909168ad372c2b4f82.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">released<\/span><\/a><span data-v-f87c67ca=\"\"> a document that aims to improve blockchain infrastructure by 2025 and explore the possibility of establishing links with Hong Kong and Singapore to test cross-chain applications.<\/span>","<span data-v-f87c67ca=\"\">While China banned all cryptocurrency transactions in September 2021, the country <\/span><a href=\"https:\/\/www.theblock.co\/linked\/107414\/china-guideline-foster-blockchain\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">remains bullish on homegrown blockchain technology and digital economies<\/span><\/a><span data-v-f87c67ca=\"\"> — with Chinese tech giants, such as Alibaba and Tencent, focusing on developing their own consortium blockchains.<\/span>","<span data-v-f87c67ca=\"\">In May, Beijing <\/span><a href=\"https:\/\/www.theblock.co\/post\/232404\/beijing-web3-white-paper?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">released a white paper aimed at promoting innovation and development of the Web 3.0 industry<\/span><\/a><span data-v-f87c67ca=\"\">. The government is looking to position Beijing as a global innovation hub for the digital economy.<\/span>","<span data-v-f87c67ca=\"\">Last month, the <\/span><a href=\"https:\/\/www.theblock.co\/post\/245921\/china-sichuan-metaverse-2025\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Sichuan province published a draft action plan<\/span><\/a><span data-v-f87c67ca=\"\"> that aims to expand its metaverse industry to hit a market size of 250 billion yuan ($34.4 billion) by 2025. The Shandong province also aims for its metaverse-related initiatives to <\/span><a href=\"https:\/\/www.theblock.co\/post\/249407\/chinas-shandong-province-aims-for-metaverse-market-worth-20-5-billion-by-2025\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reach a market size of 150 billion yuan ($20.5 billion) by 2025<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2025","content":"DATE"},{"type":"Beijing","content":"LOCATION"},{"type":"Sichuan","content":"LOCATION"},{"type":"Alibaba","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"150 billion yuan","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"September 2021","content":"DATE"},{"type":"Tencent","content":"ORGANIZATION"},{"type":"250 billion yuan","content":"MONEY"},{"type":"$20.5 billion","content":"MONEY"},{"type":"Singapore","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"$34.4 billion","content":"MONEY"},{"type":"Shandong","content":"LOCATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Shanghai","content":"LOCATION"},{"type":"China","content":"LOCATION"}],"hashtag":["ASIAN REGULATION","DEVELOPER TOOLS"],"authors":["Timmy Shen","The Block"]}