{"summary":"While the cryptosphere has rallied around the decentralized mixing protocol, some are underestimating the long-term impact of US sanctions. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/162817\/treasury-sanctions-on-tornado-cash-extend-far-beyond-the-us","publishDate":"2022-08-10T13:06:13","id":4490,"type":null,"title":"Treasury sanctions on Tornado Cash extend far beyond the US","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">On Monday, the US Treasury’s Office of Foreign Asset Control (OFAC) designated Tornado Cash as well as an ecosystem of linked wallets, saying that bad actors including North Korea’s Lazarus group had used the platform to launder more than $7 billion. The project’s co-founder <\/span><a href=\"https:\/\/twitter.com\/semenov_roman_\/status\/1556717890308653059\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">saw<\/span><\/a><span data-v-f87c67ca=\"\"> his account on open-source code repository GitHub taken down, and users of the mixer had their funds locked.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">There has subsequently been an outcry from the crypto community, which has been mourning the loss of the platform. Leading crypto figures such as Vitalik Buterin <\/span><a href=\"https:\/\/twitter.com\/VitalikButerin\/status\/1556925602233569280\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">came forward<\/span><\/a><span data-v-f87c67ca=\"\"> about using Tornado Cash for good causes.<\/span>","<span data-v-f87c67ca=\"\">Others have minimized the impact of US sanctions designations, particularly for people outside of the country.&nbsp;&nbsp;<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/asset-management\/tornado-cash-privacy-pool-usd-value-daily\/embed\" title=\"Tornado Cash Privacy Pool USD Value\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<span data-v-f87c67ca=\"\">For the time being, the amount of crypto in Tornado Cash’s privacy pool has not yet dropped precipitously. A <\/span><a href=\"https:\/\/twitter.com\/BotTornado\/status\/1557076770183995393\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">bot<\/span><\/a><span data-v-f87c67ca=\"\"> that tracks the mixer’s 24-hour transaction volume found it had processed nearly $3 million in transactions in the day following the OFAC announcement.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But, long term, these arguments underestimate the scope of US jurisdictions — especially when it comes to <\/span><a href=\"https:\/\/www.justice.gov\/opa\/pr\/bnp-paribas-agrees-plead-guilty-and-pay-89-billion-illegally-processing-financial\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">global<\/span><\/a><span data-v-f87c67ca=\"\"> financial institutions. The reality is that most of the crypto going through the protocol is destined for conversion back into fiat before it is spent. The US plays a central role in that process globally. It’s the same reason that the US sanctions regime is such a powerful tool in traditional finance.<\/span>","<span data-v-f87c67ca=\"\">In the absence of secondary sanctions, it’s true that non-US entities are broadly speaking still allowed to transact. But financial intermediaries around the world — the ones non-US Tornado Cash users will need in order to cash out — will now see these transactions as risky. As those entities back away, it’s likely that Tornado Cash will lose much of its liquidity.<\/span>","<span data-v-f87c67ca=\"\">Moreover, it’s not just legitimate institutions that want to avoid OFAC-designated entities.<\/span>","<span data-v-f87c67ca=\"\">“Even if you’re an illicit actor, you don’t want to put your money somewhere the US government is shining a light,” said Ari Redbord, a former advisor at the Treasury’s office of terrorism and financial intelligence who now leads the legal team at blockchain analytics firm TRM Labs.<\/span>","<span data-v-f87c67ca=\"\">The involvement of North Korea’s Lazarus group in this case effectively damns any project associated with Tornado Cash, as the national security apparatus is significantly more aggressive than any US financial regulator.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“It was really bad when we thought hackers attacked Ronin,” said Redbord, referring to the recent <\/span><a href=\"https:\/\/www.theblock.co\/post\/140165\/ronin-replaces-compromised-validators-and-plans-to-bolster-security-after-600-million-hack\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">theft of nearly $600 million<\/span><\/a><span data-v-f87c67ca=\"\"> from the network underlying the game Axie Infinity. “It became a national security issue when we learned that it was North Korea.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While sanctions explicitly criminalize US persons or US-based entities from interacting with Tornado Cash or the designated associated wallets, their applications are significantly broader.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Even if you are not a US person, cashing out funds from Tornado Cash at a compliant cryptocurrency service subject to US jurisdiction could still trigger a violation,” wrote Andrew Fiernan, head of sanctions strategy at Chainalysis.<\/span>","<span data-v-f87c67ca=\"\">Some, such as Coin Center’s Peter Van Valkenburgh, argued that OFAC had overstepped its authority by <\/span><a href=\"https:\/\/www.youtube.com\/watch?v=XpTrCA3tEKM&amp;t=1059s\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">designating<\/span><\/a><span data-v-f87c67ca=\"\"> an “entity” that is actually a smart contract. Typically, a legal entity is either an individual or a corporation, which gives it the right to, among other things, own property, open bank accounts and get representation in court. Tornado Cash can do none of these things. Most importantly, that means it cannot fight against its own designation.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The smart contract itself can still function — a mirror site is, in fact, already <\/span><a href=\"https:\/\/tornadov3.cash\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">live<\/span><\/a><span data-v-f87c67ca=\"\">. But the privatization features of Tornado Cash depend on having a sufficient user base. With the US Treasury having established an aggressive posture towards any new mixer that would take Tornado Cash’s place, it’s hard to picture one growing to the same scale as Tornado Cash — especially if state actors like the Lazarus Group begin using it — without encountering a similar OFAC action.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">From its experience with traditional financial investigations and sanctions, OFAC is already familiar with the whack-a-mole game of finding shell companies and related individuals holding assets for designated actors. With more tools to trace crypto, the Treasury seems set on taking that similar approach to digital finance.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Roman Semenov, a co-founder of Tornado Cash, did not return a request for comment as of publication time.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lazarus","content":"PERSON"},{"type":"US Treasury","content":"ORGANIZATION"},{"type":"TRM Labs","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"North Korea","content":"LOCATION"},{"type":"Lazarus Group","content":"ORGANIZATION"},{"type":"Ronin","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"$3 million","content":"MONEY"},{"type":"$600 million","content":"MONEY"},{"type":"Andrew Fiernan","content":"PERSON"},{"type":"US Treasury’s Office of Foreign Asset Control (OFAC","content":"ORGANIZATION"},{"type":"$7 billion","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"Ari Redbord","content":"PERSON"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Peter Van Valkenburgh","content":"PERSON"},{"type":"OFAC","content":"ORGANIZATION"},{"type":"Roman Semenov","content":"PERSON"},{"type":"Redbord","content":"PERSON"}],"hashtag":["MIXERS","SANCTIONS"],"authors":["Kollen Post","The Block"]}