{"summary":"Korean startup Uprise lost $20 million in client funds by shorting Luna during its price collapse — and getting caught on the bounces.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156031\/uprise-lost-99-of-client-funds-while-shorting-luna-during-its-price-crash","publishDate":"2022-07-06T09:26:17","id":4492,"type":null,"title":"Uprise lost 99% of client funds while shorting LUNA during its price crash: SE Daily","category":["COMPANIES"],"content":["Korean crypto startup Uprise lost virtually all of its client funds by shorting luna (LUNA) during its price crash and getting caught on the bounces, Seoul Economic daily <a href=\"https:\/\/www.sedaily.com\/NewsView\/268F1RV1RN\" data-v-f87c67ca=\"\">reported<\/a> on Wednesday.","The Korean firm billed itself as using artificial intelligence (AI)-enabled automatic trading strategies to trade crypto on behalf of its clients. This trading desk is one-half of the company’s service called Heybit while the other half is a global exchange-traded funds platform called Iruda.","Under Heybit, Uprise took custodied crypto assets from customers and traded them in the cryptocurrency futures market. Uprise’s AI-enabled trading technology was supposed to minimize the risk associated with leveraged crypto trading.","However, the system could not prevent the firm from being liquidated out of its LUNA futures trading position and losing 26.7 billion won ($20 million) in the process. This happened during Luna's price crash. It was reportedly shorting Luna — while its price plummeted — but got caught out during sudden price pumps along the way.","The lost funds represent about 99% of the funds that Uprise was managing on behalf of its customers. These clients are high-net-worth individuals and corporate entities, according to the report. Uprise also reportedly lost $3 million of its own funds short trading LUNA.","Uprise is reportedly considering some form of compensation for affected customers. “It is true that damage to customer assets has occurred due to unexpected great volatility in the market. We plan to finalize the report on [the] virtual asset business soon,” said a spokesperson for the company, according to Seoul Economic daily.","Korean venture capital giant Kakao Ventures and major Korean commercial lender Hana Bank are among some of the <a href=\"https:\/\/www.smarttimes.co.kr\/news\/articleView.html?idxno=2165\" data-v-f87c67ca=\"\">backers<\/a> of Uprise. The firm raised about $18.3 million in a Series C funding round in December 2021.","Uprise is the latest crypto business to be impacted by the LUNA collapse. The token’s death spiral in May — along with its sister token TerraUSD (UST) — has triggered <a href=\"https:\/\/www.theblock.co\/post\/153713\/inside-cryptos-biggest-deleveraging-event-and-the-three-arrows-capital-fallout\" data-v-f87c67ca=\"\">serious financial problems<\/a> for hedge funds and lenders alike including <a href=\"https:\/\/www.theblock.co\/post\/155578\/three-arrows-capital-files-for-chapter-15-bankruptcy-in-new-york\" data-v-f87c67ca=\"\">Three Arrows Capital<\/a> and Celsius.","We have reached out to Uprise and will update this article should we hear back.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to subscribe to The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/t.me\/the_block_crypto\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/t.me\/the_block_crypto\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">Telegram<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"December 2021","content":"DATE"},{"type":"Seoul Economic","content":"ORGANIZATION"},{"type":"Kakao Ventures","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"$18.3 million","content":"MONEY"},{"type":"$20 million","content":"MONEY"},{"type":"99%","content":"PERCENT"},{"type":"$3 million","content":"MONEY"},{"type":"UST","content":"ORGANIZATION"},{"type":"Hana Bank","content":"LOCATION"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}