{"summary":"A defense lawyer for Avraham Eisenberg asserted in court that &quot;it is not illegal to win.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287358\/avraham-eisenberg-executed-a-winning-trading-strategy-says-his-defense-lawyer-report","publishDate":"2024-04-09T13:33:46","id":45,"type":null,"title":"Avraham Eisenberg &#x27;executed a winning trading strategy,&#x27; says his defense","category":["PEOPLE"],"content":["The court case against the Mango Markets exploiter Avraham 'Avi' Eisenberg began its opening statements Tuesday morning in a Southern District of New York court.","Eisenberg's defense repeats what he has said since taking responsibility for the Mango Markets exploit two years ago, emphasizing that his actions enacted a lawful \"winning\" trading strategy. However, the prosecution still claims that what Eisenberg did, from alleged market manipulation to stealing funds, was fraudulent, <a href=\"https:\/\/twitter.com\/innercitypress\/status\/1777689619523309593\" data-v-f87c67ca=\"\">reports<\/a> from Inner City Press.","In opening statements, Assistant US Attorney Tian Huang said Eisenberg artificially pumped up the price of MANGO, stole funds, disguised himself as a Ukrainian woman, fled the country and ultimately \"conned Mango Markets.\"","\"At the end, what that man did boils down to something far older: plain fraud,\" Huang added.","Eisenberg's defense impinges on claiming the trades were legitimate within the decentralized finance system he executed them in.","\"Every trade has a winning side, and every trade has a losing side. It is not illegal to win, to execute a trade that is to your benefit,\" said Eisenberg's defense lawyer Sanford Talkin. \"He does not deny he did these trades. He does not deny he made a profit. But he denies he committed a crime, because he did not. He executed a winning trading strategy. He is not guilty.\"","Mango Markets is a Solana-based decentralized finance protocol providing borrowing, lending and other financial services. In early October 2022, a hacker artificially pumped up the price of MANGO, the platform's native token, and exploited the protocol through a bad debt position. This is when a borrower takes funds that they will not or cannot pay back, leaving the lender — Mango Markets — in the hole.","Specifically, the exploiter put $5 million worth of the stablecoin USDC into Mango Markets and then opened a remarkably large long position, which caused MANGO's price to jump around 1,000% within an hour. The surge in MANGO's price caused the exploiter's collateral value to rise. The exploiter then borrowed other tokens on Mango Markets to accrue a large debt position before making off with the funds, The Block previously reported.","In all, Mango Markets lost around <a href=\"https:\/\/www.theblock.co\/post\/176445\/hacker-steals-over-100-million-from-mango-markets\" data-v-f87c67ca=\"\">$116 million<\/a> worth of funds in the exploit.","Eisenberg took <a href=\"https:\/\/www.theblock.co\/post\/177424\/mango-markets-exploiter-comes-clean-claims-all-actions-were-legal\" data-v-f87c67ca=\"\">responsibility<\/a> a few days after the incident, stating that his actions were part of a legal \"highly profitable\" trading strategy that used Mango Markets as it was designed. He returned $67 million in stolen funds back to Mango Markets, and the protocol's community allowed him to <a href=\"https:\/\/www.theblock.co\/post\/177736\/mango-markets-proposes-plan-to-pay-back-victims-after-114-million-hack\" data-v-f87c67ca=\"\">keep<\/a> $47 million in a governance vote.","However, the United States agencies didn't buy Eisenberg's claims of legality. The US Justice Department <a href=\"https:\/\/www.theblock.co\/post\/198172\/mango-markets-exploiter-arrested-in-puerto-rico-for-alleged-market-manipulation\" data-v-f87c67ca=\"\">arrested<\/a> Eisenberg in Puerto Rico for charges related to commodities fraud and commodities manipulation in December 2022. The Commodity Futures Trading Commission <a href=\"https:\/\/www.theblock.co\/post\/200255\/cftc-files-its-own-case-against-mango-markets-exploiter\" data-v-f87c67ca=\"\">sued<\/a> Eisenberg for \"a manipulative and deceptive scheme to artificially inflate the price of swaps offered by Mango Markets.\" The Securities and Exchange Commission <a href=\"https:\/\/www.theblock.co\/post\/204331\/sec-charges-avraham-eisenberg-for-116-million-mango-markets-exploit\" data-v-f87c67ca=\"\">charged<\/a> him with orchestrating an attack on Mango Markets and manipulating its governance token nearly in late January 2023.&nbsp;","Eisenberg faces <a href=\"https:\/\/www.theblock.co\/post\/235083\/avraham-eisenbergs-criminal-trial-set-for-december-4-bloomberg\" data-v-f87c67ca=\"\">20 years<\/a> in prison.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"1,000%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"January 2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Sanford Talkin","content":"PERSON"},{"type":"October 2022","content":"DATE"},{"type":"Puerto Rico","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"$5 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"Inner City Press","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Avi' Eisenberg","content":"PERSON"},{"type":"$67 million","content":"MONEY"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Eisenberg","content":"PERSON"},{"type":"Tian Huang","content":"PERSON"},{"type":"Mango Markets","content":"ORGANIZATION"},{"type":"US Justice Department","content":"ORGANIZATION"},{"type":"December 2022","content":"DATE"},{"type":"Southern District of New York","content":"LOCATION"},{"type":"Solana","content":"LOCATION"},{"type":"$47 million","content":"MONEY"},{"type":"$116 million","content":"MONEY"}],"hashtag":["CRIME","LAWSUITS"],"authors":["MK Manoylov","The Block"]}