{"summary":"After each financial crisis, new regulations are adopted, such as the Dodd Frank Act, said Treasury’s Assistant Secretary for Financial Institutions Graham Steele. \nSteele, as well as Ripple CEO Brad Garlinghouse later in the day, both poked fun at Dogecoin.","author":["Sarah Wynn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273440\/treasury-officials-call-for-action-from-us-policymakers-to-regulate-crypto-before-the-next-crisis-hits","publishDate":"2024-01-18T13:41:24","id":450,"type":null,"title":"Treasury officials call for action from US policymakers to regulate crypto before the next crisis hits","category":["Policy"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Lawmakers in the U.S. need to take action before the next crisis to develop standards to regulate crypto, a U.S. Treasury official warned on Thursday.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">After each financial crisis, new regulations are adopted, such as the Dodd Frank Act and the National Bank Act, said Treasury Assistant Secretary for Financial Institutions Graham Steele. For crypto, policymakers have the ability to act before a crisis happens, he said.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"For crypto-assets, policymakers have a chance to act before a crisis to adopt higher standards that support responsible innovation,\" Steele said. \"At the same time, it is critical that any legislative proposals don't undermine the already robust regulatory foundations that apply to financial institutions and capital markets.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Steele spoke Thursday at an event hosted by George Washington University Law School and outlined his time at the Treasury Department over the past two years overseeing cybersecurity, crypto, capital markets, among others.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Lawmakers in Washington have been working for some time on bills to rein in the crypto industry. The focus on crypto has also come from President Joe Biden, who released an executive <a href=\"https:\/\/www.theblock.co\/linked\/136956\/white-house-confirms-details-of-bidens-planned-executive-order-on-digital-assets\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">order<\/span><\/a> in 2022 <\/span><span class=\"s3\" data-v-f87c67ca=\"\">\"outlining the first ever, whole-of-government approach to addressing the risks and harnessing the potential benefits of digital assets and their underlying technology.\" The order honed in on topics such as consumer protection, financial stability, climate risks and national security.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">The order also tasked Treasury with writing several reports, including one on crypto. That report from 2022 called for federal regulatory agencies to monitor the sector for bad actors and issue guidance and rules.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">\"Our report noted that the U.S. generally has strong investor and consumer protection laws that address many of the risks posed by crypto-assets,\" Steele said on Thursday. \"Where existing laws and regulations apply, they have to be vigorously enforced so that crypto-assets and services — and the consumers who use them — are subject to the same protections and principles as other financial products and services.\"<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">Steele also delved into the use cases behind crypto on Thursday.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">\"There are a number of prospective use cases that proponents hold out as the ways in which these products or services can be very beneficial,\" Steele said. Those include cross border payments, faster and lower cost settlement and immutable ledgers, he added.<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">\"Those feel like the areas, at least in our report, that we said were the most promising,\" Steele said. \"So it's less about the crypto asset itself.\"&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">Steele took a dig at Dogecoin, calling assets like that speculative.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">\"It's less about — I don't even know if Dogecoin is still a thing or not, but it's less about trading some of those things,\" Steele said.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">Meanwhile, on stage at the World Economic Forum in Davos, Switzerland, crypto executives were asked about those who say crypto still lacks major use cases.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">Ripple CEO Brad Garlinghouse cited his firm's focus on solving cross border settlement problems, but added there is speculation in the sector.<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">\"What we haven't seen yet that I still think we will see eventually see is a separation of wheat and chaff,\" Garlinghouse said, including how technologies can be used to solve problems. The CEO also poked at Dogecoin.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"I don't get it,\" Garlinghouse said. \"Other than Elon Musk as the central actor, I don't see the use case, the purpose.\"&nbsp;<\/span>"],"hashtag":["CFTC","HOUSE AGRICULTURE COMMITTEE","HOUSE FINANCIAL SERVICES COMMITTEE","SEC","SENATE BANKING COMMITTEE","SENATE FINANCE COMMITTEE","TREASURY DEPARTMENT","WAYS AND MEANS COMMITTEE"]}