{"summary":"Coinbase has hired Brett Tejpaul as the exchange attempts to lure Wall Street firms to the burgeoning crypto market.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/62362\/coinbase-taps-barclays-executive-to-lead-institutional-business","publishDate":"2020-04-20T06:00:10","id":450,"type":null,"title":"Coinbase taps Barclays executive to lead institutional business","category":["EXCHANGES"],"content":["Coinbase has hired a Barclays executive to help it take another swing at Wall Street","Brett Tejpaul brings to the firm decades of experience in credit and derivatives sales and innovative technology","In an interview with The Block, Tejpaul described how he plans to shape Coinbase’s new institutional strategy","Crypto exchange Coinbase is making another big push into the institutional market – and it has hired former Barclays executive Brett Tejpaul to lead the charge.","Tejpaul <a href=\"https:\/\/blog.coinbase.com\/our-focus-on-the-institutional-space-5c8e87332268\" data-v-f87c67ca=\"\">has joined Coinbase<\/a> as head of institutional coverage after a 17-year-long career at Barclays, spanning roles in credit and commodities sales and digital innovation. His positions at the bank have included global head of sales, global head of credit and commodities, and most recently head of digital, according to his LinkedIn <a href=\"https:\/\/www.linkedin.com\/in\/brett-tejpaul\/\" data-v-f87c67ca=\"\">profile<\/a>.&nbsp;","In a phone interview with The Block, Tejpaul described the firm’s new approach to the institutional market, through which he said the firm could serve products and services far beyond the trading of bitcoin and other cryptocurrencies.","Tejpaul said Coinbase's institutional business would continue to leverage its over-the-counter trading, custody and exchange services – but that it will take a broader approach to client needs. To that end, Tejpaul and the institutional coverage team members will be undertaking a deeper push into Wall Street to see where collaboration and deals can be struck, he said.&nbsp;","“I think about what a stablecoin can do,” said Tejpaul. “I think about credit risk, settlement risk, speed of settlement, the cost to maintain old infrastructure. This can serve as a precursor of broader adoption and the trading of bitcoin and other cryptocurrencies.”","It’s not precisely clear what services Coinbase could build around stablecoins. The exchange declined to provide specific details. Coinbase currently offers USDC stablecoin trading pairs and is a member of the consortium that manages the stablecoin.&nbsp;","Elsewhere in the market, companies like Paxos and Circle have doubled down on their stablecoin offerings, with the latter completely pivoting to the burgeoning sector. Circle offers APIs that businesses in industries ranging from fintech to e-commerce can use to accept payment in USDC and offer services built on top of it.&nbsp;","<strong data-v-f87c67ca=\"\">Take two<\/strong>","Coinbase’s revamped institutional strategy comes about two years after it rolled out its suite of institutional services in May 2018. Later that year, the firm witnessed an exodus of talent amid conflicting views for how the business should be built out.","<span data-v-f87c67ca=\"\">As The Block reported at the beginning of last year, Coinbase’s aspirations shifted from courting Wall Street investors and financial advisors to doubling down on servicing crypto-native firms. Around that time, former Instinet CEO Jonathan Kellner<\/span>&nbsp;was set to join <a href=\"https:\/\/www.theblockresearch.com\/coinbase-has-poached-instinet-ceo-to-lead-institutional-sales-1059\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">the company<\/span><\/a><span data-v-f87c67ca=\"\"> to build out a full-scale prime broker. Kellner ultimately did not join.<\/span>","The firm hasn't had an institutional coverage head since Dan Romero left the company in April 2019, but various team leaders have been focused on shipping institutional-aimed features and new products. Over the years, the firm has rolled out margin trading for professional clients and has seen its custody business grow above $8 billion.","<span data-v-f87c67ca=\"\">Yet, Coinbase might have been too early to the institutional market. At the end of 2018, a few big hedge funds were involved and bitcoin’s price was lingering in the $3,000 range. At the same time, major initiatives such as Fidelity Digital Assets and Facebook’s Libra project were still in their infancy.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I am amazed at actually how much development has happened,” Tejpaul said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As for what market observers should expect in the near term, Tejpaul said nothing has been taken off of the proverbial list.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“This isn’t about trading one thing,” he said. “It is a platform that can make up a collection of products and services.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$3,000","content":"MONEY"},{"type":"Barclays","content":"ORGANIZATION"},{"type":"Instinet","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Tejpaul","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"Fidelity Digital","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"Jonathan Kellner","content":"PERSON"},{"type":"Brett Tejpaul","content":"PERSON"},{"type":"USDC","content":"ORGANIZATION"},{"type":"May 2018","content":"DATE"},{"type":"Dan Romero","content":"PERSON"},{"type":"April 2019","content":"DATE"},{"type":"$8 billion","content":"MONEY"},{"type":"Barclays","content":"LOCATION"}],"hashtag":["COINBASE"],"authors":["Frank Chaparro","The Block"]}