{"summary":"Binance Labs, the $9 billion venture arm of the crypto exchange giant, announced that it’s committing $15 million to Xterio, a web3 gaming startup.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239333\/binance-labs-commits-15-million-to-buzzy-f2p-startup","publishDate":"2023-07-12T21:51:09","id":4504,"type":null,"title":"Binance Labs commits $15 million to buzzy F2P startup","category":["DEALS"],"content":["Binance Labs, <a href=\"https:\/\/www.theblock.co\/post\/228565\/binance-labs-yibo-ling-investments\" data-v-f87c67ca=\"\">the $9 billion venture arm<\/a> of the crypto exchange giant, said it is committing $15 million to Xterio, a web3 gaming startup.","Switzerland-based Xterio is focused on free-to-play and blockchain-based gaming. It plans to use the cash injection to continue developing its forthcoming games, as well as for the integration of AI capabilities — such as interactive experiences — and new token launches.","No valuation was disclosed. Asked what timeframe the money would be invested over, a Binance spokesperson said the round is complete, without adding further details.","“The Xterio ecosystem is expanding faster than ever and bridges free-to-play genres with on-chain gaming enhanced by AI capabilities,” said Yi He, Binance’s co-founder and head of Binance Labs.","“The Xterio core team brings together experienced Web2 professionals with Web3 expertise, we look forward to closely working with them to allow gamers around the world to experience rich on-chain gameplay.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Binance","content":"LOCATION"},{"type":"Switzerland","content":"LOCATION"},{"type":"$15 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$9 billion","content":"MONEY"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}