{"summary":"Such a large jump will likely squeeze operating margins for some miners amid an already difficult market environment.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175345\/bitcoin-miners-face-a-big-difficulty-jump-next-week-heres-whats-in-store","publishDate":"2022-10-06T19:59:30","id":4505,"type":null,"title":"Bitcoin miners face a big difficulty jump next week — here’s what’s in store","category":["COMPANIES"],"content":["The next bitcoin mining difficulty update — likely to occur Monday — could be the biggest increase in over a year.","Mining pool Braiins, for instance, currently estimates that it <a href=\"https:\/\/insights.braiins.com\/en\/#advanced_bitcoin_mining_data\" data-v-f87c67ca=\"\">will be around 12.5%<\/a>, while Bitrawr places it <a href=\"https:\/\/www.bitrawr.com\/difficulty-estimator\" data-v-f87c67ca=\"\">between 11.3% and 12.5%<\/a> and <a href=\"https:\/\/data.hashrateindex.com\/network-data\/btc\" data-v-f87c67ca=\"\">Luxor at 12.6%<\/a>. <a href=\"https:\/\/btc.com\/stats\/diff\" data-v-f87c67ca=\"\">BTC.com<\/a> has a more conservative estimate of just under 9%. While numbers can still change, they all indicate a large uptick in difficulty.&nbsp;","In the past week alone, bitcoin's hash rate has grown by over 11%, currently standing close to 250 exahashes per second (EH\/s) according to data from The Block Research.","\"There are several factors contributing to the jump in difficulty we expect to see in the coming days,\" said Kevin Zhang, senior vice president at Foundry, which runs of the biggest bitcoin mining pools. \"It’s a combination of infrastructure coming online, meaning more capacity being built out, heatwaves dissipating which is resulting in better uptime and less curtailment across mining facilities, and more efficient latest generation mining equipment being deployed.\"","Miners have been racing to scale operations in North America in the past year, following China's move to ban the industry, but have seen delays due to supply chain issues and power constraints, according to Ethan Vera, COO of bitcoin infrastructure company Luxor Technologies, which runs a mining pool.","\"As we head into Q4 of 2022, finally this is beginning to roll out in size, paving the way for machines to get plugged in and network hash rate to grow,\" he said.","At the same time, many older-generation models have been coming offline<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>around the world as it becomes less profitable to mine with them, according to Marathon CEO Fred Thiel.","\"Now that you have those machines being replaced by (Antminer) S19j Pros, you have a 3 or 4X bump in hash rate on a per machine basis for the same electricity,\" Thiel said. In other words, for the same amount of electricity used, newer models will have a much higher hash rate and mine more bitcoin.","Bitcoin's mining difficulty <a href=\"https:\/\/www.theblock.co\/post\/166757\/bitcoin-mining-difficulty-jumps-9-26-in-the-largest-increase-since-january\" data-v-f87c67ca=\"\">jumped 9.26% at the end of August<\/a> as high-heat weather began to subside and the Antminer S19 XP hit the market. The difficulty fell significantly earlier in the summer, with bitcoin miners, particularly in Texas, <a href=\"https:\/\/www.theblock.co\/post\/156974\/as-texas-grid-operator-calls-for-energy-conservation-some-bitcoin-miners-paused-operations\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">turning off their machines<\/a> in response to peak power demand due to the extreme heat.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoins-hash-rate-daily\/embed\" title=\"Bitcoin's Hash Rate (EH\/s, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Mining difficulty refers to the complexity of the computational process behind mining and it adjusts roughly every two weeks (or every 2,016 blocks) in sync with the network's hash rate.","The upcoming update will likely have an impact on already declining profits, as the industry struggles with the fall of the bitcoin's value and rising energy prices.","\"This will squeeze miners even further, putting pressure on some of the bottom tier operators to close down and also making raising capital in the space increasingly more difficult,\" Vera said.","However, miners that can keep up with the global hash rate growth by deploying new-generation machines might not see as much of an impact, according to Thiel.","\"We're growing our overall scale at a much faster rate than the global hash rate is growing. So it's going to increase our profits,\" Thiel said. \"For the miners who aren't growing at the same rate that the global hash rate is growing, it'll decrease their profits.\"","A significant portion of the hash rate growth this past week came from Marathon, which <a href=\"https:\/\/www.theblock.co\/post\/175291\/bitcoin-miner-marathons-investments-in-bankrupt-compute-north-totaled-31-3-million\" data-v-f87c67ca=\"\">energized 19,000 miners between Sept. 30 and Oct. 5<\/a>, increasing its own hash rate by roughly 1.9 Eh\/s — over 10% of the hash rate growth to the overall network.","\"As we start deploying XPs over the next months that's 30% more efficient than the S19 Pros. So essentially global difficulty could grow 30% and you'd be net zero change,\" said Thiel.","A difficulty increase of around 12% could result in a 20% drop in profitability based on one example presented by Daniel Frumkin, director of research at mining firm Braiins, which runs a bitcoin mining pool. According to the example, profit per day for an S19j Pro running at $0.05\/kWh with the current difficulty would be $4.65 — and drop to $3.75 with a 12% increase.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Oct. 5","content":"DATE"},{"type":"Ethan Vera","content":"PERSON"},{"type":"Marathon","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"$4.65","content":"MONEY"},{"type":"$3.75","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"9.26%","content":"PERCENT"},{"type":"12%","content":"PERCENT"},{"type":"12.5%","content":"PERCENT"},{"type":"Thiel","content":"ORGANIZATION"},{"type":"Foundry","content":"ORGANIZATION"},{"type":"Vera","content":"PERSON"},{"type":"30%","content":"PERCENT"},{"type":"$0.05\/kWh","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"Sept. 30","content":"DATE"},{"type":"Luxor Technologies","content":"ORGANIZATION"},{"type":"Luxor","content":"LOCATION"},{"type":"Daniel Frumkin","content":"PERSON"},{"type":"August","content":"DATE"},{"type":"9%","content":"PERCENT"},{"type":"North America","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"Braiins","content":"PERSON"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Fred Thiel","content":"PERSON"},{"type":"11%","content":"PERCENT"},{"type":"12.6%","content":"PERCENT"},{"type":"past week","content":"DATE"},{"type":"Texas","content":"LOCATION"},{"type":"11.3%","content":"PERCENT"},{"type":"Kevin Zhang","content":"PERSON"},{"type":"\" Thiel","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}