{"summary":"The developers of a pNetwork carried out a &#x27;white hat&#x27; attack and drained $4.3 million in pegged gala tokens from PancakeSwap exchange.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/182969\/developers-of-pnetwork-bridge-drain-4-3-million-from-pancakeswap-in-white-hat-attack","publishDate":"2022-11-04T07:48:22","id":4512,"type":null,"title":"Developers of pNetwork bridge drain $4.3 million from PancakeSwap in &#x27;white hat&#x27; attack","category":["HACKS"],"content":["<span data-v-f87c67ca=\"\">The developers of pNetwork, an independent cross-chain bridge protocol used to transfer assets across different chains, ethically took $4.3 million in pGALA (pegged gala) tokens that it had issued to bridge users.<\/span>","<span data-v-f87c67ca=\"\">The \"white hat\" exploit was executed today as the team <\/span><a href=\"https:\/\/twitter.com\/pNetworkDeFi\/status\/1588266897061031936\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\"> it had discovered a “misconfiguration” in the token’s smart contract, according to on-chain analysis by security firm BlockSec, which informed The Block. The developers of pNetwork attempted to front-run any malicious hackers by “draining” pGala tokens locked in PancakeSwap pools. These tokens, issued by pNetwork itself, represent a 1:1 tokenized version of the gala tokens used in play-to-earn project Gala Games.<\/span>","<span data-v-f87c67ca=\"\">The tokens are issued whenever users bridge gala tokens from its original chain, Ethereum, to BNB Chain via pNetwork bridge. <\/span><span data-v-f87c67ca=\"\">Anyone can use pNetwork to lock their assets, including gala tokens, as collateral in the bridge contract and mint tokenized gala, also known as pGala.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The pGala tokens are maintained via smart contracts controlled by the pNetwork team, and can be traded on decentralized exchanges on BNB Chain, including PancakeSwap. Today, the team said that it had discovered a misconfiguration that could allow anyone to steal from the pgala smart contract. Because of this, the contract had to be urgently patched and redeployed. “A misconfiguration of the pNetwork bridge necessitated the redeployment of pGala,” pNetwork<\/span><a href=\"https:\/\/twitter.com\/pNetworkDeFi\/status\/1588266897061031936\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">It added that it had to drain the token in liquidity pools, performing the white hat attack to protect the value of gala tokens locked in the bridge contract before it could redeploy the token contract. To drain pGala liquidity on PancakeSwap, the pNetwork developers minted billions of pGala tokens out of thin air and swapped them to BNB tokens. The team was able to mint these tokens because it had the privileged access from the contract.<\/span>","<span data-v-f87c67ca=\"\">BlockSec said: “Our investigation shows that pNetwork had a privileged address and could mint the token. This address minted lots of tokens. As explained by pNetwork, the reason they minted and sold such a large number of pNetwork, is because they intentionally drained the pool to deploy a new pGala contract.”<\/span>","<span data-v-f87c67ca=\"\">On-chain <a href=\"https:\/\/twitter.com\/BeosinAlert\/status\/1588376895078694913\" data-v-f87c67ca=\"\">data<\/a> provided by security firm Beosin showed that an address, now believed to be pNetwork team,<\/span> <a href=\"https:\/\/bscscan.com\/tx\/0x4b239b0a92b8375ca293e0fde9386cbe6bbeb2f04bc23e7c80147308b9515c2e\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">minted<\/span><\/a><span data-v-f87c67ca=\"\"> 55 billion GALA tokens and swapped them for more than <a href=\"https:\/\/bscscan.com\/address\/0x6891a233bca9e72a078bcb71ba02ad482a44e8c1\" data-v-f87c67ca=\"\">12,976 BNB tokens<\/a> worth about $4.3 million across multiple transactions.<\/span>","<span data-v-f87c67ca=\"\">PNetwork <\/span><a href=\"https:\/\/twitter.com\/pNetworkDeFi\/status\/1588267590224338949\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">clarified<\/span><\/a><span data-v-f87c67ca=\"\"> that all gala tokens on Ethereum as well as the underlying bridge collateral were safe, adding that it plans to reimburse pGala and BNB to user addresses in proportion to their positions in the PancakeSwap pool, after taking a snapshot of their positions.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Gala Games <a href=\"https:\/\/twitter.com\/GoGalaGames\/status\/1588418604315574272\" data-v-f87c67ca=\"\">commented<\/a> on the incident, saying its token was “not hacked, breached, or exploited in any way,” and pointed users to pNetwork’s posts on the white hat activity. Still, the incident caused turbulence in the gala token market. The token traded down 13% on the day,<\/span> <a href=\"https:\/\/www.coingecko.com\/en\/coins\/gala\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">according<\/span><\/a><span data-v-f87c67ca=\"\"> to CoinGecko.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BNB","content":"ORGANIZATION"},{"type":"13%","content":"PERCENT"},{"type":"Beosin","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$4.3 million","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}