{"summary":"Mt. Gox has only recovered about 20% of lost funds, and creditors were likely early adopters and are unlikely to sell repayments, UBS analysts believe.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215752\/ubs-says-mt-gox-repayments-are-unlikely-to-destabilize-bitcoin-price","publishDate":"2023-02-28T11:04:21","id":4515,"type":null,"title":"UBS says Mt. Gox repayments are unlikely to destabilize bitcoin price","category":["MARKETS"],"content":["UBS strategists say impending Mt. Gox bankruptcy repayments might not be cause for concern for the price of bitcoin.","Crypto prices have been sluggish toward the end of February. Bitcoin was trading just below $23,500 by 10:30 a.m. EST, relatively flat, according to TradingView data. The cryptocurrency has traded in a narrow range over the past week, unable to cling to levels above $24,000.&nbsp;","<a href=\"https:\/\/www.tradingview.com\/symbols\/BTCUSD\/?exchange=COINBASE\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">BTCUSD chart by TradingView<\/span><\/a>","A significant moment for bitcoin price action could be the liquidation process of the defunct Japanese exchange Mt. Gox. Following a nearly decade-long process, creditors are about to recoup some of their funds, said Ivan Kachkovski, a strategist at UBS.","The current plan gives creditors several options on repayment methods and timing.","\"The most important ones are, first, whether to take an early lump sum payment or wait for further proceedings and additional asset recoveries and second, receiving funds in fiat or crypto,\" Kachkovski said. The deadline to select a repayment option is currently set for March 10, and payments could commence in September of this year.&nbsp;","Kachkovski notes the early lump sum option with fiat repayments would result in the exchange selling bitcoin to raise the requisite cash and could give authority to the \"long-held fear that Mt.Gox redemptions would hurt bitcoin's price,\" he added.&nbsp;","Crucially, it won't be over 700,000 bitcoin being disposed of since the exchange has only recovered about 142,000 bitcoin — as well as 143,000 bitcoin cash and 69 billion Japanese yen ($505,000), \"roughly 20% of the hack,\" according to Kachkovski.","He added that the amount of bitcoin available to the exchange represents 16% of the recent daily trading volume. While this might seem meager, it would amount to about \"90% of average supply active within the last day, 28% in the last week, and 10% of the last month,\" he pointed out. When active supply increases, bitcoin's price tends to fall, according to Glassnode and UBS data.&nbsp;","","","Due to most early adopters remaining crypto believers, most of this is unlikely to reach the market, Kachkovski added. Recent reports say two of the exchange's largest creditors, with 20% of claims, have opted for the crypto payout. While new supply could come to market, he noted that this at least implies it would be less concentrated.","\"It's certainly difficult to estimate the extent to which the market has been pricing massive sales coming from Mt.Gox. However, we think such news could have been an additional factor for—what we believe could be mainly retail-led — BTC's surprising resilience of late,\" Kachkovksi's note concluded.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"10:30 a.m. EST","content":"TIME"},{"type":"69 billion Japanese yen","content":"MONEY"},{"type":"TradingView","content":"ORGANIZATION"},{"type":"$505,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"$24,000","content":"MONEY"},{"type":"UBS","content":"ORGANIZATION"},{"type":"last day","content":"DATE"},{"type":"March 10","content":"DATE"},{"type":"28%","content":"PERCENT"},{"type":"Kachkovski","content":"PERSON"},{"type":"$23,500","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"16%","content":"PERCENT"},{"type":"Kachkovksi","content":"ORGANIZATION"},{"type":"Ivan Kachkovski","content":"PERSON"}],"hashtag":["ANALYST REPORTS","BITCOIN","COINBASE","EARNINGS","ECONOMIC INDICATORS","EQUITY MOVERS","ETHEREUM"],"authors":["Adam Morgan McCarthy","The Block"]}