{"summary":"Expectation of profit is not enough to deem tokens securities, Coinbase argued in court with the SEC on Wednesday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273253\/coinbase-takes-its-turn-in-court-arguing-the-tokens-it-listed-are-not-securities","publishDate":"2024-01-17T18:05:32","id":4516,"type":null,"title":"Coinbase takes its turn in court, arguing the tokens it listed are not securities","category":["LEGAL"],"content":["<span data-v-f87c67ca=\"\">New York District Judge Katherine Polk Failla probed Coinbase <a href=\"https:\/\/www.theblock.co\/post\/273221\/judge-grills-the-sec-with-pointed-questions-as-coinbase-hearing-begins\" data-v-f87c67ca=\"\">in court<\/a> on Wednesday about whether tokens listed on its exchange were securities<\/span>","<span data-v-f87c67ca=\"\">Coinbase was sued by the Securities and Exchange Commission in June for allegedly operating as an unregistered exchange, broker and clearing agency. Coinbase has pushed back on those claims, arguing for the case to be <\/span><a href=\"https:\/\/www.theblock.co\/post\/243128\/coinbase-plans-friday-filing-to-seek-dismissal-of-secs-case-in-its-entirety\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">dismissed<\/span><\/a><span data-v-f87c67ca=\"\"> and accusing the regulator of taking a \"regulation by enforcement approach.\"<\/span>","<span data-v-f87c67ca=\"\">Coinbase lawyer <\/span><span data-v-f87c67ca=\"\">William Savitt <\/span><span data-v-f87c67ca=\"\">delved into how securities are defined, marking what they say is a difference between \"investing in Beanie Baby Inc. and buying Beanie Babies.\"&nbsp;<\/span>","<span data-v-f87c67ca=\"\">From its June complaint, the SEC had said tokens including SOL, ADA, MATIC, FIL, SAND, AXS, CHZ, FLOW, ICP, NEAR, VGX, DASH and NEXO were securities.<\/span>","<span data-v-f87c67ca=\"\">Savitt noted that Coinbase does not claim blockchain tokens can never be deemed securities.<\/span>","<span data-v-f87c67ca=\"\">\"We don’t take the view that token transactions can never be investment contracts,\" he said, adding that, however, the SEC did not present any allegations in its lawsuit that would satisfy the investment contract definition.<\/span>","<span data-v-f87c67ca=\"\">He also stated that Coinbase agrees with the SEC that a formal contract signed by a buyer is not necessary to enter into an investment contract. But, again, just the fact that token buyers read the white papers and other information about token projects does not mean they are buying investment contracts, he said.<\/span>","<span data-v-f87c67ca=\"\">Savitt also pushed back on the SEC's thesis that selling tokens on Coinbase should be deemed investment contracts simply because the token projects might have made certain promises to buyers, and buyers purchased tokens hoping for a price increase.<\/span>","<span data-v-f87c67ca=\"\">\"There has to be a statement that is meant to convey an enforceable promise. That's the irreducible minimum of what can be conceived to be an investment contract,\" Savitt said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">What makes blockchain tokens really different from securities, is that whoever buys stocks, whether directly from an issuer or on the secondary market, gets all the rights such securities give to a holder, but that is not true for tokens, Savitt said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In a curious turn of the debate, the SEC and Coinbase attorneys clashed over why bitcoin definitely is not a security.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In the first part of the hearing, the SEC’s Patrick Costello mentioned the oldest cryptocurrency and noted that it's not a security because \"there is no ecosystem behind it,\" so people buying bitcoin do not invest in a common enterprise. Coinbase’s Savitt responded to this thesis in his closing statement, noting that bitcoin definitely has an ecosystem, like any other cryptocurrency.<\/span>","<span data-v-f87c67ca=\"\">Judge Failla asked Coinbase's lawyer whether New York District Judge Jed Rakoff's decision last month was wrong when that judge sided with the SEC that <a href=\"https:\/\/www.theblock.co\/post\/269579\/new-york-judge-grants-sec-summary-judgement-over-claim-that-terraform-sold-unregistered-securities\" data-v-f87c67ca=\"\">Terraform Labs<\/a> and its former CEO Do Kwon offered and sold unregistered securities.<\/span>","<span data-v-f87c67ca=\"\">Coinbase's lawyer said \"I don't know,\" but added that the exchange disagreed with some of Rakoff's analysis.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The lawyer said that \"we can live with its analysis\" because Rakoff's decision ultimately says that there has to be a contract or a contractual agreement.<\/span>","<span data-v-f87c67ca=\"\">Other judges have taken a direct stance in deciding whether cryptocurrencies in question are securities or not. Failla also asked Coinbase's lawyer about the infamous Ripple case.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In that case, New York District Court Judge Analisa Torres <\/span><a href=\"https:\/\/www.theblock.co\/post\/239559\/sec-faces-wake-up-call-after-ripple-ruling-though-appeal-likely\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">ruled<\/span><\/a><span data-v-f87c67ca=\"\"> in July that some of Ripple's sales, called programmatic, of XRP did not violate securities laws because of a blind bid process in place for them. She also ruled that other direct sales of the token to institutional investors were securities, leaving a partial win for the SEC.<\/span>","<span data-v-f87c67ca=\"\">Judge Failla, meanwhile, mentioned the major questions doctrine that Coinbase invoked, noting that it becomes a part of court decisions quite infrequently. She said she was \"afraid to do exactly\" what Coinbase is asking her to stop the SEC from doing – take more power than the law allows.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The doctrine says that if an agency wants to decide on an issue that has major national significance, it has to be supported by clear congressional authorization. Coinbase has argued that the doctrine would apply and the SEC is trying to encroach on the Congress’s mandate and make moves that \"would have a legislative effect.\"<\/span>","<span data-v-f87c67ca=\"\">Failla said that, since being on the bench for 10 years, no one has asked about the doctrine until this case.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"My read or my research into this area does not suggest that it comes up very often and even less often does it actually get found by a court,\" Failla said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Failla said she has a \"natural hesitation\" to implicate the doctrine because it is not frequently done.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Judge Faila ended the hearing late on Wednesday saying both parties had answered some of her questions, but she noted that she had more.<\/span>","<span data-v-f87c67ca=\"\">\"I can't decide this from the bench right now,\" Failla said.<\/span>","<span data-v-f87c67ca=\"\">If the judge denies Coinbase's ask to dismiss the case, which is likely, then it goes to discovery. At the end of discovery, both the SEC and Coinbase could bring a motion for summary judgment.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">If the judge isn't convinced, then it would proceed to trial and be presented to a jury, but that wouldn't likely happen until 2025.&nbsp;<\/span>","<b data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Correction:<\/i><\/b><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> Corrects text of Savitt testimony in the fifth paragraph.<\/span><\/i>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"FIL","content":"ORGANIZATION"},{"type":"William Savitt","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Beanie Baby Inc.","content":"ORGANIZATION"},{"type":"New York District Court","content":"ORGANIZATION"},{"type":"Faila","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"XRP","content":"ORGANIZATION"},{"type":"ICP","content":"LOCATION"},{"type":"Jed Rakoff","content":"PERSON"},{"type":"2025","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Katherine Polk Failla","content":"PERSON"},{"type":"Savitt","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Failla","content":"PERSON"},{"type":"Terraform Labs","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Patrick Costello","content":"PERSON"},{"type":"Rakoff","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Analisa Torres","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"ADA","content":"ORGANIZATION"}],"hashtag":["COINBASE","SEC"],"authors":["Sarah Wynn","Anna Baydakova","The Block"]}