{"summary":"Pontem, a startup which is largely focused on encouraging devs to build web3 apps, is launching an AI-powered chatbot.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274064\/ai-powered-chatbot-can-explain-crypto-update-users-about-spot-bitcoin-etfs-and-swaps","publishDate":"2024-01-23T12:01:30","id":4519,"type":null,"title":"AI-powered chatbot can explain crypto, update users about spot bitcoin ETFs and swaps","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Web3 product development startup Pontem is launching an AI-powered chatbot that will seek to help people better understand the world of crypto, including spot bitcoin ETFs.<\/span>","<span data-v-f87c67ca=\"\">\"<\/span><span data-v-f87c67ca=\"\">The basic ChatGPT model doesn’t know what happened in crypto after September 2021, so any AI crypto project requires a lot of additional training,\" said Pontem co-founder Alejo Pinto.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The new chatbot, which the company says will be compatible with MetaMask, X, Facebook, Gmail and major Aptos wallets, aims to provide people with effective and up-to-date information on several crypto-centric subjects like “how to swap, stake, bridge, buy NFTs, use yield farming,” plus insight into Aptos blockchain and Move programming language.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The startup — which already possesses a long list of crypto-focused investors like <\/span><span data-v-f87c67ca=\"\">Faction, Lightspeed Venture Partners, Pantera Capital, Aptos Foundation, Wintermute, Altonomy, Shima Capital and Kraken Ventures<\/span><span data-v-f87c67ca=\"\">&nbsp;— has been focused on encouraging <\/span><span data-v-f87c67ca=\"\">developers to build apps that are both Ethereum Virtual Machine and Move-compatible.<\/span>","<span data-v-f87c67ca=\"\"> Earlier this month, Pontem <\/span><a href=\"https:\/\/www.theblock.co\/post\/271967\/pontem-raises-6-million-to-enable-ethereum-move-compatible-apps\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">announced<\/span><\/a><span data-v-f87c67ca=\"\"> it had raised $6 million, bringing total funding to $10.5 million.<\/span>","<span data-v-f87c67ca=\"\">With the new chatbot, Pontem is attempting to position itself as a reliable resource for both those who recently became interested in crypto and traders committed to following the twists and turns of the sometimes volatile market.<\/span>","<span data-v-f87c67ca=\"\">\"<\/span><span data-v-f87c67ca=\"\">We’re using a mix of curated data that includes Pontem's own content, on-chain data, content by Aptos Foundation and top blockchain projects that cover Move, Ethereum DeFi, and more,\" said Pinto. <\/span>","<span data-v-f87c67ca=\"\">\"By continuously testing the model through feeding it new data loops, we feel we have created a valuable up-to-date resource for the industry,\" he also said.<\/span>","<span data-v-f87c67ca=\"\">While Pontem admits there are other available options for chatbots, the company's team believes its product offers a wider range of capabilities than its competitors while providing the data typically coveted by crypto traders, like speedy updates on breaking news, price changes and on-chain metrics.&nbsp;<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Disclaimer: Evgeny Gaevoy, the founder and CEO of Wintermute, previously sat on The Block's board of directors from April 2023 to early November 2023 and remains a minority shareholder.<\/span><\/i>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Wintermute","content":"LOCATION"},{"type":"April 2023","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Aptos Foundation","content":"ORGANIZATION"},{"type":"Ethereum DeFi","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"September 2021","content":"DATE"},{"type":"Pinto","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"Aptos","content":"LOCATION"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"Evgeny Gaevoy","content":"PERSON"},{"type":"Pontem","content":"ORGANIZATION"},{"type":"Altonomy","content":"LOCATION"},{"type":"Lightspeed Venture Partners","content":"ORGANIZATION"},{"type":"Alejo Pinto","content":"PERSON"},{"type":"Shima Capital","content":"ORGANIZATION"},{"type":"$10.5 million","content":"MONEY"},{"type":"$6 million","content":"MONEY"},{"type":"Kraken Ventures<\/span><span data-v-f87c67ca=\"\">&nbsp;—","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}