{"summary":"Patterson v. Budbo lawsuit included hotly disputed allegation that CEO had misappropriated over $1 million in ICO funds. Settlement agreement provided by defendants shows release of claims. As part of settlement, agreement says that “Budbo DAO” will be created.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/38007\/lawsuit-alleging-misappropriation-of-token-sale-funds-settles-with-release-of-claims-and-creation-of-budbo-dao","publishDate":"2019-08-29T18:00:40","id":4525,"type":null,"title":"Patterson v. Budbo lawsuit alleging misappropriation of token sale funds settles","category":["LEGAL"],"content":["<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.scribd.com\/document\/423669131\/Budbo-Settlement-Highlighted\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.scribd.com\/document\/423669131\/Budbo-Settlement-Highlighted\" data-v-f87c67ca=\"\">Copy of Settlement agreement<\/a>","People file lawsuits for lots of reasons. Sometimes they’ve been wronged, sometimes they think they have but it’s not actually true. From the outside, though, it’s usually hard to know the precise motives behind a lawsuit. People are complicated. Deals go bad, and fingers have to be pointed. Or deals go well, and people’s expectations about who gets how much money get kerfuffled. In any event, a half-decent lawsuit will make the other side sound bad but the allegations are just that — claims that remain unproven and that can be controverted by the other side.","Just as it’s really hard to understand motives behind a lawsuit, precisely predicting outcomes is hard unless you happen to have an oracle that can see the future. I like to think that I am pretty good at guessing what will happen next in a lawsuit but it’s as much an art as a science — litigation, like people, is mostly non-deterministic. But see how I hedged there? There are some things that are totally and absolutely predictable. Every lawsuit has a beginning and an end (also, they all cost money).","This extended rumination brings me to an update on a case that we covered earlier this year in CCM. That case is <em data-v-f87c67ca=\"\">Patterson, v. Budbo, Inc., et al.<\/em>, and our summary was covered on The Block on March 1, <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.theblockcrypto.com\/2019\/03\/01\/4-5m-token-sale-leads-to-1-76m-of-misappropriated-funds-allegedly-2\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.theblockcrypto.com\/2019\/03\/01\/4-5m-token-sale-leads-to-1-76m-of-misappropriated-funds-allegedly-2\/\" data-v-f87c67ca=\"\">here<\/a>. &nbsp;And as is true of all lawsuits, eventually, this is one is now over, via a settlement that we discuss below.","As we explained in the original summary, the case was a shareholder derivative lawsuit that arose out of a business relationship that went bad. The lawsuit ended up in CCM because it involved a blockchain\/utility token thing for the marijuana business (“<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Bud<\/strong><\/span> bo” — get it?).","One of the claims plaintiffs made was that Budbo’s CEO, Rick Burnett, diverted seven-figures of funds from a so-called utility token sale that raised $4.75 million. Burnett denied doing this and filed motion papers saying the same.","Settlement Agreements are usually private, kept between the parties and not publicly filed, so we don’t get to write about them in CCM. In this case, however, the defendants are eager to let the world know that the case settled and that the allegation about misappropriation of funds has been released.","I was contacted by Burnett’s litigation counsel who provided a copy of the settlement agreement, a copy of which you can read <a href=\"https:\/\/www.scribd.com\/document\/423669131\/Budbo-Settlement-Highlighted\" data-v-f87c67ca=\"\">here<\/a>. The highlights (including really big asterisks) are from the lawyer.","He also sent an explanatory email:","","","(The plaintiffs' lawyer, when contacted via email, said that he thought it would be best for his clients not to comment). &nbsp;","Anyhow ... congratulations to the litigants for working out their differences. That said, I read this and wondered a couple of things — First of all, what exactly is a Budbo DAO? What is the purpose of combining marijuana, blockchain and DAO software and what could possibly go wrong? Second, I’m also surprised that the parties are interested in publicizing the fact that they ran a multi-million dollar token sale, which the settlement agreement describes in detail on page 2, in Section 3. But they really, really, really wanted the world to know all about this. So now you do.","If the Weed DAO turns into litigation or anything else we will do our best to report on it here. For now, it appears that the parties have buried the hatchet and released any claim that Burnett transferred $1.76 million to himself for any improper purpose.&nbsp;","<a title=\"View Budbo Settlement Highlighted on Scribd\" href=\"https:\/\/www.scribd.com\/document\/423669131\/Budbo-Settlement-Highlighted#from_embed\" data-v-f87c67ca=\"\">Budbo Settlement Highlighted<\/a> by <a title=\"View Anonymous RXEhFb's profile on Scribd\" href=\"https:\/\/www.scribd.com\/user\/471975281\/Anonymous-RXEhFb#from_embed\" data-v-f87c67ca=\"\">Anonymous RXEhFb<\/a> on Scribd","<iframe class=\"scribd_iframe_embed\" title=\"Budbo Settlement Highlighted\" src=\"https:\/\/www.scribd.com\/embeds\/423669131\/content?start_page=1&amp;view_mode=scroll&amp;show_recommendations=true&amp;access_key=key-GuWWgvl2oGx4OQLOvHjo\" width=\"100%\" height=\"600\" frameborder=\"0\" scrolling=\"no\" data-auto-height=\"true\" data-aspect-ratio=\"0.7729220222793488\" data-mce-fragment=\"1\" data-v-f87c67ca=\"\"><\/iframe>","&nbsp;","<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"http:\/\/@nelsonmrosario\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. This is not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March 1","content":"DATE"},{"type":"$1.76 million","content":"MONEY"},{"type":"Rick Burnett","content":"PERSON"},{"type":"Burnett","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$4.75 million","content":"MONEY"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"Patterson","content":"LOCATION"},{"type":"CCM","content":"ORGANIZATION"},{"type":"v. Budbo, Inc.","content":"ORGANIZATION"},{"type":"Stephen Palley","content":"PERSON"}],"hashtag":[],"authors":["Stephen Palley","The Block"]}