{"summary":"If accepted, the proposal will see Frax buying back even more Frax Share tokens if the FXS price drops below certain levels.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235340\/frax-founder-supports-proposal-for-aggressive-fxs-token-buybacks","publishDate":"2023-06-19T05:43:35","id":4527,"type":null,"title":"Frax founder supports proposal for &#x27;aggressive&#x27; FXS token buybacks","category":["CRYPTO ECOSYSTEMS"],"content":["Frax Finance's founder Sam Kazemian expressed support for a proposal from Ouroboros Capital that pushes for a more aggressive token buyback strategy.","Frax Share (FXS) is known for its current buyback strategy, where the project buys and burns the same amount of FXS over a predetermined timeframe, irrespective of any price fluctuations. The project has a <a href=\"https:\/\/www.theblock.co\/post\/150847\/frax-co-founders-propose-spending-20-million-to-buyback-fxs-token?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">$20 million fund<\/a> for this purpose.","Ouroboros Capital, a cryptocurrency investment research firm, put forward a <a href=\"https:\/\/gov.frax.finance\/t\/optimizing-fip-77s-twamm-parameters\/2397\" data-v-f87c67ca=\"\">proposal<\/a> on June 16 calling for a proactive optimization of the current token buyback strategy.","The proposal suggested a time-weighted average price (TWAP) buyback worth $1 million to be initiated when the FXS price dips below $5. If the price further slides to below $4, an additional $1 million buyback, set for a 1-month duration, is proposed to be activated. The key premise here is to purchase more FXS tokens for subsequent burning, as the price falls further.","This comes as the price of FXS — currently at $5.30 — falls toward $5, <a href=\"https:\/\/www.coingecko.com\/en\/coins\/frax-share\" data-v-f87c67ca=\"\">according<\/a> to CoinGecko.","“I believe that the most judicious use of our revenue and capital is to buy and burn the FXS supply,\" Kazemian told The Block. \"Especially given the low valuations in a mature ecosystem due to macro market conditions and the state of the global economy, I can’t envisage a more effective use of capital.”","Kazemian expressed agreement with the general idea of accelerating the TWAP mechanism as the price drops to $4, $3 and $2, echoing Ouroboros Capital’s suggestion. “If the price continues to fall, we should buy back more tokens more aggressively,” he added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sam Kazemian","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Frax Finance","content":"ORGANIZATION"},{"type":"$5.30","content":"MONEY"},{"type":"$2","content":"MONEY"},{"type":"$5","content":"MONEY"},{"type":"$3","content":"MONEY"},{"type":"$4","content":"MONEY"},{"type":"$1 million","content":"MONEY"},{"type":"$20 million","content":"MONEY"},{"type":"FXS","content":"ORGANIZATION"},{"type":"June 16","content":"DATE"},{"type":"CoinGecko","content":"ORGANIZATION"}],"hashtag":["ASSETS"],"authors":["Vishal Chawla","The Block"]}