{"summary":"Amid disruptions making it impossible for Binance.US to deposit or withdraw dollars, the crypto exchange partners with MoonPay.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246832\/binance-us-taps-moonpay-to-help-customers-buy-crypto","publishDate":"2023-08-22T13:36:08","id":4529,"type":null,"title":"Binance.US taps MoonPay to help customers buy crypto","category":["COMPANIES"],"content":["To possibly circumvent disruptions that have made it impossible for American customers of Binance.US to deposit or withdraw dollars, the cryptocurrency exchange is partnering with MoonPay, the company said <a href=\"https:\/\/support.binance.us\/hc\/en-us\/articles\/16783463877655-MoonPay-FAQs\" data-v-f87c67ca=\"\">last week<\/a> on its website.&nbsp;","Binance.US customers who want to add to their account will now have the ability to exchange dollars for crypto by first buying&nbsp;Tether's USDT stablecoin, which can then be converted into other cryptocurrencies available on the platform, the statement said.","\"We’ve partnered with MoonPay to make buying and selling crypto fast and easy, all within the Binance.US mobile app,\" Binance.US said in a statement. Customers can use debit cards, credit cards, Google Pay and Apple Pay to buy USDT. \"USDT can then be used to instantly buy and sell 150+ different cryptocurrencies available on Binance.US,\" the company said.","\"MoonPay provides both on-and off-ramp services,\" a MoonPay representative told The Block. \"With respect to Binance.US users, we are providing a service for those users that want to convert their crypto to fiat and deposit into their US bank account. MoonPay performs rigorous KYC checks on all customers. We support many of our existing partners and exchanges with this functionality.\"","Binance.US customers have not been able to deposit or withdraw dollars for more than a month after banking partners <a href=\"https:\/\/www.theblock.co\/post\/233917\/binanceus-suspends-usd-deposits-says-bank-partners-will-pause-dollar-payments-next-week\" data-v-f87c67ca=\"\">cut ties<\/a> with the American arm of Binance's crypto trading empire. Binance is the biggest cryptocurrency exchange in the world.","Binance may soon also be cleaved apart from Binance.US, with a June 17 <a href=\"https:\/\/www.theblock.co\/post\/235266\/binance-to-lose-access-to-binance-uss-cryptocurrency-under-proposed-sec-deal\" data-v-f87c67ca=\"\">proposal<\/a> from the Securities and Exchange Commission aiming to stop Binance Holdings officials from accessing Binance.US cloud infrastructure. The proposal is still pending federal approval.","MoonPay did not immediately respond to a request for comment from The Block.&nbsp;","<em data-v-f87c67ca=\"\">Updated with a comment from a MoonPay representative.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USDT","content":"ORGANIZATION"},{"type":"last week","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"MoonPay","content":"PERSON"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"June 17","content":"DATE"},{"type":"Binance","content":"ORGANIZATION"},{"type":"Binance Holdings","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["BINANCE"],"authors":["RT Watson","MK Manoylov","The Block"]}