{"summary":"The Council of the European Union and the European Parliament representatives agreed that AMLA will be based in Frankfurt.\nAMLA will directly oversee the crypto sector, among other things.","author":["Adam James","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278758\/frankfurt-amla-crypto","publishDate":"2024-02-23T02:59:34","id":453,"type":null,"title":"Frankfurt chosen as home location for crypto-overseeing regulator AMLA","category":["Regulation"],"content":["<span data-v-f87c67ca=\"\">Representatives from the Council of the European Union and the European Parliament reached a consensus on the location for the headquarters of the new European authority for anti-money laundering and countering terrorist financing on Thursday, determining that AMLA, the organization, will be based in Frankfurt, Germany.<\/span>","<span data-v-f87c67ca=\"\">AMLA — which will oversee the crypto sector — is slated to have more than 400 staff members and begin operations in the middle of next year, according to<\/span> <a href=\"https:\/\/www.consilium.europa.eu\/en\/press\/press-releases\/2024\/02\/22\/frankfurt-to-host-the-eus-new-anti-money-laundering-authority-amla\/#:~:text=AMLA%20will%20be%20based%20in,to%20impose%20sanctions%20and%20measures.\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">a press release<\/span><\/a><span data-v-f87c67ca=\"\"> published yesterday that labels the organization \"the centerpiece of the reform of the EU's anti-money laundering framework.\"<\/span>","<span data-v-f87c67ca=\"\">However, Mairead McGuinness, European Commissioner for Financial Stability, Financial Services and Capital Markets Union<\/span> <a href=\"https:\/\/www.coindesk.com\/policy\/2024\/02\/22\/frankfurt-to-host-new-eu-money-laundering-watchdog-tasked-with-monitoring-crypto\/?utm_medium=social&amp;utm_source=twitter&amp;utm_campaign=coindesk_main&amp;utm_term=organic&amp;utm_content=editorial\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\"> in a press conference that the authority is \"ready to go\" with its work as early as Friday morning.<\/span>","<span data-v-f87c67ca=\"\">\"We're mitigating risks linked to large sums of money with an EU-wide limit of 10,000 euros for cash payments,\" McGuinness explained, adding: \"At the same time, we're addressing risks posed by crypto and the anonymity it enables.\"<\/span>","<span data-v-f87c67ca=\"\">The selection of AMLA’s base location follows last year’s revision of the EU’s “transfer of funds rules” to allow for crypto-transaction tracing. The bloc also recently passed its high-profile<\/span> <a href=\"https:\/\/www.theblock.co\/post\/238100\/afme-defi-mica-exclusion\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Markets in Crypto Assets (MiCA) framework<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>"],"hashtag":["EUROPEAN COUNCIL","EUROPEAN PARLIAMENT"]}