{"summary":"Cboe’s chief financial officer said on the earnings call that &quot;we believe that our adjustment reflects the reality of the digital asset market environment today, but in no way changes our commitment to the digital asset space.&quot; ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/160602\/cboe-reports-460-million-write-down-on-erisx-acquisition","publishDate":"2022-08-01T11:56:31","id":4533,"type":null,"title":"Cboe reports $460 million write-down on ErisX acquisition","category":["CAPITAL MARKETS"],"content":["During its second-quarter earnings call on Friday, exchange operator Cboe reported a $460 million write-down on its recent purchase of ErisX, a crypto asset exchange acquired by the firm in May to help lead its reentry into the digital asset spot and derivatives markets.","A write-down is an accounting mechanism used by corporations to adjust the book value of an asset in order to reduce its tax burden.","<span data-v-f87c67ca=\"\">On the results call, Cboe Global Markets chief executive Ed Tilly said since the closing of the ErisX transaction, the digital asset market environment had changed dramatically, which had led to the accounting adjustment.<\/span>","<span data-v-f87c67ca=\"\">Brian Schell, Cboe’s chief financial officer, said on the call that \"we believe that our adjustment reflects the reality of the digital asset market environment today, but in no way changes our commitment to the digital asset space.\"&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The firm's <\/span><a href=\"https:\/\/www.theblock.co\/post\/121465\/cboe-acquires-erisx-crypto-spot-derivatives-exchange\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">plans to acquire ErisX<\/span><\/a><span data-v-f87c67ca=\"\"> were announced on October 20, when the price of bitcoin was trading around $67,000. Since that time prices have dropped significantly, with the price of bitcoin currently hovering around $23,300.<\/span>","<span data-v-f87c67ca=\"\">Despite the mark-down, Cboe reported rising revenue from options trading, futures trading, global foreign exchange trading, and North American and European equities.<\/span>","<span data-v-f87c67ca=\"\">The increase came from investors readjusting their portfolios to hedge against the recent economic downturn, which drove transaction volumes higher.<\/span>","<span data-v-f87c67ca=\"\">Cboe also reported profits below Wall Street expectations, with rising compensation listed as a key factor in the missed targets.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$460 million","content":"MONEY"},{"type":"$23,300","content":"MONEY"},{"type":"Cboe","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Cboe Global Markets","content":"ORGANIZATION"},{"type":"Brian Schell","content":"PERSON"},{"type":"October 20","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Tilly","content":"PERSON"},{"type":"$67,000","content":"MONEY"}],"hashtag":[],"authors":["Sam Venis","The Block"]}