{"summary":"In what could be one of the most visible partnerships with the thus-far beleaguered Brave browser, Cheddar is now using it to offer users three months of","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/9239\/video-site-cheddar-partners-with-brave-to-unlock-premium-content","publishDate":"2019-01-29T06:45:35","id":4535,"type":null,"title":"Media company Cheddar partners with Brave to unlock premium content for free","category":["STARTUPS"],"content":["In what could be one of the most visible partnerships with the thus-far beleaguered <a href=\"https:\/\/www.theblockcrypto.com\/tag\/brave\" data-v-f87c67ca=\"\">Brave<\/a> browser, <a href=\"http:\/\/cheddar.com\" data-v-f87c67ca=\"\">Cheddar<\/a> is now using it to offer users three months of free access to premium content. The companies state that the partnership could fund hundreds of thousands of subscriptions out of Brave's 5.5 million monthly active users.","Brave, a browser that controls advertising using a tokenized display model, will let users view&nbsp;Cheddar Business and Cheddar News via the browser at Cheddar.com. Cheddar, which refers to itself as the leading post-cable news, media and entertainment company, will use this partnership to introduce users to their premium products.&nbsp;To take advantage of this offer, new users can head to <u data-v-f87c67ca=\"\"><a href=\"https:\/\/brave.com\/download\/\" data-v-f87c67ca=\"\">Brave.com\/<\/a><a href=\"https:\/\/brave.com\/download\/\" data-v-f87c67ca=\"\">download<\/a><\/u> to download the browser and then head to Cheddar.com.","\"The Brave browser will automatically be recognized and the live Cheddar feeds will be unlocked,\" wrote the Cheddar team.","“Cheddar viewers are obsessed with crypto; we even have a show dedicated to it - The Crypto Craze. The idea of unlocking our premium feeds for Brave users via crypto funding, with no sign-up, seemed like a natural way to engage a passionate community that will no doubt enjoy our content,” said Cheddar CEO Jon Steinberg.","Cheddar is also a publisher on Brave's BAT platform which allows users to submit tips or contributions to the site automatically.","\"I heard about Brave a few months ago,\" said Steinberg. \"They sit at the intersection of crypto and content and I wanted us to be involved. It seems like a unique model that sits beyond advertising and subscription, and I want us to experiment.\"","Steinberg said he is not considering any other crypto partnerships. When asked why Cheddar didn't build its own crypto-based solution,&nbsp;Steinberg laughed.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Jon Steinberg","content":"PERSON"},{"type":"Steinberg","content":"PERSON"}],"hashtag":[],"authors":["John Biggs","The Block"]}