{"summary":"Several attendees of Yuga Labs’ ApeFest reported eye problems, raising questions about the NFT event’s safety and lighting used.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/261638\/eye-related-issues-affected-attendees-at-yuga-labs-apefest-nft-event","publishDate":"2023-11-06T06:26:40","id":4537,"type":null,"title":"Eye-related issues affected attendees at Yuga Labs&#x27; ApeFest NFT event","category":["COMPANIES"],"content":["<a href=\"https:\/\/apefest.com\/\" data-v-f87c67ca=\"\">ApeFest<\/a>, an event hosted by Yuga Labs, the creator of Bored Ape Yacht Club and Mutant Ape Yacht Club, in Hong Kong over the weekend, left several visitors with eye problems.&nbsp;","Following the event, numerous participants reported instances of \"eye burn\" on X, attributed to the intense light show at a party.&nbsp;","Among those affected was crypto trader Adrian Zduńczyk, who <a href=\"https:\/\/x.com\/crypto_birb\/status\/1721377042392814059?s=20\" data-v-f87c67ca=\"\">shared<\/a> his diagnosis of photokeratitis, a condition resulting from excessive exposure to ultraviolet light. Zduńczyk thanked the event organizers for an incredible event but <a href=\"https:\/\/x.com\/crypto_birb\/status\/1721222853394121193?s=20\" data-v-f87c67ca=\"\">posted<\/a> yesterday, “Still, as dozens of others, I’ve almost lost sight this night,” urging attendees with similar symptoms to seek medical help and Yuga Labs to put out an official statement with recommendations for those affected.","“You’ve likely most literally got your eyes burnt with UV like I did,” Zduńczyk added. “Without proper treatment, it may cause long lasting vision impairment and other serious damage.” Zduńczyk suggested the symptoms were similar to those experienced by partygoers at another event in Hong Kong in 2017 — attributed to the <a href=\"https:\/\/hongkongfp.com\/2017\/10\/26\/partygoers-left-burns-light-sensitivity-hypebeast-event-landmark\/\" data-v-f87c67ca=\"\">wrong type of bulbs being installed<\/a>.","Zduńczyk was diagnosed with “photokeratitis over both eyes, accident related.” Fortunately, Zduńczyk said he was left with no serious cornea damage but was prescribed steroid eye drops and eye lubricants.","BAYC member “FELD” <a href=\"https:\/\/x.com\/Feld4014\/status\/1721074476870508608?s=20\" data-v-f87c67ca=\"\">posted,<\/a>&nbsp;“Anyone else’s eyes burning from last night? Woke up at 3 a.m. with extreme pain and ended up in the ER.”","“I woke up at 4 a.m. and couldn’t see anymore. Had so much pain and my whole skin is burned. Needed to go to the hospital. The doctor told me the UV of the lightning of the stage did it. It has the same effect as sunlight. Still can not see normally,” fellow community member “Crypto June” <a href=\"https:\/\/x.com\/CryptoJune777\/status\/1721086215582101561?s=20\" data-v-f87c67ca=\"\">replied<\/a>, echoing the symptoms of many others.","“We are aware of the situation and are taking it seriously,” a Yuga Labs spokesperson told The Block. “We are actively reaching out to and are in touch with those affected.\"","\"We’re also pursuing multiple lines of inquiry to learn the root cause. Based on our estimates, the 15 people we’ve been in direct communication with so far represent less than one percent of the approximately 2,250 event attendees and staff at our Saturday night event,\" the spokesperson added.","ApeFest was open to BAYC and MAYC holders and guests with valid tickets on the tokenproof app.","Beyond the light show safety concerns, the community also criticized logistics at the event. “Yuga makes me nervous,” BAYC member “Whew” <a href=\"https:\/\/x.com\/andwhew\/status\/1721186746413482283?s=20\" data-v-f87c67ca=\"\">posted<\/a> on X. “They're fumbling things that should be really easy. Imagine if you flew across the globe for Ape Fest. Then were expected to get up early and take hours of your precious vacation time to wait in line for merch, only to find out your size is sold out? Most people buying a $60K-$500K collectible are not the type of guys who want to stand in merch lines.”","Yuga Labs is currently navigating through the tumultuous waves of the NFT market, which has seen a significant downturn from its zenith during the pandemic. The floor price of the BAYC collection has fallen 65% this year to 24.4 ETH ($46,000), according to The Block’s data dashboard. MAYC NFTs' floor price fell around 70% during the same period to 4.75 ETH ($9,000).","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/art-collectibles\/floor-price-of-art-and-collectibles-nfts\/embed\" title=\"Floor Price of Popular NFTs\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","On Saturday, Yuga Labs <a href=\"https:\/\/www.theblock.co\/post\/261542\/magic-eden-yuga-labs-launching-ethereum-nft-marketplace-to-enforce-royalties\" data-v-f87c67ca=\"\">announced<\/a> a partnership with Magin Eden to launch a marketplace for Ethereum NFTs, contractually obligated to enforce creator royalties.","Last month, Yuga Labs CEO Daniel Alegre said the team would now focus on developing its metaverse extension, <a href=\"https:\/\/www.theblock.co\/post\/258048\/yuga-labs-otherside-focus-restructuring\" data-v-f87c67ca=\"\">Otherside<\/a>, after completing its restructuring.","<em data-v-f87c67ca=\"\">Updated with specific numbers affected from Yuga Labs.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"70%","content":"PERCENT"},{"type":"Daniel Alegre","content":"PERSON"},{"type":"2017","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Yuga Labs","content":"ORGANIZATION"},{"type":"$46,000","content":"MONEY"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"$500K","content":"MONEY"},{"type":"Zduńczyk","content":"PERSON"},{"type":"this night","content":"TIME"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Adrian Zduńczyk","content":"PERSON"},{"type":"3 a.m.","content":"TIME"},{"type":"one percent","content":"PERCENT"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Saturday","content":"DATE"},{"type":"last night","content":"TIME"},{"type":"4 a.m.","content":"TIME"},{"type":"2023","content":"DATE"},{"type":"65%","content":"PERCENT"},{"type":"Mutant Ape Yacht Club","content":"ORGANIZATION"},{"type":"night","content":"TIME"},{"type":"$9,000","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"$60K","content":"MONEY"},{"type":"Magin Eden","content":"PERSON"}],"hashtag":["BAYC","MAYC","YUGA LABS"],"authors":["James Hunt","The Block"]}