{"summary":"Telegram has sold $50 million usernames on The Open Network as the messaging app giant says it aims to capitalize on blockchain tools.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/191054\/telegram-sells-usernames-worth-50-million-on-the-open-network-blockchain","publishDate":"2022-11-30T13:53:31","id":4539,"type":null,"title":"Telegram sells usernames worth $50 million on the Open Network blockchain","category":["LAYER 1S"],"content":["<span data-v-f87c67ca=\"\">In slightly less than one month, Telegram has sold $50 million usernames on The Open Network, a blockchain that the company developed, Telegram founder and CEO Pavel Durov claimed.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Last month, Telegram in October gave users the ability to buy usernames for its app via a blockchain-based platform called Fragment. The platform lets interested parties buy available usernames and secure ownership on its \"The Open Network\" blockchain, known as TON.<\/span>","<span data-v-f87c67ca=\"\">When buying a name, users pay with the TON cryptocurrency, the native asset of the network. In the last four weeks, Fragment sales surpassed $50 million, Durov<\/span><a href=\"https:\/\/t.me\/durov\/202\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\"> in a Telegram message.&nbsp;<\/span><span data-v-f87c67ca=\"\">Some individual Telegram usernames have brought in large sums of money on Fragment. For example, the username @news was auctioned for 994,000 TON, about $1.7 million, per data from the <a href=\"https:\/\/fragment.com\/?filter=sold\" data-v-f87c67ca=\"\">official website<\/a>.<\/span>","<span data-v-f87c67ca=\"\">Durov said that in future Fragment will expand beyond usernames and build a host of blockchain tools for Telegram including crypto wallets and decentralized exchanges. Such services may be accessed from within the Telegram app, Durov suggested.<\/span>","<span data-v-f87c67ca=\"\">“Telegram's next step is to build a set of decentralized tools, including non-custodial wallets and decentralized exchanges for millions of people to securely trade and store cryptocurrencies,” Durov said.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Durov","content":"PERSON"},{"type":"Telegram","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Pavel Durov","content":"PERSON"},{"type":"$1.7 million","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"last four weeks","content":"DATE"},{"type":"Durov","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}