{"summary":"The SEC investigation may have surprised Coinbase, particularly the fact that it might extend beyond its staking service into whether or not any of the assets it lists qualify as securities.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/222311\/coinbase-could-see-revenue-hit-if-sec-forces-coin-asset-delistings","publishDate":"2023-03-23T13:21:12","id":4540,"type":null,"title":"Coinbase could see revenue hit if SEC forces asset delistings, analysts say","category":["EXCHANGES"],"content":["Coinbase's revenue could take a hit if the U.S. Securities and Exchange Commission forces the company to delist assets the regulator considers securities, analysts said.","The company said on Wednesday it had received a Wells notice from the SEC that could signal an enforcement action down the road. And while a Wells notice does not necessarily imply a conclusion or foregone action, <span class=\"TextRun SCXW10821924 BCX0\" lang=\"EN-GB\" xml:lang=\"EN-GB\" data-contrast=\"auto\" data-v-f87c67ca=\"\"><span class=\"NormalTextRun SCXW10821924 BCX0\" data-v-f87c67ca=\"\">Needham analysts led by John Todaro said <\/span><\/span>some of the information about the investigation may have surprised the company, particularly that fact that it might extend beyond its staking service into whether or not any of the assets it lists qualify as securities.&nbsp;","Coinbase shares plunged after the news and are down around 14%.","The Wells notice to Coinbase is the latest move by regulators to crack down on the crypto industry. In February, rival exchange Kraken settled a case with the SEC over charges related to its <a href=\"https:\/\/www.theblock.co\/post\/210332\/kraken-settles-sec-charges-over-its-staking-program\" data-v-f87c67ca=\"\">staking-as-a-service<\/a> program, leading it to shut down those operations in the U.S. and pay a $30 million fine. Coinbase has publicly asserted that its own staking activity does not fall afoul of U.S. securities law. Also on Wednesday, the SEC charged crypto entrepreneur Justin Sun, actress Lindsay Lohan and media personality Jake Paul, among others, for the unregistered offer and sale of two “crypto asset securities.\"&nbsp;","<span data-v-f87c67ca=\"\">COIN chart by TradingView<\/span>","The exchange's business model revolves around offering a \"multitude of tradable pairs,\" the Needham analysts said. If the exchange is forced to delist assets, it could lead to \"materially lower revenue,\" they added, pointing out that about 40% of the company's trading volume comes from bitcoin, while ether accounts for 15%.&nbsp;","Needham suspects the Wells notice may be targeting altcoins that the SEC could consider to be securities.&nbsp;","<span class=\"TextRun SCXW82464422 BCX0\" lang=\"EN-GB\" xml:lang=\"EN-GB\" data-contrast=\"auto\" data-v-f87c67ca=\"\"><span class=\"NormalTextRun SCXW82464422 BCX0\" data-v-f87c67ca=\"\">KBW analysts led by Kyle Voigt also said Coinbase revenue could take a hit if it's forced to delist any coins and noted that trading revenues typically yield much higher margins for the company.<\/span><\/span>","<span class=\"TextRun SCXW82464422 BCX0\" lang=\"EN-GB\" xml:lang=\"EN-GB\" data-contrast=\"auto\" data-v-f87c67ca=\"\"><span class=\"NormalTextRun SCXW82464422 BCX0\" data-v-f87c67ca=\"\">\"We've previously estimated that 11% of Coinbase-listed digital assets volumes are at a high risk of securities designation, with another 45% of volumes being at medium risk,\" they wrote.<\/span><\/span>","While the SEC settlement with Kraken last month targeted its staking product, a similar action against Coinbase's staking services would not have as big of an impact.","<span class=\"TextRun SCXW82464422 BCX0\" lang=\"EN-GB\" xml:lang=\"EN-GB\" data-contrast=\"auto\" data-v-f87c67ca=\"\"><span class=\"NormalTextRun SCXW82464422 BCX0\" data-v-f87c67ca=\"\">\"The potential elimination of staking revenues would not have a dramatic impact on the bottom line, given that only a fraction of the revenues stay with the company as rewards are paid back to the clients,\" the KBW analysts said.<\/span><\/span>","<span class=\"TextRun SCXW82464422 BCX0\" lang=\"EN-GB\" xml:lang=\"EN-GB\" data-contrast=\"auto\" data-v-f87c67ca=\"\"><span class=\"NormalTextRun SCXW82464422 BCX0\" data-v-f87c67ca=\"\">Staking revenues account for between 3% to 4% of gross profit, based on the investment bank's 2023 and 2024 estimates.<\/span><\/span>","\"While we understand that this is all part of the journey to reforming our financial system, we are right on the law, confident in the facts, and welcome the opportunity for Coinbase (and by extension the broader crypto community) to get before a court,” Coinbase CEO Brian Armstrong said on Twitter yesterday. \"The legal process will provide an open and public forum before an unbiased body where we will be able to make clear for all to see that the SEC simply has not been fair, reasonable, or even demonstrated a seriousness of purpose when it comes to its engagement on digital assets.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"TradingView","content":"ORGANIZATION"},{"type":"Lindsay Lohan","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Kyle Voigt","content":"PERSON"},{"type":"4%","content":"PERCENT"},{"type":"Coinbase","content":"PERSON"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"Needham","content":"ORGANIZATION"},{"type":"KBW","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"3%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Justin Sun","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"45%","content":"PERCENT"},{"type":"11%","content":"PERCENT"},{"type":"$30 million","content":"MONEY"},{"type":"John Todaro","content":"PERSON"},{"type":"Jake Paul","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"14%","content":"PERCENT"}],"hashtag":["ANALYST REPORTS","BRIAN ARMSTRONG","CRYPTO MOVERS","EARNINGS","ECONOMIC INDICATORS"],"authors":["Adam Morgan McCarthy","The Block"]}