{"summary":"Australian regulators are suing BPS Financial (BPS) for alleged misleading statements about its crypto asset Qoin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179615\/australian-regulators-sue-crypto-asset-company-that-claimed-it-was-regulated","publishDate":"2022-10-25T07:33:30","id":4541,"type":null,"title":"Australian regulators sue crypto asset company that claimed it was regulated","category":["REGULATION"],"content":["Australian regulators are suing BPS Financial (BPS) for alleged misleading statements about its crypto asset Qoin.","BPS made misleading representations and engaged in unlicensed conduct in relation to Qoin, a digital currency it launched in 2019 to facilitate payments for goods and services, the Australian Securities and Investments Commission (ASIC) <a href=\"https:\/\/asic.gov.au\/about-asic\/news-centre\/find-a-media-release\/2022-releases\/22-287mr-asic-sues-bps-financial-for-alleged-misleading-statements-about-crypto-asset-qoin\/?utm_source=miragenews&amp;utm_medium=miragenews&amp;utm_campaign=news\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">said<\/a> in a statement.","BPS’s website claims holders can use Qoin at almost 38,000 merchants. ASIC believes this isn’t true.","“We allege that, despite what BPS represented in its marketing, Qoin merchant numbers have been declining, and that there have been periods of time where it was not possible to exchange Qoin tokens through independent exchanges,” ASIC deputy chair Sarah Court said.","ASIC is also concerned that the company misrepresented its regulatory status.","\"We believe the more than 79,000 individuals and entities who have been issued with the Qoin Facility may have believed that it was compliant with financial services laws, when ASIC considers it was not,” Court said.","BPS is <a href=\"https:\/\/qoin.world\/important-update\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">reviewing<\/a> the allegations.","“BPS does not agree with ASIC’s position and, confident of its position, will be defending the matter. Before it started, BPS consulted with ASIC in late 2019 regarding the structure of the Qoin project and did so again in early 2021,” it said.","The date for the first case management hearing has not yet been scheduled.","Australian regulators have been paying more attention to crypto assets recently. Earlier this month, ASIC also <a href=\"https:\/\/www.theblock.co\/post\/177615\/australian-authority-temporarily-suspends-three-holon-investments-crypto-funds\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">suspended<\/a> the offering and distributing of three cryptocurrencies to retail investors on Holon Investments for 21 days. It said order was to protect retail investments from investing in “very risky and speculative” crypto assets.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2021","content":"DATE"},{"type":"” Court","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Australian Securities and Investments Commission (ASIC","content":"ORGANIZATION"},{"type":"Sarah Court","content":"PERSON"},{"type":"Holon Investments","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"ASIC","content":"ORGANIZATION"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}