{"summary":"Ethena’s USDe stablecoin has crossed the $2 billion supply mark less than two months after its public launch in February.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286640\/ethena-usde-stablecoin-crosses-2-billion-supply","publishDate":"2024-04-05T07:03:21","id":4543,"type":null,"title":"Ethena’s &#x27;synthetic dollar&#x27; crosses $2 billion supply within two months of public launch","category":["STABLECOINS"],"content":["Ethena’s USDe stablecoin, also known as an “internet bond” and a “synthetic dollar,” has exceeded the $2 billion supply threshold only seven weeks following its public introduction.","Ethena Labs <a href=\"https:\/\/x.com\/ethena_labs\/status\/1776094092751184292\" data-v-f87c67ca=\"\">confirmed<\/a> the market capitalization, positioning it as the fifth-largest stablecoin by market cap, now accounting for 1.25% of the entire $160 billion stablecoin market, as reported by The Block’s <a href=\"https:\/\/www.theblock.co\/data\/stablecoins\/usd-pegged\/total-stablecoin-supply\" data-v-f87c67ca=\"\">data dashboard<\/a>.","Tether’s USDT remains the leading stablecoin, with a market capitalization of $112 billion or a 70% market share. Circle’s USDC ranks second at $35 billion (22%), followed by MakerDAO’s DAI at $5 billion (3%), and First Digital’s FDUSD in fourth place with a market cap of $2.5 billion (1.5%).","<span data-v-f87c67ca=\"\">Ethena's USDe supply | <a href=\"https:\/\/www.theblock.co\/data\/stablecoins\/usd-pegged\" data-v-f87c67ca=\"\">The Block<\/a><\/span>","Unlike conventional stablecoins, USDe employs a unique mechanism that does not rely on direct fiat or asset backing. Instead, it includes derivative hedging against collateral positions and an arbitrage system for minting and redeeming designed to maintain its peg to the U.S. dollar.","It also leverages a cash-and-carry trade that generates a yield, which is then shared back with stablecoin holders. For example, it utilizes strategies like staking ETH holdings (collected from USDe stablecoin minters) with Ethereum validators and simultaneously shorting the same amount of ether futures.","Previously allowing users to deposit U.S. dollars, ETH, or liquid staking tokens as collateral to mint USDe, Ethena <a href=\"https:\/\/www.theblock.co\/post\/286585\/ethena-usde-bitcoin-backing\" data-v-f87c67ca=\"\">added bitcoin<\/a> as a collateral asset yesterday. The addition will enable USDe to “scale significantly,” as traders embrace bitcoin, the project said, pointing to bitcoin’s superior liquidity and duration profile for delta hedging compared to liquid staking tokens as a factor in its decision to add the asset.","Many in crypto industry have highlighted potential counterparty risks and other risk factors associated with USDe’s yield generation strategies, the latest being <a href=\"https:\/\/twitter.com\/AndreCronjeTech\/status\/1775398490404724914\" data-v-f87c67ca=\"\">Andre Cronje<\/a> of Fantom.","The project recognizes these concerns and has detailed seven specific risks on its <a href=\"https:\/\/ethena.notion.site\/Ethena-FAQs-3ccc1437e13343f8b74c0d005e4f5128\" data-v-f87c67ca=\"\">FAQ page<\/a>. These include challenges ranging from funding rates to exchange failures and regulatory issues, with thorough examinations of each.","In February, Ethena Labs <a href=\"https:\/\/www.theblock.co\/post\/277565\/ethena-usde-stablecoin-funding-valuation-paypal-brevan-howard-others\" data-v-f87c67ca=\"\">raised<\/a> $14 million in a strategic funding round at a $300 million valuation, co-led by Dragonfly and BitMEX founder Arthur Hayes’ family office, Maelstrom. Ethena publicly launched the USDe stablecoin at the same time as the fundraising announcement following a stealth launch in December 2023.","Earlier this week, Ethena started the claim process for its <a href=\"https:\/\/www.theblock.co\/post\/286000\/ethenas-token-to-list-on-exchanges-today-amid-airdrop-claims\" data-v-f87c67ca=\"\">ENA governance token airdrop<\/a>, distributing 750 million tokens, or 5% of its total 15 billion supply, to eligible users as the token also began trading on several centralized exchanges.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"70%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$5 billion","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"22%","content":"PERCENT"},{"type":"$14 million","content":"MONEY"},{"type":"Fantom","content":"PERSON"},{"type":"Ethena Labs","content":"ORGANIZATION"},{"type":"Dragonfly","content":"ORGANIZATION"},{"type":"$35 billion","content":"MONEY"},{"type":"$2 billion","content":"MONEY"},{"type":"First Digital","content":"ORGANIZATION"},{"type":"delta","content":"ORGANIZATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"3%","content":"PERCENT"},{"type":"Ethena","content":"PERSON"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"1.5%","content":"PERCENT"},{"type":"February","content":"DATE"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"ENA","content":"ORGANIZATION"},{"type":"1.25%","content":"PERCENT"},{"type":"USDC","content":"ORGANIZATION"},{"type":"$2.5 billion","content":"MONEY"},{"type":"December 2023","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"$160 billion","content":"MONEY"},{"type":"Andre Cronje","content":"PERSON"},{"type":"$112 billion","content":"MONEY"},{"type":"$300 million","content":"MONEY"}],"hashtag":[],"authors":["James Hunt","The Block"]}