{"summary":"Embattled lender Celsius argued for a set of interim motions in first-day proceedings of its Chapter 11 bankruptcy case.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/158339\/celsius-first-day-bankruptcy-proceedings-address-the-interim-before-a-reorganization","publishDate":"2022-07-18T19:23:07","id":4547,"type":null,"title":"Celsius first-day bankruptcy proceedings address the interim before a reorganization","category":["LEGAL"],"content":["Crypto lender Celsius's Chapter 11 bankruptcy proceedings are officially underway as counsel argued for a number of interim motions during first-day proceedings.","Chapter 11 proceedings allow a business to stay operational as it restructures to pay creditors. These first-day proceedings centered on actions Celsius needs to take in the interim, or before the next hearing date. Big-picture proceedings, such as the restructuring and long-term plans for payment, will occur further in the process. The day's motions were focused on allocating the funds necessary to maintain critical operations until the restructuring is underway.","Judge Martin Glenn appeared amenable to the majority of the requests. However, the Department of Justice's Office of the US Trustee made it clear it's hoping Celsius will provide more transparency going forward, which Glenn sought to accommodate.","Nearly 200 people signed onto the Zoom hearing, and the scope of the case was apparent to those appearing. Kirkland &amp; Ellis restructuring partner Patrick Nash spent the first portion of the hearing rehashing the factors that led Celsius to bankruptcy and going over the breakdown of its funds.","Nash said Celsius is glad to have the opportunity to communicate a path forward since the firm was advised against speaking to its community in the period leading up to filing. Indeed, Celsius <a href=\"https:\/\/www.theblock.co\/post\/152317\/celsius-is-working-non-stop-according-to-its-ceo-but-has-yet-to-share-action-steps-post-withdrawal-freeze\" data-v-f87c67ca=\"\">effectively went silent<\/a> after it <a href=\"https:\/\/www.theblock.co\/linked\/151522\/crypto-lending-firm-celsius-pauses-withdrawals-and-transfers-citing-market-conditions\" data-v-f87c67ca=\"\">halted withdrawals<\/a> a month ago due to liquidity issues. Since then, little has been communicated on its plans until the firm filed for Chapter 11 proceedings last week.&nbsp;","<b data-v-f87c67ca=\"\">\"<\/b>Chapter 11 gives Celsius the opportunity to start answering at least some of these questions,\" said Nash in his opening comments. \"Chapter 11 affords us a forum to communicate with our customers on the path forward.\"","From the outset, Celsius sought to make it clear that these proceedings will not be a liquidation.","\"We do not intend to force customers to take their recovery in fiat currency,\" said Nash during the proceedings. \"All is not lost. We intend for this to be a reorganization. Our goal is to maximize the value of Celsius assets for the benefit of our customers.\"","The plan is for the US Trustee to establish a Creditor Committee, which Nash said will essentially be a customer committee, to advise the restructuring. Nash said support from the community will be critical.","And though it's seeking support from its community, Celsius also facing significant backlash.","Nash said many Celsius employees and affiliates believe their safety is threatened due to an outpouring of hate and death threats on social media. For that reason, two of the motions before Glenn sought to redact key information on the identities of employees and affiliates in public filings.","Glenn granted the interim motion but said the court would revisit the concern in the full proceedings since it's unclear whether that information can be sealed under the applicable statutes.","Shara Cornell, trial attorney at the Office of the US Trustee first raised concerns over transparency related to pending <a href=\"https:\/\/www.theblock.co\/post\/156741\/celsius-voyager-us-state-regulators-increasing-scrutiny-bloomberg\" data-v-f87c67ca=\"\">regulatory investigations<\/a> into the lender. Indeed, the firm has provided little information in its filings on the securities regulator investigations.","Though those cases aren't immediately salient to the proceedings and didn't weigh on today's motions, both Glenn and Cornell questioned Celsius's counsel on its regulatory compliance. Celsius cited the murky waters of regulation.&nbsp;&nbsp;","Cornell also sought more transparency from the lender in some of its motions, including Celsius's cash management motion, which would give the firm $300,000 of runway for inter-company transfers, such as making payroll, and authorize the firm to maintain and manage its cryptocurrency assets in the ordinary course of business. Cornell said the office would appreciate more information on the purpose and mode of transfers from crypto to fiat between debtors and non-debtor affiliates.","A previous clause in that document would have allowed Celsius to sell bitcoin mined by its subsidiary, though that was struck during negotiations with the Trustee. A final version of that document has yet to reach Judge Glenn, so it has yet to be granted.","Glenn did immediately grant the following wages motion, which allows the firm to continue to pay benefits and salaries to its employees. The money will come from the $300,000 stipulated in the cash management motion.","The mining subsidiary appears to be a significant part of Celsius's plan to maximize its assets. Multiple motions included provisions for costs related to a mining facility that remains under construction.","Though the cash management motion was retooled to strike the clause allowing the firm to sell mined bitcoin was retooled to exclude that clause, the firm said the ask will likely come up again.&nbsp;","In its motion to pay critical creditors, Celsius sought $3.76 million for the next 21 days to meet payments from those it deems most important. Among those critical creditors are those related to the construction of the mining facility.","The US Trustee pushed back on this request, calling for more information to be part of the conversation of which creditors are truly critical.","\"It's a lot of money to be spent on an industry where we're not sure where the future benefits lie,\" said Cornell during the hearing.","The list of critical creditors was lacking, according to Cornell, failing to highlight which entities are foreign and how each relates to parts of Celsius's business. Glenn acknowledged that firms are often hesitant to publicize their most important creditors in proceedings since they can do business with those who don't make the cut, and said he'd be prepared to grant the motion if Celsius submit a more detailed list under seal.&nbsp;","An additional motion asking for relief to pay insurance and bond programs also highlighted the new mining facility. Though Celsius says it's up to date on its insurance payments, it's seeking to pay another premium for the mining facility. While that claim was granted, the firm also sought to have additional cash on hand in case other needs arose.","Glenn directed Celsius to coordinate with the Trustee and the Court should that occur instead of granting the extra relief presently.","Celsius also sought relief to pay taxes and duties in the next 21 days. Arguments revealed that Celsius has not made some of these payments since 2020, and could request up to $22 million in relief in future proceedings. Considering the significant sum in back taxes, the Trustee asked why the firm needed the $1.5 million on such short notice. Celsius pointed to the mining facility – it has a number of rigs entering the country that it's slated to pay duties on. Glenn granted the motion.&nbsp;&nbsp;","The final motion of the day reinforced the protections of the bankruptcy code, essentially granting a stay so that debtors can reorganize without assets being interfered with or repossessed.&nbsp;","During the proceedings, Glenn made it clear that establishing the creditor committee was a priority before moving forward with other, bigger-picture proceedings.","While a final date for the next hearing has yet to be officially set on the docket, the Court discussed meeting again on Zoom on August 10 at 11 AM.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Martin Glenn","content":"PERSON"},{"type":"$1.5 million","content":"MONEY"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"Court","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Creditor Committee","content":"ORGANIZATION"},{"type":"$3.76 million","content":"MONEY"},{"type":"US Trustee","content":"ORGANIZATION"},{"type":"Kirkland &amp; Ellis","content":"ORGANIZATION"},{"type":"$22 million","content":"MONEY"},{"type":"Nash","content":"PERSON"},{"type":"Celsius","content":"PERSON"},{"type":"Celsius","content":"ORGANIZATION"},{"type":"August 10","content":"DATE"},{"type":"Cornell","content":"ORGANIZATION"},{"type":"Trustee","content":"ORGANIZATION"},{"type":"Patrick Nash","content":"PERSON"},{"type":"$300,000","content":"MONEY"},{"type":"Glenn","content":"PERSON"},{"type":"2020","content":"DATE"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}