{"summary":"The Ethereum infrastructure service&#x27;s round is split into two tranches, with a portion of each earmarked for “ecosystem allocation.”","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/203637\/flashbots-fundraise-billion-dollar-valuation","publishDate":"2023-01-19T05:32:02","id":4548,"type":null,"title":"Flashbots seeks up to $50 million at a billion-dollar valuation","category":["INFRASTRUCTURE"],"content":["Flashbots, an Ethereum infrastructure service, is in discussions with potential backers about raising up to $50 million at a billion-dollar valuation.","The startup hopes to raise between $30 million and $50 million in equity investment at a $1 billion pre-money valuation, according to two people with knowledge of the deal and an excerpt of the offering obtained by The Block.&nbsp;","Unusually, rather than pitching prospective investors, Flashbots has invited investors to pitch for the chance to participate in the round. This reverse-pitching process, in theory, means investors must convince the company to take their money. The round is split into two tranches, with a portion of each earmarked for “ecosystem allocation.”","Crypto venture firm Paradigm has committed to leading the investment, the people briefed on the matter said. Crunchbase, the data site, lists Paradigm as the lead investor in Flashbots’ seed-stage fundraise in 2020.&nbsp;","Flashbots and Paradigm did not immediately respond to requests for comment.","The fundraising effort is a rare example of a bigger-ticket venture deal in a crypto market that has become considerably quieter in the wake of a disastrous end to 2022, punctuated by the collapse of Sam Bankman-Fried’s FTX.","Flashbots’ service effectively proposes blocks for validators running the Ethereum blockchain. In part because its blocks provide more value to validators, the service has become dominant within the ecosystem. Data available on <a href=\"https:\/\/transparency.flashbots.net\/\" data-v-f87c67ca=\"\">its website<\/a> suggest Flashbots currently accounts for 60% of all Ethereum blocks — a figure that has risen steadily from just 16% in September last year. &nbsp;","Usage of the software has grown despite some criticism, late last year, that it was <a href=\"https:\/\/www.theblock.co\/post\/174386\/flashbots-now-accounts-for-39-of-ethereum-blocks-as-censorship-concerns-rise\" data-v-f87c67ca=\"\">censoring transactions<\/a> tied to sanctioned crypto mixing service Tornado Cash. Disagreements over the matter saw Stephane Gosselin, one of Flashbots’ co-founders, <a href=\"https:\/\/www.theblock.co\/post\/175709\/flashbots-co-founder-steps-down-after-disagreements-with-team-over-censorship\" data-v-f87c67ca=\"\">resign<\/a> in September.","Concerns over the apparent censorship prompted a response from Flashbots Product Lead Robert Miller, who said the company was exploring ways to reduce dominance. Flashbots had <a href=\"https:\/\/www.theblock.co\/post\/164152\/flashbots-to-hasten-open-sourcing-of-its-mev-boost-relay-code\" data-v-f87c67ca=\"\">said in August<\/a> that it would open-source its MEV-Boost relay code, Miller added.&nbsp;","MEV stands for maximum extractable value and refers to the premium — above the normal transaction fee — that block producers can charge for reordering or censoring transaction blocks. Flashbots’ MEV-Boost aims to deliver fair and transparent MEV extraction, hoping to mitigate the risk of nefarious MEV practices, such as frontrunning and sandwich attacks.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/number-of-blocks-proposed-from-flashbots-mev-boost-relay\/embed\" title=\"Number of Blocks Proposed from Flashbots MEV-Boost Relay\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2022","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"September last year","content":"DATE"},{"type":"60%","content":"PERCENT"},{"type":"$30 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Miller","content":"PERSON"},{"type":"Paradigm","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"16%","content":"PERCENT"},{"type":"September","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"Stephane Gosselin","content":"PERSON"},{"type":"Robert Miller","content":"PERSON"},{"type":"$50 million","content":"MONEY"},{"type":"August","content":"DATE"}],"hashtag":["SERIES A","VALIDATORS"],"authors":["Ryan Weeks","Lucy Harley-McKeown","The Block"]}