{"summary":"Traditional hedge funds with current crypto investments plan to either maintain or increase exposure, according to a report from PwC.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239315\/hedge-funds-are-showing-robust-confidence-in-crypto-pwc-says","publishDate":"2023-07-12T16:30:59","id":4549,"type":null,"title":"Hedge funds are showing robust confidence in crypto, PwC says","category":["COMPANIES"],"content":["Even though the percentage of traditional hedge funds investing in crypto declined from 37% to 29% in 2023, confidence in the value proposition and long-term sustainability of crypto assets \"appears robust,\" <a href=\"https:\/\/www.theblock.co\/post\/238894\/institutional-self-custody-pwc\" data-v-f87c67ca=\"\">PwC<\/a> said Wednesday in a <a href=\"https:\/\/www.pwc.com\/gx\/en\/news-room\/press-releases\/2023\/pwc-2023-global-crypto-hedge-fund-report.html\" data-v-f87c67ca=\"\">report<\/a>.","Traditional hedge funds with current crypto investments plan to either maintain or increase exposure, the <a href=\"https:\/\/www.pwc.com\/gx\/en\/new-ventures\/cryptocurrency-assets\/5th-annual-global-crypto-hedge-fund-report-july-2023.pdf\" data-v-f87c67ca=\"\">report<\/a> found. And that's regardless of market volatility and ongoing regulatory uncertainty that have challenged the sector.&nbsp;","Over the past year, the average allocation to crypto by traditional hedge funds increased from 4% to 7%. Still, slightly over half of traditional funds surveyed said they are unlikely to invest in crypto over the next three years.&nbsp;","The <a href=\"https:\/\/www.pwc.com\/gx\/en\/new-ventures\/cryptocurrency-assets\/5th-annual-global-crypto-hedge-fund-report-july-2023.pdf\" data-v-f87c67ca=\"\">report<\/a>, conducted with the Alternative Investment Management Association and&nbsp;CoinShares, surveyed both traditional hedge funds and crypto hedge funds. Of that second group, 93% expect the overall crypto market capitalization to be higher at the end of the year.","\"Despite market volatility, a fall in digital asset prices and the collapse of a number of crypto businesses, investment in crypto-assets is expected to remain strong in 2023,\" John Garvey, a global financial services leader at PwC U.S., said in a statement. \"Traditional hedge funds, committed to the market in the longer term, are not only increasing their crypto-assets under management, but also maintaining – if not increasing – the amount of capital deployed in the ecosystem.\"","Garvey added that regulatory uncertainty is continuing to weigh on many funds, and that more than half of those surveyed would invest more once greater transparency, regulatory certainty and risk management are in place.&nbsp;","The report found that 23% of traditional hedge funds are reassessing their crypto strategy due to the regulatory environment in the U.S., while 12% of crypto hedge funds are considering relocating away from the country.&nbsp;&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"John Garvey","content":"PERSON"},{"type":"23%","content":"PERCENT"},{"type":"12%","content":"PERCENT"},{"type":"93%","content":"PERCENT"},{"type":"29%","content":"PERCENT"},{"type":"Garvey","content":"PERSON"},{"type":"PwC","content":"ORGANIZATION"},{"type":"37%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"Alternative Investment Management Association","content":"ORGANIZATION"},{"type":"PwC U.S.","content":"LOCATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}