{"summary":"California-based crypto custody business BitGo said it views Singapore as an important hub for crypto innovation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/271148\/bitgo-singapore-inprinciple-approval-digital-asset-license","publishDate":"2024-01-09T20:01:21","id":4551,"type":null,"title":"BitGo obtains in-principle approval in Singapore for digital asset license","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">BitGo, a decade-old crypto custody business, has obtained in-principle approval from Singapore’s top financial regulator for a Major Payment Institution license through its local entity.<\/span>","<span data-v-f87c67ca=\"\">The company said today in a statement shared with The Block that, once granted the full license, BitGo Singapore Pte. Ltd., its subsidiary in Singapore, would be able to offer regulated digital payment token services in the city-state.<\/span>","<span data-v-f87c67ca=\"\">BitGo noted in the statement that it views Singapore as an important hub for crypto innovation and that operating a crypto brokerage in the country “positions BitGo as a leading provider of digital asset services for institutional finance throughout APAC.”<\/span>","<span data-v-f87c67ca=\"\">A BitGo spokesperson told The Block that the company currently offers digital asset wallet and custody solutions in Singapore. Upon obtaining a full license, it plans to expand its offerings to also allow clients to buy and sell crypto from its cold storage custody solution built within a class III vault.<\/span>","<span data-v-f87c67ca=\"\">“The Monetary Authority of Singapore's forward-looking and risk-proportionate regulatory framework for digital assets, as well as Singapore’s leading position as a financial centre, innovation hub and business gateway to APAC, are key factors driving BitGo’s commitment to Singapore as its regional headquarters,” Hobeng Lim, managing director of APAC for BitGo, said in the statement.<\/span>","<span data-v-f87c67ca=\"\">In August 2023, BitGo, based in <\/span><span data-v-f87c67ca=\"\">Palo Alto, California, <\/span><a href=\"https:\/\/www.theblock.co\/post\/244055\/bitgo-fundraise\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">raised $100 million<\/span><\/a><span data-v-f87c67ca=\"\"> in Series C financing at a $1.75 billion valuation. The Block reported that the company planned to use the funds for strategic acquisitions and global expansion.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Palo Alto","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"August 2023","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"APAC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"California","content":"LOCATION"},{"type":"$1.75 billion","content":"MONEY"},{"type":"Hobeng Lim","content":"PERSON"},{"type":"The Monetary Authority","content":"ORGANIZATION"},{"type":"BitGo Singapore Pte. Ltd.","content":"ORGANIZATION"}],"hashtag":["ASIAN REGULATION"],"authors":["Timmy Shen","The Block"]}