{"summary":"The Ethereum Name Service (ENS) domain sony.eth has been purchased for 48 ETH (72,000) by an ENS collector called sunnybay.eth.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/158540\/ethereum-name-service-collector-buys-sony-eth-ens-for-72000","publishDate":"2022-07-19T17:17:19","id":4552,"type":null,"title":"Ethereum Name Service collector buys sony.eth ENS for $72,000","category":["NFTS"],"content":["Sunnybay.eth, a pseudonymous Ethereum Name Service (ENS) collector, has <a href=\"https:\/\/etherscan.io\/tx\/0xb875b5779441930a0246f4e88f6c78b410a1a33387ab362168de7577558f0e15\" data-v-f87c67ca=\"\">purchased<\/a> sony.eth for 48 ETH (72,000), according to data from OpenSea.","The purchase came only six minutes after sunnybay made the 48 ETH offer for the domain name, according to on-chain data. Sunnybay also <a href=\"https:\/\/opensea.io\/sunnybay_eth?tab=collected\" data-v-f87c67ca=\"\">owns<\/a> several other “brand ENS” including ipad.eth and coke.eth.","ENS domains are a type of human-readable crypto addresses that are easier to read than the default alphanumeric blockchain wallet addresses. They make sending and receiving tokens easier, especially for people who might struggle with the normal blockchain address.","These ENS domain names are non-fungible tokens (NFTs). As such, owners can sell or transfer them on NFT marketplaces like OpenSea.","The sony.eth sale for $72,000 is the latest example of the growing appeal for ENS domain names. Domain names with three digits and four digits have become popular in recent times given their relative scarcity.","There are only 1,000 three-digit ENS, from 000 to 999. Conversely, there are 10,000 four-digit ENS names, from 0000 to 9999. The total supply for the two categories makes them similar to typical NFT collections.","The ENS domain <a href=\"https:\/\/www.theblock.co\/post\/155685\/ethereum-name-service-records-second-highest-ens-name-sale\" data-v-f87c67ca=\"\">000.eth sold for 300 ETH<\/a> ($315,000 at the time) earlier in July. The sale was the second-highest purchase for an Ethereum Name Service domain.","Apart from three-digit and four-digit names, Ethereum Name Service domains based on popular brands are also expected to become premium NFTs. This is based on the expectation that the companies that own such brands will want to acquire them in the future. There is currently a 1 million USD Coin ($1 million) offer on amazon.eth.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"0000","content":"DATE"},{"type":"$315,000","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ethereum Name Service","content":"ORGANIZATION"},{"type":"9999","content":"DATE"},{"type":"1 million","content":"MONEY"},{"type":"$1 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$72,000","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"ENS","content":"ORGANIZATION"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}