{"summary":"Crypto insiders consider the regulatory path ahead after Coinbase got a Wells notice from the SEC.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/222427\/what-comes-next-after-coinbases-wells-notice","publishDate":"2023-03-23T18:33:31","id":4555,"type":null,"title":"What comes next after Coinbase&#x27;s Wells notice?","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The cryptocurrency industry is in an uproar following news that the Securities and Exchange Commission issued a Wells notice to Coinbase, and other companies consider what’s next.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC’s <a href=\"https:\/\/www.theblock.co\/post\/222084\/sec-investigating-coinbase-for-its-earn-product-wallet-service-and-exchange-activity\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">notice<\/span><\/a> relates to the firm’s staking service, Coinbase Earn and Coinbase Wallet, the company wrote in a blog post on Wednesday. This comes after the SEC has said most cryptocurrencies are securities and commission Chair Gary Gensler has called on firms and token projects to register with the agency.&nbsp;<\/span>","An enforcement action against Coinbase appears to have been building for a long time: The markets regulator has signaled an increased attention to issues around staking-as-a-service and custody of crypto assets in recent weeks through a combination of enforcement and proposed rule changes. The SEC and Justice Department also charged a former Coinbase product manager with insider trading activity around nine tokens listed on Coinbase that the SEC claims are unregistered securities.","But unlike other companies and projects targeted by regulators for noncompliance, Coinbase is a public company that received approval from the SEC to sell publicly traded stock in 2021. Though the SEC frequently investigates public companies, some of the offerings apparently under scrutiny now were in place when the SEC approved the IPO.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">“They provided extensive details of their business through that process,” said Brett Quick, head of government affairs at the Crypto Council for Innovation, an industry association that counts Coinbase among its members. “Why are they now coming back and saying that there are all of these problems with the business model?\"<\/span>","The action may have galvanized crypto community support for the company, though whether that lasts could depend on if Coinbase fights the SEC or chooses to settle and change its business operations.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">“We’ve seen kind of a rallying behind Coinbase over the course of the last 24 hours,” said Jennifer Schulp, <\/span><span class=\"s2\" data-v-f87c67ca=\"\">director of financial regulation studies at the libertarian think tank Cato Institute. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The Wells notice that Coinbase received is a letter from SEC staff notifying the subject of an investigation that the agency is ready to recommend formal charges to the commission. But subjects of the investigation <\/span><span class=\"s1\" data-v-f87c67ca=\"\">can try to persuade staff not to make that recommendation, said Andrew Vollmer, senior affiliate scholar at the Mercatus Center and former deputy general counsel at the SEC. The commission will then vote on whether to bring charges in a closed meeting. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“So you don’t know how fast the staff will get something to the commission and how fast the commission puts it on its agenda,” Vollmer said. “It can take months. Sometimes cases go quiet for a long time.”&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">This is a ripe time for defendants to get together to settle, Vollmer said. That could include a fine and change in operations.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“Now is an opportune moment for Coinbase and the SEC enforcement staff to talk,” he said. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Coinbase’s Grewal said the firm still wants rulemaking and legislation over enforcement, but pointedly said “if necessary, we welcome the opportunity for Coinbase and the broader crypto community to get clarity in court.”&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Going to court is not a fast process, noted Quick. \"<\/span><span class=\"s1\" data-v-f87c67ca=\"\">But it will at least help to bring some of the transparency that not just Coinbase, but the entire industry really needs and have been asking for.”&nbsp; &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">When asked what Coinbase’s chances would be in court, Cato’s Schulp said it was too early to say. &nbsp;<\/span>","The Coinbase case could lead to increased speculation that more of the industry will move abroad, though so far threats from companies to do so without more favorable rules in the U.S. have yet to be acted upon. But companies complain that engagement with U.S. regulators leads to confrontation rather than cooperation.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">People in the industry have said that “if you’re engaging with the SEC, what you get for your trouble is a Wells notice or a settlement. This is just further evidence of that,” Schulp said. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Gensler <a href=\"https:\/\/www.theblock.co\/post\/212241\/gensler-opens-new-regulatory-front-for-crypto-firms-custody\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">repeatedly<\/span><\/a> has said that the “runway is increasingly getting short,” for crypto firms to come in a register. A lack of compliance is hurting investors, Gensler has said publicly, noting the number of frauds or bankruptcies — sometimes bankruptcies involving alleged fraud — in which investors have lost money.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">But Coinbase’s Grewal claimed in a Wednesday blog post there is no current way for a crypto exchange to register with the agency. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“It’s very difficult to be competitive in that environment and very difficult to want to be a compliant industry player if there is no path to compliance,” Schulp said. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Aaron Kaplan, co-CEO of Prometheum, a digital asset security market infrastructure company, said the best path forward is for crypto participants to come into compliance under the securities laws in order to protect investors.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“The paradigm shift is occurring and companies will need to evolve,” Kaplan said. “Those who don’t evolve will either have to really put a significant amount of their effort into fighting legal and enforcement battles and regulatory battles or they will have to potentially operate outside the United States.” &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC did not respond to a request for comment. &nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"last 24 hours","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Brett Quick","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Crypto Council for Innovation","content":"ORGANIZATION"},{"type":"Kaplan","content":"PERSON"},{"type":"Grewal","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Andrew Vollmer","content":"PERSON"},{"type":"Aaron Kaplan","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Mercatus Center","content":"ORGANIZATION"},{"type":"Coinbase Wallet","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Justice Department","content":"ORGANIZATION"},{"type":"Jennifer Schulp","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Vollmer","content":"PERSON"},{"type":"Schulp","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Coinbase Earn","content":"ORGANIZATION"},{"type":"Cato","content":"LOCATION"},{"type":"Cato Institute","content":"ORGANIZATION"},{"type":"Coinbase’s Grewal","content":"PERSON"}],"hashtag":["COINBASE","SEC"],"authors":["Sarah Wynn","The Block"]}