{"summary":"Avalanche-based DeFi protocol Wonderland was allegedly co-founded by QuadrigaCX co-founder Michael Patryn.\nPatryn reportedly has had several criminal convictions in the past.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/131931\/avalanche-defi-wonderland-time-0xsifu-quadrigacx-patryn","publishDate":"2022-01-27T04:42:43","id":456,"type":null,"title":"DeFi protocol Wonderland is allegedly run by QuadrigaCX co-founder","category":["DeFi"],"content":["<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Update 1:<\/strong> Following the publication of this story, Sestagalli has said in an official <a href=\"https:\/\/mirror.xyz\/0x8A7f7C5b556B1298a74c0e89df46Eba117A2F6c1\/Laraxx5dW-07hvHS-ff8TgnS4etd67SbM05Li1Am1ag\" data-v-f87c67ca=\"\">statement<\/a> that 0xSifu \/ Patryn will be stepping down. There will then be a vote as to whether he should rejoin the team. \"Wonderland has the say to who manages its treasury not me or the rest of the wonderland team,\" said Sestagalli.<\/em>","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Update 2:<\/strong> The vote to remove 0xSifu \/ Patryn as the treasury manager of Wonderland <a href=\"https:\/\/snapshot.org\/#\/bestfork.eth\/proposal\/0x8f974b76d4f50ea26a1f44843dcda2e0f6a4736883968b29996d272b86b447a9\" data-v-f87c67ca=\"\">has opened<\/a>. It ends on January 29. Sestagalli told The Block that 0xSifu \/ Patryn has “returned all funds to multisign” and “0 money is lost.” 0xSifu \/ Patryn posted in Wonderland’s Discord channel: “I fully expect this vote to not pass” and that he is “very heartbroken” to be leaving Wonderland.<\/em>","Avalanche-based DeFi protocol Wonderland was allegedly co-founded by Michael Patryn, the surviving co-founder of the now-defunct Canadian crypto exchange QuadrigaCX.","A crypto sleuth who goes by Zach on Twitter <a href=\"https:\/\/twitter.com\/zachxbt\/status\/1486591682728673282?s=20\" data-v-f87c67ca=\"\">posted<\/a> their conversation with Daniele Sestagalli — the other co-founder of Wonderland — on Thursday, saying that they have identified Wonderland's other co-founder OxSifu as Patryn.","Sestagalli <a href=\"https:\/\/twitter.com\/danielesesta\/status\/1486591439463014406\" data-v-f87c67ca=\"\">confirmed<\/a> his conversation with Zach about 0xSifu but did not directly say that 0xSifu is Patryn, just someone with a sinister past.","\"Today allegations about our team member @0xSifu will circulate. I want everyone to know that I was aware of this and decided that the past of an individual doesn't determine their future. I choose to value the time we spent together without knowing his past more than anything,\" said Sestagalli.","Sestagalli told The Block, “I commented I think that I knew since 1 month and I took a personal decision that my past with him as anon was good enough.”","MyCrypto founder Taylor Monahan pointed out that on-chain evidence backs up Zach's claim. In 2019, she labelled a wallet as Patryn's based on a <a href=\"https:\/\/twitter.com\/tayvano_\/status\/1486630594867957762\" data-v-f87c67ca=\"\">note<\/a> that identifies it as his Ethereum address for his Ledger hardware wallet. She <a href=\"https:\/\/twitter.com\/tayvano_\/status\/1486634588734586882\" data-v-f87c67ca=\"\">then showed<\/a> that this wallet has remained active, including with transactions — such as one for 17 ether ($42,500) — to 0xSifu's address.","Patryn has had several criminal convictions in the past, according to a Bloomberg <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2019-03-19\/from-fraud-to-fintech-quadriga-co-founder-s-past-crimes-emerge\" data-v-f87c67ca=\"\">report<\/a>. Before founding QuadrigaCX in 2013, he was sentenced to 18 months in the US for being involved in identity theft related to bank and credit card fraud in 2005. He once pleaded guilty to operating shadowcrew.com in 2002, a now-defunct marketplace that trafficked stolen credit card and bank card numbers. In 2007, he also admitted guilt in separate criminal cases for burglary and computer fraud.","Patryn also legally changed his name twice — from Omar Dhanani to Omar Patryn in 2003 and to Michael Patryn in 2008. Patryn has denied the allegations that he and Dhanani are the same person.","\"I have no bias about @0xSifu he has became a friend and part of my family and if my reputation of judgment will be hit by his dox, than be it. All frogs for me are equal,” said Sestagalli.","Wonderland was launched in September 2021 by Sestagalli and 0xSifu as a fork of the Olympus protocol on the Avalanche blockchain. Participants in the Wonderland community refer to themselves as \"frogs\" or as a \"frog nation.\" Frog Nation also encompasses Abracadabra, Popsicle Finance and now Sushi (the community behind the SushiSwap decentralized exchange).","Wonderland is a “decentralized reserve currency protocol that owns its own liquidity.\" The idea behind the protocol is to create a stablecoin that is not pegged to the US dollar or any other fiat currency but is backed by a pool of crypto assets held in the protocol’s treasury. The hope is that these assets provide a floor price for the token.","Wonderland's native token is TIME, and the current total value locked in the protocol is nearly $680 million, according to its <a href=\"https:\/\/www.wonderland.money\/\" data-v-f87c67ca=\"\">website<\/a>. As for the TIME token, it is currently <a href=\"https:\/\/www.coingecko.com\/en\/coins\/wonderland\" data-v-f87c67ca=\"\">trading over 40% down<\/a> at around $360, according to CoinGecko.","Sestagalli was the CEO of the now-defunct project Zulu Republic in 2018. He was then the chief technique officer of Utopia Genesis Basis in 2021. After that, he founded Popsicle Finance, Abracadabra and Wonderland.","<em data-v-f87c67ca=\"\">Update: The headline of this story has been changed from \"Avalanche-based\" to \"DeFi protocol.\"<\/em>","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>"],"hashtag":["AVALANCHE"]}