{"summary":"NFT marketplace OpenSea has acquired NFT aggregator service Gem, according to an email sent out to Gem&#x27;s investors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/143297\/opensea-acquires-nft-aggregator-gem","publishDate":"2022-04-25T10:00:59","id":4562,"type":null,"title":"OpenSea acquires NFT aggregator Gem","category":["STARTUPS"],"content":["OpenSea has acquired NFT aggregator service Gem, The Block has learned.","News of the deal was revealed in an email sent to Gem investors and seen by The Block.","Gem lets you buy and sell NFTs across multiple marketplaces and makes it easier to sweep the floor of an NFT collection (that is buy a range of the lower end of the collection). Following the acquisition, Gem will continue to operate as a standalone brand.&nbsp;","Gem said the acquisition offer was \"unexpected\" but that it would accelerate its next stage of growth. It added that Gem would be gaining access to OpenSea's infrastructure, resources and distribution channels.","For its part OpenSea said, in a <a href=\"https:\/\/opensea.io\/blog\/announcements\/opensea-acquires-gem-to-invest-in-pro-experience\/\" data-v-f87c67ca=\"\">blog post<\/a>, that it will be able to \"learn from Gem’s expertise and intuition about the advanced NFT community.\"","OpenSea added that during the due diligence for the acquisition, it uncovered allegations against a now-former member of Gem's leadership team who goes by the pseudonym Neso. They left the company after an investigation and before the deal closed.","\"This individual has never and will never be affiliated with OpenSea,\" said OpenSea.","<em data-v-f87c67ca=\"\">This article has been updated with more information.<\/em>","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to subscribe to The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/t.me\/the_block_crypto\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/t.me\/the_block_crypto\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">Telegram<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"OpenSea","content":"PERSON"},{"type":"Neso","content":"PERSON"}],"hashtag":["CRYPTO","OPENSEA"],"authors":["Tim Copeland","The Block"]}