{"summary":"FTX has won the auction for bankrupt lender Voyager Digital and its assets with a bid of about $1.4 billion.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/172946\/ftx-wins-auction-for-bankrupt-crypto-lender-voyager","publishDate":"2022-09-26T22:45:49","id":4565,"type":null,"title":"FTX wins auction for bankrupt crypto lender Voyager","category":["LEGAL"],"content":["FTX has won the auction for bankrupt lender Voyager Digital and its assets with a bid of around $1.4 billion, Voyager announced today.","The bid reflects the more than $1.3 billion at fair market value of crypto stored on Voyager's platform, though the final value of the deal will be based on prices on a to-be-determined date. The bid also includes \"additional consideration that is estimated as providing approximately $111 million of incremental value,\" according to a statement from the firm.&nbsp;","The Official Committee of Unsecured Creditors, which represents customers and creditors in the bankruptcy process, \"participated actively in the competitive auction and supports FTX US's winning bid,\" according to the statement.","\"FTX US's bid maximizes value and minimizes the remaining duration of the Company's restructuring by providing a clear path forward for the Debtors to consummate a chapter 11 plan and return value to their customers and other creditors,\" said the statement. \"FTX US's market-leading, secure trading platform will enable customers to trade and store cryptocurrency after the conclusion of the Company's chapter 11 cases.\"","Voyager's <a href=\"https:\/\/www.theblock.co\/post\/154316\/voyager-digital-issues-default-notice-against-three-arrows-capital\" data-v-f87c67ca=\"\">claims<\/a> against bankrupt fund Three Arrows Capital (3AC) remain with the estate, and any funds recovered from a loan to 3AC of $650 million will be distributed to creditors.","The sale ends a nearly two week long <a href=\"https:\/\/www.theblock.co\/post\/168264\/bankrupt-voyager-digital-to-hold-asset-auction-on-september-13\" data-v-f87c67ca=\"\">auction<\/a> process during which exchanges FTX and Binance were reportedly frontrunners. Voyager received multiple bids of sale and reorganization alternatives, and based on the results of the auction it concluded that \"FTX is the best alternative for Voyager stakeholders,\" it said in today's&nbsp;statement.&nbsp;","Voyager <a href=\"https:\/\/www.theblock.co\/post\/155990\/crypto-broker-voyager-digital-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">filed<\/a> for Chapter 11 protection in July of this year and has since wound its way through the bankruptcy process. During that time, FTX and sister firm Alameda <a href=\"https:\/\/www.theblock.co\/post\/159387\/voyager-document-says-ftx-alameda-proposal-has-misleading-or-outright-false-claims\" data-v-f87c67ca=\"\">squabbled<\/a> with Voyager after they <a href=\"https:\/\/www.theblock.co\/post\/159209\/ftx-alameda-propose-early-liquidity-plan-for-voyager-digital-customers\" data-v-f87c67ca=\"\">publicized their bid<\/a> for the platform. Voyager said the two related firms failed to respect the bid process, which calls for confidentiality, and sought to dispel any notion that FTX was a frontrunner early in the process, calling its offer a \"low-ball\" bid.","That initial plan would have given Voyager customers the opportunity to start a new account with FTX that would give them an opening balance related to their claim. But the terms of the now-accepted bid are not yet public. Voyager said in a statement that additional information about the timeline for customer access to crypto will be shared as it becomes available.","The proposal is subject to court approval processes, including a creditor vote. A hearing on the matter is slated for Oct. 19 at 4 p.m. EST.&nbsp;","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1.4 billion","content":"MONEY"},{"type":"Official Committee of Unsecured Creditors","content":"ORGANIZATION"},{"type":"4 p.m. EST.","content":"TIME"},{"type":"$1.3 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Voyager","content":"ORGANIZATION"},{"type":"July of this year","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$111 million","content":"MONEY"},{"type":"FTX US","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$650 million","content":"MONEY"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"Oct. 19","content":"DATE"},{"type":"Company","content":"ORGANIZATION"}],"hashtag":["FTX"],"authors":["Aislinn Keely","The Block"]}