{"summary":"LG Electronics, the Seoul-based television company, launched a new NFT platform with the help of the Hedera blockchain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/167757\/tv-maker-lg-electronics-launches-nft-platform-with-hedera","publishDate":"2022-09-04T22:30:13","id":4566,"type":null,"title":"TV maker LG Electronics launches NFT platform with Hedera","category":["NFTS"],"content":["LG Electronics, the Seoul-based television company, launched a new NFT platform with the help of the Hedera blockchain.","The company’s platform is called LG Art Lab. It will give customers a way to buy, sell and display digital art in the form of NFTs on their televisions, according to an announcement today.","LG is not the first large company to spy opportunity in the NFT space. Swiss watchmaker Tag Heuer in June <a href=\"https:\/\/www.theblock.co\/post\/152214\/tag-heuer-rolls-out-nft-feature-for-some-smartwatch-models\" data-v-f87c67ca=\"\">announced a new tool<\/a> that gave customers a way to display NFTs on the face of certain smartwatches. &nbsp;","LG Art Lab is available in the US on televisions running webOS 5.0 of later, per the announcement. It includes a feature that offers profiles of artists and previews their upcoming work, as well as a countdown to upcoming NFT “drops.” The platform’s marketplace provides a venue for trading pieces.","The Hedera network underpins the new platform, with transactions run through Wallypto, <a href=\"https:\/\/beincrypto.com\/lg-electronics-set-to-launch-digital-asset-wallet-called-wallypto\/\" data-v-f87c67ca=\"\">an LG-patented crypto wallet<\/a> for smartphones that is currently in beta testing.","Christian Hasker, CMO of Swirlds Labs, the Hedera developer, said in a statement that the announcement will bring NFTs “beyond being computer-based collectibles and toward becoming a piece of art displayed as any other artwork would be within the home of its owner.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"CMO","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"LG Electronics","content":"ORGANIZATION"},{"type":"Seoul","content":"LOCATION"},{"type":"Hedera","content":"LOCATION"},{"type":"LG","content":"ORGANIZATION"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}