{"summary":"South Korean authorities requested Interpol’s assistance in bringing back the Terraform Labs co-founder on Thursday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281050\/south-korea-requests-interpol-to-assist-with-do-kwons-extradition-reports","publishDate":"2024-03-07T05:14:08","id":4581,"type":null,"title":"South Korea requests Interpol to assist with Do Kwon’s extradition","category":["PEOPLE"],"content":["<span data-v-f87c67ca=\"\">The South Korean police agency has requested Interpol’s assistance in bringing back Terra co-founder Do Kwon, who was sought for multiple charges including securities fraud.<\/span>","<span data-v-f87c67ca=\"\">South Korea’s National Police Agency has requested Interpol’s assistance in bringing back Terraform Labs co-founder Kwon Do-hyeong in a written letter on Thursday, a police representative told The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The police agency sent the request via an electronic document to the Interpol’s General Secretariat, but has yet to hear back from Interpol, the police spokesperson said. South Korea’s Ministry of Justice is also separately requesting help from Interpol, local news agency Newsis reported.<\/span>","<span data-v-f87c67ca=\"\">Earlier this month, a Montenegrin court <\/span><a href=\"https:\/\/www.theblock.co\/post\/280635\/do-kwon-us-extradition-revoked\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">revoked Kwon’s extradition order<\/span><\/a><span data-v-f87c67ca=\"\"> to the U.S., after his defense attorneys filed an appeal, <\/span><a href=\"https:\/\/www.theblock.co\/post\/279240\/terraform-labs-do-kwon-to-miss-trial\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reportedly claiming<\/span><\/a><span data-v-f87c67ca=\"\"> that the decision was made on misinformation that the U.S. requested extradition ahead of South Korea.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The event of Do Kwon’s extradition to the U.S. being brought back for another court decision gave [us] the opportunity to again request assistance and attention,” the police spokesperson told The Block. “Since the Interpol, as an international law enforcement agency, maintains a cooperative relationship with its entity in Montenegro, we wanted to reiterate the fact that South Korea requested [Kwon’s] extradition first, ahead of the U.S.”<\/span>","<span data-v-f87c67ca=\"\">The police representative noted that the Korean agency has no direct influence over the extradition decision in Montenegro.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The former leader of Terraform Labs has been sought by U.S. and South Korean authorities for fraud charges stemming from the collapse of the Terra ecosystem in May 2022 — which wiped out some $40 billion of investor wealth in a few days.<\/span>","<span data-v-f87c67ca=\"\">Do Kwon was arrested in Montenegro last March, charged with using a fake passport in an attempt to leave the country, and was sentenced to four months in November.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On multiple occasions, Kwon has denied the accusations that he and Terraform Labs deliberately defrauded investors.<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">(Updated the piece with comments from the police and additional details throughout.)<\/span><\/i>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"May 2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"Kwon","content":"PERSON"},{"type":"Interpol’s General Secretariat","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Interpol","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"March","content":"DATE"},{"type":"Montenegro","content":"LOCATION"},{"type":"’s Ministry of Justice","content":"ORGANIZATION"},{"type":"Terra","content":"ORGANIZATION"},{"type":"National Police Agency","content":"ORGANIZATION"},{"type":"Newsis","content":"ORGANIZATION"}],"hashtag":["CRIME","DO KWON"],"authors":["Danny Park","The Block"]}