{"summary":"A critical security issue in Ledger ConnectKit library emerged today, reportedly affecting several decentralized applications.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267614\/ledger-connectkit-library-security-flaw-dapps-compromised","publishDate":"2023-12-14T08:31:38","id":4587,"type":null,"title":"Ledger ConnectKit library security issue affects multiple dapps","category":["SECURITY"],"content":["A critical Web3 security issue emerged today, reportedly affecting several decentralized applications. The issue was related to a software library from the hardware wallet provider Ledger that dapps relied on.","The incident allowed malicious code to be injected into numerous dapps on their front-ends, posing a significant risk to users and their assets. Consequently, front ends to multiple dapps could be vulnerable if used. Projects like Kyber and RevokeCash confirmed on X that they disabled their front-ends.","Security firm Blockaid described it as a “supply chain attack” on Ledger ConnectKit — wherein an attacker replaced the library software with malicious code to drain assets.","The issue may have emerged due to an alleged compromise of a specific content delivery network (CDN) that hosted the said software library, <a href=\"https:\/\/twitter.com\/matthewlilley\/status\/1735280275658006625?t=oHf46otX4Di1EPF3Xc_kDA\" data-v-f87c67ca=\"\">according to<\/a> Sushi’s chief technology officer Matthew Lilley. “LedgerHQ\/connect-kit loads JS [JavaScript] from a CDN, their CDN account has been compromised which is injecting malicious JS into multiple dApps,” Lilley said. He added that any dApp which makes use of LedgerHQ\/connect-kit was vulnerable.","Blockaid estimated that $150,000 had been lost in the first couple of hours of the incident. Later the stolen value of funds rose to over half a million dollars. Stablecoin issuer Tether blacklisted the hacker's address.","A software patch has been finalized in an update and may need to be adopted by dapps before conditions are safe. “We have identified and removed a malicious version of the Ledger Connect Kit. A genuine version is being pushed to replace the malicious file now,” Ledger said in a statement.","Meanwhile, Lilley and others have warned users to avoid interacting with any dapps until further notice.","MetaMask, the most widely used web3 wallet app <a href=\"https:\/\/twitter.com\/MetaMask\/status\/1735318141285085513\" data-v-f87c67ca=\"\">said<\/a> the incident affects all users, not just Ledger. It has deployed a fix for its app and asked users to update to the latest version.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"” Ledger","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"$150,000","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Lilley","content":"PERSON"},{"type":"Matthew Lilley","content":"PERSON"},{"type":"a million dollars","content":"MONEY"}],"hashtag":["DECENTRALIZED INFRASTRUCTURE","EXPLOITS","HACKS","WALLETS"],"authors":["Vishal Chawla","The Block"]}