{"summary":"Blockchain analysis firm Chainalysis just added support of ten ERC-20 tokens to its signature AML solutions, as cryptocurrency firms ramp up its","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/41844\/chainalysis-to-add-support-for-xrp-zcash-dash-and-seven-other-erc-20-tokens-including-dai-and-0x","publishDate":"2019-10-03T09:00:57","id":4588,"type":null,"title":"Chainalysis adds support for 10 ERC-20 tokens; support for XRP to be included","category":["SECURITY"],"content":["<span data-v-f87c67ca=\"\">Blockchain analysis firm Chainalysis just added support of ten ERC-20 tokens to its signature AML solutions, as cryptocurrency firms ramp up its compliance effort amidst regulatory uncertainty.<\/span>","<span data-v-f87c67ca=\"\">Announced on Thursday, the ten ERC-20 tokens include Maker, Dai, 0x, OmiseGo, Basic Attention Token, and others. Chainalysis will also provide on-demand services to add support tokens that it currently doesn’t cover. Over the next three months, the firm will expand its support to XRP, Doge, Ethereum Classic, and privacy coins such as Dash and ZCash (unshielded).&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Chainalysis co-founder and CSO Jonathan Levin told The Block that the addition is to meet heightened market demands and more hacks related to ERC-20 tokens.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“There clearly are a lot of experimentations and demand coming from the market, on what can be tokenized and traded, but at the same time… we also see that many of the recent exchange hacks that we have been tracking have been ERC-20 tokens stolen,” said Chainalysis co-founder and CSO Jonathan Levin.<\/span>","<span data-v-f87c67ca=\"\">Recently, cryptocurrency exchange OKEx Korea announced that it would delist five privacy coins, including Dash and Zcash. The announcement followed the issuance of FATF’s crypto guidelines in June, which requires exchanges to collect and transfer customer information during transactions.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Levin, as firms are trying to strengthen their AML effort, the ability to track activities of various ERC-20 tokens, which are becoming increasingly popular, is critical. Levin noted that there are over 200,000 ERC-20 tokens right now and “each one of those tokens represents a community around that token, a use case.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We feel that enabling those communities to come to Chainalysis and say that we want to monitor our tokens... is a way for the market to test out these use cases,” said Levin.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In April, Chainalysis released support for six ERC-20 tokens, including Binance Coin, GUSD, USDT, USDC, PAX, and TUSD. The firm's goal is to support 39 ERC-20 tokens by the end of the year, according to a company spokesperson.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Developing ERC-20 stablecoins tied to various financial assets is an important part of our strategy to bridge the gap between blockchain and the traditional financial markets,” said eToroX managing director Doron Rosenblum. “Chainalysis was able to quickly support this vision by developing the compliance technology we needed to safely and responsibly bring this strategy to life.”&nbsp;<\/span>","The blockchain security firm <a href=\"https:\/\/www.theblockcrypto.com\/daily\/11339\/chainalysis-scores-30-million-to-expand-into-u-k-with-new-research-and-development-lab\" data-v-f87c67ca=\"\">raised<\/a> a whopping $30 million Series B earlier this year, backed by Accel Partners and Benchmark. To date, the company has raised <a href=\"https:\/\/www.crunchbase.com\/organization\/chainalysis#section-overview\" data-v-f87c67ca=\"\">a total of<\/a> $53.6 million, according to Crunchbase. Its client portfolio spans across government agencies and crypto-native businesses.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Doron Rosenblum","content":"PERSON"},{"type":"Dai","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Korea","content":"LOCATION"},{"type":"20","content":"DATE"},{"type":"FATF","content":"ORGANIZATION"},{"type":"$30 million","content":"MONEY"},{"type":"Chainalysis","content":"PERSON"},{"type":"$53.6 million","content":"MONEY"},{"type":"Levin","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"Jonathan Levin","content":"PERSON"},{"type":"Accel Partners and Benchmark","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Ethereum Classic","content":"ORGANIZATION"}],"hashtag":[],"authors":["Celia Wan","The Block"]}