{"summary":"Shares in the crypto exchange soared on Thursday after it announced a deal with BlackRock to offer crypto to institutional investors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/161469\/coinbase-stock-pops-after-blackrock-announcement-temporarily-halts-due-to-volatility","publishDate":"2022-08-04T10:02:17","id":4589,"type":null,"title":"Coinbase stock pops after BlackRock announcement, temporarily halts due to volatility","category":["MARKETS"],"content":["Coinbase shares briefly hurtled past $100 on Thursday morning following an <a href=\"https:\/\/www.theblock.co\/post\/161450\/blackrock-to-offer-institutional-clients-access-to-crypto\" data-v-f87c67ca=\"\">announcement<\/a> that the firm will partner with BlackRock to offer institutional clients access to crypto.&nbsp;","Shares in the company were trading around $99 at the time of writing, after closing at $80.81 on Wednesday. Trading in COIN was halted shortly after the open having jumped as high as 35% minutes.&nbsp;","","","The price of COIN shares dropped back below $100 after trading resumed, trading up about 20% at $99","Matt Weller, global head of market research at forex.com, told The Block that investors are enthused by Coinbase’s partnership with BlackRock and its integration into the widely-used Aladdin platform.","Coinbase is set to work with BlackRock — the world's largest asset manager — to offer its institutional clients access to crypto. Clients using the asset manager's portfolio management software will soon be able to get direct access to crypto through the partnership. Clients of both companies will initially be able to trade bitcoin.&nbsp;","\"After years of hype, today’s announcement offers a ray of hope that institutional money actually *is* coming to crypto, and after today’s announcement, Coinbase is poised to be a beneficiary of that trend,\" he said.&nbsp;","Coinbase will announce its second quarter earnings next week on August 9.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$80.81","content":"MONEY"},{"type":"Matt Weller","content":"PERSON"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"August 9","content":"DATE"},{"type":"35%","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"$99","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"$100","content":"MONEY"},{"type":"second quarter","content":"DATE"}],"hashtag":["COINBASE"],"authors":["Adam Morgan McCarthy","The Block"]}