{"summary":"Flashbots co-founder Alex Obadia is departing the company. He&#x27;s also got a fresh warning.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235717\/flashbots-co-founder-warns-of-serious-challenges-beyond-mev-bots-in-departure-letter","publishDate":"2023-06-20T18:21:34","id":459,"type":null,"title":"Flashbots co-founder warns of challenges beyond MEV bots in farewell","category":["COMPANIES"],"content":["Alex Obadia, a <a href=\"https:\/\/alexobadia.com\/res\" data-v-f87c67ca=\"\">co-founder<\/a> of the Ethereum infrastructure service <a href=\"https:\/\/www.flashbots.net\/\" data-v-f87c67ca=\"\">Flashbots<\/a> formed to battle negative consequences of MEV extraction techniques on Ethereum, is departing the <a href=\"http:\/\/Maximal Extractable Value\" data-v-f87c67ca=\"\">Paradigm-backed<\/a> company. He used a farewell <a href=\"https:\/\/twitter.com\/ObadiaAlex\/status\/1671151059585097729\/photo\/2\" data-v-f87c67ca=\"\">letter<\/a> posted on Twitter to offer \"gratitude for the friendships built and lessons learned\" and also warned of \"serious challenges\" ahead.&nbsp;","\"The system we committed to protect is still vulnerable to centralization from phenomena such as cross-domain MEV and exclusive orderflow,\" he wrote in a <a href=\"https:\/\/twitter.com\/ObadiaAlex\/status\/1671151059585097729\/photo\/1\" data-v-f87c67ca=\"\">letter<\/a> posted to <a href=\"https:\/\/twitter.com\/ObadiaAlex\/status\/1671151059585097729\" data-v-f87c67ca=\"\">Twitter<\/a>. \"To top it off, as we've grown into an incumbent, we now also need to protect the system against ourselves, to avoid becoming the very Moloch we're fighting against.\"","Obadia said he was leaving the company for multiple reasons, \"some more personal than others.\"&nbsp;","\"What it boils down to is that I feel my vision and values will be better served somewhere else,\" he added. \"This is normal, and happens in every growing organization. So please understand that my departure is not a reflection of the potential I see in you all, but rather an acknowledgement that organizations, like people, need to grow and change.\"&nbsp;","Flashbots’ service proposes blocks for validators running the Ethereum blockchain, and the company earlier this year was looking to raise funds at a <a href=\"https:\/\/www.theblock.co\/post\/203637\/flashbots-fundraise-billion-dollar-valuation\" data-v-f87c67ca=\"\">billion-dollar<\/a> valuation. Its <a href=\"https:\/\/www.flashbots.net\/\" data-v-f87c67ca=\"\">website<\/a> says it was born out of the \"the existential crisis of MEV.\"","Maximal Extractable Value, which MEV refers to, is a technique that involves manipulating transaction sequencing to capitalize on certain types of trades.","\"We founded Flashbots to confront a looming crisis we saw on the horizon, standing up for a technology we believe in, and protecting values dear to us,\" Obadia said. \"In an industry often caught in the short term, the decision to invest in fundamental research may seem counterintuitive, but this is precisely our edge.\"","Obadia suggested he's open to related endeavors in the future.","\"Looking forward to the great things you'll be doing at Flashbots and to future collaborations,\" he <a href=\"https:\/\/twitter.com\/ObadiaAlex\/status\/1671167523109355521\" data-v-f87c67ca=\"\">replied<\/a> to a strategy lead at the company known as <a href=\"https:\/\/twitter.com\/hasufl\/status\/1671164804856451073\" data-v-f87c67ca=\"\">Hasu<\/a>.&nbsp;","(<em data-v-f87c67ca=\"\">Updates with response to comment from strategy lead in final paragraph; adds additional quotes throughout.<\/em>)","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alex Obadia","content":"PERSON"},{"type":"Paradigm","content":"LOCATION"},{"type":"Obadia","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Hasu","content":"PERSON"},{"type":"Maximal Extractable Value","content":"ORGANIZATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}