{"summary":"Galaxy Digital CEO Michael Novogratz says he thinks &quot;Operation Choke Point 2.0&quot; is real, telling a Miami crowd that &quot;we&#x27;re under assault.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/224138\/novogratz-operation-choke-point","publishDate":"2023-03-31T09:00:26","id":4592,"type":null,"title":"&#x27;Operation Choke Point&#x27; is real, Novogratz tells Miami crowd","category":["COMPANIES"],"content":["Galaxy Digital CEO <a href=\"https:\/\/www.theblock.co\/post\/223331\/galaxy-ditigal-novogratz-earnings-comments\" data-v-f87c67ca=\"\">Mike Novogratz<\/a> didn't mince words at a <a href=\"https:\/\/fii-institute.org\/conference\/priority-in-miami-usa\/\" data-v-f87c67ca=\"\">Thursday conference<\/a> in Miami hosted by the <a href=\"https:\/\/fii-institute.org\/\" data-v-f87c67ca=\"\">FII Institute<\/a>, where he told a crowd that the crypto industry was \"under assault\" by regulators in the U.S.","The Block's East Coast Managing Editor Nathan Crooks caught up with Novogratz after the event and asked about his thoughts on \"Operation Choke Point 2.0,\" a term being used by some in the industry to speculate about the possibility of a broader, coordinated crackdown.","<em data-v-f87c67ca=\"\">(The interview has been lightly edited for clarity.)<\/em>","<strong data-v-f87c67ca=\"\">The Block<\/strong>: You<em data-v-f87c67ca=\"\"> just finished telling the audience here that the crypto industry is \"under assault\" by regulators in the U.S. There's been a lot of talk in some spheres about an alleged&nbsp;\"<a href=\"https:\/\/www.cooperkirk.com\/wp-content\/uploads\/2023\/03\/Operation-Choke-Point-2.0.pdf\" data-v-f87c67ca=\"\">Operation Choke Point 2.0.<\/a>\" Do you think it's real?<\/em>","<strong data-v-f87c67ca=\"\">Mike Novogratz<\/strong>: Yes, 100%. I think it's real. Think about Signature Bank, how they were so quickly shut down. Now, listen, we weren't under the hood there. But when you look at Republic Bank and Signature Bank — Barney Frank, who's on their board, was like \"this is crazy, they were shutting it down.\" My friends in banking were like \"there's no reason that needed to be shut down.\" They could have done the same thing they did with Republic and the other banks, given them a lifeline. And so, that was because they're associated with crypto, and maybe associated with Trump. That's not the way our government is supposed to function. It just isn't.","And we see it all the time now, the constant regulation through enforcement. The cost of that to the innocent players, because every time there's an FTX, every single player in the ecosystem gets a subpoena for information about FTX. That costs a fortune. I look at our legal bills at Galaxy, and our audit bills, it's 4x what they would be at a normal company. That's a tax that Gensler and Co. are putting on our industry, trying to get the banks not to bank people. You know, that's real. We're smart enough, or lucky enough, to have a lot of banking sources, but lots of our portfolio companies we've been helping, and a lot of our peers even, to try to get banking ... people just don't want to bank crypto, and so you're back to small banks that people haven't heard of banking big institutions. It absolutely makes no sense. In the long run, the U.S. is going to lose. Hong Kong has got really progressive regulation, Abu Dhabi. So you're just seeing people move out of the U.S. The frustration is that it's not a big enough issue, that the broad political base cares.","<strong data-v-f87c67ca=\"\">TB<\/strong>: <em data-v-f87c67ca=\"\">We're here in Miami, at an international, <a href=\"https:\/\/fii-institute.org\/conference\/priority-in-miami-usa\/\" data-v-f87c67ca=\"\">Saudi-sponsored conference<\/a>. We heard a speech from Mayor Francis Suarez, who's been very pro-crypto in the past. Is a city like Miami, which has tried to position itself as a global hub, going to be restrained by the federal U.S. government, for example?&nbsp;<\/em>","<strong data-v-f87c67ca=\"\">Novogratz<\/strong>: The hope is that we have checks and balances in America, that we have a judiciary that for the most part is apolitical, not completely apolitical, for the most part. You're going to see, when you read the Coinbase Wells notice, I'd take my chances that they're going to win. When I read the Paxos Wells notice, I'd take my chances they're going to win. They might not. But the SEC doesn't have a real good case, and so I'm hoping that we have a firewall in our judiciary. The Republican House is very pro-crypto, just follow Tom Emmer. And so you're not going to get bad legislation. It's just this White House, and there's no one really to stop them right now because they've got the debt ceiling to worry about. They've got the banking crisis to worry about.","It's shocking. We're so worried about crypto. Bank of America's non-mark-to-market losses are bigger than the market cap of Bitcoin. Like we should be worried about other things, but you would think crypto is the only thing they worry about. You know, Gensler just asked for more money to have to go after the crypto bad actors. Like we've had AI exploding, we should be regulating AI and less on crypto.","<strong data-v-f87c67ca=\"\">TB<\/strong>: <em data-v-f87c67ca=\"\">Do you see this becoming an issue in the upcoming presidential election at all?<\/em>","<strong data-v-f87c67ca=\"\">Novogratz<\/strong>: I think it'll become an issue in the elections. What the Democrats learned, and then seemed to forgot after Sam Bankman-Fried, was that there are 50 million Americans that own crypto and like it a lot. Of that 50 million, I would bet you 15 million are single-issue voters. Like \"screw with my right to store my wealth how I want to, and I will fight you.\" And so pre-Sam, you saw a lot of Democrats coming around, and it was becoming bipartisan. And Sam made everyone look stupid. He made the industry look stupid. He made Democrats look stupid. Ironically, he almost gave as much to Republicans, quietly, but that's not the story. The story is that he was the Democrat's biggest donor. Politicians are politicians, and so they're all running for the hills.","<strong data-v-f87c67ca=\"\">TB<\/strong>: <em data-v-f87c67ca=\"\">We heard former Treasury Secretary Steven Mnuchin speak just a bit earlier about the U.S. dollar. Do you think a lot of the current administration's actions are coming because they're worried about the survival of the U.S. dollar (as a global reserve currency)?<\/em>","<strong data-v-f87c67ca=\"\">Novogratz<\/strong>: There's a little bit of that. Broadly, it just doesn't register for enough people to care. And so Elizabeth Warren, for some bizarre reason, hates crypto, and she's got a lot of sway in the financial side of the Biden administration. But for Yellen and Lael Brainard to be anti-crypto, that cuts something deeper.","When Balaji [Srinivasan] says we're gonna go to a million (the price of bitcoin), I'm like, \"Oh, God, don't, don't get what you wish for.\"&nbsp; If we went to a million, that would be a loss of civil society in America. Like I don't want us to go to a million real fast. I'd like us to go to a million over 5 or 10 years. Bitcoin is a report card on the stewardship of our finances, here and abroad. I always cheer for the U.S. to have good stewardship. It's a really hard hand to play right now with the amount of debt we have, debt to GDP at 125%, with interest rates are 5%. But the math doesn't work. And so we'll inflate it away. And that's why bitcoin is going to go up. But when you talk about hyperinflation, that scares policymakers, and then they see bitcoin as a threat. They don't see gold as a threat, but it's the same damn thing. And so I think the community needs to be a little careful about the hyperbole that everyone speaks with, because it definitely seems to be part of this anti-crypto.","<strong data-v-f87c67ca=\"\">TB<\/strong>: <em data-v-f87c67ca=\"\">Speaking of the price of bitcoin, where is it going?<\/em>","<strong data-v-f87c67ca=\"\">Novogratz<\/strong>: These are big weekly closes, monthly closes, quarterly closes. If you just look on the charts, now we're at $25,000 to $40,000 range, heading higher. So like, we're at roughly $29,000 as we speak. $35,000 is probably the next target. Are we going to go there in a straight line? Probably not. You're going to need to see the economy slow. We're going to have a credit crunch. The credit crunch isn't gonna happen overnight. But if you think regional banks, which had credit growth of 15%, if that shrinks to 5%, that's 2% of GDP. And so the Fed will be talking rate cuts in the fall. And once that happens, that's that next leg for crypto.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"fall","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Saudi","content":"LOCATION"},{"type":"Trump","content":"ORGANIZATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"2%","content":"PERCENT"},{"type":"Miami","content":"LOCATION"},{"type":"Co.","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Bank of America","content":"ORGANIZATION"},{"type":"Lael Brainard","content":"PERSON"},{"type":"White House","content":"ORGANIZATION"},{"type":"Novogratz","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"Gensler","content":"PERSON"},{"type":"Republican House","content":"ORGANIZATION"},{"type":"Francis Suarez","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Sam","content":"PERSON"},{"type":"15%","content":"PERCENT"},{"type":"Balaji [Srinivasan]","content":"ORGANIZATION"},{"type":"Mike Novogratz","content":"PERSON"},{"type":"$25,000","content":"MONEY"},{"type":"Republic Bank","content":"ORGANIZATION"},{"type":"U.S","content":"LOCATION"},{"type":"Steven Mnuchin","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Yellen","content":"PERSON"},{"type":"$29,000","content":"MONEY"},{"type":"Elizabeth Warren","content":"PERSON"},{"type":"$35,000","content":"MONEY"},{"type":"East Coast Managing Editor Nathan Crooks","content":"ORGANIZATION"},{"type":"Tom Emmer","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"America","content":"LOCATION"},{"type":"125%","content":"PERCENT"},{"type":"Signature Bank","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"FII Institute","content":"ORGANIZATION"},{"type":"Galaxy","content":"LOCATION"},{"type":"Abu Dhabi","content":"PERSON"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Biden","content":"PERSON"},{"type":"$40,000","content":"MONEY"},{"type":"Signature Bank — Barney Frank","content":"ORGANIZATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}