{"summary":"The People Power Party may pledge to eliminate the ban on spot bitcoin ETFs, institutional investment in crypto and IEOs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277996\/south-koreas-ruling-party-spot-bitcoin-etf","publishDate":"2024-02-19T05:40:50","id":4595,"type":null,"title":"South Korea’s ruling party considers allowing spot bitcoin ETFs in election pledges: report","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">South Korea’s ruling People Power Party is looking into ways to allow spot bitcoin exchange-traded funds (ETF) as part of its campaign promises for the upcoming general election in April, according to a local media report on Monday.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Aside from spot bitcoin ETFs, the right-wing party said it will review legislative measures to approve other cryptocurrency-related investment products that have been greenlit in the U.S., South Korean news agency <\/span><a href=\"https:\/\/www.news1.kr\/articles\/5325282\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">News1<\/span><\/a><span data-v-f87c67ca=\"\"> reported. Last month, the country’s financial regulator <\/span><a href=\"https:\/\/www.theblock.co\/post\/272208\/south-koreas-samsung-securities-mirae-asset-suspend-foreign-spot-bitcoin-etfs-amid-regulatory-warning\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reiterated its ban<\/span><\/a><span data-v-f87c67ca=\"\"> restricting financial institutions from launching any kind of cryptocurrency ETFs.<\/span>","<span data-v-f87c67ca=\"\">The ruling party is also planning to consider gradually lifting the country’s ban on institutional investment in crypto and initial exchange offerings (IEO). In the case of institutional crypto investment, the party is exploring the possibility of allowing investment firms to buy crypto before permitting banks or insurance companies, according to the report. This approach takes into account the need for banks and insurance firms to prioritize the protection of user funds.<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, the party has decided to promise the creation of a \"Digital Asset Promotion Committee,\" which would be given sufficient authority to propose laws and impose sanctions related to digital assets, according to the report.<\/span>","<span data-v-f87c67ca=\"\">Earlier today, local news outlet Herald Business Daily reported that the People Power Party might promise to <\/span><a href=\"https:\/\/www.theblock.co\/post\/277963\/south-koreas-ruling-party-mulls-crypto-tax-delay\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">further push back the taxation on crypto gains<\/span><\/a><span data-v-f87c67ca=\"\"> from the start of 2025 to 2027.<\/span>","<span data-v-f87c67ca=\"\">People Power Party’s election promises are aimed at gaining the votes of South Korean citizens in their 20s and 30s, News1 reported. Over 80% of cryptocurrency holders in South Korea were in that age bracket as of September 2023, according to the National Tax Agency’s <\/span><a href=\"https:\/\/d.nts.go.kr\/chungju\/na\/ntt\/selectNttInfo.do?nttSn=1327158&amp;mi=4139\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">data<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2025","content":"DATE"},{"type":"South Korea","content":"LOCATION"},{"type":"Herald Business Daily","content":"ORGANIZATION"},{"type":"2027","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"South Korean","content":"LOCATION"},{"type":"80%","content":"PERCENT"},{"type":"National Tax Agency","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Digital Asset Promotion Committee","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"September 2023","content":"DATE"},{"type":"People Power Party","content":"ORGANIZATION"},{"type":"April","content":"DATE"}],"hashtag":["ASIAN PARLIAMENTS","ASIAN REGULATION","SPOT BITCOIN ETF"],"authors":["Danny Park","The Block"]}