{"summary":"Warren also spoke with two leaders in the U.S. armed forces, who agreed that hampering crypto crime bolsters international security. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284469\/elizabeth-warren-crypto-is-helping-rogue-states-terrorists-and-criminal-organizations-on-a-scale-we-have-never-seen-before","publishDate":"2024-03-25T12:44:10","id":46,"type":null,"title":"Elizabeth Warren: Crypto is helping rogue states, terrorists and criminal organizations on a scale &#x27;we have never seen before&#x27;","category":["POLICY"],"content":["Sen. Elizabeth Warren, D-Mass., warned of two harmful uses of crypto in a Senate Committee on Armed Services hearing.","Warren <a href=\"https:\/\/www.warren.senate.gov\/newsroom\/press-releases\/icymi-at-hearing-warren-warns-of-threats-posed-by-north-koreas-crypto-funded-weapons-program-and-pig-butchering-scams-to-national-security\" data-v-f87c67ca=\"\">called out<\/a> the use of cryptocurrency in terrorism financing and 'pig butchering' scams — where scammers gain the trust of a victim, convince the victim to give them large amounts of money and then run off with it.","Warren held the discussion with two United States armed forces leaders: Admiral John C. Aquilino of the U.S. Indo-Pacific Command and General Paul J. LaCamera, who commands United States Forces Korea.&nbsp;","According to LaCamera, pig butchering involving crypto affected more than 40,000 American victims and caused the lost of $3.5 billion in 2023. Both armed forces leaders agreed that hampering criminal attempts to steal and launder crypto funds bolsters international security.&nbsp;&nbsp;","\"Crypto is the way this stuff is financed,\" <a href=\"https:\/\/www.theblock.co\/post\/275668\/elizabeth-warren-renews-criticism-of-illicit-finance-in-crypto-amid-push-for-new-legislation\" data-v-f87c67ca=\"\">Warren<\/a> said in the March 21 hearing. \"And it's helping rogue states. It's helping terrorists. It's helping criminal organizations fund their operations on a scale like we have never seen before.\" The senator added that&nbsp;her bipartisan bill would \"put a stop to it.\"","Warren's <a href=\"https:\/\/www.theblock.co\/post\/263585\/sen-elizabeth-warren-points-to-dangers-of-crypto-scams-targeting-older-investors-in-latest-call-to-pass-her-legislation\" data-v-f87c67ca=\"\">bill<\/a>, called the Digital Asset Anti-Money Laundering Act, aims to stop crypto crime by beefing up U.S. financial regulation of cryptocurrency and expanding know-your-customer protocols, among other requirements.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Senate Committee on Armed Services","content":"ORGANIZATION"},{"type":"Mass.","content":"LOCATION"},{"type":"John C. Aquilino","content":"PERSON"},{"type":"United States Forces Korea","content":"LOCATION"},{"type":"Warren","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"LaCamera","content":"ORGANIZATION"},{"type":"Crypto","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"March 21","content":"DATE"},{"type":"Pacific Command","content":"ORGANIZATION"},{"type":"Paul J. LaCamera","content":"PERSON"},{"type":"$3.5 billion","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"Elizabeth Warren","content":"PERSON"}],"hashtag":["ELIZABETH WARREN"],"authors":["MK Manoylov","The Block"]}