{"summary":"The sale marks a strategic shift for the firm — focusing on expanding and innovating within the metaverse sector.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/268116\/metaverse-improbable-gaming-unit-sale","publishDate":"2023-12-18T09:20:52","id":4602,"type":null,"title":"Metaverse firm Improbable sells gaming unit for almost $100 million","category":["DEALS"],"content":["Improbable, a metaverse startup backed by SoftBank and Andreessen Horowitz (a16z), has sold its gaming services subsidiary, MPG, to Irish video game company Keywords Studios for nearly $100 million.","Improbable sold MPG to Keywords for £76.5 million ($96.8 million) — a significant return on investment on the company it acquired for £30 million ($38 million) in 2019, according to its <a href=\"https:\/\/www.improbable.io\/news\/improbable-metaverse-vision-delivers-a-strong-2023\" data-v-f87c67ca=\"\">annual statement<\/a> published today. MPG has 360 staff in 34 countries with clients including Activision Blizzard, Bethesda and Epic.","The sale represents the first exit for the firm’s venture arm and is part of Improbable’s divestment of non-core activities. The firm will now focus on scaling up its metaverse ambitions from web2-based projects <a href=\"https:\/\/www.improbable.io\/news\/improbable-builds-major-league-baseballs-new-virtual-ballpark-that-launches-during-the-mlb-all-star-celebrity-softball-game-presented-by-corona\" data-v-f87c67ca=\"\">working with sports franchises<\/a> to web3 community initiatives with BoredElon, Forgotten Runes and <a href=\"https:\/\/www.theblock.co\/post\/157741\/how-online-gaming-firm-improbable-is-helping-yuga-labs-build-its-metaverse\" data-v-f87c67ca=\"\">Yuga Labs<\/a>’ highly anticipated Otherside metaverse platform.&nbsp;","In June, Improbable launched its distributed computing platform, M2 Network, and MML Stack, which are designed to support an ecosystem of interoperable metaverses. The company also launched The Metaverse Society in May — a specialized think tank to explore the societal and economic impact of the metaverse.","Looking ahead, Improbable expects continued metaverse development in the web2 and web3 worlds as the lines between them blur and consolidation ensues, with access to capital continuing to be more selective. The company said the popularity of VR headsets would fuel further growth in spatial computing while gaming companies continue to integrate new experiences and web3 games gain traction in their portfolios.","“The metaverse is poised for growth in 2024, fueled by the convergence of gaming, VR\/XR and web3 technologies,” Improbable founder and CEO Herman Narula said. “Headsets like Apple's Vision Pro and the success of Meta Quest 3 will further ignite demand for immersive metaverse experiences. Gaming companies will integrate metaversal elements into their offerings, creating new brand activation opportunities.”","“Consolidation in the gaming and web3 sectors will lead to a stronger, more innovative and more resilient startup ecosystem, with companies pooling resources and expertise to develop metaverse applications,” Narula added.","In October, Narula told The Block that Improbable’s <a href=\"https:\/\/www.theblock.co\/post\/254870\/improbables-pivot-to-metaverse-experiences-is-paying-off-says-ceo-narula\" data-v-f87c67ca=\"\">pivot<\/a> to metaverse experiences had paid off, enabling the company to cut losses considerably last year.","Improbable previously <a href=\"https:\/\/www.theblock.co\/linked\/141104\/improbable-raises-150-million-to-build-an-interoperable-metaverse-network\" data-v-f87c67ca=\"\">raised $150 million<\/a> to build its interoperable metaverse network in April 2022.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"MML Stack","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"April 2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"SoftBank","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"$38 million","content":"MONEY"},{"type":"Bethesda","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"Activision Blizzard","content":"ORGANIZATION"},{"type":"Narula","content":"PERSON"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Herman Narula","content":"PERSON"},{"type":"Apple","content":"ORGANIZATION"},{"type":"$96.8 million","content":"MONEY"},{"type":"Metaverse Society","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Forgotten Runes","content":"ORGANIZATION"},{"type":"$150 million","content":"MONEY"}],"hashtag":["AR","GAME DEVELOPERS","HEADSETS","OTHERSIDE","VR"],"authors":["James Hunt","The Block"]}