{"summary":"Immutable&#x27;s Gods Unchained is looking to follow other high-profile crypto games with a mobile launch soon on Apple and Android.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232038\/crypto-gods-unchained-eyes-2023-mobile-gaming-launch-apple-android","publishDate":"2023-05-24T15:43:33","id":4606,"type":null,"title":"Apple, Android could get mobile version of web3 game Gods Unchained","category":["GAMING"],"content":["<span data-v-f87c67ca=\"\">Gods Unchained is the top web3 title in the world when ranked with blockchain-enabled games by trading volume of digital assets. It's now preparing for a release on both Apple and Android mobile devices later this year that could result in exponential growth.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The mobile dev team has already begun working in the background and we’re on track to bring the game to all (Android and iOS) mobile devices with a soft launch later this year,” game makers said in a <a href=\"https:\/\/blog.godsunchained.com\/2023\/05\/23\/gods-unchained-new-roadmap\/\" data-v-f87c67ca=\"\">blog post<\/a> on Tuesday.<\/span>","<span data-v-f87c67ca=\"\">Created by Immutable and launched in 2018, Gods Unchained is a blockchain based digital-trading card game akin to the immensely popular physical trading-card game Hearthstone, according to the title’s game director Chris Clay, who previously oversaw the development team for Magic: The Gathering Arena.<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/gaming\/non-ethereum-gaming-nft-trade-volume\/embed\" title=\"Non-Ethereum Gaming NFT Trade Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<span data-v-f87c67ca=\"\">Penetrating the mobile gaming market has become paramount to blockchain gaming companies and seen as the clearest path to onboarding enough gamers to make the buying and selling of in-app digital assets (NFTs) a mainstream consumer habit.<\/span>","“Getting a good slice of the pie on mobile, even though it’s highly competitive, the pie is really, really big,” said executive producer of Gods Unchained Daniel Paez, who previously worked for traditional gaming powerhouses like Activision and Blizzard Entertainment. <span data-v-f87c67ca=\"\">“And it’s a different kind of player [compared to PC and console gaming]. You have a wider range of players you can target.”<\/span>","<span data-v-f87c67ca=\"\">Last year was monumental for crypto gaming companies, as venture capitalists poured billions of dollars into blockchain-powered games as they hoped to hit the jackpot by backing the crypto version of a blockbuster mobile video game like Pokémon GO or Clash of Clans. Combined, investors put more than $5 billion into blockchain-based games, gaming studios, metaverse applications and sports betting related apps, according to The Block Research.<\/span>","<span data-v-f87c67ca=\"\">In 2023, crypto-game developers are attempting to rise to that challenge, and getting their titles into the hands of billions of mobile gamers all around the world will be pivotal.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">There are considerably more Android users playing mobile games, but Apple’s often affluent customer base is an attractive and lucrative segment of the market that developers prioritize. Being allowed on Apple’s App Store has historically been tough, although <a href=\"https:\/\/www.theblock.co\/post\/231646\/apples-crypto-policy-softens-as-stepn-offers-in-app-digital-asset-trading\" data-v-f87c67ca=\"\">recent news<\/a> suggests the company is easing restrictions.<\/span>","<span data-v-f87c67ca=\"\">Gamefied web3 apps like Axie Infinity and Stepn both recently announced they’d finally gained Apple’s authorization to list the titles on the tech giant’s App Store. For now, Axie Infinity is only available on Apple iOS devices in select countries, but it hopes to complete its global launch soon.<\/span>","<span data-v-f87c67ca=\"\">Another game, Mythical Games’ football title NFL Rivals, also <a href=\"https:\/\/www.theblock.co\/post\/228234\/a16z-mythical-games-nfl-video-game\" data-v-f87c67ca=\"\">recently launched<\/a> on both Android and Apple devices.<\/span>","<span data-v-f87c67ca=\"\">“There is no written playbook to get on mobile,” said Paez, who added that while dealing with Android is easier, Apple has become “a lot more forthright in terms of their policies.”<\/span>","<span data-v-f87c67ca=\"\">Gods Unchained’s Clay said he’s looking forward to a new, jargon-free, era in crypto gaming where gamers don’t think twice about the fact they are trading NFTs or what blockchain their favorite title is on. He also said that after last year’s tumult, which helped separate some of the wheat from the chaff, 2023 is all about eliminating the obstacles keeping blockchain gaming from going mainstream.<\/span>","<span data-v-f87c67ca=\"\">Gamers won’t even care about the blockchain elements a game possesses if they are “solving problems they have in the games they’re playing that let them progress in the ways that they want, look the way they want, play they want, without the immense friction that exists,” said Clay.<\/span>","<span data-v-f87c67ca=\"\">The need for digital wallets, or not being able to easily access a game’s marketplace to buy and sell assets — as is the case with Axie Infinity and NFL Rivals' iOS versions — can make the gaming experience cumbersome.<\/span>","<span data-v-f87c67ca=\"\">“If there is a general term for this current era, it’s friction,” said Clay. “We need to solve the friction if we’re really going to take blockchain gaming to that next step. The need for a great game is always there, but the friction is the challenge.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Axie Infinity","content":"ORGANIZATION"},{"type":"Chris Clay","content":"PERSON"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Daniel Paez","content":"PERSON"},{"type":"$5 billion","content":"MONEY"},{"type":"Gods Unchained","content":"LOCATION"},{"type":"2018","content":"DATE"},{"type":"Activision","content":"ORGANIZATION"},{"type":"Paez","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Blizzard Entertainment","content":"ORGANIZATION"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Clay","content":"ORGANIZATION"},{"type":"NFL","content":"ORGANIZATION"}],"hashtag":["CRYPTO"],"authors":["RT Watson","The Block"]}