{"summary":"The stewards will handle the operations of sub-groups within the ENS DAO for a six-month period starting in January 2023.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/194045\/ens-dao-voting-to-elect-stewards-to-helm-three-working-groups","publishDate":"2022-12-12T09:56:16","id":4619,"type":null,"title":"ENS DAO voting to elect stewards to helm three working groups","category":["CRYPTO ECOSYSTEMS"],"content":["Members of ENS DAO, the decentralized community for the Ethereum Name Service Project, are currently voting to elect people who will lead smaller groups within the DAO from next year.","The <a href=\"https:\/\/www.theblock.co\/linked\/122925\/ethereum-name-service-announces-governance-token-plan\" data-v-f87c67ca=\"\">ENS DAO<\/a> vote is to select stewards for three working groups. In the ENS community, working groups are sub-groups of the DAO that handle specific functions. These smaller groups have stewards, members chosen by the community, to make decisions for the DAO without having to involve the larger community. This type of architecture helps to streamline the management of the DAO along core areas, the ENS documentation <a href=\"https:\/\/docs.ens.domains\/v\/governance\/governance-proposals\/term-0\/ep4-social-proposal-creation-of-foundational-working-groups-and-working-group-rules\" data-v-f87c67ca=\"\">states<\/a>.","These groups are the meta-governance, ENS ecosystem, and public goods working groups. The meta-governance working group is responsible for providing oversight on DAO governance matters, while the ENS ecosystem working group focuses on supporting users and organizations associated with the project. The public goods working group specializes in funding projects within the ENS and broader web3 ecosystem.","The current vote is to elect three stewards for each of the three working groups. DAO members vote by selecting their preferred candidates from the pool of people who put themselves up for election. Once elected, these stewards will have a six-month term beginning from Jan. 1, 2023. The voting period will end on Dec. 15, according to details on the ENS DAO Snapshot voting <a href=\"https:\/\/snapshot.org\/#\/ens.eth\" data-v-f87c67ca=\"\">page<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jan. 1, 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Ethereum Name Service Project","content":"ORGANIZATION"},{"type":"Dec. 15","content":"DATE"}],"hashtag":["DAOS","GOVERNANCE VOTES"],"authors":["Osato Avan-Nomayo","The Block"]}