{"summary":"Ethereum Layer 2 developer Taiko announced a $15 million Series A funding round as it prepares for the mainnet launch.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280268\/ethereum-layer-2-taiko-funding-mainnet","publishDate":"2024-03-02T11:00:03","id":4622,"type":null,"title":"Ethereum Layer 2 developer Taiko announces $15 million Series A round ahead of mainnet launch","category":["DEALS"],"content":["<span data-v-f87c67ca=\"\">Taiko, a blockchain project focused on scaling <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.86%\n    <\/span><\/a> <!----><\/span><\/span>, has announced a $15 million Series A funding round as it prepares for its mainnet launch.<\/span>","Lightspeed Faction, Hashed, Generative Ventures and Token Bay Capital co-led the funding round, Taiko said Saturday. Other investors in the round included Wintermute Ventures, Flow Traders, Amber Group, OKX Ventures and GSR.","It is unclear whether the round has fully closed; the announcement mentions \"the close of commitments\" and includes a note that says \"certain investments remain subject to regulatory approval.\" Taiko did not respond to The Block's multiple requests for comment.","The Series A announcement comes around nine months after the project <a href=\"https:\/\/www.theblock.co\/post\/233727\/taiko-raise-zkevm\" data-v-f87c67ca=\"\">disclosed<\/a> two funding rounds worth $22 million last June. It is unclear when Taiko began raising money for the latest round and whether it used an equity, token or mix structure. Co-founder and chief operating officer Terence Lam declined to comment on the timeline, structure and valuation but said all three rounds have the same structure.","Taiko launched its sixth testnet last month and is preparing to launch its mainnet in the coming months.","Taiko is a Layer 2 scaling startup that aims to make Ethereum cheaper while maintaining its core properties, such as being censorship-resistant, permissionless and secure. It is building a \"Type 1\" ZK-EVM — an Ethereum Virtual Machine-compatible ZK-rollup that supports zero-knowledge proof computation.","\"Type 1 ZK-EVMs strive to be fully and uncompromisingly Ethereum-equivalent. They do not change any part of the Ethereum system to make it easier to generate proofs,\" Ethereum co-founder Vitalik Buterin said in 2022. \"Type 1 ZK-EVMs are what we ultimately need to make the Ethereum Layer 1 itself more scalable.\"","Under development since 2022, Taiko <a href=\"https:\/\/www.theblock.co\/post\/272585\/taiko-final-testnet-launch\" data-v-f87c67ca=\"\">launched<\/a> its sixth testnet called Katla in January. The project claims to have seen more than 1.1 million wallet addresses and over 13 million total transactions to date on Katla.","Katla used Taiko's \"based contestable rollup\" design, a multi-proof rollup architecture that features a contestation mechanism and based sequencing, the project said.","\"In the future, Taiko will develop the based booster rollup, a design that tackles the liquidity fragmentation issue by allowing developers to deploy on Ethereum and scale natively across all Layer 2s,\" it added.","Taiko had planned to launch its mainnet by the first quarter of this year. When asked if that plan is intact, Lam said: \"We definitely need to upgrade our Katla testnet to enable support for EIP-4844 and perform one more cycle of stress test and security audit for the mainnet.\"","\"The current outlook for completion of that is before the end of Q2,\" he added.","There are currently around 40 people working for Taiko, and the project looks to grow its team by hiring across functions, including engineering, community and ecosystem growth, Lam said.","Taiko also plans to set up an ecosystem investment fund with its investors, the amount for which is yet to be finalized, Lam added. In December, Taiko announced an allocation of about $30 million for its second round of the grants program.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Generative Ventures","content":"ORGANIZATION"},{"type":"GSR","content":"ORGANIZATION"},{"type":"Amber Group","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"OKX Ventures","content":"ORGANIZATION"},{"type":"$22 million","content":"MONEY"},{"type":"Lam","content":"PERSON"},{"type":"Wintermute Ventures","content":"ORGANIZATION"},{"type":"Terence Lam","content":"PERSON"},{"type":"Hashed","content":"LOCATION"},{"type":"Saturday","content":"DATE"},{"type":"4844","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Taiko","content":"ORGANIZATION"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Flow Traders","content":"ORGANIZATION"},{"type":"$30 million","content":"MONEY"},{"type":"first quarter","content":"DATE"},{"type":"June","content":"DATE"},{"type":"-0.86%","content":"PERCENT"},{"type":"$15 million","content":"MONEY"}],"hashtag":["CRYPTO","DECENTRALIZED INFRASTRUCTURE","ETHEREUM","SERIES A","ZKEVM"],"authors":["Yogita Khatri","The Block"]}