{"summary":"Liquid staking and StakeFi economy are making big strides towards the future of Web3. As DeFi dapp ecosystems utility grows, crypto lovers want to use their coins for DeFi applications, yet many of them don’t since they don’t want to miss out on the lucrative staking rewards","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157784\/as-stake-fi-economy-grows-bifrost-sees-over-97k-4-6m-ksm-liquid-derivatives-minted","publishDate":"2022-07-17T07:35:24","id":4626,"type":null,"title":"As Stake-Fi economy grows Bifrost sees over 97k ($4.6m) KSM liquid derivatives minted","category":["SPONSORED"],"content":["<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Liquid staking and StakeFi economy are making big strides towards the future of Web3. As DeFi dapp ecosystems utility grows, crypto lovers want to use their coins for DeFi applications, yet many of them don’t since they don’t want to miss out on the lucrative staking rewards. As the conflict between DeFi and Staking arises, solutions emerge. Naturally, StakeFi is becoming more and more popular - it’s a sort of have your cake and eat it mechanism. So what has been going on in the StakeFi sector recently and why are we only finding about Bifrost now?<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Seeing over 97,000 of KSM ($4.6m) liquid derivatives minted since the launch of Bifrost’s Staking Liquidity Protocol (SLP), Bifrost is growing exponentially, and looking to be an important cross chain liquidity staking hub within DeFi. Data gathered between May and June earlier this year showed that among other liquid staking solutions, Bifrost had the highest increase in the amount of liquid KSM derivatives minted. And the reason crypto holders are turning to Bifrost is simple: Bifrost creates competitive advantage and differences on the protocol level.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","","","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Built on Substrate, Bifrost holds the advantage to upgrade functionalities effectively and efficiently in comparison to other smart contract liquid staking solutions, with additional flexibility and consistency on product updates and rapid incorporation of user feedback. One such special functionality that stems from the protocol’s flexibility is the unbonding time. For vKSM (KSM liquid staking derivative), Bifrost allows a 0-7 days redemption period, rather than fixed 7 days, and even supports cancel redemption, which many crypto holders might find especially appealing.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<b data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\">Cross chain staking<\/span><\/b><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">If 30% APY on staking and the quickest unbonding time on the market aren’t enough, Bifrost offers something else, which is the reason why early StakeFi adopters and fierce dapp users are choosing Bifrost. <\/span><b data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\">The cross-chain interoperability of liquid staking is one of the main factors driving the utility for liquid derivatives and amplifying their use cases within numerous DeFi scenarios.<\/span><\/b><span data-contrast=\"auto\" data-v-f87c67ca=\"\"> Working as both Kusama and Polkadot parachains and leveraging the XCM Cross Chain Messaging functionality to build use cases and leverage utility, Bifrost has the potential to launch liquid staking not only on Polkadot and Kusama but also on their parachains. With vKSM (KSM liquid derivative) already live, vDOT and other parachain liquid derivatives along the way of Bifrost’s roadmap as well as plans to bridge to other PoS chains such as Ethereum 2.0, Cosmos, and many more.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","","","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Bifrost staking derivatives have a unified interface, a common redemption method and an interest calculation approach, forged by the same set of agreements. By building these derivatives on XCM, each different derivative will hold the potential to be traded, while derivatives will be additionally able to generate loans to one another. There will be a potential for liquidity to be shared amongst all liquid derivatives.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">StakeFi economy has much growth potential but it can be realized only with Web3 making the cross-chain&nbsp; future possible. If we believe in a cross-chain future, we need derivatives that will help build the three key pillars for StakeFi: standardization, security, and liquidity. Bifrost is already built on this decentralized foundation. In the cross-chain StakeFI future, users should not be forced to choose and stick to one or a couple protocols and treat them as a complete ecosystem. If crypto is to see mass adoption, we need a unified cross chain DeFi and StakeFi solutions. With their cross-chain StakeFi model, Bifrost is building a truly decentralized future of the unified, shared liquidity ecosystem. Through the combination of <\/span><b data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\">security<\/span><\/b><span data-contrast=\"auto\" data-v-f87c67ca=\"\">, <\/span><b data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\">liquidity,<\/span><\/b><span data-contrast=\"auto\" data-v-f87c67ca=\"\"> and <\/span><b data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\">high standardization<\/span><\/b><span data-contrast=\"auto\" data-v-f87c67ca=\"\"> of derivatives, Bifrost will ensure growth and mass cross-chain staking adoption.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","&nbsp;","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Bifrost <\/i><i data-v-f87c67ca=\"\">and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kusama","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"KSM","content":"LOCATION"},{"type":"$4.6","content":"MONEY"},{"type":"June earlier this year","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"Cosmos","content":"LOCATION"},{"type":"XCM Cross Chain Messaging","content":"ORGANIZATION"},{"type":"Bifrost","content":"ORGANIZATION"},{"type":"Bifrost’s Staking Liquidity Protocol (SLP","content":"ORGANIZATION"},{"type":"Bifrost","content":"LOCATION"},{"type":"Bifrost","content":"PERSON"}],"hashtag":[],"authors":["Sponsored","The Block"]}