{"summary":"A new governance vote has passed that invalidates yesterday&#x27;s move, with 99% of the votes supporting the new decision.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/153011\/new-solend-vote-invalidates-governance-decision-to-take-over-whale-account","publishDate":"2022-06-20T04:34:23","id":4629,"type":null,"title":"New Solend vote invalidates governance decision to take over whale account","category":["DEFI"],"content":["<span data-v-f87c67ca=\"\">Solend, a lending and borrowing protocol on Solana, has reversed yesterday's controversial DAO decision to take control of its largest user account. A<\/span>&nbsp;<a href=\"https:\/\/realms.today\/dao\/7sf3tcWm58vhtkJMwuw2P3T6UBX7UE5VKxPMnXJUZ1Hn\/proposal\/3geE5P3D7VJRaNNDVfZciGsXgwGiao1hSNpRM6jWNa5A\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">new governance vote<\/span><\/a><span data-v-f87c67ca=\"\"> has passed that invalidates yesterday's move, with 99% of the votes supporting the new decision.<\/span>","<span data-v-f87c67ca=\"\">This all started when, on Sunday, the Solend team put up a <a href=\"https:\/\/realms.today\/dao\/SLND\/proposal\/HuaL6cDtuNtfnJgvwMnYiZDHVCoLAuDtVFgJD8kYChJ4\" data-v-f87c67ca=\"\">governance vote<\/a> asking to take over a large user loan in order to prevent a on-chain liquidation event. <\/span>","<span data-v-f87c67ca=\"\">The issue was that an unknown user held a $108 million stablecoin loan collateralized by 5.7 million Solana (SOL) tokens ($170 million) on Solend. <\/span><span data-v-f87c67ca=\"\">The proposal to “mitigate risk from the whale” noted that the user in question had 95% of the SOL deposits in Solend's main pool. <\/span>","<span data-v-f87c67ca=\"\">The main problem was that if the price of SOL dropped to $22.30, the whale’s account would be liquidated. <\/span>","<span data-v-f87c67ca=\"\">In its proposal, the Solend team claimed that a liquidation of this size on-chain was risky due to thin liquidity on the lending protocol. The team further made the case that if the on-chain liquidation went through, Solend would be at risk of accruing bad debt due to a cascading drop in SOL's value.<\/span>","<span data-v-f87c67ca=\"\">The team suggested that rather than a protocol liquidation, the loan should be wound up via an over the counter (OTC) deal. The Solend governance system then hurriedly passed a vote that gave the team full power to confiscate the user's position. In this vote, 88% of the voting power came from a single address.<\/span>","<span data-v-f87c67ca=\"\">Later on social media, the governance decision received a lot of criticism from many commentators who berated the team for undermining the ethos of decentralization. In response, the team today said it took note of the criticism and put up a<\/span><a href=\"https:\/\/realms.today\/dao\/7sf3tcWm58vhtkJMwuw2P3T6UBX7UE5VKxPMnXJUZ1Hn\/proposal\/3geE5P3D7VJRaNNDVfZciGsXgwGiao1hSNpRM6jWNa5A\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">second proposal<\/span><\/a><span data-v-f87c67ca=\"\"> seeking to invalidate yesterday's decision. The DAO voted today with 99% of votes in favor of invalidating the last proposal.<\/span>","<span data-v-f87c67ca=\"\">“We've been listening to your criticisms about SLND1 and the way in which it was conducted. The price of SOL has been steadily increasing, buying us some time to gather more feedback and consider alternatives,” the Solend team<\/span> <a href=\"https:\/\/realms.today\/dao\/7sf3tcWm58vhtkJMwuw2P3T6UBX7UE5VKxPMnXJUZ1Hn\/proposal\/3geE5P3D7VJRaNNDVfZciGsXgwGiao1hSNpRM6jWNa5A\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">wrote<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"$22.30","content":"MONEY"},{"type":"$108 million","content":"MONEY"},{"type":"SOL","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Solend","content":"LOCATION"},{"type":"99%","content":"PERCENT"},{"type":"88%","content":"PERCENT"},{"type":"Solana","content":"PERSON"},{"type":"$170 million","content":"MONEY"},{"type":"95%","content":"PERCENT"}],"hashtag":["SOLANA"],"authors":["Vishal Chawla","The Block"]}