{"summary":"Grammy-winning DJ RAC has released a personal token on a newly launched Ethereum-based marketplace called Zora \nThe $TAPE token represents a cassette tape featuring RAC’s new album and is sold on a bonding curve with a starting price of $28 per token","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/64760\/ethereum-tokenized-cassette-dj-rac-zora-grammy","publishDate":"2020-05-11T12:55:36","id":463,"type":null,"title":"Tokenized cassette tape by Grammy winner DJ RAC launches on new Ethereum-based marketplace Zora","category":["The Block"],"content":["<span data-v-f87c67ca=\"\">A tokenized, limited-edition cassette by Grammy-winning DJ André Allen Anjos – better known by his stage name RAC – has launched on Zora, an Ethereum-based online marketplace.<\/span>","<span data-v-f87c67ca=\"\">The team behind <a href=\"https:\/\/ourzora.com\/\" data-v-f87c67ca=\"\">Zora<\/a> first gained traction in late 2019 when it put out <a href=\"https:\/\/www.saintfame.com\/\" data-v-f87c67ca=\"\">Saint Fame<\/a>, a decentralized autonomous organization (DAO) that has created an Ethereum-based fashion house.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The new platform aims to help other creators follow Saint Fame's successful experiment and launch limited-edition products themselves. The pitch, according to the project's creator Jacob Horne, is to let brands capture their products' resale value.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The platform's first project is the $TAPE token, which represents 100 limited-edition cassette tapes featuring Anjos' newly released album, BOY. Tokens can be redeemed for a physical copy of the tapes.<\/span>","<span data-v-f87c67ca=\"\">Similar to $Fame, the new token is built on Uniswap's protocol. The starting price of one $TAPE token is $28, but the price can theoretically far exceed $2,000 as the total number of tokens sold approaches 100.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Conventionally, creators can only profit off of their items' initial sales value and are rarely able to tap into the extra revenue generated from secondary trading. With Zora, however, products are tokenized and sold on a bonding curve. This way, creators can reel in additional profits if their products are in high market demand. Zora will charge a 1% trading fee on the consumer side and keep up to 10% of generated revenues.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The idea of cryptocurrency is still relatively new in the music industry. But artists like Lupe Fiasco, Gramatik, Pitbull, and Imogen Heap have all begun to <\/span><a href=\"https:\/\/www.businessinsider.com\/lupe-fiasco-says-blockchain-can-revolutionize-the-music-industry-2018-2\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">explore<\/span><\/a><span data-v-f87c67ca=\"\"> how blockchain technology could potentially help musicians release music more efficiently and create another source of income.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Beyond Zora, a number of other projects – including Ujo Music, Choon, Open Music Initiative, and Musicoin – are also working to incorporate blockchain technology into how music is produced and distributed.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For Anjos, this collaboration with Zora is not his first encounter with cryptocurrency. With a long-standing interest in computer science, the Portuguese artist was drawn to the concept of digital scarcity as soon as he first learned of cryptocurrency in 2016.&nbsp;<\/span><span data-v-f87c67ca=\"\">Working in the entertainment industry, Anjos immediately started to explore how he could apply the technology to his music career.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In 2017, just months after he won a Grammy for Best Remixed Recording, Anjos partnered with ConsenSys-owned startup Ujo Music and put out his album \"EGO\" on the Ethereum network, where fans can purchase it with ETH. Last year, he opted to distribute Minerva, a music label launched by him and another DJ nicknamed Goldroom, via the Ethereum network.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Earlier this year, Anjos' team reached out to Zora to take another shot at combining music with cryptocurrency. What appealed to him about Zora, he said, is that fans don't need to know about the technical details of how cryptocurrency works in order to enjoy the product.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"When we talk about Spotify, we don't talk about what kind of audio compression they use,\" he told The Block. Similarly, Zora will abstract away most of the cryptocurrency aspects from users who might not be particularly tech-savvy.<\/span>","<span data-v-f87c67ca=\"\">\"You can use a credit card [to buy the cassette tape],\" he continued. \"So it doesn't have that initial barrier of getting MetaMask and getting the ether in your wallet, which was a true bottleneck before.\"<\/span>","<span data-v-f87c67ca=\"\">Speaking to cryptocurrency's adoption in the entertainment industry, Anjos pointed out that it is still in a \"transitional phase\" where more artists are getting interested in the concept but are not sure what to do with it. <\/span>","<span data-v-f87c67ca=\"\">\"But I feel like when it does switch, it'll be pretty quick because the technology will be abstracted and happening behind the scenes,\" he said.<\/span>"],"hashtag":["ETHEREUM"]}