{"summary":"Government shutdown or not, plaintiffs&#x27; lawyers haven’t stopped filing new crypto lawsuits. This week we look at three new complaints, one involving lost","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/7212\/project-with-token-utilizing-allegedly-nonexistent-ai-faces-complaints","publishDate":"2019-01-12T12:17:08","id":4633,"type":null,"title":"Project with token using allegedly nonexistent AI faces complaints","category":["LEGAL"],"content":["Government shutdown or not, plaintiffs' lawyers haven’t stopped filing new crypto lawsuits. This week we look at three new complaints, one involving lost crypto and a demand for a fork (the software kind), another that says that pre-sold mining hardware contracts were actually securities, and last but not least artificial intelligence on the blockchain (but not so much, it turns out). [As always, Rosario summaries are “NMR” and Palley summaries are “SDP”]","<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario [twitter: <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>] and Stephen Palley [twitter: <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>]. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.&nbsp;<\/em>","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]Kaplan v. CompCoin LLC et al., 1:18-cv-07453 (E.D. NY, December 31, 2019) [NMR]<\/strong><\/em>","If you read the Crypto Caselaw Minute regularly you might develop a slightly skewed viewpoint of the blockchain space. I mean, all we talk about in here are lawsuits and governmental actions against crypto companies, but that is not the entirety of this space! One of the great things about the blockchain space is that there are almost no incrementalists. The people building companies in this space almost uniformly dream big, and consequently claim big. Their coin, their technology, it is going to be world changing. That’s great! However, problems can arise when you make promises to people, and they start to give you money based off of those promises, and you don’t really deliver on those promises.","This particular case involves an ICO to fund building out a blockchain for a cryptocurrency that would utilize artificial intelligence to trade on the cryptocurrency holders' behalf in the foreign currency markets. It turns out that the AI was never built, and maybe it was never meant to be built. As such, this case alleges violations of federal securities laws, breach of contract, and a bunch of counts based on alleged fraud and misrepresentations on behalf of the defendants. What is sort of strange about this complaint is that it is somewhat light on the evidence presented to show the alleged fraudulent scheme.","According to the complaint, in June of 2015, defendant Alan Friedland registered Compcoin LLC as a company in Florida. In March of 2016, Friedland registered a second company, Fintech Investment Group, Inc.. in Florida again. Allegedly, <a href=\"https:\/\/medium.com\/crypto-caselaw-minute\/crypto-caselaw-minute-18-1-10-2019-e63653f66814\" data-v-f87c67ca=\"\">shortly after this Friedland<\/a> “announce[s] his technology and ICO and explained that he was preparing to launch artificial intelligence technology that would automate FOREX trading.”","The plaintiff discovered Compcoins in 2017. Kaplan read the whitepaper, was intrigued by the technology, and decided to purchase some Compcoins. That purchase was completed through the Compcoin website, which incidentally was the only place Compcoins could be purchased at the time. Okay, so far nothing seems out of the ordinary. A person with interest in the crypto space finds a company, they like what they see, they think the company is doing some cool stuff, and so they put some money into it. What’s the big deal?","Well, the plaintiff made two attempts to sell his coins with no success. The first attempt was when Compcoin, having been listed on a crypto exchange called Nova, hit an all-time high of $12\/coin. The plaintiff attempted to sell his coins, but allegedly was told by defendant Friedland that he could not, because of an alleged hack of the exchange. The Nova exchange shut down, and apparently, additional coins were generated by the Fintech team. For some reason, the price of Compcoins hit another all-time high of $37.03\/coin on January 23, 2018. That was the second time that Friedland attempted to sell his coins to no avail. Not being able to sell their coins is usually going to upset people.","Additionally, the plaintiff made at least one inquiry as to why the Compcoin blockchain was behind schedule and had not launched. Allegedly, the reason given was “that the National Futures Association had not yet approved FINTECH and therefore the COMPCOINS could not execute FOREX trades at this time.” That was not true. Fintech had been approved by the NFA on August 19, 2016. If true, that is not a good look.","This case will be interesting to follow to see what additional information comes out in discovery, for example, information concerning the alleged hack. Also, it will be very interesting to see how the defendants respond to the complaint. There are lots of allegations and counts in this lawsuit and, frankly, not a ton of evidence presented when compared to some of the other cases we’ve covered in the CCM.","<em data-v-f87c67ca=\"\">The Block is delighted to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given <\/em>The Block<em data-v-f87c67ca=\"\"> permission to republish their commentary and analysis in full. Part II of this week's analysis,&nbsp;Crypto Caselaw Minute, is above.<\/em>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Image credit: <\/span><\/i><a href=\"https:\/\/www.shutterstock.com\/g\/malibu\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Shut<\/span><\/i><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">terstock<\/span><\/i><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">\/BCFC<\/span><\/i><\/a>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Friedland","content":"PERSON"},{"type":"National Futures Association","content":"ORGANIZATION"},{"type":"December 31, 2019","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"Fintech Investment Group, Inc.","content":"ORGANIZATION"},{"type":"$12","content":"MONEY"},{"type":"Alan Friedland","content":"PERSON"},{"type":"Kaplan","content":"PERSON"},{"type":"Nelson Rosario [","content":"PERSON"},{"type":"June of 2015","content":"DATE"},{"type":"CCM","content":"ORGANIZATION"},{"type":"January 23, 2018","content":"DATE"},{"type":"Fintech","content":"ORGANIZATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"August 19, 2016","content":"DATE"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"},{"type":"FINTECH","content":"ORGANIZATION"},{"type":"March of 2016","content":"DATE"},{"type":"Florida","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"NFA","content":"ORGANIZATION"},{"type":"CompCoin LLC","content":"ORGANIZATION"},{"type":"E.D. NY","content":"ORGANIZATION"},{"type":"$37.03","content":"MONEY"},{"type":"ICO","content":"ORGANIZATION"},{"type":"Compcoin LLC","content":"ORGANIZATION"},{"type":"Palley","content":"PERSON"}],"hashtag":[],"authors":["Contributor Network","The Block"]}