{"summary":"A wallet tied to Curve Finance founder Michael Egorov has reduced its on-chain debt, easing some concerns.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234884\/curve-founder-returns-1-3-million-usdt-to-aave-to-curb-liquidation-risk","publishDate":"2023-06-15T07:53:45","id":4639,"type":null,"title":"Curve founder returns 1.3 million USDT to Aave to curb liquidation risk","category":["CRYPTO ECOSYSTEMS"],"content":["A wallet tied to Curve Finance founder Michael Egorov has <a href=\"https:\/\/etherscan.io\/address\/0x7a16ff8270133f063aab6c9977183d9e72835428#tokentxns\" data-v-f87c67ca=\"\">returned<\/a> 1.35 million USD Tether (USDT) to Aave, reducing its on-chain debt.","Egorov has proactively reduced the debt to mitigate liquidation risk associated with his loan position on the decentralized lending platform, Aave. This comes amidst a drastic downturn of Curve’s CRV token, which has witnessed a 24% weekly decline and currently trades at $0.57, per <a href=\"https:\/\/www.coingecko.com\/en\/coins\/curve-dao-token\" data-v-f87c67ca=\"\">CoinGecko<\/a>.","Egorov’s loan position, backed by 288.7 million Curve DAO (CRV) tokens, valued at $167 million, has about 62 million USDT borrowed against it, with a health factor of 1.55 — down from over 1.6 yesterday.","This position has attracted attention from the DeFi community due to its size. It comprises <a href=\"https:\/\/www.theblock.co\/post\/234138\/curve-finance-michael-egorov-aave\" data-v-f87c67ca=\"\">over 30%<\/a> of the total CRV token supply, an alarmingly high stake that, in light of the recent price drop, has sparked concerns of substantial selling pressure on CRV tokens and an increased risk of platform liquidation.","In a bold response to potential liquidation, Gauntlet, a firm specializing in DeFi risk management, has <a href=\"https:\/\/www.theblock.co\/post\/234648\/gauntlet-advises-aave-to-freeze-crv-tokens-deposited-by-wallet-tied-to-curve-finance-founder\" data-v-f87c67ca=\"\">proposed<\/a> to the Aave community. They suggest that all CRV tokens on the version 2 platform should be frozen and that the loan-to-value ratio for CRV should be adjusted to zero. This strategy is designed to reduce the risk of accruing bad debt that could arise from Egorov’s loan.","This freeze would necessitate a migration of Egorov’s loan position from Aave’s second version to its third, which is perceived as being better equipped to handle risk management.","Echoing a cautionary sentiment, Egorov commented on the Aave position to The Block, saying, “It’s better to be a bit more careful with this position on Aave. Even if [the] proposal gets rejected, it's better for me to act as if it was executed.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Aave","content":"LOCATION"},{"type":"Curve Finance","content":"ORGANIZATION"},{"type":"$0.57","content":"MONEY"},{"type":"Gauntlet","content":"LOCATION"},{"type":"Egorov","content":"PERSON"},{"type":"CRV","content":"ORGANIZATION"},{"type":"Michael Egorov","content":"PERSON"},{"type":"24%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"$167 million","content":"MONEY"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}