{"summary":"Justin Sun gifted a series of memecoins shortly after he announced he planned to trade the coins for fun.\nThe trick is common when traders want to inflate the prospects of a certain coin.","author":["RT Watson","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230429\/justin-sun-wallet-bombarded-memecoins","publishDate":"2023-05-11T10:59:05","id":464,"type":null,"title":"Justin Sun-linked wallet bombarded with memecoins after trading pledge","category":["People"],"content":["<span data-v-f87c67ca=\"\">Soon after Justin Sun announced on Twitter he would trade memecoins for \"fun,\" opportunists appear to have leaped into action, with several wallets gifting the Tron founder a load of near-worthless tokens.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/span>Sending Sun memecoins — to make it seem as though he's buying them — mirrors a common ruse intended to trick traders into thinking a particular token market is about to heat up, according to The Block Research Analyst Steven Zheng. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“It is not surprising that after Sun’s tweet we saw an influx of memecoins being sent to his account,\" he said. \"Oftentimes scammers and promoters send their tokens to popular influencer addresses to trick people into buying their coins.”","<span data-v-f87c67ca=\"\">The developments come amid the ongoing craze around so-called memecoins, or tokens with little purpose beyond pure market speculation. Would-be promoters seeking attention via Sun's extensive public platform — and using the network itself to do so — speak to the current moment.<\/span>","<span data-v-f87c67ca=\"\">It's also an environment where would-be scammers have sought to exploit unsuspecting token holders. Earlier this week, <a href=\"https:\/\/www.theblock.co\/post\/229907\/pepes-no-different-where-theres-a-meme-theres-a-scam\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">a pepe-themed NFT scam<\/a> circulated on Twitter that had been organized to appear legitimate.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">PeckShieldAlert<\/span> appears to have first noticed the activity and <span data-v-f87c67ca=\"\">posted a <\/span><a href=\"https:\/\/twitter.com\/PeckShieldAlert\/status\/1656618017319686144\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">warning to Twitter<\/span><\/a><span data-v-f87c67ca=\"\">. <\/span>","<span data-v-f87c67ca=\"\">Sun “continues to receive multiple shitcoins following his tweets,” the post reads. “We have noticed that a scammer gang created a counterfeit<\/span> <span data-v-f87c67ca=\"\">four [coin] ... <\/span><span data-v-f87c67ca=\"\">days ago and used [a wallet in order to pretend] to be<\/span><span data-v-f87c67ca=\"\"> Justin Sun.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nEtherscan data indicates that Sun has been gifted several different memecoins, including WEED, METH and NGMI.<br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/strong><\/span><span data-v-f87c67ca=\"\">Sun <\/span><span data-v-f87c67ca=\"\">did not immediately respond to requests for comment.<\/span>"],"hashtag":["CRYPTO MOVERS","JUSTIN SUN"]}