{"summary":"The SEC charged 17 people for their roles in an alleged $300 million Ponzi scheme that targeted predominantly Latino investors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282683\/sec-charges-17-people-in-300-million-crypto-ponzi-scheme-targeting-latino-investors","publishDate":"2024-03-14T17:48:53","id":4644,"type":null,"title":"SEC charges 17 people in $300 million crypto Ponzi scheme targeting Latino investors","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Securities and Exchange Commission charged 17 people for their roles in an alleged $300 million crypto-related Ponzi scheme that targeted tens of thousands of predominantly Latino investors.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The scheme involved Texas-based CryptoFX LLC and affected 40,000 investors in ten U.S. states and two other countries, the SEC said on Thursday in a <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2024-35?utm_medium=email&amp;utm_source=govdelivery\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">statement<\/span><\/a>.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">“We allege that CryptoFX was a $300 million Ponzi scheme that targeted Latino investors with promises of financial freedom and life-altering wealth from ‘risk free’ and ‘guaranteed’ crypto and foreign exchange investments,” said Gurbir S. Grewal, director of the SEC’s Division of Enforcement in a statement. “In the end, the only thing that CryptoFX guaranteed was a trail of thousands upon thousands of victims stretching across 10 states and two foreign countries.\"&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">The scheme involved salespeople soliciting investors and telling them that Crypto FX's crypto and foreign exchange trading would bring in 15% to 100% returns. The SEC said that most of the $300 million raised was not used for trading but instead for other investors to pay commissions and bonuses to themselves and fund their lifestyles.<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">According to the complaint, one of the defendants used the funds to pay for a $1 million house in Texas.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">The defendants also \"engaged in unregistered offers and sales of CryptoFX investments and acted as unregistered brokers,\" according to the <a href=\"https:\/\/www.sec.gov\/files\/litigation\/complaints\/2024\/comp-pr2024-35.pdf\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">complaint<\/span><\/a> filed in the U.S. District Court for the Southern District of Texas in the Houston division.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">The regulator previously filed an emergency action in late 2022 to halt the scheme and charged its two main principals, Mauricio Chavez and Giorgio Benvenuto. After filing the action, the SEC continued its investigation to find others involved in the scheme, said Eric Werner, director of the SEC's Fort Worth regional office.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">Two defendants, spouses Gabriel and Dulce Ochoa, continued to solicit investors after the court issued orders to halt the scheme. Gabriel Ocha went so far as to instruct two investors to take back their complaint to the SEC and another defendant Maria Saravia allegedly told investors that the SEC's lawsuit was fake, according to the regulator's statement.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">According to the statement, two of the 17 defendants settled without admitting or denying the SEC's allegations.&nbsp;<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Gabriel","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Fort Worth","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"CryptoFX LLC","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"15%","content":"PERCENT"},{"type":"Houston","content":"LOCATION"},{"type":"the Southern District of Texas","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Mauricio Chavez","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Eric Werner","content":"PERSON"},{"type":"Maria Saravia","content":"PERSON"},{"type":"Texas","content":"LOCATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Gurbir S. Grewal","content":"PERSON"},{"type":"$1 million","content":"MONEY"},{"type":"Giorgio Benvenuto","content":"PERSON"},{"type":"Dulce Ochoa","content":"PERSON"},{"type":"$300 million","content":"MONEY"},{"type":"SEC’s Division of Enforcement","content":"ORGANIZATION"}],"hashtag":["CRIME","SEC"],"authors":["Sarah Wynn","The Block"]}