{"summary":"Yesterday, a CryptoPunk sold for half a billion dollars. But the sale certainly wasn’t legitimate.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/122516\/how-a-cunning-trick-made-it-look-like-a-cryptopunk-sold-for-532-million","publishDate":"2021-10-29T06:28:24","id":4648,"type":null,"title":"How a cunning trick made it look like a CryptoPunk sold for $532 million","category":["NFTS"],"content":["A CryptoPunk was <a href=\"https:\/\/twitter.com\/cryptopunksbot\/status\/1453872415591829504\" data-v-f87c67ca=\"\">sold for 124,457 ETH<\/a> ($532 million) yesterday, making it the largest CryptoPunk sale in history — by a huge margin.&nbsp;","Only it was effectively a massive sleight of hand.","According to blockchain records, the CryptoPunk owner actually purchased the Punk from themselves. This in itself may not be new to NFTs; there has long been suspicion that accounts have purchased their own NFTs at higher and higher prices to make collections look more valuable. But there’s never been a wash trade of this magnitude before.","The key issue is the sheer amount of funding. If someone were to wash trade an NFT for 1 ETH, they would likely be able to afford it with their own money. But in this case, the owner of the NFT needed access to $532 million to buy it —&nbsp;not such an easy ask.","The CryptoPunk owner managed to access this kind of money by using a flash loan. These are large loans that are used to perform some function and repaid, all in the same transaction in the same block. If the money isn’t returned to the lender within the same block, the transaction fails and the money was never borrowed to begin with. As a result, lenders are comfortable lending out much greater amounts of money with less collateral.&nbsp;","So in this case, the owner of the CryptoPunk took out a flash loan for more than $532 million, used the funds to purchase the CryptoPunk and then sent the money back to the lender — all within the same transaction. This meant they made the sale happen without needing to stump up the funds.&nbsp;","Since this happened, multiple other people have used similar tactics. Someone used a flash loan to <a href=\"https:\/\/twitter.com\/cryptopunksbot\/status\/1453888793002586114\" data-v-f87c67ca=\"\">bid 4,206 ETH<\/a> ($18.2 million) on Punk 5362 and another <a href=\"https:\/\/twitter.com\/econoar\/status\/1453886951455485956?s=21\" data-v-f87c67ca=\"\">bid 20,400 ETH<\/a> ($88.5 million) on a range of CryptoPunks.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"CryptoPunk","content":"ORGANIZATION"},{"type":"$88.5 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$532 million","content":"MONEY"},{"type":"$18.2 million","content":"MONEY"},{"type":"Punk","content":"ORGANIZATION"}],"hashtag":["ETHEREUM"],"authors":["Tim Copeland","The Block"]}