{"summary":"FTX’s bankruptcy estate says the IRS is delaying the return of FTX user funds with “absurd and meritless” claims.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267102\/ftx-says-irs-demand-for-24-billion-in-unpaid-taxes-is-delaying-recovery-of-user-funds","publishDate":"2023-12-11T16:08:18","id":4649,"type":null,"title":"FTX says IRS demand for $24 billion in unpaid taxes is delaying recovery of user funds","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">The Internal Revenue Service should substantiate its claim against FTX and show how it estimated back taxes it says are due, FTX lawyers said on Sunday in a new filing to a Delaware bankruptcy court. The move is the latest in a months-long dispute between the IRS and the FTX bankruptcy estate over how much the bankrupt exchange and its affiliates owe the government in unpaid taxes.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While FTX claims it owes nothing to the IRS, the tax agency wants as much as $24 billion, more than three times the amount the estate currently has to try and make creditors whole.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">During its short three-year life, FTX never distributed dividends or earnings and \"never earned anything anywhere near amounts that could support the IRS claims for $24 billion in taxes,\" the lawyers wrote. On the contrary, FTX lost a vast amount of money, they added.<\/span>","<span data-v-f87c67ca=\"\">\"The only source of recovery for the IRS is by taking recoveries away from victims. As there is no basis to assert any tax claim against the Debtors, the IRS’s reliance on its own processes only serves to delay distributions to those truly injured,\" the lawyers argued in the document.<\/span>","<span data-v-f87c67ca=\"\">The IRS initially said it was owed an even larger sum, filing initial claims in April for approximately $44 billion. In September, it amended that amount to $43 billion. In November, the number went down to $24 billion.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The IRS says the $24 billion owed is related to income taxes, employment taxes and penalties owed by FTX and its affiliated entities from 2018 to 2022. It’s still not a final figure because the IRS is continuing an audit.<\/span>","<span data-v-f87c67ca=\"\">FTX called the claim \"absurd and meritless.\" Both FTX and accounting firm EY responded to over 2,300 IRS information requests and provided almost all the documents the IRS requested, except for some that will be provided by Jan. 15, 2024, the document says.<\/span>","<span data-v-f87c67ca=\"\">The IRS argues that its estimations are afforded the presumption of correctness and that the burden of proof rests on FTX to prove otherwise. FTX called the IRS statements an “Alice in Wonderland argument.”<\/span>","<span data-v-f87c67ca=\"\">In its filing yesterday, FTX insists that a schedule it suggested must be approved to avoid \"indefinitely delaying distributions to victims.\" <\/span><span data-v-f87c67ca=\"\">The next hearing on the FTX bankruptcy case is scheduled for Wednesday, Dec. 13.<\/span>","<span data-v-f87c67ca=\"\">FTX <\/span><a href=\"https:\/\/www.theblock.co\/post\/185083\/ftx-files-for-chapter-11-bankruptcy\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">filed for bankruptcy<\/span><\/a><span data-v-f87c67ca=\"\"> last November. Its former CEO, Sam Bankman-Fried, was <\/span><a href=\"https:\/\/www.theblock.co\/post\/261240\/sam-bankman-fried-convicted-on-all-counts-report\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">convicted<\/span><\/a><span data-v-f87c67ca=\"\"> of defrauding FTX users and investors on Nov. 2.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Delaware","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"the IRS","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"November","content":"DATE"},{"type":"Jan. 15, 2024","content":"DATE"},{"type":"Wonderland","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"April","content":"DATE"},{"type":"Sunday","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Internal Revenue Service","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$24 billion","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"IRS","content":"ORGANIZATION"},{"type":"Dec. 13","content":"DATE"},{"type":"$44 billion","content":"MONEY"},{"type":"$43 billion","content":"MONEY"},{"type":"Nov. 2","content":"DATE"},{"type":"last November","content":"DATE"}],"hashtag":["FTX"],"authors":["Anna Baydakova","The Block"]}