{"summary":"The Treasury has sanctioned a new ransomware gang that it has associated with Iran’s Islamic Revolutionary Guard Corps.\nThe new sanctions designate 10 people, two companies and seven Bitcoin addresses. ","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/170035\/treasury-sanctions-iranian-military-linked-ransomware-gang-including-new-btc-addresses","publishDate":"2022-09-14T11:18:49","id":465,"type":null,"title":"Treasury sanctions Iranian military-linked ransomware gang, including new BTC addresses","category":["Regulation"],"content":["The US Treasury is targeting the Iranian military's ransomware wing.&nbsp;","In <a href=\"https:\/\/home.treasury.gov\/policy-issues\/financial-sanctions\/recent-actions\/20220914\" data-v-f87c67ca=\"\">new sanctions<\/a> announced on September 14, the Treasury's Office of Foreign Asset Control took aim at 10 individuals and two companies that it associated with Iran's ransomware activities.","OFAC alleges that this ransomware group targeted a municipality in New Jersey and a children's hospital in 2021, among other exploits.&nbsp;&nbsp;","\"This IRGC-affiliated group is known to exploit software vulnerabilities in order to carry out their ransomware activities, as well as engage in unauthorized computer access, data exfiltration, and other malicious cyber activities,\" Treasury's announcement said.&nbsp;","The new sanctions included 7 new Bitcoin addresses, adding to a <a href=\"https:\/\/www.theblock.co\/post\/164336\/a-brief-history-of-us-crypto-sanctions?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">growing list of crypto addresses<\/a> that the Treasury has designated.","The past month has seen a <a href=\"https:\/\/www.theblock.co\/post\/169688\/treasury-says-sanctions-on-tornado-cash-dont-stop-people-from-sharing-code\" data-v-f87c67ca=\"\">storm of controversy<\/a> surrounding sanctions on the smart contract addresses that run decentralized mixer Tornado Cash.&nbsp;"],"hashtag":[]}