{"summary":"The yen may come further into focus after last week&#x27;s actions from the Bank of Japan.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179260\/four-things-to-watch-this-week-in-the-crypto-markets","publishDate":"2022-10-23T08:53:57","id":4651,"type":null,"title":"Four things to watch this week in cryptocurrencies","category":["BITCOIN"],"content":["With Halloween fast approaching, the crypto markets could be in for a fright — particularly if the macroeconomic picture continues to sour.","A notable lack of volatility among major cryptocurrencies Bitcoin and ether is drawing frightening parallels to 2018, before the markets experienced a final capitulation. That, combined with a struggling Japanese yen has made some traders uneasy. At the same time, the month has already been plagued by hacks — and some are wondering which protocol will be exploited next.","Still, the supply of new ether since Ethereum's switch from proof-of-work to proof-of-stake is expected to turn negative — and that's giving some Ethereum proponents a reason to be positive.","Cryptocurrency market participants have been forced to also watch traditional markets lately, thanks to riling by global macroeconomic uncertainties. Because of this, the yen may come further into focus after last week's actions from the Bank of Japan.","Last Thursday, the BOJ <a href=\"https:\/\/www.reuters.com\/markets\/asia\/bank-japan-conduct-emergency-bond-buying-yen-teeters-near-150-2022-10-20\/\" data-v-f87c67ca=\"\">conducted<\/a> emergency bond-buying operations to the tune of 250 billion yen ($1.67 billion) in an effort to set a floor for bond prices. The yen, meanwhile, traded near 32-year-lows against the U.S. dollar while 5- and 20-year bold yields increased — signaling a lack of demand.","The economic situation in Japan is causing concern over yen inflation. Should things become more volatile in that country, the markets may react — and anytime inflation is driving an economic narrative, cryptocurrencies such as Bitcoin become part of the discussion.","Barring an unforeseen reversal in the overall trend, the supply of Ethereum's native asset, ether, may fall below pre-Merge levels — meaning more coins will have been <a href=\"https:\/\/www.theblock.co\/post\/179144\/ethereum-token-supply-on-trend-to-drop-below-pre-merge-levels\" data-v-f87c67ca=\"\">burned<\/a> than created since the network switched from proof-of-work to proof-of-stake.","As of the time of this writing, about 1,814 ETH ($2,365,148) have been added to the supply since The Merge, according to data from ultrasound.money. If the switch to proof-of-stake had not happened, it may have been more than 454,648 ETH, a difference of about $590 million.","The ether supply officially becoming negative in the post-Merge timeframe would likely cause a celebration among Ethereum proponents.","The supply of new ether since The Merge is nearing 0. Source: ultrasound.money","Though things continually seem to be ratcheting up in the world — and by \"things,\" we mean \"everything\" — the crypto markets have been undeniably boring, as far as price action is concerned.","Major cryptocurrencies' prices, driven by Bitcoin's price, remain range-bound.&nbsp;","BTC \/ USD on <a href=\"https:\/\/www.tradingview.com\/chart\/qwpJ44l6\/?symbol=BNC%3ABLX\" data-v-f87c67ca=\"\">TradingView<\/a>","More than one analyst in the cryptocurrency space has <a href=\"https:\/\/twitter.com\/CL207\/status\/1584125640537968641\" data-v-f87c67ca=\"\">drawn<\/a> comparisons between Bitcoin's current price stagnation and that experienced in late 2018 — right before a capitulation move down. Others are of a different mind and say that an impending pivot from the U.S. Federal Reserve regarding interest rates will create a floor for cryptocurrency prices.","Either way, the increasing tension of the current wait-and-see market condition is almost palpable — and a big move feels likely to happen <a href=\"https:\/\/twitter.com\/rovercrc\/status\/1583900999076532231\" data-v-f87c67ca=\"\">sooner<\/a> rather than later.","October has already <a href=\"https:\/\/www.theblock.co\/post\/176824\/hacktober-surprise-worst-month-in-worst-year-of-hacks-chainalysis-says\" data-v-f87c67ca=\"\">proven<\/a> to be the worst month in the worst year of hacks for the blockchain and cryptocurrency industry — totaling more than $720 million — &nbsp;and it will be worth watching out for more exploits in the coming week.","There is little reason to assume there won't be at least one more exploit in October. Just today, an investigation conducted by trading-bot platform 3Commas and cryptocurrency exchange FTX <a href=\"https:\/\/www.theblock.co\/post\/179237\/ftx-api-keys-3commas-exploited\" data-v-f87c67ca=\"\">revealed<\/a> that API keys were used to conduct unauthorized trades for DMG trading — though the total amount of damage is not yet known. 3Commas claims that the API keys in questioned were not obtained from the platform, but rather phished or hacked from users.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bank of Japan","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"TradingView","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"Japan","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$1.67 billion","content":"MONEY"},{"type":"$590 million","content":"MONEY"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"$2,365,148","content":"MONEY"},{"type":"$720 million","content":"MONEY"},{"type":"last week","content":"DATE"},{"type":"DMG","content":"ORGANIZATION"},{"type":"BOJ","content":"ORGANIZATION"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Bitcoin","content":"PERSON"},{"type":"250 billion yen","content":"MONEY"}],"hashtag":["BITCOIN"],"authors":["Adam James","The Block"]}