{"summary":"Bosonic believes that Crypto needs a solution that leapfrogs the existing TradFi and CeFi dependencies on central counterparties, big balance sheets, complicated papered legal agreements and promises to pay. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/124272\/bosonic-solves-counterparty-credit-and-settlement-risk-for-institutional-crypto-trading","publishDate":"2021-11-18T09:00:52","id":4654,"type":null,"title":"BOSONIC solves counterparty credit and settlement risk for institutional crypto trading","category":["SPONSORED"],"content":["<b data-v-f87c67ca=\"\">Quick Take:<\/b>","<span data-v-f87c67ca=\"\">Institutional demand for access to cryptocurrencies is here.&nbsp; With the market cap crossing $3 Trillion it is now truly too large a market for any firm to ignore.&nbsp; The profiles of TradFi firms entering the space is shifting at a rapid rate to those who are regulated and\/or acting as fiduciaries and as such, they have mandates that can’t be compromised, resulting in a hyper focus on risk.<\/span>","<span data-v-f87c67ca=\"\">Currently, the biggest barrier for the participation of institutional investors, especially fiduciaries in Crypto and Digital Assets, is there’s no Tier-1 bank prime broker, central clearing-house or institutional consortium like DTCC or CLS Bank. So, there’s no entity providing an equivalent solution to fully eliminate these major risks like Bosonic.<\/span>","<b data-v-f87c67ca=\"\">A unique global solution&nbsp;<br data-v-f87c67ca=\"\">\n<\/b><span data-v-f87c67ca=\"\">Bosonic believes that Crypto needs a solution that leapfrogs the existing TradFi and CeFi dependencies on central counterparties, big balance sheets, complicated papered legal agreements and promises to pay.&nbsp; Bosonic has spent years developing unique properties and specific technologies to ease the complications of clearing and settlement without compromising the essential functionality provided by trusted legacy systems.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bosonic has spent the past several years building a next generation clearing and settlement framework.&nbsp; The validation of the system’s capacity and resiliency has been confirmed with the execution of almost $10 billion over 2 million trades. This performance has exceeded the expectation of the soft launch.&nbsp;&nbsp;&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Delivering exchange liquidity without tying up assets at each exchange<br data-v-f87c67ca=\"\">\n<\/b><span data-v-f87c67ca=\"\">Through the use of Bosonic, <\/span><a href=\"https:\/\/bosonic.digital\/client\/3\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">exchanges can distribute their liquidity<\/span><\/a><span data-v-f87c67ca=\"\"> to any client without having to custody the client’s assets, thus eliminating the dependency on exchange funding or credit.&nbsp; Exchanges on the Bosonic Network simply hold a secondary client omnibus account balance at a custodian of their choice on the network, with no cost of capital to the exchange.&nbsp; Any client on the Bosonic Network can then access the exchange’s liquidity while retaining their collateral in their own account at the custodian. Bosonic then clears and settles the trades in real-time with no counterparty credit or settlement risk.&nbsp;&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Delivering market maker liquidity without bilateral credit and settlement<br data-v-f87c67ca=\"\">\n<\/b><a href=\"https:\/\/bosonic.digital\/client\/5\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Market makers, similarly, can distribute their liquidity<\/span><\/a><span data-v-f87c67ca=\"\"> to any client without having to use bilateral credit and perform bilateral settlement movements.&nbsp; Market makers and their clients, who almost exclusively transact on unsecured credit today, can use Bosonic to trade with real-time clearing and settlement against assets held in their own accounts at the custodian of their choice.&nbsp; This makes it possible for market makers to face both institutions who are unable to take credit risk, and clients that are not credit worthy.&nbsp;&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Market makers and exchanges also have the option of using Bosonic for post-trade clearing and settlement for trades done away from Bosonic’s platform, by delivering FIX post-trade messages that get processed with Bosonic’s Atomic Swap process, as well as flowing through the automated net settlement movements at the custodians.&nbsp;&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Multi-lateral netting and cross-margining<br data-v-f87c67ca=\"\">\n<\/b><span data-v-f87c67ca=\"\">With Bosonic, not only is the <\/span><a href=\"https:\/\/bosonic.digital\/product\/3\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">aggregation of liquidity truly tradable<\/span><\/a><span data-v-f87c67ca=\"\"> because it can be cleared and settled at the custodial level, in addition, the trades are netted in real-time.&nbsp; For example, if you trade long with a market maker and short with an exchange or another market maker, you are net flat instantly from a collateral perspective.&nbsp; Clients realize the capital efficiencies of executing from one pool of collateral across any number of liquidity sources and other counterparties fully netted in real-time with no pre-trade pre-allocation.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Eliminating AML\/KYC burdens without compromising compliance<br data-v-f87c67ca=\"\">\n<\/b><span data-v-f87c67ca=\"\">All counterparties in the Bosonic <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Network<\/span><\/i><span data-v-f87c67ca=\"\">™ gain access to the network through a BSA regulated firm or the equivalent, who are absolutely responsible for AML\/KYC of their clients.&nbsp; Consequently, the market makers, exchanges and other counterparties don’t need to AML\/KYC all their counterparties and can transact anonymously on the Bosonic Network.&nbsp;&nbsp;&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Payment network for collateral management<br data-v-f87c67ca=\"\">\n<\/b><span data-v-f87c67ca=\"\">Participants in the Bosonic Network can make <\/span><a href=\"https:\/\/bosonic.digital\/product\/5\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">24x7 instant payments in Crypto or Fiat<\/span><\/a><span data-v-f87c67ca=\"\"> without using wire transfers or public leger transactions.&nbsp; As far as collateral management goes, clients can move assets without cost for use cases like margin management for OTC derivatives or fast P\/L settlements. Moreover, it changes the ownership at the custodial level making collateral immediately useable by the recipient.<\/span>","<b data-v-f87c67ca=\"\">The ultimate Bosonic game changers<br data-v-f87c67ca=\"\">\n<\/b><span data-v-f87c67ca=\"\">Now that the core of Bosonic is stress tested with real clients, the company is finalizing the rollout of scheduled features that will bridge all market participants together:&nbsp;&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Lending Marketplace:<\/span><\/span><span data-v-f87c67ca=\"\"> collateral stays in lender and borrower accounts at their own custodians, however, enables margin and leverage financing facilitated with repo transactions in real-time, executed as an Atomic Exchange on custodial Layer-2 blockchain ledgers.&nbsp; This enables all trading counterparties to remain fully funded even when trading on margin.<\/span>","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Virtual Custodian:<\/span><\/span> <a href=\"https:\/\/bosonic.digital\/product\/11\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">trade from any self-custody wallet<\/span><\/a><span data-v-f87c67ca=\"\"> with any counterparty on the Bosonic Network with Atomic Exchange on a Layer-2 which is secured by assets locked in Layer-1 Smart Contracts, or at brick-and-mortar custodians.<\/span>","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Cross-Custodian Net Settlement:<\/span><\/span> <a href=\"https:\/\/bosonic.digital\/product\/7\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">custodian-to-custodian atomic net settlement<\/span><\/a><span data-v-f87c67ca=\"\"> on behalf of all clients in support of cross-custodian trading and payments. Automatically settles netted quantities on Layer-2, as well as delivering residual quantities that need to move between custodians for both Fiat and Crypto assets using Layer-1 Smart Contracts.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bosonic","content":"LOCATION"},{"type":"CLS Bank","content":"ORGANIZATION"},{"type":"Crypto","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"DTCC","content":"ORGANIZATION"},{"type":"Bosonic","content":"ORGANIZATION"},{"type":"BSA","content":"ORGANIZATION"},{"type":"$10 billion","content":"MONEY"},{"type":"Bosonic Network","content":"LOCATION"},{"type":"Atomic Exchange","content":"ORGANIZATION"},{"type":"Bosonic Network","content":"ORGANIZATION"},{"type":"KYC","content":"ORGANIZATION"},{"type":"OTC","content":"ORGANIZATION"},{"type":"2","content":"DATE"},{"type":"$3 Trillion","content":"MONEY"},{"type":"1","content":"DATE"},{"type":"AML","content":"ORGANIZATION"},{"type":"Fiat","content":"ORGANIZATION"},{"type":"Crypto","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}