{"summary":"An MEV bot from Jaredfromsubway has been wildly successful in performing sandwich attacks on other blockchain users.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230218\/jaredfromsubway-mev-bot","publishDate":"2023-05-10T09:17:50","id":466,"type":null,"title":"Jaredfromsubway.eth&#x27;s MEV bot rakes in millions of dollars in three months","category":["CRYPTO ECOSYSTEMS"],"content":["<em data-v-f87c67ca=\"\">Update: The headline and article text have been updated with estimates from an MEV expert, providing a different view to what was said in the report. <\/em>","An MEV bot run by a pseudonymous crypto individual named after a jailed sex offender made millions of dollars in arbitrage and sandwich attacks in the last three months, <a href=\"https:\/\/eigenphi.substack.com\/p\/performance-appraisal-of-jaredfromsubway-eth\" data-v-f87c67ca=\"\">according<\/a> to a report by MEV tracking site EigenPhi.","The report stated that the bot made $34 million in proceeds (with revenues of $40 million minus blockchain fees of $6 million).","However, a pseudonymous MEV expert known as Yannick, who runs similar bots, claims that the actual proceeds are in the range of $3.5 million to $4.5 million. He told The Block that EigenPhi typically overestimates revenue from MEV extraction.","A person going by Jaredfromsubway.eth — a reference to the <a href=\"https:\/\/simple.wikipedia.org\/wiki\/Jared_Fogle\" data-v-f87c67ca=\"\">former spokesperson for sandwich chain Subway<\/a> who was sentenced to 15 years for sex crimes — created the bot in February. It quickly found traction by sandwiching other crypto users and outperforming rival MEV bots, a term for&nbsp;blockchain-based high frequency trading algorithms.&nbsp;","As the bot has become more active, its transactions can now be found in more than 60% of Ethereum blocks, according to EigenPhi.","\"Their success can be attributed to skill, strategy and tech,\" a pseudonymous crypto developer called Nox <a href=\"https:\/\/twitter.com\/0xNox_eth\/status\/1655615318067412992\" data-v-f87c67ca=\"\">said<\/a> on Twitter this week. \"Jared's bot identifies more MEV opportunities and executes transactions faster than competitors.\"","A sandwich attack is where a fast crypto user observes a pending transaction about to be processed on the blockchain. They then bundle that transaction with two of their own — one before the transaction and one after it — and submit that bundle to a blockchain validator who processes it, for a fee. The two transactions are designed to manipulate the market in a way that makes the original transaction less profitable and in turn boosts the attacker’s own profits.","<a href=\"https:\/\/www.theblock.co\/post\/227110\/mev-trading-bot-memecoins-subway\" data-v-f87c67ca=\"\">Jaredfromsubway.eth’s bot<\/a> has run a total of 238,000 attacks with more than 106,000 victims, according to EigenPhi. ","The bot's success appears to be driving out rivals. In the Flashbots Discord, Yannick said that Jaredfromsubway.eth was willing to pay a higher percentage of the proceeds from the attacks to validators. “I was bribing 97% for months until he appeared and bribed 99.9%,” they said.","Yannick noted that Jaredfromsubway.eth’s attacks were effective because they would sandwich several tokens in a single transaction and add arbitrage opportunities at the end of the bundles. At the time, Yannick said that, in response, they were planning to shut down their own MEV bot. Yet they told The Block that they haven't done so.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$34 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$40 million","content":"MONEY"},{"type":"EigenPhi","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Flashbots Discord","content":"ORGANIZATION"},{"type":"97%","content":"PERCENT"},{"type":"$3.5 million","content":"MONEY"},{"type":"$4.5 million","content":"MONEY"},{"type":"bot","content":"ORGANIZATION"},{"type":"60%","content":"PERCENT"},{"type":"99.9%","content":"PERCENT"},{"type":"millions of dollars","content":"MONEY"},{"type":"Yannick","content":"PERSON"},{"type":"MEV","content":"ORGANIZATION"},{"type":"$6 million","content":"MONEY"},{"type":"Nox","content":"ORGANIZATION"},{"type":"Jared","content":"PERSON"},{"type":"Twitter this week","content":"DATE"}],"hashtag":["MEV"],"authors":["Tim Copeland","The Block"]}