{"summary":"After revealing crypto regulation guidelines last week, the UK&#x27;s Treasury and central bank will publish a consultation report on the digital pound tomorrow morning.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/209006\/uk-government-and-central-bank-tease-cbdc-consultation","publishDate":"2023-02-06T17:30:51","id":4660,"type":null,"title":"UK government and central bank tease CBDC consultation","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">The UK’s Treasury and the Bank of England are preparing the groundwork for a potential central bank digital currency to launch this decade, with a report on the issue to be published on Tuesday morning, according to an announcement from the British government.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Coming just a few days after the UK government <\/span><a href=\"https:\/\/www.theblock.co\/post\/207488\/the-uk-finally-reveals-plan-to-regulate-crypto-trading-and-lending\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">released<\/span><\/a><span data-v-f87c67ca=\"\"> its report on broader crypto regulation calling for input from stakeholders, this consultation outlines more details about what a digital pound may entail, while seeking public comment.<\/span>","<span data-v-f87c67ca=\"\">UK Economic Secretary to the Treasury Andrew Griffith promised the report last month, while also looking to assuage privacy concerns <\/span><span data-v-f87c67ca=\"\">that a digital pound would not track retail transactions. However, the UK<\/span><span data-v-f87c67ca=\"\"> government and Bank of England have said that although they would not program or track spending, the digital pound would not be anonymous, so as to prevent money laundering.<\/span>","<span data-v-f87c67ca=\"\">A digital pound would allow retail users the possibility to make payments using central bank-backed digital currency, but it will not offer saving or investing possibilities through a central bank account. On top of that, there will be limits on how much a person or company can hold in private digital wallets for the digital pound.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The European Central Bank is <\/span><a href=\"https:\/\/www.theblock.co\/post\/183646\/digital-euro-transaction-limits-store-value-caps\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">taking<\/span><\/a><span data-v-f87c67ca=\"\"> a similar approach in its digital euro design phase, by introducing restrictions on storage and transactions. However in the UK, this feature is bound to change in the future.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“This would strike a balance between both encouraging use and managing risks, such as the potential for large and rapid outflows from banking deposits into digital pounds,” the Treasury announcement reads.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The consultation will remain open until June 7 while the Treasury will start designing the necessary technology and policies, though a digital pound remains far from certain for widescale introduction.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"While cash is here to stay, a digital pound issued and backed by the Bank of England could be a new way to pay that’s trusted, accessible and easy to use,” Chancellor of the Exchequer Jeremy Hunt said in the announcement. \"That’s why we want to investigate what is possible first, whilst always making sure we protect financial stability.”<\/span>","<span data-v-f87c67ca=\"\">The government will only make a decision on whether to implement the CBDC around 2025, with a potential to launch it further down the line.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“This consultation and the further work the bank will now do will be the foundation for what would be a profound decision for the country on the way we use money,” Governor of the Bank of England Andrew Bailey said.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2025","content":"DATE"},{"type":"Jeremy Hunt","content":"PERSON"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"June 7","content":"DATE"},{"type":"UK’s Treasury","content":"ORGANIZATION"},{"type":"Bank of England Andrew Bailey","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"morning","content":"TIME"},{"type":"Andrew Griffith","content":"PERSON"},{"type":"European Central Bank","content":"ORGANIZATION"},{"type":"Treasury","content":"ORGANIZATION"}],"hashtag":["BOE","CBDCS","UK PARLIAMENT"],"authors":["Inbar Preiss","The Block"]}