{"summary":"Retail investors in Hong Kong can get access to tokenized gold via HSBC’s online banking website and mobile app.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284936\/hsbc-tokenized-gold-hong-kong","publishDate":"2024-03-27T03:07:22","id":4662,"type":null,"title":"HSBC launches retail tokenized gold products in Hong Kong","category":["ASIA"],"content":["<span data-v-f87c67ca=\"\">HSBC has launched tokenized gold products for retail clients in Hong Kong as the local government continues its drive for real-world asset tokenization.<\/span>","<span data-v-f87c67ca=\"\">The financial services company said in a statement on Wednesday that retail customers can access the HSBC Gold Token via online banking and the bank’s mobile app.&nbsp;<\/span><span data-v-f87c67ca=\"\">“The launch marks the first time HSBC's private distributed ledger is being used to tokenise a retail investment product,” it said in the statement.<\/span>","<span data-v-f87c67ca=\"\">The bank built the HSBC Gold Token with its digital assets platform, HSBC Orion, and has previously launched digital bonds in Hong Kong and Luxembourg, according to the press release.<\/span>","<span data-v-f87c67ca=\"\">“We are proud that HSBC Gold Token, powered by HSBC Orion, is the first retail product in Hong Kong that is based on distributed ledger technology, as authorised by the Securities and Futures Commission,” said Maggie Ng, general manager and head of wealth and personal banking Hong Kong at HSBC.<\/span>","<span data-v-f87c67ca=\"\">The launch of retail tokenized gold products comes as HSBC has explored more financial use cases with blockchain technology. In November 2023, HSBC announced plans to offer a <\/span><a href=\"https:\/\/www.theblock.co\/post\/262137\/hsbc-tokenized-securities-custody-ripple-metaco\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">custody service for digital assets<\/span><\/a><span data-v-f87c67ca=\"\">, including tokenized securities, in partnership with Metaco, a Swiss-based crypto firm. HSBC also <\/span><a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-11-01\/hsbc-launches-blockchain-platform-to-tokenize-ownership-of-gold-in-london-vault\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">launched<\/span><\/a><span data-v-f87c67ca=\"\"> a platform in November to tokenize ownership of physical gold held in its London vault.<\/span>","<span data-v-f87c67ca=\"\">Tokenization has become an emerging trend in the traditional finance industry. For example, SC Ventures — the investment and innovation arm of the Standard Chartered bank — <\/span><a href=\"https:\/\/www.theblock.co\/post\/263035\/standard-chartered-sc-ventures-tokenization-libeara\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">launched<\/span><\/a><span data-v-f87c67ca=\"\"> a tokenization platform called Libeara in November.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"HSBC","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"HSBC Gold Token","content":"ORGANIZATION"},{"type":"Securities and Futures Commission","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Maggie Ng","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"SC Ventures","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"HSBC Orion","content":"ORGANIZATION"},{"type":"London","content":"LOCATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Luxembourg","content":"LOCATION"},{"type":"Standard Chartered","content":"ORGANIZATION"}],"hashtag":["TRADFI BANKS"],"authors":["Timmy Shen","The Block"]}