{"summary":"While many considered highly-priced NFTs such as Bored Apes Yacht Club (BAYC) could be sound investments with decent returns, the lack of a proper pricing mechanism for NFTs could hamper the long-term development of the space. The absence of reference pricing may be a barrier to entry for investors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/117659\/has-the-absence-of-pricing-prevented-nfts-from-becoming-a-true-asset-class","publishDate":"2021-09-15T09:16:30","id":4668,"type":null,"title":"Has the Absence of Pricing Prevented NFTs from Becoming A True Asset Class??","category":["SPONSORED"],"content":["<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Author: David Lighton, Co-founder of Lithium Finance<\/span><\/i>","<span data-v-f87c67ca=\"\">If the summer of 2020 was all about DeFi, there’s no doubt that this summer was all about NFTs. Images of apes, penguins, and other animals have dominated the headlines globally as the prices of leading NFTs have been reaching all-time highs regularly. Even people who have never touched on crypto or DeFi have probably heard about NFTs, and traditional investment tycoons, international auction houses have started to tap into this frenzy. While many considered highly-priced NFTs such as Bored Apes Yacht Club (BAYC) could be sound investments with decent returns, the lack of a proper pricing mechanism for NFTs could hamper the long-term development of the space. The absence of reference pricing may be a barrier to entry for investors.<\/span>","<span data-v-f87c67ca=\"\">Bored Apes Yacht Club (BAYC) has been one of the most high-profile NFT projects in the space and the main driver of the whole NFT market in terms of price momentum and sentiment. Data from Dun Analytics shows that the floor price of BAYC has reached a new all-time high of 44.05 ETH in late August 2021, that's more than 171,000 in USD and representing a 5800% of growth since early June. Despite the recent floor price correction, the overall trend and market demand seem to have remained robust.<\/span>","&nbsp;","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Figure 1a: Floor Price of BAYC<\/span><\/i> <i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Figure <\/span><\/i>","","","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">1b: Active Holders of BAYC<\/span><\/i><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","&nbsp;","<span data-v-f87c67ca=\"\">On top of that, the diversity of BAYC's owner landscape also seems to have increased over time. For example, in mid-April, only less than 100 hundred wallet addresses held at least one BAYC NFT, but the number grew exponentially to over 5400 in less than 6-month, and the trend didn't stop there; we witnessed growth thereafter, as well.<\/span>","<span data-v-f87c67ca=\"\">While many considered BAYC as one of the blue chip properties in the NFT world, a major question emerged as investors are ape-ing in. How do we price a BAYC NFT piece correctly? Many will likely take references from the public market. However, that may even create more confusion. Add the volatility of NFTs, generally, and we have created a mess.<\/span>","<span data-v-f87c67ca=\"\">Just recently, <\/span><a href=\"https:\/\/opensea.io\/assets\/0xbc4ca0eda7647a8ab7c2061c2e118a18a936f13d\/3749\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">BAYC #3749<\/span><\/a><span data-v-f87c67ca=\"\">, aka \"The Captain\" was sold to The Sandbox on OpenSea at the price of 740 ETH, that's almost 3 million in USD. The buyer claims that #3749 is the 27th rarest Ape out of all and wanted to be part of the company's NFT collection.<\/span>","&nbsp;","<span data-v-f87c67ca=\"\">&nbsp; &nbsp; <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Figure 2: BAYC #3749 “The Captain”<\/span><\/i>","","","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Source: Twitter<\/span><\/i>","<span data-v-f87c67ca=\"\">This case could be an excellent example of how the crypto\/NFT crowd sees the market and a good reflection of their largely positive sentiment. In the past, similar high-profile trade could be a benchmark for BAYC NFTs, at least for the short-term, and may even trigger a price increase for some of the rarest Apes available in the market. However, it seems that this is not the case this time. Mainstream players and their views on NFT could be the reasons behind this.<\/span>","<span data-v-f87c67ca=\"\">The case of \"The Captain\" could be just part of the bigger picture here. International auction house giant Sotheby's is hosting an online BAYC <\/span><a href=\"https:\/\/www.sothebys.com\/en\/buy\/auction\/2021\/ape-in\/101-bored-ape-yacht-club\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">auction<\/span><\/a><span data-v-f87c67ca=\"\">; the event has been one of the most widely debated topics among BAYC owners and many potential BAYC buyers.<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Figure 3: Sotheby’s Ape in! Online Auction<\/span><\/i>","","","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Source: Sothebys.com<\/span><\/i>","<span data-v-f87c67ca=\"\">The Sotheby's BAYC lot features a total of 107 NFTs, with 101 Apes, 3 M1, and 3 M2 Mutant serums. At the time of writing, the bid has been sitting at 19 million USD after 44 bids. Although the auction appears to be well received so far and the bid is already above the estimation, when you look deeper into the number, you will see that each Apes in the lot only cost less than 55 ETH. The number already excluded the Mutant serums.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">It's worth noting that there are two golden fur Apes (#5809 and #7940) in the lot. If you follow the BAYC market closely, it's not hard to find out the golden fur feature is one of the most valuable and highly-priced features, just like \"The Captain\".<\/span>","<span data-v-f87c67ca=\"\">Regardless of which side has a bigger market influence, if the current market price of \"The Captain\" is 740 ETH, and if someone can buy a golden fur Ape, which \"The Captain\" shares the similar feature, with just less than 55 ETH through the auction, it will create a vast valuation gap in the BAYC market.<\/span>","<span data-v-f87c67ca=\"\">From the viewpoint of a prospective BAYC investor, it's tough to get fair pricing by only observing the market due to this divergence in pricing and valuation. Although there are platforms like <\/span><a href=\"https:\/\/rarity.tools\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">rarity.tools<\/span><\/a><span data-v-f87c67ca=\"\"> to help buyers filter out some of the most common Apes and help them focus on those with unique features, it won't tell buyers whether an Ape is overpriced or undervalued. Add to this conversation the fact that there is increasing speculation in this space, and that the Apes do not have easily defined intrinsic value, and we have a very challenging appraisal problem.<\/span>","<span data-v-f87c67ca=\"\">While the market seems to lack a proper pricing mechanism to price NFT such as BAYC, there could be a solution in DeFi with protocols such as <\/span><a href=\"https:\/\/lith.finance\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Lithium Finance<\/span><\/a><span data-v-f87c67ca=\"\">. It's a decentralized pricing oracle solution focusing on private and illiquid assets, and NFT is also part of that.<\/span>","<span data-v-f87c67ca=\"\">There are two stakeholders in the Lithium ecosystem, Wisdom Nodes and Wisdom Seekers. Wisdom Nodes have specialized knowledge on pricing certain assets, while Wisdom Seekers are anyone who wants to acquire the pricing information.&nbsp;<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Figure 3: Illustration of Lithium Finance Wisdom Node Dashboard with a highlight of digital collectibles <\/span><\/i><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">&nbsp;<\/span><\/i>","","","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Source: Lithium Finance<\/span><\/i>","<span data-v-f87c67ca=\"\">Wisdom Seekers can post questions regarding the pricing information on a specific private asset, in this case, an Ape, with a bounty. Wisdom Nodes will answer them accordingly and signal how confident they are with the answer by how many LITH tokens they stake with the answer.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">So, imagine hundreds of Ape owners, NFT enthusiasts, alongside traditional art collectors, auction house appraisers, participating in Lithium as Wisdom Nodes to price NFTs like BAYC. As a result, buyers and investors will get a much more fair pricing on those NFTs and avoid the 740 ETH vs. 55 ETH situation.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Lithium could be that missing link that can bring more long-term investors and traditional art collectors into the NFT space and truly make valuable NFTs such as BAYC and CyrptoPunks into the mainstream and become an asset class.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Just like DeFi, NFT is undeniably here to stay and will be here for good. While there is no crystal ball to tell us which will be the next top NFT project, or if BAYC and CryptoPunks will remain what they are today, the long-term rising trend of NFT will continue, and for sure, it will be a bumpy road along the way. However, the flexibility of NFT makes them highly adaptable and easy to commercialize for the mass, even non-crypto natives. Still, given all the advantages NFT is enjoying, the lack of a proper pricing mechanism could be a hurdle for the space and could hamper the future growth of the overall NFT market. DeFi protocols such as Lithium Finance could be a game-changer for the NFT scene. Leveraging the crowd's wisdom, Lithium could help to price the unpriced, using analytical methods to distill the wisdom of crowds, and helping to create reference prices for auctions to clear more easily and predictably.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dun Analytics","content":"ORGANIZATION"},{"type":"BAYC","content":"ORGANIZATION"},{"type":"Yacht Club","content":"ORGANIZATION"},{"type":"Sotheby","content":"ORGANIZATION"},{"type":"Wisdom Seekers","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Lithium Finance","content":"ORGANIZATION"},{"type":"August 2021","content":"DATE"},{"type":"mid-April","content":"DATE"},{"type":"3749","content":"DATE"},{"type":"5809","content":"DATE"},{"type":"BAYC NFT","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"5800%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"David Lighton","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"Floor Price of BAYC<\/span><\/i> <i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Figure","content":"ORGANIZATION"},{"type":"Lithium Finance Wisdom Node Dashboard","content":"ORGANIZATION"},{"type":"Sothebys.com","content":"LOCATION"},{"type":"summer","content":"DATE"},{"type":"summer of 2020","content":"DATE"}],"hashtag":[],"authors":["Sponsored","The Block"]}