{"summary":"Genesis interim CEO thanked clients for their support in a letter following the firm&#x27;s bankruptcy filing.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/204190\/genesis-aims-to-move-quickly-and-efficiently-to-exit-bankruptcy-interim-ceo-says","publishDate":"2023-01-20T10:04:35","id":467,"type":null,"title":"Genesis aims to move &#x27;quickly and efficiently&#x27; to exit bankruptcy, interim CEO says","category":["COMPANIES"],"content":["Genesis has a roadmap to exit bankruptcy and hopes to do so as \"quickly and efficiently as possible,\" interim CEO Derar Islim told clients this morning in a letter obtained by The Block.&nbsp;","\"Our goal is to move through the Chapter 11 process as quickly and efficiently as possible while reaching the best outcome and emerging well-positioned for the future,\" Islim wrote in the letter hours after the company <a href=\"https:\/\/www.theblock.co\/post\/190311\/digital-currency-groups-genesis-global-files-for-bankruptcy-protection\" data-v-f87c67ca=\"\">filed<\/a>&nbsp;for Chapter 11 bankruptcy protection.&nbsp;","The firm <a href=\"https:\/\/www.theblock.co\/post\/204035\/genesis-owes-more-than-3-6-billion-to-top-50-creditors\" data-v-f87c67ca=\"\">owes<\/a> its top creditors $3.6 billion, according to its bankruptcy filing.&nbsp;","Redemptions and new loan originations at the lending business remain suspended, and all client claims will now be addressed through the Chapter 11 process, according to the letter. Islim noted the firm \"intends to establish a customary claims process for clients.\" The Chapter 11 process means there's an automatic stay that prevents Genesis from paying out on any claims to its lending customers.","The firm took a financial hit following the collapses of the crypto hedge fund Three Arrows Capital and the FTX exchange last year — which Islim highlighted in his letter.","The firm halted withdrawals and new loan originations from its lending affiliate on Nov. 16. Genesis told clients on Jan. 4 that it was continuing to work toward finding a solution for the troubled borrowing and lending unit and that it needed more time to do so.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$3.6 billion","content":"MONEY"},{"type":"Jan. 4","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Nov. 16","content":"DATE"},{"type":"Derar Islim","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["BANKRUPTCY FILINGS","CAMERON &AMP; TYLER WINKELVOSS","CRYPTO BANKS AND LENDERS"],"authors":["Adam Morgan McCarthy","The Block"]}