{"summary":"Richard Teng was named CEO of Binance on Tuesday after Changpeng Zhao stepped down following criminal charges in the U.S. ","author":["Timmy Shen","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/264174\/meet-richard-teng-a-primer-on-the-new-ceo-of-worlds-largest-crypto-exchange","publishDate":"2023-11-21T21:43:18","id":467,"type":null,"title":"Meet Richard Teng. A primer on the new CEO of world&#x27;s largest crypto exchange","category":["Companies"],"content":["<span data-v-f87c67ca=\"\">Richard Teng, a Singaporean industry veteran poached by Binance in 2021 to bolster its global compliance work, <\/span><a href=\"https:\/\/www.theblock.co\/post\/264120\/binance-names-richard-teng-as-new-ceo-as-founder-cz-admits-mistakes\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">succeeded Changpeng Zhao<\/span><\/a><span data-v-f87c67ca=\"\"> today as the chief executive officer of the world’s largest crypto exchange.<\/span>","<span data-v-f87c67ca=\"\">Teng, who first <\/span><a href=\"https:\/\/www.theblock.co\/linked\/115302\/binance-singapore-ceo-sgx-regulatory-officer\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">joined Binance<\/span><\/a><span data-v-f87c67ca=\"\"> as CEO of Binance Singapore, was only appointed as head of regional markets as recently as May this year, following roles including head of MENA. In a <a href=\"https:\/\/www.binance.com\/en\/blog\/leadership\/bio-richard-teng-binances-new-ceo-6819833624741779461\" data-v-f87c67ca=\"\">statement<\/a> released today, Binance said Teng has held roles looking after the MENA region, the European region and ultimately all regions outside of the U.S. <\/span>","<span data-v-f87c67ca=\"\">Prior to joining Binance, Teng <\/span><span data-v-f87c67ca=\"\">served as the CEO of the Financial Services Regulatory Authority at Abu Dhabi Global Market. He has also served as the chief regulatory officer at the SGX, where he led the regulation division in charge of policy framework relating to listing, trading and clearing activities.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Teng also has extensive regulatory experience. He worked for 13 years at the Monetary Authority of Singapore, the finance watchdog, with roles including director of corporate finance, according to his LinkedIn page.<\/span>","<span data-v-f87c67ca=\"\">During his tenure at the MAS, he was closely involved in regulatory matters spanning banking, insurance and capital market segments. That included the broad-ranging transformation of Singapore's financial services sector in the late 1990s, where he led efforts to develop private banking and capital market sectors.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“To ensure a bright future, I intend to use everything I’ve learned over the past three decades of financial services and regulatory experience to guide our remarkable, innovative, and committed team,” Teng said today in a <\/span><a href=\"https:\/\/twitter.com\/_RichardTeng\/status\/1727066202047164562\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">post<\/span><\/a><span data-v-f87c67ca=\"\"> on X.<\/span>","<span data-v-f87c67ca=\"\">He said he will focus on reassuring users that they can remain confident in the financial strength, security and safety of the company. He’ll also work to collaborate with regulators to “uphold high standards globally that foster innovation while providing important consumer protections.”<\/span>","<span data-v-f87c67ca=\"\">“<\/span><span data-v-f87c67ca=\"\">Richard is a highly qualified leader and, with over three decades of financial services and regulatory experience, he will navigate the company through its next period of growth,” <\/span><span data-v-f87c67ca=\"\">Changpeng Zhao, who stepped down as CEO on Tuesday, wrote in a <\/span><a href=\"https:\/\/twitter.com\/cz_binance\/status\/1727063503125766367\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">post<\/span><\/a><span data-v-f87c67ca=\"\"> on X.<\/span><span data-v-f87c67ca=\"\"> “He will ensure Binance delivers on our next phase of security, transparency, compliance, and growth.”<\/span>"],"hashtag":["BINANCE","SEC"]}