{"summary":"Nearly 40% of companies surveyed by Deloitte have already implemented blockchain technology to improve their processes, but challenges remain for greater adoption.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/68610\/deloitte-nearly-40-of-surveyed-firms-have-implemented-blockchain-but-barriers-remain-for-greater-adoption","publishDate":"2020-06-17T09:25:13","id":4675,"type":null,"title":"Deloitte: Nearly 40% of surveyed firms have implemented blockchain, but barriers remain for greater adoption","category":["LAYER 1S"],"content":["Nearly 40% of companies surveyed by Deloitte have already implemented blockchain technology to improve their processes, but challenges remain for greater adoption.","Deloitte <a href=\"https:\/\/www2.deloitte.com\/content\/dam\/insights\/us\/articles\/6608_2020-global-blockchain-survey\/DI_CIR%202020%20global%20blockchain%20survey.pdf\" data-v-f87c67ca=\"\">surveyed<\/a> around 1,500 senior executives across 14 countries and found that more companies have put money and resources on blockchain this year as compared to last year. In 2019, 23% of respondents said they had incorporated blockchain. This year’s figure (39%) is a “substantial jump”, said the “Big Four” consulting giant.","“While blockchain was once classiﬁed as a technology experiment, it now represents a true agent of change that is,” said Deloitte. Blockchain has “evolved\" and is now “solidly entrenched in the strategic thinking of organizations across industries,” according to Deloitte’s global and U.S. blockchain leader Linda Pawczuk.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","Given the tech's potential, blockchain is now one of the top five strategic priorities for most organizations (55%), according to the survey. That’s a slight increase from 53% in 2019 and 43% in 2018.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nTop five use cases that are an area of focus for surveyed companies are digital currencies, data access\/sharing, data reconciliation, identity protection and payments.","As more respondents look to explore blockchain applications, 82% of them are hiring staff with blockchain expertise or plan to do so within the next 12 months (last year that figure was 73%). Further, this year, 83% of respondents indicated their companies would lose competitive advantage if they don't adopt blockchain (versus 77% in 2019).<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","But challenges to blockchain adoption remain. These include implementation barrier i.e. replacing existing systems, potential security threats, concerns over sensitivity of competitive information, lack of regulatory clarity, and more.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"next 12 months (last year","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"43%","content":"PERCENT"},{"type":"53%","content":"PERCENT"},{"type":"23%","content":"PERCENT"},{"type":"55%","content":"PERCENT"},{"type":"77%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"83%","content":"PERCENT"},{"type":"2019","content":"DATE"},{"type":"82%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"73%","content":"PERCENT"},{"type":"39%","content":"PERCENT"},{"type":"Linda Pawczuk","content":"PERSON"},{"type":"Deloitte","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}