{"summary":"Hydra Ventures DAO is shaking up the world of fund-of-funds investing. Its backers include 1kx, ConsenSys and Seed Club.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/223373\/hydra-ventures-dao-fund","publishDate":"2023-03-29T09:00:31","id":4677,"type":null,"title":"Hydra Ventures DAO raises $10 million for fresh take on fund of funds","category":["VENTURE CAPITAL"],"content":["Decentralized autonomous organization Hydra Ventures is shaking up the world of fund-of-funds investing with a new model for the crypto industry.","Hydra Ventures DAO is the brainchild of pseudonymous venture investor Pet3rpan, a partner at venture firm 1kx. The decentralized organization has raised $10 million from investors to build a DAO that will back other investment DAOs. Investors in Hydra Ventures include 1kx, Collab+Currency, ConsenSys and Seed Club, the release said.","DAOs, collective organizations with no central authority that use blockchain technology for governance, are still relatively nascent. Data on DeepDAO <a href=\"https:\/\/deepdao.io\/organizations\" data-v-f87c67ca=\"\">show<\/a>&nbsp;over 40 already exist.","Pet3rpan helped pioneer one of the first investment DAOs, MetaCartel Ventures, which has 75 members and deployed over $13 million into more than 70 projects, including Gitcoin and Gnosis Safe. He initially viewed the fast deployment pace of investment DAOs as \"more of a bug than a feature.\" Now he sees it as an advantage.","\"As time went on, we realized that investment DAOs are really amazing vehicles for indexing exposure across a certain ecosystem or market focus,\" he said.","Hydra Ventures will invest in between 30 to 40 DAOs — with a goal of investing up to 10% into the investment DAO itself. It's already made one investment so far, which is yet to be announced, and it plans to incubate a handful of investment DAOs as part of the process, Pet3rpan said.","Its core team includes members from 1kx, MetaCartel Ventures and Thing3, who bring existing investment DAO knowledge from building out MetaCartel Ventures.","For example, Pet3rpan expected member coordination to be one of the biggest challenges with MetaCartel Ventures but instead found tax, accounting and legal to be the real nightmare, he said. Hydra Ventures will integrate Thing3, an operations-focused service DAO, to solve this problem.","\"The core team of <span class=\"marka0ik0slu8\" data-markjs=\"true\" data-ogac=\"\" data-ogab=\"\" data-ogsc=\"\" data-ogsb=\"\" data-v-f87c67ca=\"\">Hydra<\/span> <span class=\"mark4wofp8rt4\" data-markjs=\"true\" data-ogac=\"\" data-ogab=\"\" data-ogsc=\"\" data-ogsb=\"\" data-v-f87c67ca=\"\">Ventures<\/span> DAO is a well-connected, ambitious group with a proven track record of identifying and investing in projects that become foundations for everyday users,\" said Stephen McKeon, managing partner at Collab+Currency, in the release. \"The venture DAO space is nascent and constantly evolving — so, to us,&nbsp;<span class=\"marka0ik0slu8\" data-markjs=\"true\" data-ogac=\"\" data-ogab=\"\" data-ogsc=\"\" data-ogsb=\"\" data-v-f87c67ca=\"\">Hydra<\/span> is well positioned to pioneer the DAO fund of funds model.\"","The DAOs that will likely secure backing from Hydra will be those with a substantial investment thesis, Pet3rpan said.","\"People who are really passionate about a certain market domain or space really do have an advantage in investing in deal flow and due diligence and access than most venture funds if they are people on the ground,\" Pet3rpan. \"And I think that's a core thesis for Hydra.\"","Pet3rpan started raising for the DAO in June last year and closed the raise in January. The funds will be stored in a diversified set of stablecoins with plans to deploy the funds over three years instead of in perpetuity, like MetaCartel Ventures.&nbsp;","\"I think the cool thing about Hydra is that for the first time ever we have builders operating a fund of funds,\" Pet3rpan said. \"Just ironic because most people who operate fund of funds come from an institutional capital background and I think this is the first science experiment where we see very active direct ecosystem participants operate fund of funds in a very crypto native way.\"","<em data-v-f87c67ca=\"\">This story has been updated to correct the spelling of Pet3rpan's name<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Hydra Ventures","content":"ORGANIZATION"},{"type":"Gnosis","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$13 million","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"January","content":"DATE"},{"type":"Seed Club","content":"ORGANIZATION"},{"type":"Collab+Currency","content":"ORGANIZATION"},{"type":"Hydra<\/span> <span class=\"mark4wofp8rt4\" data-markjs=\"true\" data-ogac=\"\" data-ogab=\"\" data-ogsc=\"\" data-ogsb=\"\" data-v-f87c67ca=\"\">Ventures<\/span> DAO","content":"ORGANIZATION"},{"type":"Hydra","content":"ORGANIZATION"},{"type":"Hydra Ventures DAO","content":"ORGANIZATION"},{"type":"Stephen McKeon","content":"PERSON"},{"type":"DAO","content":"ORGANIZATION"},{"type":"June last year","content":"DATE"},{"type":"Gitcoin","content":"PERSON"},{"type":"$10 million","content":"MONEY"},{"type":"MetaCartel Ventures","content":"ORGANIZATION"}],"hashtag":["DAOS","GOVERNANCE VOTES","NEW VC FUNDS","SEED &AMP; PRE-SEED"],"authors":["Kari McMahon","The Block"]}