{"summary":"Like much of crypto, consumer rights for NFT buyers and sellers is still a gray area.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/206093\/test-drive-porsche-nfts-include-14-day-return-policy-regardless-of-floor-price","publishDate":"2023-01-27T05:48:29","id":4678,"type":null,"title":"Test drive: Porsche NFTs include 14-day return policy, regardless of floor price","category":["CRYPTO ECOSYSTEMS"],"content":["Porsche set a precedent in NFT land with the inclusion of a 14-day return period in the terms of its debut collection.&nbsp;","Despite the fact that consumer laws have been in play for EU and UK customers since before NFTs were created, the idea that you could return an NFT for the full amount you paid, even if the floor price has gone to zero, has set Twitter abuzz.&nbsp;","The laws, known as \"distance selling regulations,\" include digital goods and downloads, including books and in-game purchases.","Public mint is live!​<br data-v-f87c67ca=\"\">\n→ <a href=\"https:\/\/t.co\/gDi9408OjH\" data-v-f87c67ca=\"\">https:\/\/t.co\/gDi9408OjH<\/a> <a href=\"https:\/\/t.co\/WhQIoi9pfh\" data-v-f87c67ca=\"\">pic.twitter.com\/WhQIoi9pfh<\/a>","<script async=\"async\" src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\" data-v-f87c67ca=\"\"><\/script>","Like much of crypto, consumer rights for NFT buyers and sellers is a grey area. If it is enforceable, this legal technicality may potentially prevent projects from pulling the rug from under unsuspecting jpeg buyers.&nbsp;","It has been a rocky ride for Porsche's web3 team this week, as its initial NFT drop of <a href=\"https:\/\/opensea.io\/collection\/porsche-911\" data-v-f87c67ca=\"\">model 911 vehicle<\/a>-inspired tokens fell short of selling out. The digital assets failed to reach classic status, as the initial mint price of 0.911 ETH (or about $1,430 at the time of writing) and lack of a clear roadmap put many off.&nbsp;","The fast-car designers had partnered with Hamburg-based designer and 3D artist Patrick Vogel to create a customizable image of Porsche's 911 model.","Following a lacklustre mint, the German automobile maker decided to cut the supply of NFTs, after intending to mint 7,500.","There are now only 2,363 items in circulation, and a floor price of 1.9 ETH.","It also laid out its roadmap on Wednesday, which said it would give collectors access to events and experiences in the coming months.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Porsche","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"Hamburg","content":"LOCATION"},{"type":"$1,430","content":"MONEY"},{"type":"Patrick Vogel","content":"PERSON"}],"hashtag":[],"authors":["Lucy Harley-McKeown","The Block"]}