{"summary":"The theft appears to have occurred on unofficial APK package downloads that were hijacked and installed with code implanted by hackers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/197914\/bitkeep-crypto-wallets-hacked-after-thieves-create-unofficial-android-app","publishDate":"2022-12-26T07:50:05","id":4679,"type":null,"title":"BitKeep crypto wallets hacked after thieves create &#x27;unofficial&#x27; Android app","category":["SECURITY"],"content":["BitKeep user wallets have been hacked and funds stolen.","The theft appears to have occurred on unofficial APK package downloads that were hijacked and installed with code implanted by hackers. Some $8 million in assets have been <a href=\"https:\/\/twitter.com\/PeckShieldAlert\/status\/1607266917894737921\" data-v-f87c67ca=\"\">stolen<\/a>, according to PeckShield, a blockchain security services company.","\"Today's currency theft incident is mainly due to the hijacking of 7.2.9 APK. If you are using the APK version, it is very likely that it is not the official version. So please transfer the funds to BitKeep Chrome plug-in wallet as soon as possible, or the app downloaded from the official store, and create a new wallet address and keep your mnemonic phrase safe,\" the <a href=\"https:\/\/bitkeep.com\/en\/index\" data-v-f87c67ca=\"\">firm<\/a> said in a Telegram chat.&nbsp;&nbsp;","BitKeep didn't immediately respond to requests for comment via Telegram.","BitKeep urged those using the APK version of the app to transfer the funds to a wallet downloaded from another official store such as the App Store or Google Play.&nbsp;","\"If your wallet is stolen, please submit relevant materials in the form as soon as possible, we will figure out the solution and assist as soon as possible,\" BitKeep said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"PeckShield","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BitKeep","content":"PERSON"},{"type":"Google","content":"ORGANIZATION"},{"type":"$8 million","content":"MONEY"},{"type":"BitKeep Chrome","content":"ORGANIZATION"}],"hashtag":["HACKS"],"authors":["Christiana Loureiro","The Block"]}