{"summary":"The plaintiff allegedly purchased 200 bitcoin in 2011, and when he eventually sought to retrieve it years later, found the exchange had been out of business since 2013\nThe bitcoin was purchased for $3,000 in 2011 and would now be worth about $2 million\nThe case was ultimately dismissed because the plaintiff failed to meet alter ego requirements when he chose to sue the CEO of the exchange rather than the entity itself","author":["Stephen D. Palley","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/32619\/plaintiff-loses-2-million-in-btc-sees-case-dismissed-after-missing-the-point-entirely","publishDate":"2019-07-19T17:15:23","id":468,"type":null,"title":"Plaintiff loses $2 million in BTC, sees case dismissed after &#x27;missing the point entirely&#x27;","category":["Legal"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]<\/strong><\/em> <em data-v-f87c67ca=\"\"><strong class=\"br\" data-v-f87c67ca=\"\">Srinvasan v. Kenna, 2019 U.S. Dist. LEXIS 119253 (4:18-cv-03977-HSG N.D.Cal., 7\/17\/2019) [SDP]<\/strong><\/em>","This case involves an alleged bitcoin loss. Plaintiff says he bought 200 bitcoin in July 2011 from a website for which defendant was the CEO. At the time, bitcoin was trading for about $15. Plaintiff filed a lawsuit in California state court in 2018 and it was then removed to Federal Court for the Northern District of California. At issue is where this bitcoin, purchased for $3,000 and is now worth roughly $2 million.","The factual allegations in a nutshell are that (1) Plaintiff bought the bitcoin via the exchange in 2011, (2) asked to get it back in 2013 but got no response, (3) then forgot that he bought it while in a PhD program, (4) remembered he bought it in 2017 when bitcoin went up in value by a lot, (5) learned that the exchange had gone the way of all flesh, had been out of business since 2013, and no-one had told him.","The Complaint was amended a bunch of times, including most recently on April 2, 2019. That version of the lawsuit includes a single count for Conversion. We’ve talked about this tort before and it’s a civil cause of action that you can use when you allege that someone stole your stuff. You usually can’t use it for money (subject to some exceptions that we don’t need to worry about here) and can only be applied to identifiable assets. Some courts have allowed conversion claims to be used for allegedly purloined bitcoin. Plaintiff says that because of subsequent forks in bitcoin he’s also entitled to return of bitcoin gold and bitcoin cash (this isn’t quite a boilerplate claim but it’s not the first time we’ve seen this damages claim it by a long shot).","Whether bitcoin can be converted for purposes of a motion to dismiss actually isn’t at issue in this ruling though, in which the Court dismissed with prejudice the second amended complaint. With prejudice means the plaintiff doesn’t get to try again. His only remedy is the court of appeals.","Anyway, the problem here is that in the Court’s eyes was that even after multiple amendments it was still all fakatka. Plaintiff sued the CEO of the exchange himself, personally, but didn’t sue the exchange. The court said that because plaintiff failed to plead alter ego\/corporate veil piercing theories against the CEO the case had to be dismissed.","As the Court puts it: “Plaintiffs miss the point entirely. It is beside the point that Plaintiffs did not name Tradehill as a defendant. Indeed, Plaintiffs must plead alter ego because they brought suit against Tradehill’s CEO, rather than Tradehill itself. And they cannot handwave the alter ego requirements — which this Court plainly stated were necessary in its dismissal order — by stating that they are pleading conversion against Kenna himself, without having pled any facts attributable to Kenna other than acts purportedly performed by him as CEO of Tradehill.”","In short, stale and hand-wavey claims translated into not getting past the start line for a multi-million dollar bitcoin conversion claim. Bad day for the plaintiff. When asked for comment, the CEO of Bitcoin did not return our calls.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part I of this week's analysis, Crypto Caselaw Minute, is above.<\/em>"],"hashtag":[]}