{"summary":"A transaction has caused issues for Bitcoin collectibles project Ordinals, as it faces difficulty with its inscription numbering system.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229653\/bitcoin-ordinals-inscription-numbering-challenge","publishDate":"2023-05-05T06:26:40","id":4688,"type":null,"title":"Bitcoin Ordinals faces new challenge after developer inserts bug to throw out numbering","category":["CRYPTO ECOSYSTEMS"],"content":["<a href=\"https:\/\/www.theblock.co\/post\/207086\/what-are-bitcoin-nfts-ordinals-and-how-do-they-work\" data-v-f87c67ca=\"\">Ordinals<\/a>, the system by which digital collectibles are written onto the Bitcoin blockchain, is facing a new challenge after a developer found a way to introduce a bug into the metadata.&nbsp;","The problem occurred when a developer known as Supertestnet initiated a <a href=\"https:\/\/mempool.space\/tx\/c1e0db6368a43f5589352ed44aa1ff9af33410e4a9fd9be0f6ac42d9e4117151\" data-v-f87c67ca=\"\">transaction<\/a> that didn’t output a satoshi (the smallest unit of a bitcoin) but was seen as valid in the Ordinals system. As a result, it knocked the numbering system that Ordinals uses for its inscriptions off by one.&nbsp;","“It shouldn't be possible to inscribe sats that you don't own, so this is a bug. However, fixing the bug by making [Ordinals] ignore this inscription would change inscription numbers after the curious transaction. I'm honestly not sure what to do!” said Ordinals creator Casey Rodarmor on <a href=\"https:\/\/github.com\/casey\/ord\/issues\/2062\" data-v-f87c67ca=\"\">GitHub<\/a>.","<a href=\"https:\/\/www.theblock.co\/post\/228882\/bitcoin-transactions-inscriptions-record\" data-v-f87c67ca=\"\">Ordinals<\/a> provide a way to store NFTs on Bitcoin after network upgrades made it easier and cheaper to store larger amounts of data.&nbsp;Inscriptions are the metadata added to satoshis that may include information as digital entries on Bitcoin's distributed public ledger.","Supertestnet also <a href=\"https:\/\/github.com\/supertestnet\/breaker-of-jpegs\" data-v-f87c67ca=\"\">released<\/a> a tool and related instructions for anyone else who wants to create the same types of problematic transactions. They illustrated their GitHub post with an image reading \"I am become Supertestnet, destroyer of JPEGs.\"","<span data-v-f87c67ca=\"\">Source: GitHub<\/span>","The bug isn't a huge problem as it doesn’t break the main Ordinals system of tracking satoshis, which are linked to collectibles, argued Danny Diekroeger, founder of Bitcoin Lightning platform Deezy. Instead, it refers to inscription numbers, a vanity metric marking the order in which each Ordinal collectible was created.&nbsp;","“This is totally fine,\" Diekroeger <a href=\"https:\/\/twitter.com\/dannydiekroeger\/status\/1654259992596484096\" data-v-f87c67ca=\"\">said<\/a> on Twitter. \"In fact, I think inscription numbers were broken already early on anyway.”&nbsp;","His view was backed by a developer known as Rijndael who said there shouldn’t be any impact on the actual Ordinals themselves, only the inscription numbering system.","Diekroeger also noted that the original transaction contained an inscription that promoted an alternative system for creating collectibles on Bitcoin called Soma.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Casey Rodarmor","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Diekroeger","content":"PERSON"},{"type":"Ordinals","content":"ORGANIZATION"},{"type":"Danny Diekroeger","content":"PERSON"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"GitHub","content":"ORGANIZATION"},{"type":"Soma","content":"LOCATION"}],"hashtag":["BITCOIN"],"authors":["Tim Copeland","The Block"]}