{"summary":"Federal prosecutors and Sam Bankman-Fried have neared an agreement to modify his bail conditions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/217181\/prosecutors-say-sbf-should-only-access-approved-websites-he-wants-door-dash-and-the-new-york-post","publishDate":"2023-03-04T14:23:32","id":469,"type":null,"title":"Prosecutors say SBF should only access approved websites. He wants Door Dash and the New York Post","category":["POLICY"],"content":["Federal prosecutors are seeking to severely limit former FTX CEO Sam Bankman-Fried's connection to the internet and technological access to a \"flip phone or other non-smartphone\" while awaiting trial on a litany of charges connected to the collapse of the cryptocurrency exchange.&nbsp;","Prosecutors sought the restrictions in a <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.nysd.590940\/gov.uscourts.nysd.590940.100.0.pdf\" data-v-f87c67ca=\"\">March 3 letter <\/a>to the court after it was disclosed&nbsp;that Bankman-Fried had used encrypted messaging apps and a virtual private network (VPN) while on bail. Bankman-Fried faces trial this fall.","According to the letter, the two sides propose that Bankman-Fried be restricted to a select list of whitelisted websites, as well as online tools related to his defense. These tools include Zoom, government websites and several blockchain data explorers.&nbsp;","Proposed personal-use sites include news sites like Bloomberg, the New York Post and The Block, streaming services Netflix and Spotify, and consumer delivery apps Uber Eats and Door Dash.","","","The government said it had determined that the personal use sites \"do not pose a risk of danger to the community, including because they lack a private communication platform and do not pose a risk of accessing\/transferring cryptocurrency assets.\"&nbsp;","Other elements of the arrangement include a prohibition on purchasing new electronics that enable internet access and the installation of activity-monitoring software on Bankman-Fried's laptop. He is required to register his electronics with the court.&nbsp;","Bankman-Fried is living with his parents, who will also have their personal devices registered with the court and outfitted with monitoring software.","<i data-v-f87c67ca=\"\">The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York","content":"LOCATION"},{"type":"Alameda","content":"LOCATION"},{"type":"fall","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"Netflix","content":"ORGANIZATION"},{"type":"VPN","content":"ORGANIZATION"},{"type":"March 3","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}