{"summary":"Binance is facing criticism over its handling of a 2021 rug pull scam and lack of communication regarding frozen BNB.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239439\/binance-criticism-rug-pull-frozen-funds","publishDate":"2023-07-13T16:46:12","id":4693,"type":null,"title":"Binance faces criticism over handling of rug pull incident and frozen funds","category":["COMPANIES"],"content":["Binance is under scrutiny for its handling of a 2021 rug pull incident, which left victims with a loss of $15 million worth of BNB at today’s valuation.","It's now been two and a half years since the crypto exchange allegedly froze the stolen funds, with community members criticizing Binance over a lack of communication on what's happened to it.","The issue revolves around PopcornSwap, a protocol released on BNB Chain in January 2021 that performed a liquidity siphon <a href=\"https:\/\/twitter.com\/BSCNews\/status\/1354880400984739842?s=20\" data-v-f87c67ca=\"\">scam<\/a> in a near-instant rug pull upon launch, stealing tokens worth over $2 million at the time. BNB Chain-dedicated news outlet BSC News, which is partly supported by Binance’s accelerator fund, seems to have removed its coverage of the incident from 2021, though the <a href=\"https:\/\/web.archive.org\/web\/20230128074026\/https:\/\/www.bsc.news\/post\/popcornswap-liquidity-siphon-rugpull\" data-v-f87c67ca=\"\">page<\/a> is still available on a web archive.","Typically, liquidity siphon rug pulls involve developers creating a new token and launching it on a decentralized exchange (DEX) platform. They attract liquidity by incentivizing users to provide their funds to the liquidity pool, which allows others to trade the token. However, malicious actors ultimately intend to drain the liquidity and steal the funds.","While Binance was able to freeze users’ assets on the BNB Chain mid-rug pull, temporarily stopping the damage, some two and a half years later, “the aftermath revealed an alarming lack of remediation for the affected users,” a community member known as “Neonmatrixbot” <a href=\"https:\/\/twitter.com\/neonmatrixbox\/status\/1673378841031589910?s=20\" data-v-f87c67ca=\"\">said<\/a> on Twitter. “There has been no communication since.”","Neonmatrix suggested the absence of communication and action to address the situation raises concerns about Binance's “customer first” ethos and centralized interference with the BNB Chain without resolution for users. “It shows them selectively interfering with on-chain transactions as a centralized body and, when they did, not following through for a complete resolution,” Neonmatrixbot added.","Pointing to Binance's alleged ability to get the tokens frozen on BNB Chain and the potential for token burns and re-issuance, Neonmatrixbot questioned why a resolution was not forthcoming.","“In a normal blockchain world, it would be game over,\" they said. \"But Binance has shown the ability to freeze the tokens on their chain. And, with the periodic token burns, there's an opportunity for them to burn the frozen tokens and reissue them to the originators.”","However, despite attempts by the community to engage Binance directly through various channels, including DMs, support tickets, tweets to Binance’s CEO Changpeng “CZ” Zhao and reaching out to reputable lawyers, they have been met with silence, Neonmatrixbot said.","The community of affected users also set up the PopcornSwap Rugpull channel on <a href=\"https:\/\/t.co\/rx0fLV7lql\" data-v-f87c67ca=\"\">Telegram<\/a>, with members expressing frustration at their attempts to engage with Binance being ignored.","“We've tried the direct approach by reaching out to Binance here, on Twitter and through tickets. I have also been in contact with people here who have tried involving lawyers from reputable firms, and yet, we've gotten nowhere,\" channel member “Penguin Antarctica” <a href=\"https:\/\/t.co\/rx0fLV7lql\" data-v-f87c67ca=\"\">said<\/a> on Telegram. “Given the complexity of the other issues Binance is dealing with, I understand that Binance might have a lot on their plate, but the lack of response is discouraging, to say the least.”","Fellow Telegram channel member “Madden” agreed, adding that “they aren't going to do anything just to be nice guys.”","Neonmatrixbot did praise the positive step Binance took in originally freezing the attacker’s wallet after the hack occurred but again criticized the lack of response since.","“We deserve answers,” they said.&nbsp;","However, “it's essential to highlight that Binance has demonstrated the ability to stop the BNB Chain during the big hack incident. This raises questions about their intentions and transparency, which regulators and the public should be aware of,” Neonmatrixbot added.","The criticism comes at a time when Binance is dealing with regulatory issues in the U.S. and Europe. The Securities and Exchange Commission <a href=\"https:\/\/www.theblock.co\/post\/233146\/us-sec-sues-binance-ceo-zhao-for-breaking-securities-rules\" data-v-f87c67ca=\"\">filed<\/a> a lawsuit against Binance in June, alleging it had violated U.S. securities laws.","Last month, Binance announced it was <a href=\"https:\/\/www.theblock.co\/post\/235084\/binance-exits-the-netherlands\" data-v-f87c67ca=\"\">exiting<\/a> the Netherlands after failing to acquire regulatory approval. It also applied to <a href=\"https:\/\/www.theblock.co\/post\/234617\/binance-cyprus-deregister\" data-v-f87c67ca=\"\">deregister<\/a> its local entity in Cyprus and is reportedly under <a href=\"https:\/\/www.theblock.co\/post\/235129\/binance-is-under-investigation-in-france-for-alleged-money-laundering-le-monde\" data-v-f87c67ca=\"\">investigation<\/a> in France for alleged money laundering.","“This situation becomes more troubling when considering Binance's increasing scrutiny from regulatory bodies and governments. It raises questions about their operational practices and the prioritization of user protection,” Neonmatrix added.","Binance initially did not respond to multiple requests for comment from The Block.","\"BNB Chain is a community-driven, decentralized and censorship-resistant blockchain, powered by BNB. Binance does not control or operate BNB or BNB Chain. It is the community, made up of independent users, developers, validators and delegators who direct the development of BNB and BNB Chain,\" Binance responded post-publication, with a link to a <a href=\"https:\/\/www.bnbchain.org\/en\/blog\/an-overview-of-bnb-chains-security-programs\/\" data-v-f87c67ca=\"\">blog post<\/a> overview of BNB Chain's security programs.","<em data-v-f87c67ca=\"\">Updated with Binance's response post-publication.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Netherlands","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"France","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"January 2021","content":"DATE"},{"type":"$2 million","content":"MONEY"},{"type":"Penguin Antarctica”","content":"ORGANIZATION"},{"type":"a half years later","content":"DATE"},{"type":"BNB Chain","content":"ORGANIZATION"},{"type":"Cyprus","content":"LOCATION"},{"type":"Madden","content":"PERSON"},{"type":"Europe","content":"LOCATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Twitter","content":"DATE"},{"type":"DEX","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"$15 million","content":"MONEY"},{"type":"PopcornSwap Rugpull","content":"ORGANIZATION"},{"type":"Neonmatrixbot","content":"PERSON"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BINANCE","BNB CHAIN","EXPLOITS","HACKS"],"authors":["James Hunt","The Block"]}