{"summary":"Magic Eden laid off 22 people as companies across the industry cut staff amid tough times.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/211269\/magic-eden-lays-off-22-about-15-of-staff-in-latests-workforce-cuts","publishDate":"2023-02-13T21:39:08","id":4694,"type":null,"title":"Magic Eden lays off 22, about 15% of staff in latest workforce cuts","category":["COMPANIES"],"content":["Magic Eden laid off 22 people as companies across the industry cut staff amid industry-wide cuts.","That amounts to about 15% of the company based upon the 141 employees listed on LinkedIn. Magic Eden is the latest crypto company to cut back on its workforce. Last month, Coinbase cut 20% of staff, Digital Currency Group's Luno trimmed 35% and Genesis slashed 30%.","\"Magic Eden has made the difficult decision to part ways with 22 teammates as part of a company-wide restructuring effort,\" CEO Jack Lu said in a statement. \"As we established our priorities for 2023, we took an in-depth look at what structures and roles are needed internally, and had to make hard decisions to find the right mix of roles for us to pursue the next stage of scaling across chains.\"","\"We have expressed to our broader team that the company remains very well capitalized with a long runway even during today’s bear market and we remain confident in the trajectory of Magic Eden in 2023 and beyond.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jack Lu","content":"PERSON"},{"type":"35%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"Coinbase","content":"PERSON"},{"type":"20%","content":"PERCENT"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"Magic Eden","content":"ORGANIZATION"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}