{"summary":"After successfully raising $4.2 million in its seed round, Genius Yield is now launching its Initial Stake Pool Offering (ISPO).","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/127824\/more-than-75-million-ada-already-delegated-in-genius-yields-stake-pools-24h-after-ispo-launch","publishDate":"2021-12-18T09:00:20","id":4695,"type":null,"title":"More than 75 million ADA already delegated in Genius Yield’s stake pools 24h after ISPO launch","category":["SPONSORED"],"content":["<em data-v-f87c67ca=\"\">After successfully raising $4.2 million in its seed round, Genius Yield is now launching its Initial Stake Pool Offering (ISPO).<\/em>","<b data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Zug, Switzerland - December 16, 2021<\/strong><\/b>. After successfully raising $4.2 million in its seed round,&nbsp;<a href=\"https:\/\/www.geniusyield.co\/\" data-v-f87c67ca=\"\">Genius Yield<\/a>&nbsp;is now launching its Initial Stake Pool Offering (ISPO). More than 75 million ADA (worth almost $100 million at the time of writing) have already been delegated into the now four dedicated stake pools, a record number when it comes to similar projects on Cardano.","\"We launched 2 pools 2 weeks ahead of the start of our ISPO and started seeing incredible numbers really fast. We added 2 more as we were nearing the launch to avoid saturation. While we’re confident in our team and what we’re building, seeing our community rising to the occasion by delegating so much so early is encouraging. It means that what we’re trying to achieve really resonates with people.\"","Dr Lars Brünjes, Genius Yield’s CTO and Director of Education at IOHK - the company building Cardano.","For people who are new to the ecosystem, here’s how you can participate to the ISPO:<br data-v-f87c67ca=\"\">\n1. Buy ADA on your favourite exchange<br data-v-f87c67ca=\"\">\n2. Create a Cardano wallet - we recommend&nbsp;<a href=\"https:\/\/yoroi-wallet.com\/#\/\" data-v-f87c67ca=\"\">Yoroi<\/a><br data-v-f87c67ca=\"\">\n3. Transfer your ADA from your exchange to your Yoroi wallet address<br data-v-f87c67ca=\"\">\n4. Delegate your ADA to a GENS stake pool:<br data-v-f87c67ca=\"\">\n- Open up your Yoroi wallet<br data-v-f87c67ca=\"\">\n- Select ‘Delegation List’<br data-v-f87c67ca=\"\">\n- Type ‘GENS’ in the search bar<br data-v-f87c67ca=\"\">\n- Pick a GENS pool and delegate","Genius Yield has opened two new 100% GENS rewards pools: GENS3 and GENS4! New investors should not delegate to GENS1 anymore as it’s already fully saturated: new delegators will not earn GENS rewards while earlier delegators will not be affected.<br data-v-f87c67ca=\"\">\nGENS1, GENS3, and GENS4 pools reward 100% in GENS, while GENS2 rewards 50% in GENS and 50% in ADA. The maximum capacity of each pool is 64 million ADA.","","","While the world of DeFi provides many investment opportunities, managing capital is both complex and time-consuming for most users. That is why Genius Yield is building an all-in-one solution that enables users to benefit from advanced algorithmic trading strategies within an intuitive, hassle-free, and secure platform.","Users will be able to deposit the tokens of their choice and customize their investment strategy based on a number of factors: expected returns, fees they’re willing to pay, risk tolerance, when to take profits, and so on. Genius Yield’s AI-powered Smart Liquidity Management protocol will then maximize their yields while minimizing risk exposure.","In addition to that, the team is also working on launching its Genius Yield Academy in the coming weeks.","\"We believe knowledge is power, hence why we’re building a community-driven educational and mentorship platform that teaches DeFi concepts and supports everyone in their journey towards financial freedom.\"<br data-v-f87c67ca=\"\">\n-Dr. Sothy Kol-Men, co-founder.","Genius Yield ISPO basics:<br data-v-f87c67ca=\"\">\nStart date: December 15th, 2021<br data-v-f87c67ca=\"\">\nEnd date: June 15th, 2022<br data-v-f87c67ca=\"\">\nGENS Rewards: 10 Million GENS<br data-v-f87c67ca=\"\">\nRunning for 36 Epoch (1 epoch = 5 days) &nbsp;","Accumulated GENS rewards will be airdropped to the delegator’s wallet after the Token Genesis Event (time of minting). ADA holders will be able to delegate their funds to a stake pool in exchange for staking rewards. To participate in the ISPO you will simply need to delegate to Genius Yield’s’ stake pools. In return, you will be rewarded with GENS tokens based on the amount of ADA staked and the length of staking.","For more details see Genius Yield’s&nbsp;<a href=\"https:\/\/docs.geniusyield.co\/ispo\/initial-stake-pool-offering-ispo\" data-v-f87c67ca=\"\">ISPO documentation<\/a>.","<b data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">About Genius Yield<\/strong><\/b>","While DeFi provides many investment opportunities, managing capital is both complex and time-consuming. Genius Yield is your all-in-one solution to benefit from advanced algorithmic trading strategies and yield optimization opportunities. Our Smart Liquidity Management protocol is intuitive, hassle-free, and secure. Genius Yield minimizes risk and maximizes profits.","Website:&nbsp;<a href=\"https:\/\/www.geniusyield.co\/\" data-v-f87c67ca=\"\">https:\/\/www.geniusyield.co<\/a>&nbsp;&nbsp;<br data-v-f87c67ca=\"\">\nTelegram:&nbsp;<a href=\"https:\/\/t.me\/geniusyield_officia\" data-v-f87c67ca=\"\">https:\/\/t.me\/geniusyield_official<\/a><br data-v-f87c67ca=\"\">\nDiscord:&nbsp;<a href=\"https:\/\/discord.gg\/aRxX8YEe\" data-v-f87c67ca=\"\">https:\/\/discord.gg\/aRxX8YEe<\/a><br data-v-f87c67ca=\"\">\nMedium:&nbsp;<a href=\"https:\/\/geniusyield.medium.com\/\" data-v-f87c67ca=\"\">https:\/\/geniusyield.medium.com\/<\/a><br data-v-f87c67ca=\"\">\nTwitter:&nbsp;<a href=\"https:\/\/twitter.com\/GeniusyieldO\" data-v-f87c67ca=\"\">https:\/\/twitter.com\/GeniusyieldO<\/a>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"December 16, 2021","content":"DATE"},{"type":"$4.2 million","content":"MONEY"},{"type":"June 15th, 2022","content":"DATE"},{"type":"Switzerland","content":"LOCATION"},{"type":"$100 million","content":"MONEY"},{"type":"Cardano","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"GENS","content":"ORGANIZATION"},{"type":"Genius Yield","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"Sothy Kol","content":"PERSON"},{"type":"December 15th, 2021","content":"DATE"},{"type":"Genius Yield’s CTO","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"Genius Yield Academy","content":"ORGANIZATION"},{"type":"Lars Brünjes","content":"PERSON"},{"type":"ADA","content":"ORGANIZATION"},{"type":"Smart Liquidity Management","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}