{"summary":"Crypto’s rich list now comprises 22 billionaires and 88,200 millionaires, according to Henley &amp; Partners&#x27; new wealth report.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/249478\/crypto-rich-list-22-billionaires-88000-millionaires","publishDate":"2023-09-06T12:00:55","id":4698,"type":null,"title":"Crypto rich list comprises 22 billionaires and 88,000 millionaires, report estimates","category":["PEOPLE"],"content":["A new <a href=\"https:\/\/www.henleyglobal.com\/publications\/crypto-wealth-report\" data-v-f87c67ca=\"\">crypto wealth report<\/a> from residence by investment firm Henley &amp; Partners, in collaboration with global wealth intelligence company New World Wealth, estimates that crypto has now minted 22 billionaires and 88,000 millionaires, totaling over $1 trillion in market value.","The report, which takes a deep dive into the world of crypto assets, private wealth and investment migration trends, also claims that of the 22 billionaires created in crypto, six come from bitcoin wealth alone. Nearly half of the 88,200 millionaires come from bitcoin, and 182 are centimillionaires — holding $100 million or more.","However, to put this into perspective, 88,200 crypto millionaires represent just 0.15% of the estimated 60 million global millionaires, according to the latest <a href=\"https:\/\/www.ubs.com\/global\/en\/family-office-uhnw\/reports\/global-wealth-report-2023.html\" data-v-f87c67ca=\"\">UBS global wealth report<\/a>.","The methodology behind the figures involves New World Wealth tracking the movements and spending habits of over 150,000 high-net-worth individuals, combined with onchain data and public information from crypto exchanges for wealth modeling. Henley &amp; Partners does not disclose the names of individuals on its database.","The study also estimates the total number of users owning crypto worldwide to be 425 million — some 5.3% of the current global population — of which 210 million are bitcoin holders, according to the report.","The study also introduces the \"Crypto Adoption Index,\" ranking countries based on public and infrastructure adoption, innovation, tax and regulatory factors. Singapore, Switzerland and the UAE top the list, indicating these nations have created the most conducive environments for crypto growth.","The U.S. is ranked fifth overall but came first for public and infrastructure adoption combined, followed by Canada and Australia. The UK ranks highest for innovation and technology.","Singapore, Switzerland and the UAE also top Henley &amp; Partners' rankings for the best investment migration programs —&nbsp; allowing digital asset investors to obtain alternative residence permits and citizenships in the countries.","As digital assets continue to gain traction, crypto investment is reshaping the global wealth landscape. Countries that embrace the industry and create a supportive environment will likely see an influx of crypto wealth and investment in the coming years, Henley &amp; Partners said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"5.3%","content":"PERCENT"},{"type":"Switzerland","content":"LOCATION"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"UBS","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Australia","content":"LOCATION"},{"type":"$1 trillion","content":"MONEY"},{"type":"0.15%","content":"PERCENT"},{"type":"Henley &amp; Partners","content":"ORGANIZATION"},{"type":"UAE","content":"ORGANIZATION"}],"hashtag":["BITCOIN"],"authors":["James Hunt","The Block"]}