{"summary":"The crypto industry lost $336 million in Q1 due to hacks and fraud, according to blockchain security firm Immunefi.\nOrbit Bridge and Munchables were the top two exploits, accounting for 43% of the losses alone, though Munchables’ funds were later recovered.","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285312\/crypto-losses-hacks-scams-336-million-usd-q1-immunefi","publishDate":"2024-03-28T09:01:05","id":47,"type":null,"title":"Crypto losses due to hacks and scams hit $336 million in Q1: Immunefi","category":["Crypto Ecosystems"],"content":["The crypto industry has clocked up $336.3 million in losses due to hacks and scams during the first quarter so far, according to the latest <a href=\"http:\/\/immunefi.com\/research\" data-v-f87c67ca=\"\">report<\/a> from web3 bug bounty and security services platform Immunefi.","With nearly <a href=\"http:\/\/and security services platform\" data-v-f87c67ca=\"\">$100 billion<\/a> of total value locked in web3 protocols, DeFi remains a primary target for hackers, accounting for 100% of the exploits identified by Immunefi in Q1, compared to zero for centralized (CeFi) platforms.","The majority of the losses were lost by two projects alone, accounting for a combined $144.5 million, or 43%, of the total. An $81.7 million exploit of cross-chain bridge protocol <a href=\"https:\/\/www.theblock.co\/post\/269809\/orbit-chains-bridge-reportedly-hacked-for-81-5-million\" data-v-f87c67ca=\"\">Orbit Bridge<\/a>, as New Year’s celebrations were underway, represented the largest attack. January witnessed the highest monthly losses in Q1 overall at $133 million.","Book-ending the quarter, the recent $62 million exploit of Blast-based NFT game <a href=\"https:\/\/www.theblock.co\/post\/284883\/web3-gaming-platform-munchables-loses-62-5-million-in-exploit-zachxbt\" data-v-f87c67ca=\"\">Munchables<\/a> was the second-largest attack. However, the funds were <a href=\"https:\/\/www.theblock.co\/post\/284927\/munchables-recovers-62-million-taken-in-security-breach\" data-v-f87c67ca=\"\">recovered<\/a> within 24 hours after the hacker agreed to relinquish the private keys to the wallet holding Munchables’ assets.","In total, $73.9 million (22%) of the stolen funds in Q1 were recovered from seven of the exploits. The number of attacks also dropped 17.6% from 74 in Q1 2023 to 61 in Q1 this year.","However, the $336.3 million in losses represents a 23.1% decrease compared to losses of $437.5 million in the same quarter last year.&nbsp;","“While it's positive that overall losses have decreased, it's essential to note that DeFi faced significant challenges, accounting for 100% of total losses in Q1 2024,” Immunefi founder and CEO Mitchell Amador said. “Particularly, the ecosystem witnessed a considerable volume of losses due to private key compromises, emphasizing the critical need to secure both code and protocol infrastructure.”","Hacks dominated the losses in Q1, accounting for 95.6% ($321.6 million) of the total across 46 incidents, compared to cases of fraud, scams and rug pulls at 4.4% ($14.7 million) over 15 incidents.","Ethereum surpassed BNB Chain to become the most targeted chain again in Q1, with the two networks suffering the majority of the total losses at a combined 73%.&nbsp;","Ethereum witnessed the most individual attacks, with 33 incidents — representing 51% of the losses. BNB Chain witnessed 12 attacks, representing 22% of exploited funds. Arbitrum, Solana, Optimism, Bitcoin, Blast, Polygon, Conflux Network and Base made up the remainder of the incidents.","In December, Immunefi reported that crypto users had lost <a href=\"https:\/\/www.theblock.co\/post\/269349\/crypto-users-lost-1-8-billion-in-2023-hacks-and-scams-immunefi-says\" data-v-f87c67ca=\"\">$1.8 billion<\/a> to hacks and scams for the whole of 2023.","Immunefi claims to have paid more than <a href=\"https:\/\/immunefi.com\/\" data-v-f87c67ca=\"\">$95 million<\/a> in bounties and saved over $25 billion in user funds across protocols like Chainlink, The Graph, Synthetix and MakerDAO."],"hashtag":["EXPLOITS","HACKS","SMART CONTRACTS"]}