{"summary":"Roughly two months after Mastercard and Visa ended their partnership with Binance, it said it will stop service of cards.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/258800\/binance-halting-service-for-european-visa-debit-card","publishDate":"2023-10-20T15:14:48","id":4700,"type":null,"title":"Binance halting service for European Visa debit card","category":["COMPANIES"],"content":["About two months on from Visa and Mastercard ending their partnerships with Binance, the world's largest cryptocurrency trading platform is halting service of its Visa debit card in the European Economic Area.","Consumers that already possess one of the cards will be able to continue using them until Dec. 20, the company announced in a <a href=\"https:\/\/www.binance.com\/en\/support\/faq\/frequently-asked-questions-on-binance-card-eea-program-closure-d6c54984df904db7a0705f2914827381\" data-v-f87c67ca=\"\">blog post<\/a>. The card was aimed at improving consumers' ability to spend digital currency when buying goods and services.","\"With the Binance Card, European residents can convert and spend cryptocurrencies in over 60 million online and physical stores,\" the company had said. Binance also offered cashback bonuses with the card.","Visa and Mastercard's decision to stop work with Binance, announced <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-08-24\/mastercard-to-end-its-binance-co-branded-card-partnership?sref=QkiN9npb\" data-v-f87c67ca=\"\">in August<\/a>, came amid the crypto exchange's ongoing battle with regulators.&nbsp;","While Binance's relationship with the card giants has unraveled, other traditional financial institutions, like <a href=\"https:\/\/www.theblock.co\/post\/250333\/paypal-rolls-out-crypto-for-usd-conversion-service\" data-v-f87c67ca=\"\">PayPal<\/a>, are expanding its interest in digital currencies. For its part, Visa also announced last month that it was <a href=\"https:\/\/www.theblock.co\/post\/249153\/visa-stablecoin-settlement-solana-ethereum\" data-v-f87c67ca=\"\">expanding<\/a> its USDC stablecoin settlement capabilities to Solana, forming partnerships with Worldpay and Nuvei for pilot programs.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dec. 20","content":"DATE"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"European Economic Area","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Binance Card","content":"ORGANIZATION"},{"type":"Worldpay","content":"PERSON"},{"type":"Binance","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["RT Watson","The Block"]}