{"summary":"Since the release of the Bitcoin Blockchain Network in 2010, many new blockchains have been released but none of these blockchains come close to the hottest new release, Core Blockchain Network going live in the coming weeks.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/113885\/core-decentralised-technologies-realising-connectivity-as-a-human-right","publishDate":"2021-08-09T10:12:53","id":4701,"type":null,"title":"Core Decentralised Technologies Realising Connectivity As A Human Right","category":["SPONSORED"],"content":["<strong data-v-f87c67ca=\"\">Since the release of the Bitcoin Blockchain Network in 2010, many new blockchains have been released but none of these blockchains come close to the hottest new release, Core Blockchain Network going live in the coming weeks.<\/strong>","<span data-v-f87c67ca=\"\">Core implemented in its proof-of-work blockchain network the ED448-Goldilocks elliptic curve cryptography, the only blockchain in the world to implement ED448 encryption technology to date. Speaking to Rastislav Vašička, CIO of Core said, \"Goldilocks is popular for its solid performance and security. The ED448 encryption technology allows the Core Blockchain Network to execute transactions with the highest security standards, confirming transactions in around 42 seconds, an ideal network for transacting due to the implementation of banking standards.\" With mining on almost any IoT device at only 6 watts per hour, Core is not only the most affordable fully decentralized proof-of-work blockchain in the world, it is also truly environmentally friendly. \"In short, we can unquestionably say that the Core Blockchain Network is currently the fastest, safest and most affordable, truly scalable decentralized blockchain in the world\" Michael Loubser, Core Decentralized Technologies, Chairman.<\/span>","<span data-v-f87c67ca=\"\">The fast, economical and secure scalable Core Blockchain technology will be the backbone of Core Decentralized Technologies, an entire ecosystem of blockchain based solutions and applications that facilitate effective transacting, data processing and information flow across organizations. The ecosystem comprises of several platforms such as: <\/span><a href=\"https:\/\/coregroup.cc\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Core Group<\/span><\/a><span data-v-f87c67ca=\"\">, a decentralized asset digitization, financial services and settlement platform, Ting, a peer to peer decentralized communications platform and TokToKey, a fully decentralized ecommerce platform, all integrated through the CorePass, a decentralized blockchain based digital identity with integrated digital attributes and digital wallets. The entire Core Decentralized Technologies ecosystem has various forms of AI built on the <\/span><a href=\"https:\/\/lunamesh.com\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Lunaº Mesh<\/span><\/a><span data-v-f87c67ca=\"\"> platform, allowing inclusive worldwide reach of the Core services, in some areas without internet, covering 98% of the globe, including oceans.<\/span>","<span data-v-f87c67ca=\"\">Ockert Loubser, who recently took over the CEO helm from his father Michael said “In our opinion we believe free connectivity is a human right. Lunaº Mesh’s peer to peer communications platform will eventually provide free connectivity for all while bringing Core’s cutting edge ecosystem to everyone in the world.”<\/span>","<span data-v-f87c67ca=\"\">The interoperable Core applications and use cases will be promoted by Core Decentralized Technologies for implementation of blockchain in the real world. Core Decentralized Technologies blockchain software as a service with its uniquely integrated solutions, applications and use cases provides multiple business functions on a single secure blockchain platform of truth and transparency.<\/span>","<span data-v-f87c67ca=\"\">Ockert Loubser CEO, or better Okkie as he likes to be called further added \" As a technology provider, Core Decentralized Technologies allows companies and individuals to manage complex business processes by giving verified access, through its use cases, CorePass, access to real-time insights across the enterprise. As a result, businesses can accelerate workflows, improve operational efficiency, raise productivity, enhance customer experiences – and ultimately increase profits.\"<\/span>","<span data-v-f87c67ca=\"\">Okkie referred us to some videos to have a more in-depth understanding of the entire ecosystem there are several videos available:<\/span>","<span data-v-f87c67ca=\"\">For more information you can go to <\/span><a href=\"https:\/\/codetech.cc\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Core Decentralized Technologies<\/span><\/a>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ting","content":"ORGANIZATION"},{"type":"2010","content":"DATE"},{"type":"Bitcoin Blockchain Network","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Rastislav Vašička","content":"PERSON"},{"type":"98%","content":"PERCENT"},{"type":"\"Goldilocks","content":"LOCATION"},{"type":"Core Decentralized Technologies","content":"ORGANIZATION"},{"type":"Michael Loubser","content":"PERSON"},{"type":"Decentralized Technologies","content":"ORGANIZATION"},{"type":"Michael","content":"PERSON"},{"type":"Core Blockchain Network","content":"ORGANIZATION"},{"type":"Ockert Loubser","content":"PERSON"}],"hashtag":[],"authors":["Sponsored","The Block"]}