{"summary":"The Australian Securities Exchange (ASX) is dropping a long-in-the-making blockchain-powered replacement for its CHESS settlement and clearing system.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/187809\/asx-cancels-years-long-blockchain-settlement-and-clearing-system-project","publishDate":"2022-11-16T18:17:01","id":4702,"type":null,"title":"ASX cancels years-long blockchain settlement and clearing system project","category":["COMPANIES"],"content":["The Australian Securities Exchange (ASX) is dropping a long-in-the-making blockchain-powered replacement for its CHESS settlement and clearing system.","The announcement caps a process subject to <a href=\"https:\/\/www.theblock.co\/post\/69950\/asx-further-delays-launch-of-its-blockchain-settlement-system-this-time-by-one-more-year\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">delays<\/a> and controversy that once appeared to be an early win for enterprise adoption of distributed ledger technology. ASX announced in 2017 that it had tapped blockchain startup Digital Asset Holdings to develop the system to replace CHESS.&nbsp;","ASX will \"will reassess all aspects of the CHESS replacement project following completion of an independent review, conducted by Accenture, and its own internal assessment,\" according to a press statement.&nbsp;","\"The CHESS replacement capitalized software will be de-recognized in light of the solution uncertainty, resulting in a charge of $245-255 million pre-tax ($172-179 million after tax) in 1H23. This will have no impact on dividends,\" ASX said.","That translates into&nbsp; a pre-tax charge of $165 million-$172 million at today's exchange rates.","The firm undertook the process in order to develop \"a post-trade solution that balanced innovation and state-of-the-art technology with safety and reliability,\" ASX Chairman Damian Roche said in a statement.","\"However, after further review, including consideration of the findings in the independent report, we have concluded that the path we were on will not meet ASX’s and the market’s high standards. There are significant technology, governance and delivery challenges that must be addressed.\"","Regulators were critical in <a href=\"https:\/\/asic.gov.au\/about-asic\/news-centre\/find-a-media-release\/2022-releases\/22-320mr-asic-rba-joint-statement-on-asx-chess-replacement-program\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">statements<\/a> following the announcement.","\"The announcement by ASX after many years of investment by both ASX and industry is very disappointing. ASX needs to prioritize developing a new plan to deliver safe and reliable clearing and settlement infrastructure,\" Reserve Bank of Australia Governor Philip Lowe said of the news.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Digital Asset Holdings","content":"ORGANIZATION"},{"type":"ASX","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"$245","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"\" Reserve Bank of Australia","content":"ORGANIZATION"},{"type":"Australian Securities Exchange (ASX","content":"ORGANIZATION"},{"type":"Damian Roche","content":"PERSON"},{"type":"$165 million","content":"MONEY"},{"type":"$172 million","content":"MONEY"},{"type":"Philip Lowe","content":"PERSON"},{"type":"$172","content":"MONEY"},{"type":"Accenture","content":"ORGANIZATION"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}