{"summary":"BAM Trading, the company behind Binance.US, filed a motion Monday to seek a protective order against the SEC.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244886\/binance-asks-for-protective-order-over-claims-sec-is-conducting-fishing-expedition","publishDate":"2023-08-15T00:57:18","id":4707,"type":null,"title":"Binance asks for protective order over claims SEC is conducting ‘fishing expedition’","category":["EXCHANGES"],"content":["<span data-v-f87c67ca=\"\">Binance, the world’s largest cryptocurrency exchange, <a href=\"https:\/\/www.courtlistener.com\/docket\/67474542\/95\/securities-and-exchange-commission-v-binance-holdings-limited\/\" data-v-f87c67ca=\"\">filed a motion<\/a> on Monday to seek a protective order against the U.S. Securities and Exchange Commission, claiming it had provided sufficient information to the regulator.<\/span>","<span data-v-f87c67ca=\"\">BAM Trading, the holding company of Binance.US, and BAM Management submitted a motion for a protective order concerning deposition notices and discovery requests made by the SEC.<\/span>","<span data-v-f87c67ca=\"\">“The SEC has declined BAM’s proposals or to meaningfully limit its requests. The SEC’s position is unreasonable and part of a broader pattern of the SEC abusing the discovery provision of the Consent Order,” BAM wrote in the court filing.<\/span>","<span data-v-f87c67ca=\"\">BAM added that it has offered four witnesses for depositions, including “the two best positioned to address questions about the custody and security of customer assets.”<\/span>","<span data-v-f87c67ca=\"\">“At bottom, the SEC is conducting a fishing expedition instead of seeking the narrow and ‘limited’ discovery authorized by the Consent Order to ensure customer assets are presently secure and available,” BAM added.<\/span>","<span data-v-f87c67ca=\"\">BAM urged the court to issue a protective order limiting the SEC to four depositions of BAM employees, precluding the regulator from questioning witnesses during depositions on matters outside the scope of the consent order and preventing depositions of BAM’s chief executive officer and chief financial officer.<\/span>","<span data-v-f87c67ca=\"\">In June, the SEC <\/span><a href=\"https:\/\/www.theblock.co\/post\/233154\/sec-files-suit-against-binance\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">sued<\/span><\/a><span data-v-f87c67ca=\"\"> Binance and its founder Changpeng Zhao over alleged violations of the country’s securities laws, alleging the crypto exchange lied to customers and misdirected funds to a separate investment fund owned by Zhao.<\/span>","<span data-v-f87c67ca=\"\">Binance <\/span><a href=\"https:\/\/www.theblock.co\/post\/234323\/binanceus-responds-to-fraud-market-manipulation-asset-safeguarding-claims\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said<\/span><\/a> <span data-v-f87c67ca=\"\">it “maintains its customers’ fiat currency in segregated accounts maintained with its banking partners, separate from any corporate funds.” The company acknowledged that Zhao owns BAM Trading’s bank account but claimed he did not have signatory authority over it.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In the Monday filing, BAM said the SEC already has the relief it wants — confirmation that BAM’s customer assets are safe, secure and sufficient to cover any customer claims or liabilities.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Although it has expressed its ‘concerns’ otherwise, the SEC has still yet to identify any evidence suggesting that customer assets were misused or dissipated in any way,” BAM added.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Monday","content":"DATE"},{"type":"BAM Management","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"BAM","content":"ORGANIZATION"},{"type":"Zhao","content":"ORGANIZATION"},{"type":"Changpeng Zhao","content":"PERSON"}],"hashtag":["BINANCE","SEC"],"authors":["Timmy Shen","The Block"]}