{"summary":"Taiwanese electronics manufacturer HTC is working on a new blockchain router that would allow customers to run a full bitcoin node from their home. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/57688\/electronics-manufacturer-htc-to-release-a-blockchain-router-to-let-users-run-a-full-bitcoin-node-at-home","publishDate":"2020-03-04T08:00:07","id":471,"type":null,"title":"HTC to release a blockchain router to let users run a full bitcoin node at home","category":["BITCOIN"],"content":["<span data-v-f87c67ca=\"\">Taiwanese electronics manufacturer HTC is working on a new blockchain router that would allow customers to run a full bitcoin node from their home.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The new device, called EXODUS 5G Hub, is set to launch in Q2. It aims to improve data privacy in the home space by letting users hold on to their own keys through a hardware wallet. The goal, according to HTC decentralized chief officer Phil Chen, is to challenge the dominance of smart devices produced by big tech companies – Amazon Alexa, Google Nest, Facebook, etc. – that leave users’ private data vulnerable.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Today, whenever any app says they’re using end-to-end encryption, they’re using a software key to secure your data or transmission of messages,” Chen told The Block. \"And when you use a software key, that means the key is on the operating system and the cloud companies have access to it.\"<\/span>","<span data-v-f87c67ca=\"\">“Almost every other day, you see another hack, beach, or misuse of data...from emails and credit score to health data and private search data,” he continued.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The blockchain router tries to address this vulnerability by allowing users to run a full bitcoin node through Zion vault, HTC's hardware-backed key management platform. Users will be able to relay transactions independent of any third party. At the same time, each user is contributing to the security of the whole network by helping relay transactions made by others.<\/span>","<span data-v-f87c67ca=\"\">Exodus is known for its blockchain smartphone. The first model, EXODUS 1, was released in December 2018. The company subsequently launched EXODUS 1s, a smartphone capable of running a full bitcoin node, and EXODUS 1-BINANCE, a limited edition phone with built-in support of Binance’s native blockchain.<\/span>","<span data-v-f87c67ca=\"\">“Having crypto in a smartphone is crucial to mass adoption,” Chen said. The router device, on the other hand, addresses a different type of consumer need and focuses on the home space.<\/span>","<span data-v-f87c67ca=\"\">“The home is this temple of privacy. But right now, because of convenience, we’re using voice systems and cameras, so our home is very susceptible to being hacked,\" he said.<\/span>","<span data-v-f87c67ca=\"\">EXODUS 5G Hub has integrated with a number of privacy apps such as email service ProtonMail, open-source Internet browser Brave, decentralized VPN Incognito. The company has also partnered with other ecosystem players, including Binance and decentralized finance (DeFi) products like Compound and Uniswap, according to Chen.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Chen","content":"PERSON"},{"type":"HTC","content":"ORGANIZATION"},{"type":"Today","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Google Nest","content":"ORGANIZATION"},{"type":"December 2018","content":"DATE"},{"type":"Facebook","content":"LOCATION"},{"type":"VPN","content":"ORGANIZATION"},{"type":"Chen","content":"ORGANIZATION"},{"type":"Phil Chen","content":"PERSON"},{"type":"Amazon Alexa","content":"PERSON"}],"hashtag":[],"authors":["Yilun Cheng","The Block"]}