{"summary":"Southeast Asia-based VC Saison Capital, which is backed by Credit Saison, breaks down whats in a deal and why the fund puts its money into certain companies.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/224904\/vc-investing-saison-capital-deals-investment","publishDate":"2023-04-05T13:59:43","id":4720,"type":null,"title":"VC Saison Capital lays out what it looks for before making an investment","category":["DEALS"],"content":["Funding has dried up as the crypto industry undergoes bumpy times, and investors taking a more cautious approach in what companies they're willing to pony up for. So what does it take to get money from a venture capital firm these days?&nbsp;","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Saison Capital's Qin En Looi sat down with The Block this week to share some insights about the firm's approach to venture investing.<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">The firm invests up to $30 million annually and has maxed this out over the past two years, primarily focusing on early-stage companies at the pre-seed level. Saison Capital looks at these firms in two categories: applications and enablers, according to Looi, a principal at the firm. Crucial to both categories are founders with proven experience and \"operational discipline.\"<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Saison Capital is backed by Credit Saison, a Japanese financial services firm, which has $30 billion in assets under management. Since 2020, Saison Capital has been investing in crypto and blockchain startups when the firm \"recognized the broader opportunity of Web3,\" Looi said. <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The competition for dollars is increasing as fewer and fewer deals are being made.","\"In the first quarter of 2023, slightly more than $2.7 billion in venture capital was allocated across 402 blockchain-related funding deals,\" according to The Block Research. \"Funding in dollar terms was down roughly 22% Q\/Q, from approximately $3.5 billion in Q4'22 to $2.7 billion. Q1 is the lowest quarter in funding since Q4'20 and it has now fallen for four consecutive quarters.\"","","","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Typically, Saison Capital focuses on firms that have strong intellectual property in media or entertainment, as well as founders in Asia with a proven track record in web2. One such firm Looi noted was Avium, which Saison Capital led a $2 million oversubscribed round last August.&nbsp;<\/span>","Avium is a web3-based decentralized esports company founded last year by the founders of Southeast Asia's largest esports company, EVOS. The platform brings creators and artists together to create and produce animated content with studios that have worked with Marvel Comics, Tencent, Netflix and Amazon's Prime Video. Looi noted the founders' proven experience in web2 gaming was a factor in the fund's decision to invest in Avium.","<a href=\"https:\/\/www.playriftstorm.com\/\" data-v-f87c67ca=\"\">Mythic Protocol<\/a> is another portfolio company displaying the application base that appeals to Saison Capital, Looi said. The firm was founded by Indonesia's largest games development studio, which had been working on gaming for 12 years, with over 400 staff. The founders decided to pivot into web3 and brought 100 of their \"best folks\" with them.&nbsp;","The strong track record of working with intellectual property and media appealed to the fund. \"We see that as an exciting journey that we can embark on together,\" Looi said.<span data-ccp-props=\"{&quot;134245418&quot;:true,&quot;134245529&quot;:true,&quot;201341983&quot;:0,&quot;335559738&quot;:40,&quot;335559739&quot;:0,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">The second layer the fund looks at is \"enablers,\" which provide infrastructure in web3. These include startups working on marketing solutions, payments, finance and insurance.&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">An example is web3 back-office platform Headquarters, HQ.xyz, which <a href=\"https:\/\/www.theblock.co\/post\/171270\/crypto-com-invests-in-web3-back-office-platform-headquarters-5-million-raise\" data-v-f87c67ca=\"\">closed<\/a> a $5 million pre-seed round in September. It <\/span><span data-contrast=\"auto\" data-v-f87c67ca=\"\">was co-led by Crypto.com Capital, ForgeCapital and MassMutual ventures. <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span><span data-ccp-props=\"{&quot;134245418&quot;:true,&quot;134245529&quot;:true,&quot;201341983&quot;:0,&quot;335559738&quot;:40,&quot;335559739&quot;:0,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">HQ solves \"one of the biggest struggles for crypto firms,\" Looi said. \"How do you account for transactions?\" <\/span><span data-contrast=\"auto\" data-v-f87c67ca=\"\">The firm provides balance management <\/span>tools to track funds across wallets and enable the labeling and filtering of transactions to ensure wallets are accounting-ready.&nbsp;","<a href=\"https:\/\/www.evertas.com\/evertas-closes-14-million-venture-financing-round\/\" data-v-f87c67ca=\"\">Evertas<\/a>, a crypto insurance carrier authorized by Lloyds of London, is another firm Looi earmarked. The fund invested in its $14 million Series A in December. The firm provides the \"initial layer of protection\" to firms investing in crypto, which is currently lacking in the space, according to Looi.&nbsp;","The final firm Looi noted was <a href=\"https:\/\/www.jia.xyz\/\" data-v-f87c67ca=\"\">Jia.xyz<\/a>, which is working to provide loans to small to medium enterprises in emerging markets. The founders previously worked in emerging market lending, which is what appealed to Saison Capital.&nbsp;","Jia's thesis is \"very simple,\" Looi said. Customer acquisition is one of the biggest challenges for smaller companies in emerging markets. It gets costly, and it's hard to reward loyalty. Businesses will shop around and compare rates each time they need a loan. \"There's no loyalty to where you get your loan,\" according to Looi.","To solve this, the firm is creating a token layer to \"reward and incentivize loyalty.\" Businesses can take a loan from Jia and earn a formal token reward, which can be used to offset the next loan with the firm — building a credit history.&nbsp;","<em data-v-f87c67ca=\"\">Correction: Saison was part of Evertas' Series A round, but not its seed round, as indicated in a previous version of this article.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Amazon","content":"LOCATION"},{"type":"ForgeCapital","content":"ORGANIZATION"},{"type":"last August","content":"DATE"},{"type":"Indonesia","content":"LOCATION"},{"type":"Netflix","content":"ORGANIZATION"},{"type":"Looi","content":"LOCATION"},{"type":"MassMutual","content":"ORGANIZATION"},{"type":"Saison Capital","content":"ORGANIZATION"},{"type":"22%","content":"PERCENT"},{"type":"$14 million","content":"MONEY"},{"type":"Marvel Comics","content":"ORGANIZATION"},{"type":"Asia","content":"LOCATION"},{"type":"Looi","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"London","content":"LOCATION"},{"type":"$3.5 billion","content":"MONEY"},{"type":"$5 million","content":"MONEY"},{"type":"Southeast Asia","content":"LOCATION"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$2 million","content":"MONEY"},{"type":"Tencent","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"first quarter of 2023","content":"DATE"},{"type":"$30 million","content":"MONEY"},{"type":"$2.7 billion","content":"MONEY"},{"type":"Looi","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"$30 billion","content":"MONEY"},{"type":"Avium","content":"LOCATION"}],"hashtag":["NEW VC FUNDS","SEED &AMP; PRE-SEED","STARTUP ACCELERATORS","STRATEGIC INVESTMENTS"],"authors":["Adam Morgan McCarthy","The Block"]}