{"summary":"An $8.4 million exploit hit the Celo network-based decentralized lending protocol Moola Market on Tuesday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/178109\/defi-lending-protocol-moola-markets-hit-by-8-4-million-exploit","publishDate":"2022-10-18T16:01:13","id":4724,"type":null,"title":"DeFi lending protocol Moola Market hit by $8.4 million exploit","category":["DEFI"],"content":["Celo network-based decentralized finance (DeFi) lending protocol Moola Market paused operations following an exploit.","The attacker netted 8.8 million CELO ($6.5 million), 765,000 cEUR ($700,000), 1.8 million MOO ($600,000), and 644,000 cUSD ($600,000).","The Celo network-based decentralized finance lending protocol Moola Market paused operations following an $8.4 million exploit.","According to <a href=\"https:\/\/twitter.com\/FrankResearcher\/status\/1582448720985014273?s=20&amp;t=PiXIxI7bYH3vod-vexvKVg\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">an analysis<\/a> by The Block Research's Igor Igamberdiev, the exploiter used 243,000 CELO tokens originating from Binance and in turn loaned 60,000 CELO to Moola to borrow 1.8 million MOO for use as collateral. With the remaining CELO, the exploiter pumped the price of MOO and proceeded to use the borrowed MOO as collateral to borrow tokens across a series of other DeFi lending protocols.","For the efforts, the attacker netted 8.8 million CELO ($6.5 million), 765,000 cEUR ($700,000), 1.8 million MOO ($600,000), and 644,000 cUSD ($600,000).","Moola Market said its team is actively investigating the incident and that all activity on the platform has been paused. In the meantime, users are advised by Moola not to trade mTokens.","“To the exploiter, we have contacted law enforcement and taken steps to make it difficult to liquidate the funds. We are willing to negotiate a bounty payment in exchange for returning the funds within the next 24 hours,” <a href=\"https:\/\/twitter.com\/Moola_Market\/status\/1582432297835368449?s=20&amp;t=PiXIxI7bYH3vod-vexvKVg\" data-v-f87c67ca=\"\">tweeted<\/a> Moola Market.","Moola Market did not immediately respond to The Block’s request for comment.","<i data-v-f87c67ca=\"\">This is a developing story.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$6.5 million","content":"MONEY"},{"type":"Binance","content":"LOCATION"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$600,000","content":"MONEY"},{"type":"$8.4 million","content":"MONEY"},{"type":"$700,000","content":"MONEY"},{"type":"Igor Igamberdiev","content":"PERSON"}],"hashtag":["LENDING"],"authors":["Jeremy Nation","The Block"]}