{"summary":"Hut 8 missed analysts&#x27; expectations with a $23.7 million quarterly loss.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/182362\/hut-8-q3-losses-miss-estimates-hashrate-jumps-10","publishDate":"2022-11-10T08:15:13","id":4727,"type":null,"title":"Hut 8 Q3 losses miss estimates, hashrate jumps 10%","category":["MINING"],"content":["Bitcoin miner Hut 8 missed third-quarter estimates with $23.7 million in net losses compared to the estimated $19.4 million.","Revenue of $31.7 million compared to the $36.3 million average analyst estimate, data compiled by FactSet show. Computing operations revenue totaled $4.4 million. The company increased the number of digital assets mined to 982 from 905 a year earlier.","The installation of new miners brought Hut 8’s operating capacity to 3.07 EH\/s as of Sept. 30, an increase of 10% in hashrate compared to the previous quarter.","Results come as miners struggle with sinking bitcoin prices, high energy costs and increasing difficulty in mining.","\"We continue to mine at modest costs despite fluctuating power prices, increasing network difficulty, and sustained pressure on the price of bitcoin,” Hut 8 CEO Jaime Leverton said.","“Our conservative approach to managing our balance sheet continues to be paramount for us at Hut 8,” said CFO Shane Downey. “We improved our mining capacity by 10% while reducing the average cost to mine each bitcoin by 29%, when compared to the second quarter of 2022. We remain steadfastly committed to effectively managing capital in today’s challenging environment and believe we are well positioned to deliver shareholder value in 2023 and beyond.”","Hut 8 has managed to hold on to its bitcoin, which now total 8,388, unlike many other companies in the space which have sold a majority of their reserves in order to pay down debt.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$31.7 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"second quarter of 2022","content":"DATE"},{"type":"$4.4 million","content":"MONEY"},{"type":"$19.4 million","content":"MONEY"},{"type":"Shane Downey","content":"PERSON"},{"type":"$23.7 million","content":"MONEY"},{"type":"29%","content":"PERCENT"},{"type":"Sept. 30","content":"DATE"},{"type":"Jaime Leverton","content":"PERSON"},{"type":"$36.3 million","content":"MONEY"},{"type":"FactSet","content":"ORGANIZATION"}],"hashtag":["MINING COMPANIES"],"authors":["Catarina Moura","Christiana Loureiro","The Block"]}