{"summary":"The Army regained control of the account by Sunday evening, putting an end to the fake NFT promotions that were on its page.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/155684\/british-army-regains-control-of-youtube-and-twitter-accounts-following-nft-hack","publishDate":"2022-07-04T05:39:30","id":4729,"type":null,"title":"British Army regains control of YouTube and Twitter accounts following NFT hack","category":["HACKS"],"content":["Over the weekend, the British Army's official Twitter and YouTube accounts were compromised, with hackers using the accounts to promote non-fungible token (NFT) projects.&nbsp;","Hackers initially changed the account's profile picture, banner and description to promote Bapesclan NFTs – a collection which depicts cartoon apes face-on. Those in control of the account <a href=\"https:\/\/twitter.com\/hthjones\/status\/1543639488194297856\/photo\/1\" data-v-f87c67ca=\"\">later promoted<\/a> another collection called The Possessed.&nbsp;","The Army regained control of the account by Sunday evening, tweeting: \"Apologies for the temporary interruption to our feed. We will conduct a full investigation and learn from this incident. Thanks for following us and normal service will now resume.”","On YouTube, videos were posted promoting cryptocurrencies, featuring images of Tesla CEO Elon Musk.&nbsp;","A twist in the tale came as the self-professed creator of The Possessed NFT project hit back at the hackers on twitter, claiming they had been impersonated.","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">.<\/span><span class=\"r-18u37iz\" data-v-f87c67ca=\"\">@BritishArmy <\/span>has been hacked and is spreading fake <span class=\"r-18u37iz\" data-v-f87c67ca=\"\">@ThePossessedNFT <\/span>info. Forget us, please report their account as compromised as this is not okay,\" the account <a href=\"https:\/\/twitter.com\/tmw_buidls\" data-v-f87c67ca=\"\">@TMW_buidls tweeted<\/a>.&nbsp;","The Block contacted @TMW_buidls and Bapesclan for comment.&nbsp;","“We can confirm that yesterday there was a breach of the Army’s Twitter and YouTube accounts and an investigation is underway,\" an Army spokesperson told The Block.&nbsp;","“We take information security extremely seriously and whilst we have now resolved the issue an investigation is ongoing and it would be inappropriate to comment further.”","Hacks to verified accounts such as this one are commonplace in the NFT world and are a method of running scam giveaways or selling fake NFTs through official-looking sources. This hack hints at a lack of extra layers of security on official UK government accounts. This could potentially have been prevented through measures such as two-factor-authentication. The hack could also have been carried out through the owner visiting a malicious URL.&nbsp;","The British Army currently has 362,000 Twitter followers, while the YouTube channel has 177,000 subscribers.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"Twitter","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"British Army","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"evening","content":"TIME"},{"type":"Tesla CEO Elon Musk","content":"ORGANIZATION"},{"type":"Army","content":"ORGANIZATION"}],"hashtag":[],"authors":["Lucy Harley-McKeown","The Block"]}