{"summary":"The Block sat down with Matt Ball, author of a new book: The Metaverse: And How it Will Revolutionize Everything.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/160387\/an-expert-explains-what-is-and-isnt-the-metaverse","publishDate":"2022-07-31T06:48:38","id":4732,"type":null,"title":"An expert explains what is — and isn’t — the metaverse","category":["GAMING AND METAVERSE"],"content":["<span data-v-f87c67ca=\"\">Dozens of different definitions have been posed for the metaverse.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Tim McSweeney, CEO of Epic Games, <\/span><a href=\"https:\/\/www.cnn.com\/2021\/11\/18\/tech\/epic-games-ceo-apple-google-intl-hnk\/index.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">called it<\/span><\/a><span data-v-f87c67ca=\"\"> “real time 3D entertainment experiences that are social,” while Meta’s president of global affairs Nick Clegg said “it will be a constellation of technologies, platforms and products.”<\/span>","<span data-v-f87c67ca=\"\">The murky definition of the term hasn’t stymied the influx of capital pouring into <\/span><a href=\"https:\/\/www.theblock.co\/post\/156783\/animoca-brands-raises-75-million-at-pre-money-valuation-of-5-9-billion\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">metaverse development<\/span><\/a><span data-v-f87c67ca=\"\"> projects or even luxury brands like <\/span><a href=\"https:\/\/www.theblock.co\/post\/142759\/luxury-goods-giant-lvmh-is-eyeing-the-metaverse-very-carefully\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">LVMH<\/span><\/a><span data-v-f87c67ca=\"\"> eyeing the space. And the famous non-fungible token (NFT) project Bored Ape Yacht Club has attempted to launch a <\/span><a href=\"https:\/\/www.theblock.co\/post\/153349\/how-bored-apes-became-the-foundation-for-a-metaverse\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">metaverse<\/span><\/a><span data-v-f87c67ca=\"\"> of its own called Otherside.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In order to help nail down what exactly the “metaverse” is, The Block sat down with Matt Ball, author of a new book: <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><a href=\"https:\/\/www.amazon.co.uk\/Metaverse-How-Will-Revolutionize-Everything-ebook\/dp\/B09KMWYHX8\" data-v-f87c67ca=\"\">The Metaverse: And How it Will Revolutionize Everything<\/a>.<\/span><\/i>","<span data-v-f87c67ca=\"\">Ball has been writing essays analyzing the metaverse’s development since 2019. He was the former global head of strategy for Amazon Studios and is currently the managing partner for EpyllionCo, a venture capital and media production firm funding web2 and web3 projects. <\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This interview was edited for length and clarity.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">I've been familiar with the term and the many early efforts to build it for a few decades. But it was really my experiences playing a lot of Fortnite and building on the Roblox platform in 2018 that made me feel that this long-considered fantastical idea was starting to become a practical opportunity. The move was a reflection of technological progression, yes, but also a cultural shift.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Over the following years, we saw more and more affirmation of the fact that as virtual worlds became more popular, the experiences we could produce improved, and the cultural impact expanded.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Then through last year, predating my decision to start the book but running through it, was also the first time in which hundreds of billions of dollars were being spent on purely virtual goods — beyond just the typical users who had been in virtual worlds for decades.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Let me start by putting the internet in context. The internet is composed of dozens of different protocols in Transmission Control Protocol\/Internet Protocol (TCP\/IP). It reaches nearly every country globally and maintains millions of interconnected applications, hundreds of millions of servers, billions of websites and tens of billions of devices.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">We can literally discuss the internet as a dozen or so underlying protocols that make up TCP\/IP. But what we really mean is the ecosystem that reaches nearly every person and part of the global economy today.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">And so, that's a good way to discuss the question of what is not the metaverse. The metaverse, to me, is a unified experience or tech stack akin to the internet — but supporting 3D.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">And therefore, I would not say that Roblox is a metaverse, that the <\/span><a href=\"https:\/\/www.theblock.co\/linked\/142466\/the-sandbox-gears-up-to-raise-400-million-at-a-4-billion-valuation-report\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Sandbox<\/span><\/a><span data-v-f87c67ca=\"\"> is a metaverse, that <\/span><a href=\"http:\/\/a\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Otherside<\/span><\/a><span data-v-f87c67ca=\"\"> is a metaverse. I would describe them as we do virtual or digital platforms, ecosystems and hardware today. We don't say the Google internet, we don't say the Facebook internet. They are parts of it, they connect to applications devices in it.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In that regard, I would not say that web3 or blockchains are the metaverse either. In fact, there are many who come up with a plausible argument as to why they're not even necessary for the metaverse. And that's because we are talking about philosophies and or technologies that are not strict requirements to build a 3D version of the internet. But that does not mean they're not instrumental in its nature.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">What exactly is technologically realizable may depend on blockchain. But separate from what's realizable is the question of what is desirable.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">I described earlier what makes up the internet; the internet today is primarily a 2D network. We don't have an ability for different 3D experiences to find one another on the internet. And so we think of the metaverse as a 3D elevation of the internet to support 3D immersion.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But then on top of that, we talked about it as being synchronous — we can all co-experience it live. Think about how hard a video call is today. We talked about it being persistent: it has memory. What you do endures. We talked about it being built upon interoperability.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The internet doesn't always work that way, but that we have the underpinnings for them. And then in a simplified sense, what I'm describing for the metaverse is a parallel plane of existence in virtual space.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">It's a good question, for which we can't falsify one way or another. What we can do is the following: recognize the ways in which changes in the attributes I mentioned earlier, have improved and enhanced and onboarded millions more to the internet over the past several decades.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The internet was text based — not even colored text. Then it did have text and it had identity in the form of message board usernames or email addresses. We slowly started to individually have space on the internet, in the form of a blog, but that blog was infrequently, asynchronously updated with limited visuals. Then we all had a presence through a profile; we started to express our lives there.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">So there's one argument that just says let's look at that trajectory toward richer media more frequently reaching more people living the same shared experience, for which Discord or Zoom would be a good example.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The second argument is to recognize the many areas in which 3D experiences are more intuitive. And this can be put in the context of humanity. We didn't evolve for thousands of years to tap a flat piece of glass to interact with the world and information around us. We're experiential, we're tactile. You don't teach a second grader math by saying one plus one equals two. You hand them objects.<\/span>","<span data-v-f87c67ca=\"\">So certainly when we take a look at healthcare, infrastructure and education, we can see clearly how 3D does improve those fields.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">You'll see two primary arguments for its inclusion. Number one is to the extent one believes in interoperable assets, the challenge has always been what are the standards and how do you onboard the ecosystem to it? In simple terms, Publisher A does not want to use the system designed by Publisher B, especially if Publisher B operates it.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In crypto, there is an argument that there is a system consumers use and is lucrative, and not only does their competitor not own and operate it, but no one does.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But the second argument insists that decentralized technology can help keep the metaverse healthy.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Tim Sweeney, the founder and CEO of Epic Games has tweeted that crypto and NFTs seemed like the most plausible path to a metaverse that is open and where individuals own their data. That's not technically a requirement, but to combat an internet that exists in centralized, non-democratic regimes.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The metaverse that we think will thrive, that will be best, that has the most benefits to society in the least adverse effects, requires decentralized strength. The best way to do that is to find the means through which trillion-dollar corporations can be competed with by tapping into the many trillions more that are individually owned, for which blockchain is proving itself a potential solution.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tim Sweeney","content":"PERSON"},{"type":"billions of dollars","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"LVMH","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Tim McSweeney","content":"PERSON"},{"type":"Roblox","content":"PERSON"},{"type":"Nick Clegg","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"Amazon Studios","content":"ORGANIZATION"},{"type":"Transmission Control Protocol\/Internet Protocol (TCP","content":"ORGANIZATION"},{"type":"TCP","content":"ORGANIZATION"},{"type":"Matt Ball","content":"PERSON"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}