{"summary":"While people are already trading and speculating on crypto points, information on them is kept secret by some projects.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277823\/crypto-projects-115b-points","publishDate":"2024-02-17T08:34:02","id":4733,"type":null,"title":"Crypto projects have given out 115 billion points so far (but some still won&#x27;t say how many)","category":["CRYPTO ECOSYSTEMS"],"content":["Points are either the latest fad or meta in crypto, depending on who you ask. Either way, they’re <a href=\"https:\/\/www.theblock.co\/post\/274587\/crypto-projects-40-billion-points?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">a growing force<\/a> that wallet users, speculators, airdrop hunters and others are having to deal with.&nbsp;","As a short explainer, points are off-chain numbers given to users as a “reward” for certain actions, like swapping tokens on the project’s own platform. They are typically done ahead of a potential airdrop to let users know what actions will be rewarded — except the airdrops aren't usually guaranteed.","The problem is that, while crypto tokens are recorded on the blockchain, points are not. That’s not to say tokens don’t have their issues — from unclear circulating supplies to <a href=\"https:\/\/www.theblock.co\/post\/277491\/core-contributors-investors-to-unlock-1-3-billion-of-starknet-tokens-just-two-months-after-it-becomes-tradable\" data-v-f87c67ca=\"\">confusing token unlocks<\/a> —&nbsp;but points are much less transparent.","Let’s start with a simple metric. How many points have been given out by each project that offers them? With crypto tokens, you can ping the blockchain using Etherscan to check the token supply (or look at CoinGecko). With points, in the vast majority of cases, this information is not public.","There are a few ways to get close to these numbers. Most projects offering points have a public leaderboard, so you can add up the top 10 or top 100 accounts with the most points and extrapolate from there —&nbsp;guessing at the real number. Alternatively, you might need to ask the team and hope they tell you.&nbsp;","In a few cases, though, some projects do provide a live number, such as crypto wallet Rabby. Its competitor, Rainbow, also provided a live number in its Chrome extension, but this appears to have been recently removed.","However, some projects won’t say how many points there are. Magic Eden co-founder and COO Zhuoxun Yin said the company is not sharing the number of points, known as diamonds, that it has given out. When reached for comment, Orbiter Finance said, “We do not have [a] system to count all the points handed out, sorry sir, we need to keep this.”","As a result — especially in these cases — it's anyone's guess.","The reason this is important is twofold.","First, let's say you want to be eligible for a potential airdrop, and you want to do some actions to earn some points. If you don’t know the total supply of points, you have no idea whether 1 million points will earn you 1% of the airdrop allocation or 0.0001%. You can guess by looking at the leaderboard, but it’s still imprecise.","The other reason is that people are now speculating on points. Give something potential value, and people will find a way to trade it. A few years ago, people were trading Reddit's moon tokens when they were on a testnet (where tokens typically don't have value). Last month, crypto media publication CoinDesk <a href=\"https:\/\/www.coindesk.com\/business\/2024\/01\/31\/coindesk-mothballs-desk-reward-token-program\" data-v-f87c67ca=\"\">shelved<\/a> its DESK token because it found traders had set up a secondary market for it, despite this breaching its terms and conditions. Unsurprisingly, the same has happened to points.","Points trading is largely taking place on two platforms: Whales Market and Pendle Finance. For Whales Market, the core idea is that traders are betting on the value of the potential tokens that the points might turn into. So if someone makes a trade to buy some points, they don’t receive the points, but in the future they would receive any tokens that the seller gets. For Pendle, traders can get up to 74X leverage on points, or get access to the underlying asset at a discount without the points exposure.","Yet, these traders are making bets on limited information. Part of it is that the points-to-token distribution isn’t defined in advance or even guaranteed. The other part is that they may not know how many points there are.","\"I think that's where the speculation and the magic happens for yield trading for the points,\" said Pendle CEO TN Lee. \"So nobody knows how many points will be given out. Nobody even knows how many points you need to actually get a profitable or lucrative airdrop. So the speculation allows users to actually speculate and leverage on or hedge against the yield.\"","Lee added that some Pendle team members are speculating that points will be more lucrative than simply focusing on the underlying assets, such as ether. However, he said, \"some users have been hedging against the points because it's pretty much, oversaturated in a sense where the points are being inflated so much that it wouldn't even really matter to accumulate points because the numbers are just crazy — and you can't really track them because they're all off chain,\" he added.","This inability to track points is forcing traders to get even more speculative.","In a post on X, Messari research analyst Kunal Goel <a href=\"https:\/\/twitter.com\/i\/web\/status\/1755747478194766084\" data-v-f87c67ca=\"\">broke down his approach<\/a> for valuing points available to trade on these platforms. When looking at EigenLayer, he had to start with the total value locked in the project and estimate the number of points based on a <a href=\"https:\/\/twitter.com\/ThorHartvigsen\/status\/1754634903348498637\" data-v-f87c67ca=\"\">Discord comment<\/a> that each restaked ETH earns 1 point per hour. While this resulted in a reasonable estimate, it goes to show the challenge of obtaining even a rough estimate of point distributions.","The distribution of points is incredibly variable, too. ClayStack, for instance, has given out 200,000 points in total so far, while the top 1,000 wallets on MarginFi have earned 42 billion points (this an estimate based on totting up from its leaderboard rather than knowing the full amount). This would make a huge difference when it comes to trading the respective points — although, of course, there are other key factors involved.","If points are a short-lived fad, maybe this doesn’t matter — but with 115 billion points issued so far across 14 projects and crypto users increasingly trading points, perhaps it's time for some transparency.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Reddit","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"115 billion","content":"MONEY"},{"type":"Pendle Finance","content":"ORGANIZATION"},{"type":"0.0001%","content":"PERCENT"},{"type":"Pendle","content":"PERSON"},{"type":"Rainbow","content":"ORGANIZATION"},{"type":"Orbiter Finance","content":"ORGANIZATION"},{"type":"CoinGecko)","content":"ORGANIZATION"},{"type":"COO Zhuoxun Yin","content":"ORGANIZATION"},{"type":"Kunal Goel","content":"PERSON"},{"type":"Rabby","content":"PERSON"},{"type":"1%","content":"PERCENT"},{"type":"TN Lee","content":"ORGANIZATION"}],"hashtag":["ASSETS","CRYPTO","DEXS","PROTOCOLS","TOKENIZATION"],"authors":["Tim Copeland","The Block"]}