{"summary":"The Reserve Bank of Australia said that further research is required to address potential legal, regulatory, technical and operational issues related to CBDCs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246908\/australia-still-some-years-away-from-cbdc-issuance-central-bank-says","publishDate":"2023-08-23T04:01:43","id":4735,"type":null,"title":"Australia still ‘some years away’ from CBDC issuance, central bank says","category":["CENTRAL BANKS"],"content":["<span data-v-f87c67ca=\"\">Australia's central bank said issuing a central bank digital currency (CBDC) is still “some years away” after it recently wrapped up a pilot study on the matter.<\/span>","<span data-v-f87c67ca=\"\">In a <\/span><a href=\"https:\/\/www.rba.gov.au\/media-releases\/2023\/mr-23-21.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">report<\/span><\/a><span data-v-f87c67ca=\"\"> released today, the Reserve Bank of Australia (RBA) and the Digital Finance Cooperative Research Centre said that their joint study raised a number of legal, regulatory, technical and operational issues associated with an Australian CBDC that “warrant further consideration in future research.”<\/span>","<span data-v-f87c67ca=\"\">“Considering the broader context – where the Australian payments system is currently meeting most of the needs of end users and work on CBDC in advanced economies is generally still in an exploratory stage – it is likely that any serious policy consideration of issuing a CBDC in Australia is still some years away,” the report said.<\/span>","<span data-v-f87c67ca=\"\">The pilot project, designed to engage with industry to explore use cases for a CBDC, involved the RBA issuing a limited-scale pilot CBDC in a ring-fenced environment to selected industry participants, according to the report. A total of 16 use cases submitted by industry participants were selected to take part in the pilot — which took place from March to July this year.<\/span>","<span data-v-f87c67ca=\"\">“Unlike earlier projects where the CBDC was purely a proof-of-concept, the pilot CBDC was issued as a real legal claim on the RBA,” the report added.<\/span>","<span data-v-f87c67ca=\"\">The study showed that a CBDC could potentially deliver benefits to Australian households and businesses. Many submissions highlighted the ability to directly control and program a tokenized CBDC as enabling a range of complex payment arrangements that are not supported by existing payment systems, the report said.<\/span>","<span data-v-f87c67ca=\"\">The report also noted that there is significant interest from industry participants in exploring the tokenization of financial and other real assets on distributed ledger technology platforms, with CBDC used to settle related transactions. One key area of interest is traditional debt securities markets, where settlement times are typically measured in days, the report continued.<\/span>","<span data-v-f87c67ca=\"\">The RBA also warned in the report that some piloted use cases highlighted uncertainties over how CBDC and new business models making use of it would fit into current legal and regulatory frameworks.<\/span>","<span data-v-f87c67ca=\"\">“For instance, the pilot CBDC was issued as a contractual liability of the RBA rather than under a legislative framework, as would likely be the case if a decision was ever made to issue a CBDC in the future,” the report said.<\/span>","<span data-v-f87c67ca=\"\">The RBA concluded that a CBDC has the potential to support increased efficiency and resilience in some areas of the payments system, “though more research is required.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Reserve Bank of Australia (RBA","content":"ORGANIZATION"},{"type":"Australia","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"RBA","content":"ORGANIZATION"},{"type":"March to July this year","content":"DATE"},{"type":"Digital Finance Cooperative Research Centre","content":"ORGANIZATION"}],"hashtag":["ASIAN REGULATION","CBDCS"],"authors":["Timmy Shen","The Block"]}