{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley. They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/11917\/defendants-creation-of-fictitious-blockchain-exchange-commission-revisited-by-court","publishDate":"2019-02-16T15:00:57","id":4738,"type":null,"title":"Defendants&#x27; creation of fictitious Blockchain Exchange Commission revisited by court","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]SEC v. Blockvest, S.D. Cal., 8CV2287-GPB(BLM), February 14, 2019, “Order Granting Plaintiff’s Motion for Partial Reconsideration” [SDP]<\/strong><\/em>","It ain’t over til the curtain falls — this is true on Broadway and in litigation. This case is a, um, case in point. The SEC had a bad day in enforcement litigation back in November, 2018, when a federal judge in California declined to enter a requested preliminary injunction, finding that there were fact questions at issue as to whether or not the token at issue was a security under the Howey test. [For more on this earlier opinion, see <a href=\"https:\/\/medium.com\/crypto-caselaw-minute\/crypto-caselaw-minute-12-11-29-2018-b9c4308ee8c\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">here<\/a>]. Today, the same judge reconsidered its prior order and granted SEC’s Motion for Partial Reconsideration.","You can read a summary of the case in our prior post, but here’s some quick context: the SEC sued defendants alleging that they were offering and selling unregistered securities in the form of something called BLV tokens. Defendants claimed that their ICO had been approved by the SEC, CFTC and National Futures Association, and had their logos on their site. They also made up an agency called the “BEC” and put that on their site for good measure.","While Federal Judges usually don’t change their mind, you can ask, and that’s what the SEC did here. A motion for reconsideration is granted if there’s new evidence, the decision was clearly wrong\/manifestly unjust, or the law changed. The Court said here that reconsideration made sense based on a showing of the Defendants’ prior securities violations and new evidence showing they might violate the law in the future.","Under the three-pronged Howey test, the Court concluded that promotional materials on Defendants’ website, along with their whitepaper and social media accounts constituted an offer of unregistered securities, even if no sale was consummated.","First, the invitation to potential investors “to provide digital currency in return for BLV tokens satisfies the ‘investment of money’ prong of Howey. Second, the website promoted a “common enterprise” because it said that funds raised would be pooled and a profit-sharing formula would be used for payouts. Third, and finally, promotional materials said investors would be “passive” and would receive “passive income.” Thus, under Howey, the Court said that this is a security","The Court also concluded that website and whitepaper materials made available to the general public were enough to show that there was an offer, even if performance wasn’t necessarily possible. In short, this was, per the Court, enough to demonstrate a “prima facie” violation of securities law — an offer to sell unregistered securities.","Defendants argued that, even if this were all true, an injunction wasn’t necessary because it concluded it was unlikely the wrong would be repeated because Defendant had hired counsel, admitted that mistakes had been made, and promised not to do an ICO. The Court disagreed. It questioned Defendants’ creation of a fake agency (“the BEC”) used to mark the token on their website and, further, noted that Defendants’ lawyers had moved to withdraw from the case because they didn’t like things their clients wanted them to file (Rule 11 concerns, to be precise). Also, the Court said Defendants had apparently tried to file things electronically under the pretense that they were doing so as defense counsel, but the filings were rejected. The Court said that it had “concerns about whether Defendants will resume their prior alleged fraudulent conduct.” It doesn’t take a whole lot of tea leaf reading to conclude that the Court was particularly bothered by defense counsel’s departure, and the reasons for it. (If you liked the prior opinion maybe you’d take the position that bad defendants make bad law).","Bottom line — this decision was heralded by some as an important SEC loss. Turns out … not so much.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part II of this week's analysis,&nbsp;Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"National Futures Association","content":"ORGANIZATION"},{"type":"the Court","content":"ORGANIZATION"},{"type":"Court","content":"ORGANIZATION"},{"type":"BLM","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"S.D. Cal.","content":"LOCATION"},{"type":"GPB","content":"ORGANIZATION"},{"type":"California","content":"LOCATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"Howey","content":"PERSON"},{"type":"SEC’s Motion for Partial Reconsideration","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"February 14, 2019","content":"DATE"},{"type":"Palley","content":"PERSON"},{"type":"BEC","content":"ORGANIZATION"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"},{"type":"November, 2018","content":"DATE"}],"hashtag":["SEC"],"authors":["Stephen D. Palley","The Block"]}