{"summary":"The crypto-friendly bank Silvergate posted new results for the second quarter of 2020 this week.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/73000\/bitcoin-banker-silvergate-earnings","publishDate":"2020-07-27T15:59:18","id":4740,"type":null,"title":"&#x27;It&#x27;s a great time to be a bitcoin banker&#x27; says Silvergate CEO during earnings call","category":["THE BLOCK"],"content":["\"It's a great time to be a bitcoin banker.\"","That's Silvergate Bank CEO Alan Lane, who believes the future is bright amid a strong second quarter he spoke to during an earnings call on Monday.","Indeed, the crypto banking scene has revved up considerably in the span of a few months, with major acquisitions and raises tied to <a href=\"https:\/\/www.theblockresearch.com\/the-race-to-become-the-first-digital-asset-full-prime-broker-is-on-66095\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">the race<\/a> to build out crypto's first full prime broker. While some announcements could have had the potential to take a piece out of Silvergate's pie, it seems growth in the industry has translated to continued growth for the bank.","For example, the digital asset-focused bank saw a 35% increase in digital currency industry customers from last year, to now more than 880 clients.&nbsp;On June 30, 2020, Silvergate had over 200 prospective digital currency customer leads in various stages of the customer onboarding process and pipeline.&nbsp;","Digital currency-related fee income also reached $2.4 million, a 40% jump since last quarter. It's also a 120% increase from this time last year.&nbsp;","","","The Silvergate Exchange Network (SEN), the bank's 24\/7 transfer network for digital currency firms, also processed 30% more dollar-value transactions compared to last quarter, reaching $22.4 billion. That's a 160% increase from the previous year.","Lane said the bank is \"bullish\" on its payments platform, particularly with the release of its loan funding and repayment processing product SEN Leverage.&nbsp;","\"The response to our newest product offering SEN leverage has been very positive and we will continue to grow our Bitcoin collateralized loans through the second half of the year,\" said Lane. \"We also see many opportunities to further enhance the value of our global payments platform and we'll continue to invest in new product development to drive innovation.\"","The company reported that SEN Leverage saw bitcoin collateralized loans grow to $22.5 million in approved credit in the quarter, almost double the size in the first quarter.&nbsp;","","","Lane has headed Silvergate for two decades. In that time, he said, the firm has shared views with regulators on the legal permissibility for a bank to provide custody of digital assets.","Now, the U.S. Office of the Comptroller of the Currency (OCC) has <a href=\"https:\/\/www.theblockcrypto.com\/post\/72628\/us-bank-regulator-crypto-custody\" data-v-f87c67ca=\"\">formalized that view<\/a>, allowing federal savings associations and national savings banks to custody crypto. Lane said the timing of the announcement was more surprising than the announcement itself.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Silvergate","content":"ORGANIZATION"},{"type":"Silvergate Bank","content":"ORGANIZATION"},{"type":"$2.4 million","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"the first quarter","content":"DATE"},{"type":"OCC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"June 30, 2020","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"second half of the year","content":"DATE"},{"type":"$22.5 million","content":"MONEY"},{"type":"Alan Lane","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"120%","content":"PERCENT"},{"type":"$22.4 billion","content":"MONEY"},{"type":"35%","content":"PERCENT"},{"type":"160%","content":"PERCENT"},{"type":"last quarter","content":"DATE"},{"type":"second quarter","content":"DATE"},{"type":"the quarter","content":"DATE"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}