{"summary":"The Coinbase summer rally has stalled. The stock has fallen by more than 28% since peaking in July at just over $110.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244945\/coinbase-rally-stalls-as-shares-dip-more-than-28-from-july-peak","publishDate":"2023-08-16T13:35:52","id":4742,"type":null,"title":"Coinbase rally stalls as shares dip more than 28% from July peak","category":["COMPANIES"],"content":["The Coinbase rally has stalled, with shares declining more than 28% from a yearly peak in July of just over $110.&nbsp;","The crypto exchange, which saw shares surge ahead of the release of its <a href=\"https:\/\/s27.q4cdn.com\/397450999\/files\/doc_financials\/2023\/q2\/Shareholder-Letter-Q2-2023.pdf\" data-v-f87c67ca=\"\">second quarter earnings<\/a> at the beginning of the month, has declined 11% over the past week. Shares were mostly flat on Wednesday, with shares rising 0.1% to $79.28 at 1:27 p.m. ET, according to <a href=\"https:\/\/www.tradingview.com\/symbols\/NASDAQ-COIN\/\" data-v-f87c67ca=\"\">TradingView<\/a>.&nbsp;","Despite the U.S. Securities and Exchange Commission's lawsuit against the firm, Coinbase traded higher over the course of much of June and July, thanks in part to <a href=\"https:\/\/www.reuters.com\/technology\/coinbase-surges-after-cboe-names-crypto-exchange-bitcoin-etf-application-2023-07-03\/\" data-v-f87c67ca=\"\">headlines<\/a> that the firm would work with a wide-range of asset management firms on the roll out of spot bitcoin exchange-traded funds.&nbsp;","The company also beat Wall Street expectations for revenue when it <a href=\"https:\/\/s27.q4cdn.com\/397450999\/files\/doc_financials\/2023\/q2\/Shareholder-Letter-Q2-2023.pdf\" data-v-f87c67ca=\"\">reported<\/a> earnings on August 3. It didn't quantify, however, exactly how much potential revenue new spot bitcoin ETFs could bring for Coinbase, and the agreements for market surveillance sharing agreements with exchange venues Cboe and Nasdaq still depend on the SEC approving the funds.&nbsp;","\"The primary way that we'll monetize in the near term is via AUCCs,\" chief operating officer Emilie Choi said. \"And then down the line, we think there's a good deal of ancillary revenue that we can generate from things like settlement and other services.","\"The reason we're excited is that this really should expand the pie and create positive impacts for the space,\" she continued, adding&nbsp;that the space is still in the early innings as it pertains to a spot ETF given that \"these products are still going through the registration and approval process.\"","Analysts covering the stock have increased price targets on the company since the end of June, with 32% of them having a buy, or overweight, rating for COIN. About 29% have a sell rating on the stock.&nbsp;","","","Coinbase's shares have slid against the backdrop of a sleepy crypto market that has seen volatility at historic lows for bitcoin, while trading volumes are at their lowest levels since 2020.","The seven-day moving average for spot exchange volumes <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/total-exchange-volume-daily\" data-v-f87c67ca=\"\">hit<\/a> $11.2 billion on August 15, down from over $46 billion in March. That's bad news for firms like Coinbase, which make a good chunk of their revenues from fees tied to trading.","In the second quarter, Coinbase's total transaction revenue came in at $327.1 million, representing about 46% of total revenue.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"TradingView","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"32%","content":"PERCENT"},{"type":"$46 billion","content":"MONEY"},{"type":"$327.1 million","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"0.1%","content":"PERCENT"},{"type":"29%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Emilie Choi","content":"PERSON"},{"type":"second quarter","content":"DATE"},{"type":"1:27 p.m. ET","content":"TIME"},{"type":"August 3","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$11.2 billion","content":"MONEY"},{"type":"11%","content":"PERCENT"},{"type":"August 15","content":"DATE"},{"type":"28%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Cboe","content":"ORGANIZATION"},{"type":"46%","content":"PERCENT"},{"type":"$110","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"$79.28","content":"MONEY"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["COINBASE"],"authors":["Frank Chaparro","The Block"]}