{"summary":"Lawyers representing Terraform said a “coordinated short attack” caused the stablecoin to falter and that those sellers likely used FTX to, in part, conduct that attack, in a court document filed on Wednesday.","author":["Sarah Wynn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240790\/terraform-labs-wants-to-subpoena-info-from-ftx-to-aid-its-sec-defense","publishDate":"2023-07-20T12:04:54","id":475,"type":null,"title":"Terraform Labs wants to subpoena info from FTX to aid its SEC defense","category":["Companies"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Terraform Labs is asking a court to allow it to subpoena certain information about accounts, wallets and assets from bankrupt exchange FTX to defend itself in a case brought by the Securities and Exchange Commission.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC <a href=\"https:\/\/www.theblock.co\/post\/212695\/sec-charges-terraform-and-do-kwon-post-terra-collapse\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">charged<\/span><\/a>&nbsp;Terraform and its former CEO Do Kwon in February for allegedly misleading investors over its algorithmic stablecoin TerraUSD, which collapsed dramatically last year, wiping out billions in the process.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Lawyers representing Terraform said a “coordinated short attack” caused the stablecoin to falter and that those sellers likely used FTX to, in part, to conduct that attack, in a motion filed on Wednesday in the U.S. Bankruptcy Court for the District of Delaware involving FTX.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“These records are crucial to TFL’s defense in the SEC Action—for example, for TFL’s experts to perform crucial blockchain analysis of the short-sellers’ trading and market activity to combat the SEC’s allegations, among other things,” the lawyers said.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC said the company and Kwon misled investors about how stable the stablecoin really was. Algorithmic stablecoins, like TerraUSD, use market incentives via algorithms to maintain a stable price. Terra was linked to Luna, a governance token, to keep the prices stable.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC also said Terraform and Kwon misled investors when the stablecoin depegged previously in May 2021 and they said it was restored by an algorithm. Instead, <\/span><span class=\"s3\" data-v-f87c67ca=\"\">the firm <a href=\"https:\/\/www.theblock.co\/post\/212772\/jump-terraform-prop-up-terrausd\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">turned<\/span><\/a> to Jump Trading to prop up the <\/span><span class=\"s1\" data-v-f87c67ca=\"\">stabecoin, restoring its value.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">In the motion filed this week, Terraform said Jump “was not the cause for the restoration of the peg in 2021.”&nbsp;<\/span>","Terraform's former CEO is also facing legal trouble. Kwon was found guilty last month <span class=\"s1\" data-v-f87c67ca=\"\">by a <a href=\"https:\/\/www.theblock.co\/post\/235448\/do-kwon-found-guilty-in-montenegro-fake-passport-case\" data-v-f87c67ca=\"\">court<\/a> in Montenegro of using a fake Costa Rican passport in an attempt to leave the country in March and sentenced to four months in jail.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">A hearing on the motion is set for 10 a.m. on Aug 2.&nbsp;<\/span>","&nbsp;"],"hashtag":["FTX"]}