{"summary":"Coffee giant Starbucks is launching its second paid NFT collection on Polygon: &quot;The Starbucks First Store Collection.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/226809\/starbucks-polygon-new-nft-collection","publishDate":"2023-04-18T08:40:40","id":4750,"type":null,"title":"Starbucks set to launch a new NFT collection on Polygon","category":["COMPANIES"],"content":["Starbucks is launching another NFT collection on the Polygon network.","The world's largest coffeehouse chain's new \"The Starbucks First Store Collection\" features art that recalls the company's first location, which opened in 1971 in Seattle's Pike Place Market.","\"People from all over the map come to see this historic landmark for themselves, experiencing a sense of nostalgia and being part of something bigger,\" <a href=\"https:\/\/www.niftygateway.com\/collections\/starbucks-odyssey-the-first-store\" data-v-f87c67ca=\"\">Starbucks said<\/a> in its sales pitch on the Nifty Gateway NFT marketplace. \"With the Starbucks First Store Collection, you can own a piece of history.\"","There will be 5,000 \"The First Store Collection Stamps\" on sale on Wednesday, each priced at $100. Those who own two or more unique \"Journey Stamps,\" Starbucks' previous foray into NFTs, will get early access to the First Store collection at 9 a.m. PDT. The general sale will start at noon PDT, and there is a limit of one stamp per person for all collectors.","The move comes a day after another iconic retail brand made its push into crypto. <a href=\"https:\/\/www.theblock.co\/post\/226760\/nike-crypto-digital-sneakers\" data-v-f87c67ca=\"\">Nike announced its first \"digital-creation collection\"<\/a> on its .Swoosh blockchain platform yesterday. Much like the athletic apparel giant and a host of other brands, Starbucks is mostly shying away from the NFT term in favor of \"collection\" or \"stamp.\"","The coffee giant <a href=\"https:\/\/techcrunch.com\/2022\/05\/04\/starbucks-to-launch-nfts-this-year-offering-access-to-unique-experiences-and-benefits\/\" data-v-f87c67ca=\"\">first announced its plans to enter the web3 space<\/a> in May 2022 when it said on an earnings call that it would launch its own NFT collection later that year to give users access to exclusive content experiences and other benefits.","\"We are creating the digital third place,\" Starbucks Chief Marketing Officer Brady Brewer said on the call at the time. \"To achieve this, we will broaden our framework of what it means for people to be a member of the Starbucks community, adding new concepts such as ownership and community-based membership models that we see developing in the web3 space.\"","Last September, <a href=\"https:\/\/stories.starbucks.com\/press\/2022\/starbucks-brewing-revolutionary-web3-experience-for-its-starbucks-rewards-members\/\" data-v-f87c67ca=\"\">Starbucks announced Odyssey<\/a>, an extension of Starbucks Rewards that sought to expand brand loyalty in the virtual world. In December, the coffee giant <a href=\"https:\/\/stories.starbucks.com\/stories\/2022\/the-starbucks-odyssey-begins\/\" data-v-f87c67ca=\"\">launched a beta test of Odyssey<\/a>, allowing members to participate in interactive journeys like games and virtual tours related to coffee education and Starbucks history and earn Odyssey Points that can be exchanged for rewards or \"Journey Stamp\" NFTs that can be collected and traded. At the time, Starbucks also&nbsp;announced its partnerships with Nifty Gateway and Polygon.","Last month, Starbucks launched its first paid collection of NFTs, called \"Siren Collection,\" which reportedly <a href=\"https:\/\/www.benzinga.com\/markets\/cryptocurrency\/23\/03\/31291892\/starbucks-sells-2-000-nfts-in-just-20-minutes-but-no-free-coffee-included\" data-v-f87c67ca=\"\">sold out in under 20 minutes<\/a>. The 2,000-item collection featured a version of the company's Siren logo, with the stamps priced at $100 each.","The current floor price, or the lowest price, of the <a href=\"https:\/\/odysseymarket.niftygateway.com\/marketplace\/publisher\/starbucks-odyssey?sortBy=recent\" data-v-f87c67ca=\"\">Siren stamps stands at around $495<\/a>. That's a nearly 400% gain.","The floor prices of Starbucks' Journey Stamps, which were offered for free as rewards, are also trading higher in the range of $70-$1,000 each.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Pike Place Market","content":"ORGANIZATION"},{"type":"Nifty Gateway NFT","content":"ORGANIZATION"},{"type":"First Store","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Nifty Gateway","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Nike","content":"ORGANIZATION"},{"type":"$100","content":"MONEY"},{"type":"9 a.m. PDT","content":"TIME"},{"type":"Seattle","content":"LOCATION"},{"type":"1971","content":"DATE"},{"type":"May 2022","content":"DATE"},{"type":"Starbucks Rewards","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$1,000","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"Starbucks First Store Collection","content":"ORGANIZATION"},{"type":"400%","content":"PERCENT"},{"type":"First Store Collection Stamps","content":"ORGANIZATION"},{"type":"Odyssey Points","content":"ORGANIZATION"},{"type":"Starbucks Chief Marketing Officer Brady Brewer","content":"ORGANIZATION"},{"type":"$495","content":"MONEY"},{"type":"Starbucks","content":"ORGANIZATION"},{"type":"$70","content":"MONEY"}],"hashtag":["NIFTY GATEWAY"],"authors":["Yogita Khatri","The Block"]}