{"summary":"Google claims that the developers allegedly violated the RICO Act, enacted wire fraud and breached various policies on Google&#x27;s platforms.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286515\/google-sues-two-developers-for-putting-87-fraudulent-crypto-apps-on-google-play-store","publishDate":"2024-04-04T11:20:42","id":4752,"type":null,"title":"Google sues developers for putting 87 crypto scam apps onto Google Play","category":["COMPANIES"],"content":["Search engine giant Google sued two developers for placing a trove of fraudulent crypto-based apps on the Google Play store.&nbsp;","The two defendants, Yunfeng Sun and Hongnam Cheung, allegedly placed 87 fraudulent apps on Google Play within the past four years. The schemes affected at least 100,000 individuals — 8,700 of whom were purportedly based in the United States, according to a Thursday <a href=\"https:\/\/www.courtlistener.com\/docket\/68407045\/1\/google-llc-v-sun\/\" data-v-f87c67ca=\"\">lawsuit<\/a> in the Southern District of New York.&nbsp;","The developers socially engineered victims to download an app claiming to provide cryptocurrency investments. When victims attempted to withdraw the funds, however, they were forced to pay fees to allegedly cover the cost of principal investments and gains, the lawsuit notes. In some cases, the app enforced 10% to 30% additional fees to withdraw user funds, which sometimes were never paid.&nbsp;","\"Defendants and their agents designed the fraudulent apps that were made available on Google Play to appear legitimate. Their user interfaces sought to convince victims that they were maintaining balances on the app and that they were earning 'returns' on their investments,\" according to the lawsuit. \"But those statements were false. The apps were not actual trading platforms; they existed only to ingest users’ money, with which the fraudsters then abscond.\"","When Google removed one of the apps, the developers would hide their identities and network infrastructure to place new apps on the Google Play store.&nbsp;","The developers also employed the \"<a href=\"https:\/\/www.theblock.co\/post\/273634\/cftc-charges-digital-asset-platform-over-pig-butchering-scheme\" data-v-f87c67ca=\"\">pig butchering<\/a>\" scam technique, which involves gaining a victim's trust through seemingly friendly or romantic attachments to influence the victim to invest in a fraudulent financial endeavor.&nbsp;","Initiating conversation through wrong number texts and building a relationship, the developers suggested victims download an app called \"TionRT,\" which claimed to be a cryptocurrency exchange. The scammers suggested victims invest using TionRT to earn extra income and to withdraw when they saw profits, only to be forced to pay fees to obtain their money.&nbsp;","For these and other scams, <a href=\"https:\/\/www.theblock.co\/post\/284091\/google-now-shows-ethereum-name-service-wallet-balances-in-search-results\" data-v-f87c67ca=\"\">Google<\/a> claims that the developers allegedly violated the Racketeer Influenced and Corrupt Organizations (RICO) Act, enacted wire fraud and breached various policies on Google's platforms.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Hongnam Cheung","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Southern District of New York","content":"LOCATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"30%","content":"PERCENT"}],"hashtag":["CRIME"],"authors":["MK Manoylov","The Block"]}