{"summary":"The Block is delighted to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley (@stephendpalley) and Nelson M.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/3404\/crypto-caselaw-minute-week-of-11-11-18-dog-treats-and-blockchains-and-litecoins-no-lie","publishDate":"2018-11-16T08:02:09","id":4754,"type":null,"title":"Crypto Caselaw Minute, Week of 11.11.18: Dog treats and blockchains and litecoins -- no lie","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">The Block is delighted to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@NelsonMRosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full.<\/em>","Doggos, getting rekt, and what is money,&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">really?<\/em>&nbsp;These topics (and more) in today’s Crypto Caselaw Minute. (As always, Rosario summaries are “NMR” and Palley summaries are “SDP”).","<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario [twitter: @nelsonmrosario] and Stephen Palley [twitter: @stephendpalley]. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes. <\/em>","<em data-v-f87c67ca=\"\">Link to opinion:&nbsp;<a href=\"https:\/\/www.scribd.com\/document\/393285508\/Takata-Order\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Takata Order<\/a><\/em>","What do dog treats and blockchain have in common? Class action litigation!","The Riot Blockchain lawsuits involve (allegedly) an existing company that had nothing to do with technology and then late last year tried to capitalize on blockchain hype. It pivoted from “animal healthcare and veterinary products to 'being a strategic investor and operator in the blockchain ecosystem,' and concurrently changed its name from Bioptix, Inc. to Riot.” This description is contained in the Court’s November 6 Order, and you have to wonder if the Judge smiled wryly when he wrote that line. Read it out loud. If you’re not an investor, it’s actually kind of funny in a “what were they thinking?” kind of way.","The Plaintiffs in two separate class action lawsuits sued Riot for securities fraud. They allege:","<em data-v-f87c67ca=\"\">\"[A]fter this name change, Riot issued a pair of press releases adjourning scheduled annual stockholder meetings that were set to take place in Boca Raton, Florida. Shortly thereafter, CNBC published an article 'regarding questionable practices at Riot,' reporting that, after its name change, Riot’s ‘stock shot from $8 a share to more than $40, as investors wanted to cash in on the craze of all things crypto,' but that Riot did not appear to have meaningful involvement in the cryptocurrency business. Based in large part on information in the CNBC article, the Complaints accuse Riot of (1) failing to disclose that Riot’s principle executive offices were not in Colorado, but rather in Florida, the same location as a large, influential shareholder, Barry C. Honig, who had a previous working relationship with Defendant O’Rourke; (2) failing to disclose that Riot never intended to hold the two canceled annual stockholder meetings; and (3) making material misstatements about Riot’s business, operations, and prospects.\"<\/em>","Notice that I wrote class actions -- plural -- above. When there’s smoke there’s fire, and what you often see in the class action context is multiple lawsuits being filed, all arising from the same set of facts. From a judicial resources standpoint, it’s easier and more efficient for a single judge to manage multiple cases that involve a common nucleus of operative facts. We’ve seen consolidation in both the Tezos and Bitconnect litigation. The same thing has happened here  --  two lawsuits were filed in federal court in New Jersey. One set of Plaintiffs moved to consolidate the cases and the other Plaintiffs didn’t object. The Court said that because the cases “involve nearly identical questions of law and fact” consolidation made sense.","The remainder of the opinion addressed which of the Plaintiffs would be the lead Plaintiff and who would be appointed lead counsel. Explaining the Court’s decision would require a mini-course in civil procedure and frankly, isn’t all that interesting to anyone other than the participants in these cases and my Civ Pro Professor (hello Professor Droback!). The most interesting thing about the decision here is the fact that lead counsel is from a very well known plaintiff’s class action shop, the Motley Rice firm, which is also well known for its work taking on tobacco companies. In short, it’s real litigation, with big ticket class action lawyers involved.","What happens next? Well, this lawsuit — and all of the crypto-class-action litigation, as far as we can tell — remains “putative” at this point. None have been certified, and this one is no exception. What does that mean? Class action lawsuits allow one or sometimes a couple of people to stand in for a really large group of plaintiffs. Instead of having 10,000 plaintiffs you have a small number of them. Filing a class action doesn’t mean you&nbsp;<em data-v-f87c67ca=\"\">are<\/em> a class action.","Putative means something like so-called or not quite yet in this context. Once you get past the inevitable motions to dismiss, discovery, and some other procedural maneuvering you get to a thing called <em data-v-f87c67ca=\"\">class certification<\/em>. If you can satisfy the class action certification requirements  -- things like commonality, adequacy, <a href=\"https:\/\/www.merriam-webster.com\/legal\/numerosity\" data-v-f87c67ca=\"\">numerosity<\/a>, typicality --  the court certifies the class. If class cert is denied, you’re just a sad individual plaintiff with what might in truth be a pretty <em data-v-f87c67ca=\"\">de minimis<\/em> claim. My suspicion is that we will start to see class certification motions and orders in the first half of 2019.","Anyway, in this case and others, expect discovery and motion practice, and learning more about the overlap between pet treats and distributed ledger technology.&nbsp;[related id= 1]","<em data-v-f87c67ca=\"\">Link to order:&nbsp;<a href=\"https:\/\/www.cftc.gov\/sites\/default\/files\/2018-10\/enfjosephkimorder102918.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">CFTC<\/a><\/em>","No one likes to get rekt, but stealing from your employer to cover your losses is a great way to exacerbate the problem. Subsequently, lying to people that you’re starting a new trading firm and soliciting their investments to pay back the money you stole from your previous employer is just ... bad. Despite the fact it is common sense to&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">not<\/em>&nbsp;do all of these things, that <em data-v-f87c67ca=\"\">is<\/em> the subject of this CFTC order and settlement. Recall that the CFTC is the Commodity and Futures Trading Commission, and in the U.S. the CFTC decided that virtual currencies are commodities and therefore subject to their jurisdiction.","Joseph Kim engaged in his ill-conceived activities from September 2017 to March 2018. During that time he was employed by a proprietary trading firm in Chicago, as part of their virtual currency group from September 2017 to November 2017. Mr. Kim’s troubles began on or about September 23, 2017, when he transferred 980 litecoin to his personal wallet from his employer’s wallets. Mistake number one. When confronted by his employer he claimed that there were security issues that necessitated the transfers. Mistake number two.","Then, “ [I]n November 2017, using&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">means and instrumentalities of interstate commerce<\/em>, Kim misappropriated an additional 339 bitcoins (valued at approximately $3.2 million) to cover trading losses in his personal virtual currency trading account” (emphasis added). Okay, we’re going to stop tracking the mistakes here, because you shouldn’t be doing any of this stuff. Apparently, Kim “[T]hrough a series of transfers over several days, transferred the Firm’s Bitcoins back and forth between a Firm account, a Firm wallet, and his own personal trading account.” The firm figured out what was going on, and terminated Mr. Kim’s employment.","In a wholly misguided attempt to pay back the money to his former employer Mr. Kim started soliciting people for investments in his new venture, and as part of the solicitation process lied about why he left his former employer claiming it was a voluntary separation initiated by him. “Between in or about December 2017 and in or about March 2018, Kim raised approximately $545,000 from at least five customers to trade in virtual currency.” Kim told his customers that this money was going to be used in a low-risk arbitrage strategy, but of course it wasn’t. Instead, “Kim made high-risk, directional bets on the movement of virtual currencies that resulted in substantial losses.” Additionally, Kim provided false account statements to his customers claiming profits that didn’t exist.","So, what does the CFTC have to do with all this? Well, as highlighted above, when Kim was using his firms crypto to try and cover his losses he was using the&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">means and instrumentalities of interstate commerce<\/em>. This is a phrase you see a lot in U.S. law in part to justify the federal government getting involved in people’s activities. Specifically, what Kim did according to the CFTC, and agreed to by Kim as part of his settlement, was “intentionally misappropriated bitcoins and litecoins from his employer and used these virtual currencies to engage in transactions from Chicago on virtual currency exchanges in California and others locations outside of Illinois. The misappropriation of funds or virtual currencies in connection with contracts of sale of commodities in interstate commerce constitutes fraud that violates 6(c)(1) of the Act and Regulation 180.1(a).”","What about Kim’s customers? Well, as you might be able to guess, you can’t really lie to your customers if you are going to be trading commodities using their money. In particular, Kim lying about his termination from his previous employer, engaging in a different trading strategy than what he told his customers he would, and reporting false profits were all misrepresentations and omissions of material facts. What’s a material fact? Well, here a “statement of fact is material if ‘there&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">is a substantial likelihood that a reasonable investor would consider it important<\/em>&nbsp;in making an investment decision.” (emphasis added). Knowing if your trader was fired from his previous job for stealing is probably important. As well as the other stuff. Don’t get rekt, but if you do, don’t be stupid.","<em data-v-f87c67ca=\"\">Link to opinion:&nbsp;<a href=\"https:\/\/www.scribd.com\/document\/393113374\/Boa-Class-Action\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Boa Class Action<\/a><\/em>","Another class action lawsuit! This one is against Bank of America and Visa, and is focused on what the appropriate fees should be when using credit cards to purchase cryptocurrency. (Sidebar: I mean, really? You really shouldn’t be using credit cards to purchase cryptocurrency, or anything you might consider an investment, but I digress.) If this subject matter seems familiar to you it should, because what fees should attach, if any at all, to crypto purchases is the subject of other pending lawsuits.","The main argument here is: How should crypto purchases be characterized? When you purchase things with a credit card those purchases are often either characterized as normal “purchases,” that do not incur additional fees, but sometimes those purchases may be considered “cash advances,” and those come with lots of additional fees and conditions. How and why this determination is made should be detailed in your agreements with your credit card company.","In this case, the written contracts that explain the agreement for a BofA branded credit card run by Visa stated that “[BofA] will extend credit in the form of a Cash Advance in exchange for a transaction fee, in the greater amount of $10.00 or 5% of the transaction amount. [BofA] will also assess interest charges of over 26% annually, which accrue daily on both the transaction amount and the transaction fee, beginning on the transaction date.” Conversely, with respect to normal purchases, “[BofA's] Written Contracts provide that credit card 'Purchases' come with no transaction fees and lower interest rates.”","Allegedly, according to the Plaintiffs, from “2016 until and including January 22, 2018, [BofA] correctly deemed, and affirmatively disclosed and charged, such transactions as 'Purchases' under its Written Contracts.[BofA] assessed no transaction fees, and applied the same interest charges that it applied for all other types of credit card Purchases.” Allegedly, this policy changed at some point, and “between January 23, 2018 and February 2, 2018 (inclusive), Plaintiffs bought more cryptos using their same[BofA] credit cards,” and, again allegedly, “[BofA] wrongly treated all crypto transactions occurring between those dates as 'Cash Advances': contrary to the plain language of its Written Contracts, and contrary to [BofA's] prior dealings with Plaintiffs and the Class.” That allegation certainly doesn’t look good, but it is also a bit odd in that if BofA did in fact do this, why would they do it for a period of less than two weeks?","Raise your hand if you thought the beginning header of the background section of this class action lawsuit would read:&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">What is Money?<\/em>&nbsp;The subsequent paragraphs are an interesting discussion of money and its uses. The second header of the background section poses the question&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">What is a “Cryptocurrency” or “Virtual Currency”?.<\/em>&nbsp;The plaintiffs offer the following answer: In short, not money. This is an odd position to take, but it also makes intuitive sense if you are trying to not get a purchase characterized as a “cash advance.”","The second section of the background includes a discussion of the various uses of crypto and blockchain technology, and somehow a link to the website CryptoCoinsNews (surely the first time a link to that site has appeared in a federal lawsuit) makes an appearance. All of this discussion builds up to the following argument. “As of today, though, cryptos are not money: not even close. Nor do cryptos represent claims on, or derivatives of, money. Whatever their 'coin'-sounding names might portend, virtual currencies and their blockchain systems are, fundamentally, private-sector technologies, arbitrary computer codes, and software applications.” The different approaches taken by the IRS and CFTC also make an appearance in this section to bolster the argument that crypto is not money.","This case is worth following if for no other reason than to see how the court will handle the fundamental money question. There is a pending case in Florida that makes a similar argument. How these cases turn out is an open question, but it is certainly an odd place to be when <a href=\"https:\/\/bitcoin.org\/bitcoin.pdf\" data-v-f87c67ca=\"\">where we started<\/a> was “<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">A purely peer-to-peer version of electronic cash<\/em>…”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"September 23, 2017","content":"DATE"},{"type":"BofA","content":"ORGANIZATION"},{"type":"2016","content":"DATE"},{"type":"February 2, 2018","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"$545,000","content":"MONEY"},{"type":"New Jersey","content":"LOCATION"},{"type":"November 2017","content":"DATE"},{"type":"Bank of America","content":"ORGANIZATION"},{"type":"December 2017","content":"DATE"},{"type":"the IRS","content":"ORGANIZATION"},{"type":"Nelson Rosario [","content":"PERSON"},{"type":"Illinois","content":"LOCATION"},{"type":"November","content":"DATE"},{"type":"Boca Raton","content":"LOCATION"},{"type":"January 23, 2018","content":"DATE"},{"type":"the first half of 2019","content":"DATE"},{"type":"SDP","content":"ORGANIZATION"},{"type":"Boa Class Action","content":"ORGANIZATION"},{"type":"March 2018","content":"DATE"},{"type":"$8","content":"MONEY"},{"type":"Futures Trading Commission","content":"ORGANIZATION"},{"type":"Chicago","content":"LOCATION"},{"type":"Takata Order","content":"ORGANIZATION"},{"type":"Barry C. Honig","content":"PERSON"},{"type":"Stephen Palley","content":"PERSON"},{"type":"September 2017","content":"DATE"},{"type":"Rosario","content":"PERSON"},{"type":"Civ","content":"LOCATION"},{"type":"$40","content":"MONEY"},{"type":"Florida","content":"LOCATION"},{"type":"January 22, 2018","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Bioptix, Inc.","content":"ORGANIZATION"},{"type":"Kim","content":"PERSON"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"Joseph Kim","content":"PERSON"},{"type":"Colorado","content":"LOCATION"},{"type":"California","content":"LOCATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"$10.00","content":"MONEY"},{"type":"26%","content":"PERCENT"},{"type":"Palley","content":"PERSON"},{"type":"$3.2 million","content":"MONEY"}],"hashtag":[],"authors":["Contributor Network","The Block"]}