{"summary":"The Mango Markets DAO is voting in favor of letting the hacker return half the funds in exchange for no criminal prosecution.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/177262\/mango-markets-community-set-to-approve-47-million-deal-with-hacker","publishDate":"2022-10-14T11:54:53","id":4756,"type":null,"title":"Mango Markets community set to approve $47 million deal with hacker","category":["GOVERNANCE"],"content":["The Mango Markets community is voting heavily in favor of making a deal with the hacker who <a href=\"https:\/\/www.theblock.co\/post\/176445\/hacker-steals-over-100-million-from-mango-markets\" data-v-f87c67ca=\"\">stole $114 million<\/a> from its DeFi protocol.","Under the terms of the offered deal, the hacker will return roughly $67 million of the tokens and keep the remaining $47 million as a bug bounty. The <a href=\"https:\/\/dao.mango.markets\/dao\/MNGO\/proposal\/GYhczJdNZAhG24dkkymWE9SUZv8xC4g8s9U8VF5Yprne\" data-v-f87c67ca=\"\">governance vote<\/a> also states that the project will use treasury funds to write off any remaining bad debt and won’t pursue criminal investigations once the portion of tokens is returned.","It's worth noting that the hacker used $10 million to carry out the attack, so that can be deducted from the effective bounty.","The governance vote has 119 million tokens voting in favor of it and 4.6 million against the deal. The vote has achieved quorum, meaning it will likely pass when the vote ends early on Oct. 15.&nbsp;","This governance vote was created by the Mango Markets team and the hacker doesn’t appear to have voted on it from the main wallets associated with the attack. Prior to this vote, the hacker had originally <a href=\"https:\/\/www.theblock.co\/post\/176468\/mango-markets-attacker-puts-forward-proposal-that-would-pay-them-70-million-bounty\" data-v-f87c67ca=\"\">created<\/a> a governance vote and voted on it with 33 million of the stolen tokens.","Per the deal, the hacker would also send back some of the tokens shortly after the vote opened as a “show of good faith.” According to <a href=\"https:\/\/explorer.solana.com\/address\/9mM6NfXauEFviFY1S1thbo7HXYNiSWSvwZEhguJw26wY\/tokens\" data-v-f87c67ca=\"\">on-chain data<\/a>, those tokens — worth just shy of $8 million — have been returned.","If the bug bounty is accepted it would be one of the largest bug bounties in crypto history, as <a href=\"https:\/\/www.theblockresearch.com\/what-we-know-about-the-100m-mango-markets-exploit-176711\" data-v-f87c67ca=\"\">noted<\/a> by The Block Research. That said, it’s unclear whether the agreement will be legally binding in terms of not seeking criminal prosecution.","Mango Markets is a trading and lending platform on Solana. The exploit took place due to manipulation of the price of Mango Market’s native MANGO token. This occurred through the manipulation of blockchain oracles, which provide blockchains with token price data.","The hack was the sixth-largest DeFi exploit in history, falling just behind Cream Finance’s $130 million hack.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/exploits\/largest-defi-exploits\/embed\" title=\"Largest DeFi exploits\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<em data-v-f87c67ca=\"\">Update: This story has been updated to state what the attacker spent on the attack.<br data-v-f87c67ca=\"\">\n<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Oct. 15","content":"DATE"},{"type":"$114 million","content":"MONEY"},{"type":"Cream Finance","content":"ORGANIZATION"},{"type":"$8 million","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"$47 million","content":"MONEY"},{"type":"$10 million","content":"MONEY"},{"type":"$67 million","content":"MONEY"},{"type":"$130 million","content":"MONEY"}],"hashtag":["SOLANA"],"authors":["Tim Copeland","The Block"]}