{"summary":"A CryptoPunks NFT has been sold to a buyer who swapped testnet ether tokens to fund the purchase.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/218570\/cryptopunk-nft-bid-funded-with-527000-once-worthless-testnet-ether-tokens","publishDate":"2023-03-09T14:14:06","id":4758,"type":null,"title":"CryptoPunk NFT bid funded with 527,000 once worthless testnet ether tokens","category":["METAVERSE & NFT"],"content":["An NFT buyer swapped testnet ether tokens — that are supposed to be worthless — for ETH, which was then used to buy a CryptoPunk NFT.","CryptoPunk #9682 was bought for 72.72 ETH ($111,600) earlier Thursday. On-chain <a href=\"https:\/\/etherscan.io\/tx\/0x3b4fdd72fee4be14ecb2eceb5790e8b1eb1748538567c89de5af3cf3a36bf9c6\" data-v-f87c67ca=\"\">data<\/a> show the buyer swapped 527,281 goerli ether for ETH to fund the purchase.","Goerli is an Ethereum test network, or testnet. Developers use testnets to run tests on their smart contracts or applications before deploying them on the main network.","Tokens on a testnet are supposed to be free because they typically don't have market value. Goerli ETH, like other testnet tokens, should come from faucets, websites that provide small number of tokens to users for free.","A shortage of goerli ether has, however, created a situation in which developers began to purchase the testnet token. This shortage triggered the creation of a market for goerli ether which allowed holders of the testnet tokens to swap them for actual ETH.","The emergence of a <a href=\"https:\/\/www.theblock.co\/post\/215248\/speculators-push-price-of-testnet-ether-on-goerli-network-to-1-60\" data-v-f87c67ca=\"\">monetized testnet market<\/a> has led Ethereum developers to state that they will gradually sunset goerli. For now, 1 goerli ETH is worth $0.23 and has traded as high as $1.69.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$0.23","content":"MONEY"},{"type":"$1.69","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"#9682","content":"DATE"},{"type":"$111,600","content":"MONEY"},{"type":"CryptoPunk NFT","content":"ORGANIZATION"}],"hashtag":["CRYPTOPUNKS"],"authors":["Osato Avan-Nomayo","The Block"]}