{"summary":"Bitcoin miner CleanSpark grew its hash rate by 21% and bitcoin mined by 13.4% in September.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/174684\/bitcoin-miner-cleanspark-posts-21-hash-rate-growth-in-september","publishDate":"2022-10-04T13:23:22","id":476,"type":null,"title":"Bitcoin miner CleanSpark posts 21% hash rate growth in September","category":["MINING"],"content":["Bitcoin miner CleanSpark announced that its hash rate grew 21% in September, reaching 4.16 exahases per second (EH\/s).","The company has been on a tear lately despite the bear market, <a href=\"https:\/\/www.theblock.co\/post\/168711\/bitcoin-miner-cleanspark-announces-second-acquisition-in-a-month\" data-v-f87c67ca=\"\">acquiring two facilities<\/a> in the space of a month and racking up over 16,000 <a href=\"https:\/\/www.theblock.co\/post\/168193\/bitcoin-miner-cleanspark-bought-10000-asics-at-a-significantly-discounted-price\" data-v-f87c67ca=\"\">mining machines<\/a> at a discount since June.&nbsp;","During September, CleanSpark mined 448 BTC (a 13.4% month-over-month increase) and grew its bitcoin holding to 594 BTC. It also sold 380 BTC to fund operations, for a total of about $7.5 million.","\"While we continue our strategy of deploying bitcoin to fund our growth and operations, the fact that our bitcoin treasury is increasing is testament to our growth strategy,\" Chief Financial Officer Gary Vecchiarelli said. \"The growth in our HODL balance is a direct reflection of our free cash flow resulting from our recent acquisitions, low operating costs and minimal debt service.\"","The company wants to reach 5 EH\/s by the end of the year and 22.4 EH\/s by the end of 2023. It exceeded its 4 EH\/s guidance in September by growing over 30% within the span of a month.","CleanSpark's most recent <a href=\"https:\/\/www.theblock.co\/post\/169988\/bitcoin-mining-execs-talk-industry-consolidation-cleansparks-asset-deal\" data-v-f87c67ca=\"\">acquisition \"improves operating leverage\"<\/a> and drives hash rate growth \"beyond Street expectations,\" Chardan Research said in a <a href=\"https:\/\/chardan.bluematrix.com\/sellside\/EmailDocViewer?encrypt=0d10614d-b93e-42ca-8ea3-b9d35f76b190&amp;mime=pdf&amp;co=Chardan&amp;id=bdobson@chardan.com&amp;source=mail\" data-v-f87c67ca=\"\">recent note<\/a>.&nbsp;&nbsp;","\"Our rapid growth clearly indicates where our heads are in terms of market dynamics,\" CleanSpark Executive Chairman Matthew Schultz recently said. \"All bear markets eventually end, and this one is no different. We are building the groundwork for significant acceleration when we eventually emerge on the other side of these extraordinary market conditions.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gary Vecchiarelli","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"21%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Chardan Research","content":"ORGANIZATION"},{"type":"13.4%","content":"PERCENT"},{"type":"30%","content":"PERCENT"},{"type":"June","content":"DATE"},{"type":"September","content":"DATE"},{"type":"Bitcoin miner CleanSpark","content":"ORGANIZATION"},{"type":"Matthew Schultz","content":"PERSON"},{"type":"$7.5 million","content":"MONEY"},{"type":"CleanSpark","content":"ORGANIZATION"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}