{"summary":"Polygon Labs will stop accepting contributions to the Edge framework and shift focus to chain development kit (CDK).","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267883\/polygon-labs-to-discontinue-edge-development-in-favor-of-expanding-cdk-use","publishDate":"2023-12-15T14:00:02","id":4760,"type":null,"title":"Polygon Labs discontinues Edge contributions in favor of CDK","category":["CRYPTO ECOSYSTEMS"],"content":["Polygon Labs will cease accepting contributions to its Edge framework (also called Supernets), redirecting its focus towards the expansion of <a href=\"https:\/\/www.theblock.co\/post\/247873\/polygon-labs-chain-development-kit\" data-v-f87c67ca=\"\">Chain Development Kit (CDK)<\/a>.","Edge, initially developed as an open-source tool under the Apache License 2.0, facilitated the creation of custom blockchain networks compatible with Ethereum. However, over the past year, there has been a shift in the development priorities of the team, according to a statement.","Instead of continuing with Edge, the focus will now be on the successor solution CDK, the firm's toolkit designed for the development of various Layer 2 ZK-Rollups — Layer 2 networks designed using zero-knowledge proofs. Chains deployed using the CDK are anticipated to be interoperable within a wide network.","Multiple projects, such as Immutable, <a href=\"https:\/\/www.theblock.co\/post\/262973\/okx-launches-new-zk-layer-2-network-x1-with-polygon-cdk\" data-v-f87c67ca=\"\">OKX<\/a>, Astar, Canto, <a href=\"https:\/\/www.theblock.co\/post\/241693\/palm-network-polygon\" data-v-f87c67ca=\"\">Palm Network<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/221942\/gaming-project-aavegotchi-to-release-own-blockchain-with-polygon-supernets\" data-v-f87c67ca=\"\">Aavegotchi<\/a>, IDEX, Nubank, and Manta Network, have shown interest in or have plans to use the Polygon CDK for the development of their Layer 2 networks.","“Polygon CDK-deployed chains will be interoperable within a broader web of ZK-powered L2s in the CDK ecosystem, creating a single unified pool of liquidity. These are features that Edge does not support natively and require migration with significant modifications,” Polygon Labs said in a statement shared with The Block.","The project currently utilizes two primary scaling methods: a sidechain called <a href=\"https:\/\/www.theblock.co\/learn\/249532\/what-is-polygon-and-how-does-it-work-a-beginners-guide-to-matic-cryptocurrency\" data-v-f87c67ca=\"\">Polygon PoS<\/a> and a zero-knowledge rollup network, <a href=\"https:\/\/www.theblock.co\/post\/222950\/polygon-labs-unveils-zkevm-layer-2-scaling-solution\" data-v-f87c67ca=\"\">zkEVM<\/a>.","A major development focus for Polygon Labs is the <a href=\"https:\/\/www.theblock.co\/post\/250944\/polygon-matic-upgrade\" data-v-f87c67ca=\"\">2.0 upgrade<\/a>, an ecosystem comprising multiple chains enhanced with zero-knowledge capabilities. Slated for release in 2024, this ecosystem, powered by CDK, aims to integrate Layer 2 chains based on ZK rollups and facilitate cross-chain communication.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"IDEX","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"past year","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"” Polygon Labs","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Canto","content":"ORGANIZATION"},{"type":"Palm Network","content":"ORGANIZATION"},{"type":"CDK","content":"ORGANIZATION"},{"type":"Manta Network","content":"LOCATION"},{"type":"Polygon CDK","content":"ORGANIZATION"},{"type":"Aavegotchi","content":"LOCATION"},{"type":"Astar","content":"LOCATION"},{"type":"Nubank","content":"ORGANIZATION"}],"hashtag":["POLYGON"],"authors":["Vishal Chawla","The Block"]}