{"summary":"SBF seeks to paint FTX&#x27;s practices as standard in the crypto industry, and lays blame with the U.S. government over its regulatory wrangling around digital assets over the last several years.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229881\/bankman-fried-crypto-winter-ftx-failure-dismiss-charges","publishDate":"2023-05-09T04:41:09","id":4761,"type":null,"title":"SBF blames ‘crypto winter’ for FTX failure; seeks dismissal of charges","category":["COMPANIES"],"content":["Sam Bankman-Fried’s lawyers have come out swinging against federal prosecutors, seeking to preemptively dismiss most of the criminal charges made against the disgraced FTX co-founder and former CEO before a trial can take place.","A late filing on Monday by the fallen crypto mogul’s legal team seeks to toss fraud-related charges that they argue are duplicative, and also a campaign finance-related charge, on the grounds that the charge violates terms under which the Bahamian government extradited Bankman-Fried to the U.S. to face prosecution.","Bankman-Fried’s lawyers filed seven motions to dismiss charges brought against him, arguing that most could not be prosecuted by the government. The argument made by the former FTX and Alameda Research CEO’s defense team also seeks to paint the trading platform’s practices as standard in the crypto industry, and lay blame with the U.S. government over its regulatory wrangling around digital assets over the last several years.","Calling the U.S. government’s pursuit of Bankman-Fried “a classic rush to judgment,” the FTX and Alameda owner’s defense team argues that shortcomings leading to FTX’s demise are common throughout the crypto industry. They also contend the company’s failure stems from a broader crypto winter, rather than reported failure to back FTX’s native token FTT, or secret loans from FTX to Alameda alleged by both prosecutors and the bankruptcy team put in place to manage the repayment of FTX customers and creditors.","“Like many other cryptocurrency market participants, and many other start-ups that experience exponential growth in a short period, FTX did not have fully developed controls and risk management protocols,” Bankman-Fried’s lawyers told the judge presiding over the case. “FTX, like other market participants, was susceptible to a broader market collapse.”","Bankman-Fried’s team also argues that “every major participant” in the crypto industry “cratered,” and draws parallels between the collapse of different digital asset firms and the 2008 global financial crisis, the catalyst for the popularity of bitcoin and growth of digital assets.","In the motions filed with the federal Southern District of New York, Bankman-Fried’s defense team argues that a conviction in either of two pairs of charges would be a conviction for the same crime, since the charges stem from similar portions of the law. Defendants cannot be convicted twice for the same crime in the U.S., termed a right against \"double jeopardy.\"","The early defense effort argues that going to trial with multiple criminal charges that, in their eyes, could be canceled out by others he faces may lead to “undue prejudice” in his trial. It may also be an early effort by the defense to undermine the credibility of prosecutors in the eyes of a court or a future jury.","The pairs of charges in question are a charge of conspiracy to commit bank fraud and another of conspiracy to commit wire fraud on FTX customers; and a charge of conspiracy to operate an unlicensed money transmitting business and another for conspiracy to commit commodities fraud on FTX customers. Bankman-Fried argues these pairs of charges are redundant, and that one of the charges from each pair should be withdrawn.","In separate but related motions to dismiss, the defense team also makes a series of more obscure legal arguments against other charges, including that the Bahamian government did not give its consent for some of the allegations brought against Bankman-Fried when it agreed to extradite him.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"federal Southern District of New York","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"2008","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FTX"],"authors":["Colin Wilhelm","The Block"]}