{"summary":"Sequoia Capital partners apologized to investors for the $150 million it lost on the FTX crypto exchange, the Wall Street journal reported.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189301\/sequoia-capital-apologizes-to-investors-after-150-million-ftx-loss-wsj","publishDate":"2022-11-22T16:16:35","id":4762,"type":null,"title":"Sequoia Capital apologizes to investors after $150 million FTX loss: WSJ","category":["DEALS"],"content":["Sequoia Capital partners apologized to investors for the $150 million it lost on investments in crypto exchange FTX, the Wall Street Journal reported.","In a Tuesday call with investors, Sequoia partners said the firm would improve its due-diligence process on future investments and that it believed it was misled by FTX founder and CEO Sam Bankman-Fried.&nbsp;","During the call, one partner at Sequoia reportedly said the firm will be able to have a Big Four accounting firm audit financial statements of the early-stage startups it invests in, the Wall Street Journal reported.&nbsp;","Sequoia Capital earlier this month said it had written off its entire investment in the struggling crypto exchange that filed for bankruptcy protection on Nov. 11. FTX Group <a href=\"https:\/\/www.theblock.co\/post\/188980\/ftx-group-has-cash-balance-of-1-24-billion-new-bankruptcy-filing-shows\" data-v-f87c67ca=\"\">owes $3.1 billion<\/a> to its top 50 creditors, according to recent court filings.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Sequoia Capital","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$3.1 billion","content":"MONEY"},{"type":"FTX Group","content":"ORGANIZATION"},{"type":"Sequoia","content":"ORGANIZATION"},{"type":"Nov. 11","content":"DATE"},{"type":"$150 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FTX"],"authors":["Mike Truppa","The Block"]}