{"summary":"Cory Johnson, the Bloomberg Television anchor turned crypto marketer, is no longer with Ripple. Part of Johnson&#x27;s job was to make the relationship between Ripple and XRP less confusing.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/11280\/ripple-the-firm-behind-cryptocurrency-xrp-eliminates-corey-johnsons-role-at-the-firm","publishDate":"2019-02-11T17:57:11","id":4766,"type":null,"title":"Ripple eliminates Cory Johnson&#x27;s role at the firm","category":["RIPPLE"],"content":["Cory Johnson, the Bloomberg Television anchor turned crypto marketer, is no longer with Ripple, a company spokesperson confirmed.&nbsp;","Johnson, who joined Ripple in 2018 as its chief market strategist, has been scrubbed from the company's leadership page.&nbsp;\"Cory’s last year at Ripple was a success in representing the company to investors, press and regulators,\" a spokesperson said. \"Cory helped Ripple with strategy internally and overall industry education. But due to changes in market conditions, we’ve chosen to eliminate the role of Chief Market Strategist.”&nbsp;","His much-ballyhooed hire included a profile in CNBC, which outlined his role as an evangelist for the firm known for its business lines in remittances and international payments. Johnson, whose career at Bloomberg spanned 8 years, was — unsurprisingly — a vocal defender of Ripple's view of its relationship to cryptocurrency XRP. Ripple defends that XRP is mostly independent of the firm. The connection between the two has been nothing if not controversial — with some in the crypto world <a href=\"https:\/\/www.theblockcrypto.com\/2018\/12\/06\/do-ripple-executives-statements-imply-that-xrp-is-a-security\/\" data-v-f87c67ca=\"\">arguing that the coin is a security and that Ripple is an issuer<\/a>. Ripple Labs, a precursor to Ripple, invented XRP, some say. Ripple claims they didn't but were involved in its earliest days.&nbsp;","Part of Johnson's job was to make the relationship between Ripple and XRP less confusing.&nbsp;\"The role of Ripple as a company and XRP as a currency in financial markets, to regulators, financial institutions and investors could use more explaining,\" Johnson told CNBC at the time of his hire. \"I'm going to try and explain, listen and set strategies to make it easy for Wall Street and the world of finance to understand what we're doing.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cory","content":"PERSON"},{"type":"Bloomberg Television","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Johnson","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"Cory’s","content":"PERSON"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"Johnson","content":"ORGANIZATION"},{"type":"Cory Johnson","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":["CRYPTO","MOVES"],"authors":["Frank Chaparro","The Block"]}