{"summary":"FalconX, the crypto prime broker, told clients that its financial health is strong despite the exposure it had to FTX.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193679\/falconx-ftx-exposure","publishDate":"2022-12-09T11:26:57","id":4768,"type":null,"title":"FalconX says finances strong despite FTX exposure","category":["FINANCE FIRMS"],"content":["FalconX, the crypto prime broker, told clients its finances are strong despite the exposure it had to collapsed crypto exchange FTX.","\"FalconX balances locked on FTX represented 18% of our unencumbered cash equivalents,\" the company said in an email sent yesterday to clients obtained by The Block. \"This ratio was within our counterparty exposure limits.\"","In the event nothing is recovered from FTX, FalconX said it remains \"one of the best-capitalized firms in digital assets.\" It said it had \"decades of runway\" and a debt-to-equity ratio of 4%. In addition, it noted that 80% of its balance sheet was in regulated U.S. banks.&nbsp;","FalconX said it has no exposure to FTX's sister hedge fund Alameda Research, trading firm Genesis or crypto lender BlockFi.","The company noted a bright spot amid the market turmoil, saying that its market share had increased as clients seek out proven partners.&nbsp;","\"Our volumes have grown 80%+ month-over-month, and we continue to trade billions of dollars in daily volume with clients,\" FalconX said. \"We remain confident in the future of crypto and are committed to leading the industry’s maturation.'","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"18%","content":"PERCENT"},{"type":"Alameda","content":"LOCATION"},{"type":"80%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FTX","INVESTMENT FIRMS"],"authors":["Nathan Crooks","Frank Chaparro","The Block"]}