{"summary":"Things are heating up for Kraken&#x27;s newly acquired futures trading arm, and its hoping a new hire from the over-the-counter trading world will help it","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/33265\/kraken-futures-snags-a-former-otc-trader-to-attract-big-investors-with-handsome-rebates","publishDate":"2019-07-24T15:28:26","id":4771,"type":null,"title":"Kraken Futures snags a former OTC trader to attract big investors with enticing rebates","category":["MARKETS"],"content":["Things are heating up for Kraken's newly acquired futures trading arm, and its hoping a new hire from the over-the-counter trading world will help it reach new heights.&nbsp;","<span data-v-f87c67ca=\"\">Former B2C2 managing director Kevin Beardsley has joined Kraken Futures, formerly known as Crypto Facilities, to sell big trading firms in Europe on their market for so-called perpetual futures. Such contracts, which were first popularized by trading giant BitMEX, offer a synthetic way to trade cryptocurrencies.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Beardsley is leading the business development effort for the unit, aiming to strengthen the San Francisco-based exchange’s presence in the U.K. <\/span><span data-v-f87c67ca=\"\">Kraken Futures was acquired by Kraken in February with a nine-digit sales tag. Since the acquisition, the platform's trading volumes have surged. Since March, its volumes have increased by $1 billion to $2.5 billion in June, according to a spokeswoman.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Beardsley is joining Kraken as exchanges such as Bitfinex, Binance and Huobi have announced or launched rival derivatives platforms. Faced with these late-coming challengers, Beardsley is counting on Kraken Futures’ unique fee structure and trading infrastructure to help it stand out from the pack.&nbsp;<\/span>","According to Beardsley, Kraken offers a rebate to its traders, equal to 30% of the fees its earns from trading. On Wall Street, rebates are not unusual, but such schemes are just finding their way to the market for digital currencies as fees compress.&nbsp;","","","According to Kraken, in certain weeks the firm has paid out as much as $200,000 to <a href=\"https:\/\/blog.kraken.com\/post\/2466\/six-reasons-to-trade-with-kraken-futures\/\" data-v-f87c67ca=\"\">some of its most active traders<\/a>. Beardsley says this is one of the benefits of Kraken Futures' platform that he is pitching potential new clients on.&nbsp;","<span data-v-f87c67ca=\"\">\"What I really like about Kraken is that it is a crypto native business, so it is from the ground up built on crypto infrastructure,” said Beardsley.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“If you want to custody bitcoin and manage the balance of bitcoin there is quite a lot of technical infrastructure that has to be built from the ground up to make sure that it is done accurately and more importantly securely,\" he added.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Additionally, professional traders can have their funds stored in Kraken Custody credited to the derivatives platform.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Having been in the cryptocurrency industry for many years, Beardsley has been on both sides of the exchange trading. Prior to Kraken, he served as the head of business development at digital asset investment firm Elwood Asset Management, following a one-year stint at B2C2, one of the largest cryptocurrency OTC desks and market makers.&nbsp;<\/span><span data-v-f87c67ca=\"\">Beardsley believed that his extensive experience will come in handy at his new role. <\/span>","\"Having worked across a wide range of market participants, I have a pretty good understanding of what people are looking for and how to meet those needs. I can say with confidence that Kraken Futures has the best quality product, and I am excited for what lies ahead,” he said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"Bitfinex","content":"LOCATION"},{"type":"Elwood Asset Management","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Crypto Facilities","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"U.K.","content":"LOCATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"Europe","content":"LOCATION"},{"type":"March","content":"DATE"},{"type":"Kraken Futures","content":"ORGANIZATION"},{"type":"Kraken Custody","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"$200,000","content":"MONEY"},{"type":"$2.5 billion","content":"MONEY"},{"type":"Kevin Beardsley","content":"PERSON"},{"type":"Beardsley","content":"LOCATION"},{"type":"Beardsley","content":"PERSON"},{"type":"Huobi","content":"PERSON"}],"hashtag":["DERIVATIVES","KRAKEN"],"authors":["Celia Wan","Frank Chaparro","The Block"]}