{"summary":"The Bank for International Settlements has issued recommendations for the regulation, supervision and oversight of global stablecoin arrangements.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280063\/bis-regulatory-recommendations-stablecoin-arrangements","publishDate":"2024-03-01T06:13:49","id":4775,"type":null,"title":"BIS issues regulatory recommendations for global stablecoin arrangements","category":["INTERNATIONAL POLICYMAKING"],"content":["The Bank for International Settlements has proposed <a href=\"https:\/\/www.bis.org\/fsi\/fsisummaries\/\/global_stablecoins.pdf\" data-v-f87c67ca=\"\">recommendations<\/a> for regulating global stablecoins.","In a summary of recommendations issued on Thursday, the <a href=\"https:\/\/www.theblock.co\/post\/253357\/bis-concludes-cbdc-pilot-says-elements-of-defi-could-form-new-generation-of-market-infrastructure\" data-v-f87c67ca=\"\">BIS<\/a> described GSCs as widely adopted stablecoins with a potential reach and use across multiple jurisdictions. \"A GSC could become systemically important in and across one or many jurisdictions,\" the BIS said.&nbsp;","The BIS summary outlined key recommendations that aim to address financial stability risks posed by GSCs on both the domestic and international levels.","The recommendations also aim to support GSC innovation and provide flexibility for jurisdictions to implement domestic approaches.&nbsp;","Some of the key recommendations call on global jurisdictions to be ready to regulate and supervise global <a href=\"https:\/\/www.theblock.co\/post\/275448\/stablecoins-yield-ondo-coo\" data-v-f87c67ca=\"\">stablecoin<\/a> arrangements, with a focus on cross-border cooperation, coordination and information sharing.","The recommendations outline priorities for global authorities to ensure that GSC risk management frameworks are effective.","\"Risk management frameworks should be in place that comprehensively address all material risks associated with their functions and activities, especially with regard to operational resilience, cyber security safeguards and anti-money laundering\/countering the financing of terrorism measures, as well as 'fit and proper' requirements, if applicable, and consistent with jurisdictions’ laws and regulations,\" the BIS added.","Key areas of the recommendation summary also focus on data storage and access to data, redemption rights and prudential requirements.","In its summary, the <a href=\"https:\/\/www.theblock.co\/post\/239373\/bis-survey-suggests-there-may-be-a-large-increase-in-cbdcs-by-2030\" data-v-f87c67ca=\"\">BIS<\/a> said that although stablecoins have the potential to enhance the efficiency of how financial services are provided, \"they may also generate risks to financial stability.\"","\"The recommendations seek to promote consistent and effective regulation, supervision and oversight of GSCs and stablecoins with the potential to become GSCs across jurisdictions. In addition, these recommendations emphasize a technology-neutral approach that prioritizes underlying activities and risks,\" the BIS added.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"GSC","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Bank for International Settlements","content":"ORGANIZATION"},{"type":"BIS","content":"ORGANIZATION"}],"hashtag":[],"authors":["Brian McGleenon","The Block"]}