{"summary":"Ritual, a decentralized AI compute platform, landed a $25 million capital injection in a round led by Archetype.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262114\/decentralized-ai-compute-platform-ritual-closes-25-million-fundraise","publishDate":"2023-11-08T08:01:04","id":4784,"type":null,"title":"Decentralized AI compute platform Ritual closes $25 million fundraise","category":["DEALS"],"content":["Ritual, a decentralized AI compute platform, landed a $25 million capital injection in a round led by Archetype, with Accomplice and Robot Ventures also participating.","Amid the proliferation of consumer-friendly AI technologies in the past year, spearheaded by OpenAI’s ChapGPT, Ritual aims to create an “incentivized network” that will pave the way for distributed computing devices to power different aspects of artificial intelligence, according to an announcement today. The startup said that as things stand, access to chips, computing power and the models powering AI tools lie in the hands of a small group of companies.","“The consolidation of AI among a small group of powerful companies poses a significant threat to the future of technology. We founded Ritual to end the ecosystem’s reliance on the few, to open access to this critical infrastructure, and ensure a future of building better AI. Ritual is the decentralized network that the ecosystem needs,” said Niraj Pant, co-founder of Ritual, in a statement.","Ritual is operating in a similar space to Gensyn — <a href=\"https:\/\/www.theblock.co\/post\/234092\/blockchain-compute-power-gensyn-raise\" data-v-f87c67ca=\"\">the blockchain-based marketplace for compute power that raised $43 million in a round led by a16z in June<\/a>.","Founded by Niraj Pant and Akilesh Potti, who spent three years working together at crypto investment firm Polychain Capital, Ritual laid out five key areas of focus: to create its incentivized network that connects distributed computing devices to power hosting, sharing, inference and fine-tuning of AI models; an API layer for access to models; a proof layer that guarantees computational integrity; censorship resistance; and privacy. &nbsp;","The cash injection will be used to build network infrastructure, grow the team of 15 people and to grow the Ritual’s ecosystem. The firm did not disclose a valuation for the round.","The startup plans to launch its alpha platform early next year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$43 million","content":"MONEY"},{"type":"$25 million","content":"MONEY"},{"type":"Niraj Pant","content":"PERSON"},{"type":"Akilesh Potti","content":"PERSON"},{"type":"Robot Ventures","content":"ORGANIZATION"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}