{"summary":"European Central bank chief Christine Lagarde believes that Europe will, in the end, move forward on a digital euro.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/84404\/ecb-lagarde-hunch-digital-euro","publishDate":"2020-11-12T13:37:06","id":4786,"type":null,"title":"ECB not &#x27;racing to be first&#x27; but Lagarde&#x27;s hunch is that Europe will issue a digital euro","category":["CENTRAL BANKS"],"content":["Christine Lagarde, president of the European Central Bank, has said her “hunch” is that Europe will launch a digital euro.","Speaking at the ECB Forum on Central Banking 2020 on Thursday, Lagarde said that while the central bank is not “racing to be first”, she believes a decision will be taken to move forward with the project.","“It’s not a nicety, it’s not a tantrum, it is something that if it is cheaper, faster, more secure for the users then we should explore it,” she said.","“If it is going to contribute to a better monetary sovereignty, a better autonomy for the euro area, I think we should explore it. If it is going to facilitate cross border payments, which are very laborious in quite a few corners of our big world, then we should explore it.”","Her remarks come after the ECB announced on October 2 that it would be intensifying its efforts to explore the development of a digital euro – a so-called Central Bank Digital Currency – with the launch of a public consultation and experimentation.","The digital euro is envisaged as a complement to cash, rather than as the means to replace it.","The ECB’s Eurosystem High-Level Task Force on central bank digital currency (CBDC) also published a lengthy report on the implications of issuing a digital euro, in which scenarios that would necessitate the issuance of a digital euro were identified.","These scenarios included increased demand for electronic payments in Europe, a significant decline in cash usage, a broad uptake of CBDCs issued by other central banks, and the launch of global private payment initiatives.","The latter scenario appears to refer to Facebook’s proposed stablecoin Libra, which is widely viewed as having accelerated the work being done by central banks. China’s attempt to<a href=\"https:\/\/www.theblockcrypto.com\/daily\/83711\/china-digital-yuan-alipay-wechat-dcep\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">roll out a digital yuan<\/span><\/a><span data-v-f87c67ca=\"\"> – which is already undergoing real-world trials – is seen as another key stimulant for Western governments.<\/span>","The Eurosystem High-Level Task Force on CBDCs was formed in January 2020 and is composed of representatives from more than twenty European central banks, including representatives from the Banque du France, Deutsche Bundesbank and Banco de España.","Speaking at Thursday’s event, Lagarde said that even if the decision is taken to move ahead with the digital euro project, it will not “be available right away”. The ECB would still have to assess a range of issues including anti-money laundering and terrorist financing concerns, user privacy and which technology carrier to use, according to Lagarde.","She added that a digital euro launch would likely take between two and four years to come to fruition.","Jerome H. Powell, chair of the board of governors of the Federal Reserve System, speaking on the same panel as Lagarde, said the US is “committed to carefully and thoughtfully evaluating the potential costs and benefits of a central bank digital currency”.","Doubling down on earlier comments, however, he added that the dollar’s status as the global reserve currency means it is “critical that we get it right as opposed to trying to be the first”.","Bank of England governor Andrew Bailey, who spoke alongside Powell and Lagarde, issued a telling warning for potential issuers of private stablecoins.","“People I think have a right to expect certainty of value in the instrument they use to make payments in,” he said. “I have to say that I think that means that the bar is set very high for private stablecoins, and I don’t think they’ve met that bar. They haven’t met that bar in my view. And it may be that the answer to that bar is actually central bank digital currency.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Banque du France","content":"LOCATION"},{"type":"Lagarde","content":"PERSON"},{"type":"October 2","content":"DATE"},{"type":"January 2020","content":"DATE"},{"type":"ECB","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Christine Lagarde","content":"PERSON"},{"type":"Level Task Force","content":"ORGANIZATION"},{"type":"England","content":"LOCATION"},{"type":"Jerome H. Powell","content":"PERSON"},{"type":"ECB Forum on Central Banking 2020","content":"ORGANIZATION"},{"type":"Powell","content":"PERSON"},{"type":"Europe","content":"LOCATION"},{"type":"Andrew Bailey","content":"PERSON"},{"type":"Deutsche Bundesbank","content":"ORGANIZATION"},{"type":"European Central Bank","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Federal Reserve System","content":"ORGANIZATION"},{"type":"Central Bank Digital Currency","content":"ORGANIZATION"},{"type":"Banco de España","content":"ORGANIZATION"}],"hashtag":["ECB"],"authors":["Ryan Weeks","The Block"]}