{"summary":"OpsChain from EY will help companies track supply chain information on the Polygon Nightfall blockchain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/147287\/ey-unveils-supply-chain-tracking-service-on-polygon-nightfall","publishDate":"2022-05-17T08:51:04","id":4787,"type":null,"title":"EY unveils supply chain tracking service on Polygon Nightfall","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">EY, one of the big four accounting firms, has launched a supply chain tracking service called OpsChain Supply Chain Manager on Nightfall — a Layer 2 Ethereum blockchain co-developed in partnership with <a href=\"https:\/\/www.theblockcrypto.com\/post\/139735\/polygon-unveils-identity-service-leveraging-zero-knowledge-proofs\" data-v-f87c67ca=\"\">Polygon<\/a>. <\/span>","<span data-v-f87c67ca=\"\">The two firms <a href=\"https:\/\/twitter.com\/0xPolygon\/status\/1526266413413171200\" data-v-f87c67ca=\"\">launched<\/a> Nightfall's beta release today, and made OpsChain Supply Chain Manager as one of its first applications for businesses to track supply chains.<\/span>","<span data-v-f87c67ca=\"\">OpsChain allows organizations to create fungible or non-fungible tokens (NFTs) on Nightfall. Rather than acting as cryptocurrencies, these tokens represent assets and inventory within companies that can be traced on the Nightfall blockchain. Data and transactions made by OpsChain users will be much cheaper and faster since they're not taking place on the main Ethereum blockchain itself, but on a layer above it.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">OpsChain leverages Nightfall's zero-knowledge (ZK)-proofs, a technology that allows for faster and cheaper blockchain transactions while also ensuring privacy. This means that the real transactional data is cryptographically hidden.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">According to EY, Nightfall-based OpsChain aims to serve as a tool to help companies track and manage their supply chains on the Nightfall blockchain.&nbsp;<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">“Managing complex operations across enterprise boundaries is a big step forward. EY OpsChain Supply Chain Manager significantly widens the breadth of use cases available for clients to consider,” said James Canterbury, principal and blockchain leader at EY.<\/span>","<span data-v-f87c67ca=\"\">While experts have long <a href=\"https:\/\/hbr.org\/2020\/05\/building-a-transparent-supply-chain\" data-v-f87c67ca=\"\">touted<\/a> the use of blockchains in supply chain tracking, the lack of privacy in blockchain-based transactions held back its adoption. However, as OpsChain uses Polygon Nightfall’s ZK proofs, which EY claims useful in preserving the privacy of sensitive data and hence the&nbsp; product will be fit for the supply chain software market.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"OpsChain Supply Chain Manager","content":"ORGANIZATION"},{"type":"Nightfall blockchain","content":"ORGANIZATION"},{"type":"EY","content":"ORGANIZATION"},{"type":"James Canterbury","content":"PERSON"},{"type":"OpsChain","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Polygon Nightfall","content":"ORGANIZATION"},{"type":"OpsChain Supply Chain Manager on Nightfall","content":"ORGANIZATION"},{"type":"Nightfall","content":"ORGANIZATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}