{"summary":"Coinbase NFT said it is pausing drops after an artist tweeted that a collection would no longer debut on the marketplace.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/207768\/coinbase-nft-says-its-pausing-drops-for-now","publishDate":"2023-02-01T15:57:03","id":4789,"type":null,"title":"Coinbase NFT says it’s &#x27;pausing drops for now&#x27;","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Coinbase NFT announced it is pausing new drops after artist<\/span><span data-v-f87c67ca=\"\"> Jessica Yatrofsky said her upcoming collection would no longer be released on the marketplace.<\/span>","<span data-v-f87c67ca=\"\">Coinbase NFT announced it is pausing new drops after an artist took to Twitter to say an upcoming release would not be debuting on the marketplace.<\/span>","<span data-v-f87c67ca=\"\">“My official drop, XX GEN, slated for this month with [Coinbase NFT], will no longer be released on their platform,\" artist Jessica Yatrofsky said on Twitter.<\/span>","<span data-v-f87c67ca=\"\">Coinbase NFT replied to Yatrofsky, saying, “To clear up confusion: We're pausing drops for now to focus on other areas within Coinbase NFT, but we're not shutting down the Coinbase NFT marketplace.”<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Although its marketplace has not been significant in terms of volume, Coinbase, like many other crypto companies, has been <a href=\"https:\/\/www.theblock.co\/post\/200383\/coinbase-to-cut-20-of-staff-in-latest-round-of-layoffs\" data-v-f87c67ca=\"\">struggling to navigate<\/a> a more than year-long bear market recently riddled with fraud, bankruptcies and layoffs. Coinbase’s NFT marketplace became available to the general public in the <a href=\"https:\/\/www.theblock.co\/linked\/145085\/coinbases-nft-marketplace-beta-is-now-open-to-everyone\" data-v-f87c67ca=\"\">middle of last year<\/a>.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Jessica Yatrofsky","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"LOCATION"},{"type":"Coinbase NFT","content":"ORGANIZATION"}],"hashtag":["COINBASE"],"authors":["RT Watson","The Block"]}