{"summary":"Payments can start from March 10 but won’t necessarily all be paid out until September. Plus crypto exchanges might add further delays.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/216083\/mt-gox-creditors-may-finally-start-seeing-their-bitcoins-this-month","publishDate":"2023-03-01T10:25:37","id":4795,"type":null,"title":"Mt. Gox creditors may finally start seeing their bitcoins this month","category":["CRYPTO ECOSYSTEMS"],"content":["Mt. Gox creditors may start seeing their first bitcoin payments this month as the window for repayments is set to open.","Creditors are expected to receive early repayments from March 10 onward, while the deadline for such payments to be completed is September 30, according to a <a href=\"https:\/\/www.mtgox.com\/img\/pdf\/20230106_announcement_en.pdf\" data-v-f87c67ca=\"\">January statement<\/a>. This is for the first tranche of repayments —&nbsp;including early lump sum payments and intermediate payments — with further amounts set to come later.&nbsp;","“Well, for myself, I had pretty much written off the Bitcoin I still had on Mt. Gox in 2014 as a loss, so philosophically anything I get back now is a bonus to cold store,” said Blockstream CEO Adam Back, who is a Mt. Gox creditor, via Telegram.&nbsp;","“It has stretched on for many more years than anyone expected, and so it will be welcome I am sure by any creditors to finally get paid,” he added.","Crypto exchanges may add further delays to this time frame. Each creditor had to register with an exchange and nominate it to receive the funds on their behalf. Exchanges have given various timelines for how quickly they will process payments, with BitGo saying they’ll take place within 20 days, while Kraken acknowledged payments may take up to 90 days to be processed.","While there is no clarity on how much bitcoin will be handed out to creditors during this period, it will be a portion of the exchange’s balance sheet, which totaled 142,000 bitcoin ($3.3 billion today), 143,000 bitcoin cash ($19 million) and 69 billion Yen ($510 million), according to a <a href=\"https:\/\/www.mtgox.com\/img\/pdf\/20191001_report.pdf\" data-v-f87c67ca=\"\">balance sheet<\/a> in 2019. According to two creditors, the balance sheet hasn’t changed much since.","Claimants are expected to receive around 21% of the civil rehabilitation claim value. This is different from the value of the claims at the time of bankruptcy, as the exchange rates have been revalued since.","Payments will be made in a mix of crypto —&nbsp;bitcoin and bitcoin cash&nbsp;— and fiat money. The first 200,000 yen worth of each creditor’s claim will be paid in yen. If their claim is greater than this amount and they choose crypto and cash, they will receive a mix of around 71% crypto and 29% cash after the initial payment, <a href=\"https:\/\/www.reddit.com\/r\/mtgoxinsolvency\/comments\/118crl1\/comment\/j9gm1c0\/?utm_source=share&amp;utm_medium=web2x&amp;context=3\" data-v-f87c67ca=\"\">according<\/a> to a moderator of the MtGoxInsolvency subreddit and confirmed by another creditor.&nbsp;","Two of Mt. Gox’s largest creditors, defunct crypto exchange Bitcoinica and MtGox Investment Funds (MGIF), elected to go with the early lump sum payment, <a href=\"https:\/\/www.coindesk.com\/business\/2023\/02\/16\/mt-goxs-2-largest-creditors-pick-payout-option-that-wont-force-bitcoin-selloff-sources\/\" data-v-f87c67ca=\"\">according<\/a> to CoinDesk. That means their payments weren’t automatically liquidated to be paid out fully in cash. Instead, they will receive their payments in a mix of crypto and cash.","MGIF released a legal memo prepared by an unnamed Japanese law firm in 2022 that was the basis for its decision to take the early lump sum option. The memo stated that those electing to stick with the final payouts instead of taking the early lump sum option might end up waiting five to nine years.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"Blockstream","content":"PERSON"},{"type":"Mt. Gox","content":"ORGANIZATION"},{"type":"$510 million","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"21%","content":"PERCENT"},{"type":"69 billion Yen","content":"MONEY"},{"type":"$19 million","content":"MONEY"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"$3.3 billion","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"71%","content":"PERCENT"},{"type":"September 30","content":"DATE"},{"type":"March 10","content":"DATE"},{"type":"29%","content":"PERCENT"},{"type":"Adam Back","content":"PERSON"},{"type":"Telegram","content":"ORGANIZATION"}],"hashtag":["BITCOIN"],"authors":["Tim Copeland","The Block"]}