{"summary":"The Lightnet Group said it has secured a $50 million capital commitment from LDA Capital to expand blockchain technology for remittances.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/166293\/lightnet-secures-50-million-lda-capital-commitment-for-remittances","publishDate":"2022-08-29T12:52:08","id":4798,"type":null,"title":"Lightnet secures $50 million LDA capital commitment for remittances","category":["INFRASTRUCTURE"],"content":["The Lightnet Group said it has secured a $50 million capital commitment from LDA Capital to expand blockchain technology for remittances.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSingapore-based Lightnet will have the option to increase the $50 million to a total commitment of up to $100 million over the next three years. The funds will be used for payment and blockchain ledger-based remittance services with partner company Velo Labs Technology.","Lightnet, which aims to create a global network of \"trusted financial services\" partners to enable cross-border transactions, was co-founded by Chatchaval Jiaravanon, a member of the billionaire family that controls Thai conglomerate Charoen Pokphand Group. LDA Capital is a global alternative-investment group with a background in cross-border transactions worldwide.&nbsp;","Lightnet is building pilot programs to enable remittances backed by distributed ledger technology through multiple channels, including the use of stablecoins. Transactions will bypass the SWIFT settlement process and reduce costs. SWIFT is a global inter-bank messaging system that facilitates international transactions.&nbsp;","Lightnet is tapping into a massive market where demand shows no signs of slowing down. The global digital remittance market was valued at $17.88 billion in 2021 and is expected to expand at a compound annual growth rate of 15% from 2022 to 2030, according to Grand View Research.","People are also <a href=\"https:\/\/www.nber.org\/system\/files\/working_papers\/w29337\/w29337.pdf\" data-v-f87c67ca=\"\">increasingly turning to cryptocurrency<\/a> for alternative remittances, seeking to avoid capital controls and reduce the cost of sending money abroad.","&nbsp;","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Chatchaval Jiaravanon","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Velo Labs Technology","content":"ORGANIZATION"},{"type":"$17.88 billion","content":"MONEY"},{"type":"Singapore","content":"LOCATION"},{"type":"Lightnet Group","content":"ORGANIZATION"},{"type":"Grand View Research","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"LDA Capital","content":"ORGANIZATION"},{"type":"Charoen Pokphand Group","content":"ORGANIZATION"},{"type":"2030","content":"DATE"},{"type":"$50 million","content":"MONEY"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}