{"summary":"A federal judge in Seattle ruled that Chanpeng Zhao can’t return to the UAE before he’s sentenced in the U.S. in February.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266685\/zhao-cant-return-to-uae-before-sentencing-report","publishDate":"2023-12-07T20:09:16","id":4799,"type":null,"title":"Zhao can’t return to UAE before sentencing: report","category":["POLICY"],"content":["A federal judge in Seattle ruled that Chanpeng Zhao, former CEO of Binance, can’t return home to the United Arab Emirates before he’s sentenced in the U.S. in February.","The <a href=\"https:\/\/www.theblock.co\/post\/264875\/judge-says-cz-cant-return-to-uae-ahead-of-sentencing-for-now\" data-v-f87c67ca=\"\">same ruling was issued on November 27<\/a>, pending a further review. Prosecutors had warned that Zhao presented a flight risk, citing his wealth and the fact that the UAE has no extradition treaty with the U.S.","U.S. District Judge Richard Jones on Thursday rejected the idea of Zhao returning to the UAE outright before he is sentenced, according to the Bloomberg report today. In November, Zhao <a href=\"https:\/\/www.theblock.co\/post\/253681\/changpeng-cz-zhao-steps-down-as-binance-ceo\" data-v-f87c67ca=\"\">pleaded guilty<\/a> in a Seattle court to violating, and causing a financial institution to violate, the Bank Secrecy Act. He also agreed to pay a $50 million fine.","Theoretically, Zhao could face as much as 10 years in prison.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Chanpeng Zhao","content":"PERSON"},{"type":"Richard Jones","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"November 27","content":"DATE"},{"type":"Zhao","content":"PERSON"},{"type":"United Arab Emirates","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Seattle","content":"LOCATION"},{"type":"UAE","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}