{"summary":"The Sandbox and Decentraland tokens went a mini bull run during January, each more than doubling in price at one point amid a massive spike in trading volume.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/207129\/the-sandbox-decentraland-land-prices-double-during-mysterious-january-bull-run","publishDate":"2023-01-31T11:30:27","id":4802,"type":null,"title":"The Sandbox, Decentraland token prices double during mysterious January bull run","category":["METAVERSE & NFT"],"content":["<span data-v-f87c67ca=\"\">Explanations for why The Sandbox and Decentraland’s native tokens more than doubled during the beginning of this year may be elusive, but the rebound is certainly welcome news to anyone who bought in at the bottom of the market.<\/span>","<span data-v-f87c67ca=\"\">O<\/span>ut of the two metaverse platforms where people can buy and develop virtual land, Decentraland’s MANA token performed the best, leaping to a shade under $0.80 from a Jan. 1 price of about $0.30, according to CoinGecko. That’s still way off MANA’s all-time high of $5.12, which it achieved during the particularly frothy bull run that capped off 2021.","For its part, The Sandbox token SAND hit a January high of $0.84, climbing from $0.38 at the start of the year, according to CoinGecko. SAND also peaked in late 2021, eclipsing $7.00.","The price gains give no clear indication whether the crypto winter is even close to over, or another bull run is lurking around the corner. But lik<span data-v-f87c67ca=\"\">e the price gains witnessed by bitcoin and ethereum — both of which are up more than 30% this month — a spot of positivity is definitely welcome news for a digital-assets industry that has been pummeled by months of scandal and value deterioration.<br data-v-f87c67ca=\"\">\n<\/span>","<em data-v-f87c67ca=\"\">January price performance and volume for Decentraland's MANA token.<\/em>","<span data-v-f87c67ca=\"\">“The market has been very optimistic recently with the lead of large caps like bitcoin and ethereum,” said analyst Steven Zheng of The Block Research. “Typically when large caps lead for a prolonged period of time, traders start to look for newer narratives to trade around.”<\/span>","<span data-v-f87c67ca=\"\">Trading volume for metaverse tokens also jumped considerably according to CoinGecko data. Daily trading for MANA hovered at around $50 million for about the first week of January, soaring as high as a $1.1 billion mid-month. SAND volumes exceeded $795 million after beginning January at about $95 million. <\/span>","<span data-v-f87c67ca=\"\">Zheng said it’s difficult to pinpoint precisely why The Sandbox and Decentraland’s tokens spiked in January. “It seems like the metaverse narrative is the new flavor of recent weeks with this SAND and MANA pump,” he said.<br data-v-f87c67ca=\"\">\n<\/span>","<em data-v-f87c67ca=\"\">January price performance and volume for The Sandbox's SAND token.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$95 million","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$5.12","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"Steven Zheng","content":"PERSON"},{"type":"$0.84","content":"MONEY"},{"type":"$7.00","content":"MONEY"},{"type":"30%","content":"PERCENT"},{"type":"$0.80","content":"MONEY"},{"type":"MANA","content":"ORGANIZATION"},{"type":"$0.30","content":"MONEY"},{"type":"Jan. 1","content":"DATE"},{"type":"$795 million","content":"MONEY"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"$1.1 billion","content":"MONEY"},{"type":"$0.38","content":"MONEY"},{"type":"Decentraland","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":[],"authors":["RT Watson","The Block"]}