{"summary":"Digital Currency Group subsidiary Genesis allegedly made &quot;little effort&quot; to address AML and customer-disclosure deficiencies.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/272310\/genesis-settlement-bitlicense-new-york","publishDate":"2024-01-12T09:42:42","id":4803,"type":null,"title":"Genesis settles with New York regulator, forfeits BitLicense and fined: Fortune","category":["REGULATION"],"content":["Genesis Global Trading, a subsidiary of Digital Currency Group, has reportedly settled with the New York Department of Financial Services after an investigation uncovered anti-money laundering and cybersecurity deficiencies. It will&nbsp;give up its BitLicense — New York's license for virtual currency activities — and pay an $8 million fine.","“Genesis Global Trading’s failure to maintain a functional compliance program demonstrated a disregard for the Department’s regulatory requirements and exposed the company and its customers to potential threats,” Superintendent Adrienne Harris said in a statement shared with Fortune, who first <a href=\"https:\/\/fortune.com\/crypto\/2024\/01\/12\/genesis-settlement-department-financial-services-barry-silbert-bitlicense-crypto\/\" data-v-f87c67ca=\"\">reported<\/a> the news.","Harris' statement comes after DFS examined Genesis twice, and found AML and cybersecurity failures that the firm addressed with \"little effort or resources\" — apparently having no dedicated officer to oversee AML compliance.","DFS also claims Genesis failed to provide proper disclosures to its customers.","An official announcement is reportedly coming later today.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"DFS","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Harris","content":"PERSON"},{"type":"$8 million","content":"MONEY"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Department","content":"ORGANIZATION"},{"type":"Adrienne Harris","content":"PERSON"},{"type":"AML","content":"ORGANIZATION"}],"hashtag":["INVESTMENT FIRMS"],"authors":["Adam James","The Block"]}