{"summary":"The percentage cut NFT creators take as royalties has been increasing. Reddit&#x27;s NFT marketplace has more wallets than OpenSea. Some people spent over 90 hours in the metaverse last month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/181806\/october-nft-data-wrap-is-the-metaverse-a-barren-wasteland","publishDate":"2022-11-01T14:05:45","id":4804,"type":null,"title":"October NFT data wrap: Is the metaverse a barren wasteland?","category":["NFTS"],"content":["Top NFT marketplaces dropped royalties in October in a bid to compete with lower-priced alternatives, with <a href=\"https:\/\/www.theblock.co\/post\/178362\/magic-eden-coo-calls-0-royalties-a-prisoners-dilemma\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Magic Eden<\/a> becoming the largest domino to fall so far, followed by <a href=\"https:\/\/www.theblock.co\/post\/180427\/looksrare-becomes-latest-nft-marketplace-to-nix-royalties-exclusive\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">LooksRare<\/a>. Two questions remain: Is OpenSea next, and will creators find new revenue streams?","Meanwhile, in the metaverse, a new data-centric debate has started around calculating the number of users on metaverse platforms. But even if new subscribers do use metaverse platforms, one lawyer’s research on metaverse terms of service might be enough to put them off.","All this and more in the October NFT data wrap.","If a tree falls in the metaverse, is anyone around to hear it? Apparently not, according to DappRadar data.","That data came under scrutiny last month for showing that blockchain-based metaverses are barren, empty wastelands devoid of players. In one 24-hour period, for example, Decentraland appeared to have just 38 active users.&nbsp;","Decentraland refuted the methods DappRadar uses for calculating active users, namely how many unique wallet addresses interact with a platform’s smart contract. The metaverse platform itself defines an active user as someone who enters Decentraland and moves out of the initial parcel they first entered.","By that metric, on Oct. 11, the Decentraland Foundation <a href=\"https:\/\/decentraland.org\/blog\/announcements\/how-many-dau-does-decentraland-have\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">estimated<\/a> 8,000 daily active users.","Source: DCL Metrics","DappRadar updated how it calculates its total to include 3,553 different Decentraland smart contracts, but it still estimates about 6,200 unique active wallets in total for the past 30 days, an average of 206 per day. It’s important to note you don’t need a wallet to access Decentraland, though it does limit some functions, including the ability to save your avatar's appearance.","DCL Metrics also revealed <a href=\"https:\/\/dcl-metrics.com\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">data<\/a> about the most hardcore metaverse players, some of whom have spent literal days playing on the platform over the last month.","Source: DCL Metrics","Lawyer James Murphy and his team at MetaLawMan recently undertook the unenviable task of reading the <a href=\"https:\/\/www.metalawman.io\/_files\/ugd\/f6ab3a_bd10529e461641c69f7a11fbeb8d3541.pdf?index=true\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">terms of service<\/a> for 82 metaverse platforms. Almost four in five already have explicit content moderation policies that prohibit certain categories of speech.","“If you violate the speech code, the metaverse operator generally has the right to suspend or terminate your account,” Murphy said. \"It is not always clear what exactly counts as prohibited by these content policies. Roblox, for example, prohibits creators of user-generated content from using their creations in ‘a manner that is offensive’ or ‘otherwise objectionable.’ But concepts like ‘objectionable’ and ‘offensive’ can sometimes be in the eye of the beholder.\"","In the UK, metaverse platforms will fall under the scope of a controversial <a href=\"https:\/\/www.theblock.co\/post\/180445\/metaverse-platforms-to-fall-under-scope-of-controversial-uk-online-safety-bill\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">new bill<\/a> that will make them responsible for user-generated content on their platform. These platforms therefore may start running into some of same problems that social media companies currently face with regards to content moderation.","Metaverses are also attempting to shore up their defenses against any future litigation. A total of 46 require disputes to be adjudicated in private arbitration and require users to forego the right to litigate in any court anywhere. Thirty-two metaverses include specific limitations on the damages a user can recover from the operator of the metaverse if there is a dispute, ranging from $1,000 to just $5.","When a Reddit company executive <a href=\"https:\/\/www.theblock.co\/post\/179797\/reddit-avoids-crypto-lingo-shows-how-to-take-nfts-mainstream\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">mentioned<\/a> that the site's NFT marketplace has almost three million crypto wallets some heralded it as the beginning of mass adoption. People took particular note of the fact that its NFTs were called “digital collectibles,” leading to suggestions that “NFT” has become something of a dirty word.","Reddit's collectable avatars can be used as avatars on the site. While collections sold out, they were very quiet on the secondary market until recently when <a href=\"https:\/\/www.theblockresearch.com\/reddit-collectible-avatars-the-trojan-horse-of-nfts-180952?utm_source=rss&amp;utm_medium=rss\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">popularity spiked<\/a>.","","","Initially priced between $9.99 and $99.99, certain pieces have sold for eye-watering amounts, the most expensive going for over $40,000.","","","A total of 99% of collectors hold only one Reddit avatar. Compare that to other popular collections: There are 6,400 wallets holding the 10,000 Bored Ape Yacht Club (BAYC) NFTs in existence. Moonbirds feature in 6,600. Other collections fare much worse. Goblintown NFTs can be found in 4,600 unique wallets and Cryptopunks just 3,600.","Source: Galaxy Digital","In early 2021, Yuga Labs set a 2.5% royalty on BAYC NFTs. By the end of 2021, collections such as Azuki, Doodles, CloneX and Moonbirds were taking 5%. Otherdeed followed suit with a 5% royalty rate when it launched this year. Meebits also switched from a 0% to 5% royalty fee.","More recently, Goblintown has 7.5% royalty fee — which has earned the team about $7 million — while NFT Worlds takes 9.5% in royalties. Some top consumer brands are also among the highest royalty collections. Nickelodeon takes an average of 10% in royalties. Currently trending Art Gobblers takes a 6.9% royalty fee.","Overall NFT creators have earned more than $1.8 billion in royalties on Ethereum to date. Ten NFT collections account for 27% of all royalties and 482 for 80%.","Finally, NFT markets remain down. Those on Ethereum recorded a monthly volume of $378 million last month, a decrease of 25% month-over-month.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/nft-overview\/nft-trade-volume-by-chain\/embed\" title=\"NFT Trade Volume by Chain\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Reddit","content":"LOCATION"},{"type":"$9.99","content":"MONEY"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"6.9%","content":"PERCENT"},{"type":"80%","content":"PERCENT"},{"type":"James Murphy","content":"PERSON"},{"type":"Murphy","content":"PERSON"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"2.5%","content":"PERCENT"},{"type":"Azuki","content":"LOCATION"},{"type":"$5","content":"MONEY"},{"type":"$1.8 billion","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"27%","content":"PERCENT"},{"type":"Moonbirds","content":"PERSON"},{"type":"0%","content":"PERCENT"},{"type":"7.5%","content":"PERCENT"},{"type":"$99.99","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"9.5%","content":"PERCENT"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"$7 million","content":"MONEY"},{"type":"$1,000","content":"MONEY"},{"type":"99%","content":"PERCENT"},{"type":"Decentraland Foundation","content":"ORGANIZATION"},{"type":"Oct. 11","content":"DATE"},{"type":"$378 million","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"Decentraland","content":"LOCATION"},{"type":"$40,000","content":"MONEY"},{"type":"Goblintown","content":"PERSON"},{"type":"Magic Eden","content":"ORGANIZATION"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}