{"summary":"Former FTX CEO Sam Bankman-Fried denied any willful wrongdoing in an interview with the New York Times, but not everyone believes he is sincere.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/191180\/sam-bankman-frieds-bizarre-apology-tour-goes-prime-time","publishDate":"2022-11-30T20:44:44","id":4809,"type":null,"title":"Sam Bankman-Fried&#x27;s bizarre apology tour goes prime time","category":["PEOPLE"],"content":["<span data-v-f87c67ca=\"\">In a live, prime-time broadcast, former FTX CEO Sam Bankman-Fried described the murky relationship between the crypto exchange and trading firm he founded, Alameda Research.<\/span>","<span data-v-f87c67ca=\"\">He spoke during a widely anticipated interview with the New York Times’ Andrew Ross Sorkin.<\/span>","<span data-v-f87c67ca=\"\">Many in his position would have likely laid low, but disgraced crypto entrepreneur and one-time billionaire Sam Bankman-Fried is nothing if not unusual.<\/span>","<span data-v-f87c67ca=\"\">In another surprising twist, Bankman-Fried moved into the live phase of his apology tour on Wednesday, giving a prime-time <a href=\"https:\/\/www.theblock.co\/post\/191141\/sam-bankman-fried-set-to-speak-at-new-york-times-event-a-live-look\" data-v-f87c67ca=\"\">interview to the New York Times<\/a>, admittedly against his lawyers' advice.<\/span>","<span data-v-f87c67ca=\"\">“We messed up big,” he said, oftentimes visibly shaking, sipping seltzer or looking down at the ground as he spoke. “I was responsible, ultimately.\" The interview comes after risky positions and the apparent commingling of assets between the firms saw millions of customers defrauded and billions of dollars in losses for investors. <\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried took responsibility for a lack of oversight that he said led to a discrepancy regarding risky market positions Alameda Research held with FTX, which he said were not displayed on dashboards the former CEO had been working from to gauge the two firms’ solvency.<\/span>","<span data-v-f87c67ca=\"\">However, when probed over whether or not he knowledgeably committed fraud and illegally commingled customer assets to back Alameda, Bankman-Fried flatly denied any willful wrongdoing. “I didn’t ever try to commit fraud,” he said, adding that a month prior he was “excited about the prospects” for FTX.<\/span>","<span data-v-f87c67ca=\"\">Comments from Bankman-Fried come amid an ongoing bankruptcy proceeding for FTX, as authorities continue to investigate the nature of the relationship between Alameda Research and the now-capsized exchange.<\/span>","<span data-v-f87c67ca=\"\">Embroiled in the fallout of the defunct trading firm and exchange are users who cannot withdraw digital assets as well as a number of crypto lending platforms and companies with assets under the management of, or otherwise exposure to, FTX and Alameda Research. The rapid decline of the companies also impacted wider digital asset markets, as some liken it to crypto’s version of Enron or the collapse of Lehman Brothers.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">For his role in the matter, Bankman-Fried said he had not actively managed Alameda to avoid any potential conflict of interest, and failed to appoint administrative staff to manage risk. He said the same of his failure to put someone in charge of the positional risk of FTX customers.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">The claim of faulty risk management as a credible excuse doesn’t appear to be cutting it for some. “<\/span><span data-v-f87c67ca=\"\">He denied that he was involved with any criminal activity and tried to paint the picture that this fiasco was solely the result of poor risk management rather than outright fraud,” said <\/span><a href=\"https:\/\/twitter.com\/samcallah?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Sam Callahan,<\/span><\/a><span data-v-f87c67ca=\"\"> a bitcoin analyst at Swan Bitcoin, adding that, from his perspective, Bankman-Fried “played the embarrassed, innocent, and clueless founder to perfection.”<\/span>","<span data-v-f87c67ca=\"\">Others were much kinder in their assessment. “Call me crazy, but I think SBF is telling the truth,” tweeted billionaire investor and Pershing Square Capital Management CEO Bill Ackman.<\/span>","Call me crazy, but I think <a href=\"https:\/\/twitter.com\/SBF?ref_src=twsrc%5Etfw\" data-v-f87c67ca=\"\">@sbf<\/a> is telling the truth.","<script async=\"async\" src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\" data-v-f87c67ca=\"\"><\/script>","<span data-v-f87c67ca=\"\">Before Bankman-Fried’s live interview, the New York Times’ Andrew Ross Sorkin spoke to a wide range of notable figures and respected business leaders including Meta CEO Mark Zuckerberg, <\/span><span data-v-f87c67ca=\"\">U.S. Treasury Secretary <\/span><span data-v-f87c67ca=\"\">Janet Yellen, <a href=\"https:\/\/www.theblock.co\/post\/191031\/blackrock-chief-executive-fink-said-firm-invested-24-million-in-ftx\" data-v-f87c67ca=\"\">BlackRock's Larry Fink<\/a>, Netflix CEO Reed Hastings and actor Ben Affleck.<\/span>","While Bankman-Fried granted live interviews to the New York Times and ABC News, FTX’s new chief executive John Ray told the company’s employees earlier this week that Bankman-Fried is not involved in day-to-day operations. Although he has been deposed as FTX’s leader, it is likely that Bankman-Fried is still the company’s largest shareholder despite accumulating losses of around $8 billion.","<span data-v-f87c67ca=\"\">During her time on stage <\/span><span data-v-f87c67ca=\"\">Yellen called the collapse of Bankman-Fried’s FTX “a <a href=\"https:\/\/www.theblock.co\/post\/191036\/ftxs-collapse-is-a-lehman-moment-for-crypto-yellen\" data-v-f87c67ca=\"\">Lehman moment<\/a>” for the digital asset industry. “It’s a Lehman moment within crypto, and crypto is big enough that you’ve had substantial harm [to] investors … and that’s a very bad thing,” she said.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Besides Bankman-Fried saying that the largest number of those wronged by his actions were FTX customers, he also said that not only have those close to him been hurt, but that he had had a hard time coping as well. <\/span><span data-v-f87c67ca=\"\">“I’ve had a bad month,” he said.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">While the live audience laughed, on Twitter some users took offense. “<\/span><span data-v-f87c67ca=\"\">It sounds so disconnected from reality, really disgusting to watch,” wrote Julien Bouteloup, founder and CEO at Stake Capital Group.<\/span>","SBF: \"I had a bad month\" <br data-v-f87c67ca=\"\">\nand audience immediately starts laughing... <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nit sounds so disconnected from reality. really disgusting to watch. A stupid Sam but even more stupid audience. <a href=\"https:\/\/t.co\/Y5Mj3azoP1\" data-v-f87c67ca=\"\">https:\/\/t.co\/Y5Mj3azoP1<\/a> <a href=\"https:\/\/t.co\/Dnd4CMGfbW\" data-v-f87c67ca=\"\">pic.twitter.com\/Dnd4CMGfbW<\/a>","<script async=\"async\" src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\" data-v-f87c67ca=\"\"><\/script>","Toward the end of the unusual live interview, the one-time toast of the crypto world was asked if he had been truthful with his answers.&nbsp;","“I was as truthful as I, as, you know, I’m knowledgeable to be,” he said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Enron","content":"ORGANIZATION"},{"type":"Reed Hastings","content":"PERSON"},{"type":"billions of dollars","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Swan Bitcoin","content":"ORGANIZATION"},{"type":"Janet Yellen","content":"PERSON"},{"type":"Netflix","content":"ORGANIZATION"},{"type":"Larry Fink","content":"PERSON"},{"type":"Mark Zuckerberg","content":"PERSON"},{"type":"Bill Ackman","content":"PERSON"},{"type":"Ben Affleck","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Lehman Brothers","content":"ORGANIZATION"},{"type":"Sam Callahan","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Yellen","content":"PERSON"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"ABC News","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Pershing Square Capital Management","content":"ORGANIZATION"},{"type":"Stake Capital Group","content":"ORGANIZATION"},{"type":"Julien Bouteloup","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"John Ray","content":"PERSON"},{"type":"Andrew Ross Sorkin","content":"PERSON"},{"type":"$8 billion","content":"MONEY"}],"hashtag":[],"authors":["Jeremy Nation","RT Watson","The Block"]}