{"summary":"The PwC and Aspen Digital study shows growing demand for institutional-grade custody solutions in Asia among family offices and rich investors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/238894\/institutional-self-custody-pwc","publishDate":"2023-07-11T09:32:13","id":4811,"type":null,"title":"Institutional investors shun self-custodial crypto solutions, PwC report finds","category":["INSTITUTIONAL INVESTORS"],"content":["Institutional investors in Asia are increasingly turning to third-party custody service providers to navigate the complexities of the <a href=\"https:\/\/www.coingecko.com\/\" data-v-f87c67ca=\"\">$1.2 trillion<\/a> digital asset market, pointing to the limitations of self-custodial solutions.","There is a growing demand for institutional-grade custody solutions among family offices, high-net-worth individuals and external asset managers in safeguarding their digital asset holdings and exploring new investment opportunities, according to a joint <a href=\"https:\/\/drive.google.com\/file\/d\/1XC_Hoa6mNqnqtMkcFw0ITn0YkqnqoPbQ\/view\" data-v-f87c67ca=\"\">report<\/a> released by the digital asset wealth platform Aspen Digital and “big four” global accounting firm PwC today.","Self-custody solutions offer users complete control over their digital assets but they are solely responsible for managing their own private keys to secure them. Given this challenge and concerns over hacks, the report indicates an institutional preference for third-party custody providers due to their specialized capabilities and expertise.","“More institutional investors are recognizing the limitations of self-custodial solutions for their ongoing trading and operational needs. Instead, many institutions prefer third-party custody service providers,” Aspen Digital said in a statement.","Over <a href=\"https:\/\/www.blockdata.tech\/markets\/use-cases\/custody-solutions\" data-v-f87c67ca=\"\">120 custody providers<\/a>, including Citigroup and Deutsche Bank, are now operating in the space as of April 2023, according to Blockdata.","In its 2022 <a href=\"https:\/\/www.pwc.com\/us\/en\/tech-effect\/emerging-tech\/metaverse-survey.html\" data-v-f87c67ca=\"\">metaverse survey<\/a>, PwC found that 82% of U.S. executives expected to integrate web3 into their operations within three years. However, in this latest report, most NFT self-custody solutions were also found to pose a challenge for institutional investors.","Digital asset custodians are, therefore, evolving beyond their traditional role of safeguarding cryptocurrencies to assist investors in navigating emerging asset classes such as DeFi, NFTs and the metaverse, Aspen Digital said.","\"Safekeeping of assets and ensuring they are segregated from client service providers' own (house) assets is a fundamental need,” PwC digital assets and web3 co-lead Duncan Fitzgerald said in the statement. “This has applied for many years in the traditional securities industry — so I am pleased to see that there are credible options available now in the digital assets ecosystem.\"","“For institutional investors looking to allocate into digital assets, understanding the unique characteristics of custody solutions and providers compared with traditional assets is one of the biggest impediments when considering investment,” Aspen Digital CEO Elliot Andrews added. “Implementing the right digital asset custody solution is crucial for successful investment opportunities and to avoid significant asset losses.”&nbsp;","Although institutional-grade digital asset custody solutions are in demand, concerns remain regarding asset security, fragmented regulations and comprehensive insurance coverage, Aspen Digital said. “Digital asset custodians are addressing security risks through advanced technologies such as multi-party computation, keeping up with evolving regulations and meeting investors’ expectations for insurance coverage across different types of digital assets,” it added.","The report comes at a time of increased optimism surrounding the prospect of a spot bitcoin ETF in the United States, following the renewed race kicked off by <a href=\"https:\/\/www.theblock.co\/post\/235056\/blackrock-takes-giant-leap-toward-spot-bitcoin-etf-with-sec-filing\" data-v-f87c67ca=\"\">BlackRock<\/a> on June 15, with Coinbase listed as the custodian. If a spot bitcoin ETF application is approved by the Securities and Exchange Commission, it would provide another avenue for institutional investors to gain exposure to bitcoin without custodying the underlying asset themselves.","Last month, another PwC <a href=\"https:\/\/www.theblock.co\/post\/151474\/pwc-survey-sees-more-hedge-funds-investing-in-crypto-in-spite-of-volatility\" data-v-f87c67ca=\"\">survey<\/a> found more hedge funds investing in crypto, despite recent volatility.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Deutsche Bank","content":"ORGANIZATION"},{"type":"” Aspen Digital","content":"ORGANIZATION"},{"type":"April 2023","content":"DATE"},{"type":"Aspen Digital","content":"ORGANIZATION"},{"type":"$1.2 trillion","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Citigroup","content":"ORGANIZATION"},{"type":"Asia","content":"LOCATION"},{"type":"82%","content":"PERCENT"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"PwC","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Elliot Andrews","content":"PERSON"},{"type":"Blockdata","content":"ORGANIZATION"},{"type":"Duncan Fitzgerald","content":"PERSON"},{"type":"June 15","content":"DATE"},{"type":"United States","content":"LOCATION"}],"hashtag":["BLACKROCK","INVESTMENT FIRMS"],"authors":["James Hunt","The Block"]}