{"summary":"Some of the institutional crypto world&#x27;s power brokers say that crypto markets would be trading lower even if Celsius hadn&#x27;t paused withdrawals.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/151757\/celsius-turmoil-is-part-of-a-broader-macro-picture-traders-say","publishDate":"2022-06-13T17:18:17","id":4812,"type":null,"title":"Celsius turmoil is part of a broader macro picture, traders say","category":["MARKETS"],"content":["The turmoil surrounding crypto lender Celsius has generated headlines and controversy over the past day — but that even isn't top of mind for the market's biggest traders, executives at several trading firms say.","Crypto prices fell sharply Monday in the aftermath of Celsius's announcement. As The Block&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/linked\/151522\/crypto-lending-firm-celsius-pauses-withdrawals-and-transfers-citing-market-conditions\" data-v-f87c67ca=\"\">reported<\/a>, Celsius — which had as much as $11 billion in user assets as of May — froze withdrawals and paused transfers between accounts, citing \"extreme market conditions.\"","Still, the broader macro-economic backdrop is likely what is in the driver's seat of the crypto market — not Celsius.","\"Our clients are far more worried about macro than Celsius,\" said Aya Kantorovich of FalconX, a firm that offers institutional financial services. \"Market is just very frothy and the macro environment is terrible.\"&nbsp;","As Bloomberg reported Monday, the market has entered a \"sell everything but the dollar period\" during which traders are fleeing to safety, spurred by fears that the US Federal Reserve could hike rates more aggressively to combat inflation than originally anticipated.","Specifically, banks like Barclays and Jefferies have <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-06-13\/wall-street-floats-100-basis-point-fed-hike-as-inflation-stings\" data-v-f87c67ca=\"\">raised<\/a> their forecasts to 75 basis points. Other Wall Street analysts have speculated a full 100 basis-point hike. Such an outcome could have negative implications for risk assets like crypto.","","","<i data-v-f87c67ca=\"\">Source: Ychart&nbsp;<\/i>","","","<em data-v-f87c67ca=\"\">Source: CoinGecko<\/em>","Inflation, which some market participants thought would be transitory at the end of last year and into 2022, has proven to be sticky. US Labor Department recently said that the consumer price index increased 8.6% last month versus May 2021, the hottest read since the early 1980s.&nbsp;","As Goldman Sachs pointed out in a recent research note: \"Surprisingly strong CPI data reaffirm our view that the Fed's battle with inflation has put a ceiling on equity valuations.\"","The bank added:","\"Despite the 18% YTD S&amp;P 500 decline, equity valuations remain far from depress. The median S&amp;P 500 constituent's P\/E ratio of 18x ranks in the 87th percentile since 1976.\"","It's this environment that traders are navigating, meaning the Celsius situation is part of a bigger picture.","One trader at a hedge fund told The Block that \"[crypto] markets would have been down today regardless of Celsius [because] of macro.\"","\"Celsius certainly doesn't help,\" they added.","When reached by The Block, Caisse de dépôt et placement du Québec (CDPQ), a pension fund company and <a href=\"https:\/\/www.theblockcrypto.com\/linked\/120234\/celsius-raises-400-million-amid-mounting-regulatory-pressure\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Celsius investor<\/a>, highlighted the difficult investment environment","The firm said that \"in an environment of generalized market declines (stock markets and bonds—for the first time in 50 years), investors are reducing their risk in all asset classes.\"","CDPQ went on to say: \"In this context, Celsius has been impacted by very difficult markets in recent weeks, more specifically, the strong volume of withdrawals by customers.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"US Federal Reserve","content":"ORGANIZATION"},{"type":"Barclays","content":"ORGANIZATION"},{"type":"May 2021","content":"DATE"},{"type":"Fed","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"8.6%","content":"PERCENT"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"S&amp;P","content":"ORGANIZATION"},{"type":"$11 billion","content":"MONEY"},{"type":"1980s","content":"DATE"},{"type":"Aya Kantorovich","content":"PERSON"},{"type":"1976","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"18%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"last year","content":"DATE"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Celsius","content":"ORGANIZATION"},{"type":"Jefferies","content":"ORGANIZATION"},{"type":"US Labor Department","content":"ORGANIZATION"}],"hashtag":["GOLDMAN SACHS","LENDING"],"authors":["Frank Chaparro","The Block"]}