{"summary":"A Californian law firm filed a class-action lawsuit against almost 40 people and companies, including Yuga Labs and MoonPay, alleging they were part of “a vast scheme” of undisclosed celebrity endorsements.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193746\/yuga-labs-moonpay-named-in-celebrity-nft-endorsement-lawsuit","publishDate":"2022-12-09T16:30:49","id":4817,"type":null,"title":"Yuga Labs, Moonpay named in celebrity NFT endorsement lawsuit","category":["METAVERSE & NFT"],"content":["A Californian law firm filed a class-action suit against almost 40 people and companies, including Yuga Labs and MoonPay, alleging they were part of “a vast scheme” of undisclosed celebrity endorsements.","Scott + Scott, which was recently scouting for participants for the class action, claim that Yuga Labs and Hollywood talent agent Guy Oseary devised a plan to leverage their “vast network of A-list musicians, athletes, and celebrity clients and associates to misleadingly promote and sell the Yuga Financial Products,” including its Bored Ape Yacht Club (BAYC) NFTs.&nbsp;","The firm alleged that MoonPay was used as a “front operation” to compensate promoters without disclosing it to investors. As a result, it claims defendants were able to \"artificially increase the interest in and price of the BAYC NFTs during the Relevant Period, causing investors to purchase these losing investments at drastically inflated prices.\"","The lawsuit also includes allegations about MoonPay’s relationships with celebrities, which have come under scrutiny before.&nbsp;","MoonPay declined to comment. Yuga Labs called the claims “opportunistic and parasitic.”","“We strongly believe that they are without merit, and look forward to proving as much,” said a Yuga Labs spokesperson.","MoonPay CEO Ivan Soto-Wright has previously acknowledged commercial relationships with users of its Concierge service, but actual <a href=\"https:\/\/www.theblock.co\/post\/128517\/moonpay-boss-on-how-the-startup-is-guiding-celebs-into-nfts\" data-v-f87c67ca=\"\">details<\/a> have been scarce.","Earlier this week, a federal judge<a href=\"https:\/\/www.theblock.co\/post\/193088\/judge-dismisses-crypto-class-action-suit-against-kim-kardashian\" data-v-f87c67ca=\"\"> dismissed<\/a> a proposed class-action lawsuit against EthereumMax founders and celebrity promoters including Kim Kardashian, with judge Michael Fitzgerald ruling that customers should have known better, even though he said he worried about \"celebrities’ ability to readily persuade millions of undiscerning followers to buy snake oil with unprecedented ease and reach.\"","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This story has been&nbsp;<\/i><\/span><i data-v-f87c67ca=\"\">updated to include a response from Yuga Labs.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span><\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Michael Fitzgerald","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"MoonPay","content":"PERSON"},{"type":"Yuga Labs","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Wright","content":"PERSON"},{"type":"Yuga Financial Products","content":"ORGANIZATION"},{"type":"Kim Kardashian","content":"PERSON"},{"type":"Scott + Scott","content":"PERSON"},{"type":"Ivan Soto","content":"PERSON"},{"type":"Oseary","content":"PERSON"}],"hashtag":["BAYC","CRIME","LAWSUITS","YUGA LABS"],"authors":["Callan Quinn","The Block"]}