{"summary":"Jump Trading, once known as one of Chicago&#x27;s secretive trading firm, wants to be more public about its crypto operations.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/117595\/jump-trading-no-longer-wants-to-be-secretive-about-its-multi-billion-dollar-crypto-operation","publishDate":"2021-09-14T09:31:27","id":4822,"type":null,"title":"Jump Trading no longer wants to be secretive about its multi-billion dollar crypto operation","category":["CAPITAL MARKETS"],"content":["Jump Trading was once called one of Wall Street's most secretive high-speed trading firms.&nbsp;","But now, Jump is going fully public with its crypto operation and wants the community to know it is keen on being a vocal and transparent contributor to the space. The firm, which has billions of dollars put to work in the crypto market, announced Tuesday that it has launched Jump Crypto, cementing the role of its long-standing digital asset and blockchain business.&nbsp;","\"We've been in crypto for six years now in various capacities,\" said Kanav Kariya, the recently appointed president of Jump Crypto. \"That span a lot more than trading. Helping build out a lot of protocols, being involved in protocol governance, and extending into areas we have expertise in.\"","Jump's crypto operation has served as the backbone of Robinhood Crypto, providing liquidity for its cryptocurrency trading. It has also invested in the market through its affiliate venture firm, Jump Capital.","The firm is also active in the Solana ecosystem. It is a liquidity provider for FTX's decentralized exchange Serum and a founding member of Pyth, a decentralized data project built on the Solana blockchain.&nbsp;","Founded in 1999, Jump has said little about what it does publicly and its founders, two former CME Group pit traders, have effectively zero public profile.&nbsp;Such a disposition might not work in crypto in the same way that it does for quant trading in stocks.&nbsp;","\"Jump Crypto is a recognition basically of the fact that in a community-driven space, we need to have a voice and be more reachable and share what we are doing more broadly,\" said Kariya, who added:","\"It is a commitment to the way we intend to operate to position our firm itself as a meaningful contributor participant.\"","<strong data-v-f87c67ca=\"\">Protocol participation<\/strong>","In a broader sense, Jump Trading wants to be known as more than just a trading firm.","The company is looking to expand its efforts in venture capital investments, decentralized finance, and on-chain governance.&nbsp;","Jump <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2021-08-03\/quant-shop-jump-capital-buys-blockchain-engineer-firm-certus-one\" data-v-f87c67ca=\"\">announced<\/a> in August the acquisition of Certus One, a blockchain engineering firm, as part of its expansion into crypto.&nbsp;","\"We want to be someone that thinks deeply about security all the way through the stack with deep knowledge,\" Kariya told The Block. \"The Certus acquisition and team has helped us to think about that and start to deliver solutions.\"","To be sure, engaging with protocols on governance — weighing in on decisions that steer the open-source network of a given blockchain — could give Jump a leg-up when investing in the space's companies and tokens.&nbsp;","Jump Capital said on Tuesday it closed a new $350 million fund — its seventh since inception. The fund will have a significant focus on crypto and will invest in dozens of companies. It has already invested in several companies, including BitGo, which is set to be acquired by Galaxy Digital, and Curv, which PayPal acquired this year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kariya","content":"PERSON"},{"type":"$350 million","content":"MONEY"},{"type":"Robinhood Crypto","content":"ORGANIZATION"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"Jump Crypto","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"CME Group","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"1999","content":"DATE"},{"type":"Kanav Kariya","content":"PERSON"},{"type":"Jump Capital","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}