{"summary":"Spanish cryptocurrency platform Bit2Me has acquired software development studio Dekalabs, it said a release today. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179321\/crypto-platform-bit2me-snaps-up-software-studio-dekalabs","publishDate":"2022-10-24T06:25:49","id":4828,"type":null,"title":"Crypto platform Bit2Me snaps up software studio Dekalabs","category":["MERGERS & ACQUISITIONS"],"content":["&nbsp;","Bit2Me, a Spanish cryptocurrency platform, has acquired software development studio Dekalabs.&nbsp;","While Dekalabs will continue to remain autonomous after the acquisition, the purchase will allow Bit2Me to strengthen its services for private companies and public institutions, according to <a href=\"https:\/\/mcusercontent.com\/316a1aaebe96b3819d68c79a5\/files\/8ef709d4-8700-224c-3716-95f31addf4cb\/DEKALABS_ENGLISH.01.pdf\" data-v-f87c67ca=\"\">the release<\/a>. Named Bit2me Consulting, it offers consulting, development and auditing services on topics such as tokenization, the metaverse, smart contracts, NFTs and DAOs.&nbsp;","Previously, Dekalabs developed projects for companies such as Telefonica, Bayer and FC Barcelona.&nbsp;","\"We want Dekalabs to continue to operate autonomously, as it has been doing these past few years,\" said Bit2me CEO Leif Ferreira. \"With this acquisition, we want Dekalabs to take full advantage of the opportunities we see daily at Bit2Me. I think that together with Dekalabs, we can make many companies integrate into the cryptocurrency industry.\"","The company did not disclose the terms of the deal in the release nor did it respond to a request for comment by the time of publication.&nbsp;","Bit2Me is a Spanish cryptocurrency platform that offers trading, wallet, and staking services. It is recognized as a digital assets service provider by the Spanish central bank and has customers in more than 100 countries.&nbsp;","In July, it was <a href=\"https:\/\/www.coindesk.com\/business\/2022\/07\/07\/spanish-crypto-exchange-bit2me-to-double-headcount-make-three-acquisitions\/?utm_medium=referral&amp;utm_source=rss&amp;utm_campaign=headlines\" data-v-f87c67ca=\"\">reported<\/a> that the company&nbsp;signed memorandums of understanding for three acquisitions, including purchasing a 90% stake in a Latin American exchange and buyouts of a fintech company and a software developer.&nbsp;","Previously, the company partnered with telecommunications giant Telefonica to <a href=\"https:\/\/www.theblock.co\/post\/173935\/spanish-telecom-giant-telefonica-enables-crypto-payments-via-bit2me-coindesk\" data-v-f87c67ca=\"\">enable<\/a> cryptocurrency purchases on its Tu.com marketplace.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Bayer","content":"ORGANIZATION"},{"type":"Leif Ferreira","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Telefonica","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Barcelona","content":"LOCATION"}],"hashtag":[],"authors":["Tom Matsuda","The Block"]}