{"summary":"The stablecoin issuer that&#x27;s been on the front lines of the U.S. crack down on crypto is looking for help managing its reserves and is seeking a new &quot;Head of Portfolio Management.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225050\/paxos-is-hiring","publishDate":"2023-04-05T12:09:02","id":4829,"type":null,"title":"Want to manage a $20 billion stablecoin portfolio? Paxos is hiring.","category":["COMPANIES"],"content":["Paxos, the stablecoin issuer that's been on the front lines of the U.S. <a href=\"https:\/\/www.theblock.co\/post\/211889\/paxos-lands-on-the-front-lines-of-new-us-crackdown-on-crypto\" data-v-f87c67ca=\"\">crack down<\/a> on crypto, is looking for help managing its reserves and is seeking a new \"Head of Portfolio Management,\" according to a<a href=\"https:\/\/www.linkedin.com\/jobs\/view\/3452384571\/\" data-v-f87c67ca=\"\">&nbsp;job listing<\/a> on LinkedIn posted five days ago.","The person who gets hired will oversee allocation decisions on over $20 billion of portfolio reserves \"in accordance with the Paxos portfolio management mandates and legal restrictions within the NYDFS stablecoin issuance framework,\" the company said, referring to the New York state regulator that <a href=\"https:\/\/www.theblock.co\/post\/210932\/paxos-will-no-longer-issue-binance-usd-stablecoin\" data-v-f87c67ca=\"\">ordered it<\/a> to stop issuing the Binance USD stablecoin in February.&nbsp;","The person will also be charged with implementing investment strategies and processes that meet regulatory and client \"goals and constraints'; they'll also work with regulators to explain the company's products and controls.","","","Paxos is <a href=\"https:\/\/paxos.com\/careers\/role\/?gh_jid=6578706002\" data-v-f87c67ca=\"\">looking for with someone<\/a> with at least a Bachelor's degree in finance, economics, accounting, statistics, business administration, mathematics or a related field, and 15 years of trading experience; knowledge of trading short term interest rate instruments, T-bills, and overnight repos backed by treasuries would also be helpful. Over 200 people have applied for the job so far, according to LinkedIn.&nbsp;","Paxos, which dubs itself as \"a regulated blockchain infrastructure platform,\" is one of the largest players in the stablecoin space and issues the Pax Dollar (USDP), in addition to <a href=\"https:\/\/www.theblock.co\/post\/224950\/tokenized-gold-tops-1-billion-market-cap-amid-banking-crisis-concerns\" data-v-f87c67ca=\"\">Pax Gold<\/a>, a digital token backed by physical gold. While it no longer mints new Binance USD, it allows customers to redeem it for USD or convert it to USDP.","The company in February said it received a Wells Notice from the U.S. Securities and Exchange Commission about the Binance USD stablecoin, which the regulator claims is a security. Paxos <a href=\"https:\/\/www.theblock.co\/post\/211242\/paxos-categorically-disagrees-with-sec-in-calling-busd-a-security\" data-v-f87c67ca=\"\">has said<\/a> that it disagrees with the SEC and is prepared to \"vigorously litigate if necessary.\"","<a href=\"https:\/\/www.jaustincampbell.com\/\" data-v-f87c67ca=\"\">Austin Campbell<\/a>, a consultant, <a href=\"https:\/\/crypto-wanderer.medium.com\/downside-only-6555f68a8ca6\" data-v-f87c67ca=\"\">writer<\/a> and adjunct professor at Columbia Business School, held the&nbsp;<br data-v-f87c67ca=\"\">\nHead of Portfolio Management role at Paxos for ten months through December, according to his <a href=\"https:\/\/www.linkedin.com\/in\/jesseaustincampbell\/\" data-v-f87c67ca=\"\">LinkedIn profile<\/a>.&nbsp;","Neither Paxos nor Campbell immediately responded to emailed requests for comment from The Block.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Austin Campbell","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"USDP","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wells Notice","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Binance USD","content":"ORGANIZATION"},{"type":"Campbell","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"December","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"$20 billion","content":"MONEY"},{"type":"Head of Portfolio Management","content":"ORGANIZATION"},{"type":"Columbia Business School","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}