{"summary":"Bitpanda, which both cut jobs and rescinded recent job offers, told employees that in retrospect its hiring speed was &quot;not sustainable.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/154137\/investment-platform-bitpanda-lays-off-730-employees","publishDate":"2022-06-24T14:46:28","id":4835,"type":null,"title":"Bitpanda reduces headcount to 730 from around 1000","category":["COMPANIES"],"content":["<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Correction:<\/strong> This article has been corrected to say that BitPanda's headcount has been reduced to 730 people. An older version mistakenly said that the company was laying off 730 people. The Block regrets the error.<\/em>","Austrian investing platform Bitpanda it is reducing its headcount from roughly 1000 to 730 people and rescinding offers of employment made recently.","The company announced the layoffs during a call Friday, <a href=\"https:\/\/blog.bitpanda.com\/en\/way-forward\" data-v-f87c67ca=\"\">per a statement<\/a> put out on its website. The website currently says the company has \"1000+\" employees.","\"While this is a tough decision to make, it was nonetheless necessary to make sure we’re robustly well-capitalized to navigate the storm and get out of it financially healthy, no matter how long it takes for markets to recover,\" Bitpanda said.","The company also shared a message it sent to employees over Slack, in which it stated that it was growing too fast while trying to keep up with the industry.","\"We reached a point where more people joining didn’t make us more effective, but created coordination overheads instead, particularly in this new market reality. Looking back now, we realize that our hiring speed was not sustainable. That was a mistake,\" the company told employees.","Bitpanda joins a series of other firms in the crypto space that have <a href=\"https:\/\/www.theblock.co\/post\/152059\/crypto-firms-have-laid-off-more-than-1500-people-in-the-last-two-months-as-downturn-fears-persist\" data-v-f87c67ca=\"\">cut back on their staff in recent weeks<\/a> including Coindesk, BlockFi, Gemini and Crypto.com.&nbsp;","Bitpanda told employees that it would offer those who were laid off support ranging from 1:1 coaching with talent acquisition partners to mental health support and an employee assistance program.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"1000","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Bitpanda","content":"PERSON"},{"type":"Friday","content":"DATE"}],"hashtag":["LAYOFFS"],"authors":["Catarina Moura","The Block"]}