{"summary":"The launch of Solang provides a tool for developers familiar with Solidity, Ethereum&#x27;s primary smart contract programming language.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240527\/solana-labs-rolls-out-solang-compiler-to-enhance-ethereum-compatibility","publishDate":"2023-07-19T09:53:40","id":4836,"type":null,"title":"Solana Labs rolls out Solang compiler to enhance Ethereum compatibility","category":["CRYPTO ECOSYSTEMS"],"content":["Solana Labs has unveiled Solang, a new compiler designed to smooth the transition for Ethereum Virtual Machine (EVM) developers into the Solana ecosystem.","With the launch of Solang, developers familiar with Solidity, Ethereum’s primary smart contract programming language, now have a tool that enables them to delve into and write apps on the Solana network.","This unveiling comes just a day after Neon EVM’s <a href=\"https:\/\/www.theblock.co\/post\/239960\/neon-labs-releases-evm-to-bring-support-for-ethereum-apps-on-solana\" data-v-f87c67ca=\"\">release<\/a> of a similar tool, highlighting the continual efforts to enhance compatibility between Solana and existing Ethereum development approaches.","Among the features Solang offers are compatibility with Ethereum Solidity version 0.8 and integration of Solana SPL tokens with Solidity. Moreover, it grants EVM frameworks on Solana access to the network’s core features.","Traditionally, Solana development has been centered around using languages like Rust or C for scripting smart contracts. However, the team emphasized development was evolving toward greater accessibility via Solidity and EVM.","\"Solana Labs is thrilled to announce that today you can now build on Solana with Solidity using Solang, a new compiler that helps bridge the gap between EVM developers and the Solana ecosystem,\" it <a href=\"https:\/\/solana.com\/news\/solang-solana-solidity-evm\" data-v-f87c67ca=\"\">stated<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Solana Labs","content":"ORGANIZATION"},{"type":"Solana","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Ethereum Virtual Machine (EVM","content":"ORGANIZATION"},{"type":"Solana SPL","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"EVM","content":"ORGANIZATION"}],"hashtag":["ETHEREUM","SOLANA"],"authors":["Vishal Chawla","The Block"]}