{"summary":"Bessemer said in March it would commit $250 million to crypto. The firm has now set up a deal-sourcing DAO.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/174923\/venture-firm-bessemer-counts-on-a-decentralized-network-for-deal-flow","publishDate":"2022-10-05T09:00:06","id":4837,"type":null,"title":"Venture firm Bessemer counts on a decentralized network for deal flow","category":["CAPITAL MARKETS"],"content":["Venture investor Bessemer is hoping that a decentralized network of scouts will help it spot the most innovative startups opportunities in the newfangled world of DeFi and Web3 consumer applications.","Founded in the early 20th century, Bessemer has backed firms like LinkedIn, Shopify, and Bumble, and has close to $20 billion in assets under management at the last count.","On Wednesday, the firm provided an update on its DAO and new scout program, which adds a crypto twist to the traditional scouting setup — in which individual angel investors bring deals to larger, more established venture firms.&nbsp;","Bessemer, which <a href=\"https:\/\/www.theblock.co\/linked\/137398\/vc-firm-bessemer-announces-250-million-fund-for-decentralized-tech-launches-dao\" data-v-f87c67ca=\"\">committed $250 million<\/a> to crypto in March, set up a so-called decentralized autonomous organization, originally dubbed BessemerDAO, to form a community of investors and other groups to share ideas and investment opportunities. The firm said the project is gradually becoming more decentralized, and will now begin assessing prospective deals sourced by a community of scouts, who will make recommendations to commit capital to projects based on governance votes.","<strong data-v-f87c67ca=\"\">Voting for winners<\/strong>","A majority vote from a committee of DAO leaders is required for a project to be granted funding, the firm said. Bessemer will invest $500,000 to bootstrap the initiative.&nbsp;","The official vote can be viewed \"on-chain\" in addition to \"broader decisions including: GC membership decisions (e.g., adding\/removing members), launching new initiatives, incorporating new processes, etc.\"","As part of its ongoing decentralization efforts, the firm is rebranding the DAO to SteelDAO, which \"pays homage to Bessemer’s roots and embodies a new and separate brand identity as the community becomes further decentralized and evolves separate from our efforts at Bessemer Venture Partners.\"","\"The new name was selected by a committee of current DAO members and Bessemer’s community team,\" the firm added. Those DAO members hold a non-fungible token that signifies their membership.&nbsp;","Ethan Kurzweil, a partner at the firm, told The Block that the DAO shares in the profits made from investments, adding that the model represents a potential way to \"democratize access\" to such deals and leverage \"decentralized decision-making.\"","Kurzweil thinks that the majority of deals backed by the DAO will be pre-seed stage, moon-shot bets.&nbsp;\"Scouts have the inclination to go after change-the-world-ideas,\" he said.&nbsp;","Bessemer is targeting a wide-range of investment opportunities in its own right, including in consumer gaming and NFT marketplaces, decentralized finance, and smart contract and layer one infrastructure.&nbsp;","Deal proposals and voting on such deals will all be made public on-chain through a partnership with Syndicate, a crypto startup that allows groups to track on-chain investments through a dashboard.&nbsp;","“Steel DAO is an important step forward in the democratization of investing and transformation of venture capital,\" said James Seely of Syndicate. \"Community-driven investing models not only increase funding and reach, but also community-led participation, engagement, and support of early stage companies and entrepreneurs.\"","Bessemer isn't new to crypto, having previously backed crypto financial services firm NYDIG. It also has backed startups like Sorare and TRM Labs.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"early 20th century","content":"DATE"},{"type":"$250 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$500,000","content":"MONEY"},{"type":"Ethan Kurzweil","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Bumble","content":"ORGANIZATION"},{"type":"$20 billion","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Bessemer Venture Partners","content":"ORGANIZATION"},{"type":"Bessemer","content":"PERSON"},{"type":"Shopify","content":"PERSON"},{"type":"Bessemer","content":"ORGANIZATION"},{"type":"James Seely","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}