{"summary":"The Eth2 Phase 0 is scheduled to launch on December 1. Polymarket bettors say it won&#x27;t launch by the date.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/85077\/eth2-phase-0-launch-polymarket-prediction","publishDate":"2020-11-18T14:38:17","id":4838,"type":null,"title":"Will Eth2&#x27;s Phase 0 launch happen on December 1? Polymarket bettors say no","category":["ETHEREUM"],"content":["The Ethereum network has been moving toward a multi-stage transition from a proof-of-work system to a proof-of-stake model with developments around the Ethereum 2.0, or Eth2, upgrade.","While the full transition will occur in several phases, Eth2's Phase 0 is scheduled to launch on December 1. Phase Zero will involve the genesis of the so-called beacon chain, which will serve as a kind of backbone for the nascent blockchain network.","But will that December 1 date pan out? Participants on crypto prediction market Polymarket <a href=\"https:\/\/polymarket.com\/market\/will-the-ethereum-20-genesis-event-happen-successfully-on-december-1st-2020\" data-v-f87c67ca=\"\">don't appear to think so.<\/a>","For Phase 0 to go live, <a href=\"https:\/\/ethereum.org\/en\/eth2\/beacon-chain\/\" data-v-f87c67ca=\"\">at least 524,288 ETH<\/a> (currently worth about $247 million) needs to be deposited in the Eth2 staking deposit contract, <a href=\"https:\/\/blog.ethereum.org\/2020\/11\/04\/eth2-quick-update-no-19\/\" data-v-f87c67ca=\"\">by November 24<\/a> (seven days prior to December 1).","So far, however, only 101,984 ETH, i.e., around 20% of the target, <a href=\"https:\/\/etherscan.io\/address\/0x00000000219ab540356cbb839cbe05303d7705fa\" data-v-f87c67ca=\"\">has been deposited<\/a>. Maybe that's the reason Polymarket bettors don't see the Eth2 Genesis block launching on December 1.","<iframe title=\"ETH in ETH2 Deposit Contract\" src=\"https:\/\/www.theblock.co\/data\/open-finance\/asset-management\/eth-in-eth2-deposit-contract\/embed\" width=\"100%\" height=\"420\" frameborder=\"0\" data-v-f87c67ca=\"\"><\/iframe>","Specifically, Polymarket bettors are giving the odds of Phase 0 not launching on December 1 at 61% at the time of writing and launching at 39%. Interestingly, the odds were the opposite just about two weeks ago.","","","On November 6, Polymarket bettors were giving the odds of the genesis launch date at 75% and not launching at 25%. What changed? The staking deadline is getting closer, and deposits probably aren't growing at expected levels.","ETH holders could very push the staked amount upward at the last moment, as they currently have little incentive to lock up their ETH now.&nbsp;","Deposits in the Eth2 staking contract can only be withdrawn when Ethereum fully transitions to a proof-of-stake system, or once the Ethereum mainnet becomes a shard — a development expected to occur sometime in 2021.","It is possible that some large ETH holders support the Eth2 launch when the deadline nears. Ethereum creator Vitalik Buterin, for instance, has thus far contributed 3,200 ETH, an amount currently worth about $1.5 million.","Besides Polymarket bettors, some other Ethereum community members appear to remain skeptical of the Eth Phase 0 launch date. Eric Conner, for instance, has <a href=\"https:\/\/twitter.com\/econoar\/status\/1328737619925110784?s=20\" data-v-f87c67ca=\"\">suggested<\/a>&nbsp;a two-step approach. In his view, the genesis launch date should be extended to December 15 and the minimum contract deposit level of 524,288 ETH should be removed.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1.5 million","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"November 6","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"November 24","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"75%","content":"PERCENT"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"61%","content":"PERCENT"},{"type":"39%","content":"PERCENT"},{"type":"December 1","content":"DATE"},{"type":"25%","content":"PERCENT"},{"type":"$247 million","content":"MONEY"},{"type":"Eric Conner","content":"PERSON"},{"type":"December 15","content":"DATE"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}