{"summary":"Circle is deepening its European compliance by obtaining DASP registration and onboarding a regulatory veteran to head French operations. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/268853\/circle-obtains-conditional-registration-in-france-appoints-head-of-operations-in-country","publishDate":"2023-12-21T10:32:59","id":4843,"type":null,"title":"Circle obtains conditional registration in France, appoints head of operations in country","category":["COMPANIES"],"content":["Stablecoin issuer Circle has obtained digital asset regulatory licensure in France and appointed a new Head of French Operations.&nbsp;","Circle obtained conditional registration as a Digital Asset Service Provider (DASP) from the French Financial Markets Authority, the company said in a <a href=\"https:\/\/www.circle.com\/en\/pressroom\/circle-secures-conditional-dasp-registration-and-appoints-head-of-french-operations\" data-v-f87c67ca=\"\">statement<\/a>.&nbsp;Stepping into the Head of French Operations role is Coralie Billmann, who currently serves as the Chief Operating Officer of Europe and board member for the global business account and payment firm 3S Money.&nbsp;","The move deepens Circle's compliance to European standards, especially in regard to <a href=\"https:\/\/www.esma.europa.eu\/esmas-activities\/digital-finance-and-innovation\/markets-crypto-assets-regulation-mica\" data-v-f87c67ca=\"\">Markets in Crypto-Assets<\/a> (<a href=\"https:\/\/www.theblock.co\/post\/230151\/hester-peirce-sec-crypto-regulation-mica-model\" data-v-f87c67ca=\"\">MiCA<\/a>) regulation, a legal framework for crypto asset firms interacting with markets within the European Union. Billmann will help ensure Circle's MiCA readiness in addition to heading licensed operations in France.","\"The issuance of this conditional DASP registration in France marks a significant early milestone as we work towards establishing our European regulatory platform,\" Circle co-founder and CEO Jeremy Allaire said in a statement. \"With Coralie Billmann joining Circle, her deep market expertise and leadership will be instrumental in furthering our regulatory efforts and deepening our connections in France.\"","Before 3S Money, Billman previously worked at JP Morgan leading Payment High Growth Tech Sales and the EMEA Treasurer for PayPal Luxembourg, according to Billmann's LinkedIn profile. Her appointment to her new role at <a href=\"https:\/\/www.theblock.co\/post\/262414\/circle-v2-2-usdc-eurc-stablecoins-improvements-account-abstraction-security-lower-gas-fees\" data-v-f87c67ca=\"\">Circle<\/a> requires regulatory approval.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jeremy Allaire","content":"PERSON"},{"type":"European Union","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"France","content":"LOCATION"},{"type":"Digital Asset Service","content":"ORGANIZATION"},{"type":"EMEA","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Head of French Operations","content":"ORGANIZATION"},{"type":"French Financial Markets Authority","content":"ORGANIZATION"},{"type":"Billmann","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"PayPal Luxembourg","content":"ORGANIZATION"},{"type":"Circle","content":"ORGANIZATION"},{"type":"Billman","content":"PERSON"},{"type":"JP Morgan","content":"ORGANIZATION"},{"type":"Coralie Billmann","content":"PERSON"},{"type":"Crypto","content":"LOCATION"}],"hashtag":["HIRING"],"authors":["MK Manoylov","The Block"]}