{"summary":"The amount of ether burned on a daily basis has set new records for two days in a row with over 30,000 ETH burned since Wednesday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/122505\/burnt-ether-eip-1559-record-two-days","publishDate":"2021-10-29T05:21:43","id":4844,"type":null,"title":"The amount of ETH burned daily sets new records two days running","category":["ETHEREUM"],"content":["The amount of ether burned on a daily basis has set new records for two days in a row with over 30,000 ETH burned since Wednesday, data shows.","The Block's Data Dashboard shows that about 14,820 ETH were burned on October 27 as a result of the EIP-1559 proposal that went effective in early August.&nbsp;","That set a new record at the time only to be surpassed the next day with over 16,800 ETH burned on Thursday. That added the total amount of burned ether to over 668,000 ETH as of press time, which would have been worth around $3 billion.","The upgrade changed Ethereum's monetary policy by burning part of the transaction fees in every new block in an effort to make the whole fee system more reliable and easier to predict. (<a href=\"https:\/\/www.theblockcrypto.com\/news+\/114474\/how-do-ethereum-transaction-fees-work-now-that-eip-1559-is-live\" data-v-f87c67ca=\"\">Here's a primer<\/a> on how Ethereum fees now work.)","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/burned-eth-after-eip-1559-daily\/embed\" title=\"Burned ETH after EIP-1559 (Daily)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","As a result, the daily net emission of ether has gone negative for two days in a row again. The <a href=\"https:\/\/www.theblockcrypto.com\/linked\/116659\/ethereum-negative-daily-emission-eip-1559\" data-v-f87c67ca=\"\">first time<\/a> ether's daily net emission trended negative since the activation of the EIP-1559 was on September 4 at -333 ETH.","But the negative emission has now extended to -1,500 and -3,440 ETH on Wednesday and Thursday, respectively. The Block's chart shows the Ethereum's daily net issuance has been on a disinflationary trend overall since the activation of EIP-1559.","Meanwhile, ether's price has soared to a new all-time high just above $4,400 on Thursday night Eastern Time, pushing its total market capitalization to cross the half a trillion dollar mark at $516 billion.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/net-eth-emission-after-eip-1559\/embed\" title=\"Net ETH Emission after EIP-1559\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"October 27","content":"DATE"},{"type":"$3 billion","content":"MONEY"},{"type":"Block's Data Dashboard","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"September 4","content":"DATE"},{"type":"Eastern Time","content":"ORGANIZATION"},{"type":"night","content":"TIME"},{"type":"1559","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"$516 billion","content":"MONEY"},{"type":"$4,400","content":"MONEY"},{"type":"August","content":"DATE"}],"hashtag":["ETHEREUM"],"authors":["Wolfie Zhao","The Block"]}