{"summary":"The move comes after Binance announced it will fully exit from Russia following scrutiny of whether it helped Russia evade legal sanctions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/260475\/binance-to-end-ruble-payment-partnership-with-financial-services-firm-advcash-wsj","publishDate":"2023-11-01T12:47:23","id":4853,"type":null,"title":"Binance to end ruble payment partnership with financial services firm Advcash: WSJ","category":["COMPANIES"],"content":["Binance intends to end a partnership with a Belize-based payments firm called Advanced Cash, or Advcash, that was used to move funds between sanctioned Russian banks and the exchange, the Wall Street Journal <a href=\"https:\/\/www.wsj.com\/livecoverage\/fed-meeting-interest-rate-decision-fomc-november-2023\/card\/binance-to-shut-down-ruble-payment-partnership-jKH5mKQwN6qmLb24iEWx?mod=Searchresults_pos1&amp;page=1\" data-v-f87c67ca=\"\">reported<\/a>, citing people familiar with the matter.&nbsp;","An Advcash spokesperson told The Block that the firm had not yet received any information from Binance about the plan.","\"We unequivocally deny that Advcash facilitated movement of any funds between any sanctioned banks and Binance. Advcash stopped processing credit card deposits in RUB from its customers in March 2022,\" the spokesperson added.","\"As a regulated payment platform, Advcash is committed to complying with all applicable legislation,\" they continued. \"This includes screening of all users using all possible sanctioned persons lists, and employing full KYC and AML procedures via reputable KYC providers.\"","Binance first <a href=\"https:\/\/www.theblock.co\/linked\/45298\/binance-adds-support-for-russian-rubles-for-direct-fiat-to-crypto-trading\" data-v-f87c67ca=\"\">partnered<\/a> with Advcash in 2019 to enable Russian ruble movements, The Block previously reported. At the time, users could deposit and withdraw rubles for its fiat-to-crypto trading platform.&nbsp;","The move comes after Binance announced it intends to fully exit from Russia following legal scrutiny about whether the firm helped Russia <a href=\"https:\/\/www.theblock.co\/post\/229711\/doj-binance-russia-sanctions\" data-v-f87c67ca=\"\">evade<\/a> sanctions. In September, Binance <a href=\"https:\/\/www.theblock.co\/post\/253146\/binance-fully-exits-russia-amid-legal-risks-sells-business-to-commex\" data-v-f87c67ca=\"\">sold<\/a> its business to crypto exchange CommEx, though the off-boarding process may take up to a year.&nbsp;","Binance did not immediately respond to a request for comment from The Block.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Binance","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Russia","content":"LOCATION"},{"type":"Belize","content":"LOCATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"March 2022","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BINANCE","PAYMENTS"],"authors":["MK Manoylov","The Block"]}