{"summary":"As its first year in business draws to a close, the billion-dollar Venom Ventures Fund appears to have precious little to show.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267559\/abu-dhabi-crypto-fund-deafening-silence-venom-ventures","publishDate":"2023-12-15T03:08:35","id":4856,"type":null,"title":"Deafening silence surrounds billion-dollar Abu Dhabi crypto fund Venom Ventures","category":["VENTURE CAPITAL"],"content":["At the start of this year — and in the depths of a prolonged bear market — the crypto faithful’s spirits got a boost in the form of news that Abu Dhabi-based <a href=\"https:\/\/www.theblock.co\/post\/203653\/new-billion-dollar-abu-dhabi-fund-will-look-far-and-wide-for-web3-deals\" data-v-f87c67ca=\"\">Venom Ventures Fund was ready to plough $1 billion into web3<\/a>.","The fund was the brainchild of Venom Foundation, a little-known Layer 1 blockchain licensed by the Abu Dhabi Global Market, and Iceberg Capital, a locally regulated investment management firm. Peter Knez, formerly co-chief investment officer of BlackRock’s fixed income division, made up one half of a two-person leadership team at the fund alongside Mustafa Kheriba, Iceberg’s executive chairman. Together, they planned to invest across the venture spectrum, from seed to late-stage, and even dishing out grants of $25,000-200,000.","However, as its first year in business draws to a close, Venom Ventures appears to have precious little to show.","At the time of its announcement, the fund said it had <a href=\"https:\/\/www.wamda.com\/2023\/01\/uae-metaverse-startup-n%C3%BCmi-raises-20-million-venom-ventures-fund\" data-v-f87c67ca=\"\">led a $20 million investment in Nümi Metaverse<\/a>. Later in January, <a href=\"https:\/\/www.theblock.co\/post\/207062\/venom-ventures-fund-makes-5-million-strategic-investment-in-everscale-blockchain\" data-v-f87c67ca=\"\">it announced a $5 million strategic investment<\/a> in Layer 1 blockchain Everscale, with the capital set to be made available in stages based on progress. No deals have been announced since.&nbsp;","There is no information on Venom Ventures’ portfolio on its website, although there is a “coming soon” notice where such details might ordinarily sit. The Block Research’s deals database has no record of Venom Ventures investing in any startups since January. The Venom blockchain with which the venture fund is affiliated has not yet launched its mainnet, according <a href=\"https:\/\/twitter.com\/louis_tsu\/status\/1733963680046256319\" data-v-f87c67ca=\"\">to a recent post on X<\/a> by Christopher Louis Tsu, CEO of the Venom Foundation.","Meanwhile, Knez has taken on fresh responsibilities. He was recently named chair of a new conservation-focused fund named O.N.E Amazon, <a href=\"http:\/\/www.tradearabia.com\/news\/BANK_416405.html\" data-v-f87c67ca=\"\">which was unveiled at a summit in Dubai on December 3<\/a>.","Kheriba, Venom Ventures and Venom Foundation did not respond to multiple requests for comment about the venture fund's progress.&nbsp;","The love affair between venture capitalists and crypto startups has been on the rocks for over a year. Venture funding flowing to web3 is expected to come in at around $2.7 billion for Q4 this year, down from the dizzying heights of $13.5 billion Q1 2022, <a href=\"https:\/\/www.theblock.pro\/research\/november-blockchain-funding-recap-3-266771\" data-v-f87c67ca=\"\">according to The Block Research’s data<\/a>. Depressed tokens prices and successive disasters —&nbsp;including but not limited to the spectacular collapses of dozens of organizations, from Terra to FTX — have left VCs bruised. Sequoia Capital, the legendary Silicon Valley venture capital firm, <a href=\"https:\/\/www.businessinsider.com\/sequoia-loss-on-ftx-collapse-letter-to-investors-2022-11\" data-v-f87c67ca=\"\">marked a more than $200 million investment in FTX down to zero<\/a>.","In such dire times, crypto startups needing capital have increasingly looked to the Middle East. Last year, <a href=\"https:\/\/www.theblock.co\/post\/158413\/dubais-metaverse-strategy-plans-to-add-4-billion-to-economy-by-2027\" data-v-f87c67ca=\"\">Dubai announced a “metaverse strategy”<\/a> designed to add $4 billion to its economy by 2027. Former Binance CEO Changpeng Zhao <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-11-22\/binance-ceo-zhao-seeks-middle-east-cash-for-crypto-recovery-fund\" data-v-f87c67ca=\"\">reportedly went to Abu Dhabi<\/a> in November 2022 in search of investment for a billion-dollar industry recovery fund. More recently, Saudi Arabia’s NEOM Investment Fund <a href=\"https:\/\/www.animocabrands.com\/animoca-brands-and-neom-announce-strategic-partnership-and-investment\" data-v-f87c67ca=\"\">announced a proposal to invest $50 million in Animoca Brands<\/a>, the web3 investment firm.","There is a sense among some crypto veterans that the hype around web3-friendly capital in the Middle East is nothing but a mirage.","Kenzi Wang, co-founder and general partner at Symbolic Capital, said a lot of venture capitalists that seek to raise capital in the Middle East “think the money is a lot easier here than it actually is.”","“Tourist fund managers and startup founders that come here have the misguided notion that Middle East investors are just going to throw money into any crypto investment they see. That couldn’t be farther from the truth,” he said. “The investors and LPs in this region are extremely sophisticated. They’ve seen plenty of naive investors come to this part of the world thinking they’ll be able to waive their hands and get money to fall from the sky. LPs in this region aren’t going to fall for that.”","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Saudi Arabia","content":"LOCATION"},{"type":"Amazon","content":"LOCATION"},{"type":"$4 billion","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Christopher Louis Tsu","content":"PERSON"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Block Research","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Dubai","content":"LOCATION"},{"type":"Venom Ventures","content":"ORGANIZATION"},{"type":"Terra","content":"LOCATION"},{"type":"Iceberg Capital","content":"ORGANIZATION"},{"type":"$25,000","content":"MONEY"},{"type":"Nümi Metaverse","content":"LOCATION"},{"type":"$200 million","content":"MONEY"},{"type":"Knez","content":"ORGANIZATION"},{"type":"November 2022","content":"DATE"},{"type":"$5 million","content":"MONEY"},{"type":"Silicon Valley","content":"ORGANIZATION"},{"type":"Middle East","content":"LOCATION"},{"type":"2027","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Peter Knez","content":"PERSON"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Symbolic Capital","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Venom Foundation","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$2.7 billion","content":"MONEY"},{"type":"Abu Dhabi","content":"PERSON"},{"type":"Abu Dhabi Global Market","content":"ORGANIZATION"},{"type":"December 3","content":"DATE"},{"type":"$20 million","content":"MONEY"},{"type":"$13.5 billion","content":"MONEY"},{"type":"Mustafa Kheriba","content":"PERSON"},{"type":"Kenzi Wang","content":"PERSON"},{"type":"$50 million","content":"MONEY"}],"hashtag":["NEW VC FUNDS"],"authors":["Ryan Weeks","The Block"]}