{"summary":"A recent on-chain analysis by Nansen into the behavior of early Base whales unveiled investment interests in Unibot, Rollbit and memecoins.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244264\/early-base-whales-were-crypto-degens-invested-in-unibot-rollbit-and-memecoins-nansen","publishDate":"2023-08-10T14:56:13","id":4880,"type":null,"title":"Early Base whales were &#x27;crypto degens&#x27; invested in memecoins: Nansen","category":["CRYPTO ECOSYSTEMS"],"content":["A recent on-chain <a href=\"https:\/\/research.nansen.ai\/articles\/what-are-early-base-whales-doing-on-chain\" data-v-f87c67ca=\"\">analysis<\/a> by Nansen into the behavior of early Base whales — prominent crypto investors who engaged heavily with Coinbase’s Layer 2 network Base prior to its public launch yesterday — unveiled investment interests in Unibot, Rollbit and memecoins.","Nansen conducted an in-depth analysis of specific wallets among larger Base users to arrive at the finding. Of the top wallets reviewed, a large number were heavy users of blue chip DeFi apps and DEX aggregators; among major asset holdings as of Aug. 7, they also had exposure to the Telegram bot project Unibot, memecoins like Pepe and Toshi, and the on-chain gaming application Rollbit.","“Out of the top entities interacted with, most of them are very commonly used DEXs, aggregators, or blue-chip protocols. Interestingly, Unibot is also in the top 10 by the unique number of wallets, suggesting a strong product-market fit for traders,” Nansen analysts said in a <a href=\"https:\/\/research.nansen.ai\/articles\/what-are-early-base-whales-doing-on-chain\" data-v-f87c67ca=\"\">research report<\/a> shared with The Block.","These early Base whales were identified as primarily crypto-native individuals who contributed by depositing at least 100 ETH ($185,000) to Base via a bridge contract. Users had bridged a total of <a href=\"https:\/\/www.theblock.co\/post\/243379\/bridged-assets-to-coinbases-layer-2-top-100-million\" data-v-f87c67ca=\"\">$100 million<\/a> in total value even before Base’s launch.","Nansen analysts classified the users as crypto-savvy but having “degen” tendencies, given the on-chain behavior of shuffling across assets within a short span of time. The term is frequently used to describe risky and speculative behavior, often without much due diligence.&nbsp;","“Early Base bridgers are an interesting segment given they were early to another chain and likely crypto-native. These wallets had to interact with the bridge smart contract itself since there was no frontend for bridging before August 3. Given this, we can likely assume a lot of the early Base depositors are crypto-native degens,” the Nansen analysts <a href=\"https:\/\/research.nansen.ai\/articles\/what-are-early-base-whales-doing-on-chain\" data-v-f87c67ca=\"\">said<\/a>.","A large number of the wallets tracked also owned <a href=\"https:\/\/www.theblock.co\/post\/242225\/bald-memecoin-developer-liquidity-pull\" data-v-f87c67ca=\"\">Bald memecoin<\/a> as of August 7, Nansen noted, although this token dropped to zero after its developer drained liquidity from its pool.","Base’s developer-only mainnet went <a href=\"https:\/\/www.theblock.co\/post\/239393\/coinbase-base-mainnet-developers?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">live<\/a> on July 13 and was primarily accessible to developers. However, in the lead-up to the official launch, several users bridged assets to the network using a <a href=\"https:\/\/docs.base.org\/tools\/bridges\/#portal-proxy-contract\" data-v-f87c67ca=\"\">portal proxy contract<\/a> and other unofficial bridges to trade new memecoins launching on Base.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"August 7","content":"DATE"},{"type":"$185,000","content":"MONEY"},{"type":"Unibot","content":"LOCATION"},{"type":"August 3","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Unibot","content":"ORGANIZATION"},{"type":"July 13","content":"DATE"},{"type":"Pepe and Toshi","content":"PERSON"},{"type":"Nansen","content":"PERSON"},{"type":"Aug. 7","content":"DATE"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Early Base bridgers","content":"ORGANIZATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}