{"summary":"Ronin has replaced the compromised validator nodes run by the game’s creator Sky Mavis and its core contributor.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/140165\/ronin-replaces-compromised-validators-and-plans-to-bolster-security-after-600-million-hack","publishDate":"2022-04-01T08:58:20","id":4881,"type":null,"title":"Ronin replaces compromised validators and plans to ‘bolster’ security","category":["SECURITY"],"content":["<span data-v-f87c67ca=\"\">Ronin, an Ethereum sidechain that hosts Axie Infinity's play-to-earn game, said it has replaced the compromised validator nodes run by the game’s creator Sky Mavis and its core contributor.<\/span>","<span data-v-f87c67ca=\"\">Ronin’s development team also revealed plans to add new security validators in the coming weeks, meaning the number of parties verifying transactions on the sidechain will increase.<\/span>","<span data-v-f87c67ca=\"\">“Today we replaced all of the former Sky Mavis validators,” the development team said in a community<\/span><a href=\"https:\/\/roninblockchain.substack.com\/p\/community-alert-ronin-validators?s=r\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> alert<\/span><\/a><span data-v-f87c67ca=\"\"> on Thursday, adding, <\/span><span data-v-f87c67ca=\"\">\"This [adding new validators] will be a key step in bolstering the security of the network.\"<\/span>","<span data-v-f87c67ca=\"\"><iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/exploits\/largest-defi-exploits\/embed\" title=\"Largest DeFi exploits\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe update comes after a massive exploit was disclosed on Ronin on Tuesday. The sidechain reported an unknown entity stole more than 173,600 ether and 25.5 million USDC stablecoin a week prior. The exploit totaled to a staggering sum of almost $600 million — making it one of the largest crypto hacks ever — according to <a href=\"https:\/\/www.theblockcrypto.com\/data\/decentralized-finance\/exploits\" data-v-f87c67ca=\"\">data<\/a> aggregated by The Block.&nbsp;<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">A post-mortem report revealed a hacker was able to gain malicious control over five of the nine Ronin’s validators, enough to drain funds locked on the sidechain’s bridge with Ethereum.&nbsp;<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">The Ronin sidechain relies on validator nodes that play a critical role in its security.&nbsp;<\/span><span data-v-f87c67ca=\"\">It verifies transactions using a majority consensus or agreement of validators. Hence, adding more validators will help to boost its security.<\/span>","<span data-v-f87c67ca=\"\">In an earlier community-alert, Ronin did admit having a ‘small validator set,’ which it may be planning to expand. However, the complete details regarding the validator update have yet to be released.<\/span>","<span data-v-f87c67ca=\"\">As to the ongoing investigation of the $600 million hack, the Ronin team said it had ‘various calls’ with key stakeholders, including law enforcement agencies and exchanges, adding that it “cannot share more substantial information” for the time being.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mavis validators","content":"PERSON"},{"type":"Ronin","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Ronin","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Ronin","content":"ORGANIZATION"},{"type":"$600 million","content":"MONEY"},{"type":"Mavis","content":"PERSON"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}