{"summary":"Visa has filed a patent application for a &quot;digital fiat currency&quot; that points to a use case for central banks.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/65314\/visa-is-seeking-a-patent-for-digital-fiat-currency-and-the-filing-points-to-a-central-bank-use-case","publishDate":"2020-05-14T17:48:55","id":4883,"type":null,"title":"Visa is seeking a patent for &#x27;digital fiat currency&#x27; – and the filing points to a central bank use case","category":["TECHNOLOGY"],"content":["<span data-v-f87c67ca=\"\">Visa has filed a patent application for a \"digital fiat currency\" that points to a use case for central banks.<\/span>","<span data-v-f87c67ca=\"\">On Thursday, the U.S. Patent and Trademark Office (USPTO) published Visa's<\/span> <a href=\"http:\/\/appft1.uspto.gov\/netacgi\/nph-Parser?Sect1=PTO1&amp;Sect2=HITOFF&amp;d=PG01&amp;p=1&amp;u=\/netahtml\/PTO\/srchnum.html&amp;r=1&amp;f=G&amp;l=50&amp;s1=20200151682.PGNR.\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">patent filing<\/span><\/a>,&nbsp;<span data-v-f87c67ca=\"\">which was initially submitted in Nov. 2019. <a href=\"https:\/\/www.forbes.com\/sites\/jasonbrett\/2020\/05\/14\/visa-submits-patent-application-for-digital-dollar-using-blockchain\/?utm_source=TWITTER&amp;utm_medium=social&amp;utm_content=3343342103&amp;utm_campaign=sprinklrForbesCrypto#d53268a5b637\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Forbes<\/a> first covered the application's release.<\/span>","The proposed invention is pitched as a way to bridge the advantages offered by cryptocurrencies with those provided by traditional, government-issued ones. As the application explains:","\"Cryptocurrency systems have advantages over fiat currency systems. For example, cryptocurrency money transfers can also be faster than conventional fiat currency money transfers. Lastly, because some cryptocurrencies use blockchains, such cryptocurrencies are often trusted since blockchains are immutable records of transactions. While cryptocurrencies have advantages, they are generally not subject to regulation like fiat currencies. Further, it is not practical for governments to wholly convert their fiat currency systems entirely to cryptocurrencies, since cryptocurrencies require the use of electronic devices. Some segment of the population of a country may not have electronic devices so a complete conversion of fiat currencies to cryptocurrencies is not practical.\"","\"Embodiments of the invention address this and other problems, both individually and collectively,\" the filing adds.","Yet in what is perhaps the biggest departure from the cryptocurrency framework, the digital fiat currency employs a \"central entity\" intended \"to maintain control over the monetary system.\" The filing explains that such an entity could be a governmental issuer of currency or central bank.","\"A 'central entity' may refer to an entity that regulates something. A central entity may be a central bank, which regulates a monetary supply. A central entity may implement a monetary policy and issue currency. A central entity may maintain exclusive rights to create or destroy currency in a region such as a nation. A central entity may be associated with a government of such a region,\" the filing explains.&nbsp;","The application also includes eleven mentions of Ethereum. Indeed, it indicates that Ethereum could form part of an implementation of the invention. Hyperledger Fabric is almost mentioned as another blockchain platform for possible use in such a system.","<span data-v-f87c67ca=\"\">A Visa spokesperson told Forbes that \"not all patents will result in new products or features.\" But J. Christopher Giancarlo, Former Chairman of the U.S. Commodity Futures Trading Commission (CFTC), argued that the patent application itself is proof that private enterprises are willing to work with the government to reinvent how money works.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"This confirms when the U.S. does big things like the space program and the Internet, there are partnerships between the private and public sector,\" Giancarlo was quoted as saying. \"This patent filing is evidence the private sector is very much at work on the future of money.\"<\/span>","Earlier today, Visa CEO Alfred Kelly said he views digital currencies backed by a fiat currency as a potential emerging payments technology at the J.P Morgan TMC Virtual Conference.","\"[Digital currency backed by fiat] I think, are real – a potential emerging payments technology that could be very interesting. And as it relates to those, we support the case for digital currencies. We actually think that digital currencies could be additive to the payments ecosystem as opposed to being any kind of replacement or negative,\" said Kelly.","&nbsp;","<em data-v-f87c67ca=\"\">This piece was updated to include Visa CEO Alfred Kelly's remarks at the JP Morgan conference.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kelly","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"U.S. Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"Forbes","content":"ORGANIZATION"},{"type":"Giancarlo","content":"PERSON"},{"type":"Nov. 2019","content":"DATE"},{"type":"J. Christopher Giancarlo","content":"PERSON"},{"type":"U.S. Patent and Trademark Office (USPTO","content":"ORGANIZATION"},{"type":"JP Morgan","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"J.P Morgan TMC Virtual Conference","content":"ORGANIZATION"},{"type":"Alfred Kelly","content":"PERSON"}],"hashtag":[],"authors":["Yilun Cheng","The Block"]}