{"summary":"Disclaimer: This post is provided for educational purposes only. It is not legal advice.  It is my opinion only and isn&#x27;t authorized by any past, present,","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/3042\/winklevoss-lawsuit-against-charlie-shrem-peeled-out-in-top-gear-but-now-may-be-stuck-in-neutral","publishDate":"2018-11-09T17:11:25","id":4885,"type":null,"title":"Winklevoss lawsuit against Charlie Shrem peeled out in top gear, but now may be stuck in neutral","category":["BITCOIN"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: This post is provided for educational purposes only. It is not legal advice. &nbsp;It is my opinion only and isn't authorized by any past, present, or future client or employer. Also I might change my mind. I contain multitudes.<\/em>","The <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/the-winklevoss-twins-are-suing-early-bitcoin-adopter-charlie-shrem\/\" data-v-f87c67ca=\"\">Winklevoss lawsuit against Charlie Shrem<\/a> provides some gossipy insights about early bitcoin adopters set against a backdrop of dry Dickensian procedural minutiae and sharp elbows. It’s also a lesson in tactics -- if your first salvo in litigation is to shoot your heavy artillery, you better think ahead to what will happen if you miss your target.","A little bit of background, taken from the lawsuit. The plaintiff here is Winklevoss Capital Fund, LLC, not the Winklevoss brothers personally. At issue is $61,000 -- no, I am not missing a zero -- which Winklevoss (again, the firm not the twins) says should have been used to buy bitcoin on its behalf. But -- and here's the heart of the claim -- Shrem allegedly used it to <em data-v-f87c67ca=\"\">buy bitcoin for himself<\/em>. The lawsuit was filed secretly on September 11, 2018, but only unsealed on October 26, 2018 (more on that below).","Plaintiff alleges that in 2012\/2013, it gave Charlie Shrem $750,000 to buy bitcoin. They say of that total amount he took $61,000 for himself and used that to buy 5,000 bitcoin, which he kept. Using blockchain records, plaintiffs pointed to a transaction on the Bitcoin blockchain on December 31, 2012. They say it shows that particular amount of bitcoin being transferred to an address they allege was controlled by Shrem. (As you will see below, Shrem disputes this).&nbsp;","Winklevoss sued Shrem for breach of fiduciary duty, fraud, a constructive trust, and an accounting. (I am speculating a little bit, but it’s possible that a six-year statute of limitations may have been in mind when the plaintiff filed this lawsuit in September 2018. If they waited longer, they might have been time-barred).","The lawsuit gives a chatty narrative explanation of how the Winklevii met Shrem and what their relationship involved. They say they were “intrigued by the potential of a peer-to-peer money protocol, the underlying blockchain technology, and this new 'Internet of Money.'” In order to “court an investment” in his business BitInstant, Winklevoss Capital alleges that Shrem promised to buy $750,000 in bitcoin for it “at the best price” and for no commission or transaction fee. The firm received 39,876.34 bitcoin “at an average cost basis of $18.81 per bitcoin.” According to the firm, it stopped working with Shrem when it became suspicious of his accounting for the purchases but continued to buy bitcoin on the open market.","The fund says that it asked and asked for a proper accounting information from Shrem but failed to get it. Winklevoss Capital hired an accounting firm to do an audit, which it alleges shows a “shortfall of approximately 5,000 bitcoin, based on an average weighted closing price” of $12.25 per bitcoin. The firm then hired a second accounting firm, Elliptic, which the Complaint describes as “a blockchain forensic accounting firm.” Per the Complaint, Winklevoss Capital found an address linked to Shrem they say received 5,000 bitcoin, which the Plaintiff also alleges is consistent with their allegation that Shrem stole $61,000 to buy 5,000 bitcoin for himself. According to Elliptic, 4,000 bitcoin were sent to Coinbase and Xapo, with the remainder sent to other addresses.","The lawsuit states -- rather baldly in my opinion -- that Shrem became “a fiduciary” of Plaintiff when he agreed to buy bitcoin for them and that as a consequence he had a duty of “utmost good faith and undivided loyalty.” This may be a stretch, and I’ll be surprised if Shrem doesn’t move to dismiss this claim. Fiduciary relationships have more to them than an agreement to purchase an asset for someone else. More likely this was a contractual relationship and, frankly, it’s a surprise that the firm didn’t allege breach of contract.&nbsp;","Winklevoss Capital also alleges that Shrem defrauded the Plaintiff when he agreed “to purchase bitcoin for WCF at the nest price and to provide an accounting for such purposes.” Fraud requires that you plead each of the elements of the claim “with particularity” and that you’re able to prove each by “clear and convincing evidence.” There is also a claim for an equitable constructive trust, which is a remedy that basically allows a Court to take an asset from one party and turn it over to another. Finally, Count IV asks for an accounting, basically court-ordered disclosure of all records that will reveal what happened to the approximately $61,000 that Shrem cannot account for. In short, the suit alleges a lot and asks a great deal as well.","Lawsuits are typically a somewhat leisurely matter: You file a lawsuit. You serve the lawsuit. The other side answers or moves to dismiss. You exchange documents, answer interrogatories (written questions), take and defend depositions, motions are filed. In the end, maybe you end up going to trial. Even on the rocket docket in the Eastern District of Virginia – one of the fastest courts in the Country – it’s still <em data-v-f87c67ca=\"\">at least six months<\/em> from filing to trial -- often longer. It is more typical for things to take years before there’s any meaningful litigation of the merits of a case -- the determination of who’s right and who’s wrong.","This lawsuit didn’t walk the leisurely path. Plaintiff filed suit in secret and went to the Court on an “<em data-v-f87c67ca=\"\">ex parte<\/em>” basis, without notice to Shrem. It asked for an Order allowing it to “<em data-v-f87c67ca=\"\"><a href=\"https:\/\/en.wikipedia.org\/wiki\/Attachment_(law)\" data-v-f87c67ca=\"\">attach<\/a><\/em>” Shrem’s assets before a judgment was ever entered. It asked for this on the basis of sworn declarations submitted to the Court, including forensic accounting evidence. On this basis, the Court allowed Plaintiff to send “garnishment interrogatories” -- basically, written questions that have to be signed under oath -- to a wide variety of financial institutions, both crypto and not, requiring them to disclose assets held by them in Shrem’s name. <em data-v-f87c67ca=\"\">This was done before Shrem even knew that a lawsuit had been filed against him<\/em>.","This rarely happens in civil litigation, unless you are the SEC -- and the Court had to be persuaded that the Plaintiff had a very high likelihood of success on the merits and that if he became aware of the discovery would take steps to move or hide funds.","As a next step, once Shrem received notice of the lawsuit, the Plaintiff moved to “confirm” the Court’s attachment order. Shrem responded by arguing that “WCF’s case collapses on itself because those 5,000 bitcoins were <strong data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">not <\/em><\/strong>owned by Shrem. The scandalous and fantastical story WCF is advancing is nonsense.” Instead, he says that the bitcoin at issue “belonged to a prominent bitcoin industry member, who, to protect his privacy and for his security [would be referred to as] 'Mr. X.' ”","Much of the brief addresses this in detail, and points to the existence of “contemporaneous emails proving that Shrem” didn’t own the bitcoin in question as being a fatal flaw in the entire lawsuit. Winklevoss also argued that attachment was proper because Shrem owes the government $950,000 that he hasn’t paid in full yet. Shrem also refutes this argument: “The true facts are that Shrem paid a portion of the money owed before he knew of WCF’s complaint, and is in the process of paying the rest. Shrem is not evading his obligations.”","So … after this stealth lawsuit and secret asset discovery that turned up next to nothing, what happened next is a little bit surprising. It seems that Judge Rakoff read Shrem’s briefing and decided not to confirm the original attachment order and to vacate the order in its entirety.","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Read more<\/strong>: <a href=\"https:\/\/drive.google.com\/file\/d\/1HiOfGWTe3jxKvt8zl3gU5xSbTq3pfXFe\/view?usp=sharing\" data-v-f87c67ca=\"\">The&nbsp;declaration Charlie Shrem filed<\/a> that helped defeat the Winklevoss Capital attachment order. <\/em>","What does this mean exactly? It doesn’t mean that the lawsuit is over. It does mean that Shrem’s assets are no longer subject to being frozen or seized before the lawsuit has even been answered. We have to speculate a little bit to know what is in the mind of a federal judge but it’s also possible that he will view the Plaintiff’s case with a bit more of a jaundiced eye now. He ordered extraordinary pre-judgment relief, in private, without notice to the defendant. He then learned that the facts presented to him were actually hotly contested. Having fired its heavy artillery early in this lawsuit, the Plaintiff may now be at a disadvantage.","The Court has yet to issue a complete written opinion explaining its reasoning. We’ll provide an update once that has been released.","<i data-v-f87c67ca=\"\">Stephen D. Palley is a trial lawyer based in Washington, D.C. with whose practice focuses in part on cryptocurrency and blockchain<\/i><em data-v-f87c67ca=\"\">. His \"Crypto Caselaw Minute\" is re-published weekly on The Block. Palley can be found on <a href=\"https:\/\/www.linkedin.com\/in\/stephendpalley\/\" data-v-f87c67ca=\"\">LinkedIn<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Twitter<\/a>.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"the Court","content":"ORGANIZATION"},{"type":"$18.81","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Stephen D. Palley","content":"PERSON"},{"type":"Twitter","content":"DATE"},{"type":"October 26, 2018","content":"DATE"},{"type":"September 11, 2018","content":"DATE"},{"type":"Crypto Caselaw Minute\"","content":"ORGANIZATION"},{"type":"Elliptic","content":"LOCATION"},{"type":"Eastern District of Virginia –","content":"ORGANIZATION"},{"type":"Charlie Shrem","content":"PERSON"},{"type":"Winklevoss Capital","content":"ORGANIZATION"},{"type":"Complaint","content":"ORGANIZATION"},{"type":"September 2018","content":"DATE"},{"type":"Winklevii","content":"PERSON"},{"type":"LLC","content":"ORGANIZATION"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Rakoff","content":"PERSON"},{"type":"$950,000","content":"MONEY"},{"type":"WCF","content":"ORGANIZATION"},{"type":"$61,000","content":"MONEY"},{"type":"$12.25","content":"MONEY"},{"type":"December 31, 2012","content":"DATE"},{"type":"X.","content":"PERSON"},{"type":"Winklevoss","content":"PERSON"},{"type":"D.C.","content":"LOCATION"},{"type":"$750,000","content":"MONEY"}],"hashtag":[],"authors":["Stephen D. Palley","The Block"]}