{"summary":"Nearly a decade after it was founded, crypto payment company Wyre may be shutting down, former employees told Axios.\nLess than a year since it opened its physical location in Manhattan’s SoHo, EmpireDAO will close its doors and focus on a “clean exodus” after falling short of a targeted $250,000 crowdfunding goal.","author":["Jeremy Nation","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/199043\/crypto-winter-exacts-new-tolls-as-companies-brace-and-restructure","publishDate":"2023-01-03T20:08:21","id":489,"type":null,"title":"Wyre, EmpireDAO among latest casualties of crypto winter","category":["Companies"],"content":["Wyre and EmpireDAO are the two latest companies to fall victim to crypto winter.","<span data-v-f87c67ca=\"\">Founded nearly a decade ago, payment provider Wyre let a number of employees go, with two laid-off workers confirming that the company plans to shut down, according to <a href=\"https:\/\/www.axios.com\/2023\/01\/03\/wyre-shutdown-crypto-winter\" data-v-f87c67ca=\"\">Axios<\/a>.&nbsp;<\/span><span data-v-f87c67ca=\"\">One former employee, citing an email from CEO Ioannis Giannaros, indicated that the company will liquidate and terminate services as soon as this month. Another former employee told Axios no severance packages have been offered.<\/span>","<span data-v-f87c67ca=\"\">The company still is operating, according to Giannaros; however, its plans including scaling back, he told Axios.<\/span>","<span data-v-f87c67ca=\"\">In another sign of the market's downturn, it’s also the end of an EmpireDAO's tenancy at 190 Bowery in New York, which illustrates the boom-and-bust nature of the digital currency ecosystem.<\/span>","<span data-v-f87c67ca=\"\">The move to vacate the premises comes less than a year after founder Mike Fraietta opened its doors to a community that has since amassed 1,500 members with 300 daily visitors, according to <\/span><a href=\"https:\/\/www.coindesk.com\/web3\/2023\/01\/03\/web3-co-working-hub-empiredao-closes-amid-bear-market-woes\/?utm_medium=social&amp;utm_source=onecryptofeed&amp;utm_campaign=headlines\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Coindesk<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">Although Fraietta’s last-ditch efforts to save the space via <\/span><a href=\"https:\/\/eth.empiredao.xyz\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">crowdfunding<\/span><\/a><span data-v-f87c67ca=\"\"> last December targeted raising 205 ETH (almost $250,000), the campaign's site indicates that donations only reached 6.71 ETH ($8,150) from some 27 contributors. The donations will be returned now that the campaign has failed to reach its goal.<\/span>","<span data-v-f87c67ca=\"\">EmpireDAO’s future may come in the form of temporary installations at crypto conferences, but for now Fraietta said the focus is on a “clean exodus.\"<\/span>"],"hashtag":[]}