{"summary":"Latin America has a smaller crypto economy than other regions, but grassroots adoption is growing fast, according to Xapo Bank.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/264333\/how-xapo-bank-is-capitalizing-on-a-crypto-revolution-in-latin-america","publishDate":"2023-11-22T12:42:02","id":4891,"type":null,"title":"How Xapo Bank is capitalizing on a crypto revolution in Latin America","category":["COMPANIES"],"content":["In Latin America, a region marked by diverse economic challenges and varying levels of financial technology adoption, Xapo Bank is emerging as a key player in its crypto revolution.&nbsp;","“While Latin America has a smaller crypto economy than most other regions, grassroots adoption is strong, with Argentina and Mexico ranking very highly,” Xapo Bank CEO Seamus Rocca told The Block in an interview.","With digital banks thriving in Brazil due to their convenience and ease in cross-border payments, the demand for remittance services in Mexico, and Argentina grappling with hyperinflation, Xapo Bank's fusion of traditional banking with access to bitcoin, stablecoins and altcoins is well placed to service that growing demand, Rocca said.","Given the inflationary pressures and instability across many areas of Latin America, U.S. dollars are a trusted global reserve and one of the most widely used and dependable currencies, Rocca continued. However, as opening a U.S. dollar account in the region can be difficult, Xapo is trying to address this, enabling members to access accounts more easily, with annual interest rates of up to 4.1% to help protect their wealth, he added.","On the crypto side, \"unfortunately, the vast majority of users there access their cryptocurrency through an exchange, which has time and time again proved itself to be an insecure endeavor that puts customer assets at risk,\" Rocca continued. He claimed Xapo is the first bank to offer access to digital assets with the security of regulated banking protections. Xapo Bank is licensed and registered in Gibraltar and includes a deposit guarantee plan.","\"Unlike exchanges, with Xapo you don't have to worry about withdrawing money to a bank because we already are a bank, enabling quick and easy transactability,\" he said.","In Argentina, where the national currency is rapidly devaluing amid inflation levels as high as <a href=\"https:\/\/www.theblock.co\/post\/263747\/bitcoin-nears-all-time-high-argentina-javier-milei-wins-presidential-election\" data-v-f87c67ca=\"\">150%<\/a>, stablecoins like USDC are becoming increasingly vital, with people looking for alternatives to the peso, Rocca said.","\"We tend to think of crypto as a tradeable asset but bitcoin's underlying use-case is as a store of value. For them, the volatility of crypto is nothing compared to their own currency, paired with the fact that bitcoin is sovereign and not subject to political instability,\" he added.","Originally used to avoid volatility in the crypto ecosystem and the slow, costly and potentially risky process of withdrawing fiat from exchanges, stablecoins are now increasingly used as a form of cross-border payment. \"That creates opportunities for a bank like Xapo that is comfortable with crypto,\" Rocca said. \"There is a genuine use case for stablecoins in emerging markets like Mexico and Argentina, where a big majority of our members are based. Stablecoins act as a payment mechanism, enabling cross-border payments in a cost-efficient manner.\"&nbsp;","That's something Rocca says Xapo is seeing particular traction with, offering a U.S. dollar deposit bank account where you can also send and receive USDC, USDT, euros or pounds. \"Given that banks like JPMorgan are prohibiting their clients from making crypto transactions, converting stablecoins to fiat is difficult, which gives Xapo an advantage as we provide an easy and cost-efficient mechanism that bypasses SWIFT,\" he said.","USDC issuer <a href=\"https:\/\/www.theblock.co\/post\/222123\/circle-sidesteps-swift-after-bank-collapses-turns-to-gibraltars-xapo-bank\" data-v-f87c67ca=\"\">Circle<\/a> tapped into that facility after the collapse of Silicon Valley Bank earlier this year, with Xapo Bank offering one-to-one dollar conversion of USDC and supporting USDC transfers so members can sidestep the SWIFT payment system.","Remittances are core to Mexico's economy due to the population of Mexicans living in the U.S. who send money back to the country, Rocca said. That was exacerbated by the coronavirus pandemic, accelerating the adoption of crypto-based remittance services, he argued.&nbsp;","Capitalizing on this trend, Rocca said stablecoins offer users in Mexico the benefits of crypto for remittances, including speed, lower fees and reduced price volatility compared to conventional methods, enabling Xapo members to transfer funds instantly, globally and 24\/7 via its mobile app.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"fiat","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Latin America","content":"LOCATION"},{"type":"Brazil","content":"LOCATION"},{"type":"4.1%","content":"PERCENT"},{"type":"Mexico","content":"LOCATION"},{"type":"\" Rocca","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Xapo Bank CEO Seamus Rocca","content":"ORGANIZATION"},{"type":"Argentina","content":"LOCATION"},{"type":"Xapo","content":"LOCATION"},{"type":"Gibraltar","content":"LOCATION"},{"type":"150%","content":"PERCENT"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Xapo Bank","content":"ORGANIZATION"},{"type":"Rocca","content":"ORGANIZATION"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"}],"hashtag":["BITCOIN","CRYPTO BANKS AND LENDERS","TETHER","USDC"],"authors":["James Hunt","The Block"]}