{"summary":"Belarus is working on legislation that would ban peer-to-peer crypto transactions in order to combat crime.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237523\/belarus-wants-to-ban-peer-to-peer-crypto-transactions","publishDate":"2023-07-03T10:32:16","id":4893,"type":null,"title":"Belarus wants to ban peer-to-peer crypto transactions","category":["POLICY"],"content":["Belarus is working on legislation that would ban peer-to-peer crypto transactions in an effort to combat crime.","P2P crypto services are in demand among fraudsters, Alexander Ringevich, deputy chief of a crime division within Belarus's Ministry of Internal Affairs, <a href=\"https:\/\/vk.com\/wall-48821363_11116\" data-v-f87c67ca=\"\">said<\/a> in a statement Sunday. Fraudsters are using P2P crypto services to cash out and convert stolen funds, as well as to transfer money to participants of criminal activities, Ringevich said.","Since 2023, the ministry of internal affairs has halted activities of 27 individuals who were providing \"illegal\" crypto exchange services, with illicit income amounting to nearly 22 million rubles ($8.4 million), according to Ringevich.","To prevent such incidents, the ministry is looking to restrict crypto P2P services, meaning only crypto transactions via registered exchanges will be allowed.","Belarus legalized crypto transactions in 2017, according to <a href=\"https:\/\/freemanlaw.com\/cryptocurrency\/belarus-and-cryptocurrency\/\" data-v-f87c67ca=\"\">Freeman Law.<\/a> Subsequently, in November 2018, the Supervisory Council of the Hi-Tech Park approved additional guidance for the relegation of token-related activities.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"Ringevich","content":"PERSON"},{"type":"Ministry of Internal Affairs","content":"ORGANIZATION"},{"type":"Tech Park","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Belarus","content":"LOCATION"},{"type":"November 2018","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Alexander Ringevich","content":"PERSON"},{"type":"$8.4 million","content":"MONEY"},{"type":"Freeman Law","content":"ORGANIZATION"}],"hashtag":["EUROZONE REGULATION"],"authors":["Yogita Khatri","The Block"]}