{"summary":"Layer1, a Digital Currency Group portfolio company, has raised $50 million at a valuation of $200 million \nThe company was previously an investment fund, but now it is focusing on bitcoin mining\nPlanning to own the entire supply chain of bitcoin mining, the company has built its own mining chips and infrastructure; it is also running its own electricity substations in Texas","author":["Celia Wan","Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/43253\/thiel-crypto-investors-pour-50-million-into-new-bitcoin-miner-aimed-in-us","publishDate":"2019-10-15T09:00:56","id":490,"type":null,"title":"Big investors are pouring $50M into a bitcoin mining startup, and they’re hoping its own mining chips and Texas energy will make it a new powerhouse","category":["Mining"],"content":["<span data-v-f87c67ca=\"\">A Digital Currency Group (DCG)-backed investment fund is making a pivot into the bitcoin mining business, and venture capitalists including Peter Thiel are committing $50 million to the newish venture that they deem worth $200 million.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">San Francisco-based Layer1 announced on Tuesday that it has raised the multi-million-dollar Series A from Peter Thiel, Shasta Ventures, and crypto industry leaders. <\/span><span data-v-f87c67ca=\"\">Originally established as an activist fund aimed at building an ecosystem around privacy coin, Grin, the firm is now building out a bitcoin mining operation and claims to be the first bitcoin mining company in the U.S. “at scale,” said Layer1 co-founder Alexander Liegl.&nbsp;<\/span>","With the move, Layer1 is entering into a market that is around <a href=\"https:\/\/arxiv.org\/pdf\/1810.02466.pdf\" data-v-f87c67ca=\"\">70%<\/a> dominated by Chinese miners, which benefit from low electricity prices and easy access to mining machines produced by China-based manufacturers such as Bitmain and Canaan Creative. According to blockchain.com data, the top five known mining pools are also all <a href=\"https:\/\/www.blockchain.com\/en\/pools\" data-v-f87c67ca=\"\">based<\/a> in China. Still, Liegl hopes the firm will stand out due to its focus on minimizing the cost of electricity versus maximizing the efficiency of chips.","\"We expect our chips to be competitive for at least eight years now...you want to have your own chips in hand. We also have our own electricity substations: effectively that's as close you can get to owning your own power plant,\" said Liegl.","<span data-v-f87c67ca=\"\">To that end, the company has bought a dozen acres of land in Texas to build its own electricity substations, partnered with a Beijing-based semiconductor company to create its own mining chips, and built its own mining machine infrastructure. The ultimate goal, according to Liegl, is to own every step of the bitcoin mining supply chain and vertically integrate the mining business. For instance, the firm might expand into lending, derivatives, and other corners of the bitcoin market. Liegl described the firm as the Exxon Mobile of crypto.<\/span>","<b data-v-f87c67ca=\"\">All my ASICs live in Texas<\/b>","<span data-v-f87c67ca=\"\">While China’s triumph in bitcoin mining is in part due to its cheap electricity, this recipe to profit can also be replicated in Texas, according to Liegl. Indeed, he said&nbsp;<\/span><span data-v-f87c67ca=\"\">Texas has one of the most competitive electricity prices in the world and has many renewable energy plants that Layer1 can utilize to reduce operational costs.<\/span>","<span data-v-f87c67ca=\"\">However, the hot weather in Texas may present a substantial challenge to bitcoin mining.&nbsp;<\/span><span data-v-f87c67ca=\"\">Mining facilities are usually maintained in cold regions or air-conditioned environment to cool mining machines. To take advantage of Texas’ low electricity prices, Liegl said they have developed a special cooling technology that “creates only additional power draw of 3%” of the power that mining machines consume.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The electricity prices in Texas have always been extremely competitive, what happened is that nobody in the cryptocurrency mining industry has been able to take advantage of that yet, since they lack the appropriate cooling technology,” said Liegl.&nbsp;<\/span>","<strong data-v-f87c67ca=\"\">Mining ain't easy<\/strong>","<span data-v-f87c67ca=\"\">To be sure, building a mining facility from scratch incurs significantly more upfront costs than directly buying mining machines and using electricity from local power stations. Last week, Virginia-based bitcoin mining firm BCause Mining <\/span><a href=\"https:\/\/www.pilotonline.com\/business\/vp-bz-bcause-bankruptcy-liquidation-20191009-lwot3gx5pnd6di4byqdg3q7tdi-story.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">filed<\/span><\/a><span data-v-f87c67ca=\"\"> for bankruptcy. In 2018, the company had pledged to invest $64.8 million to expand its business into “the largest cryptocurrency mining operating in North America\". Now a total of&nbsp; 23 creditors claim the company owes them $13.3 million.&nbsp;<\/span>","Meanwhile, in the past, U.S. towns chosen by foreign money for mining often face opposition from local communities, doubting whether these mining facilities can truly provide the employment opportunities that they need. For example, Bitmain, which had at one time said it will create the largest mining facility in Texas that created around 350 jobs, ended up hiring less than 15 employees during the price plunge earlier this year, per a Wired <a href=\"https:\/\/www.wired.com\/story\/hard-luck-texas-town-bet-bitcoin-lost\/\" data-v-f87c67ca=\"\">report<\/a>.&nbsp;","<span data-v-f87c67ca=\"\">However, according to Liegl, running a mining farm in the U.S. has both economic and ideological significance.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I feel very strongly about this, which is you need a U.S. representative in order to create more symmetric distribution in hash power, that would definitely be a net positive for the community and the protocol.\"<\/span>"],"hashtag":["DIGITAL CURRENCY GROUP"]}