{"summary":"According to an announcement today, the investment platform and Celsius shareholder BnkToTheFuture is set to acquire crypto lender Salt.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/167419\/celsius-shareholder-bnktothefuture-set-to-acquire-crypto-lender-salt","publishDate":"2022-09-02T11:10:31","id":490,"type":null,"title":"Celsius shareholder BnkToTheFuture set to acquire crypto lender Salt","category":["BLOCKCHAIN"],"content":["BnkToTheFuture, an investment platform that allows its clients to invest in crypto, fintech companies and tokens, is set to acquire Salt Lending.","According to <a href=\"https:\/\/saltlending.com\/were-excited-to-announce-a-potential-acquisition-by-bnk-to-the-future\/\" data-v-f87c67ca=\"\">an announcement today<\/a>, BnkToTheFuture has entered into a letter of intent to acquire Salt, contingent upon signing definitive agreements and regulatory approval.&nbsp;","Founded in 2016, Salt Lending allows users to receive fiat cash loans against their cryptocurrency collateral.&nbsp;","\"Moving forward with this acquisition provides an opportunity to enhance our suite of products and advance our mission to preserve and grow your crypto wealth,\" said Salt Lending CEO Rob Odell in <a href=\"https:\/\/saltlending.com\/were-excited-to-announce-a-potential-acquisition-by-bnk-to-the-future\/\" data-v-f87c67ca=\"\">a statement<\/a> today.&nbsp;","The company said that there would be no changes to its loans as a result of the acquisition offer.&nbsp;","According to a <a href=\"https:\/\/www.coindesk.com\/business\/2022\/09\/02\/crypto-investor-bnktothefuture-agrees-to-buy-salt-to-add-crypto-lending\/\" data-v-f87c67ca=\"\">CoinDesk report<\/a>, BnkToTheFuture said the acquisition will complement its status as a registered excluded securities business in the Cayman Islands.","\"By combining a registered securities business with a registered lending business we believe we are able to offer a regulatory-compliant lending and yield platform to users,\" a company representative told CoinDesk.","The investment platform also said it plans to develop an option for helping distressed lending companies (and their customers) that are unable to resurface from bankruptcy amid regulatory constraints. It is reportedly eying the loan book of Celsius, according to people familiar with the matter cited by CoinDesk. It holds a 5% stake in the lending company","The deal, of which the terms were not disclosed, follows the struggles encountered by some of its crypto lender compatriots.","In June, Celsius <a href=\"https:\/\/www.theblock.co\/linked\/151522\/crypto-lending-firm-celsius-pauses-withdrawals-and-transfers-citing-market-conditions\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">paused withdrawals and transfers<\/a> amid turbulent market conditions. The company ultimately filed for bankruptcy, revealing a <a href=\"https:\/\/www.theblock.co\/post\/157647\/celsius-bankruptcy-documents-claim-1-2-billion-balance-sheet-gap\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">$1.2 billion hole<\/a> in its balance sheet. Troubles also beset cryptolender BlockFi amid the market downturn that saw bitcoin dip below $20,000. After pausing withdrawals, it struck<a href=\"https:\/\/www.theblock.co\/post\/155516\/blockfi-strikes-680-million-credit-deal-with-ftx-us-outlines-acquisition-path\" data-v-f87c67ca=\"\"> a credit deal with FTX US<\/a> with a pathway to acquisition.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cayman Islands","content":"LOCATION"},{"type":"BnkToTheFuture","content":"PERSON"},{"type":"2016","content":"DATE"},{"type":"June","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"$20,000","content":"MONEY"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"$1.2 billion","content":"MONEY"},{"type":"Rob Odell","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["CRYPTO","LENDING"],"authors":["Tom Matsuda","The Block"]}