{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley. They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/15221\/stolen-mining-rigs-lead-to-insurance-coverage-litigation","publishDate":"2019-03-10T18:00:41","id":4906,"type":null,"title":"Stolen mining rigs lead to insurance coverage litigation","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]818Computer, Inc. v. Sentinel Insurance Company Ltd., Cal. Superior Court, Los Angeles County, 18STSVO7218 (12\/5\/2018) [SDP]<br data-v-f87c67ca=\"\">\n<\/strong><\/em>","Insurance is only boring until you have to make a claim (or like this author are an insurance coverage lawyer). This new lawsuit involves an insurance coverage dispute involving a mining hardware loss. It was filed in state court in California, removed to federal court and just remanded to state court. I’m not going to talk about the removal and remand process because it’s not as interesting as the insurance component of this case.&nbsp;","Plaintiffs allege that “prior to September 2017, [their] business model was to design and build high-powered computers that ‘mine’ cryptocurrency full time” and depended on their ability to provide a warranty, only offered after three months of continuous operation.","In September 2017, they say that 16 mining rigs were stolen and several dozen were “total losses” because of damage they suffered in the break-in. They further allege that “at the time of the burglary, Plaintiff had purchased the component parts for their machines on credit, with the intent of repaying those loans once the machines were sold. At the time of the burglary, the global cryptocurrency market was very favorable, and demand for the “rigs” was very high. However, as a result of the burglary, Plaintiff was left without any means of repaying its loans, as the Subject Property had been stolen and\/or irreparably damaged. Absent a payment of insurance benefits, Plaintiff would be unable to continue operating its business.”","Plaintiffs allege that the insurance company gave them a long run around, made unreasonable and confusing inspection and testing results, “failed to take into consideration all the information and evidence” and ultimately “issued a claim denial” (though confusingly the Complaint also says that some money was paid). The lawsuit names both the insurance company, one of its insurance adjusters and 20 John Does as defendants. It sues for breach of contract, breach of the implied covenant of good faith and fair dealing, unfair business practice under California law, and negligent misrepresentation (guffaw). It also asks for punitive damages and attorney’s fees.","While I’ve seen all manner of insurance company hijinks, it’s actually a little hard to figure out from this Complaint what the insurance company did wrong. It also seems to proceed from the see-what-sticks theory of litigation — if you throw enough up on the wall, something will stick. I suspect that the biggest part of the dispute centers around business interruption coverage, which is a part of certain types property policies that will pay for costs associated with business stopping because of an insured loss. Another problem might be valuation of the assets themselves in a really volatile market. But it’s hard to know, because the complaint makes some loud claims but not quite as much on-point detail.","Also, I strongly suspect that the only claim that survives motion practice is the breach of contract claim, and that the adjuster and the John Doe defendants will be dismissed. (A little bit of a rant here — I don’t understand why plaintiff’s lawyers make allegations that are almost certain to trigger motion practice that they stand a good chance of losing. I don’t represent insurance companies, I am only ever averse to them, but it still makes no sense to me when I see a complaint larded with this kind of chazerai.","I’m honestly a little bit disappointed that there aren’t more details about the underlying insurance dispute here, because we could use a little more precedent in this space. For now, I just hope these plaintiffs — who say the theft and subsequent insurance coverage fight destroyed their business — aren’t paying on a contingent fee basis. In the meantime, if more happens on this case, I’ll be sure to cover it here.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part III of this week's analysis,&nbsp;Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Cal","content":"LOCATION"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"John Doe","content":"PERSON"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"Inc. v. Sentinel Insurance Company Ltd.","content":"ORGANIZATION"},{"type":"California","content":"LOCATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"Palley","content":"PERSON"},{"type":"John Does","content":"PERSON"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Los Angeles County","content":"LOCATION"},{"type":"September 2017","content":"DATE"},{"type":"Rosario","content":"PERSON"}],"hashtag":[],"authors":["Stephen D. Palley","The Block"]}