{"summary":"The Block&#x27;s Aislinn Keely recaps several days in Miami during a Bitcoin cultural convergence.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/141514\/bitcoin-2022-loses-some-evangelical-luster-as-crypto-goes-mainstream","publishDate":"2022-04-12T11:26:27","id":4909,"type":null,"title":"Bitcoin 2022 loses some evangelical luster as crypto goes mainstream","category":["BITCOIN"],"content":["<span data-v-f87c67ca=\"\">If Bitcoin 2022 is any indication, the hype train has stopped at the information station.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Twenty-five thousand people – more than double the number of last year’s attendees – descended upon Miami, Florida last week for the annual Bitcoin conference, according to the numbers announced by the event's organizers, BTC Media.&nbsp;<\/span><span data-v-f87c67ca=\"\">Outside stood a bull I was told was designed by the same firm that designed the Transformers for Michael Bay's franchise. The cyborg-looking version of Wall Street's famed monument became the conference's mascot. <\/span>","<span data-v-f87c67ca=\"\">Like last year, much of the conference center was bathed in orange, crypto firms still sought to outdo each other in increasingly elaborate displays on the expo floor and the hours post-conference were still filled with ostentatious afterparties. <\/span>","<a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2022\/04\/IMG_5962.heic\" data-v-f87c67ca=\"\"><img class=\"alignnone size-full wp-image-141519\" src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2022\/04\/IMG_5962.heic\" alt=\"\" data-v-f87c67ca=\"\"><\/a>","","<span data-v-f87c67ca=\"\">In this reporter's estimation, 2021's confab felt more like a celebration than a trade show or informational event and was defined by the announcement by El Salvador's president, Nayib Bukele, that his country would move to adopt bitcoin.<\/span>","<span data-v-f87c67ca=\"\"> This year had a clearer message: mass adoption. <\/span><span data-v-f87c67ca=\"\">And based on the proceedings, pushing mass adoption meant some of the more fringe, evangelical takes gave way to information and nuance.<\/span>","<span data-v-f87c67ca=\"\">Still, this is Bitcoin 2022, and the \"maximalist\" viewpoint was frequently on display.<\/span>","<span data-v-f87c67ca=\"\">There remained panels with titles like “Bitcoin is f*** you money,” “You are the carbon they want to reduce,” and “Memetic warfare.” <\/span><span data-v-f87c67ca=\"\">One master of ceremonies encouraged attendees to engage in a Braveheart style “Freedom” chant. Another panel leader joked that he would flagellate any of the panelists who made mention of cryptocurrencies other than bitcoin. <\/span>","<span data-v-f87c67ca=\"\">A keynote by Mexican billionaire Ricardo Salinas included a slide titled “The Villains,” which featured images of global financial regulators with devil horns drawn on them.&nbsp;<\/span>","<a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2022\/04\/IMG_5998.heic\" data-v-f87c67ca=\"\"><img class=\"alignnone size-full wp-image-141515\" src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2022\/04\/IMG_5998.heic\" alt=\"\" data-v-f87c67ca=\"\"><\/a>","","<span data-v-f87c67ca=\"\">But that style of programming was notably smaller in magnitude than last year, and it also didn’t play as well with the attendees. <\/span><span data-v-f87c67ca=\"\">MCs chastised the crowd multiple times for being quieter than usual. <\/span>","<span data-v-f87c67ca=\"\">From this reporter’s perspective, attendees just weren’t as riled up about making money and unburdening themselves from the yoke of centralized monetary policy. Instead, they were more interested in the potential of the network. <\/span>","<span data-v-f87c67ca=\"\">Sure, sometimes the use of the words “free market” would get an errant whoop from a few people, but it was a far cry from the ovations of 2021.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Downstairs at the main stage, panelists trotted out announcements and spoke on broad topics like “Bitcoin &amp; Politics,” “The Annual State of Bitcoin” and “The Bitcoin Macroeconomic Landscape.” A variety of smaller stages took a more in-depth look at specific aspects of the ecosystem, like the Bitcoin Mining stage, the Open Source Stage, or the more exclusive Enterprise stage.&nbsp;<\/span>","","","<span data-v-f87c67ca=\"\">Rather than recycling buzzwords like “freedom,” “decentralization,” and “privacy,” many panelists engaged with what the Bitcoin ecosystem has accomplished since its inception, and what it’s poised to accomplish in the future. <\/span>","<span data-v-f87c67ca=\"\">That also left room for nuance and criticism.<\/span>","<span data-v-f87c67ca=\"\">Unlike last year’s “no altcoins” policy, big speakers recognized the merits of other networks. Famed investor Peter Thiel spent a portion of his keynote comparing the different purposes of Bitcoin and Ethereum. Some even advised the hype train to proceed with caution, as psychologist Jordan Peterson’s <a href=\"https:\/\/www.theblockcrypto.com\/post\/141340\/jordan-peterson-cautions-against-unbridled-enthusiasm-for-bitcoin\" data-v-f87c67ca=\"\">fireside<\/a> posited.&nbsp;<\/span>","It also had a more favorable attitude towards regulators – minus the devil-horned slide moment.","No longer was there a question of whether bitcoin was under attack by the government, a sentiment that underpinned last year's <a href=\"https:\/\/youtu.be\/zaaYNltBksw\" data-v-f87c67ca=\"\">panel<\/a> with Senator Cynthia Lummis at Bitcoin 2021. Regulation at this stage in the game seems to be a given, and many panelists expressed hope going forward, like MicroStrategy's Michael Saylor and ARK's Cathy Wood.","Indeed, much of the discussion in policy-focused panels was aimed at how to best educate and shape the regulatory discussions around bitcoin, especially bitcoin mining.","Attendees seemed less interested in being a fringe group that operates independently of government and instead, a mainstream-recognized answer to some of the realities that come with state-controlled monetary policy.&nbsp;","","","<span data-v-f87c67ca=\"\">All of this made for a somewhat muddled tone of the event, as MCs and panel leaders often pushed for a more evangelical take on crypto, and panelists and the crowd were often unwilling to play along. <\/span>","<span data-v-f87c67ca=\"\">Doubling attendance seemed to introduce a more sober sensibility –&nbsp;or, as sober as a Bitcoin conference can get. Mass adoption, it seems, does require appealing to the masses.<\/span>","<span data-v-f87c67ca=\"\">The event certainly leveraged celebrity to push Bitcoin further into the mainstream. <\/span>","<span data-v-f87c67ca=\"\">One panel saw athletes Serena Williams, Odel Beckham Jr. and Aaron Rodgers speak on their crypto experiences. Barstool founder Dave Portnoy was slated to appear on one panel, though he never made it to his seat on stage.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Who knows why, maybe he’s sold his bitcoin again,” quipped MC Peter McCormick as he announced the drop.<\/span>","<span data-v-f87c67ca=\"\">But none of these mainstream celebrities came close to the hype around Jack Mallers, the CEO of Lightning payments firm Strike. Mallers drove the biggest, and loudest, crowd this reporter witnessed at the event. Mallers was lauded more like a rockstar than a developer.<\/span>","<span data-v-f87c67ca=\"\">“I cried when Jack Mallers made his El Salvador announcement last year,” one man told me at an afterparty.&nbsp;<\/span>","","","<span data-v-f87c67ca=\"\">And he wasn't alone. MCs continuously touted his coming announcement and Mallers' importance in the space, which culminated in the young CEO giving a 45-minute history of payment processing and an announcement that Strike had partnered with large processors to enable bitcoin payments at most stores. <\/span>","<span data-v-f87c67ca=\"\">Much of his explanation of payment processing included banks saying the phrases \"wazzup\" and \"we good?\" to each other. Like a true rockstar, Mallers had partnered with his favorite streetwear brand to celebrate the rollout and performed a transaction on stage to purchase a shirt from the new collection.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A second demo came in the form of a video depicting Mallers saying he would buy a soda from a convenience store with the new integration. It cut to Mallers at checkout with his goods – now, for some reason, a rack of Bud Lite instead of soda – and performing a transaction in bitcoin.<\/span>","As expected, the demonstration was well-received.","<span data-v-f87c67ca=\"\">But while the reaction to the Mallers' announcement illustrates who the Bitcoin community views as its hero, it also points to where many seem to want adoption to go in the future: payments. A number of panels focused on the opportunities related to the Lightning Network, Bitcoin’s payments rail, and Mallers’ work to lower barriers to its usage has seemingly elevated him to star status.<\/span>","<span data-v-f87c67ca=\"\">As I ate my $30 tacos and chips at the lunch hall, one man remarked to me how disappointed he was that vendors weren’t forced to solely transact in bitcoin. It could have been an opportunity to prove the use case, he lamented.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cathy Wood","content":"ORGANIZATION"},{"type":"$30","content":"MONEY"},{"type":"Peter Thiel","content":"PERSON"},{"type":"Aaron Rodgers","content":"PERSON"},{"type":"Dave Portnoy","content":"PERSON"},{"type":"Miami","content":"LOCATION"},{"type":"Braveheart","content":"LOCATION"},{"type":"“Bitcoin &amp; Politics","content":"ORGANIZATION"},{"type":"Jordan Peterson","content":"PERSON"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"Transformers for Michael Bay","content":"ORGANIZATION"},{"type":"Ricardo Salinas","content":"PERSON"},{"type":"Nayib Bukele","content":"PERSON"},{"type":"Cynthia Lummis","content":"PERSON"},{"type":"El Salvador","content":"ORGANIZATION"},{"type":"Michael Saylor","content":"PERSON"},{"type":"Florida","content":"LOCATION"},{"type":"BTC Media","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Odel Beckham Jr.","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Jack Mallers","content":"PERSON"},{"type":"last week","content":"DATE"},{"type":"Bitcoin Macroeconomic Landscape","content":"ORGANIZATION"},{"type":"Peter McCormick","content":"PERSON"},{"type":"Mallers","content":"PERSON"},{"type":"Serena Williams","content":"PERSON"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["BITCOIN"],"authors":["Aislinn Keely","The Block"]}