{"summary":"BitMEX CEO Arthur Hayes is slated for sentencing on Friday.\nThe Block takes a look back on the timeline of the case.\nHayes faces up to five years after pleading guilty to Bank Secrecy Act violations but has requested probation with the ability to travel abroad.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/147732\/arthur-hayes-faces-up-to-five-years-in-his-friday-sentencing-but-jail-time-is-unlikely","publishDate":"2022-05-18T18:14:48","id":491,"type":null,"title":"Arthur Hayes faces up to five years in his Friday sentencing, but jail time is unlikely","category":["Legal"],"content":["Former BitMEX CEO Arthur Hayes is slated for sentencing this Friday after pleading guilty to violating the US Bank Secrecy Act (BSA).","Though Hayes faces a possible maximum sentence of five years in prison, it's uncommon for BSA violations to result in jail time.","The sentencing will close a legal chapter that began in October 2020, when the Department of Justice and the Commodity Futures Trading Commission (CFTC) lodged <a href=\"https:\/\/www.theblockcrypto.com\/linked\/79483\/cftc-bitmex-charges-lawsuit\" data-v-f87c67ca=\"\">parallel actions<\/a> against crypto derivatives exchange BitMEX and its owner-operators. Those owner-operators included Benjamin Delo, Samuel Reed and Hayes.","The three co-founders faced a civil complaint from the CFTC alleging they violated CFTC rules by failing to implement know-your-customer procedures, a customer information program, and anti-money laundering procedures. The DOJ lodged separate criminal charges of violating the BSA.&nbsp;","At the time the complaints were filed, Hayes was living abroad in Singapore. After <a href=\"https:\/\/www.theblockcrypto.com\/linked\/97058\/us-prosecutors-bitmex-arthur-hayes-surrender-discussion\" data-v-f87c67ca=\"\">negotiations<\/a> on a surrender agreement, Hayes traveled to Hawaii where he <a href=\"https:\/\/www.theblockcrypto.com\/linked\/100751\/former-bitmex-ceo-hayes-surrender-report\" data-v-f87c67ca=\"\">appeared<\/a> before a federal judged and was later released on a $10 million bond with plans for future court proceedings to take place in New York.&nbsp;","Hayes and Delo both <a href=\"https:\/\/www.theblockcrypto.com\/linked\/135406\/bitmex-co-founders-hayes-delo-plead-doj\" data-v-f87c67ca=\"\">pleaded guilty<\/a> to one count each of violating the BSA, which carries a maximum penalty of five years in prison. At the time of the plea, a spokesperson for Hayes told The Block: “Mr. Hayes accepts responsibility for his actions and looks forward to the time when he can put this matter behind him.”","That time could be coming soon. Since then, the CFTC case has been <a href=\"https:\/\/www.theblockcrypto.com\/linked\/145385\/court-orders-bitmex-co-founders-pay-a-total-of-30-million-in-cftc-civil-case\" data-v-f87c67ca=\"\">resolved<\/a> in a $30 million penalty for the three co-founders. Each is responsible to pay $10 million for violations of federal commodities laws. BitMEX itself also entered into an August 2021 <a href=\"https:\/\/www.theblockcrypto.com\/linked\/114110\/bitmex-cftc-fincen-settlement-derivatives\" data-v-f87c67ca=\"\">settlement<\/a> that required it to pay a $100 million penalty and barred it from offering derivatives products in the US.&nbsp;","With the civil enforcement resolved, Hayes is hoping his criminal charges will resolve without jail time.","In a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/145341\/former-bitmex-ceo-asks-for-probation-over-jail-time-ahead-of-court-sentencing\" data-v-f87c67ca=\"\">letter<\/a> early this month, Hayes requested probation with the ability to travel and reside abroad over jail time. His counsel argues that Hayes's actions were consistent with industry practice at the time and occurred without clear guidance from regulators. He also has no prior offenses and is already facing the $10 million CFTC fine.","As Hayes's probation request points out, the BitMEX case is a first-of-its-kind prosecution for the government.","It marks a significant enforcement action against a crypto firm for BSA violations – a level of compliance that wasn't always upheld by the industry. In the BitMEX case, the US has made it clear that adherence to existing traditional finance guidelines around anti-money laundering is mandatory.&nbsp;","Felony BSA violations are a serious offense, but it's uncommon for them to result in jail time, according to Jaimie Nawaday, a former federal prosecutor in the Southern District of New York and current co-head of Seward &amp; Kissel's Government Enforcement and Internal Investigations Group.&nbsp;","The guidelines for felony BSA charges range from six to 12 months. For guidelines of that range, Nawaday says there's often a good chance of avoiding jail time. Additionally, in Hayes's case, the probation department came out in favor of no jail time and two years probation, though the prosecution has pushed for a one-year minimum sentence.","\"Given the low guidelines range to begin with, that it is a novel prosecution, which is one of the things that the defense is right to point out, and that the probation essentially sides with the defense in supporting no jail time at all, I would say it's pretty unlikely,\" said Nawaday.","If Hayes does receive jail time, anything over 12 months would be a meaningful decision that could have an impact going forward, according to Nawaday. A short-term sentence, like six months, would be less impactful. Whether a request to travel abroad will be granted is harder to discern since the request is more novel.&nbsp;","<em data-v-f87c67ca=\"\">Correction: A previous version of this article attributed the quote at the time of the plea to a BitMEX spokesperson. It has been corrected to a spokesperson for Hayes.&nbsp;<\/em>"],"hashtag":["BITMEX","CFTC","CRIME"]}