{"summary":"JPMorgan says Binance&#x27;s decision to auto-convert USDC deposits to BUSD could make Tether even more important when it comes to trading. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/170455\/jpmorgan-binances-usdc-move-could-increase-importance-of-tether-in-crypto-trading","publishDate":"2022-09-15T13:08:28","id":4910,"type":null,"title":"JPMorgan: Binance&#x27;s USDC move could increase importance of Tether in crypto trading","category":["MARKETS"],"content":["JPMorgan Chase analysts say that Binance’s recent stablecoin decision will benefit Tether.","From Sept. 29 Binance will convert existing balances and new deposits of stablecoins USDC, USDP and TUSD to its own stablecoin, BUSD. In addition to this, it will end trading pairs for the three stablecoins against BUSD and Tether (USDT), as well as major cryptocurrencies like bitcoin and ether.","Notably, JPMorgan believes this decision will increase Tether’s importance in crypto trading.","“­­­In our opinion, this decision is likely to bolster the importance of Tether in the stablecoin universe which had been under threat by USDC,” analysts wrote in a research note on Wednesday.","The investment bank noted that Tether’s market cap share of the stablecoin ecosystem has been declining over the past 18 months. Using this as a metric the importance of the stablecoin has been dwindling, the bank argued.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/share-of-total-stablecoin-supply\/embed\" title=\"Share of Total Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Furthermore, following the collapse of the Terra blockchain in May much of TerraUSD’s – the Terra blockchain’s stablecoin – market cap share appears to have been captured by USDC and BUSD, and not Tether. This is a problem per the bank's report, but Tether's importance is not confined to its market cap.","“In our opinion, Tether’s importance is not only confined to its market cap share in the stablecoin universe but also depends on its usage, in particular in trading.”","Tether is live across eleven different blockchains, compared to USDC’s eight, while its annualized daily trading volume is also much higher than USDC – or even bitcoin and ether. The research report went on to say that Tether’s average daily trading volume is ten times that of USDC.","","","Based on these reasons and more, JPMorgan analysts see Tether’s importance increasing following the Sept. 29 conversion. The bank also noted that BUSD will become more importance, earmarking its new fee structure.","“Binance has now introduced zero maker fees applied to all BUSD trading pairs and also made USDT\/BUSD trade with zero taker fees, according to their website.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USDC","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Sept. 29","content":"DATE"},{"type":"Terra","content":"ORGANIZATION"}],"hashtag":["JPMORGAN","TETHER","USDC"],"authors":["Adam Morgan McCarthy","The Block"]}