{"summary":"The new hire would &quot;develop and write new policies, standards, guidelines, and procedures for the firm&quot; in the EU.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/238002\/binance-seeks-european-policy-officer-amid-setbacks-in-france-netherlands","publishDate":"2023-07-05T18:04:54","id":4913,"type":null,"title":"Binance seeks European policy officer amid setbacks in France, Netherlands","category":["COMPANIES"],"content":["Crypto behemoth Binance is seeking a new policy officer for its European operations, following a number of major setbacks on the continent.&nbsp;","The new hire would \"develop and write new policies, standards, guidelines, and procedures for the firm,\" a recent job advertisement <a href=\"https:\/\/g.co\/kgs\/hWyaqp\" data-v-f87c67ca=\"\">notes<\/a>.&nbsp;","The past few weeks have been complicated for the exchange in the region, with media in France reporting that the company is under investigation by authorities in the country. Binance confirmed that authorities visited its offices in June.&nbsp;","In the UK, the country's financial watchdog said in June that its local division was not permitted to offer services in the country. The company also announced its departure from the Netherlands last month after it was unable to secure a license from the country's central bank.&nbsp;","The new policy hire will be tasked with articulating \"complex information clearly and persuasively.\"&nbsp;","The global exchange has a number of international job ads posted, including one for a government affairs associate director in Spain and compliance director in Thailand.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"UK","content":"ORGANIZATION"},{"type":"France","content":"LOCATION"},{"type":"last month after","content":"DATE"},{"type":"Thailand","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"the Netherlands","content":"LOCATION"},{"type":"Spain","content":"LOCATION"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}