{"summary":"THORChain&#x27;s native token RUNE spikes on news that it&#x27;s finally moved to mainnet after four years of development.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/154003\/rune-token-spikes-11-as-thorchain-moves-to-mainnet-after-four-years","publishDate":"2022-06-24T06:12:51","id":4914,"type":null,"title":"RUNE token spikes 11% as THORChain moves to mainnet after four years","category":["MARKETS"],"content":["<span data-v-f87c67ca=\"\">RUNE, the native token of THORChain, was up more than 11% on Friday as the non-custodial decentralized exchange (DEX) made its move to mainnet.<\/span>","<span data-v-f87c67ca=\"\">After four years of development, THORChain has successfully launched its mainnet on seven different networks. THORChain enables decentralized exchanges and its users to move assets across blockchains seamlessly. At present there is a little more than <\/span><a href=\"https:\/\/thorchain.live\/thorchain\/chaosnet\/network\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$300 million in total value locked<\/span><\/a><span data-v-f87c67ca=\"\"> (TVL) on its network.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">RUNE was trading at $2.20 according to CoinGecko at the time of writing, having spiked as high as $2.25 on some exchanges earlier in the day. This represents an increase of 11.6% in the past 24 hours, up from $1.97.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The DEX’s native token had fallen below $2 on June 13 as the broader crypto market was in tumult following crypto lending platform Celsius halting withdrawals. Today’s move sees it recover all of its losses from the past 11 days.&nbsp;<\/span>","","","<span data-v-f87c67ca=\"\">The DEX is the only network currently capable of facilitating decentralized swaps between multiple networks without smart contract capabilities. According to THORChain it does this without compromising security of self-custody.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Chad Barraford, technical lead at THORChain, spoke with The Block last week to discuss the move to mainnet. He stressed that, despite the peer-to-peer nature of crypto, most trades take place using a centralized exchange, so the long-term goal for THORChain is to support decentralized, peer-to-peer finance.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">THORChain solves this issue by running liquidity pools between chains. This means it doesn’t depend on wrapping, which is centrally controlled through smart contracts and exposes users to counter-party risk, according to some critics.&nbsp;<\/span>","<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">The platform currently supports swaps across seven different networks, including Bitcoin, Ethereum, Binance, Dogecoin, Litecoin, Bitcoin cash and RUNE, its native token.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Still, the network has been the victim of several hacks. Notably, a hacker took <\/span><a href=\"https:\/\/www.theblock.co\/post\/112308\/thorchain-suffers-8-million-loss-by-hacker-wanting-to-teach-lesson\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$8 million from THORChain<\/span><\/a><span data-v-f87c67ca=\"\"> in July 2021 — which represented about 8% of the platform's funds at the time.&nbsp;<\/span><span data-v-f87c67ca=\"\">The move to mainnet may help enhance its security to avoid future attacks. <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Binance","content":"LOCATION"},{"type":"8%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Dogecoin","content":"LOCATION"},{"type":"$2.20","content":"MONEY"},{"type":"11.6%","content":"PERCENT"},{"type":"11%","content":"PERCENT"},{"type":"$8 million","content":"MONEY"},{"type":"$2","content":"MONEY"},{"type":"Chad Barraford","content":"PERSON"},{"type":"$2.25","content":"MONEY"},{"type":"DEX","content":"ORGANIZATION"},{"type":"$1.97","content":"MONEY"},{"type":"RUNE","content":"ORGANIZATION"},{"type":"Litecoin","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"$300 million","content":"MONEY"},{"type":"July 2021","content":"DATE"},{"type":"June 13","content":"DATE"},{"type":"Bitcoin","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["CROSS-CHAIN SWAPS"],"authors":["Adam Morgan McCarthy","The Block"]}