{"summary":"Over the past 24 hours, the amount of ether staked exceeded that of ether withdrawn for the first time since Ethereum&#x27;s Shapella upgrade made withdrawals possible.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/226792\/staked-ether-deposits-surpass-withdrawals-shapella","publishDate":"2023-04-18T06:23:20","id":4919,"type":null,"title":"Staked ether deposits surpass withdrawals for the first time since Shapella upgrade","category":["LAYER 1S"],"content":["The surge in outflows of staked ether seen after <a href=\"https:\/\/www.theblock.co\/post\/226036\/ethereum-shapella-upgrade-goes-live\" data-v-f87c67ca=\"\">Ethereum's Shapella upgrade<\/a> enabled withdrawals for the first time has stopped after less than a week, with traders once again staking more ether than they're unlocking.&nbsp;","Over the past 24 hours, nearly 95,000 ETH was deposited and just over 27,000 ETH was <a href=\"https:\/\/query.nansen.ai\/public\/dashboards\/Hk93n66vsO0uvycfui8ypF2xcpNhpraxfwX5AWZJ\" data-v-f87c67ca=\"\">withdrawn<\/a>, creating a net positive flow of almost 68,000 ETH, according to data provider Nansen.&nbsp;","<span data-v-f87c67ca=\"\">Ethereum staking deposits have recently exceeded withdrawals. Source: Nansen<\/span>","Even so, the total amount of ether pending withdrawal remains just under $2 billion in value at nearly 927,000 ETH. That's down approximately $1 billion from its post-Shanghai high of <a href=\"https:\/\/www.theblock.co\/post\/226546\/ethereum-pending-withdrawals-bullish-event-shapella\" data-v-f87c67ca=\"\">over $3 billion<\/a>.","Daily, $61.6 million in ether is being <a href=\"https:\/\/token.unlocks.app\/ethereum-shanghai\" data-v-f87c67ca=\"\">withdrawn<\/a>, according to data from token.unlocks.","<span data-v-f87c67ca=\"\">Ether withdrawals have generally trended downward. Source: token.unlocks<\/span>","Early outflows of staked ether have been slower than expected, according to Grayscale's Matt Maximo and Michael Zhao.","Though the analysts claim that withdrawals may continue to grow in the short term, they also noted that withdrawals do not necessarily indicate an intent to sell. Instead, users may rotate their withdrawn ether to different validators or staking providers.","\"We believe that the short-term price impact from the Shanghai upgrade will be less severe than initially anticipated, attributable to the lower number of ETH withdrawals and full exits,\" they added. \"Looking ahead, we think this is a bullish event for Ethereum, as reducing staking risks could boost the baseline demand for ETH.\"","Indeed, the price of ether has broadly increased alongside Ethereum's Shanghai upgrade. It is currently trading above $2,100.","<span data-v-f87c67ca=\"\">The price of ether has increased alongside Ethereum's Shapella upgrade. Source: TradingView<\/span>","The Shapella update for Ethereum — the first significant modification since the protocol shifted away from the energy-intensive proof-of-work consensus mechanism with last year's Merge — was activated shortly before 6:30 p.m. EDT on April 12 at block height 6209536.","In addition to allowing for the withdrawal of staked ether, it also optimized gas fees for certain transactions.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/beacon-chain-deposits-withdrawals\/embed\" title=\"Beacon Chain Deposits &amp; Withdrawals\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Matt Maximo","content":"PERSON"},{"type":"$3 billion","content":"MONEY"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"TradingView","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"6:30 p.m. EDT","content":"TIME"},{"type":"2023","content":"DATE"},{"type":"Michael Zhao","content":"PERSON"},{"type":"April 12","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"$2,100","content":"MONEY"},{"type":"Nansen","content":"ORGANIZATION"},{"type":"$61.6 million","content":"MONEY"},{"type":"Shanghai","content":"LOCATION"},{"type":"$2 billion","content":"MONEY"}],"hashtag":["ETHEREUM"],"authors":["Adam James","The Block"]}