{"summary":"The SEC has sued Ripple and two executives alleging that XRP is a security\nSince then, several exchanges, market makers, OTC desks and payment processors have announced their plans to either fully delist XRP or only limit activity to non-U.S. customers\nSome exchanges (FTX, OKEx, Liquid, Huobi) are way less reliant on XRP volume than others (Bitstamp, Bitbank, Bitso)\nMore delistings are coming in the next few weeks","author":["Larry Cermak","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/89350\/looking-at-the-effect-of-potential-xrp-delistings-on-exchanges","publishDate":"2020-12-28T07:00:43","id":492,"type":null,"title":"Looking at the effect of potential XRP delistings on exchanges","category":["Cryptocurrency"],"content":["Last week, the SEC filed a lawsuit against Ripple, CEO Brad Garlinghouse, and co-founder Chris Larsen for conducting a $1.3 billion unregistered securities sale. <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.sec.gov\/litigation\/complaints\/2020\/comp-pr2020-338.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.sec.gov\/litigation\/complaints\/2020\/comp-pr2020-338.pdf\" data-v-f87c67ca=\"\">The complaint<\/a> also alleges that Ripple distributed billions of XRP in exchange for non-cash consideration, such as labor and market-making services. Moreover, Garlinghouse and Larsen purportedly personally sold $600 million worth of XRP.","Garlinghouse <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.theblockcrypto.com\/linked\/88822\/ripple-says-it-will-be-sued-by-sec-report\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.theblockcrypto.com\/linked\/88822\/ripple-says-it-will-be-sued-by-sec-report\" data-v-f87c67ca=\"\">said Ripple plans to fight<\/a> the case and reiterated that he believes the SEC Chairman Jay Clayton is “picking winners.” Later, he said that “the legal process will unfold from here and the world will have a much more robust and complete picture of the facts soon.”","In a <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/ripple.com\/insights\/the-secs-attack-on-crypto-in-the-united-states\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/ripple.com\/insights\/the-secs-attack-on-crypto-in-the-united-states\/\" data-v-f87c67ca=\"\">letter to employees<\/a> just prior to the complaint being public, Garlinghouse said that Ripple had had numerous discussions with the SEC over the last three years around why XRP is a currency and not a security and complained that they have never been met with clarity. Moreover, Garlinghouse claimed that he and Larsen were offered to settle with the SEC but turned down the option to “prove our case.”","Garlinghouse said that XRP can’t be a security because holders do not share in the profits or receive dividends, nor do they have voting rights or other corporate rights. He also said that XRP’s value had not been correlated with Ripple’s activities but rather to the movement of other virtual currencies.","While Ripple has shareholders that hold equity in the company, selling XRP has generated the vast majority of Ripple’s revenue.&nbsp;","When asked about the company’s business model, Ripple’s CTO David Schwartz <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/forum.ripple.com\/viewtopic.php?f=1&amp;t=1196\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/forum.ripple.com\/viewtopic.php?f=1&amp;t=1196\" data-v-f87c67ca=\"\">responded in 2013<\/a>: <em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">“We promote and develop Ripple into a massive and successful open source, decentralized payment system. <\/em><strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\"><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Our source of revenue is the sale of XRP.<\/em><\/strong><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">”<\/em>","In an interview in 2014, Chris Larsen <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/paymentweek.com\/2014-4-14-digging-deeper-with-ripple-the-internet-of-money-4534\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/paymentweek.com\/2014-4-14-digging-deeper-with-ripple-the-internet-of-money-4534\/\" data-v-f87c67ca=\"\">said<\/a>:<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\"> “Therefore as the protocol grows, since there’s a limited amount of XRP, <\/em><strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\"><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">the value of XRP should go up<\/em><\/strong><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">, because it’s in demand by market makers.”<\/em>","Moreover, the revenue from selling XRP is further used to increase the value of Ripple. Schwartz <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.reddit.com\/r\/XRP\/comments\/7mhsdo\/difficult_question_about_xrp\/dru9dxi\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.reddit.com\/r\/XRP\/comments\/7mhsdo\/difficult_question_about_xrp\/dru9dxi\/\" data-v-f87c67ca=\"\">said in 2017<\/a>: <em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">“<\/em><strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\"><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">The higher the price of XRP, the more money Ripple makes by selling XRP<\/em><\/strong><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">, the more money Ripple is worth, the more power Ripple has to incentivize partners, and so on.”&nbsp;<\/em>","Since 2016, Ripple has sold $1.29 billion worth of XRP — 58% to cryptocurrency exchanges directly (which then sold to retail investors) and 52% to institutions through OTC.","<span data-v-f87c67ca=\"\">Source: Ripple, The Block Research<\/span>","Ripple has sold the most XRP, by far, in Q2 2019 and has since stopped selling as much as before even when markets have been doing better. In fact, there have been no sales to cryptocurrency exchanges since Q4 2019. This was very likely instated to not appear like selling directly to retail customers but rather only to institutions.","<span data-v-f87c67ca=\"\">Source: Ripple, The Block Research<\/span>","In June and November 2019, Ripple made equity investments in MoneyGram, totaling $50 million in exchange for its stock and a seat on its Board of Directors. Ripple currently holds approximately 9% of MoneyGram’s publicly-traded stock.","According to its earnings reports, Ripple has paid out $52.3 million in XRP incentives to MoneyGram since 2019. MoneyGram categorizes these payouts as “market development fees” rather than revenue. The firm gets paid based on the transaction volume it processes via a product that utilizes XRP for settlements.","Since the SEC’s lawsuit became public, several exchanges, market makers, OTC desks and payment processors have announced their plans to either fully delist XRP or only limit activity to non-U.S. customers.","Crypto asset manager Bitwise <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.bitwiseinvestments.com\/resources\/press-releases\/bitwise-10-crypto-index-fund-otcqx-bitw-has-liquidated-its-position-in-xrp\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.bitwiseinvestments.com\/resources\/press-releases\/bitwise-10-crypto-index-fund-otcqx-bitw-has-liquidated-its-position-in-xrp\" data-v-f87c67ca=\"\">has liquidated the XRP position<\/a> of its index fund. XRP had a share of 3.8% in Bitwise’s crypto index fund before liquidation. Today, Europe-focused crypto asset manager 21Shares also removed XRP from all of its ETP products, saying that its rules prohibit “any token that’s a security and any token that might have liquidity issues.”","Payment processor Simplex <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.theblockcrypto.com\/linked\/89134\/simplex-bars-xrp-transactions-in-wake-of-secs-ripple-lawsuit\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.theblockcrypto.com\/linked\/89134\/simplex-bars-xrp-transactions-in-wake-of-secs-ripple-lawsuit\" data-v-f87c67ca=\"\">has begun blocking XRP transactions<\/a> for all customers. Simplex allows users to purchase cryptocurrency with credit cards on a variety of platforms using the Simplex integration, including Binance, Huobi, KuCoin, and BitPay, among others.","Two of the largest market makers, Jump Trading, Galaxy Digital, <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.theblockcrypto.com\/linked\/89303\/b2c2-xrp-trading-halt-us-counterparties\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.theblockcrypto.com\/linked\/89303\/b2c2-xrp-trading-halt-us-counterparties\" data-v-f87c67ca=\"\">have stopped making markets in XRP<\/a>, which will likely result in widening spreads. B2C2, an OTC market maker that was recently acquired by SBI, <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.theblockcrypto.com\/linked\/89303\/b2c2-xrp-trading-halt-us-counterparties\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.theblockcrypto.com\/linked\/89303\/b2c2-xrp-trading-halt-us-counterparties\" data-v-f87c67ca=\"\">halted the trading<\/a> of XRP with U.S.-based counterparties.","Four cryptocurrency exchanges have so far announced the full or partial delistings — <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/crosstower.com\/insights\/xrp-removal-notice\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/crosstower.com\/insights\/xrp-removal-notice\/\" data-v-f87c67ca=\"\">CrossTower<\/a> (only U.S. customers), <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/twitter.com\/BeaxyExchange\/status\/1341515639089999882?s=20\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/twitter.com\/BeaxyExchange\/status\/1341515639089999882?s=20\" data-v-f87c67ca=\"\">Beaxy Exchange<\/a>, <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/twitter.com\/osldotcom\/status\/1341660658123751425\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/twitter.com\/osldotcom\/status\/1341660658123751425\" data-v-f87c67ca=\"\">OSL<\/a>, and most notably <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.bitstamp.net\/article\/xrp-trading-and-deposits-be-halted-us-customers\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.bitstamp.net\/article\/xrp-trading-and-deposits-be-halted-us-customers\/\" data-v-f87c67ca=\"\">Bitstamp<\/a> (only U.S. customers).","Despite its unclear regulatory status, Ripple has always made it a top priority and had dedicated resources to have XRP listed on top exchanges. According to the SEC’s complaint, Ripple offered to cover implementation costs, pay rebates, and make intros to large holders for custody. When constantly failing to list on an undisclosed exchange (although it’s strongly implied it’s Coinbase), a Ripple executive sent an email to the founders that said: “Does a $1M cash payment move the needle for a Q3 listing?”","Following the SEC’s lawsuit, Bitstamp was the first major exchange to make its move regarding XRP. The exchange announced that it would halt all trading and deposits of XRP for all U.S. customers starting from January 8. There are still four large fiat-to-crypto exchanges serving U.S. clients that have yet to release a statement regarding XRP — Coinbase, Kraken, Bittrex, and Binance US.","There are currently basically three options for those exchanges:","So why haven’t these exchanges done anything yet? Mainly it’s an important decision that could have large implications on the business. The vast majority of the revenue of any exchange is generated from trading fees and given that XRP generates 5–20% of the total volume depending on each exchange, a full delisting could cut the total revenue by at least 5%.","Bitstamp, which primarily focuses on the European market, generated 18.5% of the total volume in 2020 from trading XRP. This could also explain why it has decided to take the less drastic step and only blocks U.S. customers from trading XRP for now. Japanese exchange Bitbank and Mexican exchange Bitso generate the highest relative volume from all major exchanges — 35.0% and 50.8% respectively. Bitso is very reliant on XRP's volume due to being a prominent Ripple partner that facilitates payment corridors between Mexico, the United States, and Argentina.","<span data-v-f87c67ca=\"\">Source: CryptoCompare, The Block Research<\/span>","The least reliant exchanges on XRP trading are FTX, OKEx, Liquid, Huobi, Bittrex, Binance, Bitfinex, and Kraken. Nonetheless, XRP volume was still from 1–7% of their total volumes.","For exchanges targeting U.S. clients, there is an expectation that they would act within a reasonable turnaround time to prepare a communication plan as well as to roll out a customer support plan to cause minimum disruption. But standing up to the SEC and continuing to list an asset, which is now clearly considered a security, would be unwise. It would be silly to think that Coinbase, which has recently submitted a confidential S-1 to go public, would want to clash with the SEC.","For exchanges that are not targeting U.S. clients, any decision will likely take longer since they are not under any pressure yet. However, it's not unprecedented that securities regulatory authorities in other jurisdictions follow the SEC's footsteps. A similar decision can quickly follow in South Korea, Japan, Singapore, Hong Kong, and in the EU.","The lawsuit will likely drag on for months and perhaps years, but it’s now crystal clear that the XRP market will be greatly affected regardless of the outcome. Significant asset managers are liquidating their positions, large market makers are no longer providing liquidity, and exchanges targeting U.S. clients will very likely delist XRP in the coming weeks and months."],"hashtag":["SEC","XRP"]}