{"summary":"The cryptocurrency market could see an uptick in activity from institutional finance in 2024, according to analysts.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265684\/institutional-investors-poised-for-increased-crypto-activity-in-2024-analysts-say","publishDate":"2023-12-25T12:01:20","id":4920,"type":null,"title":"Institutional investors poised for increased crypto activity in 2024, analysts say","category":["MARKETS"],"content":["Institutional investors will take a more active interest in the cryptocurrency sector in 2024, according to analysts from three crypto exchanges and a crypto lending platform. This will be driven by the potential approval of a <a href=\"https:\/\/www.theblock.co\/post\/264801\/bitcoin-spot-etf-anticipation-fuels-largest-crypto-fund-inflows-for-two-years\" data-v-f87c67ca=\"\">spot bitcoin ETF<\/a>, expected U.S. Federal Reserve rate cuts, and greater regulatory clarity, they said.","This is a trend that has already started. Data from the <a href=\"https:\/\/www.theblock.co\/post\/259136\/deribit-open-interest-ath-bitcoin-rally-crypto-derivatives\" data-v-f87c67ca=\"\">Deribit derivatives exchange<\/a> shows an uptick in activity from institutional investors since October 2023. According to Deribit Chief Commercial Officer Luuk Strijers, the data suggests that more experienced participants from traditional markets are positioning themselves for more involvement in the market in 2024.","“Since late October, there's been a noticeable uptick in institutional activity, largely driven by the anticipation surrounding the potential ETF news expected in January and strategic positioning by clients for this event,” Luuk told The Block.","The primary catalyst cited by Bitfinex analysts for increased involvement from traditional finance incumbents will come in the form of a spot bitcoin ETF approval. Asset managers such as <a href=\"https:\/\/www.theblock.co\/post\/258041\/blackrocks-spot-bitcoin-etf-appears-on-dtcc-website-with-ticker-ibtc\" data-v-f87c67ca=\"\">Blackrock<\/a>, Fidelity, Valkyrie, and ARK Invest are vying for approval of the first-ever spot bitcoin ETF filing from the <a href=\"https:\/\/www.theblock.co\/post\/264162\/sec-just-met-with-grayscale-for-spot-bitcoin-etf-listing-memo-shows\" data-v-f87c67ca=\"\">U.S. Securities and Exchange Commission<\/a>. The approval of such a financial instrument would give institutional investors a regulated way to bet on the price of the world's biggest cryptocurrency.","“The potential approval of an Ark Invest spot bitcoin ETF in January could be a significant driver for bitcoin's appreciation, as it would provide a regulated and more accessible investment vehicle for both retail and institutional investors,\" Bitfinex analysts told The Block.","They claimed a spot bitcoin ETF approval could come as early as the first month of the new year. \"Predictions are being made for a spot bitcoin ETF being approved by January 10, 2024,” analysts said. They added that this forecast is based on the recent amendment to ARK Invest’s spot bitcoin ETF application, which includes additional risk disclosures.","Bitfinex analysts suggested that potential interest rate cuts in 2024 would embolden institutional investors with a risk-on sentiment. This enhanced appetite for risk assets could eventually find its way to bitcoin, seen as the gateway asset into the whole cryptocurrency sector. “A rate cut situation could make risk assets like bitcoin more attractive to institutional investors seeking higher returns in a lower interest rate environment,” Bitfinex analysts added.","Market indicators are signaling a rate pause at the next <a href=\"https:\/\/www.theblock.co\/post\/252066\/bitcoins-price-is-flat-as-federal-reserve-keeps-interest-rates-unchanged\" data-v-f87c67ca=\"\">Federal Open Market Committee<\/a>, FOMC, meeting on December 13, and a rate cut in the spring of 2024, analysts said. “The anticipation of such a pause has already influenced bond yields and trader expectations, with rate cuts being priced in starting from May 2024,” Bitfinex added.","YouHodler Risk Manager Sergei Gorev told The Block the market expects softened rhetoric on rate hikes from the U.S. Federal Reserve. “The futures and options market is already laying a decrease in interest rates,” he noted.","According to Bitfinex, investors will be encouraged by more regulatory clarity in the new year. Foremost in terms of regulatory clarity would be the approval of a spot bitcoin ETF, which would “provide a regulated and more accessible investment vehicle for both retail and institutional investors,” Bitfinex analysts said.","Bittrex Global CEO Oliver Linch told The Block that 2024 is poised to become the year when global jurisdictions commence the process of clarifying their regulations for the digital asset space. Linch outlined several regulatory actions anticipated in 2024. He mentioned the EU's <a href=\"https:\/\/www.theblock.co\/post\/189568\/mica-would-have-limited-impact-on-ftx-breakdown-says-mep-ondrej-kovarik\" data-v-f87c67ca=\"\">MiCA legislation<\/a>, which is already slated to come into full effect by the end of the year. Additionally, he emphasized significant regulatory advancements in Singapore, Hong Kong, and Japan.","He also noted the UK's initiative to launch its <a href=\"https:\/\/www.theblock.co\/post\/264389\/uk-finance-minister-announces-legislation-to-boost-the-nations-digital-asset-sector\" data-v-f87c67ca=\"\">Digital Securities Sandbox (DSS)<\/a>. \"Governments are finally realizing that becoming a crypto hub means attracting institutions and that they cannot execute on nice speeches and political aspirations, only on concrete, robust, fit-for-purpose rules,” he said.","Factors such as the potential approval of a spot bitcoin ETF, anticipated U.S. Federal Reserve rate cuts, and increased regulatory clarity could contribute to a favorable environment, enticing institutional investors to take a more active role in the evolving crypto landscape. However, the factors that could drive more institutional activity in the cryptocurrency sector are dependent on uncertain macroeconomic conditions. Some analysts have also raised the possibility of a recession and a more extended period of monetary tightening by the U.S. Federal Reserve.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Digital Securities Sandbox (DSS","content":"ORGANIZATION"},{"type":"January 10, 2024","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Luuk Strijers","content":"PERSON"},{"type":"October 2023","content":"DATE"},{"type":"Blackrock","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"December 13","content":"DATE"},{"type":"spring of 2024","content":"DATE"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Bitfinex","content":"LOCATION"},{"type":"May 2024","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Federal Open Market Committee","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Valkyrie","content":"LOCATION"},{"type":"Japan","content":"LOCATION"},{"type":"Oliver Linch","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"FOMC","content":"ORGANIZATION"},{"type":"Sergei Gorev","content":"PERSON"},{"type":"October","content":"DATE"}],"hashtag":["ASIAN REGULATION","BOE","CRYPTO MOVERS","ECB","ECONOMIC INDICATORS","EUROZONE REGULATION","FCA","FEDERAL RESERVE","RATE DECISIONS","SEC","TREASURY DEPARTMENT","UK PARLIAMENT"],"authors":["Brian McGleenon","The Block"]}