{"summary":"Consensys, the Ethereum developer behind MetaMask, has held talks with investors about a potential capital injection over the summer.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239603\/ethereum-consensys-investor-talks","publishDate":"2023-07-17T06:00:26","id":4922,"type":null,"title":"Consensys says it has &#x27;ample cash&#x27; amid whispers of investor talks","category":["DEALS"],"content":["Consensys, the Ethereum developer behind MetaMask, held talks with investors over the summer about a potential capital injection. But the company insists it doesn’t need money and isn’t actively fundraising.","The blockchain firm has met with multiple investors about fundraising in recent weeks, according to four people familiar with the matter.","Consensys last raised capital in early 2022 in a $450 million Series D round led by ParaFi Capital that valued the startup at $7 billion. Deep-pocketed backers like SoftBank Vision Fund 2, Temasek and Microsoft also participated.","A Consensys spokesperson brushed off the talks, stating that while the startup sometimes considers “inbound investor interest,” it still has plenty of cash.","“Consensys has been widely perceived as the winner after the debacles of 2022,” the spokesperson said.","“Consequently, the company has experienced a significant influx of inbound investor interest, fueled in part by inaccurate reporting on the secondary market activity in our stock earlier this year,” the spokesperson continued, adding that the company doesn’t need money and is “not actively engaged in a formal process.”&nbsp;","Asked about those inaccuracies, the spokesperson clarified that secondary markets represent “a tiny fraction” of transactions in Consensys stock.&nbsp;","News of the talks comes after a period in which the shares of numerous highly valued, privately held crypto startups — Consensys among them — have&nbsp;<a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/www.theblock.co\/post\/217937\/opensea-consensys-among-prized-crypto-startups-with-shares-available-at-big-discounts\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.theblock.co\/post\/217937\/opensea-consensys-among-prized-crypto-startups-with-shares-available-at-big-discounts\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">traded at significant discounts<\/a>&nbsp;on secondary market platforms.&nbsp;","Two of the people familiar with Consensys’s recent funding discussions said that any resulting raise would be a “down round,” valuing the firm at less than $7 billion. Consensys again dismissed that claim.","“Consensys is highly capitalized and has demonstrated strong performance across all areas year to date,” the company spokesperson said. “Therefore, our existing shareholders have no intention of accepting any dilution on terms inferior to our Series D. Any claims suggesting engagement with the company regarding discussions of a down round would be providing you with inaccurate information and may be an attempt to negotiate via the press on their part.”&nbsp;","They added that Consensys has, in fact, been making use of its capital to hoover up its own shares.","“The company has ample cash, believes nearly all of the proposed secondary transactions we have been given notice of this year significantly undervalued the company and have been exercising our right of first refusal on them, accordingly,” the spokesperson said.","Consensys has developed half a dozen core products, all aimed at widening access to the Ethereum ecosystem. Crypto wallet MetaMask and Infura, the developer platform, are its flagship tools. It recently <a href=\"https:\/\/www.theblock.co\/post\/238865\/consensys-linea-layer-2\" data-v-f87c67ca=\"\">unveiled a Layer 2 network<\/a> called Linea, which aims to make Ethereum transactions up to 15 times cheaper.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$7 billion","content":"MONEY"},{"type":"$450 million","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"SoftBank","content":"ORGANIZATION"},{"type":"Temasek","content":"ORGANIZATION"},{"type":"summer","content":"DATE"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}