{"summary":"Coinbase entered into an agreement to buy a company holding a Mifid II license, a step to start offering crypto derivatives in the EU.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/270730\/coinbase-plans-acquisition-to-expand-derivatives-offering-in-eu","publishDate":"2024-01-05T18:18:54","id":4926,"type":null,"title":"Coinbase plans acquisition to expand derivatives offering in EU","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">Coinbase said Friday that it is in the process of acquiring a MiFID-licensed entity to expand its derivatives offering in the EU.<\/span>","<span data-v-f87c67ca=\"\">The deal is subject to regulatory approval and could close later in 2024, it said in a <a href=\"https:\/\/www.coinbase.com\/blog\/exploring-licensing-to-expand-trusted-compliant-access-to-derivatives-in-the\" data-v-f87c67ca=\"\">blog post<\/a>. <\/span><span data-v-f87c67ca=\"\">The name of the company, which is based in Cyprus, is unknown.<\/span>","<span data-v-f87c67ca=\"\">The license will allow Coinbase to offer cryptocurrency-based derivatives in Europe. The exchange currently only offers spot trading in the EU.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"Adding such a license to our international portfolio would further support the strong interest we’ve seen in our derivatives offerings and help us capture more of the ~75% of the global crypto market claimed by derivatives,\" Coinbase said.<\/span>","<span data-v-f87c67ca=\"\">The purchase is subject to regulatory approval and Coinbase has \"a long road ahead before finalizing” it, the company added.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Coinbase","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"75%","content":"PERCENT"},{"type":"Friday","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Cyprus","content":"LOCATION"},{"type":"Europe","content":"LOCATION"}],"hashtag":["EUROZONE REGULATION"],"authors":["Anna Baydakova","The Block"]}