{"summary":"Nigeria&#x27;s eNaira, the world&#x27;s second central bank digital currency, hasn&#x27;t been widely adopted by Nigerians thus far.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281014\/nigerias-central-bank-partners-with-gluwa-to-drive-cbdc-adoption-following-binance-spat","publishDate":"2024-03-07T07:50:02","id":4927,"type":null,"title":"Nigeria&#x27;s central bank partners with Gluwa to drive CBDC adoption following Binance spat","category":["THE BLOCK"],"content":["The Central Bank of Nigeria is teaming up with blockchain credit infrastructure company Gluwa to promote the adoption of <a href=\"https:\/\/www.cbn.gov.ng\/currency\/enaira.asp\" data-v-f87c67ca=\"\">eNaira<\/a>, its <a href=\"https:\/\/www.theblock.co\/learn\/251860\/what-is-a-cbdc-a-beginners-guide-to-central-bank-digital-currencies\" data-v-f87c67ca=\"\">central bank digital currency (CBDC)<\/a>, the company announced today.&nbsp;","Gluwa hopes to drive adoption by introducing its Credal technology to the eNaira, which powers loans on the real-world asset oriented Creditcoin blockchain developed by the company. Now, when users transact using the eNaira, they will also build a decentralized credit profile independent of any financial institution or national borders, according to the company.","\"Gluwa sets its high ambitions of onboarding millions of Nigerians by implementing its Credal technology to build credit reputations for eNaira users as a valuable new way to drive the adoption of the CBDC,\" the company's press release reads.&nbsp;","Gluwa also hopes to use its new position as a partner agent of Nigeria's central bank to foster adoption by working with lenders and fintech partners to facilitate direct eNaira transfers to customers and establish the eNaira as the definitive record for loans, the company added.&nbsp;","Nigeria launched the eNaira in October 2021, the <a href=\"https:\/\/www.bis.org\/publ\/bppdf\/bispap128.pdf\" data-v-f87c67ca=\"\">world's second such currency<\/a>. However, the eNaira has <a href=\"https:\/\/techcabal.com\/2023\/07\/13\/enaira-blockchain-currency-low-adoption\/\" data-v-f87c67ca=\"\">struggled with adoption<\/a>, even following devastating cash shortages and a recent spat over <a href=\"https:\/\/www.theblock.co\/post\/280577\/binance-nigeria-naira-support\" data-v-f87c67ca=\"\">Binance's operations<\/a> in the country. The IMF, in a <a href=\"https:\/\/www.imf.org\/en\/Publications\/WP\/Issues\/2023\/05\/16\/Nigerias-eNaira-One-Year-After-533487\" data-v-f87c67ca=\"\">report<\/a> reflecting on the first year of the eNaira's launch, noted that the digital currency had 24\/7 uptime but struggled with \"disappointingly low\" public adoption, with only 1.5% of wallets engaging in transactions weekly.&nbsp;","The announcement comes nearly eight months after Nigeria's central bank <a href=\"https:\/\/x.com\/cenbank\/status\/1684100272157597697?s=20\" data-v-f87c67ca=\"\">declared<\/a> it would amend the current eNaira model to \"ensure an increase in the volume and activity of wallet holders.\" However, Nigeria has made more news in recent weeks for its public spat with Binance, <a href=\"https:\/\/www.theblock.co\/post\/280139\/binance-10b-usd-fine-nigeria\" data-v-f87c67ca=\"\">fining the company<\/a> $10 billion and reportedly detaining two executives after the government alleged Binance, which is not authorized to operate in the country, manipulated foreign exchange rates for the naira.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Binance","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Central Bank of Nigeria","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Nigeria","content":"LOCATION"},{"type":"IMF","content":"ORGANIZATION"},{"type":"1.5%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"fintech","content":"ORGANIZATION"},{"type":"$10 billion","content":"MONEY"},{"type":"October 2021","content":"DATE"}],"hashtag":["CBDCS"],"authors":["Zack Abrams","The Block"]}