{"summary":"Michael and Amanda Griffis allegedly commingled the pool with personal funds, according to a complaint released on Tuesday. ","author":["Sarah Wynn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241323\/cftc-charges-couple-over-blessings-of-god-thru-crypto-scam","publishDate":"2023-07-25T10:41:01","id":493,"type":null,"title":"CFTC charges couple over &#x27;Blessings of God Thru Crypto&#x27; scam","category":["Policy"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Commodity Futures Trading Commission charged a couple for allegedly defrauding over 100 people with a digital assets commodity pool that had been named \"Blessings of God Thru Crypto.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Michael and Amanda Griffis, owners of a real estate company in Clarksville, Tennessee, raised over $6 million by reaching out to colleagues and customers to offer them the option to pool funds to trade digital asset commodity futures contracts<\/span><span class=\"s1\" data-v-f87c67ca=\"\">, the CFTC said on Tuesday in a <a href=\"https:\/\/www.cftc.gov\/PressRoom\/PressReleases\/8757-23\" data-v-f87c67ca=\"\">statement<\/a>.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">“The defendants falsely represented that pool funds would be safe and under their control, that pool participants could expect high gains, and that the defendants would use pool funds to trade ‘crypto futures’ on the ‘Apex Trading Platform’ with the advice of a person identified only as ‘Coach Wendy,’” the CFTC said. “As further alleged in the complaint, the defendants leveraged their personal and professional relationships, developed through their real estate business, to convince victims the pool scheme was legitimate.”<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The commodity pool claimed to give “investors the opportunity to bet on the future price of cryptocurrency,” and the couple promised “exaggerated profits” without disclosing potential risks, the agency said in the complaint.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The two allegedly commingled the pool with their personal funds.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Pool participants would transfer funds to Michael Griffis’ account, who then transferred that to his personal account on Coinbase. From there, he would convert the funds into digital asset commodities like bitcoin or Tether and transfer them to an electronic trading platform called the Apex Trading Platform to trade futures, the CFTC said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">About $855,000 was paid out to some pool participants, which the CFTC said was linked to Ponzi-style payments.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">“The defendants betrayed their pool participants, and they profited from that betrayal. Today’s filing reinforces the CFTC’s long-standing commitment to hold accountable those who take advantage of victims,” Ian McGinley, the CFTC’s director of enforcement, said in a statement.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Both Michael and Amanda Griffis operate EXIT Realty Screamin’ Eagle. The real estate firm did not immediately respond to a request for comment.&nbsp;<\/span>"],"hashtag":["CFTC"]}