{"summary":"As part of a massive product and brand overhaul, L2 Labs, the team behind ZKSwap, has announced the launch of the new comprehensive ZKSpace platform on December 20th.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/128099\/l2-labs-launches-all-in-one-layer2-platform-zkspace-featuring-zkswap-v3-0-nfts-payments","publishDate":"2021-12-22T09:00:17","id":493,"type":null,"title":"L2 Labs Launches All-in-One Layer2 Platform ZKSpace, Featuring ZKSwap v3.0, NFTs, &amp; Payments","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">As part of a massive product and brand overhaul, L2 Labs, the team behind ZKSwap, has announced the launch of the new comprehensive <\/span><a href=\"http:\/\/zks.org\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">ZKSpace<\/span><\/a><span data-v-f87c67ca=\"\"> platform on December 20th. The platform hosts an upgraded Layer 2 AMM DEX ZK-Rollups ZKSwap v3.0, an NFT minting center and marketplace called ZKSea, and payment services, ZKSquare.<\/span>","<span data-v-f87c67ca=\"\">&nbsp;<\/span><span data-v-f87c67ca=\"\">The upgrade will coincide with the official shutting down of ZKSwap v1.0 and the original PoG consensus mechanism<\/span> in due time<span data-v-f87c67ca=\"\">.<\/span>","<strong data-v-f87c67ca=\"\">ZKSpace - A Full-Featured Layer2 Platform<\/strong>","","","The all-new ZKSpace platform is comprised of three main parts: ZKSwap, ZKSquare, and ZKSea, with an all-new-look user interface, NFT support, unlimited token listing, smoother withdrawal, optimized efficiency, and multi-chain support.","Moving forward, the formula underpinning the innovative Layer 2 AMM DEX utilizing ZK-Rollups technology will feature an important change that enables more flexibility for users. When trading with stablecoins, ZKSwap v3.0 resembles the original Curve V1.0 model, but when trading between non-stablecoins, ZKSwap v3.0 will allow for adjustable-price ranges. This means users will be able to choose at which price range to lock in LPs, and in turn, avoid excess slippage for trades that drain liquidity from those ranges. Building from the Uniswap v3.0 model, ZKSwap v3.0 does this by using ERC721 LP tokens and an ‘internal oracle re-pegging mechanism’.","With the intention of providing a standard for Layer 2 NFTs, users on ZKSpace can create, mint, buy, and sell NFTs via ZKSea. This will be an important step moving forward as gas prices are inhibiting the growth of the Layer 1 NFT marketplace and raising the barrier to entry for new users. In addition, the protocol will also feature NFT Transaction Mining and NFT Liquidity Mining which will enable users to retrieve the locked liquidity of their NFT assets and gain in a percentage of transaction fees paid by other users.","Compared with the testnet, ZKSpace adds several interesting new features to its NFT product, including Likes, Collects, Add Tags\/Attributes, Share to Facebook\/Twitter, etc.","<strong data-v-f87c67ca=\"\">About ZKSwap v1.0 &amp; Proof of Gas Mining (PoG)<\/strong><br data-v-f87c67ca=\"\">\nAfter initially launching in February 2021, the innovative ZKSwap gas fee mining model served hundreds of thousands of users across its 10-month lifespan. The model allowed protocol users to enjoy zero-gas fast transactions and meant more people could try out and work with Layer 2 technologies. During this period, thousands of ETH in gas were spared at the cost of more than $10 million, providing millions as profits to users mining gas fees on the platform. This innovation was unprecedented for Layer 2 platforms and one of the key defining qualities of ZKSwap in the beginning.","With the launch of ZKSpace, the team has made the decision to stop ZKSwap v1.0 and PoG mining in due time. This means Layer 2 transactions will now incur gas fees, but these will remain low at around 1\/10th of those required for Layer 1 transitions as the platform will subsidize a percentage of the fee.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAfter the PoG mining contract stops producing ZKS, users’ assets in the smart contract will still remain intact and can be withdrawn at any time. Of the remaining ZKS to be distributed by the PoG smart contract, this will be mined via other methods to incentivize the further development of the Layer 2 ecosystem.","<strong data-v-f87c67ca=\"\">Stay Tuned<\/strong><br data-v-f87c67ca=\"\">\nWith more updates to be announced in the coming days and weeks, stay tuned to @ZKSpaceOfficial on Twitter or join the official Telegram group chat for further details about ZKSpace.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Twitter","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"NFT Liquidity Mining","content":"ORGANIZATION"},{"type":"February 2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"December 20th","content":"DATE"},{"type":"NFT Transaction Mining","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"}],"hashtag":[],"authors":["Sponsored","The Block"]}