{"summary":"Its co-founder said the funding round was meant to “align interests of liquidity providers” rather than raise capital.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273294\/woo-x-fundraise-improve-liquidity","publishDate":"2024-01-18T03:46:20","id":4935,"type":null,"title":"Crypto exchange WOO X raises $9 million to improve liquidity","category":["VENTURE CAPITAL"],"content":["<span data-v-f87c67ca=\"\">Crypto exchange WOO X has secured $9 million in its latest funding round from investors including crypto market maker Wintermute, the company said.<\/span>","<span data-v-f87c67ca=\"\">In a statement shared with The Block, WOO said it has received fresh funding from its designated market makers, with participation from Wintermute, Selini Capital, Time Research, Presto Labs, Pulsar, AlphaLab Capital, Efficient Frontier, Amber and Riverside Hedge.<\/span>","<span data-v-f87c67ca=\"\">“We are thrilled to share the expanded relationship of market makers on WOO X, following the launch of our DMM program in August last year,” Jack Tan, co-founder of WOO, said in the statement. “We anticipate liquidity on WOO X to improve substantially in the next few months, starting with BTC and ETH perpetual futures markets and expanding into altcoin perpetual futures and all spot markets.”<\/span>","<span data-v-f87c67ca=\"\">Woo said that it revamped its business model in the third quarter of last year to partner with more liquidity providers for spot and perpetual futures markets in an attempt to “move away from a single liquidity provider, Kronos Research.”<\/span>","<span data-v-f87c67ca=\"\">In November 2023, Kronos <\/span><a href=\"https:\/\/www.theblock.co\/post\/263638\/taiwanese-trading-firm-kronos-research-hacked-for-estimated-25-million-zachxbt\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">experienced a hack<\/span><\/a><span data-v-f87c67ca=\"\"> that reportedly resulted in an estimated $25 million loss. Kronos paused all trading following the event, which at one stage led to <\/span><a href=\"https:\/\/twitter.com\/_WOO_X\/status\/1726016400894898232?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">problems<\/span><\/a><span data-v-f87c67ca=\"\"> on Woo X, the exchange that was incubated by Kronos and on which Kronos served as a key market maker.<\/span>","<span data-v-f87c67ca=\"\">WOO X has taken various actions to revamp its business model. “Some notable actions include updating its fee structure, enhancing its technology infrastructure to support many DMMs quoting simultaneously, introducing a maker rebate in USDT, and launching a DMM rewards pool to further incentivize DMMs to provide liquidity on WOO X,” the company said in the Thursday statement.<\/span>","<span data-v-f87c67ca=\"\">The exchange plans to launch a DMM program for its spot markets in the first quarter of this year. “Collectively, these initiatives will enable WOO X to achieve a 100% custody ratio by Q2 of this year,” the company added.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The company intends to use the newly raised funds for its global market expansion and obtain regulatory licenses, according to the statement. Tan noted that the main purpose of the funding was to “align interests of liquidity providers” rather than raising capital, as the round was participated by market makers that have pledged to improve liquidity on WOO X.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Wintermute","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"USDT","content":"ORGANIZATION"},{"type":"WOO X.","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Wintermute","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"August last year","content":"DATE"},{"type":"first quarter","content":"DATE"},{"type":"100%","content":"PERCENT"},{"type":"AlphaLab Capital","content":"ORGANIZATION"},{"type":"Riverside Hedge","content":"ORGANIZATION"},{"type":"$9 million","content":"MONEY"},{"type":"Kronos Research","content":"ORGANIZATION"},{"type":"Efficient Frontier","content":"ORGANIZATION"},{"type":"Time Research","content":"ORGANIZATION"},{"type":"Pulsar","content":"ORGANIZATION"},{"type":"Selini Capital","content":"ORGANIZATION"},{"type":"$25 million","content":"MONEY"},{"type":"third quarter","content":"DATE"},{"type":"Jack Tan","content":"PERSON"}],"hashtag":[],"authors":["Timmy Shen","The Block"]}