{"summary":"Pudgy Penguins is working on a raise of up to $10 million in a round that would value the project at $50 million, according to documents obtained by The Block.\nThe deal would be the latest in a string of venture capital raises by prominent NFT projects.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/182494\/pudgy-penguins-seeks-10-million-seed-round","publishDate":"2022-11-03T12:26:43","id":494,"type":null,"title":"Pudgy Penguins seeks $10 million from investors; CEO denies raising money","category":["NFTs"],"content":["Pudgy Penguins — a collection of 8,888 cartoon penguins pinned to the Ethereum blockchain — is the latest NFT collection to seek backing from venture capitalists.","The project is in talks with investors about raising up to $10 million in a seed round, based on documents obtained by The Block that include outreach to prospective investors, excerpts from a pitch deck, and a term sheet. The documents indicate that the round, if closed, would give Pudgy Penguins a $50 million valuation.","Pudgy Penguins CEO Luca Netz strongly denied that the project is raising money, however. He described The Block’s reporting as “all wrong information,” and warned he would publicly brand any story on the subject “fake news.”","Netz took over as CEO of the project after <a href=\"https:\/\/www.coindesk.com\/markets\/2022\/04\/02\/pudgy-penguins-nft-collection-looks-to-next-chapter-with-25m-sale\/\" data-v-f87c67ca=\"\">acquiring it for $2.5 million<\/a> in April. The Los Angeles-based entrepreneur previously ran a dropshipping business, according to CoinDesk. Upon taking the reins of Pudgy Penguins, he outlined plans to roll out a line of toys — and in August he tweeted <a href=\"https:\/\/twitter.com\/LucaNetz\/status\/1560314099094982656?s=20&amp;t=IEzHuF-AzAWY1GTfJbE0Kg\" data-v-f87c67ca=\"\">an image<\/a> of a prototype.","There was also speculation, at the time of the takeover, that Pudgy Penguins would ultimately launch a token — following in the footsteps of other major NFT collections like Bored Ape Yacht Club, which <a href=\"https:\/\/www.theblock.co\/linked\/138156\/apecoin-tied-to-bored-ape-nft-ecosystem-debuts-with-planned-community-airdrop\" data-v-f87c67ca=\"\">debuted ApeCoin<\/a> in March. The documents reviewed by The Block earmark April 2024 for the launch of Pudgy Penguins’ token.","The $10 million raise that is currently being touted to investors takes the form of a Simple Agreement for Future Equity (SAFE) round, with token warrants attached — a structure that has <a href=\"https:\/\/www.theblock.co\/post\/171609\/why-equity-plus-token-warrants-is-the-new-go-to-formula-for-crypto-vcs?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">become the norm<\/a> in crypto-focused venture capital.","Even as the so-called crypto winter sets in, prominent NFT projects have proven an attractive target for venture capitalists. The Block recently revealed that Chiru Labs, the outfit behind Azuki, is <a href=\"https:\/\/www.theblock.co\/post\/171617\/chiru-labs-azuki-creator-30-million-series-a-fundraise\" data-v-f87c67ca=\"\">closing in<\/a> on a $30 million raise. Doodles announced <a href=\"https:\/\/www.theblock.co\/post\/169601\/doodles-announces-54-million-raise-plots-hiring-spree\" data-v-f87c67ca=\"\">a $54 million round<\/a> in September; Moonbirds creator Proof Collective <a href=\"https:\/\/www.theblock.co\/post\/166580\/a16z-leads-50-million-in-funding-for-nft-organization-proof-collective\" data-v-f87c67ca=\"\">raised $50 million<\/a> in August; and Yuga Labs, the firm behind Bored Ape Yacht Club, led the way with <a href=\"https:\/\/www.theblock.co\/linked\/138834\/bored-apes-creator-yuga-labs-raises-450-million-in-round-led-by-a16z-report\" data-v-f87c67ca=\"\">a $450 million round<\/a> in March.","Pudgy Penguins is among the best-followed NFT projects. At the height of the NFT market, in August of last year, the collection was the subject of <a href=\"https:\/\/www.nytimes.com\/2021\/08\/12\/technology\/penguin-nft-club.html\" data-v-f87c67ca=\"\">a New York Times column<\/a>. It currently costs around 3 ETH (or $4,600) to buy a Pudgy Penguin. Since its inception, 63,664 ETH (almost $100 million) in Pudgy Penguins have changed hands on secondary markets, according to <a href=\"https:\/\/opensea.io\/collection\/pudgypenguins?search%5bsortAscending%5d=false&amp;search%5bsortBy%5d=LAST_SALE_PRICE&amp;search%5btoggles%5d%5b0%5d=BUY_NOW\" data-v-f87c67ca=\"\">OpenSea data<\/a>.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/nft-overview\/weekly-trade-volume-of-nfts\/embed\" title=\"Weekly Trade Volume of NFTs by Category\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>"],"hashtag":["PUDGY PENGUINS"]}