{"summary":"The lull in NFT trading volume appears to be over, with ethereum NFT trading volumes reaching their highest point since May 2022 last week.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215382\/nft-weekly-trading-volume-on-ethereum-rises-to-highest-level-since-may","publishDate":"2023-02-27T14:19:49","id":4944,"type":null,"title":"NFT weekly trading volume on Ethereum rises to highest level since May","category":["WEB3"],"content":["The lull in NFT activity is showing signs of subsiding with weekly trading level on Ethereum last week hitting its highest level since May, according <a href=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/nft-overview\" data-v-f87c67ca=\"\">to data<\/a> from The Block.","The spike was driven by an increase of activity on NFT marketplace Blur, which has overtaken trading volumes on rival OpenSea, according to <a href=\"https:\/\/dune.com\/sealaunch\/blur-vs-opensea\" data-v-f87c67ca=\"\">data from Dune<\/a>.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/marketplaces\/nft-marketplace-monthly-volume\/embed\" title=\"Ethereum NFT Marketplace Monthly Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The launch of Blur's native token, coupled with continued token incentives, have created a \"powerful cocktail\" that has reinvigorated NFT trading activity, according to Thomas Bialek, an analyst at The Block Research.","Anticipation of upcoming airdrops may also be having an impact, as could an increase in overall market liquidity with crypto trading volumes increasing since the start of the year.","Last week, two NFT holders from trading firm Degenz Finance <a href=\"https:\/\/www.theblock.co\/post\/214373\/bored-ape-whales-cash-out-using-blur\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">cashed out<\/a> their collection of Bored Ape Yacht Club to the tune of more than 6,000 ETH ($10 million). They had been considering how they would be able to cash out without affecting the market, they explained, and saw the spike on Blur as an opportunity.","“The liquidity provided by Blur is insane at the moment,” they said on their website.","NFT's were also up across a number of other categories, with Ethereum art and collectibles sales seeing the highest volume since August 2021. Still, while monthly transaction volume is up, the number of monthly trades is down, alongside the number of monthly traders.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/marketplaces\/monthly-unique-ethereum-nft-traders\/embed\" title=\"Monthly Unique Ethereum NFT Traders\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","While transaction volumes are rising, it’s unclear if the spike is sustainable or merely connected to the short-term incentives offered by Blur.&nbsp;","\"It seems likely that this heated NFT marketplace war will continue to intensify in the near future,\" Bialek said, \"with Blur needing to demonstrate the longevity of its approach and OpenSea needing to come up with an effective response.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dune","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Bialek","content":"PERSON"},{"type":"Thomas Bialek","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Degenz Finance","content":"ORGANIZATION"},{"type":"August 2021","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"$10 million","content":"MONEY"}],"hashtag":["BLUR","DECENTRALIZED INFRASTRUCTURE","EQUITY MOVERS","NFT ARTISTS","OPENSEA"],"authors":["Sam Venis","The Block"]}