{"summary":"The markets regulator touted its latest annual enforcement numbers as the SEC receives criticism over its handling of FTX.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/187199\/sec-enforcements-and-remedies-reached-6-4-billion-last-year","publishDate":"2022-11-15T12:06:19","id":4945,"type":null,"title":"SEC enforcements and remedies reached $6.4 billion last year","category":["POLICY"],"content":["The Securities and Exchange Commission announced that penalties, as well as remedies to investors affected by criminal or civil wrongdoing, reached a total of $6.4 billion during the last federal fiscal year.&nbsp;","The agency filed 760 enforcement actions in FY 2022, which it says represents a 9% increase from the prior year, with 462 of those being entirely new cases — a 6.5% increase year-over-year.","Today’s annual wrap-up of enforcement statistics from the last federal fiscal year does not include a breakdown of how many were crypto-related, but the agency does tout several enforcement actions or settlements from the period running between Oct. 1, 2021 and Sept. 30, 2022.","The SEC also touted the fact that it is doubling the size of its crypto unit, adding 20 new positions to a team focused on the digital asset industry.","Crypto industry executives and advocates have been highly critical of the SEC’s approach. That includes recent skepticism over the agency’s handling of FTX and <a href=\"https:\/\/www.theblock.co\/post\/186908\/ftx-asked-about-but-did-not-receive-special-exemption-from-sec\" data-v-f87c67ca=\"\">meetings between FTX executives and the SEC<\/a> earlier this year.","Last week when SEC Chair Gary Gensler was pressed over why the agency had yet to take action against FTX, which primarily operated outside the U.S. despite having an American subsidiary, he <a href=\"https:\/\/www.theblock.co\/post\/185310\/gensler-pressed-on-ftx-failure-warns-investors-to-be-careful-beware\" data-v-f87c67ca=\"\">responded<\/a>: “Building the evidence, building the facts, often takes time.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gary Gensler","content":"PERSON"},{"type":"9%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"$6.4 billion","content":"MONEY"},{"type":"FY 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"6.5%","content":"PERCENT"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Oct. 1, 2021","content":"DATE"},{"type":"Sept. 30, 2022","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":[],"authors":["Colin Wilhelm","The Block"]}