{"summary":"Crypto exchange Bitfinex has had a busy month, fighting legal battles and media scrutiny about the stability of its stablecoin, Tether. But it&#x27;s not","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/25610\/bitfinex-launches-peer-to-peer-otc-trading-on-ethereum-based-partner-platform","publishDate":"2019-06-03T07:33:43","id":4946,"type":null,"title":"Bitfinex launches peer-to-peer OTC trading on Ethereum-based partner platform","category":["EXCHANGES"],"content":["<strong data-v-f87c67ca=\"\">Quick Take<\/strong>","Crypto exchange Bitfinex has had a busy month, fighting legal battles and media scrutiny about the stability of its stablecoin, Tether.","But it's not looking to slow down, announcing <a href=\"https:\/\/twitter.com\/bitfinex\/status\/1135495804385447936?s=21\" data-v-f87c67ca=\"\">via Twitter<\/a> Monday that it is launching \"trustless\" over-the-counter (OTC) trading on its spin-off platform, Ethfinex. Almost every major crypto exchange has launched an OTC offering at this point, but Bitfinex's so-called \"decentralized\" approach is novel in the OTC space.","In over-the-counter trading, trades are brokered off of an exchange's main order book. Typically, the exchange will act as an agent, bringing together two-sides of a trade. But with Bitfinex's offering, there is <a href=\"https:\/\/blog.ethfinex.com\/introducing-trustless-otc-no-more-escrow\/\" data-v-f87c67ca=\"\">no 3rd party escrow<\/a>, meaning it's exclusively peer-to-peer, and large trades will be brokered off of the exchange's main order book.","\"This is peer-to-peer exclusively, so buyers and sellers for the moment find each other externally, or are connected by agents, and then initiate the trade, generating a URL they can send to their trading partner to accept the trade,\" Ethfinex cofounder Will Harborne said of the platform.&nbsp;","Only <a href=\"https:\/\/www.theblockcrypto.com\/2018\/10\/09\/a-former-virtu-trader-is-shaking-up-a-murky-corner-of-the-cryptocurrency-market-with-a-new-decentralized-otc-product\/\" data-v-f87c67ca=\"\">Airswap's&nbsp;Spaces<\/a>, a decentralized OTC product launched in October last year, resembles Bitfinex's approach to OTC.","Harborne told The Block that the new OTC desk, dubbed Ethfinex Trustless, takes its name from its blockchain-based settlement system. Traders on the platform find each other, or are connected by agents, then express an intention to buy or sell, before transactions are closed via smart contracts.","He added&nbsp;that the desk \"solv[es]\" the escrow part of a trade too, as the exchange doesn't custody user's funds.","\"The custody is decentralised [until the trade is settled],\" Harbone explained, with the \"blockchain\" then enforcing the trade when accepted.&nbsp;","Ethfinex further noted that trades could be completed for <em data-v-f87c67ca=\"\">any&nbsp;<\/em>\"compliant\" ERC-20 token, not just the ones currently listed on the exchange.","Bitfinex launched Ethfinex, the Etheruem-token trading platform, <a href=\"https:\/\/www.theblockcrypto.com\/2019\/05\/21\/scandalized-bitfinex-plans-to-support-ieos-via-new-platform\/\" data-v-f87c67ca=\"\">in September last year,<\/a> facilitating trading of over 50 ERC-20 tokens. The two companies share the same leadership, with Bitfinex owning a major share of the smaller exchange. Both Bitfinex and Ethfinex are owned by iFinex Inc.","Bitfinex CTO Paolo Ardino <a href=\"https:\/\/twitter.com\/paoloardoino\/status\/1135498198137671680?s=21\" data-v-f87c67ca=\"\">tweeted<\/a> that the decentralized OTC launch would ensure \"more users take care of their own assets\" and help rectify crypto's existing issues around \"custody and centralization of assets.\"","Meanwhile, Harborne said the benefits would be seen across the ecosystem.","\"We are working on making it easy for agents to integrate with the service in the future, so that they can direct their clients there to easily make the trades once they have arranged a deal. This will also lower the cost and barriers to entry for OTC agents, since they do not need to be involved for escrowing trades.\"&nbsp;Fees will stand at a minimum of 0.02%.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Harborne","content":"PERSON"},{"type":"Bitfinex","content":"PERSON"},{"type":"0.02%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Will Harborne","content":"PERSON"},{"type":"September last year","content":"DATE"},{"type":"Bitfinex","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"October last year","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Ethfinex","content":"ORGANIZATION"},{"type":"Ethfinex","content":"LOCATION"},{"type":"iFinex Inc","content":"ORGANIZATION"},{"type":"CTO","content":"ORGANIZATION"},{"type":"Airswap","content":"ORGANIZATION"},{"type":"Etheruem","content":"PERSON"}],"hashtag":[],"authors":["Isabel Woodford","The Block"]}