{"summary":"Coinbase said revenue came in at $1.31 billion for the period, down from Q2&#x27;s $2.27 billion.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/123849\/coinbase-says-q3-revenue-trading-volumes-cooled-compared-to-previous-quarter","publishDate":"2021-11-09T16:35:49","id":4947,"type":null,"title":"Coinbase says Q3 revenue, trading volumes cooled compared to previous quarter","category":["EARNINGS"],"content":["Coinbase's earnings for the third quarter of the year reflect a cooler period in the crypto market after a strong spring, with trading volumes, revenue and the number of monthly transacting users all declining.","The publicly traded exchange company <a href=\"https:\/\/s27.q4cdn.com\/397450999\/files\/doc_financials\/2021\/q3\/Coinbase-Q321-Shareholder-Letter.pdf\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">said<\/a> net revenue came in at $1.31 billion for the period, down from Q2's $2.27 billion. Per the earnings report, adjusted EBITDA was $618 million compared to Q2's $1.15 billion.","Trading volume fell from $462 billion to $327 billion, with the bulk of the volume coming from the institutional segment. The share of volume and transaction revenue from non-BTC and ETH digital assets inched upward during the period. Assets held on its platform rose from $180 billion to $255 billion, according to Coinbase.&nbsp;","<em data-v-f87c67ca=\"\">Source: Coinbase Q3 investor letter<\/em>","Coinbase also reported that the number of monthly transacting users on its platform was 7.4 million for the quarter, down from Q2's 8.8 million. The exchange said that the number of verified users on the platform grew to 73 million in Q3.&nbsp;","In its investor letter, Coinbase contended that it outperformed a market that saw an overall decline in activity compared to the second quarter of the year, but that this trend is shifting upward as the end of 2021 approaches.","\"While we entered Q3 with softer crypto market conditions, driven by low volatility and declining crypto asset prices, market conditions improved meaningfully later in the quarter which we have continued to see into early Q4,\" the firm said. \"This backdrop led to global crypto spot trading volumes declining 37% in Q3 as compared to Q2, however, Coinbase outperformed the market with total trading volumes of $327 billion, a 29% decline in the same period. We have consistently indicated that volatility is a key factor influencing our transaction revenue. Q3 illustrates this point.\"","\"We believe that retail MTUs and total trading volume will be higher in Q4 as compared to Q3,\" Coinbase added.&nbsp;","The market responded sharply to the earnings release; according to after-hours data. The price of $COIN is down more than 11% at the time of writing, currently trading hands at $315.50.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$315.50","content":"MONEY"},{"type":"$180 billion","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"$327 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$618 million","content":"MONEY"},{"type":"Coinbase","content":"PERSON"},{"type":"$462 billion","content":"MONEY"},{"type":"$COIN","content":"MONEY"},{"type":"11%","content":"PERCENT"},{"type":"second quarter of the year","content":"DATE"},{"type":"29%","content":"PERCENT"},{"type":"$255 billion","content":"MONEY"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"37%","content":"PERCENT"},{"type":"$2.27 billion","content":"MONEY"},{"type":"third quarter","content":"DATE"},{"type":"$1.31 billion","content":"MONEY"},{"type":"$1.15 billion","content":"MONEY"}],"hashtag":["COINBASE","EARNINGS"],"authors":["Michael McSweeney","The Block"]}