{"summary":"The Fed announced a new program on Tuesday to strengthen its oversight centered around supervising crypto and stablecoin activity. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/243813\/federal-reserve-increases-oversight-of-banking-crypto-ties","publishDate":"2023-08-08T17:27:00","id":4949,"type":null,"title":"Federal Reserve increases oversight of banking crypto ties","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Federal Reserve announced new <a href=\"https:\/\/www.federalreserve.gov\/newsevents\/pressreleases\/bcreg20230808a.htm\" data-v-f87c67ca=\"\">guardrails<\/a> on Tuesday to strengthen its supervision of banks involved in crypto and stablecoin activity.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Called the \"Novel Activities Supervision Program,\" the central bank will <a href=\"https:\/\/www.federalreserve.gov\/supervisionreg\/srletters\/SR2307.htm\" data-v-f87c67ca=\"\">enhance<\/a> the supervision of all banking organizations it oversees, focusing on crypto, distributed ledger technology, as well as “technology-driven partnerships <\/span><span class=\"s2\" data-v-f87c67ca=\"\">with nonbanks to deliver financial services to customers.”<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">“Innovation can also lead to rapid change in individual banks or in the financial system and generate novel manifestations of risks that can materially impact the safety and soundness of banking organizations,” the central bank said in a <a href=\"https:\/\/www.federalreserve.gov\/newsevents\/pressreleases\/bcreg20230808a.htm\" data-v-f87c67ca=\"\">statement<\/a>. “Given the novelty of these activities, they may create unique questions around their permissibility, may not be sufficiently addressed by existing supervisory approaches, and may raise concerns for the broader financial system.”<\/span>","The bank said that entities participating in the \"novel\" activities would not be moved to a separate supervisory portfolio.&nbsp;","\"Instead, the Program will work within existing supervisory portfolios and alongside existing supervisory teams,\" it said, adding that it would be notifying in writing the banks whose activities will be subject to evaluation. \"The Program will help ensure that regulation and supervision allow for innovations that improve access to and the delivery of financial services, while also safeguarding bank customers, banking organizations, and financial stability.\"","The Federal Reserve added that banking organizations would not be prohibited or discouraged from providing banking services to customers of any specific class or type.&nbsp;","<span class=\"s2\" data-v-f87c67ca=\"\">The Federal Reserve also published more information for supervised state banks looking to engage in stablecoin activity. The central bank said those banks should have risk management practices in place for cybersecurity, liquidity, consumer compliance and illicit finance risks.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The Federal Reserve’s announcement comes weeks after the House Financial Services Committee <a href=\"https:\/\/www.theblock.co\/post\/241852\/stablecoins-bill-advances-in-us-house-after-tense-day-of-debate\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">advanced<\/span><\/a> a comprehensive regulatory framework for stablecoins, though bipartisan negotiations later hit a snag.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"House Financial Services Committee","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}