{"summary":"Coin Metrics&#x27; Nic Carter offers his take on what 2021 might bring.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/88079\/nic-carter-outlook-2021-bitcoin","publishDate":"2020-12-24T13:39:23","id":4953,"type":null,"title":"Nic Carter on what 2021 might bring for Bitcoin, crypto exchanges and more","category":["BITCOIN"],"content":["<em data-v-f87c67ca=\"\">Nic Carter is a co-founder of Coinmetrics.io and a partner at Castle Island Ventures.<\/em>","It’s December, so it’s the season of comfy sweaters, eggnog (or gluhwein if you’re European), and wild predictions about what the following year will bring.","I’ve got a few of these under my belt already, so let’s check in on those and see how I did.","A year ago, I <a href=\"https:\/\/www.theblockcrypto.com\/post\/51353\/nic-carter-on-what-2019-meant-for-crypto-and-what-2020-might-bring\" rel=\"noopener nofollow\" data-v-f87c67ca=\"\">predicted<\/a> the following for 2020:","<strong data-v-f87c67ca=\"\">• A continued token die-off:<\/strong> I will award myself partial credit for this one. While high-profile token sales of yore, including Kin and Telegram, threw in the towel, many other new tokens burst on the scene to take their place. The Telegram settlement was particularly remarkable because of its enormous scale (it was the second-ever largest token sale) and the high profile nature of its backers. That said, a great number of pseudo-equity tokens sprang into existence and the ‘governance token’ was born in earnest. At this point, I’ve given up trying to predict what the SEC will do.","<strong data-v-f87c67ca=\"\">• Exchanges coming under pressure:<\/strong> I think I can claim full marks for this call. The big news of the year was the lawsuit brought against BitMEX by the CFTC and the accompanying criminal charges from the Department of Justice for violating the Bank Secrecy Act. As I said in the post last year:","<em data-v-f87c67ca=\"\">\"The pariah exchanges will continue shuttling from jurisdiction to jurisdiction and hoping to avoid the long reach of the law. They can still function, lacking banking and a fixed headquarters thanks to the unstoppable liquidity engines that are Bitcoin and Ethereum. This gives them an ability to resist coercion that is rather unprecedented.\"<\/em>","<em data-v-f87c67ca=\"\">That said, the BTC-e case study is worth reflecting on. No matter where you are located, the U.S. probably has a way to sniff you out.\"<\/em>","Many commentators felt that BitMEX might be immune to regulators since they don’t rely on the banking system at all, don’t serve U.S. clients, and are domiciled abroad. But when American financial regulators are sufficiently motivated, they can go after virtually any entity anywhere on the planet. Whether the other ‘offshore’ crypto spot and derivatives exchanges meet a similar fate remains to be seen.","<strong data-v-f87c67ca=\"\">• Consequences for the unregistered underwriters:<\/strong> I expected some adverse outcomes for firms that were notionally consumers of token sales but were really acting as de facto underwriters, helping issuers market and distribute these offerings. In regulated markets, you need a broker-dealer license to engage in this kind of activity. The SEC wasn’t interested in pursuing this segment, though.","<strong data-v-f87c67ca=\"\">• Token issuers bite the bullet and issue ‘real’ equity:<\/strong> Well, this sort of happened! INX and ARCA were both issued with full SEC registration. Perhaps more influential, though, was the explosion of ‘governance’ tokens in the DeFi space. I call this ‘pseudoequity’ because it pulls apart the qualities of equity and includes it piecemeal — control rights, cash flows, dividends, etc. As far as tokens go, this is a step in the right direction, but it may not go far enough. This represents the pendulum swinging back towards more equity-like models of tokens (away from utility tokens), which is arguably a good thing for investors. That said, this comes with the elevated risk of being branded securities. There’s no free lunch.","<strong data-v-f87c67ca=\"\">• Growth of sidechains:<\/strong> This quite frankly didn’t happen, on Bitcoin at least. Next year perhaps?","<strong data-v-f87c67ca=\"\">• Unbundling of exchange competencies:<\/strong> This is more of a gradual trend, but it definitely continued in 2020. The legacy model of the integrated exchange, the brokerage, the custodian, and in some cases, the lender is being deprecated. Today, we have specialist firms excelling in each category. In particular, new brokerages being launched today are choosing to outsource both custody and order book management.","<strong data-v-f87c67ca=\"\">• Stablecoin reckoning over privacy:<\/strong> I felt that stablecoin issuers might face resistance from regulators over their relatively loose approach to privacy (KYC on the edges of the transactional graph, general lack of surveillance within the graph). This didn’t meaningfully occur, but financial regulators worldwide made an enormous amount of noise around stablecoins, portending likely actions in 2021.","<strong data-v-f87c67ca=\"\">• The emergence of ‘actually fun’ blockchain games:<\/strong> This one was a dud as well. While some creative game-like experiences did emerge, there really weren’t any breakout blockchain games in 2020. Perhaps because yield farming and DeFi were entertaining enough on their own. I have been perennially wrong on this front.","For good measure, I’ll also evaluate my <a href=\"https:\/\/www.tokendaily.co\/blog\/2020-crypto-crystal-ball\" rel=\"noopener nofollow\" data-v-f87c67ca=\"\">Token Daily<\/a> crystal ball predictions for the year:","<em data-v-f87c67ca=\"\">\"Fiat backed stablecoins face considerable regulatory scrutiny as regulators realize issuers are conducting minimal surveillance within their networks. Binance gets forced out of Malta and is forced to search for a new home base once again. The SEC wins their case against Kik, setting a firm precedent and causing dozens of similar tokens to instantly dissolve and settle. A major US exchange initiates a user-facing proof of reserve protocol.\"<\/em>","The stablecoins faced bark but no bite; Binance absolutely left Malta (were they ever there in the first place?); the SEC won a brutal <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2020-262\" rel=\"noopener nofollow\" data-v-f87c67ca=\"\">summary judgment<\/a> against Kik; no major U.S. exchange started a <a href=\"https:\/\/niccarter.info\/proof-of-reserves\/\" rel=\"noopener nofollow\" data-v-f87c67ca=\"\">Proof of Reserve<\/a> protocol, although there was very strong progress on PoR this year.","Given my generally poor performance predicting things, I will try to keep my prognostications to a minimum this year. However, there are a few trends that are poised to define 2021.","Bitcoin is midway through its financialization process.","This is the largely inevitable transition whereby a share of supply is converted into a financial asset to which financial institutions can gain convenient exposure. Reputable custodians were the first step — I expect that we get even more clarity on what it means to custody Bitcoin in 2021, too.","The growth of a lending market was another vital milestone — it facilitates liquidity on a moment’s notice and enables market makers to operate in a capital-efficient manner. True prime brokerage doesn’t currently exist, but I would not be surprised to see it emerge in 2021. The bank sector now interoperates relatively seamlessly with crypto firms. I would imagine that next year, a number of banks roll out Bitcoin custody products — most likely relying on one of the established service providers like Fidelity Digital Assets in a sub-custody arrangement. Offering services for digital assets will become a routine aspect of a bank. Next year could well be the moment in which Wall Street finally realizes that Bitcoin and its peers offer the kind of high-margin opportunities largely lacking in the traditional banking space, where negative interest rates have compressed margins.","Lastly, financial products tracking Bitcoin are still inefficient in the U.S. owing to a regressive SEC posture. Overseas, a number of exchange-traded products trade at par and offer users on traditional brokerage accounts exposure to Bitcoin in a convenient format. While much depends on the political makeup of the SEC and the inclinations of Jay Clayton’s successor, the Bitcoin market today has satisfied most of the qualities that the commission has stated are key considerations in an ETF approval. A number of reputable custodians exist; a greater share of volume is onshore, as unregulated derivatives exchanges have been marginalized or faced enforcement action; CFTC-regulated derivatives venues like the CME, Bakkt, and ErisX have gained prominence. While I cannot guarantee a Bitcoin ETF approval, at this stage, continued denials would be evidence not of a disorderly market but political animus. The conditions have been met; now it’s on the SEC to do the right thing.","Of course, while financialization will permit more sources of capital to get exposure to Bitcoin, this comes with a catch.","I expect that the Financial Action Task Force’s travel rule recommendations eventually become policy in every major jurisdiction, beyond just Switzerland and the Netherlands. When withdrawing from or depositing to a centralized exchange, users will have to identify themselves on-chain. This is not a death knell for privacy — after all, those exchanges already know where user deposits are coming from and where withdrawals are bound. The risk is that financial regulators begin demanding that exchanges fork over all these address-identity ordered pairs in an attempt to characterize the entirety of the transactional graph.","Many have expressed concern about the bifurcation of Bitcoin into lit and dark markets, with surveilled and taint-free units of Bitcoin circulating within a walled garden, while grey market, vaguely tainted Bitcoin is transacted outside. In many ways, this would mirror the way that financial gold operates: the largest OTC gold market is overseen by the London Bullion Market Association (LBMA), in which every link in the supply chain must be authenticated. Once the gold has transited through an approved refiner, it is considered <a href=\"http:\/\/www.lbma.org.uk\/good-delivery-rules\" rel=\"noopener nofollow\" data-v-f87c67ca=\"\">Good Delivery<\/a> and can enter the OTC market and circulate between approved entities. However, the Good Delivery bars cannot leave the walled garden without having to be re-authenticated all over again upon re-entry. When a <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2020-06-12\/banks-have-moved-gold-trading-from-new-york-to-london-lbma-says\" rel=\"noopener nofollow\" data-v-f87c67ca=\"\">dislocation occurred<\/a> earlier this year between the Chicago-based Comex gold futures market and the London spot market, <a href=\"https:\/\/www.reuters.com\/article\/us-gold-trading-cme\/exclusive-cme-pushed-to-change-gold-delivery-rules-amid-coronavirus-lockdown-sources-idUSKBN21B3GC\" rel=\"noopener nofollow\" data-v-f87c67ca=\"\">different standards<\/a> for acceptable gold meant that the arbitrage could not easily be closed.","With Bitcoin, such a barrier between the financialized and non-financialized asset could emerge.","However, I expect the barriers between Wall St. Bitcoin and Main Street Bitcoin to be more porous than the ones erected in gold markets. Gold is an extreme case, as it is difficult to verify, costly to transport, and must be arranged into standard, fungible physical bars to be used in a market. Bitcoin, by contrast, is virtually free to verify, painless to transport an arbitrary distance, and works just the same regardless of UTXO sizes.","Still, the lurking presence of taint in the markets, and irrepressible enthusiasm for blockchain analysis among service providers and financial regulators, might solidify a two-tiered notion of Bitcoin — even though no one thinks of cash as ‘tainted’ if it had historically been used in a black market context.","The financialization of Bitcoin has other downsides. In 2017, commercial entities seeking to push through a change to the Bitcoin protocol failed because they lacked sufficient support. However, in 2020, many more bitcoins are held by large financial institutions. Would the equivalent of the New York Agreement prevail under today’s market conditions? I hope that we don’t have to find out, but I fear that as financial intermediaries gain more relevance in Bitcoin markets, their bargaining power will grow as well.","I’ll admit something here. This prediction isn’t a pure expression of probabilities because I have a hand in the outcome. In a sense, my lionizing <a href=\"https:\/\/niccarter.info\/proof-of-reserves\/\" rel=\"noopener nofollow\" data-v-f87c67ca=\"\">Proof of Reserve<\/a> is akin to an athlete betting on a match in which they’re playing. I am actively campaigning for exchanges and custodians to adopt the PoR procedure, so I am not a mere disinterested observer.","That said, I do believe that after much reticence and prevarication, major exchanges will begin to adopt the Proof of Reserve procedure in earnest. The concept experienced a mini-boom in 2015 after the failure of Mt Gox, and then entered a period of slumber. However, in the wake of Quadriga — and as exchanges have begun to compete with each other in the domain of credibility and depository assurances, rather than merely token listings — many industry participants took a second look at trust-enhancing measures like PoR.","Exchanges and custodians will adopt Proof of Reserves for a few simple reasons. First, it’s a competitive advantage. Second, self-regulatory measures will help to abate more onerous subsequent regulation by the state, which will become an immediate concern in 2021. And finally, PoR will be standardized in 2021, so service providers will have a useful template with which to build their procedures.","I expect that more than one major exchange or custodian in the U.S. will adopt an ongoing, third-party assisted PoR attestation in 2021, and at least a half dozen worldwide.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2015","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Carter","content":"PERSON"},{"type":"Castle Island Ventures","content":"ORGANIZATION"},{"type":"Jay Clayton","content":"PERSON"},{"type":"Switzerland","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"earnest","content":"LOCATION"},{"type":"Bakkt","content":"LOCATION"},{"type":"New York","content":"LOCATION"},{"type":"Bullion Market Association (LBMA","content":"ORGANIZATION"},{"type":"London","content":"LOCATION"},{"type":"earlier this year","content":"DATE"},{"type":"Chicago","content":"LOCATION"},{"type":"lionizing <a href=\"https:\/\/niccarter.info\/proof-of-reserves\/\" rel=\"noopener nofollow\" data-v-f87c67ca=\"\">Proof of Reserve","content":"ORGANIZATION"},{"type":"CME","content":"ORGANIZATION"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Proof of Reserve","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"the Netherlands","content":"LOCATION"},{"type":"December","content":"DATE"},{"type":"Fidelity Digital Assets","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Malta","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"UTXO","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Fiat","content":"ORGANIZATION"},{"type":"Financial Action Task Force","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["BITCOIN"],"authors":["Nic Carter","The Block"]}