{"summary":"The fund, which is currently worth about $200 million, consists of 6,000 BTC and 80 million USDT.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/161962\/singapore-based-crypto-exchange-bitget-establishes-200-million-protection-fund","publishDate":"2022-08-07T04:12:55","id":4956,"type":null,"title":"Singapore-based crypto exchange Bitget establishes $200 million protection fund","category":["EXCHANGES"],"content":["Singapore-based crypto exchange Bitget has launched a $200 million fund to protect its users' assets.&nbsp;","The Bitget Protection Fund was created to provide security and to ensure secure trading for its users, the company said in a <a href=\"https:\/\/prnmedia.prnewswire.com\/news-releases\/bitget-launches-200-million-protection-fund-to-safeguard-users-asset-security-808665766.html\" data-v-f87c67ca=\"\">news release<\/a> on Friday.","The fund, which is currently worth about $200 million, consists of 6,000 BTC and 80 million USDT. The company has pledged to secure its value for the next three years.","Crypto investors have experienced a volatile period over the last two months amid unfavorable macroeconomic conditions in the traditional finance field.","Bitget has also put in place stringent KYC and AML policies and partnered with third-party legal and compliance partners to strengthen its standards and maintain a regulated operation, it said.","The company’s managing director, Gracy Chen, said: “As we continue to endure the crypto winter, it is crucial that our users can rest assured that their funds are kept safe.\"","Bitget <a href=\"https:\/\/www.theblock.co\/linked\/154234\/crypto-exchange-bitget-plans-to-double-workforce-to-1000-over-next-six-months\" data-v-f87c67ca=\"\">said in June<\/a> that it planned to double its workforce to 1,000 employees over the next six months despite the current market downturn.","The company, which was founded in 2018 and offers crypto copy trading, has been experiencing growth and generating strong cash flow amid less-than-perfect market conditions, it said at the time.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"winter","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"Gracy Chen","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"$200 million","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"2018","content":"DATE"}],"hashtag":[],"authors":["Mike Millard","The Block"]}