{"summary":"The Bank for International Settlements (BIS) said there may be 15 retail and nine wholesale CBDCs in circulation by 2030.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239373\/bis-survey-suggests-there-may-be-a-large-increase-in-cbdcs-by-2030","publishDate":"2023-07-13T07:30:47","id":4957,"type":null,"title":"BIS survey suggests there may be a large increase in CBDCs by 2030","category":["POLICY"],"content":["The Bank for International Settlements's (BIS) latest survey suggests that there might be a big increase in the number of central bank digital currencies (CBDCs) by the end of the decade.","\"It may be that there will be 15 retail and nine wholesale CBDCs publicly circulating towards the end of this decade,\" said the BIS in a <a href=\"https:\/\/www.bis.org\/publ\/bppdf\/bispap136.pdf\" data-v-f87c67ca=\"\">survey<\/a> released on July 10. This is based on the number of central banks that have indicated they are looking into creating one.","The survey noted there are currently four retail Central Bank Digital Currencies (CBDCs) in circulation. These are located in The Bahamas, the Eastern Caribbean states, Jamaica, and Nigeria.","The percentage of central banks likely to issue a retail CBDC in the next three years has risen from 15% to 18%, the survey found. The number of banks planning to issue a wholesale CBDC in the short term has also increased. The report found 16% of central banks will likely issue a wholesale CBDC within the next three years. This is twice as much as last year’s 8%. There's an upward trend for potential medium-term issuance too, with a rise from 54% to 58%.","These figures suggest central banks are becoming more decisive about their short-term CBDC plans. Central banks from Emerging Market and Developing Economies (EMDE) have a higher likelihood of issuing retail CBDCs compared to Advanced Economies (AE), it noted.","The BIS identified improved financial inclusion and payment efficiency as key motivations for issuing retail CBDCs. Central banks in both emerging markets and advanced economies attach equal importance to domestic payment efficiency, payment safety, financial stability, and cross-border payment efficiency, it noted.","The survey stated that nearly 30% of central banks report stablecoin use in their jurisdiction, mainly for remittances. Yet it noted that stablecoins are rarely used for payments outside the crypto market.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"July 10","content":"DATE"},{"type":"Central Bank Digital Currencies","content":"ORGANIZATION"},{"type":"8%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"54%","content":"PERCENT"},{"type":"Emerging Market","content":"ORGANIZATION"},{"type":"Bank for International Settlements","content":"ORGANIZATION"},{"type":"end of this decade","content":"DATE"},{"type":"BIS","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"The Bahamas","content":"LOCATION"},{"type":"18%","content":"PERCENT"},{"type":"58%","content":"PERCENT"},{"type":"Jamaica","content":"LOCATION"},{"type":"16%","content":"PERCENT"},{"type":"Nigeria","content":"LOCATION"},{"type":"15%","content":"PERCENT"},{"type":"Eastern Caribbean","content":"ORGANIZATION"}],"hashtag":["BOE","CRYPTO","ECB","FEDERAL RESERVE"],"authors":["Brian McGleenon","The Block"]}