{"summary":"Metis aims to become Ethereum&#x27;s first decentralized Layer 2 infrastructure this year, with its community taking over centralized elements.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/251235\/metis-first-ethereum-decentralized-layer-2-2023","publishDate":"2023-09-15T12:18:11","id":4958,"type":null,"title":"Metis aims to become Ethereum&#x27;s first fully decentralized Layer 2 in 2023","category":["LAYER 2S AND SCALING"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.91%\n    <\/span><\/a> <!----><\/span><\/span> Layer 2 scaling solution Metis aims to become Ethereum's first decentralized Layer 2 infrastructure, empowering its community to take over key centralized components of the network.<\/span>","Currently, Layer 2 networks introduce elements of centralization, such as relying on single sequencers controlled by the projects’ teams. A sequencer is a component of Layer 2 networks that orders and batches multiple off-chain transactions before submitting them to the Ethereum blockchain. This creates a single point of failure and potential censorship risks that could have a significant impact on users of the networks.","To achieve full decentralization over time, Layer 2s must address these centralization risks, Metis co-founder Elena Sinelnikova told The Block in a recent interview. \"One way to do this is by introducing multiple sequencers and relinquishing control to the broader community,\" Sinelnikova said. \"However, it's imperative that this transition is carried out in a safe, secure and well-planned manner.\"","Metis has an ambitious target of implementing such decentralization by the end of the year. By empowering the community to take control over a pool of decentralized sequencers, Metis aims to demonstrate it's possible to maintain the benefits of Layer 2 scalability while reducing centralization risks, Sinelnikova said. Additionally, it involves posting full transaction data to Ethereum, transitioning the Metis Layer 2 back to a classic Optimistic Rollup.","The broader question of whether blockchains can scale over time without introducing further centralization is more complex, Sinelnikova added, with solutions to balance between scalability and decentralization continuing to be explored.","<span data-v-f87c67ca=\"\">Adoption of Layer 2 solutions has grown considerably this year, with combined daily transaction averages on networks like <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Arbitrum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248386\/arbitrum-arb-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/photo_2023-03-29_21.47.00.jpeg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ARB<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -3.49%\n    <\/span><\/a> <!----><\/span><\/span>, Base and <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248388\/optimism-op-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/Optimism.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">OP<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -3.62%\n    <\/span><\/a> <!----><\/span> Mainnet more than double those on the Ethereum main chain.<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/optimistic-rollups\/transaction-count-daily-7dma\/embed\" title=\"Transaction Count on Optimistic Rollups (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/transactions-on-the-ethereum-network-daily\/embed\" title=\"Transactions on the Ethereum Network (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Throughput and fees are part of the driver behind this trend, with Layer 2s processing more than five times the amount of transactions per second on average, according to L2BEAT, at a significantly lower cost compared to the base layer.","<span data-v-f87c67ca=\"\">Transactions per second scaling factor. Image: <a href=\"https:\/\/l2beat.com\/scaling\/activity\" data-v-f87c67ca=\"\">L2BEAT<\/a>.<\/span>","However, Sinelnikova puts the surge down to successful airdrops following the launch of new networks like the Coinbase-incubated Base, Artbitrum, OP Mainnet, Mantle, Linea and zkSync — highlighting the rapid growth of the technology over the last 18-24 months.","\"The dominant trend driving transaction volume on Layer 2 networks is related to airdrops,\" Sinelnikova said. \"This activity has proven to be profitable, especially since many of these Layer 2 blockchain projects have raised substantial funding and plan to distribute a significant portion of their token supplies to network participants. Some individual airdrops have been worth five or six figures in U.S. dollars.\"","\"Given the emergence of multiple new blockchain networks like Base, Mantle, Linea, zkSync and others, there is a significant amount of airdrop activity,\" Sinelnikova continued. \"The concept of airdrops, coupled with their demonstrated profitability, has led to the perception that active participation on Layer 2 networks is one of the most profitable and low-risk activities for cryptocurrency users.\"","While the growth in Layer 2 adoption is impressive, bridging there in the first place remains largely complex and expensive for the average user, with withdrawals directly into Layer 2s from centralized exchanges currently limited — something which Sinelnikova says needs to be addressed for Layer 2s to deliver on their widespread adoption potential.","\"Optimistic Rollups still require users to wait for up to seven days for withdrawals, which can be inconvenient and hinder adoption,\" Sinelnikova said. \"Meanwhile, ZK Rollups face stability problems, and it may take a few more years to resolve these issues due to their complexity and the need for EVM (Ethereum Virtual Machine) compatibility maintenance.\"","The security of existing bridges is also a significant challenge, Sinelnikova added, risking users' assets during transfers and responsible for some of the highest-profile DeFi exploits to date.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/exploits\/largest-defi-exploits\/embed\" title=\"Largest DeFi exploits\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","However, the Metis co-founder was encouraged by Hybrid Rollup technology and non-bridge connectivity solutions currently under development.","Beyond Metis' decentralization plans, its roadmap includes integration with Ethereum Improvement Proposal 4844 to lower gas costs and make transactions more cost-effective for users. The Layer 2 project is also developing a Hybrid Rollup solution in collaboration with ZKM Econode to address the seven-day withdrawal delay while combining the benefits of Optimistic Rollups with the security of Zero-Knowledge Proofs (ZKP).","Following such critical elements, Layer 2s could then move on to tackle other barriers to adoption, including improving user interfaces and experiences to cater to mainstream users and seamlessly integrating Layer 2 solutions into traditional web and mobile applications, Sinelnikova said.","Beyond these measures, Sinelnikova added clear and sensible regulations surrounding the industry are crucial, but web3 also needed to focus on real-world applications that solve real-world problems to become more accessible and valuable to a broader audience.","Sinelnikova said Metis distinguishes itself from other Layer 2 solutions through its alignment with the MetisDAO Foundation, aiming to provide fully decentralized network infrastructure operated by the community.","In contrast to the governance of some decentralized autonomous organizations — where decisions are dominated by relatively few large token holders — the MetisDAO Foundation is adopting a reputation-based system instead of token-centric models that can lead to such concentration of power, Sinelnikova added.","\"This system blends on-chain and off-chain decision-making mechanisms, such as Reputation Power-weighted voting and community forums,\" Sinelnikova continued, \"ensuring that decisions are reached with input and consensus from all stakeholders.\"","\"We are also establishing clear procedures for emergency proposals, enabling swift action in case of security breaches or other urgent situations,\" she added.","Sinelnikova has an extensive background as a government solutions architect and transitioned to web3 initially via CryptoChicks.","Sinelnikova said the fusion of traditional institutions with decentralized technology can reshape global financial ecosystems — pointing to the rise of Central Bank Digital Currencies as a potential bridge between traditional finance and web3.","Investment banks are also finding they need to adapt, given the growth potential of the digital asset market, as demonstrated by <a href=\"https:\/\/www.theblock.co\/post\/250963\/deutsche-bank-taurus-digital-asset-custody-tokenization-services\" data-v-f87c67ca=\"\">Deutsche Bank’s foray into digital asset custody and tokenization services<\/a> announced yesterday. \"Yet, hurdles like regulatory uncertainty, integration issues, security, scalability and a skills gap must be overcome.\" Sinelnikova added.","That skills gap is where Sinelnikova was first introduced to the world of web3 via the woman and youth-focused blockchain education initiative CryptoChicks. The Metis co-founder said such global programs are pivotal for the industry's evolution, fostering inclusivity, innovation and skills development to \"level the playing field, democratize blockchain and enhance diversity to ensure a stronger, more equitable industry worldwide.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Deutsche Bank","content":"ORGANIZATION"},{"type":"Central Bank Digital Currencies","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"-3.62%","content":"PERCENT"},{"type":"Linea","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"last 18","content":"DATE"},{"type":"24 months","content":"DATE"},{"type":"-3.49%","content":"PERCENT"},{"type":"-0.91%","content":"PERCENT"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Mantle","content":"PERSON"},{"type":"Metis","content":"ORGANIZATION"},{"type":"ZKM Econode","content":"ORGANIZATION"},{"type":"MetisDAO Foundation","content":"ORGANIZATION"},{"type":"Sinelnikova","content":"PERSON"},{"type":"EVM (Ethereum Virtual Machine)","content":"ORGANIZATION"},{"type":"Elena Sinelnikova","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ARBITRUM","BASE","ETHEREUM","OPTIMISM","ZKSYNC"],"authors":["James Hunt","The Block"]}