{"summary":"A 2022 report from the Financial Reporting Council concluded that Mazars lacks &quot;adequate controls to ensure high quality audits.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193935\/skepticism-mazars-crypto-exchange","publishDate":"2022-12-11T09:14:16","id":4959,"type":null,"title":"Skepticism pervades crypto exchange liabilities reports, and Mazars","category":["EXCHANGES"],"content":["Questions are being asked about recent \"not-audits\" of crypto exchanges, as well as their preferred accounting firm, Mazars.","Binance, the biggest crypto exchange by volume, <a href=\"https:\/\/www.theblock.co\/post\/192861\/binance-collateralized-mazars-audit\" data-v-f87c67ca=\"\">released<\/a> a proof-of-reserves and proof-of-liabilities verification on Wednesday. It was conducted by accounting firm Mazars' South African affiliate, and only some are satisfied with the level of transparency and information provided.","\"Mazars’ report only shows a part of Binance's assets and liabilities,\" notes Eden Au, a research director at The Block, who added: \"More information is needed to get a sense of the whole picture of the exchange’s solvency.\"","Douglas Carmichael, an accounting professor at Baruch College and former chief auditor of the U.S. Public Company Accounting Oversight Board, <a href=\"https:\/\/www.wsj.com\/articles\/binance-is-trying-to-calm-investors-but-its-finances-remain-a-mystery-11670679351\" data-v-f87c67ca=\"\">told<\/a> the Wall Street Journal something similar when he said that he \"can’t imagine it answers all the questions an investor would have about the sufficiency of collateralization\" and isn't satisfactory to prove the exchange's finances or liquidity.","Indeed, the report's fine print clarifies that it should not be considered an audit, which Mazars also noted to The Block.","Others have taken a more cynical view. The well-known Twitter account \"mgnr\" went so far as to <a href=\"https:\/\/twitter.com\/mgnr_io\" data-v-f87c67ca=\"\">suggest<\/a> that Binance may be co-mingling specific wallet addresses with exchange deposits and even choosing \"to <a href=\"https:\/\/twitter.com\/mgnr_io\/status\/1601326064818454528\" data-v-f87c67ca=\"\">mislead<\/a>.\" Kraken CEO Jesse Powell <a href=\"https:\/\/twitter.com\/jespow\/status\/1600787933065117696\" data-v-f87c67ca=\"\">tweeted<\/a> that competitor Binance's report \"OBVIOUSLY is not a traditional Proof of Reserves.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nFormer SEC enforcement chief John Reed Stark <a href=\"https:\/\/twitter.com\/johnreedstark\/status\/1601760070806560768?s=46&amp;t=dYUpg9kk4F21vVNXnXYlKw\" data-v-f87c67ca=\"\">also chimed in<\/a>, saying the report, \"doesn’t address effectiveness of internal financial controls, doesn’t express an opinion or assurance conclusion and doesn’t vouch for the numbers. I worked at SEC Enforcement for 18+ yrs. This is how I define “red flag.\"","Binance aside, Mazars has proven to be a favorite for crypto exchanges looking to tell the world that their reserves are in order. Crypto.com <a href=\"https:\/\/www.theblock.co\/post\/193684\/crypto-com-releases-proof-of-reserves-study-conducted-by-mazars\" data-v-f87c67ca=\"\">released<\/a> its own proof-of-reserves report from Mazars on Friday, and KuCoin has <a href=\"https:\/\/www.theblock.co\/post\/192062\/kucoin-engages-auditor-mazars-to-provide-factual-findings-report\" data-v-f87c67ca=\"\">engaged<\/a> the accounting firm to do the same.","Mazars popularity among crypto exchanges has been widely noted, which subsequently brought to light a less-than-glowing review. A 2022 report from the Financial Reporting Council <a href=\"https:\/\/www.frc.org.uk\/getattachment\/264ac8d9-1e9b-4ee9-a1f2-fe2022c1d9e8\/FRC-Audit-Quality-Inspection-and-Supervision-Public-Report-2022-Tier-1-Firms-Overview_July-2022.pdf\" data-v-f87c67ca=\"\">concluded<\/a> that Mazars has \"been growing too fast, picking up higher risk audits being dropped by their peers, without adequate controls to ensure high quality audits.\" FRC explained:","\"Four of the eight audits that we reviewed at Mazars and five of the 12 audits that we reviewed at BDO needed more than limited improvements. Three and four audits at Mazars and BDO respectively needed significant improvements. These results are worse than last year and suggest a downward trend which is unacceptable.\"","There is a long-standing industry maxim that says: \"Don't trust. Verify.\" It remains to be seen if the wider industry will accept these current proof-of-liabilities reports from Mazars or demand increased financial transparency from private crypto exchanges.","\"It's great to see exchanges being more transparent,\" Au said, \"but more work needs to be done.\"","<em data-v-f87c67ca=\"\">Updated to add a critical tweet from Kraken CEO Jesse Powell and John Reed Stark.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mazars","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Financial Reporting Council","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"U.S. Public Company Accounting Oversight Board","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"KuCoin","content":"ORGANIZATION"},{"type":"John Reed Stark","content":"ORGANIZATION"},{"type":"BDO","content":"ORGANIZATION"},{"type":"Douglas Carmichael","content":"PERSON"},{"type":"SEC Enforcement","content":"ORGANIZATION"},{"type":"Jesse Powell","content":"PERSON"},{"type":"FRC","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Mazars","content":"PERSON"},{"type":"Baruch College","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BINANCE"],"authors":["Adam James","The Block"]}