{"summary":"The German cloud provider has blocked server access to Solana validators, causing a portion of the network’s stake to become delinquent.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/182283\/1000-solana-validators-go-offline-as-hetzner-blocks-server-access","publishDate":"2022-11-02T13:11:16","id":4960,"type":null,"title":"1,000 Solana validators go offline as Hetzner blocks server access","category":["INFRASTRUCTURE"],"content":["More than 1,000 Solana validators currently are offline causing more than one-fifth of the Solana stake that secures the network to be delinquent","The downtime is because Hetzner, a cloud service provider, has blocked all Solana network activity on its servers.","Data from the RockawayX infrastructure <a href=\"https:\/\/grafana.rbf.capital\/d\/U8VH9rhGk\/rockawayx-solana-validator?orgId=1&amp;from=now%2Fy&amp;to=now&amp;viewPanel=51&amp;kiosk\" data-v-f87c67ca=\"\">dashboard<\/a> show the Solana network delinquent stake ratio at 22% — the highest since May. This ratio refers to the percentage of the Solana stake that is currently delinquent.","A Solana stake becomes delinquent when the validator that the stake was delegated to goes offline. At this point, the validators and the delegator do not earn rewards.","Hetzner was already contemplating a ban on crypto node operators, according to a <a href=\"https:\/\/www.theblock.co\/post\/165976\/host-of-10-of-ethereum-nodes-prohibits-crypto-usage-discussing-consequences\" data-v-f87c67ca=\"\">previous report by The Block<\/a>. The company’s terms of service state that crypto activity is prohibited. At the time, the company’s attention was focused on Ethereum node operators as it was host to about 16% of all Ethereum hosting nodes. This number has since fallen to 12%.","Now, it appears that Hetzner has taken action against Solana validators. Hetzner did not immediately respond to The Block’s request for comments on the matter.","The Solana network seems to be unaffected despite having 22% of the network’s security vote offline. The Solana status <a href=\"https:\/\/status.solana.com\/\" data-v-f87c67ca=\"\">page<\/a> is not showing any outages, as of the time of reporting. The network has previously <a href=\"https:\/\/www.theblock.co\/post\/174182\/solana-back-online-following-latest-network-outage\" data-v-f87c67ca=\"\">suffered numerous network outages<\/a>.","Delegators and validators affected by Hetzner’s move will have to find suitable alternatives to resume earning staking rewards. Solana Labs co-founder Anatoly Yakovenko <a href=\"https:\/\/twitter.com\/aeyakovenko\/status\/1587803589111603200\" data-v-f87c67ca=\"\">called<\/a> on network participants to move their stake elsewhere.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Hetzner","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"16%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"12%","content":"PERCENT"},{"type":"22%","content":"PERCENT"},{"type":"Anatoly Yakovenko","content":"PERSON"},{"type":"Solana","content":"PERSON"}],"hashtag":["CENSORSHIP","SOLANA","VALIDATORS"],"authors":["Osato Avan-Nomayo","The Block"]}