{"summary":"Fraxtal, developed as an optimistic rollup using the OP stack, will join the Optimism Superchain ecosystem alongside Coinbase-backed Base.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276634\/frax-fraxtal-launch","publishDate":"2024-02-08T05:09:07","id":4968,"type":null,"title":"Frax launches Layer 2 network Fraxtal with partner apps","category":["LAYER 2S AND SCALING"],"content":["<span data-v-f87c67ca=\"\">DeFi project Frax Finance has released its Ethereum Layer 2 network, Fraxtal. <\/span><span data-v-f87c67ca=\"\">A restricted mainnet was activated today for specific partner apps.<\/span>","<span data-v-f87c67ca=\"\">Fraxtal operates as an Ethereum-compatible optimistic rollup developed using the <a href=\"https:\/\/docs.optimism.io\/?ref=blog.defisaver.com\" data-v-f87c67ca=\"\">OP Stack.<\/a> It will be part of Optimism's Superchain ecosystem alongside<\/span>&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/232158\/coinbase-backed-base-targeting-mainnet-launch-after-optimisms-bedrock-upgrade\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Coinbase-backed Base.<\/span><\/a>","<span data-v-f87c67ca=\"\">Fraxtal is currently limited to launch partners — including decentralized infrastructure providers such as Safe, Chainlink oracles, and Axelar and LayerZero bridges.<\/span>","<span data-v-f87c67ca=\"\">General users are expected to be able to access the chain in the coming days. The network will function as a dapps platform focused on decentralized finance.<\/span>","<span data-v-f87c67ca=\"\">Frax is the creator of the decentralized Frax stablecoin and Frax Ether, hosting a total value locked of over<\/span> <a href=\"https:\/\/defillama.com\/protocol\/frax-finance\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$1 billion<\/span><\/a><span data-v-f87c67ca=\"\">. The project is governed via Frax Shares (FXS) tokens.<\/span>","<span data-v-f87c67ca=\"\">On Mar. 6, an airdrop snapshot will be taken for holders of vote-escrowed Frax Shares (FXS) tokens, who will be given Fraxtal (FXTL) points. The team did not clarify if the points would be replaced by a separate token.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Mar. 6","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Frax Finance","content":"ORGANIZATION"},{"type":"Fraxtal","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"}],"hashtag":["BASE","OPTIMISM"],"authors":["Vishal Chawla","The Block"]}