{"summary":"Dune Analytics has hit a valuation of $1 billion with its Series B round. \nDune has big plans in place, including building a community of 1 million analysts and building an API, CEO Fredrik Haga told The Block.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/132759\/dune-analytics-crypto-series-b-valuation-1-billion","publishDate":"2022-02-02T09:00:49","id":497,"type":null,"title":"Dune Analytics raises $69.42 million in Series B, now valued at $1 billion","category":["Venture Capital"],"content":["Crypto analytics platform Dune has entered the unicorn club with its latest $69,420,000 Series B round.","The round was led by hedge fund Coatue and brings Dune Analytics' valuation to $1 billion, <a href=\"https:\/\/www.theblockcrypto.com\/post\/127759\/dune-analytics-is-raising-funds-at-a-1-billion-valuation-sources\" data-v-f87c67ca=\"\">confirming The Block's reporting<\/a> from last month. Existing investors, including Multicoin Capital and Dragonfly Capital, also participated in the round.","Dune has big plans in place with fresh capital in hand. It looks to build a community of up to 1 million analysts, support more blockchains, build an API, and massively expand its team, the firm's co-founder and CEO Fredrik Haga told The Block.","Founded in 2018, Dune lets users create data charts and dashboards on metrics such as DEX and NFT trading volumes. The platform currently has 10,000 analysts and 100,000 pieces of analysis. Dune is accessible to the public for free, but it also has a paid product for customized data, for which it charges $390 per month per user.","Dune calls its community of analysts \"Dune Wizards\" and pays many of them for creating dashboards, said Haga. The firm plans to bring more analysts to the platform and reward them as there is an ocean of blockchain data still largely underutilized, according to Haga. \"We think this open data opportunity will enable a new generation of analysts to find work in and add value in crypto communities,\" he said.","Haga went on to say that many non-developers have already learned the SQL programming language, became Dune Wizards, and then got a full-time job in the crypto space.","Dune Wizards get paid in crypto, Haga said. When asked if Dune is looking to launch its native token, he said there are no current plans.","He also declined to comment on whether the Series B round was equity or token round realized via a simple agreement for future tokens (SAFT) sale. Dune's <a href=\"https:\/\/www.theblockcrypto.com\/post\/114343\/dune-analytics-crypto-data-series-a-funding\" data-v-f87c67ca=\"\">Series A round<\/a> announced last July was an equity round worth $8 million. At the time, the startup did not disclose its valuation.","Besides building up a large community of analysts, Dune also plans to support more blockchains to its platform. It currently helps fetch data from Ethereum, Polygon, Optimism, Binance Smart Chain, and xDAI. Haga said all the major Ethereum Virtual Machine (EVM) chains, Solana, and other networks will also be supported.","Dune is also looking to build a \"much-requested\" API. It is also planning to scale its current team of around 20 people to about 200, said Haga.","Dune is among several crypto startups that have seen its valuation shot up in a short time. Last year, at least 40 crypto firms reached unicorn status, according to <a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2021\/12\/The-Block-Research-2022-Digital-Asset-Outlook.v2.pdf\" data-v-f87c67ca=\"\">The Block Research<\/a>.","When asked what is causing soaring valuations of crypto startups, especially crypto data startups, Haga said, as more and more financial activity moves to crypto, providing data presents an opportunity that is \"many times bigger than any data business or product the world has seen to date.\"","The Series B round brings Dune's total funding to date to $80 million. The firm isn't looking to raise more funds in the near future, Haga said."],"hashtag":[]}