{"summary":"The Worldcoin Foundation also announced changes to its deals with market makers, which may affect the WLD token&#x27;s circulating supply.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/258862\/worldcoin-to-pay-orb-operators-in-wld-rather-than-usdc","publishDate":"2023-10-22T21:27:58","id":4974,"type":null,"title":"Worldcoin to pay orb operators in WLD rather than USDC","category":["CRYPTO ECOSYSTEMS"],"content":["The Worldcoin Foundation will soon pay orb operators, who scan people into the Worldcoin network, in WLD tokens rather than USDC stablecoins. The foundation expects to complete the transition by next month, according to its <a href=\"https:\/\/worldcoin.org\/blog\/announcements\/update-circulating-supply-evolution-renewal-market-maker-loan-agreements\" data-v-f87c67ca=\"\">announcement<\/a>, which is not visible to users in the United States.&nbsp;","The Foundation also gave an update on the WLD token's circulating supply, which has reached over 1% of its total supply of 10 billion tokens. Of the approximately 134 million WLD issued, 100 million were given as loans to market makers while 34 million have been distributed to users and orb operators in the form of grants.&nbsp;","With the loans set to expire on Oct. 24, Worldcoin announced that the agreements would be renewed until December 15 of this year with a reduced amount of 75 million tokens; the market makers will return or, alternatively, purchase some or all of the remaining 25 million as part of the agreement.&nbsp;","Despite \"operational challenges\" <a href=\"https:\/\/www.theblock.co\/post\/250924\/sam-altman-says-worldcoin-faces-huge-operational-challenges-as-demand-grows\" data-v-f87c67ca=\"\">cited<\/a> by Sam Altman — the co-founder of Worldcoin, who's best known for founding OpenAI, the company behind ChatGPT — Worldcoin's token grants appear to be <a href=\"https:\/\/dune.com\/worldcoin\/worldcoin\" data-v-f87c67ca=\"\">growing steadily over time<\/a>, following an initial period of hyped adoption.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Foundation","content":"ORGANIZATION"},{"type":"December 15 of this year","content":"DATE"},{"type":"Oct. 24","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Worldcoin Foundation","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"United States","content":"LOCATION"},{"type":"Sam Altman","content":"PERSON"},{"type":"Worldcoin","content":"PERSON"}],"hashtag":[],"authors":["Zack Abrams","The Block"]}