{"summary":"Square, Twitter CEO Jack Dorsey’s payment company, has purchased $50 million worth of bitcoin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/80175\/jack-dorsey-square-purchases-50-million-worth-of-bitcoin","publishDate":"2020-10-08T09:15:37","id":4976,"type":null,"title":"Jack Dorsey’s Square purchases $50 million worth of bitcoin ","category":["BITCOIN"],"content":["Square, Twitter CEO Jack <a href=\"https:\/\/www.theblockcrypto.com\/linked\/27308\/we-need-a-global-currency-for-the-internet-says-twitters-jack-dorsey\" data-v-f87c67ca=\"\">Dorsey<\/a>’s payment company, has purchased around 4,709 bitcoin at an aggregate purchase price of $50 million, i.e. at an average price of around $10,600 per bitcoin.","Announcing the news on Thursday, Square <a href=\"https:\/\/squareup.com\/us\/en\/about\/investors\/press\/2617c157-c2b1-46d7-8277-623c96f3f96c\" data-v-f87c67ca=\"\">said<\/a> “cryptocurrency is an instrument of economic empowerment and provides a way to participate in a global monetary system, which aligns with the company’s purpose.”","The investment represents approximately 1% of Square’s total assets as of Q2 2020.","\"We believe that bitcoin has the potential to be a more ubiquitous currency in the future,\" said Square’s CFO Amrita Ahuja. \"As it grows in adoption, we intend to learn and participate in a disciplined way. For a company that is building products based on a more inclusive future, this investment is a step on that journey.\"","Square has become the second U.S.-based publicly-listed company after MicroStrategy to invest in bitcoin.","MicroStrategy has <a href=\"https:\/\/www.theblockcrypto.com\/linked\/77796\/microstrategy-buys-more-bitcoin\" data-v-f87c67ca=\"\">purchased<\/a> a total of 38,250 bitcoins to date, currently worth $410 million, as part of its capital allocation strategy. CEO Michael Saylor <a href=\"https:\/\/www.theblockcrypto.com\/daily\/78646\/microstrategy-ceo-interview-bitcoin-gold-dollar\" data-v-f87c67ca=\"\">told The Block in an interview<\/a> last month that bitcoin is the “best money ever created.”","Saylor said, compared to gold and the U.S. dollar, bitcoin is a superior asset for a treasury given it is not deflationary by design.","“Gold is defective in the 21st century,” he said of bullion. \"It boils down to a very simple principle. It's going to debase between 2% and 4% a year, certainly over the next hundred years.\" As for the dollar, Saylor said, the problem is monetary policy expansion and inflation — which comes at the cost of purchasing power.","Saylor also revealed in the interview that 90% of MicroStrategy's treasury balance is in the form of bitcoin.","As for Square, the company has been active in the bitcoin space since 2018 when its Cash App offering enabled buying and selling of the cryptocurrency.","In 2019, the company formed Square Crypto, an independent team solely focused on contributing to bitcoin's open-source work. Most recently, it launched the Cryptocurrency Open Patent Alliance (COPA), a non-profit organization encouraging crypto innovation and opening access to patented crypto inventions.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Amrita Ahuja","content":"PERSON"},{"type":"90%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"21st century","content":"DATE"},{"type":"2%","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"$410 million","content":"MONEY"},{"type":"Jack <a href=\"https:\/\/www.theblockcrypto.com\/linked\/27308\/we-need-a-global-currency-for-the-internet-says-twitters-jack-dorsey\" data-v-f87c67ca=\"\">Dorsey","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"$10,600","content":"MONEY"},{"type":"1%","content":"PERCENT"},{"type":"2020","content":"DATE"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Saylor","content":"PERSON"},{"type":"$50 million","content":"MONEY"},{"type":"Michael Saylor","content":"PERSON"}],"hashtag":["BITCOIN","TWITTER"],"authors":["Yogita Khatri","The Block"]}