{"summary":"The world&#x27;s second-largest bitcoin mining pool has launched a bitcoin hashrate token in an effort to bridge pow mining and yield farming.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/90847\/poolin-bitcoin-hashrate-token-pow-defi","publishDate":"2021-01-12T12:35:35","id":498,"type":null,"title":"Poolin rolls out &#x27;hash rate token&#x27; to bridge bitcoin mining and DeFi","category":["BITCOIN"],"content":["Poolin, the second-largest bitcoin mining pool, has launched an ERC-20 token backed by its bitcoin hash rate capacity in an effort to bridge proof-of-work (PoW) mining and yield farming.","The token is called pBTC35A. As the name suggests, each unit represents 1 terahash second (TH\/s) of hashing power owned by Poolin at a power efficiency of 35 Joule per TH. In an experiment to connect proof-of-work mining with decentralized finance (DeFi), Poolin has also launched a protocol called <a href=\"https:\/\/mars.poolin.fi\/\" data-v-f87c67ca=\"\">Mars<\/a>.","Users who stake pBTC35A or the trading pair of pBTC35A against USDT in one of the two liquidity pools on the Mars Protocol can receive rewards in the form of the Mars governance token as well as Wrapped BTC (wBTC). The calculation is based on the amount of bitcoin that the underlying hash rate can mine at the network's current difficulty after deducting a set electricity cost and Poolin's 2.5% fees.","The mining pool said that, at this stage, it is selling up to 50,000 pBTC35A, which is equivalent to 50,000 TH\/s of computing power backed by the newest bitcoin ASIC miners hosted at Poolin's facilities.","\"By setting just two parameters, power efficiency (35 J\/TH) and electricity cost ($0.0583\/kWh), pBTC35A helps standardize bitcoin hash rate and provides a benchmark for the pricing of bitcoin ASIC miners in the future,\" said Kevin Pan, co-founder and CEO of Poolin. \"Since the power efficiency ratio and electricity cost are given, it's also more transparent to calculate the corresponding mining results on chain [compared to traditional cloud mining].\"&nbsp;","As of press time, over 8,500 pBTC35A tokens have been sold. Users either buy the hash rate token directly from Poolin at a price of 100 USDT per a unit or via the trading pair of pBTC35A against USDT on Uniswap, which is priced at $101 as of the time of writing.","Notably, such an offering carries a price premium compared to the cost of each TH\/s of spot orders for the newest bitcoin ASIC miners.","For instance, Chinese wholesalers are now asking more than 40,000 yuan ($6,200) for a spot stock of Bitmain's AntMiner S19, which has a computing power of 95 TH\/s. That means 1 TH\/s of spot S19 inventory is worth nearly $70.","According to Pan, what buyers get in return for paying such a premium are the perpetual bitcoin mining rewards without the issues that physical miner operators or cloud miners may encounter, including unexpected power shutdowns or power drops due to depreciation.","The wBTC mining rewards will be paid out perpetually if users stake pBTC35A in the Mars liquidity pools until bitcoin's price drops significantly to a level that would make it no longer profitable to mine with a power efficiency of 35 J\/TH at an electricity cost of $0.058 per kWh.&nbsp;","Bitmain's S19, for example, has a standard power efficiency ratio of 34 J\/TH. At bitcoin's current mining difficulty and an electricity cost of $0.058 per kWh, the S19 becomes unprofitable if bitcoin's price drops below $6,551, according to miner profitability data tracked by Poolin and F2Pool.&nbsp;","Poolin said that similar hash rate tokens for ETH and other PoW coins are in the pipeline but there's no firm release schedule yet in place.&nbsp;The hash rate token comes at a time when bitcoin mining is becoming highly competitive due to bitcoin's rising price, which caused a significant shortage in the market for new hardware.","Last week, a project called <a href=\"https:\/\/www.1-b.tc\/#\" data-v-f87c67ca=\"\">1-b.tc<\/a> rolled out similar products in an attempt to standardize bitcoin's mining hash rate. The project, backed by the hash power provided by mining farms &nbsp;360power and Ke Wo Ying Mining, launched the so-called BTC Standard Hashrate Token (BTCST) via Binance's <a href=\"https:\/\/research.binance.com\/en\/projects\/btcst\" data-v-f87c67ca=\"\">Launchpool<\/a>.","Users staking BNB, BTC or BUSD in liquidity pools can receive rewards from an initial supply of 40,000 BTCST, each of which represents 0.1 TH\/s of computing power. By staking BTSCT via the project's dApp, users can receive wBTC based on the amount of bitcoin the underlying hash rate is able to generate.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bitmain","content":"ORGANIZATION"},{"type":"Poolin","content":"PERSON"},{"type":"USDT","content":"ORGANIZATION"},{"type":"Kevin Pan","content":"PERSON"},{"type":"$0.0583\/kWh","content":"MONEY"},{"type":"Poolin","content":"ORGANIZATION"},{"type":"$6,200","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$6,551","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"2.5%","content":"PERCENT"},{"type":"Joule","content":"ORGANIZATION"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"BTC Standard Hashrate Token (BTCST","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"$0.058","content":"MONEY"},{"type":"$101","content":"MONEY"},{"type":"Wrapped BTC","content":"ORGANIZATION"},{"type":"$70","content":"MONEY"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":[],"authors":["Wolfie Zhao","The Block"]}