{"summary":"The usual suspects of interoperability and utility were on the slate as talking points.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/154683\/fashion-industry-leans-into-nft-experimentation-in-spite-of-bear-market-woes","publishDate":"2022-06-29T13:10:52","id":4986,"type":null,"title":"Fashion industry leans into NFT experimentation in spite of bear market woes","category":["METAVERSE & NFT"],"content":["<span data-v-f87c67ca=\"\">If you attended any fashion-related panel discussions last week at the annual NFT.NYC conference, you’d never know that just a week prior, popular non-fungible token (NFT) projects had their floor prices drop <a href=\"https:\/\/www.theblock.co\/post\/151754\/nft-floor-prices-are-falling-along-with-the-broader-crypto-market\" data-v-f87c67ca=\"\">as much as 30%<\/a>, or the price of bitcoin and ether plunged.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In fact, the mood seemed generally optimistic, with discussions focused on launching successful NFT projects, building online communities and highlighting the technical challenges related to selling digital fashion to consumers.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The usual suspects of interoperability and utility were on the slate as talking points. In the context of digital fashion, interoperability refers to being able to carry an avatar or fashion to dress the avatar through multiple 'metaverses' or online games.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Though this concept came up multiple times throughout the week, examples of progress or insight into addressing it were few and far between. This could be because panels were often given less than 30 minutes on stage; never enough time to dig into complex topics, but just enough to loosely cover them at a high level.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Panelists also tended to agree that having tangible use-cases for NFTs, such as access to exclusive events and merchandise, provided more value long-term than just an NFT that’s merely nice to look at.<\/span>","<span data-v-f87c67ca=\"\">But discussions around how to weather larger macro trends and market volatility, as well as how to survive a looming recession were scant, though the topic was top of mind for many attendees.<\/span>","<span data-v-f87c67ca=\"\">In the times that the bear market did come up, the message was to use it as an opportunity to grow a brand or experiment to come out stronger on the other side.<\/span>","<span data-v-f87c67ca=\"\">Stefano Rosso, the founder of D-Cave, a digital lifestyle hub, said at the conference that a down market will kill the weakest projects that focus on hype, while the ones with long-term vision and strong road maps will survive.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This sentiment tended to be shared by other panelists throughout the week, some of whom spoke about their ongoing experiments in digital assets.<\/span>","<span data-v-f87c67ca=\"\">“For us, we’re still seeing what works. And still excited to see what really resonates with our consumer,” said fashion designer Rebecca Minkoff during a panel at an event hosted by The Sandbox. <\/span>","<span data-v-f87c67ca=\"\">A day later, Minkoff launched an NFT collection in collaboration with Mavion, a global fashion and NFT marketplace with NFTs that offer holders access to both digital and experiential perks.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">And so did a handful of other big brands. Gucci<a href=\"https:\/\/www.theblock.co\/post\/153785\/gucci-buys-into-superrare-dao-eyes-new-virtual-art-space\" data-v-f87c67ca=\"\"> announced<\/a> joining its first decentralized autonomous organization with SuperRare. Burberry relaunched its NFT-based game last week after a successful launch last summer. Louis Vuitton filed four trademark applications dated June 23 for NFTs, virtual goods, and digital collectibles. Italian luxury brand Salvatore Ferragamo <a href=\"https:\/\/www.theblock.co\/post\/154171\/italian-luxury-brand-salvatore-ferragamo-installs-nft-booth-in-soho\" data-v-f87c67ca=\"\">installed an NFT booth<\/a> in New York City.&nbsp;<\/span><span data-v-f87c67ca=\"\">And yesterday, Adidas partnered with British soccer team WAGMI United to explore the future of sports in web3.<\/span>","<span data-v-f87c67ca=\"\">The projects that will survive long-term, according to LVMH’s web3 leader Nelly Mensah, are the ones that find an overlap between who their customer is and who the current web3 consumer is. LVMH has <a href=\"https:\/\/www.theblock.co\/post\/152214\/tag-heuer-rolls-out-nft-feature-for-some-smartwatch-models\" data-v-f87c67ca=\"\">recently done this with<\/a> TAG Heuer, which has found an overlap between watch collectors and NFT collectors.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The biggest brands experimenting in this space aren’t backing down, said Michael Litman, Senior Director of Web3 and NFT at Media Monks, an advertising firm. “We work with brands on a global level, with the likes of Gucci and Cool Cats and Ledger, which are building for the long-term rather than the here and now,\" he said. \"The NFT community has quite a short attention span and goes on to the next thing very quickly. Our advice is, be agile and experimental but be building now for when the bull run begins again.” <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York City","content":"LOCATION"},{"type":"Nelly Mensah","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"LVMH","content":"ORGANIZATION"},{"type":"Minkoff","content":"PERSON"},{"type":"Adidas","content":"ORGANIZATION"},{"type":"Cave","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Stefano Rosso","content":"PERSON"},{"type":"Rebecca Minkoff","content":"PERSON"},{"type":"Michael Litman","content":"PERSON"},{"type":"WAGMI United","content":"ORGANIZATION"},{"type":"Mavion","content":"PERSON"},{"type":"summer","content":"DATE"},{"type":"Salvatore Ferragamo","content":"PERSON"},{"type":"Gucci","content":"ORGANIZATION"},{"type":"June 23","content":"DATE"}],"hashtag":[],"authors":["Anushree Dave","The Block"]}