{"summary":"tZERO, the blockchain subsidiary of online retailer Overstock.com, has laid off staff and cut salaries to reduce overall expenditures. tZERO provides tokenization services and a marketplace for the trade of digital securities.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/73295\/tzero-layoffs-salaries-overstock","publishDate":"2020-07-29T10:29:15","id":4987,"type":null,"title":"Overstock&#x27;s blockchain arm tZERO lays off staff, cuts salaries","category":["LAYER 1S"],"content":["tZERO, the blockchain subsidiary of online retailer Overstock.com, disclosed Wednesday that it has moved to lay off staff and cut salaries to reduce overall expenditures.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIn a <a href=\"https:\/\/www.businesswire.com\/news\/home\/20200729005299\/en\/tZERO-CEO-Saum-Noursalehi-Update-Company-Progress\" data-v-f87c67ca=\"\">letter to investors published<\/a> on Wednesday, tZERO CEO Saum Noursalehi said the company had taken the decision to prepare for “heavy” development work ahead and an external funding round.","Noursalehi did not provide specific details on the job and pay cuts, but said “several leaders” accepted cash salary reductions and received additional equity compensation. “I personally reduced my salary by 60%. Our board members are also now only compensated with equity,” said Noursalehi.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nNoursalehi said the cost-cutting measures have resulted in almost 45% savings in tZERO’s cash burn year-over-year.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nPost the publication of this story, Noursalehi told The Block in a statement that a \"large portion of the expense reductions was in reducing outside legal fees, as well as reductions in our tech department. Many of these resources were from Overstock\/Medici and moved back to our parent company.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nNoursalehi didn't disclose specific numbers, but said the job cuts were in areas where the company was \"deemphasizing certain efforts or had redundancies and have added to areas (e.g., business development), where the company is placing a greater focus.\" The current headcount of tZERO remains unknown.","Founded in 2014, tZERO provides tokenization services and a marketplace for the trade of digital securities. Looking ahead, Noursalehi said the company is focused on providing services to real estate and pre-initial public offering (IPO) companies.","“This represents the largest category of potential issuers as there are not many liquidity solutions available to these types of assets today,” said Noursalehi.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIn the statement to The Block, Noursalehi said tZERO's goals are \"to get more assets on the platform, increase liquidity, and enhance the investor experience.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"We have reallocated resources, both human and financial, to better align with these goals. At the same time, we are reducing costs and optimizing the business from a financial standpoint, ahead of our capital raise,\" he added. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nNoursalehi has tZERO hasn't determined a specific figure for the funding round at this time, but is targeting \"early-mid 2021 for the raise.\"","tZERO will also continue to work with FINRA and the SEC to get an approval for its retail broker-dealer, tZERO Markets, said Noursalehi. The company said it expects to hear from the regulators this quarter.","<em data-v-f87c67ca=\"\">Update (July 30): This story has been updated to include additional comments from tZERO CEO Saum Noursalehi.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"Overstock.com","content":"LOCATION"},{"type":"July 30","content":"DATE"},{"type":"Overstock\/Medici","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"this quarter","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"45%","content":"PERCENT"},{"type":"Saum Noursalehi","content":"PERSON"},{"type":"Noursalehi","content":"PERSON"},{"type":"60%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"FINRA","content":"ORGANIZATION"}],"hashtag":["LAYOFFS"],"authors":["Yogita Khatri","The Block"]}