{"summary":"Following the White House report on crypto assets and climate, Marathon CEO Fred Thiel argued that regulators should incentivize bitcoin miners to use renewable energy.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/170492\/marathons-thiel-regulators-should-incentivize-renewables-for-bitcoin-miners","publishDate":"2022-09-18T11:43:17","id":4989,"type":null,"title":"Marathon&#x27;s Thiel: Regulators should incentivize renewables for bitcoin miners","category":["BITCOIN"],"content":["Marathon CEO Fred Thiel believes U.S. regulators should create incentives for bitcoin miners to use renewable energy and disincentives for fossil fuel-based sources.","Thiel's comments came following a White House report on the environmental implications of crypto mining. In an interview, Thiel pointed to his firm's operations as a model for the industry.","\"Unlike other miners who may be on the grid just sucking energy off the grid in competition with consumers, we do it behind the meter,\" said Thiel. \"It's more symbiotic to the grid versus parasitic.\"","The company announced earlier this year that it would relocate miners from Montana to <a href=\"https:\/\/www.theblock.co\/linked\/140753\/marathon-to-move-its-bitcoin-miners-from-montana-to-new-locations-with-more-sustainable-power-sources\" data-v-f87c67ca=\"\">new locations with \"more sustainable\" power sources<\/a>. One of those is based in West Texas, next to a wind farm with a connection to the grid for periods of inactivity.","Thiel argued that the company is serving two functions. First, as a customer for renewable energy stations, and second by providing the grid access to a large amount of power that it can call upon when needed.","Thiel also believed that the bitcoin mining industry would respond positively to this idea. He added that excess gas which would otherwise be flared should be an exception within fossil fuels.","\"If you provide an incentive for miners to co-locate behind the mediator at renewable energy plants, then miners are going to move there.\"","The White House report said that while miners located in places with excess renewable energy like West Texas \"can provide additional revenue to renewables developers and incentivize the construction of additional renewable energy capacity,\" they can also \"reduce the financial incentives to construct transmission from these renewables to existing users.\"","In response, Thiel argued that the transmission grid won't build more connection capacity unless there is more generation capacity available.","\"It's a chicken-and-egg thing,\" he said. \"Generation capacity can only be increased if there's an economic incentive for the generator to build more capacity.\"","Thiel argued that the White House's findings essentially encourage people to look at ways to look for opportunities to make proof of work more energy efficient while reducing the impact on the environment.","\"Regulators, I think, are educating themselves. They're learning about Bitcoin mining,\" he also said. \"The understanding of what proof of work is and why proof of work is superior to proof of stake is slowly starting to permeate. But it takes time.\"","In reaction to the White House report, Kyle Schneps, the director of public policy at Foundry, said that it was a \"clear case of scapegoating a nascent industry for the purpose of political posturing.\"","\"We must ask ourselves why the cryptocurrency industry is being held to a different standard than every other major business enterprise,\" Schneps said.","Rachel Silverstein, CleanSpark's general counsel and senior vice-president of compliance, said the company would welcome the opportunity of working with the White House in setting \"fair standards\" for the mining industry.","\"We firmly believe that proof-of-work mining is the only way to keep Bitcoin accessible, transparent and open,\" Silverstein said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Rachel Silverstein","content":"PERSON"},{"type":"Montana","content":"LOCATION"},{"type":"West Texas","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Schneps","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Kyle Schneps","content":"PERSON"},{"type":"Fred Thiel","content":"PERSON"},{"type":"Silverstein","content":"PERSON"},{"type":"White House","content":"ORGANIZATION"},{"type":"Thiel","content":"ORGANIZATION"},{"type":"Foundry","content":"ORGANIZATION"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}