{"summary":"Cross-chain protocol deBridge launched DLN Trade, a way for trading tokens across multiple blockchains.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234888\/debridge-introduces-dln-trade-for-native-cross-chain-swaps","publishDate":"2023-06-15T08:00:04","id":4991,"type":null,"title":"deBridge introduces DLN Trade for native cross-chain swaps","category":["DEFI"],"content":["Cross-chain protocol deBridge launched DLN Trade, a way for trading tokens across multiple blockchains.","DLN Trade makes use of decentralized order book to allow for direct trading of any asset on one chain to any asset on another, according to a statement. It avoids the standard method of locking funds into a smart contract, used by most liquidity pool-based decentralized exchanges. It hopes that its alternative design will protect against slippage and frontrunning.","<a href=\"https:\/\/www.theblock.co\/post\/174913\/debridge-announces-deswap-liquidity-network\" data-v-f87c67ca=\"\">DeBridge<\/a> said DLN Trade doesn't have any transfer limits, compared to normal decentralized exchanges, which have limited liquidity. This allows for the execution of trades of any size with the same rates and efficiency, whether it's a $1,000 or a $10 million cross-chain trade. Additionally, DLN enables users to set cross-chain limit orders, cancelable at any time.","DLN Trade also addresses the reliability and security concerns associated with liquidity pool-based infrastructure, deBridge claimed. By pricing any asset on one chain to any asset on another without relying on automated market maker models, DLN aims to mitigate such risks in real-time. This means users can trade across chains without being exposed to wrapped assets or liquidity pools, even during heightened market volatility.","The DLN app is <a href=\"https:\/\/app.dln.trade\/\" data-v-f87c67ca=\"\">live<\/a>, offering support for Ethereum, Arbitrum, Polygon, Fantom, BNB Chain and Avalanche. DLN Trade plans to add support for additional chains soon.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Arbitrum","content":"LOCATION"},{"type":"Fantom","content":"PERSON"},{"type":"DLN","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Polygon","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"$1,000","content":"MONEY"},{"type":"$10 million","content":"MONEY"}],"hashtag":["CROSS-CHAIN SWAPS","DEXS","INTEROPERABILITY"],"authors":["James Hunt","The Block"]}