{"summary":"Matter Labs, the developer of zkSync, has launched the zkSync 2.0 mainnet but is controlling access for now.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/180846\/matter-labs-releases-first-phase-of-zksync-2-0-mainnet-called-baby-alpha","publishDate":"2022-10-28T13:46:12","id":4993,"type":null,"title":"Matter Labs releases first phase of zkSync 2.0 mainnet called &#x27;baby alpha&#x27;","category":["LAYER 2S AND SCALING"],"content":["<span data-v-f87c67ca=\"\">Matter Labs has launched the Ethereum scaling solution zkSync on mainnet in what it's calling a \"baby alpha\" phase, meaning access will initially be very restricted. <\/span>","With the release of zkSync 2.0, the network — going beyond the testnet currently in use — has attained the ability to host smart contracts, letting developers deploy DeFi protocols, NFTs and other types of applications.","<span data-v-f87c67ca=\"\">This is a much-anticipated launch because the scaling solution uses zero-knowledge technology while also being natively compatible with Ethereum applications. This compatibility is what will make it easy and quick for developers to port applications from the Ethereum mainnet to zkSync. In technical terms, it's called a \"zk-EVM.\"<\/span>","<span data-v-f87c67ca=\"\">“zkSync 2.0 launch is going to be the first zkEVM to go into production, which would likely kick start the race for the most optimal zkEVM. As zkEVM matures, it would be able to onboard a significant portion of the Ethereum community and provide the much needed scaling for Ethereum,” said Arnold Toh, a research analyst at The Block.<\/span>","<span data-v-f87c67ca=\"\">For the first month, the network will operate without any external applications open for use, nor will any external participants be able to use it. The team explained that the initial phase is only meant for stress testing and security efforts. <\/span>","<span data-v-f87c67ca=\"\">After this is completed, the next phase is called \"fair alpha.\" This is where developers will be able to port onto zkSync and start building on the network. More than 100 projects have shown interest in deploying their apps on zkSync 2.0, including DeFi protocols like Uniswap — the largest decentralized exchange by volume.<\/span>","The final phase will be when the network is fully open to everyone. This is expected to happen at the end of the year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Arnold Toh","content":"PERSON"}],"hashtag":["ETHEREUM","ZKSYNC"],"authors":["Vishal Chawla","The Block"]}