{"summary":"Worldcoin founder Sam Altman warned of what he said are the U.S. government&#x27;s increasing efforts to control crypto in a &quot;war.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/255467\/worldcoin-sam-altman-us-gov-war-on-crypto-bitcoin","publishDate":"2023-10-09T11:16:55","id":4994,"type":null,"title":"Worldcoin&#x27;s Sam Altman tells Joe Rogan that US government is waging war on crypto","category":["PEOPLE"],"content":["Worldcoin founder and OpenAI CEO Sam Altman voiced his concerns about what he said are the U.S. government's escalating attempts to regulate and control the cryptocurrency market, suggesting that the government's actions are tantamount to waging \"war\" on the industry.","\"There are many things that I'm disappointed that the U.S. government has done recently, but the war on crypto — which I think is a like, we can't give this up, like we're going to control this and all that — that's the thing that makes me quite sad about the country,\" Altman said in a wide-ranging <a href=\"https:\/\/ogjre.com\/episode\/2044-sam-altman\" data-v-f87c67ca=\"\">episode<\/a> of Joe Rogan's podcast.","\"The real fascinating crypto is bitcoin,\" Rogan said. \"To me, I mean, that's the one I think has the most likely possibility of becoming a universal viable currency. It's limited in the amount that there can be. People mine it with their own computers. That to me is very fascinating, and I love the fact that it’s been implemented.\"","\"I helped start a project called Worldcoin a few years ago, so I've gotten to learn more about the space,\" Altman replied. \"I'm excited about it for the same reasons. But I think this idea that we have a global currency that is outside of the control of any government is a super logical and important step on the tech tree.\"","Discussing the regulatory environment in the wake of the collapse of crypto firms like FTX, Altman said he wasn't anti-regulation and there was clearly a role for it. \"But I think there's an important point here, which is you have all of this other regulation … and it didn't keep us safe.\"","Altman also argued that the shift to a technologically enabled world reduces a hindrance to innovation and exposes corruption — but at a cost. \"I am very worried about how far the surveillance state could go here,\" Altman said. \"In a world where payments, for example, are no longer like bags of cash but done somehow digitally and somebody, even if you're using bitcoin, can watch those flows.\"","\"I agree,\" Rogan replied. \"I'm very worried about central bank digital currency and that being tied to a social credit score,\" something Altman said he was also \"super against.\"","The Securities and Exchange Commission's <a href=\"https:\/\/www.theblock.co\/post\/233206\/sec-binance-showdown-sends-shockwaves-through-crypto\" data-v-f87c67ca=\"\">lawsuits<\/a> against exchanges like Coinbase and Binance this year alleging violations of U.S. securities laws are among measures seen by many in the crypto community as part of a <a href=\"https:\/\/www.theblock.co\/post\/253671\/paradigm-says-sec-is-trying-to-change-the-law-with-case-against-binance\" data-v-f87c67ca=\"\">crackdown<\/a> against the industry.","In March, Galaxy Digital CEO Michael Novogratz told a crowd in Miami that the crypto industry is \"<a href=\"https:\/\/www.theblock.co\/post\/224138\/novogratz-operation-choke-point\" data-v-f87c67ca=\"\">under assult<\/a>\" from U.S. regulators, later telling The Block he thinks \"Operation Choke Point 2.0\" — a term used by some to speculate about a possible broader, coordinated crackdown — is real.","In July, Senator Elizabeth Warren also reintroduced a <a href=\"https:\/\/www.theblock.co\/post\/242008\/elizabeth-warren-crypto-bill-policy-group\" data-v-f87c67ca=\"\">crypto bill<\/a> with backing from a banking policy group to \"crack down on crypto's use in money laundering, drug trafficking and financing of terrorism and rogue nations.\"","Worldcoin has faced its own <a href=\"https:\/\/www.theblock.co\/post\/241871\/worldcoins-plan-to-decentralize-orb-production-sparks-illicit-data-harvesting-concerns\" data-v-f87c67ca=\"\">criticism<\/a> from the crypto community and various authorities since launching in July, particularly when it comes to its eyeball-scanning Orbs for ID verification proofs in return for its cryptocurrency WLD.","Worldcoin says it doesn't store the data once the iris scan is done. However, privacy concerns were enough to see <a href=\"https:\/\/www.theblock.co\/post\/242704\/worldcoin-suspended-in-kenya-one-of-its-biggest-markets-for-sign-ups-so-far\" data-v-f87c67ca=\"\">Kenya<\/a> suspend Worldcoin's operations and <a href=\"https:\/\/www.theblock.co\/post\/244289\/argentina-says-its-investigating-worldcoin-over-data-privacy\" data-v-f87c67ca=\"\">Argentina<\/a> launch an investigation into the project in August.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"Kenya","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Miami","content":"LOCATION"},{"type":"July","content":"DATE"},{"type":"Sam Altman","content":"PERSON"},{"type":"Joe Rogan","content":"PERSON"},{"type":"Worldcoin","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Rogan","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Argentina","content":"LOCATION"},{"type":"Altman","content":"PERSON"},{"type":"Michael Novogratz","content":"PERSON"},{"type":"Binance","content":"PERSON"},{"type":"Elizabeth Warren","content":"PERSON"},{"type":"August","content":"DATE"}],"hashtag":["BITCOIN"],"authors":["James Hunt","The Block"]}