{"summary":"After being forced to wind down, Cayman Islands-registered LedgerPrime is restarting with the new name MNNC Group.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279876\/ftx-linked-ledgerprime-reboots-with-new-name-reports-bloomberg","publishDate":"2024-02-29T09:58:14","id":4996,"type":null,"title":"FTX-linked LedgerPrime reboots with new name, reports Bloomberg","category":["COMPANIES"],"content":["Crypto hedge fund LedgerPrime has transformed and adopted a new name&nbsp;according to Bloomberg.","After being forced to wind down due to FTX's bankruptcy, <a href=\"https:\/\/www.theblock.co\/linked\/15010\/ledgerprime-raises-12-million-in-funding\" data-v-f87c67ca=\"\">LedgerPrime<\/a> has restarted with several former employees as MNNC Group. The new team includes Shiliang Tang, who served as Chief Investment Officer at LedgerPrime.","\"The Cayman Islands-registered, multi-strategy hedge fund has raised an undisclosed amount of money from backers, including those who invested in LedgerPrime, a subsidiary of Ledger Holdings, which was acquired by FTX US in 2021,\" the report said.","MNNC Group has 11 staffers, most of whom come from LedgerPrime, the report also said. At its peak, LedgerPrime managed as much as $400 million and recorded an annualized return average of approximately 40%, MNNC group told Bloomberg.","Earlier this year, LedgerPrime alumni Zaheer Ebtikar and Michael Churchouse also <a href=\"https:\/\/www.theblock.co\/post\/273562\/ex-ledgerprime-employees-start-liquid-token-hedge-fund-called-split-capital\" data-v-f87c67ca=\"\">launched a new fund<\/a> called Split Capital. That fund focuses on taking a longer view with an emphasis on liquid token investments.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"LedgerPrime","content":"ORGANIZATION"},{"type":"Shiliang Tang","content":"PERSON"},{"type":"Cayman Islands","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Michael Churchouse","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"},{"type":"Ledger Holdings","content":"ORGANIZATION"},{"type":"Zaheer Ebtikar","content":"PERSON"},{"type":"$400 million","content":"MONEY"},{"type":"MNNC Group","content":"ORGANIZATION"},{"type":"MNNC","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}