{"summary":"After initially selling 1 million Optimism tokens after the hack, the attacker has now sent another 1 million OP to Vitalik Buterin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/151039\/optimism-exploiter-sends-1-million-op-tokens-to-vitalik-buterins-wallet","publishDate":"2022-06-09T06:25:47","id":4997,"type":null,"title":"Optimism exploiter sends 1 million OP tokens to Vitalik Buterin&#x27;s wallet","category":["HACKS"],"content":["The attacker who sniped 20 million Optimism (OP) tokens meant for crypto market maker Wintermute has sent 1 million of those coins to Ethereum co-founder Vitalik Buterin’s wallet address, <a href=\"https:\/\/twitter.com\/PeckShieldAlert\/status\/1534714266452135936\" data-v-f87c67ca=\"\">according<\/a> to PeckShield.","Data from Etherscan shows the transfer <a href=\"https:\/\/optimistic.etherscan.io\/tx\/0xdb693613d550e38d53d47b5fd07ce505e24e141db146fa1321710c9a86d9db6a\" data-v-f87c67ca=\"\">occurred<\/a> at 12:26 AM UTC with the attacker sending tokens worth about $874,000. It is unclear why they sent the tokens to Buterin's wallet having previously sold a large chunk of them. One element may be that the tokens are largely illiquid on decentralized exchanges, since there is very little liquidity left, and so can't be sold for much at present.","The exploiter also delegated voting rights for the 1 million tokens to Ethereum Foundation security researcher Yoav Weiss. Buterin had also previously delegated his 1,746 OP tokens from the <a href=\"https:\/\/www.theblockcrypto.com\/post\/149414\/optimism-op-token-to-hit-market-today-centralized-exchanges-say\" data-v-f87c67ca=\"\">Optimism airdrop<\/a> to Weiss as well. Weiss has tweeted that he is not the hacker but suggested that the person might be a white hat hacker.","<a href=\"https:\/\/www.theblockcrypto.com\/linked\/150966\/attacker-snipes-20-million-op-tokens-intended-for-wintermute-loan\" data-v-f87c67ca=\"\">The attack<\/a> happened due to a mistake made by Wintermute. The crypto market maker secured a 20 million OP token grant from Optimism but provided a multi-signature Ethereum address that was yet to be deployed on the Optimism network.","This error allowed the hacker to claim the undeployed address on Optimism thereby siphoning all the funds. Wintermute says it bought the 1 million tokens immediately sold by the attacker following the exploit.","Wintermute has asked the hacker to return the stolen OP tokens while offering a consulting role to the entity responsible. The exploiter has one week to respond to Wintermute’s offer but — having sent this further amount to Buterin — now only 18 million of the stolen 20 million are left in their <a href=\"https:\/\/optimistic.etherscan.io\/address\/0x4f3a120e72c76c22ae802d129f599bfdbc31cb81\" data-v-f87c67ca=\"\">wallet<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$874,000","content":"MONEY"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"PeckShield","content":"ORGANIZATION"},{"type":"12:26 AM UTC","content":"ORGANIZATION"},{"type":"Weiss","content":"PERSON"},{"type":"1 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Yoav Weiss","content":"PERSON"},{"type":"Wintermute","content":"ORGANIZATION"},{"type":"Buterin","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Ethereum Foundation","content":"ORGANIZATION"}],"hashtag":["OPTIMISM","VITALIK BUTERIN","WINTERMUTE"],"authors":["Osato Avan-Nomayo","The Block"]}