{"summary":"Orbofi AI, a leading generative AI engine for web3, games, apps, media, and online communities, is thrilled to announce that they&#x27;ve secured a staggering $2.6 million in funding via private and public token sales.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232259\/leading-the-ai-revolution-in-web3-orbofi-ai-raises-2-6m-in-high-profile-funding-round","publishDate":"2023-05-27T09:00:58","id":4998,"type":null,"title":"Leading the AI Revolution in Web3: Orbofi AI Raises $2.8M in High-Profile Funding Round","category":["SPONSORED"],"content":["<a href=\"http:\/\/orbofi.com\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Orbofi AI<\/span><\/a><span data-v-f87c67ca=\"\">, a leading generative AI engine for web3, games, apps, media, and online communities, is thrilled to announce that they've secured a staggering $2.8 million in funding via private and public token sales. The private round was led by a consortium of distinguished venture capital firms including Cogitent Ventures, OIG Capital, CSP DAO, Zephyrus Capital, and Halvings Capital, among others.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">In the highly dynamic world of web3, Orbofi AI is establishing itself as a standout player. Their AI engine empowers users to generate a broad range of content, from visual content, 2D images, and 3D assets, sounds, and a variety of other digital content. Moreover, it enables anyone with a phone to create and monetize&nbsp; AI models, fostering a vibrant and prosperous digital ecosystem.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">With a rapidly expanding user base, Orbofi AI already boasts 95k users worldwide and shows no signs of slowing down. Their mission is bold: to power the imaginations of 2 billion people by turning abstract ideas into tangible digital assets.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">they've forged significant partnerships with key industry giants. These collaborations include work with Triller, the popular social media app with 200 million downloads, and Hollywood actor Danny Trejo. They also utilized their cutting-edge AI systems to create an official 3D space for the 2022 World Cup.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">The Orbofi AI team comprises talented individuals, including ex-Ubisoft developers, former employees of ThreeFold, and seasoned AI\/ML researchers. Further, they are advised by high-profile individuals from some of the world's most influential tech companies.<\/span>","<span data-v-f87c67ca=\"\">Orbofi AI's founder and CEO, Benjelloun Oussama, expressed his enthusiasm about this milestone achievement for the company.<\/span>","<span data-v-f87c67ca=\"\">\"I am absolutely thrilled to take our vision to the next level,\" Benjelloun said. \"This funding empowers us to move closer to our dream of onboarding the next billion people onto the generative AI bandwagon. We're not just creating AI-generated content; we're democratizing it. We're making it accessible for everyone, ensuring that AI models and AI-generated content become a staple in the hands of the masses. We believe that the ability to create should not be confined to a select few but should be a universal tool for expression and innovation.\"<\/span>","<span data-v-f87c67ca=\"\">The new injection of funding will provide the necessary firepower for Orbofi AI to accelerate their pioneering work in the web3 space. The company plans to utilize the funding to grow its engineering and expansion teams. In addition, it's anticipated that these funds will expedite the launch of their mobile app, scheduled for release in Q3 2023.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Soon, Orbofi AI will be releasing an API, aiming to enable developers as well as web2 and web3 applications to seamlessly integrate the Orbofi AI engine into their platforms. This will not only enhance the functionality of these applications but also make the powerful capabilities of Orbofi AI's technology more accessible to a broader audience.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">This substantial raise marks a pivotal moment for Orbofi AI and represents a vote of confidence from some of the most respected names in venture capital. As they continue to innovate at the intersection of AI and web3, the world watches eagerly to see where their ambitions and technology will take them next.<\/span>","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Orbofi AI<\/i><i data-v-f87c67ca=\"\">&nbsp;and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Halvings Capital","content":"ORGANIZATION"},{"type":"Orbofi","content":"PERSON"},{"type":"OIG","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Cogitent Ventures","content":"ORGANIZATION"},{"type":"Triller","content":"PERSON"},{"type":"Danny Trejo","content":"PERSON"},{"type":"Benjelloun","content":"PERSON"},{"type":"Orbofi AI","content":"ORGANIZATION"},{"type":"$2.8 million","content":"MONEY"},{"type":"CSP","content":"ORGANIZATION"},{"type":"Benjelloun Oussama","content":"PERSON"}],"hashtag":[],"authors":["Sponsored","The Block"]}