{"summary":"Delivering on a vision for an interoperable global standard for dollar digital currency, Circle and TRON have partnered to make USD Coin (USDC) available on the TRON blockchain, which has grown to more than 56 million accounts and nearly 2.5 billion transactions since its founding just four years ago. TRON is home to a broad ecosystem for digital assets in Asia and around the world, and the TRON community can now benefit from easy access to the world&#x27;s fastest-growing, regulated dollar digital currency. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/117317\/tron-usdc-now-available","publishDate":"2021-09-10T07:40:34","id":4999,"type":null,"title":"TRON USDC now available","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">Delivering on a vision for an interoperable global standard for dollar digital currency, Circle and TRON have partnered to make USD Coin (USDC) available on the TRON blockchain, which has grown to more than 56 million accounts and nearly 2.5 billion transactions since its founding just four years ago. TRON is home to a broad ecosystem for digital assets in Asia and around the world, and the TRON community can now benefit from easy access to the world’s fastest-growing, regulated dollar digital currency.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">USDC activity on TRON has grown rapidly since its introduction earlier this year. Businesses and individuals can leverage USDC on TRON to capture opportunities in the fast-growing NFT markets, quickly enter and exit crypto trading positions, access dynamic DeFi protocols and more.<\/span>","<span data-v-f87c67ca=\"\">TRON joins a fast-growing list of 3rd-gen blockchains that natively support USDC, including Algorand, Solana and Stellar, which have all brought major benefits to their respective user bases over the last 15 months by leveraging USDC’s transparency, stability, regulatory relationships and strong governance framework under the Centre Consortium.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Businesses can open a free Circle Account to convert, mint and redeem USDC on TRON, plus settle incoming and outbound payments involving marketplace buyers and sellers. Circle Account holders can also swap USDC across all blockchains that support the dollar digital currency and access a robust suite of APIs that support USDC for TRON.&nbsp;&nbsp;<\/span>","<a href=\"https:\/\/hubs.li\/H0W_-bD0\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Open a free Circle Account and access TRON USDC today<\/span><\/a>"],"entity":[{"type":"four years ago","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"TRON","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"last 15 months","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Centre Consortium","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Asia","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}