{"summary":"Nexo had offered rival BlockFi an $850 million deal in July when the latter firm was struggling financially and had signed a non-final deal with FTX, according to a proposal document obtained by The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/187653\/nexo-had-offered-blockfi-an-850-million-deal-to-potentially-acquire-it","publishDate":"2022-11-17T11:55:00","id":5000,"type":null,"title":"Nexo had offered BlockFi an $850 million deal to potentially acquire it","category":["COMPANIES"],"content":["Crypto lender Nexo earlier this year made an unsuccessful offer to acquire troubled rival BlockFi as part of a proposed deal worth about $850 million, according to an \"indicative investment proposal\" document obtained by The Block.","The offer was made in July when BlockFi was struggling financially after losing $80 million due to its exposure to now-bankrupt crypto hedge fund Three Arrows Capital. BlockFi rejected Nexo's offer and chose to stick with a non-final deal with FTX.US, which filed for bankruptcy protection last week alongside sister trading firm Alameda Research.","\"I can confirm that we offered BlockFi a deal in the summer,\" Nexo co-founder Antoni Trenchev told The Block. \"It was a better alternative to the FTX proposal, but BlockFi's management chose to go with FTX. Since it did not make economic sense for them to go with a worse deal, we were perplexed and there were speculations about conflicts of interest.\"","Trenchev said had BlockFi accepted Nexo's offer, it might not have found itself in its current situation. While BlockFi co-founder and Chief Operating Officer Flori Marquez had suggested the company was fine after FTX first faced a liquidity crunch, the fallout spread fast. BlockFi had to <a href=\"https:\/\/www.theblock.co\/post\/186802\/blockfi-says-platform-pause-will-continue\" data-v-f87c67ca=\"\">pause withdrawals<\/a> last week, and the Wall Street Journal <a href=\"https:\/\/www.theblock.co\/post\/187278\/blockfi-preps-possible-chapter-11-bankruptcy-protection-filing-wsj\" data-v-f87c67ca=\"\">reported<\/a> on Wednesday that it was preparing for a possible Chapter 11 bankruptcy protection filing.","\"We already knew by then that Alameda was BlockFi's largest debtor, second only to Three Arrows Capital which they had just liquidated at a loss,\" said Trenchev. \"It is Nexo's belief that our proposal, which focused on better risk management, cost reduction, new products, and markets, could have created a lot of value for all stakeholders — the clients, the shareholders, and BlockFi as a company.\"","Nexo had offered BlockFi a deal worth a total of around $850 million, Trenchev said. It included $30 million for the acquisition of 51% of BlockFi through a combination of cash and equity, $30 million payable to BlockFi's existing shareholders upon successful S1 registration of BlockFi's yield product with the U.S. Securities and Exchange Commission and a $500 million credit line to address BlockFi's liquidity needs, according to the investment proposal document.","The offer also included Nexo having a 5-year call option on the remaining 49% of BlockFi's equity at a 10x valuation of the proposal and termination of BlockFi's unvested employee option pool, \"thus increasing stakes of existing shareholders,\" according to the document. The offer for the 49% stake was worth at about $288 million, making the total offer around 850 million, said Trenchev.","FTX.US's offer for BlockFi was worth a total of $680 million. It <a href=\"https:\/\/www.theblock.co\/post\/155516\/blockfi-strikes-680-million-credit-deal-with-ftx-us-outlines-acquisition-path\" data-v-f87c67ca=\"\">included<\/a> a $400 million credit facility and an option to acquire BlockFi at a price up to $240 million.","Nexo was also willing to partner with others, including FTX.US, to make its offer to BlockFi, according to an email sent in July by Nexo's head of corporate finance and investments, Tatiana Metodieva, to BlockFi executives including co-founders Marquez and Zac Prince.","\"We would like to bring to your attention Nexo's non-binding offer for BlockFi's acquisition,\" the email read. \"We are prepared to explore the opportunity individually or in coordinated efforts with other investors, including but not limited to FTX, should the latter decide to withdraw from the process for any reason.\"","BlockFi did not respond to requests for comment from The Block.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"Nexo","content":"ORGANIZATION"},{"type":"$680 million","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"Antoni Trenchev","content":"PERSON"},{"type":"49%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"$400 million","content":"MONEY"},{"type":"Nexo","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"$80 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$288 million","content":"MONEY"},{"type":"Zac Prince","content":"PERSON"},{"type":"$30 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"51%","content":"PERCENT"},{"type":"$850 million","content":"MONEY"},{"type":"$240 million","content":"MONEY"},{"type":"Alameda","content":"LOCATION"},{"type":"$500 million","content":"MONEY"},{"type":"Trenchev","content":"PERSON"},{"type":"Flori Marquez","content":"PERSON"},{"type":"Tatiana Metodieva","content":"PERSON"},{"type":"summer","content":"DATE"},{"type":"Marquez","content":"PERSON"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}