{"summary":"Barry Silbert&#x27;s notes show talks with Cameron Winklevoss, discussing a potential merger of Gemini and Genesis, creating a &quot;juggernaut.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281064\/genesis-gemini-possible-merger","publishDate":"2024-03-07T06:20:18","id":5007,"type":null,"title":"Crypto firms Genesis and Gemini discussed possible merger in 2022, court filings show","category":["COMPANIES"],"content":["Crypto exchange Gemini and the now-bankrupt crypto brokerage firm Genesis discussed a potential merger in October 2022 in the wake of the collapse of hedge fund Three Arrows Capital, which left Genesis with a <a href=\"https:\/\/www.theblock.co\/post\/258365\/nyag-files-complaint-against-gemini-genesis-dcg-michael-moro-and-barry-silbert-over-earn-product-and-covering-up-1-billion-hole\" data-v-f87c67ca=\"\">$1 billion hole<\/a>.","The discussion took place in a lunch between Barry Silbert, CEO of Digital Currency Group — which owns Genesis — and Gemini co-founder Cameron Winklevoss, according to an email contained within <a href=\"https:\/\/dcgupdate.com\/wp-content\/uploads\/2024\/03\/Barry-Silbert-Motion-to-Dismiss-March-2024.pdf\" data-v-f87c67ca=\"\">Silbert's motion to dismiss the NYAG's lawsuit<\/a> against him for allegedly hiding the losses.","According to Silbert's notes, which were sent to other DCG and Genesis executives, he made it clear that Genesis was potentially heading toward bankruptcy and that this could heavily impact Gemini. This was due to Gemini having lent user funds to Genesis as part of the exchange's Earn program — funds that Genesis wasn't sure it could pay back.","Silbert noted that the options could range from a commercial partnership to the companies merging completely. At the time, he said the latter option was the most exciting to him as the combined company \"would be a juggernaut and would be competitive with Coinbase and FTX.\" He said the merged company would be able to raise $500 million to $1 billion and go public within two years.","Silbert said, according to his notes, that were Gemini part of DCG's family of crypto firms, it would be able to benefit from its other portfolio companies. This could have included having Genesis direct order flow to the exchange, having Foundry direct bitcoin miners to trade and custody with it and using crypto news publication CoinDesk for attracting new customers. He added that rolling out Gemini's stablecoin GUSD among its portfolio companies could help give Circle and USDC a run for its money.","\"Even without merging, there is a ton more Gemini and Genesis can do together and the two companies should be leaning in together, not pulling apart,\" said Silbert. \"Candidly, ending the Earn partnership introduces potential catastrophic risk to Genesis and thereby Gemini. So at the very least, they need to revisit that decision.\"","Silbert noted that had some concerns at the time. He was worried that Genesis wouldn't be able to replace the liquidity that was needed at the pace that was discussed. He was also scared that Genesis falling short of replacing the liquidity could trigger a run on Genesis by other lenders. \"We need to avoid a bank run, no matter what,\" he said.","After this lunch took place, Gemini and Genesis did not merge and they continued to dispute the repayment of the funds lent during the Earn program. Genesis <a href=\"https:\/\/www.theblock.co\/post\/190311\/digital-currency-groups-genesis-global-files-for-bankruptcy-protection\" data-v-f87c67ca=\"\">filed for bankruptcy<\/a> in January 2023. A few months later, <a href=\"https:\/\/www.theblock.co\/post\/238387\/gemini-sues-digital-currency-group-barry-silbert-over-alleged-fraud\" data-v-f87c67ca=\"\">Gemini sued DCG<\/a> over alleged fraud related to the Earn program.","In October 2023, <span data-v-f87c67ca=\"\">the NYAG filed a complaint against Gemini, Genesis, DCG, Silbert and former Genesis CEO Michael Moro alleging that the entities covered up the $1 billion hole. DCG <a href=\"https:\/\/www.theblock.co\/post\/263788\/ex-nyse-president-tom-farleys-bullish-buys-coindesk-in-all-cash-deal\" data-v-f87c67ca=\"\">sold CoinDesk<\/a> to Block.one's crypto exchange Bullish in November 2023. On March 6, 2024, DCG and Barry Silbert <a href=\"https:\/\/www.theblock.co\/post\/280823\/dcg-barry-silbert-lawsuit-dismiss-motions\" data-v-f87c67ca=\"\">filed motions to dismiss<\/a> the NYAG lawsuit.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DCG","content":"ORGANIZATION"},{"type":"Michael Moro","content":"PERSON"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Gemini","content":"PERSON"},{"type":"NYAG","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"March 6, 2024","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"January 2023","content":"DATE"},{"type":"Silbert","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"October 2023","content":"DATE"},{"type":"October 2022","content":"DATE"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"Barry Silbert","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$500 million","content":"MONEY"},{"type":"Cameron Winklevoss","content":"PERSON"},{"type":"Genesis","content":"PERSON"}],"hashtag":["DIGITAL CURRENCY GROUP","GEMINI"],"authors":["Tim Copeland","The Block"]}