{"summary":"A U.S. financial watchdog has extended a program that will monitor cryptocurrency-related activities among brokers in the country.  The Financial Industry","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/32870\/finra-wants-to-continue-knowing-member-firms-crypto-activities","publishDate":"2019-07-22T06:50:08","id":5008,"type":null,"title":"FINRA wants to continue knowing member firms’ crypto activities","category":["REGULATION"],"content":["A U.S. financial watchdog has extended a program that will monitor cryptocurrency-related activities among brokers in the country.&nbsp;","The Financial Industry Regulatory Authority (FINRA), a self-regulatory organization (SRO) for broker-dealers in the U.S., <a href=\"http:\/\/www.finra.org\/sites\/default\/files\/notice_doc_file_ref\/Regulatory-Notice-19-24.pdf\" data-v-f87c67ca=\"\">said<\/a> in a regulatory notice on Thursday, that it will continue an initiative it took on last year, in which it requested member firms to share information such as whether they trade or intend to trade cryptocurrencies, among other activities.&nbsp;&nbsp;","Now the authority has extended the timeframe for another one year i.e. July 31, 2020, per the notice.","“As securities regulators continue to provide guidance to members regarding the unique regulatory challenges presented by digital assets—e.g., <a href=\"http:\/\/www.finra.org\/newsroom\/2019\/joint-statement-broker-dealer-custody-digital-asset-securities\" data-v-f87c67ca=\"\">Joint Statement<\/a> on Broker-Dealer Custody of Digital Asset Securities—FINRA believes it is important to keep the lines of communication with members open on this important topic,” the notice reads.","Member firms, therefore, are “encouraged” to keep sharing whether they are involved in the mining of cryptocurrencies, accept cryptocurrencies from their customers, engaged in derivatives tied to digital assets and whether they participated in an ICO or pre-ICO, among other activities.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThose firms who engage in digital assets, whether or not they are securities, will have to follow all applicable FINRA rules and federal and state laws and regulations, the authority said.","Earlier this month, FINRA and the Securities Exchange Commission (SEC) issued a joint statement, saying that there are several concerns to be addressed before they could give the green light to cryptocurrency firms who want to operate as broker-dealers.","Industry experts <a href=\"https:\/\/www.theblockcrypto.com\/2019\/07\/10\/statement-from-sec-and-finra-codifies-questions-for-broker-dealer-custody\/\" data-v-f87c67ca=\"\">told<\/a> The Block at the time that firms will have to figure out how to solve to address those issues, such as accounting for and guarding against the loss or hacking of digital securities.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBetween 35 and 40 firms have reportedly applied to become brokerages, but none has received approval yet.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"last year","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"July 31, 2020","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Dealer Custody of Digital Asset Securities—FINRA","content":"ORGANIZATION"},{"type":"Securities Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"FINRA","content":"ORGANIZATION"},{"type":"Financial Industry Regulatory Authority (FINRA","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}