{"summary":"Dymension CEO Yishay Harel looks back at the two-year journey toward mainnet launch, and what will come next.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274498\/dymension-ceo-says-mainnet-is-very-close-and-anticipates-rollapp-summer-like-ico-boom","publishDate":"2024-01-25T11:28:36","id":5012,"type":null,"title":"Dymension CEO says mainnet is &#x27;very close&#x27; and anticipates rollapp summer like ICO boom","category":["CRYPTO ECOSYSTEMS"],"content":["In late 2017, there was an explosion of tokens on the Ethereum network fueled by a token funding mechanism called ICOs. This summer, <a href=\"https:\/\/www.theblock.co\/price\/276305\/dymension-dym-usd\" data-v-f87c67ca=\"\">Dymension<\/a> CEO Yishay Harel is hoping that there will be a similar flurry, but with new blockchains instead.","Harel pointed to the number of projects being built on Dymension. \"It kind of reminds me of a summer. Like a DeFi summer, or the token summer that we had in 2018 with the ICO, the NFTs. And now we're going to see a rollapp summer where building your own chain is not something challenging.\"","Dymension is currently in testnet form but its mainnet is “very close,” Harel, who started working in crypto in 2016 and had a stint at crypto exchange Kraken, said. The network has already allocated tokens to more than 500,000 addresses, which will be claimable once the mainnet goes live.","In late 2021, Dymension's founders took note of an emerging technology called a rollup. These are Layer 2 networks that have typically been built on Ethereum and settle transactions to the main layer. They are designed to take some weight off the main network in order to improve scalability and allow for more people to make transactions at a lower cost.","The founders originally figured that they should build a software development kit, enabling developers to more easily build rollups. Yet they noticed that Ethereum wasn't originally designed to support rollups, meaning the designs were less than optimal.","Instead, they looked at the Cosmos ecosystem, where each application has its own blockchain. Here these blockchains can talk to each other through the messaging protocol IBC. This protocol lets anyone send tokens among these blockchains very easily.&nbsp;","At this point, they pivoted toward Dymension, a network designed to natively support rollups. By creating the network with rollups in mind, it would allow for an optimal system. Plus, they opted to include support for IBC, enabling the rollups to connect to one another and all other IBC-supported blockchains.","The idea for rollapps is that each rollup will be for its own application (a bit similar to how each Cosmos blockchain is for its own application). Instead of having multiple application-specific blockchains, Dymension will support lots of application-specific rollups — colloquially known as rollapps.","So far, this appears to be happening. There are already 500 tokens created and 1,000 rollapps listed, with 13,600 deployed, on its testnet. Current rollapps include gambling, gaming and NFT apps.&nbsp;","Harel said that the key aim for Dymension is to create a sustainable system.","\"What we're doing is if you're bridging value to a rollapp, this rollapp is basically getting more incentives so we're creating this kind of loop where we want people to bridge value to Dymension. We want the ecosystem to grow according to who brings value, who builds value,\" said Harel.","He said that when incentives run out, people might move onto the next big thing but that every project should have a marketing budget, and if the project is good, it will turn a profit at the end.","Harel pointed to Ethereum, where new issuance of ether in the block production process is offset by demand for blockspace — resulted in the burning of ether in the transaction fee process. He said the goal would be to bring Dymension to a similar point of equilibrium.","\"Success is if we have users that are enjoying the protocol and use it — real users that are coming in, it's also very important,\" he said. \"But we have to get to the sustainability of the protocol.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dymension<\/a> CEO Yishay Harel","content":"PERSON"},{"type":"2016","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"IBC","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Harel","content":"PERSON"},{"type":"Dymension","content":"ORGANIZATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Dymension","content":"PERSON"},{"type":"crypto exchange Kraken","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"” Harel","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["COSMOS","DEVELOPER TOOLS","VALIDATORS"],"authors":["Tim Copeland","The Block"]}