{"summary":"&quot;We&#x27;ve held over 95% of everything we&#x27;ve ever bought,&quot; said a16z&#x27;s Chris Dixon, who talks crypto token investing strategies and avoiding FTX.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/196252\/a16z-crypto-funds-still-have-billions-to-deploy-says-co-founder-chris-dixon","publishDate":"2022-12-19T12:31:57","id":5017,"type":null,"title":"a16z crypto funds still have billions to deploy, says co-founder Chris Dixon","category":["DEALS"],"content":["The majority a16z's <a href=\"https:\/\/www.theblock.co\/post\/148685\/a16z-announces-4-5-billion-fund-for-crypto-and-blockchain-startups\" data-v-f87c67ca=\"\">most recent<\/a> crypto fund is still to be deployed, general partner and crypto fund founder Chris Dixon said in an interview on&nbsp;The Block's podcast&nbsp;<a href=\"https:\/\/www.theblock.co\/amp\/post\/196118\/a16zs-chris-dixon-on-the-state-of-the-crypto-market-exclusive\" data-v-f87c67ca=\"\">The Scoop<\/a>.","The latest $4.5 billion fund, known as \"Crypto Fund 4,\" <a href=\"https:\/\/www.theblock.co\/post\/148685\/a16z-announces-4-5-billion-fund-for-crypto-and-blockchain-startups\" data-v-f87c67ca=\"\">launched<\/a>&nbsp;in May and dedicated $1.5 billion to seed investments and $3 billion to venture investments.","\"We've deployed less than 50%, so we have the majority of our recent fundraise left,\" Dixon said.","The firm is a titan in Silicon Valley, having raised a total of $7.6 billion for the sector after launching its first crypto fund four years ago. It has most recently backed crypto startups which include Aztec, Mysten Labs and Yuga Labs. It's also <a href=\"https:\/\/a16zcrypto.com\/\" data-v-f87c67ca=\"\">known<\/a>&nbsp;for big bets on crypto startups such as Anchorage Digital, Sky Mavis and Coinbase.","\"Our venture funds have a minimum of 10-year lifespan, which means if you decide you want to invest in our fund,&nbsp; you make a commitment to us with money, and you're locked up for at least 10 years — and honestly it's usually 15 years and we extend it,\" Dixon said on the podcast. He also drew a distinction with crypto hedge funds, which he said don't have the same flexibility to extend deployment.","Dixon said the funds have kept 95% of everything they've ever invested in.","He said that crypto investors who believe that a16z has told its token investments misunderstand the firm's venture model.","\"All of our data shows that the vast majority of the returns come in the later years of the funds, and the worst thing you can do in venture capital is sell good assets too early,\" Dixon said.","The ebbs and flows ultimately don't affect the firm's model, he added.","In October, The Wall Street Journal <a href=\"https:\/\/www.theblock.co\/post\/179956\/a16z-flagship-crypto-fund-dropped-value-wsj\" data-v-f87c67ca=\"\">reported<\/a> that a16z's flagship crypto fund had dropped 40% in value in the first half of this year.","The venture firm was relatively unscathed from the collapse of FTX, while many other players such as <a href=\"https:\/\/www.reuters.com\/technology\/coinbase-write-off-investment-that-its-ventures-arm-made-ftx-source-2022-11-11\/\" data-v-f87c67ca=\"\">Coinbase Ventures<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/185136\/sequoia-says-its-investment-in-ftx-is-now-worthless\" data-v-f87c67ca=\"\">Sequoia<\/a> were left licking their wounds and writing down their investments in the collapsed exchange to zero.","\"We never really, frankly, took it seriously,\" said Dixon, describing his experience with FTX and his only meeting with founder and former CEO Sam Bankman-Fried.","a16z had previously invested in Coinbase, and Dixon said used his knowledge from that investment to inform his thought process about other exchanges. He said he saw a \"whack-a-mole\" pattern frequently form where new off-shore exchanges would crop up and then disappear each cycle.","\"For me, it was just like what's the tech innovation?\" Dixon said. \"What's new? It's Coinbase without compliance, security and finance based in an offshore place.\"","Identifying tech innovation is at the heart of a16z's thesis, Dixon said, noting that it doesn't mean there won't be train wrecks in the portfolio.","\"If you don't have on-chain trust, and you don't have off-chain regulated trust, I wouldn't put my money there,\" he said.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\"><span class=\"copyright\" data-v-f87c67ca=\"\"><\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.",""],"entity":[{"type":"Anchorage Digital","content":"ORGANIZATION"},{"type":"$7.6 billion","content":"MONEY"},{"type":"$3 billion","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Yuga Labs","content":"ORGANIZATION"},{"type":"Coinbase","content":"LOCATION"},{"type":"50%","content":"PERCENT"},{"type":"Chris Dixon","content":"PERSON"},{"type":"$1.5 billion","content":"MONEY"},{"type":"95%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$4.5 billion","content":"MONEY"},{"type":"Mysten Labs","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Dixon","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"October","content":"DATE"},{"type":"Mavis","content":"PERSON"}],"hashtag":["FTX"],"authors":["Kari McMahon","The Block"]}