{"summary":"Several crypto firms have decided to suspend services or exit the UK market in recent months amid strict new marketing rules from the country’s financial regulator.\nWithout an appropriate legal framework, Prime Minister Rishi Sunak’s ambition for the UK to become a global crypto hub could fall behind other regions, says Bittrex Global CEO Oliver Linch.","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273763\/fca-crypto-rules-sunak-uk-web3-hub","publishDate":"2024-01-22T12:22:41","id":502,"type":null,"title":"The FCA&#x27;s stringent rules are hurting crypto firms in the UK, says Bittrex Global CEO","category":["Regulation"],"content":["Last summer, UK Prime Minister Rishi Sunak <a href=\"https:\/\/www.theblock.co\/post\/234095\/a16z-uk-expansion\" data-v-f87c67ca=\"\">said<\/a> he was keen on providing regulatory clarity regarding how crypto firms should register and operate in the country — as part of his ambitions for the UK to become a global hub for web3.","However, fast-forward several months and some firms have now suspended services or exited the UK market amid strict marketing rules from the country’s financial regulator, the Financial Conduct Authority.","“For certain crypto players, the FCA’s rather stringent marketing rules are acting as a deterrent and a potential reason to leave the jurisdiction,\" lawyer and Bittrex Global CEO Oliver Linch told The Block.","\"Certainly, many had questions around the level of consultation and also noted some absurdities resulting from the prioritisation of financial promotion rules over developing a substantive regulatory framework. However, the rules themselves are more or less the same as those that apply to other financial institutions in the UK, so many of us did see this coming,\" he added.","Linch is a former Shearman &amp; Sterling solicitor with more than a decade of experience deciphering and drafting regulatory policy — particularly in financial regulation. He is also the former General Counsel and current CEO of Bittrex Global, which announced it was <a href=\"https:\/\/www.theblock.co\/post\/263875\/bittrex-global-to-wind-down-operations-urges-customers-to-withdraw-funds\" data-v-f87c67ca=\"\">winding down<\/a> in November amid the crypto exchange’s own regulatory troubles and falling market share.","“Keeping consumers safe is of paramount importance, and the best way to do that is by forming a legal framework that is comprehensible enough for the market to remain compliant with, and explicit enough for the regulator, in this case, the FCA, to enforce,” Linch said.","The UK’s new <a href=\"https:\/\/www.theblock.co\/post\/233554\/fca-to-roll-out-stricter-rules-for-crypto-ads-including-referral-bonus-ban\" data-v-f87c67ca=\"\">crypto advertising rules<\/a>, regulated by the FCA, came into effect on Oct. 8 last year — causing complications for some crypto firms. The new rules, which include a cooling-off period for first-time investors, were rolled out in the hope it would make the marketing of crypto products more transparent and accurate but several firms have found them challenging, while others turned to <a href=\"https:\/\/www.theblock.co\/post\/255431\/coinbase-okx-and-binance-partner-with-uk-firms-as-regulations-come-into-force\" data-v-f87c67ca=\"\">third parties<\/a> for compliance.","Fintech firm Revolut <a href=\"https:\/\/www.theblock.co\/post\/268168\/revolut-will-suspend-trading-for-uk-business-customers-report\" data-v-f87c67ca=\"\">suspended<\/a> crypto trading for UK businesses earlier this month to “give it more time to adjust to new requirements set by the Financial Conduct Authority in October.” Payments giant PayPal <a href=\"https:\/\/www.coindesk.com\/business\/2023\/08\/16\/paypal-to-stop-crypto-purchases-in-uk-until-2024\/#:~:text=Payments%20giant%20PayPal%20will%20temporarily,by%20the%20country's%20financial%20regulator.\" data-v-f87c67ca=\"\">said<\/a> last year it would temporarily pause crypto purchases in the UK until early 2024, and crypto exchange Bybit exited the UK in October amid the rule change.","Bybit was not the only crypto exchange impacted, with other major platforms, including OKX and Binance, <a href=\"https:\/\/www.theblock.co\/post\/255431\/coinbase-okx-and-binance-partner-with-uk-firms-as-regulations-come-into-force\" data-v-f87c67ca=\"\">reevaluating<\/a> their strategies in light of the FCA's strict guidelines, Bybit CEO Ben Zhou told The Block at the time. The new rules could mean that just having a website accessible to UK customers could be construed as a promotion, Zhou said. The FCA previously <a href=\"https:\/\/www.theblock.co\/post\/240231\/fca-crypto-memes-breach-financial-promotion-rules\" data-v-f87c67ca=\"\">warned<\/a> that even crypto memes could breach the financial promotion rules.","“We have engaged extensively with the cryptoasset industry in the UK and overseas to help firms prepare for the new financial promotions rules,” an FCA spokesperson told The Block. “We also offered cryptoasset firms an additional three months to implement parts of the rules that required greater technical development and published detailed guidance to help firms understand our expectations.”","“We will continue to work with the cryptoasset industry as it implements our financial promotion rules,” the FCA spokesperson added.","Some progress has been made on the regulatory front. In October, the UK Treasury <a href=\"https:\/\/www.theblock.co\/post\/260020\/uk-treasury-releases-final-proposals-for-crypto-asset-regulation\" data-v-f87c67ca=\"\">publishing<\/a> its final proposals for future regulation of crypto, outlining the government's intention to bring crypto asset activities into the regulatory perimeter of financial services for the first time.","In December, the UK <a href=\"https:\/\/www.theblock.co\/post\/268212\/uk-introduces-new-regulations-for-its-digital-securities-sandbox\" data-v-f87c67ca=\"\">introduced<\/a> new regulations for supervising the nation’s Digital Securities Sandbox, which came into force on Jan. 8 — aiming to facilitate the adoption of digital assets across financial markets with oversight from The Bank of England and FCA.","“The Digital Securities Sandbox is a really positive initiative and a good example of the UK taking ownership of its crypto ambitions,” Linch said. “So long as potential market participants engage enthusiastically with the programme, then the adoption of crypto will continue to rise.”","However, unless this can lead to a comprehensive legal framework, and with the UK’s general election around the corner, Sunak’s ambition of creating a global web3 hub in the UK may be put on hold.","“The next step is taking the learnings from the Sandbox — direct from the industry — and implementing them into a comprehensive legal framework so that regulated crypto activity can exist outside of that bubble and propel the UK forward,” Linch said. “The Digital Securities Sandbox will help but only legislation will suffice.”","“Legislation has been lacking for some time and is well overdue,” Linch continued. “Without it, the UK won’t match its ambitions of becoming a global crypto hub and will fall further down the pecking order to MENA, APAC and the EU.”","Linch said that there needs to be more coordination between the government and its financial regulator as there is currently a degree of polarity.","“That is hardly an enticing environment for some of the world’s largest crypto players to consider — particularly if the UK wants to attract global firms away from the EU,\" he continued. “<a href=\"https:\/\/www.theblock.co\/post\/227309\/mica-european-union-crypto-regulation-passes\" data-v-f87c67ca=\"\">MiCA<\/a> has certainly given the EU first-mover advantage, but the UK boasts the enormously successful City of London with all its existing infrastructure, a strong talent pool and the many advantages of a common law system. Deployed properly, these could present a real challenge to the EU, even with its passporting regime and single market, so&nbsp;it’s really up to the government to capitalise on that, and do what is necessary to make that possible.”","However, that might be a tall order for the current government as time is also running out ahead of an election expected in the latter half of this year, possibly in mid-November. Sunak’s Conservative party is significantly behind in the <a href=\"https:\/\/www.politico.eu\/europe-poll-of-polls\/united-kingdom\/\" data-v-f87c67ca=\"\">polls<\/a>, and “crypto won’t be quite as high on the priority list for a Labour government as it should be,” Linch said.&nbsp;","“The Prime Minister and his Economic Secretary to the Treasury, Bim Afolami, have at best 10 months to get to where the EU has with MiCA and introduce a substantive regulatory framework for crypto,” he added. “That is a big ask, but it’s certainly achievable in that timeframe.”","The Block reached out to Prime Minister Rishi Sunak’s office for comment.","<em data-v-f87c67ca=\"\">Updated with additional clarifications from Oliver Linch and comment from the FCA.<\/em>"],"hashtag":["FCA","UK PARLIAMENT"]}