{"summary":"Solana has been touted as a blockchain built to handle high-speed, large transactions. But recent network performance issues have put into question its position as a blockchain built for Wall Street.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/131278\/traders-are-complaining-about-solanas-performance-raising-questions-about-its-status-as-a-wall-street-darling","publishDate":"2022-01-23T05:00:25","id":5024,"type":null,"title":"Traders are complaining about Solana&#x27;s performance, raising questions about its status as a Wall Street darling","category":["THE BLOCK"],"content":["Jim Greco, like many traders who have had to deal with the Solana network's outage over the last few days, is annoyed.","\"How can anyone possibly trust the Solana network with real capital after a meltdown like today?\" Greco, a market structure guru and former executive at KCG, &nbsp;said in a tweet on Friday night.","As the price of cryptocurrencies across the board slid during Friday's trading session, traders large and small found themselves unable to execute transactions on Solana's blockchain — a protocol that has been touted by proponents for its scalability and fast transaction speeds. Transactions per second (tps) were down significantly.&nbsp;","Those issues spilled into Saturday. Meanwhile Solana's official status Twitter account noted that the blockchain has been \"experiencing high levels of network congestion\" tied to&nbsp;\"excessive duplicate transactions.\"","According to Solana founder Anatoly Yakovenko, bots were also apparently sending duplicate transactions, adding to the problem.&nbsp;","Solana was not the only blockchain experiencing issues as prices plunged. But the network's issues have taken the spotlight because it has become a darling of large trading shops in the crypto industry and beyond.","FTX's Sam Bankman-Fried is a big backer and Jump Trading has poured capital into Solana-based projects. According to The Block Research's John Dantoni, more than 50% of Jump Crypto's protocol investments went into the Solana <a href=\"https:\/\/twitter.com\/dantwany\/status\/1484587719699288065?s=20\" data-v-f87c67ca=\"\">ecosystem<\/a>. &nbsp;","Pyth — the Solana-based data project — counts a wide range of market participants as backers, including IEX, Virtu, and GTS. (It too has experienced <a href=\"https:\/\/markets.businessinsider.com\/news\/currencies\/bitcoin-price-pyth-bug-crypto-solana-defi-data-network-crash-2021-9\" data-v-f87c67ca=\"\">issues<\/a>.)&nbsp;","Part of the reason that Solana has been so attractive to large trading shops is that it has prioritized scale. Still, when the network gets overcrowded, it has shown that it can stall out.&nbsp;","Solana released a fix on Saturday to ameliorate \"the worst effects of this issue,\" it said.","\"These forthcoming releases are aimed at improving the state of the network, with more improvements expected to roll out in the next 8-12 weeks,\" the developers added. &nbsp;\"Many of these features are currently live on Testnet, where they are being rigorously tested.\"","Solana has a big war chest to draw from to address its issues, having completed a $314.2 million fundraise in June 2021.&nbsp;","Solana's network logjam has had ramifications across the crypto-ecosystem. Not only does it make it difficult for a retail market participant to, for instance, sell a Solana-based NFT, it also slows down large DeFi traders and forces them to work around the network. \"Slows everything down,\" one trading executive said.&nbsp;","For large traders moving tens of millions, they have to move activity over-the-counter and agree to settle once the chain is working. \"Agree on a price now and settle later... CEXes are still working so you still have price discovery,\" an executive at a derivatives trading desk noted.&nbsp;","Other traders complained about not being able to top off a leveraged position in Solana on a decentralized venue — meaning, add to their position before risking liquidation.&nbsp;","These complaints raise questions about Solana's ability to establish its position as Wall Street's preferred crypto platform. A firm trying to move around hundred of millions might opt for a different blockchain even if they have to pay hefty fees — if they can count on it to work.","&nbsp;\"I don't care about the price,\" Jim Greco said in a message to The Block. \"But I can't get anything done on the network. How many times is this going to happen at exactly the time when the network needs to perform the most?\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 2021","content":"DATE"},{"type":"Virtu","content":"LOCATION"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"John Dantoni","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"night","content":"TIME"},{"type":"FTX","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$314.2 million","content":"MONEY"},{"type":"Solana","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Anatoly Yakovenko","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"Jim Greco","content":"PERSON"},{"type":"Saturday","content":"DATE"}],"hashtag":["SOLANA"],"authors":["Frank Chaparro","The Block"]}