{"summary":"The Foundation, which has taken crypto since 2014, ultimately decided to halt accepting crypto on May 1 after a monthslong debate.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/144738\/wikimedia-foundation-stops-accepting-crypto-donations-citing-environmental-concerns","publishDate":"2022-05-02T15:31:31","id":5027,"type":null,"title":"Wikimedia Foundation halts accepting crypto due to sustainability concerns","category":["BITCOIN"],"content":["<span data-v-f87c67ca=\"\">Wikimedia Foundation (WMF), the non-profit organization supporting Wikipedia and Wikimedia Commons, will no longer accept cryptocurrency donations.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Among the main reasons for the removal were environmental sustainability concerns related to crypto and the Wikimedia community’s perceived risk to its reputation for accepting cryptocurrencies.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The proposal to remove the WMF’s use of cryptocurrency first appeared on January 11. “Accepting cryptocurrency makes a joke out of the WMF's commitment to environmental sustainability,\" wrote a pseudonymous editor named Gamaliel on January 11, 2022. <\/span>","<span data-v-f87c67ca=\"\">WMF first began accepting cryptocurrency donations in 2014, which the foundation notes has consistently been the “least utilized methods of donating.” Wikimedia received over <\/span><a href=\"https:\/\/meta.wikimedia.org\/wiki\/Fundraising\/2020-21_Report#:~:text=In%20the%202020%2D2021%20fiscal%20year%2C%20our%20major%20gift%20donors,helped%20accelerate%20the%20Foundation's%20mission.\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$154 million<\/span><\/a><span data-v-f87c67ca=\"\"> in donations during the 2020-2021 fiscal year. During that time, 347 donors gave $130,100.94, or 0.08% of the total revenue, through cryptocurrency donations — which was mostly bitcoin.<\/span>","<strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">“The financial effect of no longer accepting crypto donations would be minimal, and far outweighed by the reputational harm to the Wikimedia project of being seen to endorse a technology so strongly tied to various environmental and social harms,” wrote&nbsp; TrueAnonyman on April 9.&nbsp;&nbsp;<\/span><\/strong>","<span data-v-f87c67ca=\"\">Those in favor of keeping crypto donations argued for the use of less energy-intensive cryptocurrencies such as those that run on proof-of-stake consensus, noted cryptocurrencies “provide safer ways to donate and engage in finance for people in oppressive countries,” and mentioned fiat currency also has environmental sustainability issues.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">&nbsp;<\/span><span data-v-f87c67ca=\"\">“In 2014, Wikimedia took the step to take donations in crypto long before anyone knew it existed. We're now approaching the 8th year since, and the only fundamental thing that has changed is its popularity,\" someone writing under the name JusCurt posted on January 13. \"I don't blame Wikimedia for that move as cleaner competitors simply did not exist as they do today, and the scale of transactions did not pose any environmental threat.”<\/span>","<span data-v-f87c67ca=\"\">Community members argued over the proposal until April 12. The final decision was made on May 1. The WMF closed its account on payment processor BitPay and removed the ability for a user to donate crypto.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The Wikimedia Foundation will continue to monitor the evolution and discussion around cryptocurrency,” said the WMF in a statement. “These ongoing conversations represent a powerful example of how the Wikimedia movement engages in thoughtful debate, remains flexible and adapts in response to changing conditions.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"May 1","content":"DATE"},{"type":"January 11, 2022","content":"DATE"},{"type":"$154 million","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"$130,100.94","content":"MONEY"},{"type":"WMF","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Gamaliel","content":"PERSON"},{"type":"April 12","content":"DATE"},{"type":"January 11","content":"DATE"},{"type":"January 13","content":"DATE"},{"type":"Wikimedia Commons","content":"ORGANIZATION"},{"type":"The Wikimedia Foundation","content":"ORGANIZATION"},{"type":"April 9","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"0.08%","content":"PERCENT"}],"hashtag":["BITCOIN","CRYPTO"],"authors":["MK Manoylov","The Block"]}