{"summary":"Securities and Exchange Commission v. Reggie Middleton and Veritaseum., Case №19-cv-04265 E.D.N.Y., 8\/19\/19, Defendants’ “Memorandum of Law in Opposition","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/37510\/veritaseum-asks-court-to-lift-asset-freeze","publishDate":"2019-08-24T17:58:55","id":503,"type":null,"title":"Veritaseum asks court to lift asset freeze","category":["LEGAL"],"content":["<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Securities and Exchange Commission v. Reggie Middleton and Veritaseum., Case №19-cv-04265 E.D.N.Y., 8\/19\/19, Defendants’ “Memorandum of Law in Opposition to Plaintiff’s Application for a Preliminary Injunction” [SDP]<\/strong>","<a href=\"https:\/\/www.scribd.com\/document\/423000551\/Veritaseum-Opposition-Brief\" data-v-f87c67ca=\"\">Link to brief<\/a>","Apparently PR firms read Crypto Caselaw Minute, because earlier in this week I received an email from a PR firm that works for Veritaseum and Reggie Middleton, attaching a 30-page brief responding to the SEC’s successful motion for a Temporary Restraining Order that included an asset freeze, <a href=\"https:\/\/www.theblockcrypto.com\/2019\/08\/13\/sec-files-emergency-lawsuit-against-veritaseum-to-stop-spending-millions-of-dollars-in-ico-money\/\" data-v-f87c67ca=\"\">which we covered last week on the Block<\/a>.","Here’s the nutshell: in response to the SEC’s allegations and what appeared to be a mountain of evidence, defendants argue that the Veritaseum tokens weren’t actually securities but are in fact “digital utility tokens” that “immediately enabled token holders to” buy Veritaseum research reports and would eventually given holders access to the Veritaseum platform.","Per the defendants’ brief, the tokens “do not represent an ownership interest in Veritaseum or its assets; do not give holders any right to share in the company’s profits; do not confer voting rights; and do not pay dividends or interest. Numerous token holders have used their tokens to avail themselves of the Veritaseum’s unique products and services, which the company has continually expanded and improved.”","The SEC investigation that preceded this lawsuit began in 2017 and lasted for almost two years. SEC investigations are confidential so it was only the filing of this lawsuit that made its existence publicly known. &nbsp;These things can take a long time. It is certainly possible that other ongoing investigations that commenced during or soon after the ICO boom are also coming to an end, either to be resolved by negotiation or (as in this case) in litigation.","And about the litigation -- One of the SEC’s stated reasons for asking a Court for emergency relief was that after asking Veritaseum to stop spending ICO funds $2 million in ICO funds held in Ether was transferred. Basically, the SEC said stop spending and the defendants did exactly what they were asked not to do.","According to this brief, counsel for Veritaseum had “demonstrated to the SEC that the asset transfer in question was nothing more than the routine funding of Veritaseum’s ongoing lawful business operations and was consistent with the company’s prior funding practices. The SEC did not disclose this information to the Court in its asset freeze application and incorrectly represented to the Court that Mr. Middleton had transferred a portion of the assets to a personal account. In fact, all of the assets remained in the company’s control.”","While of course I am not the judge and this is only my subjective opinion, the argument that “BUT WE TOLD YOU WE WERE GONNA DO THIS MAN\" doesn't sound all that persuasive to me, and I doubt that the Court will be swayed.","Basically, the defendant is saying “we told you we were going to do this so you shouldn’t have objected when did the thing you told us not to do because it was really OK.” The SEC’s Complaint alleges that Veritaseum and Middleton violated a ranged of securities laws and, among other things, committed securities fraud. Telling the SEC in advance that they planned to spend assets that the SEC believes is the subject of securities fraud seems like rather weak tea. The rest of the brief proceeds in a similar manner and while I certainly can’t predict how the court will rule, it doesn’t do much for me, despite the very high quality of the lawyers who wrote it.","<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Disclaimer: Crypto Caselaw Minute is provided for educational purposes only by Nelson Rosario (<a href=\"https:\/\/twitter.com\/nelsonmrosario\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>) and Stephen Palley (<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>). These summaries are not legal advice. They are our opinions only, aren’t authorized by any past, present or future client or employer. Also, we might change our minds. We contain multitudes. &nbsp;<\/em><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">As always, Rosario summaries are “NMR” and Palley summaries are “SDP”. &nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2017","content":"DATE"},{"type":"Nelson Rosario (","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"$2 million","content":"MONEY"},{"type":"Middleton","content":"PERSON"},{"type":"Veritaseum","content":"PERSON"},{"type":"ICO","content":"ORGANIZATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"Exchange Commission","content":"ORGANIZATION"},{"type":"Palley","content":"PERSON"},{"type":"Reggie Middleton","content":"PERSON"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"}],"hashtag":["SEC"],"authors":["Stephen Palley","The Block"]}