{"summary":"Orderly Network raises funds from CoinDCX Ventures in a SAFT round.\nThe Near-based trading infrastructure protocol plans to add perpetual trading and support for other blockchains.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/223212\/orderly-network-raises-fresh-funding-at-a-flat-token-valuation-of-200-million","publishDate":"2023-03-28T09:00:40","id":503,"type":null,"title":"Orderly Network raises fresh funding at a flat token valuation of $200 million","category":["Deals"],"content":["Orderly Network, a decentralized trading infrastructure protocol based on the Near blockchain, raised an undisclosed amount of funds from India's CoinDCX Ventures in a strategic investment round.","While Orderly Network did not disclose the size of the investment in a statement, its chief operating officer Arjun Arora told The Block that the funding was realized via a simple agreement for future tokens (SAFT) at a flat valuation of $200 million — the same valuation when Orderly <a href=\"https:\/\/www.theblock.co\/post\/181701\/nomura-laser-digital-invests-orderly-network-token-round\" data-v-f87c67ca=\"\">raised<\/a> funds from Nomura's Laser Digital in November.","CoinDCX Ventures completed its investment in Orderly last month, Arora said, adding that initial talks began in late October.","As for what led CoinDCX Ventures, a unit of <a href=\"https:\/\/www.theblockcrypto.com\/linked\/142457\/coindcx-raises-series-d-funding-india-crypto-exchange?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">CoinDCX<\/a> — one of India's largest centralized crypto exchanges — to bet on Orderly, its managing director Rohit Jain said order book decentralized exchanges (DEXs) \"are the next phase in the evolution of DEXs\" as they offer centralized exchange-like experience but on-chain and with self-custody benefits.","\"We are very bullish on this model and while a few teams are building in the space, we think Orderly is perhaps the best team to build this out,\" Jain told The Block.","Orderly Network was incubated in 2021 by Near and Woo Network. Its mainnet went live last October and currently offers an infrastructure for spot order-book trading. \"Right now, we have six spot markets and one dApp, i.e. WooFi DEX,\" Arora said. The next plan is to support perpetual futures and multiple dApps by the end of April, he said, adding that multichain support will also follow next.","\"Users can expect to see multichain perps across the blue-chip Ethereum virtual machine (EVM) and non-EVM chains,\" Arora said. \"Users can also expect native deposits and withdrawals from blue chip chains.\" He declined to comment on specific blockchains that will be supported.","The current total value locked or TVL of Orderly Network <a href=\"https:\/\/defillama.com\/protocol\/orderly-network\" data-v-f87c67ca=\"\">stands at<\/a> $6.2 million, according to DefiLlama. Arora expects the TVL to \"drastically increase\" with the launch of perps, new dApps and multichain support in the coming months.","As for Orderly's native token, it's expected to launch in the second half of the year, according to Arora. To keep up with its growth plans, Orderly looks to increase the team size of its full-time employees from the current 32 people by hiring across functions, Arora said.","Orderly is CoinDCX Ventures' fifteenth investment. The venture unit was launched in May 2022 with a $12 million fund. It has thus far invested in 15 startups, including Stader Labs, Space &amp; Time and Unstoppable Domains."],"hashtag":["DECENTRALIZED INFRASTRUCTURE","DEXS","STRATEGIC INVESTMENTS"]}