{"summary":"Merge has raised a $9.5 million round led by Octopus Ventures and participation from Hashed, Coinbase Ventures, and Ethereal Ventures. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/149299\/fintech-infrastructure-for-web3-startup-merge-raises-9-5-million","publishDate":"2022-05-30T06:00:40","id":5032,"type":null,"title":"Fintech infrastructure for web3 startup Merge raises $9.5 million","category":["FINTECH"],"content":["UK-based startup Merge announced on Monday it has raised $9.5 million in seed funding in a round led by Octopus Ventures.&nbsp;","Founded by former PayPal executive Kebbie Sebastian late last year, Merge aims to provide access to banking, payments, risk management and compliance to web3 companies via an application programming interface (API). APIs are software bridges that allow businesses to more simply access each others' systems.","\"Our target customers are web3 companies that need to interface and collect funds in fiat from their customers or institutions so we're talking crypto exchanges, wallets and DeFi gateways,\" Sebastian explained in an interview with The Block, noting that many traditional banks aren't willing to offer financial services to crypto companies.&nbsp;","Through Merge's API, the startup aims to offer such services including the enabling of collecting and holding funds for themselves and for their customers and the conversion of crypto to fiat and vice versa within a wallet. These services are offered without the business having to worry about issues of compliance as this is handled by Merge.&nbsp;","While starting in the UK, Sebastian says that the startup will aim to serve customers around the world — with much of the new funding going towards procuring licensing coverage and regulatory approvals globally. The extra cash will also go toward building out its team, which currently numbers just 12.&nbsp;","For Sebastian, Octopus was a clear choice as a lead investor due to its strength in both fintech and crypto, industries with which Merge sees itself as intersecting.&nbsp;","\"It was very important to us to have investors that both understood the fintech world and the crypto world because we are merging these two together,\" says Sebastian. \"And Octopus has been a fantastic partner in that.\"&nbsp;","Along with Octopus, the round also features investors from crypto stalwarts such as Ethereal Ventures, Coinbase Ventures and Alameda Research.&nbsp;","The raise follows recent rounds from <a href=\"https:\/\/techcrunch.com\/2022\/02\/17\/multis-wants-to-build-the-financial-backbone-of-crypto-native-organizations\/\" data-v-f87c67ca=\"\">Multis<\/a>, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/138356\/coinbooks-raises-3-2-million-to-build-accounting-software-for-daos\" data-v-f87c67ca=\"\">Coinbooks<\/a> and <a href=\"https:\/\/www.theblockcrypto.com\/post\/143717\/web3-startup-rain-raises-6-million-to-launch-corporate-credit-cards-for-daos\" data-v-f87c67ca=\"\">Rain,<\/a> three other startups that aim to bridge the crypto world with traditional banking services.&nbsp;","<span data-v-f87c67ca=\"\">“Merge’s vision is to build the infrastructure necessary to allow crypto businesses to operate without fear of shutdown by regulators or third-party risk teams,\" said Octopus' Zihao Xu in a statement. \"We’re excited to back them as they build that.\"&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ethereal Ventures","content":"ORGANIZATION"},{"type":"Sebastian","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"$9.5 million","content":"MONEY"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Kebbie Sebastian","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"UK","content":"ORGANIZATION"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"Zihao Xu","content":"PERSON"},{"type":"Octopus Ventures","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"}],"hashtag":["FINTECH"],"authors":["Tom Matsuda","The Block"]}