{"summary":"The latest upgrade for the Evmos blockchain has introduced automated conversions for token swaps in and out of its ecosystem.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/199379\/evmos-auto-conversion","publishDate":"2023-01-05T06:16:43","id":5034,"type":null,"title":"Evmos adds auto-conversion for swaps between Ethereum and Cosmos tokens","category":["CRYPTO ECOSYSTEMS"],"content":["The latest upgrade for the Evmos blockchain has introduced automated conversions for token swaps in and out of its ecosystem.","Evmos is a Cosmos ecosystem blockchain with native support for Ethereum applications and tokens. Its goal is to bring the two blockchain ecosystems closer and allow tokens to flow more freely between them.","Automated conversions were added in the latest version 10.0 upgrade on Jan. 5. When someone sends a token native to the Cosmos ecosystem to Evmos, it will be automatically converted to an Ethereum-compatible token so it can be used immediately on Evmos and sent to Ethereum-compatible blockchains. The aim is to make the experience of using the blockchain and moving between Cosmos and Ethereum more streamlined.","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">No longer will users need to convert their Cosmos<\/span><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\"> assets into their respective [Ethereum Virtual Machine] asset types and vice-versa. This will be done under the hood for users!\" <a href=\"https:\/\/twitter.com\/EvmosOrg\/status\/1610431921951232001\" data-v-f87c67ca=\"\">said<\/a> Evmos on Twitter.<\/span>","This will also mean users can transfer Ethereum-based tokens to other Cosmos blockchains from Evmos in a single transaction without swapping the tokens manually.","This will only apply for token pairings — the Ethereum and Cosmos versions of the tokens — that have been associated together through Evmos' governance system. Tokens that haven't been mapped in this way won't be automatically converted.","A key feature in the Cosmos ecosystem is IBC, a form of communication that lets blockchains send tokens to each other much more easily (a function that isn't too easy in the blockchain world). Making it easier for Ethereum tokens to be switched for Cosmos-compatible tokens that can be sent using IBC could open up more communication between Ethereum and Cosmos-based blockchains.","Other features in the upgrade include more support for the crypto hardware wallet Ledger and some bug fixes.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jan. 5","content":"DATE"},{"type":"Evmos","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Cosmos","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Evmos","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"IBC","content":"ORGANIZATION"}],"hashtag":["COSMOS","ETHEREUM"],"authors":["Tim Copeland","The Block"]}