{"summary":"Today the always-on demands of online markets have to be matched with the ability to access opportunities instantly and with no limits. Historically correspondent banks would move large sums of money for those needing to transfer funds while creating bottlenecks of unnecessary friction.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/148936\/digital-asset-economy-fuels-instant-settlements-innovation","publishDate":"2022-05-26T08:35:13","id":5038,"type":null,"title":"Digital asset economy fuels instant settlements innovation","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">Today the always-on demands of online markets have to be matched with the ability to access opportunities instantly and with no limits. Historically correspondent banks would move large sums of money for those needing to transfer funds while creating bottlenecks of unnecessary friction. Innovations such as shared ledger transactions for institutional investors and traders are enabling transfers to be made of any amount and at no cost which is essential in a fast moving crypto market.<\/span>","<span data-v-f87c67ca=\"\">The digital asset economy has been a catalyst for payments and treasury innovations that have helped increase market liquidity with institutional investment leveraging new products and services. Funding trades on legacy networks that close outside of business hours can take days to send money. Price swings during the time it takes for settlement impacts margins and in some cases the ability to make a trade. Digital assets have fuelled the demand for business accounts that provide regulated access to the crypto market with USD as well as non-USD currencies with BCB Group customers able to transfer their funds with no limits and instantly between account holders.<\/span>","<span data-v-f87c67ca=\"\">The products and services featuring BCB Group’s instant settlements are being adopted by institutional players and are proving invaluable for large firms hoping to expand their interests into Europe. Reliable cross-border payments reduces the friction for international trading at a time when costs and efficiency are paramount with instant transfers made possible by sharing networks that have a common ledger with direct connectivity and no intermediaries to charge fees or slow down the process. This has improved settlements on all fronts - speed, cost, reach&nbsp; and transferable amounts.<\/span>","<span data-v-f87c67ca=\"\">A shared ledger means that everyone using the network can go through compliant onboarding such as KYC and PEP sanctions checks with money never having to move across accounts. The ledger calculates all transactions at run time, settles the balances, and reconciles to make sure the balances are in sync with physical bank accounts. This is especially useful for cryptocurrency services such as exchanges, liquidity providers, market makers, OTC brokers, funds and prime brokers. Traditional banks offering instant settlements on high-value, wholesale payments are often restricted to limited currencies and geographies whereas BCB Group has levelled the playing field offering accounts with integrated payment networks.<\/span>","<span data-v-f87c67ca=\"\">Internal omnibus accounts that can share a ledger with other users streamline the settlement process in ways that can accommodate non-USD currencies with efficiency and flexibility that separates what has previously been on offer in Europe from traditional banking. The unnecessary costs of instant settlements are being consigned into the history books of traditional finance with a new infrastructure layer taking its place built to solve the limitations of legacy banking and payment rails. This has increased institutional access to Europe for trading and investing in real time across borders during an exciting new era that has consolidated industry standards and best practices for fiat and crypto markets.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BCB Group","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Europe","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}