{"summary":"Blockchain project Lisk’s Lightcurve unit has laid off 21 of its 53 employees \nThe decision has been taken to “decrease our operational overhead in order to become more agile again,” said Lisk CEO Max Kordek \nLightcurve is just one of the blockchain projects that have cut their workforce in recent weeks ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/50432\/blockchain-project-lisks-unit-lightcurve-lays-off-40-of-staff-to-become-more-agile-again","publishDate":"2019-12-13T05:30:50","id":504,"type":null,"title":"Lisk&#x27;s unit Lightcurve lays off 40% of staff; become ‘more agile again’","category":["Layer 1s"],"content":["Blockchain project Lightcurve, a part of open-source blockchain platform Lisk, has cut nearly 40% of its workforce.","Announcing the news on chat app Discord earlier this week, Lisk co-founder and CEO, Max Kordek,<a href=\"https:\/\/discordapp.com\/channels\/405002561775599619\/405002561779793921\/653615568435412993\" data-v-f87c67ca=\"\"> said<\/a> that Lightcurve had to let go of 21 of its 53 employees to cut costs. Kordek confirmed the news to The Block on Friday, saying “one of the Lisk Foundation’s contractors named Lightcurve laid off the people.”","Lightcurve is a unit of Lisk, co-founded by Kordek and Oliver Beddows - both of them are also co-founders of Lisk. Kordek told The Block that Lightcurve is the Lisk Foundation's main research and development studio and that the foundation is working together with \"other contractors for other reasons,\" but those are \"not founded or managed by Oliver or myself.\" Kordek declined to share more information about those contractors.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe Lisk Foundation, on its part, currently employs 5 persons for operational reasons, Kordek told The Block, adding that the team consists of a managing director, two in accounting and two in legal. The foundation also has a board of three, two of those are Beddows and Kordek himself.&nbsp;","Lightcurve also terminated the contracts of three employees who were yet to join. “The reasons were to decrease our burn rate which by a large degree consisted of human resources costs, and to decrease our operational overhead in order to become more agile again,” said Kordek on Discord.","The <a href=\"https:\/\/lightcurve.io\/about-us?positions=\" data-v-f87c67ca=\"\">remaining 32 employees<\/a> of Lightcurve, from research, backend development and developer relations departments, will continue to focus on building the project. “We are looking forward to the next year. Some exciting things are coming,” said Kordek on Discord, without disclosing details.","Both Lisk and Lightcurve were founded in 2016, while the former is Switzerland-headquartered, the latter is based in Germany. Lisk raised 14,052 bitcoin (currently worth over $100 million) in an initial coin offering (ICO) in 2016. The project's <a href=\"https:\/\/coinmarketcap.com\/currencies\/lisk\/\" data-v-f87c67ca=\"\">LSK token<\/a> is currently priced at $0.65 apiece.","Lisk reportedly<a href=\"https:\/\/www.coindesk.com\/lisk-relaunches-blockchain-project-accessibility-mind\" data-v-f87c67ca=\"\"> rebranded<\/a> last year, with “accessibility” in mind. “In the beginning, it was really more like a tech project. Now we’re more about enabling people, about giving access to them, because blockchain technology is such an amazing thing. We basically want to distribute it to the people to make it accessible so that everyone can build on it,” Kordek told CoinDesk at the time.","Lightcurve is just one of the latest firms to announce layoffs in recent weeks. <a href=\"https:\/\/www.theblockcrypto.com\/daily\/50171\/another-round-of-lay-offs-sweep-circle-following-announcement-of-cofounders-exit\" data-v-f87c67ca=\"\">Circle laid off<\/a> 10 employees earlier this week. Last month, blockchain analytics firm <a href=\"https:\/\/www.theblockcrypto.com\/linked\/48030\/chainalysis-lays-off-20-of-its-employees-to-focus-on-path-to-profitability\" data-v-f87c67ca=\"\">Chainalysis cut<\/a> its workforce by 20% (laying off 39 employees), to be on the \"path to profitability.\" Ethereum development studio <a href=\"https:\/\/cointelegraph.com\/news\/unconfirmed-consensys-is-shutting-down-offices-in-india-and-the-philippines\" data-v-f87c67ca=\"\">Consensys<\/a> also recently shut offices in India and the Philippines, laying off 11 employees.","<em data-v-f87c67ca=\"\">UPDATE: This story has been updated to include further comments from Lisk co-founder and CEO, Max Kordek.<\/em>"],"hashtag":["LAYOFFS"]}