{"summary":"PeopleDAO has lost 76.5 ether, equal to about $120,000, to a hacker who gained control of the project’s payout form that was shared to a public channel.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/219214\/peopledao-hacked-via-google-sheets","publishDate":"2023-03-13T08:33:23","id":5044,"type":null,"title":"PeopleDAO hacked via Google Sheets, $120,000 worth of ether stolen","category":["CRYPTO ECOSYSTEMS"],"content":["PeopleDAO, a group formed to buy a copy of the U.S. Constitution, has lost 76.5 ETH ($120,000) to a social engineering hack on March 6 that targeted the project’s monthly contributor payout form on Google Sheets.","A combination of errors led to the theft, <a href=\"https:\/\/twitter.com\/The_PeopleDAO\/status\/1634518915668668416?s=20\" data-v-f87c67ca=\"\">according<\/a> to the project team. First, the accounting lead mistakenly shared a link to the payout form with edit access to a public channel on the project’s Discord Server. The hacker was able to use this edit access on the form to insert their address and a 76.5 ETH payment. The hacker then made this row invisible on the form.","This hidden row on the form escaped the team’s notice during rechecks. It also was not picked up by the multi-signature signers who executed the transfers after data from the form had been sent to the airdrop tool on Safe. As such, the attacker’s wallet received the 76.5 ETH payment. The hacker subsequently transferred the ether to two centralized exchanges — HitBTC and Binance — with 69.2 ETH ($110,000) going to the former and 7.3 ETH to the latter.","<a href=\"https:\/\/www.theblock.co\/post\/192901\/constitutiondao2-selling-nfts-in-revived-bid-to-buy-us-constitution\" data-v-f87c67ca=\"\">PeopleDAO<\/a> says it is working with blockchain <a href=\"https:\/\/www.theblock.co\/post\/215206\/platypus-finance-says-french-police-took-suspected-hackers-into-custody\" data-v-f87c67ca=\"\">security experts like ZachXBT<\/a> and SlowMist to track the hacker. The team says it also reported the matter to U.S. law enforcement agencies as well as the exchanges used by the hacker. PeopleDAO offered a 10% white hat bounty to the hacker should they return the funds. The hacker has not responded to this offer as of the time of reporting.","The team said it's taking steps to avoid similar mishaps in the future. “We are improving our accounting and multisig education,\" the team told The Block. “We are embracing tools built on Safe that improve signer experience.”","PeopleDAO says it is planning to host demo sessions with team members about how to use these tools to prevent a repeat occurrence.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"$110,000","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"$120,000","content":"MONEY"},{"type":"March 6","content":"DATE"},{"type":"Google Sheets","content":"ORGANIZATION"}],"hashtag":["DAOS","EXPLOITS","HACKS"],"authors":["Osato Avan-Nomayo","The Block"]}