{"summary":"Twenty-five U.S.-based virtual asset providers (VASPs) have come together to publish a white paper on an industry-wide solution to travel rule compliance.\nThe solution takes a centralized approach, setting up a “bulletin board” to locate counterparty information and point-to-point information transmission for the required data.\nFormer Coinbase CCO Jeff Horowitz first announced the white paper production in July, but he has since left the firm. ","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/81840\/working-group-vasp-fatf-travel-rule-paper","publishDate":"2020-10-21T11:49:31","id":505,"type":null,"title":"Working group of U.S. crypto firms unveil their data-sharing solution to FATF &#x27;travel rule&#x27; compliance","category":["Regulation"],"content":["Twenty-five U.S.-based virtual asset service providers (VASPs) have come together to publish a white paper on an industry-wide solution to travel rule compliance.","In essence, the U.S. Travel Rule Working Group (USTRWG) is proposing a kind of hub through which they can identify customer information and use point-to-point communication channels to transmit that data.","The Financial Action Task Force (FATF) released guidance last June that said crypto would have to comply with its travel rule. Now, VASPs will have to collect and transfer the name and account number of both the originator and beneficiary. They'll also have to collect and transfer location information on the originator.","This created a challenge for crypto, as a system built on anonymity was now being asked to transact with a traditional banking standard securely. Banks solved this problem with SWIFT infrastructure.&nbsp;","The effort to bring together U.S. crypto exchanges to design a joint solution was first made public in <a href=\"https:\/\/www.theblockcrypto.com\/daily\/72293\/coinbase-exchanges-fatf-travel-rule-solution\" data-v-f87c67ca=\"\">July<\/a>. Jeff Horowitz, Coinbase's former chief compliance officer, unveiled the effort during a GDF virtual event. Horowitz has since <a href=\"https:\/\/www.theblockcrypto.com\/post\/80824\/coinbases-chief-compliance-officer-is-set-to-leave-the-firm\" data-v-f87c67ca=\"\">departed<\/a> the role, with Chief Legal Officer Paul Grewal taking over his day-to-day responsibilities during the search for a new CCO. Grewal <a href=\"https:\/\/twitter.com\/iampaulgrewal\/status\/1318682579508232192?s=20\" data-v-f87c67ca=\"\">tweeted<\/a> out the report yesterday with the comment: \"We need to get the Travel Rule right for virtual assets. USTRWG's proposal is an important next step.\"","At the time of the July announcement, Gemini, Kraken and Bittrex were confirmed members of the working group.&nbsp;","The USTRWG says it's attempting to solve for three components of compliance: governance, reliable counterparty identification and secure data transmission. It's taken a centralized approach to these problems in a <a href=\"https:\/\/www.gdf.io\/wp-content\/uploads\/2020\/10\/USTRWG-Travel-Rule-Solution-V1.pdf\" data-v-f87c67ca=\"\">white paper<\/a> published to the Global Digital Finance (GDF) website, announced in a <a href=\"https:\/\/medium.com\/@GlobalDigitalFinance\/u-s-travel-rule-working-group-white-paper-published-7745b62e7967\" data-v-f87c67ca=\"\">post<\/a> written by Coinbase.&nbsp;","The solution will be rolled out in phases, according to the white paper, first admitting only U.S.-based VASPs to its network. This network will act as both a governance and technology mechanism for compliance by controlling who may join. Members will share an address-VASP \"lookup mechanism\" to find counterparty VASP information and use point-to-point transfer protocols to securely exchange the needed data. The look-up and information transfer mechanisms will be separate from blockchain protocols that transfer funds.","In the initial phase, USTRWG members will create formal agreements that define the governance structure among the VASPs. This approach will delineate how the group admits new members, among other network policies and data standards. It may be set up as an independent industry body in the future, but in Phase 1, the governance will be based on written agreements among the current members.","Phase 1 will also establish the centralized \"bulletin board\" for the discovery of counterparty information, and the encrypted channels for transmission. The group says transmitted data won't be shared in a centralized manner.","Once the solution scales to cover all qualified U.S. VASPs and \"additional asset types\" including high-volume assets, stablecoins and privacy-enhanced coins, it will move to its second phase — an attempt to scale beyond the shores of the U.S.","While this solution is centralized, the white paper acknowledges that other approaches are moving forward in the industry. Future iterations may address interoperability with other approaches, according to the white paper, and over time, the USTRWG says it may even look to decentralize its own approach.&nbsp;"],"hashtag":["COINBASE"]}