{"summary":"Genesis cited a &quot;new wave&quot; of institutional interest in its new Q4 report, reporting more than $8 billion in trades during the period.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/92569\/genesis-global-trading-q4-crypto-loans-trades","publishDate":"2021-01-26T09:00:03","id":5050,"type":null,"title":"Genesis originated $7.6 billion in crypto loans during Q4","category":["LENDING"],"content":["Business boomed for one of the largest trading and lending firms in the crypto market during the final quarter of 2020.","According to Genesis Global Trading's most recent quarterly report, the New York-based firm saw \"a new wave\" of institutional players — spanning banks, private equity firms, and investors — drive growth, with the firm originating more than $7 billion in loans during Q4 2020. In 2020, the firm clocked in $19 billion in cumulative originations.","<em data-v-f87c67ca=\"\">Source: Genesis<\/em>","\"In addition to structuring a new facility with one of our banking partners, we saw a significant uptick in lending volumes with ultra-high-net-worth individuals, corporations, traditional hedge funds, and family offices who wanted to dip their toes in the market for the first time,\" Genesis wrote.","\"Relentless\" demand for cash drove growth in new loan originations, according to the firm. Investors borrowed cash en masse to generate returns through the popular basis trade—which represents the spread between bitcoin futures and spot markets. In Q4, the average loan size in US dollars increased to $4 million from $2 million Q3 — a 100% increase.","\"Take a closer look at the spread\/basis between futures and spot markets, we still need to see a lot more cash inflows before spreads normalize,\" Genesis wrote.","<em data-v-f87c67ca=\"\">Source: Genesis<\/em>","The firm told The Block that the basis trade will narrow as more spot buyers enter the market. \"We expect that as more spot buyers (institutional-size capital inflows) materialize, the amount of USD circulating within the crypto ecosystem (which includes stablecoins and bank balances at Silvergate, Signature, etc.) will increase and, in turn, narrow the basis trade.\"","<strong data-v-f87c67ca=\"\">$20 billion in traded volumes <\/strong>","As for the firm's trading operation, Genesis traded $8.1 billion in spot crypto during the fourth quarter, up 80% from Q3.","The firm — which launched a prime brokerage offering this past spring — said that it executed about a third of its orders via its smart-order routing engine. In total, Genesis traded $20 billion worth of spot crypto in 2020.","Underpinning the spike in volumes was a shift in the volatility of bitcoin, which soared towards $30,000 at the end of the year.&nbsp;","\"With BTC\/USD and most of the crypto complex reaching new highs at the end of Q4, it became apparent we were entering into a new volatility regime, unlike the range bound trading we had seen over the past few years,\" the report noted. \"Spot BTC entered price-discovery mode to find new equilibrium where supply would meet surging demand.\"","","","Genesis, which has been expanding beyond its roots as an over-the-counter trading shop, anticipates more and more of its volumes will be electronic as it introduces new algorithmic strategies via its upcoming agency trading desk.","\"Electronification is a natural conclusion in any asset class,\" the firm said. \"Crypto, true to form, is accelerating through decades of market structure development in a matter of 1-2 years. If anything, crypto lends itself more to electronification than other financial assets due to its digitally-native nature.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"80%","content":"PERCENT"},{"type":"$30,000","content":"MONEY"},{"type":"$4 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$2 million","content":"MONEY"},{"type":"Genesis Global Trading","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"$7 billion","content":"MONEY"},{"type":"100%","content":"PERCENT"},{"type":"$8.1 billion","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"$20 billion","content":"MONEY"},{"type":"final quarter of 2020","content":"DATE"},{"type":"spring","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"Crypto","content":"LOCATION"},{"type":"$19 billion","content":"MONEY"},{"type":"the fourth quarter","content":"DATE"}],"hashtag":["LENDING"],"authors":["Frank Chaparro","The Block"]}