{"summary":"Celsius says it plans on using the time to develop a standalone business and maximize value for the benefit of customers and other stakeholders.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/192418\/celsius-extension-chapter-11-reorganization","publishDate":"2022-12-06T04:43:56","id":5054,"type":null,"title":"Celsius receives extension to submit Chapter 11 reorganization plan","category":["BANKRUPTCY"],"content":["Bankrupt crypto lender Celsius <a href=\"https:\/\/twitter.com\/CelsiusNetwork\/status\/1599957794299711490\" data-v-f87c67ca=\"\">received<\/a> court approval to extend its exclusivity period — the time when it maintains the exclusive right to submit a Chapter 11 reorganization plan — to Feb. 15.","\"We intend to use this time to continue developing a plan for a stand-alone business, as we explore all value maximizing opportunities available to us, for the benefit of our customers and other stakeholders,\" Celsius tweeted.","The extension comes after two court hearings, according to tweets from Celsius, during which a motion requesting approval for a stablecoin sale aimed at providing operational liquidity was also discussed. The judge's decision on the matter, which aims to \"maximize value for all stakeholders,\" is expected next week, according to the crypto lender.","Celsius originally filed a motion requesting approval for the exclusivity period's extension in the first half of November, during which time the crypto lender <a href=\"https:\/\/twitter.com\/CelsiusNetwork\/status\/1590577511188267008\" data-v-f87c67ca=\"\">claimed<\/a> it was \"making substantial progress towards the determination of a value-maximizing path forward.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"the first half of November","content":"DATE"},{"type":"Celsius","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Feb. 15","content":"DATE"}],"hashtag":["BANKRUPTCY FILINGS","COURT HEARINGS"],"authors":["Adam James","The Block"]}