{"summary":"Nexon Group announced its partnership with Ava Labs to launch its online role-playing game MapleStory on the Avalanche network.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281554\/maplestory-moves-web3-with-avalanche","publishDate":"2024-03-11T09:09:17","id":5056,"type":null,"title":"Iconic MMORPG MapleStory moves to Web3 with Avalanche","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">South Korean game publisher Nexon Group announced its partnership with Ava Labs on Monday to launch its 2D mass multiplayer online role-playing game MapleStory on the Avalanche network.<\/span>","<span data-v-f87c67ca=\"\">The collaboration aims to offer its players a Web3-enabled experience under the name, MapleStory Universe, the company said in a statement.<\/span>","<span data-v-f87c67ca=\"\">“MapleStory Universe has migrated to Avalanche for the network’s security and how successfully Avalanche has onboarded and supported various Web3 games over the years,” Nexon said in the statement.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Nexon said in the release that MapleStory Universe will be supported by its own Avalanche Subnet, which can be seen as a network inside of a network that is designed for its gaming ecosystem.<\/span>","<span data-v-f87c67ca=\"\">The first game from the Web3-updated line, named MapleStory N, intends to allow players to build their own in-game worlds and receive Web3 rewards for doing so. While the release did not specify the kind of Web3 incentives users will receive, its <\/span><a href=\"https:\/\/maplestoryuniverse.io\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">website<\/span><\/a><span data-v-f87c67ca=\"\"> states that non-fungible tokens are at the core of its value ecosystem.<\/span>","<span data-v-f87c67ca=\"\">The PC version of MapleStory N on Avalanche is expected to launch by the end of this year, the company said.<\/span>","<span data-v-f87c67ca=\"\">MapleStory, which launched in 2003, was one of the first online games to popularize the free-to-play model. It has since expanded its service to launch servers in the U.S., Europe, and other Asian countries, such as Japan and China. It <\/span><a href=\"https:\/\/medium.com\/@MaplestoryU\/what-it-means-to-run-a-game-for-20-years-1e565a4fd797\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">claims<\/span><\/a><span data-v-f87c67ca=\"\"> to have had over 180 million users worldwide in its 20-year history.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2003","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Ava Labs","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"MapleStory Universe","content":"ORGANIZATION"},{"type":"Japan","content":"LOCATION"},{"type":"Europe","content":"LOCATION"},{"type":"MapleStory N","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Nexon Group","content":"ORGANIZATION"},{"type":"Nexon","content":"PERSON"},{"type":"China","content":"LOCATION"}],"hashtag":["GAME"],"authors":["Danny Park","The Block"]}