{"summary":"Offchain Labs introduced a technical implementation called Arbitrum Stylus to support smart contract development in multiple languages.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/248265\/arbitrum-stylus-introduced-to-expand-language-support-for-ethereum-layer-2-dapps","publishDate":"2023-08-31T09:00:04","id":5059,"type":null,"title":"Offchain Labs introduces Arbitrum Stylus to expand language support for Ethereum Layer 2 dapps","category":["CRYPTO ECOSYSTEMS"],"content":["Blockchain developer Offchain Labs introduced Arbitrum Stylus, a new tool that enables smart contract development in multiple programming languages like Rust, C, and C++ on Arbitrum’s Layer 2 network, alongside the already adopted <a href=\"https:\/\/www.theblock.co\/article\/127738\/solidity-and-rust-developers-are-drawing-higher-wages-and-richer-token-rewards\" data-v-f87c67ca=\"\">Solidity<\/a> language.","Arbitrum Stylus sets itself apart by letting developers write smart contracts not just in Solidity but also in languages that can be converted to WebAssembly, commonly known as WASM. In simpler terms, <a href=\"https:\/\/webassembly.org\/\" data-v-f87c67ca=\"\">WASM<\/a> is a way to run code from languages like Rust and C++ on the web, and now, due to Arbitrum Stylus, on the blockchain too. This makes it easier for more developers to start building smart contracts.","The firm has made the code and testnet for <a href=\"https:\/\/twitter.com\/OffchainLabs\/status\/1696616432812036176\" data-v-f87c67ca=\"\">Arbitrum Stylus<\/a> publicly available. The aim is to broaden access to Ethereum-compatible smart contract development.","According to Offchain Labs, Stylus is designed to simplify smart contract creation on Arbitrum for those skilled in Rust, C, and C++. The firm estimates this could bring over 3 million Rust and C developers into the Ethereum smart contract ecosystem, which has largely been the domain of about 20,000 Solidity developers.","Offchain Labs plans to extend Stylus support to any programming language that can be converted into WASM in the future.","“Growing and building the most inclusive developer community is incredibly important to us,” said Steven Goldfeder, CEO and co-founder of Offchain Labs. “We want to open access for as many people as possible to create new applications; and there is uncapped potential for innovation on the chain and technology stack.”","Offchain Labs suggested that the wider language support and improved efficiency of Stylus could benefit projects in areas like social media or gaming that need high computational power. Specifically, Stylus can help speed up computations, largely due to its compatibility with WASM languages.","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Steven Goldfeder","content":"PERSON"},{"type":"WASM","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"Offchain Labs","content":"ORGANIZATION"}],"hashtag":["ARBITRUM","DEVELOPER TOOLS"],"authors":["Vishal Chawla","The Block"]}