{"summary":"There is now a new twist to the bZx attacks saga. 1inch.exchange, a decentralized exchange (DEX) aggregator, has alleged that it found a $2.5 million worth of vulnerability in bZx&#x27;s Fulcrum lending protocol over a month ago, but bZx didn&#x27;t inform users.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/56579\/bzx-attacks-and-1inch-exchange-allegations-heres-what-the-teams-have-to-say","publishDate":"2020-02-21T03:55:14","id":5067,"type":null,"title":"bZx attacks and 1inch.exchange allegations: Here’s what the teams have to say","category":["DEFI"],"content":["<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">There is now a new twist to the bZx attacks saga.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">1inch.exchange, a decentralized exchange (DEX) aggregator, has alleged that it found a $2.5 million worth of vulnerability in bZx's Fulcrum lending protocol over a month ago, but bZx didn't inform users.&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">It all started on January 11 when bZx's lending and margin trading platform Fulcrum released flash loans feature, <a href=\"https:\/\/medium.com\/@1inch.exchange\/yes-we-hacked-bzx-fulcrum-but-one-month-ago-3f7e5c437ee3\" data-v-f87c67ca=\"\">said<\/a> 1inch.exchange in a Medium blog post published Friday. \"We discovered that $2.5M of user funds from 3 pools could be stolen within a single transaction.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The vulnerability had been published for less than 48 hours when 1inch.exchange discovered it, so there was \"a very high chance malicious attackers could exploit it.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">1inch.exchange went on to explain that it was prepared to perform a white-hat hack to protect user funds and even tested the vulnerability by transferring only one weiDAI (0.000000000000000001 DAI) in two separate transactions. It then reached out to the Fulcrum team to disclose the vulnerability.&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"It took nearly 4 hours for the Fulcrum team to manage the issue, and we got no details from the team about the progress. Additionally, the deployment of the fix took another 12 HOURS, because of special system upgrade timelock in the smart contract. So there were 16 hours during which anyone could steal $2.5M,\" said 1inch.exchange.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Since 1inch.exchange found the vulnerability, the firm says it requested bounty from the bZx team, but \"they basically tried to deny us any bounty reward.\"&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;1inch.exchange further said that the Fulcrum team finally \"tried to use the $3.5k to silence us and hide the whole thing.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"On top of all, the Fulcrum team started accusing us of the recent exploits,\" said 1inch.exchange. bZX <a href=\"https:\/\/www.theblockcrypto.com\/post\/56207\/bzx-attacked-again-645k-in-eth-estimated-to-be-lost\" data-v-f87c67ca=\"\">lost<\/a> around $943,000 in ether (ETH) in two attacks last week.&nbsp;&nbsp;<\/span>","<strong data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">One-sided story?&nbsp;<\/span><\/strong>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">bZx co-founder Kyle Kistner told The Block that the blog post by 1inch.exchange is one-sided. \"We agreed to pay them a bounty even though they violated our disclosure policy by publishing the vulnerability to the public. This was an act of good faith,\" said Kistner.&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"We told them we were writing a post-mortem and scheduling it for the end of Feb. Industry standard responsible disclosure guidelines give 90 days for disclosure (ex. Google, Microsoft, etc. follow these guidelines). We were asking them to sign an NDA [non-disclosure agreement] because they seemed keen on extorting us,\" Kistner added.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n1inch.exchange did not sign any NDA, per the blog post.&nbsp;<br data-v-f87c67ca=\"\">\n<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">But why did it publish the blog post today? \"Since they [bZx] had 2 breaches recently we were pretty sure they will not publish anything [disclosure of the vulnerability] in Feb,\" Anton Bukov, co-founder of 1inch.exchange, told The Block.&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Kistner believes that it is \"a pretty deep violation\" by 1inch.exchange to post the blog post for the purpose of bug bounties.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Bukov, however, told The Block that \"Money is not such matter for us. We are not sure they are going to pay. People just lost $750k in 2 latest attacks. Do you think we should care about $5k?\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">1inch.exchange apparently initially demanded a bounty of closer to $40,000, Kistner told The Block. When asked if bZx will now pay 1inch.exchange the bounty, Kistner said: \"This possibly changes things. We haven't made a decision to not pay them at this time however.\"&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nKistner notably also said that bZx did in passing suspect 1inch.exchange as the hacker of its latest attacks, \"because they have motive and the technical skills but in the end we do not believe them to be behind the attack.\"<br data-v-f87c67ca=\"\">\n<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NDA","content":"ORGANIZATION"},{"type":"$2.5","content":"MONEY"},{"type":"$3.5","content":"MONEY"},{"type":"Kyle Kistner","content":"PERSON"},{"type":"$2.5 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$750k","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Feb","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"January 11","content":"DATE"},{"type":"Kistner","content":"PERSON"},{"type":"Anton Bukov","content":"PERSON"},{"type":"DEX","content":"ORGANIZATION"},{"type":"$943,000","content":"MONEY"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"$5k","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"$40,000","content":"MONEY"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}