{"summary":"Uniswap v3 is set to become completely free for use as open source software after the expiration of its current business license April 1.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/218750\/uniswap-v3-will-become-free-to-use-after-business-license-expires-on-april-1","publishDate":"2023-03-14T12:28:52","id":5068,"type":null,"title":"Developers will be free to fork Uniswap v3 protocol after BSL expires on April 1","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">The open-source protocol for Uniswap's version 3 (v3) will become completely free to be forked by developers after the current Business Source License (BSL) expires on April 1, according to <a href=\"https:\/\/docs.uniswap.org\/contracts\/v3\/guides\/governance\/liscense-modifications\" data-v-f87c67ca=\"\">official documentation<\/a>.<\/span>","<span data-v-f87c67ca=\"\">Uniswap v3, developed by Uniswap Labs, is a decentralized exchange protocol that enables users to trade crypto tokens without relying on a centralized authority. The BSL license for Uniswap v3 was released in 2021, allowing free non-commercial and non-production use of the code. Still, its production use requires an Additional Use Grant designed to balance the interests of open-source developers and commercial users.<\/span>","<span data-v-f87c67ca=\"\">The BSL license will expire two years after its launch, on April 1, after which the code will become fully open source and available for anyone to use without restrictions.<\/span>","<span data-v-f87c67ca=\"\">Uniswap's v3 protocol allows users to deposit tokens into a liquidity pool and receive pool tokens that represent their share of that pool. The pool tokens can then be used to redeem a proportional share of the pool's liquidity in the future. <\/span>","<span data-v-f87c67ca=\"\">The main difference between Uniswap v3 and previous version v2 was the introduction of concentrated liquidity.<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span><span data-v-f87c67ca=\"\">The v3 powers Uniswap's largest DEX by trading volume, processing more than <a href=\"https:\/\/www.coingecko.com\/en\/exchanges\/uniswap\" data-v-f87c67ca=\"\">$1.5 billion<\/a> in trading volume over the last 24 hours, according to CoinGecko data.&nbsp;<\/span>","The expiration of the BSL license for Uniswap v3 is a notable event in the broader DeFi ecosystem for developers inside and outside the Ethereum ecosystem because it allows them to use the code to deploy their own DEXs. When Uniswap v3 becomes available for free use, developers will be able to use its code and deploy their own exchanges free of cost.","For example, PancakeSwap, the biggest exchange on the BNB Chain, has already <a href=\"https:\/\/www.theblock.co\/post\/217147\/pancake-swap-april-upgrade?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">announced<\/a> that it will release v3 in the first week of April, which is speculated to have been developed using Uniswap's v3 protocol. It is expected that making Uniswap v3 freely available for development use may enable it to become the next-generation foundational primitive for the DEX niche, much like its widely adopted predecessor, Uniswap v2.","<span data-v-f87c67ca=\"\">It's important to note that although unlikely, it is theoretically possible Uniswap could modify the license to extend the BSL or take other actions that it might deem appropriate.<\/span>","<em data-v-f87c67ca=\"\">The headline was amended for clarity.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"April 1","content":"DATE"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Uniswap Labs","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"Uniswap v3","content":"ORGANIZATION"},{"type":"$1.5 billion","content":"MONEY"},{"type":"BSL","content":"ORGANIZATION"},{"type":"PancakeSwap","content":"ORGANIZATION"},{"type":"the first week of April","content":"DATE"}],"hashtag":["DEXS","UNISWAP"],"authors":["Vishal Chawla","The Block"]}