{"summary":"North Korea&#x27;s Lazarus Group is suspected of stealing about $37 million.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241607\/lazarus-group-suspected-by-coinspaid-of-37-million-hack","publishDate":"2023-07-26T17:36:27","id":5069,"type":null,"title":"Lazarus Group suspected by CoinsPaid of $37 million hack","category":["SECURITY"],"content":["CoinsPaid is once again processing transactions after halting service in response to an attack on July 22. The company said it suspects North Korea's Lazarus Group orchestrated the attack.","\"We believe Lazarus expected the attack on CoinsPaid to be much more successful,\" the company said in a <a href=\"https:\/\/coinspaid.com\/tpost\/0zx28tmj51-coinspaid-is-back-to-processing-after-be\" data-v-f87c67ca=\"\">statement<\/a>. \"In response to the attack, the company's dedicated team of experts has worked tirelessly to fortify our systems and minimize the impact ... our security measures and procedures allowed CoinsPaid to prevent higher loss of funds.\"","CoinsPaid said client funds were not impacted, although revenues were. The company pointed out that Lazarus Group had allegedly hacked other crypto organizations like Sky Mavis' play-to-earn game Axie Infinity, &nbsp;Atomic Wallet and Alphapo.","Last month, blockchain forensics outfit Elliptic <a href=\"https:\/\/hub.elliptic.co\/analysis\/north-korea-linked-atomic-wallet-heist-tops-100-million\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">said<\/a> Atomic Wallet had been hacked by Lazarus Group, with losses surpassing $100 million. The on-chain sleuth ZachXBT <a href=\"https:\/\/www.theblock.co\/post\/241266\/alphapos-hack-now-estimated-at-60-million-zachxbt\" data-v-f87c67ca=\"\">said yesterday<\/a> that the Alphapo hack probably resulted in a loss of $60 million.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe $60 million stolen from crypto payments processor Alphapo's hot wallets included losses suffered by CoinsPaid, according to ZachXBT. The two organizations are associated with one another.","\"Within a few weeks, CoinsPaid will organize a round table with all the Lazarus victims to announce a new initiative aimed at minimizing and preventing such attacks in the future,\" the company said.","&nbsp;","&nbsp;","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lazarus","content":"PERSON"},{"type":"July 22","content":"DATE"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"$60 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"North Korea","content":"LOCATION"},{"type":"Lazarus Group","content":"ORGANIZATION"},{"type":"Mavis","content":"PERSON"},{"type":"Alphapo","content":"PERSON"}],"hashtag":["HACKS"],"authors":["RT Watson","The Block"]}