{"summary":"The mainnet beta will enable rollups and other modular chains to use Celestia for data availability and consensus.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/260167\/modular-network-celestia-goes-live-on-mainnet","publishDate":"2023-10-31T10:10:18","id":507,"type":null,"title":"Modular network Celestia goes live on mainnet","category":["CRYPTO ECOSYSTEMS"],"content":["Celestia has completed the deployment of its mainnet beta, marking the launch of its modular network.","Operating under the codename Lemon Mint, the mainnet beta introduces data availability sampling (DAS). This technology aims to provide a new scaling method that enables blockchain nodes to confirm data availability without the necessity of downloading the entire dataset for a given block. This idea was initially presented in a whitepaper titled “LazyLedger” four years ago.","“What was once considered a wild moonshot is now a reality four years after the LazyLedger whitepaper was published,” said Ekram Ahmed, spokesperson at the Celestia Foundation. “Celestia is the first modular blockchain network that securely scales with the number of users, making it easy for anyone to spin up their own blockchain.”","Upon the mainnet’s launch, Celestia’s native token, TIA, will become available for trading <a href=\"https:\/\/www.theblock.co\/post\/259970\/celestia-mainnet-tia-token\" data-v-f87c67ca=\"\">on major centralized exchanges<\/a>, including Binance, Bybit, and KuCoin. Additionally, the decentralized exchange Osmosis has announced plans to list the token for trading on its platform.","Celestia’s architecture is designed to allow its nodes to simultaneously reach a consensus on transactions across diverse chains, all while executing these transactions off-chain. It achieves this separation by distinctly isolating the consensus and data availability layers from the execution layer. This configuration enables Celestia to focus primarily on creating an organized and systematic approach to data storage, while leaving the transaction execution to individual chains.","Although initially in an experimental stage, Celestia’s mainnet beta allows rollups and other modular chains to utilize its platform for data availability and consensus.","An ecosystem centered on Celestia is already taking shape. MilkyWay, a liquid staking protocol on Osmosis, has <a href=\"https:\/\/twitter.com\/milky_way_zone\/status\/1719306805577490924\" data-v-f87c67ca=\"\">announced<\/a> its support for Celestia and will soon introduce a liquid staking derivative token (stTIA) on the Osmosis blockchain.","Additionally, Arbitrum has <a href=\"https:\/\/www.theblock.co\/post\/259460\/arbitrum-to-integrate-its-orbit-stack-with-celestia-for-data-availability\" data-v-f87c67ca=\"\">integrated<\/a> Celestia into its Orbit and Nitro tech stacks, while the Cosmos-based smart contract platform Neutron has launched <a href=\"https:\/\/blog.neutron.org\/introducing-nexus-the-interface-to-the-modular-world-c1b424735278\" data-v-f87c67ca=\"\">Nexus<\/a>, aiming to enable developers to deploy rollups on Celestia.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Celestia","content":"LOCATION"},{"type":"Bybit","content":"LOCATION"},{"type":"Cosmos","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"LazyLedger” four years ago","content":"DATE"},{"type":"Nitro","content":"ORGANIZATION"},{"type":"MilkyWay","content":"ORGANIZATION"},{"type":"Lemon Mint","content":"ORGANIZATION"},{"type":"Celestia","content":"ORGANIZATION"},{"type":"Celestia Foundation","content":"ORGANIZATION"},{"type":"Arbitrum","content":"PERSON"}],"hashtag":["ASSETS"],"authors":["Vishal Chawla","The Block"]}