{"summary":"Coinbase has been approved to operate in Italy as a crypto asset service provider as it continues a push into Europe. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/158077\/coinbase-approved-to-operate-as-crypto-asset-service-provider-in-italy","publishDate":"2022-07-18T06:33:56","id":5073,"type":null,"title":"Coinbase approved to operate as crypto asset service provider in Italy","category":["REGULATION"],"content":["Coinbase has obtained a license to operate in Italy as a cyrpto asset service provider as the exchange expands in the region.&nbsp;","According to a <a href=\"https:\/\/blog.coinbase.com\/coinbase-secures-crypto-asset-service-provider-approval-in-italy-6cc78516bf66\" data-v-f87c67ca=\"\">blog post<\/a> on Monday, the publicly traded crypto exchange now meets the new requirements put in place by the Italian regulatory authority Organismo Agenti e Mediatori. It claims to be one of the first companies to meet these benchmarks.","\"Gaining this regulatory approval is a testament to our close collaboration and positive working relationship with the Italian financial regulators,\" said international and business development VP Nana Murugesan in the statement. \"As we continue to grow across Europe and other regions, maintaining our strong regulatory relationships will ensure that we will continue to bring to market the products that our customers want, through the most trusted and secure platform in the cryptoeconomy.”&nbsp;","Earlier this month, the US-based cryptocurrency exchange <a href=\"https:\/\/blog.coinbase.com\/building-across-europe-c4ef51f62509\" data-v-f87c67ca=\"\">outlined<\/a> steps to grow its presence in the UK and continental Europe. These involve meeting policymakers in the UK, establishing a regional centre in Ireland and expanding its footprint across the region. In <a href=\"https:\/\/www.theblock.co\/linked\/43158\/coinbase-receives-e-money-license-in-ireland-to-further-expand-into-europe\" data-v-f87c67ca=\"\">Ireland<\/a> and <a href=\"https:\/\/techcrunch.com\/2018\/03\/13\/coinbase-emoney\/\" data-v-f87c67ca=\"\">the UK<\/a>, Coinbase currently operates via an e-money license, a regulatory tool that allows fintech companies to provide payment services.&nbsp;","The Block contacted the Coinbase press office for further comment but did not hear back by the time of publication.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Monday","content":"DATE"},{"type":"UK","content":"ORGANIZATION"},{"type":"Organismo Agenti e Mediatori","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Italy","content":"LOCATION"},{"type":"Ireland","content":"LOCATION"},{"type":"Nana Murugesan","content":"PERSON"},{"type":"Europe","content":"LOCATION"}],"hashtag":["COINBASE"],"authors":["Tom Matsuda","The Block"]}