{"summary":"Korea Digital Asset expects increased local demand for crypto custody as the nation discusses the potential launch of spot bitcoin ETFs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278535\/south-korea-top-crypto-custodian-saw-deposits-tripled","publishDate":"2024-02-22T04:55:27","id":5078,"type":null,"title":"South Korea&#x27;s top crypto custodian saw deposits more than triple in H2 2023 amid ETF hopes","category":["ASIA"],"content":["<span data-v-f87c67ca=\"\">Korea Digital Asset (KODA), the largest institutional crypto custody service in South Korea, announced on Thursday that the value of crypto assets under its custody expanded by nearly 248% in the second half of 2023.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">KODA — jointly set up by major Korean bank KB Bank, crypto venture capital firm Hashed and blockchain tech firm Haechi Labs — said in a statement that the value of the assets under its custody grew to around 8 trillion Korean won ($6 billion) at the end of last year from 2.3 trillion won at the end of June 2023.<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, the price of bitcoin rose 38% in the latter half of 2023, driven by factors including investors’ excitement about the spot bitcoin exchange-traded fund launch in the U.S., which took place in January this year. Bitcoin was trading at around $51,770 at 5:15 p.m. on Thursday Hong Kong time, up 0.6% over the past 24 hours, according to <\/span><a href=\"https:\/\/www.theblock.co\/price\/248348\/bitcoin-btc-usd\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The Block’s price page<\/span><\/a><span data-v-f87c67ca=\"\">. The <\/span><a href=\"https:\/\/www.theblock.co\/indices\/top\/277090\/gmci-30-gm30\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">GMCI 30 Index<\/span><\/a><span data-v-f87c67ca=\"\"> — representing the performance of the top 30 cryptocurrencies — rose around 42.5% in the second half of last year.<\/span>","<span data-v-f87c67ca=\"\">South Korea currently restricts institutions and corporations from directly investing in crypto via exchanges, while crypto custodians have offered institutional investors a regulated window for managing crypto assets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The firm’s market share in the local crypto asset custody sector reached 80% at the end of June 2023, according to KODA, which cited a report from the Korea Financial Intelligence Unit. KODA said that it currently serves around 50 corporate clients, managing over 200 wallets.<\/span>","<span data-v-f87c67ca=\"\">The demand for crypto custody services could rise even further in the future, KODA said in the statement.<\/span>","<span data-v-f87c67ca=\"\">Earlier this week, both the <\/span><a href=\"https:\/\/www.theblock.co\/post\/277996\/south-koreas-ruling-party-spot-bitcoin-etf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">ruling<\/span><\/a><span data-v-f87c67ca=\"\"> and <\/span><a href=\"https:\/\/www.theblock.co\/post\/278170\/south-korea-opposition-bitcoin-etf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">opposition parties<\/span><\/a><span data-v-f87c67ca=\"\"> in South Korea announced that they plan to pledge the launch of local spot bitcoin exchange-traded funds (ETF) as their election promises ahead of the general election on April 10. Both parties also vowed to lift the ban that restricts institutional investments in crypto.<\/span>","<span data-v-f87c67ca=\"\">\"In view of the flow of global capital markets such as the U.S. and Hong Kong, the institutionalization of digital assets is already irreversible, and I think KODA will play a key infrastructure role if the bitcoin spot ETF is approved in Korea,\" Cho Jin-seok, chief executive officer of KODA, said in the release.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"5:15 p.m.","content":"TIME"},{"type":"80%","content":"PERCENT"},{"type":"second half of last year","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Korea Financial Intelligence Unit","content":"ORGANIZATION"},{"type":"KODA","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"second half of 2023","content":"DATE"},{"type":"42.5%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"Cho Jin","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Korea","content":"LOCATION"},{"type":"0.6%","content":"PERCENT"},{"type":"April 10","content":"DATE"},{"type":"248%","content":"PERCENT"},{"type":"January this year","content":"DATE"},{"type":"last year","content":"DATE"},{"type":"$6 billion","content":"MONEY"},{"type":"KODA","content":"ORGANIZATION"},{"type":"38%","content":"PERCENT"},{"type":"Hong Kong time","content":"TIME"},{"type":"Haechi Labs —","content":"ORGANIZATION"},{"type":"$51,770","content":"MONEY"},{"type":"KB Bank","content":"ORGANIZATION"},{"type":"June 2023","content":"DATE"}],"hashtag":["ASIAN REGULATION","SPOT BITCOIN ETF"],"authors":["Danny Park","The Block"]}