{"summary":"EU lawmakers hope that a new comprehensive framework to regulate digital assets will give the bloc a first-mover advantage. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/206554\/europes-big-bet-on-crypto-regulation","publishDate":"2023-01-31T05:30:24","id":5079,"type":null,"title":"Europe’s big bet on crypto regulation","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">As governments scramble to figure out how to regulate crypto markets, the European Union has produced one of the most comprehensive crypto frameworks to date.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">EU policymakers designed the Markets in Crypto-Assets laws to be a “global standard-setter,” with the hope that greater regulatory certainty will act as a magnet for the digital asset industry. The bill <a href=\"https:\/\/www.theblock.co\/post\/202723\/eus-final-vote-mica-regulation-postponed-april\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">awaits<\/a> a final vote in the European Parliament in April.<\/span>","<span data-v-f87c67ca=\"\">Europe’s bet has divided crypto policy experts, with some arguing that the EU’s action is net-positive for the continent. They have also raised concerns, especially around the bill’s effect on stablecoins.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Being in first mover position gives you early potential commercial opportunity, but it also means that hopefully you really got it right,” said Teana Baker-Taylor, vice president of policy and regulation strategy at Circle, issuer of USD Coin and Euro Coin. &nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“[MiCA] helps to build within the industry an expectation towards what it means to be regulated and what it means to comply on a holistic basis with requirements that are beyond the anti-money laundering space,”<\/span><span data-v-f87c67ca=\"\"> said Elisabeth Noble, the European Banking Authority's regulatory policy expert. For other jurisdictions, MiCA acts as a “benchmark against which to build their regulatory systems.”<\/span>","<span data-v-f87c67ca=\"\">The so-called “Brussels effect” describes how EU laws promulgate globally. When it comes to MiCA, it can already be found in the introductory paragraphs and footnotes of other national legislative proposals and documents by global organizations on digital asset regulation; like the Financial Stability Board’s consultative report.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“MiCA puts Europe in a very strong place. We’ve seen nothing like it globally,” said Caroline Malcolm, who leads international public policy at the blockchain data analysis firm Chainalysis. “In terms of a very comprehensive approach, MiCA pretty much has it all,” she added, acknowledging some areas of consumer protection and advertisement remain at state-level.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">MiCA was originally a response to the threat posed by a borderless digital currency from a foreign tech giant. While Facebook’s Libra (later Diem) project tanked, the EU set out to regulate the crypto sector. Many say this potential existential danger to euro sovereignty left its footprint in MiCA.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The regulation focuses on the centralized points of the industry and provides long-sought clarity over scope and definitions for crypto regulation. It gives Crypto Asset Service Providers<\/span><span data-v-f87c67ca=\"\">&nbsp;a few core competences, like harmonizing a fragmented regulatory landscape across the 27-nation bloc through its passporting regime. If a firm has a license in one EU country, it legally accesses the whole EU market.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We would envision that any of our activity that is Europe-focused would be on-shored within Europe after the implementation of MiCA, now that is on a regulated path to do so,” Circle's Baker-Taylor said.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For traditional finance, MiCA allows players to choose licensed partners to work with for developing their own crypto solutions. Having a legislative framework can prevent reputational risk from operating in an emerging market, according to a TradFi source. &nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Lawmakers in the U.S. are in the process of negotiating legislation around stablecoins and digital commodity markets. Baker-Taylor suggested that the rest of the world should lean back and watch to learn lessons from the EU.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The drafts of U.S. legislation that have been circulated don’t contain the same barriers around stablecoin activity that MiCA does,” said Baker-Taylor, while also highlighting that the U.S. does not have the same comprehensive regulation on the horizon. “MiCA gives the potential opportunity for other jurisdictions to identify where the industry has raised questions about suitability or proportionality or supervisory structure — all the things that go into new regulations.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Stablecoins are one side of the European crypto market that could be impacted. In other cases, the regulatory crackdown may stifle innovation, Baker-Taylor argued, adding that she hoped that there would be opportunities to “revisit, refresh, refine” provisions within the legislation.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The way things sound on paper or in discussion in parliament and the way things end up happening in real life — there is always a gap in that process,” she added.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Chainalysis' Malcolm said that while policy objectives like financial stability were made clear in MiCA, there was a less enunciated motive to treat non-euro currencies differently. <\/span><span data-v-f87c67ca=\"\">After much debate, policymakers <a href=\"https:\/\/www.theblock.co\/post\/173479\/non-euro-stablecoin-transaction-cap-revived-in-mica\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">introduced<\/a> a €200 million daily cap on non-euro-backed stablecoins transactions, harkening back to MiCA’s original intent to protect the euro.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“This idea of thinking about not just sticks but about carrots is probably going to be important in this next round of rulemaking. It’s one thing trying to limit the ones we don’t like, but how do we incentivize the ones we do like,” Malcolm said.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The EBA and other European financial supervisors will carve out the implementation rules for MiCA after the final vote. This includes details like requirements for crypto whitepapers which will become mandatorily listed on exchanges, or how to disclose environmental impact of consensus mechanisms.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I think the [regulatory standards] where we can expect most active engagement from the industry are most likely to be the prudential requirements, such as the requirements around the reserve that has to be maintained by issuers of asset-reference tokens,” said EBA’s Noble.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For a smooth integration of MiCA, she pointed out, the crypto industry and the regulatory institutions have to learn to cooperate and build up supervisory capacity. “The challenge is one that is common across all jurisdictions and that is building the supervisory capability to enforce the application of regulation in the crypto assets sector.”&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A potential follow-up regulation — dubbed MiCA II — is already alluded to in the European institutions by officials who feel that more needs to be done to regulate crypto, especially areas like decentralized finance.<\/span>","<span data-v-f87c67ca=\"\">For one, the European Central Bank chief Christine Lagarde is proponent of the notion. She previously told the European Parliament that Europe aims to lead in expanding crypto regulation. Noble, however, argued it is too early to think about a second regulation, as MiCA still faces a series of reviews after it applies.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Ondrej Kovarik, a centrist MEP who helped to draft the regulation in the Parliament, agreed. “Now, the real period of work on the new regulatory framework for crypto assets starts. And I think the key now is the implementation and also the way the supervisors will handle it.”&nbsp;&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"European Banking Authority","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Elisabeth Noble","content":"PERSON"},{"type":"EU","content":"ORGANIZATION"},{"type":"Crypto Asset Service Providers","content":"ORGANIZATION"},{"type":"Taylor","content":"PERSON"},{"type":"Baker","content":"PERSON"},{"type":"Europe","content":"LOCATION"},{"type":"Brussels","content":"LOCATION"},{"type":"European Central Bank","content":"ORGANIZATION"},{"type":"Euro Coin","content":"ORGANIZATION"},{"type":"Caroline Malcolm","content":"PERSON"},{"type":"MiCA","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"Crypto","content":"LOCATION"},{"type":"euro","content":"ORGANIZATION"},{"type":"Teana Baker","content":"PERSON"},{"type":"Financial Stability Board","content":"ORGANIZATION"},{"type":"European Union","content":"LOCATION"},{"type":"European Parliament","content":"ORGANIZATION"},{"type":"EBA","content":"ORGANIZATION"},{"type":"MiCA","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Christine Lagarde","content":"PERSON"},{"type":"Malcolm","content":"PERSON"},{"type":"MiCA","content":"ORGANIZATION"},{"type":"USD Coin","content":"ORGANIZATION"},{"type":"European Parliament","content":"LOCATION"},{"type":"Circle","content":"ORGANIZATION"},{"type":"Ondrej Kovarik","content":"PERSON"},{"type":"Parliament","content":"ORGANIZATION"}],"hashtag":["EUROPEAN PARLIAMENT","EUROZONE REGULATION"],"authors":["Inbar Preiss","The Block"]}