{"summary":"Peer-to-peer (P2P) crypto exchange Paxful has expanded beyond bitcoin. It has added support for Tether (USDT) stablecoin.\nPaxful CEO Ray Youssef told The Block that “stablecoins do a much better job of serving the real use cases of finance, especially in emerging markets. They don’t suffer from volatility.”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/77249\/p2p-crypto-exchange-paxful-adds-tether","publishDate":"2020-09-09T09:00:07","id":508,"type":null,"title":"P2P crypto exchange Paxful expands beyond bitcoin, adds Tether to its platform","category":["Exchanges"],"content":["Peer-to-peer (P2P) crypto exchange Paxful, which has been operating as a bitcoin-only platform since its launch in 2015, has added support for Tether (USDT) stablecoin.","Paxful users can now convert their bitcoin (BTC) holdings into USDT. They will also be able to trade USDT in the near future, said the exchange.&nbsp;","At least until last December, Paxful <a href=\"https:\/\/www.theblockcrypto.com\/post\/44475\/p2p-bitcoin-trading-platform-paxful-adds-800k-wallets-in-the-past-12-months-driven-by-growth-in-africa\" data-v-f87c67ca=\"\">wanted to remain<\/a> a \"bitcoin-only platform.\" When asked what led to the move, Paxful CEO Ray Youssef told The Block in an interview that \"whatever the ideological stance we have, that's great. But everything comes down to our customers and what they want.\"","\"And the truth is that stablecoins do a much better job of serving the real use cases of finance, especially in emerging markets. They don't suffer from volatility,\" said Youssef.","He went on to say that Paxful customers from inflation-hit countries like Venezuela, Argentina, and Nigeria, want to have access to U.S. dollars via Tether. \"The U.S. dollar is still the reserve currency of the world. That's not going to change for a while. So that's something we accept and move with.\"","Nigeria is also the number one market for Paxful in terms of trading volumes, said Youssef, followed by the U.S. and India and other African countries such as Ghana, South Africa, and Kenya making up the top 10 list.","With the USDT integration, Paxful customers won't have to go to crypto exchanges to convert their bitcoin into USDT, said Youssef. \"Normal people don't understand the intricacies of order books and matching algorithms. We offer guaranteed execution.\"","Paxful would also add trading functionality for Tether in the near future, meaning its customers would be able to buy and sell USDT with over 300 payment methods. Youssef said the trading function is already live in some countries, such as Colombia and Nigeria, and will soon be opened to the entire world.","Paxful rival LocalBitcoins currently doesn't support any other asset except bitcoin. When asked whether Paxful would add more coins in the future, Youssef said: \"Yes. It's all, again, about customer demand. If our customers want ether (ETH) and USDC Coin (USDC), we will add.\"","\"And of course, we're an American company, so we can't list any securities or anything like that,\" said Youssef, adding that Paxful also won't list any decentralized finance (DeFi) tokens such as Sushi and Kimchi.","Looking ahead, Paxful is set to launch more products, including \"Pay with Paxful,\" said Youssef. \"If you're a merchant and you want to be able to collect payments from people, you would be able to use a little widget called Pay with Paxful, which is like a version of PayPal Checkout, but it supports any payment method in the world.\"","Overall, Youssef believes that P2P trading volumes will \"far exceed centralized exchange volume in less than two years,\" and that's when \"big money is going to come in.\"","\"Once venture capitalists see peer-to-peer trading is taking over, then they're going to understand that [crypto] is real. It's not just a speculative asset class for rich nerds to play. It's something that real people use every single day to solve real problems in their everyday life,\" said Youssef.&nbsp;"],"hashtag":["BITCOIN","TETHER"]}