{"summary":"Crypto investment platform Freeway announced a halt to services amid &quot;market volatility.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179290\/crypto-platform-freeway-announces-services-halt-token-tumbles","publishDate":"2022-10-23T18:15:57","id":5084,"type":null,"title":"Crypto platform Freeway announces services halt, token tumbles","category":["COMPANIES"],"content":["Crypto investment platform Freeway halted services on Sunday, triggering a significant decline in the value of its in-house token.&nbsp;","The token has dropped by more than 80% in the past 24 hours and users on Telegram were unclear as to the exact nature of the situation. The Freeway token is trading at $0.00110245, according to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/freeway\" data-v-f87c67ca=\"\">CoinGecko<\/a>.&nbsp;","Freeway claims to offer up to 43% annual rewards on so-called \"Superchargers\" denominated in crypto and fiat currencies. Users deposit funds and purchase Superchargers, which generate yield. These products can then be sold back and the funds returned back. However, Freeway said in its statement that \"we will not be buying Supercharger simulations until our new strategies are implemented.\"","\"As all of you will be aware, there has been unprecedented volatility in Foreign Exchange and Cryptocurrency markets in recent times,\" the firm said in its message. \"Freeway has therefore decided to diversify its asset base to manage exposure to future market fluctuations and volatility ensuring the long term sustainability and profitability of the Freeway Ecosystem.\"","Co-CEO Graham Doggart didn't immediately respond to a request for comment via LinkedIn.","A discussion erupted on the company's Telegram channel, with one user saying: \"I can’t liquidate my supercharger and get my funds bc FREEWAY is 'temporarily' not buying back the superchargers they sold me.\"","Freeway wrote: \"We will notify you when we are ready to recommence partial Supercharger simulation purchases (buy-backs) and then again as we can recommence full Supercharger simulation purchases as well as on platform Freeway Token (FWT) Deposits and Buys.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"$0.00110245","content":"MONEY"},{"type":"80%","content":"PERCENT"},{"type":"Freeway","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"43%","content":"PERCENT"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"Graham Doggart","content":"PERSON"},{"type":"Foreign Exchange","content":"ORGANIZATION"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}