{"summary":"India has provided a much-anticipated clarity on crypto taxation in its Union Budget for the fiscal year 2022-23.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/132552\/india-crypto-tax-30-budget-cbdc-blockchain","publishDate":"2022-02-01T03:30:32","id":5087,"type":null,"title":"India to tax crypto income at 30%, launch CBDC in the fiscal year 2023","category":["ASIA"],"content":["India has provided a much-anticipated clarity on crypto taxation in its Union Budget for the fiscal year 2022-23.","The budget, presented on Tuesday by India's Finance Minister Nirmala Sitharaman, said that any income from the transfer of any virtual digital asset will be taxed at a rate of 30%.","The transfer of assets typically means their sale, exchange, and relinquishment, Amit Maheshwari, partner at accounting firm AKM Global, told The Block. He said clarity in taxation suggests that crypto will not be banned in India as some had feared.&nbsp;","\"This is a very significant development as this can be seen as legitimizing investment in digital assets,\" he said.","The 30% tax, however, may discourage investors from investing in crypto and delay the mass adoption of crypto in India, according to Jay Hao, CEO of crypto exchange OKX.","Finance Minister Sitharaman said the magnitude and frequency of crypto transactions made it imperative to provide a specific tax regime for crypto.","Besides the high tax rate, India will also not provide any deductions on crypto income except their cost of acquisition. Further, loss from transferring crypto cannot be set off against any other income, which is a \"bad\" measure, according to Maheshwari.","Losses from stocks, on the other hand, are allowed to be set off in India. Such losses can be set off against gains in the next financial years.","Tax deduction at source or TDS will also be imposed on payments for the transfer of crypto assets at a rate of 1% for transactions over a certain threshold. Gifts of crypto assets will also be taxed in the hands of the recipient.","However, certain ambiguity remains, such as it is not clear how crypto gains are to be calculated, said Maheshwari.","The budget also provided a specific timeline for India's central bank digital currency (CBDC) launch.","Sitharaman said a \"digital rupee using blockchain and other technologies\" will be issued by the Reserve Bank of India starting in the fiscal year 2022-23 (India's fiscal year starts from April and ends in March of next year).","\"Digital currency will give a big boost to the digital economy,\" said Sitharaman. \"Digital currency will also lead to a more efficient and cheaper currency management system.\"","The clarity on crypto taxation is \"a step in the right direction,\" according to Sumit Gupta, co-founder and CEO of CoinDCX. \"It gives much-needed clarity and confidence to the industry,\" he said.","But India still awaits regulatory clarity on crypto. In December, the government was scheduled to introduce a crypto bill in Parliament for discussion, but it didn't get presented. The bill, when presented, will provide specific details on whether India is going to embrace crypto officially or not.","The Indian crypto industry, however, remains hopeful. And as&nbsp;The Block <a href=\"https:\/\/www.theblockcrypto.com\/news+\/125957\/india-crypto-ban-regulation-what-next-signs\" data-v-f87c67ca=\"\">has reported previously<\/a>, recent optimistic comments by Indian ministers suggest that the country intends to regulate crypto soon rather than ban it.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jay Hao","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Sitharaman","content":"PERSON"},{"type":"23","content":"DATE"},{"type":"Amit Maheshwari","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"Maheshwari","content":"PERSON"},{"type":"30%","content":"PERCENT"},{"type":"Sumit Gupta","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"AKM Global","content":"ORGANIZATION"},{"type":"Parliament","content":"LOCATION"},{"type":"India","content":"LOCATION"},{"type":"1%","content":"PERCENT"},{"type":"Reserve Bank of India","content":"ORGANIZATION"},{"type":"fiscal year 2022","content":"DATE"},{"type":"April","content":"DATE"},{"type":"Nirmala Sitharaman","content":"PERSON"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}