{"summary":"Several news outlets, including The Block, reported yesterday that cryptocurrency derivatives provider LedgerX launched a retail trading platform, which","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/34307\/actually-ledgerx-might-not-have-launched-physically-settled-bitcoin-futures-contracts-after-all","publishDate":"2019-08-01T09:00:24","id":5089,"type":null,"title":"Update: CFTC confirms LedgerX doesn&#x27;t have permission after lauded launch announcement","category":["MARKETS"],"content":["Several news outlets, including The Block,&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/tiny\/ledgerx-launches-physically-delivered-bitcoin-options-and-custody\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reported<\/span><\/a> yesterday that cryptocurrency derivatives provider LedgerX launched a retail trading platform, <a href=\"https:\/\/www.coindesk.com\/beating-bakkt-ledgerx-is-first-to-launch-physical-bitcoin-futures-in-us\" data-v-f87c67ca=\"\">which would support<\/a> the first physically settled bitcoin futures contracts in the U.S. However, the primary U.S. derivatives regulator has since told The Block that won't be the case since LedgerX still lacks approval to do so.&nbsp;","The regulator <a href=\"https:\/\/www.theblockcrypto.com\/2019\/06\/25\/ledgerx-snags-license-from-cftc-clearing-the-way-for-first-physically-delivered-futures-and-swaps-in-us\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">approved<\/span><\/a> LedgerX's application for a designated contract market (DCM) license last month, completing a step along the way to deliver physically settled bitcoin futures contracts for all clients, including retail. Such futures pay out customers in actual bitcoin at the expiration of a contract, whereas cash-settled futures pay out in U.S. dollars. A source with direct knowledge of the matter told The Block this morning that LedgerX hit a snag with the CFTC, which requested they remove certain outward-facing posts out Wednesday about the launch of the new platform. The agency was not concerned about erroneous news articles, the person said.&nbsp;","<strong data-v-f87c67ca=\"\">Suspicious behavior<\/strong>","LedgerX deleted a tweet it wrote yesterday, which said: \"It's official: we're live with retail trading on Omni! If you signed up for our waitlist, you'll hear from us soon. [...].\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","Today, it <a href=\"https:\/\/twitter.com\/ledgerx\/status\/1156741493782130688?s=20\" data-v-f87c67ca=\"\">tweeted<\/a>: \"LedgerX Omni (DCM) has launched! Sign up for the waitlist here: [...].\"&nbsp;","The Commodity Futures Trading Commission (CFTC) told The Block today that LedgerX does not have the necessary derivatives clearing organization (DCO) license to trade futures. Its 2017 DCO license approval permitted the clearing of swaps, not futures.","Last market insiders noted it was not clear whether the futures would go live anytime soon. There were no official rule filings about an approved futures contracts either on the LedgerX website or on the primary U.S. derivatives regulator, the CFTC website. A \"derivatives specialist\" named Thomas G. Thompson also <a href=\"https:\/\/twitter.com\/TGTSwaps\/status\/1156608976362061824?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">tweeted<\/span><\/a> yesterday: \"The CFTC does not show any futures contracts certified by #ledgerX.\" There was also no futures volume listed on their publicly available market data.&nbsp;","\"Don't see any reported trade volume either. Vaporware launch,\" one industry insider questioned.&nbsp;","<strong data-v-f87c67ca=\"\">Chou's retort<\/strong>","In response to the CFTC's comment on lack of approval, CEO of LedgerX, Paul Chou, has taken to Twitter, alleging that the CFTC's actions are illegal and saying he plans to <a href=\"https:\/\/twitter.com\/paul_l_chou\/status\/1156987138816258048?s=20\" data-v-f87c67ca=\"\">sue<\/a> the commission if they don't \"do the right thing.\" He also alleged the CFTC previously asked LedgerX to censor its tweets. An insider told The Block that Chou has expressed concerns internally that the CFTC's action are tied to the agency playing favorites with its competitors, including Bakkt and ErisX. Chou has not responded to an email seeking comment.","Since Chou's tweeted comments, LedgerX press representative Ryan Gorman told The Block due to his concerns surrounding the issue that he will no longer be working with LedgerX. ","At best, it seems LedgerX jumped the gun on the announcement of beating rival Bakkt to offer such contracts. Bakkt, set up by the New York Stock Exchange’s parent firm, the Intercontinental Exchange (ICE), has also been preparing to offer one-month and one-day physically-settled bitcoin futures contracts. But it is currently <a href=\"https:\/\/www.theblockcrypto.com\/2019\/07\/26\/bakkt-is-eyeing-a-launch-in-q3-but-part-of-its-plan-is-risky-sources-say\/\" data-v-f87c67ca=\"\">seeking a license<\/a> from the New York Department of Financial Services to operate its so-called Bakkt Warehouse as a trust.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nWhile Bakkt seems to be nearing the launch of its product with the Q3 target timeline, there will still be some issues to adoption. The firm's largest prospective customers recently <a href=\"https:\/\/www.theblockcrypto.com\/2019\/07\/31\/physically-delivered-bitcoin-future-contracts-are-imminent-but-the-bottleneck-now-lies-with-clients\/\" data-v-f87c67ca=\"\">told<\/a> The Block that getting approval to trade Bakkt’s product will be a lengthy process in itself, limited by internal rules and company politics.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nCrypto exchange <a href=\"https:\/\/www.theblockcrypto.com\/2019\/03\/18\/heres-how-bakkt-and-erisx-are-different-according-to-their-executives\/\" data-v-f87c67ca=\"\">ErisX<\/a>, which is backed by U.S. brokerage TD Ameritrade, has also <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/erisx-picks-up-dco-license-for-its-planned-futures-market\/\" data-v-f87c67ca=\"\">received<\/a> relevant licenses from the CFTC to launch its futures products, which are slated for sometime later this year. ","&nbsp;","<em data-v-f87c67ca=\"\">This report has been updated to include new information.&nbsp;<br data-v-f87c67ca=\"\">\n<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"this morning","content":"TIME"},{"type":"Intercontinental Exchange","content":"ORGANIZATION"},{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Bakkt Warehouse","content":"ORGANIZATION"},{"type":"Thomas G. Thompson","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"DCO","content":"ORGANIZATION"},{"type":"New York Stock Exchange","content":"ORGANIZATION"},{"type":"Ryan Gorman","content":"PERSON"},{"type":"Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"TD Ameritrade","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Paul Chou","content":"PERSON"},{"type":"The Block","content":"LOCATION"}],"hashtag":["CFTC","DERIVATIVES"],"authors":["Yogita Khatri","Frank Chaparro","Aislinn Keely","The Block"]}