{"summary":"US inflation showed signs of cooling off and egg prices plunged 24% in bitcoin terms.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/226298\/us-inflation-egg-prices-bitcoin-satoshis","publishDate":"2023-04-13T16:43:19","id":5090,"type":null,"title":"Eggs got cheaper in USD and in bitcoin as US inflation cools down","category":["MARKETS"],"content":["Buying eggs with bitcoin just got a whole lot cheaper.","Egg prices measured in bitcoins fell for the third month in March. The St. Louis Fed has been tracking the price of a dozen eggs using bitcoin as a unit of measure since last summer. Since bitcoin is worth considerably more than a dozen eggs, the reserve bank multiplied the price by 100 million to express it in satoshis.","In March, the average price of a carton of eggs fell to 13,714 satoshis, or 0.00013714 BTC ($3.88), dropping 24% compared to about 18,077 satoshis in February. In January, a carton of eggs cost over 23,800.","A satoshi is the smallest unit of bitcoin, worth 0.00000001 BTC. As such, the average price charged for 12 eggs fell to about 0.00013714 BTC, or about $3.88, based on the average price on March 31, according to the St. Louis Fed's data.","","","The cost of eggs in the U.S. hit all-time highs (in dollar terms) in 2022 as inflation soared and the food product drew media attention. March marked the biggest one-month fall in price in 36 years.","The U.S. Federal Reserve has been scrambling to combat inflation for the past year. This week's data shows signs that interest rate hikes and quantitative tightening might finally be working. Goldman Sachs analysts no longer expect the central bank to hike rates in June.","An end to rate hikes would be an encouraging sign for risk assets like bitcoin. When rates are rising, investors typically flock to safe-haven assets. Risk could be <a href=\"https:\/\/www.theblock.co\/post\/224305\/bitcoin-options-volume-open-interest-cme-all-time-highs-risk-back-on\" data-v-f87c67ca=\"\">back on<\/a>, though, at least, that's what Paradigm co-founder Anand Gomes told The Block recently.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"St. Louis Fed","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"February","content":"DATE"},{"type":"March","content":"DATE"},{"type":"March 31","content":"DATE"},{"type":"third month","content":"DATE"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"24%","content":"PERCENT"},{"type":"June","content":"DATE"},{"type":"$3.88","content":"MONEY"},{"type":"last summer","content":"DATE"},{"type":"Anand Gomes","content":"PERSON"}],"hashtag":["BITCOIN","CRYPTO MOVERS","ECONOMIC INDICATORS","RATE DECISIONS"],"authors":["Adam Morgan McCarthy","The Block"]}