{"summary":"Bitcoin and ether reserves on U.S.-based exchanges have fallen below 50% amid regulatory crackdown in the country, according to CryptoQuant.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234131\/bitcoin-ether-reserves-us-crackdown","publishDate":"2023-06-12T03:35:18","id":5091,"type":null,"title":"Bitcoin and ether reserves fall below 50% on US crypto exchanges","category":["MARKETS"],"content":["Bitcoin and ether reserves on United States-based crypto exchanges have fallen below 50% amid an ongoing regulatory crackdown in the country.","\"U.S.-based crypto exchanges have been dethroned by offshore\/international exchanges in terms of the amount of bitcoin they custody for their customers,\" CryptoQuant said in a research report shared with The Block last week. \"U.S.-based exchanges' bitcoin reserves are down to the lowest level since January 2017,\" it added.","Crypto reserves refer to the amount of respective coins and tokens held by exchanges on behalf of their users. These reserves generally facilitate trading activities — serving as a measure of liquidity. Declining crypto reserves may indicate that users are withdrawing their holdings from exchanges due to security concerns or to hold their funds in private wallets.","","","U.S. regulators continue to crack down on the beleaguered crypto sector, prompting international exchanges to gain traction.","Last week, the U.S. Securities and Exchange Commission sued <a href=\"https:\/\/www.theblock.co\/post\/233202\/details-of-the-sec-complaint-against-binance-include-ftx-like-misuse-of-customer-funds\" data-v-f87c67ca=\"\">Binance<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/233270\/sec-sues-coinbase-binance\" data-v-f87c67ca=\"\">Coinbase<\/a> for allegedly breaking securities rules. Elsewhere, regions like Hong Kong have adopted crypto-friendly policies recently — attracting more crypto firms and users in those countries.","\"The U.S. federal government and regulators are making the operation of U.S.-based crypto businesses more difficult,\" said CryptoQuant. \"The SEC has been unclear about how exchanges can comply with its rules. This is precisely why some exchanges have already decided to cease operations in the U.S., while other U.S.-based exchanges have announced new platforms that will operate outside the U.S.\"","Last week, Hong Kong Legislative Council member Johnny Ng invited Coinbase and other crypto exchanges to establish regional operations. \"I hereby offer an invitation to welcome all global virtual asset trading operators including Coinbase to come to HK for application of official trading platforms and further development plans,\" Ng <a href=\"https:\/\/twitter.com\/Johnny_nkc\/status\/1667499874521350144\" data-v-f87c67ca=\"\">tweeted.<\/a>&nbsp;\"Please feel free to approach me and I am happy to provide any assistance.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Johnny Ng","content":"PERSON"},{"type":"Hong Kong Legislative Council","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"January 2017","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["BITCOIN","ETHEREUM"],"authors":["Yogita Khatri","The Block"]}