{"summary":"The USD Coin (USDC) issuer has frozen USDC funds in Ethereum wallet addresses held by sanctioned crypto mixer Tornado Cash.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/162172\/circle-freezes-usdc-funds-in-tornado-cashs-us-treasury-sanctioned-wallets","publishDate":"2022-08-08T17:16:42","id":5092,"type":null,"title":"Circle freezes USDC funds in Tornado Cash&#x27;s US Treasury-sanctioned wallets","category":["REGULATION"],"content":["Centre, the consortium behind the USD Coin (USDC) stablecoin, has blacklisted wallet addresses controlled by Tornado Cash following the <a href=\"https:\/\/www.theblock.co\/post\/162105\/us-treasury-sanctions-cryptocurrency-mixer-tornado-cash\" data-v-f87c67ca=\"\">US Treasury sanctions against the crypto mixer<\/a>.","Ethereum blockchain explorer data <a href=\"https:\/\/twitter.com\/bantg\/status\/1556712790894706688\" data-v-f87c67ca=\"\">shows<\/a> that Centre has stopped the movement of at least <a href=\"https:\/\/twitter.com\/bantg\/status\/1556712790894706688\" data-v-f87c67ca=\"\">75,000 USDC<\/a> by <a href=\"https:\/\/twitter.com\/usdcblacklist\" data-v-f87c67ca=\"\">blacklisting<\/a> Tornado Cash wallets on the sanctions list. Among these addresses is Tornado Cash’s USDC pool, meaning those with USDC deposited on Tornado Cash may be unable to withdraw their funds.","Circle did not detail the extent of the blacklisting in time for publication, but confirmed it had complied with the Office of Foreign Asset Control's latest measures.","\"Circle is a regulated company and conforms to sanctions compliance requirements,\" said the firm in an email. \"We have addressed the sanctions and blocked the addresses associated with OFAC’s Tornado Cash designation.\"","The US Treasury has sanctioned Tornado Cash for allegedly helping to launder proceeds from crypto hacks for the North Korean hacking syndicate called Lazarus Group. This hacking cartel has been <a href=\"https:\/\/www.theblock.co\/linked\/141985\/us-government-connects-north-korean-hacking-group-with-last-months-600-million-ronin-exploit\" data-v-f87c67ca=\"\">linked to several high-profile crypto hacks,<\/a> including the attacks against the Ronin and Harmony crypto bridges.","By blacklisting the wallet addresses, Tornado Cash will no longer have access to the USDC funds in those wallets. This is because when Centre blacklists an address, the owner becomes unable to receive or transfer USDC funds on-chain from that address. The consortium does this by calling a particular function called “blacklist(address investor).”","This is not the first time that Centre has blacklisted wallet addresses due to law enforcement or regulatory action. The consortium, formed by USD-issuer Circle and exchange platform Coinbase, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/70850\/centre-appears-to-have-blacklisted-an-address-holding-usdc-for-the-first-time\" data-v-f87c67ca=\"\">froze about $100,000<\/a> in USDC belonging to a wallet address in July 2020. The company said the action was based on a law enforcement request. Rival stablecoin Tether has <a href=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/usdt-banned-addresses\" data-v-f87c67ca=\"\">frozen<\/a> 653 addresses on Ethereum over the last few years.","Beyond Circle's actions, Tornado Cash's site appears to be down. Its Github page has also disappeared in the hours since the OFAC announcement.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/asset-management\/tornado-cash-privacy-pool-usd-value-daily\/embed\" title=\"Tornado Cash Privacy Pool USD Value\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"US Treasury","content":"ORGANIZATION"},{"type":"$100,000","content":"MONEY"},{"type":"July 2020","content":"DATE"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Office of Foreign Asset Control","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Centre","content":"ORGANIZATION"},{"type":"Lazarus Group","content":"ORGANIZATION"},{"type":"OFAC","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"USD Coin (USDC","content":"ORGANIZATION"},{"type":"Github","content":"PERSON"}],"hashtag":["USDC"],"authors":["Osato Avan-Nomayo","Aislinn Keely","The Block"]}