{"summary":"The premise of Orb ownership is simple yet intriguing, as it grants the holder the right to solicit insights and advice from Eric Wall — a sort of lifeline like the one used in the popular game show “Who Wants to Be a Millionaire.”","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236422\/eric-wall-nft","publishDate":"2023-06-26T14:42:15","id":5094,"type":null,"title":"Eric Wall on his unique consulting NFT Orb","category":["METAVERSE & NFT"],"content":["In the world of non-fungible tokens, new applications continually test the boundaries of what’s possible. One such experiment is Eric’s Orb, a single NFT that tokenizes a personal consulting service from crypto analyst and investor Eric Wall.","It was released in April at auction, only to now encounter a sudden challenge after its single anonymous holder, who goes by <a href=\"https:\/\/etherscan.io\/address\/0xbcb21689199166a527edec6f1bb03b8f875a88a3\" data-v-f87c67ca=\"\">pawle.eth<\/a>, <a href=\"https:\/\/twitter.com\/orb_land\/status\/1672231193713029121\" data-v-f87c67ca=\"\">relinquished<\/a> ownership after facing a massive 300% annual tax built into the NFT's contract.","Eric Wall launched the Orb as part of his project, Orb Land. The unique NFT granted access to personal consulting services, effectively tokenizing Wall’s time and expertise.","The premise of Orb ownership is simple yet intriguing, as it grants the holder the right to solicit insights and advice from Wall — a sort of lifeline like the one used in the popular game show “Who Wants to Be a Millionaire.”","Despite the attractive proposition, the Orb came with a heavy financial obligation. The holder was required to pay a 25% monthly tax, or an annual tax rate of 300%, using a so-called \"Harberger tax\" in which the owner of an asset pays on a self-determined value.","There's a catch, though, as the system gives anyone the right to purchase the asset at the self-determined value. It essentially encourages owners to value the asset to keep prospective buyers from forcing a sale.","The novel application to an <a href=\"https:\/\/www.theblock.co\/category\/nfts\" data-v-f87c67ca=\"\">NFT<\/a> was meant to ensure market liquidity and provide continuous monetary value to the creator. But the cost can be unsustainable for the holder.&nbsp;","Pawle.eth, the holder who relinquished the Orb, had originally purchased it for 10 ether worth about $18,500. They then set the selling price at 8 ether worth around $14,500, and that all worked out to an annual \"tax\" obligation of 24 ether ($44,400) or a monthly payment of about $3,700 which had to be sent to Wall.","On-chain <a href=\"https:\/\/etherscan.io\/address\/0xbcb21689199166a527edec6f1bb03b8f875a88a3\" data-v-f87c67ca=\"\">data<\/a> shows that Pawle.eth had to continuously top up their wallet to keep up with the tax. However, they eventually ended up relinquishing ownership.","\"Harberger taxes are excellent at preventing hoarding,\" Orb Land <a href=\"https:\/\/twitter.com\/orb_land\/status\/1672231196720263171\" data-v-f87c67ca=\"\">noted<\/a>. \"But what they’re not great by default at is providing someone who bought something at a high price with a soft landing when they want to get out.\"","Despite the substantial outlay, Pawle.eth actively used ownership of the Orb to ask Wall about various topics. These discussions <a href=\"https:\/\/eric.orb.land\/\" data-v-f87c67ca=\"\">included<\/a> their investment thesis as well as Wall’s views on where the most significant value could be captured in future crypto trends.","Reacting to this turn of events, the Orb Land team said it's <a href=\"https:\/\/twitter.com\/orb_land\/status\/1672231193713029121\" data-v-f87c67ca=\"\">introducing<\/a> a new feature to the Orb's mechanism — \"relinquishWithAuction.\" This addition will allow a holder wishing to dispose of the Orb to Dutch auction it, promoting smoother ownership transitions and maintaining market liquidity. The NFT, after being surrendered, will now have to be re-auctioned after a pause, leading to fresh price discovery.","The Orb Land team defended the Harberger tax model and said it prevents passive hoarding and ensures the NFT sees actual use.","“The Harberger tax system ensures that the person who needs it the most obtains the Orb, rather than the person who wants to simply speculate on it. It discourages passive hoarding and ensures that an NFT meant to be used doesn’t go to waste,” Eric Wall told The Block in a prior interview.&nbsp;","Wall himself believes that numerous crypto consultants could sustain themselves solely by answering one question each week using similar Orbs. Supporting this possibility, Wall suggested that influential figures in the crypto industry might introduce their own Orbs.","He mentioned that he could bring on board other analysts, such as <a href=\"https:\/\/www.theblock.co\/post\/88079\/nic-carter-outlook-2021-bitcoin\" data-v-f87c67ca=\"\">Nic Carter<\/a>, to join Orb Land. Additionally, he stated that if creators release an Orb, they can determine their own tax rates, whether lower or higher, as they see fit.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"$14,500","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Eric’s Orb","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"300%","content":"PERCENT"},{"type":"$3,700","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Eric Wall","content":"PERSON"},{"type":"25%","content":"PERCENT"},{"type":"Harberger","content":"PERSON"},{"type":"Nic Carter","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"$44,400","content":"MONEY"},{"type":"$18,500","content":"MONEY"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}