{"summary":"Galaxy Digital has leftover capital after its two infrastructure acquisitions late last year, but plans on getting it right with those first investments, co-president Chris Ferraro said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/217511\/galaxy-digital-has-excess-capital-after-acquisitions-needs-to-get-them-right-before-spending-again","publishDate":"2023-03-06T14:50:16","id":5096,"type":null,"title":"Galaxy Digital has excess capital after acquisitions, needs to get them right before spending again","category":["FINANCE FIRMS"],"content":["Galaxy Digital has leftover capital after its two infrastructure acquisitions late last year, but plans on getting it right with those first investments, president Chris Ferraro said.","In December, the firm agreed to buy the Helios bitcoin mining facility and its related operations from Argo Blockchain for about $65 million and last month completed its purchase of \"substantially all of the assets of GK8, a secure institutional digital asset custody platform, for approximately $44 million.\"","Ferraro, speaking at the JMP Securities Technology Conference, said this year \"should be about fortifying the acquisitions we made, integrating them, getting the foundation right and building.\"","\"We are blessed to have excess capital, to be capitalized even after all this. I won't discount that we might get active again on the M&amp;A side, but if we don't get these right, we don't get the right to buy more companies,\" he said.&nbsp;","Last year, Galaxy Digital <a href=\"https:\/\/www.theblock.co\/post\/163540\/galaxy-digital-terminates-its-acquisition-of-bitgo\" data-v-f87c67ca=\"\">terminated<\/a> an agreement to buy crypto custodian BitGo, a deal it had announced in 2021 for $1.2 billion.","Shares in the Mike Novogratz-led company have plummeted alongside cryptocurrency prices, dipping down to around $3.34 from about $19 a year ago. Ferraro noted that ether and bitcoin have been among the top performing assets in 2022 and 2023 when compared with \"the assets to own,\" namely gold, the Dow Jones, the S&amp;P 500 and others.","Ferraro pointed out that since the Covid lows in March 2020, ethereum is the number one performing asset on a risk-adjusted basis and bitcoin's ranked sixth. So far this year, bitcoin is number one and ethereum is number three, he said.","\"We think it's impossible for investors who care about looking at all the tools they could have in their toolkit to look at those assets and not be interested,\" Ferraro said.","<em data-v-f87c67ca=\"\">Update: This story has been updated to reflect Ferraro's role as president, and adds the termination of the BitGo deal.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"$65 million","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$44 million","content":"MONEY"},{"type":"S&amp;P","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"$19","content":"MONEY"},{"type":"Ferraro","content":"PERSON"},{"type":"March 2020","content":"DATE"},{"type":"Chris Ferraro","content":"PERSON"},{"type":"$3.34","content":"MONEY"},{"type":"Mike Novogratz","content":"PERSON"},{"type":"JMP Securities Technology Conference","content":"ORGANIZATION"},{"type":"$1.2 billion","content":"MONEY"},{"type":"Dow Jones","content":"ORGANIZATION"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}