{"summary":"The Web3 social app also unveiled a new TomoID wallet feature and a planned revamp of its points rewards system.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287553\/socialfi-app-tomo-raises-3-5-million-usd-seed-funding-points-rewards","publishDate":"2024-04-10T12:05:05","id":51,"type":null,"title":"SocialFi app Tomo raises $3.5 million in seed funding, plans points revamp","category":["VENTURE CAPITAL"],"content":["SocialFi app Tomo has closed a $3.5 million seed funding round led by Polychain Capital, with participation from Consensys, Symbolic Capital, OKX Ventures, Nomad Capital, Story Protocol, dao5, KuCoin Ventures and HTX Ventures, among others.","“We are thrilled by the support from our investors, enabling us to innovate in the SocialFi landscape,” Tomo founder Ryan Fang said in a statement. “Tomo's mission is to pioneer a multichain Web3 Social Wallet that unlocks unique blockchain-enabled opportunities. Our vision extends to building a platform where every connection is valued, direct and financially.”&nbsp;","“At Polychain, we back founders and projects that enable new behaviors. We recognize Tomo's role in introducing an immense new user base to the web3 space,” Polychain Capital founder and CEO Olaf Carlson-Wee added. “Tomo adds financial incentives to the feedback loops already embedded in social media apps, optimizing the distribution of value created at the intersection of creators and fans.”","Tomo did not disclose a valuation or the structure of the round.","Similar to other SocialFi apps, like first-mover FriendTech, Tomo uses a “Keys” system, enabling users to purchase access to creators’ content and direct messaging, with content moderation governed by its community guidelines. Key transactions are displayed in USD but made in ether, with a 10% royalty fee shared equally between Tomo and the content creator.&nbsp;","The iOS and Android app aims to simplify the introduction of social media users to blockchain technology, connected via their Gmail, Apple ID, X or Instagram handles. Tomo integrates fiat on-ramping solutions via third-party partners, automatically setting up non-custodial wallets using ERC-4337 technology and operating on the cheaper, scalable Ethereum Layer 2 networks Linea and Base, incubated by Consensys and Coinbase, respectively.&nbsp;","ERC-4337, a key update <a href=\"https:\/\/www.theblock.co\/post\/216504\/ethereum-developers-deploy-entrypoint-to-let-wallets-operate-as-smart-contracts\" data-v-f87c67ca=\"\">introduced<\/a> by core developers in March 2023, enabled account abstraction on Ethereum for the first time. Account abstraction allows wallets to work as smart contracts and operate a host of sophisticated features like multi-factor authentication and wallet social recovery.","Tomo currently ranks fourth in terms of <a href=\"https:\/\/defillama.com\/protocols\/sofi\" data-v-f87c67ca=\"\">total value locked<\/a> in SocialFi apps, according to DeFiLlama data, with nearly <a href=\"https:\/\/www.theblock.co\/post\/256557\/social-finance-apps-tomo-and-new-bitcoin-city-break-above-1-million-in-tvl\" data-v-f87c67ca=\"\">$1 million<\/a> in assets. FriendTech leads the crypto niche with a TVL of $40 million on Base. The Arena on Avalanche and Alpha on NOS rank second and third.","Alongside the funding announcement, the platform also unveiled TomoID —&nbsp; a social wallet for content creators and businesses, featuring a link-in-bio tool and an affiliate program for crypto commissions, just launched in beta, according to the team.","Tomo is also set to revamp its points system in the coming weeks, incentivizing engagement with the app for early contributors and participants. Tomo has yet to confirm whether or not it will launch a token for the platform. However, if or when it does, the points could be an important metric for retroactively rewarding users, the team told The Block.","The SocialFi app also enables users to create and trade ERC-404 tokens called “Tomojis” — offering fractional ownership compared to traditional NFTs. Tomojis serve as collectible digital assets and functional emojis on the app, which can also be traded on exchanges, Tomo said.","A team of four <a href=\"https:\/\/www.theblock.co\/post\/276477\/these-developers-are-mashing-erc-20-tokens-and-nfts-together-will-it-work\" data-v-f87c67ca=\"\">combined<\/a> Ethereum’s ERC-20 token standard and NFTs to create the new ERC-404 standard of semi-fungible tokens in February.","“Tomo's SocialFi strategy is not just another ‘bonding curve’ fork. The team focuses on the social aspect with a clear vision and innovative Web3-native ideas,” Consensys Growth Lead Marco Monaco said. “This investment is not just about the team but also about a tech stack that serves as a reference implementation for dApps aiming to bring millions into Web3: mobile app, account abstraction, transparent bridging, self-custody, fiat onramp, and cooperation with the Linea ecosystem.”","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"4337","content":"DATE"},{"type":"Nomad Capital","content":"ORGANIZATION"},{"type":"Consensys Growth Lead Marco Monaco","content":"ORGANIZATION"},{"type":"Ryan Fang","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$40 million","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"February","content":"DATE"},{"type":"$3.5 million","content":"MONEY"},{"type":"Tomo","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"March 2023","content":"DATE"},{"type":"20","content":"DATE"},{"type":"HTX Ventures","content":"ORGANIZATION"},{"type":"Olaf Carlson","content":"PERSON"},{"type":"KuCoin Ventures","content":"ORGANIZATION"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"Tomo","content":"ORGANIZATION"}],"hashtag":["SEED &AMP; PRE-SEED"],"authors":["James Hunt","The Block"]}