{"summary":"&quot;Tushar and I are the largest LPs of the fund,&quot; Kyle Samani, cofounder and managing partner at Multicoin Capital, told The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157108\/multicoin-capital-announces-its-third-crypto-fund-worth-430-million","publishDate":"2022-07-12T09:46:18","id":5102,"type":null,"title":"Multicoin Capital announces its third crypto fund worth $430 million","category":["VENTURE CAPITAL"],"content":["Multicoin Capital, a crypto-focused venture capital firm, announced on Tuesday its third fund worth $430 million.","The firm began raising for the fund in the fourth quarter of last year and closed it in January of this year, Kyle Samani, co-founder and managing partner at Multicoin Capital, told The Block in an interview.","A good chunk of the fund's capital comes from Samani and his co-founder, Tushar Jain. \"Tushar and I are the largest LPs [limited partners] of the fund,\" said Samani, adding that Multicoin's other employees also participated — along with other unidentified institutional backers.","A third of the Multicoin Venture Fund III has already been invested, according to Samani. Multicoin plans to fully deploy the fund by the end of this year or the middle of the next year, he added. The fund writes checks in the range of $500,000 to $25 million for early-stage opportunities and up to $100 million or more for later-stage projects.","Like its previous funds, Multicoin plans to continue investing in startups that would increase web3's adoption. \"We are looking to back bold entrepreneurs who have a unique vision of how to apply crypto in different industries,\" said Samani.","Multicoin's current investments include Helium, <a href=\"https:\/\/www.theblock.co\/post\/140231\/hivemapper-raises-18-million-to-create-decentralized-mapping-network\" data-v-f87c67ca=\"\">Hivemapper<\/a>, Delphia, Metaplex and FanTiger and it plans to continue investing in \"pioneering\" ideas, said Samani.","The venture capital firm isn't worried about the current market downturn. \"Absolutely nothing has changed for us,\" said Samani. \"We continue to invest aggressively.\" He added that current lower valuations of startups are in fact beneficial for investors like Multicoin.","Multicoin's third fund is a big jump from its $100 million second and $17 million first fund. Samani said the current assets under management of Multicoin is in \"single-digit billions\" of dollars.","Troubled crypto hedge fund Three Arrows Capital (3AC) was an investor in one of Multicoin's funds, but Samani said 3AC's situation has \"absolutely no impact on us.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Delphia","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Multicoin","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Samani","content":"PERSON"},{"type":"$500,000","content":"MONEY"},{"type":"Multicoin Capital","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Tushar Jain","content":"PERSON"},{"type":"Kyle Samani","content":"PERSON"},{"type":"$25 million","content":"MONEY"},{"type":"$17 million","content":"MONEY"},{"type":"$430 million","content":"MONEY"},{"type":"Hivemapper","content":"PERSON"},{"type":"Multicoin Venture Fund III","content":"ORGANIZATION"},{"type":"the fourth quarter of last year","content":"DATE"}],"hashtag":["KYLE SAMANI"],"authors":["Yogita Khatri","The Block"]}