{"summary":"New research disputes concerns that a central bank digital currency would endanger the traditional banking industry. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157165\/treasury-research-argues-that-a-cbdc-would-reduce-threat-of-bank-runs","publishDate":"2022-07-12T15:25:24","id":5106,"type":null,"title":"Treasury research argues that a CBDC would reduce threat of bank runs","category":["POLICY"],"content":["New research disputes concerns that a central bank digital currency would endanger the traditional banking industry.&nbsp;","The Treasury's Office of Financial Research <a href=\"https:\/\/www.financialresearch.gov\/working-papers\/files\/OFRwp-22-04_central-bank-digital-currency.pdf\" data-v-f87c67ca=\"\">published<\/a> a paper on CBDCs and stability on July 12. The researchers argue that \"the adjustments in private financial arrangements in response to a CBDC may tend to stabilize rather than destabilize the financial system.\"","The paper took aim at the concern that a CBDC would facilitate bank runs by incentivizing deposit holders to take their money out of banks. It's a common criticism of CBDCs. Many skeptics of CBDCs are generally fearful of the damage a direct digital link with the Federal Reserve would do to commercial banks.&nbsp;","However, the authors don't do much to assuage concerns that a CBDC could become a tool of government surveillance. They indeed point to information that policymakers draw from CBDC outflows as a means of identifying a bank run more efficiently that current systems allow:&nbsp;","\"If they wish to withdraw funding from the bank, they can currently shift their funds to another bank or other liquid assets (for example, government bonds). Regulators might not immediately observe these withdrawals and, even if they do, might have difficultly distinguishing them from the regular inflows and outflows generated by a bank’s client transactions. Once a CBDC is introduced, policymakers have a&nbsp;new source of information: the flow of funds into the digital currency.\"","A CBDC has become the subject of intensifying <a href=\"https:\/\/www.theblock.co\/post\/154972\/congressional-democrats-plot-path-forward-on-digital-dollar-while-they-have-the-majority\" data-v-f87c67ca=\"\">political back-and-full in recent months<\/a>. In the US, Republicans have been <a href=\"https:\/\/www.theblock.co\/linked\/147909\/house-republicans-seek-more-analysis-on-a-possible-us-cbdc-in-letter-to-the-fed\" data-v-f87c67ca=\"\">particularly skeptical<\/a> of a CBDC's benefits over existing payments systems.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"July 12","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Treasury's Office of Financial Research","content":"ORGANIZATION"},{"type":"CBDC","content":"ORGANIZATION"}],"hashtag":[],"authors":["Kollen Post","The Block"]}