{"summary":"CEO Changpeng Zhao told staff that the near collapse had not been planned and that it would likely trigger increased regulation.\nZhao told staff not to trade FTT token at center of FTX’s problems","author":["Nathan Crooks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/184789\/binance-ceo-says-he-didnt-master-plan-ftxs-collapse","publishDate":"2022-11-09T10:18:54","id":511,"type":null,"title":"Binance CEO says he didn&#x27;t &#x27;master plan&#x27; FTX&#x27;s collapse","category":["Exchanges"],"content":["One day after news broke that Binance might acquire the non-U.S. assets of FTX amid a liquidity crunch, CEO Changpeng Zhao told staff that the <a href=\"https:\/\/www.theblock.co\/post\/184423\/ftxs-bankman-fried-gets-binance-bailout-in-stunning-reversal-of-fortune\" data-v-f87c67ca=\"\">near collapse<\/a> wasn't planned and would likely trigger increased regulatory scrutiny.","\"We did not master plan this or anything related to it,\" Zhao wrote in a note to Binance employees that he later <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1590351182513729544\/photo\/1\" data-v-f87c67ca=\"\">shared on Twitter<\/a>. \"FTX going down is not good for anyone in the industry. Do not view it as a `win for us.'\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nNews of the deal shocked the crypto industry on Tuesday and triggered a broad selloff of digital assets. While Zhao had set the chaos into motion over the weekend by saying his exchange would clear its position in FTX's FTT token, he asked staff to refrain from trading it.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe Financial Times first reported on the memo to staff.","\"If you have a bag, you have a bag,\" Zhao wrote, referencing the call he held yesterday with FTX CEO Sam Bankman-Fried. \"DO NOT buy or sell. As soon as I finished the call with SBF yesterday, I asked our team to stop selling as an organization. Yes, we have a bag. But that's ok.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nZhao said that due diligence for the acquisition deal is ongoing, and he asked staff not to talk about the deal publicly. He said he had a \"good team\" handling the transaction.","The Binance CEO also predicted that regulators worldwide would scrutinize exchanges far more closely in the wake of the FTX collapse.","\"Regulators will scrutinize exchanges even more,\" Zhao wrote, telling his staff to ignore prices and keep their efforts focused on building products. \"Licenses around the globe will be harder to get. And people now think we are the biggest and will attack us more. But that's OK, we are used to being open and leaning into headwinds.\""],"hashtag":["BINANCE","CZ","FTX"]}