{"summary":"Indian crypto exchange CoinDCX has raised $2.5 million from Coinbase Ventures and Polychain Capital. CoinDCX co-founder and CEO Sumit Gupta told The Block that the exchange plans to set up a center of excellence to promote crypto adoption in India, and also plans to launch new products such as lending","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/66369\/coinbase-ventures-polychain-capital-invest-2-5-million-in-indian-crypto-exchange-coindcx","publishDate":"2020-05-25T22:00:19","id":5115,"type":null,"title":"Coinbase Ventures, Polychain Capital invest $2.5m in CoinDCX","category":["INVESTMENTS"],"content":["Indian cryptocurrency exchange CoinDCX has raised more funds, just two months after its Series A round.","The new $2.5 million investment is led by Polychain Capital, with participation from Coinbase Ventures. CoinDCX said this is Coinbase Ventures’ “first investment in an Indian blockchain company,” but the venture firm is already an <a href=\"https:\/\/medium.com\/matic-network\/announcing-our-funding-round-ffd2c2699e74\" data-v-f87c67ca=\"\">investor<\/a> in Mumbai-based Matic Network.","With the fresh capital in place, CoinDCX plans to set up a center of excellence to promote crypto adoption in India, co-founder and CEO Sumit Gupta told The Block, adding that the exchange also plans to launch various new products for retail investors, including lending.","Today's investment comes just two months after CoinDCX's $3 million <a href=\"https:\/\/www.theblockcrypto.com\/post\/59657\/bitmex-operator-polychain-lead-3m-series-a-for-indian-crypto-exchange-coindcx\" data-v-f87c67ca=\"\">Series A round<\/a> in March. When asked why the exchange needed more money so soon, Gupta said CoinDCX aims to bring 50 million users to its #TryCrypto campaign and that the investment would help achieve it via arranging educational initiatives, meetup events and community engagements.","CoinDCX launched the #TryCrypto initiative in March, with a $1.3 million commitment toward creating awareness and adoption of crypto within India.","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Repeat investment<\/strong><\/span>","Notably, this is Polychain’s repeat lead investment in CoinDCX. Olaf Carlson-Wee, founder of Polychain Capital, said CoinDCX’s “long-term product roadmap” has strengthened the venture firm’s belief in its potential.","Gupta said CoinDCX plans to build a full-fledged crypto platform that would cater to all investors and traders.","CoinDCX is “strongly positioned” to become the leading crypto trading platform in India, according to Shan Aggarwal, head of corporate development and investor relations at Coinbase Ventures.","CoinDCX said its trading volumes had touched record highs in recent months. “Our daily trading volume is around $15 million,\" said Gupta, adding that in the last two months, the exchange onboarded nearly 50,000 users.","Today's investment brings CoinDCX’s total funding amount to date to $6 million, Gupta told The Block. In March 2019, CoinDCX raised $0.5 million in seed funding, said Gupta.","CoinDCX is hiring “aggressively” to expand its current team of 60, which has grown from 50 in March. Looking ahead, the exchange is open to raising more funds via strategic investors, Gupta told The Block.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gupta","content":"PERSON"},{"type":"$2.5 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$1.3 million","content":"MONEY"},{"type":"$3 million","content":"MONEY"},{"type":"Sumit Gupta","content":"PERSON"},{"type":"Olaf Carlson","content":"PERSON"},{"type":"Matic Network","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"Mumbai","content":"LOCATION"},{"type":"March 2019","content":"DATE"},{"type":"$15 million","content":"MONEY"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"India","content":"LOCATION"},{"type":"Shan Aggarwal","content":"PERSON"},{"type":"$6 million","content":"MONEY"},{"type":"$0.5 million","content":"MONEY"},{"type":"Wee","content":"LOCATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}