{"summary":"Order book-based decentralized exchange Mangrove secures $7.4 million in funding from trading and VC giants including Cumberland and Greenfield.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215313\/mangrove-raises-7-4-million-series-a-to-enable-market-makers-to-operate-without-locked-capital","publishDate":"2023-02-28T02:51:21","id":5117,"type":null,"title":"Mangrove raises $7.4 million Series A to enable market makers to operate without locked capital","category":["DEALS"],"content":["Mangrove raised a $7.4 million Series A round to build out its order book-based decentralized exchange with its \"offer-is-code” approach to liquidity provisioning.","Cumberland and Greenfield Capital co-led the raise. CMT and Gumi Crypto Capital (gCC) also participated in the fundraising effort, the company said in a statement.&nbsp;","The startup secured $2.7 million in a seed fundraising round in 2021, which was backed by crypto trading titans including Wintermute Ventures and QCP.","Offer-is-code means that liquidity providers are able to post smart contracts as offers, which helps remove the opportunity cost of trading on a decentralized exchange by enabling liquidity providers to only source liquidity when an offer is matched. Traders see benefits because of the lower cost of capital that liquidity providers see on the exchange.","\"Your code is inside the exchange,\" Vincent Danos, co-founder and researcher at Mangrove, said in an interview with The Block. \"You don't have to compete to be close to the exchange, you are actually inside it and that's the driving idea of Mangrove.\"","Mangrove operates a black-box approach, Danos said.","\"We do not know what the nature of the code is you're attaching,\" Danos said. \"Just as in a flash loan, nobody knows what you're doing with the money you're borrowing.\"","This black-box approach creates certain benefits such as a \"last look\" on offers or amplifying liquidity by selling the same asset across different markets, Danos said.","\"Whenever you're taking on one leg in one market then your little piece of code will instantly re-adjust the amount you're offering on the other market,\" Danos said. \"And so you'll never be caught insolvent because you can correct atomically all the time.\"","Mangrove will first on launch on Polygon and will roll out to several Ethereum Virtual Machine (EVM) compatible chains this year.","\"To us, since your offer is going to be a piece of code, the cheaper the gas, the more your code can do,\" Danos said. \"Implementing strategies that are based on Mangrove markets Polygon environment, where gas is really cheap allows you peace of mind, you don't have to think twice if you think there's an opportunity.\"","“Mangrove solves these inefficiencies as the liquidity\/collateral does not have to be on the CEX\/DEX itself but can be sourced from another pool or DeFi protocol once the order in the order book is hit,\" Gleb Dudka, principal at Greenfield Capital said in the statement. \"And yield can be generated elsewhere until the offer is taken. That way Mangrove is disrupting one of the core notions of DeFi – having to lock your liquidity in one protocol compromising on capital efficiency. The disruption is very needed.\"","The startup began raising in March 2022 and closed the round in middle of that summer. The funding from the raise will be used to deliver features on the exchange and pursue research, the company said.","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2021","content":"DATE"},{"type":"Vincent Danos","content":"PERSON"},{"type":"Danos","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$2.7 million","content":"MONEY"},{"type":"Greenfield Capital","content":"ORGANIZATION"},{"type":"Mangrove","content":"LOCATION"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"March 2022","content":"DATE"},{"type":"$7.4 million","content":"MONEY"},{"type":"DEX","content":"ORGANIZATION"},{"type":"QCP","content":"ORGANIZATION"},{"type":"Gumi Crypto Capital (gCC","content":"ORGANIZATION"},{"type":"Gleb Dudka","content":"PERSON"},{"type":"Wintermute Ventures","content":"ORGANIZATION"},{"type":"summer","content":"DATE"}],"hashtag":["SERIES A"],"authors":["Kari McMahon","The Block"]}