{"summary":"An artist has turned parts of a blown up Lamborghini into 999 NFTs, critiquing crypto’s obsession with getting rich.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/134923\/artist-blows-up-lamborghini-to-make-nfts-in-protest-against-crypto-culture","publishDate":"2022-02-21T13:59:49","id":5120,"type":null,"title":"Artist blows up Lamborghini to make NFTs, in protest against crypto culture","category":["NFTS"],"content":["Earlier this month, an artist called Shl0ms, with the help of an explosives expert, blew up a Lamborghini worth just shy of $250,000. They are now turning the charred parts into a collection of 999 NFTs – to protest crypto’s get-rich-quick culture.","“This technology is incredibly promising, there are so many good things we could do with it but there are so many terrible things being done with it,” Shl0ms tells The Block by video call. “It’s really extractive, zero-sum practices.”","The pseudo-anonymous artist chose a Lamborghini because, “the Lambo is a pretty potent representation of people simply engaging with crypto because it’s a way for them to make money off other people as quickly as possible.”","Shl0ms agreed to be interviewed on a video call through a live filter that translates their face into a Matrix-like pixelated representation of a green image on a blue background — constantly shifting, constantly updating. Their voice wasn’t modified, however, so it lacked the deep monotone associated with anonymous individuals.","While they don’t have a traditional artist background, they have been in and around crypto since 2016 and are familiar with the industry. Yet they’ve always had an artistic flair and a penchant for conceptual thinking.","<span data-v-f87c67ca=\"\">The Lamborghini Huracan in the desert before it was destroyed. Image: Shl0ms.<\/span>","“To me, when I'm looking at a screen I'm super cognizant that I’m physically looking at a screen whereas before I had this mental shift, you sort of fall prey to an illusion that you’re looking at someone, for example that I’m looking at you right now and not at a glass surface and a bunch of pixels,” they say.","Shl0ms adds that the digital world is designed so you look like you drag a physical file across space, to make it seem like the real world, something known as skeuomorphism. They played with this idea in a previous artwork, which was an <a href=\"https:\/\/foundation.app\/@shl0ms\/foundation\/68523\" data-v-f87c67ca=\"\">NFT of a fractal<\/a>, where the actual data file itself contained folders within folders that replicated the same fractal. In a sense, the piece contained 730 copies of itself.","And it was this type of examination of the intersection between the physical and the digital that led them to blow up a real object to turn its fragments into NFTs.&nbsp;","It started with a urinal.","Taking inspiration from artist Marcel Duchamp’s artwork of a urinal with a signature written on it, Shl0ms recreated a similar object before smashing it to bits. They picked up each tiny fragment and turned 150 of them into short video clips. In late 2021, they sold these video clips for an NFT collection called FNTN, raising $500,000.","“The destruction as creation motif is pretty common in the traditional art world. Not as common in the crypto art world.”","<span data-v-f87c67ca=\"\">Shl0ms' FNTN artwork, inspired by Duchamp. Image: Shl0ms.<br data-v-f87c67ca=\"\">\n<\/span>","Shl0ms has also played around with other ideas, such as an image measuring 1 pixel by 100 million pixels. They claim that, if somehow displayed, it would stand 16.44 miles tall. Other artwork includes a blank overlay over a scan of the Mona Lisa and an artwork <a href=\"https:\/\/foundation.app\/@shl0ms\/foundation\/29770\" data-v-f87c67ca=\"\">making fun<\/a> of the artist’s heavy use of blank imagery. In total, Shl0ms has made in the ballpark of $1 million from their NFT art experiments.","At the same time as their art career was beginning to take off, Shl0ms had a more ambitious idea. What if they could recreate the same conceptual framework of destroying an object and turning its remnants into NFTs with something bigger and more expensive? Something controversial and unnecessarily destructive?","They decided to blow up a Lamborghini.&nbsp;","In September 2021, Shl0ms tweeted about the idea of blowing up a Lamborghini, or as they described it, “physically fractionalizing” it&nbsp; – a reference to fractionalizing NFTs by turning them into lots of tokens.","They added that Ritholtz Wealth Management COO Nick Maggiulli asked whether it would be “chaotically destroyed or methodically disassembled?” and posed that question to their Twitter following. A poll was soon issued and Shl0ms’s followers narrowly chose “chaos” over “order.”","“Also, want to be clear that I hate lambos and that is why I want to destroy one,” Shl0ms <a href=\"https:\/\/twitter.com\/SHL0MS\/status\/1433067615719772166\" data-v-f87c67ca=\"\">said<\/a> on Twitter at the time, adding, “In fact the DAO will only allow people who hate lambos, that will be our aligning ethos.”","Shl0ms got financial backing for the idea from a single entity and also used their own funds from previous art sales to push the idea forward. They started building out a team that would eventually encompass 100 people across the whole process.&nbsp;","<span data-v-f87c67ca=\"\">One part from the Lamborghini after it was blown up. Image: Shl0ms.<\/span>","Shl0ms purchased a used Lamborghini Huracan — with a lot of miles on the clock — for just under $250,000 and sent one of his “minions” to go pick it up. They then drove it to an undisclosed desert location in the US for its destruction.&nbsp;","On February 2, which Shl0ms notes was 2\/2\/2022, the Lamborghini was blown up.","But it’s no easy task blowing up a car without destroying it <i data-v-f87c67ca=\"\">too much<\/i>. The team spent two weeks prior testing the explosions, including blowing up another car. Plus, in order to handle such firepower, they had to hire a federally licensed explosives engineer (who said this was his most challenging detonation to date).","Following the blast, the team picked up the pieces and documented them. They shot a rotating video of each piece in 4K definition (although the NFT quality might be lower).","The collection is going live on February 25 and at this point the full video of the explosion will be made available. It’s made up of 999 NFTs, with 888 for sale and the remaining 111 for the team and the initial investor.","Yet while the NFT collection seems inherently contradictory — destroying a real-life object to sell NFTs in criticism of using crypto to make a quick buck — Shl0ms is fully aware of it. Plus, they plan to use the funds to build a DAO that won’t have financial goals but will be more ethically minded. So at some point, Shl0ms’s vision might be achieved, that is, as long as the ends justify the means.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$250,000","content":"MONEY"},{"type":"February 25","content":"DATE"},{"type":"2016","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"September 2021","content":"DATE"},{"type":"$500,000","content":"MONEY"},{"type":"Mona Lisa","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"Marcel Duchamp","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"Duchamp","content":"PERSON"},{"type":"Nick Maggiulli","content":"PERSON"},{"type":"DAO","content":"ORGANIZATION"},{"type":"February 2","content":"DATE"},{"type":"Ritholtz Wealth Management","content":"ORGANIZATION"}],"hashtag":["CRYPTO"],"authors":["Tim Copeland","The Block"]}