{"summary":"Embattled crypto lender Hodlnaut faces a nearly $200 million financial shortfall, according to a court affidavit obtained by The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/164756\/hodlnaut-financial-shortfall-193-million-crypto","publishDate":"2022-08-22T02:48:37","id":5121,"type":null,"title":"Hodlnaut reports $193 million financial shortfall as it seeks court protection","category":["LENDING"],"content":["Embattled crypto lender Hodlnaut reported a nearly $200 million financial shortfall in a court affidavit filed earlier this month and obtained by The Block.","The affidavit supporting Hodlnaut’s application to be placed under judicial management — filed August 12 — lays out exactly what led the company to <a href=\"https:\/\/www.theblock.co\/post\/162035\/crypto-lending-platform-hodlnaut-halts-withdrawals-and-is-working-on-a-recovery-plan\" data-v-f87c67ca=\"\">freeze withdrawals<\/a> on August 8.","The document was made available to customers after the company <a href=\"applewebdata:\/\/3FC2F515-770F-4245-BA13-692E50169E96\/Holdnaut,%20the%20embattled%20crypto%20lender,%20faces%20police%20proceedings%20and%20revealed%20that%20it%20laid%20off%20most%20of%20its%20staff.\" data-v-f87c67ca=\"\">published a blog post<\/a> on August 19 confirming that it is facing police proceedings in Singapore and that it has laid off 80% of its staff to conserve cash. The financial data is dated as of August 8.","The affidavit shows that Hodlnaut has an outstanding liability of SGD 391 million (around $281 million), compared with assets of SGD 122 million ($88 million), resulting in a shortfall of around $193 million. \"As of 8 August 2022, the Hodlnaut Group has an outstanding liability balance of SGD 391M and estimated realisable assets of SGD 122M in cryptocurrency. This financial position gives the Hodlnaut Group a realisable cryptocurrency Asset to Debt ratio of about 0.31 (ie. 31 cents on the dollar),\" it stated.","As previously reported, the firm <a href=\"https:\/\/www.theblock.co\/post\/163719\/hodlnaut-crypto-lender-creditor-protection-singapore\" data-v-f87c67ca=\"\">filed for creditor protection<\/a> in Singapore on August 16, seeking time to resolve its financial issues.","The document shows that Hodlnaut parked some $317 million in UST, the failed stablecoin, in Anchor Protocol on Terra as a way to pass high yields through to its customers. In May, Terra’s stablecoin UST <a href=\"https:\/\/www.theblock.co\/linked\/145871\/ust-stablecoin-falls-to-record-low-amid-continued-market-tumult\" data-v-f87c67ca=\"\">sharply de-pegged<\/a> from the dollar, inflicting losses of $189.7 million on Hodlnaut, per the affidavit. Those details <a href=\"https:\/\/twitter.com\/FatManTerra\/status\/1560553570814070784\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">were made public<\/a> earlier last week.","Then, between June 14 and July 15, Holdnaut suffered “greater than usual net outflows” of around $150 million as panicked customers sought to recover their funds, according to the document. Hodlnaut also said its bitcoin (BTC) and ether (ETH) holdings were affected by the broader market decline.","The document also put the number of potential creditors of Hodlnaut — defined as \"users who have actually deposited Tokens and who are likely to be creditors\" —&nbsp;at 17,513.&nbsp;The firm managed $750 million at its peak in March of this year.","Hodlnaut is exploring the option of allowing “limited exits” for users at 25 cents on the dollar, according to the affidavit. The company is already in talks with liquidity providers such as FTX, the crypto exchange, about the feasibility of the proposal, it said. In the affidavit, Hodlnaut positioned&nbsp;that plan as a better outcome for clients than its liquidation.&nbsp;“This would likely be a better option than liquidation as the latter would take a longer period of time, and likely result in a lower return than 25 cents on the dollar given the fees involved in a liquidation situation and given the present cryptocurrency asset to debt ratio of the Hodlnaut Group,” the company said.&nbsp;","The company clarified that it is not currently in liquidation and that it can envisage delivering stable returns in the future, citing the “buoyancy” of the crypto market and the fact it was profitable since launching in 2019 — the UST exposure notwithstanding.","In the months after the collapse of Terra, Hodlnaut sought to reassure concerned customers. In one email to users on June 13, the company addressed the state of the crypto market at that time.","“Hodlnaut practices sound risk management policies. Despite the current volatile conditions, all Hodlnaut products &amp; services remain unaffected and are fully operational, including interest payouts, token swaps, deposits and most importantly, withdrawals,” it said. “We take risk management in the company very seriously and utmost responsibility to customer assets and stakeholders is always at the top of our priority.”","Hodlnaut was contacted for comment on the contents of the affidavit but did not respond by press time.","Hodlonaut is not the only Singapore-based firm that is facing financial difficulties. Crypto exchange Zipmex and crypto lender Vauld have also sought creditor protection in the country. Zipmex has $53 million worth of exposure to troubled firms Babel Finance and Celsius. Vauld, on the other hand, owes more than $400 million to its creditors, <a href=\"https:\/\/www.theblock.co\/post\/158647\/crypto-lender-vauld-owes-363-million-to-retail-investors-after-halting-withdrawals\" data-v-f87c67ca=\"\">as The Block reported last month<\/a>.","<em data-v-f87c67ca=\"\">This article has been updated to include more details about Hodlnaut's plans for offering limited exits to customers.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Hodlnaut","content":"PERSON"},{"type":"$88 million","content":"MONEY"},{"type":"80%","content":"PERCENT"},{"type":"August 2022","content":"DATE"},{"type":"$281 million","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Babel Finance","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$193 million","content":"MONEY"},{"type":"25 cents","content":"MONEY"},{"type":"$317 million","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"$53 million","content":"MONEY"},{"type":"$750 million","content":"MONEY"},{"type":"$189.7 million","content":"MONEY"},{"type":"Terra","content":"LOCATION"},{"type":"$400 million","content":"MONEY"},{"type":"$200 million","content":"MONEY"},{"type":"August 19","content":"DATE"},{"type":"SGD","content":"LOCATION"},{"type":"August 8","content":"DATE"},{"type":"July 15","content":"DATE"},{"type":"Hodlnaut","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"31 cents","content":"MONEY"},{"type":"August 12","content":"DATE"},{"type":"August 16","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Hodlnaut Group","content":"ORGANIZATION"},{"type":"Terra","content":"ORGANIZATION"},{"type":"June 14","content":"DATE"},{"type":"March of this year","content":"DATE"},{"type":"UST","content":"ORGANIZATION"},{"type":"$150 million","content":"MONEY"},{"type":"June 13","content":"DATE"}],"hashtag":["LENDING"],"authors":["Ryan Weeks","Yogita Khatri","The Block"]}