{"summary":"With fourth-quarter earnings for bitcoin miners starting, industry experts are closely watching how companies plan to deploy hardware and manage their treasury going forward.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/209425\/as-bitcoin-miners-prep-for-earnings-season-all-eyes-are-on-treasuries-and-deployments","publishDate":"2023-02-13T21:17:29","id":5124,"type":null,"title":"As bitcoin miners prep for earnings season, all eyes are on treasuries and deployments","category":["CRYPTO INFRASTRUCTURE"],"content":["With fourth-quarter earnings for bitcoin miners starting, industry experts are closely watching how companies plan to deploy hardware and manage their treasury going forward.","2022 was a lesson in frenzied growth and even in the face of bitcoin's recent rally, combined with a dip in energy prices in January, healthy balance sheets and access to low-cost power will still be a winning combination.","CleanSpark set the tone for earnings season Thursday when the firm laid out plans to keep acquiring machines and new sites as it works to meet its end-of-year hashrate guidance. And while CleanSpark plans to keep leveraging discounted prices on the spot market, the possibility of future contracts is also on the table for the coming months.","\"We believe the tides are starting to shift,\" CEO Zach Bradford <a href=\"https:\/\/www.theblock.co\/post\/210393\/cleanspark-2023-buying-spree-continues-as-company-seeks-to-add-50-75mw\" data-v-f87c67ca=\"\">said<\/a> in the company's earnings call for the last quarter.","CleanSpark saw its average power cost across all sites rise from $0.05 per kilowatt-hour between July and September to $0.06 in the following quarter, according to Bradford, but more recently they've consistently been in the $0.02 range.","As the company looks at acquiring an additional 50 to 75 megawatts, any new site will still have to meet \"very strict criteria\" when it comes to power cost, Bradford underlined.","Even combined with the recent rise in bitcoin prices, analysts said that as hashrate that previously dropped off comes back online — increasing mining difficulty in the process — it might offset any of those tailwinds.","\"We remain cautious here as the increase in competition is likely to continue due to the recent drop in energy prices. As a result, we continue to lean on miners with low-cost power, funded growth plans, and ample liquidity to capitalize on the impending shakeout,\" said a note from investment firm D.A. Davidson published on Jan. 30, once again highlighting Riot and Marathon.","D.A. Davidson went as far as to say that well-positioned miners could very well benefit bitcoin trading at a lower value because of the \"competitive dynamic\" of the industry.","\"Given sustained headwinds in the road ahead, we continue to favor public miners with access to low-cost power, an efficient mining fleet, and a healthy balance sheet to withstand unforeseen market volatility,\" said another note from investment firm Stifel.","Stifel also highlighted miners Hive and Hut 8 as well positioned, with the latter last week announcing a <a href=\"https:\/\/www.theblock.co\/post\/209265\/bitcoin-miners-hut-8-and-us-bitcoin-merge-to-form-new-us-based-entity\" data-v-f87c67ca=\"\">merger with US Bitcoin<\/a>.","December was a tough month for miners, with low temperatures driving up energy prices further. The last quarter culminated in the bankruptcy of the largest company in the space, Core Scientific, and many others struggled as well after months of operating at depressed margins.","Companies in the mining sector found themselves in a serious liquidity crunch last year, having taken on large amounts of debt while holding on to all or most of the bitcoin they mined, only to them sell them at depressed prices around the summer in order to reduce debt loads.","\"I'm insanely curious about how people are going to portray their treasury management strategies because we saw a lot of miners sell-off over the course of the last six months,\" Galaxy Digital's Head of Mining Amanda Fabiano told The Block. The company recently acquired a 180-megawatt expandable site from Argo Blockchain, which was exposed to power spikes over the summer as it struggled to close a fixed-price power purchase agreement.","In a recent <a href=\"https:\/\/www.galaxy.com\/research\/whitepapers\/2022-end-of-year-mining-report\/\" data-v-f87c67ca=\"\">report<\/a>, Galaxy estimated that in 2022, miners defaulted on about 11.59 EH\/s worth of hardware-backed loans. Fabiano also highlighted how companies are thinking about growth plans.","\"Those are the things that are really going to distinguish the people who win and the people who lose this year,\" she said.","Kevin Dede, an analyst with H.C. Wainwright, is also zeroing in on how different companies are looking to execute their hashrate deployment plans.","\"Whether or not they have changed, whether or not they've got the machines and whether or not they have the plugs to support those plans and then the power cost,\" he added.","\"In the next cycle, I'd love to see people get a little bit more in-depth on the operational differences between one miner to the next,\" Fabiano also said.","Even though some investors view mining stocks as an alternative to investing in bitcoin, it doesn't mean one miner is equal to another, she argued.","\"We saw a lot of miners that focused the majority of their capital and their time on building the future versus by focusing on 'how do I make this 100 megawatts the best that I could ever make it.' It was 'how do I get to 500 megawatts,'\" she said. \"And the rationale for that was because that's what the market was rewarding.\"","In other words, they built up their businesses based on a snapshot in time, rather than accounting for all the variability of power costs, mining difficulty and bitcoin price, said CleanSpark's executive chairman Matthew Schultz.","\"I don't think a thorough analysis went into energy cost, which is the biggest cost of doing business,\" he said.","While some companies focused their energy on scaling up as fast as possible when money was flowing into the sector, others prioritized nailing down infrastructure and low cost of power.","Meanwhile, hosting providers who offered fixed costs while taking on real-time power prices were the hardest hit in the sector and they probably won't offer the same fixed-rate contracts going forward, the Galaxy report also pointed out.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"CleanSpark","content":"PERSON"},{"type":"US Bitcoin","content":"ORGANIZATION"},{"type":"H.C. Wainwright","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Marathon","content":"ORGANIZATION"},{"type":"Jan. 30","content":"DATE"},{"type":"July","content":"DATE"},{"type":"this year","content":"DATE"},{"type":"\" Fabiano","content":"ORGANIZATION"},{"type":"Zach Bradford","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"D.A. Davidson","content":"PERSON"},{"type":"last quarter","content":"DATE"},{"type":"Argo Blockchain","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"December","content":"DATE"},{"type":"$0.02","content":"MONEY"},{"type":"Matthew Schultz","content":"PERSON"},{"type":"\" Galaxy Digital's Head of Mining Amanda Fabiano","content":"ORGANIZATION"},{"type":"$0.05","content":"MONEY"},{"type":"Bradford","content":"PERSON"},{"type":"summer","content":"DATE"},{"type":"$0.06","content":"MONEY"},{"type":"Kevin Dede","content":"PERSON"},{"type":"Stifel","content":"ORGANIZATION"}],"hashtag":["MINING COMPANIES"],"authors":["Catarina Moura","The Block"]}