{"summary":"Digital asset investment products saw a fourth consecutive week of outflows, while eight altcoin assets saw inflows. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230795\/cardano-tron-sandbox-bitcoin","publishDate":"2023-05-15T11:04:43","id":5126,"type":null,"title":"Cardano, tron, sandbox draw interest as investors shy away from bitcoin: CoinShares","category":["COMPANIES"],"content":["Digital asset investment products saw a fourth consecutive week of outflows totaling $54 million, led as usual by bitcoin, while eight altcoin assets saw inflows.&nbsp;","That suggests \"investors are becoming more adventurous,\" CoinShares said in its weekly fund flow report.&nbsp;","The most notable inflows were to cardano, tron and sandbox. Binance was the only altcoin to see outflows.","Bitcoin and ether prices were down about 3% for the week. Traditional market indices, including the Nasdaq and S&amp;P 500, were also lower.","","","Bitcoin saw outflows totaling $38 million, representing 80% of all outflows for the week. \"When combined with short-bitcoin outflows they highlight that the recent investor activity has almost solely been focused on the asset,\" the firm said.&nbsp;","The outflows were focused primarily in Europe, while 84% of the outflows in the U.S. were from investors selling out of short positions.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$38 million","content":"MONEY"},{"type":"80%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"3%","content":"PERCENT"},{"type":"$54 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"S&amp;P","content":"ORGANIZATION"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"84%","content":"PERCENT"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}