{"summary":"A historical overview of MimbleWimble, Grin, &amp;amp; BEAM MimbleWimble, a blockchain protocol focused on fungibility, privacy, and scalability, was released","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/6747\/mimblewimble-history-technology-and-the-mining-industry","publishDate":"2019-01-08T13:51:57","id":5129,"type":null,"title":"MimbleWimble: History, Technology, and the Mining Industry","category":["RESEARCH"],"content":["<span data-v-f87c67ca=\"\">MimbleWimble, a blockchain protocol focused on fungibility, privacy, and scalability, was released in the wild in July 2016 on IRC channel <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">#bitcoin-wizards<\/span><\/i> <span data-v-f87c67ca=\"\">by pseudonymous Tom Elvis Jedusor. <\/span><span data-v-f87c67ca=\"\">The paper proposed a novel way of combining transactions to improve the privacy features in a public blockchain. <\/span>","<span data-v-f87c67ca=\"\">Jedusor's paper was built on the work of another<\/span> <a href=\"http:\/\/diyhpl.us\/~bryan\/papers2\/bitcoin\/Increasing%20anonymity%20in%20bitcoin%20using%20one-way%20aggregatable%20signatures.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">anonymously posted paper<\/span><\/a><span data-v-f87c67ca=\"\"> from 2013 using one-way aggregate signatures (OWAS), which required a novel cryptographic primitive, <\/span><a href=\"https:\/\/en.wikipedia.org\/wiki\/Pairing-based_cryptography\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">pairing crypto<\/span><\/a><span data-v-f87c67ca=\"\">, which wasn't well trusted in academia. It also drew inspiration from Confidential Transactions and CoinJoin, two privacy proposals by Bitcoin Core developer <\/span><a href=\"https:\/\/github.com\/gmaxwell\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Gregory Maxwell<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">The original MimbleWimble paper used the same elliptic curve cryptography Bitcoin uses, catching the attention of many Bitcoin researchers including <\/span><a href=\"https:\/\/github.com\/apoelstra\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Andrew Poelstra<\/span><\/a><span data-v-f87c67ca=\"\">, a mathematician and applied cryptographer at Blockstream, who further improved on the <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">MimbleWimble<\/span><\/i><span data-v-f87c67ca=\"\"> white paper, releasing a<\/span><a href=\"https:\/\/download.wpsoftware.net\/bitcoin\/wizardry\/mimblewimble.pdf\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">“precise” version<\/span><\/a><span data-v-f87c67ca=\"\"> in October 2016. Poelstra's work has long been focused on privacy, having worked on Confidential Transactions and scriptless scripts in Bitcoin.<\/span>","<span data-v-f87c67ca=\"\">Originally, it was envisioned that MimbleWimble could either be integrated as an upgrade to Bitcoin or exist as a sidechain, but <\/span><a href=\"https:\/\/github.com\/sipa\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Pieter Wuille<\/span><\/a><span data-v-f87c67ca=\"\">, co-founder of Blockstream and a Bitcoin Core developer, clarified some of the challenges to integrating it as a backwards-compatible change on a<\/span><a href=\"http:\/\/diyhpl.us\/wiki\/transcripts\/mimblewimble-podcast\/\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">2016 podcast<\/span><\/a><span data-v-f87c67ca=\"\">:<\/span>","\"Introducing mimblewimble into bitcoin in a backwards-compatible way would be a difficult exercise. It may not be impossible, but it would be hard. I think the way if people were experimenting with this, I would expect it to be an experimental separate chain or sidechain. In a sidechain we would not introduce a new cryptocurrency but it would be a separate chain. There are some downsides to mimblewimble. In particular, it does not have a scripting language...a scripting language is very neat to play with, but it has a privacy downside. Mimblewimble takes this to the other side where you have very good privacy but at the expense of no other features any more.\"","<span data-v-f87c67ca=\"\">The trade-off made by MimbleWimble excludes an expressive scripting language, which allows for innovations such as payment channels (e.g., the Lightning Network) and cross-chain atomic swaps, both of which launched in Bitcoin in 2017. Since then, two separate implementations of the MimbleWimble protocol have emerged, both with different considerations around community, ethos, funding, and technical details.<\/span>","<span data-v-f87c67ca=\"\">The first implementation, <\/span><a href=\"http:\/\/grin-tech.org\/\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Grin<\/strong><\/i><\/a><span data-v-f87c67ca=\"\">, which has become synonymous with MimbleWimble, was released just a few days after Poelsta's position paper. Pseudonymous<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span><a href=\"https:\/\/github.com\/ignopeverell\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ignotus Peverell<\/span><\/a><span data-v-f87c67ca=\"\">, the original owner of Harry's invisibility cloak, created the Github project <\/span><b data-v-f87c67ca=\"\">ignopeverell\/grin<\/b><span data-v-f87c67ca=\"\">, where he provided a<\/span><a href=\"https:\/\/github.com\/mimblewimble\/grin\/commit\/f73a308bf3c9c3a621f8b08d5dfd2e8d87c8a840\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">partial implementation<\/span><\/a><span data-v-f87c67ca=\"\"> of the protocol written in Rust, in addition to posting his vision for the project's ethos.<\/span>","<span data-v-f87c67ca=\"\">In March 2017, Peverell posted<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span><a href=\"https:\/\/github.com\/mimblewimble\/grin\/blob\/master\/doc\/intro.md\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">a technical introduction<\/span><\/a><span data-v-f87c67ca=\"\"> to Grin and MimbleWimble (as the name is now stylized), which serves as the principle reference to the protocol's specification today. To date, the project is still maintained by a group of mostly anonymous developers, several of whom have taken on Harry Potter pseudonyms in line with the original ethos of the project (including Luna Lovegood, Seamus Finnigan, and Percy Weasley). The first Grin testnet was launched in November 2017 and the project is currently on testnet 4,<\/span> <a href=\"https:\/\/www.grin-forum.org\/t\/grin-testnet-4-launch-announcement\/993\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">which is believed to be<\/span><\/a><span data-v-f87c67ca=\"\"> the last before the project's mainnet launch.<\/span>","<span data-v-f87c67ca=\"\">The second implementation, <\/span><a href=\"https:\/\/www.beam.mw\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">BEAM<\/span><\/a><span data-v-f87c67ca=\"\">, is a project started in March 2018 and was formally announced on the one year anniversary of the original <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Mimblewimble<\/span><\/i><span data-v-f87c67ca=\"\"> paper release. BEAM was presented in a<\/span><a href=\"https:\/\/docs.beam.mw\/BEAM_Position_Paper_v0.2.2.pdf\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">separate white paper<\/span><\/a><span data-v-f87c67ca=\"\"> (along with a fully functional mining node and wallet client) and took on a more formal structure<\/span> <a href=\"https:\/\/medium.com\/@arjunblj\/zcash-the-founder-incentive-trilemma-fe7689fc8293\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">similar to Zcash<\/span><\/a><span data-v-f87c67ca=\"\">, in stark contrast to Grin's anarchic, open-source ethos. The BEAM team is led by CEO<\/span> <a href=\"https:\/\/twitter.com\/azaidelson\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Alexander Zaidelson<\/span><\/a><span data-v-f87c67ca=\"\">, an Israeli entrepreneur.<\/span>","<span data-v-f87c67ca=\"\">With a defined management\/engineering team, pre-sale, a formal foundation, and founder's tax, BEAM took a very different approach to present a competitive alternative to Grin in the market. In addition to creating the formal structure around the project, the BEAM team made different technical choices to Grin, including decisions related to the monetary policy and hashing algorithm (which are explored below).<\/span>","<span data-v-f87c67ca=\"\">BEAM launched in early January 2019 with a<\/span> <a href=\"https:\/\/twitter.com\/DoveyWan\/status\/1081945463987683328\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">significant lead<\/span><\/a><span data-v-f87c67ca=\"\"> on hash-rate.<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Note: This, by no means serves as a comprehensive introduction to Bitcoin or cryptography, but provides enough context such that the uninformed reader should be able to follow along.<\/span><\/i>","<span data-v-f87c67ca=\"\">From the earliest days, privacy and fungibility have been core concerns of Bitcoin users. Through complex network analysis and blockchain analysis, Bitcoin has seen many attempts to de-anonymize transactions. While cryptocurrencies have emerged where privacy is a top priority (e.g., Monero and Zcash), Bitcoin has also seen significant privacy and fungibility improvements at both the protocol layer and the transaction layer.<\/span>","<span data-v-f87c67ca=\"\">Both Grin and BEAM use the same unspent transaction output (UTXO) model that Bitcoin uses, in contrast to other account-based cryptocurrencies such as Ethereum.<\/span>","<span data-v-f87c67ca=\"\">A visualization of Bitcoin's UTXO model from Bitcoin.org's documentation.<\/span>","<span data-v-f87c67ca=\"\">When 90k satoshis are sent via new transactions TX1 and TX2, two outputs are generated (40k and 50k satoshis respectively) to an address with an amount determined by the sender.<\/span>","<span data-v-f87c67ca=\"\">Bitcoin, Grin, and BEAM all allow for this through the use of<\/span><a href=\"https:\/\/simple.wikipedia.org\/wiki\/Cryptographic_hash_function\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">&nbsp;cryptographic hashing<\/span><\/i><\/a><span data-v-f87c67ca=\"\">. At a very high-level, a hash function allows you to take an input, apply a <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">cryptographic hash function or CHF<\/span><\/i><span data-v-f87c67ca=\"\"> (which is a standard transformation) and get a fixed-size output (called a digest). This is illustrated below.<\/span>","<span data-v-f87c67ca=\"\">Most importantly: the magic of CHFs <\/span><b data-v-f87c67ca=\"\">represent an asymmetry between an attacker and a defender.<\/b><span data-v-f87c67ca=\"\"> What does this mean? It's really easy to hash an input, but really, really hard (impossible in human-time with the world's supercomputers) to reverse a digest to get the original input. This is a good thing: the majority of the world's internet security assumptions, from passwords to public\/private keys are hashed and the assumption holds until we have meaningfully powerful quantum computers.<\/span>","<span data-v-f87c67ca=\"\">A diagram of a cryptographic hash function. Source: Wikipedia.<\/span>","<span data-v-f87c67ca=\"\">In Bitcoin's UTXO model, it's clear there are three pieces of information publicly visible and verifiable: the <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">input<\/span><\/i><span data-v-f87c67ca=\"\"> information, the <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">output<\/span><\/i><span data-v-f87c67ca=\"\"> information, and the <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">transaction amount<\/span><\/i><span data-v-f87c67ca=\"\">. None of this information is hidden and allows for easy verifiability of how much money is in the system (since all of the UTXOs add up to the expected supply of bitcoins in the system).<\/span>","<span data-v-f87c67ca=\"\">However, these properties come with trade-offs: Bitcoin transactions are not very private, since all of this information <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">appears<\/span><\/i><span data-v-f87c67ca=\"\"> unencrypted to the outside world (though they are hashed). While the community has<\/span><a href=\"https:\/\/bitcoin.org\/en\/protect-your-privacy\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">advanced best practices<\/span><\/a><span data-v-f87c67ca=\"\">, such as discouraging address re-use and encouraging the use of \"mixers\" (where bitcoins are tumbled around with \"fresh\" UTXOs returned to you), privacy efforts like<\/span> <a href=\"https:\/\/en.bitcoin.it\/wiki\/CoinJoin\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">CoinJoin<\/span><\/a><span data-v-f87c67ca=\"\"> and<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span><a href=\"https:\/\/people.xiph.org\/~greg\/confidential_values.txt\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Confidential Transactions<\/span><\/a><span data-v-f87c67ca=\"\"> have been advanced to incorporate more robust privacy features for users.<\/span>","<span data-v-f87c67ca=\"\">MimbleWimble makes several changes to Bitcoin's UTXO model to enable private transactions, based on Confidential Transactions and CoinJoin. From<\/span> <a href=\"https:\/\/github.com\/mimblewimble\/grin\/blob\/master\/doc\/grin4bitcoiners.md\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">the documentation<\/span><\/a><span data-v-f87c67ca=\"\">:<\/span>","<span data-v-f87c67ca=\"\">The first two components are explained by the use of <\/span><b data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Confidential Transactions<\/i><\/b><span data-v-f87c67ca=\"\">, a proposal from former Blockstream CTO (and currently implemented on<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span><a href=\"https:\/\/blockstream.com\/2018\/10\/10\/liquid-launch\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Blockstream Liquid<\/span><\/a><span data-v-f87c67ca=\"\">, a Bitcoin sidechain in production) which uses a cryptographic primitive called a <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Pederson commitment scheme<\/span><\/i><span data-v-f87c67ca=\"\"> to improve on Bitcoin's UTXO model. With confidential transactions, only the <\/span><b data-v-f87c67ca=\"\">participants in a transaction<\/b><span data-v-f87c67ca=\"\"> can see the transaction amount. In theory, this sounds great, but with one key concern: you need non-participants in the system to be able to tell when a transaction is bogus — to prevent any user from spending more money than they have.<\/span>","<span data-v-f87c67ca=\"\">How is this done? A cryptographic <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">commitment<\/span><\/i><span data-v-f87c67ca=\"\"> sounds fancy, but what it means is, \"I am proving I knew something before hashing it because I can't reverse the hash to reveal what I knew.\" Even outside of cryptocurrencies, commitments are used (for example) by people to prove public predictions, e.g. Nic Carter's <\/span><a href=\"https:\/\/twitter.com\/nic__carter\/status\/947899649200934912\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">public prediction<\/span><\/a><span data-v-f87c67ca=\"\"> on January 1st about 2018 project development. In 2019, Nic will be able to reveal his list (in plain-text English) and people will be able to easily verify that his list matches (to the character) what was hashed the previous year.<\/span>","<span data-v-f87c67ca=\"\">In Bitcoin, where simple cryptographic hash functions are used to make transaction commitments, the input, output, and transaction amounts are all essential. A <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Pederson commitment<\/span><\/i><span data-v-f87c67ca=\"\"> improves on this by ensuring that the <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">sum<\/span><\/i><span data-v-f87c67ca=\"\"> of the inputs and the <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">sum<\/span><\/i><span data-v-f87c67ca=\"\"> of the outputs are verifiably equal. The cryptographic proofs that allow for this certainty are beyond the scope of this piece, but this reveals one key insight: the specific inputs and output amounts being spent can remain a secret while the security of the system (and verifiability of that security in any given transaction by non-participants) remains intact.<\/span>","<span data-v-f87c67ca=\"\">But what's to prevent someone from taking two inputs (e.g., -100BTC, 100BTC), using the 100BTC as an input in a confidential transaction and disregarding the -100BTC? The solution in Confidential Transactions is to use another cryptographic primitive called a <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">range proof<\/span><\/i><span data-v-f87c67ca=\"\">. This proof ensures the sanctity of the total supply of money by guaranteeing that the inputs in the system are in a certain range (in this case, positive).<\/span>","<span data-v-f87c67ca=\"\">MimbleWimble implementations all use Confidential Transactions to ensure there are no addresses or amounts visible in the system.<\/span>","<span data-v-f87c67ca=\"\">The third goal stated above, \"removing all intermediary information\" is explained by the use of <\/span><b data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">CoinJoin<\/i><\/b><span data-v-f87c67ca=\"\">, also created by Gregory Maxwell, and speaks to the <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">transaction graph<\/span><\/i><span data-v-f87c67ca=\"\"> in a network. While hiding the information explicitly revealed in a transaction is crucial and done with Confidential Transactions, a transaction's <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">history<\/span><\/i><span data-v-f87c67ca=\"\"> still holds a wealth of implicit information that allows someone with sufficient amounts of computational resources to easily visualize and infer relationships between different transactions in a network. An example of this type of graph is seen below.<\/span>","<span data-v-f87c67ca=\"\">Example of a Bitcoin transaction being visualized, courtesy of Benedict Koehler.<\/span>","<span data-v-f87c67ca=\"\">This is not unprecedented — startups such as <\/span><a href=\"https:\/\/www.elliptic.co\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Elliptic<\/span><\/a><span data-v-f87c67ca=\"\"> and<\/span> <a href=\"https:\/\/www.chainalysis.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Chainalysis<\/span><\/a><span data-v-f87c67ca=\"\"> use these forms of on-chain forensics to detect fraud and \"illicit transactions\" (e.g., money laundering, black market activity) and are well-funded with users ranging from cryptocurrency exchanges (who use it for compliance) to government organizations. Due to the easy traceability of Bitcoin's network graph, it remains a poor choice for necessarily private transactions.<\/span>","<span data-v-f87c67ca=\"\">While presenting a moral argument for the merits of full privacy is beyond the scope of this piece, this problem is not just one for drug dealers and money launderers: an easily traceable network graph allows analysts to make increasingly stronger inferences about transactions on the network over time. Maintaining privacy on this front remains a goal for all proto cyber-monies.<\/span>","<span data-v-f87c67ca=\"\">In CoinJoin, inputs from multiple users are combined in what's called an <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">anonymity set<\/span><\/i><span data-v-f87c67ca=\"\"> and tumbled to ensure that the transaction graph is harder to trace. This is pictured below, where Alice and Bob's 10BTC and 20BTC inputs are combined in a CoinJoin transaction.<\/span>","<span data-v-f87c67ca=\"\">CoinJoin diagram courtesy of Artncase.<\/span>","<span data-v-f87c67ca=\"\">Bitcoin wallets such as <\/span><a href=\"https:\/\/www.wasabiwallet.io\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Wasabi Wallet<\/span><\/a><span data-v-f87c67ca=\"\"> and tumblers like<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span><a href=\"https:\/\/cs-people.bu.edu\/heilman\/tumblebit\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">TumbleBit<\/span><\/a><span data-v-f87c67ca=\"\"> have implemented CoinJoin to offer transaction-layer privacy for Bitcoin. However, they are unsatisfactory. The anonymity set of these products tends to be very small, with only a few participants in each transaction and tend to take significant time to get matching funds. Researchers have even <\/span><a href=\"https:\/\/academic.oup.com\/cybersecurity\/article\/3\/2\/127\/4057584\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">been able to de-anonymize<\/span><\/a><span data-v-f87c67ca=\"\"> the majority of transactions in small anonymity sets.<\/span>","<span data-v-f87c67ca=\"\">MimbleWimble implementations solve this by making CoinJoin a core part of the protocol, rather than a transaction-layer privacy improvement implemented by third-party wallets and services. In MimbleWimble, <\/span><b data-v-f87c67ca=\"\">all transactions in every block are automatically collapsed into a single transaction<\/b><span data-v-f87c67ca=\"\"> and most intermediary transaction information is hidden.<\/span>","<span data-v-f87c67ca=\"\">Now you're probably thinking: my inputs, outputs, and transaction amounts are hidden and the transaction graph sufficiently obfuscated... are there any other ways for motivated actors to figure out what I'm doing? The final potential point of failure is in the ability for individual nodes to de-anonymize transactions by leveraging the originating IP address.<\/span>","<span data-v-f87c67ca=\"\">When a Bitcoin transaction is made from a wallet, it's broadcast to a set of nodes, which then quickly broadcast to their peer nodes in what's described as Bitcoin's <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">gossip network<\/span><\/i><span data-v-f87c67ca=\"\">. Before they're consolidated into a block, because individual transactions are broadcast in pieces, an actor who wants to understand your transactions may do so by recording transactions and the IP addresses they originate from, hoping to use that information to gain information about someone's activity.<\/span>","<span data-v-f87c67ca=\"\">The solution to this proposed by MimbleWimble is based on another improvement proposal originally designed for Bitcoin,<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span><a href=\"https:\/\/arxiv.org\/pdf\/1701.04439.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Dandelion<\/span><\/a><span data-v-f87c67ca=\"\">, envisioned by a team of researchers at the University of Illinois at Urbana-Champaign. It has been in discussion since 2017 as a <\/span><a href=\"https:\/\/lists.linuxfoundation.org\/pipermail\/bitcoin-dev\/2017-June\/014571.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">public Bitcoin Improvement Proposal<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">The goal of Dandelion is to obfuscate the IP address of a Bitcoin transaction. A dandelion flower's petals have a single stem til they blossom fully. Similarly, with Dandelion, a Bitcoin transaction is broadcast to the network in two phases: the \"stem\" phase (where it is obfuscated) and the \"fluff\" phrase where it is broadcast.<\/span>","<span data-v-f87c67ca=\"\">First the transaction is broadcast to a single node, which is then relayed to another single peer, until there are enough \"hops\" from the original peer — at which point, the transaction is broadcast to the rest of the gossip network. A visualization of this can be seen below, where a transaction (in Phase 1) is broadcast to a single peer before spreading to the remainder of the network (Phase 2).<\/span>","<span data-v-f87c67ca=\"\">Image courtesy of Giulia Fanti’s presentation \"Presenting Dandelion\" in Lisbon.<\/span>","<span data-v-f87c67ca=\"\">The combination of improvements like confidential transactions, CoinJoin, and Dandelion allow MimbleWimble implementations to do away with traditional ideas like addresses: the commitments made by people generating a transaction serves the purpose of the public\/private key used in Bitcoin to conduct a transaction. This allows MimbleWimble to offer material privacy improvements over Bitcoin by offering a fully private cryptocurrency.<\/span>","<span data-v-f87c67ca=\"\">While both Grin and BEAM implement the MimbleWimble protocol from scratch, both come with slight differences:<\/span>","<span data-v-f87c67ca=\"\">The mining landscape for both Grin and BEAM remain unclear as both networks are so new (with Grin pre-launch).<\/span>","<span data-v-f87c67ca=\"\">The BEAM team opted for modified <\/span><a href=\"https:\/\/github.com\/BeamMW\/beam\/wiki\/Beam-Equihash-specification\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Equihash PoW<\/span><\/a><span data-v-f87c67ca=\"\"> (Equihash 150,5 with additional datapath change intended to deter ASICs). This, in addition to a planned six-month hard fork, is intended to deter ASICs from the network.<\/span>","<span data-v-f87c67ca=\"\">Grin uses the novel <\/span><a href=\"https:\/\/github.com\/tromp\/cuckoo\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Cuckoo Cycle<\/span><\/a><span data-v-f87c67ca=\"\"> (to start with), an alternative proof of work system developed by<\/span><a href=\"https:\/\/tromp.github.io\/\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">John Tromp<\/span><\/a><span data-v-f87c67ca=\"\"> in 2015. While the algorithm is intended to be ASIC resistant, the team <\/span><a href=\"https:\/\/www.grin-forum.org\/t\/proof-of-work-update\/713\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">has long believed<\/span><\/a><span data-v-f87c67ca=\"\"> ASICs are a potentially inevitability. The solution <\/span><a href=\"https:\/\/www.grin-forum.org\/t\/meeting-notes-governance-sep-25-2018\/874\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">emerged in September 2018<\/span><\/a><span data-v-f87c67ca=\"\">: using two algorithms, one optimized to be ASIC-friendly (Cuckatoo31+) and another to allow GPUs to compete (Cuckaroo29), where the PoW balances mining rewards between the two every 24-hour period.<\/span>","<span data-v-f87c67ca=\"\">The GPU of choice among early miners of both Grin and Beam appears to be the <\/span><a href=\"https:\/\/www.nvidia.com\/en-us\/geforce\/products\/10series\/geforce-gtx-1080-ti\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Nvidia GTX 1080 TI<\/span><\/a><span data-v-f87c67ca=\"\"> (which is general purpose hardware also used to mine many other blockchains).<\/span>","<span data-v-f87c67ca=\"\">Early BEAM <\/span><a href=\"https:\/\/miningpoolstats.stream\/beam\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">launch stats<\/span><\/a><span data-v-f87c67ca=\"\"> seem to indicate the dominance of two major pools:<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span><a href=\"http:\/\/sparkpool.com\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">sparkpool.com<\/span><\/a><span data-v-f87c67ca=\"\"> (a multi-asset mining pool with ~69% of the hash rate) and <\/span><a href=\"http:\/\/bepool.org\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">bepool.org<\/span><\/a><span data-v-f87c67ca=\"\"> (with ~30% of the hash rate) for a total of<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span><a href=\"https:\/\/explorer.beam.mw\/blocks\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">~1.5m solutions\/sec<\/span><\/a><span data-v-f87c67ca=\"\">. The specific number of solutions\/sec possible from hardware depends on the miner used (and its optimizations), but with the OpenCL miner clocking ~10 sols\/sec and a CUDA-based miner clocking ~15-20 sols, it's likely 100,000+ GPUs are currently securing the network.<\/span>","<span data-v-f87c67ca=\"\">The Grin mining market is more institutionalized, with over a dozen private mining operations pitching a wide variety of crypto funds, family offices, and HNW. Individual miners have the choice of joining pools as they launch. The <\/span><a href=\"https:\/\/www.grinmint.com\/pages\/index.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">grinmint<\/span><\/a><span data-v-f87c67ca=\"\"> pool (launched by BlockCypher) and <\/span><a href=\"http:\/\/mwgrinpool.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">MWGrinPool.com<\/span><\/a><span data-v-f87c67ca=\"\"> are two options the community has presented.<\/span>","<span data-v-f87c67ca=\"\">There are still difficulties in mining so early on: miners for other GPUs (e.g., AMD chipsets) is less accessible, pool software isn't robust or reliable, multi-signature wallet infrastructure doesn't yet exist, and optimizations aren't broadly known to the market. This offers a material information asymmetry to early miners who can leverage technical sophistication. Some companies are aiming to build this infrastructure like <\/span><a href=\"https:\/\/713.mw\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">713<\/span><\/a><span data-v-f87c67ca=\"\">'s grinbox.<\/span>","<span data-v-f87c67ca=\"\">In a world with social credit systems and artificial intelligence techniques that are getting increasingly knowledgeable about what you’re transacting, who you’re transacting with, and even <\/span><a href=\"https:\/\/www.forbes.com\/sites\/kashmirhill\/2012\/02\/16\/how-target-figured-out-a-teen-girl-was-pregnant-before-her-father-did\/#5eae6d346668\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">what’s going to happen in the future<\/span><\/a><span data-v-f87c67ca=\"\">, it’s clear that privacy is important when designing future money systems.<\/span>","<span data-v-f87c67ca=\"\">Where even using a privacy method (e.g. a Bitcoin mixer) might otherwise “taint” a user in the eyes of law enforcement, fully private currencies allow users to have plausible deniability over their intentions. While they may have nothing to hide, this is an important distinction.<\/span>","<span data-v-f87c67ca=\"\">Grin and BEAM brought two different approaches to the market. Despite surface-level similarities, they differ on virtually every level apart from being MimbleWimble-based. It will take several months, if not longer, for a \"winner\" to emerge. Though it's unclear which currency will \"win,\" the two launches offer a test of a number of things enthusiasts have always considered supremely important:<\/span>","<span data-v-f87c67ca=\"\">It will be an exciting year ahead for privacy.<\/span>","<em data-v-f87c67ca=\"\">Disclosure: Arjun Balaji is an analyst, engineer, and technical advisor to The Block. He founded Shomei Capital and does not have a position in BEAM or Grin (not mining).<\/em>","<em data-v-f87c67ca=\"\">Image credit: <\/em><a href=\"https:\/\/www.shutterstock.com\/g\/Woramet+Muangsiri\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Shutterstock\/Woramet Muangsiri<\/em><\/a>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Arjun Balaji","content":"PERSON"},{"type":"November 2017","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"Peverell","content":"ORGANIZATION"},{"type":"AMD","content":"ORGANIZATION"},{"type":"Monero","content":"PERSON"},{"type":"March 2018","content":"DATE"},{"type":"March 2017","content":"DATE"},{"type":"Bitcoin Core","content":"ORGANIZATION"},{"type":"July 2016","content":"DATE"},{"type":"September 2018","content":"DATE"},{"type":"the University of Illinois","content":"ORGANIZATION"},{"type":"Alexander Zaidelson","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Blockstream","content":"LOCATION"},{"type":"Urbana","content":"LOCATION"},{"type":"sec","content":"ORGANIZATION"},{"type":"BEAM","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Tom Elvis Jedusor","content":"PERSON"},{"type":"January 2019","content":"DATE"},{"type":"MimbleWimble","content":"ORGANIZATION"},{"type":"Pederson","content":"PERSON"},{"type":"Luna Lovegood","content":"PERSON"},{"type":"IRC","content":"ORGANIZATION"},{"type":"2015","content":"DATE"},{"type":"2016","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"Carter","content":"PERSON"},{"type":"2013","content":"DATE"},{"type":"Harry Potter","content":"PERSON"},{"type":"Harry","content":"LOCATION"},{"type":"2018","content":"DATE"},{"type":"20","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Alice","content":"PERSON"},{"type":"Seamus Finnigan","content":"PERSON"},{"type":"John Tromp","content":"PERSON"},{"type":"Bitcoin mixer","content":"ORGANIZATION"},{"type":"Andrew Poelstra","content":"PERSON"},{"type":"Nvidia GTX","content":"ORGANIZATION"},{"type":"69%","content":"PERCENT"},{"type":"Confidential Transactions","content":"ORGANIZATION"},{"type":"Wikipedia","content":"LOCATION"},{"type":"Shutterstock\/Woramet Muangsiri","content":"ORGANIZATION"},{"type":"Percy Weasley","content":"PERSON"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"Lisbon","content":"LOCATION"},{"type":"CoinJoin","content":"ORGANIZATION"},{"type":"Pieter Wuille","content":"PERSON"},{"type":"Zcash","content":"LOCATION"},{"type":"HNW","content":"ORGANIZATION"},{"type":"October 2016","content":"DATE"},{"type":"CUDA","content":"ORGANIZATION"},{"type":"Ignotus Peverell","content":"PERSON"},{"type":"Benedict Koehler","content":"PERSON"},{"type":"GPU","content":"ORGANIZATION"},{"type":"Champaign","content":"LOCATION"},{"type":"Dandelion","content":"PERSON"},{"type":"Giulia Fanti","content":"ORGANIZATION"},{"type":"Dandelion","content":"LOCATION"},{"type":"Shomei Capital","content":"ORGANIZATION"},{"type":"Blockstream CTO","content":"ORGANIZATION"},{"type":"Poelsta","content":"ORGANIZATION"},{"type":"Bob","content":"PERSON"},{"type":"Gregory Maxwell","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":[],"authors":["Arjun Balaji","The Block"]}