{"summary":"The Securities and Exchange Commission is considering a rule proposal that would require more from investment advisers maintaining crypto.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/211786\/sec-to-vote-on-rule-that-would-tighten-crypto-custody-requirements","publishDate":"2023-02-15T10:00:28","id":513,"type":null,"title":"SEC votes to advance rule tightening crypto custody requirements","category":["POLICY"],"content":["The Securities and Exchange Commission voted 4-1 to propose a rule requiring registered investment advisers to keep cryptocurrencies with a qualified custodian, and those custodians would have to abide by certain requirements. &nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">The proposed rule would expand the current custody rule to include any client assets that an adviser has custody over and would also add more protections to those assets such as surprise examinations.<span class=\"ContentPasted0\" data-v-f87c67ca=\"\">&nbsp;<\/span> The five-member commission voted on the proposed rulemaking on Wednesday morning. <\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Registered investment advisers are subject to a custody rule, which requires them to maintain those assets with a qualified custodian, such as a bank or broker-dealer. In prepared remarks provided to press, SEC Chair Gary Gensler said that rule has not been updated since 2009. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“Further, today’s proposal, in covering all asset classes, would cover all crypto assets — including those that currently are covered as funds and securities and those that are not funds or securities,\" Gensler said.&nbsp;&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The proposed rule also would require advisers to segregate their investors’ assets. The current rule requires advisers and qualified custodians to segregate funds and securities, and the new rule would expand that to all assets, Gensler said. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Gensler also warned that depending on how crypto platforms operate, investment advisers cannot rely on them as qualified custodians. An SEC official said some investment advisers do rely on crypto platforms as custodians. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The rule would also require advisers to enter into a written agreement with qualified custodians to make sure clients get certain protections.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“These protections are designed, among other things, to ensure client assets are properly segregated and held in accounts designed to protect the assets in the event of a qualified custodian bankruptcy or other insolvency,” the agency said in a fact sheet. &nbsp;<\/span><span class=\"s1\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Republican Commissioner Hester Peirce was the lone vote against the proposed rulemaking, citing concerns that the requirements would end up “shrinking the ranks of qualified custodians.”&nbsp;","“By insisting on an asset neutral approach to custody we could leave investors in crypto assets&nbsp;<i class=\"ContentPasted0\" data-v-f87c67ca=\"\">more<\/i>&nbsp;vulnerable to theft or fraud, not less,” Peirce said. &nbsp;","During the meeting, Peirce asked SEC staff whether there would be any “qualified custodians in the crypto space,” if the rule were to go into place today. The SEC staff said yes and said the proposal is aimed at being technology neutral. &nbsp;","Democratic Commissioner Caroline Crenshaw supported the rule proposal. &nbsp;","<span class=\"ContentPasted0\" data-v-f87c67ca=\"\">“While the Custody Rule today in fact covers many crypto asset securities, I share the concerns in the release that many of those assets are not in practice properly custodied or safeguarded, and events across the crypto markets have shown the spectacular harm and loss that can befall investors when client assets are not adequately safeguarded,” Crenshaw said.&nbsp;&nbsp;<\/span>","During a media briefing, SEC’s Gensler said crypto exchanges were not following current custodial rules for assets. &nbsp;","Coinbase Chief Legal Officer Paul Grewal said the exchange looked forward to engaging with the SEC.&nbsp;","<span class=\"ContentPasted0\" data-v-f87c67ca=\"\">“Coinbase Custody Trust Co. is a Qualified Custodian today and will be a Qualified Custodian&nbsp;<\/span><span class=\"ContentPasted0\" data-v-f87c67ca=\"\">tomorrow,” Grewal said. “Today's proposal from does not change this fact.”&nbsp;<\/span>","A custody rule in general is a good thing in the name of making sure regulated entities safeguard client assets, said Jason Gottlieb, partner and chair of Morrison Cohen's White Collar and Regulatory Enforcement group.&nbsp;","“The trouble is that we don’t yet know whether this is going to be a followable rule,” Gottlieb said. &nbsp;","If the SEC is saying that the rule will require a registered investment adviser that invests in crypto to have a qualified custodian while also detailing how that custodian can hold crypto — that is fine, Gottlieb said. &nbsp;","“My fear is that they will require qualified custodians to hold crypto, but then they will not create a real path for qualified custodians to hold crypto and as a result people won’t be able to find a qualified custodian and as a result they won't’ be able to satisfy the custody rule,” Gottlieb said. &nbsp;","<em data-v-f87c67ca=\"\"><span class=\"ContentPasted0\" data-v-f87c67ca=\"\">With additional reporting from Colin Wilhelm&nbsp;<\/span><\/em>","<em data-v-f87c67ca=\"\">Updated throughout with the SEC's vote, Hester Peirce's dissent and industry comment. Headline updated.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Hester Peirce","content":"PERSON"},{"type":"Crenshaw","content":"PERSON"},{"type":"Coinbase Custody Trust Co.","content":"ORGANIZATION"},{"type":"Today","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"today","content":"DATE"},{"type":"Gottlieb","content":"PERSON"},{"type":"Custody Rule","content":"ORGANIZATION"},{"type":"Colin Wilhelm","content":"PERSON"},{"type":"Jason Gottlieb","content":"PERSON"},{"type":"Grewal","content":"PERSON"},{"type":"2009","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Peirce","content":"PERSON"},{"type":"morning","content":"TIME"},{"type":"Wednesday","content":"DATE"},{"type":"Caroline Crenshaw","content":"PERSON"},{"type":"Morrison Cohen's White Collar and Regulatory Enforcement","content":"ORGANIZATION"},{"type":"Paul Grewal","content":"PERSON"}],"hashtag":["SEC"],"authors":["Sarah Wynn","The Block"]}