{"summary":"Io.net, a Solana-based DePIN project focused on sourcing GPU computing power, has unveiled a rewards program ahead of its token launch.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279643\/solana-based-depin-protocol-io-net-unveils-rewards-program-ahead-of-april-token-launch","publishDate":"2024-02-28T13:06:10","id":5130,"type":null,"title":"Solana-based DePIN protocol io.net unveils rewards program ahead of token launch in April","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Io.net, a <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Solana <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/33827\/solana-sol-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/solana.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">SOL<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.30%\n    <\/span><\/a> <!----><\/span><\/span>-based decentralized physical infrastructure network (DePIN) project focused on sourcing GPU computing power, has unveiled a rewards program in anticipation of its token launch.<\/span>","Dubbed Ignition, the program starts its first phase on Mar. 1 and will run until Apr. 28, Io.net said Wednesday. The program will reward points to users based on their supply of GPUs to the network.","\"A number of factors are considered in the rewards algorithm, including job hours completed, the node's bandwidth, GPU model, and uptime,\" Io.net said. The program will also consider GPU supplier activity dating back to the launch of io.net in Nov. 2023, io.net added.","Io.net is a Solana-based <a href=\"https:\/\/www.theblock.co\/post\/272456\/decentralized-infrastructure-11-5-million-series-a-coinfund\" data-v-f87c67ca=\"\">DePIN<\/a> project that aggregates GPU resources for artificial intelligence (AI) and machine learning (ML) companies. The project originated in 2020 when Shadid was building Dark Tick, an ML quant trading business, he said. Dark Tick required an \"immense\" amount of computing capacity to run models for every stock and cryptocurrency being traded.","To reduce costs, Shadid said, he designed a distributed network of GPUs worldwide. After OpenAI launched ChatGPT, he realized that the network was suited for serving AI\/ML companies, which also required massive computing capacity at low latency. Subsequently, Io.net became one of the winners of the Solana Hackathon in April 2023 and launched the network in November.","Io.net said that its network currently provides access to hundreds of thousands of GPUs at lower costs and fast lead times. Since its launch three months ago, according to Shadid, io.net has grown to over 25,000 nodes, served more than 47,000 compute hours, and paid more than $300,000 from customers to network suppliers.","\"The demand for GPU compute capacity for AI applications is more than 2.5 times the capacity that exists in cloud services like AWS and Azure today, increasing costs and lead times for everyone,\" said Shadid. \"The reality is that AI will only become further entrenched in our everyday lives. From OpenAI's Sora to Microsoft's Copilot to the thousands of AI startups that are being built, the demand for capacity is growing at an alarming rate.\"","Io.net said it aims to build an \"Internet of GPUs\" and solve the GPU compute capacity shortage that the AI boom has created.","Io.net uses the <a href=\"https:\/\/www.theblock.co\/post\/252775\/solana-depin-projects-gig-economy-next-level\" data-v-f87c67ca=\"\">Solana<\/a> blockchain to provide transparent proof-of-compute and make every job and transaction between supplier and consumer visible on-chain. The IO token, in turn, provides a unified transaction experience for users and enables incentive mechanisms for suppliers, customers, and users to participate and grow the network, the project said.","The upcoming launch of the Ignition rewards program is the first step to decentralizing io.net and transitioning governance to the community, io.net said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Solana <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/33827\/solana-sol-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/solana.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">SOL","content":"ORGANIZATION"},{"type":"April 2023","content":"DATE"},{"type":"Apr. 28","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"-1.30%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Nov. 2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Solana Hackathon","content":"PERSON"},{"type":"GPU","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"$300,000","content":"MONEY"},{"type":"Mar. 1","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"Shadid","content":"PERSON"},{"type":"AWS","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"}],"hashtag":["DECENTRALIZED INFRASTRUCTURE","SOLANA"],"authors":["Yogita Khatri","The Block"]}