{"summary":"Considered a key element missing from networks utilizing its software, OP Labs said its &quot;fault proof&quot; system is now live as an alpha.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/254154\/op-labs-fault-proof-system-goes-live-as-an-alpha-on-testnet","publishDate":"2023-10-03T12:52:46","id":5134,"type":null,"title":"OP Labs&#x27; &#x27;fault proof&#x27; system goes live as an alpha on testnet","category":["CRYPTO ECOSYSTEMS"],"content":["Considered a key element missing from networks utilizing its software, OP Labs has announced that its \"fault proof\" system is now live in alpha form on the OP Goerli Testnet.","\"This system leverages the power of the OP Stack’s modular design to lay the foundation to build out a multi-proof dispute system that can include ZK proofs,\" <a href=\"https:\/\/twitter.com\/OPLabsPBC\/status\/1709236296604930487\" data-v-f87c67ca=\"\">OP Labs said on X<\/a>.","A <a href=\"https:\/\/www.theblock.co\/post\/248677\/op-labs-hires-former-google-exec-as-chief-operating-officer\" data-v-f87c67ca=\"\">core developer<\/a> of the Optimism Collective, which governs the Layer 2 network&nbsp;Optimism, OP Labs is a research and development firm that aims to improve the scalability of Ethereum applications through the use of optimistic rollups.&nbsp;","\"This fault proof system alpha is a major step towards a more decentralized and efficient Superchain,\" the Optimism foundation <a href=\"https:\/\/twitter.com\/optimismFND\/status\/1709236759031116231\" data-v-f87c67ca=\"\">said on X<\/a>. \"Contributors across the ecosystem will benefit from our Collective effort to test and improve it.\"","U.S.-based cryptocurrency exchange Coinbase <a href=\"https:\/\/www.theblock.co\/post\/247268\/coinbase-base-optimism\" data-v-f87c67ca=\"\">has said<\/a> it will work with Optimism and OP Labs in order to transition Base, its own Layer 2, towards full decentralization.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"cryptocurrency exchange Coinbase","content":"ORGANIZATION"},{"type":"OP Goerli Testnet","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"OP Labs","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}