{"summary":"London-based Argent, a cryptocurrency wallet developer that integrates several decentralized finance (DeFi) apps such as Maker and Compound, has raised $12 million in Series A funding. The round was led by Paradigm, with participation from Index Ventures, Compound founder Robert Leshner and other investors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/58095\/defi-friendly-crypto-wallet-argent-raises-12m-in-series-a-funding","publishDate":"2020-03-09T06:00:21","id":5139,"type":null,"title":"Paradigm leads $12M round for DeFi-friendly Argent wallet","category":["DEFI"],"content":["London-based Argent, a cryptocurrency wallet developer that integrates several decentralized finance (DeFi) apps such as Maker and Compound, has raised $12 million in Series A funding.","The round was led by Paradigm, with participation from Index Ventures, Compound founder Robert Leshner and other investors, according to a statement shared with The Block on Monday. Notably, this is Paradigm's first investment in Europe. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"Argent has systematically solved some of the biggest usability and security issues in crypto. Their team has a unique combination of cryptographic expertise and experience scaling mobile apps to tens of millions of users. We're thrilled to partner with them as they help make crypto mainstream in the years ahead,\" said Paradigm managing partner Matt Huang.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nArgent said it will use the funding to continue to hire technical talent. Today's round brings the firm's total funding to date to $16 million since founding in December 2017.","Last July, Argent integrated with <a href=\"https:\/\/www.theblockcrypto.com\/daily\/34007\/argent-leverages-smart-contracts-to-offer-decentralized-bank-accounts\" data-v-f87c67ca=\"\">MakerDAO, <\/a>and since then it has accelerated the pace at which it has onboarded new users onto the platform. At this point, 3,000 clients are actively using Argent ahead of its expected April exit from beta-mode, according to CEO Itamar Lesuisse. The profile of clients has also been more diverse than originally expected, he said.&nbsp;","\"It's not just people putting their money in there for small savings,\" Lesuisse said, noting a wide-range of wallets including some with as more as $200,000. In total, the firm reports a 330% increase in active wallets.&nbsp;","In a sense, the firm is aiming to be a DeFi gateway, serving as a conduit to different Ethereum-based protocols. Users of the app are able to earn a yield from a savings account-like feature that is integrated with Maker and Compound.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"Argent is building the simplest, safest, and most practical gateway to crypto &amp; open financial products,\" said Compound's Leshner.&nbsp;","Looking ahead, Argent plans to also beef up its security measures, which will include new types of \"Guardians.\" A Guardian is an account on the Ethereum blockchain that users permit to help recover their wallets. It also plans to roll-out features that will aim to make it easier for users to get involved with protocol governance.&nbsp;","\"It should be extremely easy,\" Lesuisse said. \"We want every token holder to participate.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">UPDATE<\/strong> - 9.00 am EST: This story has been updated with more information.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Compound","content":"ORGANIZATION"},{"type":"$12 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"December 2017","content":"DATE"},{"type":"Lesuisse","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"Maker and Compound","content":"ORGANIZATION"},{"type":"Matt Huang","content":"PERSON"},{"type":"Europe","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"Paradigm","content":"LOCATION"},{"type":"330%","content":"PERCENT"},{"type":"$200,000","content":"MONEY"},{"type":"Itamar Lesuisse","content":"PERSON"},{"type":"London","content":"LOCATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Argent","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Robert Leshner","content":"PERSON"},{"type":"$16 million","content":"MONEY"}],"hashtag":["PARADIGM","SERIES A"],"authors":["Yogita Khatri","The Block"]}