{"summary":"Luxury brand Gucci will begin accepting crypto payments in select stores across the US later this month.\nThis is just one of many recent moves into crypto by the brand, which has a dedicated digital experiences team. ","author":["Anushree Dave","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/145188\/select-gucci-stores-to-accept-bitcoin-dogecoin-and-more-as-part-of-ongoing-experiments-in-web3","publishDate":"2022-05-04T18:19:06","id":514,"type":null,"title":"Select Gucci stores to accept bitcoin, dogecoin and more as part of ongoing experiments in web3","category":["Startups"],"content":["Luxury fashion house Gucci is going to start accepting cryptocurrency payments in limited stores as the brand continues its ongoing experiments in crypto.","The pilot will launch at a few US stores at the end of this month, with eventual plans to expand into all its North American stores this summer, according to <a href=\"https:\/\/www.voguebusiness.com\/technology\/gucci-takes-the-leap-will-accept-crypto-in-us-stores\" data-v-f87c67ca=\"\">Vogue Business<\/a>, which first reported the news.","Accepted cryptocurrencies will include Bitcoin, Bitcoin Cash, Ethereum, Wrapped Bitcoin, Litecoin, Dogecoin, Shiba Inu, and five stablecoin pegged to the US dollar. Gucci's crypto payments will happen through a QR code sent to a customer by email, which will allow customers to attach their wallets and pay.","Gucci has already taken significant steps in moving into the crypto and blockchain gaming space. The company has a specific team dedicated to Web3-focused initiatives and had 19 million visitors on Gucci Garden, its Roblox game. The company has also created “skins” which change the appearance of an avatar on games like Animal Crossing and Pokemon Go.","“There are more and more ‘second worlds’ where you can express yourself [but] there is probably an underestimation of the value being attached to individuals who want to express themselves in a virtual world with a virtual product, [through] a virtual persona,” said Gucci’s chief marketing officer Robert Triefus, in an interview with McKinsey, that The Block <a href=\"https:\/\/www.theblockcrypto.com\/post\/142276\/louis-vuitton-releases-new-nfts-as-fashion-brands-continue-experiments-in-gaming\" data-v-f87c67ca=\"\">reported last month<\/a>.","The brand has also purchased digital real estate on The Sandbox, a virtual real-estate platform backed by a blockchain. Last summer, Gucci drew attention online when a virtual purse on Roblox’s marketplace sold for over $4,000, exceeding the price of its real-world equivalent.","The move comes as a number of luxury retailers and brands are integrating crypto payments. Earlier this week, luxury fitness and health club Equinox announced accepting cryptocurrency in clubs in New York City, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/144785\/luxury-fitness-club-equinox-starts-accepting-crypto-payments-in-new-york-city\" data-v-f87c67ca=\"\">The Block reported<\/a>. A few months ago, fashion brand Off-White began accepting crypto payments in Paris, London, and Milan.&nbsp;","“We know that people are willing to pay good money for NFTs, for digital collectibles, and to have a second life in the metaverse,” said Triefus in the McKinsey interview. “So the revenue potential is absolutely there. One has to understand how to curate the experience as in the physical world, and make sure that experience Is delivering what the customer would expect from the respective brand.”"],"hashtag":[]}