{"summary":"Bitcoin&#x27;s third block reward halving is coming next month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/61762\/the-bitcoin-halving-what-it-is-and-why-it-matters","publishDate":"2020-04-14T11:01:36","id":5140,"type":null,"title":"The bitcoin halving: what it is and why it matters","category":["BITCOIN"],"content":["Whether you're a member of the crypto faithful or just a passer-by who happened to notice a bitcoin headline, you've likely come across the halving.","The roughly quadrennial event is arguably an important one in the progression of the bitcoin network. For all the adjustments and changes to bitcoin's code since its launch – and the evolution of the ecosystem and industry around it – the issuance cycle and bitcoin's predetermined supply have never been altered.","The halving is, perhaps, emblematic of both bitcoin's philosophical basis as well as its technical progression. It's also a heck of a lot of fun, with past halvings <a href=\"https:\/\/www.coindesk.com\/coindesk-guide-bitcoin-halving-parties-care\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">inspiring celebrations and watch-parties<\/a> for those counting down each block until the halving officially kicks in.","So, let's get into it.","First, some basics. Each bitcoin block brings three things with it: transactions, newly-created bitcoins and fees.","For example, <a href=\"https:\/\/www.blockchain.com\/btc\/block\/00000000000000000005fdc403473f797781bed3e75750f77d4aaef83ec8d28c\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">block number 625875<\/a> included 1,478 transactions worth 4899.23684782 BTC. The block was created by BTC.com. In exchange for making that block, BTC.com earned 12.5 BTC and 0.08439752 BTC in fees.","When bitcoin first launched, each block had a subsidy of 50 BTC. In 2012, that amount fell to 25 BTC per block, and in 2016 it was further reduced to 12.5 BTC per block. With upcoming halving – currently estimated to take place in or around May 12, when the network hits its 630,000th block – that amount will drop to 6.25 BTC per block.","To date, roughly 18.3 million bitcoins have been minted out of a total of 21 million that will ever be created.","Miners create the blocks of transactions that make sending BTC throughout the distributed bitcoin network possible. They append new blocks to the ever-growing chain – that's the blockchain – and are rewarded with new bitcoins for doing so.","To create block 625875, BTC.com ran its miners and sought to be the first to create the next block. Mining is resource-intensive by design, and while some have described the process as an effort to solve a complex mathematical problem, a more apt description might be that miners rapidly try forming different numbers until they land on the right one.","Mining is a key element of Bitcoin's security. As more blocks are added, it becomes more difficult to rewind the transactional clock and undo transactions from earlier blocks.","The generation of new BTC is how miners make money; their profits come from the sale price minus the cost of electricity, labor and everything else it takes to keep their legions of mining machines humming. The block reward is also the bedrock incentive for miners to keep the block production process – and, as a result, the transaction history – honest. By getting paid in bitcoin, they have an interest in seeing its price stay steady. A transaction history prone to manipulation or tampering would have no value.","The cycle of block reward or subsidy halvings is baked into bitcoin's code. The reward reduction underpins bitcoin's <a href=\"https:\/\/en.bitcoin.it\/wiki\/Controlled_supply\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">controlled supply<\/a>, serving as a kind of digital parallel to finite natural resources.","Yes. As The Block highlighted on Monday, miners currently&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/linked\/61657\/bitcoin-miner-revenue-after-halving\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">make an estimated $13.4 million<\/a> per day in new bitcoin and fees. Once the halving kicks in, that'll drop to about $6.7 million total in the even that prices remain steady.","Of course, that number may very well fluctuate depending on the market reaction in the hours, days, weeks and months ahead. For a deeper look, check out The Block's Larry Cermak <a href=\"https:\/\/www.theblockresearch.com\/a-brief-look-at-bitcoins-third-halving-61632\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">by-the-charts column<\/a> on the halving published on Monday.","Much digital ink has been spilled in recent months on the question of whether bitcoin's price will rise as a result of the halving.","There are varying theories as to why: the halving will bring new market entrants, the tightening of issuance will spur more buying, or history will basically repeat itself. For example, bitcoin's price rose above $1,000 a year after its 2012 halving. The July 2016 halving saw bitcoin's price around $660 – a year later, the price had soared above $2,000.","<em data-v-f87c67ca=\"\">Source: CoinMetrics, The Block Research<\/em>","But those were, arguably, different times, and next month's halving is the first to occur after the parabolic craziness of early 2018.","A price increase isn't a foregone conclusion – though, to be sure, neither is a drop or a continuation of the status quo.","Nobody knows. And this isn't investment advice, so quit asking me.","Here at The Block, the editorial team – journalists and researchers – have <a href=\"https:\/\/www.theblockcrypto.com\/tag\/halving\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">covered<\/a> the economic implications for the industry sectors likely to be impacted by the halving.","One can expect that major portions of the bitcoin-facing industry could be impacted in one way or another.&nbsp;","As noted above, miners will see the primary element of their income – new bitcoins – be cut in half. That's bad news for miners who are operating older, less efficient hardware or borrowed significant sums of money to get new equipment – especially those <a href=\"https:\/\/www.theblockcrypto.com\/daily\/59615\/some-bitcoin-miners-have-suffered-amid-the-recent-market-turmoil-but-heres-why-it-may-be-a-boon-in-the-long-term\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">hit by the recent turbulence<\/a> in crypto markets. Bitcoin's hash rate – a measure of the network's computational power – could slip as some operations find themselves unable to make a profit and thus are forced to power down.","<a href=\"https:\/\/www.theblockcrypto.com\/post\/61133\/what-crypto-exchanges-are-saying-about-the-upcoming-bitcoin-block-reward-halving\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Exchanges<\/a> will be affected because they'll be front-and-center for any market response. It could prove to be a boon for exchanges as they'll arguably be in the best position to benefit from any positive market moves.","The best vantage point would a block explorer, where live updates for new transaction blocks can be found.","Given that the vast majority of countries are currently in the midst of social distancing because of the coronavirus pandemic, it's unlikely that in-person parties will be held.","But with everyone stuck at home, it's virtually certain that those with a stake or interest in crypto will be online – from Twitter to Telegram to IRC – waiting for the third-ever bitcoin reward halving to take place.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2016","content":"DATE"},{"type":"2012","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$6.7 million","content":"MONEY"},{"type":"$1,000","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"$13.4 million","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"Larry Cermak","content":"PERSON"},{"type":"$2,000","content":"MONEY"},{"type":"$660","content":"MONEY"},{"type":"July 2016","content":"DATE"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"May 12","content":"DATE"},{"type":"IRC","content":"ORGANIZATION"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}