{"summary":"Starkware launched a new form of scaling technology on August 11 for its starkEx and Starknet scaling solutions. Recursive proving improves the speed and transaction fees allowing Starkware to vastly increase its scalability.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/163601\/starkware-launches-recursive-proofs-in-bid-to-boost-layer-2-scaling","publishDate":"2022-08-15T15:20:15","id":5146,"type":null,"title":"Starkware launches recursive proofs in bid to boost Layer 2 scaling","category":["LAYER 2S AND SCALING"],"content":["Starkware turned on recursive proofs, a layer two scaling method that could drive down gas fees and improve speed.","Recursive proving is the fourth major milestone for Starkware’s scaling technology.","Starkware launched a new form of scaling technology on August 11 for its starkEx and Starknet scaling solutions.","The technology is called recursive proving, which aims to improve the speed and transaction fees by allowing Starkware to increase its overall scalability.","Recursive proofs are a relatively new concept in the race to scale blockchains via rollups. Rollups execute transactions separate from the Ethereum network but still post transaction data to the network. Data availability is one of the largest scalability bottlenecks, and rollups aim to solve this problem to scale the network while still deriving security from Ethereum.","As Starkware’s CEO Uri Kolodny put it: “Recursive proving is an enthralling concept as it defies what we intuitively think to be the limits of scaling.”","Starkware’s previous proving system was able to roll up thousands of transactions into a single proof. With recursive proofs, now it will be able to take hundreds of these single proofs, each of which attests to thousands of transactions, and roll them into another single proof.","“It’s like finding a way to comfortably fit thousands of passengers in a jet instead of a few hundred. Turning on recursive proofs means that we massively boosted the extent to which we can scale,” said Starkware’s head of core engineering Gideon Kaempfer.","This is the fourth major milestone for Starkware scaling. The previous three were STARK scaling, Cairo (general computation without needing to understand the complex math behind STARKs), and SHARP (shared proofs between applications).","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gideon Kaempfer","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"August 11","content":"DATE"},{"type":"Uri Kolodny","content":"PERSON"},{"type":"Cairo","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ETHEREUM","ROLLUPS"],"authors":["Mike Truppa","The Block"]}