{"summary":"Investing in cryptocurrencies has rapidly gained wide adoption and media attention, with the development of the Metaverse, Non-Fungible Tokens (NFTs), DeFi 2.0 and Web 3.0.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/124985\/crypto-as-the-new-asset-class-under-a-regulated-environment","publishDate":"2021-11-22T09:00:19","id":5148,"type":null,"title":"Crypto as the New Asset Class under a Regulated Environment","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">Investing in cryptocurrencies has rapidly gained wide adoption and media attention, with the development of the Metaverse, Non-Fungible Tokens (NFTs), DeFi 2.0 and Web 3.0. As a result, the industry as a whole has enjoyed exponential growth over the past twelve months alone. To put this growth into context, there are now in excess of 77 million users<\/span><span data-v-f87c67ca=\"\">1<\/span><span data-v-f87c67ca=\"\"> globally and 6,000 coins\/tokens in 2021¹<\/span><span data-v-f87c67ca=\"\"> compared to 0.89 million global users<\/span><span data-v-f87c67ca=\"\">1<\/span><span data-v-f87c67ca=\"\"> and 66 coins\/tokens in 2013².<\/span>","<span data-v-f87c67ca=\"\">However tempting to newcomers investing in digital assets is, it’s essential the necessary research and due diligence is carried out, as with any form of investment carries risk. To assist new investors to navigate the myriad of considerations, requires a partner that’s familiar with the latest regulations, while also understanding crypto technology and the broader industry. Huobi Technology Holdings Limited (“<\/span><b data-v-f87c67ca=\"\">Huobi Tech<\/b><span data-v-f87c67ca=\"\">”, stock code: 1611.HK) is committed to becoming the leading one-stop compliant virtual asset service platform in Asia.<\/span>","<span data-v-f87c67ca=\"\">Research shows that the demand for crypto and blockchain technology will continue to grow over the next three years, with the market estimated to grow exponentially from $3 billion USD in 2020 to $39.7 billion USD in 2025³.<\/span><span data-v-f87c67ca=\"\"> Blockchain technology will also continue to provide value-add to businesses (primarily in the finance, private, healthcare and retail sectors) by an estimated $3.1 trillion USD by 2030<sup data-v-f87c67ca=\"\">4<\/sup><\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">We believe that factors such as regulation, security, price stability and risk management play an important role in shaping user adoption and these are catalysts within the industry that can usher digital assets into more mainstream acceptance and adoption.&nbsp;<\/span>","<strong data-v-f87c67ca=\"\">Value of Adding Crypto into Asset Allocation Mix<\/strong>","<span data-v-f87c67ca=\"\">Investing in cryptocurrencies can produce significant gains, but with that can come an element of risk. The<\/span> <span data-v-f87c67ca=\"\">cumulative impact of digital asset investment should complement a broader asset portfolio, which are key factors for retail and institutional investors. Cryptocurrencies such as Bitcoin has almost no correlation to other traditional asset classes, and therefore provides clear diversification benefits. RIA Digital Asset Council reports, one percent of Bitcoin exposure will not reduce the fixed return of the overall return on investment (ROI), but provide a higher risk-adjusted return. In other words, digital assets are rapidly becoming important mainstream investments.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Even though owning digital assets can help diversify an investor’s portfolio risk, issues related to taxation, auditing and other factors could put some off from entering the space. Nonetheless, regulated crypto funds can be an easier gateway under these circumstances.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">One of Huobi Tech’s wholly-owned subsidiaries, Huobi Asset Management (Hong Kong) Limited, has obtained approval to conduct Type 4 (Advising on Securities) and Type 9 (Asset Management) regulated activities from the Securities and Futures Commission of Hong Kong (SFC). It has created a variety of asset management products and services for professional investors, including a multi-asset fund, a BTC tracker fund, an ETH tracker fund, a crypto mining fund and the first multi-strategy virtual asset fund in Hong Kong.&nbsp;<\/span>","<strong data-v-f87c67ca=\"\">The Importance of Crypto Custody Service<\/strong>","<span data-v-f87c67ca=\"\">Assets such as cash, bonds or stocks are usually held by third-party custodian’s such as a bank. However, this is not the case for digital assets. Crypto such as Bitcoin and Ethereum are very different from traditional assets. In the sense, they are built on blockchains and managed through private keys. In the world of blockchain, crypto custodians offer custody services to protect clients’ assets on their behalf.<\/span>","<span data-v-f87c67ca=\"\">Recently, large investment banks are opening crypto desks, and private bank clients are looking to invest in digital assets. Crypto assets are becoming an alternative investment and even a new asset class to many investors. Long-term holders of these assets may include banks, family offices, asset managers, brokers or retail investors. These players focus on their core business and do not want to deal with operational complexity in securing their crypto assets. Often it takes time and money to establish good operational and technological environment to hold custody for such assets. That’s where third-party custodians come to play.<\/span>","<span data-v-f87c67ca=\"\">Compliance is an important aspect for investors. For those who invest on behalf of their clients, an independent third-party custodian is required to reassure their clients and regulators that their assets are protected by a neutral party. A compliant and licensed crypto custodian would be audited regularly by a governing body or CPA firm, and is subject to the rules and regulations, such as anti-money laundering to ensure financial transparency.<\/span>","<strong data-v-f87c67ca=\"\">Benefits for Investors to Use Regulated Exchange<\/strong>","<span data-v-f87c67ca=\"\">KYC\/AML is mandatory before a client can start trading. Crypto exchanges are required to apply the same stringent standards as licensed banks or financial institutions, so that all related policies and procedures are fully audited. The checks go both ways, while it could prolong a client’s onboarding process, the benefit is that every participant on the platform can be sure that whoever they are transacting with is legitimate. This process can also protect the platform from being implicated by suspicious client accounts or transactions.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">One of the primary concerns investors have is that their assets are protected on the platform. Similar to any other financial institutions, regulated exchanges are required to<\/span> <span data-v-f87c67ca=\"\">segregate clients’ and firms’ assets.<\/span> <span data-v-f87c67ca=\"\">Clients’ assets including digital assets are stored on separate accounts and wallets, under an associated entity, owned by the exchange. Should there be any financial issue with the platform itself, would not affect a clients’ assets.<\/span>","<span data-v-f87c67ca=\"\">Regulated exchanges have an obligation to maintain fair and orderly markets, similar to established stock exchanges. Trading activity is monitored closely by the financial industry’s standard market surveillance tools. Malicious trading patterns such as spoofing or layering will be also flagged. If this occurs, exchange operators can investigate and remove the accounts from operating.<\/span>","<span data-v-f87c67ca=\"\">Cryptocurrencies are still considered a new asset class, but with anything novel, can bring factors that may seem risky to investors. However, with tighter regulations being introduced by industry bodies, central exchanges that initiate these new regulations, will in turn provide investors with a safer environment to trade and invest, which will ultimately increase adoption rates in the months and years to come.&nbsp;<\/span>","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">¹Source: <\/span><a href=\"https:\/\/www.statista.com\/statistics\/647374\/worldwide-blockchain-wallet-users\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/www.statista.com\/statistics\/647374\/worldwide-blockchain-wallet-users\/<\/span><\/a><\/span><br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">²Source: <\/span><a href=\"https:\/\/www.statista.com\/statistics\/863917\/number-crypto-coins-tokens\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/www.statista.com\/statistics\/863917\/number-crypto-coins-tokens\/<\/span><\/a><span data-v-f87c67ca=\"\">&nbsp;&nbsp;<br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">³Source: <\/span><a href=\"https:\/\/financesonline.com\/blockchain-statistics\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/financesonline.com\/blockchain-statistics\/<\/span><\/a><\/span><br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><sup data-v-f87c67ca=\"\">4<\/sup>Source:&nbsp;<\/span><a href=\"https:\/\/media.consensys.net\/gartner-blockchain-will-deliver-3-1-trillion-dollars-in-value-by-2030-d32b79c4c560\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/media.consensys.net\/gartner-blockchain-will-deliver-3-1-trillion-dollars-in-value-by-2030-d32b79c4c560<\/span><\/a><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2025","content":"DATE"},{"type":"$3 billion","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"$3.1 trillion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"2030<sup data-v-f87c67ca=\"\">4","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$39.7 billion","content":"MONEY"},{"type":"1611","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"Securities and Futures Commission of Hong Kong (SFC","content":"ORGANIZATION"},{"type":"Huobi Technology Holdings Limited (“<\/span><b data-v-f87c67ca=\"\">Huobi Tech","content":"ORGANIZATION"},{"type":"one percent","content":"PERCENT"},{"type":"Huobi Tech","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"RIA Digital Asset Council","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Importance of Crypto Custody Service","content":"ORGANIZATION"},{"type":"Use Regulated Exchange","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}