{"summary":"This activity could potentially exert upward pressure on the price of bitcoin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285041\/bitcoin-options-open-interest-for-march-expiry-on-deribit-hits-record-levels","publishDate":"2024-03-27T10:27:17","id":515,"type":null,"title":"Bitcoin options open interest for March expiry on Deribit hits record levels","category":["MARKETS"],"content":["&nbsp;","Over $9.5 billion worth of bitcoin options open interest is set to expire this week on the Deribit cryptocurrency derivatives exchange. This makes Friday's end-of-month expiry one of the largest the leading crypto derivatives exchange has ever seen.&nbsp;","\"This Friday marks one of the biggest expiries in Deribit's history as $9.5 billion bitcoin options open interest out of $26.3 billion will expire, or 40%,\" Deribit analysts said in a note sent to The Block.","<span data-v-f87c67ca=\"\">The max pain level for Friday's end of month expiry on the Deribit derivatives exchange is $50,000. Image: Deribit.<\/span>","The data from Deribit corresponds with that from The Block's Data <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/options\/deribit-btc-option-open-interest-by-expiry\" data-v-f87c67ca=\"\">Dashboard<\/a>. According to The Block's data, open interest in U.S. dollar value for Friday's March end-of-month expiry for bitcoin options contracts on Deribit has increased to a peak of $8.61 billion. In contrast, the end-of-month expiries on Deribit for January and February were significantly lower, at $3.74 billion and $3.72 billion, respectively.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/options\/deribit-btc-option-open-interest-by-expiry\/embed\" title=\"Deribit BTC Option Open Interest by Expiry\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","According to Deribit, out of the $9.5 billion <a href=\"https:\/\/www.theblock.co\/post\/284637\/bitcoin-price-breaks-out-above-71000-causing-spike-in-short-liquidations\" data-v-f87c67ca=\"\">bitcoin<\/a> options open interest, at a current spot price level of around $70,000, $3.9 billion will expire in-the-money, with a \"max pain\" price of $50,000. This means that if these options were to be exercised before or on Friday, they would generate a profit, suggesting a significant portion of the options contracts are currently valuable based on the current price of bitcoin.","The Deribit analysts added that the present situation implies that a large number of options are profitable due to bitcoin's recent price rally, which can lead to derivatives traders seeking to hedge their positions or speculate on further price movements.","Deribit analysts suggested that with higher levels of in-the-money expiries, increased buying activity may occur as option holders exercise their contracts. This activity could potentially exert upward pressure on the price of bitcoin or increase volatility as traders adjust their positions.","\"These levels are higher than usual which can also be seen in the low max pain levels. The reason is of course the recent price rally. Higher levels of in-the-money expiries might lead to potential upward pressure or volatility in the underlying and a removal of the lower max pain magnet,\" Deribit analysts said.","According to Deribit Chief Commercial Officer Luuk Strijers, the overall cryptocurrency market is still quite bullish when derivatives data is factored in. \"This is especially when looking at the basis yield that can be achieved by buying spot and selling the longer-dated futures,\" he added.","Strijers added that there is currently $1.2 billion in bitcoin notional open interest in contracts of $100,000 and higher on Deribit. \"Demand is decent, ther 25 Delta Skew, put-call, is green for both bitcoin and ether for shorter dated options and decreases over time. This means implied volatility is higher for calls versus puts as of 12 April for bitcoin and as of 31 May for ether. This in turn means calls are more expensive, in bigger demand, than puts,\" the Deribit CCO said.","Strijers added that the ether put-call ratio has increased from 0.3 towards 0.5 plus since beginning of the year. \"This means overall one in three options outstanding was a put option and now it's one in two overall. When looking at individual expiries it 0.83 for March,&nbsp; 0.64 for April, 0.33 for June, and 0.31 for Sep. So, there is more short-dated bearish views and perception and more positive positioning for longer-dated expiries,\" he said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"$8.61 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"The Block's Data <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/options\/deribit-btc-option-open-interest-by-expiry\" data-v-f87c67ca=\"\">Dashboard","content":"ORGANIZATION"},{"type":"$50,000","content":"MONEY"},{"type":"$3.9 billion","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"},{"type":"Deribit","content":"LOCATION"},{"type":"Deribit CCO","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"April","content":"DATE"},{"type":"$26.3 billion","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"February","content":"DATE"},{"type":"$3.74 billion","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"$100,000","content":"MONEY"},{"type":"Friday's end of month expiry","content":"DATE"},{"type":"$70,000","content":"MONEY"},{"type":"March end","content":"DATE"},{"type":"June","content":"DATE"},{"type":"$3.72 billion","content":"MONEY"},{"type":"Delta Skew","content":"ORGANIZATION"},{"type":"$1.2 billion","content":"MONEY"},{"type":"$9.5 billion","content":"MONEY"}],"hashtag":["CRYPTO MOVERS"],"authors":["Brian McGleenon","The Block"]}