{"summary":"The TRON DAO Reserve rolled out a decentralized algorithmic stablecoin named USDD (Decentralized USD), which has already been listed on SunSwap, Sun.io,","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/145865\/tron-dao-reserve-launches-usdd-on-over-seven-dexs-and-names-first-member-and-whitelisted-institution","publishDate":"2022-02-10T09:00:36","id":5154,"type":null,"title":"TRON DAO Reserve Launches USDD on Over Seven DEXs and Names First Member and Whitelisted Institution","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">The TRON DAO Reserve rolled out a decentralized algorithmic stablecoin named USDD (Decentralized USD), which has already been listed on SunSwap, Sun.io, Curve, Uniswap, Ellipsis, PancakeSwap, KyberSwap, and others. The initial total supply just reached around $127 million on <\/span><a href=\"https:\/\/tronscan.org\/#\/token20\/TPYmHEhy5n8TCEfYGqW2rPxsghSfzghPDn\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">TRON<\/span><\/a><span data-v-f87c67ca=\"\">, and $18 million on <\/span><a href=\"https:\/\/etherscan.io\/token\/0x0C10bF8FcB7Bf5412187A595ab97a3609160b5c6\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum<\/span><\/a> <span data-v-f87c67ca=\"\">and $20 million on <\/span><a href=\"https:\/\/bscscan.com\/token\/0xd17479997f34dd9156deef8f95a52d81d265be9c\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">BNB Chain<\/span><\/a> <span data-v-f87c67ca=\"\">through the cross-chain protocol BitTorrent Chain (BTTC). (As of May 5th 2022.)&nbsp;<\/span>","<span data-v-f87c67ca=\"\">USDD is circulating as a decentralized TRC token on the TRON blockchain. The TRON DAO Reserve transparently oversees the issuance and administration of reserves. USDD is algorithmically pegged to the U.S. dollar to achieve the overarching goal of financial freedom for everyone. As a TRC-20 standard token, USDD can trade without brokers and depends solely on the TRON network.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">USDD was created to develop a modern decentralized financial system on the blockchain. The TRON DAO Reserve strives to safeguard the global blockchain industry and crypto market, prevent panic trading caused by extreme market volatility, and mitigate severe and long-term economic downturns.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The TRON DAO Reserve aims to stabilize the exchange rates of centralized and decentralized stablecoins on TRON and other blockchains by benchmarking interest rates and guiding the market through liquidity provisions. It intends to formulate and implement monetary and exchange rate policies, play the role of a lender of last resort to market participants, and maintain reserve assets of various blockchains and blockchain-powered financial institutions in order to minimize systemic risks and contribute to the stability of the overall market.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On Thursday, May 5th, the TRON DAO Reserve announced Alameda Research as its first Member and Whitelisted Institution. Alameda Research is a leading principal trading firm. They use internally developed technology and the team’s deep crypto expertise to trade thousands of digital asset products, including all major coins, altcoins, and their derivatives. They have built a globally focused team and infrastructure with the ability to trade on all major exchanges and markets since 2017.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This appointment lists Alameda Research as an approved collaborator to the Reserve, granting them the right to mint and the right to burn USDD. As a Member and Whitelisted Institution, Alameda Research will serve as an advisor and make recommendations to improve, enhance and provide general support to the USDD network. They will prepare for, attend, and be fully engaged in all Reserve membership meetings. They will also support the USDD community and raise awareness surrounding the USDD network and the use of USDD in general.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The TRON DAO Reserve <\/span><a href=\"https:\/\/tdr.org\/#\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">website<\/span><\/a> <span data-v-f87c67ca=\"\">is now live, and historical token issuance records are published<\/span> <a href=\"https:\/\/tdr.org\/#\/records\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">here<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Tron<\/i><i data-v-f87c67ca=\"\">&nbsp;and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BitTorrent","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"USDD (Decentralized USD","content":"ORGANIZATION"},{"type":"$18 million","content":"MONEY"},{"type":"TRON DAO Reserve","content":"ORGANIZATION"},{"type":"Ellipsis","content":"LOCATION"},{"type":"TRC","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"Uniswap","content":"LOCATION"},{"type":"$127 million","content":"MONEY"},{"type":"USDD","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"TRON","content":"ORGANIZATION"},{"type":"$20 million","content":"MONEY"},{"type":"May 5th 2022","content":"DATE"},{"type":"May 5th","content":"DATE"},{"type":"Alameda Research","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}