{"summary":"Celsius has sought to reopen withdrawals for select customers that hold assets in its &quot;Custody Program and Withhold Accounts.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/167214\/celsius-seeks-to-reopen-withdrawals-for-certain-customers","publishDate":"2022-09-01T14:53:46","id":516,"type":null,"title":"Celsius seeks to reopen withdrawals for certain customers","category":["LENDING"],"content":["Crypto lender Celsius, which halted client withdrawals in June and filed for bankruptcy in July, is seeking to reopen withdrawals for select customers.","In a <a href=\"https:\/\/cases.stretto.com\/public\/x191\/11749\/PLEADINGS\/1174909012280000000022.pdf\" data-v-f87c67ca=\"\">filing submitted<\/a> Thursday in the Bankruptcy Court for the Southern District of New York, Celsius said that customer assets held in the \"Custody Program and Withhold Accounts\" are not the company's property and thus customers should be allowed to withdraw them.","Celsius argues that customers of the custody program own their assets, unlike customers of its Earn or Borrow programs. \"The Debtors believe that assets in the Earn Program and the Borrow Program are likely property of their estates, and that the transfer of such assets to Custody Program or the Withhold Accounts would have been a transfer of the Debtors' property to customers on account of such customers' claims against the Debtors,\" Celsius said in the filing.","Around 58,300 users hold \"custody assets\" worth about $210 million, and around 5,000 users hold \"withhold assets\" worth about $15 million as of August 29, according to the filing.","The court will discuss the motion at a hearing scheduled for October 6.","The filing comes a day after a group of 64 Celsius customers, represented by bankruptcy-focused law firm Togut, Segal &amp; Segal, filed a complaint in the court to recover their assets. The group sought to recover more than $22.5 million worth of assets collectively held in Celsius's custody program.","Assets held in Celsius's custody program represent only a small part of the company's total liabilities. Recent court documents&nbsp;<a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/www.theblock.co\/post\/163687\/celsius-report-shows-2-8-billion-in-crypto-liabilities-dwindling-cash-flow\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.theblock.co\/post\/163687\/celsius-report-shows-2-8-billion-in-crypto-liabilities-dwindling-cash-flow\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">showed<\/a>&nbsp;that Celsius’s liabilities are more than $6.7 billion and its assets are worth only around $3.9 billion — resulting in a balance sheet hole of $2.8 billion.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bankruptcy Court","content":"ORGANIZATION"},{"type":"Southern District of New York","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"$6.7 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"October 6","content":"DATE"},{"type":"$3.9 billion","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"August 29","content":"DATE"},{"type":"$210 million","content":"MONEY"},{"type":"$22.5 million","content":"MONEY"},{"type":"Celsius","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"Celsius","content":"LOCATION"},{"type":"$15 million","content":"MONEY"},{"type":"$2.8 billion","content":"MONEY"},{"type":"\" Celsius","content":"ORGANIZATION"},{"type":"Togut, Segal &amp; Segal","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}