{"summary":"The European Union’s potential central bank digital currency may have low transaction and storage thresholds for individual users.\nThe European Central Bank is currently investigating and developing a digital euro prototype.","author":["Inbar Preiss","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/183646\/digital-euro-transaction-limits-store-value-caps","publishDate":"2022-11-07T06:02:47","id":516,"type":null,"title":"Digital euro may have transaction limits and store-of-value caps","category":["Policy"],"content":["<span data-v-f87c67ca=\"\">The European Union’s central bank digital currency (CBDC) may have transaction and store-of-value limits for individuals, Fabio Panetta, an executive board member of the European Central Bank (ECB), suggested at the \"Towards a legislative framework enabling a digital euro\" conference hosted by the European Commission.<\/span>","<span data-v-f87c67ca=\"\">Exact limits are not set in stone — as the digital euro project is still in an investigation phase within the ECB — but Panetta mentioned <\/span><span data-v-f87c67ca=\"\">€<\/span><span data-v-f87c67ca=\"\">3,000 as an example store-of-value limit and 1,000 transactions as a monthly limit.<\/span>","<span data-v-f87c67ca=\"\">“If we give access to a means of payment, which is relatively limited, there are no transaction costs because you only need to have a smartphone,” Panetta said, explaining: “There will be risks that people could use this possibility to move, for example, their deposits of other banks or their money out of financial intermediates.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This would be a threat to financial stability in times of crisis, he added — which is why the ECB is looking to introduce transaction limits for the potential CBDC.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Digital euro would be an additional option for retail payment — not a challenge to the function of the financial system,” Panetta said, highlighting that the CBDC is not meant to replace cash.<\/span>","Panetta also pointed toward a €50 cap on transactions, citing anti-money laundering provisions.","However, Christian Lindner, the German minister of finance, expressed concerns. “I wonder whether people would accept €50 as they can pay in cash hundreds and more,” he said, adding: “We should introduce a digital euro that is really accepted by people and not only by policymakers.”","The ECB is expected to decide whether to move forward with a realization phase by September 2023. With a legislative proposal <a href=\"https:\/\/www.theblock.co\/post\/183632\/eu-commission-propose-legislation-digital-euro\" data-v-f87c67ca=\"\">expected<\/a> from the European Commission, the continuation of the European CBDC project is becoming more likely.&nbsp;","<em data-v-f87c67ca=\"\">Update: Added new information regarding a potential €50 cap on transactions, as well as a quote from Christian Lindner.<\/em>"],"hashtag":["ECB"]}