{"summary":"Quick take:  FLEX has grown from $0.05 in December 2020 to more than $5 today, representing 100x+ growth Assets under custody hit $1.2 billion CoinFLEX’s repo market went from millions to billions of dollars per day in volume flexUSD market cap reached $370 million and has paid out $17 million in interest to holders CoinFLEX’s automated market maker (AMM+) hit $100 million in assets","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/129134\/coinflex-a-retrospective-on-crypto-derivatives-innovation-in-2021","publishDate":"2022-01-05T08:59:18","id":5164,"type":null,"title":"CoinFLEX: A Retrospective on Crypto Derivatives Innovation in 2021","category":["SPONSORED"],"content":["<strong data-v-f87c67ca=\"\">Quick take:<\/strong>","<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">CoinFLEX focuses not only on building for the crypto markets today, but also for what will remain true ten years from now:<\/strong>","<strong data-v-f87c67ca=\"\">Armed with these truths, CoinFLEX has created products that enable passive investors to earn yield directly from the volatility and leverage available in the crypto derivatives markets without being a full-time professional trader or money manager<\/strong>.","Last year, CoinFLEX saw success in several products: flexUSD, AMM+, FLEXDAO, and the first smartBCH bridge.","<strong data-v-f87c67ca=\"\">flexUSD<\/strong><br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">With nearly $400 million in market cap, flexUSD – CoinFLEX’s stablecoin – has seen both increasing retail and institutional adoption.<\/strong>","<strong data-v-f87c67ca=\"\">AMM+<\/strong><br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">Learning from DeFi-borne financial primitives, CoinFLEX created the first automated market making (AMM) model for the futures market. The hybrid CeFi + DeFi model offers:<\/strong>","<strong data-v-f87c67ca=\"\">FLEXDAO<\/strong><br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">First exchange token DAO launched by a centralized exchange.<\/strong>","<strong data-v-f87c67ca=\"\">First smartBCH bridge<\/strong><br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">CoinFLEX serves an important role as the first bridge between the BCH chain and smartBCH.<\/strong>","<strong data-v-f87c67ca=\"\">Crypto Yield 2.0<\/strong><br data-v-f87c67ca=\"\">\nA major theme that will develop in 2022 is the rise of<strong data-v-f87c67ca=\"\"> Crypto Yield 2.0.<\/strong>","<strong data-v-f87c67ca=\"\">This means, users will find new ways of sourcing yield directly from the most liquid crypto market (futures) rather than interacting with protocols or centralized intermediaries. This direct, transparent, and market-based solution that CoinFLEX provides will continue to fuel the growth of crypto yield from a multi-billion to a multi-trillion dollar industry.<\/strong>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BCH","content":"ORGANIZATION"},{"type":"First exchange token DAO","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$400 million","content":"MONEY"},{"type":"Crypto Yield 2.0","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}