{"summary":"South Korea&#x27;s top financial regulator has introduced new penalty standards for crypto exchanges if they fail to implement proper AML measures.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/97845\/korea-crypto-exchanges-penalties-aml-failures","publishDate":"2021-03-10T06:00:37","id":5166,"type":null,"title":"Korean crypto exchanges to be subject to penalties for any AML failures","category":["REGULATION"],"content":["South Korea's Financial Services Commission (FSC), the country's top financial regulator, has introduced new penalty standards for crypto exchanges if they fail to implement proper anti-money laundering (AML) measures.","The standards, <a href=\"https:\/\/www.fsc.go.kr\/eng\/pr010101\/75536?srchCtgry=&amp;curPage=&amp;srchKey=&amp;srchText=&amp;srchBeginDt=&amp;srchEndDt=\" data-v-f87c67ca=\"\">announced Wednesday<\/a> and effective from April 20, align with Korea's revised act on Reporting and Using Specified Financial Transaction Information that is going into effect later this month.","Under the new penalty standards, virtual asset service providers (VASPs), including crypto exchanges, will be subject to fines if they are found to violate three duties: Internal control (e.g., failure to report suspicious transaction activities), data maintenance (e.g., failure to keep relevant data on suspicious transactions), and duties specifically pertaining to VASPs (e.g., failure to keep separate management of customers' transactions records).","<a href=\"https:\/\/www.fsc.go.kr\/no010101\/75533?srchCtgry=&amp;curPage=&amp;srchKey=&amp;srchText=&amp;srchBeginDt=&amp;srchEndDt=\" data-v-f87c67ca=\"\">Penalties could vary from<\/a> 30% to a maximum of 60% of the legally approved maximum amount. The FSC has also introduced a penalty reduction program of 50% for large firms and more than 50% for small firms.","The imminent strict rules likely explain why Bithumb, the second-largest crypto exchange in South Korea, <a href=\"http:\/\/www.koreaherald.com\/view.php?ud=20210309001006\" data-v-f87c67ca=\"\">tightened<\/a> its know-your-customer and AML measures on Tuesday. Specifically, the exchange banned accounts of users staying in regions that have not adopted AML measures, including Iran and North Korea.","This is not the first time the FSC has introduced stringent measures for the crypto sector. In 2018, the regulator <a href=\"https:\/\/www.theblockresearch.com\/regulatory-overview-south-korea-88206\" data-v-f87c67ca=\"\">implemented<\/a> a \"real-name account system,\" requiring users to submit a real-name bank account, a local phone number, and a residence permit for opening an account with a crypto exchange.","Starting next year, South Korea is also introducing a&nbsp;20% <a href=\"http:\/\/www.koreaherald.com\/view.php?ud=20210222000880#:~:text=South%20Korean%20investors%20who%20make,million%20won%20is%20tax%2Dfree.\" data-v-f87c67ca=\"\">tax&nbsp;for investors<\/a> who make more than 2.5 million won (around $2,200) from cryptocurrency trading.&nbsp;","South Korea is one of the popular markets for crypto, according to <a href=\"https:\/\/www.theblockresearch.com\/analysis-singapore-south-korea-switzerland-top-list-in-relative-cryptocurrency-popularity-25305\" data-v-f87c67ca=\"\">The Block Research<\/a>. The country ranked second in terms of crypto interest relative to its population in mid-2019, meaning South Korea contributed a larger share in web traffic of crypto exchanges at the time.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Korea","content":"LOCATION"},{"type":"North Korea","content":"LOCATION"},{"type":"20%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"60%","content":"PERCENT"},{"type":"April 20","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"Using Specified Financial Transaction Information","content":"ORGANIZATION"},{"type":"FSC","content":"ORGANIZATION"},{"type":"$2,200","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"AML","content":"ORGANIZATION"},{"type":"Financial Services Commission (FSC","content":"ORGANIZATION"},{"type":"Iran","content":"LOCATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}