{"summary":"Foundation Capital leads digital asset protection startup Coincover&#x27;s $30 million raise.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210061\/crypto-protection-startup-coincover-raises-30-million","publishDate":"2023-02-09T08:00:39","id":5167,"type":null,"title":"Crypto protection startup Coincover raises $30 million","category":["DEALS"],"content":["Crypto protection startup Coincover has secured $30 million in funding in a round led by Foundation Capital.","Coincover <a href=\"https:\/\/www.coincover.com\/\" data-v-f87c67ca=\"\">provides<\/a>&nbsp; protection and insurance-backed guarantees to crypto investors and companies through its technology platform. The insurance protection is underwritten by Lloyds of London insurers.","The UK-based startup <a href=\"https:\/\/www.theblock.co\/post\/110691\/welsh-crypto-insurer-coincover-lands-9-2-million-series-a-fundraise\" data-v-f87c67ca=\"\">raised<\/a> a $9.2 million Series A back in July 2021 with backing from investors such as Valor Equity Partners, Susquehanna Private Equity Investments, LLLP and DRW Venture Capital.","Coincover's CEO and co-founder David Janczewski declined to disclose the names of other investors for this round. However, he said they were \"a real mixture\" of investors with some being crypto native VCs as well as the more traditional venture firms and corporate venture funds.","\"I think it's the next round of logical fundraising,\" said Janczewski in an interview with The Block. \"There are certain people who will put a letter on that. So it's logical if the last one was A that this was B, but I guess it's just the next logical step for us in terms of raising the right amount of capital, more importantly from the right venture building partners to scale the business to the next stage.\"","Founded in 2018, Coincover offers two core digital assets protection services: disaster recovery and transaction protection. Clients run the gamut from early stage companies to exchanges and hedge funds, Janczewski said.","Over the years, Coincover has seen a greater awareness and appreciation for the types of products the company offers as the market has matured, Janczewski said. Most clients start their journey with the company for its disaster recovery product. Whereas transaction protection product is more popular with companies that have an installed user base.","\"I would say that we've seen a a substantial increase in demand by a wide variety of customers who when I speak with any of them are eager and keen to be proactive when they think about protecting client assets,\" said Janczewski describing the impact of the bear market on market appetite.","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">The digital assets sector is underserved by the broader insurance market, in part because it is so young but also due to its volatility. Broker Aon estimates the crypto market insurance rate is below 2%, according to&nbsp;<\/span><a href=\"https:\/\/news.bloomberglaw.com\/insurance\/crypto-insurance-policies-popping-up-to-meet-frenetic-demand\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">Bloomberg Law<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\">.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:0,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">At the height of the bull market, insurance and protection services for digital asset firms could be a hard sell, said Dave Roque, head of digital assets insurance at USI, in an <a href=\"https:\/\/www.theblock.co\/post\/169174\/crypto-companies-are-finally-looking-to-buy-insurance-but-are-the-policies-out-there-worthwhile\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">&nbsp;interview<\/a>&nbsp;with The Block.&nbsp;<\/span><span data-contrast=\"auto\" data-v-f87c67ca=\"\">That mentality shifted dramatically as the market soured, with his company witnessing&nbsp; a 350% increase in client acquisition from fintech and crypto companies within the last year.<\/span>","Coincover operates as a bridge between customer and insurer. It's about providing high quality risk data that can get everyone comfortable with risks and therefore offer increased numbers of coverage to customers, Janczewski said.","The new funding will be used to accelerate hiring, make product updates and secure more partnerships, Janczewski said.","\"We select our partners and I think they select us very carefully and I think that's good for the market in general,\" he added. \"Our ability to onboard more partners throughout this year is now increased, which is fantastic.\"","The fundraising efforts kicked off toward the end of the first quarter in 2022 and closed towards the middle of the fourth quarter. He wouldn't disclose whether the funding followed the popular <a href=\"https:\/\/www.theblock.co\/post\/171609\/why-equity-plus-token-warrants-is-the-new-go-to-formula-for-crypto-vcs\" data-v-f87c67ca=\"\">industry structure<\/a> of equity plus token warrants but said it was \"nothing particularly special\" in terms of structuring. The startup also did not disclose its valuation.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“After a tumultuous year for digital assets, investing in&nbsp;<span class=\"mark2kclq1mpe\" data-markjs=\"true\" data-ogac=\"\" data-ogab=\"\" data-ogsc=\"\" data-ogsb=\"\" data-v-f87c67ca=\"\">Coincover<\/span> was a no-brainer,” said Charles Moldow, general partner at Foundation Capital, in the release. “The brand offers assurance in a fast-paced market.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USI","content":"ORGANIZATION"},{"type":"Dave Roque","content":"PERSON"},{"type":"Coincover","content":"PERSON"},{"type":"end of the first quarter","content":"DATE"},{"type":"2%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Lloyds","content":"ORGANIZATION"},{"type":"Bloomberg Law","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Valor Equity Partners","content":"ORGANIZATION"},{"type":"Charles Moldow","content":"PERSON"},{"type":"$30 million","content":"MONEY"},{"type":"350%","content":"PERCENT"},{"type":"UK","content":"ORGANIZATION"},{"type":"David Janczewski","content":"PERSON"},{"type":"Susquehanna Private Equity Investments","content":"ORGANIZATION"},{"type":"Foundation Capital","content":"ORGANIZATION"},{"type":"London","content":"LOCATION"},{"type":"fourth quarter","content":"DATE"},{"type":"Janczewski","content":"PERSON"},{"type":"July 2021","content":"DATE"},{"type":"DRW Venture Capital","content":"ORGANIZATION"},{"type":"$9.2 million","content":"MONEY"}],"hashtag":["SERIES A","SERIES B"],"authors":["Kari McMahon","The Block"]}