{"summary":"This twice-weekly newsletter is republished with permission from Global Coin Research, a global research firm with a focus on Asia blockchain and related","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/30747\/global-coin-research-asia-blockchain-summit-libra-in-asia-exchanges-boost-data-offerings-and-more","publishDate":"2019-07-10T16:15:19","id":5173,"type":null,"title":"Global Coin Research: Asia Blockchain Summit, Libra in Asia, exchanges boost data offerings, and more","category":["OP-ED"],"content":["<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">This twice-weekly newsletter is republished with permission from Global Coin Research, a global research firm with a focus on Asia blockchain and related technologies. You can find more resources on Asia Cryptocurrency and Blockchain at GlobalCoinResearch.com and on Twitter at <a href=\"https:\/\/twitter.com\/globalcoinrsrch?lang=en\" data-v-f87c67ca=\"\">@globalcoinrsrch<\/a><\/em>","<em data-v-f87c67ca=\"\">This is a double-edition including last week's Friday Global Coin Research post that featured quick takes from Asia Blockchain Summit 2019 in Taipei.<\/em>","&nbsp;","Our founder Joyce Yang was at the Asian Blockchain Summit in Taipei on July 2-3. This was arguably one of the most interesting and best conferences this year since the market picked back up, with many folks from North America, China, Korea, Japan and Southeast Asia all coming together. A number of the whales from China came, along with the largest exchange founders such as those from Bitmex and Binance.","The highlight of the conference was definitely the debate between Nouriel Roubini and Arthur Hayes, which was held off the record. While the polling results have shown that Arthur won the debate, Nouriel is still quite bitter about it. But truly, if you were actually present and listened to the entire debate, the answer was crystal clear.&nbsp;","Nouriel claimed that cryptocurrencies were not scalable, not private, and not secure, but he addressed them in almost an uncivilized and comedic manner, through personal attacks and dismissive condescending statements. He bashed the current state of the scammy, retail-focused crypto market, while completely failing to recognize how nascent this space is, and without acknowledging any of the good actors trying to build in this space. He lauded how China’s Wechat and Africa’s MPesa have already achieved the scalability and speed in payments, while ignoring the issue of privacy. On the other hand, Hayes came prepared and made his points logically and clearly. He emphasized that Bitcoin and cryptocurrencies give people another choice, and that’ll be increasingly valuable as societal digital transformations put us under more surveillance.","Along the way and through our conversations with different projects and communities, we are seeing a widening gap between East and West. This is observed through the pace of development among the local exchanges and projects, and also the direction in which they are developing. Companies are taking their own flavors of the blockchain to build something suitable for their audience, and that has resulted in very different product offerings in the market.","We are seeing this trend in areas such as blockchain tools and DeFi. In the case of blockchain tools, for example, given the ongoing push for real case adoption and gaming in Korea, we are seeing the rise of blockchain agnostic tools such as Bifrost and Supertree. Bifrost claims to be the first and only middleware platform between Dapps and protocols. The company builds hybrid permissioned versions of public chains which allow DApps to vary the number of permissioned features. Supertree, on the other hand, uses meta-blockchain technology such as ETH, EOS, for game developers. It is developing a platform that combines the systems of the centralized and decentralized platforms for initial stable operations, but once nodes are secured, it will be changed to a fully decentralized dApp.","In DeFi, we met with a native stablecoin that’s coming out of China. Dforce this month is launching a synthetic indexed USD stablecoin protocol and unlike DeFi folks that are building on top of Ethereum, Dforce aims to build an integrated platform for blockchain-native DeFi and monetary protocols serving as back-bone infrastructure for DeFi.&nbsp;","While many projects are interesting, the question that we want to emphasize is how can they achieve global adoption beyond their own jurisdiction? And do any of them really need global adoption? When we see the evolution in the last few years, we come to recognize how being early in multiple markets will become a lasting advantage for the projects that have launched in the last few years.","On the exchange side, we are seeing increasing clarity and sophistication of data offered in this previously opaque space. Alameda Research has introduced a dynamic dashboard for real exchange volumes. The trading firm tested each exchange on six different criteria and it estimates that it trades 5% of all global crypto volume. One stat says “spot” trades of actual digital assets and derivatives, like bitcoin futures , see $38 billion in real volume a day. Eighty-seven percent of this volume happens on Asian exchanges, with just 9% happening on U.S. venues. Alameda also believes more crypto volume is real than Bitwise’s report claims. For OKEx and Huobi, which were founded in China, Alameda estimates about 70% of their transactions are authentic.&nbsp;<br data-v-f87c67ca=\"\">\n&nbsp;<br data-v-f87c67ca=\"\">\nWe’ve also heard from sources that Huobi has laid off all of its U.S. staff, whereas Coinsuper, a large exchange in China, has also laid off 70–80% of its staff from the bear market. One caveat here though, in China, unlike the startups in the U.S., it is not atypical to fire a large number of employees given poor employee labor protection and traditionally unsophisticated management culture. Chinese firms scale up and down pretty rapidly all the time. And in case you haven’t been paying attention- Vietnam is now the seventh largest country by crypto trading volume.&nbsp;<br data-v-f87c67ca=\"\">\n&nbsp;<br data-v-f87c67ca=\"\">\nOther companies that we thought were super interesting and worth keeping an eye on in Asia: Tagomi (U.S.-based prime brokerage service but ramping up in Asia aggressively), Coinflex (physical futures and growing), Sparkpool (Ethereum mining pool in Hangzhou with over 25% of hashpower) and Starkware.","<strong class=\"fd ga\" data-v-f87c67ca=\"\">Facebook has requested discussions with the central bank of Thailand <\/strong>because Thailand has 50 million registered Facebook users.&nbsp;<a href=\"http:\/\/bit.ly\/2NIlKm7\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Source<\/em><\/a>","<strong class=\"fd ga\" data-v-f87c67ca=\"\">Facebook’s plans to create its own cryptocurrency <\/strong>have forced China’s central bank into stepping up research into creating its own digital currency as Libra could potentially pose a challenge to Chinese cross-border payments, monetary policy and even financial sovereignty, according to a People’s Bank of China official. “China wants to know, in particular, the composition of the currency basket and the role the US dollar will play.&nbsp;<em data-v-f87c67ca=\"\"><a href=\"http:\/\/bit.ly\/2YIb1sQ\" data-v-f87c67ca=\"\">Source<\/a><\/em>","<strong class=\"fd ga\" data-v-f87c67ca=\"\">Chinese blockchain media company Cailu<\/strong> has received $10 million in pre-Series A funding for further development.&nbsp;<em data-v-f87c67ca=\"\"><a href=\"http:\/\/bit.ly\/2S5VLDW\" data-v-f87c67ca=\"\">Source<\/a><\/em>","<strong class=\"fd ga\" data-v-f87c67ca=\"\">OKCoin is announcing that STASIS,<\/strong>&nbsp;the first euro-pegged stablecoin, is listed on the OKCoin exchange. Now, OKCoin customers can deposit and withdraw EURS, in addition to trade against USD, EUR, and BTC.&nbsp;<em data-v-f87c67ca=\"\"><a href=\"http:\/\/bit.ly\/2xEvAe1\" data-v-f87c67ca=\"\">Source<\/a><\/em>","<strong class=\"fd ga\" data-v-f87c67ca=\"\">KuCoin launches derivatives trading platform KuMEX<\/strong>, promises up to 20x leverage- following recent announcements by Huobi, Binance, and Bitfinex. Just recently, KuCoin has launched an EOS Soft Staking Program.&nbsp;<a href=\"http:\/\/bit.ly\/2S5J77M\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Source<\/em><\/a>","<strong class=\"fd ga\" data-v-f87c67ca=\"\">Bitfinex LEO token announces 27%&nbsp;<\/strong>of profit burn.&nbsp;<em data-v-f87c67ca=\"\"><a href=\"http:\/\/bit.ly\/2S1UbTm\" data-v-f87c67ca=\"\">Source<\/a><\/em>","<strong class=\"fd ga\" data-v-f87c67ca=\"\">Tron releases a subpar response i<\/strong>n response to the Wave Field Community Scam after protestors disrupted the office and led to police presence.&nbsp;<em data-v-f87c67ca=\"\"><a href=\"http:\/\/bit.ly\/2SdNNIZ\" data-v-f87c67ca=\"\">Source<\/a><\/em>","<strong class=\"fd ga\" data-v-f87c67ca=\"\">Bitmain granted all the employees&nbsp;<\/strong>with certain titles who had been with the company since early 2018 with options, pending IPO.&nbsp;<em data-v-f87c67ca=\"\"><a href=\"http:\/\/bit.ly\/2S47B18\" data-v-f87c67ca=\"\">Source<\/a><\/em>","<strong class=\"fd ga\" data-v-f87c67ca=\"\">Former Thailand Blockchain Events COO<\/strong>: “This Is An Industry That Needs To Un-Scam Itself.\" <em data-v-f87c67ca=\"\"><a href=\"http:\/\/bit.ly\/2S5UAo0\" data-v-f87c67ca=\"\">Source<\/a><\/em>","<strong class=\"fd ga\" data-v-f87c67ca=\"\">Singapore Global eTrade Services (GeTS)<\/strong> announced that it will produce blockchain based electronic Certificates of Origin (eCOs) for internationally traded goods.&nbsp;<em data-v-f87c67ca=\"\"><a href=\"http:\/\/bit.ly\/2S4iq36\" data-v-f87c67ca=\"\">Source<\/a><\/em>","<strong class=\"fd ga\" data-v-f87c67ca=\"\">Singapore-based online car marketplace sgCarMart<\/strong> and decentralized data exchange protocol Ocean Protocol are launching a blockchain-powered “Know-Your-Vehicle” data marketplace.&nbsp;<em data-v-f87c67ca=\"\"><a href=\"http:\/\/bit.ly\/2S3DJSw\" data-v-f87c67ca=\"\">Source<\/a><\/em>","<strong class=\"fd ga\" data-v-f87c67ca=\"\">The Indian government is latest to show skepticism toward&nbsp;<\/strong>Facebook’s planned cryptocurrency Libra.&nbsp;<em data-v-f87c67ca=\"\"><a href=\"https:\/\/bloom.bg\/2S4j9kQ\" data-v-f87c67ca=\"\">Source<\/a><\/em>","<strong class=\"fd ga\" data-v-f87c67ca=\"\">China’s central bank, the People’s Bank of China,&nbsp;<\/strong>has processed 30 billion yuan of foreign exchange transactions on a blockchain-based trade finance platform. The formal schedule is to began for August.&nbsp;<em data-v-f87c67ca=\"\"><a href=\"http:\/\/bit.ly\/2S8cuGr\" data-v-f87c67ca=\"\">Source<\/a><\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"70%","content":"PERCENT"},{"type":"EUR","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"KuCoin","content":"ORGANIZATION"},{"type":"Nouriel","content":"ORGANIZATION"},{"type":"$38 billion","content":"MONEY"},{"type":"Cailu","content":"ORGANIZATION"},{"type":"27%","content":"PERCENT"},{"type":"Asian Blockchain Summit","content":"ORGANIZATION"},{"type":"Asia Cryptocurrency","content":"LOCATION"},{"type":"West","content":"LOCATION"},{"type":"August","content":"DATE"},{"type":"North America","content":"LOCATION"},{"type":"Bitmex","content":"LOCATION"},{"type":"Dapps","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Korea","content":"LOCATION"},{"type":"Wave Field Community Scam","content":"ORGANIZATION"},{"type":"Arthur","content":"PERSON"},{"type":"Alameda","content":"LOCATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Hangzhou","content":"LOCATION"},{"type":"Nouriel Roubini","content":"ORGANIZATION"},{"type":"Africa","content":"LOCATION"},{"type":"Huobi","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"},{"type":"Vietnam","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"80%","content":"PERCENT"},{"type":"Friday Global Coin Research","content":"ORGANIZATION"},{"type":"Hayes","content":"PERSON"},{"type":"Global Coin Research","content":"ORGANIZATION"},{"type":"Joyce Yang","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"2019","content":"DATE"},{"type":"Singapore Global eTrade Services","content":"ORGANIZATION"},{"type":"Tagomi (U.S.","content":"LOCATION"},{"type":"People’s Bank of China","content":"ORGANIZATION"},{"type":"Huobi","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"July 2","content":"DATE"},{"type":"3","content":"DATE"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"},{"type":"Binance","content":"PERSON"},{"type":"Taipei","content":"LOCATION"},{"type":"Southeast Asia","content":"LOCATION"},{"type":"9%","content":"PERCENT"},{"type":"Dforce","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"Japan","content":"LOCATION"},{"type":"Thailand","content":"LOCATION"},{"type":"30 billion yuan","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"seven percent","content":"PERCENT"},{"type":"China","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bifrost","content":"LOCATION"}],"hashtag":[],"authors":["Contributor Network","The Block"]}