{"summary":"Socios and the AFA will also build a gamified, web3-ready, engagement and rewards community for Argentine fans through the tokens, which will be built on the Chiliz blockchain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/166849\/socios-extends-argentina-soccer-deal-tapping-into-a-market-ravenous-for-digital-assets","publishDate":"2022-08-31T14:30:54","id":5185,"type":null,"title":"Socios extends Argentina soccer deal tapping into a market ravenous for digital assets","category":["BLOCKCHAIN"],"content":["<span data-v-f87c67ca=\"\">Socios extended a deal for a $ARG fan token for the Argentine Football Association through at least 2026.<\/span>","<span data-v-f87c67ca=\"\">Argentines are eager to put their money anywhere but the peso, making digital assets highly attractive.<\/span>","","&nbsp;","Socios has extended its deal to provide the $ARG fan token for the Argentine Football Association (AFA)&nbsp; through at least 2026.","The two <a href=\"https:\/\/medium.com\/socios\/socios-com-retains-exclusivity-as-fan-token-provider-for-afa-e6737130871e\" data-v-f87c67ca=\"\">will also build<\/a> a gamified, web3-ready, engagement and rewards community for Argentine fans through the tokens, which will be built on the Chiliz blockchain.","The Socios-AFA partnership was paused earlier this year over a dispute that landed in an Argentine court, a Socios representative said in an email without clarifying the nature of the disagreement. The two sides reached an agreement outside of court, allowing Socios to be the exclusive provider of the $ARG fan token through 2026.&nbsp;","Socios leverages blockchain technology to provide fan tokens, collectibles and other digital assets to sports organizations. Last year, it partnered with the management firm behind the New England Patriots and the National Hockey League’s New Jersey Devils. It had partnerships with 24 National Basketball Association franchises as well.","Socios is tapping into a soccer-wild country. In a survey of Argentines, <a href=\"https:\/\/www.statista.com\/statistics\/1082896\/like-soccer-argentina\/\" data-v-f87c67ca=\"\">Statista<\/a> found that 85% of them are interested in the sport. Perhaps more noteworthy is the popularity digital assets are seeing. With annual inflation at 64% in August, with some forecasts sending it to 90% by year’s end, locals swap their pesos as quickly as possible, be it for U.S. dollars, bitcoin or anything that’s simply not a peso. According to a Morning Consult survey earlier this year, nearly 60% of Argentine respondents said they'd bought or sold cryptocurrency in the last month.&nbsp;","<em data-v-f87c67ca=\"\">This story has been updated with additional details on the $ARG token's extension.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"2026","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Argentine Football Association (AFA","content":"ORGANIZATION"},{"type":"New England Patriots","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$ARG","content":"MONEY"},{"type":"64%","content":"PERCENT"},{"type":"60%","content":"PERCENT"},{"type":"85%","content":"PERCENT"},{"type":"Argentine Football Association","content":"ORGANIZATION"},{"type":"National Hockey League’s New Jersey Devils","content":"ORGANIZATION"},{"type":"24 National Basketball Association","content":"ORGANIZATION"},{"type":"AFA","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}