{"summary":"Automated market makers, or AMM, serves as one of the most critical infrastructures in DeFi. Thanks to this innovation, trading on decentralized exchanges is now a common thing among DeFi users.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/119191\/cross-chain-the-future-of-amm","publishDate":"2021-10-05T09:09:38","id":5187,"type":null,"title":"Cross-Chain: The Future of AMM","category":["SPONSORED"],"content":["<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Author: Ivan Yeung, Co-founder of Convergence Finance<\/span><\/i>","<span data-v-f87c67ca=\"\">Automated market makers, or AMM, serves as one of the most critical infrastructures in DeFi. Thanks to this innovation, trading on decentralized exchanges is now a common thing among DeFi users. While this year’s monthly aggregated trade volume of major DEXes has almost tripled compared to last year, most of the assets traded on-chain remained on the same chain. This could limit the scalability of DEX, even the growth of the broader DeFi space in the long run. The future of DeFi could lie on a viable cross-chain solution on trading, and cross-chain AMM could be the answer.<\/span>","<span data-v-f87c67ca=\"\">Trading activity remained vigorous on DEXes in the past few months. Although the broader crypto market was not favorable during that period, data from Dune Analytics shows that the aggregated monthly trade volume of major DEXes maintained at over 56 billion USD from June to September, which is after the massive broader market corrections noticeably higher than in late 2020.<\/span>","&nbsp;","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Figure 1a: Monthly DEX Volume by Project<\/span><\/i>","","","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Source: Dune Analytics<\/span><\/i>","&nbsp;","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Figure 1b: Monthly DEX Volume Grouped by Year<\/span><\/i>","","","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Source: Dune Analytics<\/span><\/i>","&nbsp;","<span data-v-f87c67ca=\"\">This year's major DEXes' monthly trade volume has already outpaced the numbers in the last two years. Let's take September as an example. At the time of writing, monthly DEX trade volume has reached 8.3 billion USD, compared to 2.9 billion USD in the same period last year, and 298 million in 2019.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The numbers are strong proof that an increasing number of crypto crowds have turned themselves into AMM-style trading instead of using traditional centralized methods. Part of the reason for that could be the expanding product selections on DEXes. The DeFi space looks very different from two years ago, from basic asset swaps to derivatives, concentrated liquidity, and private-sale tokens. The innovations we've seen in DEXes are undeniably imperative. This transformation of AMM-style trading could also partly explain why the TVL in DeFi has been growing steadily.<\/span>","&nbsp;","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Figure 2: TVL in DeFi (USD; 1-year)<\/span><\/i>","","","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Souce: DeFi Pulse<\/span><\/i>","<span data-v-f87c67ca=\"\">Although AMM has been evolving rapidly, one issue remains the same, when an AMM is built on one chain, their trades and assets will also stay on the same chain and hardly move to another chain. With the increasing adoption of DeFi, this lack of interoperability could be an issue for AMM-style trading and DeFi in general. It could limit its scaling in the long run.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">If you believe cross-chain is the future of DeFi, cross-chain AMM is the future of DeFi trading. Imagine what if a DeFi user can trade an Ethereum-based asset through a MoonRiver-based AMM. So, what benefit can the user have, you may wonder. There are several advantages in such cross-chain AMM, and cost would be one of them.<\/span>","<span data-v-f87c67ca=\"\">Anyone that has tried to swap assets on any Ethereum-based AMMs would know that all transactions you make there involve a gas fee, and the gas fee could be unreasonably high sometimes due to network congestion.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Undoubtedly, it makes sense that when someone uses the blockchain, they pay for their usage; however, when the fee is too high for everyday users, it seems to defeat the original purpose of DeFi, which is open and accessible. Furthermore, as more users are open to Ethereum-based DeFi trading, the network will be more congested, increasing the gas fee. This cycle will go on and on.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">That's why cross-chain AMM could be a solution for that. For example, if an AMM is built on a high-performance chain with an extra-low gas fee, AMM could trade popular ETH-based assets very quickly, and assets could be swapped across different chains effortlessly.<\/span>","<span data-v-f87c67ca=\"\">This cross-chain capability can solve the high gas fee and congestion problem and allow users to trade assets not just on one chain but also on many others. That will open up even more investment opportunities for all DeFi users; also, developers can build their projects with extra flexibility, and the chain itself will not limit their creativity.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Although cross-chain AMM is not a new concept, many existing cross-chain AMMs can only connect small chains with only a handful of assets, and the market still hasn't seen one that can connect major chains with major assets. Convergence could be the one that can change that.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Convergence started as an ETH-based AMM featuring major assets and exotic assets such as private-sale tokens. It aims to open up the private investment market to the public. Convergence recently announced that its AMM would be deployed to Moonriver, Moonbeam's first EVM-compatible parachain on Kusama. The deployment will make ConvX a true cross-chain AMM with the technical advantages and efficiency as a parachain on Kusama and enjoy the convenience of full Ethereum compatibility.<\/span>","<span data-v-f87c67ca=\"\">As a firm believer of cross-chain DeFi, AMM with cross-chain capabilities is inevitable. Although we have seen more attempts to achieve a seamless cross-chain experience in the space, we believe that building on a flexible high-performance EVM-compatible chain is the best way. We are still in the early days of cross-chain DeFi, innovations in this field will still emerge, and we are just at the beginning of an even more exciting time.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ivan Yeung","content":"PERSON"},{"type":"Convergence Finance","content":"ORGANIZATION"},{"type":"Moonriver","content":"PERSON"},{"type":"Kusama","content":"PERSON"},{"type":"DEX Volume by Project","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"from June to September","content":"DATE"},{"type":"56 billion USD","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"last two years","content":"DATE"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"DEX Volume Grouped","content":"ORGANIZATION"},{"type":"Moonbeam","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"AMM","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"two years ago","content":"DATE"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}