{"summary":"The Central African Republic now has a new national cryptocurrency called Sango Coin that will be used to power its digital economy.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/155665\/central-african-republic-launches-national-cryptocurrency-called-sango-coin","publishDate":"2022-07-03T14:39:15","id":5188,"type":null,"title":"Central African Republic launches national cryptocurrency called &#x27;Sango Coin&#x27;","category":["POLICY"],"content":["President Faustin-Archange Touadéra of the Central African Republic (CAR) launched Sango Coin as the country's national cryptocurrency in a virtual <a href=\"https:\/\/sango.org\/event\" data-v-f87c67ca=\"\">event<\/a> broadcast on Sunday.","Dubbed the “Sango Genesis Event,” it saw the country’s president enumerate plans for bitcoin and crypto utilization.","“Sango Coin will be the next-generation currency for [the] Central African Republic,” President Touadéra stated in his address.","According to President Touadéra, Sango Coin will act as the “gateway to the natural resources of the Central African Republic.” CAR’s government previously announced plans to <a href=\"https:\/\/www.theblock.co\/post\/150041\/central-african-republic-announces-plan-to-tokenize-countrys-minerals\" data-v-f87c67ca=\"\">tokenize the country’s natural resources<\/a>, including petroleum, diamonds and copper.","The country plans to use Sango Coin to create a crypto-based economy driven by private investment. This digital economic hub also includes the creation of a \"crypto island\" on the Oubangui River.","Hervé Ndoba, the country’s finance minister, also appeared at the event and stated that the national crypto is backed by bitcoin. It is, however, unclear the exact nature of the bitcoin-backing for Sango Coin.&nbsp;The landlocked African country became the first on the continent to <a href=\"https:\/\/www.theblock.co\/post\/143738\/central-african-republic-adds-bitcoin-as-legal-currency-afp\" data-v-f87c67ca=\"\">recognize bitcoin<\/a> as an official currency in April.","Apart from introducing Sango Coin, the Touadéra administration says it wants to adopt blockchain technology to revamp the country’s digital architecture. The CAR government plans to use blockchain to digitize its land registry system.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Faustin","content":"PERSON"},{"type":"Sunday","content":"DATE"},{"type":"Sango Coin","content":"ORGANIZATION"},{"type":"Archange Touadéra","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Touadéra","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"Sango Genesis Event","content":"ORGANIZATION"},{"type":"Oubangui River","content":"LOCATION"},{"type":"Sango Coin","content":"LOCATION"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}