{"summary":"The Shanghai Upgrade marks the final milestone in Ethereum&#x27;s transition from Proof of Work (PoW) to the Proof of Stake (PoS) consensus mechanism.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225896\/how-the-liquid-staking-scenario-will-change-after-the-ethereum-shanghai-upgrade","publishDate":"2023-04-12T08:50:02","id":5189,"type":null,"title":"How the Liquid Staking scenario will change after the Ethereum Shanghai upgrade","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">The Shanghai Upgrade marks the final milestone in Ethereum's transition from Proof of Work (PoW) to the Proof of Stake (PoS) consensus mechanism. This transition will shepherd proposals to reduce transaction costs, increase transaction speeds, and unlock staked ETH. The Beacon chain's release in December 2020 enabled the stake function of ETH and initiated the dual-track system of PoS and PoW. By September 2022, Ethereum had transformed into a PoS chain and ended algorithmic mining with the completion of the Merge. However, ETH will not be unlocked and withdrawable until the Shanghai upgrade.<\/span>","<span data-v-f87c67ca=\"\">Currently, the number of PoS validators in the Ethereum network has exceeded 510,000, with the total number of ETH tokens staked over 16.4 Million. These ETH are locked in the Ethereum network, awaiting the Shanghai Upgrade to be withdrawn.<\/span>","<span data-v-f87c67ca=\"\">Despite concerns that opening Shanghai unstake may cause a sell-off of ETH, two reasons lead one to think otherwise: Small bits of the unlocked ETH will be available for withdrawals daily, which are minimal compared to ETH's daily trading volume.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The enthusiasm of ETH holders to participate in staking will significantly increase. Currently, the staking ratio for ETH is about 16%, while the staking ratios for mainstream PoS chains are generally between 40% and 70%, leaving plenty of room for growth.<\/span>","<b data-v-f87c67ca=\"\">Bifrost: A cross-chain LSD protocol<\/b>","<span data-v-f87c67ca=\"\">The introduction of a new wave of platforms utilizing the PoS consensus mechanism has increased interest in liquid staking solutions. <\/span><a href=\"http:\/\/bifrost.finance\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bifrost Finance<\/span><\/a><span data-v-f87c67ca=\"\">, a non-custodial, decentralized, and cross-chain liquid staking protocol, supports the liquid staking of tokens from multiple PoS chains. Token holders of supported PoS chains can stake their tokens and receive the corresponding vTokens, including vETH, vDOT, vKSM, vGLMR, vMOVR, vBNC, and vFIL.<\/span>","<span data-v-f87c67ca=\"\">Launched by Bifrost in 2020, <\/span><a href=\"https:\/\/bifrost.app\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">vETH<\/span><\/a><span data-v-f87c67ca=\"\"> is the Liquid Staking Derivative (LSD) asset of Ethereum and has a current minting volume exceeding 20,000 ETH. Meaning, Bifrost’s total TVL is $70 Million and 42% of its staked assets are on ETH.<\/span>","<span data-v-f87c67ca=\"\">Upon implementing the Shanghai upgrade, we will launch the vETH 2.0 contract, enabling vETH holders to redeem their original staked ETH with interest. vETH 2.0 holders will no longer need to manually collect their earnings, and they can increase the amount of ETH that can be redeemed as they hold vETH 2.0.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">vETH 2.0 allows holders to take part in different farming pools built cross-chain. This enables them to stake LP Token onto a protocol they believe is valid and receive xcBNC as rewards, an EVM-compatible version of BNC, the Bifrost Native Coin.<\/span>","<span data-v-f87c67ca=\"\">DeFi's interoperability allows for the creation of composable solutions by building on top of existing protocols and combining them. Such primitives include repackaging liquid staking tokens, secondary distribution based on staking revenue, and different restaking scenarios. Projects must adopt and leverage such innovations to drive progress and remain competitive and relevant as the DeFi ecosystem continuously grows.<\/span>","<span data-v-f87c67ca=\"\">In line with this, we have developed vETH2.0 as a dual-chain native asset for both the Ethereum and Bifrost chains. The seamless transfer of vETH2.0 between the EVM and Substrate ecosystem is made possible by <\/span><a href=\"https:\/\/www.theblock.co\/post\/223428\/bifrost-finance-the-gateway-to-cross-chain-liquid-staking-on-polkadot\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">the cross-chain bridging infrastructure<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">Bifrost's unique position, recent launches and commitment to staying at the forefront of emerging trends make it well-suited to thrive and lead the way in this composable and interoperable DeFi future we are approaching.<\/span>","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Bifrost<\/i><i data-v-f87c67ca=\"\">&nbsp;and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"70%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"42%","content":"PERCENT"},{"type":"Shanghai Upgrade","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"},{"type":"December 2020","content":"DATE"},{"type":"Bifrost Native Coin","content":"ORGANIZATION"},{"type":"$70 Million","content":"MONEY"},{"type":"16%","content":"PERCENT"},{"type":"September 2022","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Bifrost Finance","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Shanghai","content":"LOCATION"},{"type":"EVM","content":"ORGANIZATION"},{"type":"Bifrost","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}