{"summary":"Riot Blockchain reported recently that in July it made $9.5 million worth of &quot;power credits&quot; in Texas. What exactly are these power credits?","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/164376\/why-bitcoin-miners-in-texas-are-getting-paid-not-to-mine-bitcoin","publishDate":"2022-08-18T18:54:04","id":5190,"type":null,"title":"Why bitcoin miners in Texas are getting paid not to mine bitcoin","category":["BITCOIN"],"content":["<span data-v-f87c67ca=\"\">As bitcoin miners flock to Texas, one of the toughest things they’ve had to contend with is the heat. In July, however, mining firm Riot Blockchain showed how it’s possible to cash in on it — by not mining bitcoin.<\/span>","<span data-v-f87c67ca=\"\">The company reported in its July monthly report that due to the heat it cut power a number of times in that month and that the shutdowns were a big reason behind a 28% drop in bitcoin mined compared with June. <\/span>","<span data-v-f87c67ca=\"\">But it also announced that it received $9.5 million in “power credits” and other benefits from the grid operator or a utility company for shutting down during periods of high demand that resulted from a heatwave. <\/span><span data-v-f87c67ca=\"\">The sum “significantly outweighed” the decrease in bitcoin production, according to CEO Jason Les.<\/span>","<span data-v-f87c67ca=\"\">That would suggest that shutting down operations when the grid is stressed could be a lucrative business opportunity, and not just for Riot. But what exactly are these power credits and how does a bitcoin miner qualify for them?&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Texas has its own electrical grid, which is operated by The Electric Reliability Council of Texas (ERCOT). ERCOT acts as sort of an​​ air traffic controller, balancing supply and demand. One way it can do that is by asking large power users to turn off (or curtail) their power whenever the grid conditions are tight. It does this via a number of so-called demand response programs — some of which come with financial incentives.<\/span>","<span data-v-f87c67ca=\"\">As Texas has grown into a bitcoin mining hub, advocates have argued that the ability to quickly stop operating — unlike other power-hungry facilities like factories that may need more time to shut down — <a href=\"https:\/\/www.google.com\/url?q=https:\/\/www.theblockcrypto.com\/news%2B\/145817\/bitcoiners-take-it-as-a-given-that-a-mining-rush-will-improve-texass-grid-not-everyone-is-convinced&amp;sa=D&amp;source=docs&amp;ust=1660863230489855&amp;usg=AOvVaw1dnfBDdcak3vgm8BGatUD2\" data-v-f87c67ca=\"\">will make mining firms valuable users of the grid<\/a>. That claim was tested in July.<\/span>","<span data-v-f87c67ca=\"\">As the heat reached extreme levels, ERCOT made a public <\/span><a href=\"https:\/\/www.theblock.co\/post\/156974\/as-texas-grid-operator-calls-for-energy-conservation-some-bitcoin-miners-paused-operations\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">appeal <\/span><\/a><span data-v-f87c67ca=\"\">to Texans and Texas businesses to cut down on their power use as demand for air conditioning and cooling pushed the grid’s capacity to its limit.<\/span>","<span data-v-f87c67ca=\"\">There are no policies requiring firms to curtail their power use during times of high demand. Riot’s payday, however, suggests that financial incentives may be sufficient.<\/span>","<span data-v-f87c67ca=\"\">The details about how these demand response incentives work are complicated. But there are three sources of payments by ERCOT for power curtailments, an ERCOT spokesperson said in an email.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">First, there are \"non-controllable load resource programs.\" Essentially, these programs pay power users a certain amount simply for the option of turning them off during emergency situations.<\/span>","<span data-v-f87c67ca=\"\">“They may not ever get turned off, but they'll still get paid to be available to be turned off,” explained Joshua Rhodes, a researcher with the Webber Energy Group at the University of Texas at Austin. “It’s load-side insurance.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">ERCOT said it did not make any payments in July under this program.<\/span>","<span data-v-f87c67ca=\"\">Then there are “controllable load resource programs,” which treat participating power customers like a “negative power plant,” Rhodes said. <\/span><span data-v-f87c67ca=\"\">“Just like a power plant gets paid for producing electricity, a controllable load resource gets paid for not consuming.” <\/span><span data-v-f87c67ca=\"\">The program is tied to power price signals and in order for loads to be responsive, they need advanced technology like automated software triggers that can cut power when prices reach a certain threshold.<\/span>","<span data-v-f87c67ca=\"\">Finally, there’s something called an \"emergency response\" service, in which certain power users and generators make themselves available for shutdown or deployment in an electric grid emergency. \"Unverified crypto mining loads\" totaling 1,000 megawatts in capacity curtailed power for two-and-a-half hours on July 13 under this program, ERCOT said.<\/span>","<span data-v-f87c67ca=\"\">There is a funding cap set by the regulators, which determines how often this measure can be used. It <\/span><a href=\"https:\/\/www.law360.com\/articles\/1511872\/heat-wave-underscores-urgency-of-texas-grid-policy-reform\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">was expanded in July<\/span><\/a><span data-v-f87c67ca=\"\"> as the heat pushed the grid to the limit.<\/span>","In addition to these power curtailment programs, miners also try to save money by participating in a program called Four Coincident Peak (4CP), through which they can save on transmission costs from their utility providers in the following year if they are powered down during four specific 15-minute periods in the summer months when the grid reaches peak capacity. These 15-minute periods are determined by ERCOT after the fact.","The Block has asked Riot to clarify where their July \"power credits\" came from but has not received a response. ERCOT, for its part, said that it “does not comment on specific loads or plants.”","<span data-v-f87c67ca=\"\">“In the future, we may very well have the ability to in fact have a mutually beneficial economic relationship with the grid operator,” Levitt said.<\/span>","<span data-v-f87c67ca=\"\">Argo Blockchain did not disclose how much power it curtailed in Texas in its most recent monthly operational update. However, it claimed that miners in Texas had collectively reduced usage by more than 1,000 megawatts at peak demand.<\/span>","<span data-v-f87c67ca=\"\">“We could talk about power in Texas for hours and hours,” the company’s CEO Peter Wall said at the Bitcoin Mining Council’s second quarter briefing. “It’s a very complicated grid. It’s a fantastic place for bitcoin miners, that’s why there are so many miners that have moved there recently.”<\/span>","<span data-v-f87c67ca=\"\">Finally, Marathon said during its earnings call that it renegotiated its hosting agreement with Compute North so that it could participate in curtailment programs with ERCOT.<\/span>","<span data-v-f87c67ca=\"\">\"Some of our peers in the industry have recently demonstrated there are times when it can be more profitable to sell electricity back to the grid than it is to mine Bitcoin,\" Marathon CEO Fred Thiel noted.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"ERCOT","content":"ORGANIZATION"},{"type":"Bitcoin Mining Council’s","content":"ORGANIZATION"},{"type":"Marathon","content":"ORGANIZATION"},{"type":"Austin","content":"LOCATION"},{"type":"Levitt","content":"PERSON"},{"type":"Peter Wall","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"Rhodes","content":"PERSON"},{"type":"Riot Blockchain","content":"PERSON"},{"type":"Argo Blockchain","content":"PERSON"},{"type":"second quarter","content":"DATE"},{"type":"Compute North","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Webber Energy Group","content":"ORGANIZATION"},{"type":"July 13","content":"DATE"},{"type":"Jason Les","content":"PERSON"},{"type":"Fred Thiel","content":"PERSON"},{"type":"$9.5 million","content":"MONEY"},{"type":"Texas","content":"LOCATION"},{"type":"The Electric Reliability Council of Texas (ERCOT)","content":"ORGANIZATION"},{"type":"Joshua Rhodes","content":"PERSON"},{"type":"28%","content":"PERCENT"},{"type":"June","content":"DATE"},{"type":"the University of Texas","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}