{"summary":"Axelar unveiled the Interchain Token Service (ITS), aiming to improve interoperability of tokens across Ethereum-compatible chains.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240274\/axelar-launches-interchain-token-service-aimed-to-boost-asset-interoperability","publishDate":"2023-07-18T09:00:57","id":5191,"type":null,"title":"Axelar launches ‘Interchain Token Service’ to boost asset interoperability","category":["THE BLOCK"],"content":["Blockchain project Axelar has unveiled its Interchain Token Service (ITS), a product aimed at enhancing the interoperability of ERC-20 tokens across all Ethereum-compatible chains.","The service specifically focuses on the interoperability of ERC-20 tokens across all EVM-compatible ecosystems. These tokens will be generated on a 1:1 ratio and managed with the help of Axelar’s native computing environment, the Axelar Virtual Machine.","Sushi, a decentralized exchange (DEX), is one of the first to adopt the “interchain tokens” via the service. Sushi plans to utilize the ITS to facilitate seamless interaction of its native SUSHI token across multiple chains, its team said. The initial deployment will ensure interoperability of SUSHI across Arbitrum, Ethereum, Optimism, and Polygon, allowing the SushiSwap decentralized exchange to manage its multichain deployments more efficiently through the Axelar network.","“Axelar’s Interchain Token Service unlocks a more seamless, interchain experience for Sushi users,” said Sushi’s head chef, Jared Grey. “Currently, there are many bridged versions of SUSHI that lack fungibility and carry bridge risk. With Interchain Tokens, Sushi can achieve true cross-chain interoperability, simply and securely.”","The traditional approach to achieving cross-chain transfers for Web3 applications has usually relied on bridged token versions, which may be exposed to inherent security risks and compatibility issues. Sergey Gorbunov, co-founder of Axelar, claimed Axelar’s interoperability solution addresses these challenges with specialized smart contracts and a software development kit, enabling developers to manage interchain tokens.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Interchain Token Service","content":"ORGANIZATION"},{"type":"Axelar Virtual Machine","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Arbitrum","content":"LOCATION"},{"type":"Sergey Gorbunov","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Axelar’s Interchain Token Service","content":"ORGANIZATION"},{"type":"Jared Grey","content":"PERSON"},{"type":"20","content":"DATE"},{"type":"Interchain Tokens","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}