{"summary":"Stephan Tual, who helped design the first major DAO, says he feels misaligned with the current state of Ethereum.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/164672\/architect-of-the-dao-splits-from-ethereum-circus-after-nine-years","publishDate":"2022-08-20T13:08:53","id":5193,"type":null,"title":"Architect of The DAO splits from Ethereum ‘circus’ after nine years","category":["ETHEREUM"],"content":["Stephan Tual, one of the main designers behind the structure of The DAO, has left the Ethereum community after nine years — citing a disconnect between what he wanted to build and what he feels the project has become.","“I cannot, in good conscience, continue to act like 'all is well' in Web3,” he wrote in an email to the Ethereum London meetup, announcing that he is stepping down from running the meetup and leaving the Ethereum community more broadly.","Tual provided more details in a separate <a href=\"https:\/\/www.reddit.com\/user\/Ursium\/comments\/wp561e\/explaining_the_dao_one_last_time_an_open_letter\/\" data-v-f87c67ca=\"\">Reddit post<\/a>. This post addressed a set of perceived criticisms and fraudulent claims around The DAO and software company Slock.it’s part in it. It also went further into his disconnect with the current state of Ethereum.","“As of August 15th, 2022, the 'blockchain' (or should I use the hedge-fund coined terminology 'distributed ledger'?) has turned into a circus of centralized NFTs, endless Ponzi schemes, illegal securities or turncoat sycophants pledging loyalty to the nearest regulator. I do not recognize myself in that space, not even one bit,” he said.","Tual added that he now intends to focus on other technologies including mesh networks and software-defined radio communication.&nbsp;","In January 2014, Tual joined the Ethereum project as chief communications officer. He worked there until September 2015, when he left to create Slock.it, which created a framework for building DAOs in 2016. That year, a large community of developers took the framework, in coordination with Slock.it, and used it to launch what became known as The DAO.","The DAO was the first major attempt at a truly decentralized autonomous organization focused on crowdfunding. It attracted a lot of investment — up to 15% of all ether (ETH) in circulation at the time — before a bug in its code was exploited. The issue was so severe that the Ethereum blockchain ended up forking, resulting in the Ethereum we know today and Ethereum Classic.","Following the collapse of The DAO, Tual faded from the limelight but remained active in the Ethereum community. He left Slock.it in 2017 to create a crypto-focused incubator and continued running Ethereum events in London.","As for who exploited the bug in The DAO, Tual didn’t provide any details, but noted that, “<i data-v-f87c67ca=\"\">the truth WILL out,<\/i> eventually.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ethereum London","content":"LOCATION"},{"type":"Reddit","content":"LOCATION"},{"type":"August 15th, 2022","content":"DATE"},{"type":"2016","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"The DAO","content":"ORGANIZATION"},{"type":"January 2014","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"London","content":"LOCATION"},{"type":"Stephan Tual","content":"PERSON"},{"type":"September 2015","content":"DATE"},{"type":"Ethereum Classic","content":"ORGANIZATION"}],"hashtag":["ETHEREUM","SANCTIONS"],"authors":["Tim Copeland","The Block"]}