{"summary":"JPMorgan&#x27;s blockchain unit Onyx is in hyper-growth mode.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/111833\/jpmorgan-is-on-a-blockchain-hiring-spree","publishDate":"2021-07-19T11:03:22","id":5194,"type":null,"title":"JPMorgan is on a blockchain hiring spree","category":["LAYER 1S"],"content":["JPMorgan is on a hiring spree for its blockchain unit, seeking to fill positions across audit, engineering and marketing, several LinkedIn postings reveal.&nbsp;","The bank — which has been active in the blockchain space for several years — <a href=\"https:\/\/www.cnbc.com\/2020\/10\/27\/jpmorgan-creates-new-unit-for-blockchain-projects-as-it-says-the-technology-is-close-to-making-money.html\" data-v-f87c67ca=\"\">announced<\/a> in October 2020 that it would bring all of its blockchain-related products and services under a new business unit, dubbed Onyx. Those services including Liink, a blockchain network of hundreds of financial-services firms and corporations, as well as its Coin Systems business, as per its <a href=\"https:\/\/www.jpmorgan.com\/onyx\/offerings.htm\" data-v-f87c67ca=\"\">website<\/a>.&nbsp;","As for the job ads, JPMorgan has plastered dozens of new postings on LinkedIn, including engineering-related roles. One <a href=\"https:\/\/www.linkedin.com\/jobs\/search\/?currentJobId=2637692117&amp;keywords=jpmorgan%20blockchain\" data-v-f87c67ca=\"\">role<\/a> for a blockchain platform software engineer is looking for someone with a background in proof of stake, Ethereum, and bitcoin and would create a \"forum for innovation with the blockchain technology community that drives thought leadership around the digital architecture roadmap and strategy.\"","There's also evidence the firm wants a stronger external presence for the blockchain work being worked on at the firm.","\"This individual will drive the Liink marketing strategy by developing a thorough understanding of our strategic objectives, positioning, brand voice, and offerings so that you can create consistent and engaging content across multiple touchpoints,\" the ad <a href=\"https:\/\/www.linkedin.com\/jobs\/search\/?currentJobId=2642729055&amp;keywords=jpmorgan%20blockchain\" data-v-f87c67ca=\"\">reads<\/a>. The person hired would be tasked with creating marketing strategies that \"spark engagement — both internally and externally.\"","The bank added that they want the person to have a sense of humor that is a touch irreverent.","JPMorgan has already made quite a number of big-ticket marketing hires for Onyx. At the beginning of the year, Ariana Gianacopoulos — formerly VP of global commercial marketing at Conde Nast — joined the firm as a marketing director.","Ray Beharry — previously a marketing executive for IBM's cloud services division — also joined at the beginning of the year as head of marketing at Onyx, as per his LinkedIn.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"October 2020","content":"DATE"},{"type":"Onyx","content":"ORGANIZATION"},{"type":"IBM","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Ray Beharry","content":"PERSON"},{"type":"Liink","content":"PERSON"},{"type":"Ariana Gianacopoulos","content":"ORGANIZATION"},{"type":"Conde Nast —","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["JPMORGAN"],"authors":["Frank Chaparro","The Block"]}