{"summary":"Polygon published a blog post earlier today, alleging that Matter Labs’ Boojum system used part of the code from its Plonky2 without proper attribution.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/243159\/matter-labs-ceo-denies-polygons-code-attribution-accusations","publishDate":"2023-08-04T03:55:00","id":5199,"type":null,"title":"Matter Labs CEO denies Polygon’s code attribution accusations","category":["THE BLOCK"],"content":["<span data-v-f87c67ca=\"\">Alex Gluchowski, co-founder and chief executive of Matter Labs, the company behind zkSync, said Friday morning Asia time that allegations from Polygon about it partially copying the latter’s open-source code without proper attribution “could not be further from the truth.”<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Polygon alleged that Matter Labs’s recent release, <a href=\"https:\/\/www.theblock.co\/post\/239880\/zksync-launches-new-proof-system-called-boojum-for-era-mainnet\" data-v-f87c67ca=\"\">Boojum,<\/a>&nbsp;incorporated some code from the <a href=\"https:\/\/polygon.technology\/blog\/introducing-plonky2\" data-v-f87c67ca=\"\">Plonky2<\/a> , a zero knowledge technology developed by Polygon. Although the Plonky2 system is open source, Matter Labs did not provide accurate attribution, Polygon asserted. This code was used in Boojum, a zero-knowledge proof system, which is deployed on the zkSync Era mainnet.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">“Today’s accusations are unfounded, misleading, and extremely disappointing coming from a team I highly respect,” Gluchowski said in a post on social media X, also known as Twitter. He <a href=\"https:\/\/twitter.com\/gluk64\/status\/1687189416832372736\" data-v-f87c67ca=\"\">claimed<\/a> earlier that the team gave credit to Polygon in the first line of the Boojum <a href=\"https:\/\/github.com\/matter-labs\/era-boojum\/blob\/8b4955f1c24d4d35db7e4ed79aa9b107260ebc8c\/src\/field\/goldilocks\/mod.rs#L1\" data-v-f87c67ca=\"\">module<\/a> .<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Earlier today, Polygon published a <a href=\"https:\/\/mirror.xyz\/0x70DF15b0208eFCeFaA541Da9A0ED6C4A884554Fc\/gNi8coqXjd1ybFsQBAG7QARUkPHZECu7ihIRkpiVx2Y\" data-v-f87c67ca=\"\">blog post<\/a> titled “Protect the Open Source Ethos,” alleging that “copy-pasting source code without attribution and making misleading claims about the original work is against the open source ethos and hurts the ecosystem.” Polygon added that while anyone is free to modify open source code, they must give credit to its original creators.<\/span>","<span data-v-f87c67ca=\"\">In response to the allegations, Gluchowski wrote: “The reader of the Polygon Zero post is left with the impression that Boojum is largely using Plonky2 code with little innovation, and that we allegedly re-used this code without providing any attribution to the original work. These claims could not be further from the truth.”<\/span>","<span data-v-f87c67ca=\"\">However, Polygon argued that the code was included “without the original copyrights or clear attribution to the original authors.” It also attached in the post a number of <a href=\"https:\/\/twitter.com\/0xPolygonZero\/status\/1687153312120946688\" data-v-f87c67ca=\"\">screenshots<\/a> showing part of the code used in both systems.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">To clarify, Gluchowski said that only about 5% of the Boojum code is based on the code of Plonky2, claiming that both Plonky2 and Boojum are implementations of the RedShift construction — a project introduced by Matter Labs three years prior to the release of the Plonky2 paper.<\/span>","<span data-v-f87c67ca=\"\">“The Plonky2 team never gave us credit (although they referred to RedShift in their paper). We never bothered,” Gluchowski added.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Open Source is all about genuine cooperation. If the Polygon Zero team wanted additional credit, the easiest way would have been to submit a pull request which we would have happily accepted,” he continued.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Matter Labs","content":"ORGANIZATION"},{"type":"Boojum","content":"LOCATION"},{"type":"morning","content":"TIME"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Gluchowski","content":"PERSON"},{"type":"Alex Gluchowski","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Asia","content":"LOCATION"}],"hashtag":["POLYGON","ZKSYNC"],"authors":["Timmy Shen","The Block"]}