{"summary":"Babylon will also help dual-stake Nomic&#x27;s security by using staked Bitcoin and staked NOM, Nomic&#x27;s native token.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287444\/nomic-bitcoin-liquid-staking-token-babylon","publishDate":"2024-04-10T01:01:05","id":52,"type":null,"title":"Nomic launches BTC liquid staking token via a partnership with Babylon","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">The team behind Nomic, a Layer 1 blockchain providing a decentralized <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +1.27%\n    <\/span><\/a> <!----><\/span><\/span> bridge, launched a bitcoin liquid staking token (LST) called stBTC.&nbsp;<\/span>","Nomic, which has the native token NOM, entered a partnership with bitcoin staking protocol Babylon to launch the LST. Babylon will also help dual-stake Nomic's security by using staked Bitcoin and staked NOM, according to a release from <a href=\"https:\/\/www.nomic.io\/\" data-v-f87c67ca=\"\">Nomic<\/a> developers.&nbsp;","Individuals can use Babylon to stake bitcoin to Nomic, rewarding the user with NOM and nBTC that can redeemed for bitcoin. The cryptocurrency nBTC reflects 1:1 ownership of bitcoin in a token compatible with the Inter-Blockchain Communication Protocol (IBC). This standardized protocol allows many blockchains to transact with each other. Thus, users can use nBTC on the decentralized Cosmos exchange Osmosis, the Cosmos Hub and other DeFi protocols.&nbsp;","The Nomic team intends to have a funding round later this year. stBTC is currently on a testnet but will go into mainnet once Babylon does the same, a Nomic spokesperson told The Block. The blockchain tech firm Turbofish is Nomic's founder and contributor.","“Nomic and Babylon provide two important primitives to Bitcoin: decentralized custody and staking,” said Turbofish CEO Matt Bell in a statement. “By pairing the two, their impact is magnified, making a more practical solution for the average Bitcoin holder to earn yield through staking. With innovations like stBTC emerging, Bitcoin DeFi now has the potential to compete with the trading volumes and total value locked of Ethereum DeFi.”","Babylon lets BTC holders earn rewards by staking their assets on proof-of-stake blockchains. The platform's developers <a href=\"https:\/\/www.theblock.co\/post\/279515\/bitcoin-babylon-testnet-nft-passes\" data-v-f87c67ca=\"\">launched<\/a> its first testnet on Feb. 28 this year.&nbsp;","Babylon raised <a href=\"https:\/\/www.theblock.co\/post\/266518\/bitcoin-staking-babylon-series-a\" data-v-f87c67ca=\"\">$18 million<\/a> in a Series A funding round co-led by Polychain Capital and Hack VC, with further support from Framework Ventures, Polygon Ventures, Castle Island Ventures, OKX Ventures and Symbolic Capital in early December 2023.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nomic","content":"ORGANIZATION"},{"type":"NOM","content":"ORGANIZATION"},{"type":"Polygon Ventures","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Inter-Blockchain Communication Protocol (IBC","content":"ORGANIZATION"},{"type":"Castle Island Ventures","content":"ORGANIZATION"},{"type":"+1.27%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$18 million","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Bitcoin DeFi","content":"ORGANIZATION"},{"type":"Feb. 28 this year","content":"DATE"},{"type":"OKX Ventures","content":"ORGANIZATION"},{"type":"Framework Ventures","content":"ORGANIZATION"},{"type":"Matt Bell","content":"PERSON"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"Cosmos Hub","content":"ORGANIZATION"},{"type":"December 2023","content":"DATE"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["BITCOIN","COSMOS"],"authors":["MK Manoylov","The Block"]}