{"summary":"Coinbase H1 2020 institutional review reveals Coinbase’s client base stands at 35 million across its institutional and retail business arms.\nIt also shows they are expanding their trading capabilities and want to help fintechs dive into crypto.","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/72886\/coinbase-35-million-clients","publishDate":"2020-07-24T14:50:13","id":520,"type":null,"title":"Coinbase&#x27;s latest Institutional Review Reveals 35 million Client Base","category":["Startups"],"content":["A review of the cryptocurrency landscape by Coinbase's institutional team has revealed new details about the size of its client base and the exchange's future plans.&nbsp;","According to the <a href=\"https:\/\/static-assets.coinbase.com\/custody\/Coinbase-Institutional-Crypto-H1-2020-Review.pdf\" data-v-f87c67ca=\"\">mid-year review<\/a>, Coinbase has grown its client base to more than 35 million retail and institutional clients — a figure that's up from 30 million at the beginning of the year. The growth of the firm's client base may not come to a surprise to readers of The Block. As Yogita Khatri previously <a href=\"https:\/\/www.theblockcrypto.com\/daily\/60850\/crypto-exchanges-report-uptick-in-user-registrations-trade-volumes-as-coronavirus-pandemic-batters-the-global-economy\" data-v-f87c67ca=\"\">reported<\/a>, the coronavirus pandemic pushed more retail traders into equity and crypto markets.","In addition to further participation among retail traders, 2020 was an important year from an institutional perspective, according to Coinbase. Here's Coinbase (emphasis is our own):","To further capitalize on developments in the institutional crypto market, Coinbase said it would move to enhance a number of its business lines. In trading, for instance, Coinbase said that it would soon start offering clients the ability to trade across several pools of liquidity vis-a-vis <a href=\"https:\/\/www.theblockcrypto.com\/post\/66479\/coinbase-tagomi-acquisition\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">its acquisition of crypto broker Tagomi<\/a>.&nbsp;","\"In H1 2020, the digital asset market continued its evolution towards multi-venue best execution, in which clients expect to route trades through brokerages that aggregate liquidity and offer advanced execution algorithms. With our recently announced acquisition of Tagomi, we've greatly accelerated this transition; Coinbase will integrate multi-venue execution going forward,\" the firm said.","The firm also plans to expand its lending capabilities by \"scaling our credit programs further across both fiat and digital assets in response to client demand.\"","The report also highlighted the entrance of new fintech players in the digital asset space. Indeed, the market has been awaiting the launch of PayPal's crypto service, which is reportedly in the works via a partnership with crypto firm Paxos.&nbsp;","Paxos announced earlier this month the launch of Paxos Crypto Brokerage, which would help fintechs launch crypto services by white-labeling its technology.&nbsp;","It appears Coinbase wants in on the action as well.&nbsp;","\"We anticipate that the combination of Coinbase’s rapidly advancing crypto-as-a-service capabilities, which make adding crypto easier for fiat-native businesses, as well as visible success stories from public companies that have embraced digital assets, will continue to drive new entrants from the fintech, brokerage, and banking sectors,\" Coinbase said. \"We believe that eventually, all modern financial services businesses will want to provide their clients with digital assets as the asset class continues to grow and use cases broaden with advancements in crypto borrowing, lending, payments, staking, governance, remittances, derivatives, insurance, asset management, and more.\""],"hashtag":["LENDING"]}