{"summary":"There is one problem DeFi can’t seem to shake: the user experience (UX). And while it’s been highly discussed, barriers like excessive user actions and overly complex platform interfaces are still a problem for those unfamiliar with the space.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/139096\/synfutures-upcoming-v2-aims-to-address-defis-ux-problem","publishDate":"2022-03-24T08:53:04","id":5202,"type":null,"title":"SynFutures’ Upcoming V2 Aims to Address DeFi’s UX Problem","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">There is one problem DeFi can’t seem to shake: the user experience (UX). And while it’s been highly discussed, barriers like excessive user actions and overly complex platform interfaces are still a problem for those unfamiliar with the space. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">One DeFi derivatives protocol is on a mission to solve the UX problem to help bring new users to the space. With a goal to make derivatives trading accessible to the masses, <\/span><a href=\"https:\/\/bit.ly\/3wmGVz3\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">SynFutures<\/span><\/a><span data-v-f87c67ca=\"\"> is already making headway with the user experience, especially with its upcoming V2 launch.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">The Road to Mainstream Adoption<\/b>","<span data-v-f87c67ca=\"\">DeFi has been thriving well over two years since the sector entered its eponymous era of growth “DeFi Summer” in 2020. While the total value locked in DeFi protocols has <\/span><a href=\"https:\/\/defillama.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">slipped since December of last year<\/span><\/a><span data-v-f87c67ca=\"\">, the sector doesn’t show many signs of slowing down, with new protocols and investments seemingly announced on a weekly basis.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">But can the excitement last long enough to see mainstream adoption?<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">“The momentum is strong in DeFi right now, but the barriers to entry are still too high. There are a variety of factors, but UX is arguably the biggest one,” said Rachel Lin, co-founder and CEO of SynFutures. “These obstacles impact most DeFi protocols, but they’re even more detrimental for products that provide more complex offerings, such as derivatives products.”<\/span>","<span data-v-f87c67ca=\"\">The complexity of trading decentralized derivatives may be one reason why the market hasn’t yet reached its stride. While the derivatives market in both traditional financial markets and centralized crypto exchanges are multiples larger than their spot counterparts, the opposite is true in decentralized markets. The lack of a seamless, easy-to-navigate UX across decentralized derivatives offerings is hindering progress. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/span>","<b data-v-f87c67ca=\"\">Improving the Derivatives Trading Experience&nbsp;<\/b>","<span data-v-f87c67ca=\"\">With the launch of its V1 public beta last year, SynFutures set the stage for a radically improved derivatives trading experience, proving that a DeFi derivatives protocol can be as permissionless and easy to use as spot DEXs. SynFutures adapted the Uniswap V3 model for the derivatives market, allowing users to list and trade futures on any asset with just a few clicks. Enabling users to provide liquidity with a single token further streamlined the listing process by removing the need to provide liquidity to both assets in the pair. Furthermore, the interface is simple and intuitive, making it easy for new users to explore derivatives.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While Polygon is its <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/138224\/synfutures-surfaces-as-leading-derivatives-exchange-on-polygon\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">most active chain<\/span><\/a><span data-v-f87c67ca=\"\">, SynFutures employs a multi-chain strategy, having already deployed on Ethereum, Arbitrum, and BNB Chain, with plans to expand to additional&nbsp; EVM and non-EVM chains by the end of the year.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The platform’s approach to UX has attracted more than 56,000 users and led to billions in cumulative trading volume. Its focus on creating a user-friendly platform has also helped attract an increasingly active retail user base. While typically a few addresses account for the majority of trading volume across decentralized derivatives platforms, SynFutures’ top five traders account for less than 5 percent of the DEX’s total trading volume, signaling its traction with retail users.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Launching SynFutures V2 and Beyond<\/b><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">With the upcoming V2 launch, SynFutures is introducing an even easier-to-use interface to improve the user experience, as well as a streamlined experience for liquidity providers. SynFutures V2 will also introduce new derivatives products beyond futures, and other developments, including a Tinder-like NFT derivatives trading product and a bevy of other trading products will be released throughout the year.<\/span>","Caption: A mock-up of SynFutures’ upcoming V2 closed alpha","<span data-v-f87c67ca=\"\">While there are still a lot of other challenges to be solved in decentralized derivatives and the greater DeFi market, SynFutures is up for the challenge and ready to meet the evolving demands of the market.<\/span>","<span data-v-f87c67ca=\"\">“SynFutures V1 brought simplified trading to decentralized derivatives; already we’re seeing the results of our user-focused approach with the number of traders and volume already on our platform,” said Lin. “Like with all innovations, we realize there’s room for improvement, so we look forward to introducing our new and improved platform to users in the near future.”<\/span>","<span data-v-f87c67ca=\"\">SynFutures is expected to release its V2 closed alpha in early Q2 2022. Sign up for early access here: <\/span><a href=\"https:\/\/bit.ly\/3tzbDD4\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/bit.ly\/3tzbDD4<\/span><\/a><span data-v-f87c67ca=\"\">. <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lin","content":"PERSON"},{"type":"SynFutures","content":"ORGANIZATION"},{"type":"December of last year","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Derivatives Trading Experience","content":"ORGANIZATION"},{"type":"Arbitrum","content":"LOCATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"5 percent","content":"PERCENT"},{"type":"2020","content":"DATE"},{"type":"Rachel Lin","content":"PERSON"}],"hashtag":[],"authors":["Sponsored","The Block"]}