{"summary":"The Basel Committee on Banking Supervision, which includes banking regulators from the U.S., U.K., Japan, and several other countries, has called for","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/50549\/basel-committee-calls-for-prudential-rules-for-crypto-as-they-pose-risks-to-banks","publishDate":"2019-12-14T10:15:11","id":5211,"type":null,"title":"Basel Committee calls for &#x27;prudential&#x27; rules for crypto as they pose risks to banks","category":["REGULATION"],"content":["The Basel Committee on Banking Supervision, which includes banking regulators from the U.S., U.K., Japan, and several other countries, has called for \"prudential\" regulatory treatment of cryptocurrencies and stablecoins.&nbsp;","The committee, a unit of the Bank for International Settlements, has <a href=\"https:\/\/www.bis.org\/bcbs\/publ\/d490.pdf\" data-v-f87c67ca=\"\">published<\/a> a discussion paper, saying that the growth of cryptocurrencies and related services could pose risks to financial stability and banks, and therefore, a “conservative prudential” treatment to cryptocurrency exposures should be applied.","“If banks are authorized, and decide, to acquire crypto-assets or provide related services, the Committee is of the view that they should apply a conservative prudential treatment to such exposures, especially for high-risk crypto-assets,” it said.","Exposure to cryptocurrencies could be direct (direct holdings) or indirect (e.g. derivatives) and accordingly, capital and liquidity requirements rules could apply. For instance, the committee has proposed that crypto-assets should not be eligible to serve as financial collateral for the purpose of the credit risk mitigation framework.","It has also recommended that bank exposures to crypto-assets should be subject to a “full deduction” from Common Equity Tier 1 capital, which mainly <a href=\"https:\/\/www.investopedia.com\/terms\/c\/common-equity-tier-1-cet1.asp\" data-v-f87c67ca=\"\">consists of<\/a> common stock held by a bank. “This treatment reflects the high degree of uncertainty about the positive realizable value of crypto-assets in times of stress,” it added.","While banks’ exposures to crypto-assets are currently “limited,” the absolute size of the market is “meaningful,” said the committee, adding that a “robust” regulatory framework is needed for the sector.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">Warning&nbsp;<\/strong>","In March, the committee <a href=\"https:\/\/www.theblockcrypto.com\/linked\/15616\/basel-committee-warns-against-crypto-assets\" data-v-f87c67ca=\"\">warned<\/a> banks about risks associated with cryptocurrencies, including liquidity, credit and money laundering risks. “The continued growth of crypto-asset trading platforms and new financial products related to crypto-assets has the potential to raise financial stability concerns and increase risks faced by banks,” it said at the time.","Reiterating its point, the committee said that if a crypto-asset and a \"traditional\" asset are equivalent in their economic functions and the risks they pose, they should not be treated differently for prudential purposes. \"There is the potential for certain types of crypto-assets to become systemically important. The design of the prudential treatment of crypto-assets should therefore be simple and flexible in nature,\" said the committee.","If the committee decides to go ahead with any specified treatment, it would constitute a minimum standard for internationally active banks. The discussion paper is open for comments until March 13, 2020 to all stakeholders, including academics, banks, central banks, finance ministries, market participants and the general public, among others.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"prudential","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Basel Committee on Banking Supervision","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"U.K.","content":"LOCATION"},{"type":"Bank for International Settlements","content":"ORGANIZATION"},{"type":"Committee","content":"ORGANIZATION"},{"type":"March 13, 2020","content":"DATE"},{"type":"Japan","content":"LOCATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}