{"summary":"Crypto exchange CoinList experienced some downtime on Wednesday after investors rushed to participate in its NEAR Protocol token sale. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/74872\/coinlist-suffers-technical-problems-during-rush-to-invest-in-near-protocols-token-sale","publishDate":"2020-08-13T16:58:51","id":5212,"type":null,"title":"CoinList suffers technical problems during rush to invest in NEAR Protocol&#x27;s token sale","category":["STARTUPS"],"content":["Crypto exchange CoinList ran into technical headwinds on Wednesday as investors rushed to participate in the NEAR Protocol token sale.&nbsp;","This was the exchange's second attempt at hosting a NEAR token sale after having to postpone following a traffic overload earlier this week. Co-host of the <a href=\"https:\/\/www.zeroknowledge.fm\/\" data-v-f87c67ca=\"\">Zero Knowledge Podcast<\/a> Anna Rose <a href=\"https:\/\/twitter.com\/annarrose\/status\/1293843139069906944?s=21\" data-v-f87c67ca=\"\">tweeted<\/a> that CoinList had a \"meltdown\" while hosting the sale, giving users a 524 error display page.&nbsp;","Despite the exchange's traffic issues, the NEAR token sold out of 100 million tokens — worth nearly $30 million — in less than three hours. However, some potential investors were not able to participate in the sale due to the technical issues.","CoinList issued a <a href=\"https:\/\/twitter.com\/CoinList\/status\/1293712871356997635\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">statement<\/a> on its Twitter yesterday evening, apologizing for its technical issues.&nbsp;","\"The NEAR token sale obviously did not go as planned for many of you who wanted to participate. To the NEAR community, we are truly sorry. We're working with the NEAR team to find a way to make things right for you,\" the statement said.&nbsp;","NEAR also issued a <a href=\"https:\/\/twitter.com\/NEARProtocol\/status\/1293650138385260547\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">statement<\/a> yesterday, saying because of \"regulatory considerations,\" they were unable to discuss the sale publicly.&nbsp;","\"We had to watch from the sidelines while questions went unanswered,\" the statement said. \"Nothing could be more frustrating for our team.\"","CoinList co-founder Andy Bromberg told The Block the exchange is completing a full technical audit to understand and fix the issues, as well as to ensure the sale was fair to participants. Bromberg said the exchange is putting together a post-mortem on the results.","\"To give a sense of the demand, the sale was oversubscribed by roughly 4x — with more than $150MM in allocation requests, relative to a cap on the sale of around $30MM. There were over 9800 registrants, and ultimately only 1500 were able to secure an allocation. This low ratio, however, wasn't because of the site issues — it was because there was simply more demand than supply,\" Bromberg said.&nbsp;","Bromberg said CoinList and the NEAR team recognize that because of the high demand, thousands of users were unable to participate in the sale, and said the teams are working on ways to remedy the situation.&nbsp;","\"These are incredible numbers, and speak to the passion of the NEAR community and the strength of the NEAR project. And the interest in this sale also points to the thoughtful structure NEAR put in place to ensure community members and contributors had access at a similar valuation to their last private round,\" Bromberg said.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"earlier this week","content":"DATE"},{"type":"Anna Rose","content":"PERSON"},{"type":"$30MM","content":"MONEY"},{"type":"Bromberg","content":"PERSON"},{"type":"$150MM","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Andy Bromberg","content":"PERSON"},{"type":"$30 million","content":"MONEY"}],"hashtag":[],"authors":["Saniya More","The Block"]}