{"summary":"Crypto lender Nexo will take one month more to decide on its potential acquisition of Vauld, according to an email obtained by The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168817\/nexo-vauld-30-more-days-potential-acquisition","publishDate":"2022-09-09T04:29:35","id":5216,"type":null,"title":"Nexo to take 30 more days to decide on its potential Vauld acquisition","category":["MERGERS & ACQUISITIONS"],"content":["Crypto lender Nexo will take a further month to decide on its potential acquisition of Vauld, an embattled rival, according to an email obtained by The Block.","The email, sent by Vauld to its customers on Tuesday, reads that \"the 60-day exclusivity period previously agreed with Nexo to conduct due diligence in relation to the potential acquisition has been extended for a period of a further 30 days from today. This is because more time is required for the due diligence process.\"","Nexo co-founder&nbsp;Antoni&nbsp;Trenchev confirmed the extension to The Block when contacted. Vauld did not respond to The Block's request for comment.","Nexo started conducting due diligence on Vauld on July 5 and had until September 5 to make its decision. The extension means no decision will be announced until the first week of October at the earliest.","Vauld halted client withdrawals on July 4 as it fought to stave off insolvency. The firm&nbsp;<a class=\"editor-rtfLink\" href=\"https:\/\/www.theblock.co\/post\/158647\/crypto-lender-vauld-owes-363-million-to-retail-investors-after-halting-withdrawals\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">owes a total of $402 million to creditors<\/a>, as The Block reported at the time. Of that sum, $363 million — or 90% — comes from individual retail investors' deposits.","To add to its problems, last month, India's Enforcement Directorate (ED), a law enforcement agency that investigates financial crimes, <a href=\"https:\/\/www.theblock.co\/post\/163329\/indian-authorities-freeze-46-million-worth-of-vaulds-assets\" data-v-f87c67ca=\"\">froze<\/a> Vauld's assets worth around $46 million. One of its clients was involved in a money laundering case, according to ED.","While Nexo has until early October to announce its decision, Vauld itself has until November 7 to decide its path forward, having <a class=\"editor-rtfLink\" href=\"https:\/\/www.theblock.co\/post\/160510\/vauld-gets-three-month-moratorium-extension-to-continue-exploring-options\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">received three months<\/a>&nbsp;from the Singapore High Court in August to continue exploring its options. After that date, Vauld could be forced into liquidation unless the court grants another extension.","If the Nexo deal doesn't happen, Vauld has said it has other plans, including raising more capital, waiting for some of its deployed money to be returned, converting debt to equity and issuing its own token.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"first week of October","content":"DATE"},{"type":"November 7","content":"DATE"},{"type":"Antoni&nbsp;Trenchev","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"September 5","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Nexo","content":"ORGANIZATION"},{"type":"July 5","content":"DATE"},{"type":"Enforcement Directorate (ED)","content":"ORGANIZATION"},{"type":"$402 million","content":"MONEY"},{"type":"Vauld","content":"ORGANIZATION"},{"type":"Singapore High Court","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$363 million","content":"MONEY"},{"type":"India","content":"LOCATION"},{"type":"$46 million","content":"MONEY"},{"type":"July 4","content":"DATE"},{"type":"Nexo","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}