{"summary":"Arcade2Earn, a play-to-earn gaming platform on Ethereum, has raised $4.8 million in a private token round.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274100\/arcade2earn-private-token-round-public-arc-sale","publishDate":"2024-01-23T12:17:45","id":5219,"type":null,"title":"Arcade2Earn raises $4.8 million in private token round ahead of public ARC sale","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Arcade2Earn, a play-to-earn gaming platform that recently moved away from Solana to <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.043%\n    <\/span><\/a> <!----><\/span><\/span> and Avalanche, has raised $4.8 million in a new funding round led by Crypto.com Capital.<\/span>","Other investors included Solana Ventures, <a href=\"https:\/\/www.theblock.co\/post\/268094\/coinbase-galaxy-polygon-multicoin-other-crypto-vc-funding-outlook-2024\" data-v-f87c67ca=\"\">Shima Capital<\/a>, KuCoin Labs, and GSR, Arcade2Earn said Tuesday. The funding was realized via a simple agreement for future tokens, Josh Poole, co-founder and CEO of Arcade2Earn, told The Block. The fundraising effort spanned about a year, concluding at the end of 2023, Poole said.","Arcade2Earn will also conduct a public token sale. \"Our public token sale will be for the $ARC token, which is on Ethereum, starting Feb. 27 and lasting 72 hours on the Fjord Foundry platform,\" Poole said. The project will sell 1.875% of the token's total supply, which is 15 million tokens from 800 million, Poole added.","Arcade2Earn won't be planning more such public token sales in the near future, according to Poole. \"The way other tokens will be distributed is through some community incentive programs,\" he said.","Investors in the private token round will undergo a 6-month cliff from the token generation event on Feb. 27, followed by an 18-month linear vesting period, Poole added.","Arcade2Earn <a href=\"https:\/\/www.theblock.co\/post\/178332\/solana-based-gaming-platform-arcade2earn-raises-3-2-million-exclusive\" data-v-f87c67ca=\"\">was previously building its gaming platform on Solana<\/a> when The Block covered its $3.2 million seed funding round in October 2022. The project had made \"the majority\" of the application on Solana, but later, about a year into development, it realized that some of the application's technical needs were better suited for Ethereum.","\"This was a difficult decision after having built most of the product out on Solana already, but it was important to us that we not cut corners on functionality,\" he said.","Arcade2Earn, however, hasn't scrapped the Solana code and plans to use it for a multi-chain expansion in the future, Poole said.","Arcade2Earn is now building on Ethereum and Avalanche. \"Our primary liquidity token is on Ethereum (ARC), and our synthetic platform token is on Avalanche ($xARC),\" Poole said.","\"We made this decision to ensure that our main liquidity token would be anchored by the liquidity depth, security, and stability of Ethereum, while enabling us to leverage the speed, lower transaction cost, and higher throughput offered by Avalanche,\" he added.","Arcade2Earn has been under development since its founding in 2021. However, according to Poole, several factors have delayed its launch, including the shift from Solana and more time required by its gaming partners.","Last month, Arcade2Earn launched a closed alpha version of its platform and has gathered around 1,500 unique users through community airdrops and partner activations, Poole said.","\"We have numerous other airdrops planned between now and the token generation event, with the goal to onboard several thousand more in that time span,\" he added.","Arcade2Earn will provide access to games through a system called \"Mission Pools\" in which gamers don't need to own non-fungible tokens or NFTs to play games and earn money. The system involves Mission Pool Operators (MPOs) and Mission Pool Contributors (MPCs).","In the case of MPOs, which can include gaming guilds and individual gamers, users play web3 games using NFTs from Arcade's treasury or those lent to the platform. Meanwhile, MPCs – essentially Arcade token holders – support specific MPOs and in-game activities by depositing $xARC tokens in Mission Pools, with rewards distributed based on the success of the missions, Arcade2Earn said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Solana Ventures","content":"ORGANIZATION"},{"type":"-1.043%","content":"PERCENT"},{"type":"1.875%","content":"PERCENT"},{"type":"Poole","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"GSR","content":"ORGANIZATION"},{"type":"Poole","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Josh Poole","content":"PERSON"},{"type":"Feb. 27","content":"DATE"},{"type":"$xARC","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Fjord Foundry","content":"ORGANIZATION"},{"type":"October 2022","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"Shima Capital","content":"ORGANIZATION"},{"type":"$ARC","content":"MONEY"},{"type":"$4.8 million","content":"MONEY"},{"type":"$3.2 million","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["AVALANCHE","ETHEREUM"],"authors":["Yogita Khatri","The Block"]}