{"summary":"A newly launched crypto project called AnubisDAO raised $60 million in a token sale. But the funds raised have all been suddenly withdrawn.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/122529\/crypto-fork-uses-dog-meme-to-raise-60-million-then-the-money-goes-missing","publishDate":"2021-10-29T09:10:13","id":5221,"type":null,"title":"Crypto fork uses dog meme to raise $60 million, then the funds go missing","category":["CRYPTOCURRENCY"],"content":["A newly launched crypto project that raised $60 million overnight appears to have lost the funds in what may have been a phishing attack.","The project was called AnubisDAO and it was promoted as a fork of OlympusDAO — a cryptocurrency backed by the assets in its treasury. AnubisDAO was first announced on October 28 with the launch of a Discord server and a Twitter account, which ended up only making a few tweets. The supposed fork was themed around Anubis, an egyptian god of death that has a dog's head, a branding similar to other <a href=\"https:\/\/www.theblockcrypto.com\/linked\/122323\/shib-overtakes-doge-as-rival-memecoin-surpasses-market-capitalization\" data-v-f87c67ca=\"\">dog-themed memecoins<\/a>.","Despite the lack of website, investors plowed into the token sale, putting $60 million in ETH into it.","The token sale was supposed to continue, with more investors putting in ETH and receiving anubis tokens (ANKH) in return, for a 24 hour period.","But at 11:58 UTC — around 20 hours into the sale — the liquidity in the pool (which enables investors to buy and sell the tokens) was removed. The $60 million in ETH that had been put into the token sale so far was then sent to a <a href=\"https:\/\/etherscan.io\/address\/0x9fc53c75046900d1f58209f50f534852ae9f912a#tokentxns\" data-v-f87c67ca=\"\">different address<\/a>.","That the liquidity was removed at all was a bad sign, and it getting removed before the sale ended was an even worse sign — both pointing toward either a rug pull (where the team disappears with the money) or that the money was stolen by another party in some kind of exploit.","Since the money was taken, the price of the ANKH token has effectively gone to zero because there's no liquidity to sell into. The chart below was originally on the Copper website — where the token sale took place — but has since been removed.","","","Twitter sleuths <a href=\"https:\/\/twitter.com\/loldefi\/status\/1454064508276727810?s=21\" data-v-f87c67ca=\"\">found a series of transactions<\/a> that connected the wallet that received the funds to a Twitter account named @Beerus, which have been confirmed by The Block's researchers. Moments ago, this Twitter account was deleted.","Since then the owner of the Twitter account has <a href=\"https:\/\/twitter.com\/cryptofan777\/status\/1454069612232863744\" data-v-f87c67ca=\"\">claimed<\/a> — under an alternative account — that they may have fallen foul to a phishing attack. They shared a screenshot of an email from someone pretending to be crypto investor 0xSisyphus that contained an attachment, which could have contained malicious code. ","Investors who bought into the token sale have been dismayed by the events. 0xSisyphus <a href=\"https:\/\/twitter.com\/0xsisyphus\/status\/1454058681134374922?s=21\" data-v-f87c67ca=\"\">tweeted<\/a> that he was putting out a 1,000 ETH ($4.3 million) bounty to find out who owned the address that received the funds. The project's Discord channel has, as per usual in these sorts of situations, fallen into chaos.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"October 28","content":"DATE"},{"type":"$60 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$4.3 million","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"}],"hashtag":["ETHEREUM"],"authors":["Tim Copeland","The Block"]}