{"summary":"The price of testnet ether on Goerli spiked over the weekend, with critics proclaiming it the beginning of the end for the testnet.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215248\/speculators-push-price-of-testnet-ether-on-goerli-network-to-1-60","publishDate":"2023-02-26T07:42:02","id":5223,"type":null,"title":"Speculators push price of testnet ether on Goerli network to $1.60","category":["CRYPTO ECOSYSTEMS"],"content":["The price of testnet ether on the Goerli testnet spiked to $1.60 on Feb. 25 as traders speculated on a token that's supposed to be worthless.","Last week, cross-chain platform LayerZero <a href=\"https:\/\/www.theblock.co\/post\/213868\/layerzero-sparks-controversy-by-making-it-possible-to-buy-testnet-ether\" data-v-f87c67ca=\"\">created<\/a> a way for Goerli's testnet ether to be traded and swapped between the Ethereum mainnet and the Goerli testnet. The idea was to create a way for developers to buy testnet ether in a more convenient way than the traditional approach of using faucets or asking the testnet's developers for coins. Still, critics warned that monetizing the native currency of a testnet — which is designed to have no value, allowing the network to support pre-production testing — would render it less suitable for its main purpose.","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">This is the start of the end of Goerli testnet. It served us well,\" <a href=\"https:\/\/twitter.com\/Mudit__Gupta\/status\/1629793552111910912\" data-v-f87c67ca=\"\">said<\/a> Polygon Chief Information Security Officer Mudit Gupta on Twitter. \"Testnet ether is supposed to be free, but is being marked up by speculators.\"<\/span>","The token <a href=\"https:\/\/dexscreener.com\/ethereum\/0x4b1e9a9de809ce968c7dfb0e66f91bb7d794f3ed\" data-v-f87c67ca=\"\">traded<\/a> around $0.15 at the end of last week but rose to a peak of $1.60 Saturday. Since then the token has traded downward, but still retains a value of about $0.37.","<span data-v-f87c67ca=\"\">The price of testnet Goerli spiked over the weekend. Image: DEXScreener.<\/span>","The distribution of testnet ether on Goerli is in the hands of a few validators. These developers could have a big impact on the market if they were to sell a large amount of the tokens at once, which also adds an element of risk.","Ethereum developers have <a href=\"https:\/\/www.theblock.co\/post\/214974\/ethereum-core-developers-plan-new-testnet-called-holli\" data-v-f87c67ca=\"\">proposed<\/a> one solution that may address the problem. They are planning to build a new testnet called Holli that would make it easier for developers to acquire its testnet ether, reducing the need for a secondary market where it must be purchased.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Goerli","content":"PERSON"},{"type":"$0.15","content":"MONEY"},{"type":"$0.37","content":"MONEY"},{"type":"Polygon Chief Information Security Officer Mudit Gupta","content":"ORGANIZATION"},{"type":"last week","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Holli","content":"PERSON"},{"type":"$1.60","content":"MONEY"},{"type":"Goerli","content":"ORGANIZATION"},{"type":"Feb. 25","content":"DATE"},{"type":"Saturday","content":"DATE"}],"hashtag":["CROSS-CHAIN SWAPS","ETHEREUM"],"authors":["Tim Copeland","The Block"]}