{"summary":"The company said it is trying to preserve capital as it attempts to maintain &quot;a highly liquid balance sheet with a strong capital position as it navigates recent volatility in the digital asset industry.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/206187\/silvergate-slides-pre-market-after-suspending-preferred-dividend","publishDate":"2023-01-27T09:29:05","id":5228,"type":null,"title":"Silvergate slides pre-market after suspending preferred dividend","category":["COMPANIES"],"content":["Silvergate fell more than 6% before the open after announcing it suspended the payment of dividends on its 5.375% Fixed Rate Non-Cumulative Perpetual Preferred Stock, Series A.","The company said it is trying to preserve capital as it attempts to maintain \"a highly liquid balance sheet with a strong capital position as it navigates recent volatility in the digital asset industry.\"","Silvergate's stock has been volatile this month after it reported a $1 billion fourth-quarter loss, and cut about 20% of its workforce. Crypto prices have been rising lately, but are still far from their 2021 peaks. The collapse of 3AC and FTX have led to ripple effects throughout the industry.","“We were surprised by the announcement, to be frank, as SI hadn't previously indicated it was contemplating pausing the dividend payment in recent public commentary,\" KBW analysts led by Michael Perito wrote in a note. \"The bank indicated it still has more cash than deposits as of the date of the announcement (1\/27), and we continue to have no liquidity concerns.\"","The company said it \"continues to maintain a cash position in excess of its digital asset customer related deposits,\" and the board will re-evaluate the payment of quarterly dividends as market conditions evolve.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Michael Perito","content":"PERSON"},{"type":"6%","content":"PERCENT"},{"type":"5.375%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"KBW","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}