{"summary":"Zero-knowledge proof cryptography is technologically feasible in a central bank digital currency, a new study lead by Mina Protocol and Etonec shows.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195341\/zero-knowledge-proof-cbdc-privacy","publishDate":"2022-12-15T09:00:13","id":5234,"type":null,"title":"Zero-knowledge proofs could solve CBDC privacy concerns, research shows","category":["CENTRAL BANKS"],"content":["<span data-v-f87c67ca=\"\">Deploying zero-knowledge proof cryptography could allow for \"trustless privacy\" in a central bank digital currency (CBDC), according to new research, addressing a major area of concern for a state-backed crypto projects.<\/span>","<span data-v-f87c67ca=\"\">The <a href=\"https:\/\/www.etonec.com\/post\/how-to-design-a-compliant-privacy-preserving-fiat-stablecoin-via-zero-knowledge-proofs\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">report<\/a> by Mina Foundation, a decentralized network, and Etonec, a crypto payments group, looks to show that CBDCs can provide the same privacy levels as cash while also being compliant to anti-money laundering regulations.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Providing anonymity for payments, while ensuring regulatory compliance, is not a technological question, but a policy question,” Jonas Gross, head of digital assets and currencies at Etonec and chairman of the Digital Euro Association, said in a statement to The Block.<\/span>","<span data-v-f87c67ca=\"\">To achieve cash-imitating levels of privacy, transaction details can be kept confidential between the sender and receiver using zero-knowledge (ZK) technology. A third party, like a financial authority, would not be able to access the details unless it hits certain preset thresholds. Then, the transacting pair will only be able to continue making payments after they are confirmed to be compliant with regulation, according to the study.<\/span>","<span data-v-f87c67ca=\"\">\"Zero-knowledge technology will be an essential backbone of the future of payments because it enables privacy preservation of confidential payment data in the digital realm,” Gross added.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Privacy is a major concern when it comes to a state-backed digital currency. <\/span><span data-v-f87c67ca=\"\">In a survey conducted in 2021 by the European Central Bank, the protection of privacy <\/span><a href=\"https:\/\/www.ecb.europa.eu\/press\/pr\/date\/2021\/html\/ecb.pr210113~ec9929f446.en.html\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">topped<\/span><\/a><span data-v-f87c67ca=\"\"> European citizens’ priorities in a future digital euro.<\/span>","<span data-v-f87c67ca=\"\">The findings of the research will be sent to central bankers, Gross confirmed.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We see that there is a strong demand for preserving privacy around CBDCs — even if there are cultural differences,” he wrote in the statement. “Some central banks are already experimenting with a CBDC that utilizes privacy-preserving technologies to satisfy this demand.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Etonec","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Jonas Gross","content":"PERSON"},{"type":"Digital Euro Association","content":"ORGANIZATION"},{"type":"European Central Bank","content":"ORGANIZATION"},{"type":"Gross","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Mina Foundation","content":"ORGANIZATION"},{"type":"Etonec","content":"LOCATION"}],"hashtag":[],"authors":["Inbar Preiss","The Block"]}