{"summary":"zkSync has found a solution to release the 921 ETH ($1.7 million) locked in Gemholic&#x27;s smart contract on the Ethereum Layer 2 network, it claimed.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225364\/zksync-unfreeze-millions-stuck","publishDate":"2023-04-07T03:40:27","id":5236,"type":null,"title":"ZkSync develops &#x27;solution&#x27; to unfreeze $1.7 million stuck in smart contract","category":["CRYPTO ECOSYSTEMS"],"content":["The development team at zkSync said it had devised a solution to unlock the 921 ETH ($1.7 million) stuck in a smart contract used by a team called Gemholic on its Era network. zkSync is a ZK-Rollup Layer 2 scaling solution developed by Matter Labs that can support Ethereum smart contracts.","In a statement, zkSync <a href=\"https:\/\/twitter.com\/zksync\/status\/1644139366707523584\" data-v-f87c67ca=\"\">claimed<\/a> \"funds are safe\" and that it has \"discovered an elegant method to unlock the frozen contract.\"","On Thursday, Eden Au, director of research at The Block, was the <a href=\"https:\/\/twitter.com\/0xedenau\/status\/1644016993996247040\" data-v-f87c67ca=\"\">first<\/a> to note that the project raised 921 ETH ($1.7 million) through a token sale on zkSync's Era mainnet, but the funds had become trapped in the smart contract. The funds in the contract got locked due to an issue with using the <a href=\"https:\/\/consensys.net\/diligence\/blog\/2019\/09\/stop-using-soliditys-transfer-now\/\" data-v-f87c67ca=\"\">.transfer() function<\/a>, which resulted in a hard dependency on gas costs.","When the .transfer() function is used to send Ether to a smart contract, the fallback() function is triggered. If the fallback() function requires more than the allocated 2300 gas, the transaction may fail, and the funds get stuck.","To mitigate these gas issues, zkSync gives a warning about the .transfer() function directly into the compiler, which was likely ignored by the Gemholic team. The zkSync team further <a href=\"https:\/\/twitter.com\/zksync\/status\/1644139370012606465\" data-v-f87c67ca=\"\">stated<\/a> that Gemholic deployed contracts on the Era mainnet without testing on the testnet or a local node.","zkSync has been working to resolve the issue with a minor protocol-level change to recover the funds fully, and it plans to provide details shortly.","\"We identified an elegant solution which can solve a broader class of gas-related problems. It will require minimal changes in the gas metering of the protocol, but will allow for full recovery of the funds,\" the zkSync team <a href=\"https:\/\/twitter.com\/zksync\/status\/1644139387423260672\" data-v-f87c67ca=\"\">said<\/a>.","In response to zkSync's efforts, Gemholic publicly thanked the project, <a href=\"https:\/\/twitter.com\/GemholicECO\/status\/1644164420954906624\" data-v-f87c67ca=\"\">adding<\/a> they \"sincerely apologize\" for their actions.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2300","content":"DATE"},{"type":"Eden Au","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$1.7 million","content":"MONEY"}],"hashtag":["ZKSYNC"],"authors":["Vishal Chawla","The Block"]}