{"summary":"The developer has proposed to Lido Finance&#x27;s governance platform that it should sell $17 million of ETH from its treasury funds.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/150247\/lido-developer-dao-should-sell-17-million-of-eth-to-prepare-for-bear-market","publishDate":"2022-06-06T10:58:53","id":5238,"type":null,"title":"Lido developer: DAO should sell $17 million of ETH to &#x27;prepare for bear market&#x27;","category":["CRYPTOCURRENCY"],"content":["<span data-v-f87c67ca=\"\">A Lido Finance core developer has put forward a <a href=\"https:\/\/research.lido.fi\/t\/lido-to-prepare-for-the-bear-market\/2318\/5\" data-v-f87c67ca=\"\">proposal<\/a> asking its governance platform to sell 10,000 ether (ETH) ($17 million) from its treasury funds — in case of a prolonged market downturn. <\/span>","<span data-v-f87c67ca=\"\">The developer, who goes by kadmil, recommended that the governance platform, known as Lido DAO, should diversify around half of its ETH into stablecoins to pay for Lido's operations for the next two years. <\/span><span data-v-f87c67ca=\"\">“We propose to sell 10,000 ETH of treasury funds to DAI. This should cover about two years for 50-people team &amp; ops expenses of the protocol maintenance budget,” the proposal stated.&nbsp;<\/span>","Kadmil expressed concerns that if the price of ETH spiraled down in future against the US dollar, the DAO will have far fewer resources for operational overhead and reimbursement of DAO contributors.","<span data-v-f87c67ca=\"\"><a href=\"https:\/\/www.theblockcrypto.com\/post\/148642\/lido-finance-refuses-to-support-terras-new-blockchain\" data-v-f87c67ca=\"\">Lido Finance<\/a> is a liquid staking protocol that allows users to unlock the value of their staked tokens for capital efficiency. It's currently the leading liquid staking protocol on Ethereum.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to kadmil, Lido pays its operational expenses in stablecoins like USDC, whereas LDO tokens are only used to reward liquidity providers as well as referral bonuses. As such, the proposal focused on selling only half of its unstaked ETH to build up its stablecoin reserves. <\/span>","<span data-v-f87c67ca=\"\">At the same time, the proposal asked the DAO not to sell any of its own LDO governance tokens as that would put “unnecessary price pressure” on its price.<\/span>","<span data-v-f87c67ca=\"\">It's not clear yet whether this proposal will be put to an on-chain vote or whether it will be approved in the end. Having said that, it does indicate Lido's willingness to reduce exposure to ETH and to play it safe in case of a drawn-out bear market. But it's already quite late; the price of ETH is down 48% this year alone.<br data-v-f87c67ca=\"\">\n<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lido Finance","content":"ORGANIZATION"},{"type":"Lido DAO","content":"LOCATION"},{"type":"Lido","content":"LOCATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"48%","content":"PERCENT"},{"type":"$17 million","content":"MONEY"},{"type":"DAI","content":"ORGANIZATION"}],"hashtag":["LIDO FINANCE"],"authors":["Vishal Chawla","The Block"]}