{"summary":"Crypto &quot;is just waiting for that next bull run — and there may not be another,” Art Blocks founder Erick Calderon said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229643\/art-blocks-erick-calderon-crypto-bull-run","publishDate":"2023-05-05T05:00:11","id":5244,"type":null,"title":"Art Blocks resists crypto bull run hopium as NFT sales slide","category":["METAVERSE & NFT"],"content":["By his own admission, Erick “Snowfro” Calderon is not a typical crypto founder.","Before founding Art Blocks, a marketplace for computer-generated artworks, he spent 20 years running a ceramic tile business. During the last bull market, he claims to have turned down multiple investment offers that would have valued Art Blocks at over $1 billion. He stands firm on the need to uphold creator royalties in the NFT space. And he has resisted the temptation to launch an Art Blocks token.","But most iconoclastic of all, he isn’t convinced there will be another crypto bull run.","“There are people that would accuse us of being not ambitious enough with the amount of funds that we have left,” Calderon, who is also Art Blocks’ CEO, said in an interview. “The reason that I’m a little bit timid and hesitant is because I think a lot of that ‘invest in your startup’ mentality is just waiting for that next bull run — and there may not be another bull run.”","Art Blocks is in the business of auctioning off generative art in the form of NFT collections created by algorithms, albeit within parameters set by human artists. The platform was a darling of the 2021 crypto boom. In a single month in August 2021, <a href=\"https:\/\/www.cryptoslam.io\/art-blocks\/sales\/summary\" data-v-f87c67ca=\"\">it sold no less than $587 million<\/a> worth of NFTs, according to CryptoSlam data.","But times have changed for Art Blocks, much as they have in the wider crypto space. The business recorded just $6.5 million in sales in April, the lowest total since May 2021. Around half the projects listed on the platform today don’t sell out, according to Calderon.","Yet Calderon, who is himself a generative artist, is stubborn. Even as volumes wane, he has stuck to his guns on topics such as creator royalties — despite other marketplaces in the sector deciding to <a href=\"https:\/\/decrypt.co\/121638\/opensea-drops-fees-royalty-protections-blur-rises\" data-v-f87c67ca=\"\">waive them<\/a> for the benefit of traders. While this and similar strategic choices are costing Art Blocks money in the short-term, Calderon remains optimistic.","“The vibes are negative, but the vision is very resolute,” he said. “I’m just as excited today — I’m maybe more excited today — than I was in 2021 and I just want people to know that.”","Art Blocks’ stance on royalties — the levy paid to creators on secondary sales of their NFTs — is an apt illustration of how the business has positioned itself.","Blur, the recently launched NFT marketplace targeting pro traders, <a href=\"https:\/\/www.theblock.co\/post\/215294\/blur-royalties-insulting-animoca-brands-yat-siu-says\" data-v-f87c67ca=\"\">set its royalty fee<\/a> at just 0.5% in February. In response, rival OpenSea dropped its 2.5% fee to zero for a limited time.","Art Blocks, which has a secondary market of its own, continues to enforce full royalty fees of 5%. That means collectors must spend more to buy an NFT on Art Blocks than they would for the same NFT on Blur or OpenSea. Inevitably, that has put a dent in revenues.","“Art Blocks has lost a significant amount of income as a result of royalties,” Calderon said, adding that the royalty fees had previously provided the bulk of the firm’s event budgets.","But Calderon thinks artists create higher quality work — in part because it’s less necessary for them to continually produce — and are generally more engaged with their audiences when royalties are upheld. “To me it just seems very straightforward that the ecosystem will be a better place if royalties are respected,” he added.","Blur, Calderon said, is “the antithesis of being about the art,” and is much more focused on market mechanics and traders. “I’m also very frustrated with what’s happening, but if it wasn’t them, it would be somebody else doing it,” Calderon said.","Even with revenue down, Art Blocks remains a \"well-capitalized company,” according to Calderon.","The startup may not have raised at a billion-dollar valuation, but it did <a href=\"https:\/\/www.coindesk.com\/business\/2021\/10\/06\/art-blocks-raises-6m-from-galaxy-flamingo-dao-on-strength-of-generative-nfts\/\" data-v-f87c67ca=\"\">bring in some cash<\/a>&nbsp;through a $6 million round that closed in August 2021. True Ventures, Galaxy Interactive and Collab Currency invested alongside existing backers Libertus Capital, Flamingo DAO and The LAO.","The bulk of the capital at Art Blocks’ disposal today, however, comes from the revenue it booked in the bull run. The company <a href=\"https:\/\/docs.artblocks.io\/creator-docs\/creator-onboarding\/readme\/faqs\/#:~:text=Art%20Blocks%20is%20allotted%2010,and%202.5%25%20of%20secondary%20sales.\" data-v-f87c67ca=\"\">takes a 10% fee<\/a> on primary sales and 2.5% of any secondary transactions, according to its website. A straightforward calculation suggests, therefore, that Art Blocks banked at least $58 million in revenue in the month of August 2021 alone.","“We had a crazy year in 2021,” Calderon said. Naturally, after the $6 million round, bigger backers came knocking.","Calderon said he fielded offers both to invest in Art Blocks and to buy the company outright at valuations in excess of $1 billion. He declined to name the investors.","“Why we didn’t raise more money? Because I thought it would be gross to raise more money when everything was just peak FOMO,” he said. “I’m sitting here thinking, ‘OK yeah, I can see that from the numbers now, but what on earth makes you think that these numbers are going to continue forever?’ It’s completely unreasonable.”","Cost-wise, the operation appears to have stayed fairly lean; Calderon said Art Blocks’ current headcount is 40 people. And as alluded to earlier, Art Blocks does not seem to burn through cash quite so hungrily as the average tech startup. Calderon sees a runway of one to two years as “too low,” mindful of the often-stellar jobs his staff left to join what remains a fairly zany startup.","Keep calm and carry on seems to be the basis of Calderon’s plan for navigating a rough period for crypto firms.","“We’re in a canoe, going down a river that’s moving very fast, with tiny little paddles, and all we can do just from a mental health standpoint is just keep f---ing doing what we’re doing,” he said.","Which is not to say that Art Blocks doesn’t have any new ideas in the works. Calderon speaks enthusiastically about potential use cases for Art Blocks’ on-demand minting technology — at the heart of which is <a href=\"https:\/\/medium.com\/the-link-art-blocks\/1of1ofx-the-native-nft-13123d2e3593\" data-v-f87c67ca=\"\">the 1 of 1 of X concept<\/a> — in other industries, such as fashion or even ceramic tiles. Art Blocks is hoping to position the platform as an “engine partner” for such endeavors, Calderon said.","In October last year, Tyler Hobbs, creator of an Art Blocks’ smash hit collection called <a href=\"https:\/\/www.artblocks.io\/collections\/curated\/projects\/0xa7d8d9ef8d8ce8992df33d8b8cf4aebabd5bd270\/78\" data-v-f87c67ca=\"\">Fidenza<\/a>, made $17 million <a href=\"https:\/\/www.theblock.co\/post\/175578\/fidenza-artist-tyler-hobbs-has-a-new-idea-buy-now-mint-later-nfts\" data-v-f87c67ca=\"\">selling passes<\/a> that gave buyers a level of control over the look of NFTs minted from his QQL collection. By toying with knobs and dials, pass-holders can manipulate the QQL algorithm to suit their fancy.","Art Blocks is working on new minting mechanics of its own, due next quarter, Calderon said. There will be less of a manual element, however.","Calderon acknowledges that Art Blocks must hit “homeostasis” at some point. To do that, the startup and indeed the industry needs to find ways to access a bigger market.","“Some people are just so focused on extracting every last dollar from every last person in the industry that are here, that they’re not spending any time on thinking, ‘how do I make this thing appealing to the outside world?’ And I think that’s where we could shoot ourselves in the foot as an industry,” Calderon said. &nbsp;","“If Art Blocks doesn’t make it through this, it’s like the value proposition of the NFT just disappears.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$58 million","content":"MONEY"},{"type":"Galaxy Interactive","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"August 2021","content":"DATE"},{"type":"$587 million","content":"MONEY"},{"type":"next quarter","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"2.5%","content":"PERCENT"},{"type":"the month of August 2021","content":"DATE"},{"type":"0.5%","content":"PERCENT"},{"type":"Flamingo DAO","content":"ORGANIZATION"},{"type":"Calderon","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Erick “Snowfro” Calderon","content":"PERSON"},{"type":"$6 million","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"May 2021","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Collab Currency","content":"ORGANIZATION"},{"type":"October last year","content":"DATE"},{"type":"$6.5 million","content":"MONEY"},{"type":"Tyler Hobbs","content":"PERSON"},{"type":"” Calderon","content":"PERSON"},{"type":"$17 million","content":"MONEY"}],"hashtag":["NFT ARTISTS"],"authors":["Ryan Weeks","The Block"]}