{"summary":"This increase in liquidity should help stabilize bitcoin markets and make the idea of entering this space more attractive to institutional investors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282353\/spot-bitcoin-etf-mania-has-fixed-the-alameda-liquidity-gap","publishDate":"2024-03-13T13:40:19","id":5246,"type":null,"title":"Spot bitcoin ETF mania has fixed the Alameda liquidity gap","category":["MARKETS"],"content":["The spot bitcoin market is experiencing significant activity, with Monday recording the second-highest volume day for the ten issuers.","This level of activity stands out, even when compared to the stock market, where only five other stocks saw higher trading volumes, according to Eric Balchunas of Bloomberg. Although it might sound cliché, the evidence suggests that we are still in the early stages of this development, especially considering the pace at which Wall Street operates.","Mike Belshe of BitGo, who appeared on The Scoop this week, mentioned that he believes a substantial portion of the capital flowing into these funds comes from retail investors, based on the sizes of most transactions. As we have previously noted in this column, it will take some time for large financial services firms to make these products available to their clients and for advisors to include them in their portfolios. The process of integrating these products has only just begun.","<span data-v-f87c67ca=\"\">JMP Securities, which has raised its price target for Coinbase from $220 to $300, estimates that flows into spot <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.78%\n    <\/span><\/a> <!----><\/span><\/span> ETFs will reach $220 billion over the next three years. This anticipated influx of capital is a key factor behind the firm's increasingly bullish outlook on the cryptocurrency exchange.<\/span>","Still, identifying the exact sources of these capital inflows can be challenging, as Teddy Fusaro highlighted in a recent discussion. “Yes, retail buyers usually print smaller trade sizes but institutions play a different game, often breaking up big orders into smaller pieces,” he said.","In any case, although the long-term impact of these ETFs has yet to fully manifest, their influence on the market structure of cryptocurrency has already been significant. This includes unusual trading activity around the closing bell (a time when issuers purchase bitcoin as the index price matches the NAV) and a significant increase in liquidity. Kaiko has noted that liquidity in the bitcoin markets has \"notably improved.\"","“Both market makers and traders have returned to the market with BTC 2% depth now nearing its pre-FTX levels in US dollar terms,” the firm’s Dessislava Aubert said.","Ultimately, this increase in liquidity is expected to help stabilize Bitcoin markets and make the proposition of entering this space more attractive to institutional investors. As noted by QCP this morning, market dips have been relatively short-lived. The anticipated risk reversal flush that occurred overnight was \"extremely short-lived.\"","<em data-v-f87c67ca=\"\">This first appeared in Chaparro’s biweekly The Scoop Newsletter on March 13. <a href=\"https:\/\/www.theblock.co\/newsletters\/\" data-v-f87c67ca=\"\" data-v-03de5780=\"\">Sign up now<\/a>.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$220 billion","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"Mike Belshe","content":"PERSON"},{"type":"QCP this morning","content":"TIME"},{"type":"$300","content":"MONEY"},{"type":"2%","content":"PERCENT"},{"type":"JMP Securities","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"NAV","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"March 13","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC","content":"ORGANIZATION"},{"type":"Teddy Fusaro","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"$220","content":"MONEY"},{"type":"-0.78%","content":"PERCENT"},{"type":"Dessislava Aubert","content":"PERSON"},{"type":"Eric Balchunas","content":"PERSON"}],"hashtag":["SPOT BITCOIN ETF"],"authors":["Frank Chaparro","The Block"]}