{"summary":"Stone Ridge, a multi-billion-dollar asset manager, has launched an accelerator program for Bitcoin&#x27;s Lightning network.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/180198\/stone-ridge-launches-an-accelerator-for-bitcoins-lightning-network","publishDate":"2022-10-26T17:27:51","id":5250,"type":null,"title":"Stone Ridge launches an accelerator for Bitcoin’s Lightning network","category":["COMPANIES"],"content":["Stone Ridge, a multi-billion-dollar asset manager, has launched a startup accelerator focused on the Bitcoin Lightning network.","The accelerator program, called Wolf, is taking applications for its first cohort. Each participating team will receive $250,000 in funding, as well as advisory services from employees at Stone Ridge and its subsidiary company NYDIG, which is focused on institutional bitcoin services.&nbsp;","Additionally, other venture capitalists and Bitcoin-focused companies will be looking to make potential investments and provide advisory services for cohort members. Only companies building on Lightning and Taro, which enable new digital assets like tokens or collectibles to be created on Bitcoin, will be allowed into the program.","The Lightning network originated in 2015 and its goal is to create a scalable payment network and smart contract ecosystem on top of Bitcoin. Taro and the Lightning Network function similarly to Ethereum by having multiple layers to solve scalability bottlenecks.","Up to this point, the Lightning Network has seen steady adoption, but it has faced several challenges in which business opportunities and directions make the most sense for long-term growth, <a href=\"https:\/\/volt.capital\/writing\" data-v-f87c67ca=\"\">according to<\/a> Volt Capital venture partner Mohamed Fouda.","Applications coming out of this incubator could include liquidity hubs to collect routing fees, integrations and user services to expand Lightning Network’s reach, and payment rails using it as the underlying infrastructure.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$250,000","content":"MONEY"},{"type":"2015","content":"DATE"},{"type":"Volt Capital","content":"ORGANIZATION"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Stone Ridge","content":"ORGANIZATION"},{"type":"Wolf","content":"PERSON"},{"type":"Mohamed Fouda","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["BITCOIN"],"authors":["Mike Truppa","The Block"]}