{"summary":"Coinbase&#x27;s interest in decentralized finance has long been known, but new comments from the publicly traded crypto exchange&#x27;s chief financial officer suggest that the company is eyeing a broader scope.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/124396\/coinbase-is-looking-at-support-for-third-party-defi-apps-on-its-platform-says-cfo","publishDate":"2021-11-15T14:50:53","id":5251,"type":null,"title":"Coinbase is looking at support for third-party DeFi apps on its platform, says CFO","category":["DEFI"],"content":["Coinbase's interest in decentralized finance has long been known, but new comments from the publicly traded crypto exchange's chief financial officer suggest that the company is eyeing a broader scope.","Alesia Haas spoke during a fintech-focused event hosted by Citi on Monday. Early in that appearance, Haas provided insight into the exchange's overall strategy, dividing it into three \"pillars.\" The third one, she said, centers around the Coinbase platform as one that users can access an array of applications and uses within.","\"The third pillar for us is crypto as an app platform, and here's where we serve the broader crypto ecosystem,\" Haas explained, going on to say:","\"We plan eventually to service third-party apps inside our main product and so that we're going to be agnostic between a customer choosing a Coinbase product or a third-party DeFi product. We want to introduce and find the best product for our customers.\"","Haas later spoke to the overarching relationship between Coinbase, a centralized platform run by a company, and DeFi, the composition of which is defined by ecosystems run by smaller development teams or token-holding governance stakeholders.","Still, Coinbase aims to become \"a bridge to DeFi,\" according to Haas:","\"So how do we think about Coinbase in relative to DeFi? So earlier, I talked about our...crypto as an app platform strategy, and this is where this all comes in. As crypto as an app platform, will help DeFi in two ways. One, we're building tools to accelerate the builders in the ecosystem through Coinbase Cloud. And we believe this opportunity itself will be large in the future because more and more companies are going to want to offer crypto services to their end customers. So the second thing we do is that we're helping with distribution. Just like we've been a bridge to crypto buy, sell, we'll be a bridge to DeFi.\"","Ultimately, the company thinks it \"can bring billions of users to DeFi by making it easy to use\" according to Haas.","Such an approach is perhaps unsurprising, given the exchange's support to DeFi protocol tokens and its participation in groups like the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/101203\/coinbase-defi-alliance-membership\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">DeFi Alliance<\/a>. From a practical sense, it appears that Coinbase sees DeFi as an avenue for future business.&nbsp;","As Haas put it at one point: \"[W]e believe that Coinbase and DeFi can and will successfully grow and coexist.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Monday","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"Haas","content":"PERSON"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Coinbase Cloud","content":"ORGANIZATION"},{"type":"Alesia Haas","content":"PERSON"},{"type":"DeFi Alliance","content":"ORGANIZATION"},{"type":"Citi","content":"ORGANIZATION"}],"hashtag":["COINBASE"],"authors":["Michael McSweeney","The Block"]}