{"summary":"Decentraland’s Ethereum-based virtual world went live this week. I did find things to do, but I spent much of my experience wandering the virtual abyss, encountering buildings and artistic constructs and the occasional player.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/56656\/decentraland-ethereum-virtual-world-review","publishDate":"2020-02-21T17:46:07","id":5252,"type":null,"title":"Lost in Decentraland: My journey through an Ethereum-powered virtual world","category":["ETHEREUM"],"content":["When I first started poking around Decentraland on its launch day this week, I found myself with <a href=\"https:\/\/twitter.com\/mpmcsweeney\/status\/1230546213793075201\" data-v-f87c67ca=\"\">little guidance<\/a> as to <i data-v-f87c67ca=\"\">what I should be doing<\/i>. The gamer’s instinct, if one could call it that, is to seek out some objective or next step that would then carry them onto the next thing.","But at the time, I was at work, using a work laptop, so I decided to cut my foray short with the plan of sitting down for a proper exploration later that evening. In the end, I put in two-and-a-half hours of play, taking notes and screenshots as I went to catalog my experience in this new virtual world.","To be clear: this review is not intended to be an examination of the economic underpinnings of Decentraland, its token(s) model or how the Ethereum blockchain is utilized here. My colleague Steven Zheng wrote <a href=\"https:\/\/www.theblockresearch.com\/a-look-at-decentraland-and-why-people-are-paying-175k-for-virtual-properties-2256\" data-v-f87c67ca=\"\">a very fine deep-dive<\/a>&nbsp;back in 2018, so I’ll excerpt his piece as a bit of a preface so that the uninitiated reader might understand Decentraland’s core concept:","\"Real estate on Decentraland is represented by a non-fungible cryptographic token called LAND. Users can purchase LAND using a native token called MANA. Similar to the real world, where a record of ownership is kept for a property, on Decentraland ownership of LAND is recorded on the Ethereum blockchain. And unlike Second Life, the owner of the LAND has full control over how it is used. As stated in Decentraland’s Terms of Service, “All acquired Land parcels in the virtual world are owned by their acquirer, giving him\/her control over his\/her parcel of Land.\"","TL;DR – it’s a virtual world where players actually own the stuff they build and acquire, and ownership is logged via ETH transactions.","Instead, my review is intended to capture my experience as a <i data-v-f87c67ca=\"\">player<\/i>, as if I had wandered into Decentraland off the street. I don’t own any LAND, MANA or ETH, the latter of which did hamper my experience a bit as I’ll get into below. Further, I pointedly avoided any online guides or written tutorials – instead, I wanted to experience the world as it came at me. If Decentraland told me to do something, I’d do it. The one exception to this was that I took hints from other users via Twitter on possible places to visit.","The result: I <i data-v-f87c67ca=\"\">did<\/i> find things to do, but I spent much of my experience wandering the virtual abyss, encountering buildings and artistic constructs and the occasional player. I also encountered some bugs and performance issues, which might be expected at launch for a wholly experimental virtual world.","Did I like it? I think I did. I’m a sucker for social gameplay, and I tend to gravitate toward multiplayer gaming. But would I come back to Decentraland? That’s an even tougher question, and one that I think will determine the fate of the project as a platform on which people are supposed to come together and do things.","But let’s dive in, shall we?","Signing up for Decentraland was fairly simple. Though compared to my initial experience, this time I had to connect a MetaMask wallet in order to authenticate my account. No problem – I have a MetaMask wallet, so I connected it and in I went. My avatar was a mohawk-bearing dude in a black suit with glasses clearly inspired by those worn by <a href=\"https:\/\/twitter.com\/MarcHochstein\/status\/1230554365620084736\" data-v-f87c67ca=\"\">Geordi LaForge<\/a>.","","","Pretty cool, right? I agree; I made great choices.","Once I completed the tutorial that lay before me – pick up a key to unlock a chest, move a lever, press a button – I stepped into a portal. One loading screen later, I reappeared...as a brown-haired woman. This was the first bug I encountered, but, undeterred, I decided to press on as my new avatar. Plus, her teal jacket was pretty snazzy, not going to lie.","","","Directly ahead of the spawn point is a temple with some statues inside of it. Once I walked through the doors – literally through them – I was prompted to “discover amazing destinations” by entering the command \/goto magic. Well, if Decentraland says so, I must do it!","I was transported to a street with some buildings, placing me directly in front of the Crypto Valley Conference Center. Naturally, I began to go inside, and as I walked toward the entrance, I was prompted to participate in a Treasure Hunt through which I could obtain collectibles – but, I’d have to pay the Ethereum gas costs if I succeed. So, naturally, I accepted and was once again whisked away via loading screen.","I appeared in front of a group of several buildings, including the Sugar Club, which I guess is a Decentraland-based dance club franchise. Once you enter, it prompts you to offer a donation amidst the music, and in the next room, there was an ever-changing imageboard that at one point had a picture of Goku on it. Pretty cool.","","","Nearby, I discovered the treasure chest that I was promised, and inside I found 10 MANA and a commemorative T-shirt for my avatar. But, as I do not own any ETH, I could not afford the transaction cost. Alas, my only reward for the hunt was the thrill of discovery.","There was also a building nearby that projected cryptocurrency price data for BTC, ETH and EOS, as well as voice-recorded explainers for each network. Curious, I pressed all three buttons in quick succession, and they promptly began to play over each other, the sound of which persisted even as I moved a considerable distance away from the building.","It was around this time that I started to encounter more and more branding for the HTC Exodus “blockchain phone.”","","","During my initial foray, I <a href=\"https:\/\/twitter.com\/mpmcsweeney\/status\/1230548929944735744\" data-v-f87c67ca=\"\">wondered aloud<\/a> whether HTC has some kind of formal partnership with Decentraland, and, as it turns out, <a href=\"https:\/\/decentraland.org\/blog\/announcements\/decentraland-partners-with-htc\/\" data-v-f87c67ca=\"\">it does<\/a>. The assets I encountered can be found in the Builder module, which lets LAND owners drop structures and items on their plots as they choose. I encountered HTC branding throughout the world, which, to be honest, really stuck out for me after a while.","At one point, I found a building full of lizards who seemed to be watching some kind of show together. Intrigued, I entered, and what were they all looking at? An HTC Exodus phone.","","","From a business perspective, I suppose the inclusion makes sense.","But as a humble player, it felt a lot like encountering billboards nestled within the various areas I came across. Maybe there’s a better way to do it, but perhaps there isn’t. Either way, it was for me, as an explorer, a bit jarring.","Much of what I discovered was, in essence, creative experimentation within Decentraland’s framework. And honestly, I thought that was cool.&nbsp;I found some pretty elaborate structures, including a T-rex skeleton, a volcano with an amphitheater at its peak (complete with working lights) and a spooky forest that had ominous sounds and music playing in the background.","I’m a big fan of Minecraft – which is very much couched in the creative process – and Decentraland struck me very much as an open canvas upon which LAND-owning users can create to their hearts' content.","Or, conversely, they can play a Harambe the gorilla-themed slot machine in a virtual casino named the Chateau Satoshi.","No, seriously, this exists (chips out, <a href=\"https:\/\/twitter.com\/MarcHochstein\/status\/1230680295919247360\" data-v-f87c67ca=\"\">as they say<\/a>):","","","Jokes aside, the casino was one of the areas that I encountered in which you might say a “use case” for Decentraland emerges. One of the neat things about Second Life is that it allowed for the creation of wholly virtual businesses, and the <a href=\"https:\/\/twitter.com\/decentralgames\/status\/1230475012848701441?s=21\" data-v-f87c67ca=\"\">Chateau Satoshi by Decentral Games<\/a> seems to fall into that category. Currently, the casino lets you spend fake PLAY tokens as well as tokens on the Ropsten test network.&nbsp;","My big question – which would crop up as I encountered more things in the world – is to what extent a business model for the casino exists. Do they take a cut of every game?","<a href=\"https:\/\/decentral.games\/blog\/community-progress-blog-post-4-chateau-satoshi-roulette-nfts\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Decentral Games’s blog post<\/a> from Feb. 19 details&nbsp;their plans, including real-money competitions, Lamborghini-inspired NFTs and more. When reached for comment, project advisor Peter Dhaliwal told me that \"[c]urrently, we have our house edge programmed into our gaming smart contracts. We will release the smart contract code soon after our second audit, so that all players can see that our games are provably fair.\" Future plans for the casino include poker and blackjack.","\"Essentially, we’re virtual land developers with a focus on casinos,\" he said in the email. \"We feel that our casino and games are the best in Decentraland, and we are excited to build bigger and better.\"","","","I encountered other emergent business models within Decentraland, most notably commercial\/events space.","The aptly-named Decentraland Convention Center allows would-be event planners to customize the amount of event space they want to rent, although I couldn’t figure out how actually to facilitate such a rental. The buildings themselves are bare (though it’s possible that event organizers can customize their space during an actual event). Maybe someone can get a virtual expo going?","","","I encountered a similar set up (with its own Sugar Club location nestled inside), and if there are others like it, that might indicate that people believe Decentraland could be a spot where virtual residents can gather for an online conference. I’m not sure how communication would work on this front – maybe a third-party app like Discord would come in handy – but with recent talk of virtual conferencing <a href=\"https:\/\/www.marketwatch.com\/story\/will-the-shows-go-on-coronavirus-mwc-cancellation-hang-over-tech-conferences-2020-02-20\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">amid the coronavirus epidemic<\/a>, who’s to say that people won’t try?","Advertisers, as might be expected, have also set up shop in Decentraland.","","","In this case, I saw ads for OpenSea and CoinGecko above what I understand to be a network of art kiosks distributed around Decentraland. Again, I'm not quite sure who is receiving the income from these plots, but my immediate reaction was that I was encountering monetized artistic spaces.","Art feels very much at the center of what comprises Decentraland, at least as it exists at this point.","In addition to the creative works and arrangements found throughout the virtual landscape, I encountered several places explicitly built to display digitized artworks.","","","The Museum District, as explained in a posted mission statement, exists “to be the Crypto-Art hotspot in Decentraland and the most visited art venue in the world.” A lofty goal, I thought to myself as I wandered the museum, which I had entirely to myself.","","","As I noted in a tweet on launch day, the Museum District was, perhaps, the most striking use case for Decentraland I encountered. Here, the idea of user-centric ownership feels most palpable.","In theory, one could create an artistic space where the artists themselves have a stake. And while I couldn’t tell during my visit what kind of business model the Museum would have outside of donations, that question of <i data-v-f87c67ca=\"\">ownership<\/i> seemed to make the most sense.","","","The experience also reinforced for me a wholly separate point that I ought to mention: my time in Decentraland felt very lonely.","Yes, it’s launch day, and yes, users are separated into distinct realms by design to scale a higher number of users. But apart from the handful of users that I encountered – we exchanged, at most, “hello” to one another before moving on, I was alone in my wanderings.","Moving through the digital museum, I thought how great it would be to <i data-v-f87c67ca=\"\">share<\/i> that experience, talk about which artworks resonated with me the most, or maybe just stand there and take in a creative result in the presence of other people. Y’know, like being in a real museum.","Maybe that’ll be possible, one day. For the sake of the artists whose work is on display there, I certainly hope so.","I did encounter some technical issues and bugs during my time in Decentraland.","Apart from the aforementioned avatar bug, there were numerous times throughout where my browser would have an issue displaying Decentraland. This seemed to occur most during the especially busy or highly animated areas I visited, and was always resolved once I refreshed the page.","There were also points during which the camera would start to shake, particularly if I was standing on top of a structure. I played Decentraland almost completely in third-person mode, and all the times during which this issue cropped up were in that mode.","Some of the things I noticed were purely visual. For example, there were times when my avatar’s feet were obscured by the floor (pictured below), and other times when it seemed like my avatar was hovering above the ground. From a user perspective, this wasn’t a huge hindrance, and great graphics <i data-v-f87c67ca=\"\">do not<\/i> make for a great experience, but since we’re talking performance stuff here, it seems worth mentioning.","","","I did encounter a random error with a Decentraland-specific splash screen while wandering through a cool-looking forest area.","The screen advised me to reload, which I did, and things resumed just fine. I saw similar messages floating around Twitter as I explored, so whatever I ran into appears to be something that others have run up against as well.","Performance-wise, the game ran best for me at its lowest graphical settings, even when using a gaming-focus laptop with GTX 1060 graphics card. The frame rate fell when I shifted to the highest possible settings, and in the end, I left it on 'Medium' with only minimal choppiness.&nbsp;","Overall, these experiences gave the impression of an unfinished product. No company is free from bugs or errors – looking at you, Bethesda Studios – but for all the enjoyable things I encountered, I was nonetheless reminded of some alpha-level games I have tested in the past.","I could probably add another 1,000 words to this article about the neat things users have assembled in Decentraland. Suffice to say, it’s clear that some thought went into the actual user experience, but it still feels rugged and incomplete. The occasional bugs I encountered reinforced that impression and stuff like the HTC swag was a bit off-putting. Mostly it just felt empty, with its plots of unused land separating the developed areas, a state of affairs that, by the end of my tour, weighed on me a bit as a player.","But from a pure experience perspective, I do think that Decentraland is on to something.","Whether it succeeds is an entirely open question, and history, to be honest, is probably against them. Even the once-mighty World of Warcraft <a href=\"https:\/\/www.statista.com\/statistics\/276601\/number-of-world-of-warcraft-subscribers-by-quarter\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">has entered an extended twilight<\/a>, shedding users over the years even as it pushed more and more game-changing updates. I’m also inclined to lump in Elite Dangerous, an absolutely mammoth space simulation game <a href=\"https:\/\/steamcharts.com\/app\/359320\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">that plays home<\/a>&nbsp;to several thousand players at most on a given day.","People do appear to have bet on the success of Decentraland. As Camila Russo noted in The Defiant newsletter, <a href=\"https:\/\/nonfungible.com\/market\/history\/decentraland\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">NonFungible.com<\/a>&nbsp;reports more than $160,000 in LAND sales via 121 transactions in the past week. Over the past month, 467 transactions worth more than $500,000 have been conducted, per the site. There are also, apparently, <a href=\"https:\/\/twitter.com\/RocketNFT\/status\/1230512109672370176?s=20\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">virtual mortgages being offered<\/a> on Decentraland, indicating that people see such opportunity. And there was, of course, Decentraland’s <a href=\"https:\/\/www.coindesk.com\/26-million-blockchain-vr-project-decentraland-raises-new-funding-in-ico\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">2017 ICO<\/a> that raised more than 86,000 ETH at the time.","Is it going to work, though? Like many crypto-focused projects, Decentraland’s success would seem to hinge on people actually showing up and making use of it. Whether it becomes more than a virtual curiosity and evolves into an actual, living world seems far-fetched – but then again, so did bitcoin in the eyes of many in its early days.","I don’t think I’ll go back to Decentraland anytime soon. But I’ll be watching and waiting to see if people hitch their virtual wagons and begin to roll in.","<em data-v-f87c67ca=\"\">This review has been updated with additional information.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2017","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Steven Zheng","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"$160,000","content":"MONEY"},{"type":"Bethesda","content":"LOCATION"},{"type":"Crypto Valley Conference Center","content":"ORGANIZATION"},{"type":"Museum District","content":"ORGANIZATION"},{"type":"Decentraland","content":"ORGANIZATION"},{"type":"Crypto","content":"LOCATION"},{"type":"Second Life","content":"ORGANIZATION"},{"type":"Decentraland Convention Center","content":"ORGANIZATION"},{"type":"Sugar Club","content":"ORGANIZATION"},{"type":"Lamborghini","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Geordi LaForge","content":"PERSON"},{"type":"Satoshi","content":"PERSON"},{"type":"Decentraland’s Terms of Service","content":"ORGANIZATION"},{"type":"GTX","content":"ORGANIZATION"},{"type":"Camila Russo","content":"PERSON"},{"type":"$500,000","content":"MONEY"},{"type":"Peter Dhaliwal","content":"PERSON"},{"type":"HTC","content":"ORGANIZATION"},{"type":"Feb. 19","content":"DATE"},{"type":"Decentraland","content":"LOCATION"}],"hashtag":["DECENTRALAND"],"authors":["Michael McSweeney","The Block"]}