{"summary":"Lawmakers are vying to throw in crypto-related measures into end-of-year legislative packages, though more action will likely happen in 2024. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265769\/tensions-rise-as-us-lawmakers-work-to-get-crypto-provisions-into-end-of-year-bills","publishDate":"2023-12-01T17:37:40","id":5253,"type":null,"title":"Tensions rise as US lawmakers work to get crypto provisions into end-of-year bills","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">U.S. lawmakers are still vying to throw in crypto-related measures into end-of-year legislative packages, though industry sources say more action will likely happen in 2024.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">While&nbsp;<\/span>Republican House Speaker Mike Johnson's approach to a spending measure may mean there will be no larger \"omnibus\" bill where several measures can be thrown into at the end of the year, some crypto provisions may still end up in other end-of-year bills.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">The National Defense Authorization Act could include an amendment from Sens. Cynthia Lummis, R-Wyo., Kirsten Gillibrand, D-N.Y., Roger Marshall, R-Kan., and Elizabeth Warren, D-Mass., that <a href=\"https:\/\/www.gillibrand.senate.gov\/news\/press\/release\/gillibrand-lummis-warren-marshall-announce-senate-passage-of-amendment-to-ndaa-to-prevent-use-of-crypto-assets-in-illicit-financial-transactions\/#:~:text=The%20amendment%20requires%20regulators%20to,and%20anonymity%2Denhancing%20crypto%20assets.\" data-v-f87c67ca=\"\">would require<\/a> regulators to set up examination standards for financial institutions engaged in crypto activities while also requiring the Treasury Department to come up with recommendations to Congress on crypto mixers.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The amendment is still in flux, Sen. Lummis told reporters on Thursday at the Blockchain Association Policy Summit.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"I hear rumors, and that's all they are, that it may get caught up into some other negotiations and I don't know whether it's going to survive,\" Lummis said. \"But we should know more early next week.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The proposed amendment is something the crypto industry can accept, said Cody Carbone, vice president of policy for the Chamber of Digital Commerce. The crypto industry is less keen on a <a href=\"https:\/\/www.warren.senate.gov\/imo\/media\/doc\/Crypto%20AML%20One-Pager_7.26.23.pdf\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">bill<\/span><\/a> from Sen. Warren that aims to crack down on the use of crypto for money laundering and sanctions evasion in part by extending know-your-customer requirements to miners and wallet providers.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"We just don't want to create new standards and burdens on some of these players in the ecosystem that aren't relevant, which is what Warren's bill would do for miners and validators who don't work with customers,\" Carbone said. \"So we think this is a good compromise.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">One bill that Carbone said he would like to get added to the NDAA is the Financial Technology Protection Act, which creates a working <a href=\"https:\/\/www.budd.senate.gov\/press-releases\/budd-gillibrand-introduce-bipartisan-financial-technology-protection-act\/\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">group<\/span><\/a> with representatives from several federal agencies including Treasury to combat terrorism and illicit financing.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"We're hopeful and we've been advocating for that to get added,\" Carbone said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Crypto provisions could also be included in a final appropriations package, such as one from Rep. Josh Gottheimer, D-N.J., which would allocate $3 million to the Treasury Department for research and to work with blockchain analytics firms to help combat terrorist financing, Carbone said. Others that are more partisan, such as Republican Rep. Tom Emmer's provision to remove all funding from the Securities and Exchange Commission for crypto related enforcement actions, are unlikely to be included, Carbone said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Rep. Patrick McHenry, R-N.C., chair of the House Financial Services Committee, has meanwhile been pushing to include crypto legislation into the NDAA, according to multiple news reports. His committee advanced a market structure bill and another bill that would regulate stablecoins on the federal level during the summer and is awaiting a full House vote.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Those rumors are true, they are trying to push through either market structure or stablecoins, but the odds of that happening successfully are pretty rough but we'll see,\" said Ron Hammond, <\/span><span class=\"s3\" data-v-f87c67ca=\"\">director of government relations at the Blockchain Association.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">McHenry would still need buy in from Sen. Sherrod Brown, D-Ohio. Brown leads the Senate Banking Committee and has been critical of the crypto industry, recently calling for a <a href=\"https:\/\/www.theblock.co\/post\/259648\/sen-sherrod-brown-calls-for-crackdown-on-use-of-crypto-to-fund-terrorism\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">crackdown<\/span><\/a>.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Hammond said the stablecoin bill, which has a bit more of a buy in from top Democrats such as former House Financial Services Committee Chair Maxine Waters, D-Calif., could potentially slide into the NDAA. Odds are slim of getting either bill included in the NDAA, but the stablecoin provision is the more likely of the two given concerns around Tether's alleged use in illicit finance, Hammond said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">McHenry also went so far as to <span class=\"s2\" data-v-f87c67ca=\"\">threaten<\/span> to block bipartisan banking policy in the NDAA, including a bill introduced by Brown to combat the fentanyl crisis, this past week, according to <a href=\"https:\/\/punchbowl.news\/article\/mchenry-crypto-reform-legislation\/\" data-v-f87c67ca=\"\">Punchbowl News<\/a>. <\/span><span class=\"s1\" data-v-f87c67ca=\"\">The market structure and stablecoin bills are essentially McHenry's babies, the Chamber of Digital Commerce's Carbone said, though said it's likely that the industry could see a \"more dedicated legislative effort in 2024.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"These bills are definitely a priority for him and I think that we're seeing is that they are more of a priority than anyone expected,\" Carbone said. \"These are his babies and he is really dedicated to moving them so I think it makes sense that he is going to look for any vehicle possible to pass them.\"<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Warren","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Sherrod Brown","content":"PERSON"},{"type":"Hammond","content":"PERSON"},{"type":"N.J.","content":"LOCATION"},{"type":"Brown","content":"PERSON"},{"type":"Ron Hammond","content":"PERSON"},{"type":"Kirsten Gillibrand","content":"PERSON"},{"type":"Carbone","content":"PERSON"},{"type":"National Defense","content":"ORGANIZATION"},{"type":"Elizabeth Warren","content":"PERSON"},{"type":"N.Y.","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Blockchain Association Policy Summit","content":"ORGANIZATION"},{"type":"Chamber of Digital Commerce","content":"ORGANIZATION"},{"type":"Tom Emmer","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Wyo.","content":"LOCATION"},{"type":"$3 million","content":"MONEY"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"House","content":"ORGANIZATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"McHenry","content":"PERSON"},{"type":"Financial Technology Protection Act","content":"ORGANIZATION"},{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"Lummis","content":"PERSON"},{"type":"House Financial Services Committee Chair Maxine Waters","content":"ORGANIZATION"},{"type":"Roger Marshall","content":"PERSON"},{"type":"Senate Banking Committee","content":"ORGANIZATION"},{"type":"Warren","content":"ORGANIZATION"},{"type":"Mike Johnson","content":"PERSON"},{"type":"Cynthia Lummis","content":"PERSON"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"Punchbowl News","content":"ORGANIZATION"},{"type":"Mass.","content":"LOCATION"},{"type":"Josh Gottheimer","content":"PERSON"},{"type":"Cody Carbone","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Patrick McHenry","content":"PERSON"},{"type":"Ohio","content":"LOCATION"},{"type":"Calif.","content":"LOCATION"},{"type":"Kan.","content":"LOCATION"},{"type":"NDAA","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}