{"summary":"Safe Foundation, a proposed steward for the Gnosis Safe ecosystem, is plotting a $100 million token sale.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/134253\/safe-foundation-proposed-steward-of-the-gnosis-safe-ecosystem-plans-to-raise-100-million","publishDate":"2022-02-15T10:48:07","id":5259,"type":null,"title":"Safe Foundation, proposed steward of the Gnosis Safe ecosystem, plans to raise $100 million","category":["DEFI"],"content":["Safe Foundation, a proposed steward for the Gnosis Safe ecosystem, is plotting a $100 million token sale.","A document obtained by The Block shows that 8% of the total supply of SAFE tokens — a yet-to-be-launched governance token — have been earmarked for a sale to strategic investors. The raise would therefore value the project at $1.25 billion.","Safe Foundation has already secured $65 million worth of commitments from investors including 1kx, Dragonfly Capital, Coinbase Ventures, Blockchain Capital and Zee Prime.","But the sale will not close unless the Gnosis community — specifically, holders of its native token GNO — approve <a href=\"https:\/\/forum.gnosis.io\/t\/gip-29-spin-off-safedao-and-launch-safe-token\/3476\" data-v-f87c67ca=\"\">a proposal<\/a> to spin off Gnosis Safe from Gnosis Ltd, creating a new SAFE token and an entity named SafeDAO to govern it.&nbsp;Gnosis Safe is a popular multi-signature crypto management platform. There are currently more than $107 billion in ether and ERC20 tokens — those native to the Ethereum blockchain — stored on the network.","If the proposal goes ahead, Safe Foundation will be established alongside SafeDAO as a Swiss non-profit. At genesis, one billion SAFE tokens will be minted by the foundation. Its role will be to foster Gnosis Safe’s ecosystem while safeguarding some of the project’s key assets, such as IP, domain names, and GitHub repositories. The spin-off vote is set to be concluded in the coming weeks.","Lukas Schor, project lead of Gnosis Safe, said the tool has “clearly become critical infrastructure for Web3,” powering both DAOs and centralized exchanges.","“With the spin-off and token launch we aim to make Gnosis Safe a full community-run and owned project,” he said, explaining that Safe Foundation will help steward that transition.","“In the process of the spin-off we also aim to conduct a strategic token sale. The goal is to get strategic partners on board that believe in the potential of smart-contract-based accounts and have a strategic interest in the Gnosis Safe project,” Schor added.","He declined to comment on the specifics of the raise.","The document obtained by The Block shows that the proceeds of the token sale will go towards scaling core contributors on the network, funding Safe Foundation’s day-to-day operations, and providing three years of financial resources in fiat currency to guard against downturns in the crypto market.","But the lion’s share — some $65 million — will go towards ecosystem investments, grants and bounties. Safe Foundation will also set up incubation and accelerator programs.","“It is expected that the role of the Safe Foundation will decrease in importance over time, similar to the Ethereum Foundation, which was fundamental during the initial phase of Ethereum but also became less significant over time as the ecosystem became more decentralized,” said Schor.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$107 billion","content":"MONEY"},{"type":"Gnosis Ltd","content":"ORGANIZATION"},{"type":"8%","content":"PERCENT"},{"type":"$1.25 billion","content":"MONEY"},{"type":"$65 million","content":"MONEY"},{"type":"Gnosis","content":"PERSON"},{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"GitHub","content":"ORGANIZATION"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"Safe Foundation","content":"ORGANIZATION"},{"type":"Schor","content":"PERSON"},{"type":"Dragonfly Capital","content":"ORGANIZATION"},{"type":"Blockchain Capital","content":"ORGANIZATION"},{"type":"Lukas Schor","content":"PERSON"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}