{"summary":"The Steem community is planning a hard fork on Friday to remove Justin Sun’s Steemit Inc. The hard fork of Steem is planned for March 20 at 10 am EST, which will result in a new blockchain called “Hive,” according to SteemPeak, a front-end application for Steem.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/59079\/steem-community-plans-hard-fork-to-expel-justin-suns-steemit","publishDate":"2020-03-18T06:30:24","id":5261,"type":null,"title":"Steem community plans hard fork to expel Justin Sun’s Steemit","category":["LAYER 1S"],"content":["The Steem community - a group of members claiming to represent the Steem blockchain - are planning a hard fork to remove Justin Sun’s Steemit Inc.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe hard fork of Steem is <a href=\"https:\/\/steempeak.com\/communityfork\/@hiveio\/announcing-the-launch-of-hive-blockchain\" data-v-f87c67ca=\"\">planned<\/a> for March 20 at 10 am EST, which will result in a new blockchain called “Hive,” according to SteemPeak, a front-end application for Steem.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“Hive is a DPOS [Delegated Proof of Stake] governance blockchain created by implementing a hard fork of existing Steem code,” said SteemPeak, adding: “This new direction steps away from the burden of the Steemit Inc.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIn a separate post on Monday, leading validator of Steem, Blocktrades, <a href=\"https:\/\/steempeak.com\/steem\/@blocktrades\/why-i-won-t-be-compromising-with-justin-sun\" data-v-f87c67ca=\"\">said<\/a> Steemit Inc has \"nearly zero value now.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“When Justin [Sun] acquired it, Steemit absolutely had some strong value, in the form of intellectual property, branding, and experienced blockchain and frontend developers. But now, all the developers he acquired are gone (they’ve all quit),” said Blocktrades.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIt continued that the Steem community now “mostly wants nothing to do” with Sun and that some members of the community are even \"willing to pay him to leave.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSun’s Tron Foundation <a href=\"https:\/\/www.theblockcrypto.com\/linked\/56043\/blockchain-based-social-media-platform-steemit-to-transition-to-tron-blockchain\" data-v-f87c67ca=\"\">acquired<\/a> Steemit last month. The move has led to controversies since then. Most recently, Tron’s “<a href=\"https:\/\/www.theblockcrypto.com\/post\/57508\/tron-steem-takeover-crypto-exchanges-governance-reversal-soft-fork-blockchain\" data-v-f87c67ca=\"\">hostile takeover<\/a>” over the Steem network came under the limelight.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nTron and Steemit unilaterally enforced a hard fork with help from top exchanges, including Binance and Huobi, to remain in control of the Steem network.","Binance CEO Changpeng \"CZ\" Zhao <a href=\"https:\/\/www.theblockcrypto.com\/post\/57607\/justin-sun-stands-by-trons-decision-to-overturn-community-governance-rule\" data-v-f87c67ca=\"\">acknowledged<\/a> his approval of the hard fork in a tweet at the time. But he also suggested that Binance did not receive any monetary incentives from Tron and pledged neutrality.","\"Binance have no interest in chain governance. We stay neutral,\" CZ said at the time.","The “hostile takeover” resulted in a community outcry and the community now wants to move to the Hive blockchain.","“The initial Hive launch will be a direct copy of existing blockchain with a few small upgrades, which will allow us to get back to community discussion on the direction for future development, needed changes, and most wanted chain-level features,” said SteemPeak.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Steemit Inc","content":"ORGANIZATION"},{"type":"Justin [","content":"PERSON"},{"type":"Blocktrades","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Blocktrades","content":"LOCATION"},{"type":"Changpeng \"CZ\" Zhao","content":"PERSON"},{"type":"March 20","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Justin Sun’s Steemit Inc.","content":"ORGANIZATION"},{"type":"Steemit Inc.","content":"ORGANIZATION"},{"type":"Tron Foundation","content":"ORGANIZATION"},{"type":"Steem","content":"PERSON"},{"type":"Binance","content":"PERSON"}],"hashtag":["JUSTIN SUN"],"authors":["Yogita Khatri","The Block"]}