{"summary":"YoMix became a replacement to the sanctioned Sinbad mixer for North Korea’s Lazarus hacker group, Chainalysis said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277511\/lazarus-switched-to-yomix-after-sanctions-against-sinbad","publishDate":"2024-02-15T09:00:03","id":5262,"type":null,"title":"Lazarus switched to YoMix after sanctions against Sinbad mixer, Chainalysis says","category":["SECURITY"],"content":["<span data-v-f87c67ca=\"\">North Korean hackers are switching to new money laundering techniques and increasingly using cross-chain bridges, Chainalysis said in a <\/span><a href=\"https:\/\/www.chainalysis.com\/blog\/2024-crypto-money-laundering\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">report<\/span><\/a><span data-v-f87c67ca=\"\"> published Thursday.<\/span>","<span data-v-f87c67ca=\"\">The Lazarus Group, notorious for its hacks of crypto companies and protocols including Harmony, Coincheck, Atomic Wallet and many others, remains one of the most prolific attackers in crypto. While the group used to be an active user of the Tornado Cash mixing protocol and the Sinbad mixer, it's now switched to a a <\/span><span data-v-f87c67ca=\"\">new mixer called YoMix, Chainalysis found.<\/span>","<span data-v-f87c67ca=\"\">Over the course of 2023, inflows of funds to YoMix grew five times, Chainalysis said, adding that about one third came from wallets associated with crypto hacks.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The growth of YoMix and its embrace by Lazarus Group is a prime example of sophisticated actors’ ability to adapt and find replacement obfuscation services when previously popular ones are shut down,” the report said.<\/span>","<span data-v-f87c67ca=\"\">Lazarus has also been using cross-chain bridges, Chainalysis said. Bridging protocols have become significantly more popular among cybercriminals recently and received $743.8 million worth of crypto from crime-related addresses in 2023, which is twice as much as the $312.2 million in 2022.<\/span>","<span data-v-f87c67ca=\"\">“North Korea-affiliated hackers have been among those to utilize bridges for money laundering the most,” Chainalysis said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In 2023, blockchain wallets linked to illicit activities sent $22.2 billion worth of cryptocurrency to various platforms and services that allow to obfuscate the origins of the funds, including exchanges, mixers and DeFi platforms, Chainalysis said. The number is notably lower than the $31.5 billion in 2022.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In general, mixers seem to be getting less popular among cybercriminals, Chainlaysis found. In 2023, they received $504.3 million worth of crypto from crime-linked addresses, compared to $1 billion in 2022.<\/span>","<span data-v-f87c67ca=\"\">Centralized exchanges have remained the main destination for illicit funds over the past five years, Chainalysis said. In 2023, 71.7% of all illicit services went to only five centralized platforms, the firm said. According to Chainalysis data, 109 exchange deposit addresses received over $10 million worth of illicit crypto each, and $3.4 billion altogether in 2023.<\/span>","<span data-v-f87c67ca=\"\">“While that still represents significant concentration, in 2022, only 40 addresses received over $10 million in illicit crypto, for a collective total of just under $2 billion,” the report reads.<\/span>","<span data-v-f87c67ca=\"\">This level of concentration differs for different kinds of cybercrime, Chainalysis noted. For example, vendors of ransomware and child sexual exploitation materials demonstrate a high degree of concentration, with over a half of all funds going to just seven deposit addresses. Online scammers and darknet vendors, on the other hand, use more various deposit addresses for their illicit funds.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Overall, it’s possible that crypto criminals are diversifying their money laundering activity across more nested services or deposit addresses in order to better conceal it from law enforcement and exchange compliance teams. Spreading the activity across more addresses may also be a strategy to lessen the impact of any one deposit address being frozen for suspicious activity,” the report noted.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$312.2 million","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Lazarus Group","content":"ORGANIZATION"},{"type":"North Korea","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Coincheck","content":"LOCATION"},{"type":"$743.8 million","content":"MONEY"},{"type":"$504.3 million","content":"MONEY"},{"type":"Chainalysis","content":"PERSON"},{"type":"Sinbad mixer","content":"ORGANIZATION"},{"type":"71.7%","content":"PERCENT"},{"type":"$3.4 billion","content":"MONEY"},{"type":"$31.5 billion","content":"MONEY"},{"type":"$22.2 billion","content":"MONEY"},{"type":"$10 million","content":"MONEY"},{"type":"$2 billion","content":"MONEY"}],"hashtag":["HACKS","MIXERS"],"authors":["Anna Baydakova","The Block"]}