{"summary":"Centaur is the term coined by Bessemer Venture Partners for software-as-a-service startups that hit $100 million in annual recurring revenue.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/169134\/fireblocks-proclaims-centaur-status-with-100-million-in-annual-recurring-revenue","publishDate":"2022-09-12T04:44:17","id":5265,"type":null,"title":"Fireblocks proclaims &#x27;centaur&#x27; status with $100 million in annual recurring revenue","category":["COMPANIES"],"content":["Fireblocks, <a href=\"https:\/\/www.theblock.co\/post\/131952\/fireblocks-raises-550-million-in-series-e-funding-now-valued-at-8-billion\" data-v-f87c67ca=\"\">an $8 billion company<\/a> that builds tools for the secure storage and transfer of cryptocurrencies, announced Monday that it has reached so-called \"Centaur\" status with $100 million in annual recurring revenue (ARR).","The term \"Centaur\" <a href=\"https:\/\/www.bvp.com\/centaur\" data-v-f87c67ca=\"\">was coined<\/a> by Bessemer Venture Partners, and applies to software-as-a-service (SaaS) startups that hit the revenue milestone. The moniker is a spin on \"unicorn\" startups, a heavily-used term that refers to private tech companies with valuations in excess of $1 billion.&nbsp;","Fireblocks said its ARR has surpassed $100 million just four years after its inception and three years on from its first product coming to market. That puts it in the company of tech darlings like Slack and Twilio, which both reached Centaur status in under five years.&nbsp;The centaur announcement coincides with Fireblocks hosting a conference in Barcelona, where it has taken over the entire beachfront W Hotel.","\"We pioneered MPC [Multi-Party Computation] technology and it's become an industry status,\" Fireblocks co-founder and CEO Michael Shaulov told The Block in an interview. MPC enables multiple parties — each holding their own private data — to evaluate a computation without ever revealing any of the private data held by each party. It is seen as the gold standard for crypto key management and protection.","Shaulov said Fireblocks's ARR surpassed $100 million in the second quarter of this year. He declined to provide specific figures but said the company's revenue grew 600% last year, and is expected to grow 300% this year. As for revenue breakdown, Shaulov noted Fireblocks sells an annual license for using its MPC wallets and also offers other services such as decentralized finance and staking to institutional clients.","Fireblocks says it has over 1,500 institutional clients from traditional finance and crypto. Shaulov said the growth of traditional finance clients, including banks and payment service providers, has helped the company weather the crypto market downturn.","As for expansion plans, Fireblocks plans to double its engineering team this year from 150 to around 300, said Shaulov. The company currently employs 550 people, he added.","Fireblocks is also open to acquisitions in the security and development space but currently doesn't have any targets, according to Shaulov. It also has plans to go public in the future, with the option of tokenizing its shares, he added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"second quarter of this year","content":"DATE"},{"type":"Michael Shaulov","content":"PERSON"},{"type":"$100 million","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"600%","content":"PERCENT"},{"type":"300%","content":"PERCENT"},{"type":"Shaulov","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Centaur","content":"ORGANIZATION"},{"type":"Fireblocks","content":"ORGANIZATION"},{"type":"ARR","content":"ORGANIZATION"},{"type":"centaur","content":"ORGANIZATION"},{"type":"MPC","content":"ORGANIZATION"},{"type":"Bessemer Venture Partners","content":"ORGANIZATION"},{"type":"Barcelona","content":"LOCATION"},{"type":"$8 billion","content":"MONEY"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}