{"summary":"An analyst said that the approval of spot ETFs by the SEC has elevated the risk of shorting bitcoin by sophisticated market participants.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/272427\/spot-bitcoin-etfs-may-increase-short-trades-by-traditional-market-participants-analyst-says","publishDate":"2024-01-16T15:11:32","id":5267,"type":null,"title":"Spot bitcoin ETFs may increase short trades by traditional market participants, analyst says","category":["MARKETS"],"content":["The capacity for traditional market participants to make significant short bitcoin trades has been \"enhanced significantly\" by the approval of spot bitcoin ETFs, according to an analyst.","A <a href=\"https:\/\/www.theblock.co\/post\/272522\/blackrocks-spot-bitcoin-etf-saw-half-a-billion-dollars-in-inflows-in-first-two-days\" data-v-f87c67ca=\"\">spot bitcoin ETF<\/a>, similar to a stock, can be shorted, enabling investors to capitalize on anticipated price declines by selling borrowed ETF shares. The process of shorting an ETF would involve borrowing shares from a broker, selling them at the current market price, and later repurchasing them at a lower price to return to the lender.","\"This increased capacity to safely short bitcoin by traditional market participants is in part because the perceived risk of the share-borrow, and the collateral posted to support it, is now lower in the minds of these market participants, as compared to dealing with unregulated CeFi crypto lenders,\" crypto derivatives trader Gordon Grant told The Block.","Grant stressed that traditional stock market traders could recognize a major use-case in borrowing shares of new spot bitcoin ETF funds in order to short sell them, \"either outright or as a hedge mechanism for options.\"","Grant added that there is now the potential for the emergence of functional \"repo\" markets for spot bitcoin ETFs with top-tier equity trading counterparts. This development could foster a perception among market participants that there is now reduced counterparty risk when engaging in borrowing and lending mechanisms used for short positions.","\"In essence, whereas in the past, you had to feel comfortable with the credit risk of the CeFi desk of your choice, which obviously did not end well in many circumstances, the arrival of spot bitcoin ETFs should see counterparty risk palpably abate since it will be possible to gain short exposure to bitcoin in a way other than through borrowing and selling the actual token, trading on unregulated offshore exchanges, or having access to a commodities futures trading account via an FCM,\" Grant said.","Grant further explained that traders who seek passive yield could lend out ETF shares, for a market determined rate of interest. \"Traders could then easily borrow the ETF and sell it, with a much lower perceived counter party risk, because they are dealing with a regulated U.S. equity broker dealer or prime broker,\" Grant added.","However, Grant noted that the borrowing and shorting of shares is a normal facet of healthy, well functioning asset markets. \"It is also essential for supplemental considerations such as options trading, structured products, taking of directional leverage, and more complex instruments,\" he added.","If there is an excess supply of ETF shares in the market due to increased selling, the market price of the ETF may fall below its net asset value. This situation could present an arbitrage opportunity for market participants, who could buy the undervalued ETF shares, redeem them with the ETF issuer for the commensurate cash value of equivalent bitcoin.","Tuesday saw the third day of trading of <a href=\"https:\/\/www.theblock.co\/post\/272945\/grayscale-blackrock-and-fidelity-dominate-spot-etf-market-with-nearly-90-of-volume-on-third-day-of-trading\" data-v-f87c67ca=\"\">spot bitcoin ETFs<\/a>, and funds offered by Grayscale, <a href=\"https:\/\/www.theblock.co\/post\/272522\/blackrocks-spot-bitcoin-etf-saw-half-a-billion-dollars-in-inflows-in-first-two-days\" data-v-f87c67ca=\"\">BlackRock<\/a> and Fidelity are the clear leaders among the 11 funds currently trading.","(<em data-v-f87c67ca=\"\">This article was updated at 9.40 am UK time, adding that investors could redeem their ETF shares with the issuer for the commensurate cash value of equivalent bitcoin.<\/em>)","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Gordon Grant","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"FCM","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Grant","content":"PERSON"},{"type":"ETF","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Grant","content":"ORGANIZATION"}],"hashtag":["BITCOIN","CRYPTO MOVERS","ECONOMIC INDICATORS","SPOT BITCOIN ETF"],"authors":["Brian McGleenon","The Block"]}