{"summary":"ETH options on the CME reached new highs for the second month running. Analysts linked the increase to the Shapella upgrade.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228258\/ether-option-ethereum-cme","publishDate":"2023-04-26T13:52:14","id":5269,"type":null,"title":"ETH options reach new milestones on the CME amid Shapella upgrade","category":["MARKETS"],"content":["Ether options on the <a href=\"https:\/\/www.cmegroup.com\/\" data-v-f87c67ca=\"\">CME<\/a> continue to reach fresh highs, with analysts seeing the Ethereum blockchain's latest upgrade as a catalyst.","Volume has risen to $272 million so far this month, up from $94.7 million in March, according to The Block data. The 187% increase is being linked to the Ethereum blockchain's <a href=\"https:\/\/www.theblock.co\/post\/226036\/ethereum-shapella-upgrade-goes-live\" data-v-f87c67ca=\"\">Shapella<\/a> upgrade that enabled withdrawals of staked ether on the network for the first time.","Open Interest, the total number of contracts outstanding in the market, reached a fresh record of around $205 million.","\"Shapella was a de-risking event for Ethereum because it closed the loop on staking liquidity by allowing validators to finally withdraw their staked ether,\" Carlos Gonzalez, a research analyst at 21Shares, told The Block.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/options\/volume-and-oi-of-cme-ethereum-options\/embed\" title=\"Volume and OI of CME Ethereum options\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The liquidity risk for investors, particularly for institutions, has been reduced, which could have contributed to increased ether options and open interest, Gonzalez said.","\"Last week, we saw the highest amount of ETH being staked in a week,\" he added. \"The inflow was driven mainly by institutional-grade staking providers, including Stakefish, Staked.US, Kiln, Figment, and Bitcoin Suisse combined for 162,464 ETH staked in the last seven days.\"","Beyond the Shapella upgrade, the 30-day moving average of ether's spot-to-futures volume is nearing a three-year low, according to The Block data. This means that futures activity has been increasing faster than the demand from spot buyers, Gonzalez noted.","\"The ratio has stayed in a somewhat tight band since September 2022 (the date of the Merge), suggesting that the system has become more leveraged as investors speculate on how proof-of-stake and staking withdrawals will impact Ethereum's future,\" he said.","As more traditional finance firms enter the market in the U.S. with structured products using proven options strategies, Dunn anticipates a further surge in interest, according to Michael Dunn, chief product officer at Bitnomial.","“We’re seeing increasing demand for crypto options, especially ether, as investors are actively seeking ways to earn yield on their assets,\" he told The Block.&nbsp;","Ether options on the CME launched in August of last year, shortly before The Merge — when the blockchain moved to a proof-of-stake consensus mechanism.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dunn","content":"PERSON"},{"type":"$94.7 million","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bitcoin Suisse","content":"ORGANIZATION"},{"type":"Last week","content":"DATE"},{"type":"last seven days","content":"DATE"},{"type":"Bitnomial","content":"ORGANIZATION"},{"type":"187%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Carlos Gonzalez","content":"PERSON"},{"type":"$205 million","content":"MONEY"},{"type":"Michael Dunn","content":"PERSON"},{"type":"September 2022","content":"DATE"},{"type":"$272 million","content":"MONEY"},{"type":"Gonzalez","content":"PERSON"},{"type":"CME","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":["ANALYST REPORTS","CRYPTO MOVERS","ETHEREUM"],"authors":["Adam Morgan McCarthy","The Block"]}