{"summary":"Sir Anthony Hopkins is launching an NFT collection on Thursday that promises some randomly selected holders Zoom meetings with the two-time Oscar winning actor.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176922\/fancy-a-zoom-call-with-hannibal-lecter-theres-an-nft-for-that","publishDate":"2022-10-13T08:49:33","id":5270,"type":null,"title":"Fancy a Zoom call with Hannibal Lecter? There&#x27;s an NFT for that","category":["NFTS"],"content":["Sir Anthony Hopkins is launching an NFT collection on Thursday which promises randomly selected holders Zoom meetings with the two-time Oscar winning actor.","Perhaps best known for his role as Hannibal Lecter in the film Silence of the Lambs, 84-year-old Hopkins’ collection, The Eternal, is currently emblazoned on the homepage of OpenSea ahead of its mint later today.","The 1,000-strong collection “immortalizes Sir Anthony Hopkins’ diverse archetypal interpretations of The Eternal: The Jester, The Lover, The Rebel, The Hero, The Ruler, The Sage, The Magician, The Giver, The Explorer, and The Creator,” the description reads.","The collection is promising some interesting utility for the select few. Holders of ten unique signature animation NFTs will get a discussion with the knighted actor via Zoom and an autographed Dreamscapes Art Book, featuring hundreds of full-color images of paintings and drawings by Hopkins himself.","Five randomly selected holders owning one the remaining 990 unique one-of-a-kind images collections will get a group Zoom call with Hopkins.","One holder will snag the top prize: a “once-in-a-lifetime” one-on-one Zoom call with Hopkins. The conversation will be recorded and posted on his social media.","The NFTs will set buyers back 0.25 ETH, or around $300 at today's prices. There will be a limit of three per wallet.&nbsp;","Hopkins joins a rash of celebs toying with their own NFT projects. Among others, earlier this year, Paris Hilton partnered with metaverse platform The Sandbox to launch NFTs and hold virtual parties. Rapper Snoop Dogg also announced plans to turn Death Row Records, a record label that he acquired from <span id=\"SpecialReportArticle-QuoteInBody-7\" class=\"QuoteInBody-quoteNameContainer\" data-test=\"QuoteInBody\" data-v-f87c67ca=\"\">Blackstone-con<\/span>trolled MNRK Music Group, into an “NFT label.”","Nevertheless, The Block suggests winners enjoy the Zoom call with some fava beans and a nice Chianti.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Anthony Hopkins","content":"PERSON"},{"type":"$300","content":"MONEY"},{"type":"MNRK Music Group","content":"ORGANIZATION"},{"type":"Blackstone","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Rapper Snoop Dogg","content":"ORGANIZATION"},{"type":"Chianti","content":"LOCATION"},{"type":"Hopkins","content":"PERSON"},{"type":"Paris Hilton","content":"LOCATION"},{"type":"Death Row Records","content":"ORGANIZATION"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}