{"summary":"Anderson Kill partner Robert Cornish explores the legal contours of margin debt and trading in the crypto space.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/60145\/living-on-the-edge-understanding-margin-debit-rights-and-obligations","publishDate":"2020-03-27T10:27:17","id":5271,"type":null,"title":"Living on the edge: understanding margin debit rights and obligations","category":["MARKETS"],"content":["<em data-v-f87c67ca=\"\">Robert Cornish is a partner at Anderson Kill, a Washington, D.C.-based law firm.&nbsp;<\/em>","Recent financial market events have been quantitatively compared with the 1987 corrections in the equity and bond markets. Many industry players in the digital assets industry likely were not around to witness the proliferation of margin debit cases involving retail customers and modest institutional investors, many involving options and commodities trading.","The financial markets are clearly different than they were over three decades ago. Yet, some core principles remain concerning margin that both investors and industry participants need to keep in mind.","First and foremost: the use of margin or leverage is not “free money” in the digital assets arena.","Other than in private funds and, to a degree, the modest markets of futures on cryptocurrency such as bitcoin, there are few if any inherently “leveraged” positions or contracts available to investors. This means that investors in digital assets who seek to utilize leverage are borrowing money from an exchange or brokerage at a rate of interest they are obligated to pay. In turn, the brokerage or exchange makes money on the spread between its wholesale lending rate and the “margin lending” rate. The customer’s borrowing of money is secured in whole or part through recourse to that customer’s assets as provided in a customer agreement or margin agreement.","What this means to customers is that if you borrowed money and your positions cannot cover the entire cost of borrowing, you as the customer are personally on the hook to pay your lender what was borrowed. If one is running a brokerage or exchange, those customers who do not have positions to collateralize margin lending likely have a direct legal obligation to pay back their borrowings through other means and other assets. Other than the liquidation of assets, margin debits are enforced through courts or arbitration proceedings. This applies even if one or both of the parties to a margin agreement are bankrupt.","The most recent example of extensive margin debit collection in the bankruptcy context in the United States involved MF Global. Even those customers who had margin debits that were not the subject of collection action prior to the MF Global bankruptcy had obligations to cover their balances by order of a US bankruptcy court.","In the digital assets space, other considerations may complicate issues regarding margin.","For example, there are non-US “offshore” exchanges that may well be handling accounts offering outlandish leverage rates otherwise prohibited in a customer’s country of origin. May improper registration status of an exchange render enforcement of a margin debit impossible due to “unclean hands” or illegality? How are these issues balanced with the monetary benefits that a customer may have already received by virtue of the extension of margin?","Precedent offers scant guidance. Compounding matters further are customer agreements that may have unclear dispute resolution mechanisms in remote jurisdictions or, perhaps, no such mechanisms at all. And if there are no such mechanisms, may the brokerage or exchange avail itself of equitable remedies in a jurisdiction where a customer has assets? This is particularly important for those firms and clients with a nexus to either (a) the State of New York, which has some of the more powerful pre-judgment asset attachment provisions in the United States via CPLR Articles 62 and 75 or (b) the United Kingdom, which through Mareva Injunction proceedings may enable worldwide freezing of assets.","All of this being said, there is one interesting aspect of margin debit collection that provides a glimmer of hope for the wiped-out investor.","As the Commodities Futures Trading Commission (CFTC) in the United States has found in its sweep of boiler-room physical metals traders in South Florida, there are firms out there that purport to offer margin privileges and facilitate trading without actually ever borrowing any money. Essentially, fake margin privileges facilitating fictitious trading that has no paper trail provides no grounds to enforce parallel margin obligations. In the decentralized world of digital assets, delivery and possession of positions can and should be easily traceable.","If one has not noticed the continued use of the term “margin” versus “credit” in this article, it is purely intentional. Given the CFTC’s classification of cryptocurrencies as commodities, the use of “credit” such as through credit cards to facilitate trading is fraught with legal and regulatory risks of extraordinary complexity. Whether a digital brokerage finds itself ahead of or behind a credit card provider through which a client funded their trading activities will depend on a variety of factors, including the respective customer agreements of the brokerage and the credit card provider. If one is running an exchange or brokerage that permits trading through credit cards, recent market events should hopefully cause a reevaluation of that business model.","Notwithstanding, both customers and industry participants need to be aware of their rights and obligations when it comes to margin privileges. There is no such thing as free money, nor should there be.","This is especially so for industry participants living on the edge of the new frontiers of nascent, volatile digital markets who may now need to enforce collection obligations.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"1987","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"Anderson Kill","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Commodities Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Robert Cornish","content":"PERSON"},{"type":"South Florida","content":"LOCATION"},{"type":"D.C.","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"United Kingdom","content":"LOCATION"}],"hashtag":["CRYPTO"],"authors":["Robert Cornish","The Block"]}