{"summary":"The group and other plaintiffs sued Treasury, arguing that the sanctions, “exceeded their statutory authority because Tornado Cash is used to complete functions that do not include &#x27;any property in which any foreign country or a national thereof has any interest.&#x27;”","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176701\/coin-center-sues-treasury-over-tornado-cash-sanctions","publishDate":"2022-10-12T12:46:09","id":5272,"type":null,"title":"Coin Center sues Treasury over Tornado Cash sanctions","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">Washington, D.C.-based policy nonprofit Coin Center is suing the Treasury Department over its sanctioning of Tornado Cash, the open source software that can be used to anonymize transactions on the Ethereum blockchain.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Treasury’s August sanctioning of the transaction mixer, “<\/span><span data-v-f87c67ca=\"\">exceeded their statutory authority because Tornado Cash is used to complete functions that do not include 'any property in which any foreign country or a national thereof has any interest,'” the co-plaintiffs argue in their <a href=\"https:\/\/www.coincenter.org\/app\/uploads\/2022\/10\/1-Complaint-Coin-Center-10-12-22.pdf\" data-v-f87c67ca=\"\">brief<\/a>. Joining Coin Center on the suit are an anonymous human rights advocate based in the Southeastern United States, a software developer who used the Ethereum blockchain, and David Hoffman, a digital asset manager.<\/span>","<span data-v-f87c67ca=\"\">The lawsuit is the <\/span><a href=\"https:\/\/www.theblock.co\/post\/168502\/backed-by-coinbase-employees-sue-treasury-to-roll-back-tornado-cash-sanctions\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">second<\/span><\/a><span data-v-f87c67ca=\"\"> against the Treasury Department over the sanctioning. U.S. crypto giant Coinbase is backing a lawsuit filed last month by six individuals who used the software, including two Coinbase employees.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Challenges to Treasury’s sanctioning of the software could be <\/span><a href=\"https:\/\/www.theblock.co\/post\/170234\/170234\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">landmark<\/span><\/a><span data-v-f87c67ca=\"\"> cases for blockchains. The nonprofit and Coinbase-backed lawsuits seek to convince the court that the government overstepped its authority in targeting software, rather than an individual or entity, as well as overstepping the statutory language and intent giving Treasury the power to issue economic sanctions.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Americans use Tornado Cash unilaterally to protect their own property,” the suit continues. Treasury’s “defiance of this statutory element assumes an authority that would give them virtually unlimited control to regulate the American economy.”<\/span>","<span data-v-f87c67ca=\"\">The plaintiffs also state that the mixer is necessary to protect their right to privacy.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“<\/span><span data-v-f87c67ca=\"\">If a user doesn’t take proactive steps to protect his privacy, the ledger’s transparency allows strangers to track his private associations and stalk his intimate relations,” Coin Center and the other plaintiffs assert. “It invites publicization of and retaliation for his private contributions to unpopular causes. And it allows anyone to see whether he has a lot of assets, which would put a target on his back.”<\/span>","<span data-v-f87c67ca=\"\">The suit has been filed with the U.S. District Court for the Northern District of Florida. <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"David Hoffman","content":"PERSON"},{"type":"Coinbase","content":"PERSON"},{"type":"Southeastern United States","content":"LOCATION"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Northern District of Florida","content":"ORGANIZATION"},{"type":"D.C.","content":"LOCATION"},{"type":"August","content":"DATE"}],"hashtag":["ETHEREUM","SANCTIONS"],"authors":["Colin Wilhelm","The Block"]}