{"summary":"The regulator, however, said Spark Fintech Ltd., a separate Bybit entity in Hong Kong, was not involved in the alerted activities.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282740\/hong-kong-regulator-lists-bybit-as-suspicious-crypto-trading-platform-in-latest-alert","publishDate":"2024-03-15T01:16:16","id":5273,"type":null,"title":"Hong Kong regulator lists Bybit as ‘suspicious’ crypto trading platform in latest alert","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Cryptocurrency exchange Bybit was <a href=\"https:\/\/www.sfc.hk\/en\/alert-list\/3015\" data-v-f87c67ca=\"\">classified<\/a> as a \"<\/span><span data-v-f87c67ca=\"\">suspicious\" crypto trading platform by Hong Kong’s financial regulator, even as the firm’s local entity, Spark Fintech, submitted its crypto exchange license application earlier this year.<\/span>","<span data-v-f87c67ca=\"\">The Hong Kong Securities and Futures Commission on Thursday <\/span><a href=\"https:\/\/www.sfc.hk\/en\/alert-list\/3015\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">updated<\/span><\/a><span data-v-f87c67ca=\"\"> its list of “suspicious virtual asset trading platforms” to include Bybit. The SFC also identified 11 products offered by Bybit as suspicious.<\/span>","<span data-v-f87c67ca=\"\">The “suspicious” investment products are Bybit Futures Contracts and Inverse Futures Contracts, Bybit Options, Bybit Leveraged Tokens, Dual Asset, Dual Asset 2.0, Bybit Shark Fin, Liquidity Mining, ETH 2.0 Liquid Staking, Bybit Web3 Staking, Bybit Lending, and Bybit Wealth Management, according to the SFC’s website.<\/span>","<span data-v-f87c67ca=\"\">“The SFC is concerned that these products have also been offered to Hong Kong investors and wishes to make it clear that no entity in the Bybit group is licensed by or registered with the SFC to conduct any ‘regulated activity’ in Hong Kong,” the SFC said in a <\/span><a href=\"https:\/\/apps.sfc.hk\/edistributionWeb\/gateway\/EN\/news-and-announcements\/news\/doc?refNo=24PR47\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">statement<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">“At this time, we are unable to comment on any specific product or regulatory inquiry,” a Bybit spokesperson said in a statement shared with The Block. “Since different products are listed for various regions to meet local compliance requirements, you can be confident that these products are not available in the Hong Kong market.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The regulator noted that the aforementioned activities were conducted by bybit.com, operated by Bybit Fintech Limited, a Seychelles company. That’s distinct from the separate website bybit.com.hk, which is managed by Spark Fintech Limited, a Bybit entity incorporated in Hong Kong.<\/span>","<span data-v-f87c67ca=\"\">In January, Spark Fintech submitted its license application with the SFC to operate as a “virtual asset trading platform,” according to the regulator’s <\/span><a href=\"https:\/\/www.sfc.hk\/en\/Welcome-to-the-Fintech-Contact-Point\/Virtual-assets\/Virtual-asset-trading-platforms-operators\/Lists-of-virtual-asset-trading-platforms\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">list<\/span><\/a><span data-v-f87c67ca=\"\"> of applicants.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Bybit Wealth Management","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"SFC","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Spark Fintech","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Bybit Fintech Limited","content":"ORGANIZATION"},{"type":"Bybit Shark Fin","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Spark Fintech Limited","content":"ORGANIZATION"},{"type":"Seychelles","content":"LOCATION"},{"type":"Hong Kong Securities and Futures Commission","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"}],"hashtag":["ASIAN REGULATION"],"authors":["Timmy Shen","The Block"]}