{"summary":"After a triumphant conclusion of two major blockchain conferences back-to-back and USDD now actively staking across multiple DeFi platforms, TRON is continuing to build, enhance, and evolve its ecosystem and expand its team.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/155533\/usdd-now-staking-across-multiple-defi-platforms-tron-concludes-blockchain-conferences-as-team-expands","publishDate":"2022-07-02T05:30:25","id":5274,"type":null,"title":"USDD Now Staking Across Multiple DeFi Platforms, TRON Concludes Blockchain Conferences as Team Expands","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">After a triumphant conclusion of two major blockchain conferences back-to-back and <\/span><a href=\"https:\/\/usdd.io\/#\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">USDD<\/span><\/a><span data-v-f87c67ca=\"\"> now actively staking across multiple DeFi platforms, <\/span><a href=\"https:\/\/trondao.org\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">TRON<\/span><\/a><span data-v-f87c67ca=\"\"> is continuing to build, enhance, and evolve its ecosystem and expand its team.<\/span>","<span data-v-f87c67ca=\"\">Since its May 5 launch, <\/span><a href=\"https:\/\/usdd.io\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">USDD<\/span><\/a><span data-v-f87c67ca=\"\"> has been on a growth streak, joining the league of global crypto heavyweights. USDD has been made available on numerous DeFi sites throughout the ecosystem, where you can stake USDD paired with various tokens.<\/span>","<span data-v-f87c67ca=\"\">TRON attended the <\/span><a href=\"https:\/\/www.coindesk.com\/consensus2022\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Consensus 2022 Presented by CoinDesk<\/span><\/a><span data-v-f87c67ca=\"\"> from June 9 to 12 in Austin, Texas. TRON was as hot as the Texas heat wave as its swag was flying off the shelves to the hungry hands. At the same time, swarms of people crowded around the booth wanting to know more about TRON and the first over-collateralized decentralized stablecoin, USDD.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Attendees also got to experience TRON’s unique Immersive Screen, where you could step inside and personally engage with TRON’s rich history and accomplishments as digitalized blockchains wrapped around you. Folks also had the pleasure of taking photos with the TRON&nbsp; Bull, who created a buzz everywhere they wandered.<\/span>","<span data-v-f87c67ca=\"\">Next, the TRON team flew to attend the <\/span><a href=\"https:\/\/www.nft.nyc\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">NFT.NYC Conference 2022<\/span><\/a><span data-v-f87c67ca=\"\">, the 4th Annual NFT Industry Event from June 20 to 23 in New York City, New York. TRON took over the entire 7th floor and displayed its main attraction, the Floating Neon TRON Diamond. It included two screens to display TRON and <\/span><a href=\"https:\/\/apenft.io\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">APENFT Marketplace<\/span><\/a><span data-v-f87c67ca=\"\">’s facts, thrilling, action-packed music, and a stage for attendees to take photos and dance with the crowd's favorite TRON Bull. There was as much hype and excitement on the TRON floor as the energy in Times Square.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">During the two conferences, it was also a chance to let other tech enthusiasts know that TRON’s team is expanding and offers a unique opportunity – to work directly with a Layer 1 Blockchain and touch every corner of our industry. TRON has a fun, diverse, and challenging work environment that fosters creativity, efficiency, and teamwork.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">TRON has been thriving amidst a market for rescinded job offers and staff cuts, and is taking this opportunity to scale up - despite a steep decline in overall crypto market cap under heightened volatility - to align its internal culture around a set of shared values. TRON remains driven and forward-thinking as it enforces its mission to accelerate the decentralization of the internet via decentralized applications (dApps) and blockchain technology.<\/span>","<span data-v-f87c67ca=\"\">View more open positions <\/span><a href=\"https:\/\/boards.greenhouse.io\/rainberry\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">here<\/span><\/a><span data-v-f87c67ca=\"\">. Join TRON and BUIDL the future of Web3.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York City","content":"LOCATION"},{"type":"June 20","content":"DATE"},{"type":"May 5","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Austin","content":"LOCATION"},{"type":"June 9","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"Blockchain","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"TRON Bull","content":"ORGANIZATION"},{"type":"4th Annual NFT Industry Event","content":"ORGANIZATION"},{"type":"USDD","content":"ORGANIZATION"},{"type":"TRON&nbsp; Bull","content":"ORGANIZATION"},{"type":"TRON","content":"ORGANIZATION"},{"type":"Times Square","content":"ORGANIZATION"},{"type":"Floating Neon TRON Diamond","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}