{"summary":"GSR’s Rich Rosenblum says Bitcoin and the broader crypto market are not in a bear market but rather a period of stasis.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/112066\/bitcoin-price-bear-market-with-gsr","publishDate":"2021-07-21T12:13:53","id":5277,"type":null,"title":"Bitcoin price swings show market is in stasis state, says GSR exec","category":["THE BLOCK"],"content":["<i data-v-f87c67ca=\"\">Episode <\/i><strong data-v-f87c67ca=\"\">41<\/strong><i data-v-f87c67ca=\"\">&nbsp;of Season 3 of The Scoop was recorded remotely with The Block’s Frank Chaparro and Rich Rosenblum, Co-founder and CEO of GSR Markets. <\/i>","<i data-v-f87c67ca=\"\">Listen below, and subscribe to The Scoop on <\/i><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Apple<\/i><\/a><i data-v-f87c67ca=\"\">, <\/i><a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Spotify<\/i><\/a><i data-v-f87c67ca=\"\">, <\/i><a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Google Play<\/i><\/a><i data-v-f87c67ca=\"\">, <\/i><a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Stitcher<\/i><\/a><i data-v-f87c67ca=\"\"> or wherever you listen to podcasts. Email feedback and revision requests to <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"2d5d42494e4c5e596d5945484f41424e464e5f545d5942034e4240\">[email&nbsp;protected]<\/a>.<\/i>","<strong data-v-f87c67ca=\"\">This episode is brought to you by our sponsors <a href=\"http:\/\/eventussystems.com\/\" data-v-f87c67ca=\"\">Eventus<\/a>, <a href=\"http:\/\/kraken.com\/scoop\" data-v-f87c67ca=\"\">Kraken<\/a>, and Exodus<\/strong>","<em data-v-f87c67ca=\"\">Eventus is the leading global provider of multi-asset class trade surveillance, transaction monitoring and market risk solutions. Eventus offers a powerful, award-winning trade surveillance platform that is easy to deploy, customize and operate. Eventus is proven in the most complex, high-volume and real-time environments and supports many of the industry’s leading crypto exchanges including Coinbase, Gemini, ErisX and OSL. The company’s rapidly growing client base relies on Eventus’ responsive support and product development teams to overcome its most pressing regulatory challenges.<\/em>","<strong data-v-f87c67ca=\"\">About Kraken<\/strong>","<em data-v-f87c67ca=\"\">Whether you’re an experienced crypto trader or just starting out, Kraken has the tools to help you achieve financial freedom. With 50+ cryptocurrencies to choose from, industry-leading security and a wide variety of features to suit any investing strategy, Kraken puts the power in your hands to buy, sell and trade digital assets. Visit <\/em><a href=\"http:\/\/kraken.com\/scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Kraken.com<\/em><\/a><em data-v-f87c67ca=\"\"> to get started today.<\/em>","<strong data-v-f87c67ca=\"\">About Exodus<\/strong>","&nbsp;","<span data-v-f87c67ca=\"\">GSR’s Rich Rosenblum doesn’t seem to mind the volatility.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On this week’s episode of The Scoop, GSR Markets co-founder and President Rich Rosenblum, joined host Frank Chaparro for a discussion on the state of the bitcoin market.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The price of the cryptocurrency has been gyrating over the course of the last several weeks, even dropping below $30,000 on Tuesday. That bearish price activity, however, is happening against a backdrop of crypto firms raising hundreds of millions in equity financing.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Rosenblum cut his teeth as an oil trader at Goldman Sachs before launching the crypto trading firm and market maker GSR in 2013. Today, GSR trades billions of dollars worth of crypto. He said what we are seeing is not a bear market.<\/span>","<span data-v-f87c67ca=\"\">“I'd say we're in more of a stasis. I think that the market is getting more iterated, more complex than ‘do I buy it and hold it for this rampant bear market or do I get short?’ I think we're a bit in between here.”<\/span>","<span data-v-f87c67ca=\"\">Indeed, the private market in crypto startups is heating up, with FTX announcing its own $900 million Series B raise this week. In total, data from The Block Research shows companies have raised $6.2 billion this year. Rosenblum added:<\/span>","<span data-v-f87c67ca=\"\">“So I do think that the drop in the market really isn't evident for what I think is going to happen in the future of prices. If you look at private market valuations, many of these valuations are up 50 percent or doubled in the past two or three months. So, certainly the private equity companies that are coming to the space and looking there, they've got more firepower than the VC’s and they're not afraid to spend. So there's a lot of building, but the price of a token dropping by 50 percent in two or three months, I think it's pushed away not only in retail, but some of the institutional investors. So the token landscape is a little bit quieter. But as say, it's down but not out.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">We also discuss:<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$900 million","content":"MONEY"},{"type":"GSR","content":"ORGANIZATION"},{"type":"$30,000","content":"MONEY"},{"type":"Rosenblum","content":"PERSON"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Gemini","content":"LOCATION"},{"type":"2013","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"OSL","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Rich Rosenblum","content":"PERSON"},{"type":"Spotify","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"$6.2 billion","content":"MONEY"},{"type":"50 percent","content":"PERCENT"},{"type":"Frank Chaparro","content":"PERSON"}],"hashtag":["BITCOIN"],"authors":["Frank Chaparro","The Block"]}