{"summary":"MDH is purchasing more mining equipment and space for its operations as it braces for a halving of bitcoin rewards that can be reaped through mining","author":["Elizabeth Napolitano","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282923\/marathon-digital-holdings-bitcoin-mining-90-million-halving","publishDate":"2024-03-15T15:57:08","id":528,"type":null,"title":"Marathon Digital Holdings strikes $87 million equipment deal before bitcoin halving","category":["Companies"],"content":["Marathon Digital Holdings (MDH) is building out its crypto mining resources as it prepares to weather a scheduled change to the bitcoin blockchain's programming that could reduce its profits.&nbsp;","In a release on Thursday, the company announced that it will purchase a 200-megawatt data center in Texas for $87.3 million. This will also significantly change how Marathon does its mining.","\"Following the close of this acquisition and the anticipated expansion of the site in 2024, Marathon will have increased the number of megawatts in its mining portfolio to 1.1 gigawatts, 54% of which will reside on sites directly owned and operated by the Company,\" Marathon said in its press release.&nbsp;","Currently, just 3% of its mining is on facilities owned and operated by Marathon.&nbsp;","The added capacity increase will help Marathon mine larger bitcoin volumes, helping offset potential profit losses posed by a drastic <a href=\"https:\/\/www.theblock.co\/halving\" data-v-f87c67ca=\"\">halving of bitcoin rewards<\/a> for miners in April.&nbsp;","MDH's stock is trading at $19.64, up nearly 8% as of the time of writing.","Marathon is one of the few large public mining companies to weather the most recent bout of \"crypto winter\" and continue operating as bitcoin prices reached new all-time highs in 2024. Competitors such as Celsius Mining and Compute North filed for bankruptcy over the past couple of years, clearing the path for MDH to gain a lead against its former competitors in a once-crowded field.&nbsp;","<a href=\"https:\/\/www.theblock.co\/price\/248348\/bitcoin-btc-usd\" data-v-f87c67ca=\"\">The Block's BTC price page<\/a> shows that bitcoin was trading at $68,798 on Friday at 3:53 p.m. EDT, down 1.5% from the previous day."],"hashtag":["MINING COMPANIES"]}