{"summary":"Users who created NFTs on the Ethereum Mainnet or Optimism&#x27;s Superchain before Jan. 10 are eligible to claim rewards. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278251\/optimism-distributes-over-10-million-op-worth-nearly-41-million-in-fourth-airdrop","publishDate":"2024-02-20T15:17:13","id":5280,"type":null,"title":"Optimism distributes over 10 million OP worth nearly $41 million in fourth airdrop","category":["LAYER 2S AND SCALING"],"content":["Layer 2 network Optimism announced its fourth airdrop, which focuses on rewarding web3 artists.","The airdrop disseminated 10,343,757.81 OP, worth roughly $40.8 million, to 22,998 addresses, according to an official <a href=\"https:\/\/app.optimism.io\/airdrops\/4\" data-v-f87c67ca=\"\">release<\/a>. Users have until Feb. 13, 2025 to claim the tokens.","\"A great society needs artists,\" Optimism wrote in an <a href=\"https:\/\/app.optimism.io\/airdrops\/4\" data-v-f87c67ca=\"\">airdrop<\/a> claim page. \"This airdrop is a thank you to the artists and their ability to bring creativity onchain. Your contributions play a vital role in the Optimism Collective.\"","Users who created NFT art from Jan. 10, 2023 to Jan. 10, 2024 on the Ethereum mainnet or Optimism's <a href=\"https:\/\/www.theblock.co\/learn\/251461\/what-is-optimism-and-how-does-it-work\" data-v-f87c67ca=\"\">Superchain<\/a>, an interconnected series of Layer 2 networks, were eligible for the airdrop.&nbsp;","The airdrop rewarded NFT creators based on how much gas other users spent while minting or trading their NFTs; the more popular the NFT project, the more rewards the NFT creator is eligible for. A user's NFTs causing 1 ETH worth of gas on Optimism's Superchain netted the individual 5,000 OP, and accruing 1 ETH of gas on the Ethereum mainnet gave them 50 OP. Final rewards maxed out at 6,000 OP ( about $23,640) per address.","Token allocations for users could be increased by 50% or multiplied by 1.5 through bonus eligibility, which includes creating an NFT contract before Jan. 10, 2023, having an NFT they created transferred after Nov. 11, 2023, being active on the Superchain since Nov. 11, 2023 or if collectors spent more than 0.0005 ETH to transfer one of their NFTs since July 14, 2023. The extent of the increase depends on the number of qualifying bonus activities.","Optimism's first airdrop occurred on May 31, 2022, followed by a second on Feb. 8, 2023 and a third on Sept. 13, 2023. The third airdrop gave out 19.4 million OP worth $26 million at the time to nearly 32,000 addresses that engaged in the delegation activities of the Optimism Collective, the platform's DAO, <a href=\"https:\/\/www.theblock.co\/post\/251626\/optimism-third-airdrop\" data-v-f87c67ca=\"\">The Block previously reported<\/a>.&nbsp;","Optimism has roughly 560 million OP remaining for future airdrops, it <a href=\"https:\/\/twitter.com\/Optimism\/status\/1760002867581333594\" data-v-f87c67ca=\"\">noted<\/a> on the social media platform X. \"Multiple drops allow us to refine this mechanism, fostering positive-sum behavior,\" Optimism continued.","The OP token trades at $3.94 at 1:47 p.m. ET on Feb. 20, after seeing a 0.71% increase in the past 24 hours, according to The Block's Price page for the <a href=\"https:\/\/www.theblock.co\/price\/248388\/optimism-op-usd\" data-v-f87c67ca=\"\">token<\/a>. OP has a circulating supply of 957.4 million and total supply of 4.3 billion.","<span data-v-f87c67ca=\"\">Price behavior of OP. Image: The Block Prices<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Feb. 20","content":"DATE"},{"type":"$26 million","content":"MONEY"},{"type":"Feb. 13, 2025","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Sept. 13, 2023","content":"DATE"},{"type":"Jan. 10, 2024","content":"DATE"},{"type":"May 31, 2022","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Jan. 10, 2023","content":"DATE"},{"type":"July 14, 2023","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"$3.94","content":"MONEY"},{"type":"0.71%","content":"PERCENT"},{"type":"Feb. 8, 2023","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$23,640","content":"MONEY"},{"type":"1:47 p.m. ET","content":"TIME"},{"type":"$40.8 million","content":"MONEY"},{"type":"Nov. 11, 2023","content":"DATE"},{"type":"OP","content":"ORGANIZATION"}],"hashtag":["OPTIMISM"],"authors":["MK Manoylov","The Block"]}