{"summary":"Alameda Research, Jump Capital and Target Global were among the Series B round&#x27;s backers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/172136\/automated-crypto-trading-startup-3commas-raises-37-million","publishDate":"2022-09-22T12:54:06","id":5281,"type":null,"title":"Automated crypto trading startup 3Commas raises $37 million","category":["COMPANIES"],"content":["3Commas, an automated trading bot platform for crypto, has raised $37 million in a Series B funding round.&nbsp;","The round was led by Alameda Research, Jump Capital, Target Global and Dmitry Tokarev, CEO and founder of the institutional-focused crypto firm Copper.&nbsp;","Among the uses of the $37 million was the formation of a subsidiary known as DeCommas, with a focus on automating access to decentralized finance (DeFi) protocols.","\"We are excited to continue to build technology that democratizes access to the transformational benefits of crypto by relentlessly advancing our technology and offering a suite of developer tools to make 3Commas the destination for investment app innovation,\" Yuriy Sorokin, 3Commas's founder and CEO, said in a press statement.","3Commas <a href=\"https:\/\/www.theblock.co\/linked\/83417\/alameda-invests-3-million-into-retail-trading-bot-platform-3commas\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">raised<\/a> a $3 million round, with backing from Alameda, in 2020, as The Block previously reported.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"$37 million","content":"MONEY"},{"type":"$3 million","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Dmitry Tokarev","content":"PERSON"},{"type":"Yuriy Sorokin","content":"PERSON"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}