{"summary":"The move marks yet another digital asset users can transact with on Venmo, which began offering crypto purchases in 2021. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/252177\/payment-app-venmo-to-offer-paypal-usd-stablecoin","publishDate":"2023-09-20T13:36:07","id":5282,"type":null,"title":"Payment app Venmo to offer PayPal USD stablecoin","category":["COMPANIES"],"content":["The peer-to-peer payment platform Venmo will soon offer the stablecoin PayPal USD, or PYUSD.&nbsp;","PayPal's ERC-20 stablecoin will be available for purchase in the \"coming weeks,\" PayPal notes in a <a href=\"https:\/\/newsroom.paypal-corp.com\/2023-09-20-PayPal-USD-is-now-available-on-Venmo\" data-v-f87c67ca=\"\">release<\/a>. Users will be able to buy and send PYUSD to others on PayPal, Venmo or compatible external wallets.&nbsp;","\"In the first example of a stablecoin enabling wallet interoperability at scale with no cost, transfers between PayPal and Venmo users are fast and free, connecting two wallets with millions of users each,\" PayPal wrote.&nbsp;","The move marks yet another digital asset users can transact with on Venmo, which began <a href=\"https:\/\/www.theblock.co\/linked\/102295\/paypal-venmo-crypto\" data-v-f87c67ca=\"\">offering<\/a> crypto purchases in 2021.&nbsp;","Venmo is a subsidiary of the payment giant PayPal, which <a href=\"https:\/\/www.theblock.co\/post\/243569\/paypal-launches-stablecoin\" data-v-f87c67ca=\"\">launched<\/a> the stablecoin backed by U.S. dollar deposits, short-term Treasuries and similar cash equivalents. PayPal launched PYUSD via a partnership with the crypto infrastructure firm Paxos on Aug. 7.","Nearly a month later, PayPal added a crypto-for-USD conversion <a href=\"https:\/\/www.theblock.co\/post\/250333\/paypal-rolls-out-crypto-for-usd-conversion-service\" data-v-f87c67ca=\"\">service<\/a> where users could transfer digital currency for U.S. fiat on Sept. 11.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sept. 11","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"PayPal USD","content":"ORGANIZATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"USD","content":"ORGANIZATION"},{"type":"Aug. 7","content":"DATE"}],"hashtag":["PAYMENTS"],"authors":["MK Manoylov","The Block"]}