{"summary":"Aave, the decentralized lending (DeFi) lending protocol, is considering deploying a minimum viable version (MVP) of Aave version 3 on Polygon&#x27;s zkEVM.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/216830\/aave-starts-governance-discussion-to-deploy-on-upcoming-polygon-zkevm-mainnet","publishDate":"2023-03-03T07:20:36","id":5283,"type":null,"title":"Aave starts governance discussion to deploy on upcoming Polygon zkEVM mainnet","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Aave, a decentralized lending protocol, is considering deploying a minimum viable version (MVP) of Aave version 3 on Polygon's upcoming zkEVM Layer 2 network.<\/span>","Marc Zeller, the founder of Aave-Chan Initiative and an Aave protocol delegate, submitted this proposal to establish Aave's presence on Polygon's zkEVM network soon after its mainnet beta <a href=\"https:\/\/www.theblock.co\/post\/211517\/polygon-eyes-mainnet-beta-release-for-zkevm-layer-2-next-month\" data-v-f87c67ca=\"\">launch<\/a> on March 27. The proposal is currently in the \"temperature-check\" phase.","<span data-v-f87c67ca=\"\">To reduce risk, the proposal suggests limiting the onboarding of assets and setting conservative risk parameters. It recommends onboarding only three collateral types: wrapped ETH (WETH) and wrapped MATIC (WMATIC) tokens, as well as USDC stablecoin. It also recommends including only one borrowable asset, the USDC stablecoin.<\/span>","<span data-v-f87c67ca=\"\">The proposal says it also aims to lay the groundwork for possibly issuing Aave's GHO stablecoin on the zkEVM, if the governance were to consider this option in the future.<\/span>","<span data-v-f87c67ca=\"\">Polygon's<\/span><a href=\"https:\/\/www.theblock.co\/post\/197324\/polygons-zkevm-launched-its-second-testnet-the-last-step-before-mainnet-goes-live\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">zkEVM<\/span><\/a><span data-v-f87c67ca=\"\"> will be a zero-knowledge or ZK-rollup that performs off-chain computations on a secondary layer for faster and cheaper transactions while prioritizing security. The aim is to further expand the Ethereum network's scaling capabilities.<\/span>","<span data-v-f87c67ca=\"\">Polygon says its zkEVM will be equivalent to Ethereum's Virtual Machine, which means that the network is expected to support the same code as Ethereum. This will allow developers to onboard apps from Ethereum and use them on the zkEVM network without making significant changes.<\/span>","<span data-v-f87c67ca=\"\">Aave has a track record of working closely with core teams to implement its lending protocol, particularly in 2021 on the Polygon and Avalanche blockchains. Aave's<\/span><a href=\"https:\/\/cryptobriefing.com\/aave-will-build-matics-scalable-layer-2-platform\/\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">expansion<\/span><\/a><span data-v-f87c67ca=\"\"> onto the Polygon sidechain network (distinct from zkEVM) in 2021 was a significant driver of increased activity on the network.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2021","content":"DATE"},{"type":"USDC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Ethereum's Virtual Machine","content":"ORGANIZATION"},{"type":"March 27","content":"DATE"},{"type":"Marc Zeller","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}