{"summary":"Kazakh officials assure crypto miners that they will be able to continue operating as long as they report to regulators.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/129152\/following-energy-shortage-kazakhstan-is-reining-in-2021s-stampede-of-crypto-miners","publishDate":"2022-01-05T10:04:52","id":5286,"type":null,"title":"Following energy shortage, Kazakhstan is reining in 2021&#x27;s stampede of crypto miners","category":["REGULATION"],"content":["In recent months Kazakhstan's new regime for cryptocurrency mining has established a new registry that is growing at a rapid clip amid pressure on the country's electrical grid. Amid issues with that grid, some miners have already left, but the situation seems to be stabilizing.","As of the New Year, the Kazakh Ministry of Digital Development has <a href=\"https:\/\/www.gov.kz\/memleket\/entities\/mdai\/documents\/details\/249489?lang=ru\" data-v-f87c67ca=\"\">registered<\/a> 146 firms involved in crypto mining. The new registry includes 53 companies currently actively mining, 82 looking to begin mining and another 11 infrastructure providers. Such providers are mostly data centers like Enegix, which, <a href=\"https:\/\/www.enegix.net\/en\" data-v-f87c67ca=\"\">advertising<\/a> 180 megawatts, is one of the largest of its kind in the world.&nbsp;","The list of miners has followed from new law on Kazakhstan's cryptocurrency industry adopted at the end of June. Since the beginning of the year, miners have been subject to an additional charge of 1 tenge per kilowatt-hour of electricity — worth $0.0023 as of press time.","Kazakhs involved in the mining industry tell The Block that they are awaiting either new taxes or a special fee on energy for crypto miners.&nbsp;","Now the second-largest source of Bitcoin's hashrate in the world — after the U.S. and ahead of neighboring Russia — Kazakhstan has seen a&nbsp; surge in cryptocurrency mining since a <a href=\"https:\/\/www.theblockcrypto.com\/news+\/110096\/kazakhstan-destination-chinese-bitcoin-miners\" data-v-f87c67ca=\"\">mass exodus from China<\/a> earlier this year. While miners came to Kazakhstan in part due to its cheap electricity, the country found its resources strained.","One local mining consultant told The Block: \"For around a month, all of the large centers were shut off. Now they are turning them back on again.\"","Amid those issues, some miners left Kazakhstan. BitFuFu, one of the largest, told <a href=\"https:\/\/www.coindesk.com\/policy\/2021\/12\/02\/bitmain-backed-bitfufu-abandons-mining-rigs-in-kazakhstan-due-to-power-rationing\/\" data-v-f87c67ca=\"\">CoinDesk<\/a> that it was abandoning its machines in the country in favor of U.S. operations, following inconsistent rules and energy cutoffs.&nbsp;","Other miners are still moving in. On January 4, Chinese Bitcoin mining firm Canaan <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1780652\/000119312522000981\/d276021dex991.htm\" data-v-f87c67ca=\"\">filed<\/a> with the U.S. Securities and Exchange Commission announcing that it was adding 10,000 machines to its Kazakh operations.&nbsp;","Kazakh outlet TengriNews <a href=\"https:\/\/tengrinews.kz\/kazakhstan_news\/pozitsiyu-kazahstana-mayningu-kriptovalyut-obyyasnil-ministr-453024\/\" data-v-f87c67ca=\"\">reported<\/a> that energy minister Magzum Mirzagaliyev is not interested in cutting off electricity to registered \"white miners.\" Mirzagaliyev was, rather, interested in locking down on what he called \"gray miners,\" referring to unregistered and illegal operations.&nbsp;","\"We already see 'white miners' in our country. They consume over 600 megawatts of electricity. 'Gray miners,' we have determined, consume 340 megawatts,\" said Mirzagaliyev. While acknowledging that Kazakhstan will need years to up its overall capacity, he said \"I want to put out the clear message that nobody is planning to cut off 'white miners.' We want to move 'gray miners' into the zone of 'white miners.'\"","Meanwhile, Kazakhstan is already facing a new energy crisis, this time in petroleum shortages that have driven up the price of gas. Significant <a href=\"https:\/\/t.me\/nexta_live\/15297\" data-v-f87c67ca=\"\">protests<\/a> are gathering across the country, despite police suppression. The administration of President Tokayev declared a state of emergency and subsequently shut down much of the internet connectivity across the country.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Mirzagaliyev","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Kazakh Ministry of Digital Development","content":"ORGANIZATION"},{"type":"Tokayev","content":"PERSON"},{"type":"January 4","content":"DATE"},{"type":"$0.0023","content":"MONEY"},{"type":"Kazakhstan","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"Russia","content":"LOCATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"Magzum Mirzagaliyev","content":"PERSON"},{"type":"China","content":"LOCATION"}],"hashtag":["MINING"],"authors":["Kollen Post","The Block"]}