{"summary":"ZenGo says ClearSign will tell users the details of the transactions they are about to sign thus offering protection from scammers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/153520\/crypto-wallet-app-zengo-introduces-web3-firewall-feature-called-clearsign","publishDate":"2022-06-22T09:00:12","id":5287,"type":null,"title":"Crypto wallet app ZenGo introduces Web3 firewall feature called ClearSign","category":["SECURITY"],"content":["Crypto wallet provider ZenGo has introduced a new feature, called ClearSign, that protects its users from the dangers of signing transactions from malicious smart contracts, the company announced on Wednesday.","According to ZenGo, ClearSign is designed to reduce the risk of users losing their non-fungible tokens (NFTs) and other crypto assets due to attack vectors like phishing scams and untrustworthy decentralized apps. NFT communities like Bored Ape Yacht Club (BAYC) have <a href=\"https:\/\/www.theblock.co\/post\/143328\/bored-ape-instagram-account-hacked-nfts-worth-2-8-million-stolen\" data-v-f87c67ca=\"\">suffered several instances<\/a> of their holders losing valuable NFTs to scammers via social engineering attacks.","The feature works by telling users the details of the transactions they are signing in a way that is easy to understand. ClearSign will also act as a firewall that blocks unwanted actions from untrustworthy decentralized Dapps, according to ZenGo’s announcement.&nbsp;","The firewall will alert users to suspicious smart contracts and block the signing of transactions that would expose private keys or seed phrases.","ZenGo says it has already partnered with the popular Discord bot Collab.Land to integrate ClearSign on the latter’s platform. Many projects use Collab.Land to verify that their members are owners of their digital assets, including NFTs. Some high-profile NFT hacks have involved the creation of fake Collab.Land bots to steal valuable collectibles from unsuspecting victims.","ClearSign will be available on both iOS and Android. ZenGo says it will add other Dapp integrations in the coming weeks.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"ClearSign","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Discord bot","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}