{"summary":"The NFT platform will have optional creator fees for new collections on Aug. 31, and for any existing collections by Feb. 29, 2024. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246328\/opensea-investor-mark-cuban-says-nft-marketplace-removing-royalties-is-a-huge-mistake","publishDate":"2023-08-18T13:47:39","id":5290,"type":null,"title":"Mark Cuban says OpenSea removing royalties is a &#x27;huge mistake&#x27;","category":["METAVERSE & NFT"],"content":["Billionaire investor Mark Cuban criticized OpenSea's decision to make creator fees optional.&nbsp;","\"Not collecting and paying royalties on NFT sales is a HUGE mistake by OpenSea,\" Cuban <a href=\"https:\/\/twitter.com\/mcuban\/status\/1692541974484549925?t=cVhDgI3Bn5e5BEtCsA5f7w&amp;s=19\" data-v-f87c67ca=\"\">wrote<\/a> on social media. \"It diminished trust in the platform and hurts the industry. And I say this as an OpenSea investor.\"","As a response to someone in favor of removing NFT royalties, Cuban said \"the buyer knows what the royalties are before they buy it. The creator can set the royalty to zero. They are part of the smart contract that mints the NFT. It's not smart. It's desperation.\"","OpenSea announced yesterday that it would&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/246095\/opensea-disables-royalty-enforcement-tool-makes-creator-fees-optional\" data-v-f87c67ca=\"\">disable<\/a>&nbsp;its royalty enforcement tool, OpenSea Operator Filter, and make creator fees optional for new collections starting after Aug. 31.","The platform said it was making the change to do away with the \"ineffective, unilateral enforcement\" of NFT royalties — without removing them completely.&nbsp;","\"The optional royalty approach kills future applications that go far beyond collectibles,\" Cuban added. \"Which is where the most money will be.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"OpenSea Operator Filter","content":"ORGANIZATION"},{"type":"Aug. 31","content":"DATE"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}