{"summary":"Vauld has rejected rival Nexo&#x27;s &#x27;final&#x27; acquisition proposal. The firm continues to seek answers from Nexo, particularly around its solvency.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/199416\/vauld-rejects-nexos-final-acquisition-proposal-questions-companys-solvency","publishDate":"2023-01-05T09:49:58","id":5294,"type":null,"title":"Vauld rejects Nexo&#x27;s &#x27;final&#x27; acquisition proposal, questions company&#x27;s solvency","category":["DEALS"],"content":["Troubled crypto lender Vauld and its committee of creditors (COC) rejected rival Nexo's \"final\" acquisition proposal due to concerns about Nexo's financial health and others issues.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"We have taken the terms of the Final Nexo Proposal into consideration and further consulted with the COC, and we unanimously do not accept your proposal as it stands,\" Vauld co-founder and CEO Darshan Bathija wrote to Nexo in a letter dated Wednesday that was obtained by The Block.","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Nexo&nbsp;<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.theblock.co\/post\/197947\/nexo-writes-open-letter-to-vaulds-creditors-presents-final-proposal\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">presented<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\"> the proposal to Vauld's creditors on Dec. 26 in an open letter. The letter came on the same day Bathija said in an email to Vauld's creditors that the potential Nexo deal had been called off. But Nexo said it hadn't yet given up on its attempt to make a deal with Vauld.<\/span>","Vauld, however, rejected Nexo's offer as it did not contain significant changes from its previous proposal, and therefore, it continues to seek answers from Nexo on its two key concerns. Those concerns are how Nexo will treat claims of U.S.-based Vauld creditors since it recently announced plans to exit the market and whether Nexo is in good financial health.","\"Overall, you have failed to adequately respond to our repeated requests (which echoes the COC's requests) for a comprehensive due diligence exercise including a solvency assessment of Nexo, or otherwise to elaborate on what measures may be able to be agreed upon to provide Vauld's creditors with a greater level of assurance in the event of insolvency of Nexo,\" Bathija said in the letter.","A Vauld creditor speaking on condition of anonymity told The Block that they \"want ironclad assurance that Nexo is solvent, so we don't get swept up into another insolvency crisis.\"","They further said that \"there is too much uncertainty for Vauld's U.S. creditors who make up 45% of the firm's AUM, no protection if Nexo goes bust, and Nexo still hasn't given us their financial model so we have a reasonable estimate of hole reduction.\"","Vauld has given Nexo until Friday to respond to its concerns. \"As these requests are not new to you, we hope that you will be able to show your sincerity in this proposal by providing us satisfactory responses to our queries before the close of business in Singapore on Friday, 6:00pm (SGT) on 6 January 2023,\" Bathija said in the letter.","\"Mid-next week, Nexo will host a live AMA [ask-me-anything] session to address all outstanding questions about our proposal, and we are adamant about the fact that this is the offer that creates most value for Vauld’s customers,\" Kalin Metodiev, co-founder and managing partner at Nexo, told The Block. \"In contrast to most everyone in the space, Nexo has a third-party confirmation that our assets exceed liabilities via our real-time attestation that is live since mid-2021.\"","Vauld and Nexo have been in <a class=\"editor-rtfLink\" href=\"https:\/\/www.theblock.co\/post\/155790\/nexo-vauld-offer-potential-acquisition\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">discussions<\/span><\/a> for a potential deal since early July, when the former <a class=\"editor-rtfLink\" href=\"https:\/\/www.theblock.co\/post\/155679\/vauld-halts-withdrawals-hires-legal-financial-advisors\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">halted<\/span><\/a> client withdrawals after facing a severe liquidity crunch. Vauld <a href=\"https:\/\/www.theblock.co\/post\/158647\/crypto-lender-vauld-owes-363-million-to-retail-investors-after-halting-withdrawals\" data-v-f87c67ca=\"\">owes<\/a> over $400 million to its creditors.","The firm has until Jan. 20 to sort its financial issues, having received another credit protection extension last November. Vauld, however, has applied for yet another extension and a hearing for the extension is scheduled for Jan. 17. It remains to be seen whether the firm receives yet another extension.","Vauld and its financial advisor, Kroll, did not respond to The Block's requests for comment.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Darshan Bathija","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Nexo","content":"ORGANIZATION"},{"type":"January 2023","content":"DATE"},{"type":"July","content":"DATE"},{"type":"Dec. 26","content":"DATE"},{"type":"November","content":"DATE"},{"type":"Final Nexo Proposal","content":"ORGANIZATION"},{"type":"COC","content":"ORGANIZATION"},{"type":"AMA","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Mid-next week","content":"DATE"},{"type":"$400 million","content":"MONEY"},{"type":"Nexo","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Kroll","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Bathija","content":"PERSON"},{"type":"Jan. 20","content":"DATE"},{"type":"45%","content":"PERCENT"},{"type":"Vauld","content":"ORGANIZATION"},{"type":"Jan. 17","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"Kalin Metodiev","content":"PERSON"}],"hashtag":["CRYPTO BANKS AND LENDERS"],"authors":["Yogita Khatri","The Block"]}