{"summary":"North Island is “investing pretty heavily” in the Cosmos infrastructure service platform, but expects venture backing of crypto projects to drop off in the coming year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175169\/north-island-backing-cosmos-after-closing-second-125-million-fund","publishDate":"2022-10-07T04:00:33","id":5297,"type":null,"title":"North Island backing Cosmos after closing second $125 million fund","category":["STARTUPS"],"content":["<span data-v-f87c67ca=\"\">North Island Ventures is gazing up at the Cosmos.<\/span>","The crypto-focused investment firm, which recently closed its <a href=\"https:\/\/www.theblock.co\/post\/169738\/north-island-ventures-launches-125-million-investment-fund\" data-v-f87c67ca=\"\">second fund<\/a> at $125 million, is “investing pretty heavily” in the Cosmos infrastructure service platform, which aims to become more interoperable, decentralized and secure in its newest incarnation with North Island’s backing. The strategy involves purchases of Cosmos’ native token, as well as investments in projects developing in the Cosmos ecosystem.&nbsp;","North Island co-founder Travis Scher said developers have started to gravitate toward Cosmos “pretty heavily” over the last six months.","“The momentum around Cosmos is now very real,” Scher said in an interview. “The traction with end users is still fairly limited, but I think that Cosmos is building ahead of where the market is going.”","<a href=\"https:\/\/www.theblock.co\/post\/172998\/cosmos-contributors-release-new-whitepaper-showcasing-two-big-ideas\" data-v-f87c67ca=\"\">Cosmos<\/a> is a blockchain network consisting of interoperable, application-specific blockchains. These chains can interact with one another using the Inter Blockchain Communication (IBC) protocol. The Cosmos Hub is an independent blockchain and is secured by validators who stake Cosmos’ native token called ATOM.","North Island’s second fund is nearly double the size of its <a href=\"https:\/\/www.theblock.co\/linked\/93784\/paul-tudor-jones-ll-cool-j-and-more-back-new-72-million-crypto-vc-fund\" data-v-f87c67ca=\"\">predecessor<\/a>, which closed in 2020 with a total of $70 million, and has made around 30 investments. The new fund is expected to be invested in 30 to 40 firms primarily in seed-stages.","“The fund is a bit bigger than the last fund primarily because the opportunity set in crypto is meaningfully larger than it was in 2020,” Scher said. “Back in 2020 there were only really two blockchains that had any usage or momentum at all. There was no interest or momentum in NFTs whatsoever. There was just budding momentum in the DeFi space.”","While crypto investment opportunities have multiplied since the firm’s first fund, Scher acknowledges that now isn’t exactly the best time to deploy the newly raised cash.","“We just experienced a bubble in crypto, so I think we are most certainly seeing a pullback in terms of investment dollars getting put to work,” Scher said. “Venture investing in crypto over the next 12 months will be meaningfully less than it was over the previous 12 months.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Travis Scher","content":"PERSON"},{"type":"Inter Blockchain Communication (IBC","content":"ORGANIZATION"},{"type":"Cosmos","content":"LOCATION"},{"type":"Cosmos Hub","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$125 million","content":"MONEY"},{"type":"Scher","content":"PERSON"},{"type":"North Island","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"North Island Ventures","content":"LOCATION"},{"type":"$70 million","content":"MONEY"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}