{"summary":"At midnight tomorrow, Qbase will rob a number of unsuspecting investors blind as they begin their “Cryptocurrency Pre-ICO.” Every single aspect of Qbase","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/202\/qbase-anatomy-of-an-ico-scam","publishDate":"2018-08-02T15:47:20","id":53,"type":null,"title":"Qbase: Anatomy of an ICO Scam","category":["HACKS"],"content":["<span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"56f89f949263\" data-v-f87c67ca=\"\">At midnight tomorrow,&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/qbase.io\/\" target=\"_blank\" rel=\"nofollow noopener noopener\" data-href=\"https:\/\/qbase.io\/\" data-v-f87c67ca=\"\">Qbase<\/a>&nbsp;will rob a number of unsuspecting investors blind as they begin their “Cryptocurrency Pre-ICO.” Every single aspect of Qbase is a complete and utter scam. There is not a single piece of information on the site that represents an honest attempt at creating new technology or representing how that technology will be created. And yet the Pre-ICO countdown clock ticks forward with no regulatory body moving to shut down this site ahead of its offering of worthless tokens to investors in return for real money. This story has played out hundreds of times before — and each time the faith of the public at large is shaken and the reputation of the cryptocurrency ecosystem suffers.<\/span>","Here we explore each part of the project as presented to reveal how basic and easy to create this scam project is.","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Team<\/strong>","We were first alerted to the existence of Qbase by the tweet and thread below in which it was clear that Qbase had ripped a real person’s profile off LinkedIn, given her a new name and fraudulently represented that she was their community manager.","So <a href=\"https:\/\/twitter.com\/qbase_io?ref_src=twsrc%5Etfw\" data-v-f87c67ca=\"\">@qbase_io<\/a>, since you falsely have on your site I’m your Community Manager, how about those paychecks? <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSeriously tho, remove me, my name, my likeness, my LinkedIn, and my bio immediately from your website &amp; anywhere else as an employee or you’ll be hearing from a lawyer. <a href=\"https:\/\/t.co\/30mIl2JbGm\" data-v-f87c67ca=\"\">pic.twitter.com\/30mIl2JbGm<\/a>","<script async=\"async\" src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\" data-v-f87c67ca=\"\"><\/script>","Upon learning of this fraud, we checked out the website and noticed another prominent investor fraudulently represented under *her own name* as Managing Director of the Qbase project.","Well, guess this is a story for <a href=\"https:\/\/twitter.com\/TheBlock__?ref_src=twsrc%5Etfw\" data-v-f87c67ca=\"\">@TheBlock__<\/a> ! Clearly, <a href=\"https:\/\/twitter.com\/qbase_io?ref_src=twsrc%5Etfw\" data-v-f87c67ca=\"\">@qbase_io<\/a> is a total scam. I cannot believe they listed me as a team member. I wrote to have myself removed. Doubt the support address even works. <a href=\"https:\/\/t.co\/AUKhkC0LXG\" data-v-f87c67ca=\"\">https:\/\/t.co\/AUKhkC0LXG<\/a>","— Laurel Touby (@laureltouby) <a href=\"https:\/\/twitter.com\/laureltouby\/status\/1023561079807520768?ref_src=twsrc%5Etfw\" data-v-f87c67ca=\"\">July 29, 2018<\/a>","<script async=\"async\" src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\" data-v-f87c67ca=\"\"><\/script>","This led us to contact two other listed Qbase “Team” members, both of whom were unaware that Qbase even existed or that their likenesses and reputations were being fraudulently utilized to scam investors. In an act that will surprise no one, the Team page has been completely wiped from the Qbase site — and there is no record anywhere online of what humans are involved in this scam.","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Home Page<\/strong>","Nearly the entire home page above the hold is dominated by a photo of the Earth from space with the Sun behind it. The remainder shows a Pre-ICO countdown, some head-scratching text and bum links…","“What Do We Do? We want to blur the line between the cryptocurrency merchants and ordinary consumers. We will popularize the cryptocurrency by giving free admission, and by helping people understand and confide what we believe to be the future of money.”&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Uh, sorry, I have no idea what this means.<\/em>","“What is Qbase: The blockchain is a public ledger that records Qbase transactions. A novel solution accomplishes this without any trusted central authority: the maintenance of the blockchain is performed by a network of communicating nodes running cryptocurrency software.This allows Qbase software to determine when a particular cryptocurrency amount has been spent, which is necessary in order to prevent double-spending in an environment without central oversight.”&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Hmm, sounds an awful lot like a paper I read written by someone named Satoshi 10 years ago…<\/em>","“How the Token Works: In the blockchain, Qbase can be stored on any ERC20 compatible wallet address. Creating an ERC20 address is nothing more than picking a random valid private key.”&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Um, er, uh, sure, ok….<\/em>","“Benefits for Everyone: Qbase is a cryptocurrency and worldwide payment system. It is the first decentralized digital currency, as the system works without a central bank or single administrator. The network is peer-to-peer and transactions take place between users directly, without an intermediary. These transactions are verified by network nodes through the use of cryptography and recorded in a public distributed ledger called a blockchain.”&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Um, er, uh, sure, ok…have you heard of this little cryptocurrency called Bitcoin?<\/em>","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Presale Bonus<\/strong>","This is all about money. You give it to us, and you get a discount from the price at which the next sucker gives it to us! Also, we have an arbitrary “Release Date” on September 21st that doesn’t tie at all to anything on our Roadmap (below.)","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Roadmap<\/strong>","None of this exists. None of it.","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Github<\/strong>","The project joined Github on July 27, 2018, well after the marketing website was live — and just one week before selling tokens to the public. There is no activity to date on the&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/github.com\/qbaseproject\" target=\"_blank\" rel=\"noopener nofollow\" data-href=\"https:\/\/github.com\/qbaseproject\" data-v-f87c67ca=\"\">Github account<\/a>.","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Facebook &amp; Instagram<\/strong>","They are really&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.facebook.com\/qbase.io\/\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.facebook.com\/qbase.io\/\" data-v-f87c67ca=\"\">gearing up for the technical challenges ahead<\/a>! 57 followers on each platform with deep thoughts such as “<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.instagram.com\/p\/BlTK5OAD1sf\/?taken-by=qbase.io\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.instagram.com\/p\/BlTK5OAD1sf\/?taken-by=qbase.io\" data-v-f87c67ca=\"\">programming has always been fun<\/a>.”","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Twitter<\/strong>","<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/twitter.com\/qbase_io\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/twitter.com\/qbase_io\" data-v-f87c67ca=\"\">Shill, shill, shill!<\/a>","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Telegram<\/strong>","<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/t.me\/qbase_io\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/t.me\/qbase_io\" data-v-f87c67ca=\"\">12,705 members<\/a>. Discussion is total nonsense. It’s a huge indictment of the increasingly fraudulent atmosphere on Telegram. One has to assume that the majority of the channel members are “bot and paid for!”","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Features<\/strong>","None of the links are clickable, none of the claims are validated, none of the product as described exists","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">What We Do<\/strong>","“<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/qbase.io\/wp-content\/uploads\/2018\/07\/Whitepaper-en.pdf\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/qbase.io\/wp-content\/uploads\/2018\/07\/Whitepaper-en.pdf\" data-v-f87c67ca=\"\">Whitepaper<\/a>” (save yourself the click) is a 10 page nothing-burger PDF","“<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/vimeo.com\/279054332\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/vimeo.com\/279054332\" data-v-f87c67ca=\"\">Play Video<\/a>” takes you to a cutesy Silicon Valley style video of a fun project with delightful marketing music in the background. It says *absolutely nothing* about how the protocol works or what the investor is actually purchasing. There is no other video or information linked to the account describing how the technology might work.","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Supported by Global Partners<\/strong>","Qbase lists 4 “global partners” on its home page. Each partner is simply a media outlet that could have theoretically written an article about the project. Unfortunately, none have done so.","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Terms &amp; Conditions<\/strong>","Help us scam people by&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/qbase.io\/terms-and-conditions\/\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/qbase.io\/terms-and-conditions\/\" data-v-f87c67ca=\"\">promoting this offering<\/a>. You must be a *US citizen* to do so!","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Token Sale<\/strong>","Every last link that purports to show you more information ultimately lands you in the “Token Sale” money-burning pit. The countdown is on, and you can be notified of when your hard-earned money will be burned as the Qbase home page sun comes out from behind the Earth and scorches your wealth.","If you have a few free minutes in the next 24 hours, contact the SEC, the Qbase team and their public channels to let them know that the cryptocurrency and blockchain community will not stand for bald-faced fraud and theft. Enough is enough!","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Earth","content":"LOCATION"},{"type":"July 29, 2018","content":"DATE"},{"type":"cutesy Silicon Valley","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Qbase","content":"ORGANIZATION"},{"type":"Satoshi","content":"PERSON"},{"type":"Global Partners","content":"ORGANIZATION"},{"type":"Github","content":"ORGANIZATION"},{"type":"Laurel Touby (","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"July 27, 2018","content":"DATE"},{"type":"Facebook &amp; Instagram","content":"ORGANIZATION"}],"hashtag":[],"authors":["Mike Dudas","The Block"]}