{"summary":"SevenX Ventures, an Asia-based blockchain fund, recently announced that they had raised $30 million in the second phase of their fund.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/128094\/sevenx-venture-raised-30m-to-empower-entrepreneurs-in-crypto-from-0-to-1","publishDate":"2021-12-20T09:00:56","id":5301,"type":null,"title":"SevenX Venture Raised $30M to Empower Entrepreneurs in Crypto from 0 to 1","category":["SPONSORED"],"content":["SevenX Ventures, an Asia-based blockchain fund, recently announced that they had raised $30 million in the second phase of their fund. SevenX add LPs from the likes of family offices, hedge funds, blockchain industry veterans, and internet companies to their list. The firms said they would be moving towards Venture Fund II which will specifically focus on DeFi, NFT, WEB3.0, Polkadot ecosystem, NEAR ecosystem, and the new ecology of the data storage paradigm represented by Arweave.","<strong data-v-f87c67ca=\"\">Mapping out SevenX Ventures’ Portfolio<\/strong> <br data-v-f87c67ca=\"\">\nSevenX looks for long-term value projects that can make the real world better using a long-term development mindset and underlying logic perspective. There are a number of success stories among SevenX’s portfolio and the following statistics demonstrate some of such outcomes:","","","• In the DeFi space, as one of the first investment funds specializing in DeFi, SevenX is an angel investor in Opium, Shield, Kine, InsureAce, DODO. In addition, they were also the first investor in Furucombo and had made a strategic investment in Zerion in 2020;","• In the NFT field, SevenX has carried out a matrix layout under its own logic framework. Starting with the core technology system, it has co-led the Rangers Protocol investment with Framework and Pantera, and then went on to invest in NFT Alchemy;","In the middle layer (content and application layer), SevenX invested in MintGate, BeeperDAO, and ShowMe; Whereas in the upper layer of “NFT+DeFi,” SevenX invested in Taker and NiftyPay.","In the top traffic layer of the wallet, SevenX also invested in Blocto, YGG, and Whaleshark- one of the world's largest collector communities, Moreover, SevenX also invested in MYNFT, an interconnection platform with East and West creators.","• As for the Arweave, SevenX has been investing in this area as a frontier since 2020. “There will be an extraordinary wave of breakthroughs in the Arweave ecosystem over the coming years, ” stated Eraser Li, the founding partner of SevenX Ventures. Koii and Everpay are building a storage-based computation paradigm based on Arweave; ARGO, the appless augmented reality solution provider, allowing developers to deploy DAPP to AR instantly, while ArDrive enables customers to use AR as their own data storage solution as easy as using an Internet network disk. These are the SevenX portfolio.","<strong data-v-f87c67ca=\"\">Immersion Investing<\/strong> <br data-v-f87c67ca=\"\">\nThe blockchain ecosystem is highly autonomous and for a startup to grow in such uncertain conditions, funding is not the “do-all.” Blockchain startups need much more than just money - they need the resources, tools, and knowledge necessary to execute plans and strategies. This is where the role of SevenX comes into play.","SevenX doesn’t just provide blockchain startups with the bucks, but also strategic consulting services. The entrepreneurs get an opportunity to understand the industry as an omniscient spectator - an external view. Furthermore, SevenX attempts to understand the problems and challenges that the entrepreneurs face, thereby finding solutions and opportunities accordingly. And that’s where SevenX provides all-around help and why SevenX has come up with an “immersion investing” strategy.","The team’s bid to provide growth opportunities and foster entrepreneurs has helped shape its “immersion investing” strategy. Take DODO as an example, a decentralized exchange platform powered by the Proactive Market Maker (PMM) algorithm. As the angel and private round investor, SevenX has provided DODO with consulting services, including strategy, community, fundraising, and token economic design, making the 1-year-old product one of the top digital assets DEX globally. SevenX also assisted Mask.io in the global market, connected with leading crypto funds; helped Darwinia reposition as “Polkadot‘s Golden Gate Bridge” to enhance market awareness.","<strong data-v-f87c67ca=\"\">Looking forward<\/strong> <br data-v-f87c67ca=\"\">\nThe rise of any industry is due to the efforts of countless entrepreneurs, and SevenX Ventures will further capitalize on the next wave of crypto innovators and entrepreneurs. In doing so, SevenX Ventures appreciates the efforts of all and welcomes more and more entrepreneurs to join the SevenX family and be a part of the miraculous change that the world is witnessing at the moment.","&nbsp;","Media Contact<br data-v-f87c67ca=\"\">\nE-mail: <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"e68f888089a6d19e9085c885898b\">[email&nbsp;protected]<\/a><br data-v-f87c67ca=\"\">\nTwitter: https:\/\/twitter.com\/SevenXVentures<br data-v-f87c67ca=\"\">\nWebsite: http:\/\/www.7xvc.com\/","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kine","content":"LOCATION"},{"type":"Opium","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Blocto","content":"LOCATION"},{"type":"Whaleshark","content":"PERSON"},{"type":"Asia","content":"LOCATION"},{"type":"Eraser Li","content":"PERSON"},{"type":"$30 million","content":"MONEY"},{"type":"eFi","content":"ORGANIZATION"},{"type":"NiftyPay","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"SevenX Ventures","content":"ORGANIZATION"},{"type":"Pantera","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Shield","content":"LOCATION"},{"type":"Rangers Protocol","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}