{"summary":"Rally CEO Kevin Chou speaks with The Block&#x27;s Frank Chaparro in a new interview focused on creator coins.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/111718\/creator-coins-explained-by-rally-ceo","publishDate":"2021-07-16T13:44:09","id":5302,"type":null,"title":"Rally CEO Kevin Chou says billions could have their own coins","category":["PODCASTS"],"content":["<i data-v-f87c67ca=\"\">Episode <\/i><strong data-v-f87c67ca=\"\">40<\/strong><i data-v-f87c67ca=\"\"> of Season 3 of The Scoop was recorded remotely with The Block’s Frank Chaparro and Kevin Chou, CEO of Rally. <\/i>","<i data-v-f87c67ca=\"\">Listen below, and subscribe to The Scoop on <\/i><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Apple<\/i><\/a><i data-v-f87c67ca=\"\">, <\/i><a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Spotify<\/i><\/a><i data-v-f87c67ca=\"\">, <\/i><a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Google Play<\/i><\/a><i data-v-f87c67ca=\"\">, <\/i><a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Stitcher<\/i><\/a><i data-v-f87c67ca=\"\"> or wherever you listen to podcasts. Email feedback and revision requests to <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"fe8e919a9d9f8d8abe8a969b9c92919d959d8c878e8a91d09d9193\">[email&nbsp;protected]<\/a>.<\/i>","<strong data-v-f87c67ca=\"\">This episode is brought to you by our sponsors <a href=\"http:\/\/eventussystems.com\/\" data-v-f87c67ca=\"\">Eventus<\/a>, <a href=\"http:\/\/kraken.com\/scoop\" data-v-f87c67ca=\"\">Kraken<\/a>, and Exodus<\/strong>","<em data-v-f87c67ca=\"\">Eventus is the leading global provider of multi-asset class trade surveillance, transaction monitoring and market risk solutions. Eventus offers a powerful, award-winning trade surveillance platform that is easy to deploy, customize and operate. Eventus is proven in the most complex, high-volume and real-time environments and supports many of the industry’s leading crypto exchanges including Coinbase, Gemini, ErisX and OSL. The company’s rapidly growing client base relies on Eventus’ responsive support and product development teams to overcome its most pressing regulatory challenges.<\/em>","<strong data-v-f87c67ca=\"\">About Kraken<\/strong>","<em data-v-f87c67ca=\"\">Whether you’re an experienced crypto trader or just starting out, Kraken has the tools to help you achieve financial freedom. With 50+ cryptocurrencies to choose from, industry-leading security and a wide variety of features to suit any investing strategy, Kraken puts the power in your hands to buy, sell and trade digital assets. Visit <\/em><a href=\"http:\/\/kraken.com\/scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Kraken.com<\/em><\/a><em data-v-f87c67ca=\"\"> to get started today.<\/em>","<strong data-v-f87c67ca=\"\">About Exodus<\/strong>","&nbsp;","<span data-v-f87c67ca=\"\">Imagine a world with not just a few thousand cryptocurrencies, b<\/span><span data-v-f87c67ca=\"\">ut billions of them.<\/span>","<span data-v-f87c67ca=\"\">That's Rally CEO Kevin Chou’s vision. The founder of mobile gaming heavyweight Kabam joined The Scoop's Frank Chaparro to talk about the development of creator coins, which are blockchain-based tokens that are tied to the social capital of a person.<\/span>","<span data-v-f87c67ca=\"\">“We thought about… if you have instead of just thousands of tokens in the world, but you have millions of tokens, tens of millions of tokens, a billion tokens at some future point in time, how do you create a world where people can easily exchange that value?”<\/span>","<span data-v-f87c67ca=\"\">To be sure, it’s early days for Rally. The firm has onboarded approximately 160 creators, and that number is growing, with a community that spans athletics, art, and music.<\/span>","<span data-v-f87c67ca=\"\">Rally is currently working with musicians like Portugal. The Man, as well as streamers, gamers, celebrities, athletes, and others to create their own fungible tokens via their network.<\/span>","According to Rally, the decentralized $RLY Community has raised $108 million to date for its community treasury. T<span data-v-f87c67ca=\"\">he project is offering a platform for creators to issue their own 'creator coins' that allow them to engage directly with fans and offer bespoke incentives — thereby <\/span><span data-v-f87c67ca=\"\">giving them the power to “own their economic destiny,\" as Chou puts it.<\/span>","<span data-v-f87c67ca=\"\">But the vision is much broader, according to Chou, who said in the interview:<\/span>","<span data-v-f87c67ca=\"\">“How do we eventually think about a world where more and more people choose to create their online identity, reputation and financial wherewithal all on a blockchain. And that's kind of the world that we're trying to solve here on Rally.”<\/span>","<span data-v-f87c67ca=\"\">Chou believes that for many, Rally will be most people’s first foray into cryptocurrency. He said the project aims for Rally to provide that means of value without creators needing to work with other services to create their own tokens.<\/span>","<span data-v-f87c67ca=\"\">“We want to, again, make sure that the first creators, the first communities, the first fans, that come on to Rally and get into crypto for the first time, that there's really solid use cases, that there's plenty of applications, and integrations into various different tools and social media sites and in other services.”<\/span>","<span data-v-f87c67ca=\"\">Chou also highlighted the importance Rally places on compliance with regulatory commissions, saying: “We've invested over 10 million dollars on just compliance, civil work and the technology associated with that at Rally.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Chou also discusses:<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$108 million","content":"MONEY"},{"type":"Portugal","content":"LOCATION"},{"type":"RLY Community","content":"ORGANIZATION"},{"type":"Kevin Chou","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Gemini","content":"LOCATION"},{"type":"$","content":"MONEY"},{"type":"Google","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"OSL","content":"ORGANIZATION"},{"type":"Chou","content":"ORGANIZATION"},{"type":"Rally","content":"ORGANIZATION"},{"type":"10 million dollars","content":"MONEY"},{"type":"Spotify","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Frank Chaparro","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}