{"summary":"NFTs are mostly associated with digital art and collectibles from creators, but most experts believe the features that make these tokens fun to trade could also make them far more useful to society at large. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173574\/the-future-of-nfts-is-consumer-friendly","publishDate":"2022-09-30T08:50:32","id":5303,"type":null,"title":"The Future of NFTs Is Consumer Friendly","category":["SPONSORED"],"content":["<i data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\">The potential for NFTs is enormous. But in order for the market to live up to that potential, everything from creating NFTs to paying for them has to get easier. <\/span><\/i><a href=\"https:\/\/www.mastercard.com\/news\/perspectives\/2022\/simple-nft-purchasing-on-nft-marketplaces\/\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">Here’s how we’ll get there<\/span><\/i><\/a><i data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\">.<\/span><\/i><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">By David Senci, Vice President, Crypto, Blockchain &amp; NFTs at Mastercard<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">NFTs are mostly associated with digital art and collectibles from creators, but most experts believe the features that make these tokens fun to trade could also make them far more useful to society at large.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Because ownership of NFTs, like cryptocurrencies, relies on blockchain technology, the buying and selling of digital goods is made public. That allows creators, whether they’re independent artists or a luxury brand, to set conditions on how their work is sold and who benefits financially. But it also can empower consumers, boosting the resale value of something they own by publicly validating its provenance.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Blockchain-powered property titles could contain an irrefutable record of ownership, boosting buyer confidence, or include contractual features that would allow, for example, simple fractional ownership with rents automatically divvied up – and rent payments automatically deducted from the owners’ accounts. NFT proof of ownership could open the door to new loyalty offerings, forging stronger connections between consumers and brands. And in-game NFTs could let gamers hold on to their purchases for years, giving them the choice of diving back into a game at any time or allowing them to sell their in-game NFTs.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">But for NFTs to live up to their potential, they need to be much easier to create, buy and own, and that means simplifying NFT digital transactions and the payment experiences. People who aren’t cryptocurrency enthusiasts or savvy to the technology behind digital wallets and the blockchain, need to be able to buy digital assets the way they do a cup of coffee – and sell them just as easily. If that happens, the potential market for NFTs will grow many orders of magnitude and this also supports the creator economy.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">There’s plenty of evidence that consumers are ready. <\/span><a href=\"https:\/\/www.mastercard.com\/news\/perspectives\/2022\/digital-payment-landscape-2022\/\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">Mastercard’s New Payments Index survey<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\"> of more than 35,000 people in 40 countries found that 45% would consider purchasing, or had purchased, an NFT in the past year. And roughly half of respondents agree they wanted the ability to pay for everyday purchases with crypto (51%) or to be able to use a credit or debit card to buy an NFT (49%).<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Right now, buying an NFT often means opening a digital wallet, exchanging dollars for a digital currency such as Ethereum, then going to an NFT marketplace to open another account. The final leg is to link the crypto wallet to the NFT market and make the purchase. That system worked fine for the early adopters and crypto enthusiasts, but NFTs need to eventually be accessible to everyday consumers if they are going to meet demand and scale safely and securely.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">We’re seeing crypto exchanges and NFT marketplaces making changes that allow for the <\/span><a href=\"https:\/\/www.mastercard.com\/news\/perspectives\/2022\/simple-nft-purchasing-on-nft-marketplaces\/\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">purchase<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\"> of NFTs with a credit or debit card and it’s another payment choice for consumers to pay how they want, when they want. It’s a big improvement in convenience, but it also means consumers get the features they’re used to when purchasing physical goods, including anti-fraud protections.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">As we see several large brands come into the NFT space, they bring a strong following of loyal consumers that are new to purchasing NFTs, although wanting to continue to be connected to their favorite brands.&nbsp; These changes are enabling the non-crypto native users to start purchasing NFTs without the use of cryptocurrency.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Ultimately, scaling any new technology requires that using it be safe, simple and smart. Making NFT purchases as easy as using a card to buy other everyday items will help bring more consumers into the digital marketplace, and that in turn will generate more use cases for NFTs and ultimately choice for consumers. The blockchain is a complex technology but email, e-commerce and other internet technologies we now take for granted started out with similar obstacles to adoption. Consumer choice and protection will benefit both NFTs and the people who buy and sell them.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<em data-v-f87c67ca=\"\">This post is commissioned by Mastercard and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"David Senci","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"49%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"45%","content":"PERCENT"},{"type":"Crypto","content":"LOCATION"},{"type":"Blockchain &amp; NFTs","content":"ORGANIZATION"},{"type":"51%","content":"PERCENT"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}