{"summary":"Google will work with Coinbase to allow certain customers payment for cloud services from early 2023.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176131\/google-and-coinbase-partner-on-plan-to-offer-crypto-payments-for-cloud-services","publishDate":"2022-10-11T08:45:04","id":5305,"type":null,"title":"Google and Coinbase partner on plan to offer crypto payments for cloud services","category":["COMPANIES"],"content":["Google and Coinbase revealed plans for a strategic partnership which would allow select customers to pay for cloud services using crypto from early 2023.","The new program will use Coinbase's commerce product. In turn, Coinbase will use Google Cloud to process blockchain data, while also using its fiber-optic network to improve its global reach, according to a <a href=\"https:\/\/www.coinbase.com\/blog\/announcing-coinbase-google-cloud\" data-v-f87c67ca=\"\">blog post<\/a>.&nbsp;","Initially crypto payments will be available to companies working in the web3 space, with a limited number of cryptocurrencies available. Coinbase's commerce platform already integrates into several platforms, notably Shopify.&nbsp;","Blockchain developers will also be able to use Google's BigQuery crypto public datasets. These will be powered by Coinbase's cloud nodes — which aim to streamline the building process for decentralized applications.&nbsp;","Google will use Coinbase Prime for its institutional crypto services, such as custody and reporting. In August the world's largest asset manager, BlackRock, also <a href=\"https:\/\/www.theblock.co\/post\/161450\/blackrock-to-offer-institutional-clients-access-to-crypto\" data-v-f87c67ca=\"\">chose<\/a> Coinbase Prime for its institutional offering.","Google Cloud's aim is to make it frictionless for customers to take advantage of its services, Thomas Kurian, CEO of Google Cloud said in the release.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Coinbase","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Google Cloud","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Thomas Kurian","content":"PERSON"},{"type":"Google","content":"ORGANIZATION"},{"type":"Coinbase Prime","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":["COINBASE","GOOGLE","PAYMENTS"],"authors":["Adam Morgan McCarthy","The Block"]}