{"summary":"Crypto exchange OKEx has today launched its non-custodial or decentralized exchange in test mode. The DEX runs on OKEx’s native blockchain network, OKChain, a testnet of which went live today.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/55490\/okex-rolls-out-its-non-custodial-exchange-in-test-mode","publishDate":"2020-02-11T09:05:23","id":5308,"type":null,"title":"OKEx rolls out its non-custodial exchange in test mode","category":["EXCHANGES"],"content":["Crypto exchange OKEx has today launched its non-custodial or decentralized exchange (DEX) - OKEx DEX - in test mode.","The DEX runs on OKEx’s native blockchain network, OKChain, a testnet of which went live today, according to a statement shared with The Block. The testnet has been <a href=\"https:\/\/okexpressroom.prowly.com\/63333-okex-talks-about-okbs-eco-development-along-its-1st-anniversary\" data-v-f87c67ca=\"\">delayed<\/a> by over six months - it was scheduled to get launched last June.","“OKChain is [a] huge milestone for us, meaning that we are now able to provide an open, low-cost, and autonomous ecosystem for everyone to enjoy the benefits blockchain and decentralization brings,” said Jay Hao, CEO of OKEx.","OKEx first revealed the development of OKChain and OKEx DEX in March 2019. At the time, the exchange said it will migrate all OKB tokens to OKChain. Reiterating the point, OKEX today said OKT will be the native token of OKChain and 100% of the genesis block will be mapped to OKB token holders.","\"A total of 700 million unissued OKB will be burned,\" said OKEx, adding that OKT trading will be available when the OKChain mainnet goes live.","It is currently unclear when the mainnet would go live. An OKEx spokesperson told The Block that the mainnet schedule is yet to be determined as “we'd like to receive as much feedback from the market as possible.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"OKEx DEX is the very first dApp [decentralized application] on OKChain. We are looking at DEX potentially leveraging the vast market and user base accrued on OKEX's exchange-traded products suite,\" Lennix Lai, financial markets director at OKEx, told The Block.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nOKEx's development is similar to rival Binance, which <a href=\"https:\/\/www.binance.com\/en\/blog\/327334696200323072\/Binance-DEX-Launches-on-Binance-Chain-Invites-Further-Community-Development\" data-v-f87c67ca=\"\">launched<\/a> its native blockchain network (Binance Chain) and non-custodial exchange (Binance DEX), last year.","It remains to be seen how OKEx DEX performs in the crowded market of non-custodial exchanges. The current top three non-custodial exchanges by market share or trading volumes are -- Uniswap, KyberSwap and Binance DEX, according to The Block research.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"100%","content":"PERCENT"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Jay Hao","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"March 2019","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Lennix Lai","content":"PERSON"},{"type":"Binance DEX","content":"ORGANIZATION"},{"type":"OKT","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}