{"summary":"A quintet of upgrade packages are set to go live on the Ethereum blockchain network Thursday as part of the London hard fork.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/113595\/ethereums-london-hard-fork-what-it-is-and-why-it-matters","publishDate":"2021-08-04T17:07:16","id":5318,"type":null,"title":"Ethereum&#x27;s &#x27;London&#x27; hard fork: What it is and why it matters","category":["ETHEREUM"],"content":["A quintet of upgrade packages are set to go live on the Ethereum blockchain network Thursday as part of the London hard fork.","“Hard fork” is software parlance for a backward-incompatible upgrade, meaning that post-London activation, if you want to stay connected to the Ethereum network, you’ll need to download London.","Thursday’s activation is the culmination of months of work and, at times, drama, particularly as it relates to one of the five Ethereum Improvement Protocols (EIPs), called EIP-1559, that London contains. Earlier this year, upgrade proposal <a href=\"https:\/\/www.theblockcrypto.com\/post\/96316\/ethereum-mining-pools-divided-eip1559\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">drew opposition<\/a> from some mining pools, the operators of which argued that EIP-1559 would unfairly cut into their income.","But we’re getting ahead of ourselves here. Let’s take a look at what’s actually coming with the London hard fork.","London is the overarching title for Thursday’s hard fork, which includes a total of five EIPs. For details on each part of the overall London suite, check out <a href=\"https:\/\/blog.ethereum.org\/2021\/07\/15\/london-mainnet-announcement\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">this post<\/a> by the Ethereum Foundation from last month.","In sum, the main goal of London is to improve the quality of life for Ethereum users. For instance, though London isn’t going to make Ethereum cheaper to use,it does aim to make the cost of using Ethereum more predictable. The controversial proposal dubbed EIP-1559 was designed to achieve this.","EIP-1559 aims to adjust the makeup of Ethereum’s fee market. A blockchain fee market, simply put, is the function of transactors paying fees on their transactions and miners collecting those fees as they add these transactions to the chain.","The way it works now is that the higher the fee a transactor offers in a transaction, the more likely that transaction is likely to be included in a block quickly.","But EIP-1559’s authors contend this is inefficient, and so have proposed a way for block sizes to adjust depending on the degree of congestion on the network and for a “base fee” that either rises or falls based on existing demand. The adjustment of the block size allows for more transactions at a given time.","As The Block Research <a href=\"https:\/\/www.theblockresearch.com\/upcoming-eips-and-the-ethereum-1-0-roadmap-92101\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">noted in a piece from January<\/a>:","“User experience is improved by decreasing the variance and delays waiting for transactions to be approved since miners can adjust to periods of high demand. Fees are easier to estimate because (apart from periods where demand grows quickly) there’s an obviously optimal fee that can be bid to be included in blocks. When there is no congestion, users can always get into the next block with the fixed base fee. If blocks are congested, transaction costs increase rapidly with an increasing base fee, driving the demand down.”","As in the past, included in the London set of EIPs is a fresh delay of Ethereum’s “difficulty bomb” or “ice age” mechanism. This mechanism, if allowed to play out unabated, renders block times on the network incrementally longer and, as a result, makes the network increasingly difficult to use.","Simply put, the bomb exists to incentivize regular updates to the network’s code.","Luckily, there are a few simple ways to monitor when London will actually go live.","First, you can go right to the source and watch the blocks come rolling in.","The activation block is number 12,965,000, according to <a href=\"https:\/\/ethereum.org\/en\/history\/#london\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Ethereum.org<\/a>. As of the time of the writing of this sentence, Ethereum just added its 12,959,923th block, meaning there are (well, or were) 5,077 blocks to go.","Admittedly, this isn’t a very efficient way to track things.","There are also a handful of Web-based countdown tools, including this one from <a href=\"https:\/\/ethernodes.org\/london\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">EtherNodes<\/a>. The tool currently estimates that activation will happen roughly around 8:30 a.m. ET on August 5, but given how block times aren’t exactly consistent, this time window could shift a bit beforehand.","Practically? Maybe...nothing? Or something? I don’t know.","There’s been a fair bit of ink spilled about how London is price-positive or “bullish” because it introduces deflationary characteristics to the network. CoinDesk’s <a href=\"https:\/\/www.coindesk.com\/analysts-take-cautious-stance-on-ether-as-london-hard-fork-nears\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Omkar Godbole<\/a> spoke to some analysts for a piece Wednesday and the collective opinion appears to be “meh” on any immediate market response to London’s activation.","In an investor note sent out this week and obtained by The Block, Goldman Sachs looked at this “ETH as a deflationary asset” topic and struck a downbeat note.","Here’s what the bank had to say:","“The London upgrade will not make ETH a deflationary asset by default. Mainstream media has long touted the idea that burning the Base Fee, would turn ETH deflationary, thereby making it a more attractive store of value for investors. In order for this to happen, the Base Fee burnt would need to offset the ETH issuance rate (i.e. block reward). Some commentators go as far as comparing the Base Fee burning akin to a share buy-back, which takes part of miner’s revenue and internalizes it. What the upgrade does do is decrease the overall ETH inflation rate, while making ETH itself sometimes inflationary and sometimes deflationary. More interestingly, greater Ethereum network activity will mean more ETH burnt as Base Fee and less ETH for miners to resell in the market, potentially reducing miner selling pressure.","As far as the network’s economy is concerned, Compass Mining’s <a href=\"https:\/\/compassmining.io\/education\/what-eip-1559-means-for-ether-miners\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Will Foxley<\/a> estimates that due to the fee market changes in EIP-1559 miner income could fall by as much as 30%.","Under the new regime, users can opt to pay a “priority fee,” also known as a “tip,” to miners in order to make their transactions more attractive. However, the base fee paid by users won’t be given to miners — under EIP-1559, it’ll be burnt instead.","Whether the economic shift resulting from London leads to broader changes in the topography of the global cryptocurrency mining ecosystem is tough to predict.","Miners make money when the cost of producing coins is lower than the expense of powering and taking care of these machines, and a steep income drop would likely cause headaches for low-margin operations.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Thursday","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"August 5","content":"DATE"},{"type":"Omkar Godbole","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"1559","content":"DATE"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Compass Mining’s <a href=\"https:\/\/compassmining.io\/education\/what-eip-1559-means-for-ether-miners\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Will Foxley","content":"ORGANIZATION"},{"type":"8:30 a.m.","content":"TIME"},{"type":"Wednesday","content":"DATE"},{"type":"London","content":"LOCATION"}],"hashtag":["ETHEREUM"],"authors":["Michael McSweeney","The Block"]}