{"summary":"The Japan Virtual and Crypto assets Exchange Association (JVCEA) plans to ease token listing for exchanges, according to Bloomberg. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/178249\/japans-crypto-regulator-plans-to-ease-token-listing-rules-bloomberg","publishDate":"2022-10-19T05:23:30","id":5324,"type":null,"title":"Japan&#x27;s crypto regulator plans to ease token listing rules: Bloomberg","category":["ASIA"],"content":["Japan's cryptocurrency regulator plans to relax rules pertaining to the listing of coins and tokens.&nbsp;","Currently, cryptocurrency exchanges that want to list coins or tokens must have them screened by the Japan Virtual and Crypto assets Exchange Association (JVCEA). Moreover, just over 50 crypto assets are allowed to be traded in Japan, per its regulatory rules.&nbsp;","According to documents seen by Bloomberg, the JVCEA <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-10-19\/japan-to-further-relax-crypto-rules-by-easing-listings-of-tokens\" data-v-f87c67ca=\"\">plans<\/a> to allow exchanges to list tokens without going through this lengthy process. It also said that the relaxed rules could come into effect as early as December, with the documents already being distributed to member firms.&nbsp;","Bloomberg spoke to Vice Chairman of the JVCEA Genki Oda who confirmed these documents. He also said that it could scrap pre-screenings for Japan's new coins by March 2024, as well as for tokens issued through ICOs.","Once the JVCEA's planned measure on relaxing token screening comes into place, exchanges should be able to list tokens within 30 days of reporting their listing plan and coin assessments, with this being shortened to within two weeks from April, continued Oda.&nbsp;","The regulatory relaxation follows recent moves in the country's cryptocurrency space. Last week, a web3 developer platform <a href=\"https:\/\/www.theblock.co\/post\/176510\/web3-developer-platform-settlemint-raises-e16-million-as-it-expands-to-japan\" data-v-f87c67ca=\"\">raised<\/a> $15.5 million to expand to Japan, citing its regulatory clarity. Binance is also said to be <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-09-26\/binance-seeks-permit-to-return-to-japan-market-after-four-years\" data-v-f87c67ca=\"\">seeking<\/a> a license in the country, with rival firm FTX <a href=\"https:\/\/www.theblock.co\/post\/150055\/ftx-launches-licensed-crypto-exchange-service-in-japan\" data-v-f87c67ca=\"\">launching<\/a> services for its Japanese customers in June.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Oda","content":"ORGANIZATION"},{"type":"JVCEA Genki Oda","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"December","content":"DATE"},{"type":"Japan","content":"LOCATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"JVCEA","content":"ORGANIZATION"},{"type":"Exchange Association","content":"ORGANIZATION"},{"type":"March 2024","content":"DATE"},{"type":"ICOs","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"$15.5 million","content":"MONEY"},{"type":"April","content":"DATE"}],"hashtag":[],"authors":["Tom Matsuda","The Block"]}