{"summary":"Binance and its CEO faced requests from US prosecutors at the end of 2020 in relation to an anti-money laundering probe.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/167025\/us-prosecutors-requested-records-on-binance-ceo","publishDate":"2022-09-01T08:44:59","id":5325,"type":null,"title":"US prosecutors requested records on Binance CEO, Reuters reports","category":["LEGAL"],"content":["Prosecutors in the US requested communication records of Binance CEO Changpeng Zhao, or CZ, in late 2020, according to Reuters.&nbsp;","Per the <a href=\"https:\/\/www.reuters.com\/technology\/exclusive-us-sought-records-binance-ceo-crypto-money-laundering-probe-2022-09-01\/\" data-v-f87c67ca=\"\">report<\/a>, the US Justice Department's money laundering division asked the exchange to voluntarily hand over messages relating to its detection of illegal transactions and recruitment of US customers.","Prosecutors' requests extended to any messages instructing employees that, \"documents be destroyed, altered, or removed from Binance's files\" or \"transferred from the United States.\" The request included CZ as well as 12 other executives and partners.&nbsp;","According to Reuters, the request was made in December 2020, in relation to the department's investigations into the exchange's compliance with US financial crime laws. The investigation is ongoing.","Sources went on to say US authorities are investigating whether Binance may have violated the Bank Secrecy Act, according to Reuters.","Under the act, crypto exchanges that conduct substantial business in the US must register with the Treasury and comply with anti-money laundering guidelines. Violations of the act can result in perpetrators facing jail sentences.","A Binance spokesperson told The Block regulators around the globe are reaching out to crypto exchanges as they look to understand the industry.&nbsp;","\"This is a standard process for any regulated organization and we work with agencies regularly to address any outstanding questions,\" they said.","The spokesperson went on to add the exchange prides itself on its \"industry leading global security and compliance team which boasts more than 500 employees across the globe.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"December 2020","content":"DATE"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"US Justice Department","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["ANTI-MONEY LAUNDERING","BINANCE","CZ"],"authors":["Adam Morgan McCarthy","The Block"]}