{"summary":"El Salvador’s president Nayib Bukele tweeted on Sunday that El Salvador will be hosting more than 40 countries this week to discuss topics including bitcoin in the Central American country. \n\nDespite headlines playing up bitcoin’s focus, the event is not primarily about cryptocurrency.","author":["Kristin Majcher","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/147244\/heres-why-central-bankers-are-talking-about-bitcoin-in-el-salvador-this-week","publishDate":"2022-05-17T18:36:58","id":533,"type":null,"title":"Here&#x27;s why central bankers are in El Salvador talking about bitcoin","category":["Events"],"content":["<span data-v-f87c67ca=\"\">On Sunday evening, El Salvador's President Nayib Bukele tweeted that the nation will be hosting more than 40 countries this week to discuss topics including the Central American country's bitcoin rollout.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Tomorrow, 32 central banks and 12 financial authorities (44 countries) will meet in El Salvador to discuss financial inclusion, digital economy, banking the unbanked, the Bitcoin rollout and its benefits in our country,” the <a href=\"https:\/\/twitter.com\/nayibbukele\/status\/1526058744009957376\" data-v-f87c67ca=\"\">tweet<\/a> said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Many interpreted this to mean that El Salvador, which last year made bitcoin legal tender and passed a law requiring that most merchants accept it, <\/span><span data-v-f87c67ca=\"\">is holding a <a href=\"https:\/\/cryptopotato.com\/el-salvador-invites-over-40-central-banks-for-international-event-on-bitcoin\/\" data-v-f87c67ca=\"\">bitcoin-focused conference<\/a> for central bankers. That's not quite the case, however.<\/span>","<span data-v-f87c67ca=\"\">While Bukele <\/span><a href=\"https:\/\/twitter.com\/nayibbukele\/status\/1526058744009957376\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">listed all of the central banks<\/span><\/a><span data-v-f87c67ca=\"\"> that would be participating in the talks, he did not tweet the name of the event. As it turns out, <\/span><a href=\"https:\/\/www.afi-global.org\/events\/digital-financial-services-sme-finance-working-group-meeting\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">two financial meetings<\/span><\/a><span data-v-f87c67ca=\"\"> are happening in San Salvador between May 16 and May 19: The 25th Digital Financial Services Working Group (DFSWG) and 18th SME Finance Working Group (SMEFWG).&nbsp;<\/span>","<span data-v-f87c67ca=\"\">These working groups are both part of the <a href=\"https:\/\/www.afi-global.org\/\" data-v-f87c67ca=\"\">Alliance For Financial Inclusion (AFI)<\/a>, a Malaysia-based organization that describes itself as “a policy leadership alliance owned and led by member central banks and financial regulatory institutions with the common objective of advancing financial inclusion at the country, regional and international levels.” El Salvador's Central Reserve Bank is jointly hosting these two working group meetings with AFI.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But the idea that these meetings would focus mainly on bitcoin seems overplayed, especially considering that the AFI event page <a href=\"https:\/\/www.afi-global.org\/events\/digital-financial-services-sme-finance-working-group-meeting\/\" data-v-f87c67ca=\"\">does not even mention crypto<\/a> or bitcoin by name when describing the content the working groups will cover. <\/span>","<span data-v-f87c67ca=\"\">This confusion has compelled at least one country to set the record straight. Paraguay’s central bank (BCP) <\/span><a href=\"https:\/\/www.bcp.gov.py\/comunicado-sobre-participacion-del-bcp-en-foro-internacional-n1716\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">issued a May 16 statement<\/span><\/a><span data-v-f87c67ca=\"\"> saying that while it is participating in the SME Finance Working Group meeting, that event is not primarily focused on crypto. “The focus of the meeting is not related to cryptocurrencies or the like,” a translation of the Spanish-language BCP statement reads. The bank explained that it was releasing the clarification following publications stating it would participate<\/span><span data-v-f87c67ca=\"\">&nbsp;in an \"international event about cryptocurrencies.\"&nbsp;<\/span>","The BCP then reiterated that cryptocurrency is not legal tender in Paraguay by <a href=\"https:\/\/www.bcp.gov.py\/comunicado-del-bcp-sobre-monedas-virtuales-o-criptomonedas-n1153\" data-v-f87c67ca=\"\">linking back<\/a> to its 2019 remarks on the topic. \"<span data-v-f87c67ca=\"\">Likewise, the BCP does not plan to discuss cryptocurrencies in the said environment or meeting, a matter on which an institutional position has been established at the time,\" it added.<\/span>","<span data-v-f87c67ca=\"\">The Block asked AFI for an agenda but did not receive one by press time.<\/span>","<span data-v-f87c67ca=\"\">Cryptocurrency <a href=\"https:\/\/twitter.com\/romanmartinezc\/status\/1526342634016542722\" data-v-f87c67ca=\"\">has come up<\/a> during the working group meetings as central bank heads discuss financial inclusion. After all, financial leaders sitting in El Salvador are probably curious to know how the country's bitcoin implementation is playing out there. But it's a stretch to say this is “a conference that may best be described as the Davos for Bitcoin,” <\/span><span data-v-f87c67ca=\"\">as<\/span>&nbsp;<a href=\"https:\/\/fortune.com\/2022\/05\/16\/el-salvador-president-nayib-bukele-davos-bitcoin-crypto\/\" data-v-f87c67ca=\"\">one media outlet<\/a> wrote. It is primarily focused on financial inclusion, and one of several meetings that AFI holds each year."],"hashtag":[]}