{"summary":"China has published a new book to educate government officials on digital currency and propose policy measures to deal with emerging challenges like","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/66744\/chinese-communist-partys-new-blockchain-book-casts-libra-as-a-threat-to-its-currency-system","publishDate":"2020-05-28T16:31:18","id":5334,"type":null,"title":"Chinese Communist Party&#x27;s new blockchain book casts Libra as a threat to its currency system","category":["CHINA"],"content":["China has published a new book to educate government officials on digital currency and propose policy measures to deal with emerging challenges like Facebook's Libra.&nbsp;","<span data-v-f87c67ca=\"\">The book, <i data-v-f87c67ca=\"\">Discussing Digital Currency with Leading Officials,<\/i> is part of a series that explores the political and economic consequences of technologies like cryptocurrency and artificial intelligence. The publisher, the Central Party School, is a higher education institution that trains government officials for the Communist Party. <\/span>","<span data-v-f87c67ca=\"\">As <a href=\"https:\/\/www.jinse.com\/blockchain\/678892.html\" data-v-f87c67ca=\"\">reported<\/a> by Chinese news outlet jinse.com last week, the book<\/span><span data-v-f87c67ca=\"\"> touches on a wide range of topics including central bank digital currency, cross-border payments, stablecoins, Libra, initial coin offerings and exchanges, among others.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to jinse.com, the book argues that Libra is an excellent example of public-private partnerships and has the potential to become the future world currency. But at the same time, the book argues that Libra could get in the way of the government’s attempt to increase the international influence of the Chinese yuan, according to the report.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“China originally relied on mobile payment to get ahead, but now Libra has the potential to change the game again,” Hongzhang Wang, the former chairman of China Construction Bank and one of the authors of the book’s preface, said recently in another <\/span><a href=\"https:\/\/baijiahao.baidu.com\/s?id=1666738616600005511&amp;wfr=spider&amp;for=pc\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">article<\/span><\/a><span data-v-f87c67ca=\"\"> about the book, by Chinese media outlet Sina.com. “We can’t deal with new risks by discouraging technological developments,\" he said. \"This would allow U.S. companies to build a digital currency system through blockchain technology, which could threaten or even surpass Alipay or WeChat Pay.”<\/span>","Wang went on to say that <span data-v-f87c67ca=\"\">the best way to deal with challenges like Libra is through the innovation of China’s regulatory system. Indeed, the new book apparently suggests that China is exploring new regulatory policies regarding initial coin offerings as well as trading and exchanges, which as of now remain in a legal grey area.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Discussing Digital Currency","content":"ORGANIZATION"},{"type":"Communist Party","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"China Construction Bank","content":"ORGANIZATION"},{"type":"last week","content":"DATE"},{"type":"Sina.com","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"” Hongzhang Wang","content":"PERSON"},{"type":"Libra","content":"PERSON"},{"type":"Libra","content":"LOCATION"},{"type":"Central Party School","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Yilun Cheng","The Block"]}