{"summary":"Will Craig Wright claim under oath that he is the real Satoshi Nakamoto?  It&#x27;s a bet twitter influencers, journalists, and other market participants can","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/12711\/crypto-twitter-rejoice-a-new-way-to-bet-on-just-about-anything-in-the-market-is-live-on-ethereum","publishDate":"2019-02-20T16:00:57","id":5337,"type":null,"title":"Crypto Twitter rejoice! A new way to bet on just about anything in the market is live on Ethereum","category":["DEFI"],"content":["Will Craig Wright claim under oath that he is the real Satoshi Nakamoto?&nbsp;","It's a bet twitter influencers, journalists, and other market participants can make via Helena, the ConsenSys spin out, which announced on Wednesday its official launch on the Ethereum mainnet. Previously, the ConsenSys spoke was being tested internally. The firm, led by Mark Ziade, made the announcement at an industry conference hosted by crypto research firm Delphi and Oppenheimer.&nbsp;","Helena, <a href=\"https:\/\/pm.helena.network\/markets\/list\" data-v-f87c67ca=\"\">a so-called predictions market<\/a>, allows people to earn rewards by providing insights on different industry events. \"For example, Insight Providers can predict the total capacity of the Bitcoin Lightning Network in BTC by a specific date, or even vote on a prediction about whether or not Dr. Craig Wright will testify under oath stating he is Satoshi,\" a press release noted. By leveraging the wisdom of the crowd, the platform could provide insights for future events in the digital asset ecosystem.","Helena is one of the first firms to \"graduate\" from ConsenSys Labs under the ConsenSys 2.0 era, and follows moves recently made by Veil, which is building peer-to-peer trading for prediction markets and the launch of derivatives on top of Augur. The key difference, however, is Helena has built its platform on top of Gnosis, and will use play tokens to gamify buying into markets rather than using real funds — a process the team believes will remove frictions currently seen on rival Veil. So-called \"insight providers\" will be rewarded monthly on Helena depending on how well their predictions perform.&nbsp;","\"The idea underlying Helena is a belief that ‘play money’ prediction markets, coupled with diligent participant curation, will enable the delivery of real-time quantified fundamental insights to investors,\" Ziade said in a release. \"Crypto Twitter has been essential for the crypto community to discuss, debate and share insights, but never before have we been able to truly measure the accuracy and enduring insight of these predictions.”","To be sure, it is early days for the platform. And it is unclear if Helena can grow a user-base that is large and heterogeneous enough to render accurate predictions. Whereas fees on Augur tend to range from 0.25-1% for traders, Helena will charge customers looking to tap into the platform's market data a monthly subscription fee, according to a source. Ziade told this reporter that its fee structure isn't set yet and at the moment the platform is free.","\"The global aspect of the platform (through the blockchain infrastructure) ensures demographic diversity and decentralization and the focus on onboarding people from various level of expertise and various industry backgrounds (tech consultants, research analysts, crypto experts, twitter influencers, crypto and non-crypto reporters, crypto professionals, tech professionals, developers, entrepreneurs etc.) ensures the diversity and independence of opinion,\" Ziade said in an email to The Block.","[related id=\"1\"]Prediction markets, if leveraged at scale, could potentially provide the world with one of the most efficient forecasting tools available, <a href=\"https:\/\/www.theblockcrypto.com\/2018\/09\/19\/block-by-block-prediction-markets\/\" data-v-f87c67ca=\"\">as noted by The Block researcher Steven Zheng<\/a>. Still, censorship and centralization greatly handicap the industry, which should immediately capture the interest of entrepreneurs in the world of crypto.","<em data-v-f87c67ca=\"\">This post has been update to clarify Helena's fee structure.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Helena","content":"ORGANIZATION"},{"type":"Bitcoin Lightning Network","content":"ORGANIZATION"},{"type":"Craig Wright","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Gnosis","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Steven Zheng","content":"PERSON"},{"type":"Satoshi","content":"PERSON"},{"type":"Oppenheimer","content":"ORGANIZATION"},{"type":"Mark Ziade","content":"PERSON"},{"type":"Helena","content":"LOCATION"},{"type":"\" Ziade","content":"PERSON"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Insight Providers","content":"ORGANIZATION"},{"type":"Delphi","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"1%","content":"PERCENT"},{"type":"ConsenSys Labs","content":"ORGANIZATION"},{"type":"Ziade","content":"PERSON"}],"hashtag":["CRYPTO"],"authors":["Frank Chaparro","Ryan Todd","The Block"]}