{"summary":"The New York Times on Friday released new details and findings about its News Provenance Project, a blockchain-focused research and development project. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/68136\/new-york-times-publishes-details-about-its-blockchain-prototype-project","publishDate":"2020-06-12T11:52:23","id":5342,"type":null,"title":"New York Times publishes details about its blockchain prototype project","category":["TECHNOLOGY"],"content":["The New York Times on Friday released new details and findings of its News Provenance Project, a blockchain-focused research and development project.&nbsp;","<a href=\"https:\/\/open.nytimes.com\/could-blockchain-be-a-solution-to-the-issue-of-misinformation-online-492ca63ae42\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">In a blog post<\/a>, product manager Pooja Reddy delved into the initiative, which it built using <a href=\"https:\/\/www.theblockcrypto.com\/post\/57564\/onchain-custodian-delivers-enhanced-wallet-management-with-the-support-of-ibm\" data-v-f87c67ca=\"\">IBM<\/a>'s Blockchain Platform. Word of the Times' work on a blockchain project emerged last spring through <a href=\"https:\/\/www.theblockcrypto.com\/linked\/15629\/the-new-york-times-is-exploring-blockchain-enabled-publishing\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a now-deleted job posting<\/a>. The Times later launched a <a href=\"https:\/\/www.newsprovenanceproject.com\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">website<\/a> for the News Provenance Project, which indicated it would move \"from research to execution\" during a new phase in 2020.","Friday's blog post details the results of that execution. As Reddy noted:","\"A prong of The News Provenance Project was to conduct research around how readers make judgments about the photos they see online. To help with that research, we built a prototype that leveraged blockchain to surface a news photo's contextual information on a simulated social media feed. We wanted to see whether visible contextual information, such as the photographer's name and the location depicted in the photo, could help readers better discern the credibility of news photos in their social feeds.\"","From a technology perspective, Reddy said that the Times \"wanted to see if it was possible to record everything that happens to a photo, from capture to publication, in the form of photo metadata and display that information on social media platforms.\"","\"Blockchain's ability to preserve the full history of a photo separately from the image file itself made it a compelling technology for our explorations around tracking provenance,\" she continued.","For the trial, The Times said it built a network of test news organizations as well as a social media platform that would link them. Additionally, the organizations had shared ownership of a distributed ledger and database between them and \"could make changes to photo metadata in the database.\"","The end result, per Reddy: \"When testing our prototype with users, we found that it effectively helped them make informed judgments about photos in a social media feed. Yet, there is more research and exploration that needs to be done.\"","\"While blockchain technology could be a viable tool in helping preserve the origin of news photos, there are a number of challenges that would need to be addressed before it could be widely used,\" she continued.","According to Reddy, prototype-centric assumptions would face critical tests in real-world environments, including about the content that exists on the blockchain itself as well as how photos may be altered when shared on social media. Reddy also stressed that \"[b]lockchain networks must be accessible to news organizations\" and that for such a system to work, a variety of outlets would need to be brought in with the lowest barrier to entry possible.","\"This prototype was an experiment that taught us a lot about the power of credible, contextual information in social media feeds, but there is a long way to go before something like this can be fully realized,\" Reddy wrote.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The News Provenance Project","content":"ORGANIZATION"},{"type":"The Times","content":"ORGANIZATION"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Pooja Reddy","content":"PERSON"},{"type":"Blockchain","content":"PERSON"},{"type":"News Provenance Project","content":"ORGANIZATION"},{"type":"Times","content":"ORGANIZATION"},{"type":"IBM","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"spring","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"Reddy","content":"PERSON"},{"type":"Reddy","content":"LOCATION"}],"hashtag":["SOCIAL MEDIA"],"authors":["Michael McSweeney","The Block"]}