{"summary":"PoolTogether raised $1.05 million from IDEO CoLab Ventures, ConsenSys Labs and DTC Capital, based on a simple agreement for future equity (SAFE). \nThe new funds will help the firm improve its security, increase the size of its prizes, and support its zero-fee services\nThe firm also has plans to roll out a new USDC pool with daily prizes and a feature allowing users to link their tickets together.","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/54760\/pooltogether-raises-1m-to-improve-its-dai-based-weekly-pool-and-launch-a-new-usdc-based-daily-pool","publishDate":"2020-02-03T12:21:09","id":535,"type":null,"title":"Pool Together raises $1m in order to make improvements","category":["Ethereum"],"content":["<span data-v-f87c67ca=\"\">PoolTogether has raised $1.05 million to improve the protocol’s security, add larger prizes, support the platform’s zero-fee services as well as launching a USDC daily pool and ticket-pooling feature in the near future.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Established in Sep. 2019 and backed by the&nbsp;MakerDAO Foundation, PoolTogether is an Ethereum-based no-loss lottery system, which was initially designed by governments to counter inflation and encourage saving. <\/span>","<span data-v-f87c67ca=\"\">With PoolTogether, users can purchase a lottery ticket at the price of 1 Dai. Payments <\/span><span data-v-f87c67ca=\"\">will immediately start earning yield through Compound’s Dai money market and, every week, one ticket holder will&nbsp;<\/span><span data-v-f87c67ca=\"\">win the lottery and receive the interest that's earned. <\/span>","<span data-v-f87c67ca=\"\">According to a Monday <\/span><a href=\"https:\/\/medium.com\/pooltogether\/pooltogether-raises-1-million-to-expand-prize-linked-savings-protocol-eb51a1f88ed8\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">announcement<\/span><\/a><span data-v-f87c67ca=\"\">, the startup secured $1.05 million in an investment round led by <\/span><span data-v-f87c67ca=\"\">IDEO CoLab Ventures, with participation from <\/span><span data-v-f87c67ca=\"\">ConsenSys Labs and DTC Capital.&nbsp;<\/span><span data-v-f87c67ca=\"\">The fundraise was based on a simple agreement for future equity, PoolTogether's co-founder and chief vision officer Leighton Cusack told The Block.&nbsp;<\/span>","The fresh inflow of capital will support the firm in a number of areas.&nbsp;","<span data-v-f87c67ca=\"\">First, PoolTogether will use the new investment to work on platform security, a process that will include the hiring of security auditors and implementing higher rewards for their bug bounty program. Notably, Cusack revealed that the firm also received a small grant of less than $50,000 from MakerDAO to pay for its first security audit.<\/span>","<span data-v-f87c67ca=\"\">Second, a part of the new fund will be put into the interest pool as “sponsored Dai,” which will contribute to the weekly yield but will not be eligible to win the lottery. The pool currently features approximately $250,000 worth of sponsored Dai, the company said, and the new addition is set to raise the system’s expected value.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Third, PoolTogether initially planned to keep 10 percent of the yield earned for itself but has since then implemented a zero-fee model. The new investment will support the firm as it provides no-fee services.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Beyond the above immediate enhancements, the investment will also finance PoolTogether as it launches new pools and features.<\/span>","<span data-v-f87c67ca=\"\">According to Cusack, the firm is planning on releasing<\/span> a new USDC-based pool with daily prizes. <span data-v-f87c67ca=\"\">“Increasing the frequency of the prizes improves the probability for small depositors,” he said. “This new daily prize pool uses USDC, so we're also expanding the token types people can use.”<\/span>","<span data-v-f87c67ca=\"\">Moreover, the firm is developing a new feature, “pods,” which enables users to link their tickets together and share the prize if they win. This ticket-pooling feature will allow users with small deposits to compete with those holding much larger funds, Cusack said.<\/span>","<span data-v-f87c67ca=\"\">PoolTogether has seen rapid growth since its launch, with a recent pool amassing over <\/span><span data-v-f87c67ca=\"\">$195,000 from 1,187 unique players, The Block previously <\/span><a href=\"https:\/\/www.theblockresearch.com\/pooltogether-no-loss-lottery-54004\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">noted<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">Cusack believes that the platform’s growth is spurred by the “flywheel effect” that has started to emerge in Jan., where more deposits lead to larger prizes and larger prizes, in turn, lead to more deposits.<\/span>","<span data-v-f87c67ca=\"\">“As people have seen this trend in action, I think that generates a lot of interest,” he said.<\/span>","<span data-v-f87c67ca=\"\">Moreover, according to <\/span><span data-v-f87c67ca=\"\">Cusack, while platforms linking savings products to prizes are prevalent in traditional finance, they are still lacking in the Ethereum ecosystem.<\/span>","<span data-v-f87c67ca=\"\">“Prize linked savings products have been massively popular in traditional finance. Building one on Ethereum only makes it better,” he said. “There is high demand for products like these but not many exist.”<\/span>"],"hashtag":["DAI"]}