{"summary":"Former SEC Chair Jay Clayton said that applicants for a spot bitcoin ETF have a strong chance at approval if they can prove that it’s a more efficient and effective way for investors to buy into the digital asset.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/238701\/former-sec-chair-says-bitcoin-etf-approval-hard-to-resist-if-efficacy-proven","publishDate":"2023-07-10T13:20:04","id":5351,"type":null,"title":"Former SEC chair says bitcoin ETF approval &#x27;hard to resist&#x27; if &#x27;efficacy&#x27; proven","category":["POLICY"],"content":["Former U.S. Securities and Exchange Commission Chair Jay Clayton said that applicants for a spot bitcoin exchange-traded fund have a strong chance at approval if they can prove that it’s a more efficient and effective way for investors to buy into the digital asset.","“If they’re right that that the spot market has similar efficacy to the futures market, it would be hard to resist approving a bitcoin ETF,” Clayton said in an appearance on cable news network CNBC on Monday.","But Clayton, who led the SEC during several rejections of previous bitcoin spot ETF applications and now works in private practice as a senior policy advisor at the international law firm Sullivan &amp; Cromwell, demurred on making a prediction as to when a bitcoin spot ETF might finally happen.","The SEC has rejected applications in the past due to lack of transparency and concerns about how to protect investor from the unregulated spot market.","Clayton explained further the SEC’s thinking, comparing how it handled approval of futures ETFs in the past.","“When the SEC approved a futures-based ETF, they said ‘let’s look at the futures market, we see the surveillance, we see the protections in that market for the investor, that are sufficient,” Clayton said in the televised interview. “We don’t see them in the spot market, so we’re going to make that distinction.’”","A recent application by investment giant BlackRock, which has a near-perfect record in ETF approvals, spurred enthusiasm that a spot bitcoin ETF could finally become a reality.","The SEC first approved futures ETFs for the cryptocurrency in 2021.","The most recent applications from BlackRock and others have proposed using Coinbase as a partner for market surveillance and information on trading and clearing to increase transparency in the pseudonymous market. The SEC is <a href=\"https:\/\/www.theblock.co\/post\/238500\/coinbase-knew-it-violated-securities-law-sec-says\" data-v-f87c67ca=\"\">currently suing<\/a> the U.S. crypto trading firm over alleged violations of U.S. securities laws.","In another ongoing lawsuit, digital asset investment firm Grayscale <a href=\"https:\/\/www.theblock.co\/post\/176392\/grayscale-says-sec-harmed-investors-in-new-brief-appealing-etf-rejection\" data-v-f87c67ca=\"\">took the SEC to court<\/a> over the agency's rejection of its own bitcoin spot ETF.","Legislation to grant greater authority to the Commodity Futures Trading Commission in directly regulating the spot market for bitcoin, among other possible digital assets, stalled last year due in part to the FTX collapse and scandal surrounding Sam Bankman-Fried. But new <a href=\"https:\/\/www.theblock.co\/post\/235852\/u-s-house-committee-to-vote-on-crypto-stablecoin-legislation-in-july\" data-v-f87c67ca=\"\">legislation<\/a> could grant similar authority and might assuage regulators when considering ETF approval.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BlackRock","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Jay Clayton","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Clayton","content":"PERSON"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Sullivan &amp; Cromwell","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["BLACKROCK","SEC"],"authors":["Colin Wilhelm","The Block"]}