{"summary":"CEO Ivan Soto-Wright thinks big brands’ demand for web3 is undimmed, even after a series of disasters in the wider crypto space. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/192384\/moonpay-soto-wright-web3-culture-crypto-winter","publishDate":"2022-12-06T08:05:27","id":5352,"type":null,"title":"MoonPay’s Soto-Wright wants web3 to ‘permeate culture’ — at a challenging time","category":["CORPORATE NFTS"],"content":["<span data-contrast=\"none\" data-v-f87c67ca=\"\">Ivan Soto-Wright could speak uninterrupted about web3 for the entirety of an interview without being asked a single question, if allowed to. There is, after all, a lot to cover.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Soto-Wright is one of web3’s busiest executives. While running a $3.4 billion company, he finds ample time to schmooze musicians and television stars, largely thanks to his efforts to broker NFTs to the rich and famous. Lil Baby, the rapper, gave MoonPay a shout-out in a song released in October — “Invest a lil’ somethin’ into MoonPay just to try somethin’” — after spending time with Soto-Wright. Few Series A founders live in $38 million <\/span><a href=\"https:\/\/nypost.com\/2021\/12\/17\/crypto-czar-ivan-soto-wright-invests-in-38m-miami-mansion\/\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">Miami mansions<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\">. Soto-Wright does.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">His company, MoonPay — at its inception a rather dry payments business selling tools to other firms that allow their customers to buy and sell crypto — is today one of the sector’s buzziest, constantly unfurling new partnerships and projects in the wider web3 space. Many of those initiatives involve NFTs.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Still, Soto-Wright insists he’s a down-to-earth guy who used to sleep on a tatami mat early in his career in London to save money for rent. “I came from that bootstrapper mindset,” he said in an interview with The Block. “It’s not been an overnight success.”&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">He frames his glamorous lifestyle as part of a mission to make crypto culturally relevant. “It goes back to why are we doing this? Because we think that it’s important that our brand is able to permeate culture.”<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">MoonPay’s numerous new offshoots, too, are part of his plan to align the firm with the world’s biggest brands and help as they experiment with web3 technologies.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Even amid <\/span><a href=\"https:\/\/www.theblock.co\/post\/152059\/crypto-firms-have-laid-off-more-than-1500-people-in-the-last-two-months-as-downturn-fears-persist\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">widespread retrenchment<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> from crypto rivals during the bear market — one punctuated by the spectacular collapse of Sam Bankman-Fried’s empire last month — MoonPay continues to try new things because Soto-Wright believes big brands’ appetite for web3 is undiminished. He points out that MoonPay’s HyperMint went live as recently as June, with launch partners including Fox Corporation and Death Row Records.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“They had the full knowledge of knowing what the climate was, so that if they were hesitant, they could have pulled back and said, ‘we don’t want to do it’ — but they said, ‘we absolutely want to do it,’” Soto-Wright said. Nike debuted a MoonPay-powered platform for web3 wearables called .Swoosh <\/span><a href=\"https:\/\/www.theblock.co\/post\/186733\/nike-to-debut-its-own-platform-for-web3-wearables\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">just a few weeks ago<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\">.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">How MoonPay’s bold bets on new web3 infrastructure pan out will depend on its ability to keep landing these partnerships. Former Time magazine president Keith Grossman will now spearhead that effort —&nbsp;<\/span><a href=\"https:\/\/decrypt.co\/115775\/executive-who-brought-time-magazine-into-web3-is-leaving-for-moonpay\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">joining MoonPay<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> as president of its enterprise division last week.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“Where is the most valuable Intellectual Property being created?” Soto-Wright asked. “Well, a lot of it is being created in Hollywood, a lot of it is being created by some of the world’s biggest brands.”<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Supporting his thesis is the fact that, despite the wider slump in the NFT market this year, some corporate experimentation has proven extremely lucrative. A report published in October by the research arm of Galaxy Digital showed that Nike had already <\/span><a href=\"https:\/\/www.theblock.co\/post\/179004\/nft-royalties-have-generated-1-8-billion-with-nike-bayc-coming-out-top-galaxy\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">pocketed more than $91 million<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> in NFT royalties.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Soto-Wright sees MoonPay’s new divisions — those catering to big brands and other creators — as “increasing the surface area” of its core payments business. To him, there is a cohesion between MoonPay’s offshoots that perhaps is less obvious to outsiders. “These are all highly interrelated building blocks together, right? There’s payments infrastructure, there’s smart contract infrastructure, and there’s the wallet scaffolding that connects it,” he said, adding that a lot of energy this year has gone towards positioning MoonPay as a comprehensive “web3 infrastructure.”<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">With so many new projects, Soto-Wright unsurprisingly described 2022 as an “R&amp;D year” for the business, in which it shifted away from profitability. He could hardly have picked a riskier year for experimentation.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">MoonPay was not exposed to FTX and took no financial hit from its collapse. As things stand, the company is not planning any layoffs and has over five years of financial runway, Soto-Wright said.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">That is not to say, however, that he is not cautious about getting caught out in the crypto winter.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">At the start of year, Soto-Wright hoped to double the company’s headcount — which today stands around 280. Now, he is more focused on establishing a clear corporate culture, and less on personnel growth. “I’d like us to be like 300 Spartans,” he said. “We want to be lean. We want to be financially disciplined. I don’t see us making huge increases in our headcount until we feel really confident about how the team is operating.”<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">The startup published a blog post outlining its <\/span><a href=\"https:\/\/www.moonpay.com\/blog\/moonpay-values\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">corporate values<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> in September 2021. One of those is “kaizen” — a Japanese word close to Soto-Wright's heart that means “change for better.” He said the term embodies his own love of sports. He rowed for St. Anne’s College at Oxford University, often posts footage of himself doing pull-ups at a public park on Instagram and is a fan of wellness activities, in particular the sauna.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“I’m definitely not the four hours on a beanbag kind of guy,” he said — a reference to former FTX boss Bankman-Fried’s sleeping habits. “I make sure I try to hit the sauna as much as possible and just try to keep my mind focused, because there’s so much stuff that you’re doing.”<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">It is a precarious time indeed to have so many plates spinning, and Soto-Wright acknowledges that MoonPay still needs “prove out” its new projects.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">But he has grand ambitions. Today, there are 14 million customers using the MoonPay payments platform. Armed with largely untested web3-focused infrastructure in the form of HyperMint and the web3 passport, the company hopes to connect those millions of people to big brands’ NFT projects — which it also hopes to have a hand in creating.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“We envision a world where we can bridge our customers with the experiences that we’re building with the leading web3 brands,” said Soto-Wright. “The best analogy is we’re becoming more like an American Express.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Soto","content":"PERSON"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"MoonPay —","content":"ORGANIZATION"},{"type":"Miami","content":"LOCATION"},{"type":"September 2021","content":"DATE"},{"type":"Keith Grossman","content":"PERSON"},{"type":"$38 million","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$91 million","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"American Express","content":"ORGANIZATION"},{"type":"$3.4 billion","content":"MONEY"},{"type":"London","content":"LOCATION"},{"type":"Nike","content":"ORGANIZATION"},{"type":"St. Anne’s College","content":"ORGANIZATION"},{"type":"Time magazine","content":"ORGANIZATION"},{"type":"Oxford University","content":"ORGANIZATION"},{"type":"Hollywood","content":"LOCATION"},{"type":"Fox Corporation and Death Row Records","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Ivan Soto","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"Wright","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"ups","content":"ORGANIZATION"}],"hashtag":["NFT INFRASTRUCTURE","PAYMENTS"],"authors":["Ryan Weeks","The Block"]}