{"summary":"The old Terra ecosystem tokens are on the rise today with Luna Classic surging 20% in the last 24-hour trading period.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/208412\/luna-classic-token-price-rises-to-highest-level-since-november","publishDate":"2023-02-03T06:30:21","id":5359,"type":null,"title":"Luna Classic token price rises to highest level since November","category":["MARKETS"],"content":["Luna Classic (lunc) is up 20% in the last 24-hour trading period and has risen to its highest price point since November, according to data from CoinGecko.","Luna Classic is the native token of the old Terra ecosystem that collapsed in March. The Terra community voted to <a href=\"https:\/\/www.theblock.co\/post\/149127\/terra-gets-second-life-as-new-blockchain-goes-live-with-luna-2-0-airdrop\" data-v-f87c67ca=\"\">create a new network<\/a> with a fresh Luna token. As such, the old Luna coin became known as Luna Classic.","Luna Classic up 20% today. Image: TradingView","Today’s price pump for Luna Classic is in keeping with a trend so far this year. The old Luna coin is up <a href=\"https:\/\/www.coingecko.com\/en\/coins\/terra-luna-classic\" data-v-f87c67ca=\"\">30%<\/a> in the last 30-day trading period, making it the biggest gainer among the top 50 cryptocurrencies by market capitalization.","This price surge has coincided with a 75% increase in open interest for Luna Classic, <a href=\"https:\/\/coinalyze.net\/terra-classic\/open-interest\/\" data-v-f87c67ca=\"\">according<\/a> to Coinalyze. Open interest refers to the number of unsettled derivatives contracts for an asset. It is a measure of how much money is flowing into the market for a particular asset.","UST Classic is the highest crypto price gainer today. Image: TradingView","Terra‘s old stablecoin, now called UST Classic, is up <a href=\"https:\/\/www.coingecko.com\/en\/coins\/terraclassicusd\" data-v-f87c67ca=\"\">60%<\/a> today, making it the biggest gainer among all tokens tracked by CoinGecko. UST virtually lost its peg to the U.S. dollar during the Terra collapse, falling as low as $0.01 during the crisis. UST Classic is now trading at $0.039 and is up 90% in the last month.","The price gains for these old Terra coins are in keeping with the current state of the crypto market. Token prices have been on the rise since the start of the year. The crypto market has crossed the $1 trillion mark, after having fallen below that level in November.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"$1 trillion mark","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"Luna Classic","content":"ORGANIZATION"},{"type":"75%","content":"PERCENT"},{"type":"60%","content":"PERCENT"},{"type":"30%","content":"PERCENT"},{"type":"November","content":"DATE"},{"type":"$0.01","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"Terra","content":"ORGANIZATION"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"UST","content":"ORGANIZATION"},{"type":"$0.039","content":"MONEY"},{"type":"UST Classic","content":"ORGANIZATION"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}