{"summary":"&quot;This module represents a significant step towards strong diversification and decentralization,&quot; Obol wrote Friday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/261439\/lido-finances-approves-proposal-to-enable-obol-decentralized-staking-module","publishDate":"2023-11-03T14:49:58","id":5365,"type":null,"title":"Lido Finance approves proposal to enable decentralized staking module","category":["CRYPTO ECOSYSTEMS"],"content":["Liquid staking protocol Lido Finance voted to approve a proposal incorporating a simple distributed validator technology module from Obol and SSV Network.&nbsp;","The motion <a href=\"https:\/\/snapshot.org\/#\/lido-snapshot.eth\/proposal\/0xf3ac657484444f0b54eba2c251135c47f875e3d1821496247d11bdd7fab0f291\" data-v-f87c67ca=\"\">passed<\/a> with over 99% support on Nov. 3. As a condition, of the use the Lido DAO cover fund to pay for module slashing penalties and other costs was also approved.&nbsp;","\"DVT represents the fastest way to add many new Node Operators to the Lido Node Operator set with a more diverse profile of solo and community staker participants while benefiting from the technology's inherent benefits such as increased resilience, distribution, and security,\" a Lido member wrote in the proposal.","\"The Simple DVT module is intended to demonstrate that utilizing DVT on mainnet is possible, while furthering the diversification of the Lido Node Operator set on Ethereum and potentially setting the stage for more scalable and permissionless DVT-based modules in the near future.\"","\"This vote signifies support for the advancement of this new module. This will be Lido's first module to use Obol DVs on Ethereum mainnet,\" Obol Labs, the firm building the Obol network, wrote on <a href=\"https:\/\/twitter.com\/ObolNetwork\/status\/1717570637408120901\" data-v-f87c67ca=\"\">social media<\/a>. \"This module represents a significant step towards strong diversification and decentralization of the Lido Node Operator set.\"","SSV Network and Obol enable decentralized staking by connecting users to a network of operators that jointly manage Ethereum validator nodes.","<em data-v-f87c67ca=\"\">Updated with information that SSV Network is also involved in the simple DVT module.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lido Finance","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"Lido Node Operator","content":"ORGANIZATION"},{"type":"Nov. 3","content":"DATE"},{"type":"Lido DAO","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"DVT","content":"ORGANIZATION"},{"type":"SSV Network","content":"ORGANIZATION"},{"type":"99%","content":"PERCENT"},{"type":"Obol DVs","content":"ORGANIZATION"}],"hashtag":["VALIDATORS"],"authors":["MK Manoylov","The Block"]}