{"summary":"Shuffle&#x27;s partnership with Bazaar also facilitates cross-chain accessibility with users on Ethereum, Base, Arbitrum, Polygon, ZkSync and Optimism.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280677\/crypto-casino-shuffle-partners-with-decentralized-launchpad-bazaar-to-boost-its-liquidity-bootstrapping-pool","publishDate":"2024-03-05T13:05:04","id":5368,"type":null,"title":"Crypto casino Shuffle partners with decentralized launchpad Bazaar to boost its liquidity bootstrapping pool","category":["DEFI"],"content":["The crypto casino Shuffle has partnered with the decentralized launchpad Bazaar to help bolster its liquidity bootstrapping pool (LBP), which forms token's on-chain liquidity.","The partnership comes ahead of Shuffle's airdrop in early March, during which 10% of the 1 billion SHFL token supply will be distributed. The LBP will occur from March 10 at 5:00 p.m. ET (22:00 UTC) to March 13 at 5 p.m. ET (22:00 UTC), according to a release shared with The Block.&nbsp;","Shuffle's partnership with Bazaar also facilitates cross-chain accessibility with users on Ethereum, Base, Arbitrum, Polygon, ZkSync and Optimism.","\"This partnership between SHFL and Bazaar signifies a leap forward in token launch methodologies, promising an equitable, secure, and dynamic participation experience for our community,\" Shuffle wrote in a release. \"Following the LBP's conclusion, Airdrop 1 will be claimable on the platform, marking the end of SHFL's first airdrop and the full launch of the SHFL token.\"","Shuffle plans to distribute 28% of its token supply through three airdrops, with the subsequent two airdrops each releasing 9% of the total SHFL tokens in the forthcoming years, The Block previously <a href=\"https:\/\/www.theblock.co\/post\/277644\/crypto-casino-shuffle-targets-token-airdrop-for-first-week-of-march\" data-v-f87c67ca=\"\">reported<\/a>.&nbsp;","“Bazaar makes the launch of SHFL as open as possible. We’re super excited to be working with them for the first step in our of the launch of SHFL and our airdrop,\" a Shuffle representative told The Block.","<em data-v-f87c67ca=\"\">(Updates LBP period.)&nbsp;<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"9%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"Bazaar","content":"ORGANIZATION"},{"type":"Polygon","content":"LOCATION"},{"type":"Base","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"March 13","content":"DATE"},{"type":"March 10","content":"DATE"},{"type":"March","content":"DATE"},{"type":"28%","content":"PERCENT"},{"type":"Arbitrum","content":"LOCATION"},{"type":"SHFL","content":"ORGANIZATION"},{"type":"5:00 p.m.","content":"TIME"},{"type":"5 p.m.","content":"TIME"},{"type":"LBP","content":"ORGANIZATION"}],"hashtag":["TOKENS"],"authors":["MK Manoylov","The Block"]}