{"summary":"The Block Research was commissioned by Forte to create “Blockchain-Based Gaming: A Primer” which provides a comprehensive introduction to how blockchain technology is being employed in video gaming experiences.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/120409\/blockchain-based-gaming-a-primer-brought-to-you-by-forte","publishDate":"2021-10-13T11:17:16","id":5372,"type":null,"title":"Blockchain-Based Gaming: A Primer — Brought to you by Forte","category":["THE BLOCK"],"content":["<b data-v-f87c67ca=\"\">Abstract<\/b>","<span data-v-f87c67ca=\"\">The video gaming industry is evolving across several dimensions.<\/span>","<span data-v-f87c67ca=\"\">User experiences are transforming. In-person split-screen play has given way to massively distributed online games with global reach. Virtual and augmented reality primitives are immersing gamers in increasingly realistic alternative and borderless digital worlds.<\/span>","<span data-v-f87c67ca=\"\">Business models are evolving. Monetization through sales of physical games in-store has given way to free-to-play games monetized through in-game purchases and advertising. eSports tournaments and streaming services such as Twitch are giving gamers a “slice” of gaming industry revenues for the first time.<\/span>","<span data-v-f87c67ca=\"\">But a new trend is emerging.<\/span>","<span data-v-f87c67ca=\"\">Over ten years after the advent of Bitcoin, blockchain technology is being leveraged to redefine gaming experiences for developers and players alike. With innovations such as non-fungible tokens (“NFTs”) and smart contracts, developers have new toolsets for crafting gaming <\/span><span data-v-f87c67ca=\"\">experiences and their related economics.<\/span>","<span data-v-f87c67ca=\"\">With the introduction of blockchain technology come new existential questions. <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">What are the incentive structures that align the interests of game developers, players, and spectators? Does the introduction of digital assets merely provide developers a new avenue for extracting <\/span><\/i><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">rents from gamers? Or does it deliver gamers more enjoyable and more valuable gaming experiences?<\/span><\/i>","<span data-v-f87c67ca=\"\">All signs point to the most popular blockchain-based games today being proof of concepts that precede much higher levels and potentially widespread adoption of blockchain technology within the video gaming industry. Understanding how the technology is embedded into and impacting gaming experiences today can provide insights into how this nascent industry’s future could evolve.<\/span>","<span data-v-f87c67ca=\"\">How this report is structured:<\/span>","<b data-v-f87c67ca=\"\">Chapter 1<\/b><span data-v-f87c67ca=\"\"> defines “blockchain-based games” and explains the technology underpinning them.<\/span>","<b data-v-f87c67ca=\"\">Chapter 2<\/b><span data-v-f87c67ca=\"\"> outlines how blockchain technology is redefining in-game economics and impacting players and developer experiences, alike. It includes a case study on Axie Infinity, the largest blockchain-based game seen to date, that showcases many of these technological and economic concepts in action. The section concludes with a series of data that capture the current state of the industry and related fundraising data.<\/span>","<b data-v-f87c67ca=\"\">Chapter 3<\/b><span data-v-f87c67ca=\"\"> introduces the concept of “the metaverse” and where blockchain-based gaming resides within it. It also identifies several catalysts for adoption of blockchain-based games.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Infinity","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":[],"authors":["The Block Research","The Block"]}