{"summary":"Decentraland LAND owners can now rent out their property to others. Renters pay each day using MANA, the platform&#x27;s main cryptocurrency. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193353\/decentraland-will-now-let-you-become-a-virtual-landlord","publishDate":"2022-12-08T13:12:30","id":5374,"type":null,"title":"Decentraland now lets you become a virtual landlord","category":["METAVERSE & NFT"],"content":["Virtual world platform Decentraland now allows land owners to rent out their property.&nbsp;","The new system lets owners of Decentraland land NFTs, called LAND parcels, to find tenants in what <a href=\"https:\/\/docs.decentraland.org\/player\/market\/rentals\/\" data-v-f87c67ca=\"\">the company says<\/a> is a secure, trustless process. Virtual land owners can establish the cost of renting per day and the desired duration of the lease, and the tenant pays the owner through MANA, Decentraland's main cryptocurrency.","Once the rental period expires, the virtual landlord must manually decide whether to claim their property or put it up for rent again. Decentraland said a potential use case for the system would be a virtual DJ, who could rent a space as a nightclub for performances.","The Decentraland Foundation, which oversees the platform, will store the owner and tenant data off-chain as well as on the Ethereum blockchain.&nbsp;","Rentable land, of the virtual kind, has been possible since June through <a href=\"https:\/\/www.theblock.co\/post\/155242\/new-ethereum-token-standard-paves-way-for-rentable-nfts\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">ERC-4907<\/a>, the Ethereum standard that allows rentable NFTs. Unlike Decentraland's rental system, this token standard allows land to automatically revert back to the owner once the rental period expires. While the token standard can be applied to items beyond just virtual spaces, the firm behind the standard's creation, Double Protocol, told The Block that it envisions metaverse land rentals as one the key markets for rentable NFTs.&nbsp;","The average cost of Decentraland parcels is around $2,380, making it one of the more valuable land plot compared to <a href=\"https:\/\/www.theblock.co\/post\/169047\/singapores-biggest-bank-dbs-to-acquire-land-in-the-sandbox-metaverse\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">The Sandbox<\/a>, NFT Worlds and other web3 virtual worlds, according to The Block's Data Dashboard.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/gaming\/metaverse-average-land-sale-price\/embed\" title=\"Metaverse Average Land Sale Price\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Decentraland Foundation","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$2,380","content":"MONEY"},{"type":"4907","content":"DATE"},{"type":"Decentraland","content":"ORGANIZATION"},{"type":"MANA","content":"ORGANIZATION"}],"hashtag":["DECENTRALAND"],"authors":["MK Manoylov","The Block"]}