{"summary":"The European Central Bank&#x27;s Christine Lagarde said that the collapse of FTX emphasizes the need for more rules around the digital asset industry, reiterating her call for more crypto legislation beyond MiCA.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/190329\/lagarde-calls-for-broader-crypto-regulation-following-ftx-collapse","publishDate":"2022-11-28T12:12:24","id":5378,"type":null,"title":"Lagarde calls for broader crypto regulation following FTX collapse","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">European Central Bank President Christine Lagarde called for more crypto regulations following the collapse of crypto exchange FTX, and cast doubt on the broader digital asset market.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The “stability and reliability” of crypto “has been exposed in the most obvious way recently,” Lagarde said during an appearance before the European Parliament, responding to questions from policymakers concerned about the implications of FTX’s downfall.&nbsp;<\/span>","The ECB president reiterated a previous call for more legislation around cryptocurrencies, with the parliament on the verge of passing the&nbsp;<span data-v-f87c67ca=\"\">Markets in Crypto-Assets regulation. That bill, expected to pass early next year and come into force in 2024, will cover portions of crypto and service providers. <\/span>The enforcement of MiCA will put Europe as \"pioneers in this world of great inventivity and great unreliability,\" Lagarde said.","<span data-v-f87c67ca=\"\">“There will have to be a MiCA II,” Lagarde added, as part of a bid to embrace more supervision of crypto. “Europe aims to be a leader in that respect.”<\/span>","<span data-v-f87c67ca=\"\">Lagarde previously pressed for a so-called MiCA II to expand on the provisions outlined by the landmark framework. In June, she <\/span><span data-v-f87c67ca=\"\">suggested<\/span><span data-v-f87c67ca=\"\"> that MiCA II would address risk-producing connections to traditional finance, as well as crypto activities outside of MiCA’s scope like decentralized finance.<\/span>","<span data-v-f87c67ca=\"\">Lagarde also added that the ECB will provide EU citizens with digital payment alternatives. The ECB chief told the members of the European Parliament's economic committee that the central bank’s digital euro will offer EU citizens a digital payment system. “We have to be able to offer that, otherwise somebody else will take that place.”<\/span>","<span data-v-f87c67ca=\"\">The ECB’s digital euro project is in the pipeline, as the central bank is <\/span><a href=\"https:\/\/www.theblock.co\/post\/172812\/european-central-bank-preparing-for-broad-digital-currency-adoption-scenario\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">collaborating<\/span><\/a><span data-v-f87c67ca=\"\"> with partners on a prototype. <\/span>","<span data-v-f87c67ca=\"\">A decision on whether to move forward with implementation will come by September 2023. The European Commission is also set to <\/span><a href=\"https:\/\/www.theblock.co\/post\/183632\/eu-commission-propose-legislation-digital-euro\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">propose<\/span><\/a><span data-v-f87c67ca=\"\"> legislation on a central bank digital currency “soon.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"European Parliament","content":"ORGANIZATION"},{"type":"Lagarde","content":"PERSON"},{"type":"Central Bank","content":"ORGANIZATION"},{"type":"ECB","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Christine Lagarde","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"European Commission","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"September 2023","content":"DATE"},{"type":"Crypto","content":"LOCATION"}],"hashtag":["EUROPEAN PARLIAMENT"],"authors":["Inbar Preiss","The Block"]}