{"summary":"Antivirus software company Norton has released a new crypto product that allows users to mine ether (ETH) from their personal computers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/107323\/norton-crypto-ether-eth-mining-pool","publishDate":"2021-06-04T17:17:34","id":538,"type":null,"title":"Antivirus software company Norton now allows mining ETH via pool service","category":["ETHEREUM"],"content":["NortonLifeLock, formerly Symantec Corporation, has released a new crypto product that allows users to mine ether (ETH) from their personal computers.","The product, Norton Crypto, is currently available to select customers who use the company's antivirus software called Norton 360. The public launch of the product is expected \"<a href=\"https:\/\/investor.nortonlifelock.com\/About\/Investors\/press-releases\/press-release-details\/2021\/NortonLifeLock-Unveils-Norton-Crypto\/default.aspx\" data-v-f87c67ca=\"\">in the coming weeks.<\/a>\"","How does the product work? A crypto-mining software is installed within Norton 360, which allows users to run it when their computers are idle.","Norton offers this product via its own crypto mining pool, a company spokesperson told The Block. That means Norton pools users together for greater chances of mining an Ethereum block and getting and sharing rewards.","As with every mining pool, Norton charges a fee for sharing those rewards, creating a revenue stream for the company. According to the terms of Norton Crypto, the company <a href=\"https:\/\/www.scribd.com\/document\/510496726\/Norton-s-Crypto-Feature-T-C\" data-v-f87c67ca=\"\">charges 15% of rewards<\/a> transferred to users. Ethermine, one of the biggest ETH mining pools, on the other hand, <a href=\"https:\/\/bitfly.at\/GTO_v1.5.pdf\" data-v-f87c67ca=\"\">charges only 1% fees<\/a>.","While the ability to mine ETH from personal computers seems simple and a good idea, it is not easy to earn rewards given Ethereum's mining difficulty, which is currently at an <a href=\"https:\/\/etherscan.io\/chart\/difficulty\" data-v-f87c67ca=\"\">all-time high<\/a>, according to tracker Etherscan.","Norton itself has warned in the terms of the product that rewards are not guaranteed and it is possible that users could spend more money on electricity and computer hardware than ETH reward earnings. To be sure, crypto mining consumes higher electricity, which is why the subject is often discussed within environmental circles.","As for hardware, users of Norton Crypto will have to have a graphics card capable of executing ETH mining calculations. These include Nvidia 1000, 2000, 3000 series cards, AMD 5000 and 6000 series cards, and others, the company spokesperson told The Block.","Earned rewards will be periodically sent to users' Norton Crypto Wallet, which is stored in the cloud to avoid losses due to hard drive failures, said the spokesperson.","While Norton is currently only supporting ETH mining, the Nasdaq-listed Fortune 500 company is \"considering adding reputable cryptocurrencies in the future,\" the spokesperson told The Block.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2000","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Norton","content":"PERSON"},{"type":"Nvidia","content":"ORGANIZATION"},{"type":"Norton Crypto Wallet","content":"ORGANIZATION"},{"type":"Symantec Corporation","content":"ORGANIZATION"},{"type":"AMD","content":"ORGANIZATION"},{"type":"Norton","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"1%","content":"PERCENT"},{"type":"6000","content":"DATE"},{"type":"Norton Crypto","content":"ORGANIZATION"},{"type":"Norton Crypto","content":"PERSON"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["ETHEREUM"],"authors":["Yogita Khatri","The Block"]}