{"summary":"The SEC needs to work more efficiently to regulate the cryptocurrency industry, according to one of the agency&#x27;s key leaders.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265508\/sec-commissioner-peirce-says-agency-should-work-more-efficiently-to-regulate-crypto","publishDate":"2023-11-30T14:01:49","id":5381,"type":null,"title":"SEC Commissioner Peirce says agency should work more efficiently to regulate crypto","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Securities and Exchange Commission needs to work more efficiently and clearly to regulate the cryptocurrency industry, according to one of the agency's key leaders.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Republican Commissioner Hester Peirce, citing the handling of the SEC's charges against crypto startup LBRY, said the agency has been unclear on why it has brought charges against some firms and not others.<br data-v-f87c67ca=\"\">\n<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC <a href=\"https:\/\/www.theblock.co\/post\/259861\/hester-peirce-lambasts-the-secs-approach-to-lbry-says-there-is-not-a-clear-path-to-register\" data-v-f87c67ca=\"\">first charged<\/a> LBRY with selling unregistered securities in March 2021, and it decided to litigate instead of settling. A judge later decided that its token was subject to regulatory oversight and ordered LBRY to pay over $100,000.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Peirce told an audience on Thursday at the Blockchain Association Policy Summit that the LBRY case was a \"low point\" for her as a commissioner.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"To some extent, enforcement is always a little bit arbitrary because there are tons of cases that we as a commission can bring in lots of different areas and we have to pick and choose,\" Peirce said. \"We have to make resource allocation decisions. Where does it make sense to spend our resources?\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"We're picking old cases and there doesn't seem to be a rhyme or reason for a lot of the crypto cases we bring,\" Peirce later added.&nbsp;<\/span>","The SEC has sought to <a href=\"https:\/\/www.theblock.co\/post\/263059\/sec-has-another-highly-productive-year-in-crypto-related-charges-in-fy-2023\" data-v-f87c67ca=\"\">reel<\/a> in the crypto industry, citing a <span class=\"s1\" data-v-f87c67ca=\"\">\"highly productive and impactful year\" that saw charges brought against big names in the sector and celebrities. SEC Chair Gary <\/span><span class=\"s1\" data-v-f87c67ca=\"\">Gensler has also been consistent in his messaging that crypto firms need to register with the agency and has said most cryptocurrencies are indeed securities.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC would be more effective if it first addressed areas where there is \"real harm\" and then focus on how entities are registered through rulemaking, Peirce later told The Block.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Each of the individual cases takes a lot of our resources to pursue as well, but if we don't pursue similarly situated facts, people will say well why did you go after this one and not after this one,\" Peirce said. \"I think it's just more efficient for everyone because I also don't love it when people are reading the tea leaves of enforcement actions and trying to figure out what to do.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">As for whether the SEC needs more regulatory authority from Congress to oversee crypto, Peirce said lawmakers' involvement would be helpful. Chair Gensler has separately said that <a href=\"https:\/\/www.theblock.co\/post\/226974\/gary-gensler-ether-security-crypto-clarity-congress-sec\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">regulation<\/span><\/a> is already clear about crypto.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"I think Congressional involvement would be very helpful in allocating regulatory authority,\" Peirce said.&nbsp;<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Hester Peirce","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Blockchain Association Policy Summit","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Gary <\/span><span class=\"s1\" data-v-f87c67ca=\"\">Gensler","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"March 2021","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Gensler","content":"PERSON"},{"type":"$100,000","content":"MONEY"},{"type":"Peirce","content":"PERSON"}],"hashtag":["SEC"],"authors":["Sarah Wynn","The Block"]}