{"summary":"MAS seeks detailed information on crypto assets firms hold, lending and borrowing counterparties and amounts loaned as well as top tokens staked via decentralized-finance protocols.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/166092\/singapore-seeks-crypto-company-details-ahead-of-possible-regulatory-changes-bloomberg","publishDate":"2022-08-27T05:41:40","id":5389,"type":null,"title":"Singapore seeks crypto company details ahead of possible regulatory changes: Bloomberg","category":["CENTRAL BANKS"],"content":["The Monetary Authority of Singapore (MAS) is asking for detailed information from licensed cryptocurrency companies and from some applicants, <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-08-26\/singapore-steps-up-crypto-questioning-as-firms-brace-for-changes\" data-v-f87c67ca=\"\">Bloomberg reported<\/a> on Friday, citing people familiar with the matter.","“In light of the various insolvencies and counterparty defaults which have plagued the crypto industry recently, the MAS is likely to be assessing the need for additional regulatory measures to mitigate the risks that led to these distressed scenarios,” Hagen Rooke, a partner at law firm Reed Smith LLP in Singapore, told Bloomberg.","In particular, Singapore-based hedge fund Three Arrows Capital <a href=\"https:\/\/www.theblock.co\/post\/155578\/three-arrows-capital-files-for-chapter-15-bankruptcy-in-new-york\" data-v-f87c67ca=\"\">filed for bankruptcy<\/a> in early July, while later that month crypto exchange Zipmex <a href=\"https:\/\/www.theblock.co\/post\/159982\/zipmex-files-for-protection-against-creditors-in-singapore\" data-v-f87c67ca=\"\">filed for protection<\/a> against creditors and crypto lender Vauld <a href=\"https:\/\/www.theblock.co\/post\/158647\/crypto-lender-vauld-owes-363-million-to-retail-investors-after-halting-withdrawals\" data-v-f87c67ca=\"\">halted withdrawals. <\/a>","Bloomberg said the MAS is asking companies for detailed information on crypto assets they hold, lending and borrowing counterparties and amounts loaned as well as top tokens staked via decentralized-finance protocols.","An MAS spokesperson told Bloomberg in response to a query about the requests: “Licensees and applicants are expected to notify MAS of any events that materially impede or impair the operations of the entity, including any matter which may affect its solvency or ability to meet its financial, statutory, contractual or other obligations.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Singapore","content":"LOCATION"},{"type":"Reed Smith LLP","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Monetary Authority of Singapore (MAS","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"July","content":"DATE"},{"type":"Hagen Rooke","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":[],"authors":["Mike Millard","The Block"]}