{"summary":"Former FTX CEO SBF will be sentenced in a courtroom in the middle of Manhattan tomorrow. Legal experts say he will likely be in prison for decades.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285170\/legal-experts-outline-what-to-expect-at-sam-bankman-frieds-hearing-thursday","publishDate":"2024-03-27T15:55:58","id":5390,"type":null,"title":"Legal experts outline what to expect at Sam Bankman-Fried&#x27;s hearing Thursday","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Former FTX CEO Sam Bankman-Fried is set to be sentenced on Thursday in a courtroom New York City and legal experts say he will likely be in prison for decades.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Prosecutors have argued that Bankman-Fried, 32, should be in prison for <a href=\"https:\/\/www.theblock.co\/post\/282916\/prosecutors-lock-up-sbf-for-up-to-50-years\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">40 to 50 years<\/span><\/a> while his defense says that figure should be closer to <a href=\"https:\/\/www.theblock.co\/post\/279487\/sbf-lawyers-prison-sentence\" data-v-f87c67ca=\"\">six and a half years<\/a>.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Bankman-Fried was found <a href=\"https:\/\/www.theblock.co\/post\/261240\/sam-bankman-fried-convicted-on-all-counts-report\" data-v-f87c67ca=\"\">guilty<\/a> in November by a jury in New York of all seven criminal counts of defrauding the customers, lenders and investors of FTX. Prosecutors say Bankman-Fried orchestrated \"likely the largest fraud in the last decade.\" Bankman-Fried's <a href=\"https:\/\/www.theblock.co\/post\/279630\/sam-bankman-frieds-family-and-jail-bunkmate-appeal-for-leniency-in-sentencing-citing-safety-concerns\" data-v-f87c67ca=\"\"><span class=\"s4\" data-v-f87c67ca=\"\">family<\/span><\/a> pleaded with the court, saying the disgraced former crypto market wunderkind is \"wracked with remorse\" and worries about his safety in prison.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">A number of legal experts say the former billionaire will get at least a few decades in prison, somewhere between 20 to 30 years. They expect Bankman-Fried to make a personal statement in court, though they still don't expect him to take full responsibility for what happened. <\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Here is how his sentencing may unfold:&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The first thing that will happen Thursday morning is Judge Lewis Kaplan will confirm that he has received relevant materials, including victim letters, the government's and Bankman-Fried's sentencing submissions and a pre-sentence report by the U.S. Probation Department, which calculates and recommends an \"advisory U.S. sentencing guideline range,\" said Samson Enzer, partner at Cahill Gordon &amp; Reindel LLP. Enzer is a former federal prosecutor in the U.S. Attorney's Office for the Southern District of New York.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The pre-sentence guideline range recommends 100 years, Enzer said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The judge will then hear arguments from the government, the defense, the victims, and then, Bankman-Fried himself. Afterwards, Judge Kaplan will impose the sentence, give a speech on its reasons, and ask if there are any legal reasons why it cannot be imposed. Both sides can then take a position, and then a final judgment is entered, Enzer said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Bankman-Fried still can appeal, which Enzer says is likely.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Braden Perry, partner at Kennyhertz Perry and a former federal enforcement attorney, expects \"<\/span><span class=\"s5\" data-v-f87c67ca=\"\">a structured, yet potentially emotionally charged proceeding.\"<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">Perry said the day would begin with a presentation of the charges and then proceed to arguments from both sides.&nbsp;<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">\"Victim impact statements, if presented, could significantly influence the atmosphere and the judge’s decision,\" Perry said.<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">Just over the past few days, dozens of victim impact statements have flooded detailing the distress and financial hardship they have experienced since the exchange's collapse, while others, including a college friend, said Bankman-Fried should get a lighter sentence and could \"be an asset to society.\"<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">Due to the magnitude of the financial crimes, SBF will likely get a substantial prison sentence, Perry said.&nbsp;<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">\"The specific number of years would depend on the application of sentencing guidelines, which are influenced by factors such as the amount of financial loss and victim impact,\" Perry said. \"In this, as in many white-collar\/large-loss cases, the difference between the government’s ask of 40 to 50 years and the defense’s ask of six and a half years is quite stark.\"&nbsp;<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">Due to FTX's collapse being one of the biggest frauds in history, the former FTX CEO's attempt to tamper with witnesses and that he did not accept responsibility during the trial, Enzer said he expected Bankman-Fried to get anywhere from 20 to 30 years in prison.&nbsp;<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">Bankman-Fried will likely have a chance to make a personal statement before his sentencing is imposed on Thursday.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"It will allow SBF a chance to plead for leniency, express remorse, explain actions, or present mitigating factors that might influence the sentencing decision,\" Perry said. \"Most defendants will do an allocation, and there is no real harm in doing so. One reason he may not provide an allocation is if it would affect any arguments his team will bring on appeal, but that will be up to him and his defense team.\"<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Enzer said he would take \"Vegas odds\" that Bankman-Fried will speak during his sentencing and said it will be similar to his testimony from late last year.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"He will acknowledge that he screwed up, so to speak, and that he's sorry that people were harmed,\" Enzer said. \"This is what my wife calls a husband's apology, like, I'm sorry you're mad at me as opposed to I am sorry for what I did wrong.\"<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Overall, the former billionaire won't fully accept responsibility, and if he were to, that could hurt his ability to appeal, Enzer said.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"It underscores the need for more stringent oversight and may prompt regulators and lawmakers to accelerate efforts to establish clearer rules for the sector,\" said former enforcement attorney Perry. \"The sentencing itself, beyond its direct consequences for Bankman-Fried, will be closely analyzed for its broader implications on how legal systems around the world might approach similar cases in the future, particularly those involving emerging financial technologies.\"&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Bankman-Fried's sentencing comes as his archrival, former Binance CEO Changpeng Zhao, is set to be sentenced next month. Zhao, also known as CZ, shows remorse unlike Bankman-Fried, said <\/span><span class=\"s1\" data-v-f87c67ca=\"\">Terrence Yang, managing director at Swan Bitcoin.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">CZ <a href=\"https:\/\/www.theblock.co\/post\/253681\/changpeng-cz-zhao-steps-down-as-binance-ceo\" data-v-f87c67ca=\"\"><span class=\"s6\" data-v-f87c67ca=\"\">pleaded<\/span><\/a> guilty last year to anti-money laundering and sanctions violations following years-long probes by federal regulators. Binance agreed to pay $4.3 billion in one of the largest corporate settlements in history. Zhao agreed to pay a $50 million fine and stepped down as CEO.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"CZ is in some ways much smarter than Sam Bankman-Fried,\" Yang said. \"They're both pretty evil.\"&nbsp;<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York City","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Swan Bitcoin","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Kaplan","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"Enzer","content":"PERSON"},{"type":"Samson Enzer","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Lewis Kaplan","content":"PERSON"},{"type":"last decade","content":"DATE"},{"type":"Perry","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Yang","content":"PERSON"},{"type":"Braden Perry","content":"PERSON"},{"type":"Kennyhertz Perry","content":"PERSON"},{"type":"U.S. Probation Department","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"morning","content":"TIME"},{"type":"Bankman","content":"PERSON"},{"type":"$4.3 billion","content":"MONEY"},{"type":"the Southern District of New York","content":"ORGANIZATION"},{"type":"Terrence Yang","content":"PERSON"},{"type":"Cahill Gordon &amp; Reindel LLP","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":["BINANCE","COURT HEARINGS","FTX"],"authors":["Sarah Wynn","The Block"]}