{"summary":"Sei Labs, a core contributor to the Sei blockchain, is using KYC solutions from the established payment rails company Plaid.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/255907\/fintech-plaid-partners-with-sei-labs-shortly-after-layer-1s-launch","publishDate":"2023-10-11T12:12:39","id":5395,"type":null,"title":"Sei Labs uses Plaid&#x27;s KYC solutions shortly after Layer 1&#x27;s launch","category":["COMPANIES"],"content":["Sei Labs is using KYC solutions offered by fintech giant Plaid, including its identity verification and anti-money laundering watchlist screening.","Sei Labs' hope is that the partnership will not only help reduce friction and increase user adoption but also encourage developers to build applications using the blockchain.","“For blockchain to succeed you need normal people coming to use the blockchain. Normal people come on if there are killer applications for them to use,” said Sei Labs co-founder Jayendra Jog. “And killer applications only come once you set up the right guardrails for developers to come, and Plaid is one example of these guardrails.”","Sei Foundation is responsible for creating and launching the Sei blockchain while Sei Labs, which operates separately, is creating software that uses the blockchain. Sei Labs is led by a team of people who previously worked at high-profile organizations like Goldman Sachs, Google, and Nvidia, the company said in a statement.","For Jog and his team, using trusted web2 companies that provide effective infrastructure like payment rails, is paramount if blockchain-powered applications hope to attract average consumers.","“There’s this really strong misconception from people in crypto that crypto is just going to completely replace everything that exists in traditional finance,” said Jog. “That might happen 50 years from now, but I think it’s going to be a much more gradual process. And the most clear way to get more on-chain adoption is rather than trying to replace everything, by collaborating with the systems that already exist.”","Jog also said his company is particularly focused on scaling so it can attract talented developers keen to build web3 applications. He's confident the Sei blockchain is made of the right stuff.","“Sei is currently the fastest blockchain in existence,” he said. “So it’s faster than Solana. It’s faster than Aptos.”","Earlier this year Sei Labs raised $30 million from investors including Jump and Distributed Global.","<em data-v-f87c67ca=\"\">Update: Sei Labs initally claimed in a press release that it had partnered with Plaid. Plaid says that Sei Labs is not a partner but is a pay-as-you-go customer of its KYC solutions. Plaid denied that it would be helping with <span data-v-79c326f0=\"\" data-v-f87c67ca=\"\">wallet onboarding<\/span> and <span data-v-79c326f0=\"\" data-v-f87c67ca=\"\">bank account authentication, as was stated in the press release, and said it had not approved the press release. We have updated the article to reflect this.<\/span><\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Aptos","content":"LOCATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Jayendra Jog","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Nvidia","content":"ORGANIZATION"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Sei Labs","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"$30 million","content":"MONEY"}],"hashtag":["APTOS","SOLANA"],"authors":["RT Watson","The Block"]}