{"summary":"Polygon Labs cut 20% of its staff, affecting roughly 100 positions as it consolidates its business units.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/213586\/polygon-labs-cuts-staff-by-20-in-consolidation","publishDate":"2023-02-21T08:41:52","id":5402,"type":null,"title":"Polygon Labs cuts staff by 20% in consolidation","category":["LAYER 2S AND SCALING"],"content":["Polygon Labs announced plans to reduce headcount by 20%, with about 100 staff affected.&nbsp;","The firm noted it \"consolidated multiple business units\" under the Polygon Labs banner earlier this year. \"As part of this process, we're sharing the difficult news that we've reduced our team by 20%, impacting multiple teams and about 100 positions,\" a company <a href=\"https:\/\/polygon.technology\/blog\/consolidating-teams-within-polygon-labs\" data-v-f87c67ca=\"\">statement<\/a> read.","The firm's treasure remains healthy and has a balance of more than $250 million and more than 1.9 billion MATIC; according to its founders, \"we have crystallized our strategy for the next several years to help drive mass adoption of web3 by scaling Ethereum,\" they added.&nbsp;","Employees will received three months of severance pay, regardless of their level or time at the company, the statement read. Affected employees were told the same in an email seen by The Block, with further information regarding severance promised within 3 days.&nbsp;","Today's announcement comes months after the firm's head of human resources said it planned to increase overall headcount by over 40%. Bhumika Srivastava <a href=\"https:\/\/www.theblock.co\/post\/168588\/polygon-will-continue-hiring-despite-market-downturn-bloomberg\" data-v-f87c67ca=\"\">said<\/a> the company hoped to capitalize on the misfortune of other companies in the space.&nbsp;","In the intervening period, sentiment in the crypto market and the broader economy has worsened. The collapse of FTX brought crypto prices down across the board and welcomed renewed regulatory scrutiny. All the while, governments across the globe have continued to raise interest rates to combat inflation.","Layoffs, which first affected the crypto industry in June of last year, have come across big tech and continued to affect crypto in the past few weeks.&nbsp;","<em data-v-f87c67ca=\"\">Updated to include information on severance packages.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$250 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"June of last year","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Bhumika Srivastava","content":"PERSON"},{"type":"20%","content":"PERCENT"},{"type":"1.9 billion","content":"MONEY"},{"type":"40%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["HIRING","POLYGON"],"authors":["Adam Morgan McCarthy","The Block"]}