{"summary":"MetaCRM, a blockchain customer relationship management (CRM) solu tion provider, today announced the completion of a USD$2.5 million seed financing round led by Cherubic Ventures and joined by Ondine Capital, Red Building Capital, and Singapore government-backed Tribe Accelerator","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228362\/metacrm-raises-usd-2-5-mil-in-seed-round-funding-led-by-cherubic-ve-ntures","publishDate":"2023-05-01T09:00:44","id":5407,"type":null,"title":"MetaCRM raises USD $2.5 mil in seed round funding led by Cherubic Ventures","category":["SPONSORED"],"content":["<strong data-v-f87c67ca=\"\">Targeting pain points in Web3 CRM, the startup has already integrated with Curve Finance and Radiant Capital<\/strong>","MetaCRM, a blockchain customer relationship management (CRM) solution provider, today announced the completion of a USD$2.5 million seed financing round led by Cherubic Ventures and joined by Ondine Capital, Red Building Capital, and Singapore government-backed Tribe Accelerator. MetaCRM expressed that the new round of funds will be used to launch new products, accelerate customer expansion and user growth, and better integrate the product’s multi-chain data to create an enhanced blockchain experience for brands and users.","Other investors in MetaCRM’s current round of funding include the renowned MR. Block, former Asana CRO Oliver Jay and former marketing head at Meta Asia Pacific, Deeps. D, among others. The MetaCRM solution has recently been adopted by the world 's largest decentralized exchange (DEX) Curve Finance, and the startup is also the first Web3 CRM solution provider to partner with BNB Chain (Former Binance Smart Chain) and the Arbitrum ecosystem.","<strong data-v-f87c67ca=\"\">MetaCRM targets pain points of Web3 CRM, opens blue ocean for marketing<\/strong><br data-v-f87c67ca=\"\">\nMetaCRM directly addresses ongoing pain points in CRM, customer support, and marketing for Web3 companies. Firstly, most Web3 brands rely on web2 apps such as Google Forms, Telegram, and Discord for customer support that makes customer relationship management difficult due to the inability to identify end-users across channels and rampant customer service fraud. Secondly, there are currently no methods to effectively analyze marketing campaigns and customer behavior holistically through on-chain data for web2 brands and web3 protocols. Marketing activities such as airdrops and whitelists are not utilized at their fullest potential due to the lack of suitable tools to collect and analyze data, restricting the opportunity to remarket which increases conversion rates. Lastly, as blockchain technology develops, the interaction between different chains is becoming more frequent, with various services moving closer to a \"multi-chain\" model. However, current multi-chain data is scattered and messy. Therefore, integrating data from different channels and providing a streamlined customer relationship management tool will be crucial to success.","Beyond solving industry pain points, MetaCRM also seizes tremendous business opportunities in Web3 marketing. According to TripleA’s survey research, the number of global encrypted asset owners is expected to reach 420 million in 2023, roughly 5% of the global population (note 1). However, there are to date no effective marketing tools to track and analyze this group of fast-growing users, showing that Web3 CRM tools are a new blue ocean with huge growth potential.","<strong data-v-f87c67ca=\"\">The Wallet is “the new cookie\", essential to creating a second growth curve for brands<\/strong><br data-v-f87c67ca=\"\">\nWith third-party cookies preparing to enter the twilight, global brands such as Adidas, Prada, Starbucks, Nike, and LVMH are eyeing Web3 as the next marketing battlefield. Salesforce co-founder Marc Mathieu has even stated, “The Wallet is the new cookie” (note 2), highlighting Web3’s importance to marketing.","MetaCRM connects on-chain and off-chain data to create blockchain-native solutions and analytics tools which include MetaForm, MetaDesk, and MetaPanel. MetaForm is a blockchain-native survey tool that not only collects customer feedback and on-chain data, but also incorporates other useful features such as automated NFT creation and “smart” airdrop. MetaDesk is a customer ticketing aggregator supported by customizable on-chain tags that provides visibility to multi-chain transactions in a single pane view, helping companies serve and prioritize their customers more efficiently. MetaPanel is a powerful customer analytics database that compiles users' on-chain and off-chain activities, constructs comprehensive user profiles, and generates analytics that help brands derive valuable insights. This one-stop CRM tool significantly improves customer service productivity and efficiency.","Upcoming integration with ChatGPT also allows MetaCRM to develop customer service responses via AI. Besides enhancing efficiency, the AI also enables MetaCRM to monitor whether customer service agents are using the appropriate tone when engaging with users.","The MetaCRM team is composed of a group of senior blockchain developers with eight-plus years of in-depth experience in blockchain development and investment. The startup has also recruited top-level executives from leading B2B and SaaS brands such as BCG, Zendesk, and Snapchat who understand the marketing challenges faced by Web2 and Web3 industries. MetaCRM is committed to building a global blockchain CRM tool that empowers Web2 and Web3 companies to seize the opportunities in Web3.","<em data-v-f87c67ca=\"\">Note 1: <\/em><a href=\"https:\/\/triple-a.io\/crypto-ownership-data\/\" data-v-f87c67ca=\"\">Triple A-Global Crypto Adoption<br data-v-f87c67ca=\"\">\n<\/a><em data-v-f87c67ca=\"\">Note 2: <a href=\"https:\/\/decrypt.co\/122102\/the-wallet-is-the-new-cookie-salesforce-web3-lead\" data-v-f87c67ca=\"\">The Wallet Is the New Cookie': Salesforce Web3 Lead<\/a><\/em>","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by MetaCRM <\/i><i data-v-f87c67ca=\"\">and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BCG","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Adidas","content":"ORGANIZATION"},{"type":"Zendesk","content":"PERSON"},{"type":"Oliver Jay","content":"PERSON"},{"type":"BNB Chain (Former Binance Smart Chain)","content":"ORGANIZATION"},{"type":"Ondine Capital","content":"ORGANIZATION"},{"type":"Curve Finance","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Google Forms","content":"ORGANIZATION"},{"type":"Nike","content":"ORGANIZATION"},{"type":"DEX) Curve Finance","content":"ORGANIZATION"},{"type":"Radiant Capital","content":"ORGANIZATION"},{"type":"MR. Block","content":"PERSON"},{"type":"Marc Mathieu","content":"PERSON"},{"type":"Cherubic Ventures","content":"ORGANIZATION"},{"type":"Meta Asia Pacific","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"LVMH","content":"ORGANIZATION"},{"type":"Prada","content":"LOCATION"},{"type":"Telegram","content":"LOCATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Deeps","content":"LOCATION"},{"type":"Starbucks","content":"ORGANIZATION"},{"type":"MetaPanel","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}