{"summary":"German startup lemon.markets has raised $17 million in seed funding in a round co-led by Lakestar and Lightspeed.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/140359\/stock-trading-api-startup-lemon-markets-raises-17-million-in-seed-funding","publishDate":"2022-04-04T03:00:37","id":541,"type":null,"title":"Stock trading API startup lemon.markets raises $17 million in seed funding","category":["FINTECH"],"content":["German startup lemon.markets has raised $17 million in seed funding in a round co-led by Lakestar and Lightspeed Venture Partners.","Founded by 21-year-old Max Linden, the startup aims to capitalize on <a href=\"https:\/\/www.theblockcrypto.com\/news+\/126561\/november-vc-fintech\" data-v-f87c67ca=\"\">the wealthtech boom<\/a>&nbsp;by building application programming interfaces (APIs) for tech companies looking to integrate a stock trading feature.&nbsp;","APIs are software bridges that allow businesses to more simply access each others' systems. Linden says that there is currently no infrastructure that makes European capital markets accessible for developers, making it more difficult to build user-friendly stock trading products such as personalized portfolio trackers, trading automation and custom saving plans.&nbsp;","\"The problem is 85% of people in Europe have not invested in any form,\" he said. \"By building this infrastructure, we can allow other companies to solve very specific problems for different demographics, social backgrounds, and nationalities and cultures.\"&nbsp;","Using its business-to-business model, lemon.markets says it has already been approached by around 50 companies wanting access to its trading API for developers, the majority of which would be considered fintech firms, according to Linden.&nbsp;","But with the rise of embedded finance — which has seen financial products woven into the offerings of a range of firms not typically engaged in financial services — lemon.markets has a long-term vision to serve customers outside of fintech.&nbsp;","With the extra financing, the company largely plans to hire further in-house expertise to ensure regulatory compliance and build out its features to simplify building applications for European capital markets.&nbsp;","Once the startup has fully developed its capital markets offering, Linden says&nbsp;crypto integration is very much on the roadmap — following the lead of&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/post\/138659\/expenses-fintech-jeeves-eyes-crypto-transfers-as-it-raises-180-million\" data-v-f87c67ca=\"\">a growing number of fintech firms,<\/a>&nbsp;","\"Crypto is obviously top of mind,\" he said. \"Because in the end, we want to give people the ability to get the best portfolio possible and this is something which is requested by the mass market a lot.\"&nbsp;","Ten years down the line, he envisions a future where a lemon.markets API would enable access to both capital and digital asset markets with the aim of having as many tradable assets as possible — \"tokenized houses, tokenized art or even tokenized wine.\"&nbsp;","He stressed that for now, however, his focus is 100% on traditional stock market trading.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lakestar","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"Max Linden","content":"PERSON"},{"type":"Lightspeed Venture Partners","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$17 million","content":"MONEY"},{"type":"fintech","content":"ORGANIZATION"},{"type":"85%","content":"PERCENT"},{"type":"Linden","content":"PERSON"},{"type":"Europe","content":"LOCATION"},{"type":"Linden","content":"LOCATION"}],"hashtag":["DEVELOPER TOOLS"],"authors":["Tom Matsuda","The Block"]}