{"summary":"Joe McCann, the Founder and Chairman of the Board of NodeSource joins The Scoop to discuss open source software, how it&#x27;s changing the banking industry, decentralized financing, and how they&#x27;re all coming together.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/28957\/joe-mccann-nodesource","publishDate":"2019-06-25T17:26:48","id":5410,"type":null,"title":"The Scoop: A Conversation with Joe McCann, Founder of NodeSource","category":["PODCASTS"],"content":["\n<style data-v-f87c67ca=\"\">\n\t.transcript {}\n\t.transcript .speaker {font-weight: bold;}\n<\/style>\n","<em data-v-f87c67ca=\"\">The following transcript is taken from The Scoop, The Block's new podcast. Listen below and subscribe to The Scoop on <a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Apple<\/a>, <a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Spotify<\/a>, <a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Google Play<\/a>, <a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\">Stitcher<\/a>, or wherever you listen to podcasts. Email feedback to <a href=\"\/cdn-cgi\/l\/email-protection#a8d8c7cccbc9dbdce8dcc0cdcac4c7cbc3cbdad1d8dcc786cbc7c5\" data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"d6a6b9b2b5b7a5a296a2beb3b4bab9b5bdb5a4afa6a2b9f8b5b9bb\">[email&nbsp;protected]<\/span><\/a>. This transcript has been edited for clarity and length. <\/em>","<em data-v-f87c67ca=\"\">Frank Chaparro and Matteo Leibowitz interview <a href=\"https:\/\/twitter.com\/joemccann?lang=en\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Joe McCann<\/a>, the Founder and Chairman of the Board of NodeSource in this week's episode of The Scoop. Frank, Teo, and Joe discuss open source software, how it's changing the banking industry, decentralized financing, and how they're all coming together.<\/em>","<iframe src=\"https:\/\/playlist.megaphone.fm?e=BLOCK5434417918\" width=\"100%\" height=\"200\" frameborder=\"0\" scrolling=\"no\" data-v-f87c67ca=\"\"><\/iframe>","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> All right ladies and gentlemen thank you so much for tuning into the scoop. We are joined by a very special guest. We scooped him on his exit. I think it was a couple months ago but he's forgiven us. He's here. He's in studio live. Joe McCann very excited to have you with us. I'm joined also by Matteo Liebowitz our ether head and researcher at the block and we're gonna be picking Joe's brain about so many different topics spanning Defy, trading, why he's bullish on Coinbase and a whole lot more. Joe thanks so much for being here.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> My pleasure. Thanks for having me.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Joe. Just let's I guess the best place to start, you're a free agent right now.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Indeed.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> You left Passport. How many months has it been?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> It's been about two and a half months now.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So what do you, since you left you've had a lot of free time to sort of just explore the space possibly find new opportunities right. What's what's exciting you right now.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Certainly crypto. But also I think this this broader sort of collision between the two cultures that actually comprise crypto which is finance and technology. And I've been fortunate enough to work in both of those industries. And so what I'm seeing certainly on the West Coast I live in the Bay Area is this oil and water mixture of people in traditional finance and technologists kind of colliding in this most unique way creating incredible opportunities not necessarily that are interesting on the financial side. Right. So one of the fascinating things about crypto is that there's all of these market opportunities that get created and in a lot of cases traders or investors or people that are familiar with finance see those market opportunities but can't write code right. And so it's challenging for them to capitalize on them. And then on the flip side you have technologists that are quite literally creating all of these market opportunities and have no idea they're doing it. So in a lot of cases the things that I'm trying to kind of hone my focus on is how can I bridge the gap between those two because I've been fortunate enough to be a former trader on Wall Street to you know being a former CTO and CEO and programmer for almost the past 20 years. And I feel like putting those two together is where I can add the most value certainly to the crypto ecosystem. But certainly to potential companies and or a company.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Was Passport... Was that the first place where you were able to bridge those two experiences that you have together. You were kind of brought on to build out something new there.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Yeah. I mean my experience was great that they they brought me into help kind of build out a broader sort of quant systematic trading system but focused on crypto assets and that was really the first time that I got an experience of sort of like how to be a bridge between traditional finance and technology particularly as it pertains to crypto and you know hats off to Passport for having a very sort of technologically progressive approach to how they are investing in the space. And that's ultimately what drew me there. As I said I've been a free agent for about two and a half months now and it's really because I feel like there's more things I can be doing and contributing to the space beyond sort of what I accomplished at Passport.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> And you mentioned before you came on there's this this trend right of you know Wall Street and crypto and tech not understand each other not kind of coming together and and moving the space forward. You mentioned something before we have done about your company NodeSource. And you know a large investment bank that you were working with that experience that you describe really I think epitomizes what's going on.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Yeah I completely agree. So so just to give listeners kind of context here. So I started a company called NodeSource about six and a half four ish. It's been a while six and a half seven years ago nodesource is the node.js company. If you're a technologist you know what that is if you're not you probably don't know .js Is this application runtime for building any type of sort of network or web application mobile application desktop application etc. So it's basic like an engine powering software development is the easiest way to describe it. It's now the biggest open one of the fastest growing I should say open source products on Earth it's now been adopted by 100 percent of Fortune 500 including folks in the investment banking space and so early on what we were providing was support and commercial sort of products around open source. And I think it's an important distinction for people understand when you hear about open source and hear about free software you think to yourself Oh man it's free to pay for anything. actually pay for a lot and in fact I was in I was here actually in Lower Manhattan a couple of years ago giving a talk at this open source kind of financial summit was a roomful of investor bankers and trying to explain to them the responsibility that comes with using open source and the it's pretty funny. I've got this room of guys and gals in suits and you know all kind of like buttoned up. And the first slide is a picture of a puppy. And people were like Why is this guy showing us a puppy and I said Well here's the thing about Open Source imagine the moment that I hand you a puppy and it's just it's so soft and cuddly and it smells good and it's oh it's so adorable it's cute. And then a second after that you're like oh shit I got to walk this thing I've got to make sure doesn't show up my wife's shoes. I've got to clean up after it. I've got to take it to the vet that's open source right. Just because something is free does not mean that doesn't have these sort of hidden costs associated with it. And that was what I was explaining this room. And so when you go to sell open source like we did a nodesource we're basically providing that layer of sort of support security and additional tooling around open source. And as I was talking to this investment bank they were adopting no .js full bore. They launched an online savings account. I guess product that was utilizing it from from day one a lot of their legacy stuff was transitioning to it. And one of the things that I recognized was once we actually closed them which was an incredibly difficult process. Number one they had told us you know you're the one out of five companies that we have brought on its vendors that are series a back startup. So I was pretty proud of that. But number two I quickly realized how incredibly difficult it is to do open source inside a Tier 1 investment bank like that.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> To their credit we have seen in recent years even investment banks like Goldman Sachs and Deutsche open sourcing their own code right. Deutsche release I think a couple thousand lines of code of its autobahn platform and then Goldman Sachs open source and its trading software. So we are seeing them move into that direction but there's still there's still hurdles.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Oh absolutely.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> What do you see as being the biggest impediment.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Yes it's a great question and I think this is one of these that experience that this particular organization so you can see folks like Goldman for example will have a github profile and a github page and there will be a repository there but then you'll see in kind of the little footer there it says oh by the way you can't contribute to this. Right. So it's like OK you're halfway there you're on GitHub you're thinking in an open source way. But then no one can contribute to it.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> It's pointless as a bull with tits.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> There you go. So that's one way of putting it that's for sure. So. So I think that the interesting thing about how they're halfway there and halfway not is that if you dig into the why that's the case you'll find out you go into these organizations and you have folks that are running you know legal or compliance. They've been there for twenty five plus years. They're probably making pretty decent money and in their mind why would they take the career risk to all the sudden open up the outside world to be contributing to this thing that they are responsible for. Right. And that's one of the biggest sort of structural challenges internally these organizations is getting legal and compliance to recognize oh hey wait we can all kind of agree we don't have to spend two years debating like what a license is going to look like and contribute to our agreement and all this sort of stuff right. Unfortunately that's where it is. The second thing though and I think this is the one of most critical things and again this is that collision of finance and technology is that in finance investment banking hedge funds particularly it's all about closed source. It's all about my secret sauce not telling anybody anything keeping everything away from everyone else even the exchanges you want data you've got to pay for it you want direct market access you got to pay for it that it doesn't exists in tech and open source and certainly in crypto and I think that paradigm shift has to change and I think we're seeing it particularly at a place like Goldman they've got 30 percent of their staff now are engineers. I would say most of those men and women are in fact contributing or utilizing open source almost every day.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So how do we get the cultures to coalesce. How do we bridge that gap to get banks to be more open.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> It's really simple, burning man.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> I think I think that answers the question perfectly.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> How about this. So we're starting to see platforms like new Numeri which are essentially open sourcing these various different trading algorithms emerge do you think there's a possibility that products like Numeri beat these traditional investment banks and trading houses at their own game and kind of attract open source contributors before these traditional...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Hedge funds, right? They're crowdsourcing different trading strategy.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> Exactly. So beat them at their own game before they can even kind of get off the starting block.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Yeah I mean. My gut tells me not a chance. I just don't think you're gonna beat Renaissance D Shaw and Goldman and set it all at their game. There's a reason that they're still around doing it. What I do think though is that the there are different business model opportunities right. So. So if you step back for a second and look at like the the open source business model and I kind of alluded to this earlier as you take something that's free. But then you kind of wrap stuff around it to sell and that could be support that could be additional tooling. It could be hosting it. Right. So imagine you're an open source developer and you create an algorithm for Numeri but you have no idea how to setup like a distributed system or cloud computing environment to run these strategies. Right. There is a business opportunity. And do I think Goldman or Citadel will kind of provide a hey run your strategies here type business. I don't think so. Are you gonna be able to create an algorithm that's going to beat citadel. You probably already work at Citadel. Like I mean that's that's my guess. It's certainly possible. I just don't see that as like an immediate sort of opportunity. I just see the second step to that being these enhancements around business models and how that can actually start to change things because the the obvious question that gets raised is well if all these algorithms are open source then everybody can see it then there's no edge there's no advantage. And I strongly disagree with that. This is the same argument against things like technical analysis will have everybody's doing it then it just you know it doesn't really work or ever than it's of course it's it's self-fulfilling prophecy. I just think that there is a big distinction between. Having skin in the game and kind of being like an academic around saying these types of pontiff pontificating these sorts of platitudes where you're effectively saying look if if we if we all give away these these strategies there's no way it's anybody's going to make any money except for the fact that when you put real money at work. You now are in a very different position than just simply talking about it there's there's this weird behavioral trick that happens when you have skin in the game you put money into the market. And so when you're actually running these strategies you may actually realize that oh this is really good but not for this type of asset or this thing is kicking ass but only up to a certain capacity I can only trade up to say a million dollars or 10 million dollars or whatever that number might actually be. And I think that's one of the things that is exciting about the space is that there's this there's this entirely new class of what I called trader of the future if you will being kind of manifested today. They're not thinking of it and I need to you know go to Ivy League I need to get an MBA and then I need to go intern at you know D Shaw Citadel or an investment bank and then become a trader. I think today you're starting to see so much innovation around the concept of trading because of crypto. And so if we step back for a second and look at and go What is the trader of the future what does that look like. I don't even think it's considered a trader. I would say is somebody playing a videogame right now 15 year old kid playing Fortnite or World of Warcraft and then thinking digitally about virtual goods and digital goods and how those things are created and exchanged. Those patterns in a lot of cases are the same patterns that they apply to crypto trading. Right. And so by in being involved in that I think will change the concept of why these algorithms being open source and freely available are actually a good thing.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So it's interesting right because you outline basically how crypto decentralized finance is pushing traditional markets into this direction. And at the same time though you know we see the immaturity of the crypto market especially its market structure and the tools that are available for traders at a more micro level thinking about your experiences at Passport and you know running the systematic trading desk. What what do you think is missing in the digital asset crypto market specifically in terms of you know maybe it's OMS systems that work the right type of custody solutions being in the driver's seat. What did what were those pain points.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Man there were a lot and I know that anyone anybody that's in risk or accounting or compliance. God bless you at this point if you're involved in crypto because it is completely foreign to try to explain to people that well it's 24\/7 there's just there's no like end to this. Oh and by the way like the account balances change because we're running a staking node and that wallet address is going to get new token balance every 12 hours and oh by the way we don't know what that number will be it's not forecasting all. Oh and by the way you can't just go to a Web site check it out because it's a privacy coin and therefore it's shielded from you. I mean like it on the one hand creates a massive opportunity for service providers on the other hand it's a friction point for I think institutional traditional asset allocators and investors to get into the space because the infrastructure around just core reporting accounting et cetera is not there and I know.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> How do you do it. Like well what tools did you use.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> I mean I had to build my own like that was really. So this is again this is on the one hand it's like build by our partner to move fast and a lot of these cases is a case with pretty much any business. And one of the reasons that I even before I took the job Passport I started building well and the backup I like to sleep like most people and crypto doesn't enable you to do that if you're trading like it doesn't stop. And one of the worst feelings is like getting long in a position you're really excited about and you wake up and it's down 30 percent the next day and you slept for six hours right. So I actually started to build my own sort of like real time risk management monitoring system purely out of self-interest right. Just because I actually needed it I don't think everybody has that ability to do that. It takes a lot of time it takes skilled actually write code to be able to do that kind of stuff. And so whether it was a Passport or it's even today or anybody else it's out there. You still have to pretty much do this yourself which again to me sort of underscores the opportunity around all these additional big businesses and business opportunities that exist around crypto. Right. So whether it's accounting whether it's trading whether it's you know tying into you know a an order management system that is already currently in existence at a hedge fund or an investor bank or whatever it is none of that stuff exists. And. It's very very difficult to do it in a one off sense. In fact these types of products frankly should be open sourced because that will actually draw broader adoption and frankly standardization across the board of how to do these things and I think this is one of the key things that I recognized while building things at Passport and even previously to Passport is that there is no sort of one stop shop crypto utopia for developers. There's just you don't know what exchange to go to. You don't know which projects to use. You don't know which frameworks you use. You don't know the best practices around security or scaling. If you're a trader for example I met with a guy out here in New York about a year ago way smarter than me. Math quant trader for about past 15 years. And the thing that he told me was he's like You know I see all these opportunities in crypto I just know how to execute on them I go what do you mean. He says I don't want I don't understand cloud computing I don't understand distributed systems. I've been writing code to be co-located into an exchange this entire time. I just write to one specification and plug in and I'm done. Here's a situation where that doesn't exist. You know support for example that I saw a lot of folks and I think even Coinbase you know put a bullet in their Chicago project with the high frequency low latency matching engine team you say well why did they do that that was such a big mistake. If you actually know how to trade you'll recognize that high frequency low latency is not important in crypto. Not yet. It might be at some point but not yet. You know it's more important determinism. Can I confirm that my order was filled at this time on this exchange or across any number of exchanges. Right because this is the big distinction between trading and crypto and trading in traditional asset classes as you have and a number of exchanges. And the price discrepancies are different between those and also your operational risk between say trading on. I don't know. You see the nose of Poloniex recently like trading on Poloniex vs. Binance vs. Coinbase How do you factor that into a model. All of this blows up spreadsheet jockeys. Right. They have no clue on really how to manage this kind of stuff.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> And part of the reason why they shut down that project right. Because it wasn't high on the priority list for traders and what they need.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> So I don't have insight into that but that would be my guess.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> No they did.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Is that is that is actually why? There is no demand for it right? Yeah because I mean I met with them and I met with another set of guys that were building a high frequency low latency exchange in Malta and the same sort of thing and I'm like well where you know he's like you asking me some microsecond execution and have all these different order types","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> That's not what people are worried about. Nobody cares about order types right now.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Exactly.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> You mentioned it and it's funny because a lot of these problems right they apply to Bitcoin Ethereum, even the highest market cap coins. Yeah. I can't imagine and Taylor brought this up just thinking about you often post charts on mid micro caps that almost compounds the issues in trading this market just thinking about low liquidity and like I mentioned what we saw with poloniex, margin lenders lost thirteen point five million dollars. How do you trade. It's one question How do you trade Bitcoin Ethereum etc. It's another question entirely of how you do it with what somebody...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> So yeah so great question. So on the one hand the idea of trading assets like nano or call them.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Or clam.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Clam. This is one of the reasons why I am convinced that anyone that is trying to find ways of mitigating or minimizing their risk and trading in crypto has to have some form of of systematic or real time monitoring across their systems. And the reason I say that is that like let's assume that you have a long thesis on bitcoin you're just you know bitcoin is going to go to some astronomical price in the future I just want to accumulate more bitcoin. OK. Well if that's the case then you should be trading halts. Right. Why. Because sometimes all it's turned out before bitcoin and you can actually gain more bitcoin when all to outperform. But how do you capture that value. Are you going to go trade clams which is incredibly thin or some something like nano or any of these other assets. I'm just I'm not promoting anything by the way I'm just simply saying these assets.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> This this podcast is sponsored by clams. Yes we're waiting for the cheque still for that","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> So I guess my point is is that if you have a if you have a strategy in place that you want to accumulate BTC therefore you need to trade alts. Therefore I need to be able to capitalize on some of these moves. One of the most shocking and revelatory things to me about trading crypto is that it's incredibly formulaic right. So if you look at a chart you can see lets just take Ripple for example. This this this thing will just fade for months and then spike like whatever. Two hundred percent and then it fades for another month. So the majority of the alpha that you can capture and that is that like one or two days that it's moving. And if you just happen to be sitting in front of your computer at the right moment when that's happening then you can capture that value. Guess what's really good at doing that. Computers. Right. If you have a system that's automatically all the time running monitoring all of these different assets and you created signals to be able to capture that kind of stuff. Now you can actually trade nano or trade these other sort of thinly thinly traded micro caps et cetera to capitalize on those moves. Otherwise yeah. I mean people ask me like do you. I was doing a interview for a product manager at gnosis the other day because they were talking about like prediction markets and how traders think about it is like can you talk about the fundamental research you do in an asset and free trade. I'm like I don't do any right. This is a completely behavioral speculative asset class today. And so even more so the reason to have in my opinion a systematic strategy attached to it.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> We have we have a couple of questions when it comes to that exactly. So obviously while at a Passport you are a trader by profession. But a trader dealing with digital assets or crypto assets is that actually any ideological resonance that for you. Are you kind of perm along bitcoin.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Oh sure. Yeah. I mean still a thesis. Yeah. Great. So we were talking a little bit about this. So I don't have a degree in computer science. I don't have a finance degree I have a degree in philosophy which doesn't really get you a job. It gets you into law school. But my focus was in logic and and in in kind of going down that sort of philosophical rabbit hole if you will. One of the things that I've really resonated with is this idea of unbundling and decentralization across myriad things historically. So there's a guy Niall Ferguson is his name he wrote this book called The Square in the tower. Highly recommend reading it is super super relevant to crypto. It's basically in a nutshell. Apologies Niall This is a terrible butchering of it but it's basically this there's a pendulum swinging from centralized hierarchical structures to decentralize non-hierarchical structures and that has happened historically over time. So for example if you take in 15 hundreds if you look at where literacy rates increased in Europe it was there was next to these called nodes on a network which were actually where printing presses were around Europe. So you had literacy you had an increase in obviously intelligence et cetera by having these like decentralized systems meaning set of printing presses all throughout Europe enabling folks to become smarter and not just listen to say the Roman Catholic Church for example. That in my opinion that same sort of pendulum swinging around decentralization is happening to currency for the first time in human history. And for me I think that's a great thing. If we look at the past 50 years and the great experiment that is fiat currency today there are only a few people that benefit from that. And I think we know who they are. And it's certainly not the majority of people and I I believe wholeheartedly that a decentralized currency of sorts that's not pegged to any sort of central bank or politicians win is incredibly valuable for the future of humanity and what it unlocks in terms of having to have a trust minimize relationship with your global neighbors. That has to be good longer term. Right. So so to be very clear I am 110 percent fully bought in on the concept of Bitcoin and the concept of broader I would say crypto assets or crypto currencies and trust minimize networks. As a trader though I almost don't care. Right and I think this is a clear distinction for people to understand is that like there are. I have this kind of running joke with folks I mentioned is that they got another podcast where there's there's this belief that do I want to be a prophet. P-R-O-P-H-E-T or make a profit. Right. And if you if you're it's cool if you just want to be academically right like that's great. Like you can argue till you're blue in the face about why you're right and the market doesn't give a shit right. And once you recognize that that oh I can still be philosophically aligned with bitcoin but I can also understand that maybe I should sell some here at ninety one hundred.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> It's not immmoral to short Bitcoin.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> It's absolutely not immoral to short bitcoin. I and in fact if you have a one sided market you're doing yourself a disservice to the folks that actually want to acquire Bitcoin.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> Going back to this. Ideological alignment is that more so. So you are talking about this separation between kind of the state and the free market when it comes to some kind of money. Store value. Is that what interests you or is it the formal issuance rate and monetary policy of bitcoin because bitcoin does have a a rather particular monetary policy.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> So so I don't think it's I think it's both. I mean I think on the one hand you know they're the monetary aspects of bitcoin and having a finite fixed amount of supply is a good thing. I mean when I try to explain to folks that are completely not in Bitcoin or in cryptocurrency or that are not technical about like Hey why why why would I invest in something that like I don't know what is and nobody really seems to care and like why should I believe in this like the only reason bitcoin has value is because everybody believes in it. It's like well yeah that's the story you've been told about that crispy U.S. dollar you have in your wallet right now. The only reason that it has value is because we believe in it right. Bitcoin to me changes that because it's math. And if you believe in math it's really difficult to kind of disrupt the the belief that this is some made up thing. Now does it help that there are means and that there's a set of behavioral sort of standards that come with investing and buying and selling Bitcoin Of course that's the case with I think any asset that has any sort of form of value but but longer term you know if you look at Bitcoin relative to any other asset that's whether it's a store value a method of exchange et cetera. There has been nothing that existed that is kind of mathematically complete like like Bitcoin and I think that is one of the most attractive features to it.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> But but is it the the maths itself or the finite supply element because you can have various different issuance rates when it comes to these crypto currencies and we're starting to see a divergence of issuance rates across the crypto assett landscape.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Sure. So when it comes to Bitcoin I think having a fixed supply that they actually have is a good thing long term for hopefully all the real...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> For mimetic purposes or...?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Sorry. what?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> For the means basically. Or like a sensible issuance rate.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> So like look at it this way right. So like assume we know 100 percent of all gold on the planet today. We just have it stockpiled somewhere. Right now we can understand how scarce or not that asset actually is. Whereas we understand the scarcity associated with bitcoin. Period. In fact it's less than 21 million as most of us know because there's so many that are lost. Right. So that aspect to me is actually more compelling than the means associated with it. Right now I'm not going to downplay the power of means like means have been around for a long time it's just they're they're very much sort of codified in the way that we actually think about crypto. But I don't think that's kind of like the the thing right. I think there's there's something around the scarcity of Bitcoin and how that translates to a clear sort of mathematical formula that makes a lot of sense to folks that want to see this as some store value or medium exchange or et cetera.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Maybe it worked. Pivoting over to defi","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> Before defi I have a couple more questions. As far as fundamental value and then kind of the more traditional technical analysis setup that you use. So we're starting to see a real proliferation of Unchained focused metrics and hybrid on chain exchange focused metrics. Some of the more famous ones come from the folks at Adaptive capital. I actually have a couple metrics of my own as well. So are these things that you monitor as well and use as part of your wider trading strategy. Do they matter right now. Would they have actually predicted this this latest move from some my research that they they wouldn't. And and do you see them playing a more important role in the kind of medium long term.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Sure it's a great question. So first and foremost especially the folks at Adaptive Rod those folks are brilliant they're absolutely brilliant. This is one of the things for me that is so exciting and stimulating about being in crypto is that there's no rules right. There's no framework there's no set of standards and you have exceptionally smart people doing the investigative analysis to try to understand. And I think this is a key concept just in humanity maybe this is my philosopher and me speaking here is that human beings desire understanding why things are the way they are. And you see this all the time in crypto let alone other things you'll see some you know fly by night Web site post. Bitcoin jumped 10 percent today and here's why it's like no no no you don't actually know why you want to know why. And the reason you are clicking as the user on that article is because you want to understand there is no one that has this figured out. There's like there today went up because there were more buyers and sellers. That's really the only true answer. And it's indisputable. I don't see how you can say some fundamental catalysts happen or etc.. That also applies to these new types of indicators and signals in my opinion. It doesn't mean to me that they're not valuable it does. It just doesn't imply that they can predict what's going to happen. I think what's more important is that you stick with what works for you. So for example I looked into a lot of these. Call them crypto native indicators on chain analytics wallet analytics and forensics. Those are valuable but not in an individual sense. You know I think a lot of people are looking for the easy button when it comes to crypto. What's the one thing I can just look at and go like yep I'm just going to buy. I'm going to sell or whatever and I tweeted this thing the other day about the 200 day moving average. And if you go back historically which is not very longer for bitcoin but you go back historically and you look at the times when the 200 day move average started to turn upwards. And if you just bought bitcoin at that price and then sold at the point where bitcoin started the 200 day move average sort of turn down the returns were astronomical. That might be the dumbest simplest indicator you could possibly have for any asset is the 200 day moving average. I know when we were used to trade on the street we would call it moving average monkeys, folks that would just focus on and it's like I mean it's it's kind of hard to argue with a twenty three thousand percent return by just buying when 200 day turns up and it turns out. So my point is is that it's not that there isn't value in a lot of these indicators and kind of new newly designed metrics. In fact I think it's super healthy for the ecosystem because what we'll find is certain things work and certain things don't and the things that work get standardized and that's what I think we need a lot more of. In the meantime I have tried to overcomplicate my strategy Believe me it doesn't work. The simplest things tend to work in crypto and it's the only market I've ever seen this actually exists.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Do you think that I mean when we look across the at a more macro level the OTC market making creating world in crypto a lot of funds are a lot of trading firms that were at the top of the pack like circle DRW they're seeing either people leave or the general company is in financial problems. You know we've reported you know that 10 percent of folks leaving circle we reported yesterday the head of global alert the global head at DRW is left. What do you think is happening just at a macro level in the trading world. It seems like those at the top are now struggling and other things are happening.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Yeah I mean and this is just my own opinion is purely speculation it's not grounded in fact whatsoever but I got to believe that an industry an ecosystem an asset class that is literally programmable money shouldn't have people picking up a phone to make a trade. That's just my personal belief and so is there an opportunity to do white glove institutional buying and selling of large block size orders. Absolutely. I just see that as a commoditized business invention that that it's going to zero in my opinion over time. I do not think it happens overnight. I think it happens over time and in a lot of cases it's just because number one there are. I don't even know how many OTC desks nowadays globally there are tons right. So what happens when you have a saturated market like that.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> And we're already seeing spreads compress and the money coming in depreciating. Well how do you position yourself as a firm in this market versus maybe 2017 when it was I mean the money was just pouring in as an OTC dealer.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> If you only knew a guy that was a trader and a technologist... no, I'm just kidding. I honestly think this is this is this is the kind of I would say the standard cycle for getting technology integrated into these systems. I think if you're a if you are in this space and you're running a desk of any sort. You have to be thinking through how am I going to enable and integrate technology into say my OTC desk or my trading in general if you don't you will be at a loss or a massive competitive disadvantage relative to the folks that do. I mean we saw this in the late 90s and early 2000s with the shift towards algorithmic trading and easy ends and technology enabled trading. It just decimated so many other folks because they weren't ready or willing for whatever reason to adopt technology. So in my opinion if you're a firm that is starting to see margins compress or feel like your business is about to become commoditized is already becoming commoditized. You may want to consider actually integrating technology solutions into your organization. Finally what I will say I met with. I have met with a number of these these smart order routers or companies like Togami that are I believe attempting to be like the one stop shop prime broker which I think is a great idea and a lot of cases I found OTC desks will just literally you know use routefire or coin routes as Fox whatever in any of one of these sort of smart routers and they'll be taking the order and they just...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> So it's just about relationships right.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Exactly. And so there is something to be said about the trusted relationship.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> But it might not be about relationships anymore like DRW provides a great case study where you see every single James or Bobby Cho the relationship guys are gone.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> But there's a there's always going to be some value in having a human voice on the other end of the phone right.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> So so I would say today yes. But ultimately like if we think about the broader macro picture of crypto we're talking about trust minimize systems right. I don't want to have to trust the individual in a telegram or signal chat in Hong Kong to make sure that I get my bitcoin right. I mean it just that there's something odd about that. And so I think for maybe you know highly sophisticated high net worth individuals family offices that just want white glove service that just want to be able to buy and sell with. I think that is going to exist but that's probably going to be an extension of the business not a core piece of the business. And I think that's the big distinction is how do you recognize number one that being kind of white glove institutional OTC desk for your top clients is more of a feature as opposed to a core business because that core business is getting commoditized out.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> Before we do move on to defi and I do want to discuss defi I think some of our listeners would really appreciate if you could just briefly go through and explain the contango backwardation relationship that you're often posting about because there seems to be a lot of confusion around that. I think it's time that we finally clarify what those words even mean and why they're important how you can use them in your training strategy.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> OK so. First and foremost as I mentioned earlier this is just an indicator that I use it will very likely not be relevant at some point the future. But right now it is. And so what is the difference between backwardation and contango. What what the hell am I even talking about. So the easiest way to describe this and I'm sure there are way more qualified people to describe this in very distinct detail than me but the way that I think about it is the following if you have an asset today spot price you go on Coinbase or whatever and just buy Bitcoin at say eight thousand bucks. Great. But now there's an opportunity to buy a futures contract that's six months from now that says hey you can buy Bitcoin at eight thousand one hundred dollars guarantee price in six months you can buy it for that. That's a hundred dollar delta between the spot price and the futures price. But more importantly because that hundred dollar delta is positive meaning you're paying more in the future. The sentiment that that states is that there is a bullish sentiment associated with that. They're basically saying it's eight thousand now but in six months man if I can get it for eighty one hundred. That's that's a steal. Right. I believe it's going to be higher in the future. That is a state of contango, backwardation is the opposite of that. If you buy it at eight thousand and the futures contract is at say seventy nine hundred. That's a delta of minus one hundred. That's a belief that maybe it's a little overpriced right here right at eight today. I believe like in the future I'm going to buy at seventy nine hundred it's a better deal. That's the state of backwardation. Why does this matter why is this important. I don't know, in crypto again. This is a lot like no one has if anybody tells you they've got it figured out they're full of shit. I'm being just very honest views that I started capturing this data to analyze it and just to kind of see is there are there trends here and so what I've been doing for the past I don't know how many weeks now or months I've been capturing every single minute. The spot price and the futures price for two particular futures contracts on Bitmax. And when I analyze the data what I see is is that when there is a prolonged state of contango which is that bullishness spot price tends to continue to rise when there is a sustained state of backwardation spot price tends to drift lower. I don't know why. It's just simply for me a sentiment indicator and what I've found though is that by capturing that on a per minute basis I've been able to see in multiple occasions not one or two sort of anecdotal one offs multiple occasions that one minute before spot tends to dump or spike. The futures contracts either Spike massively into contango or drop massively into backwardation and so for me I see that as an opportunity to trade on if I have 60 seconds of data that is going to help forecast in a lot of cases a rather large move. I want to utilize that but if I'm not sophisticated enough as a trader or a technologist be able to capitalize on that then I want a broader sentiment. So the sentiment view to me is what's most important about this concept around backwardation versus contango. And furthermore I'll finalize by saying this. It is not an exact science and a lot of cases people say well yeah there's a reason that it's in contango because futures traders are hedging against their long split like blah blah. I don't care like I don't care if you could be totally right about that and all I'm doing is looking at what the data is telling me and the data is telling me bullish sentiment bearish sentiment. Trading opportunity go and that's all that actually matters to me.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> That's interesting stuff really interesting especially because spot volume massively outweighs futures volume right now. But but what Joe has describing is kind of the futures market leading spot potentially.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Yeah I mean and again like I don't want to say in some cases it could be miners hedging in some cases it could be actual traders right. Arb'ing opportunities like at the end of the day I don't really care because what I'm looking for is an opportunity to trade on to get a better sense of how I'm feeling about the market. And I've been doing I've been trading long enough to know that there is no silver bullet indicators signal et cetera. It's how you use it in concert.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So for example think price discovery is moving to like derivative markets.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Mm hmm. I don't know if it's moving there. There's a significant uptick in futures trading we saw the we see even on Darabit which is an exchange it has options futures trading. Huge amount of open interest around options the like. So I think there's certainly more activity there I don't know if it's where things are going. But the the most fascinating part about how futures and options are starting to actually influence price not effective at influence it is that when you take the data that I've been mentioned like the backwardation or contango data futures data et and up and sort of marry that are in concert with other data points. Right. So for example last week I posted on Twitter that the weekly candle. So there's a whole study around candlesticks as well. I won't go into it. That's a whole other separate podcast but in essence. The weekly candle put out what's called a doji OK. Doji tends to show indecision or a lack of kind of direction and in a lot of cases it can be the point where it's the end of a trend. And so I tweeted this and so I was like this to me feels like maybe we reverse a little bit or we trade sideways. And then when I tweeted it the response from crypto Twitter naturally was extreme bullishness. Oh no this has gone higher the parabola the blah blah blah. All these reasons and I was like that's a second indication that this is a top. Right. So you said so so. So that's the saying that now I'm seeing sustained drawdown in the contango the contango was really really high starting to come back closer and closer to zero which means that eventually it'll flip into backwardation. And guess what happened when we dumped earlier this week with Bitcoin. We flipped immediately into backwardation heavily in spot price dropped like 10 percent. Right. So those three things in concert as a trader it's hard to systematized now but it is possible Sentiment analysis is kind of weak on Twitter I don't recommend it. But the point is is that like I tweet some I see a doji I tweeted the crypto Twitter tells me I'm wrong that it's super bullish. And then we have the thing happen with futures and now we're down 10 percent. Like I'm not saying that's why it worked but it's hard to look at it and go it didn't work.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Interesting. So you're a board director at Dharma right. You're paying attention now.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Advisor.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Advisor. Which means what, what are you advising them on.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> So this. Well. Effectively anything right. So Dharma for those of you don't know they're on the defi space. They're the simplest way to do lending for crypto assets. They are an open source business right.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> Not quite.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Well hold on. So you don't have to be 100 percent open source to be an open source business. Like I don't if you guys from this company called GitHub GitHub was acquired by Microsoft like seven and a half billion dollars. They're not a hundred percent open source. Right. So my point is is that I think that the folks at Dharma are brilliant. They're absolutely brilliant. But what I like about them which is refreshing to see in Silicon Valley is they're they're humble enough to know that they want advice and counsel from people that have either done it before or they have a different perspective on things or whatever. And so what I do is I'm hey I'm. I'm your utility player like you need me to help with operational stuff. Talk about fundraising. How about product stuff whatever it might be. Promote stuff whatever it might be. That's how I can actually add value to folks like Dharma and a handful of other companies that I'm advising.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> Why do you prefer Dharma over some of the other lending protocols out there. I'm thinking compound I'm thinking Nuo I'm thinking UIDX. Obviously different kind of structures as a more fixed variable rates variable terms but they do have slightly more emphasis on the on the open source side. What do you like about Dharma and the second question is you know one of the main things that people are using these lending protocols for right now is leverage. Right. You're a trader. Are you actually using these services yourself for leverage.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> So those two questions are why do I like Dharma versus the others and second. How am I using it for leverage. The first is it's not that I don't like to buy the X compound or set protocol or any of these other ones actually set protocols all the different. Yeah it's a little bit Evan. But the point being is that it's not that I don't like them it's that what I like about Dharma is that I feel like they're focused on the user first. And it's not tha UIDX has a bad experience or compound has a bad experience. But when I when I say that the user first they're looking at opportunities for getting people into crypto enhancing that that experience around crypto. But they have a very tailored product design sense. So in my colorful...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> That's your background.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Yeah I like. Exactly so I work at a company called Frog Design. It's kind of like if you are familiar with IDEO they're kind of hand-in-hand but frog was been around for like 50 plus years phenomenal experience working at that place. But I have a huge sort of affinity for well-designed products and experiences and I feel like Dharma puts that first you know so when I started nodesource I could not ship a shitty enterprise business software product. I just refused for to look like crap and not function well. And I feel like that's front and center for four for Dharma but more importantly dharma to me feels like the set of primitives that you need for defi whereas compound is fairly specific. UIDX is fairly fairly specific margin tokens etc. as opposed to like Dharma being this like broader lending platform in the set of primitives that can extend from that. So for example and it's not to say that com pound or UIDX could not do this but I think one of the key distinctions around why I'm so excited about Dharma is that if you look at the current cycle if you will of defi lending it's so new and nascent. There's still lots of stuff to figure out lots of stuff to solve for. But. Recently they announced CDP refinancing right. So let's let's let that sink in for a second. We are what a year into this barely maybe a year plus into this sort of defi lending space. We are now at the second iteration where people are saying oh you parked a bunch of [...] in your CDP and your rate sucks. Yeah we can you can refinance that with us. That to me is a massive sort of monumental moment for defi because what you're seeing is maturity in how deFi is actually growing. And to me Dharmas is leading the pack in that sense.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Well he didn't answer your other question about whether.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Oh do I use margin or not. So I do have some positions in Dharma. Of course it's as a.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> As a lender or a borrower.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> As lender. Yeah. So I lend today. I mean the rates are like absurdly good. So you have to be silly not to. I think the challenges is that and I've spoken with members of the team over there about this is that there are lots of people willing to lend and fewer people are willing to borrow. And so trying to figure out how to make that market a little bit more efficient I think it's sort of you keep....","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> Now that they've stopped subsidizing rates as well that they kind of have to...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Yeah well welcome to Silicon Valley. I mean I love this I've had this conversation the day because you know if you live in San Francisco over the past kind of decade you have you could have signed up for every free meal delivery service every free car service like you name it and you've you could have you just basically got free V.C. money to live off for for a really long time. That's kind of what we're seeing a little bit in a lot of these Silicon Valley V.C. backed defi startups or crypto startups is that they are utilizing the Silicon Valley playbook which I agree with to drive growth and adoption et cetera but they're doing it it in a subsidized sense right.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> We see the same thing and centralize you know crypto lending with blockfi offering. I mean it's everywhere. All right. So since I promised at the beginning and I don't want to be a liar we're going to talk about. You sent us which I didn't read through the entire thing but a 40 50 I know I'm I'm terrible student a terrible student slideshow on Coinbase you are very familiar with the firm you know a lot of people there you're you're out there and in the valley. Talk to us a little bit about why you're bullish on Coinbase and how they could potentially be basically a one stop shop for everything as a way to.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Yeah. Yeah. It's a great question. So. So prior to Passport and even while I was at Passport one of the things I recognized while building out a lot of these sort of quant trading systems systematic platforms et cetera is that there is just so much missing from a developer's experience around building anything around crypto that something or someone or some entity needs to exist to kind of be this one stop shop crypto utopia for developers and that doesn't necessarily just mean let's expose some API so you can trade on an exchange that is actually being the kind of the industry leader a pioneer around best practices and standardization. So for example if you want to go build a trading application today. What exchanges can you trust in terms of their volume. Where can you get. Where can you get a sense of like oh this this seems legit. Well you could read the the the work by [...]. It was amazing. Those guys are incredible that credible report they done. But like if I'm a developer I'm not reading a 50 page document that feels like it's geared towards the financial industry. I want to read documentation or I want to have a trusted source of information and the reason that I believe that Coinbase is in the best position to do that is one they have twenty five million plus KYC AML clients and growing too they have a huge custody business. 3 they are in Silicon Valley so they have engineering talent. They have the kind of engineering led culture that a lot of very powerful technology companies have had. And if there is an opportunity for someone to say hey we want to not only standardize best practices around security around cloud computing and distributed systems but also we're just going to provide say I don't know fully audited tech data so that you can test your strategies for free even if you don't trade on Coinbase right. Why not provide this type of information and I think that a lot of this gets back to like that. Well that'll never work because that's a business model right like like Bloomberg and all these other exchanges they sell this data. Why would they just give away free order to dictate it because it's it's it's bringing people to their platform. And if they can start to do something like that I think that it's a homerun for them. There's no one out there today in my opinion that is providing developers or third party integrators the one stop shop for building period whether it's building on their for trading on their exchange or not there's just no one out there doing that. And Coinbase to me feels like given the culture that they have the engineering prowess that they have their balance sheet the number of KYC AML customers et cetera et cetera et cetera that they are in a prime position to actually capitalize and being that sort of one stop shop crypto utopia.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> Interestingly enough we asked we are actually seeing a bit of that in the decentralized exchange. So 0x has a has a pretty formal market make a program that trying to make things as easy as possible.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Correct. Now here's the challenge with that. If I'm a developer why would I build on a dex today.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> There's no liquidity, inflation, scammers.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Exactly the equivalent would be Hey I'm a mobile app developer I'm gonna build a phone for Windows Phone like you're not, that just makes no sense","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> Well let's let's ask another question then. How do you think about the decentralized exchange landscape and how do you think about the different tradeoffs that various different protocols are making so whether that's 0x protocol and or their relays and then you have a uniswap which is taking off with that automated market market maker model. Recently I just wrote about Dutchex as well which uses batch auctions which I'm sure you find very interesting. Have you played around with them. Do you see a future in them. What's it actually gonna take to bring institutional volumes onto these exchanges. And I think that question kind of applies more broadly to the Defi space as a whole. You know we were just talking about Dharma earlier. They have various obstacles that they need to overcome before they start attracting institutional volumes onto their exchanges.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Right. So yeah it's a great question and so like here's the unfortunate truth for a lot of dexes today is that I know of zero institutions that trade on taxes.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> Well they can't.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Exactly. And so that's the problem right is that liquidity begets liquidity and if I can't trade on there then there's less liquidity and then therefore I have less of a reason to go invest in how I can actually trade that right. So you know I'm certainly not an attorney or an S.E.C. expert but I would assume that if you're an registered investment advisor or have significant capital under management or both A dex is completely off the table. Right. Like you're in violation of I don't know what policies but I'm sure in regulations but I'm sure they know your counterparty is a mere act. Exactly. And so so I think that the challenge is not. The challenge is going to be how can we shoehorn in institutions into Dexes given the current regulatory landscape. I don't think that's super valuable. I think that's going to be a very very tough uphill climb instead.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> And that's not even getting into all the other issues.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Exactly. That's that's just getting their period like step one right. Instead what I do believe is that there are folks out there. Call them you know crypto specific hedge funds. Right. They're not actually V.C. funds but actual crypto hedge funds like [...] Like folks that are in the space for real. If you have built your hedge fund or family office or whatever from the beginning to to be crypto native or support crypto in some aspect you've probably structured it in a way where you can. You don't necessarily have the same constraints that say a [...] adviser would actually have. That to me feels where like where the focus is folks like 0x et cetera.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> That's where they can get their liquidity.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Correct. And if they try to go to your traditional asset allocators I mean yeah luck. Right. Like even if you're a standardized vendor and understood and you have relationships with banks et cetera it's even like an 18 month sale cycle to get stuff done with a lot of these folks right. Or get them on board to whatever your platform might actually be. So when I go to places like crypto specific crypto native hedge funds that are already designed to be able to capitalize on these types of things.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So real quick. Thank you so much for coming on. I really appreciate it. Let's let's end with an uncomfortable question.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Oh boy","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> You're on the market. What would be your dream company to work at aside from the block?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> You guys aren't hiring now. I interviewed? Wow. Dream job. I would love to work for Nicholas Nassim Taleb. That's my dream job.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Why.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> He's so such an asshole that he's so smart. I feel like I could learn a lot from him. I'm a big fan so that would be like a dream scenario because I kind of like B his like you know since executives I've mop his floors like I don't care I'm a big fan so that would be one thing I think in more practical terms I don't think the lab is hiring at this point certainly not me. I think more practical terms it is genuinely trying to find how I can be utilized to bridge the gap between finance technology if I can do that. Whether it's at a hedge fund it's at crypto places it's an exchange it's a cloud computing company or whatever I'm on track.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Well you can link this podcast at the bottom of your resume.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> There you go. Exactly.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Thanks so much show we appreciate you coming on and thank you for listening. Tune in next time.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Joe McCann<\/span><\/strong> Thanks.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Thank you. That was great.","Subscribe to <strong data-v-f87c67ca=\"\">The Scoop<\/strong> wherever you listen:"," 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Niall Ferguson","content":"PERSON"},{"type":"Frog Design","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Fox","content":"ORGANIZATION"},{"type":"million dollars","content":"MONEY"},{"type":"Taylor","content":"PERSON"},{"type":"Silicon Valley V.C.","content":"ORGANIZATION"},{"type":"Matteo Leibowitz","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"Chaparro<\/span><\/strong> Thank","content":"PERSON"},{"type":"10 million dollars","content":"MONEY"},{"type":"Spotify","content":"LOCATION"},{"type":"Chaparro<\/span><\/strong> Joe","content":"PERSON"},{"type":"AML","content":"ORGANIZATION"},{"type":"Chicago","content":"LOCATION"},{"type":"Bobby Cho","content":"PERSON"},{"type":"dex","content":"ORGANIZATION"},{"type":"Chaparro","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"Matteo Liebowitz<\/span><\/strong> Exactly","content":"ORGANIZATION"},{"type":"Silicon Valley","content":"ORGANIZATION"},{"type":"Goldman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"twenty three thousand percent","content":"PERCENT"},{"type":"Nicholas Nassim Taleb","content":"ORGANIZATION"},{"type":"Shaw Citadel","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Poloniex vs. Binance vs. Coinbase How","content":"ORGANIZATION"},{"type":"Niall This","content":"PERSON"},{"type":"Frank Chaparro<\/span><\/strong> Interesting","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Citadel","content":"ORGANIZATION"},{"type":"Goldman","content":"ORGANIZATION"},{"type":"Evan","content":"PERSON"},{"type":"West Coast","content":"LOCATION"},{"type":"10 percent","content":"PERCENT"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"Deutsche","content":"ORGANIZATION"},{"type":"San Francisco","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Renaissance D Shaw","content":"ORGANIZATION"},{"type":"Togami","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"The Scoop","content":"ORGANIZATION"},{"type":"IDEO","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"Bitcoin Ethereum","content":"PERSON"},{"type":"GitHub GitHub","content":"ORGANIZATION"},{"type":"Teo","content":"PERSON"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"Joe McCann","content":"PERSON"},{"type":"Board of NodeSource","content":"ORGANIZATION"},{"type":"Numeri","content":"PERSON"},{"type":"Bay Area","content":"LOCATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"DRW","content":"ORGANIZATION"},{"type":"delta","content":"ORGANIZATION"},{"type":"Lower Manhattan","content":"LOCATION"},{"type":"today","content":"DATE"},{"type":"thirteen point five million dollars","content":"MONEY"},{"type":"half billion dollars","content":"MONEY"},{"type":"100 percent","content":"PERCENT"},{"type":"V.C.","content":"LOCATION"},{"type":"Matteo Liebowitz","content":"PERSON"},{"type":"Roman Catholic Church","content":"ORGANIZATION"},{"type":"V.C.","content":"ORGANIZATION"},{"type":"Joe","content":"PERSON"},{"type":"30 percent","content":"PERCENT"},{"type":"110 percent","content":"PERCENT"},{"type":"a half seven years ago","content":"DATE"},{"type":"Liebowitz","content":"PERSON"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Malta","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Dharma","content":"LOCATION"},{"type":"CTO","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","Matteo Leibowitz","The Block"]}