{"summary":"Crypto broker Voyager Digital has requested permission from a federal bankruptcy court to honor customer withdrawals for the more than $350 million held","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157946\/voyager-asks-bankruptcy-court-to-honor-withdrawals","publishDate":"2022-07-15T20:54:44","id":5412,"type":null,"title":"Voyager asks bankruptcy court to honor withdrawals","category":["COMPANIES"],"content":["Crypto broker Voyager Digital has requested permission from a federal bankruptcy court to honor customer withdrawals for the more than $350 million held by Metropolitan Commercial Bank, a court document filed late Thursday shows.&nbsp;","Voyager said in a July 6 statement that it has about $1.3 billion worth of crypto assets on the platform, and it held more than $350 million in a For Benefit of Customers (FBO) account at Metropolitan Commercial Bank. The company also said it has claims against Three Arrows Capital exceeding $650 million.","\"The debtors have determined, in their business judgment, that failure by the debtors to honor withdrawals any longer could materially harm customer morale during these Chapter 11 cases,\" the company's July 14 filing with the US Bankruptcy Court for the Southern District of New York said. \"Reinstating access to withdrawals will alleviate customer concerns that access to their cash held in the [Metropolitan Commercial Bank] accounts, and the integrity of the platform, is restored.\"","In its court filing, Voyager also is seeking authorization to carry out other financial actions. These include liquidating crypto from customer accounts with negative balances, \"sweep cash\" held in third-party exchanges, conducting \"ordinary course reconciliation\" of the customer accounts, continuing cryptocurrency staking and \"granting related relief.\"","A hearing has been scheduled for August 4 at 11:00 a.m. Eastern Time.&nbsp;","Voyager<a href=\"https:\/\/www.theblock.co\/post\/155990\/crypto-broker-voyager-digital-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\"> filed<\/a> for Chapter 11 bankruptcy protection on July 5.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$350 million","content":"MONEY"},{"type":"Southern District of New York","content":"ORGANIZATION"},{"type":"July 14","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"July 6","content":"DATE"},{"type":"$1.3 billion","content":"MONEY"},{"type":"August 4","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"July 5","content":"DATE"},{"type":"Voyager","content":"ORGANIZATION"},{"type":"$650 million","content":"MONEY"},{"type":"Metropolitan Commercial Bank","content":"ORGANIZATION"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"US Bankruptcy Court","content":"ORGANIZATION"},{"type":"11:00 a.m. Eastern Time","content":"ORGANIZATION"}],"hashtag":[],"authors":["Kristin Majcher","The Block"]}