{"summary":"Former Bitmex CEO Arthur Hayes considers the macro environment over the next few years and how it will affect bitcoin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232399\/arthur-hayes-predicts-volatile-2023-followed-by-strong-bitcoin-rally","publishDate":"2023-05-27T06:00:14","id":5417,"type":null,"title":"Arthur Hayes predicts volatile 2023 followed by strong bitcoin rally","category":["MARKETS"],"content":["Former Bitmex CEO Arthur Hayes, who now runs a family office called Maelstrom, doesn’t see bitcoin breaking new highs this year — but is bullish from 2024 onward.","“I don’t think we get up to $70,000 this year, I think next year is when we cross that barrier, then we get the blow off top [2025], [2026] and then it’s Armageddon,” Hayes said on the <a href=\"https:\/\/www.youtube.com\/watch?v=yV-zwcFnR3Q&amp;t=1781\" data-v-f87c67ca=\"\">What Bitcoin Did<\/a> podcast, pointing toward bitcoin’s halving event in 2024 as a key event.","As for his comment on Armageddon, he explained that he’s referring to more of a societal change, such as a major war. He pointed to quantitative easing and social discontent as two factors that would lead to such an event.","“It doesn’t have to be too straightforward, we just have this situation, we have this tinderbox of too much money, no trust and people trying to eke out a living for themselves,” Hayes said. He added that bitcoin would go down too in this scenario.","When asked about the U.S. debt ceiling, Hayes said that it will be resolved following the usual back and forth. But he argued that its timing could cause waves in the market, claiming that financial disruption events typically happen in the fall.","“With the banking crisis — and you have the federal government issuing trillions of dollars of debt because they need to fund themselves — you’re basically putting this powder keg together of a situation that’s going to be exploding in Q3\/Q4 of this year and so why ultimately I think it could be quite good for bitcoin. It will be quite volatile on the upside and the downside,” he said.","As for Hayes’ own investment strategy during this time, he mentioned that Maelstrom was making some plays with respect to ether staking and that it was taking a hard look at the emergence of NFTs on Bitcoin, known as <a href=\"https:\/\/www.theblock.co\/post\/207086\/what-are-bitcoin-nfts-ordinals-and-how-do-they-work\" data-v-f87c67ca=\"\">Ordinals<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2025","content":"DATE"},{"type":"trillions of dollars","content":"MONEY"},{"type":"2026","content":"DATE"},{"type":"fall","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"$70,000","content":"MONEY"},{"type":"Hayes","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Hayes’","content":"ORGANIZATION"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":[],"authors":["Tim Copeland","The Block"]}