{"summary":"Crypto entrepreneur Alex Masmej has sold $20,000 worth of personal tokens on the Ethereum network to fund his next venture.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/61699\/this-crypto-entrepreneur-just-sold-20000-worth-of-personal-tokens-on-ethereum","publishDate":"2020-04-13T17:05:34","id":5419,"type":null,"title":"This crypto entrepreneur just had a $20,000 &#x27;human IPO&#x27; on Ethereum","category":["ETHEREUM"],"content":["<span data-v-f87c67ca=\"\">Crypto entrepreneur Alex Masmej has raised $20,000 by selling \"personal tokens\" on the <a href=\"https:\/\/www.theblockresearch.com\/ethereums-mobile-wallet-landscape-33578\" data-v-f87c67ca=\"\">Ethereum<\/a> blockchain. <\/span>","<span data-v-f87c67ca=\"\">The fresh fund will support him as he builds a new decentralized finance (DeFi) savings startup in Silicon Valley.&nbsp;<\/span><span data-v-f87c67ca=\"\">Masmej is the founder of <\/span><a href=\"https:\/\/medium.com\/@AlexMasmej\/introducing-rocket-get-a-loan-against-your-nfts-f67b1b5738f0\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Rocket<\/span><\/a><span data-v-f87c67ca=\"\">, a for-profit DAO offering loans against non-fungible tokens (NFT) like Decentraland tokens, gold derivatives, and crypto art. <\/span><span data-v-f87c67ca=\"\">He has also contributed to projects including MetaCartel DAO, Marketing DAO, and Santa is Money.<\/span>","<span data-v-f87c67ca=\"\">Born and raised in Paris, Masmej nevertheless sees Silicon Valley as the prime location for tech entrepreneurs and has conducted an offering of his private tokens – $ALEX – to fund his relocation to San Francisco, where he hopes to build his next venture.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Following his initial <\/span><a href=\"https:\/\/medium.com\/@AlexMasmej\/taking-risks-during-chaos-initial-alex-offering-339883bb7f6d\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">announcement<\/span><\/a><span data-v-f87c67ca=\"\"> of the token sale on April 7, Masmej on Sunday <\/span><a href=\"https:\/\/twitter.com\/AlexMasmej\/status\/1249391273070473221?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">disclosed<\/span><\/a><span data-v-f87c67ca=\"\"> that the offering is now complete and that he has raised $20,000 from selling 100,000 $ALEX tokens to 29 participants.<\/span>","<span data-v-f87c67ca=\"\">The token represents \"a blend between a small Income Sharing Agreement and a human IPO,\" Masmej explained in his announcement. Token holders will be entitled to 15% of all his income for the next three years, capped at $100,000. The dividends will be distributed to shareholders on a quarterly basis in the form of DAI or an equivalent stablecoin.<\/span>","<span data-v-f87c67ca=\"\">Masmej told The Block that the income-sharing model has been in existence for years, but not so much through cryptocurrency or on the <a href=\"https:\/\/www.theblockresearch.com\/gap-between-bitcoin-and-ethereum-transaction-volumes-narrows-as-stablecoin-demand-soars-34564\" data-v-f87c67ca=\"\">Ethereum<\/a> network.&nbsp;<\/span><span data-v-f87c67ca=\"\">According to him, adding the crypto element to the model brings benefits like increased transparency, secondary trading through Uniswap, and the utility aspect extended to token holders.<\/span>","<span data-v-f87c67ca=\"\">The $ALEX tokens already have approximately 200 token holders on Uniswap. In addition to a guaranteed percentage of Masmej's future income, they will also receive additional utilities like one-on-one sessions with Masmej, access to his network, and possible participation in the seed round of his next startup.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The tech startup that Masmej promises to spend the fresh funds on is still in the idea stage, but he revealed that it would be a DeFi project focused on saving accounts.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"In this time of crisis, people want to save money and care less about crypto native experiments,\" he said. \"Right now savings seems to me like the most needed crypto product that is better than traditional finance.\"<\/span>","<span data-v-f87c67ca=\"\">The tokenization of human capital has recently emerged as a popular new asset class.<\/span>","<span data-v-f87c67ca=\"\">Last year, designer Matthew Vernon – nicknamed \"Dapp Boi\" – issued 100 $BOI tokens representing 100 hours of his time. The tokens were later purchased by projects including fashion DAO Saint Fame and crypto lender Dharma.<\/span>","<span data-v-f87c67ca=\"\">In another high-profile case,&nbsp; Brooklyn Nets player Spencer Dinwiddie <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/52682\/nbas-spencer-dinwiddie-set-to-roll-out-tokenized-investment-platform-next-monday\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">announced<\/span><\/a><span data-v-f87c67ca=\"\"> his plan to tokenize his NBA contract on the <a href=\"https:\/\/www.theblockresearch.com\/money-2-0-stuff-negative-yields-on-ethereum-39059\" data-v-f87c67ca=\"\">Ethereum<\/a> blockchain.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Peter Pan, a founding member of Metacartel DAO, and Ameen Solamani, CEO of SpankChain, also issued their own personal tokens in this manner.<\/span>","<span data-v-f87c67ca=\"\">According to Masmej, the success of his fundraising efforts is partly attributable to his social media following, most of whom are crypto-native folks supportive of his work. But generally speaking, he believes that the model of personal tokens will soon gain more traction as a growing number of people are affected by the ongoing pandemic and start to look for new, innovative ways to raise funds.<\/span>","<span data-v-f87c67ca=\"\">\"I'm affected by the crisis. I'm making less money. So this is what I found to bring myself up and turn this crisis into an opportunity for myself,\" he said. \"I think this is going to be very popular because people would need to be on the payroll.\"<\/span>","<span data-v-f87c67ca=\"\">\"I think that the personal tokens space is super unsaturated right now,\" he continued. \"But we'll see a new wave of freelancer and entrepreneur doing this. Ever since I announced the fundraise for the person last week, I've been contacted by many people wanting to create their own personal tokens. I think the space is going to explode.\"<\/span>","<span data-v-f87c67ca=\"\">A few platforms have been established recently to support the creation of personal tokens. <\/span><a href=\"https:\/\/humanipo.app\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">HumanIPO<\/span><\/a><span data-v-f87c67ca=\"\"> and <\/span><a href=\"https:\/\/stakeonme.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">StakeOnMe<\/span><\/a><span data-v-f87c67ca=\"\"> are two examples. In rolling out his $ALEX token, Masmej chose to partner with the <\/span><a href=\"https:\/\/tryroll.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Roll Network<\/span><\/a><span data-v-f87c67ca=\"\">, an infrastructure provider for personal tokens.<\/span>","Established in 2019, Roll has by now helped over 100 digital artists, streamers, entrepreneurs, and investors mint their tokens.","\"We see 'social money' as the next phase of personal tokens because the focus isn't actually on the individual, it's on the community,\" said Roll co-founder Bradley Miles. \"$ALEX is now a community of over 120 people. The long term value of $ALEX will likely come from them as opposed to the creator (Alex Masmej).\"","\"Our goal is really to build tools and features that grow this type of utility over time across platforms,\" he added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"Metacartel DAO","content":"ORGANIZATION"},{"type":"Peter Pan","content":"PERSON"},{"type":"Paris","content":"LOCATION"},{"type":"$20,000","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"Alex Masmej","content":"PERSON"},{"type":"Spencer Dinwiddie","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"$ALEX","content":"MONEY"},{"type":"Sunday","content":"DATE"},{"type":"Santa","content":"LOCATION"},{"type":"NBA","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Ameen Solamani","content":"PERSON"},{"type":"Masmej","content":"ORGANIZATION"},{"type":"$BOI","content":"MONEY"},{"type":"Masmej","content":"LOCATION"},{"type":"Masmej","content":"PERSON"},{"type":"$100,000","content":"MONEY"},{"type":"April 7","content":"DATE"},{"type":"Roll Network","content":"ORGANIZATION"},{"type":"Matthew Vernon –","content":"PERSON"},{"type":"Brooklyn","content":"LOCATION"},{"type":"Bradley Miles","content":"ORGANIZATION"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"Decentraland","content":"LOCATION"},{"type":"Dapp Boi","content":"ORGANIZATION"}],"hashtag":["TOKENS"],"authors":["Yilun Cheng","The Block"]}