{"summary":"An exploited Ethereum Alarm Clock smart contract has allowed exploiters to take advantage of a gas refund bug.\nBlockchain security and analytics company Peckshield first reported the exploit Wednesday.","author":["Mike Truppa","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/178418\/ethereum-alarm-clocks-smart-contract-is-being-targeted-by-exploiters","publishDate":"2022-10-19T15:19:58","id":542,"type":null,"title":"Ethereum Alarm Clock&#x27;s smart contract is being targeted by exploiters","category":["Ethereum"],"content":["An exploited Ethereum Alarm Clock contract has allowed exploiters to receive more ETH-denominated refunds than intended.","<a href=\"https:\/\/github.com\/ethereum-alarm-clock\/ethereum-alarm-clock\" data-v-f87c67ca=\"\">Ethereum Alarm Clock<\/a> is a protocol that allows users to schedule future Ethereum transactions. The transaction scheduling logic it uses occurs in smart contracts.","Blockchain security and analytics company Peckshield reported the ongoing exploit <a href=\"https:\/\/twitter.com\/peckshield\/status\/1582756435955359744\" data-v-f87c67ca=\"\">earlier this morning.<\/a>","Under the exploit, the attacker first calls a cancel() function on the Ethereum Alarm Clock contract with an abnormally <a href=\"https:\/\/etherscan.io\/tx\/0x4a84d0872887f91546cd5400cf99763b654975efb3376ee55e4463bcfbca4e97\" data-v-f87c67ca=\"\">high transaction fee.<\/a> The exploit occurs in the following step, where the transaction fee refund is calculated too high, paying out <a href=\"https:\/\/etherscan.io\/tx\/0x431adb8a541017c47b8cb97c576711366d45cc5ab4b31a707c86ff7acdf79ec2\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">a higher value than intended<\/a>.","The end result gives the exploiter a much higher ETH refund because of the higher transaction fee that they set. Under normal circumstances, the user calling the contract would receive back only slightly more than what their transaction fee was, according to The Block Research's Igor Igamberdiev.","<em data-v-f87c67ca=\"\">This is a developing story.<\/em>"],"hashtag":[]}