{"summary":"Digital assets will help the private market, relative to the stock market, become the standard for trading in the next five to ten years, according to Jay Biancamano, crypto charge at custodian bank State Street.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/57765\/state-street-exec-digital-assets-will-help-the-private-market-become-the-standard-in-5-10-years","publishDate":"2020-03-04T13:01:49","id":5420,"type":null,"title":"State Street exec: digital assets will help the private market become the standard in 5-10 years","category":["THE BLOCK"],"content":["<span data-v-f87c67ca=\"\">Digital assets will help the private market become the standard for trading in the next five-to-ten years, according to Jay Biancamano, who leads the crypto charge at custodian bank State Street.<\/span>","<span data-v-f87c67ca=\"\">In a new&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/post\/56920\/state-street-exec-explains-why-stocks-wont-be-tokenized-anytime-soon\" data-v-f87c67ca=\"\">episode<\/a> of The Scoop podcast, Biancamano told The Block that much of the current market inefficiency lies in high-performance drag. Due to fees and other costs involved in securities trading, the actual return for many traders is much lower than what they could have gotten if all transaction costs are removed. <\/span>","<span data-v-f87c67ca=\"\">Digital assets, on the other hand, offer a more efficient alternative, he said, and have the potential to bring order to the booming private market. The SEC's recent decision to expand the definition of accredited investors, especially, opened up more opportunities for retail investors to enter into private deals.<\/span>","<span data-v-f87c67ca=\"\">“If you think about the access to private deals where most of the returns and issues are going on right now, the individual or the small investor has access to them,” said. “So I think when the SEC actually looked to lower the threshold for individual investors to access private deals, that was the first piece.”<\/span>","<span data-v-f87c67ca=\"\">According to Biancamano, fractional trading makes it easier for retail investors to hop on the market, and digital assets make it easy to do so. Last year, <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/50309\/robinhood-rolls-out-fractional-trading-allowing-millennial-clients-to-trade-stocks-with-as-little-as-1\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Robinhood<\/span><\/a><span data-v-f87c67ca=\"\"> and <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/44543\/cash-app-adds-stock-trading\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Cash App<\/span><\/a><span data-v-f87c67ca=\"\"> both rolled out fractional trading, while <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/43627\/brokerage-giant-charles-schwab-will-allow-investors-to-buy-fractional-shares-of-stocks\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Charles Schwab<\/span><\/a><span data-v-f87c67ca=\"\"> announced its plan to do the same. <\/span>","<span data-v-f87c67ca=\"\">“You could slice and dice a digital asset, much more efficiently than you could with a traditional asset,” he said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Biancamano also pointed to Morgan Stanley’s <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/56489\/morgan-stanley-is-acquiring-discount-broker-etrade-for-13b\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">acquisition<\/span><\/a><span data-v-f87c67ca=\"\"> of discount broker E*Trade as an example of how institutions are increasingly paying attention to retail customers and offering them access to private deals.<\/span>","<span data-v-f87c67ca=\"\">“Morgan Stanley is an institutional firm and they have a small consumer-facing money management firm,” he said. “Now they have access to tens of millions of E*Trade customers to provide them access to private deals.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I really think that the private market is going to be the standard in and probably five or ten years,” he continued. “And I think digital assets will be the gateway to provide that because of its ability to offer smaller pieces of assets, eliminate drag, and make it much more cost-effective for these large firms to provide access to these assets to individuals.\"<\/span>","<iframe src=\"https:\/\/playlist.megaphone.fm?e=BLOCK9527353347\" width=\"100%\" height=\"200\" frameborder=\"0\" scrolling=\"no\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Charles Schwab","content":"PERSON"},{"type":"Jay Biancamano","content":"PERSON"},{"type":"Biancamano","content":"LOCATION"},{"type":"Biancamano","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Morgan Stanley","content":"ORGANIZATION"},{"type":"State Street","content":"ORGANIZATION"}],"hashtag":["ROBINHOOD","SEC"],"authors":["Yilun Cheng","The Block"]}