{"summary":"Hong Kong&#x27;s Securities and Futures Commission received license applications from 22 firms to operate as crypto exchanges.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280039\/hong-kong-draws-22-firms-seeking-crypto-exchange-licenses-including-okx-bybit-and-htx","publishDate":"2024-03-01T01:43:37","id":5422,"type":null,"title":"Hong Kong draws 22 firms seeking crypto exchange licenses","category":["ASIA"],"content":["Hong Kong has received applications from 22 crypto firms for a license that would allow them to operate as crypto exchanges offering retail trading services, as Hong Kong continues its drive to become a regional crypto hub.","<span data-v-f87c67ca=\"\">The city's Securities and Futures Commission has received applications from 22 firms — including OKX, Bybit, Bullish, Crypto.com, Huobi HK, Matrixport HK and Gate.HK — before the application deadline of Feb. 29, according to the SFC’s <\/span><a href=\"https:\/\/www.sfc.hk\/en\/Welcome-to-the-Fintech-Contact-Point\/Virtual-assets\/Virtual-asset-trading-platforms-operators\/Lists-of-virtual-asset-trading-platforms\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">website<\/span><\/a><span data-v-f87c67ca=\"\">. <\/span><span data-v-f87c67ca=\"\">HKVAEX, a crypto platform <\/span><a href=\"https:\/\/www.scmp.com\/tech\/big-tech\/article\/3239020\/binance-behind-hong-kong-crypto-exchange-hkvaex-which-seeking-licence-city-sources-say\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reportedly<\/span><\/a><span data-v-f87c67ca=\"\"> linked to Binance, also submitted its application.<\/span>","Hong Kong has already granted licenses to two platforms — namely HashKey and OSL — since it officially started the licensing regime last year. Crypto platforms operating in Hong Kong that fail to submit license applications will need to cease business by the end of March, the SFC noted on its website.","In addition to overseeing crypto trading platforms, Hong Kong is gearing up to regulate stablecoin issuance. Paul Chan, the financial secretary of Hong Kong, said in his budget speech on Wednesday that the Hong Kong Monetary Authority plans to introduce a regulatory sandbox for stablecoin issuers in the near future.","In December, the Financial Services and the Treasury Bureau and the HKMA jointly <a href=\"https:\/\/www.theblock.co\/post\/269292\/hong-kong-proposes-licenses-should-be-required-for-stablecoin-issuers\" data-v-f87c67ca=\"\">launched<\/a> a consultation until Feb. 29 on regulating stablecoin issuers. They proposed that all fiat-referenced stablecoin issuers should obtain a license from the HKMA.","Chan added that the government also plans to expand the pilot scope of e-CNY, China’s central bank digital currency in trial, to enhance cross-border payment efficiency.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Paul Chan","content":"PERSON"},{"type":"Binance","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Securities and Futures Commission","content":"ORGANIZATION"},{"type":"Hong Kong Monetary Authority","content":"ORGANIZATION"},{"type":"SFC","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Feb. 29","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Financial Services","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Bybit","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"Treasury Bureau","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"HKMA","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["ASIAN REGULATION"],"authors":["Timmy Shen","The Block"]}