{"summary":"Google Cloud&#x27;s BigQuery has integrated Solana, offering enhanced insights into the blockchain’s archival data and analytics.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/258770\/solana-live-on-google-cloud-bigquery","publishDate":"2023-10-31T11:05:05","id":5423,"type":null,"title":"Solana goes live on Google Cloud&#x27;s BigQuery data analytics platform","category":["INFRASTRUCTURE"],"content":["Google Cloud has integrated <a href=\"https:\/\/console.cloud.google.com\/marketplace\/product\/bigquery-public-data\/crypto-solana-mainnet-us?project=ardent-girder-403621\" data-v-f87c67ca=\"\">Solana<\/a><span data-v-f87c67ca=\"\"> with its BigQuery data analytics service, making it easier to access <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Solana <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/33827\/solana-sol-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/solana.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">SOL<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.14%\n    <\/span><\/a> <!----><\/span><\/span>-based data and expanding support to its 20th blockchain network.<\/span>","First announced at <a href=\"https:\/\/www.theblock.co\/post\/183459\/google-cloud-adding-bigquery-support-for-solana-in-q1-2023\" data-v-f87c67ca=\"\">Breakpoint 2022<\/a> in Lisbon, the inclusion of Solana into BigQuery aims to offer enhanced insights into the blockchain’s analytics, according to a statement. Solana support was expected to go live in Q1, Google Cloud web3 lead Nalin Mittal said at the time.","“The team at Google Cloud was committed to doing this right before going live and therefore needed more time to finalize the dataset and make sure it captures a comprehensive overview of what is happening on-chain,” Solana Foundation executive director Dan Albert told The Block.","BigQuery is Google Cloud’s serverless data warehouse with built-in machine learning, artificial intelligence and business intelligence — enabling users to query vast datasets.","“The Solana ecosystem is growing rapidly, generating new innovations, data and insights each day,” Albert said in the statement. “With this tremendous growth comes an increasing need for the Solana community and the web3 industry at large to have fast and easy access to the insights and data produced on our network, and we’re proud that the Foundation has helped Google Cloud make Solana more accessible, transparent and open.”","Anyone from developers to enterprises and individual users can query data from Solana to answer complex questions regarding transactions, NFT minting, wallet activities and more, the Solana Foundation said. Leveraging Google’s Bigtable distributed data storage service alongside BigQuery, the ecosystem can also provide access to archival data from the Solana network.","Multichain NFT app Floor is one of the first to tap into the Solana integration for new use cases, sending data on Solana NFT sales and listings to the BigQuery platform.","“There's a lot of interesting data that's slightly off-chain, but related to on-chain data that today, isn't very available,” Floor CEO Chris Maddern said.","“NFT data in the Solana ecosystem has traditionally been difficult to parse for the average user, or only available at a high level,” the Solana Foundation said. “By taking the data publicly available on-chain — sales, for example — with some of Floor’s proprietary information, analysts and other users can take a deeper look into what is happening in the world of Solana NFTs.”","“[The Solana community] is thinking ahead and leading and innovating on making an open ecosystem, and this felt like the right place for us to try it out and see what happens,” Maddern added. “We're excited to share something back to the community that has welcomed us with open arms.”","The integration also has implications for advancing web3 adoption by web2 companies, according to Albert. “A lot of traditional tech and finance firms are still struggling to grasp what blockchain and crypto can really achieve and how it can help them optimize their businesses,” he said. “Comprehensive datasets like BigQuery can help enterprises and other web2 projects get a better understanding of just how much interest and movement there is in web3 and how consumers are utilizing this technology so that they can make more educated decisions about how to incorporate blockchain into their businesses too.”","Albert said that the dataset also enabled web3 developers to conduct more advanced research, such as using Google Colab notebooks for more detailed analysis beyond simple SQL queries. “The data available in BigQuery is also much easier to use — it’s parsed and neat for external consumption, so anyone who is curious to learn more about web3 can dive into the nitty gritty details of what is going on across the Solana ecosystem and also create impressive visuals to represent network activity,” he added.","Furthermore, it's “especially useful for projects that need to be aware of how user activity compares or is aggregated across chains,” Albert said. “This would include stats such as network fees comparisons between Solana and other blockchains; how many mints are taking place across the top three leading NFT-favorite chains, and so forth.”","Solana becomes the 20th blockchain integration for Google Cloud’s BigQuery. It initially began offering support for Bitcoin and Ethereum in 2018. In 2019, Bitcoin Cash, Dash, Dogecoin, Ethereum Classic, Litecoin and Zcash support was added. Last month, <a href=\"https:\/\/www.theblock.co\/post\/252542\/google-cloud-new-blockchains-bigquery\" data-v-f87c67ca=\"\">11 additional chains<\/a> were integrated: Avalanche, Arbitrum, Cronos, Fantom, Near, Optimism, Polkadot, Polygon, Tron and the test networks Polygon Mumbai and Ethereum Goerli.","Beyond BigQuery, Google Cloud also provides web3 infrastructure services, such as managing validator operations, including Solana. Google Cloud is also working on bringing Solana support to its Blockchain Node Engine node hosting service.","Google Cloud’s integration is the latest institution to provide infrastructure support for the Solana ecosystem after <a href=\"https:\/\/www.theblock.co\/post\/249153\/visa-stablecoin-settlement-solana-ethereum\" data-v-f87c67ca=\"\">Visa expanded its USDC stablecoin settlement<\/a> capabilities to the blockchain in September. Solana's payment system <a href=\"https:\/\/www.theblock.co\/post\/246974\/solana-pay-integrates-with-shopify-for-digital-dollar-currency-payments\" data-v-f87c67ca=\"\">Solana Pay<\/a> also integrated with the e-commerce giant Shopify in August.","“There has always been somewhat of a narrative circulating in web3 that blockchain and crypto will replace a lot of the systems that traditional tech has built,” Albert said regarding the evolution of web2’s adoption of web3. “From my perspective, it’s not so much about creating entirely separate systems but rather about optimizing the infrastructure we have in place and broadening access through web3. I see this happening particularly when it comes to content creation — allowing creators to monetize their work better through blockchain and royalties — and I see this happening when it comes to optimizing payments infrastructure too.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Solana Foundation","content":"ORGANIZATION"},{"type":"Google Cloud","content":"ORGANIZATION"},{"type":"Polygon","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"Google Cloud’s BigQuery","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Google Colab","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Fantom","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"Polkadot","content":"LOCATION"},{"type":"Lisbon","content":"LOCATION"},{"type":"August","content":"DATE"},{"type":"Solana <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/33827\/solana-sol-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/solana.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">SOL","content":"ORGANIZATION"},{"type":"Foundation","content":"ORGANIZATION"},{"type":"Solana NFTs","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Ethereum Goerli","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Solana NFT","content":"ORGANIZATION"},{"type":"Dogecoin","content":"LOCATION"},{"type":"-1.14%","content":"PERCENT"},{"type":"Nalin Mittal","content":"PERSON"},{"type":"Blockchain Node Engine","content":"ORGANIZATION"},{"type":"Chris Maddern","content":"PERSON"},{"type":"Arbitrum","content":"LOCATION"},{"type":"Polygon Mumbai","content":"ORGANIZATION"},{"type":"Dan Albert","content":"PERSON"},{"type":"BigQuery","content":"ORGANIZATION"},{"type":"Bitcoin Cash","content":"ORGANIZATION"},{"type":"Cronos","content":"LOCATION"},{"type":"Litecoin","content":"PERSON"},{"type":"Albert","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"Ethereum Classic","content":"ORGANIZATION"}],"hashtag":["DATA PROVIDERS","SOLANA"],"authors":["James Hunt","The Block"]}