{"summary":"The messaging app says said a Twitter thread alleging crimes including rape and assassination is likely an attempt to steal users&#x27; private keys.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/150472\/telegram-says-lurid-twitter-claims-have-all-the-hallmarks-of-a-hoax","publishDate":"2022-06-07T07:20:18","id":5424,"type":null,"title":"Telegram says lurid Twitter claims have &#x27;all the hallmarks of a hoax&#x27;","category":["CRYPTOCURRENCY"],"content":["Telegram, a messaging app popular with crypto investors, said a pseudonymous <a href=\"https:\/\/twitter.com\/adyingnobody\/status\/1534021154674966529\" data-v-f87c67ca=\"\">Twitter thread<\/a> alleging crimes including rape and assassination \"has all the hallmarks of a hoax\" and is probably an attempt to steal the private keys to users' crypto wallets.&nbsp;","A Twitter user going by the handle @adyingnobody claimed to have used an exploit in Telegram's software to download more than 100GB of messages, including evidence of behavior ranging from crypto influencers \"pretending to be someone you're not\" to rape, pedophilia and even murder. The top post in the thread had more than 4,000 retweets as of 7:15 a.m. ET on Tuesday.&nbsp;","The Block also received an email from an address with a similar name, recapping the allegations — although they didn't respond to a follow-up email requesting more information.","A spokesperson for Telegram poured cold water on the lurid tales, telling The Block that \"the post has all the hallmarks of a hoax and the purpose of the text is likely to make gullible people download some malware that steals your private keys.\"&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Telegram","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"7:15 a.m.","content":"TIME"}],"hashtag":[],"authors":["Andrew Rummer","The Block"]}