{"summary":"The Earth, once the Eden, the precious gift to mankind, has turned to a dark, exhausted orb in this vastly deep, cold, and seemingly empty space.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/125380\/escaping-the-earth-dec-14-with-a-new-play-to-earn-dmmo","publishDate":"2021-11-25T09:00:05","id":5426,"type":null,"title":"Escaping the Earth Dec 14 with a New Play-to-Earn dMMO","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">The Earth, once the Eden, the precious gift to mankind, has turned to a dark, exhausted orb in this vastly deep, cold, and seemingly empty space. We are no longer welcome here. But we still believe that this could not be the end. Not yet.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The ones who yet survived the dawn of the Earth are gathering the remaining resources of our beloved home to build our only possible future - Spaceships. To collaborate, they proposed a new decentralized currency - Credits, easing the path of the pioneers and enabling the new economy. But no economy can exist without conflicts, when someone prospers - raiders will inevitably emerge. Alongside drills and excavators, the pioneers are mounting firearms. The preparation for the great journey has begun. The Universe of Farsite awaits. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Developed by <\/span><a href=\"http:\/\/spnv.io\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">SUPERNOVAE<\/span><\/a><span data-v-f87c67ca=\"\">, the team which pioneered the NFT gaming back in early 2018 with their city-builder strategy <\/span><a href=\"http:\/\/mcp3d.com\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">MegaCryptoPolis<\/span><\/a><span data-v-f87c67ca=\"\">, the new decentralized MMO game <\/span><a href=\"http:\/\/farsite.online?from=tbc\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Farsite<\/span><\/a><span data-v-f87c67ca=\"\"> offers players a new playable world to leverage their cNFTs. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">The main asset in the game, as obvious as it may seem for a space MMO, is a Spaceship. Ships are unique in their appearance, there are multiple models of Spaceships with various rarity and characteristics. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">But the most interesting part is that these Ships are not regular NFTs. Each and every ship, as well as modules (used to tune and modify your ships), are <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/121511\/cnfts-the-future-of-play-to-earn-gaming\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">cNFTs<\/span><\/a><span data-v-f87c67ca=\"\">, which means Collateral Non-Fungible Tokens - ERC-721 tokens with ERC-20 standard tokens - Credits - locked inside as collateral.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The main purpose of Credits is to stake them as collateral to create new ships and modules, which in the future could be used as collateral themselves, enabling lending against game assets.&nbsp;<\/span>","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"mankind","content":"LOCATION"},{"type":"Earth","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Universe of Farsite","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"20","content":"DATE"}],"hashtag":[],"authors":["Sponsored","The Block"]}