{"summary":"The new support allows users to connect their Metamask wallets from web browsers and load music from ERC-721 and ERC-1155 tokens on Ethereum and Polygon.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/192808\/winamp-web3-nft-music-update","publishDate":"2022-12-07T04:54:24","id":5427,"type":null,"title":"Winamp goes web3 with NFT music support in new update","category":["METAVERSE & NFT"],"content":["Old-school media player Winamp now supports Ethereum and Polygon-based music NFTs in its latest desktop update.","The new web3-focused support allows users to connect their Metamask wallets from web browsers Chrome, Firefox and Brave, and load music from ERC-721 and ERC-1155 tokens on Ethereum and Polygon.","“The genesis of Winamp has always been about accessibility and innovation, and today we are proud to launch the very first standalone player reading audio NFTs, as well as any other existing formats,” Winamp CEO Alexandre Saboundjian said in <a href=\"https:\/\/www.winamp.com\/wp-content\/uploads\/press-release-2022.12.06-winamp-player-now-supports-audio-nfts.pdf\" data-v-f87c67ca=\"\">a release<\/a>.","“Winamp was a key part of the first digital music innovation, when mp3s changed the way we listen and enjoy music,” Saboundjian added. “Now we’re supporting the leading edge of the next one, as more and more artists explore web3 and its potential.”","In addition to adding support for music NFTs, the update reduces Winamp's memory footprint and upgrades security.","Winamp was originally released in 1997 and is most widely remembered as the dominant Windows media player of the day. It has since long been overtaken by a variety of other media platforms, such as Windows Media Player and Apple Music.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Apple Music","content":"ORGANIZATION"},{"type":"Winamp","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Polygon","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"1155","content":"DATE"},{"type":"Alexandre Saboundjian","content":"PERSON"},{"type":"Firefox","content":"ORGANIZATION"},{"type":"1997","content":"DATE"}],"hashtag":[],"authors":["Adam James","The Block"]}