{"summary":"A Bitcoin developer executed a complex transaction that temporarily affected many nodes on the experimental Lightning Network.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176085\/large-bitcoin-transaction-briefly-took-down-bulk-of-lightning-network","publishDate":"2022-10-11T06:29:35","id":5429,"type":null,"title":"Large Bitcoin transaction briefly caused many Lightning Network nodes to fall out of sync","category":["BITCOIN"],"content":["A Bitcoin developer created and executed a complex transaction on the Bitcoin blockchain that caused a lot of Lightning Network nodes to fall out of sync with the Bitcoin network on Oct. 9.","The Lightning Network is a layer built on top of Bitcoin that’s designed to handle high amounts of low-value transfers. It is still in the experimental phase, and those running Lightning nodes also have to run Bitcoin nodes.","The transaction was a multi-sig payment, where multiple cryptographic keys are used to sign a single transaction. Normally, these kinds of transactions have a handful of participants.&nbsp;In this case, Bitmatrix Founder Burak Keceli decided to test the boundaries of what is possible. He <a href=\"https:\/\/twitter.com\/brqgoo\/status\/1579216353780957185\" data-v-f87c67ca=\"\">created<\/a> a 998 out of 999 multi-sig — where 998 keys had to be used to sign the transaction out of a possible 999. The transaction went through and only cost the developer $4.82 in transaction fees (which is relatively cheap, considering the complexity).","The transaction caused problems for the Lightning Network. Many users <a href=\"https:\/\/github.com\/lightningnetwork\/lnd\/issues\/7002\" data-v-f87c67ca=\"\">complained<\/a> that they were unable to stay in sync with the Bitcoin network, prevent them from adding bitcoin from the network. The issue was due to a bug in the parsing library of an implementation of Bitcoin called btcd. It was <a href=\"https:\/\/github.com\/lightningnetwork\/lnd\/issues\/7002#issuecomment-1272654613\" data-v-f87c67ca=\"\">mistakenly<\/a> still checking a limit from an old version of the code.","The bug has now been fixed among Lightning node implementations. This enabled Lightning node operators to sync with the Bitcoin network again.","<em data-v-f87c67ca=\"\">Correction: This story has been updated to show that the bulk of the Lightning network did not go down, but merely a lot of nodes fell out of sync with it — an issue that only affected node runners from adding liquidity.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Burak Keceli","content":"PERSON"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bitmatrix","content":"ORGANIZATION"},{"type":"Oct. 9","content":"DATE"},{"type":"$4.82","content":"MONEY"}],"hashtag":["BITCOIN"],"authors":["Tim Copeland","The Block"]}