{"summary":"Montreal-based Lighthouse rolled out an open metaverse navigation engine that allows users to find places to visit in virtual worlds.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/194508\/lighthouse-metaverse-lonely","publishDate":"2022-12-13T09:00:11","id":5432,"type":null,"title":"Lighthouse wants to make the metaverse less lonely: Exclusive","category":["METAVERSE"],"content":["Montreal-based Lighthouse rolled out an open metaverse navigation engine that allows users to find places to visit in virtual worlds.","The platform indexes information about experiences and events from more than 20 blockchain-friendly virtual worlds, including Decentraland, The Sandbox, Voxels and Mona. It's releasing the platform following a successful beta in which over 40,000 testers registered, according to the company.","Backed by the likes of Accel, BlockTower, White Star Capital and Animoca Brands during a <a href=\"https:\/\/www.theblock.co\/linked\/146303\/lighthouse-labs-raises-7-million-in-seed-round-to-build-metaverse-search-engine\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">$7 million funding round<\/a> in May, Lighthouse uses indexing tools and direct partnerships with metaverse companies to collect and curate data for its platform.&nbsp;","“The biggest critique around the metaverse, which is a very fair one, is that it feels empty,\" said co-founder and CEO Jonathan Brun, adding: \"Everyone that jumps in these worlds feels alone and there's never anyone around.\"&nbsp;But that’s not because of a lack of cool experiences, he said. “We talk to creators every day and we see what they've built. There’s super exciting stuff.\"","Lighthouse believes that the empty metaverse problem is a search issue. Truly social experiences in the metaverse are lacking not because there’s not enough quality content to discover but because creators, friends and audiences simply can’t find each other.&nbsp;It hopes its platform will solve this issue by highlighting and recommending popular spots to visit across different worlds. It also plans to include a social element — in which users can track friends through the metaverse, follow creators and save their favorite projects and places.&nbsp;","\"As you create friends on Lighthouse and they go inside those worlds, regardless of where they are, you can actually find them, click on their name and jump to meet them within those worlds, which is an amazing coordination tool as people plan these explorations,\" said Brun.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mona","content":"LOCATION"},{"type":"White Star Capital","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Montreal","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Jonathan Brun","content":"PERSON"},{"type":"$7 million","content":"MONEY"},{"type":"Brun","content":"PERSON"},{"type":"Accel","content":"ORGANIZATION"}],"hashtag":["ANIMOCA BRANDS","DECENTRALAND","THE SANDBOX","VOXELS"],"authors":["Callan Quinn","The Block"]}