{"summary":"The Forsage founders could face 20 years in jail if convicted.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/214205\/forsage-founders-indicted-in-340-million-ponzi-scheme","publishDate":"2023-02-22T18:34:07","id":5436,"type":null,"title":"Forsage founders indicted in $340 million Ponzi scheme ","category":["LEGAL"],"content":["The founders of Forsage, a decentralized finance crypto investment platform, were indicted for their alleged roles in a $340 million “global Ponzi and pyramid scheme.”<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","A federal grand jury returned an indictment charging four Russian nationals for their role at the platform: Vladimir Okhotnikov, Olena Oblamska, Mikhail Sergeev and Sergey Maslakov.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","All four were charged with conspiracy to commit wire fraud and could face 20 years in jail if convicted.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“The defendants aggressively promoted Forsage to the public through social media as a legitimate and lucrative business opportunity, but in reality, the defendants operated Forsage as a Ponzi and pyramid investment scheme that took in approximately $340 million from victim-investors around the world,” the Justice Department said in a press release.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The indictment comes months after the Securities and Exchange Commission <a href=\"https:\/\/www.theblock.co\/post\/160624\/sec-charges-forsage-founders-promoters-in-300-million-crypto-ponzi-scheme-lawsuit\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">charged<\/span><\/a> nearly a dozen people for their alleged roles at Forsage.","The defendants are accused of coding and deploying smart contracts that “systemized their combined Ponzi-pyramid scheme” on the Ethereum blockchain, the Binance Smart Chain and the Tron blockchain. Court documents say that when an investor put their funds into Forsage, the smart contract automatically diverted them to another investor.","More than 80% of Forsage investors received fewer ETH than they invested, and more than 50% never received a payout, according to the Justice Department.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Vladimir Okhotnikov","content":"PERSON"},{"type":"Olena Oblamska","content":"PERSON"},{"type":"$340 million","content":"MONEY"},{"type":"Binance Smart Chain","content":"ORGANIZATION"},{"type":"80%","content":"PERCENT"},{"type":"Justice Department","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Mikhail Sergeev","content":"PERSON"},{"type":"Sergey Maslakov","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}