{"summary":"In December, Coinbase said it was winding down its GiveCrypto initiative, handing out remaining funds to Brink and GiveDirectly.\nBrink revealed today it will be receiving $3.6 million from the exchange.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277882\/coinbase-donates-3-6-million-to-support-bitcoin-developer-funding-through-brink","publishDate":"2024-02-16T12:30:03","id":544,"type":null,"title":"Coinbase donates $3.6 million to support Bitcoin developer funding through Brink","category":["Crypto Ecosystems"],"content":["<span data-v-f87c67ca=\"\">Coinbase is donating $3.6 million to <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.36%\n    <\/span><\/a> <!----><\/span><\/span>-supporting nonprofit Brink as it winds down GiveCrypto, an organization that gave out crypto to those in poverty.<\/span>","In December, the exchange said that it was <a href=\"https:\/\/www.coinbase.com\/en-gb\/blog\/winding-down-givecrypto\" data-v-f87c67ca=\"\">ending the initiative<\/a> due to its inability to create a lasting impact. At the time, Coinbase said it was splitting the remaining funds between Brink and a charity platform called GiveDirectly, but didn't specify amounts.","Founded in 2020, Brink aims to boost the Bitcoin protocol through research and development, and by supporting the Bitcoin developer community. It offers a fellowship program to onboard new software engineers into Bitcoin development and a grants program for existing Bitcoin developers.","Brink said the funds will be directly used to support its grantees, which are a number of developers focused on the Bitcoin codebase.","“Brink is excited to receive one of the biggest Bitcoin open source developer donations from one of the biggest companies in the space, Coinbase. With these funds, we will continue our mission to support the Bitcoin developer ecosystem through funding, education, and mentoring,\" said Brink co-founder Mike Schmidt.","In June 2023, Brink raised $5 million from Jack Dorsey’s Smart Small funding initiative to support independent Bitcoin developers through grants. In January 2024, investment firm VanEck pledged 5% of its spot bitcoin ETF profits to Brink."],"hashtag":["BITCOIN","COINBASE"]}