{"summary":"Crypto tax startup Koinly laid off 14% of its staff.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/192721\/crypto-tax-startup-koinly-cuts-14-of-staff","publishDate":"2022-12-06T17:22:28","id":5441,"type":null,"title":"Crypto tax startup Koinly cuts 14% of staff","category":["COMPANIES"],"content":["Crypto tax startup Koinly has cut 14% of its staff, a reduction in headcount CEO Robin Singh attributed to a bear market made worse by the collapse of crypto exchange FTX.","“We are taking measures to ensure we’re as lean as possible as we make our way through the crypto winter,\" CEO Robin Singh said in a statement. \"While change is an unavoidable part of business, it’s been a sad week at Koinly as we have had to let go of several of our colleagues.\"","How many positions Koinly cut is unclear. The company's LinkedIn page lists 93 employees. An email asking Koinly for clarification about its total headcount was not returned by the time of publication.&nbsp;","Koinly's main business is helping people in more than 20 countries calculate and declare the taxes owed on their digital assets. While the company saw record growth this year and increased its headcount significantly, the company is cutting back as it adjusts to a market in which crypto investors are seeing more losses and not filing as many returns, which Singh said is a common mistake.&nbsp;","“As a crypto tax company, what's hurting us more than the actual crypto downturn is the lack of awareness crypto investors have around filing their crypto losses,\" Singh said. \"We are seeing fewer people reporting crypto on their tax returns, mostly because there are a lot of losses this year,\" Singh said, adding that filing losses could benefit investors by helping them offset gains when they file in the future.&nbsp;","Several other crypto and tech companies have cut staff in recent months, with some having to make multiple rounds off layoffs. <a href=\"https:\/\/www.theblock.co\/post\/192555\/gamestop-undertakes-a-big-round-of-layoffs-crypto-team-reportedly-impacted\" data-v-f87c67ca=\"\">GameStop<\/a>, Latin America-focused exchange <a href=\"https:\/\/www.theblock.co\/post\/190758\/bitso-cuts-more-staff-in-fresh-round-of-layoffs\" data-v-f87c67ca=\"\">Bitso <\/a>and&nbsp;Australian crypto exchange <a href=\"https:\/\/www.theblock.co\/post\/192060\/australia-crypto-exchange-swyftx-layoffs\" data-v-f87c67ca=\"\">Swyftx<\/a> have all reduced their headcount in the past week alone.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Robin Singh","content":"PERSON"},{"type":"winter","content":"DATE"},{"type":"14%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Latin America","content":"LOCATION"},{"type":"Singh","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"GameStop","content":"ORGANIZATION"}],"hashtag":["LAYOFFS"],"authors":["Kristin Majcher","The Block"]}