{"summary":"In re Ripple Labs Inc. Litigation, &quot;Amended Class Action Complaint&quot;, D.N.D.Cal, Case No. 4:18-cv-06753-PJH, , Filed 8\/5\/19 . There’s a great moment in","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/36201\/xrp-the-more-things-change-the-more-they-stay-the-same","publishDate":"2019-08-15T19:00:55","id":5442,"type":null,"title":"XRP: the more things change, the more they stay the same","category":["LEGAL"],"content":["<strong data-v-f87c67ca=\"\">In re Ripple Labs Inc. Litigation, \"Amended Class Action Complaint\", D.N.D.Cal, Case No. 4:18-cv-06753-PJH, , Filed 8\/5\/19 [PJB].<\/strong>","There’s a great moment in Alan Moore’s <em class=\"ll\" data-v-f87c67ca=\"\">Watchmen&nbsp;<\/em>where a pop television philosopher explains the significance of the birth of a new superhero, Dr. Manhattan, to the American public.","Dr. Manhattan, born Dr. Jonathan Osterman, was originally born human. He grew up to be an extremely nerdy, lanky scientist. After being bitten by a radioactive marmot (killed in a freak radiological accident), Osterman was re-born as a nigh-omnipotent being of pure energy capable of experiencing all four spatial and temporal dimensions simultaneously. Oh, and he also has complete command over all existence.","Pretty cool, right? This supposedly led the philosopher to say of Dr. Manhattan that “the superman exists and he is American.” In the television clip, however, he corrects the interviewer by pointing out he actually said “‘<em class=\"ll\" data-v-f87c67ca=\"\">God<\/em> exists and he’s American.’” He continues: “If that statement starts to chill you after a couple of moments’ consideration, then don’t be alarmed. A feeling of intense and crushing religious terror at the concept indicates only that you are still sane.”","<a class=\"cj cf lm ln lo lp\" href=\"https:\/\/www.youtube.com\/watch?v=s_n_okV8xRU\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">https:\/\/www.youtube.com\/watch?v=s_n_okV8xRU<\/a>","Those of us with law degrees and experience in securities practice who watched the cryptocurrency space from outside experienced similar feelings in the years between 2015 and 2018. We too questioned our sanity as we watched company after company sell coins into the U.S. market but not treat those coins as securities offerings. Among the companies in relation to which it has been alleged that the coin offerings constitute securities transactions is Ripple Labs.","According to a &nbsp;<a class=\"cj cf lm ln lo lp\" href=\"https:\/\/www.coindesk.com\/investors-suing-ripple-cite-sec-guidance-to-argue-xrp-is-a-security\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">CoinDesk<\/a>&nbsp;headline from earlier this week, “SEC [Token Framework] Gives Ammo to Lawsuit Claiming XRP is an Unregistered Security.” Much wailing and gnashing of teeth followed on Twitter and in my Signal DMs. The significance of the move has been a little overstated on the Internet, so I wanted to break it down briefly here for the readers of this august publication:","<strong class=\"kz mi\" data-v-f87c67ca=\"\">1) The plaintiffs already alleged that XRP was an unregistered security in the previous version of their complaint.<\/strong>","They’re not making any allegations that are new.","<strong class=\"kz mi\" data-v-f87c67ca=\"\">2) The SEC Framework has no precedential value.<\/strong>","Nor does it feature that heavily in the argument. It appears at paragraph 6 in the summary of the action and a half-dozen times throughout the rest of the pleading. The question before the Court remains whether the sale of XRP satisfies the four prongs of the long-standing test from <em class=\"ll\" data-v-f87c67ca=\"\">SEC v. W.J. Howey, Co.<\/em>and (as the action is brought in California) the alternative four-pronged “risk capital” test from&nbsp;<em class=\"ll\" data-v-f87c67ca=\"\">Silver Hills Country Club v. Sobieski <\/em>specific to California.","While the SEC’s guidance will, undoubtedly, assist the plaintiffs’ case in that the SEC’s conclusions could be seen to support their own, ultimately the SEC’s Framework is of persuasive value and the common-law tests are what must be answered, having due regard for whatever distinctions have been made in similar cases in the past.","<strong class=\"kz mi\" data-v-f87c67ca=\"\">3) Ripple has assembled an all-star legal team to defend the action so this is by no means a slam dunk.<\/strong>","Their legal team at Debevoise &amp; Plimpton is led by Mary Jo White, former chairwoman of the Securities and Exchange Commission. Serious business.","<strong class=\"kz mi\" data-v-f87c67ca=\"\">4) The best way to think about this is as a sanity check.<\/strong>","The aforementioned quotation from <em class=\"ll\" data-v-f87c67ca=\"\">Watchmen<\/em> is something I have meditated on frequently as an observer of issuer conduct throughout the height of the ICO boom.","Entrepreneurs in the crypto space, or in any space for that matter, are risk-takers and sometimes can be quite cavalier risk-takers. The importance for the legal practitioner advising entrepreneurs on the cutting edge is to be sufficiently confident with one’s handle on the technology or the marketplace that one can ensure that whatever <em class=\"ll\" data-v-f87c67ca=\"\">folie a plusieurs <\/em>has seized the imagination of the market does not also have a firm hold on you.","If you have thought that there is a possibility that what companies like Ripple are doing might be found to constitute the sale of securities, as is alleged in this action, and have been gripped by “a feeling of intense and crushing religious terror” at the implications for these issuers down the line if and when enforcement should come, I have good news for you: this indicates “only that you are still sane” and that you’ve had due regard to the fact that securities enforcement can be a very long game, and that you are in a good position to advise your clients on the risks of operating a cryptocurrency business in the United States.","<em class=\"ll\" data-v-f87c67ca=\"\">Disclaimer: Crypto Caselaw Minute is provided for educational purposes only by Nelson Rosario (@nelsonmrosario) and Stephen Palley (@stephendpalley). This post was written by Preston Byrne (@prestonjbyrne). &nbsp;These summaries are not legal advice. They are the authors' opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"earlier this week","content":"DATE"},{"type":"2015","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Nelson Rosario (","content":"PERSON"},{"type":"Jonathan Osterman","content":"PERSON"},{"type":"Debevoise &amp; Plimpton","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Co.","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Osterman","content":"PERSON"},{"type":"august","content":"DATE"},{"type":"Unregistered Security","content":"ORGANIZATION"},{"type":"Manhattan","content":"LOCATION"},{"type":"Ripple Labs Inc","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Silver Hills Country Club v. Sobieski","content":"ORGANIZATION"},{"type":"Watchmen","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Preston Byrne","content":"PERSON"},{"type":"Alan Moore","content":"PERSON"},{"type":"Mary Jo White","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"W.J. Howey","content":"PERSON"},{"type":"California","content":"LOCATION"}],"hashtag":["XRP"],"authors":["Preston Byrne","The Block"]}