{"summary":"Rep. Patrick McHenry, who has been a staunch advocate for the crypto industry, will be retiring at the end of his term in January 2025.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266168\/crypto-friendly-rep-patrick-mchenry-wont-be-seeking-re-election","publishDate":"2023-12-05T14:33:38","id":5443,"type":null,"title":"Crypto-friendly Rep. Patrick McHenry won&#x27;t be seeking re-election","category":["LEGAL"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Rep. Patrick McHenry, who has been a staunch advocate for the crypto industry, will be retiring at the end of his current term in January 2025.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"I will be retiring from Congress at the end of my current term,\" House Financial Services Committee Chair McHenry said in a statement on Tuesday. \"This is not a decision I come to lightly, but I believe there is a season for everything and — for me — this season has come to an end.\"<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">McHenry led efforts to advance crypto legislation out of his committee during the summer, including one<\/span><span class=\"s1\" data-v-f87c67ca=\"\"> bill that would regulate stablecoins at the federal level and another that takes a comprehensive approach to crypto's market structure. Both bills would need to garner support from the Senate, which could prove to be tough next year.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"It's a sad day for the digital asset industry,\" said Cody Carbone, <\/span><span class=\"s3\" data-v-f87c67ca=\"\">vice president of policy for the Chamber of Digital Commerce. \"Chairman McHenry has been a champion for the innovation that this industry has proven it can provide to the financial services sector.\"&nbsp;<\/span>","\"I look forward to continuing to work alongside him to pass digital asset legislation ahead of his retirement,\" Carbone added. \"A lot of work still needs to be done!\"&nbsp;","<span class=\"s2\" data-v-f87c67ca=\"\">Sheila Warren, CEO of the Crypto Council for Innovation, called McHenry an \"unparalleled leader.\"<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"We have appreciated McHenry's approach to coalition building, willingness to work in a bipartisan nature, and constructive engagement with industry. He will be noticeably missed in Congress,\" Warren said in a statement.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Rep. Blaine Luetkemeyer, who's been somewhat vocal on crypto-related issues recently, is in the running for House Financial Services Committee chair, according to his spokesperson. Luetkemeyer said that former Binance CEO Changpeng Zhao represented \"the worst of the crypto industry,\" following his departure and a $4 billion settlement made with U.S. prosecutors last month.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"The crypto space has produced amazing new technologies and holds great promise in cross-border payments and data management. As is the case with all industries, U.S. policies should promote innovative crypto companies that expand financial access to honest, hardworking people,\" <\/span><span class=\"s1\" data-v-f87c67ca=\"\">Luetkemeyer said. \"<\/span><span class=\"s2\" data-v-f87c67ca=\"\">However, there is no place here for any individual or company that aids tyrants and campaigns of terror.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Reps. Bill Huizenga, R-Mich., and French Hill, R-Ark., are also expected to be interested in the chair position as well, according to Politico.&nbsp;<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Warren","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"$4 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Crypto Council for Innovation","content":"ORGANIZATION"},{"type":"Blaine Luetkemeyer","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"January 2025","content":"DATE"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Carbone","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"McHenry","content":"ORGANIZATION"},{"type":"Bill Huizenga","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Chamber of Digital Commerce","content":"ORGANIZATION"},{"type":"Sheila Warren","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Cody Carbone","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Patrick McHenry","content":"PERSON"},{"type":"\" House Financial Services Committee Chair McHenry","content":"ORGANIZATION"},{"type":"Mich.","content":"LOCATION"},{"type":"Luetkemeyer","content":"PERSON"},{"type":"Ark.","content":"LOCATION"},{"type":"summer","content":"DATE"},{"type":"Binance","content":"ORGANIZATION"},{"type":"Senate","content":"ORGANIZATION"},{"type":"McHenry","content":"PERSON"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}