{"summary":"The market capitalization of the top proof-of-stake assets dropped 7% to $254 billion in the latest quarter of the year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/259632\/proof-of-stake-asset-market-capitalization-drops-7-to-254-billion","publishDate":"2023-10-26T10:23:44","id":5444,"type":null,"title":"Proof-of-Stake asset market capitalization drops 7% to $254 billion","category":["COMPANIES"],"content":["The market capitalization of the top proof-of-stake assets dropped 7% to $254 billion in the latest quarter of the year from the previous quarter, according to a report from Staked, a non-custodial staking platform owned by crypto exchange <a href=\"https:\/\/www.theblock.co\/post\/210332\/kraken-settles-sec-charges-over-its-staking-program\" data-v-f87c67ca=\"\">Kraken<\/a>.","Additionally, the value of staked assets increased 3% to $74 billion, while the annualized staking rewards dropped 7% to $4.1 billion. The average PoS staking yield was 10.2%, a 4% decrease from the last quarter.&nbsp;","Overall, the share of PoS compared to the total cryptocurrency market capitalization is 22%, a 2% drop quarter-over-quarter.","Staked notes that while the quarter-by-quarter metrics may have been depressed, it bodes well for moving out of the market's rock bottom.&nbsp;","\"Crypto markets drifted lower during the quarter,\" Staked wrote in the report","\"The lack of near term catalysts, regulatory uncertainty and macro challenges left markets in a holding pattern. While crypto assets were down 5-10% on a quarter-by-quarter basis, they were up 10-40% on a year-by-year basis (except stablecoins), indicating that while the bear persists, the market is off the bottom,\" it continued.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"$4.1 billion","content":"MONEY"},{"type":"3%","content":"PERCENT"},{"type":"2%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"10%","content":"PERCENT"},{"type":"22%","content":"PERCENT"},{"type":"10.2%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"$74 billion","content":"MONEY"},{"type":"$254 billion","content":"MONEY"},{"type":"last quarter","content":"DATE"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}