{"summary":"Institutions are wading into the market for digital assets and that appears to be a boon for CME Group&#x27;s bitcoin products. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/67857\/cme-bitcoin-institutional-investors","publishDate":"2020-06-10T11:12:26","id":5445,"type":null,"title":"CME&#x27;s bitcoin products appear to benefit as institutional investors wade into crypto","category":["THE BLOCK"],"content":["Institutions are wading into the market for digital assets — and CME Group's bitcoin products seem to be drawing attention as well.","A <a href=\"https:\/\/www.theblockcrypto.com\/post\/67763\/fidelity-nearly-80-of-institutional-investors-see-the-appeal-of-digital-assets\" data-v-f87c67ca=\"\">survey<\/a> conducted by Fidelity Digital Assets found that nearly 80% of institutional investors see something appealing about the asset class, the company revealed during a conference call on Tuesday. The percentage of investors who allocated to digital assets increased from 22% in 2019 to 27% in 2020, an indication that an incoming tide of adoption continues,&nbsp;according to Fidelity Digital Assets' director of research Ria Bhutoria.&nbsp;","Indeed, investors have become more comfortable with digital assets on several fronts, with the number of respondents concerned about the asset's price volatility, market manipulation, and lack of fundamentals to gauge appropriate value decreasing in 2020 compared to 2019.","Bhutoria said investors have been drawn into the market by \"hard money\" theses and unconventional monetary policy by central banks aiming to stimulate the economy.","","","The manner in which investors gain exposure to the market varies, with some purchasing crypto directly and others buying derivatives products like futures, according to the survey. This should come as no surprise, given how difficult it is for certain funds to custody bitcoin and other digital assets. And in some cases, they lack the legal mandate to do so.","As such, the number of investors allocated to digital assets via futures saw significant growth from 2019 to 2020, increasing by 13 percentage points.&nbsp;","","","Fidelity's report did not break down which futures products investors are buying. Still, it's a safe bet to say CME Group's bitcoin futures product would have been the dominant product among US-based firms.","CME Group's bitcoin futures product is perhaps the easiest way for a large investment firm or fund to gain indirect exposure to bitcoin, as my colleague Ryan Todd has <a href=\"https:\/\/www.theblockresearch.com\/cme-groups-bitcoin-futures-are-drawing-in-more-large-traders-than-ever-before-55976\" data-v-f87c67ca=\"\">noted<\/a>. For traditional funds — which already trade different futures across assets — CME offers a regulated and liquid venue with which they are already familiar.","The size of CME's bitcoin futures market appears to have grown as institutional investors have sought out indirect exposure to digital assets, as shown by data from Skew.&nbsp;Since the beginning of May, open interest in CME's bitcoin futures product has stood above $400 million.","That's a fourfold increase compared to the end of 2019.&nbsp;","","","The size of CME Group's bitcoin options market has also seen some growth, picking up significant market share relative to market leader Deribit.","On Tuesday, CME Group's options contract — which launched at the beginning of 2020 — comprised of 23% of aggregated open interest in crypto options. That growth comes in spite of higher capital requirements to trade compared to Deribit.","In terms of volumes, CME's market represents one-third of the total crypto options market. That's a noticeable increase even when compared to a few weeks ago when The Block's Larry Cermak identified Deribit as the clear <a href=\"https:\/\/www.theblockresearch.com\/the-year-of-options-and-the-clear-winner-66373\" data-v-f87c67ca=\"\">leader<\/a>&nbsp;in crypto options.&nbsp;","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ryan Todd","content":"PERSON"},{"type":"80%","content":"PERCENT"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Ria Bhutoria","content":"LOCATION"},{"type":"CME Group","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"23%","content":"PERCENT"},{"type":"22%","content":"PERCENT"},{"type":"2019","content":"DATE"},{"type":"Fidelity Digital","content":"ORGANIZATION"},{"type":"Larry Cermak","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Fidelity Digital Assets","content":"ORGANIZATION"},{"type":"27%","content":"PERCENT"},{"type":"US","content":"LOCATION"},{"type":"$400 million","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"CME","content":"ORGANIZATION"}],"hashtag":["DERIVATIVES"],"authors":["Frank Chaparro","The Block"]}