{"summary":"Slated for launch on PlayStation, Xbox and PC, &quot;Off the Grid&quot; is video game that incorporates an in-game economy.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284572\/playstation-crypto-game-dev-gunzilla-games-raises-30-million-in-round-led-by-avalanche-fund-and-coinfund","publishDate":"2024-03-26T09:00:09","id":5446,"type":null,"title":"PlayStation crypto game dev Gunzilla Games raises $30 million in round led by Avalanche fund and CoinFund","category":["GAMING"],"content":["Gunzilla Games, the developer behind the upcoming video game \"Off the Grid,\" has raised $30 million in a round co-led by CoinFund and Avalanche's Blizzard Fund, according to a statement.","\"Off the Grid,\" which is a free-to-play, <span data-v-f87c67ca=\"\">battle royale video game, is slated for release on both the Sony PlayStation and Microsoft's Xbox, in addition to PC. The new third-person shooter video game \"deploys the revolutionary concept of complete asset ownership and a player-driven in-game economy,\" according to Gunzilla Games.<\/span>","<span data-v-f87c67ca=\"\">In its statement, Gunzilla Games also said its \"combined $30 million\" raise includes a \"$10 million strategic token round,\" <\/span><span data-v-f87c67ca=\"\">participation from Republic Capital and Morningstar Ventures<\/span><span data-v-f87c67ca=\"\">, and \"previously<\/span> <span data-v-f87c67ca=\"\">unreported equity and validator sales.\" <\/span>Gunzilla Games's new raise follows a <span data-v-f87c67ca=\"\">$46 million <a href=\"https:\/\/gunzillagames.com\/en\/news\/41-Gunzilla-Games-Raises----M-to-Redefine-the-Battle-Royale-Genre-By-Letting-Players-Trade-Their-In-Game-Items-in--Off-The-Grid--\" data-v-f87c67ca=\"\">funding round<\/a> from August 2022.<\/span>","The arena of blockchain-based shooter style video games <a href=\"https:\/\/www.theblock.co\/post\/281739\/delphi-digital-joins-5-million-round-for-developer-of-crypto-video-game-metalcore\" data-v-f87c67ca=\"\">appears to be maturing<\/a> with \"Off the Grid\" set to compete against other titles like <span data-v-f87c67ca=\"\">Studio 369's<\/span><span data-v-f87c67ca=\"\"> \"MetalCore\" and the extraction shooter \"Shrapnel.\" Up until now, most crypto video games, where players can own and trade digital assets, have been fairly limited in scope and complexity.&nbsp;<\/span>","\"<span data-v-f87c67ca=\"\">With the forthcoming launch of '<\/span>Off the Grid'<span data-v-f87c67ca=\"\"> and GUNZ to the public, we are not just advancing towards a new horizon in AAA gaming but also establishing a new standard in the blockchain space,\" Gunzilla Games co-founder and CEO Vlad Korolov said in the statement. <br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">He added that \"Off the Grid\" will \"<\/span><span data-v-f87c67ca=\"\">deliver a AAA gaming experience\" that exceeds \"gamers’ expectations and enriches their engagement with the game universe by incorporating the decentralized community driven in-game economy.\"<\/span>","CoinFund p<span data-v-f87c67ca=\"\">artner and Director of Research Evan Feng said in the statement that he believes \"<\/span><span data-v-f87c67ca=\"\">the gap between traditional and on-chain games is rapidly closing and will invert as game developers choose to leverage the full power of blockchain technology.\"<\/span>","Gunzilla Games said GUNZ is a blockchain-powered <span data-v-f87c67ca=\"\">platform which will \"allow Gunzilla and even other AAA game developers to empower players with full ownership of in-game items as tradable NFTs on an on-chain marketplace and mobile apps.\" The GUNZ testnet launched last April, according to the company.<\/span>","\"'Off the Grid' fully dissolves tricky web3 elements like complex wallets and NFT acquisition into the natural gameplay, giving everyday console gamers a blockchain gaming experience without necessarily realizing they’re having one,\" said Lydia Chiu, an executive at Ava Labs and head of Blizzard Fund.","Last year, Gunzilla Games posted a \"<span data-v-f87c67ca=\"\">gameplay walkthrough trailer<\/span>\" of the upcoming game on YouTube. The video, viewed more than 400,000 times, features top gamers like <span data-v-f87c67ca=\"\">Dr Disrespect, Clix, and ImperialHal.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lydia Chiu","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"August 2022","content":"DATE"},{"type":"Morningstar Ventures","content":"ORGANIZATION"},{"type":"Vlad Korolov","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Ava Labs","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Sony","content":"ORGANIZATION"},{"type":"last April","content":"DATE"},{"type":"$30 million","content":"MONEY"},{"type":"GUNZ","content":"ORGANIZATION"},{"type":"Clix","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Republic Capital","content":"ORGANIZATION"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"$46 million","content":"MONEY"},{"type":"Gunzilla Games","content":"ORGANIZATION"},{"type":"Director of Research Evan Feng","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"}],"hashtag":["GAME"],"authors":["RT Watson","The Block"]}