{"summary":"Standard Chartered will be a founding shareholder in Partior after making an investment of an undisclosed size.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/182627\/standard-chartered-partior","publishDate":"2022-11-03T09:02:19","id":5447,"type":null,"title":"Standard Chartered invests in JPMorgan-founded blockchain tech platform Partior","category":["INSTITUTIONAL INVESTORS"],"content":["International banking group Standard Chartered has invested in Partior and will be a founding shareholder in the blockchain-based technology provider.","Partior is an independent company that arose from the Monetary Authority of Singapore-backed Project Ubin collaboration. It was founded by JPMorgan, DBS and Temasek in 2021.","The aim of Partior is to leverage the programmable, immutable and traceable characteristics of blockchain technology and smart contracts for the benefit of digital clearing and settlement.&nbsp;Standard Chartered will be Partior's first euro settlement bank, according to an <a href=\"https:\/\/www.sc.com\/en\/media\/press-release\/standard-chartered-makes-strategic-investment-in-partior-accelerating-transformation-of-the-global-financial-network\/\" data-v-f87c67ca=\"\">announcement<\/a>.","The investment is also being made to further Standard Chartered's push into the blockchain space, which it sees as providing an opportunity to build \"a more transparent, efficient and secure infrastructure for global value movement.\"","Specifically, the investment aims to increase the speed of Standard Chartered's blockchain deployments across its global wholesale payments and settlements network while simultaneously scaling Partior's utility in global capital markets.","The financial details of the investment have not been shared.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Singapore","content":"LOCATION"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"DBS","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Temasek","content":"ORGANIZATION"},{"type":"Standard Chartered","content":"ORGANIZATION"}],"hashtag":["JPMORGAN"],"authors":["Adam James","The Block"]}