{"summary":"Chengdu is having its second giveaway campaign of the country&#x27;s central bank digital currency. But this time there&#x27;s a notable difference.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/110377\/china-digital-yuan-test-programmable-chengdu","publishDate":"2021-07-02T07:17:01","id":545,"type":null,"title":"China&#x27;s new digital yuan test shows it can be programed to confine utility","category":["CHINA"],"content":["Chengdu is kicking off its second giveaway campaign of the China's central bank digital currency (CBDC), dubbed the digital yuan or the e-CNY, but with a notable difference this time.","The Chengdu government said in an <a href=\"https:\/\/mp.weixin.qq.com\/s\/1ZsahCH7AGlLX6b_or2TXA\" data-v-f87c67ca=\"\">announcement<\/a> on Friday that it is issuing 12 million e-CNY — worth around $1.85 million — through a lottery to 100,000 residents as part of the ongoing CBDC test. This comes months after the municipal government started its first giveaway campaign of 40 million digital yuan in February.&nbsp;","But instead of issuing free digital yuan to lucky citizens that they can use wherever the e-CNY payment is supported, the latest test comes with a theme called \"low carbon summer transportation\" that gives away the e-CNY as allowances to encourage citizens to take more public transportations.","As such, the free e-CNY will arrive with a pre-programed utility for paying for subway and bus tickets through Chengdu's Tianfutong mobile app or for shared bikes on the Meituan mobile app.&nbsp;","This appears to be the first time that the Chinese government is testing the programability of the e-CNY, which is a <a href=\"https:\/\/www.theblockcrypto.com\/daily\/81710\/china-digital-currency-patents\" data-v-f87c67ca=\"\">technology advancement<\/a> on traceability and ensuring a certain fund in the e-CNY form can only be spent on intended purposes.","According to the government's blog post, local residents can register for the lottery starting from July 3 and choose either a \"subway+bike\" or \"bus+bike\" package.","Lottery winners will still need to download and activate a standalone e-CNY mobile app like in previous tests. But different to the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/107407\/china-expands-digital-yuan-reach-with-its-latest-giveaway-trial-in-shanghai\" data-v-f87c67ca=\"\">ten tests<\/a> that have been done throughout six Chinese cities so far, the free digital yuan in the latest test won't be given out to lottery winners' e-CNY mobile app wallets.","Rather, the free digital yuan will be credited to a user's Tianfutong or Meituan mobile app as coupons. By activating their e-CNY wallet apps using the same mobile number they have signed in with on Tianfutong or Meituan, users can then activate the coupons and the e-CNY payment option from within the two mobile apps.","To take mass transportation rides, lottery winers in Chengdu will first pay with the e-CNY coupon, which will cover only parts of the fees. They will need to pay the remaining fees from within their e-CNY mobile apps after topping up the balances through their bank accounts.","But it appears users won't be able to convert the values of the e-CNY coupons for taking rides into the general purpose e-CNY stored in their digital yuan wallets.&nbsp;","Earlier this week, it was reported that other Chinese cities are also integrating the e-CNY payment option within their mass transportation systems.&nbsp;","Residents in the Chinese capital city of Beijing who have already activated the e-CNY standalone apps in previous lottery campaigns can now pay for subway fees using the e-CNY across all 24 lines in the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/110057\/beijing-suzhou-china-digital-yuan-cny-subway\" data-v-f87c67ca=\"\">Beijing railway system<\/a>, which covers 428 stations.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Beijing","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"$1.85 million","content":"MONEY"},{"type":"February","content":"DATE"},{"type":"July 3","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"summer","content":"DATE"},{"type":"Chengdu","content":"LOCATION"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Wolfie Zhao","The Block"]}