{"summary":"Bankrupt crypto lender Celsius Network proposes a sale and restructuring to NovaWulf Digital Management.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/211865\/celsius-sale-plan-novawulf","publishDate":"2023-02-15T03:57:04","id":5458,"type":null,"title":"Bankrupt crypto lender Celsius proposes sale plan to NovaWulf","category":["BANKRUPTCY"],"content":["Bankrupt crypto lender Celsius Network put forward plans for a sale to NovaWulf&nbsp; Digital Management.","Smaller Celsius creditors with less than $5,000 in their lending accounts would receive the majority of their funds back, documents filed with the bankruptcy court on Wednesday <a href=\"https:\/\/cases.stretto.com\/public\/x191\/11749\/PLEADINGS\/1174902152380000000043.pdf\" data-v-f87c67ca=\"\">said<\/a>. Larger creditors will receive tokenized shares in a new company. The tokens will trade on Provenance Blockchain through a registered broker-dealer, and the new firm will also file public disclosure documents, the proposal said.","The long awaited restructuring plan would see NovaWulf, an investment firm founded in 2021 by former Wall Street dealmakers, manage the new entity. Managing partner Jason New <a href=\"https:\/\/www.novawulf.io\/bio\/Jason-New\" data-v-f87c67ca=\"\">helped<\/a> run distressed and special situations teams at Blackstone's GSO Capital Partners unit. Others worked at King Street and Beowulf Energy.","Celsius filed for bankruptcy in July owing billions of dollars and leaving investors fearful for their savings. A damning court appointed examiner report last month <a href=\"https:\/\/www.theblock.co\/post\/207007\/celsius-lost-800-million-risky-bets\" data-v-f87c67ca=\"\">detailed<\/a> multiple operational failures, dishonest public statements, market manipulation and Ponzi-like recycling of client assets.","The firm attracted 40 expressions of interest and nine bids, the court document said. The new owners will inject $45 million to $55 million into the business and plan to add new divisions including debt cards, factoring, trade finance and private wealth services.","In a separate action, the official committee of Celsius’s unsecured creditors filed <a href=\"https:\/\/cases.stretto.com\/public\/x191\/11749\/PLEADINGS\/1174902142380000000129.pdf\" data-v-f87c67ca=\"\">court documents<\/a> seeking to recover millions of dollars it says were fraudulently transferred from the company’s founder and former CEO Alex Mashinsky, his wife and other former senior executives.","<em data-v-f87c67ca=\"\">Correction: story updated to clarify that larger creditors will receive tokenized shares.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Provenance Blockchain","content":"ORGANIZATION"},{"type":"King Street","content":"ORGANIZATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"Beowulf Energy","content":"ORGANIZATION"},{"type":"$5,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Celsius Network","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Alex Mashinsky","content":"PERSON"},{"type":"Jason New","content":"PERSON"},{"type":"$45 million","content":"MONEY"},{"type":"Blackstone","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"$55 million","content":"MONEY"},{"type":"millions of dollars","content":"MONEY"},{"type":"GSO Capital Partners","content":"ORGANIZATION"},{"type":"NovaWulf&nbsp; Digital Management","content":"ORGANIZATION"},{"type":"Ponzi","content":"PERSON"}],"hashtag":["BANKRUPTCY FILINGS","INVESTMENT FIRMS","LAWSUITS","PRIVATE COMPANY M&AMP;A"],"authors":["Benjamin Robertson","The Block"]}