{"summary":"Web3 game developer and publisher Xterio has raised $40 million at a $300 million valuation.\nThe funding was raised via a SAFT sale, Xterio co-founder Jeremy Horn told The Block.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/166447\/web3-game-developer-xterio-raises-40-million-in-saft-sale","publishDate":"2022-08-30T07:00:11","id":546,"type":null,"title":"Web3 game developer Xterio raises $40 million in SAFT sale","category":["Gaming and Metaverse"],"content":["Xterio, a web3 game developer and publisher, has raised $40 million in a funding round co-led by video game developer FunPlus, venture capital firm Makers Fund, FTX Ventures and blockchain gaming platform XPLA.&nbsp;","Other investors in the round included Animoca Brands, HashKey, Foresight Ventures, Infinity Ventures Crypto and Matrix Partners, Xterio announced Tuesday. This was Xterio's first fundraise and realized via a simple agreement for future tokens (SAFT) sale, co-founder Jeremy Horn told The Block in an interview. The round brings Xterio's valuation to $300 million, he added.","While the current market downturn meant Xterio had to work to be \"extra convincing\" to investors, the firm ultimately closed an oversubscribed round and didn't have to lower its valuation, said Horn, a former FunPlus and Jam City executive.","With fresh capital in hand, Xterio plans to develop and publish <a href=\"https:\/\/www.theblock.co\/category\/gaming-and-metaverse\" data-v-f87c67ca=\"\">web3 games<\/a> and scale its team. Horn declined to comment on specifics of planned games but said they will be \"equal in quality to the best console games out there.\"&nbsp;","Horn also declined to comment on which blockchain Xterio is using for its native token but said it'll be a \"utility\" token to reward users and partners. Xterio will first publish its own games and then add partners' games in the future, said Horn.","Xterio aims to onboard regular web2 gamers into web3. Horn said Xterio is building its entire ecosystem around user participation. \"We are going to always have users participate in the development of games and be really transparent on what's happening on each game,\" he said.&nbsp;","Xterio is expected to release multiple games \"in the upcoming quarters\" for both mobile and browser interfaces.&nbsp;","There are currently over 60 people working for Switzerland-based Xterio and it plans to hire more in the near future, said Horn. Xterio is helmed by game executives from Electronic Arts, Activision Blizzard and Krafton. Its chief technology officer is co-founder of FunPlus, Yitao Guan.&nbsp;","\"Xterio has the right team, the right technology and the right approach to be builders in these early days of creating the next generation developer and publisher designed for the web3 era,\" said Chris Petrovic, chief business officer at FunPlus and a council member of the Xterio Foundation. \"They understand that ultimately the entertainment value of experiences must come first to truly deliver the promise of web3 in the long run.\""],"hashtag":["FUNDRAISING"]}