{"summary":"The DOJ responded to Sam Bankman-Fried&#x27;s intention to present an advice-of-counsel defense at his upcoming October trial.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/248084\/doj-sam-bankman-fried-advice-of-counsel-defense","publishDate":"2023-08-30T08:34:33","id":5464,"type":null,"title":"DOJ pushes for clarity on Sam Bankman-Fried&#x27;s advice-of-counsel defense","category":["LEGAL"],"content":["The U.S. Department of Justice (DOJ) responded to Sam Bankman-Fried's intention to present an advice-of-counsel defense at his upcoming October trial.","The government department requested the court to order the defendant to provide more comprehensive details regarding his defense strategy to be raised at trial, according to a legal <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.nysd.590940\/gov.uscourts.nysd.590940.239.0.pdf\" data-v-f87c67ca=\"\">filing<\/a> on Tuesday. Failing that, it asked the court to prevent certain types of questioning, evidence and arguments not relevant to the case.","The disgraced former FTX CEO <a href=\"https:\/\/www.theblock.co\/post\/236735\/judge-denies-motion-to-dismiss-most-charges-against-sam-bankman-fried\" data-v-f87c67ca=\"\">faces<\/a> over 100 years in prison if convicted on charges including fraud, over allegations that he and other FTX executives used billions of customer assets for their own failed investments. FTX <a href=\"https:\/\/www.theblock.co\/post\/188187\/the-ftx-bankruptcy-filings-are-a-doozy-we-bring-you-the-highlights\" data-v-f87c67ca=\"\">filed<\/a> for bankruptcy in November 2022.","The court previously ordered Bankman-Fried to notify the government if he planned to present such a defense on July 1. On Aug. 16, the defendant wrote to the government stating, “please take notice of our intent to rely on a defense of advice of counsel at trial.” The government informed the defense counsel that the notice was insufficiently detailed and moved to require additional disclosures.","On Aug. 23, lawyers for Sam Bankman-Fried <a href=\"https:\/\/www.theblock.co\/post\/246995\/bankman-fried-plans-to-place-partial-blame-on-previous-legal-advice-in-october-trial\" data-v-f87c67ca=\"\">said<\/a> they planned to argue that he was given legal advice on matters including auto-delete policies and loans to FTX and Alameda which made him believe he was “acting in good faith.” Specifically, lawyers representing jailed Bankman-Fried said they plan to “elicit evidence” that lawyers from Fenwick &amp; West LLP and in-house counsel were involved in “reviewing and approving” certain decisions.","However, the defense “declined to provide any additional information about the nature of the reliance on counsel, or to produce discovery as the government had requested,” U.S. Attorney Damian Williams wrote to Judge Lewis Kaplan in the filing.","The government argued that mere involvement of attorneys doesn't necessarily prove the defendant's innocence or good faith, citing several cases to highlight the importance of clarity in presenting an advice-of-counsel defense. In particular, the government pointed to the need for defendants to provide evidence that they genuinely sought legal advice, disclosed all relevant facts to their counsel and acted based on that advice.","In a response <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.nysd.590940\/gov.uscourts.nysd.590940.240.0.pdf\" data-v-f87c67ca=\"\">filed<\/a> Wednesday morning, Bankman-Fried’s current lawyer, Mark Cohen, said disclosures regarding the advice-of-counsel strategy were sufficient but added that his release was necessary to prepare his defense.","“At the present time, the defense is unable to adequately prepare for trial and prepare the defense, which is a violation of Mr. Bankman-Fried’s Sixth Amendment rights,” Cohen said.&nbsp;","“Internet access provided to Mr. Bankman-Fried two days a week is woefully inadequate, and the ability of counsel to consult with and discuss the defense with Mr. Bankman-Fried has proven to be cumbersome,” Cohen added.","Bankman-Fried’s defense also took issue with the government's late production of discovery materials, especially given the proximity to the trial date.","On Aug. 22, Bankman-Fried pleaded not guilty to seven counts, and his lawyer said the former billionaire was eating only peanut butter, bread and water in jail. Judge Kaplan <a href=\"https:\/\/ecf.nysd.uscourts.gov\/cgi-bin\/show_temp.pl?file=file0.362387245326442.pdf&amp;type=application\/pdf\" data-v-f87c67ca=\"\">granted<\/a> Bankman-Fried's request the following day to meet with his attorneys in person daily.","Bankman-Fried was sent to await trial in jail <a href=\"https:\/\/www.theblock.co\/post\/244540\/ftx-judge-says-hes-revoking-bail-for-bankman-fried-inner-city-press\" data-v-f87c67ca=\"\">earlier<\/a> this month after prosecutors accused him of witness tampering by leaking the private diary of a former colleague, Caroline Ellison, and using an encrypted messaging app to contact a potential witness.","Yesterday, the DOJ called for all seven expert witnesses that Sam Bankman-Fried has proposed for his October trial to be <a href=\"https:\/\/www.theblock.co\/post\/247821\/sam-bankman-fried-sbf-witnesses-doj\" data-v-f87c67ca=\"\">barred from testifying<\/a>.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Aug. 16","content":"DATE"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Kaplan","content":"PERSON"},{"type":"Damian Williams","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Fenwick &amp; West LLP","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"July 1","content":"DATE"},{"type":"November 2022","content":"DATE"},{"type":"Lewis Kaplan","content":"PERSON"},{"type":"Aug. 23","content":"DATE"},{"type":"Aug. 22","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Fried","content":"ORGANIZATION"},{"type":"Cohen","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"U.S. Department of Justice (DOJ","content":"ORGANIZATION"},{"type":"morning","content":"TIME"},{"type":"Bankman","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Mark Cohen","content":"PERSON"}],"hashtag":["FTX","SAM BANKMAN-FRIED"],"authors":["James Hunt","The Block"]}