{"summary":"The potential approval of a spot bitcoin ETF in the U.S. may not have a significant impact on the crypto market, according to JPMorgan.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/238316\/jpmorgan-bitcoin-etf-approval-comments","publishDate":"2023-07-07T08:19:21","id":5466,"type":null,"title":"JPMorgan says bitcoin ETF approval unlikely to be a game changer","category":["MARKETS"],"content":["While crypto enthusiasts eagerly await the approval of a spot bitcoin exchange-traded fund (ETF) in the United States, JPMorgan says such approval may not have the significant impact on the crypto market many anticipate.","\"The potential approval of physically backed bitcoin ETFs by the SEC [Securities and Exchange Commission] is unlikely to be a game changer for crypto markets,\" JPMorgan strategists led by Nikolaos Panigirtzoglou wrote in a report on Thursday. Several factors have led to JPMorgan casting doubt on the impact.","First, spot bitcoin ETFs have existed in Canada and Europe for some time but have failed to gain significant investor interest. Outflows from gold ETFs over the past year or so have also not benefited bitcoin funds overall, including futures ETFs, the analysts said.","While <a href=\"https:\/\/www.theblock.co\/post\/237085\/americans-want-a-spot-bitcoin-etf-coinbases-grewal-says\" data-v-f87c67ca=\"\">spot bitcoin ETFs<\/a> have some advantages over futures bitcoin ETFs, those benefits are \"rather marginal,\" according to JPMorgan analysts. Spot bitcoin ETFs offer a direct and potentially more secure way of gaining exposure to the world's first and largest cryptocurrency. They eliminate complexities related to custody and transfer of the cryptocurrency and also mitigate the basis risk associated with futures-based ETFs. (Basis risk is a deviation between the value of an investment and its underlying benchmark).","Spot bitcoin ETFs also have the potential to better reflect real-time supply and demand, bringing increased liquidity and improved price transparency, according to the analysts. However, the introduction of spot bitcoin ETFs may shift trading activity and liquidity from U.S. bitcoin futures markets \"to the extent spot bitcoin ETFs replace futures-based bitcoin ETFs,\" the analysts said.","The renewed race for a spot bitcoin ETF is underway. Several companies, including traditional finance giants BlackRock and Fidelity, are vying for approval and competing to offer investors access to the crypto market. The SEC has previously rejected all spot bitcoins ETFs in the past. This time there is growing optimism that the SEC may provide approval as one of its main previous concerns is assumed to be addressed as ETF filers have noted their plans to enter into \"surveillance-sharing agreements\" with exchanges such as <a href=\"https:\/\/www.theblock.co\/post\/237563\/blackrock-refile-for-spot-bitcoin-etf-naming-coinbase-as-surveillance-partner\" data-v-f87c67ca=\"\">Coinbase<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"Nikolaos Panigirtzoglou","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"SEC [Securities and Exchange Commission]","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"}],"hashtag":["BITCOIN","TRADFI BANKS"],"authors":["Yogita Khatri","The Block"]}