{"summary":"Starknet is going to launch its governance environment with a vote to deploy its latest protocol upgrade on the mainnet.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/220101\/starknet-governance-to-begin-with-vote-for-new-protocol-upgrade","publishDate":"2023-03-15T10:36:42","id":5467,"type":null,"title":"Starknet governance to begin with vote for new protocol upgrade","category":["CRYPTO ECOSYSTEMS"],"content":["Starknet DAO is set to begin its decentralized governance with the community’s inaugural vote to green light the launch of its latest protocol upgrade, called Starknet Alpha v0.11.0.","This first phase of Starknet’s governance will <a href=\"https:\/\/community.starknet.io\/t\/starknet-foundation-delegation-for-the-first-vote\/11820\" data-v-f87c67ca=\"\">focus<\/a> on protocol upgrades. Community members will be able to vote on every protocol upgrade released by the <a href=\"https:\/\/www.theblock.co\/post\/208731\/starkware-open-sources-prover-technology-for-ethereum-layer-2-network\" data-v-f87c67ca=\"\">Ethereum scaling solution<\/a>. Every successful vote will lead to the launch of a new protocol version on the Starknet mainnet.","The Starknet Foundation says it will be playing a pivotal role in kickstarting the DAO’s governance. <a href=\"https:\/\/www.theblock.co\/post\/185109\/starknet-reveals-new-governance-entity-starknet-foundation\" data-v-f87c67ca=\"\">Established in October 2022<\/a>, the Starknet Foundation is in charge of leading grants and funding for the Ethereum scaling protocol. The foundation plans to share some of its voting power with several independent delegates. This move is to ensure a diverse governance environment for the project. Other participants in this early governance period will include investors, core contributors, and other delegates.","The DAO has chosen March 21 as the start of the voting period for its next upgrade. The vote, which will happen via Snapshot, is expected to take six days to complete.","Starknet’s planned protocol upgrade will be launched on the Goerli testnet while the vote is ongoing. This will then be followed by a mainnet launch if the vote passes.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March 21","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Starknet Foundation","content":"ORGANIZATION"},{"type":"October 2022","content":"DATE"}],"hashtag":["ETHEREUM","STARKNET"],"authors":["Osato Avan-Nomayo","The Block"]}