{"summary":"Robinhood&#x27;s acquisition of crypto app Ziglu faces regulatory uncertainty.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/182459\/robinhood-wont-close-ziglu-acquisition-this-quarter","publishDate":"2022-11-02T21:17:05","id":5475,"type":null,"title":"Robinhood won&#x27;t close Ziglu acquisition this quarter","category":["MERGERS & ACQUISITIONS"],"content":["Robinhood will not close its long-awaited acquisition of UK-based crypto startup Ziglu this quarter.&nbsp;","Chief Financial Officer Jason Warnick also raised the possibility that the deal may not close at all on the company's third-quarter earnings call on Nov. 2.&nbsp;","“While the parties are working hard at it, there’s some regulatory uncertainty as to whether the deal will close,\" Warnick told investors and analysts. \"What we know at this point is that the deal won’t close this quarter.”","The retail investing platform <a href=\"https:\/\/www.theblock.co\/post\/164249\/robinhood-more-than-halves-acquisition-offer-for-uk-fintech-ziglu\" data-v-f87c67ca=\"\">slashed<\/a> its acquisition offer for Ziglu in August, decreasing its value from $170 million to $72.5 million. Robinhood and Ziglu first <a href=\"https:\/\/www.theblock.co\/linked\/142501\/robinhood-to-acquire-crypto-wallet-and-card-startup-ziglu\" data-v-f87c67ca=\"\">announced<\/a> the deal in April.&nbsp;","The New York State Department of Financial Services <a href=\"https:\/\/www.theblock.co\/post\/160891\/robinhoods-crypto-division-slapped-with-30-million-fine\" data-v-f87c67ca=\"\">slapped<\/a> Robinhood's crypto division with a $30 million fine in August for alleged violations relating to anti-money laundering, consumer protection and cybersecurity regulations.","Despite the uncertainty hanging over the Ziglu acquisition, Robinhood executives underscored that expansion outside the U.S. still is in the works. The company plans to start offering its Robinhood Wallet internationally \"early next year.\"","Menlo Park, California-based Robinhood launched its self-custody web3 wallet to 10,000 beta customers in late September. The company's waitlist is more than 1 million people long, Robinhood's wallet website <a href=\"https:\/\/robinhood.com\/web3-wallet\/\" data-v-f87c67ca=\"\">shows<\/a>.","Executives on the earnings call said the company will roll out the wallet to more people in coming months. Robinhood expects to make the wallet \"generally available\" in early 2023 and will likely add NFT capabilities. One in-demand feature from crypto enthusiasts is the ability to view NFTs in the wallet app.","\"I think trading NFTs in-app is a little bit complicated with the recent Apple guidance, so we're keeping an eye on that, Robinhood CEO Vlad Tenev said during the call. \"But I think it's highly likely that we'll add the ability to view NFTs and for people to custody them.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Vlad Tenev","content":"PERSON"},{"type":"this quarter","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"$170 million","content":"MONEY"},{"type":"Warnick","content":"PERSON"},{"type":"$30 million","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$72.5 million","content":"MONEY"},{"type":"California","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"Nov. 2","content":"DATE"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Jason Warnick","content":"PERSON"},{"type":"New York State Department of Financial Services","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"August","content":"DATE"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["ROBINHOOD"],"authors":["Kristin Majcher","The Block"]}