{"summary":"The token will be used to reward users, said the exchange, which has struggled to regain market share in recent years.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/184038\/bitmex-to-launch-trading-of-its-bmex-token-on-friday","publishDate":"2022-11-08T00:54:55","id":5477,"type":null,"title":"Bitmex to launch trading of its BMEX token on Friday","category":["EXCHANGES"],"content":["Crypto exchange Bitmex is set to launch trading of its native BMEX token on Nov. 11 after first announcing it last year.","Bitmex said on Tuesday that the token will be used to reward customers, as the company aims to regain market share in the derivatives space. Rewards will be offered in the form of trading fee discounts, withdrawal fee waivers, improved staking rewards and access to new products and services, said Bitmex.","The exchange first announced the BMEX token in December last year and started airdropping to users in February. Bitmex today said it has airdropped \"millions of BMEX to over 80,000 traders\" since February. In June, the company delayed the listing of its token, citing \"market conditions.\" But now is the right time to launch, according to Bitmex's chief marketing officer Benjamin Usinger, who said in a statement that the exchange \"would like to contribute to growth in liquidity and revitalize the crypto markets.\"","Bitmex will list the BMEX\/USDT pair on its recently launched spot exchange on Friday, and also launch two new perpetual swaps — BMEXUSDT and BMEXUSD — on its derivatives platform.","The token listing comes with Bitmex, once a top crypto derivatives exchange, struggling to regain its standing in the market after a number of legal battles in the last few years. Bitmex once claimed around 35% of the open interest across bitcoin futures, according to data from The Block Research. Now it only holds around 2% of market share, with other players eating its lunch.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/futures\/share-of-open-interest-across-bitcoin-futures-monthly\/embed\" title=\"Share of Open Interest across Bitcoin Futures\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","It remains to be seen whether the token listing will help Bitmex return to its former glory. The exchange recently <a href=\"https:\/\/www.theblock.co\/post\/179580\/bitmex-ceo-alexander-hoptner-steps-down-with-immediate-effect\" data-v-f87c67ca=\"\">lost<\/a> its CEO Alexander Hoptner and <a href=\"https:\/\/www.theblock.co\/post\/181814\/crypto-exchange-bitmex-cuts-part-of-workforce-following-ceo-departure-exclusive\" data-v-f87c67ca=\"\">cut<\/a> some of its staff as part of a plan to refocus on the crypto derivatives market.","<em data-v-f87c67ca=\"\">Update: An earlier version of this story stated that Bitmex recently cut 30% of its staff. A Bitmex spokesperson said the percentage is in fact lower, but did not specify an exact figure. &nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alexander Hoptner","content":"PERSON"},{"type":"USDT","content":"ORGANIZATION"},{"type":"2%","content":"PERCENT"},{"type":"Bitmex","content":"PERSON"},{"type":"December last year","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"February","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"June","content":"DATE"},{"type":"Bitmex","content":"ORGANIZATION"},{"type":"35%","content":"PERCENT"},{"type":"Benjamin Usinger","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Nov. 11","content":"DATE"},{"type":"Bitmex spokesperson","content":"ORGANIZATION"}],"hashtag":["BITMEX"],"authors":["Yogita Khatri","The Block"]}