{"summary":"The first phase of GNO becoming a DAI collateral has passed as the MakerDAO governance voted yes to the proposal.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/171316\/makerdao-governance-votes-yes-to-adding-gnosisdao-token-as-collateral-for-dai","publishDate":"2022-09-20T10:35:41","id":5478,"type":null,"title":"MakerDAO governance votes yes to adding GnosisDAO token as collateral for DAI","category":["GOVERNANCE"],"content":["The MakerDAO Governance has voted in favor of a <a href=\"https:\/\/forum.makerdao.com\/t\/gno-mip6-collateral-onboarding-application-gnosisdao\/17321\" data-v-f87c67ca=\"\">proposal<\/a> to add GnosisDAO (GNO) token as new collateral for the DAI stablecoin.","Details on the voting <a href=\"https:\/\/vote.makerdao.com\/polling\/QmcUnpWV\" data-v-f87c67ca=\"\">page<\/a> show that participants in favor of the move voted with a combined total of almost 70,000 Maker (MKR) tokens. This amounted to a 77% approval rating for the proposal.","The positive outcome of the vote by the DAO does not mean GNO will immediately become collateral for DAI. Core Units will conduct risk, technical, and oracle assessments for GNO, per the proposal document. These assessments will be followed by another vote — Maker token holders and delegates will decide whether to execute the deployment of GNO as a new collateral type on the Maker protocol.","","","Once approved, users will be able to deposit GNO in the Maker protocol and mint DAI against it, a spokesperson for MakerGrowth told The Block.","Meanwhile,&nbsp;GnosisDAO reportedly plans to create 30 million DAI using GNO from its $<a href=\"https:\/\/deepdao.io\/organization\/529571a8-5816-47ff-a50e-1e6372e2324b\/organization_data\/finance\" data-v-f87c67ca=\"\">972 million<\/a> treasury as collateral. This is scheduled to happen within the first year GNO being included as a collateral type for DAI. According to the proposal, GnosisDAO plans to use the DAI generated by the GNO collateral vault to boost the development of the Gnosis chain.","According to the proposal, MakerDAO stands to benefit from adding GNO to DAI’s multi-collateral suite.","DAI is the main stablecoin on <a href=\"https:\/\/www.theblock.co\/post\/142701\/gnosis-chain-makes-key-upgrade-to-prevent-potential-security-attacks\" data-v-f87c67ca=\"\">Gnosis chain<\/a> — an EVM-compatible blockchain created by Gnosis. It is also used to pay transaction fees on the chain.","<em data-v-f87c67ca=\"\">This article has been updated to include a correction about the number of subsequent votes on the proposal and a comment from a MakerGrowth spokesperson.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"GNO","content":"ORGANIZATION"},{"type":"Gnosis","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"$<a href=\"https:\/\/deepdao.io\/organization\/529571a8-5816-47ff-a50e-1e6372e2324b\/organization_data\/finance\" data-v-f87c67ca=\"\">972 million","content":"MONEY"},{"type":"77%","content":"PERCENT"},{"type":"DAI","content":"ORGANIZATION"}],"hashtag":["DAI"],"authors":["Osato Avan-Nomayo","The Block"]}