{"summary":"Some believe Ethereum will consistently pay out 12% yield post Merge, but the current data suggests it will be much lower.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168309\/ethereums-staking-yield-after-the-merge-will-be-lower-than-expected","publishDate":"2022-09-10T08:55:29","id":5487,"type":null,"title":"Ethereum’s staking yield after The Merge will be lower than expected","category":["THE MERGE"],"content":["The Merge is expected to occur within the next two weeks, and one of the overarching discussions has been around what yield to expect on Ethereum once it moves to proof of stake.","There is a bit of a misconception that Ethereum staking will pay out yield as high as 12% post Merge. This is largely based on historical data that has drastically changed over the past year, such as the amount of ETH staked. The current network usage and staking data give a much lower yield number.","This isn’t to say the yield couldn’t reach the higher estimates. It's contingent on several factors, such as the burn amount and network activity. But unless there’s a big increase in market activity, those numbers are unlikely in the short term.","Let’s first understand where Ethereum yield comes from and how the yield is determined.","In order for proof of stake to work, ETH needs to be staked in order to run a validator. Validators create and verify new blocks, and without them the network couldn’t operate.","The yield paid to validators comes from: block rewards, transaction tips paid for prioritized transactions, and tips related to maximum extractable value (MEV).","Block rewards are shared by all the validators. Ethereum’s yield from block rewards is determined by the amount of ETH staked.","<span data-v-f87c67ca=\"\">How the yield will drop if there's more ETH staked on the network. Image: <a href=\"https:\/\/docs.ethhub.io\/ethereum-roadmap\/ethereum-2.0\/eth-2.0-economics\/\" data-v-f87c67ca=\"\">EthHub<\/a>.<\/span>","Transaction tips are also distributed to validators. During periods of network congestion, users can tip validators to incentivize their transactions getting prioritized and chosen over others.","MEV rewards are the final component to Ethereum yield. Validators that post new blocks can reorder transactions, and users may try to pay validators for a <a href=\"https:\/\/www.google.com\/url?q=https:\/\/cryptoslate.com\/how-flashbots-fighting-mev-extraction-help-the-ethereum-network\/&amp;sa=D&amp;source=docs&amp;ust=1662564997280407&amp;usg=AOvVaw1sLEZBT6KWj_FbFGSJBddX\" data-v-f87c67ca=\"\">specific ordering<\/a> that they can profit from.","According to <a href=\"https:\/\/dune.com\/hildobby\/ETH2-Deposits\" data-v-f87c67ca=\"\">Dune Analytics<\/a>, there is approximately 13.51 million ETH staked, roughly 11.3% of the total supply. This would put validator block rewards at approximately 4%.","The other contributing factors to ETH staking yield, MEV and transaction tips, are largely dependent on network usage.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/transactions-on-the-ethereum-network-daily\/embed\" title=\"Transactions on the Ethereum Network (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","More transactions and higher transaction costs result in larger tips. This also results in higher amounts of gross MEV profit, and more ETH burned.","Throughout the past year, transaction prices sometimes were as high as $200 for a token swap. Compared to today, that number has drastically reduced to around $5 to $10. This suggests that the extra revenue will be a lot lower than it was in the past.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/burned-eth-after-eip-1559-daily\/embed\" title=\"Burned ETH after EIP-1559 (Daily)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Selini Capital SIO Jordi Alexander <a href=\"https:\/\/newsletter.banklesshq.com\/p\/is-the-merge-overhyped?triedSigningIn=true\" data-v-f87c67ca=\"\">published his<\/a> predictions for Ethereum’s staking APY in 2023 based on current data.","By 2023, he expects Ethereum validators will receive roughly 3.2% APY, accounting for block rewards, MEV, and transactions tips.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$5","content":"MONEY"},{"type":"EthHub","content":"ORGANIZATION"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"$10","content":"MONEY"},{"type":"Ethereum","content":"PERSON"},{"type":"12%","content":"PERCENT"},{"type":"$200","content":"MONEY"},{"type":"Jordi Alexander","content":"PERSON"},{"type":"3.2%","content":"PERCENT"},{"type":"11.3%","content":"PERCENT"}],"hashtag":["ETHEREUM","MEV","STAKING"],"authors":["Mike Truppa","The Block"]}