{"summary":"Issuer Valkyrie is raising for an upcoming venture capital fund focused on early stage middleware and &quot;web 2.5&quot; firms.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/158389\/valkyrie-to-launch-venture-capital-fund","publishDate":"2022-07-19T09:00:18","id":5491,"type":null,"title":"Valkyrie to launch venture capital fund","category":["VENTURE CAPITAL"],"content":["Issuer Valkyrie is raising for an upcoming venture capital fund focused on early stage \"web 2.5\" firms.","&nbsp;It's brought a <a href=\"https:\/\/www.theblock.co\/linked\/142768\/valkyrie-launches-new-trust-holding-proof-of-stake-tokens\" data-v-f87c67ca=\"\">number<\/a> of<a href=\"https:\/\/www.theblock.co\/linked\/127856\/valkyrie-launches-innovative-balance-sheet-etf\" data-v-f87c67ca=\"\"> financial products<\/a> to <a href=\"https:\/\/www.theblock.co\/linked\/145016\/valkyrie-launches-new-trust-holding-avax\" data-v-f87c67ca=\"\">market<\/a> in recent months, but now it's working on a different kind of fund. Valkyrie Ventures is the firm's first foray into venture capital. It brought in Lluis Pedragosa to head the venture. Pedragosa comes to Valkyrie from VC firm Team8, which focused on enterprise technologies, artificial intelligence and fintech.","The firm will geographically focus on startups in the US and Israel, both areas of expertise for Pedragosa. The plan is to invest in startups seeking to bridge the gap to web 3 for the average user, a sector Pedragosa and Valkyrie have dubbed \"web 2.5.\" Filling in the gap between the familiar web 2 user experience and connection to web 3 assets is the path to the next billion users of blockchain, according to Pedragosa.","\"I'm looking for companies that provide a web 2.0 user experience with an underlying crypto native infrastructure of web 3 so people can use the assets without even knowing they're using blockchain,\" he said. \"The point is the user doesn't need to know that all this stuff is web 3 or blockchain, people generally don't want to know.\"","In addition to firms creating that user experience, the fund also plans to invest in \"middleware\" startups – those dealing with \"the picks and shovels of blockchain,\" as Pedragosa put it. Essentially, firms building secure blockchain infrastructure. Most firms have to retain full-stack developers in order to build crypto products. Pedragosa says he's looking for startups that lower that barrier.","\"There's a lot to be done in security authentication, compliance, data management, governance payments and transactions,\" he said.","The fund will look to raise somewhere between $30 million and $50 million. The announcement comes amid a significant downturn for the industry, one in which a number of firms are slashing their valuations, declaring <a href=\"https:\/\/www.theblock.co\/post\/155990\/crypto-broker-voyager-digital-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">bankruptcy<\/a> or even closing up shop. But that's not a huge concern, according to Pedragosa. He said winters have historically been a time for building in the industry, and past seasons have cleaned out those that built for the wrong incentives.","Though Valkyrie Ventures was conceived before the downturn, Pedragosa said the thesis hasn't had to change much.","\"The types of companies we're looking for, it's for the long term of blockchain, so ones that bring users to blockchain, the infrastructure, all of that is more for the long term,\" he said. \"I think that doesn't change over time.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Pedragosa","content":"PERSON"},{"type":"Israel","content":"LOCATION"},{"type":"Pedragosa","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Valkyrie Ventures","content":"ORGANIZATION"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Lluis Pedragosa","content":"LOCATION"},{"type":"$30 million","content":"MONEY"},{"type":"$50 million","content":"MONEY"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}