{"summary":"San Francisco-based crypto-native fund Momentum Capital has secured a $10 million investment from Canada&#x27;s BM Fund, according to an announcement.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246511\/momentum-capital-apple-crypto-investment","publishDate":"2023-08-21T07:58:00","id":5493,"type":null,"title":"Momentum Capital looking for &#x27;next Apple in crypto&#x27; after $10 million investment","category":["VENTURE CAPITAL"],"content":["San Francisco-based crypto-native fund Momentum Capital has secured a $10 million investment from Canada's BM Fund.&nbsp;","The investment was finalized in July 2023, according to a <a href=\"https:\/\/chainwire.org\/2023\/08\/21\/momentum-capital-celebrates-10-million-investment-from-bm-fund\/\" data-v-f87c67ca=\"\">statement<\/a> released today.","The infusion of capital will, according to the announcement, be used to expand the team and support early-stage web3 projects to help the fund in its <a href=\"https:\/\/mt.capital\/\" data-v-f87c67ca=\"\">mission<\/a> to find \"the next 'Apple' in crypto.\"","Momentum Capital’s performance during volatile market phases influenced the move, according to BM Fund. \"Our decision to invest in Momentum Capital during bear markets underscores their proficiency,\" BM Fund Founder Carmen said.","Looking ahead to the next stage in the crypto market cycle, Momentum said it was ready to amplify its focus on web3 opportunities.&nbsp;","\"Momentum Capital remains devoted to investing in and nurturing web3 projects of intrinsic value,\" Momentum Capital Managing Partner Gary said. \"As we navigate the currents of the market in the next six to twelve months, our focus will extend to nurturing global builders, with a keen emphasis on web3 infrastructure, regional web3 opportunities and web3 applications.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"Gary","content":"PERSON"},{"type":"Canada","content":"LOCATION"},{"type":"Carmen","content":"PERSON"},{"type":"Momentum Capital","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$10 million","content":"MONEY"},{"type":"July 2023","content":"DATE"}],"hashtag":["STRATEGIC INVESTMENTS"],"authors":["James Hunt","The Block"]}