{"summary":"Fireblock researchers claimed the vulnerability could have exposed users&#x27; private keys.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/220804\/fireblocks-reported-vulnerability-now-patched-in-bitgo-tss-wallets","publishDate":"2023-03-17T09:00:46","id":5495,"type":null,"title":"Fireblocks claims it detected vulnerability, now patched, in competitor BitGo&#x27;s TSS wallets","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Researchers at Fireblocks <a href=\"https:\/\/www.fireblocks.com\/blog\/bitgo-wallet-zero-proof-vulnerability\" data-v-f87c67ca=\"\">claim<\/a> in a report they detected a critical vulnerability in BitGo's Threshold Signature Scheme (TSS) wallet type used for multi-party computation (MPC).&nbsp;<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">According to Fireblocks' allegations, the said vulnerability resulted from a missing implementation of mandatory zero-knowledge proofs in the TSS wallet protocol.&nbsp;<\/span>","Fireblocks also claimed and <a href=\"https:\/\/www.fireblocks.com\/blog\/bitgo-wallet-zero-proof-vulnerability\" data-v-f87c67ca=\"\">demonstrated<\/a> in the report that the vulnerability allowed them to extract the private key of a BitGo TSS wallet on the Ethereum mainnet.","<span data-v-f87c67ca=\"\">BitGo and FireBlocks compete in providing custody and wallet services to institutional clients.<\/span>","BitGo has criticized Fireblocks' finding, <a href=\"https:\/\/blog.bitgo.com\/our-response-141b240aef96\" data-v-f87c67ca=\"\">calling<\/a> it a \"publicity stunt\" that attempts to create fear and damage BitGo's reputation. It claimed that the wallet type in question was still in early access and had only been made available to 20 developers. BitGo added it was pursuing legal remedies against Fireblocks.","\"None of our clients were using this type of wallet to store their assets. Because the wallet was in an early-access phase, it’s only available to 20 developers who are fully aware of the risks of using it, and several of those 20 developers are BitGo employees and contributors,\" a BitGo spokesperson said.","BitGo claimed that the issue had already been <a href=\"https:\/\/github.com\/BitGo\/BitGoJS\/blob\/master\/modules\/sdk-core\/src\/bitgo\/utils\/tss\/ecdsa\/ecdsa.ts#L31\" data-v-f87c67ca=\"\">documented<\/a> in their open-source code on GitHub and was publicly known before Fireblocks had flagged it.","<em data-v-f87c67ca=\"\">The article was updated to add comments from BitGo.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Fireblocks","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"MPC","content":"ORGANIZATION"},{"type":"TSS","content":"ORGANIZATION"},{"type":"GitHub","content":"ORGANIZATION"}],"hashtag":["EXPLOITS"],"authors":["Vishal Chawla","The Block"]}