{"summary":"Investment bank Cowen&#x27;s digital asset unit, launched last year, is closing down.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232750\/investment-bank-cowens-digital-asset-unit-is-shutting-down","publishDate":"2023-05-31T14:15:02","id":5496,"type":null,"title":"Investment bank Cowen&#x27;s digital asset unit is shutting down","category":["COMPANIES"],"content":["Cowen Digital, the digital asset unit launched by investment bank Cowen last year, is closing its doors.","In a message to clients obtained by The Block, Cowen Digital said that Wednesday \"would be the last day for the team here at Cowen Digital.\"","\"From its inception in early months of 2021, our goal has been to build a premiere, full-service platform to service the entire life-cycle of digital asset investing,\" the&nbsp; Cowen Digital team said, suggesting&nbsp;it would try to build such a service under a new roof, though the statement offered few details on how that ambition might be realized.&nbsp;","\"We will continue to try and fulfill that endeavor, but will have to do so in a different home,\" the team said. \"We are grateful for the TD Cowen senior management in allowing us to incubate this business and support its growth, internally and externally.\"","The digital asset unit <a href=\"https:\/\/www.theblock.co\/linked\/139032\/investment-bank-cowen-launches-digital-assets-division\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">was launched<\/a> in March 2022 as part of a bid to woo institutional clients. Cowen Digital's launch was part of a broader wave aimed at capturing institutional interest.","TD acquired Cowen in March in a deal announced last summer by the two firms.&nbsp;","A representative for Cowen did not immediately respond to an emailed request for comment.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March","content":"DATE"},{"type":"TD Cowen","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Cowen Digital","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"last summer","content":"DATE"},{"type":"Cowen","content":"ORGANIZATION"},{"type":"March 2022","content":"DATE"}],"hashtag":["INVESTMENT FIRMS"],"authors":["Michael McSweeney","Frank Chaparro","The Block"]}