{"summary":"The Singapore-based firm has been trying to sell its claim to FTX&#x27;s funds to distressed asset buyers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/194878\/qcp-capital-ftx-exposure","publishDate":"2022-12-15T11:45:00","id":5499,"type":null,"title":"Crypto trading firm QCP Capital has at least $97 million stuck on FTX: Sources","category":["INSTITUTIONAL INVESTORS"],"content":["QCP Capital, a crypto trading firm based in Singapore, has at least $97 million stuck on FTX after the crypto exchange filed for bankruptcy last month.","In an effort to recoup some cash, QCP is attempting to sell a claim on the frozen funds to distressed asset buyers, two sources with knowledge of the matter told The Block.","Last month, QCP <a href=\"https:\/\/twitter.com\/QCPCapital\/status\/1590955395195207680\" data-v-f87c67ca=\"\">said<\/a> it has exposure to FTX but did not disclose the amount. The firm at the time said it had active trading positions on FTX and was able to withdraw \"a substantial amount of assets\" while leaving some stuck.&nbsp;","\"We have sufficient equity to absorb the impairment from the position,\" a QCP spokesperson said, while declining to comment on the value of the frozen funds. \"The impairment does not impact our clients nor our counterparties. Withdrawals remain open and trading continues as usual. Our business remains profitable and healthy.\"","QCP Capital operates a 24\/7 trading desk with a focus on crypto derivatives. The firm, which also engages in proprietary trading and offers market-making services, says it has handled trades worth nearly $38 billion so far this year. QCP is currently an exempt payment services provider pending licensing from the Monetary Authority of Singapore as a major payments institution providing crypto services.","QCP is one of many companies to fall afoul of FTX's sudden collapse. <a href=\"https:\/\/www.theblock.co\/post\/184766\/multicoin-capital-hit-by-ftx-collapse-with-10-of-its-funds-aum-stuck-on-the-exchange\" data-v-f87c67ca=\"\">Multicoin Capital<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/188335\/genesis-block-hk-has-more-than-50-million-stuck-on-ftx-source\" data-v-f87c67ca=\"\">Genesis Block HK<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/186306\/crypto-hedge-fund-galois-capital-says-half-of-funds-stuck-on-ftx-ft\" data-v-f87c67ca=\"\">Galois Capital<\/a> reportedly all also have funds stuck on the exchange. The impact on Genesis Block HK was so significant that the firm shut down its over-the-counter trading business last week after nearly 10 years.","Contagion from the implosion of FTX has spread far and wide in the crypto world. FTX filed for bankruptcy protection on Nov. 11, leaving about 1 million creditors in the lurch. The exchange owes its top 50 creditors alone $3.1 billion, according to court filings.","Some FTX creditors have already sold their claims at knock-down prices to avoid a likely years-long bankruptcy process, as The Block <a href=\"https:\/\/www.theblock.co\/post\/193560\/ftx-distressed-asset-investors\" data-v-f87c67ca=\"\">reported<\/a> last week. Apollo Global Management and Attestor are among the distressed asset investors to have held conversations about snapping up FTX claims. Thomas Braziel's 507 Capital has already purchased several claims from hedge funds for cents on the dollar.&nbsp;","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$3.1 billion","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Singapore","content":"LOCATION"},{"type":"QCP","content":"ORGANIZATION"},{"type":"$38 billion","content":"MONEY"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$97 million","content":"MONEY"},{"type":"Thomas Braziel","content":"PERSON"},{"type":"Nov. 11","content":"DATE"},{"type":"Galois Capital","content":"ORGANIZATION"}],"hashtag":["FTX","HEDGE FUNDS","INVESTMENT FIRMS"],"authors":["Benjamin Robertson","Yogita Khatri","The Block"]}