{"summary":"The Ethereum community is worried that The Merge could lead to censorship on its base layer — and want to fight against it.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/169508\/ethereum-is-grappling-with-the-risk-of-censorship-after-the-merge","publishDate":"2022-09-13T09:30:48","id":550,"type":null,"title":"Ethereum is grappling with the risk of censorship after The Merge ","category":["TECHNOLOGY"],"content":["<span data-v-f87c67ca=\"\">Last month, the US Office of Foreign Assets Control (OFAC)<\/span> <a href=\"https:\/\/home.treasury.gov\/news\/press-releases\/jy0916\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">blacklisted<\/span><\/a><span data-v-f87c67ca=\"\"> decentralized crypto mixer Tornado Cash. The development marked the first time for the US government to sanction the use of a smart contract.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The ripple effects of this move have been critical for Ethereum with many stakeholders taking actions to comply with the sanctions. Circle, dYdX, GitHub, Infura, Oasis and Alchemy all took steps by blocking sanctioned addresses — and related ones — from accessing their products and services.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The situation has also made Ethereum supporters and developers worry that these steps portend a more problematic future, one which might see the network become vulnerable to censorship.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">When Ethereum transitions to proof of stake — and validators become the ones processing transactions on the network — it’s possible that those who run these validators could participate in censoring certain transactions to comply with current or future sanctions. Doing so, the validators could potentially damage Ethereum’s status as a neutral technology.<\/span> It's an issue so concerning that even one of Ethereum's biggest supporters would abandon the whole project if it were to happen.","<span data-v-f87c67ca=\"\">\"If the Ethereum base-layer ends up engaging in permanent censorship then I will consider the Ethereum experiment a failure and I will move on,\" EthHub co-founder <a href=\"https:\/\/www.theblock.co\/post\/169507\/the-merge-anthony-sassano-explains-why-ethereums-final-boss-is-still-the-nation-state\" data-v-f87c67ca=\"\">Anthony Sassano<\/a>, one of Ethereum’s biggest advocates,<\/span> <a href=\"https:\/\/twitter.com\/sassal0x\/status\/1559357892645437440\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\"> on Twitter.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">After The Merge, Ethereum will be running on a proof-of-stake consensus mechanism. Gone will be the miners and the new kings in town will be validators — those that cough up large amounts of ETH and process new transactions, knowing that if they act maliciously, they could see their staked tokens get slashed.<\/span>","<span data-v-f87c67ca=\"\">Beacon Chain Staking Depositors | Source: Dune Analytics<\/span>","<span data-v-f87c67ca=\"\">Among the largest validators include crypto firms like Coinbase, Kraken, Binance, Staked.us, Bitcoin Suisse, stakefish, and Figment, all of which offer staking services to their users to let them earn staking rewards. <\/span><span data-v-f87c67ca=\"\">These firms have become so popular that they look after nearly<\/span> <a href=\"https:\/\/dune.com\/hildobby\/ETH2-Deposits\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">40%<\/span><\/a><span data-v-f87c67ca=\"\"> of ether deposited by validator nodes on the Beacon Chain. <\/span>","<span data-v-f87c67ca=\"\">There's also Lido Finance, a liquid staking protocol that is responsible for more than 30% of ether deposits on the Beacon Chain and remains a potential point of centralization. That said, it doesn't serve as a single validator but makes use of a range of validators like those mentioned above.<\/span>","<span data-v-f87c67ca=\"\">If these validators agreed to comply with the US sanctions, they possess enough power for protocol-level censorship, with the Ethereum community being forced to support validators that they might disagree with. Worse, due to the design of Beacon Chain, users can't un-stake their ether until the Shanghai upgrade, which is another 6-12 months after The Merge.<\/span>","<span data-v-f87c67ca=\"\">Ethereum co-founder Vitalik Buterin said in a <\/span><a href=\"https:\/\/www.youtube.com\/watch?v=jJaCaS0WbIw\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">developer call<\/span><\/a><span data-v-f87c67ca=\"\"> on August 18 that base layer censorship can come in two forms with different amounts of probability. <\/span>","<span data-v-f87c67ca=\"\">The first type is when certain validators choose to exclude or filter sanctioned transactions within the <\/span><span data-v-f87c67ca=\"\">blocks they propose themselves. This scenario, according to Buterin, can lead to temporary censorship and transactions may get delayed as they wait to be finalized. <\/span>","<span data-v-f87c67ca=\"\">As long as some validators don't partake in censorship, those transactions will eventually get picked up in the subsequent blocks. The only issue will be that it will take a longer time for transactions to be processed into blocks.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">After The Merge, validators will also have to sign and broadcast an attestation during every epoch on the network. This brings us to the second type of potential censorship where <\/span><span data-v-f87c67ca=\"\">validators (with more than 51% stake) decide to not attest blocks that contain sanctioned transactions. <\/span><span data-v-f87c67ca=\"\">The attestation-based censorship coming from a majority number of validators would create a soft fork of Ethereum or an alternative version of the Ethereum blockchain that does not include any sanctioned transactions. <\/span>","<span data-v-f87c67ca=\"\">The second scenario is classified as \"permanent censorship\" that may result in sanctioned transactions never getting finalized on the Ethereum network, according to Buterin. While Buterin said <\/span><span data-v-f87c67ca=\"\">that the likelihood of the second scenario is small, <\/span><span data-v-f87c67ca=\"\">Ethereum core developers are still discussing ways to resist chances of both temporary and permanent censorship.<\/span>","<span data-v-f87c67ca=\"\">At this stage, the fear of censorship coming from centralized validators is hypothetical, given how Ethereum validators haven’t clarified whether they will comply with sanctions. <\/span>","<span data-v-f87c67ca=\"\">Whatever may be the eventual result, Ethereum validators are going to face a tough time keeping Ethereum as a permissionless network and complying with regulations from OFAC. This would particularly be the case if the US regulators instructed them to not process transactions that have come from Ethereum mixers like Tornado.cash.<\/span>","<span data-v-f87c67ca=\"\">Coinbase CEO Brian Armstrong has clearly stated that his staking service, which has 14% control over all Beacon Chain validators, will not censor transactions. Armstrong<\/span><a href=\"https:\/\/twitter.com\/brian_armstrong\/status\/1560016827253551104?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1560016827253551104%7Ctwgr%5E9b3b0ece5edf38d9cd210f1206868662cf50a68c%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fdecrypt.co%2F107700%2Fcoinbase-ceo-wed-shut-down-ethereum-staking-if-threatened-by-regulators\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\"> he would prefer to stop the company’s staking service rather than engage in on-chain censorship on Ethereum.<\/span>","<span data-v-f87c67ca=\"\">Any existing validators on Beacon Chain can stop its duties by invoking a function called<\/span> <a href=\"https:\/\/lighthouse-book.sigmaprime.io\/voluntary-exit.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">voluntary exit process<\/span><\/a><span data-v-f87c67ca=\"\">. This means they would be able to stop staking their tokens without getting punished for doing so.<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, other staking providers such as Kraken and Bitcoin Suisse want to preserve censorship resistance. But these don’t have clear answers yet to how they would deal with sanctions.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"Kraken believes in the importance of crypto being censorship-resistant and permissionless. As a leading ETH validator we are carefully monitoring the discussion on the potential implications of Tornado Cash sanctions for validators,\" Marco Santori, chief legal officer at Kraken, told The Block in a statement.<\/span>","<span data-v-f87c67ca=\"\">A similar reply came from Bitcoin Suisse, whose spokesperson said: “Regarding the question of the handling of transactions involving sanctioned addresses, Bitcoin Suisse is currently reviewing the situation, as it involves complex legal, regulatory, and technical questions to which there are no clear answers yet.”<\/span>","<span data-v-f87c67ca=\"\">Since the issue has come to light, Ethereum’s core developers have discussed mitigation strategies to fight it. <\/span><span data-v-f87c67ca=\"\">In response to a Twitter discussion on the issue, Buterin<\/span><a href=\"https:\/\/twitter.com\/VitalikButerin\/status\/1559271315080679432\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">commented<\/span><\/a><span data-v-f87c67ca=\"\"> that he supported the idea of punishing validators who participate in censorship. <\/span>","Here Ethereum developers can manually slash validators that engage in censorship. This may result in censoring validators losing a portion of their collateral and is being explored as the primary defense against censorship by major staking providers. Ethereum's core developers are preparing to organize social enforcement and democratic slashing if these firms try to censor transactions.","<span data-v-f87c67ca=\"\">Then there are more stringent steps as well. For example, to counter a potential 51% censorship that leads to an alternative version of the Ethereum blockchain, developers can consider implementing what’s called a “user activated soft-fork (UASF).”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Lefteris Karapetsas, an Ethereum developer and founder of Rotki, the stake of validators participating in censorship can be taken away with a USAF. <\/span><span data-v-f87c67ca=\"\">“If a dishonest majority tries to attack the protocol with something like censoring, the approach is a UASF from the community to throw them out of the network and burn their stake,” Karapetsas told The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Another technique previously suggested by Vitalik Buterin as an anti-censorship tool is called<\/span> <a href=\"https:\/\/notes.ethereum.org\/@vbuterin\/pbs_censorship_resistance\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">proposer\/builder separation<\/span><\/a><span data-v-f87c67ca=\"\"> (PBS). This is a proposed proof-of-stake organizational structure where Ethereum block production is divided between two types of entities: proposers and builders, creating an on-chain check against transactional censorship.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bitcoin Suisse","content":"PERSON"},{"type":"EthHub","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Anthony Sassano","content":"PERSON"},{"type":"Beacon Chain","content":"LOCATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"USAF","content":"ORGANIZATION"},{"type":"Buterin","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Armstrong","content":"ORGANIZATION"},{"type":"Marco Santori","content":"PERSON"},{"type":"OFAC","content":"ORGANIZATION"},{"type":"Shanghai","content":"LOCATION"},{"type":"US Office of Foreign Assets Control (OFAC","content":"ORGANIZATION"},{"type":"Binance","content":"LOCATION"},{"type":"Infura","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Bitcoin Suisse","content":"ORGANIZATION"},{"type":"12","content":"DATE"},{"type":"GitHub","content":"ORGANIZATION"},{"type":"Lefteris Karapetsas","content":"PERSON"},{"type":"August 18","content":"DATE"},{"type":"51%","content":"PERCENT"},{"type":"Lido Finance","content":"ORGANIZATION"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"14%","content":"PERCENT"},{"type":"Rotki","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["CENSORSHIP","STAKING"],"authors":["Vishal Chawla","The Block"]}