{"summary":"A hastily formed collective is raising funds to bid on a rare print of the U.S. Constitution at an upcoming Sotheby’s auction.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/124288\/a-dao-is-trying-to-buy-a-rare-print-of-the-us-constitution","publishDate":"2021-11-14T15:13:33","id":5501,"type":null,"title":"A DAO is trying to buy a rare print of the US Constitution","category":["GOVERNANCE"],"content":["A group of individuals — seemingly a small team backed by a large community — is raising funds with a unique goal: to purchase one of the earliest prints of the U.S. Constitution.","The print is one of thirteen surviving copies of the Official Edition of the Constitution, out of the 500 that were first issued for submission to the Continental Congress. According to Sotheby’s, where the <a href=\"https:\/\/www.sothebys.com\/en\/digital-catalogues\/the-constitution-of-the-united-states\" data-v-f87c67ca=\"\">auction will take place<\/a>, this was the very first appearance of the Constitution in its final form. <a href=\"https:\/\/www.npr.org\/2021\/09\/27\/1040830033\/a-rare-first-edition-copy-of-the-constitution-will-be-up-for-auction?t=1636916452457\" data-v-f87c67ca=\"\">According to<\/a> Sotheby’s senior vice president Selby Kiffer, just two such copies are in private hands.","The group's plan is to underpin the effort with a decentralized autonomous organization or DAO. Community-led, with ownership usually dictated by owning a token or an NFT, decisions within DAOs are typically made through votes conducted by token holders. In recent times, some DAOs have amassed large treasuries and some have made notable purchases, such as buying a rare <a href=\"https:\/\/www.theblockcrypto.com\/linked\/121542\/nft-ownership-collaborative-pleasrdao-says-it-purchased-rare-wu-tang-clan-album\" data-v-f87c67ca=\"\">Wu-Tang Clan CD<\/a> for $4 million.","Appropriately dubbed ConstitutionDAO, the idea is to raise enough cryptocurrency in the form of ether or ETH to buy the copy of the U.S. Constitution at auction. Currently, ConstitutionDAO is not technically a DAO since there are no tokens binding everyone together or enabling them to control the future direction of the project, but that's where it's headed. In the interim, the group's efforts are taking place via a dedicated Discord server.","“In the ethos and spirit of Web3, we intend to purchase The Constitution and find a home for it among the world’s finest artifacts to be preserved and enjoyed by all. We the people plan to preserve the document for the people. The ownership, of course, will reside within the DAO. We'll fractionalize, NFT-ify, and mem-ify in the way that we do,” wrote Graham Novak, one of the architects of the project, on Discord.","On November 12, the Twitter account behind the project said that it was trying to raise $20 million. This is the higher end of Sotheby’s estimate of $15 to $20 million for the auction but it won't necessarily be enough.","Crypto exchange FTX has said <a href=\"https:\/\/twitter.com\/brett_ftxus\/status\/1459594027100262404?s=21\" data-v-f87c67ca=\"\">it would exchange<\/a> the cryptocurrency raised by this project into U.S. dollars to make the purchase, assuming the DAO wins the auction. In its Discord, ConstitutionDAO participant Julian Weisser said the group has been in talks with FTX but hasn’t officially decided to use the exchange for this purpose.","In a recent update, ConstitutionDAO participant Alice Ma said the group has been in talks with Sotheby’s staff. Ma explained how the auction house recommended that the DAO should either have a museum bid on its behalf or use a limited liability company to do so. The project is pursuing both suggestions, with the museum idea top of the list.","According to Ma's update, Sotheby’s will accept the project’s ether (ETH) balance as proof that it has the funds necessary to bid on the auction. The project hasn’t revealed how much money it has raised so far, or whether it has yet reached the $20 million mark.","If the project is successful, it appears it will do some sort of community ownership. This approach is common in the crypto space, whereby an item (either in the real world or on a blockchain) is fractionalized into millions of tokens, and these are distributed among token holders.&nbsp;","The idea is that the token holders collectively own the item in question — although this is not necessarily the case. Other pesky issues include whether the item can be unfractionalized and returned to the ownership of a single individual.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sotheby’s","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Selby Kiffer","content":"PERSON"},{"type":"Graham Novak","content":"PERSON"},{"type":"$4 million","content":"MONEY"},{"type":"Julian Weisser","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"November 12","content":"DATE"},{"type":"$15","content":"MONEY"},{"type":"Continental Congress","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Tang","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ma","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Alice Ma","content":"PERSON"},{"type":"$20 million","content":"MONEY"},{"type":"$20 million mark","content":"MONEY"}],"hashtag":["ETHEREUM"],"authors":["Tim Copeland","The Block"]}