{"summary":"Crypto dwarfed other financial sectors in scam reports last year, according to a new report from the UK&#x27;s financial regulator. There were 8,568 suspected","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/177753\/crypto-is-lead-sector-for-financial-scam-alerts-in-the-uk-fca","publishDate":"2022-10-17T23:43:34","id":5507,"type":null,"title":"Crypto is lead sector for financial scam alerts in the UK: FCA","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">Crypto dwarfed other financial sectors in scam reports last year, according to a new report from the UK's financial regulator. <\/span>","There were 8,568 suspected crypto scams reported to the Financial Conduct Authority during the period running from April 1, 2021 to March 31, 2022, according to an annual enforcement summary published by the agency. That's an approximately 36% increase from the same time the year before. <span data-v-f87c67ca=\"\">That figure leads the board, more than doubling the runner-up scamming category of pension transfer to a new scheme.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The data release is part of the FCA's “ScamSmart” campaign, which includes warning consumers of the risks of investing in crypto. <\/span>The FCA&nbsp;reiterated the importance of the project in its annual public review meeting earlier in October, along with that crypto investors should be ready to <a href=\"https:\/\/www.theblock.co\/post\/176539\/uk-regulator-pushes-line-that-crypto-investors-must-be-prepared-to-lose-all-their-money\" data-v-f87c67ca=\"\">“lose all their money”<\/a>.","The FCA opened 432 cases into potential crypto-related scams during the yearlong period of the report, and said that digital assets have the highest rate of customers, 79%, who have already invested money when reporting a possible fraud.&nbsp;","Those high numbers may drive the FCA's strategy of being,&nbsp;<span data-v-f87c67ca=\"\">“tough at the authorisation gateway”. The approach caused some crypto companies to <a href=\"https:\/\/www.theblock.co\/post\/139679\/blockchain-com-becomes-latest-firm-to-retreat-from-uk-regulation-application\" data-v-f87c67ca=\"\">withdraw<\/a> applications and prioritize approval in the EU instead<\/span><span data-v-f87c67ca=\"\">. But the annual review report shows that digital asset companies aren't the only ones finding it hard to receive business approval in the UK; overall one-in-five applications from financial firms looking to join the consumer investment market in 2021 to 2022 were withdrawn or not approved.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Setting high standards and acting quickly to crack down on problem firms will help ensure market and consumer confidence, supporting the integrity and growth of UK financial services,” Sarah Pritchard, the FCA’s executive director of markets, said in a press release.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The national register shows <\/span><a href=\"https:\/\/register.fca.org.uk\/s\/search?predefined=CA\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">39<\/span><\/a><span data-v-f87c67ca=\"\"> crypto asset firms legally operating in the UK; and <\/span><a href=\"https:\/\/register.fca.org.uk\/s\/search?predefined=U\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">246<\/span><\/a><span data-v-f87c67ca=\"\"> crypto asset companies currently operating that are not registered.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"UK","content":"ORGANIZATION"},{"type":"36%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"March 31, 2022","content":"DATE"},{"type":"FCA","content":"ORGANIZATION"},{"type":"79%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Financial Conduct Authority","content":"ORGANIZATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Sarah Pritchard","content":"PERSON"},{"type":"April 1, 2021","content":"DATE"}],"hashtag":["FCA"],"authors":["Inbar Preiss","The Block"]}