{"summary":"Initia, a Layer 1 blockchain designed for modular rollups, has received a pre-seed investment from Binance Labs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/256143\/layer-1-project-initia-emerges-from-stealth-with-a-pre-seed-investment-from-binance-labs","publishDate":"2023-10-12T08:59:06","id":551,"type":null,"title":"Layer 1 project Initia emerges from stealth with a pre-seed investment from Binance Labs","category":["DEALS"],"content":["A group of developers working on a Layer 1 network Initia transitioned from stealth mode today, securing a pre-seed investment from Binance Labs, the venture capital and incubation arm of the crypto exchange Binance.","With the newly raised capital, the development team behind Initia aims to enable developers to build Layer 2 scaling solutions that are interconnected with each other. The team did not disclose the investment amount from Binance Labs.","Initia will operate as a Layer 1 in the <a href=\"https:\/\/www.theblock.co\/learn\/249525\/what-is-cosmos-and-how-does-it-work-a-beginners-guide-to-atom-cryptocurrency\" data-v-f87c67ca=\"\">Cosmos ecosystem<\/a> and host scalable application-specific Layer 2s developed using optimistic rollup technology. The Layer 1 Initia will also facilitate cross-chain interactions between these rollups.","“We are thrilled to have Binance Labs as an early partner to accelerate the growth of Initia’s highly performant hub and bespoke blockchain platform. In collaboration with Binance Labs, Initia aims to underpin an interconnected ecosystem of applications while simultaneously aligning the economic interests of all L1\/2 users and operators,” said Stan Liu, a core contributor to Initia.","Initia will leverage a computing framework named MoveVM, based on the Move smart contracting language. The Move language isn’t exclusive to Initia. Other Layer 1 chains, including <a href=\"https:\/\/www.theblock.co\/post\/159439\/aptos-closes-150-million-round-led-by-ftx-ventures-jump-crypto\" data-v-f87c67ca=\"\">Aptos<\/a> and Sui, have also adopted it.","The project remains in the development phase on a testnet. Initia developers said they have planned partnerships with other notable crypto projects, including Binance Labs portfolio companies and game publishers that will be revealed in the coming months.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Aptos","content":"LOCATION"},{"type":"Stan Liu","content":"PERSON"},{"type":"Binance Labs","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Initia","content":"LOCATION"},{"type":"Initia","content":"ORGANIZATION"},{"type":"Sui","content":"PERSON"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}