{"summary":"Jeremy Ng and Eugene Ng unveiled their crypto startup OpenEden.\nThe startup launched an on-chain vault to offer exposure to tokenized Treasury Bills.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/224565\/openeden-gemini-execs-tokenized-t-bill-vault","publishDate":"2023-04-03T12:45:16","id":551,"type":null,"title":"OpenEden: Ex-Gemini execs launch tokenized T-Bill vault","category":["Companies"],"content":["Jeremy Ng and Eugene Ng — Gemini's ex-Asia Pacific head and former head of business development for the region, respectively — unveiled a new crypto startup called OpenEden to offer exposure to tokenized Treasury Bills (T-Bills).","OpenEden was established early last year and comes out of stealth today with its first product launch, according to a statement shared with The Block on Monday. The product, dubbed OpenEden T-Bill vault, lets USDC stablecoin holders mint the \"TBILL\" token and earn a yield.","The launch comes amid a high interest-rate environment and <a href=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\" data-v-f87c67ca=\"\">stablecoins<\/a> sitting on the sidelines due to challenging market conditions. There is also \"increased distrust\" with banks and centralized platforms following collapses, so this is the right time to launch the vault, Eugene Ng told The Block in an interview.","The \"vault\" is an on-chain pool that allows stablecoin holders to earn a yield from U.S. Treasury Bills. Most of the pool's assets will be invested directly into short-dated U.S. Treasury Bills off-chain, and a small portion of USDC will remain on-chain to facilitate 24\/7 instant withdrawals, according to OpenEden's <a href=\"https:\/\/app.openeden.com\/\" data-v-f87c67ca=\"\">website<\/a>.","\"The vault is permissioned as investors need to submit KYC [know-your-customer] documents to deposit USDC into it,\" Eugene said. \"KYC is a digital process and gets approved within 15 minutes, and once approved, users get the minted TBILL tokens in their wallets.\"","Once minted, users can redeem those tokens along with an interest rate (currently about 5%), based on the yield from the underlying T-bills. according to Eugene. He added that both minting and redemptions are on-chain and have 24\/7 \"instant\" settlement support versus up to two business days in traditional finance.","OpenEden, however, is not the only crypto platform providing exposure to tokenized T-Bills. <a href=\"https:\/\/www.theblock.co\/post\/200611\/ondo-finance-tokenized-treasuries-bonds\" data-v-f87c67ca=\"\">Ondo Finance<\/a> and <a href=\"https:\/\/www.prnewswire.com\/ru\/press-releases\/decentralized-lending-protocol-flux-finance-launches-looks-to-support-tokenized-us-treasuries-from-ondo-finance-301720061.html\" data-v-f87c67ca=\"\">Flux Finance<\/a> are among its closest competitors. But Eugene said OpenEden is \"the first smart contract vault managed by a regulated financial institution to offer direct access to T-Bills 24\/7 in a bankruptcy-remote special purpose vehicle or SPV.\"","An SPV is a subsidiary created by a parent company to isolate financial risk. In the OpenEden's case, its SPV dubbed OpenEden Cayman Limited, will not be impacted if OpenEden goes bankrupt, according to Eugene. OpenEden has partnered with Saxo Bank as its custodian that \"holds the underlying assets of TBILL tokens in this SPV for the benefit of TBILL token holders, removing any risk of commingling with OpenEden's balance sheet,\" Eugene said.","As for the vault managed by a regulated financial institution, Eugene said it is managed by OpenEden Pte. Ltd., which is a <a href=\"https:\/\/eservices.mas.gov.sg\/fid\/institution\/detail\/411841-OPENEDEN-PTE-LTD\" data-v-f87c67ca=\"\">registered<\/a> fund management company regulated by the Monetary Authority of Singapore. The issuer of TBILL tokens, on the other hand, is Hill Lights International Ltd., which is recognized as a professional fund established under the British Virgin Islands Securities and Investment Business Act 2010, according to OpenEden's website.","Besides Saxo Bank, OpenEden has partnered with multiple other firms, including Circle (fiat on-ramp), DBS Bank (fiat banking partner), KPMG (tax advisor), Elliptic (blockchain compliance), Harneys (legal counsel), Capital Asia Investments (fund administrator), and TJ Assurance Partners PAC (fund auditor), according to the statement. The startup has also partnered with Chainlink to provide \"real-time transparency into the underlying assets of TBILL tokens.\"","As the T-Bill vault goes live today, OpenEden plans to onboard 30 to 50 clients that are on its waitlist, Eugene said. Those clients include decentralized autonomous organizations (DAOs), crypto funds and decentralized finance (DeFi) protocols, he added.","Looking ahead, OpenEden plans to support more stablecoins and launch more products, including tokenized bonds, stocks, and real estate investment trusts (REITs), according to Eugene.","As for OpenEden's business model, it will start charging fees once it reaches a certain amount of total value locked or TVL, Eugene said.","Last week, Citi <a href=\"https:\/\/www.theblock.co\/post\/224014\/citi-tokenized-securities-use-case?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">said<\/a> \"almost anything of value can be tokenized\" as the bank forecasts up to $4 trillion in tokenized digital securities and up to $5 trillion of central bank digital currency could be circulating in major economies in the world, half of which could be linked to distributed ledger technology.","Tokenizing financial and real-world assets could be the \"killer use-case\" that blockchain needs to drive a breakthrough, according to the bank.&nbsp;"],"hashtag":["DECENTRALIZED INFRASTRUCTURE","SEED &AMP; PRE-SEED","USDC"]}