{"summary":"BlockFi&#x27;s bankruptcy filing is the latest challenge facing Bitcoin miners, who have been struggling with the collapse in crypto asset prices and increasing difficulty in mining.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/191691\/blockfis-bankruptcy-is-the-latest-blow-for-a-bleeding-bitcoin-mining-industry","publishDate":"2022-12-02T16:33:25","id":5511,"type":null,"title":"BlockFi&#x27;s bankruptcy is the latest blow for a bleeding Bitcoin mining industry","category":["CRYPTO INFRASTRUCTURE"],"content":["As if crashing crypto assets, high energy prices and increasing difficulty in mining weren't enough, now Bitcoin miners face the fallout from BlockFi's bankruptcy protection filing.","BlockFi was the second biggest lender in the space after NYDIG, according to public information <a href=\"https:\/\/www.theblockresearch.com\/bitcoin-miner-creditworthiness-evaluation-150739\" data-v-f87c67ca=\"\">laid out by<\/a> The Block Research in June. On top of that, BlockFi debtor Core Scientific — ie, the largest mining company in the world — is itself close to filing for bankruptcy. Core had $54 million in outstanding debt to BlockFi in September and late in October said that it would not make payments by end of the month.","They are far from the only miner <a href=\"https:\/\/www.theblock.co\/post\/181448\/bankruptcy-top-of-mind-as-miners-confront-market-downturn\" data-v-f87c67ca=\"\">struggling with liquidity<\/a>.","Machine-backed loans helped miners bootstrap operations and plan lofty expansions at the height of the bull market. The future of that financing is now uncertain, and those who owe money are in a tight spot, experts said.","\"They ran a very aggressive lending model and it finally, unfortunately, caught up with them,\" said <span class=\"markzhxgtbgrd\" data-markjs=\"true\" data-ogac=\"\" data-ogab=\"\" data-ogsc=\"\" data-ogsb=\"\" data-v-f87c67ca=\"\">Pablo<\/span>&nbsp;<span class=\"markq4qb9ia4y\" data-markjs=\"true\" data-ogac=\"\" data-ogab=\"\" data-ogsc=\"\" data-ogsb=\"\" data-v-f87c67ca=\"\">Bonjour, managing partner and crypto expert at restructuring firm MACCO, which advised crypto lender Cred <a href=\"https:\/\/www.coindesk.com\/business\/2020\/11\/08\/crypto-lender-cred-files-for-bankruptcy-after-losing-funds-in-fraud\/\" data-v-f87c67ca=\"\">through chapter 11 bankruptcy<\/a>.<\/span>","Now that BlockFi has filed for Chapter 11 bankruptcy protection, their financial advisors will likely be reaching out one by one to companies that owe them money.","\"We're normally discounting 50%, 60%, 80% ... You'll see a lot of negotiation off of the original amount,\" <span class=\"markq4qb9ia4y\" data-markjs=\"true\" data-ogac=\"\" data-ogab=\"\" data-ogsc=\"\" data-ogsb=\"\" data-v-f87c67ca=\"\">Bonjour<\/span> said. \"You'll see a lot of these companies survive for a little bit longer, maybe with a little bit less pressure. But ultimately, it's bad for the industry.\"","Miners might be able to get away with delaying payments for a few months but eventually, creditors will catch up to them — especially given that the case is in federal court.","\"When they get a call from a financial advisor, it's not just a collector. You've got the full backing of the federal government, the Department of Justice and really the best litigators in the country,\" <span class=\"markq4qb9ia4y\" data-markjs=\"true\" data-ogac=\"\" data-ogab=\"\" data-ogsc=\"\" data-ogsb=\"\" data-v-f87c67ca=\"\">Bonjour<\/span> said.","The price of an ASIC machine has fallen on average by 80% since December last year, and consequently so has the value of the assets collateralizing a significant portion of the loans in the mining industry.","\"Basically, they're just pet rocks at that point,\" said William Foxley, media and strategy director for Compass Mining. \"The collateral you handed over for your loan went to zero. And that's happening for some people at this moment. So I really think it just brings into question a huge financial instrument for miners. We might be seeing that going out the door. Perhaps there are smarter financiers out there to figure out how to make these loans more approachable.\"","BlockFi loans secured by machines include $80 million to Core Scientific and $32 million to Bitfarms. The companies didn't respond to a request for comment.","BlockFi also lent out nearly $47 million to a joint venture between Cipher Mining and WindHQ. \"They have fully funded a loan to us and we are making payments on it,\" Cipher CEO Tyler Page told The Block via Telegram.","A common practice in the industry has been to sign non-recourse deals, in which lenders can't claim any assets beyond the collateral. That leaves the lenders in a particularly tough position, said Glyn Jones, CEO and founder of Icebreaker Finance, which recently <a href=\"https:\/\/www.theblock.co\/post\/171275\/maples-icebreaker-finance-launches-300-million-lending-fund-for-bitcoin-miners\" data-v-f87c67ca=\"\">launched a lending fund<\/a> for distressed miners.","\"I don't think anyone's written any new loans of that nature in the last five months ... I would never write one,\" Jones said. \"The exact time when they default and say 'I don't want them anymore' is the exact time when the assets aren't worth very much money ... The price of mining rigs goes up and down like a yo-yo.\"","In what's considered a strategic move, Iris Energy recently <a href=\"https:\/\/www.theblock.co\/post\/188756\/bitcoin-miner-iris-energy-unplugs-hardware-collateralizing-over-100-million-in-loans\" data-v-f87c67ca=\"\">unplugged hardware collateralizing over $100 million<\/a> in loans, after getting a default notice from its lender, freeing up data center capacity to refill with machines it already made prepayments towards.","Jones said that while he's been \"delighted with the investor appetite\" for Icebreaker's fund, it's been more of a challenge to find credit-worthy borrowers.","\"I've met with more than 60 miners,\" Jones said. \"Unfortunately, there's very few miners who are generating sufficient cash flows where I think they will be able to service debt.\"","Because machines aren't worth as much, it's also not in collectors' interest to call them back. \"So the threat of foreclosure to take the machines is significantly less leverage,\" <span class=\"markq4qb9ia4y\" data-markjs=\"true\" data-ogac=\"\" data-ogab=\"\" data-ogsc=\"\" data-ogsb=\"\" data-v-f87c67ca=\"\">Bonjour said<\/span>.","BlockFi has not closed any new loans to miners since the spring, the company's Chief Risk Officer Yuri Mushkin <a href=\"https:\/\/www.theblock.co\/post\/180546\/massmutual-blockfi-are-among-bitcoin-miner-core-scientifics-biggest-creditors\" data-v-f87c67ca=\"\">told The Block<\/a> in October.","\"BlockFi holds risk capital reserves to protect against potential loan defaults, which includes mining-equipment finance business,\" Mushkin said at the time. \"Furthermore, our credit risk management team closely monitors the bitcoin mining sector and regularly speaks with the borrowers in the portfolio.\"","While BlockFi was a big lender for the industry, miners were on the other hand a small portion of BlockFi's business.","Last year, the firm took steps to jump into the mining sector beyond lending, closing a deal with hosting provider Blockstream for 300 megawatts of power capacity.","\"As BlockFi looks to expand our offerings to the mining community and accumulate Bitcoin on our balance sheet, mining directly to support the Bitcoin network provides a means to vertically integrate our supply chain while diversifying our revenue streams,\" Joe Chu, Director, principal credit and mining at BlockFi, <a href=\"https:\/\/blockfi.com\/blockfi-taps-blockstream-for-mining-colocation-services\" data-v-f87c67ca=\"\">said<\/a> at the time.","The Blockstream deal will be analyzed as part of the Chapter 11 process to see if it's profitable, <span class=\"markq4qb9ia4y\" data-markjs=\"true\" data-ogac=\"\" data-ogab=\"\" data-ogsc=\"\" data-ogsb=\"\" data-v-f87c67ca=\"\">Bonjour said<\/span>. \"If it is, then that would become part of the restructuring. But if it's not, you could see a situation where that joint venture with Blockstream is effectively shut down.\"","Ultimately, mining loans are part of BlockFi's assets, so \"creditors will work very hard to get those loans paid in full,\" Jeff Burkey, VP of business development at Foundry, which provides financing for miners, said via Telegram.&nbsp;","\"With each bankruptcy comes more ASIC supply, and lower prices for the rigs,\" he said. \"Good news for buyers, bad news for large miners as their balance sheet assets get marked lower.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jones","content":"PERSON"},{"type":"80%","content":"PERCENT"},{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Compass Mining","content":"ORGANIZATION"},{"type":"Yuri Mushkin","content":"PERSON"},{"type":"Glyn Jones","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"60%","content":"PERCENT"},{"type":"Foundry","content":"ORGANIZATION"},{"type":"ASIC","content":"ORGANIZATION"},{"type":"Icebreaker Finance","content":"ORGANIZATION"},{"type":"$54 million","content":"MONEY"},{"type":"Telegram","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"William Foxley","content":"PERSON"},{"type":"Mushkin","content":"PERSON"},{"type":"spring","content":"DATE"},{"type":"Iris Energy","content":"ORGANIZATION"},{"type":"MACCO","content":"LOCATION"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"Cipher Mining","content":"ORGANIZATION"},{"type":"Blockstream","content":"PERSON"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"December last year","content":"DATE"},{"type":"$80 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"The Block via Telegram","content":"ORGANIZATION"},{"type":"Jeff Burkey","content":"PERSON"},{"type":"Joe Chu","content":"PERSON"},{"type":"Bonjour","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"$32 million","content":"MONEY"},{"type":"Pablo<\/span>&nbsp;<span class=\"markq4qb9ia4y\" data-markjs=\"true\" data-ogac=\"\" data-ogab=\"\" data-ogsc=\"\" data-ogsb=\"\" data-v-f87c67ca=\"\">Bonjour","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"$47 million","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["MINING COMPANIES"],"authors":["Catarina Moura","The Block"]}