{"summary":"As artificial intelligence&#x27;s grip on the future of technology tightens, blockchain could help discern real internet users from fake ones.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/268446\/how-blockchain-can-help-solve-proof-of-personhood","publishDate":"2023-12-26T03:21:04","id":5512,"type":null,"title":"How blockchain can help solve proof of personhood","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">A little more than a year ago ChatGPT burst onto the scene, causing tech giants like Google, Microsoft and Meta to simultaneously mobilize, all appearing to be afraid of falling behind when it comes to the innovation and adoption of artificial intelligence, or AI.<\/span>","<span data-v-f87c67ca=\"\">With hundreds of millions of people now experimenting with the power of AI chatbots on a monthly basis, the role artificial intelligence plays in our daily lives, especially online, is expected to grow exponentially as more users come to grasp the technology's power.<\/span>","<span data-v-f87c67ca=\"\">In a <a href=\"https:\/\/www.ftpartners.com\/interviews\/worldcoin\" data-v-f87c67ca=\"\">recent conversation<\/a> with investment firm FT Partners, Tools For Humanity CEO and co-founder Alex Blania discussed concerns related to the idea that one day soon artificial intelligence could drive the bulk of online interactions. If that prediction comes to fruition, discerning who is a real person and who is not on the internet, could become paramount.<\/span>","<span data-v-f87c67ca=\"\">\"There’s three main areas that you could go into to address the problem,\" said Blania in December. \"One, is KYC (know-your-customer), so basically government infrastructure. Two, you do what people call 'web of trust,' so you know me, I know you, we assign each other a certain trust value … so we build a network of people that know each other.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"And the last one would be biometrics,\" he added, as the discussion turned to addressing the concept of \"proof of personhood.\" <\/span><span data-v-f87c67ca=\"\">Blania’s Tools for Humanity is the main developer of <\/span><span data-v-f87c67ca=\"\">Worldcoin, a proof-of-personhood crypto project that uses orb devices to scan people’s irises to help them authenticate their identity online.<\/span>","<span data-v-f87c67ca=\"\">While the internet is already full of malicious actors and fake bot accounts employed to both spread disinformation and trick people, many thought leaders see the rise of artificial intelligence as eventually exacerbating malicious behavior. Perhaps the only solution — something core to <a href=\"https:\/\/www.theblock.co\/post\/237647\/inside-sam-altmans-worldcoin-and-its-quest-to-catalog-all-humans\" data-v-f87c67ca=\"\">Worldcoin's mission<\/a> — involves the authentication of people’s identities at scale.<\/span>","A major and prevalent concern with this approach, however, is the fact that many <span data-v-f87c67ca=\"\">people may be concerned to hand over the data required to authenticate their identity, such as highly sensitive personal or biometric information. With hacks and the leaking of personal data commonplace, how would people have the confidence to turn over the data necessary to make proving the personhood of billions of people viable?<\/span>","<span data-v-f87c67ca=\"\">This is where some, like Blania, say blockchain technology could play a pivotal role. \"The fundamental idea of crypto and blockchain is to build something that is decentralized,” Blania said during his December conversation.<\/span>","<span data-v-f87c67ca=\"\">At the heart of blockchain technology are digital ledgers, which serve as incorruptible, distributed databases, storing information — that could be encrypted — in a decentralized manner. This means no one entity (person, company or government) maintains sole control of the data. Many blockchain advocates argue that a single entity tends to be more vulnerable to attacks or changing whims, while a decentralized system would be more reliable as it relies on cooperation and consensus.<\/span>","<span data-v-f87c67ca=\"\">Besides personal data being stored securely and encrypted on the blockchain, a decentralized system could also offer people more control of their own private information, instead of having it stored by profit-driven corporations like Google or Amazon.<\/span>","<span data-v-f87c67ca=\"\">Blockchain, it is argued, could power the concept of self-sovereign identity. The theory of self-sovereign identity is that by leveraging blockchain, individuals could wield greater control over their personal data, so when they choose to access online platforms, they would be able to be more decisive about both what data is accessible and how it is used.<\/span>","\"<span data-v-f87c67ca=\"\">Centralized systems like Google have complete control over your data, including how it's used and who has access to it,\" Raheel Govindji, CEO and founder of ModClub told The Block. \"In decentralized systems, you maintain control over your own data. You can choose what to share and with whom, enhancing privacy and autonomy.\"<\/span>","Modclub is set to <a href=\"https:\/\/www.theblock.co\/post\/263579\/proving-youre-human-internet-computer-app-openchat-to-test-facial-recognition\" data-v-f87c67ca=\"\">test facial recognition<\/a> with the decentralized chat app OpenChat in order to tackle challenge of proving “unique humanity.”","Isaac Patka, who is co-founder of blockchain security company Shield3, cautions, however, while decentralized systems can offer people more control over their data, they aren't without vulnerabilities. \"A decentralized system is not necessarily more secure just by being decentralized,\" he told The Block. \"But it does reduce the potential breadth. If there is no central repository of data, an attacker would have to compromise multiple systems one by one.","<span data-v-f87c67ca=\"\">Some advocates see blockchain’s immutability as also making it inherently more resistant to risks of identity theft and fraud. The fact that blockchain is harder to tamper with could, therefore, help ensure that recorded information is not altered or tampered with at a later date, thus curtailing potentially malicious activities.<\/span>","\"<span data-v-f87c67ca=\"\">Unlike centralized systems where access records can be more easily manipulated, blockchain ensures that all interactions are permanently logged. This feature is particularly valuable in applications like Proof of Humanity. Changes or updates are securely recorded on the blockchain; this allows for trust without the need for repeated data exchanges, enhancing both security and efficiency,\" said Govindji. \"<\/span><span data-v-f87c67ca=\"\">Blockchain is like giving everyone their own digital vault, where you control when, where, and how your data is accessed.\"<\/span>","<span data-v-f87c67ca=\"\">Worldcoin has been perhaps the highest-profile project concerned with proof of personhood, but it is not the only blockchain-based project interested in facilitating the verification of unique humanity. Among others, these projects include the d<\/span><span data-v-f87c67ca=\"\">ecentralized chat app <\/span><a href=\"https:\/\/www.theblock.co\/post\/263579\/proving-youre-human-internet-computer-app-openchat-to-test-facial-recognition\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">OpenChat<\/span><\/a><span data-v-f87c67ca=\"\"> and the <\/span><a href=\"https:\/\/www.theblock.co\/post\/246627\/proof-of-humanity-plug-in-for-crypto-apps-launched-by-rarimo\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Rarimo<\/span><\/a><span data-v-f87c67ca=\"\"> protocol.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Blania","content":"LOCATION"},{"type":"Alex Blania","content":"PERSON"},{"type":"Blania","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Amazon","content":"LOCATION"},{"type":"Govindji","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"ModClub","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Worldcoin","content":"LOCATION"},{"type":"FT Partners","content":"ORGANIZATION"},{"type":"Raheel Govindji","content":"PERSON"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"Isaac Patka","content":"PERSON"}],"hashtag":["IDENTITY"],"authors":["RT Watson","The Block"]}