{"summary":"Stronghold Digital Mining has pushed back its second-quarter earnings call to August 15.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/163133\/stronghold-digital-mining-pushes-back-q2-earnings-due-to-significant-announcement","publishDate":"2022-08-11T19:20:25","id":5514,"type":null,"title":"Stronghold Digital Mining pushes back Q2 earnings due to &#x27;significant announcement&#x27;","category":["COMPANIES"],"content":["Stronghold Digital Mining pushed back its second-quarter earnings conference call from this afternoon to August 15, the company said on Thursday in a press release. It is now the second mining company to delay its earnings release this week.&nbsp;","\"We're making a significant announcement that needed a day or two more to finalize,\" a spokesperson said when asked about the delay. Stronghold did not publicly mention a reason for rescheduling its earnings in its press statement.","Stronghold now is planning to hold its second-quarter earnings conference call on August 15 at 5:00 p.m. EDT, and would issue a press release with results after trading closes that day. The mining company's <a href=\"https:\/\/www.theblock.co\/post\/163102\/bitcoin-mining-stock-report-august-11\" data-v-f87c67ca=\"\">stock price<\/a> was up 4.68% today from yesterday's close.&nbsp;&nbsp;","Stronghold operates miners at two plants in Pennsylvania that generate power using waste coal. The company <a href=\"https:\/\/www.theblock.co\/linked\/121444\/bitcoin-mining-stronghold-127-million-ipo\" data-v-f87c67ca=\"\">went public<\/a> in October 2021.&nbsp;","Another notable mining company, Riot Blockchain, also delayed its earnings release this week. Riot notified the U.S. Securities and Exchange Commission (SEC) in an <a href=\"https:\/\/seekingalpha.com\/filing\/6639037?source=content_type%3Areact%7Csection%3ASEC%20Filings%7Csection_asset%3ASEC%20Filings%7Cfirst_level_url%3Asymbol%7Cbutton%3ATitle%7Clock_status%3ANo%7Cline%3A1\" data-v-f87c67ca=\"\">August 9 filing<\/a> that it would be unable to file its second-quarter report on time,&nbsp; saying it needed to do an assessment of its impairment due to \"recent adverse changes in business climate.\"","Contributing to the accounting delay were \"various global macroeconomic and geopolitical factors, such as the ongoing war in Ukraine, global logistics slowdowns, and recent significant inflationary pressures,\" Riot said in the filing.&nbsp;","&nbsp;","&nbsp;","&nbsp;","&nbsp;","&nbsp;","&nbsp;","&nbsp;","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Stronghold Digital Mining","content":"ORGANIZATION"},{"type":"this afternoon","content":"TIME"},{"type":"August 9","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"August 15","content":"DATE"},{"type":"quarter","content":"DATE"},{"type":"October 2021","content":"DATE"},{"type":"5:00 p.m. EDT","content":"TIME"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Pennsylvania","content":"LOCATION"},{"type":"Riot Blockchain","content":"PERSON"},{"type":"4.68%","content":"PERCENT"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":[],"authors":["Kristin Majcher","The Block"]}