{"summary":"Tandem Bank, one of the United Kingdom’s much-hyped crop of neo-banks, has filed annual results that show mounting losses and warn the firm faces “material uncertainty” about its ability to remain in business.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/91049\/uk-neobank-tandem-faces-uncertain-future-losses-mount","publishDate":"2021-01-14T07:05:56","id":5523,"type":null,"title":"UK neobank Tandem issues “material uncertainty” warning as losses mount","category":["THE BLOCK"],"content":["Tandem Bank, one of the United Kingdom’s much-hyped crop of neo-banks, has filed annual results for 2019 that show mounting losses and warn the firm faces “material uncertainty” about its ability to remain in business.","The startup lost £18.9 million in the 12 months to December 31, 2019, up from £13.7 million the previous year. Tandem attributes the larger losses to investment in infrastructure and to having made provision for defaults on unsecured loans.&nbsp;","Its income increased from £15.4m in 2018 to £24.8m the following year, driven primarily by growth in unsecured lending.","The accounts, which were filed January 11, 2021, were signed off by Tandem's directors and auditors PwC in August of 2020.&nbsp;","The report highlights the impact of the Covid-19 crisis and suggests it has made “going concern assessments more testing and judgemental”.","“Tandem is not isolated from this environment and faces the same issues with implications across future revenue generating activities, credit losses and ability to fundraise, which results in material uncertainty in the group’s ability to continue as a going concern,” the report continues. &nbsp;","A similar warning in the annual accounts of Monzo, a rival digital bank, <a href=\"https:\/\/www.cnbc.com\/2020\/07\/31\/monzo-losses-double-as-uk-digital-bank-warns-of-pandemic-uncertainty.html\" data-v-f87c67ca=\"\">caused a stir<\/a> in July.","A spokesperson for Tandem told The Block the material concern note is “prudent and appropriate given Tandem is still a loss-making business and no different to the statements you’ll see in the accounts of many other startups”.","“However, you'll also notice the closure of a £60 million fundraising round in August 2020, and we've made a number of adjustments to our banking product portfolio. We’ve also demonstrated significant resilience through the Covid-19 pandemic, and we remain on track to hit profitability this year,” they continued.","Tandem closed a £60m raise in August 2020 while simultaneously <a href=\"https:\/\/www.fnlondon.com\/articles\/the-complex-waggle-dance-behind-honeycombs-bank-investment-20200902\" data-v-f87c67ca=\"\">announcing the acquisition<\/a> of green finance firm Allium Lending Group. The move was part of a restructuring process that will see Tandem position itself as a clean energy-focused bank.","PwC wrote that Tandem would require additional capital injections within the next twelve months from the date it signed off on the accounts if the digital bank is to continue at its planned rate of growth.","“In order to meet future regulatory requirements and to continue in business as a going concern, the company will either have to moderate its rate of growth or raise further capital,” wrote PwC.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"December 31, 2019","content":"DATE"},{"type":"January 11, 2021","content":"DATE"},{"type":"19","content":"DATE"},{"type":"August 2020","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"August of 2020","content":"DATE"},{"type":"July","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Covid","content":"PERSON"},{"type":"PwC","content":"ORGANIZATION"},{"type":"Allium Lending Group","content":"ORGANIZATION"},{"type":"United Kingdom","content":"LOCATION"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}