{"summary":"Treasury is asking Congress to give it more authority to go after illicit actors in the digital asset industry, a top official said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265227\/u-s-treasurys-wally-adeyemo-calls-for-more-authority-to-go-after-bad-actors-in-crypto","publishDate":"2023-11-29T11:37:52","id":5525,"type":null,"title":"U.S. Treasury&#x27;s Wally Adeyemo calls for more authority to go after bad actors in crypto","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The U.S. Treasury Department is asking Congress to give it more authority to go after illicit actors in the digital asset industry, a top official said on Wednesday.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The Treasury Department sent recommendations to lawmakers, including one for new sanctions tools, according to prepared remarks from Deputy Treasury Secretary Wally Adeyemo ahead of the Blockchain Association's Policy Summit.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"We are calling on Congress to create a secondary sanction regime that will not only cut off a firm from the U.S. financial system, but will also expose any firm that continues to do business with the sanctioned entity to being cut off from the U.S. financial system,\" Adeyemo said. \"This is a significant tool we do not request lightly. But we need to do everything in our power to make sure that groups like Hamas are not able to find safe haven within the digital asset ecosystem.\"<\/span>","Crypto's use in terrorist financing has been at the forefront of discussions involving Hamas's fundraising efforts in Washington. Both Republicans and Democrats have recently penned letters to Biden and the Justice Department raising concerns about crypto's use in financing terrorism as well as asking federal prosecutors to \"carefully evaluate the extent to which Binance and Tether are providing material support and resources to support terrorism.\"","<span class=\"s1\" data-v-f87c67ca=\"\">Adeyemo also said \"dollar-backed stablecoin providers\" that are outside the U.S. should not be able to use U.S. currency without putting in place procedures to block terrorists from taking advantage of their platform.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"I am increasingly concerned about things like dollar-based stablecoins that aren't based here in the United States, but give people the privilege and the ability to use the dollar outside of our jurisdiction,\" Adeyemo said later on Wednesday during a fireside chat at the Blockchain Association Policy Summit.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Adeyemo added that Treasury's recommendations should not be seen as \"targeting a technology.\"<\/span>","Treasury proposed creating a new crypto related category under the Bank Secrecy Act, according to a list of recommendations obtained by The Block. Some crypto entities such as DeFi platforms say they are not subject to certain requirements under the BSA because they are not centralized, Treasury said, and legislation is needed to make clear that DeFi would have to follow the BSA and its money laundering rules.&nbsp;","Stablecoins also need more oversight, Treasury said and added that they have become \"common vehicles for terrorist financing.\"","<span class=\"s1\" data-v-f87c67ca=\"\">\"Legislation could explicitly authorize OFAC to exercise extraterritorial jurisdiction over transactions in stablecoins pegged to the USD (or other dollar-denominated transactions) as they generally would over USD transactions,\" Treasury said.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">Adeyemo's comments come a week after the U.S. Department of Justice settled a case with the world's largest crypto exchange Binance, <\/span><span class=\"s1\" data-v-f87c67ca=\"\">which probed into alleged money laundering, fraud and sanctions violations. The crypto exchange will pay a $4.3 billion fine, marking one of the largest corporate settlements in U.S. history.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Over several years, Binance allowed itself to be used by the perpetrators of child sexual abuse, illegal narcotics trafficking, and terrorism, across more than 100,000 transactions,\" Adeyemo said. \"Groups like Hamas, Al Qaeda, and ISIS conducted these transactions.”<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Adeyemo had a strong a message for the crypto industry in his prepared remarks.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"I want to directly address those within the digital asset industry who believe they are above the law, those that willfully turn a blind eye to the law, and those that promote assets and services that aid criminals, terrorists, and rogue states,\" Adeyemo said. \"My message is simple: We will find you and hold you accountable.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The crypto industry needs to step up, he said, to help prevent bad actors, Adeyemo said later at the fireside chat hosted by the Blockchain Association.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"While you may be different, I do think that the industry needs to step up and to take steps here, to think through what you're for in terms of making sure that you help work with government to prevent illicit finance, because oftentimes, what I hear is the rules currently are unclear, too hard to understand how they apply to us,\" Adeyemo said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"We're open to working with you,\" Adeyemo continued. \"We're open to talking with you about what we can do together. What we're not open to is the idea that the law should not apply to us because that doesn't work for you in terms of building an industry that is going to respected and get capital flowing and doesn't work for us from the standpoint of protecting our national security.\"&nbsp;<\/span>","The Treasury's Office of Foreign Assets Control also announced sanctions on Wednesday against a virtual currency mixer called Sinbad.io and said it was used by the Democratic People's of Korea to launder stolen crypto.","\"The Treasury Department and its U.S. government partners stand ready to deploy all tools at their disposal to prevent virtual currency mixers, like Sinbad, from facilitating illicit activities. While we encourage responsible innovation in the digital asset ecosystem, we will not hesitate to take action against illicit actors,\" Adeyemo said in a statement.","Sinbad helped launder millions of dollars in stolen crypto and is a preferred mixer for the North Korea affiliated Lazarus Group, according to OFAC.","<em data-v-f87c67ca=\"\">Updated at 12:15 p.m. ET to include more details after receiving Treasury's recommendations&nbsp;<\/em>","<em data-v-f87c67ca=\"\">Updated at 5:40 p.m. ET to include comments from the Blockchain Association Policy Summit fireside chat&nbsp;<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Adeyemo","content":"PERSON"},{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Treasury's Office of Foreign Assets Control","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"5:40 p.m.","content":"TIME"},{"type":"North Korea","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Blockchain Association's Policy Summit","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"U.S. Department of Justice","content":"ORGANIZATION"},{"type":"Al Qaeda","content":"PERSON"},{"type":"The Treasury Department","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"millions of dollars","content":"MONEY"},{"type":"the Justice Department","content":"ORGANIZATION"},{"type":"OFAC","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Wally Adeyemo","content":"PERSON"},{"type":"Blockchain Association Policy Summit","content":"ORGANIZATION"},{"type":"U.S. Treasury Department","content":"ORGANIZATION"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Korea","content":"LOCATION"},{"type":"Lazarus Group","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"BSA","content":"ORGANIZATION"},{"type":"Hamas","content":"ORGANIZATION"},{"type":"Deputy Treasury","content":"ORGANIZATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"$4.3 billion","content":"MONEY"},{"type":"\" Treasury","content":"ORGANIZATION"},{"type":"ISIS","content":"ORGANIZATION"},{"type":"Biden","content":"PERSON"},{"type":"12:15 p.m.","content":"TIME"}],"hashtag":["BINANCE","SEC","TREASURY DEPARTMENT"],"authors":["Sarah Wynn","The Block"]}