{"summary":"Friday’s trading session was brutal for crypto stocks \nWhile bitcoin’s price has fallen sharply since the beginning of 2022, some crypto stocks have seen steeper declines.\nThat bearish activity could pump the brakes on ambitions among crypto companies to go public","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/131214\/crypto-stock-plunge-could-pump-the-brakes-on-a-busy-deals-market","publishDate":"2022-01-22T13:33:55","id":553,"type":null,"title":"Crypto stock plunge could pump the brakes on IPO and deal market","category":["Capital Markets"],"content":["\"Being a public company seems like a total blast.\"","Barry Silbert, chief executive of crypto power-house DCG, was of course sarcastic in <a href=\"https:\/\/twitter.com\/BarrySilbert\/status\/1484561094253465604\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">his January 21 tweet<\/a>; it's been a brutal period for publicly traded companies in the digital asset market amid the ongoing rout in liquid tokens.&nbsp;","Shares in Robinhood, the popular brokerage app company, are down 29.61% since the start of 2021. Since soaring to all-time highs above $80 soon after its public market debut, it has declined by more than 80%.","Meanwhile, Coinbase's stock is down 23.5% since the beginning of the year and ended Friday's trade down $13.38.&nbsp;","Friday's session was even worse for MicroStrategy, which plunged on reports that the Securities and Exchange Commission had rebuffed the company's approach to accounting for bitcoin in financial disclosures. It's down more than 71% from its February 2021 high.&nbsp;","Bitcoin, meanwhile, has fallen approximately 48.7% from its highs near $69,000 per coin to $35,369. It's down about 25% year-to-date.","The US Federal Reserve's intention to hike interest rates as part of a strategy to combat mounting inflation has rippled through markets, pushing investors out of growth stocks and more risky assets that have benefited from the Fed's easy-money policies.&nbsp;The Nasdaq Composite is down more than 12% year-to-date.&nbsp;","There's a stark dichotomy between the state of the public equity market for crypto firms and the privately-held market, where the number of unicorns has been growing at a breakneck clip.","At the same time, venture funds in the market have been raising billions of dollars in fresh funding. FTX announced its own $2 billion fund earlier this month, following the lead of venture capital firms Paradigm and a16z.&nbsp;","The venture capital sitting on the sidelines could be propping up valuations while public companies feel the pressure, according to David Mercer, CEO of LMAX.&nbsp;","\"Everyone is hunting for the next Skype,\" he told The Block. \"If you were able to write a bunch of $1 million checks you would, you don't need that many to work out: it's throwing spaghetti at the wall.\"","As for public crypto companies, Mercer said that in volatile markets, companies are \"oversold.\"","The view has emerged that bearish action in crypto stocks -- juxtaposed with the ample amounts of cash in private markets -- could dampen ambitions to go public among other firms in the space. It raises an important question: why go public and risk underperforming, when it is easy for a large crypto firm to raise private capital.&nbsp;","\"Certainly, both equities and crypto market trends matter for crypto-based business IPO aspirations,\" said Eric Risley, managing partner of M&amp;A advisory firm Architect Partners.","\"It is certainly safe to say that these market conditions right now are not conducive to launching a crypto business IPO roadshow right now,\" Risley added. \"Anyone in that position would certainly be monitoring how things develop over the next few weeks or perhaps a month before making any type of final decision on go\/no-go.\"","That would be a shift from 2021, which saw companies like Bakkt, Coinbase, and Robinhood tap the public markets. Elsewhere, companies like Circle and crypto exchange Bullish announced their own plans to go public via a SPAC.&nbsp;","The market rout could also pause big ticket merger deals, in the short term. The crypto market saw merger and acquisition activity ramp up in 2021 with M&amp;A activity surging 131%, according to <a href=\"https:\/\/www.theblockcrypto.com\/linked\/128025\/crypto-industry-ma-activity-surged-131-in-2021\" data-v-f87c67ca=\"\">data<\/a> from The Block Research.&nbsp;","Still, market participants expect the year to be active for M&amp;A even if prices continue to slide—thanks in part to large cash balances among private crypto companies.&nbsp;","\"I still think they will be active but M&amp;A prices may come down,\" one expert said.&nbsp;"],"hashtag":["COINBASE","IPOS","ROBINHOOD"]}