{"summary":"Silicon Valley Bank, First Republic, Signature Bank- in one week America saw its second largest bank failure in US history along with the collapse of other smaller banks. What links these together? A cautionary tale on risk and the impact of lending only to the most wealthy facet of society.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/226272\/svb-collapse-a-cautionary-tale-of-concentration-risk-and-lending-to-the-rich","publishDate":"2023-04-14T13:06:38","id":5534,"type":null,"title":"SVB Collapse: A cautionary Tale of Concentration Risk and Lending to the Rich","category":["SPONSORED"],"content":["Silicon Valley Bank, First Republic, Signature Bank- in one week America saw its second largest bank failure in US history along with the collapse of other smaller banks. What links these together? A cautionary tale on risk and the impact of lending only to the most wealthy facet of society","<strong data-v-f87c67ca=\"\">The Silicon Valley Bank Customer Profile<\/strong>","At the start, Silicon Valley Bank had an explosive growth, as many of its tech company clients were flourishing during the beginning of the pandemic. It took the risk of lending to risky tech startups and crypto firms that no one else would lend to. Its client base consisted of mostly extremely wealthy customers and it lent solely to this group, ignoring anyone else as the wealthy clients created the growth. <a href=\"https:\/\/www.npr.org\/2023\/03\/19\/1164531413\/bank-fail-how-government-bonds-turned-toxic-for-silicon-valley-bank\" data-v-f87c67ca=\"\">Its deposits tripled between 2020 and 2022, with billions and billions of dollars flowing in<\/a>. Silicon Valley Bank took all of those billions it earned from taking those risks and put them into what is supposed to be the least risky investment around: US government bonds.","<strong data-v-f87c67ca=\"\">Government Bonds<\/strong>","Bonds are normally seen as a risk free investment. Bonds are loans individuals give the government for a set period of time (3 months, 1 year, 10 years, etc.) At the end of the loan term, the government will pay back the debt along with interest. Although they are risk free, they are not super profitable, but the longer term bonds are more profitable as they pay out more interest at the end. SVB wanted the biggest payout and took the longest bond term to make the most money they could off of their investment into their wealthy clients. They poured billions into these long term bonds and once the billions were locked up they could not touch it for the 10 year period.","However, SVB did not predict the rising interest rates. The market value of bonds is directly tied to the interest rate. When interest rates go up, the market price of older bonds goes down because new bonds pay out higher interest rates. SVB bought these bonds when interest rates were at rock bottom and when interest rates started going up, the market value of Silicon Valley Bank's bonds went down.","<strong data-v-f87c67ca=\"\">Effects of Wealthy Clients<\/strong>","As mentioned earlier, SVB’s core customers were extremely wealthy individuals and companies. When rumors started up about the bank, customers panicked and started pulling their money out. Because they were rich individuals and companies, that meant multi-million, even multi-billion dollar accounts cashing out all at once. Silicon Valley Bank needed a lot of cash fast and a lot of its cash was locked up in 10 year bonds. Also, because the prices collapsed, banks were originating a product priced below its worth. A bank can't keep originating a product that costs more than its value to produce and sell it for less than what the raw materials are worth. Now it had to try and sell those at a loss to get cash.","Banks take money from the rich and lend it back to the rich. All banks want to lend money to rich people because it's easy to underwrite, or get the loan approved. However, the rich only comprise a small 5% of society and all banks want to solely lend to this 5%. This creates a massive supply and demand issue. There is limited supply of the rich and there is great demand from banks who want to lend to the rich. This supply demand problem caused an oversupply which then caused prices of these loans to collapse. But why does every bank want to lend to the rich? It isn't because they're discriminatory and it isn't because they hate the poor. It's just that the underwriting and approval process is easier. They don't have to worry about defaults as much.","<strong data-v-f87c67ca=\"\">Solving lending disparity with AI<\/strong>","Banks can reduce this supply and demand issue by introducing AI into the equation. AI makes it simple for banks to lend to everybody the same way as the technology is fast and able to calculate complex lending scenarios. Banks tend to prefer the client with steady income versus one with a less linear past. However, the AI alleviates this process of evaluating backgrounds of applicants. It ensures that the borrowers are processed the same way. It makes lending to a low income person working a couple of jobs with complexities in their financials be as operationally simple as lending to the applicant with a million dollars in his bank account. One example of a bank implementing this technology is a FinTech startup called Celligence. They have created an AI to assist banks and borrowers to review loans fast and simple for all borrowers. Banks do not like complexity and want easy returns on their money. AI ensures that everyone is given an equal playing field, not just the rich.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by SunWest<\/i><i data-v-f87c67ca=\"\">&nbsp;and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"First Republic","content":"ORGANIZATION"},{"type":"FinTech","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"America","content":"LOCATION"},{"type":"a million dollars","content":"MONEY"},{"type":"Signature Bank","content":"ORGANIZATION"},{"type":"SunWest","content":"ORGANIZATION"},{"type":"SVB","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Silicon Valley Bank Customer Profile","content":"ORGANIZATION"},{"type":"Wealthy Clients","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"}],"hashtag":[],"authors":["Megan Podgorski","The Block"]}