{"summary":"The SEC snapped back against Ripple’s assertion that a New York court should not allow the agency to appeal part of a high profile ruling. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/250024\/sec-snaps-back-against-ripple-in-push-for-an-interlocutory-appeal","publishDate":"2023-09-08T17:43:09","id":5537,"type":null,"title":"SEC snaps back against Ripple in push for an interlocutory appeal","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Securities and Exchange Commission snapped back against<a href=\"https:\/\/www.theblock.co\/post\/248839\/ripple-says-court-should-deny-sec-request-for-appeal\" data-v-f87c67ca=\"\"> Ripple’s assertion<\/a> that a New York court should not allow the agency to appeal part of a high profile ruling.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The agency first filed a <\/span><span class=\"s2\" data-v-f87c67ca=\"\">motion with the U.S. District Court in the Southern District of New York, asking it to certify for interlocutory appeal last month. The SEC argued on Friday that the interlocutory appeal would result in just one trial and wouldn't prolong the process.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The SEC, like the Court, has an institutional interest in the most efficient ultimate resolution of this litigation,\" the agency said. \"Defendants’ interest, by contrast, is to delay an ultimate resolution so that they may continue freely selling XRP into public markets without the disclosures that come with registration, to the tune of over $3 billion net ODL sales since 2020 alone.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">New York District Court Judge Analisa Torres <a href=\"https:\/\/www.theblock.co\/post\/239559\/sec-faces-wake-up-call-after-ripple-ruling-though-appeal-likely\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">ruled<\/span><\/a> in July that some of Ripple's sales, called programmatic, of XRP did not violate securities laws because of a blind bid process in place for them. She also ruled that other direct sales of the token to institutional investors were securities, leaving a partial win for the SEC.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC wants to appeal the part of the decision about the programmatic sales as well as \"other distributions\" that included offers and sales of XRP in exchange for goods and services.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Ripple has said the court should deny the SEC’s <a href=\"https:\/\/www.theblock.co\/post\/248839\/ripple-says-court-should-deny-sec-request-for-appeal\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">request<\/span><\/a> for appeal and said the court's summary judgment \"does not present a controlling question of law suitable for interlocutory appeal.\" <\/span><span class=\"s1\" data-v-f87c67ca=\"\">It argued that if the SEC is allowed to appeal, the regulator could \"seek to cross-appeal\" the court’s order involving institutional sales of XRP.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"That cross-appeal, too, will call for a review of the full record, not merely those parts the SEC wishes to emphasize,\" Ripple's lawyers said last week.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC cited multiple crypto cases throughout its filing including Terraform, where a judge rejected t<\/span><span class=\"s4\" data-v-f87c67ca=\"\">he idea that a Ripple Labs decision might invalidate the SEC's case against the payment platform.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Facing the direct conflict between Terraform and this Court’s Order, Defendants try to reduce Terraform and every other relevant case to its facts and ignore other courts’ reasoning and interpretation of Howey,\" the SEC said on Friday.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Court","content":"ORGANIZATION"},{"type":"$3 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"New York District Court","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Analisa Torres","content":"PERSON"},{"type":"Southern District of New York","content":"LOCATION"},{"type":"Howey","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"XRP","content":"ORGANIZATION"},{"type":"ODL","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}