{"summary":"Layer N has been testing its trading-focused Nord Engine ahead of the project’s planned public testnet launch next month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274816\/founders-fund-backed-layer-n-hits-120k-tps-in-testing-ahead-of-february-public-testnet","publishDate":"2024-01-30T10:18:11","id":554,"type":null,"title":"Founders Fund-backed Layer N hits 120K TPS in testing ahead of February public testnet","category":["CRYPTO ECOSYSTEMS"],"content":["Founders Fund-backed Layer N hit a peak of 120,000 transactions per second in testing ahead of its public testnet slated to launch in February.","Layer N is a Layer 2 network built on Ethereum that’s focused on supporting decentralized exchanges designed to replicate their centralized counterparts.","The testing was done on a closed testnet, according to a statement. It was done to check the performance of the project’s Nord Engine, which Layer N says was designed to enable a rollup to support high trading activity.&nbsp;","While the testnet hit a peak of 120,000 transactions per second, Layer N noted that it was able to handle 20,000 transactions per second over a sustained period.","Layer N CEO and co-founder Dima Romanov said the goal is to launch multiple optimized rollups, including its own version of the Ethereum Virtual Machine. He added that this would be compatible with the Nord Engine.","Looking further ahead, he imagined that developers creating exchanges on Layer N would be able to build native integrations that can plug into them. “Imagine if centralized exchanges we are all familiar with could allow developers to build applications directly on top of them. That’s what we are enabling,” he said.","Layer N uses EigenDA to store batched transaction data as part of being a rollup. This is cheaper than storing it directly on the Ethereum mainnet.&nbsp;","In September 2023, Layer N <a href=\"https:\/\/www.theblock.co\/post\/250785\/ethereum-layer-n-founders-fund-peter-thiel\" data-v-f87c67ca=\"\">raised $5 million<\/a> in a seed round co-led by Founders Fund and dao5. <span data-v-03de5780=\"\" data-v-f87c67ca=\"\">Other investors in the round included Kraken Ventures, Mirana Ventures, GSR and Amber Group.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dima Romanov","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"GSR","content":"ORGANIZATION"},{"type":"Amber Group","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"Nord Engine","content":"ORGANIZATION"},{"type":"Mirana Ventures","content":"ORGANIZATION"},{"type":"September 2023","content":"DATE"},{"type":"Kraken Ventures","content":"ORGANIZATION"},{"type":"$5 million","content":"MONEY"}],"hashtag":["DEXS"],"authors":["Tim Copeland","The Block"]}