{"summary":"Payment for order flow (PFOF) was less important for Robinhood&#x27;s bottom line in the second quarter.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/113198\/robinhoods-shrinking-reliance-on-payment-for-order-flow-reflects-the-growing-role-of-crypto-revenue","publishDate":"2021-08-03T15:48:23","id":5542,"type":null,"title":"Robinhood expects revenue increase despite drop in PFOF in Q2","category":["THE BLOCK"],"content":["It looks like payment for order flow is becoming less important to the now-public stock and crypto brokerage Robinhood, according to data compiled by The Block.&nbsp;","During the second quarter of the year, Robinhood reported in a 606 filing with the Securities and Exchange Commission that it brought in $217 million from payment for order flow (PFOF). PFOF refers to the process of brokers offloading their retail stock and options orders to large trading firms to internalize. Those trading firms pay for that order flow. It's controversial because some opponents say that practice introduces conflicts of interests, whereas proponents say it's helped bring down the cost to trade.&nbsp;","Robinhood has long been reliant on the practice for the bulk of its revenues, but it looks like that's changing given the data.","Robinhood's PFOF payments declined by ~35% from the first quarter of the year to the second. In Q1, it made $331 million from PFOF. Meanwhile, the firm is set to see its revenues increase from $522 million in the first quarter to an estimated $546 million to $574 million, reflecting an increase of 4.59% to 9.96%.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/public-companies\/robinhood-payment-for-order-flow\/embed\" title=\"Robinhood Payment for Order Flow\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","That indicates Robinhood has seen an increase in its transactional revenues outside of stock and options trading, specifically in transactional crypto revenues and lending from its margin and premium product, <a href=\"https:\/\/robinhood.com\/us\/en\/support\/my-account-and-login\/robinhood-gold\/\" data-v-f87c67ca=\"\">Robinhood Gold<\/a>. Clients of Robinhood Gold can trade with margin and have access to more in-depth market data, according to its website.","As for crypto, several sources told The Block the company has been eying a broad expansion of the unit, dubbed Robinhood Crypto, fueled in part by the outsize impact it's had on its bottom line.&nbsp;","Diversifying its business could prove to be beneficial in the event that regulators crackdown on PFOF. Indeed that is something that the firm noted in its S-1 as a risk:","\"If our customers begin to disfavor PFOF and Transaction Rebate practices generally or the specific market markers with whom we do business due to any negative media attention, they may have an adverse view of our business model and decide to limit or cease the use of our platform.\"","The Securities and Exchange Commission, led by chairman Gary Gensler, is expected to review the practice.","Robinhood had a shaky debut on the Nasdaq last week, falling by more than 10% during the course of the trading day. But it has since pared those losses and has surged during Tuesday's session, hitting nearly $47 a share — up more than 30% since Thursday.&nbsp;","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Robinhood Crypto","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"$217 million","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"$47","content":"MONEY"},{"type":"9.96%","content":"PERCENT"},{"type":"30%","content":"PERCENT"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"$546 million","content":"MONEY"},{"type":"first quarter","content":"DATE"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Robinhood Gold","content":"ORGANIZATION"},{"type":"Transaction Rebate","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"35%","content":"PERCENT"},{"type":"$522 million","content":"MONEY"},{"type":"$574 million","content":"MONEY"},{"type":"1","content":"DATE"},{"type":"second quarter","content":"DATE"},{"type":"$331 million","content":"MONEY"},{"type":"4.59%","content":"PERCENT"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["ROBINHOOD"],"authors":["Frank Chaparro","The Block"]}