{"summary":"Linktree will let users use NFTs as their profile pics and create links that can only be opened with NFTs, among other features.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/147396\/linktree-launches-new-nft-features-in-partnership-with-opensea","publishDate":"2022-05-17T14:42:12","id":5545,"type":null,"title":"Linktree launches new NFT features in partnership with OpenSea","category":["NFTS"],"content":["Linktree, a platform that allows creators to include all their social media links on one page, is launching NFT features, some of which are in partnership with NFT marketplace OpenSea.","The features include an NFT Gallery, which allows users to show off the NFTs they own; NFT profile pictures and background images; and NFT \"locks,\" a feature that lets creators lock access to certain links on their page that can only be unlocked by visitors who own the NFT.","It will also be possible to add an interactive link to an OpenSea collection. When visitors to the page hover over the link, it generates a preview of the OpenSea page. Linktree will rely on OpenSea and Metamask to verify NFTs on the platform.&nbsp;","<em data-v-f87c67ca=\"\">New Linktree layout&nbsp;<\/em>","The new integration \"allows users to prominently display the work they've created or proudly collected, now just one click away on Linktree,\" said <span class=\"xn-person\" data-v-f87c67ca=\"\">Ryan Foutty<\/span>, VP of Business Development at OpenSea, in a statement. \"We know many NFT creators and collectors already use Linktree to link to their collections on OpenSea, and we're excited that the Linktree integration makes NFT displays that much more seamless and engaging.\"","Many social media companies recently have also launched experiments in NFT profile pictures and other integrations. This month, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/145758\/meta-to-start-testing-digital-collectibles-on-instagram\" data-v-f87c67ca=\"\">Meta started to test digital collectibles<\/a> on a select group of creators in the US. Earlier this year, Twitter <a href=\"https:\/\/www.theblockcrypto.com\/post\/131052\/twitter-begins-rolling-out-access-to-nft-profile-pictures\" data-v-f87c67ca=\"\">also launched<\/a> an NFT profile picture feature which was also supported by the API of OpenSea.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"NFT Gallery","content":"ORGANIZATION"},{"type":"Ryan Foutty","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"OpenSea","content":"ORGANIZATION"},{"type":"VP of Business Development","content":"ORGANIZATION"},{"type":"API of OpenSea","content":"ORGANIZATION"}],"hashtag":[],"authors":["Anushree Dave","The Block"]}