{"summary":"Taiko launched its final testnet, Katla, before its expected mainnet release by the end of the first quarter of 2024.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/272585\/taiko-final-testnet-launch","publishDate":"2024-01-15T10:00:02","id":5555,"type":null,"title":"Taiko launches final testnet ahead of planned mainnet release in Q1","category":["LAYER 2S AND SCALING"],"content":["Ethereum Layer 2 rollup project Taiko has launched Katla — its final testnet before the expected mainnet, which is slated to go live by the end of the first quarter of 2024.","Katla, the sixth Taiko testnet from Taiko developers, introduces a new rollup design known as the <a href=\"https:\/\/taiko.mirror.xyz\/Z4I5ZhreGkyfdaL5I9P0Rj0DNX4zaWFmcws-0CVMJ2A\" data-v-f87c67ca=\"\">multi-proof based contestable rollup<\/a>. This combines elements of both Optimistic and ZK-rollups — expected to benefit decentralized applications requiring high throughput and cost efficiency.","In terms of its overall architecture and execution, Taiko is an Ethereum-equivalent <a href=\"https:\/\/www.theblock.co\/post\/222950\/polygon-labs-unveils-zkevm-layer-2-scaling-solution\" data-v-f87c67ca=\"\">ZK-EVM<\/a> (Type-1), which has the same compatibility as the Ethereum mainnet.","“We are excited to share this latest testnet with our community and partners, aiming to further enhance the scalability and security of the Ethereum network. Taiko is the first Layer 2 to test multiproof solutions in a public testnet,” said Daniel Wang, CEO of Taiko Labs.","Unlike Layer 2 rollups with centralized sequencers, Taiko claims to rely on Ethereum validators to sequence transactions and blocks — to gain its security and censorship resistance.","Taiko Labs, the team developing the Layer 2 network, <a href=\"https:\/\/www.theblock.co\/post\/233727\/taiko-raise-zkevm\" data-v-f87c67ca=\"\">raised $22 million<\/a> across two rounds earlier. The first was a $10 million seed round led by Sequoia China in 2022, and the second was a $12 million pre-Series A round led by Generative Ventures in 2023.","Other investors in the two rounds included IOSG Ventures, GSR, GGV Capital, and angel investors such as POAP founder Patricio Worthalter, Tim Beiko of the Ethereum Foundation, and Ethereum educator and investor Anthony Sassano.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"POAP","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Generative Ventures","content":"ORGANIZATION"},{"type":"GSR","content":"ORGANIZATION"},{"type":"$12 million","content":"MONEY"},{"type":"end of the first quarter of 2024","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Taiko","content":"ORGANIZATION"},{"type":"Anthony Sassano","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Patricio Worthalter","content":"PERSON"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Daniel Wang","content":"PERSON"},{"type":"Taiko Labs","content":"ORGANIZATION"},{"type":"$22 million","content":"MONEY"},{"type":"Tim Beiko","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"1","content":"DATE"},{"type":"$10 million","content":"MONEY"},{"type":"Sequoia China","content":"ORGANIZATION"}],"hashtag":["ZKEVM"],"authors":["Vishal Chawla","The Block"]}