{"summary":"Crypto wallet Zerion anticipates that its ZERO network will go live in Q2 or Q3 this year, offering free transactions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282597\/crypto-wallet-zerion-is-building-a-layer-2-network-that-aims-to-offer-zero-fees","publishDate":"2024-03-14T13:00:02","id":5556,"type":null,"title":"Crypto wallet Zerion is building a Layer 2 network that aims to offer zero fees","category":["CRYPTO ECOSYSTEMS"],"content":["Crypto wallet Zerion is working on its own Layer 2 network called the ZERO Network, which it plans to launch in late Q2 or early Q3 of this year.","<span data-v-f87c67ca=\"\">The network will be an <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.99%\n    <\/span><\/a> <!----><\/span><\/span>-based rollup, and its unique selling point is that it will be free to use. The project hopes that subsidized fees will improve user experience.&nbsp;<\/span>","“Ultimately we realized that for the end user, the fees should not exist,” said Zerion co-founder Evgeny Yurtaev. He said the idea of paying fees is striking and unfamiliar for anyone who’s entering the blockchain space.","The big question is how the economics of offering free transactions will work. Zerion claims that subsidizing the fees will represent a cost to the business that will decline over time as transaction fee improvements are made. Yurtaev pointed to the recent <a href=\"https:\/\/www.theblock.co\/post\/282236\/ethereum-dencun-upgrade-blobs\" data-v-f87c67ca=\"\">introduction of blobs<\/a>, which have <a href=\"https:\/\/www.theblock.co\/post\/282417\/ethereum-layer-2s-show-dramatic-drop-in-transaction-fees-after-dencun\" data-v-f87c67ca=\"\">dropped fees drastically<\/a> on Layer 2 networks.","“Our current assumption is that, with tens of thousands of dollars, we can sponsor millions of transactions and over the year, we're expecting that to go even lower,” said Yurtaev.","At the same time, Zerion anticipates that having its own network will increase awareness of its wallet and bring in additional revenue. Yurtaev said it could bring in new wallet users, who could end up paying fees when swapping through its app or by signing up for its premium services. This could then justify the cost of subsidizing the rollup.","“You can send some USDC to your friend for free and your friend is able to immediately start transacting on all of the different dapps that will be available on the Zero Network. In turn, all of that should create the network effect for the wallet itself.”","With the notion of a network offering free transactions, it’s possible that it will be targeted with spam. Zerion anticipates that it will need to check various factors relating to the wallet and the transaction in order to weed out spam. If it determines that a transaction counts as spam, it won’t subsidize the fee, but will still allow the user to pay for the transaction themselves.&nbsp;","Zerion also plans to work with dapp developers to share the cost of subsidizing transactions. Dapps will be able to pay for their users' fees on the network.","Zerion declined to comment on the technical specifications of the EVM-compatible Layer 2 network when asked which stack it would be built on. Yurtaev said Zerion is working with unspecified partners to launch on the network when it’s ready. It's still in discussions with which data availability layer it will be using.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Zerion","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"tens of thousands of dollars","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"ZERO Network","content":"ORGANIZATION"},{"type":"-0.99%","content":"PERCENT"},{"type":"Yurtaev","content":"PERSON"},{"type":"Zerion","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Evgeny Yurtaev","content":"PERSON"}],"hashtag":["ROLLUPS"],"authors":["Tim Copeland","The Block"]}