{"summary":"Haru Invest has suspended deposit and withdrawal requests until further notice as of 12:40 a.m. UTC today.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234366\/haru-invest-deposit-withdrawal-suspension","publishDate":"2023-06-13T03:11:32","id":5564,"type":null,"title":"Haru Invest suspends deposit and withdrawal requests","category":["EXCHANGES"],"content":["Haru Invest has suspended deposit and withdrawal requests until further notice as of 12:40 a.m. UTC today.","\"Recently, we have come across a certain issue with one of the service partners we have worked with,\" the South Korea-founded and Singapore-based crypto investment platform <a href=\"https:\/\/haruinvest.com\/blog\/important-update-june-13-2023\/\" data-v-f87c67ca=\"\">explained<\/a>, adding: \"We are now further investigating the issue with them and seeking the contingency plan to rectify the situation.\" It has not shared further information on the service partners in question.","\"For the purpose of protecting our users’ assets under our custody, we have come to make a tough decision that any deposit and withdrawal requests will be suspended until further notice,\" it declared.","The platform's co-founder and former CTO, Eunkwang Joo, <a href=\"https:\/\/twitter.com\/jooddang\/status\/1668444998348726273\" data-v-f87c67ca=\"\">tweeted<\/a> that there may be a situation developing internally at the company but suspects it is not malicious.","CEO Hyung-soo Lee <a href=\"https:\/\/www.mk.co.kr\/news\/economy\/10758726\" data-v-f87c67ca=\"\">issued<\/a> a statement that claims the company's Seoul office is empty for employee-safety reasons.","Haru Invest's claims to have more than 80,000 members across more than 140 countries. Its official website also advertises up to 12% yield on its Earn Plus product.","The company, in a subsequent <a href=\"https:\/\/twitter.com\/haruinvest\/status\/1668634892203352064?s=46&amp;t=yoL7WJcO9vZ3TjSE2j6FRQ\" data-v-f87c67ca=\"\">update<\/a>, said it had \"discovered through our internal inspection process that certain information provided by a consignment operator was suspected to be false.\" It's currently engaged in a \"fact-finding process\" and committed to protecting investors.","\"We will provide you with further updates as soon as it's available,\" the company added. It said some press reports about a suspected \"rug pull\" were \"not true at all.\"","<em data-v-f87c67ca=\"\">Updated to provide additional information.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"Eunkwang Joo","content":"PERSON"},{"type":"12:40 a.m.","content":"TIME"},{"type":"Singapore","content":"LOCATION"},{"type":"Hyung","content":"PERSON"},{"type":"soo Lee","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"12%","content":"PERCENT"},{"type":"CTO","content":"ORGANIZATION"},{"type":"Seoul","content":"LOCATION"}],"hashtag":[],"authors":["Adam James","The Block"]}