{"summary":"Blockchain, the cryptoasset wallet provider, is partnering with Ledger, the crypto custody provider, to launch a custom hardware device, Lockbox, which is","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/2215\/blockchain-partners-with-ledger-to-develop-custom-hardware-device","publishDate":"2018-10-25T09:00:18","id":5565,"type":null,"title":"Blockchain partners with Ledger to develop custom hardware device","category":["STARTUPS"],"content":["Blockchain, the cryptoasset wallet provider, is partnering with Ledger, the crypto custody provider, to launch a custom hardware device, <a href=\"https:\/\/www.blockchain.com\/lockbox\" data-v-f87c67ca=\"\">Lockbox<\/a>, which is exclusively compatible with the Blockchain Wallet.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>The Lockbox offers hardware and software products that enable Blockchain’s nearly 30 million users to securely store their cryptoassets offline.","“The Lockbox is a reflection of what our companies both do best. We’ve created an elegant software and hardware integration that offers more functionality than previously existed in our space. We’re thrilled to offer the Lockbox to Blockchain users so they can easily manage their funds online and offline seamlessly,” said Peter Smith, CEO, and Co-Founder of Blockchain.","“With stories about crypto hacking continuing to dominate headlines, it’s obvious that security must be top of mind for all stakeholders in the crypto space,” said Pascal Gauthier, President of Ledger.","As a part of their announcement, Blockchain is also unveiling its Swap, a new trading and liquidity product for Blockchain users. Users can access Swap to exchange cryptoassets directly from their hardware devices and Blockchain Wallet. \"You'll be able to trade directly from the Lockbox now at high-limits. So you'll be able to just go on, you do one link with your ledger, make the trade, you'll get a notification on your app on your phone that the trade has completed when it is completed,\" said Smith.&nbsp;Existing users and owners of Ledger devices will be able to pair their device to the Blockchain Wallet to access the user interface and Swap features provided by Blockchain.","Blockchain's partnership with Ledger comes at a time when Trezor, Ledger's closest competitor in the hardware wallet space, is also ramping up the add-on services it provides. Most recently, Trezor <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/trezor-users-can-now-exchange-cryptoassets-directly-in-their-wallet\/\" data-v-f87c67ca=\"\">announced the release of its \"Exchanges\"<\/a>&nbsp;feature, which enables Trezors&nbsp;users to trade cryptoassets directly from their Trezor devices.&nbsp;Still, Blockchain‘s new offering is unique because it leverages a large network of liquidity providers beyond just crypto exchanges. According to Smith, this enables Blockchain's users to get access to the best possible prices for their assets.","Blockchain has recently experimented with a host of new offerings including an <a href=\"https:\/\/blog.blockchain.com\/2018\/06\/28\/blockchain-launches-institutional-product-blockchain-principal-strategies\/\" data-v-f87c67ca=\"\">institutional&nbsp;data and research platform <\/a>and <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/cryptocurrency-wallet-provider-blockchain-announces-airdrop-program\/\" data-v-f87c67ca=\"\">an Airdrop services<\/a>. The release of Lockbox and Swap shows the company’s push to become more than a software cryptoasset wallet.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Trezor","content":"ORGANIZATION"},{"type":"Ledger","content":"ORGANIZATION"},{"type":"Blockchain Wallet","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Peter Smith","content":"PERSON"},{"type":"Pascal Gauthier","content":"PERSON"},{"type":"Lockbox","content":"LOCATION"},{"type":"Smith","content":"ORGANIZATION"},{"type":"Smith","content":"PERSON"},{"type":"Blockchain","content":"PERSON"}],"hashtag":[],"authors":["Steven Zheng","The Block"]}