{"summary":"After Grayscale’s recent move, Xapo clients don’t see Coinbase Custody as a “comparable service&quot;. Grayscale Investments moved $2.7 billion worth of cryptocurrencies from Xapo’s wallet to Coinbase Custody, which market observers speculated was part of the acquisition.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/35927\/crypto-custodian-bitgo-says-xapo-clients-are-extremely-concerned-about-coinbase-deal","publishDate":"2019-08-14T09:03:14","id":5581,"type":null,"title":"BitGo says Xapo clients are &#x27;extremely concerned&#x27; about Coinbase deal","category":["CUSTODY"],"content":["Cryptocurrency custodian BitGo is eyeing the business looking to rival Coinbase Custody via an ongoing acquisition of Xapo's institutional business.&nbsp;","In a blog post on Wednesday, BitGo said that Xapo's clients are <span data-v-f87c67ca=\"\">“extremely concerned,” and that they don't see Coinbase Custody as a \"comparable service,\" as the exchange moves to <\/span>acquire Xapo. In response to those concerns, BitGo said it is now offering “qualifying” clients 12-months of no-fee custody service. The offer is valid through the end of September, per the blog post.","As&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/2019\/05\/16\/coinbase-in-advanced-talks-to-acquire-xapo-sources\/\" data-v-f87c67ca=\"\">The Block reported<\/a> in May, Coinbase was in late talks to acquire parts of Xapo's business. The cryptocurrency exchange was in a neck-and-neck race with Fidelity Digital Assets for the deal, according to a source. BitGo also considered the deal.&nbsp;","The deal has not been confirmed, but earlier this month cryptocurrency assets manager Grayscale Investments moved $2.7 billion worth of cryptocurrencies from Xapo’s wallet to Coinbase Custody, which market observers speculated was part of the acquisition.","In any case, BitGo says that Xapo clients, who apparently reached out to the firm, are \"concerned about the safety of their digital assets.\"","Xapo reportedly holds around 700,000 bitcoins (worth $7.3 billion at today’s price) under its custody via a cold storage vault. Xapo also does not charge customers a fee for storing their bitcoin, rather it generates revenue by enabling over-the-counter (OTC) trades for customers using bitcoin under its custody.","Rival BitGo, on the other hand, reportedly has $2 billion in assets under its custody and charges fees. But the firm’s CEO Mike Belshe told The Block recently that as the competition in the space increases, fees for custody won’t just fall, but actually crash to zero. “I do believe it’s driving towards a very low price, maybe zero,” Belshe said.","The cryptocurrency custody market has indeed been seeing increased competition. Earlier this year, financial services giant Fidelity ventured into the space. Much-awaited crypto exchange Bakkt is also set to launch with its own storage capabilities, having acquired Digital Asset Custody Company.","A Coinbase representative was not available for comment at press time but we will update this story if we hear back.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"fall","content":"DATE"},{"type":"Mike Belshe","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Coinbase Custody","content":"ORGANIZATION"},{"type":"Grayscale Investments","content":"ORGANIZATION"},{"type":"Fidelity Digital","content":"ORGANIZATION"},{"type":"Belshe","content":"PERSON"},{"type":"Xapo","content":"PERSON"},{"type":"$2.7 billion","content":"MONEY"},{"type":"$7.3 billion","content":"MONEY"},{"type":"Xapo","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Digital Asset Custody Company","content":"ORGANIZATION"},{"type":"$2 billion","content":"MONEY"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}