{"summary":"Terraform Labs founder Do Kwon, who is wanted by South Korean authorities, is not in the city-state, Reuters reported.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/170896\/do-kwon-is-not-in-singapore-according-to-police-reuters","publishDate":"2022-09-17T13:21:18","id":5585,"type":null,"title":"Do Kwon is not in Singapore, according to police: Reuters","category":["ASIA"],"content":["Singapore police said in a statement late Saturday that Terraform Labs founder Do Kwon, who is wanted by South Korean authorities, is not in the city-state, according to reporting by Reuters.","Singapore police are willing to assist South Korea \"within the ambit of its domestic legislation and international obligations,\" according to the report.","On Wednesday, a South Korean court issued an <a href=\"https:\/\/www.theblock.co\/post\/169825\/south-korean-court-issues-warrant-for-do-kwons-arrest\" data-v-f87c67ca=\"\">arrest warrant<\/a> for the crypto project founder, four months after <a href=\"https:\/\/www.theblock.co\/post\/146444\/terra-luna-and-ust-how-we-got-here\" data-v-f87c67ca=\"\">the collapse of the Terra ecosystem<\/a>, its native luna token and its TerraUSD algorithmic stablecoin — which together wiped out about $40 billion in value.&nbsp;","The next day, South Korean prosecutors asked the country’s Foreign Ministry to <a href=\"https:\/\/www.theblock.co\/post\/170338\/south-korean-authorities-seek-to-invalidate-do-kwons-passport-munhwa\" data-v-f87c67ca=\"\">invalidate his passport<\/a>, so the crypto developer would be unable to travel.","Do Kwon's last known whereabouts were reportedly in Singapore. He is still active on social media, tweeting Saturday: \"One can tell a lot about a society by the way it raises its young and buries its dead.\"","Do Kwon did not respond to a message seeking comment at the time of publication.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"Kwon","content":"PERSON"},{"type":"Saturday","content":"DATE"}],"hashtag":[],"authors":["Mike Millard","The Block"]}