{"summary":"There&#x27;s a &quot;good chance&quot; quantitative trading firm Jane Street owns the wallet behind the stablecoin&#x27;s de-pegging, Wintermute&#x27;s head of research tweeted.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215696\/jane-street-wallet-ust-depeg-wintermute","publishDate":"2023-02-28T08:26:11","id":5588,"type":null,"title":"Jane Street wallet may have been linked to UST depeg, Wintermute researcher says","category":["CRYPTO ECOSYSTEMS"],"content":["The wallet associated with last year's TerraUSD (UST) depeg might belong to trading firm Jane Street, Wintermute Head of Research Igor Igamberdiev said in <a href=\"https:\/\/twitter.com\/FrankResearcher\/status\/1630545591397670916\" data-v-f87c67ca=\"\">Twitter thread<\/a> on Tuesday.","Based on transaction analysis, Igamberdiev said there is a \"good chance\" the wallet is related to Jane Street. Clearpool <a href=\"https:\/\/twitter.com\/FrankResearcher\/status\/1630545594145021953?s=20\" data-v-f87c67ca=\"\">announced<\/a> on May 3 of last year that Jane Street borrowed 25 million USDC from BlockTower using its permissioned lending pool — based on this, he identified three<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\"> addresses belonging to the trading firm; one was of particular interest, dubbed Wallet A.<\/span>","<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">The same wallet borrowed $25 million again two weeks later before depositing it into a Coinbase wallet. The wallet in question received 84.5 million USDC from the UST de-pegger, Igamberdiev noted, before adding, the wallet didn't have any other interactions other than these deposits, meaning its \"highly likely to belong to the same entity.\"<\/span>","Jane Street did not immediately respond to an email requesting comment. A person who answered a call placed to the firm's UK office said they would pass on our message.&nbsp;","Igamberdiev noted the wallet held UST on Anchor for a month, adding that \"it wouldn't necessarily mean that Jane Street had malicious intent.\"","The TerraUSD stablecoin, often known by its ticker UST, collapsed in May 2022, wiping out tens of billions of dollars for investors.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"May 3 of last year","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"May 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Igamberdiev","content":"PERSON"},{"type":"Wallet A.","content":"ORGANIZATION"},{"type":"$25 million","content":"MONEY"},{"type":"tens of billions of dollars","content":"MONEY"},{"type":"Wintermute Head of Research Igor Igamberdiev","content":"ORGANIZATION"},{"type":"Jane Street","content":"PERSON"},{"type":"UST","content":"ORGANIZATION"},{"type":"two weeks later","content":"DATE"}],"hashtag":["INVESTMENT FIRMS"],"authors":["Adam Morgan McCarthy","The Block"]}