{"summary":"Coinbase shares fell shortly after the open after Cowen analysts downgraded the stock and cut their price target, citing dwindling retail volumes, lower revenue expectations and a harsh regulatory environment. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/199424\/coinbase-shares-drop-10-as-cowen-downgrades-stock-and-slashes-price-target","publishDate":"2023-01-05T11:18:48","id":5593,"type":null,"title":"Coinbase shares drop 10% as Cowen downgrades stock and slashes price target","category":["COMPANIES"],"content":["Coinbase shares fell shortly after the open as Cowen analysts downgraded the stock and cut their price target, citing dwindling retail volumes, lower revenue expectations and a harsh regulatory environment.&nbsp;","Shares in the crypto exchange were trading at $33.26 by 10:40 a.m. EST, down over 11%, according to Nasdaq data.&nbsp;","<em data-v-f87c67ca=\"\"><a href=\"https:\/\/www.tradingview.com\/symbols\/NASDAQ-COIN\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">COIN chart by TradingView <\/span><\/a><\/em>","Cowen analysts downgraded the stock to market perform from outperform, citing reduced revenue estimates, low visibility for stabilization in retail trading volumes and potential SEC enforcement action post-FTX. The firm also slashed its price target to $36 from $75.","Coinbase shares had risen 12% yesterday following a settlement with the New York Department of Financial Services (NYDFS) in which the exchange agreed to pay a $50 million fine and invest another $50 million in its compliance program.","Cowen's Stephan Glagola and George Kuhle lowered their revenue estimates for 2023 by around 40% to $2.1 billion from $3.6 billion.","The firm also lowered expectations for adjusted earnings before interest, taxes, depreciation, and amortization (EBITDA) to a loss of $361 million from an expected loss of $61 million.&nbsp;","Trading volumes have fallen consistently since November 2021, when bitcoin reached an all-time high just below $69,000, and there is a low chance of this stabilizing or rebounding in 2023, according to Cowen. Analysts cited the turbulent macroeconomic backdrop and contagion risks on crypto asset prices relating to FTX.&nbsp;","Utilizing Nomics data, Cowen now assumes total trading volumes of $420 billion in 2023, which would represent a drop of 49% year-on-year.&nbsp;","Regulatory concerns will persist in 2023, according to Cowen analysts.&nbsp;","Cowen's Washing Research Group analyst Jaret Seiberg holds that the SEC must bring enforcement actions against trading platforms in the first quarter of 2023 before Chair Gensler testifies before Congress.","There is a risk to a material portion of the exchange's non-bitcoin or ether trading volumes and assets under custody, which could be deemed securities by regulators, according to the report.","\"There is also uncertainty on the impact any potential separation of custody and exchange\/trading would have on the company, potentially severing custodial fee revenue,\" analysts wrote.","Seiberg doesn't see Congress enacting crypto legislation this year. He said hearings will offer insight into what may become law in 2024 and \"believes there is a risk that Congress will over-regulate on crypto legislation in the next two years.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$75","content":"MONEY"},{"type":"TradingView","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"12%","content":"PERCENT"},{"type":"$36","content":"MONEY"},{"type":"George Kuhle","content":"PERSON"},{"type":"40%","content":"PERCENT"},{"type":"$3.6 billion","content":"MONEY"},{"type":"Gensler","content":"PERSON"},{"type":"49%","content":"PERCENT"},{"type":"November 2021","content":"DATE"},{"type":"$2.1 billion","content":"MONEY"},{"type":"Washing Research Group","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"10:40 a.m. EST","content":"TIME"},{"type":"2024","content":"DATE"},{"type":"$420 billion","content":"MONEY"},{"type":"Congress","content":"ORGANIZATION"},{"type":"11%","content":"PERCENT"},{"type":"$69,000","content":"MONEY"},{"type":"$61 million","content":"MONEY"},{"type":"first quarter of 2023","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Stephan Glagola","content":"PERSON"},{"type":"New York Department of Financial Services (NYDFS)","content":"ORGANIZATION"},{"type":"$361 million","content":"MONEY"},{"type":"$33.26","content":"MONEY"},{"type":"Cowen","content":"ORGANIZATION"},{"type":"Jaret Seiberg","content":"PERSON"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":[],"authors":["Adam Morgan McCarthy","The Block"]}