{"summary":"Following the U.S. approval, Hong Kong could be the next hub in Asia to introduce a spot crypto ETF, regional experts said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/271810\/bitcoin-etf-approvals-bigger-impact-on-asia-says-animoca-yat-siu","publishDate":"2024-01-10T23:42:12","id":5594,"type":null,"title":"Bitcoin ETF approvals may have bigger impact on Asia, says Animoca cofounder Yat Siu","category":["FINANCE FIRMS"],"content":["<span data-v-f87c67ca=\"\">The long-awaited <\/span><a href=\"https:\/\/www.theblock.co\/post\/271718\/spot-bitcoin-etfs-have-now-been-approved-what-comes-next\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">spot bitcoin ETF approval<\/span><\/a><span data-v-f87c67ca=\"\"> earlier today in the U.S. will likely have a bigger impact on crypto development in Asia, co-founder of Hong Kong-based crypto venture capital firm Animoca Brands, Yat Siu told The Block in an interview Wednesday.<\/span>","<span data-v-f87c67ca=\"\">This landmark approval from the U.S. Securities and Exchange Commission — whose chair Gary Gensler <\/span><a href=\"https:\/\/www.theblock.co\/post\/271755\/gary-gensler-hasnt-changed-his-tone-on-crypto-even-with-sec-approval-of-spot-bitcoin-etfs\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">holds a rather unfavorable view<\/span><\/a><span data-v-f87c67ca=\"\"> towards crypto — is expected to create a rush of new capital into the industry as spot bitcoin ETFs will act as a safer and more secure vehicle for the crypto-curious, industry leaders said.<\/span>","<span data-v-f87c67ca=\"\">While the SEC’s decision may drive businesses around the world to look for ways to partake in this opportunity, Siu said that the way crypto regulation has been moving forward in Asia signifies that the U.S. ETF approval will positively impact the region more than others.<\/span>","<span data-v-f87c67ca=\"\">“There's regulatory clarity and there's this willingness from, basically governments and regulators to sort of build this ecosystem and partake and see the opportunities that [are] out there,” Siu added.<\/span>","<span data-v-f87c67ca=\"\">Even as the SEC announced the ETF approval, its chair <\/span><a href=\"https:\/\/www.theblock.co\/post\/271755\/gary-gensler-hasnt-changed-his-tone-on-crypto-even-with-sec-approval-of-spot-bitcoin-etfs\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Gary Gensler stood by his stance<\/span><\/a><span data-v-f87c67ca=\"\"> on crypto where he said the decision “should in no way signal the Commission’s willingness to approve listing standards for crypto asset securities.”<\/span>","<span data-v-f87c67ca=\"\">Siu pointed out that Asian investors, especially the younger generation, tend to have a more open view towards capitalism on average compared to those in the U.S. “If I was to put sort of a comment around this, I would say that the American dream is more alive and well in Asia than it is in America,” he said.<\/span>","<span data-v-f87c67ca=\"\">“In Asia, even though there's also, of course, inequity, capitalism has broadly been of benefit to this and the last generation,” Siu commented. “I mean, look at China, look at South Korea, Southeast Asia, just generally speaking, these are all countries that 30 years ago were literally nowhere, like they had nothing, in many cases,” the Animoca co-founder explained.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Brian Hoonjong Baik, co-founder and chief operating officer of crypto management platform SmashFi, bolstered the view of U.S. spot bitcoin ETF approval’s major impact on Asia. “Asian investors have always been more adventurous than their Western counterparts, right from bitcoin's early days. An ETF would be like a perfect marriage between crypto and regulation, easing worries for institutional investors who've been looking for a legitimate way to build a crypto portfolio.”<\/span>","<span data-v-f87c67ca=\"\">Chong Kok Kee, CEO of AsiaNext, an institution-only crypto exchange, explained that <\/span><a href=\"https:\/\/www.chainalysis.com\/blog\/2023-global-crypto-adoption-index\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">crypto adoption in Asia<\/span><\/a><span data-v-f87c67ca=\"\"> is higher than other continents, with Central and South Asia being the top regions. “The Asian market, known for its preference for stable investments, might see a mindset shift in viewing crypto as an investment asset besides its transactional purpose, as the ETF provides a regulated and lower-risk avenue for investment exposure to cryptocurrencies,” Chong said.<\/span>","<span data-v-f87c67ca=\"\">Following the U.S. ETF approval, which Coinbase dubbed a <\/span><a href=\"https:\/\/www.theblock.co\/post\/271778\/coinbase-calls-spot-bitcoin-etf-approval-watershed-moment\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">“watershed moment”<\/span><\/a><span data-v-f87c67ca=\"\"> for crypto, Asian jurisdictions may next push out such spot crypto products.<\/span>","<a href=\"https:\/\/www.theblock.co\/post\/268582\/industry-leaders-see-hong-kong-as-next-bitcoin-etf-hub-amid-us-approval-anticipation\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Hong Kong<\/span><\/a><span data-v-f87c67ca=\"\">, which underwent a major regulatory renewal last year to reclaim its position as the region’s crypto hub, could be next to introduce a spot crypto ETF in Asia, several regional experts suggested.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“In Asia, Hong Kong is definitely the prime candidate for the next spot crypto ETF. Aligning with its crypto hub ambitions, Hong Kong regulators have already sent a clear message that there is an appetite to consider spot crypto ETFs, including for retail,” Angela Ang, a former Monetary Authority of Singapore regulator and senior policy advisor at blockchain intelligence firm TRM Labs, told The Block. <\/span>","<span data-v-f87c67ca=\"\">“The next step is aligning regulatory and industry expectations on controls and compliance, in order to make this a reality,” Ang added.<\/span>","<span data-v-f87c67ca=\"\">It appears that Hong Kong, a financial hub and a regulatory testbed for China, is already on the move. Livio Weng, COO of Hong Kong-based crypto exchange HashKey, said Wednesday that 10 fund managers, including those backed by Chinese capital, are <\/span><a href=\"https:\/\/www.theblock.co\/post\/271458\/hong-kong-asset-managers-spot-crypto-etf-hashkey\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">looking into launching spot crypto ETFs<\/span><\/a><span data-v-f87c67ca=\"\"> in the city.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In December, Hong Kong’s Securities and Futures Commission and the Hong Kong Monetary Authority, the city’s de facto central bank, <\/span><a href=\"https:\/\/www.theblock.co\/post\/268981\/hong-kong-says-its-ready-to-accept-spot-crypto-etf-applications\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">announced<\/span><\/a><span data-v-f87c67ca=\"\"> that both agencies have reviewed their existing policy. The regulators published two <\/span><a href=\"https:\/\/apps.sfc.hk\/edistributionWeb\/gateway\/EN\/circular\/doc?refNo=23EC67\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">circulars<\/span><\/a><span data-v-f87c67ca=\"\"> addressing the requirements for spot crypto ETFs.<\/span>","<span data-v-f87c67ca=\"\">Johnny Ng, a Hong Kong lawmaker, said today on X that Hong Kong should <\/span><a href=\"https:\/\/www.theblock.co\/post\/271813\/hong-kong-lawmaker-calls-for-swift-action-following-us-spot-bitcoin-etf-greenlight\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">“take the lead” in the crypto space<\/span><\/a><span data-v-f87c67ca=\"\"> by introducing spot crypto ETFs. “I hope that Hong Kong, amidst rapid development and intense competition in the virtual asset sector, can swiftly secure a position globally, particularly by taking the lead in implementing relevant policies and products in Asia,” he added.<\/span>","<span data-v-f87c67ca=\"\">Singapore, another major financial hub, could also be a potential contender for the spot crypto ETF race in Asia. “Singapore’s mature regulatory environment has positioned itself as a mature and leading jurisdiction to oversee structured spot crypto products,” said Wayne Huang, co-founder and group CEO of Taiwan-headquartered crypto exchange XREX.<\/span>","<span data-v-f87c67ca=\"\">Ko Jangdeok, CEO of SBINFT, the non-fungible token subsidiary under the Japanese financial services conglomerate SBI Group, expects significant regulatory movement in Japan in the near future. “The approval of spot ETFs in the U.S. is likely to have a highly positive impact on policymakers in Japan. It wouldn't be surprising to witness an acceleration in discussions about a ‘Japanese version of an ETF.’”<\/span>","<span data-v-f87c67ca=\"\">Nevertheless, there are still variables for Asia in launching its spot crypto ETFs. One may be the employment of capital inflows in Asia compared to the vast amount in the U.S. “The United States has a well-established foundation in this aspect. Although Asia is not inferior, the success factor lies in how effectively the finance sector and funds can be integrated,” Ko said.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Another factor lies in how progressive the <\/span><a href=\"https:\/\/www.theblock.co\/post\/264953\/year-end-crypto-regulatory-roundup-asia-takes-center-stage\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">region’s regulators<\/span><\/a><span data-v-f87c67ca=\"\"> will be, as the crypto industry is still battling unpredictable volatility and trust issues from hacks and bankruptcies.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Hong Kong and Singapore have become more cautious in encouraging retail participation in virtual assets investments, especially after the two cities’ residents suffered losses, from the likes of JPEX in Hong Kong and the collapse of FTX,” said Patricia Ho, general counsel of Scroll, an Ethereum Layer 2 network.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“In the short term, we may also be seeing more enforcement in Hong Kong, which may dampen investor appetite. In the medium and longer term, I expect that there will be a pick up in interest and investor appetite in virtual assets locally, with bitcoin halving, approval of virtual assets trading platforms by SFC and new Hong Kong stablecoin regulations later this year,\" Ho added.<\/span>","<span data-v-f87c67ca=\"\">Asset managers in Hong Kong may consider rolling out products through a fund-of-funds structure to provide their investors with exposure to bitcoin, as suggested by Glenn Woo, head of sales of APAC at web3 infrastructure firm Blockdaemon.<\/span>","<span data-v-f87c67ca=\"\">“Hong Kong ETF issuers have the option to create a 'fund of funds,' which basically wraps an ETF from outside of Hong Kong,” said Woo, who has over a decade of experience in the traditional financial industry in Hong Kong. “I can see that thematic ETFs, such as technology [or] blockchain ETFs, through a fund-of-funds structure, would be able to actually put these bitcoin ETFs into a basket.”<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"TRM Labs","content":"ORGANIZATION"},{"type":"South Korea","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Hong Kong Monetary Authority","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Johnny Ng","content":"PERSON"},{"type":"U.S. ETF","content":"ORGANIZATION"},{"type":"APAC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Asia","content":"LOCATION"},{"type":"Angela Ang","content":"PERSON"},{"type":"Taiwan","content":"LOCATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Animoca","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Siu","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Glenn Woo","content":"PERSON"},{"type":"Wayne Huang","content":"PERSON"},{"type":"Southeast Asia","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Commission","content":"ORGANIZATION"},{"type":"The United States","content":"LOCATION"},{"type":"earlier today","content":"DATE"},{"type":"SFC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"South Asia","content":"LOCATION"},{"type":"today","content":"DATE"},{"type":"Yat Siu","content":"PERSON"},{"type":"Chong Kok Kee","content":"PERSON"},{"type":"America","content":"LOCATION"},{"type":"December","content":"DATE"},{"type":"Japan","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Futures Commission","content":"ORGANIZATION"},{"type":"Blockdaemon","content":"ORGANIZATION"},{"type":"ETF","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Monetary Authority of Singapore","content":"ORGANIZATION"},{"type":"Chong","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"SBI Group","content":"ORGANIZATION"},{"type":"Patricia Ho","content":"PERSON"},{"type":"Brian Hoonjong Baik","content":"PERSON"},{"type":"China","content":"LOCATION"}],"hashtag":["ASIAN REGULATION","CRYPTO","SPOT BITCOIN ETF","TRADFI BANKS"],"authors":["Danny Park","Timmy Shen","The Block"]}