{"summary":"State Street wants to send a message to Wall Street: the custodial banking firm is serious about digital assets. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/108214\/state-street-stands-up-new-crypto-unit-as-it-eyes-potential-custody-defi-products","publishDate":"2021-06-11T15:14:09","id":5596,"type":null,"title":"State Street stands up new crypto unit as it eyes potential custody, DeFi products","category":["INSTITUTIONAL INVESTORS"],"content":["State Street wants to send a message to Wall Street: the custodial banking firm is serious about digital assets.&nbsp;","To that end, it's built up an entirely new business unit dedicated to digital assets, tokenization, and cryptocurrency assets. Announced Thursday, the new unit — dubbed State Street Digital — will be led by Nadine Chakar, an executive Vice President at the firm.&nbsp;","\"It's a real sign of commitment from our CEO,\" Chakar said, referring to Ron O'Hanley, who in a statement said that digital assets are becoming an important part of the broader financial services industry.&nbsp;","\"The objective is to evolve the platform into a multi-asset platform to support crypto assets among other asset classes,\" O'Hanley said.&nbsp;","In a sense, State Street's new unit — staffed by 400 employees — continues much of its previous work in the digital asset market. The firm has partnered with a number of companies offering bitcoin products, serving as the administrator for a planned bitcoin ETF set to list on the Frankfurt Stock Exchange. It is also the appointed transfer agent for VanEck's Bitcoin Trust.","Still, the firm has historically shied away from talking about entering the bitcoin custody market, which has seen interest from firms ranging from <a href=\"https:\/\/www.ft.com\/content\/d90ed3bf-2c8d-46c9-98b7-67859f6598e5\" data-v-f87c67ca=\"\">Citigroup<\/a> to <a href=\"https:\/\/www.theblockcrypto.com\/daily\/82334\/jpmorgan-digital-asset-custody-subcustody\" data-v-f87c67ca=\"\">JPMorgan<\/a>. Chakar told The Block that custody is on the firm's radar and it would launch such a product, pending the necessary regulatory approval.&nbsp;","\"We are building and will deploy at the right time,\" Chakar said.&nbsp;","For now, on the crypto front, the firm will continue to offer its fund administration services and offer clients a white label software service that allows clients to trade across various liquidity venues. The list of clients interested in these products appears to be extensive.&nbsp;","\"We don't trade on our balance sheet, it's a white-labeled solution,\" Chakar described.&nbsp;","She went on to say:","\"There are new cryptocurrency types of funds that are launching, asset managers looking at maybe launching index funds. We are also seeing endowments and foundations looking for assistance as they are getting grants and pledges in crypto.\"&nbsp;","There's also interest from corporates, which are considering allocating to bitcoin on their balance sheet, following in the footsteps of electric chief executives like Elon Musk at Tesla and Michael Saylor at MicroStrategy.&nbsp;","\"We're still at this stage with clients dipping their toes in the water and they are desperate for knowledge,\" Chakar added.","Still, the firm might be playing catch-up, as reported by <a href=\"https:\/\/www.coindesk.com\/state-street-bank-launches-dedicated-cryptocurrency-division\" data-v-f87c67ca=\"\">CoinDesk<\/a>. Competitors like BNYMellon have already announced cryptocurrency units, while State Street has yet to publicize a target date for such a launch.&nbsp;","As for its other ambitions, the firm could give a facelift to its existing GlobalLink platform to support a form of peer-to-peer cryptocurrency trading to allow institutions to test the DeFi market.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ron O'Hanley","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Tesla","content":"LOCATION"},{"type":"Frankfurt Stock Exchange","content":"ORGANIZATION"},{"type":"Citigroup","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Nadine Chakar","content":"PERSON"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"State Street Digital","content":"ORGANIZATION"},{"type":"VanEck's Bitcoin Trust","content":"ORGANIZATION"},{"type":"Chakar","content":"PERSON"},{"type":"O'Hanley","content":"PERSON"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"State Street","content":"ORGANIZATION"},{"type":"Michael Saylor","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}