{"summary":"Gunzilla Games announces integration with OpenSea that aims to help players easily trade gaming assets usable on PlayStation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287094\/gunzillas-new-playstation-game-features-crypto-asset-trading-on-opensea","publishDate":"2024-04-09T09:00:04","id":56,"type":null,"title":"PlayStation game by Gunzilla to feature crypto asset trading on OpenSea","category":["GAMING"],"content":["Gunzilla Games announced an integration with OpenSea to allow players to trade in-game assets on the NFT marketplace.","The company’s “Off the Grid” game will be the first Gunzilla title to test the new integration.","Gunzilla Games, the developer of the upcoming video game \"Off the Grid,\" has announced an integration with OpenSea that will allow players to trade in-game assets on the NFT marketplace.","OpenSea has agreed to integrate the gaming developer's GUNZ blockchain, which is built on a custom Avalanche subnet, Gunzilla Games said in a statement.","\"The integration of GUNZ into OpenSea will provide a compliant and transparent NFT marketplace for trading in-game items,\" Gunzilla Games said in its statement. \"Players and OpenSea users alike will be able to trade in-game NFT items for any game built on the GUNZ blockchain and utilize the GUN token as the exclusive method of payment.\"","OpenSea CEO Devin Finzer said his marketplace is \"excited to partner with web3 gaming pioneers like Gunzilla who prioritize great gameplay and advanced in-game economies that put the player first,\" also according to the statement.","The battle royale title \"Off the Grid\" will be Gunzilla Games' first offering to take advantage of the new integration. It is slated to be released on PC, PlayStation and Xbox consoles later this year. The title could end up being the first video game available on both Sony's PlayStation and Microsoft's Xbox that allows players to own and trade digital assets in the form of NFTs.","In March, PlayStation maker Sony Interactive Entertainment <a href=\"https:\/\/patentscope.wipo.int\/search\/en\/detail.jsf?docId=WO2023039557&amp;_cid=P12-LFCQE7-38867-1\" data-v-f87c67ca=\"\">filed a patent for NFTs<\/a> which would allow for the transferring of non-fungible tokens across games and console generations.","\"The launch of our flagship title, 'Off The Grid,' will be the first to showcase the potential of [the OpenSea] partnership, offering a glimpse into the future of gaming economies,\" Gunzilla Games co-founder and CEO Vlad Korolov said in a statement.","When asked about any regional restrictions regarding players trading \"Off the Grid\" NFTs, Gunzilla Games said, \"In-game assets held by players where [the game] is set to debut will be tradable on OpenSea.\" The company also said it \"will be making separate announcements about the specific rollout of GUNZ across different regions.\"","Last month, Gunzilla Games <a href=\"https:\/\/www.theblock.co\/post\/284572\/playstation-crypto-game-dev-gunzilla-games-raises-30-million-in-round-led-by-avalanche-fund-and-coinfund\" data-v-f87c67ca=\"\">said it had raised<\/a> $30 million in a round co-led by CoinFund and Avalanche's Blizzard Fund. The company is aiming to be the first to produce a blockchain-based AAA video game that is popular with mainstream gamers.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sony Interactive Entertainment","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Devin Finzer","content":"PERSON"},{"type":"Vlad Korolov","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Sony","content":"ORGANIZATION"},{"type":"$30 million","content":"MONEY"},{"type":"GUNZ","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"Gunzilla Games","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}