{"summary":"BlockFi has secured $18.3 million in a Series A led by fintech investor Valar\nThe company is eyeing new products and markets","author":["Frank Chaparro","Ryan Todd","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/34850\/blockfi-clinches-18-3m-series-a-led-by-fintech-investor","publishDate":"2019-08-06T08:35:05","id":56,"type":null,"title":"BlockFi clinches $18.3M Series A led by fintech investor","category":["Bitcoin"],"content":["BlockFi, the cryptocurrency lending company, has secured an additional $18.3 million in venture capital funding as the firm eyes an international expansion and the roll-out of new financial products.&nbsp;","The firm's Series A included a number a previous investors, including Morgan Creek, Galaxy Digital, and Fidelity, but is being led by a new investor, <a href=\"https:\/\/valar.com\/\" data-v-f87c67ca=\"\">Valar Ventures<\/a>.&nbsp;","Valar's investment in BlockFi will be its first foray into the cryptocurrency world, according to BlockFi chief executive officer Zac Prince. The venture capital firm is known for its financial technology investments as its portfolio companies also include the likes of peer-to-peer currency exchange TransferWise, investment app Stash, and upstart challenger bank N26. The Winklevoss' twins Winklevoss Capital is another new addition to BlockFi's cap table.&nbsp;","The firm has previously raised $50 million in the form of <a href=\"https:\/\/www.businessinsider.sg\/bitcoin-king-novogratz-invests-in-crypto-lender-2018-7\/\" data-v-f87c67ca=\"\">a lending facility from Galaxy Digital<\/a> in July 2018. It also raised $4 million in convertible debt instruments in a December fundraise, and an undisclosed extension by Coinbase Ventures <a href=\"https:\/\/www.theblockcrypto.com\/2019\/01\/29\/blockfi-scores-new-funding-from-coinbase-ventures-to-kickstart-international-expansion\/\" data-v-f87c67ca=\"\">earlier this year<\/a>.","The injection of new capital will primarily provide BlockFi with the runway to continue to expand its headcount, which Prince said has now crested 40 staff. The firm could grow to approximately 60 by the end of the year. Prince said the firm's plans have not changed much <a href=\"https:\/\/www.theblockcrypto.com\/2019\/07\/17\/zac-prince-interview\/\" data-v-f87c67ca=\"\">since he appeared on The Scoop podcast in July<\/a>.","While BlockFi is currently in the business of lending and paying interest on deposited bitcoin, stablecoins, and ether, the lender has its sights set on diversifying its product offering in order to reach a wider mainstream audience. Prince told us that he views BlockFi not as a bank, but as a fintech company in the mold of SoFi; the privately-owned lender which first built its business around student loans to Ivy League borrowers. It's since gone on to become a one-stop shop for mortgage, personal loans, checking, and even an investing platform which will soon offer crypto trading.","He said the firm will continue to move into \"phase 2\" of its roadmap, which will include the roll-out of a bitcoin rewards credit card, and would complement its existing crypto loan and interest-yielding saving account products. \"Phase 3\" includes expansion into new emerging markets, such as Latin America.&nbsp;","","","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Source: The Block<\/em><\/span>","The new credit card product will require a new product manager, a new compliance official, and other technical resources.&nbsp;","As for other changes that could come to the platform, Prince hinted at the possibility of eliminating minimums for bitcoin deposits.&nbsp;","\"That would be just part of making the platform a bit more attractive for ordinary users,\" he said.&nbsp;","Since launching the bitcoin interest product in March, BlockFi has adjusted rates according to supply and demand in the market. Currently, deposits up to 10 BTC receive 6.2% APR, with incremental bitcoin in the account currently receiving 2.15%.","",""],"hashtag":["BLOCKFI"]}