{"summary":"In the first two months of 2024, phishing incidents resulted in losses amounting to $104 million. \nThis included $57.7 million lost to phishing attacks in January and $46.8 million during February.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281545\/104-million-in-crypto-lost-to-phishing-incidents-within-two-months-of-2024","publishDate":"2024-03-11T00:48:37","id":560,"type":null,"title":"$104 million in crypto lost to phishing incidents within two months of 2024","category":["Crypto Ecosystems"],"content":["Phishing attacks continue to result in substantial losses for crypto users.","Over the first two months of this year, an estimated 97,000 users were affected by phishing incidents, culminating in a staggering $104 million in losses, according to data from the security firm Scam Sniffer. This included <a href=\"https:\/\/dune.com\/scam-sniffer\/january-2024-crypto-phishing-report\" data-v-f87c67ca=\"\">$57.7 million<\/a> lost to phishing incidents in January and <a href=\"https:\/\/dune.com\/scam-sniffer\/february-2024-scam-sniffer-phishing-report\" data-v-f87c67ca=\"\">$46.8 million<\/a> during February.&nbsp;","Users on Ethereum have been the prime target, with $78 million of the total losses associated with users’ assets such as ether and ERC20 tokens being drained.&nbsp;","The majority of the stolen funds were due to victims unwittingly signing malicious phishing signatures, including “ERC20 Permit” and “increaseAllowance” signatures. These signatures, when malicious, grant attackers access to the victim’s funds without their knowledge.","Phishing attacks can be a major concern because signing only one malicious signature may result in the loss of all assets stored in a wallet.","Scam Sniffer's analysis also shed light on the tactics used by these cybercriminals, noting that a large number of victims were lured to phishing sites through deceptive comments on social media platforms, particularly Twitter. These comments, posing as legitimate accounts, attempt to direct users to malicious sites where their assets are compromised.","“Most victims were lured to phishing websites through phishing comments from impersonated Twitter accounts,” Scam Sniffer noted.&nbsp;","The total funds lost by users to crypto phishing attacks amounted to <a href=\"https:\/\/www.theblock.co\/post\/270105\/crypto-phishing-attacks-2023\" data-v-f87c67ca=\"\">$300 million<\/a> during all of 2023."],"hashtag":["EXPLOITS","HACKS"]}