{"summary":"Crypto trading platform and web3 wallet provider OKX is hoping to establish itself as a supporter of new token standards.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274753\/okx-doginals-atomicals-stamps-runes","publishDate":"2024-01-29T09:30:05","id":5606,"type":null,"title":"OKX to enable Doginals, Atomicals, Stamps and Runes inscription standards","category":["EXCHANGES"],"content":["<span data-v-f87c67ca=\"\">In what OKX is calling a “first-to-market” move, the company has announced it is enabling inscription token standards across its wallet and marketplace — including support for Dogecoin Ordinals, or Doginals, in addition to Atomicals, Stamps and Runes.<\/span>","\"OKX Wallet will integrate Bitcoin token standard, SRC-20 (Stamps), enabling users to view and transfer inscription standards<span data-v-f87c67ca=\"\">,\" the company said in a statement.<\/span> \"In late February, OKX Wallet will integrate ARC-20 (Atomicals), DRC-20 (Doginals) and Runes. Also in late February, OKX Marketplace will integrate the DRC-20, ARC-20 and Runes standards, giving millions of users the ability to buy and sell DRC-20, ARC-20 and Runes inscriptions, with zero fees.\"","Like BRC-20 on Bitcoin, newer token standards are being given their own names. Other examples include PRC-20 on Polygon PoS, <a href=\"https:\/\/www.theblock.co\/post\/236632\/ordinals-like-tokens-on-ethereum-surge-past-1-million-in-volume\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">Ethscriptions<\/a> on Ethereum and Solana Inscriptions on Solana.","<span data-v-f87c67ca=\"\">Bitcoin inscriptions began <a href=\"https:\/\/www.theblock.co\/post\/266272\/brc-20-style-tokens-are-spreading-to-chains-beyond-bitcoin-but-why\" data-v-f87c67ca=\"\">gaining popularity<\/a> last year. While some NFT aficionados have welcomed the new Bitcoin-based digital assets, at least one critic recently <a href=\"https:\/\/www.theblock.co\/post\/266298\/bitcoin-dev-luke-dashjr-calls-inscriptions-spam-community-members-push-back\" data-v-f87c67ca=\"\">called them<\/a> “spam” amid network congestion issues.<\/span>","<span data-v-f87c67ca=\"\">Inscriptions “really resonated with a lot of our Asian users and we saw a lot of the activity pick very quickly, which really drove us to dive deeper and ultimately build the early makings of the product today, which was to support their ability, in our web3 self-custodial wallet, to hold, view, buy and sell these early inscriptions,” OKX Chief Innovation Officer Jason Lau told The Block.<\/span>","<span data-v-f87c67ca=\"\">When describing OKX's efforts to better serve its customers given the interest in Bitcoin inscriptions, Lau said the data supports his company's plan. “We're seeing this explosion of new activity and the market and the users continue to grow … when we launched our product, we had hundreds of users using this, now that’s up to 100,000 plus users,\" he said.<\/span>","<span data-v-f87c67ca=\"\">OKX is a top crypto trading platform by total market share that also provides users with a web3 wallet.<\/span>","<span data-v-f87c67ca=\"\">\"We’re seeing early signs of this activity spill over to other UTXO chains,\" said Lau, \"We’re responding ultimately to our desire to be at the forefront, to build tools for our users to access all of web3.\"<\/span>","<span data-v-f87c67ca=\"\">OKX Wallet's <\/span><span data-v-f87c67ca=\"\">inscriptions tool<\/span><span data-v-f87c67ca=\"\"> currently supports <\/span><span data-v-f87c67ca=\"\">inscriptions minting<\/span><span data-v-f87c67ca=\"\"> on 23 networks, including Bitcoin, Dogecoin, Ethereum, Polygon, BNB Chain, Avalanche-C, Arbitrum One, and many others.<\/span>","<span data-v-f87c67ca=\"\">When asked why OKX is rolling out its new initiative now, Lau said: \"The timing is really because all these protocols are now launching and are starting to gain traction\"<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Polygon","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Atomicals","content":"LOCATION"},{"type":"Dogecoin","content":"LOCATION"},{"type":"February","content":"DATE"},{"type":"SRC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"Jason Lau","content":"PERSON"},{"type":"Lau","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"OKX","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"DRC","content":"ORGANIZATION"},{"type":"BRC","content":"ORGANIZATION"},{"type":"PRC","content":"ORGANIZATION"},{"type":"Solana Inscriptions on Solana","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["OKX"],"authors":["RT Watson","The Block"]}