{"summary":"In this episode of the Scoop we explore: How the firm has adapted when the institutional wave of asset managers fell apart, How the notion of a crypto prime broker has changed since the company&#x27;s founding, Why the firm does not want to service retail clientele and more.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/53566\/the-state-of-institutional-money-crypto-with-tagomi-co-founder-marc-bhargava-coo-kevin-johnson","publishDate":"2020-01-22T15:45:02","id":5612,"type":null,"title":"The state of institutional money in crypto with Marc Bhargava and Kevin Johnson","category":["THE BLOCK"],"content":["<em data-v-f87c67ca=\"\">Episode 2 of Season 2 of The Scoop was recorded with Frank Chaparro, Ryan Todd, Tagomi Co-Founder Marc Bhargava &amp; COO Kevin Johnson. Listen below, and subscribe to The Scoop on <a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Apple<\/a>,&nbsp;<a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Spotify<\/a>,&nbsp;<a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Google Play<\/a>,&nbsp;<a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Stitcher<\/a>, or wherever you listen to podcasts. Email feedback and revision requests to&nbsp;<a href=\"\/cdn-cgi\/l\/email-protection#14647b707775676054607c7176787b777f77666d64607b3a777b79\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"e4948b8087859790a4908c8186888b878f87969d94908bca878b89\">[email&nbsp;protected]<\/span><\/a>.<\/em>","<iframe src=\"https:\/\/playlist.megaphone.fm?e=BLOCK4352045905\" width=\"100%\" height=\"200\" frameborder=\"0\" scrolling=\"no\" data-mce-fragment=\"1\" data-v-f87c67ca=\"\"><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><\/iframe>","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">When Tagomi came out of stealth mode in 2018, the need for a crypto prime broker was a commonplace talking point in the digital asset world. An independent broker, sitting in between the spine-tingling market and investors, would help lure larger asset managers to bitcoin, pundits said. Indeed, two years later even Tagomi has been disappointed by the lack of asset managers in the market and their focus on best execution, although important, is no longer core. Still, even though the firm's conception of a crypto prime broker has changed, it sees other opportunities on the horizon. <\/i>","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">In this episode of the Scoop we explore: <\/i>","<em data-v-f87c67ca=\"\">The transcript is provided for your convenience, please excuse any errors or typos resulting from the transcription process:<\/em>","<strong data-v-f87c67ca=\"\">Frank <\/strong>Ladies and gentlemen, thank you for joining me for what is a very special episode of The Scoop. I'm your host, Frank Chaparro. I'm joined again by my delightful colleague, Ryan Todd. Ryan, we have a really interesting episode. This is the round two of bringing in the folks at Tagomi to explore what they're doing. When we were at the old office, we had some issues with the heat, we had some issues with the door slamming, and it's probably for the best because they have a little bit more to talk about. They've grown up a little bit more. It's almost been six months, more than six months, since they stopped by our old office. And they're known for being one of the few prime broker-like companies helping larger traders, more mature, sophisticated traders access different liquidity pools across various exchanges and OTC platforms. And it's interesting because at the same time as they were in stealth mode and trying to raise money and I was a reporter at Business Insider, a lot of my sources at the time--and maybe they had known that you guys were percolating, so to speak--they were telling me that what the market needed so desperately then, in terms of bringing that institutional money off of the sidelines, was a prime broker-type entity. Here we are now in 2020, and there is still a lot of money sitting on the sidelines, so much so that we often think here if it'll ever trickle down into this market. And so that's kind of the question we'll be exploring today is what is the state, so to speak, of institutional money and crypto? You hear the same stuff from your sources in the industry. It's all about high net worth individuals. The banks are really not looking to get in quite yet, the larger banks. FA's today, we had a survey from Bitwise that showed just 6% of the financial advisors they surveyed had allocated capital to this space. So we're going to explore that. We're going to explore what's holding those firms up, because I know you've talked to them and I know you're involved in very long due diligence onboarding processes with firms like this. And so, let's just get started. Well, first off, let's introduce the two very special people we have: Kevin Johnson, the Chief Operating Officer at the firm, and we have Marc Bhargava, one of the co-founders, one of the three co-founders. So, gentlemen, let's start there. Let's explore the client profile, if you will, because I know we've gone a little bit downstream into some more retail-y, we call them consumer, prosumer-type clients, but the bread and butter, I think, is still those crypto-native hedge funds. Fifty, one hundred million dollars in management. Has it changed since 2018 in any respect? Walk us through it.","<strong data-v-f87c67ca=\"\">Kevin <\/strong>So I think we've seen a lot of good growth in the number of clients we've had. We definitely had pretty good capture in terms of the largest funds. A lot of them are investors in us, and a lot of them have been onboarded now. I think we've seen a little bit of increase in diversity of the type of institutional clients we've seen. So the crypto hedge funds are the obvious choice. You know, family offices and venture firms that are owning crypto directly are the other thing we started with. I think the areas of expansion that we've seen are a lot of other trading firms, either desks that want some kind of a better backend trading system for what they're doing. They look to us as a way to give them that institutional trading system that can let them focus on whatever their core business is. So we're basically all about taking this group of technology that we've built for execution, for settlement, for financing and finding different use cases for different types of institutional clients, whether it's a trading firm, or quant fund, or an index fund.","<strong data-v-f87c67ca=\"\">Frank <\/strong>And it's an end--and the way you often describe it is as being an end-to-end solution. But, when I harken back on those days in 2018, and I heard about the desire for a prime broker, the firms that I thought of, instantly, who would want that type of service were--and before we turned on the mics, we were talking about interviews at Bridgewater and such--but those types of firms. And it's funny, not too long ago, I was with one of your CEOs, Greg Tusar, at an event in Greenwich, Connecticut, with high net worth and institutional investors. And it was not a crypto-native conference, so many of them were, you know, approaching this space, so to speak, with a 10-foot pole. Why--rather, is it surprising that--or at least it's surprising to me that--most of the firms you guys work with are these crypto-native firms, and you've kind of been able to build a business from from that side of the market.","<strong data-v-f87c67ca=\"\">Marc <\/strong>It's slowly changing with the offerings that are changing. So when we introduced trading on margin, shorting, lending and borrowing of both cash and coin, you suddenly had a new group of clients that could come. And so those were the quant funds that are basically, you know, they're not crypto experts. Some of them don't even believe in it, but they do think they can take old strategies and apply them now and going long\/short on all kinds of different assets in the space. So in terms of surprises, I think we started really the idea in late 2017, started the company very early 2018, launched first half of 2019, and, in earnest, you know, groups that have been disappointing have definitely been family offices and large asset managers. And I think a lot of them were in it for the hype, but also, to be fair to them, a lot of them are looking for real use cases and are not finding all that many. The groups that have become more active are more the crypto funds, which is where the family offices tend to invest and then the crypto funds sort of invest their capital. So indirectly, I'd say we're still getting a nice share of that sort of family office institutional capital, but it's coming through the vehicle of the crypto funds. That was a bit of a surprise. And then, in addition to that, now the quant funds that are getting into the space and the hedge funds. And it's super exciting to have people like Greg Tusar at the helm who, you know, helped run Goldman for 13 years on the trading side. And Kevin here, who's been with Two Sigma and Citadel and others, kind of helping these macro and quant funds get in the space. There have been surprises on the plus side, too, though. So the surprises on the plus side are the big tech firms. In 2017, you know, I was angel investing in the space in 15, 16, 17. And in 2017, if you told me Facebook, Square, SoFi, you know, the Chinese government, were all getting into crypto, I would've been like \"Wow, Bitcoin is probably at 100k, right, if those are the names in it.\" I would have assumed at that time that it would be Goldman and you know, maybe some of these banks and asset managers. But it's ended up being the really big institutions--and Goldman has seven times, you know, Facebook is seven times the market cap of Goldman--these really big institutions that are coming in in 2020 tend to actually be tech institutions, or government institutions, instead. So we can obviously talk through more of what that means for our product, how that's changing strategy--","<strong data-v-f87c67ca=\"\">Frank <\/strong>Yeah, that's super interesting. So it doesn't really stand. At first glance, that connection doesn't really make that much sense, right? How does a Facebook building out something like Libra translate into more business for Tagomi, aside from more clients seeing that as a tailwind for the space. But I don't see a direct--is there a direct link?","<strong data-v-f87c67ca=\"\">Marc <\/strong>Think about any token. Like, we help a lot of the actually, and a new group of clients, which we also weren't expecting, but turning on lending and margin has allowed us to attract as many of the token projects they want to manage their treasury. So if they need help getting listed on exchanges that Tagomi trades with and is close with, if they want to lend out Ethereum they might have raised or the cash they have on their balance sheet to people who want to trade on margin. So Treasury management has become a really large part of the prime brokerage operation--.","<strong data-v-f87c67ca=\"\">Frank <\/strong>And that's something you could extend then to Facebook?","<strong data-v-f87c67ca=\"\">Marc <\/strong>Anyone with a token is something we could extend, if they want to create more, redeem more, if they want to lend out reserves, any of those pieces of it. So in general, we see a huge opportunity for anyone who wants to integrate Bitcoin suddenly on their platform. And, you know, you see a lot of tech companies starting to talk about that and making steps, or anyone who wants to have their own independent token, they can use us for Treasury management as well. So, you know, in 2020, definitely kind of this institutional class of tech is one we're keeping our eyes on, in addition to the very fast-growing group of more quant funds and hedge funds who are saying, \"Look, we're not going into the protocol diligence of any of this stuff, but we're noticing patterns, we're noticing arb or discrepancies, and we want to take advantage of that.\" And now suddenly Tagomi, which started more as best execution, is helping them do that on margin, is helping them short, you know, has a lot of different tools that we've built over now almost two years with people who obviously know this client base really intimately.","<strong data-v-f87c67ca=\"\">Frank <\/strong>And that's probably a higher margin business to be in.","<strong data-v-f87c67ca=\"\">Marc <\/strong>Absolutely. I mean, borrowing and lending, especially on some of the smaller assets, the rates are still high. That's not true on Bitcoin as much anymore. But, you know, anytime you're extending credit, you have to analyze risk. You're doing those harder pieces. So I almost view like the trading in the custody as, \"Look, it's the best price on Tagomi and there's a reason for that.\" That's our user acquisition strategy is to have the best fee tiers, the best pricing across 14 liquidity sources. You know, we offer we've been seeing custody at much lower rates than other folks offer. And so that sort of gets folks in the door. The higher margin products, to your point, is exactly that. It's trading on margin. It's matching up lenders and borrowers, internalizing that, having the network effect around the prime brokerage piece.","<strong data-v-f87c67ca=\"\">Ryan <\/strong>You mentioned these big tech companies moving into the space, Square being pretty notable. They actually allow you to now withdraw deposit Bitcoin. Is there an opportunity to to help them source liquidity on that backend? I'm just using them as an example, but are there other companies that--.","<strong data-v-f87c67ca=\"\">Frank <\/strong>I mean, you have Robinhood as another example, right, that are sourcing liquidity from high frequency trading firms.","<strong data-v-f87c67ca=\"\">Ryan <\/strong>What's that look like? It seems opaque just based on the research we've done into that process.","<strong data-v-f87c67ca=\"\">Kevin <\/strong>Yeah. So I think speaking about them generically, they all at their core have a need for some kind of trading and brokerage function, right? They're taking cash and turning it into coin or vice versa. And I think a lot of these firms that want to do that, they think, \"OK, well, do I want to do that myself? Do I want to outsource that somehow? If I outsource it, what model do I use?\" And, you know, we can look to the traditional equity space for interesting models like the PFOF sort of wholesaling model that you see for retail brokerages.","<strong data-v-f87c67ca=\"\">Frank <\/strong>Payment for Order Flow.","<strong data-v-f87c67ca=\"\">Kevin <\/strong>Payment for Order Flow. Yeah. Otherwise they can also just principally trade it themselves if they have the sophistication to do that. But even if you do take the principle risk yourself, you still want somebody to give you market access, right? You know, it's not your core competency to build exchange connectivity and smart order routers and things like that. So there's always a need at these firms to have some kind of connection to the markets, whichever of the economic models that they choose. And our building blocks are flexible enough to be put together to service all those different kinds of needs.","<strong data-v-f87c67ca=\"\">Frank <\/strong>So that would be kind of like a golden goose, so to speak, or a golden egg, for you guys to step in between whatever market access Robinhood is maybe engaging with, or Square is engaging with, and kind of say, \"Hey, just give all of it to us, and we'll sort of help you figure it out.\"","<strong data-v-f87c67ca=\"\">Kevin <\/strong>I think there's there's two important things there. One is just the access and making it easy for them because it's our core competency. The other thing is the independence, right? So we as an agency brokerage focus on getting best execution for our clients in a transparent way, right? We're not doing this is like a market-maker or a prop shop. So if you as a retail app want to show to your clients that you're getting best execution, you're doing right by your clients, you're very transparent about how you do it, using an agency brokerage is a really great way to do that. A lot of the other models are a little bit more opaque. So I think we can help kind of provide that layer of not only technology, but also transparency into the execution process.","<strong data-v-f87c67ca=\"\">Ryan <\/strong>I think it's helpful for our listeners--you know, I come from a traditional finance background. I know the term prime broker. I'm not really familiar with the term agency broker. What's the difference? I know we've thrown out that Tagomi does prime-type services, but it could be helpful talking through those two things.","<strong data-v-f87c67ca=\"\">Kevin <\/strong>So I bucket prime services, as you know, obviously execution: providing best execution across you know, other exchanges are market makers or brokers that you work with. It's providing that custody in that sort of true brokerage account, holding your assets for you.","<strong data-v-f87c67ca=\"\">Ryan <\/strong>And you guys do offer that in capacity?","<strong data-v-f87c67ca=\"\">Kevin <\/strong>Yeah, we're full of fully licensed. We have an MSB, we have MTLs. We're able to hold customer funds on their behalf. And then the third thing is that financing aspect, right? Providing the leverage and financing capability to do those institutional side trades. That's the prime brokerage piece. Now, you can do that in different ways. You can do that as a principal, where you know, you are the counterparty to trades with your clients, which is a great service to provide if your assets are illiquid or they're hard to source or they're, you know, maybe not traded on many electronic exchanges. But what we see in other asset classes is most things move to a model where your broker is essentially acting as an agent on your behalf, finding you the best prices across all of the different liquidity sources they can find. And what that does is it creates an alignment between the client and the broker so that the client can trust the broker to get the best price on their behalf, to be transparent about how they did it and what they paid, and that provides a lot of great incentives for that client. It means they can be very transparent with their investors, or whoever they're a fiduciary to, or if they have retail clients, they can go to them and say, \"Hey, you know, we're doing the right thing for you, getting best execution.\" And what we've seen in other asset classes, especially, you know, retail brokerage, there's a lot of rules and laws around that the SEC has put out around how, you know, an Ameritrade or e-Trade has to be transparent about how they do things like payment for order flow. So we would expect that any market, even the crypto market as it grows up, will be held to those same kinds of standards. And we can provide that level of transparency for our clients.","<strong data-v-f87c67ca=\"\">Frank <\/strong>As you guys have pivoted in a sense towards new services, or added additional focus to services like Treasury management or trying to attract large tech companies to offer them market access--the Squares and Robin Hoods of the world--how has the definition of prime broker, agency broker, in your view, changed?","<strong data-v-f87c67ca=\"\">Marc <\/strong>Yes. So in 2017, for over six months, actually, my co-founder Jennifer, she was Union Square Ventures, and I was investing with one other person at Brainchild, we spent over six months in 2017 basically looking for this deal. And the reason for that is this principal versus agency distinction. So in 2017, as you had the first metastables and Polychains and larger funds come to the market, you had certain family offices start to double down because of their returns in Andreesen or USV or funds like that, you had people coming in and they were looking for like an Interactive Brokers of crypto. They were looking for like an agency, and there were plenty of principal options. So in 2017, there was no lack of OTC desks that you could call up in Boston or New York or Chicago or S.F.. There were also several pretty large market-makers and others. So there was absolutely no lack of, you know, principal folks in 2017. But we noticed that the more sophisticated folks coming from Wall Street were saying, \"No, you can't just mark up the price and send it to me. Like, I need to know where you got this, what price, what's the markup, what's the fee? How did you execute? Would it be best execution standards?\" And Jen and I were sitting there like, \"Oh, OK, we'll try to find a company that does all of that for you. And, you know, we'll also obviously want to invest in that company when we find it for these LPs and these funds, and we didn't find anything.\"","<strong data-v-f87c67ca=\"\">Frank <\/strong>Was one of those LP's Peter Thiel?","<strong data-v-f87c67ca=\"\">Marc <\/strong>So, the Founders Fund group, yeah. They've been investing for a while. I think it ended up breaking in The Wall Street Journal that since 2013. So they were kind of one of the groups too that that had this idea. So there were some very smart people who understood trading and trade execution. And, at first, for us it looked like why don't you go to an OTC desk, why don't you go to a market-maker. But all of those folks were trading on principal, and they needed more of an agency option. And so that's what we sat down with Greg, at the time, the head trader at Polychain. Chase Lochmiller actually used to work for Greg. He now has a really awesome successful mining company called Crusoe Energy. But Chase said, \"Hey, I know you guys are searching for this. There's this guy, Greg, who sold two companies. He's run Goldman. He actually coded up the first instance of sending multiple orders to an exchange. Like, this is the perfect guy to help you figure out who to back.\" And so when we sat down with Greg and started really understanding this distinction between principal and agency and how there wasn't a single agency choice in this entire market while, you know, in equities or FX, it might be 80% electronic and done through best execution, we said, \"This seems really obvious.\" And so the three of us teamed up. But the vision has always been to be a prime brokerage. Specifically, folks would ask us, \"Who's the Interactive Brokers for crypto?\" You know, who's allowing you to do all of these different services like lending, shorting, trading margin? But best execution is really the best place to start, because the most easy case to understand is I want to buy or I want to sell Bitcoin. And so that's kind of the most universal place to start, and bringing it back to some of these tech companies, like many of them are integrating just Bitcoin, right? Not the other stuff, not margin trading, not shorting. So the largest addressable market was people who wanted to do larger Bitcoin orders, and it was one we knew really well because they were kind of asking us for this help. So that's why we started with best execution. It's not really a pivot, it's more adding these different layers to become Interactive Brokers of crypto, which we view as a really successful company.","<strong data-v-f87c67ca=\"\">Frank <\/strong>When you think about that original core feature, the best execution aspect of the platform, that was kind of what you viewed as the catnip, so to speak, that would lure in some of these folks who are sitting on the sidelines, folks like Founders Fund or others that you were speaking to, who saw that as being the impediment to them getting into the space. Once you built that, do you think you over-indexed how important that would be to getting those institutional investors, not the crypto-native hedge funds, but those larger asset manager types who were sitting on the sidelines?","<strong data-v-f87c67ca=\"\">Marc <\/strong>I think a lot of it is the market. So when we were making this observation that these sophisticated, larger asset managers needed best execution. So, for example, many of them are required to have an ETF. You have to be an authorized participant to do the buying and selling of ETF shares. So when we were sitting in 2017 and we were thinking about, OK, when ETF come to the market, they're going to need best execution, we certainly were hoping that ETFs came to the market sooner, and then they didn't. That doesn't mean that folks like Bitwise or Crescent Crypto or other clients of ours don't appreciate it--and many of them are obviously striving to be ETFs and we believe should become ETFs--but, certainly, parts of the industry haven't matured as we'd liked, including some of these asset managers and ETFs coming into the of the game. I think another thing that didn't mature as we like is, you know, some of the scalability of protocols, the use cases. So there are a lot of things I think that sitting in 2017 you would expect more of. But having invested in the space for a while and been through several cycles, I can also tell you that there's some very exciting things that you wouldn't have expected, and that's going on on tech side and the international side. So you have to be nimble. And at the end of the day, we're in a good spot to be nimble because we're fundamentally just a technology firm. So we can mix and match these different pieces. And maybe best execution for an ETF is not what the demand is, but best execution for, you know, a tech company that's suddenly putting Bitcoin up on their platform, or a wealth manager--","<strong data-v-f87c67ca=\"\">Frank <\/strong>And that's something you wouldn't have expected back in 2017.","<strong data-v-f87c67ca=\"\">Marc <\/strong>Totally. So you have to--I think our approach of having the best technology in the space and remaining compliant, and then molding it to the use case in the super young industry, is, you know, something us and our investors are very aligned on, and, you know, we've seen good results so far from it.","<strong data-v-f87c67ca=\"\">Frank <\/strong>Who do you see as being your competitor in this respect?","<strong data-v-f87c67ca=\"\">Marc <\/strong>Always a loaded question, because--","<strong data-v-f87c67ca=\"\">Frank <\/strong>Well it's not an easy question, really, I'll admit.","<strong data-v-f87c67ca=\"\">Ryan <\/strong>We get asked actually quite a lot. Who is Tagomi's competitor?","<strong data-v-f87c67ca=\"\">Kevin <\/strong>I mean, I think there are a lot of substitutes, right? So you want to buy Bitcoin, there's a bunch of ways you can do that. And, you know, depending on how you get into the market and what you care about and what you prefer, you can get it done in different ways. You can obviously go to a Coinbase, but an institutional investor is not going to put 10 million dollars into a Coinbase account when they need best execution and they need an account that their ops team can interact with, right.","<strong data-v-f87c67ca=\"\">Marc <\/strong>Or they want to trade on margin or short or, you know, a plethora of product lines.","<strong data-v-f87c67ca=\"\">Kevin <\/strong>Yes. So I think our combination of the prime brokerage services, the best execution, actually having a true brokerage account with the licenses, and providing financing on an agency basis is still quite unique. There are other people that offer similar services, but I think if you dig into it a little bit, they do it in a different way--either on a principal basis or they don't have licenses or it's only one source of liquidity--so I think, you know, if you're an institutional investor, you have to do your diligence on what's important to you, what do your fiduciarys require you to do, and then make sure that you know exactly how your broker is operating.","<strong data-v-f87c67ca=\"\">Frank <\/strong>What if you're not an institutional investor? My impression and I might be imprecise or inaccurate as I often am--","<strong data-v-f87c67ca=\"\">Ryan <\/strong>Your doing good so far.","<strong data-v-f87c67ca=\"\">Frank <\/strong>Thanks, Ryan, I appreciate your unwavering support. But you're right. I'm sure you guys would be happy. And, you know, I don't know if whenever Greg would say to me if he was kidding or not, but to sort of have me open up an account and try it. My impression is you'd be happy to have even little guys on there. You know, if I want to make a few five hundred dollar, thousand dollar Bitcoin trades, I mean, it might not be the best user experience compared to a Coinbase, but I'm sure you'd be happy to take their money.","<strong data-v-f87c67ca=\"\">Marc <\/strong>Yeah. So we actually view that quite differently.","<strong data-v-f87c67ca=\"\">Frank <\/strong>Yeah, like I said, I might be wrong.","<strong data-v-f87c67ca=\"\">Marc <\/strong>We provide our clients with a certain level of customer support and consultation that we cannot do at scale. So we are very focused on people placing larger trades. We don't have a specific minimum on the platform because we've found, you know, crazy influencers go on there and use it and then they sign up their, you know, two hundred million dollar fund the next week or something, so we're not out there marketing to the consumer, and we don't want the consumer either, because we really want people placing larger trades.","<strong data-v-f87c67ca=\"\">Frank <\/strong>Sure.","<strong data-v-f87c67ca=\"\">Marc <\/strong>So the only element that you'd benefit from on our platform is if there was a price difference between the 10 exchanges and four market-makers we work with, we would route you to whichever has the best price.","<strong data-v-f87c67ca=\"\">Frank <\/strong>And you always wouldn't get that big of a price difference, but the platform itself is sleek. I mean, I could see someone like myself who's very poor, interested in using it.","<strong data-v-f87c67ca=\"\">Marc <\/strong>We would love for you to use it. We'd love for more people in the press or influencers to use it. But really, it's for people, you know, doing trades of at least 25k to 250k in size is sort of the small end. And then we've had, you know, a certain client and several clients trade more than a hundred million with us, and those are more where we're going. So I think, think of us again as Interactive Brokers. It's a really good analogy because Interactive Brokers has pretty legit hedge funds on it all the way down to like two GSB grads who are starting a fund. But it doesn't have Frank, you know? It's for somebody who's spending all of their time trading and maybe they're not really a pro, but at least they're full time, they have a couple hundred K. I think that's kind of where we draw the line because we have a lot of customer support, a lot of risk analysis. Many of these tools that, you know, it doesn't make sense to support for retail.","<strong data-v-f87c67ca=\"\">Frank <\/strong>So let's focus in on the companies making those larger trades. You don't need to tell me who your largest clients are because I already know. No, I'm kidding. I have no idea. I haven't the faintest idea. But what do they look like? You think about the most active players on the platform. Is it simply just those larger crypto-native funds like a Pantera or something similar to that?","<strong data-v-f87c67ca=\"\">Kevin <\/strong>Those are definitely, you know, a large part of our base. You know, either fundamental or quantitative hedge funds that will use us for all their trading, execution, and custody needs. There are other categories of people that exist too. There's a lot of mining firms that use us. They like the best execution. They like, you know, using us to kind of facilitate that through our API. So there are lots of different types of institutional clients that do a fair amount of trading. I mean, some these quant funds are sending us orders every couple minutes, right? So they appreciate the low touch electronic access. The fact that they can focus on their strategies, their alpha, and not worry about exchange connectivity. So I think it's actually an interesting mix between those larger funds and other ones.","<strong data-v-f87c67ca=\"\">Ryan <\/strong>Going off the crypto-native firms and stuff, you mentioned at the start of the pod, addressable market being high frequency, quant shops, that sort of audience. I'm curious, because I'm not in the room on this, but what's that conversation look like when you're trying to onboard that type of client into this space and do events like, say, this week, CME launch of options, make the space a bit more appetizing for that type of client?","<strong data-v-f87c67ca=\"\">Frank <\/strong>Great question.","<strong data-v-f87c67ca=\"\">Kevin <\/strong>I definitely think for the non-crypto-native funds, they're looking for a bunch of things before they move into the space, right? The presence of a prime broker is table stakes for them, and to have a trusted counterparty that has all the service that we provide, they absolutely need that. But they are going to look for a bunch of other things in the market. They're going to look for, you know, enough volumes on trusted exchanges. They're going to look for derivatives like what have been launched. So I think that's what it will take to get the other non-crypto institutions into the space. And we're ready for them. Like as soon as they want to make that leap, we will look familiar to them. You know, we will have the kind of integration and customer service they would expect from their biggest prime brokers in traditional asset classes. So that's why we're going to really focus this year on adding other products, you know, looking at the derivatives space, you know, continuing to build out our financing capability and we're ready for them. And we're certainly talking to a lot of them, and they're keeping tabs on the market, and we think we're the right choice when they're ready.","<strong data-v-f87c67ca=\"\">Frank <\/strong>And those cycles take so long, those due diligence cycles. I remember I spoke with one exchange who talked about onboarding a rather large 20 billion dollar hedge fund. They ended up getting the account open after--it must have been six months, but to my knowledge, I don't even know if that firm ever made a trade, right? And I'm sure you guys have experienced similar situations in which, you know, you have these incredibly long cycles of due diligence. What does that look like? And walk us through the anxieties that some of these firms have in sort of coming on board.","<strong data-v-f87c67ca=\"\">Kevin <\/strong>Yeah, I think it's important to point out first that it can go quickly, right? So for firms that have all their stuff ready to go and the product is already a great fit for them, we can onboard a firm very quickly. And then what we focus on at that point is, you know, do they know how to use the product? Have we lined up all the right features for them? Have we made all the right customizations for them in the product? You know, we can do things like sub-portfolios and we can have multiple logins to the same portfolio, different levels of permissions. These are all features that frankly don't exist in any other crypto platform or exchange out there in most cases. So we spend a lot more of our time then just making sure the product is customized for them. But for the ones that go through a longer process, it is often about learning more about our setup, our security, our licensing. You know, they have teams that do diligence all day, and so they ask a lot of great important questions, and we'll do whatever it takes then to make sure they understand how we work and how we've covered all the bases to make sure we are compliant, we're licensed, we have the security procedures in place to safely handle their money. So I think it's important to note that it can be a long process, but it can go very quickly, and a lot of it is just focusing on customization.","<strong data-v-f87c67ca=\"\">Frank <\/strong>Outside of the robustness or the readiness of the firm and your platform, is there anything external to that that sometimes serves as the impediment, internal politics, for instance, at larger investors, or just, you know, we were talking to one of our sources at a financial firm that had a crypto initiative that literally went through everything and on the last signature sort of fell apart. Right. So that as an example, do you--is that just part of it or?","<strong data-v-f87c67ca=\"\">Marc <\/strong>Yeah, for sure. I think like firm ownership structure really matters. So you could have a massive hedge fund, but if it's run by one or two people who really run it versus, you know, a publicly traded financial firm, they might be the same size, but obviously one has a couple decision makers. And in the cases where there is a couple decision makers, having an in is super helpful. And there are kind of two ways that we've seen that play out for us. One is many of them work with Greg and were clients of Goldman Sachs for over a decade, might have even worked with him at the firm before that that was acquired by Goldman. That's how Greg got there. So we've had, you know, RIA's and other very traditional folks. \"This guy has helped me do trade execution for 20 years. Why is he suddenly buying and selling Bitcoin for people? Maybe I should buy some.\" And you know, when we launched Bitcoin was 4000. So that whole class of folks is doing really great and we're very, very excited for them and hope it goes higher.","<strong data-v-f87c67ca=\"\">Frank <\/strong>They're taking Greg out for dinner and drinks?","<strong data-v-f87c67ca=\"\">Marc <\/strong>So that's one group, another group. Another group, you'd be surprised to see that many of these folks invest in venture capital. So many of these hedge fund managers are LP's in Founders Fund or they invest alongside Joe Lansdale or Elad Gill or some of our other angels who have made great introductions as well. So generally, like the two things that would make it go fastest is, one, there's a limited set of decision-makers versus a committee and a board and all these other things. And then--and that exists for some pretty massive kind of financial platforms. And then the second is having some sort of relationship. And normally that comes through people on our team or investors. But then there are other ones where there's a really long process, and it's just tough. And honestly, they care a lot more about the price than they let on. So, you know, we went through like six, seven months diligence, you know, coming up to our launch. And then we were excited to work with folks. But, you know, we launched a Bitcoin 4000 stayed five to six for a while. And, you know, a lot of the working committees suddenly disappeared, and then they-- the working committees--we knew it would take them nine months to a year, right? It wasn't Greg's first rodeo winning over some of these large clients. So we knew it was a nine-month to year process and sort of six months in all the committees disappeared because the price crashed. And, of course, they give you a totally different answer, right? Like, \"Oh, we realized blockchain is not--Bitcoin is not scalable or whatever.\" And we're like, \"No, you didn't realize that. You saw the price crash, and no one wants to advocate for it because everyone's up for a promotion.\" So all the committees stopped. And then it was funny how they all kind of restarted like, you know, four or five months ago. Right. So when I think about, you know, price outlook--and obviously at Tagomi we do not give any price outlooks et cetera, et cetera--but I do think that, you know, a lot of the process has started back up when Bitcoin kind of came out of that trough. So for a lot of these institutional folks, they will do their usual six months, nine months, twelve month process. And a lot of those kicked off, you know, six months ago. So that's just one group of investors.","<strong data-v-f87c67ca=\"\">Frank <\/strong>You just gotta cross your fingers for another three months!","<strong data-v-f87c67ca=\"\">Marc <\/strong>Yeah, but so much can happen there. So I think definitely, you know, it's just a very different nuance flavor. So at Tagomi, we're a team of only 22 people. We only have one person working on sales. We are technology- and product-focused. So for us, the client acquisition has been all referrals. It's folks like Paradigm and Pantera and Multicoin and others publicly saying, \"We looked at investing in pretty much every trading platform. We could use any trading platform. And we invested in Tagomi and we use Tagomi.\" And people say, why? And, you know, we get the intro, we onboard them, we have them use the product, we service them really well. And so our growth has been just all organic. And I think, you know, that will have to change as we grow as a company. We'll need to think about, like, we don't have a blog, you know, we'll have to do things like that, SEO optimization, marketing, etc. But right now, our focus is really just on can we have the best product, period, for all these different services and get there quickly. And, you know, we're big believers in the industry and we're excited about a lot of the more technical aspects that are going on there. And we ultimately think that is what will have to drive for this, not just necessarily that the perfect product is ready for institutionals.","<strong data-v-f87c67ca=\"\">Frank <\/strong>Part of driving that adoption and attracting those customers has been dropping your fee tier on the exchange side to zero, right? I'm sure there are some folks out there--and it's been a question hanging over equities for a long time--who think, well, when fees are zero, then don't I become the product, so to speak. And I don't know if that's a concern that you bring to you, but how are you approaching--","<strong data-v-f87c67ca=\"\">Marc <\/strong>So our fees are 10 basis points down to 5 basis points on trading. So it's not zero. So we definitely have those all in--","<strong data-v-f87c67ca=\"\">Frank <\/strong>The exchange fees, though, were brought to zero. So any time an order is routed to an exchange, there is no fee for that. But obviously, for OTC you would then pay for that bit that's routed there.","<strong data-v-f87c67ca=\"\">Marc <\/strong>Yeah. So out tiering is kind of 10 bips down to five, all in, doesn't matter if it goes to exchange or OTC. That is very low. Look, it's one of the lowest in the space to have that sort of liquidity. We route across both exchanges and market makers and we don't make a lot of money off of trading. We use it, though, as the product to attract people to the higher-margin piece. So there were two reasons we decided to reduce our fees. One was we launched all these higher-margin products and we wanted to get more and more folks in the funnel to get them to those higher products, all the prime brokerage stuff. And then the second was our volumes were picking up, so we were becoming kind of the lowest tier on all these different exchanges. So also our cost of trading for us as Tagomi really went down and we wanted to pass that along to the customer. So those were the two reasons to have a very compelling, and what we think is really kind of best in class, fee structure on the trading side. And, you know, we'll continue to grow the business on prime brokerage.","<strong data-v-f87c67ca=\"\">Frank <\/strong>Have the exchanges sort of picked up on that? Are they starting to get a little wary that they're feeding the beast, so to speak, when in many respects you are taking the client away from them on the front end?","<strong data-v-f87c67ca=\"\">Kevin <\/strong>I think a lot of cases, you know, it's--.","<strong data-v-f87c67ca=\"\">Frank <\/strong>Or they just don't know.","<strong data-v-f87c67ca=\"\">Kevin <\/strong>Well, I mean, a lot of the bigger clients that we're really going after, you know, wouldn't onboard do an exchange directly themselves. I mean, you know, if you're a large multi-billion dollar asset manager, you're not going to take a selfie with your passport and share a login and password with your entire ops team, like they're just not equipped for that. So I think it's, you know, it's the sort of thing where we're we're geared fundamentally toward servicing those larger clients. And then, you know, look, we'll route to the exchanges with the best prices, right? So the exchanges are still going to get that liquidity, but they're going to compete for it, and we're going to do that in a transparent way that demonstrates that we're doing the right thing for our clients.","<strong data-v-f87c67ca=\"\">Frank <\/strong>But in some cases, they do lose that direct relationship with the client.","<strong data-v-f87c67ca=\"\">Marc <\/strong>We think it's offset, though. So it's kind of a tradeoff, right? Absolutely, there were some people who had a Coinbase account, a Kraken account, a Bitstamp account, a Gemini account, and they had all the screens open, and they were, you know, manually trading across the different ones. And, you know, you're losing some of that direct connectivity, and you probably don't like that. On the other hand, we bring in, you know, quant funds and others that need long\/short strategies that you can't do on an individual exchange, and so they're getting new volume. So we think it's just part of a market shift, and, eventually, it will look not that dissimilar to equities or FX where, you know, you don't go trade directly on Nasdaq or whatever if you're an institution. So I think it's just a shift of market structure. There's obviously some downsides for them. You know, there are a lot of upsides, too. And I think ultimately many of these exchanges, to grow into their valuations, realize that they need new liquidity, new people coming in, new scale.","<strong data-v-f87c67ca=\"\">Ryan <\/strong>So to that point, do you expect consolidation this year within the exchanges?","<strong data-v-f87c67ca=\"\">Marc <\/strong>To a degree. So, you know, one of our investors and someone who was very encouraging us to start the company is a guy called Jay Kim, who's like probably the most important but least known guy in crypto because he's a really nice, humble guy. He started a company called Nexon, which makes Counterstrike and a bunch of awesome games out of his apartment in Korea. It's now a 16 billion dollar company. Jay was still early in the space, he invested in Korbit, one of the early exchanges in Korea, and he recently bought Bitstamp, the exchange in Europe. So Jay's someone who has been looking at the exchange space for a long time, was one of our first backers and investors and just has a great insight on that. And I think, you know, to answer your question, you'll see consolidation within geographies, but not across geographies generally. So the exchange retail business is highly regulated because retail is getting affected. So like in Korea, they got really upset when, you know, some of the retail exchanges started doing margin, weren't KYC-ing, and so the Korean government definitely wants to have an oversight on that. Same with the Japanese government, the special license they've now created. Even here in the U.S., trying to get a bit license as a foreign exchange is much harder, at least from the experiences we hear from our partners. So I think because of this regulatory aspect, you're going to see, sure, within the U.S., within Europe, within Japan, a degree of consolidation because it's a bear market and fees have to go down because folks like us don't route to you if you have high fees. But I think that you'll still have fragmentation globally. So that's a lot of what we offer. You know, the 10 exchanges we have on-platform are very global, and to really tap that global liquidity, you have to use someone like us.","<strong data-v-f87c67ca=\"\">Frank <\/strong>There's so many directions in which I want to go, but the goal for 2020 is to keep these things tight. So I have two more questions. Alright, we asked the last guest on the show what they thought about Libra. I think it'd be a good question and things at least for the next couple episodes, and I'm the host, so I get to do that. But in any case, you mentioned how there's opportunity potentially in the future, Treasury management services, etc.. Have you talked to them? Is that something you've talked with them about? Yes, no, maybe so? And then follow up to that question, also Libra-related: do you think it launches in 2020?","<strong data-v-f87c67ca=\"\">Marc <\/strong>So I think I am actually quite bullish on Libra and Calibra. Not a lot of people know this, but like Mark Zuckerberg is actually one of the world's best Civilization players, the game. He's super smart, super creative, and wants to take over the world. You know, we have quite a lot of overlapping investors. And he is not putting this out for PR. You know, there are plenty of large institutions that might be putting out Bitcoin and crypto for PR to show how tech-forward they are. That's not Facebook, or Instagram. You know, it's a very tech-forward company that doesn't need that. It's doing it because it wants to do it. I think, you know, there's a lot of resources in the company, its senior people are really pushing it forward, and the vision is honestly one of the primary use cases of crypto. So when I think of use cases, like payments is absolutely one of the top three use cases for crypto to have mass adoption, I've always thought that, you know, and I think Facebook has realized that. It has 2 billion distribution. Payments as the most obvious use case for crypto, it is why Bitcoin was originally started. Sure, it's now switched more to store of value, etc. But you know, the first sort of transactions how Finney was using, you know, wasn't to store value as a hedge to market, blah blah blah, it was payments. And so I think Facebook has identified that. So I think it's really just an implementation question. But it's hard to imagine that, you know, with all the regulatory sort of resources that they have, that there won't be some sort of resolution to how it'll be done. So I am bullish, but let's say longer-term. My prediction probably would be maybe it doesn't launch this year, maybe launches next year. It's too hard for us and at Tagomi we don't really time these sort of things, like again, for us it's just build the best technology, be ready for whenever it launches. And we obviously have existential question of, you know, are we too early, are we too late? We definitely don't think too late, but maybe too early. But, you know, we're just kind of head down operators that are going to build an infrastructure that could support them, should they, when they want to launch.","<strong data-v-f87c67ca=\"\">Kevin <\/strong>I also think that they're tackling a lot of the questions that people are asking of crypto directly, right? So questions around jurisdiction and legality and travel rule and all the things that, you know, we're sort of scrambling to figure out when we look back at Bitcoin or Ethereum, or how they were launched, or how they sort of effect rules and regulations. You know, something like Libra, they got to go tackle these things head-on. You know, they're gonna go in front of Congress, they're gonna go in front of governments and really like hash these things out, versus other cryptocurrencies where you don't only have somebody to, frankly, go talk to. So that's gonna do a great service for industry because it's going to force us to really answer some of these questions and figure out what would work in different jurisdictions. You know, what could we change about the network structure? What could we change about the way that we operate a wallet to make it work for the current legal regime and then evolve that and work with the governments to change it? So I think it's it's actually can provide a lot of great insight and do a lot of great education for the governments around the world.","<strong data-v-f87c67ca=\"\">Frank <\/strong>Very good answer. Well, thank you so much. This is exactly what I want the scoop to look like in 2020. Tons of insights, tons of good stories.","<strong data-v-f87c67ca=\"\">Ryan <\/strong>Yeah, this was great.","<strong data-v-f87c67ca=\"\">Frank <\/strong>Thank you. Tagomi, Mark. Kevin, thank you so much for joining us.","<strong data-v-f87c67ca=\"\">Kevin <\/strong>Thanks.","<strong data-v-f87c67ca=\"\">Marc <\/strong>Thank you.","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Marc <\/strong>Anyone","content":"PERSON"},{"type":"Polychain","content":"LOCATION"},{"type":"Korbit","content":"LOCATION"},{"type":"Peter Thiel","content":"PERSON"},{"type":"Greg","content":"PERSON"},{"type":"Kevin <\/strong>Well","content":"PERSON"},{"type":"Mark","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Interactive Brokers of crypto","content":"ORGANIZATION"},{"type":"Marc <\/strong>Thank","content":"PERSON"},{"type":"Tagomi","content":"ORGANIZATION"},{"type":"Mark Zuckerberg","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"Marc <\/strong>Totally","content":"ORGANIZATION"},{"type":"10 million dollars","content":"MONEY"},{"type":"Spotify","content":"LOCATION"},{"type":"Crusoe Energy","content":"ORGANIZATION"},{"type":"two years later","content":"DATE"},{"type":"Crescent Crypto","content":"ORGANIZATION"},{"type":"Two Sigma","content":"ORGANIZATION"},{"type":"Robin Hoods","content":"PERSON"},{"type":"Pantera","content":"ORGANIZATION"},{"type":"Chicago","content":"LOCATION"},{"type":"Kevin Johnson","content":"PERSON"},{"type":"Ryan <\/strong>Yeah","content":"PERSON"},{"type":"Bridgewater","content":"LOCATION"},{"type":"Kevin <\/strong>Payment for Order Flow","content":"ORGANIZATION"},{"type":"CME","content":"ORGANIZATION"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"Greg Tusar","content":"PERSON"},{"type":"Ryan Todd","content":"PERSON"},{"type":"Jen","content":"PERSON"},{"type":"Tagomi","content":"PERSON"},{"type":"Calibra","content":"ORGANIZATION"},{"type":"Goldman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Tagomi","content":"LOCATION"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Korea","content":"LOCATION"},{"type":"Finney","content":"PERSON"},{"type":"end of the day","content":"TIME"},{"type":"S.F.","content":"LOCATION"},{"type":"Business Insider","content":"ORGANIZATION"},{"type":"Citadel","content":"ORGANIZATION"},{"type":"Goldman","content":"ORGANIZATION"},{"type":"Greenwich","content":"LOCATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Boston","content":"LOCATION"},{"type":"Kevin <\/strong>Yeah","content":"PERSON"},{"type":"4000","content":"DATE"},{"type":"Jay Kim","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"FA","content":"ORGANIZATION"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"Marc <\/strong>Yeah","content":"PERSON"},{"type":"RIA","content":"ORGANIZATION"},{"type":"6%","content":"PERCENT"},{"type":"e-Trade","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"Ameritrade","content":"ORGANIZATION"},{"type":"80%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"Kevin","content":"PERSON"},{"type":"2013","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"The Scoop","content":"ORGANIZATION"},{"type":"one hundred million dollars","content":"MONEY"},{"type":"Union Square Ventures","content":"ORGANIZATION"},{"type":"earnest","content":"LOCATION"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Jennifer","content":"PERSON"},{"type":"Europe","content":"LOCATION"},{"type":"MSB","content":"ORGANIZATION"},{"type":"Jay","content":"PERSON"},{"type":"Connecticut","content":"LOCATION"},{"type":"Ryan","content":"PERSON"},{"type":"Interactive Brokers","content":"ORGANIZATION"},{"type":"LP","content":"ORGANIZATION"},{"type":"16 billion dollar","content":"MONEY"},{"type":"Tagomi Co-Founder Marc Bhargava &amp; COO Kevin Johnson","content":"ORGANIZATION"},{"type":"Joe Lansdale","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Elad Gill","content":"ORGANIZATION"},{"type":"Brainchild","content":"ORGANIZATION"},{"type":"20 billion dollar","content":"MONEY"},{"type":"Japan","content":"LOCATION"},{"type":"Marc Bhargava","content":"PERSON"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"OTC","content":"ORGANIZATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Nexon","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"USV","content":"ORGANIZATION"}],"hashtag":[],"authors":["Andreas Nicolos","The Block"]}