{"summary":"Ledn is looking to shakeup a market that is often forgotten in crypto: Canada. Started by early bitcoin adopter Mauricio Di Bartolomeo, Ledn is a","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/2684\/meet-ledn-canadas-first-bitcoin-backed-lender","publishDate":"2018-11-02T14:08:26","id":5613,"type":null,"title":"Meet Ledn: Canada&#x27;s first bitcoin-backed lender","category":["BITCOIN"],"content":["Ledn is looking to shakeup a market that is often forgotten in crypto: Canada.","Started by early bitcoin adopter&nbsp;Mauricio&nbsp;Di&nbsp;Bartolomeo, Ledn is a providing credit to Canadian bitcoin businesses and consumers.&nbsp;Canadian Bitcoiners, which make up <a href=\"https:\/\/www.bankofcanada.ca\/wp-content\/uploads\/2018\/07\/san2018-23.pdf\" data-v-f87c67ca=\"\">an estimated 5%<\/a> of the country, struggle to access many of the services provided by traditional financial institutions, and Ledn is filling in the gap, according to Di Bartolomeo. \"Canada seems to be have left to the side unfairly,\" he said, noting&nbsp;the country has been punching above its weight in its contribution to the bitcoin community.&nbsp;","Francis Pouliot, founder and CEO of Satoshi Portal, a company building bitcoin&nbsp;payments and exchange solutions, agreed. <a id=\"jump\" data-v-f87c67ca=\"\"><\/a> The firm owns Bylls, Canada's largest bitcoin payment processor: \"Satoshi Portal tried to get loans elsewhere, and as a company, we were not even able to get a credit card. The banks will not allow us to get credit.\" As a result, Bylls recently became one of Ledn's clients.&nbsp;","Bylls receives bitcoins from its users and pays bills on their user's behalf. As such, Bylls is dealing with a lot of bitcoin, but the company doesn't necessarily want to hold all that bitcoin on its balance sheet because the price is volatile. That's why Bylls is borrowing from Ledn. Using the bitcoin to borrow traditional cash makes things more stable. \"We are taking what we need. Nothing more nothing less,\" Pouliot said. Bylls uses these loans to fund its operation and&nbsp;pay its fiat-denominated business costs.","Bylls is just one of Ledn's customers. The firm declined to share its exact number of clients, saying \"we've received a tremendous amount of demand for our service to date.\"","The credit platform works in four steps. A customer applies for a loan from Ledn and sends in bitcoin as collateral. Ledn receives and verifies a loan application before sending Canadian loans to the borrower. The borrower then can make monthly interest payments (1-1.25% on their loan) on their loans until the end of the term. At that point, the borrower will pay back the principal of the loan, and Ledn will return the bitcoin that acted as collateral. Ledn is funding its loans via the money its raised, including $1.55M from an earlier round. The firm is planning a future raise of $50M, according to Di Bartolomeo.&nbsp;","&nbsp;","Ledn co-founder Mauricio&nbsp;Di&nbsp;Bartolomeo and Bylls founder Francis&nbsp;Pouliot","<strong data-v-f87c67ca=\"\">Risky business<\/strong>","This brings up two key risks of bitcoin-based loans: custody and margin calls. Because a borrower has to send bitcoin to lenders, the bitcoin carries a \"custody risk.\" If lenders fail to properly secure the bitcoins of borrowers, they could end up losing them to hackers. \"We wanted to use a third-party custodian, but they were all U.S.-based and none had immediate plans to provide custody in Canada, so we assembled a team of engineers to build our own custody,\" Bartolomeo explained. According to Ledn, the company holds its collateral bitcoins in cold-storage wallets — protecting them from online hacking efforts — and every client will receive a unique wallet address to monitor their own bitcoin.","The second risk for borrowers is margin calls. Because bitcoin is a volatile asset that experiences dramatic fluctuations, the dollar value of a borrower's bitcoin collateral could fall below the nominal value of the loan. In this case, lenders will either request additional collateral or sell portions of the collateral to maintain their risk profile. For Bitcoiners, the risk of possibly losing their bitcoin collateral might be a disincentive to take out a loan.","\"One of the key frictions for borrowers is to calculate your liquidation point,\" Pouliot noted. Ledn attempts to avoid these margin calls by constantly monitoring the price of bitcoin and communicating with their prior to a possible liquidation event. \"We are going to call people way far before a margin call hits,\" said&nbsp;Bartolomeo, adding that Ledn has an incentive to not liquidate their clients. \"A margin-called client won’t have a good experience,\" he said.","<em data-v-f87c67ca=\"\">With contributions from Frank Chaparro.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"Mauricio&nbsp;Di&nbsp;Bartolomeo","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"5%","content":"PERCENT"},{"type":"Bitcoiners","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Ledn","content":"ORGANIZATION"},{"type":"Ledn","content":"PERSON"},{"type":"Di Bartolomeo","content":"ORGANIZATION"},{"type":"1.25%","content":"PERCENT"},{"type":"Bartolomeo","content":"PERSON"},{"type":"Francis Pouliot","content":"PERSON"},{"type":"$1.55","content":"MONEY"},{"type":"Satoshi Portal","content":"PERSON"},{"type":"$50M","content":"MONEY"},{"type":"Francis&nbsp;Pouliot","content":"PERSON"},{"type":"Pouliot","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"}],"hashtag":[],"authors":["Steven Zheng","The Block"]}