{"summary":"Crypto trading company Cumberland said it had virtually no exposure to crypto exchange FTX, which has collapsed amid a liquidity crisis.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/184658\/crypto-trading-firm-cumberland-says-it-had-virtually-no-exposure-to-ftx","publishDate":"2022-11-09T06:15:28","id":5615,"type":null,"title":"Crypto trading firm Cumberland says it had virtually no exposure to FTX","category":["COMPANIES"],"content":["Crypto trading company Cumberland said it had virtually no exposure to crypto exchange FTX, which has collapsed amid a liquidity crisis.","FTX revealed that it had reached a breaking point on Nov. 8, when it announced a possible acquisition by rival Binance. This has led to speculation as to what companies might be affected — either through money held on FTX or through agreements or loans with the exchange.","<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">\"While we had virtually no exposure to FTX and our operational controls enabled us to provide deep liquidity to a market in search of it, the exchange consolidation we saw was unfathomable 60 hours ago,\" <a href=\"https:\/\/twitter.com\/CumberlandSays\/status\/1590278435603378176\" data-v-f87c67ca=\"\">said<\/a> Cumberland on Twitter. It added that it's focused on serving its counterparties in this volatile market.<br data-v-f87c67ca=\"\">\n<\/span>","Cumberland said on Nov. 8 that it's not an investor in FTX.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"Cumberland","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"crypto exchange FTX","content":"ORGANIZATION"},{"type":"Cumberland","content":"LOCATION"},{"type":"Nov. 8","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FTX"],"authors":["Tim Copeland","The Block"]}