{"summary":"The auction house&#x27;s VC arm made its nvestment will be in a blockchain interoperability startup called LayerZero Labs. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/158119\/christies-launches-venture-fund-makes-first-investment-in-web3-company","publishDate":"2022-07-18T10:07:16","id":5618,"type":null,"title":"Christie&#x27;s launches venture fund, makes first investment in web3 company","category":["COMPANIES"],"content":["Christie's, the renowned British art and luxury business, has launched an investment fund that will aim to support emerging technology and fintech companies related to the art market.","The new fund, called Christie's Ventures, will initially focus on three areas: web3 innovation, financial technology related to art, and other solutions that \"enable seamless consumption of art,\" according to a statement from the company.&nbsp;","The venture arm's first investment is in LayerZero Labs, an interoperability protocol that makes moving assets between different blockchains easier for clients. The company did not reveal the size of the venture fund or how much it will invest in LayerZero Labs.&nbsp;","\"We will focus on products and services which can solve real business challenges, improve client experiences, and expand growth opportunities, both across the art market directly and for interactions with it,\" Devang Thakkar, Global Head of Christie's Ventures, said in a statement.&nbsp;","This is far from Christie's first foray into web3 and crypto. In March of 2021, the platform <a href=\"https:\/\/www.theblock.co\/linked\/98047\/christies-beeple-auction-ends-digital-art\" data-v-f87c67ca=\"\">auctioned off<\/a> its first non-fungible token (NFT) art piece, which was created by the artist Beeple, for $69 million. Since then it has held a number of additional NFT auctions. In December, the company partnered with NFT marketplace OpenSea to curate Christie's first on-chain NFT auction.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$69 million","content":"MONEY"},{"type":"Christie's Ventures","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Global Head of Christie's Ventures","content":"ORGANIZATION"},{"type":"Christie","content":"ORGANIZATION"},{"type":"LayerZero Labs","content":"LOCATION"},{"type":"Devang Thakkar","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"fintech","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"March of 2021","content":"DATE"}],"hashtag":[],"authors":["Anushree Dave","The Block"]}