{"summary":"Securitize doesn&#x27;t buy the argument that crypto companies don&#x27;t know how to register with U.S. regulators — it&#x27;s done it. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234685\/securitize-takes-contrarian-view-in-cryptos-war-with-the-sec","publishDate":"2023-06-14T14:39:26","id":5619,"type":null,"title":"Securitize takes contrarian view in crypto&#x27;s war with the SEC","category":["COMPANIES"],"content":["Securitize, Inc., a blockchain firm that <a href=\"https:\/\/www.theblock.co\/post\/229366\/securitize-hamilton-lane-tokenized-fund-ploygon\" data-v-f87c67ca=\"\">specializes<\/a> in tokenizing real-world assets, doesn't buy the argument that crypto companies don't know how to register with U.S. regulators — it's done it.&nbsp;","\"People don't know how to register?\" <a href=\"https:\/\/www.linkedin.com\/in\/carlosdomingo\/\" data-v-f87c67ca=\"\">Carlos Domingo<\/a>, the company's founder and CEO, asked. \"Well, we know how to register. It's just the normal registration path.\"","He was referring to some of the heated discourse that's occurred as crypto exchanges Coinbase and Binance battle fresh <a href=\"https:\/\/www.theblock.co\/post\/233826\/gensler-lays-out-paths-for-crypto-compliance-criticizing-binance-and-coinbase\" data-v-f87c67ca=\"\">lawsuits<\/a> brought by the U.S. Securities and Exchange Commission and argue for new legislation for the sector. On Wednesday, Gemini co-founder Tyler Winklevoss <a href=\"https:\/\/twitter.com\/tyler\/status\/1669025319356084224?s=20\" data-v-f87c67ca=\"\">called<\/a> the SEC \"downright evil\" for bringing lawsuits in an attempt to \"destroy crypto companies under the false premise that the rules are clear when they know they are not.\"","Coinbase CEO Brian Armstrong has also been a vocal critic of the regulator and argues that the registration process for crypto firms has not been <a href=\"https:\/\/www.theblock.co\/post\/233595\/talk-to-your-lawyer-coinbase-ceo-recounts-icy-meeting-with-sec-chair-gensler\" data-v-f87c67ca=\"\">clear<\/a>.&nbsp;","Securitize, for its part, was founded in 2017 and has raised over $120 million. The company obtained a registered transfer agent license in July 2019 and owns a broker-dealer.&nbsp;","\"We have this set of licenses, and the underlying technology, to be able to take the tokenization process from end to end,\" Domingo said in an interview, acknowledging that tokenization \"starts with the premise that this is regulated.\"","\"What the SEC is telling everybody is that 'if you want to register, these are the rules,'\" he continued. \"The SEC is not going to create a different path for crypto people that is that is completely different than what other companies do.\"","While Domingo said Congress could eventually pass new legislation, he said it would be unlikely in the next two to three years given. And despite concern that crypto firms could start to offshore some activities, he doesn't see too many companies leaving the country outright.&nbsp;","\"It's 20% of the world's economy, but it's 40% of the world capital markets,\" Domingo said. \"Whoever thinks that they can ignore the U.S. is probably missing out on the biggest, most mature, most sophisticated financial services market.\"","\"This narrative that people can go to Dubai to operate, it means first they're operating from a jurisdiction that is very small, and it doesn't actually allow you to then solicit investors in other parts of the world,\" he said.","\"In Europe you have regulation for trading digital asset securities, but the type of securities you could trade was restricted,\" Domingo added.&nbsp;","The U.S. \"is the most reliable, trustworthy capital market in the world for a reason,\" he said. \"It has a very strong regulatory framework, and that's why it attracts capital.\"","While there's always been interest in the tokenization sector, he said there hadn't been massive adoption in the past, with many crypto firms focusing on initial coin offerings, decentralized finance, governance tokens and NFTs. Now, amid the regulatory crackdown in the U.S., there's more interest in the space, and the company is seeing more institutional adoption.","\"Crypto people have realized that issuing magic beans on chain, you know, goes as far as it goes,\" Domingo said. \"These are assets that don't have any intrinsic value, that are problematic as we've seen. They're very illiquid, and they're easy to manipulate.\"","The company last month launched a new feeder fund that offers tokenized exposure on Polygon to a private credit fund from asset manager Hamilton Lane.&nbsp;","Securitize, meanwhile, doubled its revenue in 2022, and Domingo said the company expects to grow 50% to 100% this year, despite the so-called crypto winter.","(<em data-v-f87c67ca=\"\">Updates with quote in 11th paragraph.<\/em>)","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gemini","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"July 2019","content":"DATE"},{"type":"Domingo","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Inc.","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Hamilton Lane","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"Tyler Winklevoss","content":"PERSON"},{"type":"40%","content":"PERCENT"},{"type":"Europe","content":"LOCATION"},{"type":"100%","content":"PERCENT"},{"type":"Dubai","content":"LOCATION"},{"type":"Carlos Domingo","content":"PERSON"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"$120 million","content":"MONEY"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}