{"summary":"Rebecca Rettig, Polygon Labs&#x27; new chief policy officer, is joining the company at a time when policy and regulation is at the forefront of the crypto industry conversation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/216718\/polygon-labs-rebecca-rettig-on-policy-regulation","publishDate":"2023-03-17T10:20:56","id":5621,"type":null,"title":"Smart contracts are neither smart, nor contracts. Polygon’s policy chief on jargon and pushing ahead.","category":["COMPANIES"],"content":["Smart contacts are neither smart, nor are they contracts. That's just techie jargon, according to Polgyon Labs' new chief policy officer.&nbsp;","Rebecca Rettig thinks the wonky words and less-than-precise meaning are doing their part to hold the crypto and web3 industry back. And she wants to help change that.","What's \"really important is that people who understand the technology can speak about it precisely, clearly, without using a lot of complicated jargon to make sure that we can allow policymakers to understand what this technology really does,\" she said in an interview with The Block.","A smart contract, as Rettig explained it, is simply software that lays out the \"rules of the road\" for transactions that are transparent and easily checked. The continued use of technical terms to describe new technology is confusing the general public and lawmakers alike, resulting in distrust and confusion instead of tapping into the possibilities of new technology, she said.","Rettig joined Polygon Labs from Aave Companies, where she was general counsel, at a time when policy and regulation is at the forefront of the crypto industry conversation. Agencies from the Securities and Exchange Commission to the Justice Department and the Commodity Futures Trading Commission brought cases against Sam Bankman-Fried following the discovery of rampant fraud at his companies and since then they have been on a roll.","Last month, the SEC sued Terraform Labs and in January fined Nexo and charged Genesis with offering unregistered securities.","It has become \"politically attractive\" to go after digital assets, Rettig said. Regulatory agencies which have enforcement power are exercising in the wake of FTX, but at some point, \"Congress is still going to act and that will be the law of the land.\"","Rettig's been in the industry since 2017 and is \"very passionate\" about crypto, web3 and the changing paradigms from transactions going through intermediaries – including in arts and media – to decentralization. Though she's been a lawyer in the space for a while, the focus mostly on policy will be a new challenge for her.","\"I wanted to take it on for a few reasons,\" she said. \"The end of last year was obviously very difficult for the industry and I wasn't willing to give up on the space. I also think that open, permissionless decentralized systems are very different from what we saw\" previously.","\"In order to ensure that there is proliferation of this technology and it's protected and can grow, we need good regulatory guardrails,\" she said. The lawyer is hopeful the U.S. will pass evergreen legislation that will permit the industry to flourish.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"I want 2023 to be the year of the use case,\" Rettig said. There are \"amazing applications\" that people are building that need to be highlighted, like tracking food to get to developing countries. Household name brands are also incorporating blockchain into their long-term innovation plans, and those actions should be spotlighted.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2017","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Justice Department","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Aave Companies","content":"ORGANIZATION"},{"type":"Rebecca Rettig","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Polgyon Labs","content":"ORGANIZATION"},{"type":"Rettig","content":"PERSON"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Polygon Labs","content":"ORGANIZATION"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}