{"summary":"Following the successful launch of U.S. spot bitcoin ETFs, Bitfinex anticipates high demand for regulated digital asset investment vehicles.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275351\/bitfinex-securities-el-salvador","publishDate":"2024-01-31T09:00:03","id":5623,"type":null,"title":"Bitfinex Securities launches digital asset services in El Salvador","category":["EXCHANGES"],"content":["Bitfinex Securities has become the first licensed provider to offer digital assets services in El Salvador.","The securities token platform said it was now accepting customer applications and has established a pipeline of potential tokenized financial asset issuances that it expects will come to market in the first half of this year.","“We are delighted to be able to announce the launch of Bitfinex Securities in El Salvador,” Bitfinex Securities CTO Paolo Ardoino said in a statement. “This is not only an important market for Bitfinex given its adoption of Bitcoin as legal tender and the fostering of a Bitcoin-based economy, but it also gives El Salvador the opportunity to attract global investment flows, as issuers put out competitively priced securities offerings.”","Following the successful launch of U.S. spot bitcoin exchange-traded funds, Bitfinex anticipates high demand for such regulated digital asset investment vehicles. “We are especially positive about the timing given the recent surge of institutional investor interest in Bitcoin-focused financial products,” Bitfinex Securities Head of Operations Jesse Knutson added.","El Salvador, which hit the headlines in 2021 by giving <a href=\"https:\/\/www.theblock.co\/post\/107699\/el-salvador-becomes-the-first-country-ever-to-make-bitcoin-legal-tender\" data-v-f87c67ca=\"\">Bitcoin legal tender<\/a> status, also launched an “Adopting El Salvador Freedom Visa” program in collaboration with stablecoin issuer Tether in December. Under the scheme, investors apply for the <a href=\"https:\/\/www.theblock.co\/post\/266732\/el-salvador-launches-1-million-freedom-visa-bitcoin-tether\" data-v-f87c67ca=\"\">Freedom Visa<\/a> by investing $1 million in Bitcoin or USDT.","Earlier this month, the country also approved a <a href=\"https:\/\/blog.bitfinex.com\/announcements\/el-salvadors-historic-digital-asset-securities-law-passes\/\" data-v-f87c67ca=\"\">digital asset regulatory framework<\/a>, laying the foundation for fully operational Bitcoin-based financial markets.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"El Salvador","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Bitfinex Securities CTO Paolo Ardoino","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Adopting El Salvador Freedom Visa","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"Bitfinex Securities","content":"ORGANIZATION"},{"type":"Bitfinex Securities Head of Operations Jesse Knutson","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":[],"authors":["James Hunt","The Block"]}