{"summary":"As non-crypto native companies develop their Web3 strategies, an increased focus has been placed on the utility of NFTs. Over the past month, we’ve looked at how various companies are tokenizing RWA.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/209654\/a-guide-to-accounting-for-tokenization","publishDate":"2023-02-08T08:50:32","id":5630,"type":null,"title":"A Guide To Accounting for Tokenization","category":["SPONSORED"],"content":["<span data-contrast=\"auto\" data-v-f87c67ca=\"\">As non-crypto native companies develop their Web3 strategies, an increased focus has been placed on the utility of NFTs. Over the past month, we’ve looked at how various companies are <\/span><a href=\"https:\/\/www.theblock.co\/post\/200439\/real-world-assets-and-the-road-to-tokenization\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">tokenizing RWA<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\">. For non-financial companies, <\/span><a href=\"https:\/\/www.forbes.com\/sites\/jeffgapusan\/2023\/01\/30\/intangibles-and-nfts-can-creators-make-beliebers-of-companies\/\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">taking cues from creators<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\"> may steer how they leverage what could be their largest asset, intellectual property. There is no doubt that tokenization allows companies to creatively extract value from their assets. As digital assets grow in popularity, so, too, do <\/span><a href=\"https:\/\/ledgible.io\/accounting\/\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">accounting and financial reporting<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\"> needs around those assets.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:360}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Tokenization gives companies the ability to communicate information and transact directly with external stakeholders (including investors and customers). The blockchain allows the enterprise to protect the authenticity, ownership, and integrity of that information. Additionally, tokenization enables companies to fractionalize ownership interests in assets for distribution to customers.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:360}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">The <\/span><a href=\"https:\/\/ledgible.io\/10-considerations-for-accountants-working-with-defi-transactions\/\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">nonfungible nature of NFTs<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\"> speaks to the unique nature of every asset, which changes the way accountants and other financial professionals think about cost-basis. As balance sheet assets are tokenized, companies have the ability to use the specific identification method as it relates to inventory valuation. Let’s look at two real-world examples with tangible (financial products) and intangible (patents) assets.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:360}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">When investors purchase financial products, investors record the number of units (shares), per unit cost, and applicable transaction fees. Like physical goods, investors calculate the cost basis of their positions for FP&amp;A purposes. As they accumulate or add to their initial position, that cost basis may change based on market fluctuations. As investors close out their positions, how they determine cost basis could affect their P&amp;L dramatically. There are a number of <\/span><a href=\"https:\/\/ledgible.io\/professional\/\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">cost-basis calculation<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\"> methods—First In, First Out (FIFO), and Last In, First Out (LIFO), Highest In, First Out (HIFO), and Average Cost Basis to name a few— that could also add to the confusion. <\/span><span data-contrast=\"auto\" data-v-f87c67ca=\"\">While investors choose a cost-basis calculation method that meets their needs, it is generally expected they apply the same method across reporting periods.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:360}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">For intangible assets, in this case, we’ll use patents, the methodology is not as cut &amp; dry. Intangible assets are valued and tracked on the balance sheet only when they are part of an acquisition, and a valuation is actually determined. Unlike financial products, there is no concept of marking to market the value of intangible assets. Thus, there is no standardized accounting method for their valuation between origination and sale. By tokenizing patents, it is conceivable that not only can a value be assessed to a balance sheet asset, but the ownership of the same asset could be fractionalized to spread financing risk\/reward across a number of investors or interested parties.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:360}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Tokenization enables more accurate determinations of value and methods of gaining exposure to different asset classes. In order to successfully account for this activity, the infrastructure must be built to support the enhanced functionality enabled by blockchain technology. Companies and financial &amp; accounting professionals must have access to tools that accurately account for their tokenization activity. While legacy financial technology suites are often unable to do so, Ledgible was developed to bridge this gap. Partnered with providers like, FIS, Thomson Reuters, and Wolters Kluwer, Ledgible standardizes and normalizes digital asset and blockchain accounting data to fit into existing tax and accounting infrastructure. To learn more about the solutions Ledgible offers to <\/span><a href=\"https:\/\/ledgible.io\/solutions\/\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">enterprises and institutions<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\">, you can explore our solutions page <\/span><a href=\"https:\/\/ledgible.io\/solutions\/\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">here<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\">.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:360}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<em data-v-f87c67ca=\"\">This post is commissioned by Ledgible and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ledgible","content":"PERSON"},{"type":"Thomson Reuters","content":"ORGANIZATION"},{"type":"Wolters Kluwer","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"FIS","content":"ORGANIZATION"},{"type":"FIFO","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}