{"summary":"SushiSwap, a new, unaudited decentralized finance (DeFi) protocol, has crossed $700 million in total value locked. SushiSwap is a fork of Uniswap, with a governance token called SUSHI.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/76419\/uniswap-fork-sushiswap-700-million-total-value-locked","publishDate":"2020-08-31T04:40:26","id":5633,"type":null,"title":"Uniswap fork SushiSwap has crossed $700 million in total value locked within three days of the project announcement","category":["DEFI"],"content":["SushiSwap, a new, unaudited decentralized finance (DeFi) protocol, has gained much momentum within three days of its protocol announcement.","A Uniswap fork, SushiSwap, has already hit more than $700 million in total value locked, according to tracker Zippo. SushiSwap <a href=\"https:\/\/medium.com\/sushiswap\/the-sushiswap-project-c4049ea9941e\" data-v-f87c67ca=\"\">claims to have been designed<\/a> as an \"evolution\" to Uniswap.","What differentiates SushiSwap from Uniswap is the governance token SUSHI. Uniswap doesn't yet have its governance token and offers collected trading fees to its liquidity providers. SushiSwap, on the other hand, would offer SUSHI tokens to liquidity providers when the protocol's mainnet goes live in about two weeks.","Specifically, Uniswap currently distributes 0.30% of all trading fees as rewards to liquidity providers in any pool. SushiSwap, on the other hand, would offer 0.25% to liquidity providers, while the remaining 0.05% would get converted back to SUSHI tokens and get rewarded. This means liquidity providers that provide the most liquidity would get most SUSHI tokens, which can then be traded, as well as be used to cast governance votes.","SushiSwap's massive total value locked shows that liquidity providers are lapping up to grab SUSHI tokens, which are currently priced at $3.62 a piece, according to Zippo.","","","The SushiSwap mania gives a feeling of <a href=\"https:\/\/www.theblockcrypto.com\/post\/74810\/yam-token-market-cap-collapses-by-more-than-90-flaw\" data-v-f87c67ca=\"\">YAM, the viral DeFi project<\/a>, which quickly grew popular and died off within days due to a critical bug in its smart contracts.","SushiSwap's smart contracts are also unaudited, although <a href=\"https:\/\/twitter.com\/NomiChef\/status\/1300304685836853250?s=20\" data-v-f87c67ca=\"\">Quanstamp is said to be<\/a> auditing them soon. Moreover, SushiSwap is founded by anonymous developers, led by pseudonym <a href=\"https:\/\/twitter.com\/NomiChef\" data-v-f87c67ca=\"\">Chef Nomi<\/a>. The development team of SushiSwap would <a href=\"https:\/\/medium.com\/sushiswap\/the-sushiswap-project-c4049ea9941e\" data-v-f87c67ca=\"\">get 10%<\/a> of all SUSHI that is issued.","Several DeFi experts are against SushiSwap for apparent reasons. Brendan Forster, co-founder of lending protocol Dharma Labs, <a href=\"https:\/\/twitter.com\/brendan_dharma\/status\/1299852028366057473?s=20\" data-v-f87c67ca=\"\">hopes<\/a> that the SushiSwap experiment \"fails.\"","\"Forking liquidity will make swap prices worse for all users and make impermanent loss worse for all LPs [liquidity providers]. The only beneficiaries are the Sushi founders,\" said Forster.","Will Warren, co-founder of decentralized exchange protocol 0x, <a href=\"https:\/\/twitter.com\/willwarren89\/status\/1299883870423146496?s=20\" data-v-f87c67ca=\"\">said<\/a> it would be \"terrible\" if SushiSwap won. \"It's in the Ethereum community's best interest to reward builders. That said, forking liquidity would only result in worse swap prices for people that go direct to single source rather than an aggregator,\" said Warren.","Yet, at the time of writing, more than $698 million of Uniswap's $1 billion liquidity <a href=\"https:\/\/uniswap.info\/token\/0x6b3595068778dd592e39a122f4f5a5cf09c90fe2\" data-v-f87c67ca=\"\">is coming from<\/a> people earning SUSHI tokens.","","","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Source: Uniswap.info<\/span><\/em>","Uniswap itself is also breaking new records. The number one decentralized exchange protocol <a href=\"https:\/\/twitter.com\/haydenzadams\/status\/1300034164830408704?s=20\" data-v-f87c67ca=\"\">overtook<\/a> Coinbase Pro's trading volumes for the first time yesterday. Coinbase Pro's 24-hour volumes were $348 million, while Uniswap hit $426 million.","Uniswap is also said to roll out its governance token with the launch of its version 3 (V3) protocol in the near future, and users appear to have high expectations from it.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"0.30%","content":"PERCENT"},{"type":"Warren","content":"PERSON"},{"type":"Uniswap fork","content":"ORGANIZATION"},{"type":"0.25%","content":"PERCENT"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"$3.62","content":"MONEY"},{"type":"YAM","content":"ORGANIZATION"},{"type":"$348 million","content":"MONEY"},{"type":"$698 million","content":"MONEY"},{"type":"Brendan Forster","content":"PERSON"},{"type":"Forster","content":"PERSON"},{"type":"SushiSwap","content":"ORGANIZATION"},{"type":"$700 million","content":"MONEY"},{"type":"$426 million","content":"MONEY"},{"type":"0.05%","content":"PERCENT"},{"type":"pseudonym <a href=\"https:\/\/twitter.com\/NomiChef\" data-v-f87c67ca=\"\">Chef Nomi","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["UNISWAP"],"authors":["Yogita Khatri","The Block"]}