{"summary":"Digital Currency Group founder and CEO Barry Silbert updated shareholders on Tuesday and said the company would come out of the current environment stronger. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189280\/dcg-ceo-barry-silbert-updates-shareholders-says-company-will-emerge-stronger","publishDate":"2022-11-22T14:30:35","id":5635,"type":null,"title":"DCG CEO Barry Silbert updates shareholders, says company will emerge &#x27;stronger&#x27;","category":["EXCHANGES"],"content":["Digital Currency Group founder and CEO Barry Silbert updated shareholders on Tuesday and said the company would come out of the current environment stronger a day after media reports that its Genesis unit faced a possible bankruptcy.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"DCG will continue to be a leading builder of the industry and we are committed to our long-term mission of accelerating the development of a better financial system,\" he wrote in a note to clients obtained by The Block. \"We have weathered previous crypto winters and while this one may feel more severe, collectively we will come out of it stronger.\"&nbsp;","Genesis Global Capital, the crypto lender owned by DCG, has hired investment bank Moelis &amp; Company to explore options including a potential bankruptcy, the New York Times <a href=\"https:\/\/www.nytimes.com\/2022\/11\/22\/business\/dealbook\/genesis-crypto-restructuring-adviser.html\" data-v-f87c67ca=\"\">reported on Tuesday<\/a>, citing sources. A final decision hasn't been made, and the sources said it was still possible to avoid bankruptcy.&nbsp;","\"Our goal is to resolve the current situation without the need for filing a bankruptcy,” a Genesis spokesman told the New York Times.&nbsp;","<em data-v-f87c67ca=\"\">(Updates with New York Times report.)<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DCG","content":"ORGANIZATION"},{"type":"Moelis &amp; Company","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"Barry Silbert","content":"PERSON"}],"hashtag":[],"authors":["Nathan Crooks","Frank Chaparro","The Block"]}