{"summary":"Users can now swap native crypto assets on the Thorswap platform without needing to use a third-party bridge.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/165011\/thorswap-launches-cross-chain-swaps-for-over-8300-tokens","publishDate":"2022-08-23T10:00:17","id":5636,"type":null,"title":"Thorswap launches cross-chain swaps for majority of Ethereum tokens","category":["DEX"],"content":["Thorswap, a multi-chain decentralized exchange (DEX) aggregator built on THORChain's cross-chain liquidity protocol, has launched cross-chain swaps for the majority of Ethereum-based tokens.","This addition of supported assets, paired with its aggregated liquidity from DEXs such as Uniswap and Sushiswap, allows users to swap native crypto assets on the Thorswap platform without needing to use a third-party bridge.","A native token is one running directly on a blockchain (say ether on Ethereum), while a non-native token is a derivative token on another blockchain (like wrapped ether on Solana).","Thorswap gives users the choice of what type — non-native or native — tokens they want to transfer. It supports bitcoin, ether, BNB, dogecoin and other coins. The protocol currently holds approximately $361 million in Total Value Locked (TVL).","Cross-chain swaps let you swap a token from one blockchain to a different token on another blockchain. They either happen through one single protocol or take use of multiple protocols (combinations of decentralized exchanges and bridging protocols).","In this case, Thorswap uses Thorchain, which is a single protocol for cross-chain swaps. This is what enables users to make cross-chain swaps without using non-native assets.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Thorswap","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"$361 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["TOKENS"],"authors":["Mike Truppa","The Block"]}