{"summary":"The company reported the incident to law enforcement authorities in Shenzhen, and some of BTC.com&#x27;s digital assets have already been secured.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/197924\/btc-com-parent-bit-mining-hacked-3-million-in-assets-taken","publishDate":"2022-12-26T10:16:45","id":5641,"type":null,"title":"BTC.com parent BIT Mining hacked, $3 million in assets taken","category":["SECURITY"],"content":["BTC.com parent company BIT Mining Limited said it was <a href=\"https:\/\/www.prnewswire.com\/news-releases\/bit-mining-limited-subsidiary-experiences-cyberattack-301709947.html\" data-v-f87c67ca=\"\">hacked<\/a> earlier this month, with about $700,000 in client assets and $2.3 million in company assets stolen.","The publicly-traded firm said it was hit by a cyberattack on Dec. 3. It reported the incident to law enforcement authorities in Shenzhen, and some of BTC.com's digital assets have since been secured.","Authorities started an investigation on Dec. 23 into the matter.","“In the wake of discovering this cyberattack, the company has implemented technology to better block and intercept hackers,” BIT Mining said. “BTC.com is currently operating its business as usual, and apart from its digital asset services, its client fund services are unaffected.”","Shares of the miner are down 98% over the past year as miners have seen margins squeezed with higher energy costs and a slump in the price of bitcoin.","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dec. 3","content":"DATE"},{"type":"BIT Mining Limited","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Shenzhen","content":"LOCATION"},{"type":"98%","content":"PERCENT"},{"type":"$2.3 million","content":"MONEY"},{"type":"$700,000","content":"MONEY"},{"type":"Dec. 23","content":"DATE"}],"hashtag":["HACKS"],"authors":["Christiana Loureiro","The Block"]}