{"summary":"The FCA warned that it can take steps to suspend or cancel the registration of a cryptoasset business. Bitpanda said that it and Trustology are &quot;confident that no issues with the acquisition will arise.”","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/135042\/uk-financial-regulator-issues-warning-shot-on-crypto-mergers-following-bitpanda-deal","publishDate":"2022-02-22T12:01:01","id":5642,"type":null,"title":"UK financial regulator issues warning shot on crypto mergers following Bitpanda deal","category":["MERGERS & ACQUISITIONS"],"content":["<span data-v-f87c67ca=\"\">The UK’s financial regulator issued a warning shot on crypto mergers on Tuesday afternoon, following an acquisition announcement by Austrian exchange Bitpanda.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bitpanda, which is regulated in the EU, said it would buy DeFi custodian Trustology, which is Financial Conduct Authority (FCA) regulated through the Money Laundering Regulations (MLR) register.&nbsp;<\/span>","<a href=\"https:\/\/www.theblockcrypto.com\/post\/134994\/crypto-unicorn-bitpanda-acquires-trustology\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The acquisition<\/span><\/a><span data-v-f87c67ca=\"\"> is the first of its kind in the UK market and is seen by Bitpanda as a<\/span> first step towards transforming its Bitpanda Pro platform into a fully-fledged prime brokerage business.&nbsp;","<span data-v-f87c67ca=\"\">Shortly after the announcement, the FCA issued a release highlighting that existing regulations for crypto firms do not include provisions, which allow the watchdog to assess how well new owners meet its requirements if a regulated firm is bought out.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Other regimes give the FCA the powers to supervise, authorize or enforce against firms operating in the UK.<\/span>","<span data-v-f87c67ca=\"\">“The FCA can take steps to suspend or cancel the registration of a cryptoasset business if it is not satisfied the firm or its beneficial owner is fit and proper,” it said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">It added that it has powers to suspend or cancel a firm’s cryptoasset registration on a number of grounds, including where a firm has not complied with obligations under MLRs.<\/span>","<span data-v-f87c67ca=\"\">A spokesperson for Bitpanda said that it and Trustology are “confident that no issues with the acquisition will arise.”<\/span>","<span data-v-f87c67ca=\"\">“We have a very good working relationship with the FCA who was informed of that transaction well in advance and the FCA statement was in accordance with Bitpanda’s expectations,” they said, adding:<\/span>","<span data-v-f87c67ca=\"\">“Given that this transaction was the first ever acquisition of an FCA registered cryptoasset firm ever, it appears that the FCA wants to highlight this specific difference in its ability to assess the suitability of new beneficial owners of FCA registered cryptoasset firms only after a transaction took place as opposed to, for example, FSMA-authorised firms such as Investment firms which can be assessed prior to such transactions.”<\/span>","<span data-v-f87c67ca=\"\">The release comes amid prolonged wrangling between crypto firms operating in the UK and regulators, as the deadline to be included on the FCA’s cryptoassets register by the 31st March looms ever nearer.&nbsp;<\/span>","<a href=\"https:\/\/www.theblockcrypto.com\/post\/133597\/crypto-firms-face-cliff-edge-in-uk-as-time-ticks-down-for-aml-approval\" data-v-f87c67ca=\"\">Earlier in February<\/a>, there were still 96 applicants awaiting decisions on their applications.&nbsp;","Bitpanda has previously explained that it had applied to be on the temporary register in May 2021, but it had missed the deadline. It is now in the process of being admitted to the full register.&nbsp;","The Block contacted the FCA for further clarification on its statement but had not heard back by the time of publication.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March","content":"DATE"},{"type":"UK","content":"ORGANIZATION"},{"type":"May 2021","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"MLRs","content":"ORGANIZATION"},{"type":"FCA","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"Bitpanda","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"Financial Conduct Authority (FCA","content":"ORGANIZATION"},{"type":"afternoon","content":"TIME"}],"hashtag":["FCA"],"authors":["Lucy Harley-McKeown","The Block"]}