{"summary":"LDO&#x27;s weight in the Grayscale DeFi Fund sits at 19.04%, second only to Uniswap&#x27;s UNI at 45.46%.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/238487\/grayscale-makes-lido-the-second-heaviest-component-in-its-defi-fund","publishDate":"2023-07-07T16:30:44","id":5647,"type":null,"title":"Grayscale makes Lido the second-heaviest component in its DeFi Fund","category":["DEFI"],"content":["Digital asset manager Grayscale added the Lido protocol's LDO token to its DeFi Fund, making it the second-heaviest component.","Grayscale's DeFi Fund is now weighted to include Uniswap (UNI) at 45.46%, Lido (LDO) at 19.04%, Aave (AAVE) at 11.53%, MakerDAO (MKR) at 10.82%, Curve DAO Token (CRV) at 7.03% and Synthetix (SNX) at 6.12%.","\"In accordance with the CoinDesk DeFi Select Index methodology, Grayscale has adjusted the DeFi Fund’s portfolio by selling certain amounts of the existing Fund Components in proportion to their respective weightings, and using the cash proceeds to purchase Lido (LDO),\" Grayscale said in a company <a href=\"https:\/\/www.globenewswire.com\/news-release\/2023\/07\/07\/2701070\/0\/en\/Grayscale-Digital-Large-Cap-Fund-Grayscale-DeFi-Fund-and-Grayscale-Smart-Contract-Platform-Ex-Ethereum-Fund-Announce-Rebalancing-of-Funds-for-Second-Quarter-2023.html\" data-v-f87c67ca=\"\">release<\/a>. \"No tokens were removed from the DeFi Fund.\"","Lido is a decentralized liquid staking protocol that allows users to keep staked tokens liquid via a stand-in token, or stToken.","Grayscale redefines the composites of its funds quarterly.","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"6.12%","content":"PERCENT"},{"type":"Uniswap (UNI","content":"ORGANIZATION"},{"type":"7.03%","content":"PERCENT"},{"type":"CRV","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"45.46%","content":"PERCENT"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"19.04%","content":"PERCENT"},{"type":"10.82%","content":"PERCENT"},{"type":"11.53%","content":"PERCENT"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}