{"summary":"MakerDAO has added Chainlink’s oracle to its technology stack for maintaining the stability of its DAI stablecoin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210229\/makerdao-integrates-chainlink-oracle-to-help-maintain-dai-stability","publishDate":"2023-02-09T12:00:48","id":5649,"type":null,"title":"MakerDAO integrates Chainlink oracle to help maintain DAI stability","category":["CRYPTO ECOSYSTEMS"],"content":["MakerDAO integrated Chainlink’s decentralized oracle into the framework that helps to maintain the stability of its DAI stablecoin, after a successful governance vote.","With the <a href=\"https:\/\/vote.makerdao.com\/executive\/template-executive-proposal-dust-parameter-changes-chainlink-automation-keeper-network-stream-setup-recognized-delegate-compensation-for-january-february-8-2023#proposal-detail\" data-v-f87c67ca=\"\">vote<\/a> passed, MakerDAO can now onboard Chainlink Automation to its Keeper Network. MakerDAO’s Keeper Network is responsible for ensuring DAI stability. It is a network of bots that controls parameters like price and debt ceiling to ensure that DAI maintains its parity with the U.S. dollar.","Chainlink Automation becomes the latest third-party protocol added to the technology stack that runs the DAI stablecoin. The Chainlink oracle will be put to work on functions like price updates, liquidity rebalancing and upgrading of the debt ceiling for DAI collateral assets. Debt ceiling refers to the maximum number of DAI that can be minted against supported collateral assets.","The Chainlink integration was part of a <a href=\"https:\/\/www.theblock.co\/post\/194316\/makerdao-to-execute-bundled-governance-actions-including-pay-for-delegates\" data-v-f87c67ca=\"\">voting package<\/a> agreed upon by DAO delegates on Thursday. The voting package also included dust parameter changes for several vault types and compensation for recognized DAO delegates for January. There are 17 DAO delegates who will receive a total of 109,048 DAI ($109,048).","The Chainlink Automation integration itself on the Keeper Network will also receive a stream of 181,000 DAI ($181,000). This sum will cover a period of 6 months, amounting to 1,000 DAI tokens per day.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$109,048","content":"MONEY"},{"type":"Chainlink Automation","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Chainlink oracle","content":"ORGANIZATION"},{"type":"DAI","content":"ORGANIZATION"},{"type":"$181,000","content":"MONEY"}],"hashtag":["DAI","DAOS","DEVELOPER TOOLS","GOVERNANCE VOTES"],"authors":["Osato Avan-Nomayo","The Block"]}