{"summary":"The SEC will approve a spot bitcoin ETF by the Jan. 10 deadline as a &quot;political necessity,&quot; according to TD Cowen.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/270051\/spot-bitcoin-etf-sec-political-necessity-td-cowen","publishDate":"2024-01-02T16:25:02","id":5652,"type":null,"title":"SEC will approve a spot bitcoin ETF as a &#x27;political necessity&#x27;: TD Cowen","category":["MARKETS"],"content":["The U.S. Securities and Exchange Commission will approve a spot bitcoin exchange-traded fund by the Jan. 10 deadline as a \"political necessity,\" according to investment bank TD Cowen.","\"To us, this is a political necessity as the agency needs to cement its role as a crypto regulator before Congress consider broader crypto legislation,\" TD Cowen Washington Research Group, led by Jaret Seiberg, wrote in a note on Tuesday. \"We also believe the agency does not want to lose a legal challenge to its refusal to approve bitcoin ETFs.\"","The Jan. 10 deadline is when the SEC must finally decide whether to accept or deny an application from Cathie Wood's ARK Investment and 21Shares — the first group to file a spot bitcoin ETF application. By that time, the SEC could also rule on other similar filings. More than a dozen firms, including BlackRock and Fidelity, have filed spot bitcoin ETF applications.","TD Cowen is <a href=\"https:\/\/www.theblock.co\/post\/258453\/jpmorgan-bitcoin-etf-approval-within-months\" data-v-f87c67ca=\"\">among several analysts<\/a> that are confident that the SEC will approve spot bitcoin ETFs by next week. Last week, citing sources, Reuters <a href=\"https:\/\/www.theblock.co\/post\/269789\/sec-may-notify-approved-etf-issuers-by-early-next-week-ahead-of-january-10-launch-reuters?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">reported<\/a>&nbsp;that the SEC may notify whether the 14 firms vying to issue a spot bitcoin ETF&nbsp; would have its approval or not as early as this week, ahead of a possible Jan. 10 launch. The price of bitcoin has rallied over the past months, mainly due to growing optimism that the SEC will approve spot bitcoin ETFs, which are expected to bring additional institutional investment into the crypto industry. <a href=\"https:\/\/www.theblock.co\/prices\" data-v-f87c67ca=\"\">Bitcoin's price<\/a> is currently around $45,000.","Aside from the SEC nod for spot bitcoin ETFs on the crypto policy front, the focus has also been on <a href=\"https:\/\/www.theblock.co\/post\/266114\/legislative-outlook-what-headwinds-does-crypto-legislation-face-in-2024\" data-v-f87c67ca=\"\">two Republican-led bills<\/a> over the past year. One bill wants to regulate stablecoins on the federal level, while the other takes a comprehensive approach to crypto's market structure. Both bills passed out of the House Financial Services Committee led by Chair Patrick T. McHenry, R-N.C., in July but would need to be brought to the Senate Banking Committee, which could prove challenging this year.","But, according to TD Cowen, there is still an opportunity to make a deal during the 'lame duck' period after an election for a broad crypto market structure bill. The lame duck period refers to the time between the election and the inauguration of a new government. McHenry would want to get it done before retiring from Congress at the end of 2024, according to TD Cowen. \"To get the Senate and White House on board, the SEC will need to be the lead on investor protections,\" TD Cowen said.","On the stablecoin bill, TD Cowen said it would be the fallback for McHenry if he cannot enact broader crypto market structure legislation. \"We see this as less of a political lift than crypto market structure, though the hurdles remain significant,\" TD Cowen said, adding: \"It will depend on how much Republicans are willing to give in to Democratic demands.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Jan. 10","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"White House","content":"ORGANIZATION"},{"type":"Cathie Wood","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Senate Banking Committee","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"McHenry","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"TD Cowen Washington Research Group","content":"ORGANIZATION"},{"type":"Patrick T. McHenry","content":"PERSON"},{"type":"TD Cowen","content":"ORGANIZATION"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"$45,000","content":"MONEY"},{"type":"Cowen","content":"ORGANIZATION"},{"type":"Jaret Seiberg","content":"PERSON"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":["BITCOIN","INVESTMENT FIRMS","TRADFI BANKS"],"authors":["Yogita Khatri","The Block"]}