{"summary":"Tether has offered new loans in USDT to clients almost a year after it said it would stop offering secured loans in 2023.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/252273\/tether-stablecoin-lending","publishDate":"2023-09-21T08:46:37","id":5656,"type":null,"title":"Tether increased stablecoin loans to $5.5 billion after saying it planned to stop: WSJ","category":["STABLECOINS"],"content":["<span data-v-f87c67ca=\"\">Tether has reportedly continued lending stablecoin <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248350\/tether-usdt-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/Tether.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">USDT<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.024%\n    <\/span><\/a> <!----><\/span> to clients less than a year after stating it would discontinue the practice.<\/span>","The company's latest <a href=\"https:\/\/tether.to\/en\/transparency\/#reports\" data-v-f87c67ca=\"\">quarterly financial update<\/a> showed the stablecoin issuer has increased its issuing of USDT-denominated loans. The report showed assets that included $5.5 billion of loans as of June 30. This is an increase from $5.3 billion a quarter earlier.","According to the <a href=\"https:\/\/www.wsj.com\/finance\/currencies\/tether-is-lending-its-stablecoins-again-b11705f2?mod=Searchresults_pos1&amp;page=1\" data-v-f87c67ca=\"\">Wall Street Journal<\/a>, the company has made new loans. “During the second quarter of 2023, we received a few short-term loan requests from clients with whom we have cultivated longstanding relationships, and we made the decision to accommodate these requests,” a Tether spokesperson told The Wall Street Journal.","is a publicist who works at , a public relations firm. She shared comments from a Tether spokesperson with the WSJ reporter, but she is not the spokesperson.&nbsp;","Welch said the reasons for issuing the loans were either to prevent any depletion of customer liquidity or to assist clients so they did not have to sell their collateral at potentially unfavorable prices. However, she reportedly added that loans would be reduced to zero by 2024.","This is contrary to Tether's blog <a href=\"https:\/\/tether.to\/en\/tether-addresses-fud-around-secured-loans-reveals-plans-to-reduce-these-to-zero-in-2023\/\" data-v-f87c67ca=\"\">post<\/a> announcement from late last year that said the company would reduce its loans to zero in 2023. \"Tether is announcing starting from now, throughout 2023, it will reduce secured loans in Tether’s reserves to zero,\" the company stated in December 2022. Tether's blog post came after the collapse of the <a href=\"https:\/\/www.theblock.co\/post\/251956\/stanford-university-plans-to-return-millions-of-dollars-received-from-ftx-bloomberg\" data-v-f87c67ca=\"\">FTX cryptocurrency exchange<\/a> and was an attempt to restore faith in the market.","In direct response to the Wall Street Journal's report, Tether <a href=\"https:\/\/tether.to\/en\/challenges-plague-banking-industry-as-tether-demonstrates-strength-and-commitment-to-high-quality-principles-amidst-scrutiny-from-wsj\/\" data-v-f87c67ca=\"\">stated<\/a>: \"Traditional financial institutions are not addressing the needs of their customers in a way that is detrimental to a thriving economy and few have taken the time to examine this further. Rather they are spending time scrutinizing Tether, who, in the interest of its customers, has accrued more than $3.3 billion in excess reserves to effectively reduce secure loan exposure as net result.\"","Tether previously said it only issues secured loans that are \"over-collateralized by liquid assets.\" However, the company's balance sheets do not show what those assets are and whether the collateral includes cryptocurrencies. The quarterly report reserve breakdown states a composition of 6.36% in secured loans, \"with none to affiliated entities.\"","Most assets listed in Tether Holdings’ latest quarterly <a href=\"https:\/\/assets.ctfassets.net\/vyse88cgwfbl\/63oJePOHqIvrcnXWMPZ1M0\/4cfaf2e7cdf80c30b17fdc70faaf741f\/ESO.03.01_Std_ISAE_3000R_Opinion_30-06-2023_BDO_Tether_CRR.pdf\" data-v-f87c67ca=\"\">report<\/a> are U.S. Treasury bills and other highly liquid assets. Treasury bills make up around $55.8 billion of the company's reserves. Also listed is around $3.3 billion in precious metals and around $1.7 billion in bitcoin.","Tether does not release a comprehensive balance sheet in its quarterly reports. Reserves are independently audited in periodic attestations by accounting firm BDO Italia. Tether provides minimal information about the make-up of the borrowers of its secured loans.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"Anyone with a minimum understanding of financial markets would see how a company having $3.3 billion in excess equity and on track to make a yearly profit of $4 billion is in all effects offsetting the secured loans and retaining such profits within the company balance sheet,\" Tether said, while noting that it \"is still committed to removing the secured loans from its reserves.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USDT","content":"ORGANIZATION"},{"type":"June 30","content":"DATE"},{"type":"WSJ","content":"ORGANIZATION"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"$55.8 billion","content":"MONEY"},{"type":"+0.024%","content":"PERCENT"},{"type":"$4 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"second quarter of 2023","content":"DATE"},{"type":"$3.3 billion","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Tether","content":"ORGANIZATION"},{"type":"$5.5 billion","content":"MONEY"},{"type":"December 2022","content":"DATE"},{"type":"BDO Italia","content":"ORGANIZATION"},{"type":"Welch","content":"PERSON"},{"type":"$1.7 billion","content":"MONEY"},{"type":"$5.3 billion","content":"MONEY"},{"type":"6.36%","content":"PERCENT"}],"hashtag":["TETHER"],"authors":["Brian McGleenon","The Block"]}