{"summary":"Interoperability project Connext will release native token and airdrop to early users in September.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/245990\/connext-token-airdrop","publishDate":"2023-08-17T11:00:54","id":5657,"type":null,"title":"Connext to airdrop native token &#x27;Next&#x27; in early September","category":["COMPANIES"],"content":["Blockchain interoperability project Connext will launch its native token, called Next, on September 5 — more than a year after the initial plan for a token. The Connext team will airdrop its Next token to early users across Polygon, Arbitrum, Optimism, and Gnosis Chain, and the claims will begin on September 5.","Connext serves as a cross-chain messaging protocol, enabling transfer across multiple blockchains. It has processed more than 1.2 million transactions across different blockchains with a cumulative volume of $1.6 billion.","The Next <a href=\"https:\/\/www.theblock.co\/post\/142663\/connext-unveils-token-next-airdrop-blockchain-interoperability\" data-v-f87c67ca=\"\">token<\/a> will be used to govern Connext’s ecosystem through a decentralized autonomous organization.","“At launch, the Next token will be used for tokenholder governance in the Connext DAO,” Arjun Bhuptani, founder and CEO of Connext, told The Block. “Subject to DAO approval and community development, the token could also be used to enshrine common governance operations, such as fair router utilization and asset\/chain support, directly into the protocol itself through activities such as staking of Next tokens.”","In the future, the token will have the additional function of decentralizing the network by allowing activities such as cross-chain routing and token listings to be completely permissionless. This will be done through the staking of Next tokens, subject to DAO approval.","The announcement comes as Connext is partnering with <a href=\"https:\/\/www.tokensoft.io\/\" data-v-f87c67ca=\"\">Tokensoft<\/a> to introduce what's known as \"crosschain airdrops as a service\". With this service, recipients of airdrops can claim tokens on any chain without needing to bridge or incur extra gas fees. The service will go live with the Next airdrop.","The airdrop claim service leverages Connext’s recently released <a href=\"https:\/\/www.theblock.co\/post\/241290\/alchemix-connext-xerc20\" data-v-f87c67ca=\"\">xERC20 token standard<\/a>, allowing assets to move across chains without slippage.","In June 2023, Connext <a href=\"https:\/\/www.theblock.co\/post\/234494\/interoperability-startup-connext-raises-7-5-million\" data-v-f87c67ca=\"\">raised<\/a> $7.5 million in a strategic funding round at a valuation of $250 million, bringing the team’s total funding to $23.5 million.","<em data-v-f87c67ca=\"\">Disclaimer: Larry Cermak, CEO of The Block, is an angel investor in Connext.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Connext","content":"ORGANIZATION"},{"type":"Polygon","content":"LOCATION"},{"type":"September 5","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$250 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$1.6 billion","content":"MONEY"},{"type":"Connext DAO","content":"ORGANIZATION"},{"type":"Arjun Bhuptani","content":"PERSON"},{"type":"Larry Cermak","content":"PERSON"},{"type":"$23.5 million","content":"MONEY"},{"type":"DAO","content":"ORGANIZATION"},{"type":"$7.5 million","content":"MONEY"},{"type":"Gnosis Chain","content":"PERSON"},{"type":"June 2023","content":"DATE"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}