{"summary":"Last week saw the US Treasury sanction Tornado Cash, Blackrock announce its entry into crypto and a tentative date for Ethereum’s transition to proof-of-stake. \nNext week will likely see ripples across the crypto space as Ethereum gears up for the merge, an update on embattled lender Hodlnaut and further developments on the Tornado Cash ordeal. ","author":["Tom Matsuda","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/163428\/the-week-aheads-three-biggest-cryptocurrency-stories","publishDate":"2022-08-14T08:57:47","id":566,"type":null,"title":"The week ahead&#x27;s three biggest cryptocurrency stories","category":["Cryptocurrency"],"content":["It's safe to say that crypto is one of the most unpredictable financial sectors. Last week, the US Treasury sanctioned crypto mixer Tornado Cash, Blackrock announced its entry into crypto and a tentative date for Ethereum's transition to proof-of-stake was revealed.&nbsp;","While it's hard to imagine what might happen next in crypto, here are the three biggest stories we expect to set tongues wagging next week.&nbsp;","Last week began with the US Treasury making its first ever move against open source code by sanctioning wallets associated with Tornado Cash, a crypto mixer that makes it possible to conceal the origin and destination of cryptocurrency transfers.&nbsp;","While the initial move was widely criticized in crypto circles, by Friday this had amplified with the announcement that the Dutch Fiscal Information and Investigation Service had arrested a Tornado Cash engineer — later <a href=\"https:\/\/www.theblock.co\/post\/163297\/arrested-tornado-cash-developer-is-alexey-pertsev-his-wife-confirms\" data-v-f87c67ca=\"\">revealed<\/a> to be Alexey Pertsev.&nbsp;","Next week could see more legal action. The Dutch authorities have not ruled out further arrests and Pertsev's wife is currently working with lawyers, she told The Block. A decentralized autonomous organization (DAO) associated with the sanctioned crypto mixer was also discussing ways in which it&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/163220\/tornado-cash-community-discussing-legal-avenues-to-challenge-us-sanctions\" data-v-f87c67ca=\"\">might challenge<\/a> the US sanction in the wake of the arrests before its <a href=\"https:\/\/www.theblock.co\/post\/163228\/tornado-cashs-discord-server-and-governance-forum-shuttered-amid-arrest?utm_source=cryptopanic&amp;utm_medium=rss\" data-v-f87c67ca=\"\">governance forum was taken down<\/a>. It is unclear whether a legal fund that it discussed will come to fruition.&nbsp;","Monday also saw Hodlnaut become the latest crypto lender to <a href=\"https:\/\/www.theblock.co\/post\/162035\/crypto-lending-platform-hodlnaut-halts-withdrawals-and-is-working-on-a-recovery-plan\" data-v-f87c67ca=\"\">halt withdrawals<\/a>, following Celsius and BlockFi.&nbsp;","The firm cited recent market conditions for the move and said that it needs to \"focus on stabilizing our liquidity and preserving assets\". It also said that it withdrew its application for a license with the Monetary Authority of Singapore (MAS).&nbsp;","Other embattled crypto lenders such as Celsius have <a href=\"https:\/\/www.theblock.co\/post\/157483\/crypto-lender-celsius-to-declare-chapter-11-bankruptcy-cnbc\" data-v-f87c67ca=\"\">filed for Chapter 11 bankruptcy,<\/a> while BlockFi <a href=\"https:\/\/www.theblock.co\/post\/155516\/blockfi-strikes-680-million-credit-deal-with-ftx-us-outlines-acquisition-path\" data-v-f87c67ca=\"\">struck a credit dea<\/a>l with FTX.US in July, outlining a path to acquisition.&nbsp;","While it is not yet known what might be the next step for the crypto lender, the situation should become clearer on August 19, when we may get a previously-promised <a href=\"https:\/\/twitter.com\/hodlnautdotcom\/status\/1556583257159790592?s=20&amp;t=hKVNv2g-zzYXn3ccDgBkyA\" data-v-f87c67ca=\"\">update<\/a> on the situation.&nbsp;&nbsp;","On Thursday, Ethereum core developers<a href=\"https:\/\/www.theblock.co\/post\/162988\/ethereum-foundation-suggests-tentative-dates-for-the-merge\" data-v-f87c67ca=\"\"> earmarked tentative dates<\/a> for the merge, a process that will see the blockchain transition from proof-of-work to proof-of-stake. This follows Wednesday's news that Ethereum has passed the final test for proof-of-stake merge on Goerli, paving the way for the merge proper.&nbsp;","While currently expected to occur in mid-September — on the 15th or 16th — it's possible that the dates could be tweaked due to block times and hash rate fluctuations. It's likely that this will become clearer in the coming days and weeks.&nbsp;","The switch faces opposition from some members of the Ethereum community. There are reports of a miner-led hard fork of the blockchain to maintain the PoW status quo. Those at the heart of this movement said on Friday that an <a href=\"https:\/\/www.theblock.co\/post\/163229\/ethpow-team-says-its-miner-led-ethereum-fork-is-inevitable\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">ETHPoW chain was inevitable<\/a> and that the fork may happen at the same time as the merge.&nbsp;","The week ahead may also see more exchanges clarify how the merge might affect derivatives tied to ether. On Tuesday, crypto spot and derivatives exchange FTX <a href=\"https:\/\/www.theblock.co\/post\/162333\/ftx-says-ethereum-merge-shouldnt-affect-ether-derivatives-trading\" data-v-f87c67ca=\"\">notified users<\/a> that derivatives markets tied to ether (ETH) will remain unaffected prior to the merge.&nbsp;"],"hashtag":["CRYPTO","LENDING"]}