{"summary":"Representatives overseeing the liquidation of Three Arrows Capital want a U.S. court to subpoena the founders.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/177798\/three-arrows-capital-liquidators-seek-subpoenas-amid-reported-regulatory-scrutiny","publishDate":"2022-10-17T17:13:10","id":5662,"type":null,"title":"Three Arrows Capital liquidators seek subpoenas amid reported regulatory scrutiny","category":["LEGAL"],"content":["The firm overseeing the liquidation of collapsed hedge fund Three Arrows Capital wants a U.S. court to grant a subpoena for the firm's missing founders through their Twitter and email accounts due to founders' alleged failure to cooperate with requests for information.&nbsp;","U.S. bankruptcy proceedings in parallel with foreign bankruptcy proceedings in Singapore and the British Virgin Islands have led to a liquidation of 3AC handled by financial advisory firm Teneo – a process complicated by the unknown location of firm's founders Su Zhu and Kyle Davies and their alleged reluctance to engage in court processes.","New court documents filed on Friday in the Southern District of New York show that representatives for Teneo want to compel the founders and others involved with 3AC to produce records and testify in order to get a fuller picture of the fund's assets. Until now, Teneo representatives contend that Zhu, Davies and other investment managers have provided only \"selective and piecemeal disclosures\" through their lawyers.","\"The Founders, through counsel, implausibly insist that the meager information provided to the Foreign Representatives [Teneo], which amounts to an incomplete list of assets and selective disclosures regarding the means to access certain digital assets electronically, represents all of the documents in their possession relating to the Debtor,\" said the filing.","The subpoenas would compel 3AC to produce documents \"to identify the existence of, location of, and method of accessing and controlling the assets\" of the fund, including account information, seed phrases and keys, among other information.","Teneo representatives previously requested that the Singapore law firm representing the founders accept service of papers. The firm, Advocatus Law, resisted.&nbsp;","\"The Founders’ recent use of their Twitter accounts and the Founders’ use of those accounts for purposes related to the Debtor makes those Twitter accounts a reasonable means to provide the Founders notice of discovery in this action,\" the motion filed Friday reads.&nbsp;","Teneo representatives also say in the filing that they plan to seek an order in the British Virgin Islands to serve Zhu and Davies and require them to attend an examination.&nbsp;","Meanwhile, U.S. regulators are said to be taking a closer look at 3AC, according to <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-10-17\/us-investigating-bankrupt-crypto-hedge-fund-three-arrows-capital\" data-v-f87c67ca=\"\">a new report from Bloomberg<\/a>. The Commodity Futures Trading Commission (CFTC) and Securities and Exchange Commission (SEC) are investigating whether 3AC misled investors on the financial health of its balance sheet and failed to register with proper authorities, according to people familiar with the matter.&nbsp;","The scrutiny comes amid a high-profile liquidation of the hedge fund, which previously boasted billions under management before incurring significant losses due to its heavy positions in the algorithmic stablecoin TerraUSD, which crashed earlier this year. Since then, it's entered into<a href=\"https:\/\/www.theblock.co\/post\/155578\/three-arrows-capital-files-for-chapter-15-bankruptcy-in-new-york\" data-v-f87c67ca=\"\"> Chapter 15 bankruptcy proceedings<\/a> in the Southern District of New York, a status that enables the protection of its U.S.-based assets as it winds through foreign bankruptcy proceedings in the British Virgin Islands.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Advocatus Law","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Kyle Davies","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"Su Zhu","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Twitter","content":"DATE"},{"type":"Founders","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Teneo","content":"ORGANIZATION"},{"type":"Southern District of New York","content":"LOCATION"},{"type":"British Virgin Islands","content":"LOCATION"},{"type":"Davies","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"The Founders","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"}],"hashtag":["THREE ARROWS CAPITAL"],"authors":["Aislinn Keely","The Block"]}