{"summary":"Kraken is gradually rolling out support for EUR and GBP deposits via PayPal for users in the UK and Europe, according to a source.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/249654\/kraken-paypal-uk-europe","publishDate":"2023-09-07T06:32:51","id":5666,"type":null,"title":"Kraken gradually rolling out PayPal deposits in UK and Europe","category":["EXCHANGES"],"content":["Crypto exchange Kraken is gradually rolling out support for euro and British pound deposits via PayPal for users in the United Kingdom and Europe, according to a source familiar with the new feature.","A recent email sent to Kraken users in the UK seen by The Block confirmed that PayPal can now be used to fund user accounts. \"You can use either your PayPal balance, bank account or payment cards connected with your PayPal account to transfer up to £1,000 ($1,250) every day,\" the email stated.","However, the PayPal funding method is currently only available on the Kraken mobile app, following an update two days ago. PayPal deposits are \"available in seconds,\" incurring a 2.4% fee, according to the UK version of the app, adding to existing Plaid and wire transfer options.","Kraken users funding their accounts via PayPal need to be verified at its Intermediate or Pro level, ensuring the name on the PayPal account aligns with the name on their Kraken account, and reside in the United Kingdom or Europe — excluding Hungary and Croatia — according to a <a href=\"https:\/\/support.kraken.com\/hc\/en-us\/articles\/fund-your-kraken-account-with-paypal\" data-v-f87c67ca=\"\">support page<\/a> for the new feature.","Depositing funds is a straightforward process. Users select the desired currency — EUR or GBP — from the deposit screen and connect their PayPal account. Once linked, users can choose PayPal as their deposit method, enter the desired amount and swipe to deposit. The funds reflect almost instantly and are available to withdraw after seven days, with fees varying depending on the region.","\"The seven-day hold on withdrawals will apply to any assets in cash or cryptocurrency, equal to the deposited amount. The withdrawal hold does not apply to trading,\" the support page adds.","The main Kraken platform is also getting a makeover, with a new interface replacing the legacy \"Kraken Classic\" trading platform, according to the site login page. Kraken additionally offers an advanced trading platform, Kraken Pro and an NFT marketplace.","Last month, <a href=\"https:\/\/blog.kraken.com\/news\/trading-for-paypal-usd-pyusd-starts-august-21-deposit-now#:~:text=We're%20thrilled%20to%20announce,on%20Kraken%20on%20August%2021.\" data-v-f87c67ca=\"\">Kraken also added support for PayPal's new stablecoin<\/a>, PayPal USD (PYUSD), on its platform — joining rival exchanges Coinbase, Huobi and Crypto.com in listing the dollar-pegged asset.","<a href=\"https:\/\/www.theblock.co\/post\/243569\/paypal-launches-stablecoin\" data-v-f87c67ca=\"\">PayPal's stablecoin launched on Ethereum<\/a> on Aug. 7 in partnership with Paxos and will be gradually made available to PayPal customers in the U.S. The <a href=\"https:\/\/etherscan.io\/token\/0x6c3ea9036406852006290770bedfcaba0e23a0e8\" data-v-f87c67ca=\"\">current total supply of PYUSD stands at 43 million tokens<\/a>.&nbsp;","Earlier this week, web3 wallet <a href=\"https:\/\/www.theblock.co\/post\/249265\/metamask-adds-cash-out-function-allowing-users-to-sell-crypto-for-fiat\" data-v-f87c67ca=\"\">MetaMask launched a \"cash out\" feature<\/a>, enabling users to convert crypto for fiat and send it to their PayPal account, adding to its existing onramp feature via PayPal.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Croatia","content":"LOCATION"},{"type":"PayPal USD","content":"ORGANIZATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"2.4%","content":"PERCENT"},{"type":"Hungary","content":"LOCATION"},{"type":"Aug. 7","content":"DATE"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$1,250","content":"MONEY"},{"type":"U.S","content":"LOCATION"},{"type":"euro","content":"ORGANIZATION"},{"type":"Huobi","content":"PERSON"},{"type":"United Kingdom","content":"LOCATION"}],"hashtag":["KRAKEN"],"authors":["James Hunt","The Block"]}