{"summary":"The Layer 1 network Solana restarted after around four hours of halted block progression.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276237\/solana-network-restarts-after-outage-that-lasted-five-hours","publishDate":"2024-02-06T10:31:51","id":5667,"type":null,"title":"Solana network restarts after outage that lasted five hours","category":["LAYER 1S"],"content":["The Layer 1 network Solana has restarted after going dark around five hours earlier.&nbsp;","\"Block production on Solana mainnet beta resumed at 14:57 UTC (9:47  a.m. ET), following a successful upgrade to v1.17.20 and a restart of the cluster by validator operators. Engineers will continue to monitor performance as network operations are restored,\" the network wrote in an incident <a href=\"https:\/\/status.solana.com\/incidents\/n5kcgs8dl9pj\" data-v-f87c67ca=\"\">report<\/a>.","\"The outage began at approximately 09:53 UTC, lasting 5 hours. Core contributors are working on a root cause report, which will be made available once complete,\" the report continued.&nbsp;","At 10:22 UTC (5:22 a.m. ET), Solana wrote in a network status <a href=\"https:\/\/status.solana.com\/\" data-v-f87c67ca=\"\">notice<\/a> that \"engineers from across the ecosystem are investigating an outage on mainnet-beta.\"&nbsp;","The disruption caused block progression to halt, meaning transactions couldn't go through, The Block previously <a href=\"https:\/\/www.theblock.co\/post\/276174\/solana-major-outage-mainnet-beta\" data-v-f87c67ca=\"\">reported<\/a>.&nbsp;","After around two hours of attempting to fix the matter, Solana Status, a page run by the Solana Foundation, <a href=\"https:\/\/twitter.com\/SolanaStatus\/status\/1754813351945789491\" data-v-f87c67ca=\"\">said<\/a> on the social media platform X that \"engineers from across the ecosystem are readying a new validator software release, which includes a patch to address an issue which caused the cluster to halt. Validator operators should prepare for an upgrade and restart of the network.\"","The last time Solana experienced a \"Major Outage\" was in <a href=\"https:\/\/www.theblock.co\/post\/215235\/solana-network-back-online-following-second-restart\" data-v-f87c67ca=\"\">February 2023<\/a>, when the blockchain was down for a few hours. After two restart attempts, the network came back online.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Solana Foundation","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"5:22 a.m.","content":"TIME"},{"type":"Solana Status","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"February 2023","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"9:47  a.m.","content":"TIME"}],"hashtag":["SOLANA"],"authors":["MK Manoylov","The Block"]}