{"summary":"Hardware manufacturer Canaan is launching the Avalon Made A13 series with two new models with increase efficiency and computing power.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179390\/bitcoin-hardware-manufacturer-canaan-introduces-new-a13-series","publishDate":"2022-10-24T11:36:18","id":5668,"type":null,"title":"Bitcoin hardware manufacturer Canaan introduces new A13 series","category":["COMPANIES"],"content":["Bitcoin mining hardware manufacturer Canaan is introducing two ASIC models with its new Avalon A13 series.","The A1366 will have a hash rate of 130 TH\/s and an efficiency of 25 J\/TH, beating its predecessors in computing power and power efficiency, the company said. It's unclear when they will start shipping.","\"We are now working around the clock across the supply chain to prepare for future purchase orders and deliveries of the new products to our clients worldwide,\" Nangeng Zhang, chairman and CEO of Canaan said in a <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1780652\/000110465922110763\/tm2228786d1_ex99-1.htm\" data-v-f87c67ca=\"\">filing<\/a> with the U.S. Securities and Exchange Commission.","The new series and the A1366 in particular are \"extremely competitive\" when compared to Bitmain’s flagship S19 XP and MicroBT’s M50S on an efficiency basis, said Ethan Vera, COO of bitcoin infrastructure company Luxor Technologies.","The second model, the A1346, has slightly lower specs at 110 TH\/s hash rate and 30 J\/TH efficiency.","\"We expect the A13 series to get a lot of interest due to the top-tier efficiency, if the price is in line with competitors,\" Vera said. \"Miners are flocking to the latest-generation machines as hashprice has been plummeting, creating a dynamic where the most-efficient miners have higher resistance to hashprice.\"","Hashprice is a term coined by the company, referring to revenue miners earn from a unit of hash rate over a specific timeframe.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoin-hashprice-index\/embed\" title=\"Bitcoin Hashprice Index\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Bitcoin miners have seen their profit margins squeezed over the past few months as they deal with the sharp decline in the value of bitcoin at the same time as power costs and mining difficulty rise. On Sunday, the difficult metric <a href=\"https:\/\/www.theblock.co\/post\/179299\/bitcoin-mining-difficult-rises-by-more-than-3\" data-v-f87c67ca=\"\">jumped by 3.4%<\/a> after <a href=\"https:\/\/www.theblock.co\/post\/175900\/bitcoin-mining-difficulty-jumps-to-all-time-high-levels\" data-v-f87c67ca=\"\">climbing 13.55%<\/a> two weeks ago.","\"While the current challenges in the industry persist, the fundamental values and the long-term growth prospects of bitcoin and the supercomputing industry remain strong,\" Zhang said.","Vera also pointed out that Canaan has in the past had \"mixed reviews\" from North American miners and, because of its <a href=\"https:\/\/www.theblock.co\/post\/67272\/chinas-chip-making-giant-smic-which-recently-partnered-with-bitcoin-miner-maker-canaan-files-for-2-8-billion-ipo\" data-v-f87c67ca=\"\">use of chips from SMIC<\/a>, which was <a href=\"https:\/\/www.reuters.com\/article\/us-usa-china-sanctions-idUSKBN28S0HL\" data-v-f87c67ca=\"\">blacklisted by the US<\/a>, the company \"is seen as more likely to face supply chain disruptions.\" To be clear, Canaan hasn't announced whether the two new models are made with SMIC chips.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"Nangeng Zhang","content":"PERSON"},{"type":"Ethan Vera","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"3.4%","content":"PERCENT"},{"type":"Vera","content":"PERSON"},{"type":"Canaan","content":"LOCATION"},{"type":"Luxor Technologies","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Zhang","content":"PERSON"},{"type":"Canaan","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"13.55%","content":"PERCENT"},{"type":"SMIC","content":"ORGANIZATION"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}