{"summary":"Curve’s native token CRV experienced a sharp price decline due to a reentrancy attack, prompting founder Michael Egorov to take measures to stabilize his personal DeFi position.\nAmid the market turbulence, Egorov made notable transfers, including repaying a loan of 5.13 million FRAX stablecoins and reclaiming 12.5 million CRV tokens as collateral.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242425\/open-interest-in-crv-linked-futures-skyrockets-as-curve-token-reels-from-recent-attack","publishDate":"2023-08-01T05:22:42","id":567,"type":null,"title":"Open interest in CRV-linked futures skyrockets as Curve token reels from recent attack","category":["Crypto Ecosystems"],"content":["CRV,&nbsp;the native token of Curve, plummeted in price from 0.73 to $0.5 after a <a href=\"https:\/\/www.theblock.co\/post\/242066\/curve-finance-factory-pools-targeted-due-to-reentrancy-vulnerability\" data-v-f87c67ca=\"\">reentrancy attack<\/a> on the Curve platform. The protocol's founder is now fighting to relieve some of the pressure. &nbsp;","CRV's value hit the $0.5 mark earlier today, a low point since November of the prior year, before rebounding to 0.59. At the same time, open interest in CRV-linked perpetual futures grew to over <a href=\"https:\/\/coinalyze.net\/curve-dao-token\/open-interest\/\" data-v-f87c67ca=\"\">$124 million<\/a>, according to Coinalyze data. Data on&nbsp;<a href=\"https:\/\/coinalyze.net\/curve-dao-token\/funding-rate\/\" data-v-f87c67ca=\"\">negative funding rates<\/a>, also tracked by Coinalyze, suggests traders could be shorting CRV in anticipation of further price dips.","In response, Michael Egorov, the founder of Curve, tried to stabilize his personal DeFi position.","Amid sharp volatility, Egorov made several key transfers. He repaid a noteworthy 5.13 million FRAX stablecoin loan and reclaimed 12.5 million CRV tokens as collateral. Observers also highlighted on-chain data showing that Egorov moved 12.5 million CRV from Fraxlend to a fresh wallet. Before this action, Egorov had received Tether from anonymous wallets, fueling <a href=\"https:\/\/twitter.com\/etheraltog\/status\/1686262939236364288?s=20\" data-v-f87c67ca=\"\">speculation<\/a> from crypto commentators about potential OTC deals or transactions off the main platform.","In another significant move, a wallet tagged as belonging to Tron founder Justin Sun withdrew $2 million in Tether (USDT) from the Aave lending platform before redirecting them to Egorov, security firm PeckShield <a href=\"https:\/\/twitter.com\/PeckShieldAlert\/status\/1686292872583360512\" data-v-f87c67ca=\"\">noted<\/a>. In exchange, Egorov transferred about 5 million CRV (approximated at ~$2.9 million) to Sun, possibly indicating another off-platform arrangement.","The current dynamics have heightened concerns within the crypto community. Egorov has <a href=\"https:\/\/debank.com\/profile\/0x7a16ff8270133f063aab6c9977183d9e72835428\" data-v-f87c67ca=\"\">deposited<\/a> a sizable $175 million CRV on Aave and borrowed some $59 million and a health factor of 1.62, according to DeBank records. If CRV’s price were to decrease by just 38%, it could instigate a massive liquidation event, reverberating throughout the wider DeFi landscape."],"hashtag":[]}