{"summary":"Coinbase&#x27;s stock hit an all-time low Friday, a development that came as the beta version of the company&#x27;s long-awaited NFT marketplace has finally been released in beta.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/143154\/coinbase-stock-slides-to-all-time-low-amid-nft-marketplace-beta-rollout","publishDate":"2022-04-23T09:18:41","id":5674,"type":null,"title":"Coinbase stock slides to all-time low amid NFT marketplace beta rollout","category":["EXCHANGES"],"content":["<span data-v-f87c67ca=\"\">Two days after the beta launch of its <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/142684\/coinbase-nft-marketplace-beta-launch\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">new NFT marketplace<\/span><\/a><span data-v-f87c67ca=\"\">, Coinbase’s stock fell to an all-time low during Friday's trading session.<\/span>","<span data-v-f87c67ca=\"\">The company announced plans to enter the NFT space back in October of last year and over 1.5 million people signed up for the waitlist. The beta launch kicked off on April 20.<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, Coinbase’s stock has been consecutively dipping lower since the beginning of the month, according to <\/span><a href=\"https:\/\/finance.yahoo.com\/quote\/COIN\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">data from Yahoo! Finance<\/span><\/a><span data-v-f87c67ca=\"\">, and the beta launch this week did not change that trajectory. On Friday, $COIN touched a low of $131.25 and later closed at $131.52.<\/span>","<span data-v-f87c67ca=\"\">While everyone can <\/span><a href=\"https:\/\/nft.coinbase.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">access the website<\/span><\/a><span data-v-f87c67ca=\"\"> at this point, with the beta launch only a few select clients can buy and sell Ethereum-based NFTs with payments in ETH. The company plans to integrate other blockchains in the future, as well as add some unique features that would allow users to engage more.<\/span>","<span data-v-f87c67ca=\"\">John Todaro, a senior research analyst at Needham &amp; Company, said the real question is whether or not the NFT marketplace will succeed. Everyone has known for months that it was coming.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Investors are now looking for ‘can you really scale it, can it do volume, can it really compete with Open Sea?” he told the Block. “Is this really going to add to revenue versus is this just going to launch and maybe fizzle out.”<\/span>","<span data-v-f87c67ca=\"\">Coinbase is facing competition not only from OpenSea and LooksRare, which dominate the market but also from major crypto exchanges FTX.US and Binance, which have also launched NFT marketplaces last year.<\/span>","<span data-v-f87c67ca=\"\">Todaro said Needham &amp; Company put out a note stating that, once it got to scale, Coinbase’s NFT marketplace could very incrementally add to revenue.<\/span>","<span data-v-f87c67ca=\"\">“We remain bullish on the stock, we think it’s fundamentally very attractive,” he said. “If they can get it to scale I think it's really gonna add to the stock.”<\/span>","<span data-v-f87c67ca=\"\">In a <a href=\"https:\/\/jmp.bluematrix.com\/sellside\/EmailDocViewer?encrypt=1fcc969b-3556-427f-a873-485ef6bbf8ea&amp;mime=pdf&amp;co=jmp&amp;id=Frank@TheBlockCrypto.com&amp;source=mail\" data-v-f87c67ca=\"\">report published in February<\/a>, JMP Group indicated similarly that Coinbase might benefit from the NFT marketplace in the long run.<\/span>","<span data-v-f87c67ca=\"\">“The company is investing in a number of areas that may not have as much of an immediate impact, but should contribute materially to longer-term revenues, including its forthcoming NFT platform,” the report said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Jeff Dorman, co-founder and chief investment officer of crypto asset management firm Arca, also said that it’s still too early for Coinbase’s NFT marketplace to prove its worth to investors.<\/span>","<span data-v-f87c67ca=\"\">“Since NFTs as a whole are still not widely loved or accepted by TradFi, we believe you'll need to see real traction for numerous quarters before any equity analysts give Coinbase credit for it,” he told The Block over email.<\/span>","<span data-v-f87c67ca=\"\">According to Dorman, Coinbase’s “lower than expected multiple” is in part due to the expectation that their trading fees will keep going down. The decline in retail has added extra pressure, he argued.<\/span>","<span data-v-f87c67ca=\"\">“Until Coinbase's subscription and services business lines make up a larger portion of their revenues, Coinbase will continue to suffer in low volume\/low retail environments,” Dorman said.<\/span>","<span data-v-f87c67ca=\"\">Todaro said that Coinbase’s stock performance in the past few months has also reflected broader market trends. He pointed out that interests rates have impacted tech stocks in general and that, more specifically, retail crypto and trading volumes have been down.<\/span>","<span data-v-f87c67ca=\"\">“So investors are also trying to understand ‘are we in a new environment here where retail crypto trading activity is much lower than it was for 2021,” he said.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$131.25","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$131.52","content":"MONEY"},{"type":"February","content":"DATE"},{"type":"Dorman","content":"PERSON"},{"type":"$COIN","content":"MONEY"},{"type":"Jeff Dorman","content":"PERSON"},{"type":"October of last year","content":"DATE"},{"type":"April 20","content":"DATE"},{"type":"Yahoo! Finance","content":"ORGANIZATION"},{"type":"John Todaro","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"OpenSea","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Needham &amp; Company","content":"ORGANIZATION"},{"type":"Until Coinbase","content":"ORGANIZATION"},{"type":"Coinbase’s NFT","content":"ORGANIZATION"},{"type":"Todaro","content":"PERSON"},{"type":"JMP Group","content":"ORGANIZATION"}],"hashtag":["COINBASE"],"authors":["Catarina Moura","The Block"]}