{"summary":"Howard’s consideration for the head chef of SushiSwap will have to be approved through a community vote. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/159818\/sushiswap-team-nominate-a-new-potential-head-chef","publishDate":"2022-07-27T09:00:18","id":5676,"type":null,"title":"SushiSwap team nominate a new potential &#x27;Head Chef&#x27;","category":["DEFI"],"content":["<span data-v-f87c67ca=\"\">SushiSwap, the popular decentralized exchange, has <a href=\"https:\/\/forum.sushi.com\/t\/election-of-jonathan-howard-as-head-chef\/10874\/14\" data-v-f87c67ca=\"\">proposed<\/a> that the community should hire<\/span><span data-v-f87c67ca=\"\"> Jonathan Howard as Head Chef, an official title given to the project’s chief executive officer. According to DeFiLlama, SushiSwap is the seventh largest decentralized exchange, holding over <a href=\"https:\/\/defillama.com\/protocols\/Dexes\" data-v-f87c67ca=\"\">$660 million<\/a> in locked deposits.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">The nomination was announced in a governance post written by Sushi contributor JiroOno on Tuesday. <\/span>“We’ve sourced the candidate we believe represents the best option for Sushi and are now looking to present this candidate to the Sushi community,” the proposal stated.","Currently there is a heat check poll, which has 40 votes so far and is currently 65% in favor of the hire. If the poll remains positive and a forum call goes well, then there will be a snapshot vote for SUSHI holders to decide whether to hire Howard.","If brought on, Howard would be looking after day to day management of operations and leading efforts on delivering both pending and new products at Sushi.&nbsp;","<span data-v-f87c67ca=\"\">According to his <a href=\"https:\/\/www.linkedin.com\/in\/staringispolite\/\" data-v-f87c67ca=\"\">Linkedin bio<\/a>, Howard is currently the co-founder and chief technology officer at an NFT-focused firm called BigHeadClub and previously founded tech startups. In a Twitter post, Howard wrote he was “excited and beyond honored that the SushiSwap team is nominating me as Head Chef.”<\/span>","The search to find the next Sushi Head Chef has been going on since the <a href=\"https:\/\/www.theblock.co\/linked\/117960\/project-lead-behind-2-8-billion-dex-sushiswap-is-set-to-step-down\" data-v-f87c67ca=\"\">departure<\/a> of former Sushi head Maki in September 2021.&nbsp;","<span data-v-f87c67ca=\"\">The governance post that announced Howard's nomination has largely positive feedback from community members, matching the heat check poll.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Many are enthused with Sushi’s prospects if Howard came onboard. In the governance discussion, Matthew Lilley, a core Sushi developer who goes by the pseudonym ImSoftware <a href=\"https:\/\/forum.sushi.com\/t\/election-of-jonathan-howard-as-head-chef\/10874\/8\" data-v-f87c67ca=\"\">wrote<\/a>: “<\/span><span data-v-f87c67ca=\"\">Have spoken to Jon a handful of times and have been impressed. I think having a head chef with a background in technology &amp; art is perfect for where we’re at now and where we’re going.”<\/span>","<span data-v-f87c67ca=\"\">While the majority comments have been in favor of Howard’s nomination, there were many who still disapproved of Howard being chosen as the new Head Chef. These members expressed Howard's lack of DeFi experience as one of the main issues.<\/span>","<span data-v-f87c67ca=\"\">Pegbit, Sushi core contributor, who was part of the team who interviewed Howard, said, in a <a href=\"https:\/\/forum.sushi.com\/t\/election-of-jonathan-howard-as-head-chef\/10874\/14?u=tanmat\" data-v-f87c67ca=\"\">detailed response<\/a>, <\/span><span data-v-f87c67ca=\"\">“During the interview with Jon, he struck me as someone nice with skills. Still, I did not see him as a head chef at that moment because he had no relevant experience in DeFi and didn’t bring up anything extraordinary on the roadmap he presented.”<\/span>","<span data-v-f87c67ca=\"\">Other members disapproved of the proposed salary of the Head Chef being too high for Sushi’s treasury to afford. <\/span><span data-v-f87c67ca=\"\">As per the details provided in the governance post, if hired, Howard would earn a base annual salary of $800,000 in the USDC stablecoin. SushiSwap's treasury is worth $19.4 million, per DeepDAO.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">In terms of token incentives, the Head Chef gets 600,000 SUSHI tokens vested for four years with a six month cliff. Currently, each SUSHI token is worth $1.29.<\/span>","<span data-v-f87c67ca=\"\">The Head Chef will also receive a one-time bonus of 350,000 SUSHI tokens. Beyond this, 1.2 million SUSHI incentives will be paid to the Head Chef when the SUSHI token hits certain price targets between $3-$11. <\/span>","<span data-v-f87c67ca=\"\">Furthermore, if the community decided to terminate Howard due to some reason, he will be entitled to a 24 month-long severance package equal to the base salary plus the above token incentives. Depending on the SUSHI price, the incentive and severance package could be worth millions of dollars each year.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$11","content":"MONEY"},{"type":"September 2021","content":"DATE"},{"type":"Linkedin bio","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$3","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"$660 million","content":"MONEY"},{"type":"Howard","content":"ORGANIZATION"},{"type":"SushiSwap","content":"ORGANIZATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"Sushi","content":"LOCATION"},{"type":"Jonathan Howard","content":"PERSON"},{"type":"$1.29","content":"MONEY"},{"type":"Matthew Lilley","content":"PERSON"},{"type":"DeFiLlama","content":"ORGANIZATION"},{"type":"BigHeadClub","content":"ORGANIZATION"},{"type":"Howard","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"65%","content":"PERCENT"},{"type":"Jon","content":"PERSON"},{"type":"$19.4 million","content":"MONEY"},{"type":"$800,000","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Maki","content":"ORGANIZATION"},{"type":"Sushi","content":"ORGANIZATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}