{"summary":"A newly proposed standard aims to enhance Ethereum smart contract security by allowing anyone to verify audit information on-chain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/251666\/ethereum-standard-security-audits","publishDate":"2023-09-19T08:00:04","id":5677,"type":null,"title":"Proposed Ethereum standard aims to verify security audits on-chain","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">A newly proposed standard, <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.98%\n    <\/span><\/a> <!----><\/span><\/span> Request for Comments (ERC)-7512, aims to enhance the security of Ethereum decentralized applications by allowing anyone to utilize and verify smart contract audit information on-chain as opposed to doing it off-chain.<\/span>","This <a href=\"https:\/\/twitter.com\/blockomotive\/status\/1702720109184221575\" data-v-f87c67ca=\"\">proposal<\/a> has been introduced by a group of Ethereum developers from projects including Safe, Ackee Blockchain, OtterSec, ChainSecurity, OpenZeppelin, and Hats Finance.","The objective of ERC-7512 is to ensure that audit details, such as who conducted the audits and their findings, can be parsed by contracts to verify their authenticity. As of now, audits are manually presented by teams with no representation of their authenticity on-chain.","The need for this standard arises from the losses associated with issues found in smart contracts. Specifically, in the first half of 2023, more than <a href=\"https:\/\/de.fi\/blog\/de-fi-rekt-report-over-204m-lost-in-q2-2023\" data-v-f87c67ca=\"\">$650 million<\/a> has been lost to DeFi-related scams and hacks.","Smart contracts, which are integral to dapps, can often be vulnerable to attacks. While audits are essential for ensuring their integrity, achieving absolute security remains challenging and more robust on-chain visibility of audits needs to introduced, experts say.","“While permissionless innovation allows anyone to build anything, for actual use cases to emerge, we need to create a layer that will enable us to verify the security of contracts that interact. This visibility is currently missing,” said Richard Meissner, co-founder of Safe and one of the authors of ERC-7512.","The proposed ERC-7512 could potentially bridge this security verification gap, allowing developers to enable more thorough audit checks and create reputation systems around audits. This standard, if implemented, can also make it easier for users and dapps to verify rigorous audits by trusted auditors and establish an on-chain reputation system for dapps.","“The first step is to make crucial audit information available to contracts verifiably. This is the goal of ERC-7512, a standard drafted by some of the industry’s best auditors and security minds. ERC-7512 is not just a one-time initiative but a catalyst for further innovation in smart contract security,” Meissner added.","It is yet to be determined whether the core Ethereum developers will accept and implement ERC-7512 as a standard.","Additionally, there have been previous proposals to boost dapp security on Ethereum. For instance, in July, there was a <a href=\"https:\/\/www.theblock.co\/post\/237671\/ethereum-erc-7265-circuit-breaker-defi-hacks\" data-v-f87c67ca=\"\">proposal<\/a> titled ERC-7265, a “circuit breaker,” that suggested protocols should insert a protective measure in their smart contracts to halt token transfers in case there is a hack. That proposal remains under development.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Richard Meissner","content":"PERSON"},{"type":"7512","content":"DATE"},{"type":"Meissner","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"the first half of 2023","content":"DATE"},{"type":"-0.98%","content":"PERCENT"},{"type":"$650 million","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"7265","content":"DATE"},{"type":"Hats Finance","content":"ORGANIZATION"}],"hashtag":["DECENTRALIZED INFRASTRUCTURE","DEVELOPER TOOLS","EXPLOITS","HACKS","SECURITY FIRMS"],"authors":["Vishal Chawla","The Block"]}