{"summary":"Ellison has already pleaded guilty to corruption. Now, with the help of the prosecution, she&#x27;s arguing that Bankman-Fried corrupted her.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/256061\/inside-sbfs-trial-the-corruption-of-caroline-ellison","publishDate":"2023-10-11T22:07:01","id":568,"type":null,"title":"Inside SBF’s Trial: The corruption of Caroline Ellison","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Before Caroline Ellison, in her role as Alameda Research CEO, repaid billions of dollars in loans Alameda had taken out from third-party lenders, she checked with the firm’s owner, Sam Bankman-Fried. She checked with Bankman-Fried before speaking to employees. She checked with Bankman-Fried before tweeting. She checked with Bankman-Fried before sending Alameda’s balance sheet to investors&nbsp;— and asked which of her seven drafts he liked best.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Now, all Bankman-Fried can do is watch as his ex-coworker —&nbsp;and ex-girlfriend — testifies against him at his trial on seven counts of fraud. Ellison, who pleaded guilty to seven counts of her own last December, is cooperating with the government, helping to put Bankman-Fried away in the hope of receiving a shorter sentence.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Over the course of their direct examination, which concluded on Wednesday, government prosecutors led Ellison through questions with the apparent goal of establishing two main points: that Ellison’s Alameda frequently borrowed funds from FTX customers, and that it did so with Bankman-Fried’s implicit approval — or at his explicit direction, such as when Alameda borrowed billions of customer funds using its line of credit on FTX in order to repay its lenders in May 2022.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I thought it was wrong,” Ellison testified. So why did she authorize the payments anyway? “Because Sam told me to.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On the stand, Ellison readily admitted to her own corruption, describing how she sent misleading balance sheets to investors, lied to employees and to the public about Alameda’s unsavory behavior, and rubber-stamped more and more borrowing, even as she knew it undermined Alameda’s financial stability.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A major turning point for Ellison came in the spring of 2022, following the crypto market downturn spurred by the collapse of Terra (and perhaps, for the superstitious, Ellison’s declaration <\/span><a href=\"https:\/\/www.theblock.co\/post\/255798\/inside-the-trial-caroline-ellison-dishes-on-sbfs-unyielding-hunger-for-capital\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">hours earlier<\/span><\/a><span data-v-f87c67ca=\"\">, “I think things are going better”). As crypto prices crashed, Alameda’s lenders asked for billions of dollars back — Alameda’s loans were mostly open-term, meaning they could be called at any time.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Yet Alameda didn’t have the cash on hand, according to an analysis Ellison said she shared with Bankman-Fried. After reviewing the document, however, Bankman-Fried continued to direct Ellison to repay the loans, she testified. How? “I understood that he was telling me to use FTX customer funds to repay our loans,” she said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Though Bankman-Fried made the decision, Ellison testified that she directed Alameda’s settlements team to handle the payments. What followed, Ellison testified, was “a constant state of dread” as she worried about the risk Alameda’s borrowing posed to FTX’s customers.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">To make matters worse, Genesis, one of Alameda’s lenders, requested a balance sheet from Ellison on June 18, 2022. Ellison and Bankman-Fried agreed that a balance sheet that clearly disclosed Alameda’s borrowing — Ellison estimated it at $10 billion owed to FTX and $5 billion in loans to executives — looked too bad to send.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Ellison came up with seven alternative ways to display the data; the one Bankman-Fried chose, Ellison testified, simply canceled out those two values — despite the illiquid nature of the loans, which were mostly used to fund venture investments. Ellison concealed the remaining balance, around $5 billion in borrowed customer deposits, in the long-term loan category of the balance sheet. (As the bank run on FTX would later show, customer deposits did not actually resemble long-term loans.)&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Ellison said that she knew sending the misleading balance sheet to Genesis was wrong. “I did consider it to be dishonest,” she testified.&nbsp;<\/span><span data-v-f87c67ca=\"\">Bankman-Fried could only watch from his chair as Assistant U.S. Attorney Danielle Sassoon read one of his Tweets from the same period: “Backstopping customer funds should always be primary. Everything else is secondary.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Despite her hopes that the crypto market would recover or that Bankman-Fried would be able to secure additional financing from FTX, perhaps from Saudi Crown Prince Mohammed bin Salman who Ellison said Bankman-Fried was courting, the scenario Ellison had feared for months would soon arrive.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Yet Ellison, appearing to choke up while testifying for the only time, described feeling mixed emotions as Alameda and FTX collapsed around her. “I felt a sense of relief that I didn't have to lie anymore, that I could start taking responsibility and being honest about what I had done, even though I obviously felt indescribably bad about all of the people that were harmed and the people that lost their money, the employees that lost their jobs, people that trusted us that we had betrayed,” Ellison testified.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried believed in “a very proactive approach” to PR, Ellison testified. He had a particular attachment to his hair. \"He said ever since Jane Street, he thought he had gotten higher bonuses because of his hair and that it was an important part of FTX's narrative and image,” Ellison testified.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">After first moving to the Bahamas, the two of them were assigned luxury cars, Ellison testified. Bankman-Fried suggested they switch: a Toyota Corolla for him, and a Honda Civic for her. When a Bloomberg reporter asked questions about FTX’s relationship with Alameda, she tried to match what she had heard him say in the past —&nbsp;after checking with Bankman-Fried whether she should give a comment at all.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Ellison was also asked about Bankman-Fried’s media investments, with specific questions regarding <\/span><a href=\"https:\/\/www.theblock.co\/post\/193753\/the-block-ceo-resigns-after-failure-to-disclose-loans-from-bankman-frieds-alameda\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">the investments he made in this publication<\/span><\/a><span data-v-f87c67ca=\"\">. Ellison testified that Bankman-Fried told her “...he thought [The Block] was the best crypto news organization, and I think he said that they were in some amount of financial trouble and he wanted to support them so they could continue their reporting.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Asked by Sassoon if Bankman-Fried said anything about the “effect he intended for his investments,” Ellison said, \"I don't recall anything beyond him saying that he wanted to support The Block.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Over the course of Ellison’s direct examination, the prosecution’s implicit argument became clear: Ellison wasn’t corrupt by chance; rather, she was <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">corrupted<\/span><\/i><span data-v-f87c67ca=\"\"> by Bankman-Fried. At every possible moment, guided by the prosecution’s deft questioning, Ellison emphasized how she acted at Bankman-Fried’s direction —&nbsp;especially when doing things she knew were wrong. Her performance on the stand helped sell the point to several members of the public who showed up to observe the trial.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“She was prepped really well. At every single point possible, she kept on saying ‘and we took customer funds.’ She kept on saying ‘I was directed by Sam,’” one observer told me as another nodded in agreement. “She’s very rehearsed, she knows her stuff.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried seemed to have a particularly strong reaction to Ellison’s testimony. At one point, Sassoon even called a sidebar meeting with the judge to complain about Bankman-Fried’s behavior.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I've noticed several times since the lunch break that in response to things the witness has said, the defendant has laughed, visibly shaken his head, and scoffed,” Sassoon said. “It's possible it's having a visible effect on her, especially given the history of this relationship, the prior attempts to intimidate her, the power dynamic, their romantic relationship, and I would ask that defense counsel tell him to control his visible reaction to her testimony.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Defense attorney Mark Cohen, after calling the complaint “ridiculous” and pointing out that Ellison had trouble even identifying Bankman-Fried in court yesterday, conceded that he’d talk to his client during the break about his behavior.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Block will be back in court tomorrow for Caroline Ellison’s cross-examination by the defense.&nbsp;<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ellison","content":"PERSON"},{"type":"billions of dollars","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$5 billion","content":"MONEY"},{"type":"June 18, 2022","content":"DATE"},{"type":"Jane Street","content":"PERSON"},{"type":"Honda","content":"ORGANIZATION"},{"type":"spring of 2022","content":"DATE"},{"type":"Danielle Sassoon","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Sam","content":"PERSON"},{"type":"Genesis","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Sassoon","content":"ORGANIZATION"},{"type":"May 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Toyota Corolla","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"$10 billion","content":"MONEY"},{"type":"Fried","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Alameda","content":"PERSON"},{"type":"Bahamas","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"Mark Cohen","content":"PERSON"}],"hashtag":["FTX","SAM BANKMAN-FRIED","SBF TRIAL"],"authors":["Zack Abrams","The Block"]}