{"summary":"The following is a lightly edited transcript of The Block CEO Mike Dudas&#x27; recent conversation with Peter McCormack, host of the very popular What Bitcoin","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/7240\/what-bitcoin-did-mike-dudas-from-the-block-on-crypto-journalism","publishDate":"2019-01-13T09:03:40","id":5685,"type":null,"title":"What Bitcoin Did: Mike Dudas from The Block on Crypto Journalism","category":["PEOPLE"],"content":["<em data-v-f87c67ca=\"\">The following is a lightly edited transcript of The Block CEO Mike Dudas' recent conversation with Peter McCormack, host of the very popular What Bitcoin Did podcast. You can find additional What Bitcoin Did interviews and subscribe to the podcast <a href=\"https:\/\/www.whatbitcoindid.com\/podcast\/mike-dudas-from-the-block-on-crypto-journalism\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">here<\/a>.<\/em>","<a href=\"https:\/\/www.whatbitcoindid.com\/podcast\/mike-dudas-from-the-block-on-crypto-journalism\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">What Bitcoin Did: Mike Dudas from The Block on Crypto Journalism<\/a>","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> Welcome to the <em data-v-f87c67ca=\"\">What Bitcoin Did<\/em> podcast. Hi there. How are you all? Are you all having a great week? Simply the best Bitcoin podcast in Bedford. I'm your hosts, Peter McCormack. Today I have an interview with Mike Dudas from <a href=\"https:\/\/www.theblockcrypto.com\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">The Block<\/em><\/a>.","Let's move on to my interview with Mike. Mike Dudas from <em data-v-f87c67ca=\"\">The Block<\/em>, who I also love because he is also a Liverpool fan. We've not only been talking about football, but we've been talking for quite a while now. Kind of got to know him. Been following what <em data-v-f87c67ca=\"\">The Block<\/em> do. Just a note before you listen to this. We actually recorded this before Christmas. But the way the schedule worked, this would have had to have come out on Christmas day, which I thought was a waste of time, so I've delayed it to this week. Do you know <em data-v-f87c67ca=\"\">The Block<\/em>? Have you checked them out? They have definitely changed the game with crypto journalism. From their hard hitting reporting to their in depth analysis. Their content has definitely been creating ripples across the whole crypto space. If you're on crypto Twitter you definitely can't miss it.","So many things stand out about them though. From the quality of the team which Mike has recruited, to the way they ensure that they have no conflicts of interest with what they do. I wanted to talk to Mike. I wanted to get him on. I wanted to discuss the background of <em data-v-f87c67ca=\"\">The Block<\/em>, but what their strategy is. At some point I'm going to get some of the other reporters from the team on. But right now you've got the main guy. You've got Mike. If you've got any questions about the show you know you can reach out to me. Make sure you also follow <a href=\"https:\/\/twitter.com\/theblock__?lang=en\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">The Block<\/em><\/a>.&nbsp;Okay, so on to the interview. As I said, if you've got any questions you can always reach out to me. My email address is <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"2d45484141426d5a454c594f44594e424443494449034e4240\">[email&nbsp;protected]<\/a>. I look forward to hearing from you.","Listen, I've been following <em data-v-f87c67ca=\"\">The Block<\/em> for a while. Following your work. Absolutely loving it. But fully recognize that you are very different from every other crypto publication. Throwing hand grenades out there. Big stories, big coverage. Tell me about it. What's the strategy? What are you trying to do here with <em data-v-f87c67ca=\"\">The Block<\/em>?","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong>&nbsp;With <em data-v-f87c67ca=\"\">The Block,<\/em> we're really trying to bring clean clear objective fact based analysis, journalism, and research to an ecosystem in which 95 percent plus of the projects are basically poof. If not in the next couple months, in the next couple years. It's pretty clear to anyone. Everyone was saying six to eight months ago when this idea for <em data-v-f87c67ca=\"\">The Block<\/em> first came about that, \"Look. This entire quote unquote asset class is overvalued\". But nobody was covering it that way, right? You had <em data-v-f87c67ca=\"\">CoinDesk<\/em> and others literally running BitConnect ads. It's crazy.","Mainstream media did not at the time understand the technology well enough, the governance well enough. Pretty much anything well enough to report on this accurately. They were just reporting on price. Including <em data-v-f87c67ca=\"\">CNBC<\/em>, including <em data-v-f87c67ca=\"\">Bloomberg<\/em>, and doing it in really short segments. We feel, I certainly feel having worked in FinTech at Braintree, at Google Wallet, at Venmo, for years at PayPal, that blockchain and crypto assets are a major significant evolution in how we think about money, how we think about technology and value, and digital assets. I don't think it's like traditional FinTech, that tends to get co-opted by the big banks in the existing system. I think of it as something that can exist outside of those systems. That really got me excited.","At the same time, was disappointed with the lack of professional coverage in the space, and felt like we could play a part as a media and information source of great credibility, at helping to highlight the good things and highlight the bad things. Then really separate the wheat from the chaff.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> Right, okay. You spotted the opportunity. What did you go through to make it a reality?","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong>&nbsp;Basically it's a people business, right? So much by the way of this entire ecosystem is a people ecosystem. We're creating software. We're creating protocols. We're not creating, in our business which is a media, information, research, and analysis business. Or in these technology businesses that are being created. It's primarily software driven. It's a lot about the people. The biggest thing at <em data-v-f87c67ca=\"\">The Block<\/em> was being able to recruit those people who were best in the world.","Best in the world in this ecosystem isn't somebody with 20 years of experience, because nobody has it outside of a handful of folks who were crypto anarchists in the '90s, right? What it means is bringing on people who are curious. People who have depth of knowledge, and tremendous amounts of energy, and are so passionate about this. I mean our team, we have an internal Slack group that we use for a variety of reasons. But we spend, you'll see a message, like 22 out of 24 hours of the day on there from somebody on the team. The energy is palpable. Recruiting the best people is key. The best researchers. The best analysts. The best technologists.","We're really excited about where we are. We have a really good team. The output has been tremendous since we actually launched the product in September, and the readership has followed and attention has followed.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong>&nbsp;You said you think 95 percent is going to go poof. What is it you think that?","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> Probably more. I mean that's if we go to like token 5,000 on <em data-v-f87c67ca=\"\">CoinMarketCap<\/em>. There's just, I mean there's a whole variety of reasons, right? There are people who literally scammed others. You have a variety of scams. You have a variety of people who raised money because it was easy to sell tokens to the public. Oftentimes in ways that are unregulated. Then simply don't have the capability to build what they said they would. I mean that's probably, I'm making up numbers here, but that's a big big big chunk of projects.","Then there are people who believed they could do things and haven't been able to, and have had to shut down. Then you get to the cream of the crop, right? I mean you have ... When entities like Consensus that employed 1,000 or so people at the peak are laying off hundreds and hundreds of people, with many more to come, you know that the funding got far far far ahead of what the technology is capable of. I think a lot of things that got funded will, it has so many analogies to the first internet bubble. But will be things that, in 10 years an idea might make sense, but today it doesn't.","A lot of it has to do with, \"Cool. You can do this technology thing.\" But the trade-offs to do it on a blockchain are that it becomes absolutely unusable by consumers or businesses. Because the interface is just abysmal. That's a whole other segment of products.","Then you know, the products are actually good and interesting. Just, a lot of them aren't getting usage. You look at consumer facing dApps, which was a big use case for Ethereum outside of ICO funding and ERC20 tokens. The dApp, either business or consumer usage simply isn't there yet. EOS has been launched to try to reduce friction and enhance scalability. But again, we're talking ... The big question right now for so many of these projects is, \"Is a blockchain necessary?\", right? For many it's not.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> Right, okay. You also, you mentioned <em data-v-f87c67ca=\"\">CoinDesk<\/em>. It seems like a number of the other crypto publications and websites, they are reporting in a different way. Do you think some of them, maybe this is ... Well I identify probably two reasons. One is a conflict of interest in the bigger group they may be part of. Secondly is the model they've built. In that I think many of these companies are relying on these crypto projects as a source of income. We've seen that some actually will accept payment for positive stories. Do you think that's why they've not covered it? You obviously have a different model.","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> Yeah. I mean this is very easy to break into groups. Let's start with the mainstream media, right? The mainstream media covers this because it gets a disproportionate amount of clicks and attention. It's interesting and it's a class of money as well as a class of technology. But they focus on a general purpose audience and typically don't give the specific thing they're looking at the depth of treatment that's necessary. <em data-v-f87c67ca=\"\">The Economis<\/em>t is the guiltiest of this. <em data-v-f87c67ca=\"\">Bloomberg<\/em> is occasionally guilty when they put their general purpose reporters on it. But when they put their crypto reporters on it they actually do a pretty darn good job. <em data-v-f87c67ca=\"\">Fortune<\/em> has some good folks, like Jeff Roberts. There's some good mainstream media reporting. But I would say in aggregate it just doesn't go into depth.","Then you get, I think the area that you were most interested in focusing on is the <em data-v-f87c67ca=\"\">Coindesk<\/em>s, the <em data-v-f87c67ca=\"\">CCNs<\/em>, and the <em data-v-f87c67ca=\"\">Cointelegraph<\/em>s. Let's just use those as the three largest pure play crypto media entities. <em data-v-f87c67ca=\"\">CCN<\/em> and <em data-v-f87c67ca=\"\">Cointelegraph<\/em> are the absolute early <em data-v-f87c67ca=\"\">Business Insider<\/em>. Just write every single thing up, aggregate. Don't worry too much about whether it's perfectly factually accurate or has depth or things are spelled right. Then let's monetize that through, like you just said earlier, ICO ads and you name any product. I mean you go onto their home pages or article pages anytime, and you're going to see some really low quality ads. That's the model. Very low cost content. Very low quality advertising. It's just volume volume volume. Then they do, as you said, accept sponsored posts. That they do denote. But in sometimes not the most transparent way.","Then you have actual high quality media, which is an interesting new category, and I'll go back to <em data-v-f87c67ca=\"\">Coindesk<\/em>. But you have a high quality media. Some of the new folks like <em data-v-f87c67ca=\"\">Decrypt Media<\/em>, who I have great respect for, and <em data-v-f87c67ca=\"\">BREAKER<\/em>, who I have great respect for. Now both of those are funded by, so <em data-v-f87c67ca=\"\">Decrypt<\/em> is directly funded by ConsenSys, and so while there's a Chinese wall there and that team has great editorial integrity, it's just hard to operate with that relationship without some doubt creeping in on the reader's mind, right? But again, what I've seen to date is high quality reporting. Who knows if stories get killed or other things happen, and who knows what their long term revenue model is. Or if it's just to be sort of patron funded by ConsenSys in a manner similar to how <em data-v-f87c67ca=\"\">The Washington Post<\/em> could lose money because Bezos owns it.","<em data-v-f87c67ca=\"\">BREAKER<\/em> is another one. I don't know what the long term revenue model is there. It's hard to really comment on what their plans are in the future. But today you would look at them and say, \"It's going to be a really difficult challenge to establish businesses with either of those models\". Unless they are funded by the projects. <em data-v-f87c67ca=\"\">BREAKER<\/em> is funded by a project, Singular DTV that ICO'd, has I'm sure a treasury, and can continue to put money into that. They have connections to <em data-v-f87c67ca=\"\">New York Magazine<\/em> as advisors. Those are the only two that I see doing quality work similar to us. But the funding model and business model is in question.","Lastly we'll get to <em data-v-f87c67ca=\"\">Coindesk<\/em>. <em data-v-f87c67ca=\"\">Coindesk<\/em> is a wholly owned subsidiary of Digital Currency Group. Barry Silbert, one of the most powerful most connected folks in the entire ecosystem, who has his tentacles in so many different businesses, so many different projects. His entity is a 100 percent owner. Now <em data-v-f87c67ca=\"\">Coindesk<\/em> has some fantastic editorial talent. Both on the pure editor side, as well as their journalists. They also, and they have great analysts and researchers. It's a mix. They put out some really good work and they put out some lower quality work. But on balance they are doing good work.","The thing is, their model isn't the journalism, the analysis, and the research. It's the conference. To your original question, they make any profit that they make on basically these series of conferences by which it's paid to speak. Gets paid to attend, and it's paid to speak. We're talking tens of millions of dollars in cumulative gross revenue annually for these sponsorships, for these speaking spots, and for participation in conferences. The journalism is meant to drum up interest.","We look at ourselves ... We looked at that landscape and then we looked at ourselves and said, \"Look. There has to be someone who comes into this market\". Like the information has in general technology. Like <em data-v-f87c67ca=\"\">CB Insights<\/em>&nbsp;has in terms of analysis in broader technology, and who does this independent journalism, plus independent research that people will pay for. That's what we're doing at <em data-v-f87c67ca=\"\">The Block<\/em>. While all of our work is shared for free today, we will be introducing a paid product in Q1.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> Do you want to talk about that product? How much can you tell me?","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> Yeah, so I'll give you the broad outline of it. But it will be heavy on a few different things. Number one, we will go much deeper in our research. Some of the <em data-v-f87c67ca=\"\">LUMAscape<\/em> style charts that you've seen about enterprise blockchain or stablecoins, we'll dive deeper into research in those areas. That will be actionable for people who want to invest, who want to work in those areas, who want to understand the technology. Our analysis will go much deeper into looking at specific exchanges. Looking at trade volumes and potential irregularities. I mean just, these are a variety of topics. Again, things that will influence how perhaps people might trade.","Looking at projects much more in depth and looking at people much more in depth. Doing the things that <em data-v-f87c67ca=\"\">The Information<\/em> does, where they highlight deeply, \"Who are all the important people at organization X, Y, or Z? Or protocol or foundation X, Y, or Z?\". Things like <em data-v-f87c67ca=\"\">CrunchBase<\/em>. John Biggs is working with us as editor currently, and he's incredible. He's the founder of <em data-v-f87c67ca=\"\">CrunchBase<\/em>, and so to have John giving us that guidance as we launch this premium paid product. He's somebody who was working in crypto for over a year prior to joining us in the last few weeks. It's just such a massive shot in the arm for our efforts. We have one of the people who's sort of foremost in the world at launching one of these information, research, and people services, helping to guide our editorial teams.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> Right, so it all comes down to the team, right? You've identified, you've got to get the best people.","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> Yeah, it's the team. You know, I left out the journalism. We will continue to break news. We view investigative journalism, such as the great piece that Frank Chaparro wrote on Blockchain Terminal last week, as really important. Because we want to share things that the general public, and even potentially investors in the project, aren't aware of. We know for a fact that we have shown light in certain cases on certain things that folks have then, authorities have then said, \"This is something that we need to investigate\". We think this is really important for the ecosystem, because we have resources and we believe that when we introduce our paid product, we will create such value for folks that we'll also have a business model. To support something that I said earlier will separate the wheat from the chaff in this industry.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> With those quite controversial stories, the investigative journalism side, how much consideration do you have to give to the risk of publishing an article, and how it might reflect on you? Or do you just stand up and say, \"Look. We're journalists. We're reporting the facts\"? Freedom of the press, etc. Where are you positioned with that?","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> We ensure that the things that we put to print, that we publish on www.theblockcrypto.com, have been fact checked. Have been run by legal. Are exceptionally well sourced. Either on the record or with multiple sources off the record. That we have been privy to evidence that supports any factual claim that we make in those articles. What we put into those articles, we stand behind 100 percent.","The thing that is clear always in investigative journalism, and you've seen this with higher profile cases. Things like, the <em data-v-f87c67ca=\"\">Wall Street Journal<\/em> coverage of Theranos. It's always deny deny deny. Then the onion gets peeled back. It's always a cost benefit analysis. When you're saying, \"Should we peel off all eight layers of this? Or should we just leave it with the two layers we've peeled off and get back to focusing on what the customer is looking for?\". In the cases where we've done some investigative journalism, and we have some additional pieces coming over the next month, we're going to basically write the piece and share a reasonable amount of information that we believe is essential to tell the story that the public needs to know, and that we're able to prove. But that doesn't compromise our ability to do all the other things that we do, right?","We can't be pouring 100 percent of our resources into investigative journalism, even if we literally get, I'm not kidding, across our whole team we get more than a dozen tips that are worth looking into about pretty significant potential frauds and scams on a daily basis. It's really wild. I've literally never seen an ecosystem like this. Having spoken with journalists in other verticals and sort of telling them some of the tips that we're getting, not all of which are confidential. Meaning people do share them freely. They say, \"Wow. That's bonkers\". I mean there's a lot of crazy stuff going on in the ecosystem.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> How do you think we've got to this point, then? Where there is so much.","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> It was just a wild wild period of excess. The tens and tens of billions of dollars of capital that poured in, and was contributed by a number of unaccredited investors globally in a relatively unregulated way. It just opened up a crazy Pandora's box. I mean, not to mention the actual companies that are still operating, and I'm not going to name any specifically. Because again, we have some investigations going on. But you look, we had a piece just yesterday. That one percent of volume, this was just a small piece that we wrote, and we were basically repeating what a more detailed study had said. But one percent of volume pairs of BTC on the top 25 pairs was legitimate volume, and more than 90 percent was wash trading or illegitimate volume. I mean it's just bonkers.","I think it's too much money. Not enough regulation. Too many jurisdictions. Whether it be state, federal, multiple countries. These types of markets attract, clearly, the worst kind of people, right? There's ability for money laundering. There's ability to exit scam. I think people still, a lot of the crooks that you'll see, and I'm not talking about anybody that we've covered or anything that we've covered. Because I'm not implying anything about anybody we've covered being crooks. But just in the ecosystem, the things that people do often that I read about and I see other folks covering, or that the SEC is actually settling with people over, I mean it's just dumb stuff. It's stuff that you're obviously going to get caught for doing. Like, \"What the hell are you doing, people?\".","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> It feels like therefore your business is going to transition quite a bit with the market. There's obviously so much to report about right now. You know, we're going to have a complete wipe out of the market. A complete shakeout of the projects that can't ship, won't ship, ship but to low quality and won't get users. All these projects will get wiped out. But at the same time, if we compare to the dot com era, there will be another round of investment of sensible ideas that follow the regulatory framework. I guess over time, you're going to, the type of things you're going to report on are gradually going to be less of the scams and the bad things happening. Then you're going to start following all the good things that are happening.","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> Exactly. That is literally our dream. I didn't know that the market was going to drop 85 percent from the day I made the decision and wrote my day one medium post in January when we were up 1740 Bitcoin. Now where are we? 3500? My wife definitely lets me know repeatedly that I should have sold more a the peak. But you know, you cover what there is to be covered. We don't write about price very often, but we do write about projects that are having trouble, and there's more of those than there are projects that are shining.","That being said, we're going to have a great piece come out written by Arjun Balaji, our technical advisor, this week on the Lightning Network. We are waiting for Myles Snider to write a piece, a positive one, on EOS. There are so many good developments in this ecosystem that we want to cover. I expect to see the pendulum swing back in 2019. But not entirely. In other words, there's going to be projects that run out of capital. Projects that are folded into others.","Then there's the ones that will continue. The best example of that and the one that fascinates me the most is obviously Ripple and XRP. That is, so Ripple is a company and XRP is a protocol, that are unquestionably connected. There's no question, no doubt on Earth. We've spent time. Larry Cermak, our head analyst, has written about this. I had a tweet storm over Thanksgiving about this that was backed up by public facts. That story is going to remain. We're not going to...","Our coverage, the way our coverage will change is, we're no going to keep stating the Ripple security thing over and over again. We're not out here to beat dead horses. We're not out here to chase specific people or projects, or prove points that we already feel we've proven or covered. But if there's new news, I want to see Ripple actually, I'd love to see them get product adoption. I've worked at companies similar to them. With Google Wallet, that launched from zero and now is Google Pay, and it's globally accepted.","I worked on Venmo when it had 30,000 monthly active users. I mean, it was amazing to see that product launch and scale. To help Braintree grow. To found a company in Button that went from zero revenue to more than halfway to $100 million in gross revenue. It's something, I'm an entrepreneur. I want to see these folks succeed.","The thing with Ripple, to get back to that example, is just some of the mealymouthed thing, and changed narrative about the ties to the actual cryptocurrency protocol. But if the company just existed itself without trying to force the token into the business model to prop up the treasury, which has become their actual business model, meaning selling XRP, I would be supportive. I'm supportive as Ripple, if they can improve upon Swift. But as the Transfer Wise CEO said, \"I really haven't seen that to date\".","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> Yeah, and also SWIFT aren't just going to let their business model be taken from underneath them.","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> Of course not. I look at them as more like FinTech than I do Bitcoin. Which could potentially be a store of value. You know, censorship resistant programmable money. But we can save that conversation for another day.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> What do you make of the community around XRP? In that one of the things I've noticed is, I'm very suspicious of the bot activity. But I don't know if that's centrally controlled or if that's something that's just some very eager fans of XRP. But one thing I notice is, the volume of XRP people who have XRP in their name, XRP logos on Twitter, they hammer Coinbase every time they make an announcement, they don't discuss any crypto outside of XRP. If you actually dive into their little communities on their message boards, they're all just sharing each other's content in this kind of weird community.","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> Yeah, so look. It strikes me ... Again, I'm not a journalist and I am not an editorial person at The Block. I feel like I can say that it strikes me as suspicious. That being said, and I've noticed, and many folks like Jeff Goldberg, who almost obsessively talks about this publicly on Twitter, and is somebody who I've known for years pre-crypto, pre him doing any of this. But seems to, the evidence he's presented is at least eyebrow raising on the coordination of some of these things.","I personally don't have any evidence that this is connected to Ripple Corp, or that Ripple is paying any of these folks. I would never make that insinuation or accusation. But it makes you wonder if someone is, right? I don't know what's going on there, is all I have to say. But you don't see behavior like this from any other crypto quote unquote community. You see people talking about the technology. The general level of sophistication of the arguments of that particular army and community versus literally any other one is, like I can't put a number on it. It's significantly lower and less sophisticated. It's not even worth engaging at this point anymore. I've just made a policy on my personal account to just block it.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> Yeah, and do you know what? How do you separate what is <em data-v-f87c67ca=\"\">The Block<\/em> and what is personal views? Twitter accounts tend to be personal.","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> It's really difficult. It's really difficult. I'm never going to get it to a point where 100 percent of people will agree with 100 percent of where I draw the line. By the way, I think that's true of <em data-v-f87c67ca=\"\">The Block's<\/em> coverage. We even internally debate, how much should we say on our personal accounts? How much should we say on <em data-v-f87c67ca=\"\">The Block<\/em> account. Then what should we cover? We have lots of internal debate on what we should cover and how we should cover it, and have different viewpoints.","But basically I think the rule, and I'm learning as I go, because I've historically been in more enterprise technology. Which by the way was why it was so fun to kind of raise $2 million for this business over the summer. A business that I'd never done before. But our investors believed in this mission, knew I'd been in crypto since 2013 and was passionate about it, and that I'm a great recruiter and could recruit this world class team to do this. But my personality and who I am and my passion is a big part of what makes this tick, and that's true of the rest of our team as well. Larry, Frank, Steven, John Biggs.","I took it, one of the highest praise or most, literally one of the kindest things anybody has said to me in a long time is, John Biggs, again, early <em data-v-f87c67ca=\"\">TechCrunch<\/em>, who came up with <em data-v-f87c67ca=\"\">CrunchBase<\/em> and worked closely with Michael Arrington, said, \"Dudas, man. You remind me of Michael Arrington in the early days. Like the fire\", and said a few other things. I was excited by that. I think Michael was able to, and he's still in the game in a big way in crypto. But he was able to I think move the industry in a number of ways and in a positive light. In a positive direction. Get it more visibility. Make it ready for mainstream coverage. I'd like to do that as well for crypto. But I'd like to be the mainstream publication.","<em data-v-f87c67ca=\"\">TechCrunch<\/em>, they've kind of ultimately purchased and didn't necessarily realize their true financial potential. I think we can learn from some of the things that happened there to do that. To do even better.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> Tell me about the team then. Because that is one of the most impressive things. You've recruited this all star team. Every time someone new comes on you're like, \"Yeah. I've been reading your content already.\" Tell me about the team. Who the key people are. What their roles are within The Block. But also, tell me about where the gaps are. Who you're looking to get in the future. What kind of people.","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> The key folks, my co-founder and CTO Jake McGraw, is incredible. He and I worked together 10 years ago at the first startup that both he and I worked at in '08, '09. Which was an ad tech startup. My key rule here is, the absolute best signal that somebody is going to be great to work with at an early stage company is that you know them and have worked with them before. Or you know their work.","Jake McGraw is my co-founder, and he's incredible. John Biggs coming on as our editor, we parted ways with our founding editor. John is incredible. He has a tremendous amount of experience, skill, relationships. Can keep it calm and cool when it's just, I'm a very emotional and fiery person as you know. He brings measure. But candidly, our strongest asset is the people doing the work. It's Larry Cermak, our head analyst. It's Steven Zheng, our head researcher. It's Frank Chaparro, who's our senior correspondent, and came to us from Business Insider. Then Isabel Woodford, who just joined us, who'd worked at Reuters and is based in London. Those four are doing the work that is really making this company special.","What's so fascinating is that each one of them is under the age of 25, but knows more about this space, whether it be the technology, whether it be the people, whether it be the companies, than I do. My job is to get to a slightly below topical level knowledge about a lot of things, and then help orchestrate what we cover. Go out, sales and marketing, raise money, and lead the team. But these folks are world class experts. They've been so amazing that they helped attract Arjun Balaji, who is I think one of the top five people. We've been friends. I leapt for joy when he agreed to join as technical advisor. He's giving us a decent amount of his time, and will be publishing some work.","But the whole point is, great talent attracts great talent. We're now getting more contributor pieces, ideas, tips. Then last but definitely not least, I hired a guy named Mike McCaffrey, who had spent 18 months working at Citibank as an investment banker. He was recommended to us by two investors. Bloomberg Beta, I love that <em data-v-f87c67ca=\"\">Bloomberg<\/em> is an investor in our business, and Blockchange's Ken Seiff, who is an incredible investor. Multiple funds, and just a wonderful man. Former CEO, and a great advisor to us. But they both recommended Mike as chief of staff, and we subsequently promoted him to director of operations and finance, as well as chief of staff. The guy is 24 going on 40. The maturity that he brings. You need these heroes.","The biggest thing I've learned, I don't recruit on LinkedIn. We don't even have to post jobs, because our network, the people we see, the talent basically comes to you if you're doing great stuff. That's what's been so so exciting. These best people just rise to the challenge in an incredible way. We're just looking for more of that. Frankly it gives us what you would call a quote unquote arbitrage opportunity versus others. We compensate every single full time person on the team in equity. As well as fair value cash. It's basically like you have upside above and beyond. That's something, that we don't have to over over over pay like I bet some of the other publications out there have to. We can pay these folks and give them upside. It's an unfair advantage.","Lastly, we have Stephen Palley, who is one of the best lawyers in the space, working on our behalf. That really, I developed a friendship with him. He's really been an incredible asset to the team, because so much of what we do does require a legal review prior to publication.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> Yeah, it's a great team. I'm a fan of every single one of them, every person you just named. I think they're all amazing. One thing, it seems to me as an outsider, and I could be wrong. But it feels like you don't really have any kind of huge hierarchy of structure. It feels like you probably have quite a flat structure, and you give your team a lot of freedom.","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> Exactly. That, I didn't actually answer the last parting question which was, \"What are the gaps?\". We are launching, as I mentioned, a paid product. The biggest thing, and I just posted this actually yesterday publicly, that we will hire between now and February when we launch additional researchers and analysts. There's some really really exciting world class people who we're talking to. We're going to hire more full time folks. With love, anybody interested and listening, to apply on our site. As well as contributor pieces.","It's just the exposure that folks will get. They love it. They can get it on our site where we're seeing now hundreds of thousands of monthly visits. As well as through our newsletter, which is read by just an insane who's who of the industry. Obviously can't reveal names. But these are C level folks at Fortune 500 companies. These are leaders in protocols, household names, investors, etc.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> Another thing I've noticed, and really I'm a big fan of, is the design of the website. It's very simple. It's very clean. It's very easy to use. It's a real joy actually. As somebody who's come from a web design background, I don't like publisher websites normally. Usually they're either ugly, or something like <em data-v-f87c67ca=\"\">Mashable<\/em> which try to do something different, which I don't get along with. Your site is just really easy to use. It's a really nice chronological hierarchy of stories, which you can filter by Bitcoin, Ethereum. It's very very simple. I'm guessing that was a key decision, right?","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> Absolutely. The original idea was crypto simplified. \"Crypto Simplified\", that's the tagline. That applies whether you're presenting exceptionally complex ideas, or whether you're doing blockchain 101. We were really lucky. So much of this comes down to relationships. I mean, you put yourself in a position to get lucky. But my co-founder, Chris Maddern, of my former company, Button, and who I also worked with at Venmo, recommended an incredible firm called Charming Robot. Who are world class designers. They've worked with <em data-v-f87c67ca=\"\">The Skimm<\/em>. They helped launch <em data-v-f87c67ca=\"\">Skift<\/em>, which was Rafat Ali's travel publication. They've worked with a number of other great folks who all endorsed them to us.","I knew Dan Maccarone, the CEO, and Eric Bowie, the COO, for a while. They did just a bang up job. This is pre-Jake coming on as our CTO. We wanted to build up the site, get it launched on WordPress. You're going to see a lot of updates. But in terms of that clean \"Crypto Simplified\" design, they did such a great job. We wanted to be distinct and look different. In sort of that snippet based or kind of block based design. They helped with the name as well. It was certainly something that I thought about in the shower, and kept thinking about at 3:00 AM. Now we have to figure out how to get the domain name.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> Somebody else got it?","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong>&nbsp;Block.co. Block.com is like Chevy, I think, and I don't think they'll be selling.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong>&nbsp;Right, okay. All right, so look. It's all going well. Readership's up. I saw you put the stats out. They were pretty impressive. You've got a great team. Your paid product's coming. Everything seems to be going well. What are your main challenges, Mike? What's the stuff that is keeping you up at night?","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> Yeah, so as a CEO you always have to mix a healthy dose of optimism and paranoia. I'm most optimistic about the team, as we've talked about, and about the reception to what we're doing. At the same time, there are risks, right? We're largely pre-revenue. We do have revenue coming in, and we will start, by the way, running sponsorships from key partners. Those will be sponsored posts, clearly delineated. From brands that we have great respect, so high quality brands. Not like ICOs that we wouldn't believe in or things like that. In January. \"How is our audience going to respond to that?\", would be a concern. Hopefully well, and we think well.","Then are we going to get that right mix? We have some more hiring to do over the next couple months, as I mentioned. On the research and analysis side. We believe we have the product people are going to like. When we launch the paid product, the last thing I forgot is we're going to have like a Matt Levine from <em data-v-f87c67ca=\"\">Bloomberg<\/em> style, or a Ryan Selkis style column on a daily or every couple day basis. That'll be behind the paywall. But you know, will that product resonate? We think it will. My basic thing is, I'm not going to name the price point now, but basically at the price point we're going at, if we help you make one good decision per year you've more than paid for your subscription. That's kind of the bar that we want to hit. We want everybody to make 10X from what they read from us.","Then the next thing is, well does the market recover? Right? The market doesn't have to recover per se. But you need some volatility for folks to remain interested. I don't fear that, because I'm kind of a true crypto believer. But I think there's a reasonable logical question. But I think we're past that point, just based on the developer activity I'm seeing through the downturn. The market changing next year. We will go to market to raise one more round of capital, and I'd like to turn profitable on that rate. I plan to raise a series A. I plan to do that in sort of the late Q1 or Q2 timeframe. Based on a really strong management team and a really strong editorial team and a product that will be starting to generate some really good revenue. Led by me, by Jake our CTO, and by John Biggs, our editor in chief. I think that's going to be a really compelling vertical media and information value proposition for investors. But always a risk as to whether you can raise. I mean, I've done it before and I think we can do it.","Then the last thing is just, can we maintain, can we keep our people, right? Can we keep them engaged as their star grows? Because I think it will be advantageous to everybody that we stick together. But this is a people business. I think we all make each other better, and as a leader it's my job to put them all in a position to keep doing that. But scaling is hard, man. You know. You've seen it. I'm sure you've been through it. I did it at Button, at my last company. Over 100 people now. It's like every, when you go from where we are, 10 to 25 is a huge jump. 25 to sort of 40. After that it's just, once you're above 40 it's just constant evolution. People are coming and going.","I think we're a different kind of business, where we don't necessarily need to get that large. But keeping the core intact is really critical, and always the biggest risk.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> Yeah. The most I ever got to was a full time team of 35, and like a transient team of five, so let's say 40. What I noticed is, and I've had this twice actually, about 15 people, above that it starts to change. Because you can't be there holding hands and everyone making decisions together. That kind of united front kind of changes. But the biggest change I had was when we went over 30. It was almost like I had to let go. My job became to manage the people and manage the company. But also you have cliques form and groups form within the company, and politics has become something that's very hard to find. It just naturally happens. Though I'm sure you're prepared for it, Mike.","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> Yeah, we are. But that will be a challenge. We're already in five timezones with 10 people, so it'll be interesting as we hire. In Asia for example. We have a reporter role that we have open there, and we have contributors from there. Joseph Young right now who's a phenomenal contributor who's written a couple pieces for us. We'll have to grow and grow prudently. But you know, the distributed mobile company, it's a new thing. We're looking at the folks who perhaps haven't done it as well, right? Or have grown too fast. You see ConsenSys cutting back.","ConsenSys has done ... I don't mean to pick on them. They've done some incredible things with the Ethereum ecosystem and for the crypto ecosystem at large. But you know, grew too fast and then had to pull back, which can hurt folks. But by the way, that's I think positive for the rest of the ecosystem. We're talking to ConsenSys folks ourselves. I think there's going to be landing places for that talent.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> Yeah. I think, I can imagine in a couple of years we're going to look back at 2018 and hopefully say, \"I'm glad that happened. It was needed. It was required. We needed that to shake everything out so people focus on fundamentals again\".","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> That's what we say about ... We make mistakes as a company in different areas. Whether it's resource planning, hiring, you name it. As long as you can kind of do a retro, take those lessons and grow from them. I have this experience from previous businesses. Not dwell, right? Just like, if I was dwelling on the fact that I lost 80 percent of the notional Bitcoin value that I had at the beginning of the year, I'd drive myself nuts. I don't. Right? I thought about it as play money, and I hedged by actually building a business that I think is going to be tremendously valuable in the long run.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> Well look, you saw my tweet, right?","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong>&nbsp;Yeah. I didn't want to interrupt, yeah.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> Yeah, no, it's fine. It's -","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong>&nbsp;You've got a lot of stuff going on. You're going to look at this in five years and say, \"Hell ...\". I really think, because I see you, the energy that you bring. Now it's my turn to say nice things about you. But I see the energy that you bring in all of your endeavors. By the way, just like I know you don't agree with 100 percent of what I say publicly, I don't always agree with you. But I have such respect for your energy, your conviction, and your honesty and openness. Because again, I'm the same way. Very honest and open.","It's risky and it exposes you. Vulnerability to other people, that they can then point to later. But the bottom line is, you're a doer. You're doing three, four, five things now, and you're going to be successful. Because I think you have good judgment. People are interested in what you do. You have good ideas, and you're thoughtful. You're in, as far as I believe, the right market at the right time.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> Yeah. You know, there's a lot of luck there. But it was just on your point, right? You said you hedged. You wish ... Like I wish I'd sold. I got a phone call from the Guardian newspaper today, because they wanted to talk about what happened. They thought I was all depressed and miserable. I said, \"You know what? I'm not\". They asked if there were regrets and I said, \"Regrets are stupid. Because every decision I've made, at the time I thought it was the right one\". Right? There's no point having regrets.","But like you, I hedged. I was like, \"This isn't going to go on forever. I'm going to build a podcast. I've got a sustainable income. I'm not broke. I haven't lost my house or anything\". Actually, I think we'll look back and ... If someone turned around to me and said, \"You could have all the money but you wouldn't have the podcast\", I wouldn't take it. Because what would I be doing?","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> You have this platform now. It's growing. Yeah, this is how I feel about <em data-v-f87c67ca=\"\">The Block<\/em> as well. Yeah, bottom line, if you can take that positive approach, stay out of depression. Which, I'm somebody and I've said this publicly, who over periods of my life, I fight on a daily basis sort of clinical, clinically, I forget the exact description. But sort of social anxiety disorder. It's a challenge. It impacts how I engage with people. But basically I work day in and day out so that I can overcome it and be that outgoing person. Which is so key to my business. If you're resilient, even despite it being hard and challenging day to day, and taking those setbacks. Which you know, of course. As a startup CEO you can imagine, we've had setbacks. You've revealed the setbacks you've seen over the past year, and come out of it with that spirit.","Then look at the things that you're lucky about. I mean yeah, I'd tweet this recently. But yeah, I've got a beautiful family. A son and a daughter, four and a half year old daughter, one year old son. Amazing life. My parents are incredible, brother. My wife's family. I mean it's just, it's awesome. You know, I feel very fortunate about that. That's the stuff that's important when I'm not tweeting.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> Anxiety though, it's pretty rough, right?","<strong data-v-f87c67ca=\"\">Mike Dudas:&nbsp;<\/strong>It is, yeah. I developed, in my early 20s and didn't know what it was until my mid 20s. It was most crippling when I didn't know what it was. I would literally, if I got up in front of an audience I would literally break into a cold sweat. Then the anticipatory anxiety would become very nerve racking. Then you start to avoid, and I've always been a social outgoing person. You're like, \"What the heck is this?\". But often it happens to that type of a personality.","I've over the years managed it. I mean it's been literally, I'm almost 40, so I've been managing it since I was, managing it well since I was 26. It's been like 14 years. No fun. Daily battle. Many other people have, that's what you would call kind of a mental, let's say a mental illness. In other aspects of my health I'm very fortunate.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> Yeah. I had, I've had bouts of anxiety for five years. Panic attacks. SVTs.","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> Yeah. I read about it. That's what I felt comes from wanting ... chatting with you about it. Mine hasn't gotten to that point. But there was a period actually when I literally would, it was painful to fly because I associated it with ... Then physical things, again, would manifest it. It wouldn't be like a heart rate. But sweating, and I'd get these weird things, like leg cramps, and all kinds of odd stuff. The brain is a powerful thing in positive ways, and can be a powerful thing in negative ways.","I find when I talk to other people doing really exciting, interesting, on the edge things, many of them share these kind of unique things that they manage and that drive them to be better and let them sort of exist on the extremes. Right? I mean I just - I feel that is comforting. That I know there's many other people out there. Again, I've been successful. The most successful parts of my career have been while I've been managing that. It sort of drives me to kind of prove like, \"Hell, I'm going to win and win again.\"","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> Man, I get it. I've been through the roughest times and the good times. I know what it's like. All right, well listen. Look. This is really good stuff. But let's talk about next year. 2019. Give me your predictions, Mike. What do you think is going to happen?","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> I think that this industry is going to return to a really positive builder mentality industry, across all key segments. We've seen the infrastructure being build on the institutional side. In terms of Fidelity and others building out institutional products. I think we're going to start to see some really really early new consumer facing adoption. Endorsement from big companies like Starbucks, like Fidelity. I come from a world where I believe that's important, even though I know many of the early folks and libertarians would say, and maximalists of certain types would say, or crypto anarchists I mean, not maximalists, would say, \"This is bad. They're co-opting our technology and our money\".","I think it's necessary for mass adoption. You're going to see broader adoption and usage of these technologies, and you're going to see more building without the hashtag. You're not going to see people bragging about building. You're going to see some cool product announcements. I think people are going to follow the Lightning Labs of the world, and realize that actually delivering product and then showing how the nodes are growing week over week, and having people talk about it. Folks like Casa who are delivering products. Folks like Ledger. Folks like Nomics who just announced a raise today. Those are the people to follow. Folks like Ric Burton at Balance who keep trucking along, and then just mentioned yesterday that he was able to find a lead for his next round.","I'm excited to watch those builders. Julian from Unlock Protocol. The protocols themselves. Even the projects that are delayed. I'm somebody who's interested in projects far beyond just a coin Ethereum. I was excited to hear Dfinity say, \"This is coming next\". Even Hashgraph today talking about things in the future. I think we're going to see a lot more things come into reality.","Then we're going to see some things come to a head. Things that don't work, right? We're going to see much more regulatory enforcement, and some projects are going to settle and go away. I think that's a healthy thing. You're going to see projects make prudent decisions like Basis did, to sort of shut down when they realized what they proposed isn't feasible. I thought that team wound down in an exceptionally professional way, and should be proud of themselves.","Then we're going to start to see, I think ... I think there will be a high profile disintegration. I don't know what project it is. Bitcoin Cash is sort of doing it to themselves. But you know, just a big massive highly valued project that doesn't deliver. I'm not going to name names. I have some in mind. That kind of the value craters even more than it already has.","I'll kind of end with the notion of, I think you're going to see separation in 2019. Maybe I'm hoping and projecting here. But between high quality project price, you're going to see some drop, like a lot of tokens drop to negative 99 percent of all time high. I mean it's hard to speak in these short term periods and I'm not going to make any investment advice or price predictions. But you know, wherever Bitcoin sort of ends the year, I think 12 months later it's not going to go much lower than that. Or, I'll say this. Two to three years out I see it being higher than where it is now.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> Yeah. I'm with you.","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> In every metric. Hash rate. Activity. On the network. Transactions. You know, consumer usage and price.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> I don't know about you. I'm actually in some ways, I'm excited more than ever.","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> Oh my god, yeah. That's what I should have said. I don't think you're going to see a stop to the flow of people. I do think you're going to see more people entering into this ecosystem. One of the reasons, by the way is because I actually think, so it's important to consider crypto, and I just use that word, slaying. But crypto in the context of the larger global economy, and so I think we're going to start to see some real trouble in the larger global economy. That's going to lead to layoffs. You're going to see more people, people in technology, looking for things to do. Google and Amazon continue to expand. They'll hoover up tons of talent. They're building campuses here in New York.","But there's a lot of other companies that are going to bleed people. I wouldn't be surprised if you see some of those folks coming into this ecosystem and this asset class. You'll start to see I think more ... The one thing that I'm unsure of, the one thing I want to see just so people stop talking about it is this goddamn ETF just getting approved or not. I'm sure Gabor has talked about his. Was he on your show talking about it?","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> Yeah, he was on a few weeks ago. You know what? He put out one tweet that's really interesting. I can't remember the exact wording, but I'll find it and put it in the show notes. But he said something along the lines of, that Coin Base is able to issue shit coin after shit coin to retail investors, whilst they are building a regulated product for institutional investors, and they can't get approval.","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> It's a great ... I'm glad you brought that up. Please do interview my colleague Larry on an upcoming show, because he and I actually disagree fundamentally on this. I think a Bitcoin ETF should be approved. If you look at other assets that have been approved, when you look at market manipulation and those markets, I would argue, and Gabor would as well, that there's no more than there is, at least to be alleged in the Bitcoin market. There's a whole host of other factors they consider.","But then the next question is, \"Was that tweet responsible?\". I'm of the opinion, I really like him, and I'm the type of guy who tweets some things that people don't always necessarily think are proper. I thought it was fun. I think he just kind of called out the wrong company. Now, full disclosure, Coinbase is an investor in <em data-v-f87c67ca=\"\">The Block<\/em>. Very small. Less than 0.3 percent of the company. They, I have a place in my heart for them. They got me into crypto. My first meeting in crypto was when I was at Braintree and at Coinbase. But yeah, I view them as a very credible very secure exchange. They've still only listed, what, like 10, 12 coins at most? Silly one to pick on, I would say. I think listing a token for trading is sort of very very different than having it be an ETF available to unaccredited investors and available through traditional channels.","Once you get that Bitcoin ETF approved, it then can start showing up, not for people who seek it out on Coinbase, but for people who might see that in their traditional accounts. It is a big difference, and so it was just a weird analogy.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> Okay. What are your predictions for <em data-v-f87c67ca=\"\">The Block<\/em> for next year?","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> My prediction for <em data-v-f87c67ca=\"\">The Block<\/em> is that when you look at us five years from now, we are going to be the absolute standard in the crypto ecosystem in terms of the brand that people think of when they think of media, information, you name it, right? Like <em data-v-f87c67ca=\"\">Bloomberg<\/em> is to traditional financial markets, people will think of <em data-v-f87c67ca=\"\">The Block<\/em> as that to crypto. I don't think we'll talk about it as crypto then. I believe it will be digital assets. It will include things like tokenized securities. It will include some of the things that people today classify as FinTech. I think FinTech as a word starts to go away, and we'll start to talk more about digital assets and things of that nature.","I have every intention to make us sort of the preeminent media and information brand. Multimedia by the way. We'll expand into other media in this world.","Then lastly, I think media and information companies have not done a good job of creating communities. I think within the crypto ecosystem in particular, just like Twitch has done in video gaming, I think people love Telegram, they love Slack, in the crypto ecosystem to communicate with one another. They learn in that way. We are going to over the next few years build in an element of communication and community. LinkedIn will not exist in this ecosystem, and so we can act as a sort of replacement for them. It's easy to say that. We have a pretty interesting plan on how we will get there.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> Amazing. Who's going to win the Premier League?","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong>&nbsp;Liverpool. I would say by three points at the end.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> I think it's going to be close. That's all I can say. I think it's going to be tight. It's going to be close.","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> Yeah. I'm not a lifelong fan like you are. I'm a six year fan.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong>&nbsp;Yeah. That's enough. Well you know, if you ever get over here, Mike, I'll get us tickets. I'll take us to a game.","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> Yeah. We tried the last time. I ended up going to see Liverpool versus Palace, and it was an absolute blast.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong>&nbsp;Was that at Palace?","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> Yeah, and I didn't wear any gear.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong>&nbsp;I mean, that's a great ground. That's, that ground is great. It's a noisy ground.","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> Oh my goodness. I did cheer at the whistle, 2-0. The folks around me, season ticket holders, not pleased. Told me to keep it down. I was an American fan. You're not allowed to clap for your team when they win unless you're in the visitors quarters area I guess.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> Yeah. I know the chairman because he used to be a client of mine. We used to do the web work and digital work for Crystal Palace. I got to know Parish, and he invited me to the game where we were three all at, you know, when we missed out on winning the league. What a game. All right. Well listen, look, Mike. This has been great. I knew it would be. Tell me, well tell everyone how they can follow <em data-v-f87c67ca=\"\">The Block<\/em> and how they can follow you, and who you want to hear from.","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong>&nbsp;Of course. You can find us at www.theblockcrypto.com. We're <a href=\"https:\/\/twitter.com\/theblock__?lang=en\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@theblock__<\/a> on Twitter. We've got to fix that. I'm <a href=\"https:\/\/twitter.com\/mdudas\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@mdudas<\/a> on Twitter. Love to engage. I have open DMs. We have open DMs for <em data-v-f87c67ca=\"\">The Block<\/em>. Please communicate with us. We're looking for world class researchers to work with us. World class analysts and world class journalists who have a deep deep interest in the crypto ecosystem. We're always always always looking for tips. If you have an interesting story that you'd either like to write as a contributor yourself, or a tip that you want to share with us. Either anonymously or under your identity. Please don't hesitate to reach out to us.","<strong data-v-f87c67ca=\"\">Peter McCormack:<\/strong> All right, man. That was cool. Thanks a lot, Mike.","<strong data-v-f87c67ca=\"\">Mike Dudas:<\/strong> All right, thank you, brother.","<strong data-v-f87c67ca=\"\">Peter McCormack:&nbsp;<\/strong>Okay, so what did you make of that? Did you enjoy that interview with Mike? Are you following The Block? Have you checked out any of their reporting? Certainly some of their work is full on. But it is a breath of fresh air for someone to come into the space, have a new service which doesn't worry about conflicts of interest, doesn't worry about being part of a bigger group, and can just go out there and say it how it is. I give a massive amount of credit to <em data-v-f87c67ca=\"\">The Block<\/em> and Mike for the work they're doing.","I was also interested to learn about how they're going to monetize their product. I think their website is beautiful, but I couldn't really see how they were going to have advertising on there. It was great to hear from Mike from their plans. I think the subscription service sounds awesome. Probably something I will almost certainly sign up to. Anyway, I hope you enjoyed the interview.&nbsp;"," 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jeff Roberts","content":"PERSON"},{"type":"Arjun Balaji","content":"PERSON"},{"type":"Amazon","content":"LOCATION"},{"type":"$100 million","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Google Wallet","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Steven Zheng","content":"PERSON"},{"type":"think 12 months later","content":"DATE"},{"type":"Myles Snider","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"Thanksgiving","content":"LOCATION"},{"type":"Ryan Selkis","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"95 percent","content":"PERCENT"},{"type":"'08, '09","content":"DATE"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Larry","content":"PERSON"},{"type":"Pandora","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Jake McGraw","content":"PERSON"},{"type":"Chris Maddern","content":"PERSON"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"Starbucks","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"Mike?","content":"PERSON"},{"type":"Ric Burton","content":"PERSON"},{"type":"CrunchBase","content":"ORGANIZATION"},{"type":"Frank","content":"ORGANIZATION"},{"type":"Dan Maccarone","content":"PERSON"},{"type":"2013","content":"DATE"},{"type":"Christmas","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"CB Insights","content":"ORGANIZATION"},{"type":"85 percent","content":"PERCENT"},{"type":"2019","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"Crypto Journalism","content":"ORGANIZATION"},{"type":"one percent","content":"PERCENT"},{"type":"Crystal Palace","content":"ORGANIZATION"},{"type":"London","content":"LOCATION"},{"type":"Ripple","content":"LOCATION"},{"type":"Mike","content":"PERSON"},{"type":"Earth","content":"LOCATION"},{"type":"FinTech","content":"ORGANIZATION"},{"type":"Cointelegraph","content":"PERSON"},{"type":"New York Magazine","content":"LOCATION"},{"type":"today","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Bedford","content":"LOCATION"},{"type":"100 percent","content":"PERCENT"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"Peter McCormack","content":"PERSON"},{"type":"Larry Cermak","content":"PERSON"},{"type":"Braintree","content":"LOCATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"Michael","content":"PERSON"},{"type":"Matt Levine","content":"PERSON"},{"type":"Citibank","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"90 percent","content":"PERCENT"},{"type":"Google Pay","content":"ORGANIZATION"},{"type":"Mike McCaffrey","content":"PERSON"},{"type":"Jake","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"The Skimm","content":"ORGANIZATION"},{"type":"Bezos","content":"PERSON"},{"type":"Barry Silbert","content":"PERSON"},{"type":"Blockchange","content":"ORGANIZATION"},{"type":"tens of billions of dollars","content":"MONEY"},{"type":"3:00 AM","content":"ORGANIZATION"},{"type":"XRP","content":"ORGANIZATION"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Steven","content":"PERSON"},{"type":"Venmo","content":"LOCATION"},{"type":"tens of millions of dollars","content":"MONEY"},{"type":"Bitcoin, Ethereum","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Christmas day","content":"DATE"},{"type":"\"Dudas","content":"LOCATION"},{"type":"John Biggs","content":"PERSON"},{"type":"Rafat Ali","content":"ORGANIZATION"},{"type":"Mike Dudas","content":"PERSON"},{"type":"Ripple Corp","content":"ORGANIZATION"},{"type":"Unlock Protocol","content":"ORGANIZATION"},{"type":"Chevy","content":"ORGANIZATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"CCN","content":"ORGANIZATION"},{"type":"The Washington Post","content":"ORGANIZATION"},{"type":"Isabel Woodford","content":"PERSON"},{"type":"Joseph Young","content":"PERSON"},{"type":"Bloomberg Beta","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"0.3 percent","content":"PERCENT"},{"type":"Michael Arrington","content":"PERSON"},{"type":"0","content":"DATE"},{"type":"Ken Seiff","content":"PERSON"},{"type":"80 percent","content":"PERCENT"},{"type":"Gabor","content":"PERSON"},{"type":"$2 million","content":"MONEY"},{"type":"Jeff Goldberg","content":"PERSON"},{"type":"Eric Bowie","content":"PERSON"},{"type":"99 percent","content":"PERCENT"},{"type":"Coindesk","content":"ORGANIZATION"},{"type":"CTO","content":"ORGANIZATION"},{"type":"next month","content":"DATE"}],"hashtag":["FUNDRAISING","XRP"],"authors":["Mike Dudas","The Block"]}