{"summary":"Web3 developer infrastructure firm Alchemy has acquired Satsuma, a blockchain indexing platform, for an undisclosed sum.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/252948\/alchemy-satsuma","publishDate":"2023-09-26T10:00:05","id":5686,"type":null,"title":"Alchemy acquires blockchain data indexing platform Satsuma","category":["MERGERS & ACQUISITIONS"],"content":["Alchemy, a web3 developer infrastructure firm that was <a href=\"https:\/\/www.theblock.co\/post\/133397\/alchemy-raises-at-10-2-billion-valuation-in-round-led-by-silver-lake\" data-v-f87c67ca=\"\">valued at $10.2 billion last year<\/a>, has acquired Satsuma, a blockchain data indexing platform. As part of the deal, Satsuma will merge with Alchemy and operate as Alchemy Subgraphs, Alchemy said Tuesday. The terms of the deal weren't disclosed.","The acquisition comes amid bearish crypto market conditions, but Alchemy's product manager, Mike Garland, told The Block that the deal is unrelated to the bear market. \"Acquiring Satsuma right now has nothing to do with the bear market,\" he said. \"Their team built a phenomenal product and quickly growing, fanatical user base that reminded us of the early days at Alchemy. Folding the Satsuma team and technology into Alchemy was the obvious next step in continuing to solve the biggest pain points for developers.\"","Satsuma is <a href=\"https:\/\/www.theblock.co\/post\/165681\/web3-infrastructure-provider-alchemy-snaps-up-chainshot-its-first-acquisition\" data-v-f87c67ca=\"\">Alchemy's second acquisition after ChainShot<\/a>, a web3 developer education platform, which it acquired in August 2022.","As a blockchain data indexing platform, Satsuma helps developers build apps faster by extracting and transforming blockchain data.","Building a successful app on top of blockchains is hard, Alchemy said. Suppose someone wants to compute a total value locked of a decentralized finance protocol. In that case, they must create a system to gather and organize transactions in their database. They will also need to ensure the data stays accurate even when the blockchain changes, and they will have to handle the ongoing costs of managing this data.","With Satsuma, developers can build custom data-sharing interfaces faster and significantly cut indexing time. All web3 developers — including those building DeFi, gaming, NFT and metaverse applications — can benefit from Satsuma, Alchemy added.","Satsuma was founded in March 2022 and announced a <a href=\"https:\/\/www.theblock.co\/post\/224834\/satsuma-seed-funding\" data-v-f87c67ca=\"\">$5 million seed funding round<\/a> co-led by Initialized Capital and Archetype in April of this year. There are currently six full-time employees working for Satsuma, and all of them will join Alchemy, Garland said.","\"Dan [Li] and I started Satsuma because we saw an opportunity to make blockchain indexing easier for those building the decentralized internet,\" Jonathan Kau, co-founder and CEO of Satsuma, told The Block. \"We're excited to join forces with Alchemy to accelerate our impact on the web3 ecosystem and vertically integrate our products.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Acquiring Satsuma","content":"ORGANIZATION"},{"type":"Alchemy Subgraphs, Alchemy","content":"ORGANIZATION"},{"type":"August 2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Satsuma","content":"LOCATION"},{"type":"Jonathan Kau","content":"PERSON"},{"type":"Mike Garland","content":"PERSON"},{"type":"March 2022","content":"DATE"},{"type":"Satsuma","content":"ORGANIZATION"},{"type":"$10.2 billion","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Dan [Li","content":"PERSON"},{"type":"Alchemy","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Garland","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"$5 million","content":"MONEY"}],"hashtag":["DATA PROVIDERS","DEVELOPER TOOLS","PRIVATE COMPANY M&AMP;A"],"authors":["Yogita Khatri","The Block"]}