{"summary":"Ethereum founder Vitalek Buterin&#x27;s apparent praise for Bittensor preceded the network&#x27;s token passing $500 at one point.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276263\/ai-network-bittensors-crypto-token-is-up-more-than-90-as-market-cap-hits-3-billion","publishDate":"2024-02-06T13:31:57","id":569,"type":null,"title":"AI network Bittensor&#x27;s crypto token is up more than 90% as market cap hits $3 billion","category":["TOKEN PROJECTS"],"content":["The Bittensor network's token has been skyrocketing as the organization which developed the protocol, the Opentensor Foundation, hopes to offer an open-source alternative amid the artificial intelligence arms race.&nbsp;","Bittensor's $TAO token has risen by more than 90% during the past two weeks and surpassed a market capitalization of $3 billion on Tuesday, according to <a href=\"https:\/\/www.theblock.co\/price\/268328\/bittensor-tao-usd\" data-v-f87c67ca=\"\">The Block's Price Page<\/a>. The token was up 12% and trading at $482.39 as of 12:51 p.m. ET, also according to CoinGecko.","About a week ago, Ethereum founder Vitalek Buterin appeared to express support for Bittensor. In a blog post, <a href=\"https:\/\/vitalik.eth.limo\/general\/2024\/01\/30\/cryptoai.html\" data-v-f87c67ca=\"\">Buterin said<\/a> that Bittensor offered an opportunity to incentivize the creation of better AI by offering financial incentives. \"'Using crypto incentives to incentivize making better AI' can be done without also going down the full rabbit hole of using cryptography to completely encrypt it: approaches like Bittensor fall into this category,\" he wrote.","On a macro level, the intersection of AI and blockchain appears to be complimentary, with blockchain possibly providing a way to curb some of the threats posed by artificial intelligence, for example by ensuring the data used by large language models are trustworthy. Simultaneously, many technological thought leaders fear a world where closed, centralized companies like OpenAI and Google wield a disproportionate amount of control over how perhaps the most powerful and dangerous technology of the 21st century is deployed.","","","Opentensor Foundation aspires to protect against the risks of a few companies dominating AI by incentivizing open-source development of the burgeoning technology through financial incentives.","\"Bittensor interconnects neural networks on the internet, and has created a global, distributed, and incentivized machine learning system that rewards high-performing AI tools with a cryptocurrency,\" according to a statement. \"AI developers that use Bittensor are financially rewarded for creating AI models that are useful, while discouraging AI developers from creating models that are poorly made or don’t solve real world problems.\"","The network encourages competition among developers, according to Opentensor Foundation co-founder and COO Ala Shaabana. \"People on the system will compete with each other to provide the best possible output,\" he told The Block. \"If I'm doing better than you I'm going to get more reward because my model is doing better.\"","Bittensor has nearly 70,000 active accounts and has issued about 5.8 million $TAO tokens, according to the <a href=\"https:\/\/bittensor.com\/scan\" data-v-f87c67ca=\"\">network's website<\/a>.&nbsp;","Bittensor's incentive mechanism rewards \"honestly selected weights,\" which makes the system \"resistant to collusion of up to 50 percent of the network weight,\" according to the network's whitepaper. \"The result is a collectively run intelligence market that continually produces newly trained models and pays contributors who create information theoretic value.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"$482.39","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"$3 billion","content":"MONEY"},{"type":"12:51 p.m. ET","content":"TIME"},{"type":"Opentensor Foundation","content":"ORGANIZATION"},{"type":"COO Ala Shaabana","content":"ORGANIZATION"},{"type":"21st century","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"12%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$TAO","content":"MONEY"},{"type":"Buterin","content":"PERSON"},{"type":"Vitalek Buterin","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"50 percent","content":"PERCENT"}],"hashtag":[],"authors":["RT Watson","The Block"]}