{"summary":"Digital Currency Group, the parent company to struggling crypto trading firm Genesis, has halted its quarterly dividend payments.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/203202\/crypto-giant-digital-currency-group-halts-dividend-payments-coindesk","publishDate":"2023-01-18T05:09:27","id":5691,"type":null,"title":"Crypto giant Digital Currency Group halts dividend payments: Coindesk","category":["COMPANIES"],"content":["Crypto giant Digital Currency Group (DCG) has suspended its quarterly dividends, according to a shareholder letter <a href=\"https:\/\/www.coindesk.com\/business\/2023\/01\/17\/crypto-conglomerate-dcg-suspends-dividends-amid-distress-at-genesis-unit\/?utm_medium=social&amp;utm_source=onecryptofeed&amp;utm_campaign=headlines\" data-v-f87c67ca=\"\">seen by Coindesk<\/a>.","\"In response to the current market environment, DCG has been focused on strengthening our balance sheet by reducing operating expenses and preserving liquidity. As such, we have made the decision to suspend DCG's quarterly dividend distribution until further notice,\" said DCG in the shareholder letter seen by Coindesk.","A DCG spokesperson didn’t immediately respond to a request for comment.","DCG owns a number of crypto companies including distressed trading firm Genesis, whose lending arm took a significant hit from the collapses of FTX and hedge fund Three Arrows Capital and ultimately had to pause withdrawals. Barry Silbert, the CEO and founder of DCG, has been locked in a sparring match with Cameron Winklevoss, the co-founder of crypto exchange Gemini, over the paused withdrawals and its impact on Gemini Earn users.","Winklevoss <a href=\"https:\/\/www.theblock.co\/post\/200442\/gemini-ceo-winklevoss-escalates-dcg-spat-demands-removal-of-silbert\" data-v-f87c67ca=\"\">called<\/a> for the removal of Silbert over the issue and DCG <a href=\"https:\/\/twitter.com\/DCGco\" data-v-f87c67ca=\"\">responded<\/a> on Twitter calling it an \"unconstructive publicity stunt.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DCG","content":"ORGANIZATION"},{"type":"Cameron Winklevoss","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Silbert","content":"PERSON"},{"type":"Coindesk","content":"ORGANIZATION"},{"type":"Digital Currency Group (DCG","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Barry Silbert","content":"PERSON"}],"hashtag":[],"authors":["Kari McMahon","The Block"]}