{"summary":"Those using Chainalysis&#x27;s transaction monitoring tool will now see both future and historical transfers from BitMEX trigger alerts.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/79959\/chainalysis-bitmex-high-risk-warning","publishDate":"2020-10-06T12:03:16","id":5693,"type":null,"title":"Chainalysis says BitMEX is now a &#x27;high risk&#x27; exchange","category":["EXCHANGES"],"content":["<span data-v-f87c67ca=\"\">Chainalysis, the influential cryptocurrency investigations firm, has slapped futures exchange BitMEX with a “high risk” label.<\/span>","<span data-v-f87c67ca=\"\">On October 5, Chainalysis contacted its clients — which include government agencies, banks and exchanges — to advise them that it will consider BitMEX a “high risk exchange” from October 13 onward. Those using the company’s transaction monitoring tool, which is called KYT, will now see both future and historical transfers from BitMEX trigger alerts in the system.<\/span>","<span data-v-f87c67ca=\"\">The news comes after the U.S. Department of Justice and the Commodity Futures Trading Commission <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/79483\/cftc-bitmex-charges-lawsuit\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">filed charges<\/span><\/a><span data-v-f87c67ca=\"\"> against BitMEX and its owner-operators, including chief executive Arthur Hayes, on October 1. <\/span><span data-v-f87c67ca=\"\">The exchange’s founders are accused of operating an unregistered trading platform, as well as of violating anti-money laundering and know-your-customer rules.<\/span>","<span data-v-f87c67ca=\"\">“Any transfers from October 1<\/span><span data-v-f87c67ca=\"\">st<\/span><span data-v-f87c67ca=\"\"> and later should be considered high risk. Compliance teams should also look back at older transfers, but given this change may trigger alerts on thousands of older transfers, it is reasonable to do that incrementally,” Chainalysis told clients in an email that was shared with The Block.<\/span>","<span data-v-f87c67ca=\"\">A spokesperson for Chainalysis said that its customers can set their own risk tolerance, but that “as a general rule to protect them from reputational risk and other associated risks, we consider an entity to be high risk if criminal charges have been brought against the entity or its owners\/operators\/leadership”.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, the label may affect the willingness of regulated institutions to have exposure to BitMEX. David Mercer, chief executive of <a href=\"https:\/\/www.theblockcrypto.com\/linked\/40317\/lmax-digital-continues-its-solid-growth-trajectory-with-record-trading-volumes-of-23-5-billion-over-the-last-3-months\" data-v-f87c67ca=\"\">LMAX<\/a> Group, which operates a London-based cryptocurrency exchange, said he believes the designation will have “a knock-on effect”. <\/span><span data-v-f87c67ca=\"\">He added: “I can’t see any significant institution wanting to continue to trade there.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">One derivatives trader, who spoke on condition of anonymity, described the label as a “death knell”.<\/span>","<span data-v-f87c67ca=\"\">Either way, a flight from the troubled exchange seems to be underway in the wake of the U.S. government’s charges. <\/span><span data-v-f87c67ca=\"\">Data from Arcane Research showed that open interest on BitMEX’s bitcoin derivatives market had dropped off 16% by October 2, a day after the CFTC’s charges were brought against the company.<\/span>","<span data-v-f87c67ca=\"\">A spokesperson for HDR Global Trading Limited, BitMEX’s parent company, has <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/79504\/bitmex-operator-to-fight-charges\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">called the charges ‘heavy-handed’<\/span><\/a><span data-v-f87c67ca=\"\"> and vowed to defend itself against the government’s allegations.<\/span>","<span data-v-f87c67ca=\"\">\"We're aware of this and are in discussions with Chainalysis. In the meantime it is business as usual for the BitMEX platform. All funds are safe and withdrawals are being processed as normal,” said a BitMEX spokesperson.&nbsp; <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"October 2","content":"DATE"},{"type":"October 1","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"October 5","content":"DATE"},{"type":"HDR Global Trading Limited","content":"ORGANIZATION"},{"type":"David Mercer","content":"PERSON"},{"type":"Arcane Research","content":"ORGANIZATION"},{"type":"October 13","content":"DATE"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"U.S. Department of Justice","content":"ORGANIZATION"},{"type":"Chainalysis","content":"PERSON"},{"type":"LMAX<\/a> Group","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"16%","content":"PERCENT"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"London","content":"LOCATION"}],"hashtag":["BITMEX"],"authors":["Ryan Weeks","The Block"]}