{"summary":"Japan&#x27;s Financial Services Agency (FSA), the country&#x27;s securities regulator, has confirmed to The Block that it views XRP as a cryptocurrency and not as a security.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/90922\/japan-fsa-xrp-comments-cryptocurrency","publishDate":"2021-01-13T15:21:16","id":5695,"type":null,"title":"Japan&#x27;s top securities regulator says XRP is not a security","category":["RIPPLE"],"content":["Japan's Financial Services Agency (FSA), the country's securities regulator, has confirmed to The Block that it views XRP as a cryptocurrency and not as a security.","The question has become relevant recently in light of the U.S. Securities and Exchange Commission's <a href=\"https:\/\/www.theblockcrypto.com\/linked\/88912\/sec-ripple-labs-lawsuit-filed-2\" data-v-f87c67ca=\"\">allegation<\/a> that by selling XRP the firm engaged in sales of unregistered securities — and because just about one month ago Ripple CEO Brad Garlinghouse <a href=\"https:\/\/www.theblockcrypto.com\/linked\/81998\/ripple-japan-singapore-if-leaves-the-us\" data-v-f87c67ca=\"\">said<\/a> that the firm might leave the U.S. in search of a more friendly regulatory environment.","\"FSA regards XRP as a cryptocurrency based on definitions of the Payment Services Act,\" the Japanese regulator told The Block in an email Tuesday. \"FSA refrains from making comments about other authorities' response.\"","The statement represents the first time the FSA has commented directly on the legal status of XRP. Last month, Nomura Research Institute <a href=\"https:\/\/www.nri.com\/jp\/knowledge\/blog\/lst\/2020\/fis\/osaki\/1224\" data-v-f87c67ca=\"\">published<\/a> a report, saying that according to the Act, a \"widely accepted interpretation\" is that XRP is a crypto asset and not a security.","Shortly after, citing that report, Ripple's investor and business partner SBI Holdings <a href=\"http:\/\/www.sbigroup.co.jp\/news\/2020\/1228_12272.htmlmorning\" data-v-f87c67ca=\"\">published<\/a> a press release saying that XRP is not a security in Japan. It did not cite any direct comments from the FSA.","SBI Holdings did not respond to The Block's requests for comments when reached.&nbsp;Ripple also cited the Nomura report when reached for comments. The firm did not provide any further comments by press time.","According to Japan's Payment Services Act, a digital asset is a cryptocurrency or \"virtual currency\" when it is used as a payment method to an unspecified person and when it is not denominated in fiat currency.","\"The term 'Virtual Currency' as used in this Act means any of the following,\" the FSA told The Block:","\"(i) property value (limited to that which is recorded on an electronic device or any other object by electronic means, and excluding the Japanese currency, foreign currencies, and Currency-Denominated Assets; the same applies in the following item) which can be used in relation to unspecified persons for the purpose of paying consideration for the purchase or leasing of goods or the receipt of provision of services and can also be purchased from and sold to unspecified persons acting as counterparties, and which can be transferred by means of an electronic data processing system;","and (ii) property value which can be mutually exchanged with what is set forth in the preceding item with unspecified persons acting as counterparties, and which can be transferred by means of an electronic data processing system.\"","Currency-denominated assets mean any assets that are denominated in Japanese yen or a foreign currency, per the Act.","The U.K.'s finance ministry also considers XRP as a non-security. It considers the digital asset as an \"exchange token.\"","\"Tokens that are primarily used as a means of exchange – this includes widely known cryptoassets such as Bitcoin, Ether and XRP,\" the finance ministry said in a regulatory <a href=\"https:\/\/assets.publishing.service.gov.uk\/government\/uploads\/system\/uploads\/attachment_data\/file\/950206\/HM_Treasury_Cryptoasset_and_Stablecoin_consultation.pdf\" data-v-f87c67ca=\"\">consultation document<\/a> published last week.","The U.K. was also previously <a href=\"https:\/\/www.theblockcrypto.com\/linked\/81998\/ripple-japan-singapore-if-leaves-the-us\" data-v-f87c67ca=\"\">shortlisted by Ripple<\/a> for its new headquarters, among other countries, if it leaves the U.S.","Of course, the FSA determination doesn't mean much for Ripple's looming fight with the SEC. But it does reflect how governments around the world take divergent viewpoints on regulating digital assets such as XRP.","Within less than a month since the SEC filed its lawsuit against Ripple, Garlinghouse, and co-founder Chris Larsen, crypto firms around the world have come under pressure to drop XRP from their offerings. XRP's price is down by about 35% since the lawsuit. It is currently trading at around $0.30 per token.","","","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Source: CoinGecko, The Block Research<\/span><\/em>","But in Japan, it appears that XRP trading will be allowed to continue for the foreseeable future — and that might be enough to lure Ripple there, too.","Ripple has maintained that XRP is not a security and has vowed to fight the SEC charges. Ripple is expected to submit its initial response to the SEC’s charges <a href=\"https:\/\/www.theblockcrypto.com\/post\/90437\/ripple-ceo-garlinghouse-questions-sec-lawsuit-twitter\" data-v-f87c67ca=\"\">in the coming weeks<\/a>.","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">&nbsp;<\/span><\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Nomura","content":"ORGANIZATION"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Chris Larsen","content":"PERSON"},{"type":"Garlinghouse","content":"PERSON"},{"type":"U.K.","content":"LOCATION"},{"type":"Japan","content":"LOCATION"},{"type":"Financial Services Agency","content":"ORGANIZATION"},{"type":"SBI Holdings","content":"ORGANIZATION"},{"type":"Brad Garlinghouse","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"$0.30","content":"MONEY"},{"type":"FSA","content":"ORGANIZATION"},{"type":"35%","content":"PERCENT"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Nomura Research Institute","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["XRP"],"authors":["Yogita Khatri","The Block"]}