{"summary":"Japan&#x27;s FSA encouraged financial institutions to strengthen their monitoring of &quot;unlawful&quot; transfers to crypto exchange service providers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277426\/japan-fsa-unlawful-money-transfers-crypto-p2p","publishDate":"2024-02-14T06:48:51","id":5696,"type":null,"title":"Japan&#x27;s financial regulator encourages stronger monitoring of crypto transfers","category":["REGULATION"],"content":["Japan's Financial Services Agency <a href=\"https:\/\/www.fsa.go.jp\/en\/news\/2024\/20240214.html\" data-v-f87c67ca=\"\">encouraged<\/a> financial institutions in the country to strengthen their monitoring of \"unlawful\" transfers to crypto exchange providers.","Citing analysis by the country's National Police Agency — which concludes damages resulting from specialized fraud regarding unlawful money transfers are mostly transferred using crypto — the FSA \"encouraged financial institutions to further strengthen their user's protection depending on the risks such as their status of transfers to crypto-asset exchange service providers.\"","Specifically, the FSA suggested that financial institutions stop transfers \"to crypto-asset exchange service providers if the sender's name is different from the account name.\" While this may be an effort to combat cases of identity theft and money laundering, some have suggested that the wording opens the door to halting certain peer-to-peer transfers, such as a bank account holder sending a payment to another individual's crypto exchange account.","The Block reached out to the FSA for comment and clarification.","The FSA also encouraged financial institutions to further strengthen the \"monitoring of unlawful transfers to crypto-asset exchange service providers.\"","While the FSA's recommendations may not be inherently \"crypto-friendly,\" the Japanese government recently <a href=\"https:\/\/www.theblock.co\/post\/269200\/japan-seeks-to-exempt-companies-from-tax-on-unrealized-crypto-gains-reports\" data-v-f87c67ca=\"\">approved<\/a> a 2024 tax regime revision that seeks to exclude corporations from paying tax on unrealized crypto gains if they hold the assets longer term.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"FSA","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"National Police Agency","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Japan","content":"LOCATION"},{"type":"Financial Services Agency","content":"ORGANIZATION"}],"hashtag":["ASIAN REGULATION","TRADFI BANKS"],"authors":["Adam James","The Block"]}