{"summary":"New users must complete level-one KYC verification to be able to deposit and trade, the company said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246462\/bitget-kyc","publishDate":"2023-08-21T02:12:19","id":5699,"type":null,"title":"Crypto exchange Bitget to require mandatory ID verification for users","category":["EXCHANGES"],"content":["Cryptocurrency exchange Bitget is strengthening its know-your-customer (KYC) requirements for users, the company <a href=\"https:\/\/www.bitget.com\/support\/articles\/12560603796549\" data-v-f87c67ca=\"\">announced<\/a> today.","The crypto exchange said that starting from Sept. 1, newly signed-up users must complete level-one KYC verification to deposit and trade digital assets on Bitget. This move is “to comply with regulatory requirements in the global cryptocurrency sector and create a secure cryptocurrency trading environment,” Bitget said.","For users who signed up before Sept. 1, they must meet the level-one KYC requirements before October 1. Otherwise, the exchange clarified, they will only be able to withdraw, cancel orders and close positions.","Bitget’s level-one KYC verification requires users to submit a government-issued identity document and go through facial authentication. According to the exchange’s registration landing page, this process would take about 20 minutes.","Bitget’s move to heighten its KYC rules comes as the exchange looks to expand its global presence. In April, the exchange <a href=\"https:\/\/www.theblock.co\/post\/225504\/bitget-venture-fund\" data-v-f87c67ca=\"\">unveiled<\/a> a $100 million global venture capital fund, focusing on Asia.","In July, Bitget launched its crypto loan products, catering to users seeking alternative means of funding through digital assets.","In July, crypto exchange KuCoin <a href=\"https:\/\/www.theblock.co\/post\/236838\/crypto-exchange-kucoin-mandatory-kyc\" data-v-f87c67ca=\"\">introduced<\/a> mandatory know-your-customer (KYC) procedures for all users, warning that failure to comply would result in limitations. This move came after New York State Attorney General Letitia James <a href=\"https:\/\/www.theblock.co\/post\/218600\/new-york-sues-kucoin-claims-ether-is-an-unregistered-security\" data-v-f87c67ca=\"\">sued<\/a> KuCoin, alleging that the crypto exchange had operated as an unregistered commodities and securities broker or dealer.","Bybit, another crypto exchange, also <a href=\"https:\/\/www.theblock.co\/post\/227943\/bybit-moves-to-impose-mandatory-kyc-rules-for-all-services\" data-v-f87c67ca=\"\">announced<\/a> that it would take a more stringent approach, starting to require KYC identification for all its services in May.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York State","content":"ORGANIZATION"},{"type":"Letitia James <a href=\"https:\/\/www.theblock.co\/post\/218600\/new-york-sues-kucoin-claims-ether-is-an-unregistered-security\" data-v-f87c67ca=\"\">sued<\/a> KuCoin","content":"PERSON"},{"type":"KYC","content":"ORGANIZATION"},{"type":"October 1","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Sept. 1","content":"DATE"},{"type":"July","content":"DATE"},{"type":"Bitget","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"Asia","content":"LOCATION"}],"hashtag":["ANTI-MONEY LAUNDERING"],"authors":["Timmy Shen","The Block"]}