{"summary":"Bitcoin is trading at a premium of nearly $400 on Binance.US.\nThe move comes after the U.S. SEC sued the crypto exchange and sought to freeze its assets.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/233429\/bitcoin-price-premium-binance-sec-lawsuit","publishDate":"2023-06-07T06:17:11","id":57,"type":null,"title":"Bitcoin price commands premium on Binance.US after SEC lawsuit","category":["Exchanges"],"content":["Bitcoin is trading at a premium of nearly $400 on Binance.US after the United States Securities and Exchange Commission sued the crypto exchange earlier this week.","The bitcoin price on Binance.US currently stands at around $27,190, whereas on Coinbase, it stands at about $26,800, according to TradingView data. The SEC sued both crypto exchanges this week for allegedly violating U.S. security laws by allowing users to trade crypto it deems unregistered securities.","The bitcoin premium on Binance.US may indicate that users are trying to move their assets into the foremost cryptocurrency to withdraw it immediately — instead of fiat, as wire withdrawals typically take longer, should the exchange's assets get frozen by the SEC. The regulator yesterday <a href=\"https:\/\/www.theblock.co\/post\/233369\/sec-files-temporary-restraining-order-against-binance\" data-v-f87c67ca=\"\">sought<\/a> an order for the freeze of assets, including cryptocurrencies, held by Binance, Binance.US, and their owner, Changpeng 'CZ' Zhao, \"to ensure the safety of customer assets.\"","This is not the first time Binance.US has recently experienced a bitcoin premium. Last month, the event occurred for several days. That occurrence was due to the exchange's difficulties in finding a banking partner since Signature and Silvergate banks closed. With high demand for bitcoin, users on Binance.US were seeking faster withdrawal times than USD, leading to a rush of bitcoin trading and a premium on the exchange.","Binance.US is still having USD deposit and withdrawal issues, according to its website, which <a href=\"https:\/\/www.binance.us\/status\" data-v-f87c67ca=\"\">says<\/a>: “Due to channel switching, for some users, USD-based payment methods including Debit Card, Apple Pay and Google Pay will be temporarily unavailable.” This could have further contributed to the bitcoin premium on the exchange.","","","CryptoQuant analyst Mikołaj Zakrzowski said the bitcoin premium \"may be a result of market makers leaving Binance.US, which decreased the liquidity in the exchange's order book and caused a weak market depth.\"","\"In essence, the imbalance of the order book was what caused the premium on the exchange to emerge, as the order book got heavily skewed in favor of buy orders and bitcoin's price followed,\" Zakrzowski said.","The <a href=\"https:\/\/www.theblock.co\/post\/233270\/sec-sues-coinbase-binance?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">SEC lawsuits<\/a> against Binance, Binance.US and Coinbase have led to large withdrawals from the exchanges. According to Nansen, Binance users have <a href=\"https:\/\/twitter.com\/nansen_ai\/status\/1666145237474095104\" data-v-f87c67ca=\"\">withdrawn<\/a> over $3 billion, and Coinbase users have withdrawn over $1.2 billion as of yesterday.","<em data-v-f87c67ca=\"\">(Updates with comment from CryptoQuant)<\/em>"],"hashtag":["BINANCE","BITCOIN","COINBASE"]}