{"summary":"Tenderly revealed its Web3 Gateway, a development tool designed to reduce obstacles for the integration of blockchain-based applications.\n\nThe company expects the Web3 Gateway will offer greater transparency, allowing developers to integrate tools for users to see the ramifications of transactions before committing to them, potentially stifling scammers.\n\n ","author":["Jeremy Nation","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/182025\/tenderly-ceo-web3-gateway-to-increase-transaction-transparency","publishDate":"2022-11-02T09:00:48","id":570,"type":null,"title":"Tenderly CEO: Web3 Gateway to increase transaction transparency","category":["Web3"],"content":["Web3 development platform Tenderly unveiled its Web3 Gateway, a service it expects will allow software engineers to build tools to forecast transaction results in blockchain applications before users commit to them, potentially saving them from losing assets, the company said.","<span data-v-f87c67ca=\"\">Web3 Gateway is designed to reduce obstacles for developers integrating blockchain systems into their technology stacks and application layers, Tenderly CEO and co-founder Andrej Bencic and Vice President of Marketing Stela Udovicic said in an interview with The Block. <\/span>","<span data-v-f87c67ca=\"\">T<\/span>he Tenderly Web3 Gateway aims to be a versatile tool, built to enable developers to build better user interfaces while reducing the technical know-how related to blockchain engineering and offering a wide array of debugging, documentation, observation, and reporting tools, Bencic said.","<span data-v-f87c67ca=\"\">“What's most interesting about it is it provides the transaction transparency and predictability to the end users, who, in some cases might not be as experienced with the space as some of us veterans are,” said Bencic, adding that it allows users “to preview transactions and actually see the differences and the effects of transactions before committing to them.”<\/span>","<span data-v-f87c67ca=\"\">The ability to potentially see the ramifications of a transaction before it goes through could prevent users from losing assets to scammers.<\/span>","<span data-v-f87c67ca=\"\">Tenderly’s Ethereum engineering platform offers a complete view of software development, according to Bencic. “We cover anything from the development to observability, and finally, providing the infrastructure for that.”<\/span>","<span data-v-f87c67ca=\"\">“We are running 50 million simulations per month currently and we have customers who are building that as a backbone of their development,” said Udovicic.<\/span>","One of those customers is the decentralized finance platform Instadapp, which embedded Tenderly’s tools in production and internal testing environments to reduce time spent on bug fixes by a factor of 10, according to a case study obtained by The Block.","<span data-v-f87c67ca=\"\">Aside Instadapp, a number of other major crypto platforms use Tenderly, including Binance, Aave, Kyber Network, Yearn, 1inch, Lido, Chainlink, Optimism, Uniswap and Maker, among others.<\/span>","<span data-v-f87c67ca=\"\">“When there's hype and when there's sort of positivity and optimism about the space in general, that's when we are seeing most developers come on board as well,” said Bencic. “We, as a space, want to replicate as often as we can,” he added.<\/span>","<span data-v-f87c67ca=\"\">\"Bringing in the new wave of that web3 convergence is something that is very, very high on our priority list.”<\/span>"],"hashtag":[]}