{"summary":"A deal between Binance.US and Voyager may fall under review by the Committee on Foreign Investment in the United States, said a court filing.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/198587\/binance-us-deal-with-voyager-may-fall-under-federal-committee-review","publishDate":"2022-12-30T15:51:40","id":5703,"type":null,"title":"Binance.US deal with Voyager may fall under federal committee review","category":["U.S. POLICYMAKING"],"content":["<span data-v-f87c67ca=\"\">An agreement between Binance.US and bankrupt crypto lender Voyager Digital may be subject to review by the Committee on Foreign Investment in the United States (CFIUS), court filings showed.<\/span>","<span data-v-f87c67ca=\"\">The review’s outcome “could affect the ability of the parties to complete the transactions, the timing of completion, or relevant terms,” according to the notice.<\/span>","<span data-v-f87c67ca=\"\">In such matters, bankruptcy courts take into account CFIUS reviews among other potential national security concerns when determining a bidder’s qualification, said the document.<\/span>","<span data-v-f87c67ca=\"\">Beating out other bidders such as rossTower, Wave Financial and INX, Binance.US sought to broker a deal with Voyager that would rapidly restore its customer’s access to locked funds.<\/span>","<span data-v-f87c67ca=\"\">Under the <\/span><a href=\"https:\/\/www.theblock.co\/post\/196216\/binance-us-buy-voyager-assets\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">terms of the deal<\/span><\/a><span data-v-f87c67ca=\"\"> now under review, users would ultimately gain access to their digital assets and receive disbursements from Voyager on Binance.US. To get the ball rolling, Binance.US offered to make an initial $10 million deposit and pay Voyager an additional maximum of $15 million for expenses.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"the Committee on Foreign Investment","content":"ORGANIZATION"},{"type":"CFIUS","content":"ORGANIZATION"},{"type":"$15 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Voyager","content":"LOCATION"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"$10 million","content":"MONEY"}],"hashtag":["BINANCE"],"authors":["Jeremy Nation","The Block"]}