{"summary":"Reflecting on the collapse of FTX, Bahamas Prime Minister Philip Davis said he wouldn&#x27;t have done anything differently.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228659\/bahamas-ponders-ftx-collapse","publishDate":"2023-04-27T14:53:30","id":5704,"type":null,"title":"FTX collapse hasn&#x27;t soured The Bahamas on crypto","category":["COMPANIES"],"content":["Bahamas Prime Minister Philip Davis used a Thursday appearance at CoinDesk's <a href=\"https:\/\/consensus.coindesk.com\/\" data-v-f87c67ca=\"\">Consensus<\/a> conference in Austin, Texas to reflect on the collapse of the FTX crypto exchange that had been headquartered in the Caribbean country. He said he wouldn't have done anything differently.&nbsp;","\"The Monday morning quarterback is always right,\" he said. \"I don't think we would have done anything differently than what we did. In fact, he put my jurisdiction on a map in this space.\"","Davis was referring FTX founder Sam Bankman-Fried, who he said he met no more than four times during his time in the Bahamas.&nbsp;","\"He was passionate in what he was doing, very smart, and was very philanthropic in his work,\" Davis said. \"It was a shock to discover that the business had encountered the challenges that it did.\"","Davis said that <a href=\"https:\/\/www.scb.gov.bs\/\" data-v-f87c67ca=\"\">authorities in the Bahamas<\/a> are actively investigating the events that led to the collapse of the exchange.&nbsp;","\"Due to the wide range of jurisdictions in which FTX operated, and the size and scope of its business activities, the investigation is complex and continuing,\" he said. \"Any view, however, that events which led to the FTX collapse are tied to a weakness in the Bahamas legislative structure is not consistent with the facts.\"","He praised Bahamian authorities for acting quickly and decisively putting the Bahamas-based entity into liquidation ahead of the filing for Chapter 11 bankruptcy and securing assets worth around $3.5 billion at the time.&nbsp;","The Bahamas Attorney General Ryan Pinder said the country respected the rule of law.&nbsp;","\"We're very confident that the liquidation procedures, and the process underway in the Bahamas in the courts, supervised by the courts, will result in maximum benefit to the clients of FTX,\" Pinder said, adding that courts in the country will have final say over seized funds.&nbsp;","The new management of FTX in the U.S.<a href=\"https:\/\/www.theblock.co\/post\/221212\/ftx-sues-for-control-of-bahamas-assets-calls-ftx-digital-markets-a-front-to-defraud-customers\" data-v-f87c67ca=\"\"> is suing<\/a> the liquidators of the Bahamas entity, arguing that it wrongly claims to own the exchange. They want a declaratory judgment from the U.S. Bankruptcy Court for the District of Delaware that says the Bahamian entity has no ownership in any FTX debtor property.","Prime Minister Davis said the county was no stranger to large liquidations.","\"We've gone through it before,\" he said, adding he was disappointed with what some view as tension with the U.S. \"The ultimate aim of this is to see how we could make customers whole.\"","Pinder said that if <a href=\"https:\/\/www.theblock.co\/post\/227697\/scaramucci-ftx-skybridge\" data-v-f87c67ca=\"\">FTX were to restart<\/a>, the Bahamas would be the appropriate jurisdiction.&nbsp;","Davis said <a href=\"https:\/\/www.theblock.co\/post\/228350\/bahama-crypto-regulations-ftx\" data-v-f87c67ca=\"\">new amendments<\/a> and initiatives planned for the country's crypto regulation would keep the country an attractive destination the crypto sector, specifically when it comes to stablecoins, custody services and decentralized autonomous organizations. He noted that plans for the changes had been started before FTX collapsed.","\"The amendments will address a comprehensive range of digital asset activities and strengthen protection mechanisms for the registration and ongoing supervision of operators,\" he said. \"They represent an even greater focus on consumer and investor protection, robust risk management, as well as market development and innovation.\"","\"When it comes to the digital asset sector, we are open for business,\" he said. \"When you are looking for jurisdiction where you can confidently invest, look no further than the Bahamas.\"","Pinder said the crypto sector has not slowed down in the Bahamas and said there was a lot of enthusiasm about the new amendments. He said the collapse of FTX has had no impact on the country's GDP.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Delaware","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Austin","content":"LOCATION"},{"type":"Davis","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"Pinder","content":"PERSON"},{"type":"Philip Davis","content":"PERSON"},{"type":"Caribbean","content":"LOCATION"},{"type":"morning","content":"TIME"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bahamas","content":"LOCATION"},{"type":"$3.5 billion","content":"MONEY"},{"type":"Ryan Pinder","content":"PERSON"}],"hashtag":["FTX"],"authors":["Nathan Crooks","The Block"]}