{"summary":"Lightning Network development team Lightning Labs has raised a $10 million Series A led by Craft Ventures, with participation from Ribbit Capital, RRE Ventures, Slow Ventures, and others. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/54963\/lightning-labs-10-million-series-a-bitcoin-beta","publishDate":"2020-02-05T10:00:19","id":5705,"type":null,"title":"Lightning Labs raises $10M Series A, launches beta version of its first financial product","category":["STARTUPS"],"content":["<span data-v-f87c67ca=\"\">Lightning Network development team Lightning Labs has raised a $10 million Series A funding round led by Craft Ventures, with participation from Ribbit Capital, RRE Ventures, Slow Ventures, and others.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Along with the <a href=\"https:\/\/medium.com\/@lightning_labs\/entering-the-decade-of-lightning-8c4a4d31167f\" data-v-f87c67ca=\"\">funding round news<\/a>, the San Francisco-based startup also announced Wednesday the beta release of Lightning Loop, the firm's first financial product. <\/span><span data-v-f87c67ca=\"\">Over the past year, Lightning Labs focused on developing the Lightning Network implementation software (Lightning Network Daemon) and launched its mobile and desktop apps. Now, the firm is seeking to expand its user base with the Lightning Loop feature.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We are building a real business with real customers and real revenue, and we want to solve real problems for real users… We will be using the fund to hire more talent on the development and business side,” Lightning Labs CEO Elizabeth Stark told The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">First <\/span><a href=\"https:\/\/blog.lightning.engineering\/posts\/2019\/03\/20\/loop.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">launched<\/span><\/a><span data-v-f87c67ca=\"\"> in March 2019 in alpha, Lightning Loop is a non-custodial service that provides the on-and-off ramp for users to move funds between the Lightning Network – the layer 2 scaling solution built on the bitcoin blockchain – and the bitcoin network itself.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Currently, when users transact with each other through Lightning channels, the maximum amount of bitcoin they can send and receive is predetermined by the number of bitcoin they deposit into the channel when first setting it up. To transfer more than that amount, users have to open up a new channel.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Through <\/span><a href=\"https:\/\/github.com\/submarineswaps\/swaps-service\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Submarine Swaps<\/span><\/a><span data-v-f87c67ca=\"\">, a technique designed by the Lightning Labs to enable atomic on-chain to off0chain swaps, Lightning Loop allows users to move bitcoin out of their Lightning channels onto the bitcoin blockchain to free up channel space and receive more funds. Similarly, users can also refill their channels with onchain bitcoin from wallets or exchanges.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“There is this liquidity element to Lightning, where you have to have funds to be able to send or receive in the right place, so Loop is helping startups and companies to efficiently allocate their funds to Lighting,” said Stark.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Though still in its early phase, Lightning Loop has already attracted several adopters, including e-commerce startup Fold. In addition, there are around 30 startups that have integrated Lightning Labs’ software solution, according to a press statement shared with The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Services like Loop are essential to the growth of the Lightning Network, enabling builders to focus on bringing great lightning experiences to life without being slowed by the complexities of lightning node management,” Fold CEO Will Reeves told The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I view Lightning as a financial transaction and infrastructure platform,” Stark said, adding:<\/span>","“I really see Lightning as at the intersection of the financial world and the tech world.\"","<span data-v-f87c67ca=\"\">Lightning Loop is not the only financial product built on the Lightning Network. <\/span>","<span data-v-f87c67ca=\"\">Last week, Lightning Network wallet provider Zap <a href=\"https:\/\/twitter.com\/jackmallers\/status\/1222941238279708674?s=12\" data-v-f87c67ca=\"\">announced<\/a> Strike, a mobile application that lets users buy bitcoin with their debit and credit cards. <\/span>","<span data-v-f87c67ca=\"\">Another Lightning Network startup, OpenNode, provides an API for people to make online purchases with Lightning. <\/span>","<span data-v-f87c67ca=\"\">In addition, crypto-native firms such as <\/span><a href=\"https:\/\/www.bitfinex.com\/posts\/440\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitfinex<\/span><\/a><span data-v-f87c67ca=\"\">, BitMEX, Bistamp have expressed interest in Lightning.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to <a href=\"https:\/\/blog.bitmex.com\/lightning-network-part-7-proportion-of-public-vs-private-channels\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">BitMEX Research<\/a>, around 72% of the total L<\/span><span data-v-f87c67ca=\"\">ightning channels are public. Since there are roughly 36,000 public channels, some quick math gives that the Lightning Network today has around 50,000 channels in total, including both public and private.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"Bitfinex","content":"LOCATION"},{"type":"Craft Ventures","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Will Reeves","content":"PERSON"},{"type":"Slow Ventures","content":"ORGANIZATION"},{"type":"Elizabeth Stark","content":"PERSON"},{"type":"Lightning","content":"ORGANIZATION"},{"type":"72%","content":"PERCENT"},{"type":"Lightning","content":"LOCATION"},{"type":"Ribbit Capital","content":"ORGANIZATION"},{"type":"Lightning Loop","content":"LOCATION"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"March 2019","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Lightning Loop","content":"ORGANIZATION"},{"type":"BitMEX Research","content":"ORGANIZATION"},{"type":"Lightning Labs","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"},{"type":"Lightning Network Daemon)","content":"ORGANIZATION"}],"hashtag":[],"authors":["Celia Wan","The Block"]}