{"summary":"Ooki DAO members are discussing ways to raise funds for a possible legal defense of the lawsuit brought on by the CFTC.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173635\/ooki-dao-is-mulling-its-options-to-fight-back-against-the-cftc","publishDate":"2022-09-29T06:04:23","id":5707,"type":null,"title":"Ooki DAO is mulling its options to fight back against the CFTC","category":["GOVERNANCE"],"content":["The Ooki DAO has begun discussing within the community about how to respond to the <a href=\"https:\/\/www.theblock.co\/post\/172274\/cftc-files-lawsuit-against-decentralized-autonomous-organization\" data-v-f87c67ca=\"\">recent lawsuit<\/a> filed against the DAO by the US Commodity Futures Trading Commission (CFTC).","The CFTC’s lawsuit claims that Ooki DAO is an unincorporated association involved in unlawful activity, namely running an unlicensed exchange called bZx. The founders of the exchange recently settled with the regulator to the tune of $250,000. As part of the complaint against Ooki DAO, the CFTC says community members who participated in governance votes are liable for Ooki’s alleged wrongdoings.","DAO members are now <a href=\"https:\/\/forum.ooki.com\/t\/future-of-ooki-dao\/456\" data-v-f87c67ca=\"\">discussing<\/a> the appropriate response to the CFTC’s lawsuit. One of these responses involves allocating treasury funds towards legal counsel for DAO members.","The Ooki community is also mulling the idea of raising additional funds for a possible legal challenge of the CFTC’s complaint. One possible route proposed by the DAO member who initiated these discussions is to submit a grant proposal on Gitcoin to raise funds for the legal defense. The idea here is to elicit support from the broader DeFi and crypto community to support the Ooki DAO's legal fight. “Insofar as all DAOs have a stake in the outcome, broad community support of Ooki DAO’s legal defense is critical,” the forum post stated.","NFTs have also been identified as another possible fundraising route for the DAOs legal defense. The community is discussing the possibility of releasing an NFT collection to raise funds for the endeavor.","These discussions could lead to a possible vote on the matter. Early reactions within the community have so far been supportive of the motions raised in the forum post.","The CFTC’s lawsuit against Ooki DAO did <a href=\"https:\/\/www.theblock.co\/post\/172416\/whats-next-for-daos-breaking-down-the-cftcs-latest-enforcement-action\" data-v-f87c67ca=\"\">elicit strong reactions<\/a> from a cross-section of the crypto space. Many lawyers and commentators expressed concerns about the CFTC’s approach and the <a href=\"https:\/\/www.theblock.co\/post\/173171\/a-crypto-lawyer-dissects-the-impact-of-the-cftc-targeting-daos\" data-v-f87c67ca=\"\">possible negative implications<\/a> for DAOs and decentralized governance in general.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$250,000","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ooki DAO","content":"PERSON"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"US Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"Ooki DAO","content":"ORGANIZATION"}],"hashtag":["CFTC"],"authors":["Osato Avan-Nomayo","The Block"]}