{"summary":"Reddit’s cryptocurrency subreddit-token moons is moving toward full decentralization, with admins renouncing the contract and burning over 30% of the supply, according to an update by community moderators.\nMoons is a rewards token connected to Reddit’s Community Points program, with its price rising 240% since the announcement.","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262981\/reddit-admins-reduce-moons-supply-token-surges","publishDate":"2023-11-14T06:51:09","id":571,"type":null,"title":"Reddit admins set to reduce moons supply by over 30%, token surges 240%","category":["Token Projects"],"content":["Reddit admins are set to fully renounce control over the moons contract by the end of this month and burn over 30% of its total supply, with the r\/CryptoCurrency community token becoming “completely decentralized.”","Community moderators confirmed the renouncement in an <a href=\"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/17un84c\/update_regarding_moons_contract_community_tanks\/?rdt=60400\" data-v-f87c67ca=\"\">update<\/a> late yesterday, rendering the contract immutable and ensuring no new moons tokens can be created. This means the Reddit admins will send the contract to a burn address so that no one has control over it.","The Reddit admins will also burn around 34% of tokens held in the “Community Tank” under their control, reducing the total supply from around 126 million to 83 million, according to the post. All exchange listings for moons will remain intact and the token will continue to be traded by exchanges and wallets, the community moderators added.","The moderator team said it would work with the community to develop a plan for moons moving forward, including a way to distribute the remaining moons in the community wallet — potentially based on community contributions, tipping and contest participation. Additionally, they are working on technological enhancements to improve user experience and utility.","Moons is a rewards token connected to Reddit’s Community Points program, which it announced was sunsetting last month. Introduced in 2020, the program rewarded users for their activity on the platform, such as receiving significant upvotes on comments or posts. The points earned were Ethereum-compatible ERC-20 tokens stored in Reddit's crypto wallet, Reddit Vault, which could be spent on perks like emojis or badges. However, to address scalability issues and reduce transaction costs, the service <a href=\"https:\/\/www.theblock.co\/post\/162299\/reddits-community-points-are-migrating-to-arbitrum-nova\" data-v-f87c67ca=\"\">migrated<\/a> from Ethereum to Layer 2 Arbitrum Nova in August 2022.","The price of moons tokens surged 240% from $0.05 to $0.17 following the update before consolidating, according to CoinGecko data. Moons currently trades at $0.14.","Reddit’s r\/FortNiteBR <a href=\"https:\/\/www.coingecko.com\/en\/coins\/brick\" data-v-f87c67ca=\"\">bricks<\/a> token, another community reward token, gained around 85% during the same period and currently trades at $0.06.","On Oct. 17, Reddit <a href=\"https:\/\/www.theblock.co\/post\/258016\/reddit-plans-to-sunset-its-blockchain-based-reward-service-community-points\" data-v-f87c67ca=\"\">announced<\/a> it was pulling the plug on its blockchain-based reward service Community Points three years after its rollout.&nbsp;","\"We recently made the decision to sunset the Community Points beta, including Special Memberships, by Nov. 8. At that point, you'll also no longer see Points in your Reddit Vault nor earn any more Points in your communities. Though we saw some future opportunities for Community Points, there was no path to scale it broadly across the platform,\" Reddit <a href=\"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/17a33ql\/serious_sunsetting_community_points_beta_and\/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button\" data-v-f87c67ca=\"\">wrote<\/a> in a forum post at the time. The decision was also attributed to regulatory issues.&nbsp;","Two days later, on-chain data indicated that at least two moderators linked to Reddit’s cryptocurrency subreddit <a href=\"https:\/\/www.theblock.co\/post\/258476\/pair-of-reddit-mods-appear-to-have-sold-off-tokens-ahead-of-announcement-to-terminate-blockchain-based-program\" data-v-f87c67ca=\"\">liquidated<\/a> large amounts of moons tokens before Reddit publicly announced the end of its Community Points program.","\"Points were never intended to have any monetary value, and buying, selling and trading Points has always been a violation of our terms for the product,\" a spokesperson for Reddit told The Block in an email."],"hashtag":["ARBITRUM","ETHEREUM"]}