{"summary":"Stefan Chu, who ran the over-the-counter (OTC) trading desk at TPS Capital, has left the company.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/160586\/tps-capital-exec-departs-as-trading-firm-distances-itself-from-three-arrows","publishDate":"2022-08-02T03:36:54","id":571,"type":null,"title":"TPS Capital exec departs as trading firm distances itself from Three Arrows","category":["HIRING"],"content":["Stefan Chu, who ran the over-the-counter (OTC) desk at TPS Capital, has left the company as the trading firm distances itself from bankrupt crypto fund Three Arrows Capital.","Chu left TPS in late July, according to two people with knowledge of the situation, and he recently began describing himself as \"ex TPS\" on <a href=\"https:\/\/twitter.com\/realstefanchu\" data-v-f87c67ca=\"\">his Twitter profile<\/a>. Neither Chu nor TPS responded to requests for comment from The Block.","His departure comes a few weeks after TPS moved to distance itself from Three Arrows Capital (3AC), the hedge fund now in liquidation after failing to repay loans from an array of crypto institutions. In <a href=\"https:\/\/twitter.com\/TPSCapital\/status\/1544870918853459969?s=20&amp;t=F7eyz3vijrMYPA-ZJOMfJg\" data-v-f87c67ca=\"\">a statement<\/a> on July 7, TPS said it's an “independent legal entity and its operations are separate and distinct from those of 3AC.”","TPS further clarified that while 3AC was briefly a shareholder in the company, it ceased to be in early 2021. 3AC’s co-founders Su Zhu and Kyle Davies held an “indirect equity interest” in TPS, it said, but with no control over the company’s operations. According to the statement, the two firms’ cooperation primarily took the form of referring business to each other. TPS also acted as an intermediary, helping to coordinate loan agreements with lenders.","The Block’s reporting has shown that TPS staff described their employer as <a href=\"https:\/\/www.theblockcrypto.com\/news+\/155338\/inside-the-three-arrows-capital-money-machine\" data-v-f87c67ca=\"\">the OTC desk<\/a> of 3AC in emails to prospective clients.","Chu himself produced regular <a href=\"https:\/\/stefanc.substack.com\/p\/tps-capital-the-official-otc-desk-002\" data-v-f87c67ca=\"\">market research reports<\/a> since at least July 2021 under the title, \"State of the Blockchain Weekly Run.\" Versions of those reports published on the messaging app Telegram, that were reviewed by The Block, show him referring to TPS as “The Official OTC desk for Three Arrows Capital” in editions dated December 18 and January 15.","TPS bills itself as a proprietary trading firm, offering OTC, market making, trade facilitation and block trade services to crypto investors.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"TPS Capital","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"July 7","content":"DATE"},{"type":"Kyle Davies","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Stefan Chu","content":"PERSON"},{"type":"January 15","content":"DATE"},{"type":"July","content":"DATE"},{"type":"Su Zhu","content":"ORGANIZATION"},{"type":"July 2021","content":"DATE"},{"type":"December 18","content":"DATE"},{"type":"TPS","content":"ORGANIZATION"},{"type":"TPS","content":"LOCATION"}],"hashtag":["THREE ARROWS CAPITAL"],"authors":["Ryan Weeks","The Block"]}