{"summary":"The streaming giant is trialing NFT promotions but won&#x27;t be selling NFTs directly on its platform.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/147064\/spotify-starts-trialing-nfts-on-its-platform-music-ally-reports","publishDate":"2022-05-16T08:36:32","id":5724,"type":null,"title":"Spotify starts trialing NFTs on its platform, Music Ally reports","category":["NFTS"],"content":["Artists may soon be able to promote their non-fungible tokens (NFTs) on Spotify if a trial rollout goes well, Music Ally <a href=\"https:\/\/musically.com\/2022\/05\/13\/spotify-artists-promote-nfts\/\" data-v-f87c67ca=\"\">reported<\/a> on Friday.","The latest tech company to jump on the NFT bandwagon, Spotify waded into the web3 world earlier this month with the May 3 launch of <a href=\"https:\/\/newsroom.spotify.com\/2022-05-03\/spotify-island-brings-new-experiences-for-fans-and-artists-to-roblox\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">\"Spotify Island\"<\/a> on Roblox. Starting with a single pilot group of artists, among them Steve Aoki and The Wombats, Spotify will now test NFTs on the platform to specially selected users based in the US.","They will not sell NFTs directly, however, as users will need to tap through to an external marketplace to make purchases. Spotify has said it will not take a cut of the sales as part of the test.","At the same time, users have reported that Spotify is also sending out surveys and even offering some people compensation for chats with team members about users' attitudes toward NFTs and web3. Questions, which have been shared on Twitter, include asking about sentiment, crypto-related purchases and why people bought NFTs. The questions were met with derision by some posters.","Rumors that Spotify was interested in entering web3 have been circulating since March when the company posted two job ads for working with early-stage web3 projects. The latest news comes just days after Meta <a href=\"https:\/\/www.theblockcrypto.com\/linked\/145758\/meta-to-start-testing-digital-collectibles-on-instagram\" data-v-f87c67ca=\"\">announced<\/a> it too would start testing digital collectibles and NFTs on Instagram.","Spotify did not respond to a request for comment from The Block by the time of publishing.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"May 3","content":"DATE"},{"type":"Spotify","content":"ORGANIZATION"},{"type":"Spotify Island","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Spotify","content":"PERSON"},{"type":"Music Ally","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Steve Aoki","content":"PERSON"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}