{"summary":"Bitcoin miner CleanSpark purchased 1,061 rigs at a “substantially discounted price,” after announcing another large order just last month.\nCEO Zach Bradford described the current market as an “incredible market for builders.”","author":["Catarina Moura","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157567\/cleanspark-doubles-down-on-discounted-bitcoin-mining-rigs","publishDate":"2022-07-14T12:21:57","id":573,"type":null,"title":"CleanSpark doubles down on discounted bitcoin mining rigs","category":["Mining"],"content":["Bitcoin miner CleanSpark has acquired 1,061 rigs at a time when market prices are down.","The company added 1,061 Whatsminer M30S machines to its fleet, increasing its total hash rate by 93 petahashes per second (PH\/s), according to a statement released Thursday.","As of June 30, CleanSpark had a total hash rate of 2.8 EH\/s, which indicates the new machines represent roughly a 3% increase.","\"We are seeing unprecedented opportunities in this market,\" said Zach Bradford, CEO of CleanSpark. \"We believe that our operational strategy focused on efficiency, up-time and execution will allow these metrics to continually improve.”","Last month, the company also announced that it has <a href=\"https:\/\/www.theblock.co\/post\/152216\/capitalizing-on-buyers-market-cleanspark-acquires-1800-bitcoin-miners\" data-v-f87c67ca=\"\">bought 1,800 Antminer<\/a><br data-v-f87c67ca=\"\">\nS19 XP bitcoin mining machines, at a total of 252 (PH\/s).","CleanSpark said this week that the new machines were purchased at a \"substantially discounted price compared to the spot market price from just a few months ago.\"","Bradford described the current market as an \"incredible market for builders.\"","According to a recent operational update, CleanSpark <a href=\"https:\/\/www.theblock.co\/post\/156056\/cleanspark-sold-nearly-all-339-bitcoin-it-mined-in-june\" data-v-f87c67ca=\"\">increased its bitcoin production in June<\/a> by almost 9% compared with the previous month, mining a total of 339 BTC.","The company sold almost all of it, bringing in around $8.4 million from the sale of 328 bitcoin."],"hashtag":[]}