{"summary":"Circle is opening up the doors to its new stablecoin platform for businesses after months of downsizing. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/58284\/circle-announces-launch-of-apis-for-businesses-usdc","publishDate":"2020-03-10T11:44:35","id":5730,"type":null,"title":"Circle announces launch of APIs for businesses to adopt USDC stablecoin","category":["STARTUPS"],"content":["Circle is opening up the doors of its new stablecoin platform to businesses.","The company announced Tuesday that business clients can now sign up for the Circle Business Account, a toolbox of APIs that allow developers to build on top of USDC – the stablecoin it founded alongside Coinbase in 2018 via the CENTRE consortium. The move is the latest development in Circle's shift from a business primarily built around trading and investing to one focused on the adoption and use of stablecoins.&nbsp;","Indeed, Circle has found new homes for many of its past business units. This list includes Poloniex, which Circle spun out less than two years after purchased it for <a href=\"https:\/\/www.coindesk.com\/circle-to-spin-out-poloniex-exchange-less-than-2-years-after-400-million-takeover\" data-v-f87c67ca=\"\">$400 million<\/a> (which is about the market-cap of USDC). It also sold the remnants of its over-the-counter trading desks to Kraken and is in the process of selling SeedInvest, CEO Jeremy Allaire said in an interview with The Block.&nbsp;","As for the launch of the new business account, Allaire said the offering would allow companies to more easily connect their traditional banking infrastructure to \"upload their dollars to the internet and have the benefits of digital dollars.\"","Allaire said financial technology companies are one target client-based.&nbsp;","\"With Circle's APIs, any fintech company that wants to integrate USDC and have the ability to store it and custody it and build it into a product will be able to do that.\"","Put simply, an API – or application program interface – is a set of tools that determine how different software components can interact.&nbsp;","To start, Circle is offering three APIs, including one for payments that would allow companies to accept card payments that can then settle into USDC. The firm plans to roll out more APIs over the coming weeks.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jeremy Allaire","content":"PERSON"},{"type":"Circle Business Account","content":"ORGANIZATION"},{"type":"Allaire","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Circle","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$400 million","content":"MONEY"},{"type":"2018","content":"DATE"}],"hashtag":["USDC"],"authors":["Frank Chaparro","The Block"]}