{"summary":"The first airdrop will contain 10% of the total token supply, with two additional airdrops of 9% happening in the coming years. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277644\/crypto-casino-shuffle-targets-token-airdrop-for-first-week-of-march","publishDate":"2024-02-15T12:08:25","id":5738,"type":null,"title":"Crypto casino Shuffle targets token airdrop for first week of March","category":["COMPANIES"],"content":["Crypto casino and sports betting platform Shuffle intends to airdrop its SHFL token&nbsp;within the coming weeks.&nbsp;&nbsp;","The Block confirmed that the platform is targeting the first week of March for SHFL's token generation event and airdrop, which will happen on the same day.","Earlier today, the platform announced its tokenomics structure and airdrop plans in an official <a href=\"https:\/\/shfl.shuffle.com\/\" data-v-f87c67ca=\"\">whitepaper<\/a>. Shuffle will give out 28% of its total token supply across three airdrops in the next few years, with the first airdrop giving out the largest chunk at 10%.","Five percent of SHFL will go to the platform's liquidity bootstrapping pool. \"This LBP will be used to create the initial liquidity for SHFL on-chain,\" Shuffle explained in the whitepaper. \"The USDC raised from the LBP will be used to seed the initial liquidity for the SHFL-USDC Pool, which will be live after the completion of the LBP.\"","An additional 2% will go to liquidity mining programs, 8.8% to early contributors, 25% to the team and 31.2% to Shuffle's treasury.","SHFL's maximum and total token supply will cap at 1 billion, with an initial circulating supply of 71,126,984 SHFL.&nbsp;","Shuffle users can use SHFL, an ERC-20 token, as a wager asset and a way to access perks, with the token having a buyback-and-burn mechanism. The platform has seen 35,000 users places 2.8 billion bets since its launch on Feb. 1, 2023.","<em data-v-f87c67ca=\"\">(Corrects LBP structure.)<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"2%","content":"PERCENT"},{"type":"1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"31.2%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"28%","content":"PERCENT"},{"type":"Shuffle","content":"ORGANIZATION"},{"type":"SHFL","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Feb. 1, 2023","content":"DATE"},{"type":"8.8%","content":"PERCENT"},{"type":"LBP","content":"ORGANIZATION"}],"hashtag":["TOKENIZATION"],"authors":["MK Manoylov","The Block"]}