{"summary":"Russia&#x27;s Sberbank has conducted the first digital financial asset transaction on its own blockchain-based platform","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156748\/sberbank-first-digital-asset-transaction-blockchain","publishDate":"2022-07-09T09:22:34","id":5739,"type":null,"title":"Russia&#x27;s biggest bank executes first digital asset transaction on its blockchain platform","category":["CAPITAL MARKETS"],"content":["Sberbank, the largest bank in Russia and majority-owned by the government, has conducted the first digital financial asset transaction on its own blockchain-based platform.","Announcing the news today, Sberbank <a href=\"https:\/\/press.sber.ru\/publications\/sber-provel-pervuiu-sdelku-po-vypusku-tsfa-na-sobstvennoi-platforme\" data-v-f87c67ca=\"\">said<\/a> it had launched the smart contract-based blockchain platform and carried out the first transaction with its subsidiary, SberFactoring, executing a 1 billion rouble (about $15 million) issue with a three-month maturity.","\"The launch of the platform and our obtaining the status of an operator is the result of the teamwork of many divisions of our bank in close cooperation with the Bank of Russia,\" Anatoly Popov, deputy chairman of the board of Sberbank, said in the announcement.","Popov went on to say that the research conducted by Sberbank's blockchain laboratory, which was initially <a href=\"https:\/\/www.sberbank.com\/news-and-media\/press-releases\/article?newsID=7fb6c222-a431-431c-bdb2-fe9390d514a3&amp;blockID=7&amp;regionID=77&amp;lang=en&amp;type=NEWS\" data-v-f87c67ca=\"\">launched i<\/a>n 2018, is now being translated into industrial business solutions. \"We believe that our <a href=\"https:\/\/www.theblock.co\/linked\/91980\/russia-sberbank-blockchain-approval-central-bank\" data-v-f87c67ca=\"\">platform<\/a> has good prospects, since the digital format significantly speeds up and simplifies the process of issuing financial instruments and lowers the threshold for entering the market,\" he said.","Sberbank's blockchain platform is operating in pilot mode for a limited number of users, but soon all corporate clients of the bank will be able to connect to it.","Looking forward, the bank also plans to launch more types of financial assets on its platform.","Last month, Russia's second-biggest bank, VTB's subsidiary VTB Factoring, executed its first cash-backed digital financial asset transaction in partnership with the fintech company Lighthouse.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"1 billion","content":"MONEY"},{"type":"$15 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Russia","content":"LOCATION"},{"type":"today","content":"DATE"},{"type":"Anatoly Popov","content":"PERSON"},{"type":"VTB","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Bank of Russia","content":"ORGANIZATION"},{"type":"Sberbank","content":"ORGANIZATION"}],"hashtag":["TOKENIZATION"],"authors":["Yogita Khatri","The Block"]}