{"summary":"Selected applicants will gain Magic Eden&#x27;s mentorship, marketing assistance, tech support and grant dollars. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246054\/magic-eden-launches-1-million-fund-to-foster-blue-chip-polygon-nft-collections","publishDate":"2023-08-17T14:33:13","id":5740,"type":null,"title":"Magic Eden launches $1 million fund to foster Polygon NFT collections","category":["NFT MARKETPLACES"],"content":["Solana's premiere marketplace Magic Eden has launched a $1 million fund for creators building on the Polygon blockchain.&nbsp;","Users may apply to win funding for their Polygon-based web3 project, and selected parties will gain Magic Eden's mentorship, marketing assistance, tech support and grant dollars to bring their project to market, Magic Eden wrote in a <a href=\"https:\/\/magic-eden-creator-fund.simple.ink\/\" data-v-f87c67ca=\"\">statement<\/a>. The goal is to help bolster a blue-chip NFT presence on Polygon, a blockchain best known for web3 gaming.&nbsp;","\"The bear market has been rough for everyone,\" Magic Eden wrote. \"That’s why we’re encouraging builders in the ecosystem to find and support the best and brightest project founders who will spark the next wave of NFT adoption.\"","Projects are selected based on uniqueness, scalability and the ability to \"challenge the status quote of the NFT landscape.\"&nbsp;","Though originally founded on Solana, Magic Eden made major moves within the last year to build more of a presence on Polygon.","Magic Eden first added Polygon NFT <a href=\"https:\/\/www.theblock.co\/post\/189035\/magic-eden-expands-nft-support-to-polygon-network-embargo-9-am-et\" data-v-f87c67ca=\"\">support<\/a> in November of 2022 before <a href=\"https:\/\/www.theblock.co\/post\/195404\/magic-eden-bolsters-gaming-support-by-adding-polygon-nft-minting-and-trading\" data-v-f87c67ca=\"\">adding<\/a> Polygon NFT minting and trading capabilities for gaming a month later.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Polygon NFT","content":"ORGANIZATION"},{"type":"Solana","content":"LOCATION"},{"type":"Magic Eden","content":"ORGANIZATION"},{"type":"November of 2022","content":"DATE"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}