{"summary":"Binance, the world’s largest cryptocurrency exchange by trading volumes, has acquired Indian cryptocurrency exchange WazirX to serve over 1 billion people","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/47852\/binance-acquires-indian-crypto-exchange-wazirx-to-serve-over-1-billion-people-of-the-country","publishDate":"2019-11-21T00:20:14","id":5743,"type":null,"title":"Binance acquires Indian crypto exchange WazirX to serve over 1 billion people of the country","category":["EXCHANGES"],"content":["Binance, the world’s largest cryptocurrency exchange by trading volumes, has acquired Indian cryptocurrency exchange WazirX to serve over 1 billion people of the country.","Announced Thursday, the acquisition will allow Indians to buy and sell cryptocurrencies with local fiat currency Indian rupees (INR), starting Nov. 25.","WazirX CEO Nischal Shetty told The Block that Binance now owns 100% of WazirX, but did not disclose the price details due to a non-disclosure agreement. The price is <a href=\"https:\/\/economictimes.indiatimes.com\/small-biz\/startups\/newsbuzz\/binance-acquires-mumbais-bitcoin-exchange-wazirx\/articleshow\/72152901.cms\" data-v-f87c67ca=\"\">reportedly<\/a> in the range of $5-$10 million.","Shetty added that all 20 members of WazirX will now be employed by Binance, but the former will continue to run independently and focus on its mission “to involve every Indian in the crypto revolution.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe acquisition will add an additional <a href=\"https:\/\/www.theblockcrypto.com\/linked\/47263\/binance-adds-support-for-turkish-lira-for-direct-crypto-purchases\" data-v-f87c67ca=\"\">fiat-to-crypto gateway<\/a> for Binance. \"Fiat ramps play a critical role in deciding the size &amp; adoption of cryptomarket. Binance has all the major traders in the world and WazirX has tried and tested technology for next-generation peer to peer exchange, together we can drive mass adoption across the globe by solving fiat ramps,\" said Siddharth Menon, COO of WazirX.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">Plans ahead&nbsp;<\/strong><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIn Q1 of 2020, Binance will also integrate WazirX’s peer-to-peer auto-matching engine into its fiat gateway platform to bring easy cryptocurrency access to the Indian population. The integration will allow users to purchase Tether (USDT) stablecoin against INR from WazirX and then trade USDT against any cryptocurrency available on Binance.com, per the announcement.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“The next phase of mass adoption for Crypto will arise from developing nations around the world. India with more than a billion people is primed for massive crypto adoption and this acquisition by Binance gives us the opportunity to not only cater to India but every developing nation where fiat on-ramps have to be built,” said Shetty. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBinance CEO Changpeng \"CZ\" Zhao echoed: \"The young demographic in India give an edge to adopt and build on new financial technologies, and I believe this [acquistion] will play a vital role in making India a global blockchain innovation centre to also spur cryptocurrency adoption throughout the larger public in the country.\"","Founded in March 2018, WazirX has seen substantial growth in trading volumes and adoption. “We do about $30 million in monthly trading volume currently and are a top-rated mobile app in India with an average rating of 4.4 and more than 200,000 app downloads,” Shetty told The Block.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nWazirX is also planning to hold a token sale of its native coin WRX, which is currently available to users through trade mining and signups. Shetty told The Block that WRX is a \"utility token\" and some 64,000 users currently hold the token.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">Indian crypto scene&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/strong>The acquisition comes amid regulatory uncertainty of cryptocurrencies in India. In April 2018, the Reserve Bank of India (RBI), the country’s central bank, <a href=\"https:\/\/www.rbi.org.in\/Scripts\/BS_PressReleaseDisplay.aspx?prid=43574\" data-v-f87c67ca=\"\">barred<\/a> banks from serving cryptocurrency exchanges and firms. Since then, several exchanges have filed legal petitions to reverse the RBI ban, but the matter is still pending in the supreme court of India. The <a href=\"https:\/\/twitter.com\/cryptokanoon\/status\/1196359356326924295?s=20\" data-v-f87c67ca=\"\">next hearing<\/a> is scheduled in January.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe regulatory uncertainty forced several exchanges to <a href=\"https:\/\/www.theblockcrypto.com\/post\/47852\/binance-acquires-indian-crypto-exchange-wazirx-to-serve-over-1-billion-people-of-the-country\" data-v-f87c67ca=\"\">shut shop<\/a>, including Koinex, Coindelta, Coinome and Zebpay.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe Indian government also recently <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/indias-draft-bill-proposes-a-10-year-jail-sentence-for-using-cryptocurrencies\/\" data-v-f87c67ca=\"\">proposed<\/a> a draft bill banning cryptocurrency trading as well as suggesting a 10-year jail sentence for using cryptocurrencies. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBut Shetty is hopeful that the situation in India will improve. He told The Block: \"I've been running #IndiaWantsCrypto campaign on Twitter for over a year and will continue to do that. It's been getting a lot of attention in the crypto ecosystem. We've also been meeting Members of Parliament and will continue to do so. Binance will further help us since they have experience dealing with regulators globally.\"<strong data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/strong>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"the Reserve Bank of India","content":"ORGANIZATION"},{"type":"Crypto","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Nischal Shetty","content":"PERSON"},{"type":"$30 million","content":"MONEY"},{"type":"Siddharth Menon","content":"PERSON"},{"type":"$5","content":"MONEY"},{"type":"100%","content":"PERCENT"},{"type":"Shetty","content":"PERSON"},{"type":"” Shetty","content":"PERSON"},{"type":"March 2018","content":"DATE"},{"type":"Members of Parliament","content":"ORGANIZATION"},{"type":"India","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"Nov. 25","content":"DATE"},{"type":"Fiat","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"$10 million","content":"MONEY"},{"type":"Binance","content":"ORGANIZATION"},{"type":"April 2018","content":"DATE"}],"hashtag":["BINANCE","CZ"],"authors":["Yogita Khatri","The Block"]}