{"summary":"The bulk of this latest rally has been fueled by institutional players, as evidenced by the recent peak in open interest.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266075\/are-we-early-bitcoin-rally","publishDate":"2023-12-05T16:24:12","id":5745,"type":null,"title":"Latest rally has all of crypto wondering if it&#x27;s still early to the party","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Are we early?<\/span>","<span data-v-f87c67ca=\"\">It's a question that participants in the crypto market ponder during each cycle, as each cycle brings its own indicators signaling the end. I think the biggest top signal to me personally was when I was at a barbershop in Los Angeles and one barber was explaining why he was moving all of his coins from Coinbase to an exchange I had never heard of.<\/span>","<span data-v-f87c67ca=\"\"> Indeed, rumblings of crypto in the regular world always seems like a good indication of market froth. Right now, crypto seems like much of an <\/span>afterthought to regular people, and as my friend Jim Greco put it in a recent text, this latest rally has so far made little noise.&nbsp;","\"If you weren't in crypto, you wouldn't know bitcoin hit $41k.\"","Retail still seems far from as interested as they were at the last peak top. And the data points to this. Coinbase ranking in the App Store, which is The Block's Steven Zheng's favorite top indicator, has been basically flat since September.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/alternative-crypto-metrics\/app-usage\/crypto-apps-ranking-on-the-app-store-in-the-us\/embed\" title=\"Crypto Apps Ranking on the App Store in the US\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Sure you might counter that volumes have increased, but only slightly. The daily exchange volume seven day moving average stood at $27 billion on Dec. 4, which is below the year's high of $47 billion. Meanwhile, bitcoin has appreciated by 153%.&nbsp;","It appears that the bulk of this latest rally has been fueled by institutional players, as evidenced by the recent peak in open interest held by significant stakeholders in CME Bitcoin futures during the week of Nov. 11. Furthermore, both October and November recorded the highest volumes of the year in CME's bitcoin options market.","Even within the institutional realm, it still seems early to me.","The market structure of crypto is fragmented, primarily due to the fallout of the 2021 credit crisis that led to the downfall of numerous lending and trading market participants. Even for the largest hedge funds managing tens of billions in capital, there's a scarcity of counterparties they feel at ease transacting with. The actual initiation of substantial institutional involvement will likely occur when a more robust market structure is established.","<strong data-v-03de5780=\"\" data-v-f87c67ca=\"\"><em data-v-03de5780=\"\" data-v-f87c67ca=\"\">This first appeared in Frank Chaparro's biweekly The Scoop Newsletter.&nbsp;<a href=\"https:\/\/www.theblock.co\/newsletters\/\" target=\"_blank\" rel=\"noopener\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">Sign up<\/a>&nbsp;now.&nbsp;<\/em><\/strong>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Los Angeles","content":"LOCATION"},{"type":"Steven Zheng","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$47 billion","content":"MONEY"},{"type":"November","content":"DATE"},{"type":"Dec. 4","content":"DATE"},{"type":"153%","content":"PERCENT"},{"type":"September","content":"DATE"},{"type":"$27 billion","content":"MONEY"},{"type":"CME Bitcoin","content":"LOCATION"},{"type":"Nov. 11","content":"DATE"},{"type":"October","content":"DATE"},{"type":"CME","content":"ORGANIZATION"},{"type":"Jim Greco","content":"PERSON"},{"type":"$41k","content":"MONEY"},{"type":"Frank Chaparro","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}