{"summary":"Polygon ID will help applications verify user information while also preserving on-chain privacy.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/139735\/polygon-unveils-identity-service-leveraging-zero-knowledge-proofs","publishDate":"2022-03-29T10:55:05","id":5749,"type":null,"title":"Polygon unveils identity service leveraging zero-knowledge proofs","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Polygon, a popular sidechain on Ethereum, has unveiled a new user identification service that gives blockchain-based applications the ability to check a person's credentials without revealing their personal data. The solution is still under development and estimated to launch in 2023.<\/span>","The service, called Polygon ID, will help in verifying users’ information while preserving their on-chain privacy. Using Polygon ID, applications running on the blockchain will be able authenticate user data while keeping sensitive information private, the development team working on Polygon announced today.","To make this work, Polygon will leverage <a href=\"https:\/\/docs.iden3.io\/\" data-v-f87c67ca=\"\">iden3<\/a>, a decentralized identity protocol that uses zero-knowledge proofs — a cryptographic technology that can verify data that remains encrypted and hidden from the verifying party.&nbsp;","Polygon said its ID solution will find use in blockchain-related Know Your Customer (KYC) checks needed in certain regulated activities as well as custom applications. Even though crypto addresses are anonymous in themselves, the team has outlined the need for its ID. A spokesperson explained that addresses themselves cannot store user data.","\"Blockchain addresses tell you nothing about the person behind it. An address does not have KYC attached with it. Polygon ID takes real world credentials and makes details private via zero-knowledge proof. It’s about the user data that we can associate with the identity,\" a Polygon spokesperson told The Block.","<span data-v-f87c67ca=\"\">As such, Polygon hopes its ID offering will aid in on-chain verification and eliminate the need for relying on centralized parties for user verification. The product will work with Polygon’s cryptocurrency wallet offering, the team said in its announcement.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"KYC","content":"ORGANIZATION"},{"type":"Polygon","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}