{"summary":"Apple has warned the Nostr-based decentralized social media app Damus that it will remove the app from its platform if it doesn&#x27;t comply.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234392\/apple-damus-app-removal-warning","publishDate":"2023-06-13T05:47:01","id":5750,"type":null,"title":"Apple will remove Damus app unless it drops Bitcoin tipping feature","category":["COMPANIES"],"content":["Apple has warned the creators of the decentralized social media app Damus that it will remove the app from its platform if it doesn't issue an update to stay compliant with its policies.","\"To ensure there is no interruption of the availability of your app on the App Store, please submit an update within 14 days of the date of this message,\" Apple told Damus, according to a <a href=\"https:\/\/twitter.com\/damusapp\/status\/1668529709867495424\" data-v-f87c67ca=\"\">tweet<\/a> by the project today. \"If we do not receive an update compliant with the App Store Review Guidelines within 14 days, your app will be removed from sale.\"","The warning concerns Damus's \"zaps\" feature, which allows users to earn bitcoin on posts. \"The simplest way to think about Zaps is that they are simply tips. Tips which are transmitted over the Lightning network at the speed of light with basically no transaction fees,\" according to the <a href=\"https:\/\/nostr.how\/en\/zaps\" data-v-f87c67ca=\"\">Nostr<\/a> protocol, on which Damus is based.","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Damus <\/span><a class=\"editor-rtfLink\" href=\"https:\/\/twitter.com\/jack\/status\/1604138310036852736?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1604138310036852736%7Ctwgr%5Efa9b7d398d6b1010c56af41cf272d393158bc7bf%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fpublish.twitter.com%2F%3Fquery%3Dhttps3A2F2Ftwitter.com2Fjack2Fstatus2F1604138310036852736widget%3DTweet\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">integrated<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;a Layer 2 Lighting Network widget to make bitcoin payments and tips directly on the platform.<\/span>","\"We noticed that your app allows users to send 'tips' associated with receiving content from digital content creators with a mechanism other than in-app purchase,\" Apple said. \"Although tips or donations may be optional, if they are connected to or associated with receiving digital content, they must use in-app purchase in accordance with guideline 3.1.1.\"","Damus core developer William Casarin told The Block that the zaps feature will have to be removed to stay on the App Store, \"which we will likely do,\" but the app \"will be removed in its current form if we don't.\"","Damus <a href=\"https:\/\/twitter.com\/damusapp\/status\/1668537198004543490?s=20\" data-v-f87c67ca=\"\">said<\/a> it doesn’t sell any digital goods or provide features for selling digital goods. \"It simply has a tip button for facilitating p2p [peer-to-peer] transactions like Venmo or CashApp,\" it added.","If Apple removes the Damus app, it will be \"a dead platform for bitcoin applications trying to innovate on lightning,\" Damus said.","Nostr-based Damus was <a href=\"https:\/\/www.theblock.co\/post\/207448\/nostr-based-decentralized-twitter-alternative-damus-goes-live-on-apple-app-store\" data-v-f87c67ca=\"\">launched<\/a> in February as \"the social network you control.\" Nostr is a decentralized social network protocol backed by former Twitter CEO Jack Dorsey.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Apple","content":"ORGANIZATION"},{"type":"App Store Review Guidelines","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"William Casarin","content":"PERSON"},{"type":"Damus","content":"PERSON"},{"type":"Damus","content":"ORGANIZATION"},{"type":"Jack Dorsey","content":"PERSON"}],"hashtag":["DECENTRALIZED INFRASTRUCTURE","SOCIAL MEDIA"],"authors":["Yogita Khatri","The Block"]}