{"summary":"Lens Protocol, has released version 2 of its platform, incorporating the ERC-6551 token standard and enhanced smart contract functionality.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239858\/lens-protocol-version-2-open-actions-erc-6551","publishDate":"2023-07-17T05:30:57","id":5752,"type":null,"title":"Lens Protocol introduces version 2, integrating &#x27;Open Actions&#x27; and ERC-6551","category":["METAVERSE & NFT"],"content":["The decentralized social graph project, Lens Protocol, has introduces code for version 2 of its platform, incorporating enhanced external smart contract functionality called \"Open Actions\" and the ERC-6551 token standard.","The main change brought with the second version of Lens is \"Open Actions,\" a feature that enables the execution of any external smart contract action directly from Lens’ content posts. For example, with this feature, users can mint non-fungible tokens (NFTs) on an OpenSea contract directly from Lens' published content.","“By plugging into any web3 social application and supporting two-way integrations, Lens Open Actions extends the composability and modularity of Lens itself,” the team said in a statement.","Lens Protocol’s new version will also integrate the platform with the <a href=\"https:\/\/eips.ethereum.org\/EIPS\/eip-6551\" data-v-f87c67ca=\"\">ERC-6551 token<\/a> standard, thereby allowing NFTs' ownership to be attached to other assets and interact with applications.","In this new framework, NFTs' ownership can be assigned to profiles instead of their owner’s address, thereby granting them the capability for advanced integrations. For instance, a virtual land in the metaverse can now be programmed to own its Lens profile and interact with its land users.","Launched on Polygon in May 2022, Lens Protocol is a decentralized social graph used to construct social media platforms. It facilitates the storage of social media activity via NFTs and on-chain data.","In June, Lens Protocol announced a <a href=\"https:\/\/www.theblock.co\/post\/233746\/lens-protocol-raise-decentralized-social-media\" data-v-f87c67ca=\"\">$15 million<\/a> funding round led by IDEO CoLab Ventures. The team is also working on a blockchain scaling solution named <a href=\"https:\/\/www.theblock.co\/post\/228380\/lens-protocol-bonsai-scaling-solution\" data-v-f87c67ca=\"\">Momoka<\/a>, which is designed to store social media transaction data off-chain while verifying them on-chain.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lens Protocol","content":"ORGANIZATION"},{"type":"IDEO CoLab Ventures","content":"ORGANIZATION"},{"type":"May 2022","content":"DATE"},{"type":"June","content":"DATE"},{"type":"$15 million","content":"MONEY"},{"type":"Momoka","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"6551","content":"DATE"}],"hashtag":["AAVE"],"authors":["Vishal Chawla","The Block"]}