{"summary":"Bringing shielded voting should bring improvements in governance incentives, according to Snapshot.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/158084\/snapshot-to-let-daos-hide-votes-with-threshold-encryption","publishDate":"2022-07-18T10:27:04","id":5758,"type":null,"title":"Snapshot to let DAOs hide votes with threshold encryption","category":["TECHNOLOGY"],"content":["<span data-v-f87c67ca=\"\">Decentralized voting platform Snapshot will soon introduce shielded voting, a privacy-preserving feature that will enable decentralized autonomous organizations (DAOs) to encrypt individual votes when a governance vote is still going on.&nbsp;<\/span>","If a particular vote has not concluded, shielded voting will fully hide the distribution of already-cast votes. Once the voting is finalized, all votes will be revealed, along with their respective addresses as well as automatic calculation of results.","<span data-v-f87c67ca=\"\">Snapshot's shielded voting uses a cryptographic solution that leverages threshold encryption, and was developed in partnership with Shutter Network.<\/span>","<span data-v-f87c67ca=\"\"><a href=\"https:\/\/snapshot.org\/#\/\" data-v-f87c67ca=\"\">Snapshot<\/a> is one of the most widely-used governance tools among crypto projects. <\/span><span data-v-f87c67ca=\"\">The off-chain voting system is used by hundreds of DAOs to democratically make decisions on topics such as roadmap and <a href=\"https:\/\/www.theblock.co\/post\/150847\/frax-co-founders-propose-spending-20-million-to-buyback-fxs-token\" data-v-f87c67ca=\"\">treasury spending<\/a> via multiple-choice or a simple \"yes or no\" voting scheme.<\/span>","<span data-v-f87c67ca=\"\">Whenever there is a governance <a href=\"https:\/\/www.theblock.co\/post\/152690\/decentraland-dao-votes-to-give-decentral-games-1-million-grant\" data-v-f87c67ca=\"\">vote<\/a> on Snapshot, anyone can check data on who is voting and for which voting option. While this is great for transparency, providing information on already-cast votes can inadvertently influence behavior of the remaining voters.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In rare cases, the voting information can also be abused towards undesirable actions from stakeholders, such as vote collusion or vote buying to sway governance decisions. Having the votes shielded can prevent such situations, according to Snapshot.<\/span>","<span data-v-f87c67ca=\"\">\"Everyone should be on the same information level when they vote. That's how we do it for real elections as well,\" Nathan van der Heyden, ecosystem lead at Snapshot told The Block. \"Due to the state of a certain vote, voters might be inclined to change their behavior. Knowing how others voted has an influence on our own voting behavior.\"&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Any DAO using Snapshot will be able to enable shielded voting in their admin view. The feature is currently at the end of its closed beta and will be released this week for everyone to test.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Shutter Network","content":"ORGANIZATION"},{"type":"Nathan van der Heyden","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"}],"hashtag":["DAOS"],"authors":["Vishal Chawla","The Block"]}