{"summary":"Should the SEC reject spot bitcoin ETF applications, it may face legal action from applicants, according to JPMorgan.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/259616\/jpmorgan-bitcoin-etf-sec-lawsuits","publishDate":"2023-10-26T08:54:57","id":576,"type":null,"title":"JPMorgan says an SEC rejection of spot bitcoin ETFs could lead to lawsuits","category":["Finance firms"],"content":["<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Should the United States Securities and Exchange Commission decline approval for spot bitcoin exchange-traded fund applications, it may face legal action from applicants, according to JPMorgan. <\/span><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"Any rejection could trigger lawsuits against SEC creating more legal troubles for the agency,\" JPMorgan analysts led by Nikolaos Panigirtzoglou wrote in a report on Wednesday. <\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Although any such rejection is unlikely, \"it is possible,\" Panigirtzoglou told The Block. <\/span><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"We believe that a new legal battle on the issue of spot bitcoin ETF approval is not something that the SEC would be willing to face again,\" he said.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Last month, the SEC lost in a case brought against it by Grayscale Investments after a court ruling in favor of the crypto asset manager. The SEC did not appeal, and the ruling was <a href=\"https:\/\/www.theblock.co\/post\/258767\/us-court-confirms-grayscale-ruling-says-sec-must-re-review-bid-for-spot-bitcoin-etf\" data-v-f87c67ca=\"\">formalized<\/a> earlier this week — mandating the SEC to reconsider the application from Grayscale to convert its bitcoin trust into a spot bitcoin ETF.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">JPMorgan expects multiple spot bitcoin ETF approvals to come \"within months,\" it <a href=\"https:\/\/www.theblock.co\/post\/258453\/jpmorgan-bitcoin-etf-approval-within-months\" data-v-f87c67ca=\"\">said<\/a> last week. Today, it said that asset managers appear to be making progress with the SEC with <a href=\"https:\/\/www.theblock.co\/post\/259309\/bitcoin-rises-back-above-34000-as-blackrocks-proposed-etf-returns-to-dtcc-list-after-disappearing-earlier-tuesday\" data-v-f87c67ca=\"\">technical preparations<\/a> and amended filings to clarify issues over market manipulation, commingling customer funds, etc.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.39%\n    <\/span><\/a> <!----><\/span><\/span> price is up nearly 20% over the last seven days on the back of growing optimism about the approval of a spot bitcoin ETF and other factors. Bitcoin's strong performance is \"fueled by institutional demand\" as opposed to the retail-driven performance witnessed in previous quarters, the JPMorgan analysts said.<\/span><\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"For example, our futures position proxy based on CME bitcoin futures, which tends to be used mostly by institutional investors, has spiked over the past week, rising not only to the highest level for this year but also to levels last seen in August 2022 before the FTX collapse,\" the analysts said. \"In contrast, the equivalent futures position proxy for CME Ethereum futures remains subdued.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Furthermore, there has been a substantial inflow of bitcoin into larger wallets recently — underscoring the demand from institutional investors, according to the analysts.<\/span>"],"hashtag":["INVESTMENT FIRMS","TRADFI BANKS"]}