{"summary":"Breaker Magazine, the crypto publication tied to an entertainment studio of the same name, is shutting down, according to sources familiar with the","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/21313\/breakermag-is-shutting-down","publishDate":"2019-04-29T17:31:20","id":5761,"type":null,"title":"BreakerMag is shutting down","category":["THE BLOCK"],"content":["Breaker Magazine, the crypto publication tied to an entertainment studio of the same name, is shutting down, according to sources familiar with the situation.&nbsp;","The publication was launched last year as an independent unit of SingularDTV, a self-proclaimed blockchain firm for the entertainment industry, which rebranded to Breaker earlier this year.&nbsp;","The firm was one of a number of notable ventures in crypto media to launch in 2018, including Decrypt Media and The Block — all of which came online in the hopes of chipping away at the marketshare of CoinDesk and other mainstream outlets in their coverage of the nascent market, which is known for pay-for-play and poor journalism.&nbsp;","BreakerMag stood out for its long-form stories akin to what one might find in New York Times Magazine or the New Yorker — but for bitcoin and crypto news. Indeed, not long after it gatecrashed the crypto media landscape the publication put out a jaw-dropping investigation into the state of pay-for-play in crypto.&nbsp;","As reported by staff reporter Corin Faife, Breaker found through its own investigative research that a majority of so-called crypto publications — including NewsBTC and AMB Crypto — took money to write stories.&nbsp;","\"The prices quoted for this ranged from a low of $240 to a high of $4500, which reflects the size and reach of the outlets we investigated,\" <a href=\"https:\/\/breakermag.com\/we-asked-crypto-news-outlets-if-theyd-take-money-to-cover-a-project-more-than-half-said-yes\/\" data-v-f87c67ca=\"\">Faife reported<\/a>.","Sources said the reasoning behind the shut down is lack of a viable business plan and high-burn rate from the perspective of its owner Breaker.","Among its leadership ranks were Editor-in-Chief Ben Schiller, who previously ran a European management magazine. Schiller was also a staff writer for Fast Company from 2011 to April 2018.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ben Schiller","content":"PERSON"},{"type":"2011","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"$4500","content":"MONEY"},{"type":"Fast Company","content":"ORGANIZATION"},{"type":"Schiller","content":"PERSON"},{"type":"AMB","content":"ORGANIZATION"},{"type":"Corin Faife","content":"PERSON"},{"type":"Faife","content":"PERSON"},{"type":"$240","content":"MONEY"},{"type":"April 2018","content":"DATE"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}