{"summary":"HSBC is working with the Ripple-owned firm Metaco to introduce a custody service for digital assets like tokenized securities.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262137\/hsbc-tokenized-securities-custody-ripple-metaco","publishDate":"2023-11-08T06:19:38","id":5768,"type":null,"title":"HSBC to launch tokenized securities custody with Ripple-owned Metaco","category":["FINANCE FIRMS"],"content":["HSBC is stepping firmly into the future of finance, announcing plans to offer a custody service for digital assets, including tokenized securities.&nbsp;","Partnering with the Swiss-based institutional digital asset custody, trading and DeFi firm Metaco — owned by crypto payments company Ripple — HSBC’s latest blockchain initiative is set to debut in 2024 for its institutional clientele, according to a statement.","“We’re seeing increasing demand for custody and fund administration of digital assets from asset managers and asset owners, as this market continues to evolve,” HSBC’s Chief Digital, Data and Innovation Officer, Securities Services Zhu Kuang Lee said in the statement. “Through key partnerships, HSBC is delivering the next-generation custody infrastructure that will be scalable and secure.”","The new service uses Metaco’s Harmonize solution and is an extension to HSBC's existing digital assets issuance platform, HSBC Orion. It also complements the banking giant’s new tokenized gold system <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-11-01\/hsbc-launches-blockchain-platform-to-tokenize-ownership-of-gold-in-london-vault\" data-v-f87c67ca=\"\">launched<\/a> last week, which leverages distributed ledger technology to digitize gold ownership.","“I’m excited by the forthcoming launch of our new custody service for digital assets, which will complement HSBC Orion, our platform for issuing digital assets, as well as our recent launch of tokenized physical gold,” Global Head of Digital Assets Strategy, Markets and Securities Services John O’Neill added. “These services underscore HSBC’s commitment to the overall development of digital asset markets.”&nbsp;","“Tokenization of financial and real-world assets is gaining momentum, bringing huge potential to drive significant cost efficiencies and new revenue streams for regulated financial institutions,\" Metaco founder and CEO Adrien Treccani told The Block via email.","\"Metaco Harmonize remains the market-leading institutional-grade digital asset custody and orchestration platform, uniquely fit for the stringent requirements of top tier banks and global custodians. Purpose-built for seamless integration with existing governance and risk management processes, our platform enables financial institutions to build the infrastructure that will enable them to scale their pilots or experiments with tokenized assets,\" he added.","HSBC joins the ranks of major banks like JPMorgan and Deutsche Bank, which have recently commercialized blockchain applications. Last month, JPMorgan announced its <a href=\"https:\/\/www.theblock.co\/post\/259580\/jpmorgan-jpm-coin-billion-daily-transactions\" data-v-f87c67ca=\"\">JPM Coin<\/a> payment system now handles $1 billion in daily transactions. In September, <a href=\"https:\/\/www.theblock.co\/post\/250963\/deutsche-bank-taurus-digital-asset-custody-tokenization-services\" data-v-f87c67ca=\"\">Deutsche Bank<\/a> partnered with the Swiss fintech firm Taurus to develop digital asset custody and tokenization services for its clients.","<a href=\"https:\/\/www.theblock.co\/post\/231140\/ripples-acquires-metaco\" data-v-f87c67ca=\"\">Ripple acquired Metaco<\/a> for $250 million in May, signaling an expansion for the crypto payments specialist into institutional custody services. It was financed through a mix of cash and Ripple equity, seeing Ripple become the sole shareholder of Metaco, but the firm still operates as a standalone brand.&nbsp;","“Ripple is uniquely positioned to address the growing institutional crypto custody market, expected to reach nearly $10 trillion by 2030,” Ripple President Monica Long said at the time.","However, <a href=\"https:\/\/www.theblock.co\/post\/237245\/citigroup-is-reviewing-its-partnership-with-digital-asset-custodian-metaco-bloomberg\" data-v-f87c67ca=\"\">Citigroup<\/a>, which was already working with Metaco on its own digital assets custody services, said it was reviewing its partnership with the firm in June.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Deutsche Bank","content":"ORGANIZATION"},{"type":"HSBC","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"$250 million","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Citigroup","content":"ORGANIZATION"},{"type":"$10 trillion","content":"MONEY"},{"type":"Securities Services Zhu Kuang Lee","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"September","content":"DATE"},{"type":"HSBC Orion","content":"ORGANIZATION"},{"type":"John O’Neill","content":"PERSON"},{"type":"Adrien Treccani","content":"PERSON"},{"type":"2030","content":"DATE"},{"type":"” Global Head of Digital Assets Strategy","content":"ORGANIZATION"},{"type":"Monica Long","content":"PERSON"}],"hashtag":["TRADFI BANKS"],"authors":["James Hunt","The Block"]}