{"summary":"The SEC is determined to secure a decisive win in its lawsuit against Coinbase. To do so, it is trying to leverage a recent ruling on a separate case. But the regulator’s legal strategy may not be a winning one. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281214\/sec-says-its-small-legal-win-carries-weight-in-colossal-coinbase-case-some-lawyers-disagree","publishDate":"2024-03-07T15:52:59","id":5770,"type":null,"title":"SEC says its small legal win carries weight in colossal Coinbase case. Some lawyers disagree.","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">The Securities and Exchange Commission is determined to secure a decisive win in its lawsuit against Coinbase, filed in a New York federal court. To do so, it is trying to leverage a recent ruling on a separate case from a court in California, thousands of miles from its current legal battle.<\/span>","<span data-v-f87c67ca=\"\">But the regulator’s legal strategy, lawyers told The Block, may not be a winning one.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“To say that… there's case law saying crypto assets are securities based on [the insider trading case] is a little aggressive,” Terrence Yang, a lawyer and managing director at Swan Bitcoin, told The Block.<\/span>","<span data-v-f87c67ca=\"\">Last June, <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2023-102\" data-v-f87c67ca=\"\">the SEC sued Coinbase<\/a>, accusing it of breaking federal securities laws by offering unregistered securities in the form of digital tokens. The lawsuit is the latest in a string of complaints the agency has brought against crypto companies as it attempts to expand its regulatory power over the digital assets industry — a move that crypto professionals say would stifle innovation in the burgeoning industry, driving crucial technological advancements and funding opportunities overseas.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Judge Katherine Polk Failla of the Southern District of New York will soon issue a ruling on the tokens-as-securities issue in the current court battle between Coinbase and the SEC. The decision may answer a major question in the regulatory debate: Should cryptocurrencies be classified as securities, thus falling under the SEC's purview?<\/span>","<span data-v-f87c67ca=\"\">To support its view, the SEC this week made a new play to answer that question, leveraging a judge’s judgment in <\/span><a href=\"https:\/\/www.theblock.co\/post\/280492\/sec-leverages-insider-trading-ruling-to-strengthen-lawsuit-against-coinbase\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">a separate, but tangential, case.<\/span><\/a>","<span data-v-f87c67ca=\"\">In a letter to the court filed on Monday, the SEC asks Judge Failla to consider a ruling issued last Friday by Judge Tana Lin of Seattle in a separate insider-trading case involving an ex-Coinbase employee, Ishan Wahi, who used his privileged knowledge of the exchange to help his brother, Nikhil Wahi, and friend, Sameer Ramani, make highly lucrative trades on the platform.&nbsp;<\/span><span data-v-f87c67ca=\"\">According to that judgment, known as the Wahi order, “tokens… traded [by defendants of the insider-trading case] were offered and sold as investment contracts and, thus, were securities.”<\/span>","<span data-v-f87c67ca=\"\">The ruling came in the form of a summary judgement, a decision issued by a judge at the SEC's request after one of the defendants, Wahi, failed to show up to court.&nbsp;<\/span>","<a href=\"https:\/\/www.theblock.co\/post\/280711\/coinbase-counters-use-of-default-judgment-ruling-in-sec-lawsuit\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Coinbase <\/span><\/a><span data-v-f87c67ca=\"\">on Tuesday hit back against the circumstances under which a judge issued the decision, however, arguing the Wahi order “should be afforded no weight\" in a letter to Judge Failla.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The Wahi order was procured against an empty chair and its reasoning reflects as much,” the company’s lawyers said in the letter.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Teresa Goody Guillén, a partner at BakerHostetler law firm, also asserts the weight the insider trading case carries in the SEC’s larger lawsuit against Coinbase should be modest at most.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The value or the implication is pretty limited because it was a default judgment,” Guillén said.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Tana Lin","content":"PERSON"},{"type":"Ishan Wahi","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"Guillén","content":"PERSON"},{"type":"Seattle","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Southern District of New York","content":"ORGANIZATION"},{"type":"Katherine Polk Failla","content":"PERSON"},{"type":"Swan Bitcoin","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Teresa Goody Guillén","content":"PERSON"},{"type":"Failla","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Sameer Ramani","content":"PERSON"},{"type":"Wahi","content":"PERSON"},{"type":"California","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"last Friday","content":"DATE"},{"type":"Terrence Yang","content":"PERSON"},{"type":"Nikhil Wahi","content":"PERSON"}],"hashtag":["LAWSUITS","SEC"],"authors":["Elizabeth Napolitano","The Block"]}