{"summary":"If Democrats and Republicans don’t reach consensus on how to regulate crypto, the U.S. will become less attractive, according to a Moody’s Investors Service report.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235684\/failure-to-advance-crypto-legislation-could-make-the-us-less-attractive-moodys-analysts-say","publishDate":"2023-06-20T13:53:54","id":5771,"type":null,"title":"Failure to move new crypto law could make US less attractive: Moody&#x27;s","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">If Democrats and Republicans don’t reach consensus on how to regulate cryptocurrencies, the U.S. will become less attractive for firms and investors as other countries move ahead with their own rules, according to a <a href=\"https:\/\/www.moodys.com\/\" data-v-f87c67ca=\"\">Moody’s Investors Service<\/a> report.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The report comes as the House Financial Services Committee is discussing two legislative proposals to regulate stablecoins and another that more comprehensively regulates crypto. A hearing last week showed divides between the two parties on that larger picture, though there could be hope for a consensus on stablecoins.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Despite some agreement on topics such as protecting consumers, both Republicans and Democrats have differing opinions on the process, the Moody’s analysts said.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Failure to reach bipartisan agreement and to advance digital assets-specific legislation could make the United States comparatively less attractive for both firms and investors, particularly in a context where many other jurisdictions are moving forward with comprehensive rules,\" the Moody’s analysts said in a report on Tuesday.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The comprehensive market structure bill, proposed by House Financial Services Chair Patrick T. McHenry, R-N.C., would create a <a href=\"https:\/\/www.theblock.co\/post\/232983\/republican-draft-bill-would-create-new-definition-of-decentralized-network\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">pathway<\/span><\/a> for a digital token to go from being treated as a security to a commodity.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Former House Financial Services Chair Maxine Waters, D-Calif, said she was concerned about consumer protection in that bill during the hearing last week.<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">\"The bill appears to halt any enforcement actions by the SEC against crypto firms, even when they have committed fraud,\" Waters said. \"This provisional registration could reward bad actors with a 'get out jail free' card and allow them to continue harming consumers and investors.\"<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">Lawmakers have also gone back and forth on a stablecoin bill since last year. Republicans have recently received feedback from Democrats and said they worked that into an updated version. Waters, too, has said she was \"encouraged by the legislative process being made\" on the stablecoin bill.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">\"I do believe that Mr. McHenry and I have gotten a long way in dealing with stablecoins, and I’m sorry that it got interrupted somehow, but I’m looking forward to getting back and negotiating to see if we can move stablecoins forward,\" Waters said last week.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">Moody’s analysts warned that the McHenry draft could possibly bring more regulatory arbitrage and harm consumers. Under the draft framework, the Federal Reserve would not be the primary supervisor of stablecoin issuers, and state regulators would supervise issuers, according to Moody’s.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">\"By differentiating between bank and non-bank stablecoin issuers at the state and federal level, and by allowing each category of issuer to be supervised by a different body, the proposed framework could lead to regulatory fragmentation and create risk asymmetries between issuers since they would not all be submitted to the same set of rules, which could, in turn, increase regulatory arbitrage and harm consumers’ protections,\" Moody’s said.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"\" Waters","content":"ORGANIZATION"},{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Moody’s","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Calif","content":"LOCATION"},{"type":"Patrick T. McHenry","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Former House Financial Services Chair Maxine Waters","content":"ORGANIZATION"},{"type":"Moody’s Investors Service","content":"ORGANIZATION"},{"type":"Moody","content":"ORGANIZATION"},{"type":"House Financial Services","content":"ORGANIZATION"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"McHenry","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"McHenry","content":"PERSON"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}