{"summary":"Crypto wallet provider BRD has received a $750,000 investment from Ripple\nRipple wants to grow the adoption of its cryptocurrency XRP through the funding \nBRD’s co-founder and CEO Adam Traidman told The Block that the firm has over 2.5 million users, with the top six markets being the U.S., Canada, Australia, Germany, the UK and Japan","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/42921\/ripple-invests-750k-in-crypto-wallet-brd-to-increase-xrp-usage","publishDate":"2019-10-11T11:00:27","id":578,"type":null,"title":"Ripple invests $750K in crypto wallet BRD to increase XRP usage","category":["Wallets"],"content":["Cryptocurrency wallet provider BRD (formerly Bread) has received a $750,000 investment from blockchain payments firm Ripple to boost the adoption of its XRP cryptocurrency.","The investment, made via Ripple’s Xpring program, will allow BRD to build on the XRP Ledger and integrate XRP into its wallet apps - both Andriod and iOS, according to an announcement Friday. One the integration is complete, BRD users can buy, sell, hold and send XRP across the world.","Switzerland-based BRD claims to have over 2.5 million users in 170 countries. Its top six markets are the U.S., Canada, Australia, Germany, the U.K., and Japan, Adam Traidman, BRD’s co-founder and CEO, told The Block.","The wallet currently supports bitcoin (BTC), bitcoin cash (BCH), ether (ETH) and several other ERC-20 tokens. Traidman said it’s the time to support the \"large\" XRP community, adding: “It is our plan to have BRD be the cheapest and easiest place to buy XRP moving forward.”","Ethan Beard, senior vice president of Ripple’s Xpring unit said that BRD has helped consumers on-ramp $6 billion worth of traditional currencies into digital currencies, which makes it “an ideal partner” to continue the adoption of XRP to solve “real-world problems.”","Traidman told The Block that BRD’s “unique” attribute is that it's a “complete non-custodial” wallet, which allows users to control their own funds, while also enabling them to trade cryptocurrencies when required. “This way, users can install the app and store assets without providing any personal information.”","Today’s investment brings BRD’s total funding to date to $56 million, Traidman told The Block. He, however, did not disclose the firm’s valuations, nor revenues.","Earlier this year, BRD <a href=\"https:\/\/www.theblockcrypto.com\/post\/8829\/crypto-wallet-scores-15-million-from-sbi-holdings\" data-v-f87c67ca=\"\">raised<\/a> a $15 million Series B, led by Japanese financial services giant SBI Holdings. Previously, it raised $32 million via an initial coin offering of its token BRD, and $1 million in a seed round.","Traidman told The Block that BRD is a utility token and is used to reward token holders with discounts on trading and other perks. “The token has been instrumental in building our community and generating enthusiasm about the app.” He added that the liquidity of tokens is ensured via listing it on top exchanges, including Binance.","The firm is not looking to raise any more funds in the next few years, and is now all focused on bringing “an entirely new product” to the market, Traidman said, without giving any specific details. “It is geared towards crypto developers and large financial enterprises” and will be announced within this quarter, he added.","BRD currently has a headcount of 60, spread across North America, Japan, and Europe, and is not looking to add more members to its team."],"hashtag":["WALLETS","XRP"]}