{"summary":"The Monetary Authority of Singapore is expanding its regulatory scope for crypto service providers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285991\/singapore-widens-crypto-regulation-introduces-enhanced-user-protection-requirements","publishDate":"2024-04-02T02:44:46","id":5781,"type":null,"title":"Singapore widens crypto regulation, introduces enhanced user protection requirements","category":["REGULATION"],"content":["Singapore is introducing regulations that appear to be more stringent for companies engaging in cryptocurrency services or digital payment token (DPT) services.","The Monetary Authority of Singapore <a href=\"https:\/\/www.mas.gov.sg\/news\/media-releases\/2024\/mas-expands-scope-of-regulated-payment-services\" data-v-f87c67ca=\"\">announced<\/a> on Tuesday that it is expanding the scope of regulated payment services by introducing amendments to the Payment Services Act and its subsidiary legislation.","The amendments are expected to take effect from April 4 in stages, according to the statement. Specifically, the MAS noted that the new rules would cover custodial services for DPTs, facilitation of the transmission of DPTs, and facilitation of cross-border money transfers between countries “even where moneys are not accepted or received in Singapore.”","“The amendments will empower MAS to impose requirements relating to anti-money laundering and countering the financing of terrorism, user protection and financial stability on DPT service providers,” the MAS said.","The MAS added that it would provide “transitional arrangements” for those conducting activities under the expanded regulatory scope, but they need to inform the regulator within 30 days and file a license application within six months from April 4.","<span data-v-f87c67ca=\"\">“This expansion has been in the works since 2021 and brings much anticipated regulatory clarity to crypto custody players in Singapore,” Angela Ang, a former MAS regulator and senior policy advisor at blockchain intelligence firm TRM Labs, told The Block.<\/span>","<span data-v-f87c67ca=\"\">“I don't think any of the changes are unexpected or surprising so to the extent that these changes may lead to some crypto exchanges or firms exiting Singapore, that decision likely would have been taken some time ago,” said Kelvin Low, a law professor at National University of Singapore.<\/span>","<span data-v-f87c67ca=\"\">Lily Z. King, COO of crypto wallet and custody firm Cobo, said that the MAS' announcement comes at a crucial time, \"especially considering the recent call for legislation regarding crypto custody in Hong Kong by legislative council member Duncan Chiu earlier this week.\"<\/span>","In a <a href=\"https:\/\/www.mas.gov.sg\/regulation\/guidelines\/ps-g03-guidelines-on-consumer-protection-measures-by-dpt-service-providers\" data-v-f87c67ca=\"\">guideline<\/a>&nbsp;released Tuesday, the MAS spelled out terms on the consumer protection measures DPT service providers should take under the Payment Services Act.","The measures include segregating customers’ assets, maintaining proper books and records, and ensuring the integrity and security of customers’ assets. The guideline is expected to take effect on October 4.","<em data-v-f87c67ca=\"\">(Updates: Added comments from Ang, Low and King)<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DPT","content":"ORGANIZATION"},{"type":"TRM Labs","content":"ORGANIZATION"},{"type":"Kelvin Low","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"April 4","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"October 4","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Lily Z. King","content":"PERSON"},{"type":"Angela Ang","content":"PERSON"},{"type":"Cobo","content":"ORGANIZATION"},{"type":"Monetary Authority of Singapore","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"National University of Singapore","content":"ORGANIZATION"},{"type":"MAS","content":"ORGANIZATION"},{"type":"Duncan Chiu","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"}],"hashtag":["ASIAN REGULATION"],"authors":["Timmy Shen","The Block"]}