{"summary":"Bitcoin miner BIT Mining is selling 51% of its subsidiary Loto Interactive, which used to run three sites in that country.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157132\/bit-mining-to-sell-subsidiary-loto-interactive-as-it-expands-in-the-us","publishDate":"2022-07-12T18:57:20","id":5782,"type":null,"title":"BIT Mining to sell subsidiary Loto Interactive as it expands in the US","category":["MINING"],"content":["Bitcoin mining firm BIT Mining, formerly known as 500.com, is selling its majority share of Loto Interactive, which began as an online lottery business and shifted to bitcoin mining in 2019.","The company announced Tuesday that it entered into a sale and purchase agreement with an unnamed third party for 51% of Loto Interactive's shares. After the deal, it will maintain an 8.79% stake.","BIT Mining explained that the move aligned with the company's plans to keep expanding in the US. After being forced to shut down operations in China last year, the company <a href=\"https:\/\/www.theblock.co\/post\/111117\/china-bitcoin-miner-bit-mining-50-million-overseas\" data-v-f87c67ca=\"\">raised $50 million in a private stock offering to move overseas<\/a>.","BIT Mining is currently in the process of building out a site in Ohio in partnership with Viking Data Centers, which will grant it access to 82.5 megawatts of energy capacity. The first 50 megawatts have already been developed, <a href=\"https:\/\/www.prnewswire.com\/news-releases\/bit-mining-limited-to-improve-efficiency-at-ohio-mining-site-after-business-spin-off-301578773.html\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">per a recent update<\/span><\/a>. It also owns one of the largest mining pools, BTC.com.","The company's operations, via Loto Interactive, were mainly located in China until the government's crackdown on bitcoin mining last year. Loto Interactive at one point owned three sites referred to as \"big data centres.\"","According to Loto's first-quarter earnings results, one of those sites in Sichuan Province was closed in January 2022, and the other two were also set to close down.","Additionally, Loto started operating a \"big data centre\" in Hong Kong in November 2021, which generated HK$6.9 million (roughly $878,991) in the first three months of the year, per the document — essentially all the company's earnings during that time period, with the remaining 9.82% stemming from its \"money lending business.\"","In the first quarter of 2021, Loto had brought in HK$74,259,000 in revenue (around $9,460,150).","The \"significant decrease\" in revenue was mostly \"due to the termination of operation of the three big data centres in Sichuan Province,\" the company said.","BTC.com was founded by Bitmain and sold to 500.com in 2021. Now called BIT Mining, the company is listed on Nasdaq and has indirectly been backed by some state-owned capital, <a href=\"https:\/\/www.theblockcrypto.com\/news+\/96817\/chinese-state-owned-capital-500-bitcoin-mining\" data-v-f87c67ca=\"\">as The Block explained last year<\/a>.","Similar to Loto, BIT Mining used to be in the business of online sports lotteries and struggled amid China’s 2015 crackdown of online lotteries.&nbsp;","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">This report has been updated with additional information.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"HK$6.9 million","content":"MONEY"},{"type":"2015","content":"DATE"},{"type":"January 2022","content":"DATE"},{"type":"Bitmain","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"Loto Interactive","content":"ORGANIZATION"},{"type":"9.82%","content":"PERCENT"},{"type":"$9,460,150","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"$878,991","content":"MONEY"},{"type":"Hong Kong","content":"LOCATION"},{"type":"November 2021","content":"DATE"},{"type":"8.79%","content":"PERCENT"},{"type":"Viking Data Centers","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"BIT Mining","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Ohio","content":"LOCATION"},{"type":"Sichuan Province","content":"LOCATION"},{"type":"51%","content":"PERCENT"},{"type":"first quarter of 2021","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Loto","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"$50 million","content":"MONEY"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}