{"summary":"Kazakhstan&#x27;s parliament is bringing its crypto mining industry, once one of the world&#x27;s largest, closer to heel.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/192911\/kazakhstan-bitcoin-mining-legislation","publishDate":"2022-12-07T12:17:38","id":5785,"type":null,"title":"Kazakhstan&#x27;s parliament moves forward on Bitcoin mining legislation","category":["POLICY"],"content":["Kazakhstan is advancing new legislation to regulate local crypto miners.&nbsp;","Kazakhstan's Majalis, the federal parliamentary body, has <a href=\"https:\/\/yandex.ru\/video\/preview\/14309848359203792774\" data-v-f87c67ca=\"\">approved<\/a> the second reading of a bill \"On the Digital Assets of the Republic of Kazakhstan.\" The <a href=\"https:\/\/online.zakon.kz\/Document\/?doc_id=38842072&amp;pos=6;-108#pos=6;-108\" data-v-f87c67ca=\"\">bill<\/a> will now go to a third reading, which precedes a vote.","The new legislation would put in new licensing regimes for crypto miners based on whether or not they operate their own facilities or rent them from other suppliers. Miners would also have to purchase their electricity from the shared grid at market rates through energy provider Korem, which follows earlier specific taxes on miner electricity consumption.&nbsp;","Awash with cheap electricity, Kazakhstan saw a flood of miners following China's ban on crypto. Following widespread protests over high fuel prices that led to political crackdowns including an <a href=\"https:\/\/www.theblock.co\/post\/129312\/bitcoin-mining-pool-hashrates-fall-amid-kazakhstan-internet-shutdown\" data-v-f87c67ca=\"\">internet shutdown<\/a> in January, Kazakhstan imposed a <a href=\"https:\/\/www.theblock.co\/linked\/145103\/kazakhstan-formalizes-reporting-regime-for-cryptocurrency-miners\" data-v-f87c67ca=\"\">new reporting and taxation regime<\/a> for crypto miners.","Cambridge releases the most <a href=\"https:\/\/ccaf.io\/cbeci\/mining_map\" data-v-f87c67ca=\"\">authoritative data<\/a> on Bitcoin's global hashrate, which continues to show Kazakhstan as one of the leading sources, but has not been updated since January.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Korem","content":"LOCATION"},{"type":"Kazakhstan","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["MINING COMPANIES"],"authors":["Kollen Post","The Block"]}