{"summary":"Options volume have prevailed amid depressed perpetual and futures trading, the crypto derivative exchange Deribit finds. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/255081\/crypto-options-prevail-amid-depressed-futures-and-perpetuals-trading","publishDate":"2023-10-05T16:24:37","id":5786,"type":null,"title":"Crypto options prevail amid depressed futures and perpetuals trading","category":["MARKETS"],"content":["Options volumes are outperforming depressed perpetual and futures trading, the crypto derivative exchange Deribit said Thursday in an emailed report.&nbsp;","Deribit Chief Commercial Officer Luuk Strijers told The Block that the increase in options trading was due to the demand for yield, especially as they expire. The Block reported late last month that $3 billion in bitcoin options and $1.8 billion in ether options <a href=\"https:\/\/www.theblock.co\/post\/252621\/bitcoin-volatility-may-rise-as-options-worth-3-billion-expire-at-end-of-month\" data-v-f87c67ca=\"\">expired<\/a> on Sept. 29.","<span data-v-f87c67ca=\"\">Overall derivatives markets volume in USD billions. Image: Deribit<\/span>","\"Perpetual and futures volumes are down 22% quarter-on-quarter for the entire derivatives market due to lack of direction and volatility,\" Deribit wrote in the Thursday newsletter.","\"The good news however is that overall market options volumes are in line Q3 vs Q2 (zero activity loss) and have therefore proven to be a more resilient asset class versus perpetuals and futures,\" it continued.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1.8 billion","content":"MONEY"},{"type":"$3 billion","content":"MONEY"},{"type":"Deribit","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Sept. 29","content":"DATE"},{"type":"22%","content":"PERCENT"},{"type":"USD","content":"ORGANIZATION"}],"hashtag":[],"authors":["MK Manoylov","Frank Chaparro","The Block"]}