{"summary":"The proposal wants the Frax DAO to agree to make its frax stablecoin redeemable purely on the Ethereum 2.0 chain post-merge.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/161429\/frax-finance-proposes-rejection-of-any-ethereum-proof-of-work-fork","publishDate":"2022-08-04T07:46:42","id":5793,"type":null,"title":"Frax Finance proposes rejection of any Ethereum proof of work fork","category":["GOVERNANCE"],"content":["Frax Finance co-founder Sam Kazemian has submitted a <a href=\"https:\/\/gov.frax.finance\/t\/fip-101-make-frax-stablecoins-only-redeemable-on-pos-eth\/1753\" data-v-f87c67ca=\"\">proposal<\/a> for the project’s stablecoin to be redeemable solely on the Ethereum proof-of-stake (PoS) mainnet following the network's forthcoming switch from proof-of-work (PoW) consensus.","This proposal was published to the Frax governance page on Thursday and comes amid concern that some Ethereum miners might stage a hard fork of the Ethereum chain during the move from PoW to PoS — a shift known as \"the merge.\" A hard fork is a network split that results in the creation of two different chains. <a href=\"https:\/\/www.theblock.co\/post\/160462\/as-the-ethereum-merge-approaches-a-key-miner-is-pushing-a-proof-of-work-fork\" data-v-f87c67ca=\"\">As previously reported by The Block<\/a>, one influential Chinese crypto miner Chandler Guo has already pushed plans for a hard fork to create what he called “ETH PoW.”","Kazemian’s proposal calls for Frax's DAO to choose PoS Ethereum (also called Ethereum 2.0 or ETH2) as the only recognized Ethereum network for its frax stablecoin post-merge.","“Frax is the 5th largest stablecoin in the world and 20%+ of Curve’s TVL, a Uniswap top 10 token, and a critical piece of the Ethereum ecosystem. Thus, it makes sense to clearly make FXS holders’ desire public knowledge through governance,” the proposal states, referring to the <a href=\"https:\/\/www.coinbase.com\/price\/frax-share\" data-v-f87c67ca=\"\">frax share<\/a> governance token by its ticker FXS.","If passed by the DAO, Frax will liquidate all tokens on any Ethereum PoW forks and keep the funds in its treasury to honor stablecoin redemptions by users.","The proposal also marks Frax as the first decentralized stablecoin issuer to offer public support for ETH2 — although Tether chief technology officer Paolo Ardoino has <a href=\"https:\/\/twitter.com\/paoloardoino\/status\/1553702442348453894\" data-v-f87c67ca=\"\">stated<\/a> that its centralized stablecoin will support ETH2.","The potential for the Ethereum merge being contested via hard forks has significant implications for stablecoins — because such forks typically double the number of tokens as the chain splits. This situation is especially concerning for fiat-backed stablecoins as the supply increase would affect their ability to maintain their US dollar peg.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Chinese crypto miner Chandler Guo","content":"ORGANIZATION"},{"type":"fiat","content":"ORGANIZATION"},{"type":"Sam Kazemian","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Frax Finance","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"Paolo Ardoino","content":"PERSON"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}