{"summary":"A bankruptcy judge has approved Core Scientific&#x27;s plan to replace a previous loan with new financing from B. Riley.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/207253\/judge-approves-core-scientifics-70-million-loan-from-b-riley","publishDate":"2023-02-01T14:42:49","id":5795,"type":null,"title":"Judge approves Core Scientific&#x27;s $70 million loan from B. Riley","category":["CRYPTO INFRASTRUCTURE"],"content":["Bankrupt bitcoin miner Core Scientific got the green light from a bankruptcy judge to move forward with a <a href=\"https:\/\/www.theblock.co\/post\/207110\/core-scientific-reaches-deal-with-b-riley-for-70-million-replacement-loan\" data-v-f87c67ca=\"\">$70 million debtor-in-possession<\/a> (DIP) loan from B. Riley.","Representatives of the company asked the court for interim approval for an initial draft of $35 million.","The company will use the funds to repay the original DIP loan it had initially presented when filing for bankruptcy in December, <a href=\"https:\/\/www.theblock.co\/post\/197047\/core-scientific-eyes-sale-of-up-to-1-gigawatt-worth-of-facilities-amid-bankruptcy-exclusive\" data-v-f87c67ca=\"\">with a prearranged deal<\/a> that involved turning most of its debt into equity. At that time, it took out an initial $37.5 million.","Since then, bitcoin's price has risen over 30%, and the company's cash flow has \"significantly\" improved, representatives of the company said during a meeting Wednesday in the U.S. Bankruptcy Court for the Southern District of Texas.","The new deal will give Core Scientific \"up to 15 months of runway and significant flexibility\" since it has no \"plan-related milestones and is not conditioned on seeking approval of any specific Chapter 11 plan,\" the motion said.","The Official Committee of Unsecured Creditors issued a <a href=\"https:\/\/cases.stretto.com\/public\/X217\/12024\/PLEADINGS\/1202401312380000000103.pdf\" data-v-f87c67ca=\"\">support statement<\/a> for the deal, saying in a <a href=\"https:\/\/cases.stretto.com\/public\/X217\/12024\/PLEADINGS\/1202401312380000000103.pdf\" data-v-f87c67ca=\"\">filing<\/a> Tuesday that while the original DIP loan \"represented a substantial threat to unsecured creditor recoveries,\" the new one gives Core \"flexibility to pursue a plan of reorganization that will maximize value for all creditors, rather than just the convertible noteholders.\"","However, it opposed the payment of a 15% termination fee (about $6 million), arguing that it was approved only on an interim basis and that \"the court is not bound by the original interim DIP order’s approval of the original DIP’s fees because it was not a final order.\"","A representative of the committee claimed that this amount was \"unreasonable\" and would \"deprive\" unsecured creditors of $4 million. Representatives of the debtor argued, on the contrary, that the termination fee was priced into the original DIP loan and should remain.","The objection on the termination fee was overruled by judge David R. Jones, who said \"the process has to be bigger than any particular case.\"","Some of Core Scientific's top creditors, like Barrings, had filed objections to the original DIP financing, arguing that they needed adequate protection. But the new deal has found support from the multiple parties involved in the bankruptcy.","\"In bankruptcy, there's an order of things. If there's going to be a payout, the secured lenders are typically right at the top,\" <span class=\"markzhxgtbgrd\" data-markjs=\"true\" data-ogac=\"\" data-ogab=\"\" data-ogsc=\"\" data-ogsb=\"\" data-v-f87c67ca=\"\">Pablo<\/span>&nbsp;<span class=\"markq4qb9ia4y\" data-markjs=\"true\" data-ogac=\"\" data-ogab=\"\" data-ogsc=\"\" data-ogsb=\"\" data-v-f87c67ca=\"\">Bonjour, managing partner at restructuring firm MACCO, which advised crypto lender Cred <a href=\"https:\/\/www.coindesk.com\/business\/2020\/11\/08\/crypto-lender-cred-files-for-bankruptcy-after-losing-funds-in-fraud\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">through Chapter 11 bankruptcy protection,<\/a><\/span>&nbsp;told The Block. \"Anything that threatens, number one, their position of priority or, number two, the collateral, they're going to object to.\"","The judge also approved a petition for the sale of Bitmain coupons totaling $6.7 million which are set to expire in March and April, and which the company has \"no intention\" of using for buying S19 miners.","The sale is not expected to bring in nearly close to that amount. Because of how depressed mining machine prices have been, coupons traded in the secondary market have been going for about 15% and 25% of their face value, the company said in a <a href=\"https:\/\/cases.stretto.com\/public\/X217\/12024\/PLEADINGS\/1202401262380000000006.pdf\" data-v-f87c67ca=\"\">filing<\/a>.","Core Scientific had a cash balance of $35.7 million at the end of December, said a <a href=\"https:\/\/cases.stretto.com\/public\/X217\/12024\/PLEADINGS\/1202402012380000000009.pdf\" data-v-f87c67ca=\"\">debtor-in-possession monthly operating report<\/a> filed Tuesday by Core Scientific.","The miner had $2.3 billion in assets and $694 million in liabilities. Of that amount, only $7.4 million was unsecured debt. Convertible noteholders have the majority portion of the company's debt, with other big creditors including BlockFi, NYDIG, Anchor Labs, the parent company of digital asset bank Anchorage Digital, and B. Riley itself.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$694 million","content":"MONEY"},{"type":"Anchorage Digital","content":"ORGANIZATION"},{"type":"Official Committee of Unsecured Creditors","content":"ORGANIZATION"},{"type":"$2.3 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$6.7 million","content":"MONEY"},{"type":"$70 million","content":"MONEY"},{"type":"$37.5 million","content":"MONEY"},{"type":"$35.7 million","content":"MONEY"},{"type":"30%","content":"PERCENT"},{"type":"$7.4 million","content":"MONEY"},{"type":"David R. Jones","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"25%","content":"PERCENT"},{"type":"B. Riley","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"$6 million","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"MACCO","content":"LOCATION"},{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"the Southern District of Texas","content":"ORGANIZATION"},{"type":"$35 million","content":"MONEY"},{"type":"$4 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"December","content":"DATE"},{"type":"March","content":"DATE"},{"type":"Pablo<\/span>&nbsp;<span class=\"markq4qb9ia4y\" data-markjs=\"true\" data-ogac=\"\" data-ogab=\"\" data-ogsc=\"\" data-ogsb=\"\" data-v-f87c67ca=\"\">Bonjour","content":"PERSON"}],"hashtag":["MINING COMPANIES"],"authors":["Catarina Moura","The Block"]}