{"summary":"Huobi Trust, a wholly owned subsidiary of Huobi Technology Holdings, has hired former Homeland Security agent Robert Whitaker as its COO.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/113629\/former-homeland-security-agent-robert-whitakerjoins-huobi-trust","publishDate":"2021-08-05T11:00:55","id":5796,"type":null,"title":"Former Homeland Security agent joins Huobi Trust as COO","category":["PEOPLE"],"content":["Huobi Trust, a wholly owned subsidiary of Hong Kong-listed Huobi Technology Holdings, has hired former Homeland Security agent Robert Whitaker as its chief operating officer (COO).","Whitaker <a href=\"https:\/\/www.linkedin.com\/in\/robertewhitaker\/\" data-v-f87c67ca=\"\">began work<\/a> at Huobi Trust last month as the firm's first COO, after a four-year stint at blockchain analytics firm BIGG Digital Assets. He previously served for more than a decade at the U.S. Department of Homeland Security, where he oversaw the crypto investigation program in his most recent role.","When asked why he quit the government role to initially enter the crypto industry in 2017, Whitaker told The Block that he spent a considerable amount of time in government and \"didn't want to get locked into a routine and stay in one environment.\"","\"The crypto industry changes at such a rapid pace, so I saw retiring from the government to go private as a way to gain a new perspective on the space and continue growing as a professional,\" he said. \"2017 was really when crypto started gaining mainstream attention, so the timing was right.\"","Whitaker was first exposed to crypto in early 2015, he said, when he was transferred to Homeland Security's headquarters office in Washington, D.C., and landed in the finance division, which was launching a new crypto-focused program at the time called the Illicit Digital Economy Program. As a supervisor, he was tasked with learning about crypto and training other agents and agencies on matters related to crypto, said Whitaker.","At Huobi Trust, Whitaker's role is to oversee the growth and development of the company's vision and strategy, as well as current and future product offerings, he said.","Huobi Trust currently offers fiat custody and a range of compliance services for blockchain companies as a Nevada state-chartered retail trust company, said Whitaker. The firm is also the primary custodian for the assets backing Huobi Global's HUSD stablecoin. \"In the future, Huobi Trust sees opportunities for deploying a wide range of additional trust, custodial, and compliance products using distributed ledger solutions, which are all subject to regulatory approval,\" said Whitaker.","Whitaker believes that crypto has the potential to create new ways for people and businesses to transact worldwide. He said there's a misconception among regulators that crypto is primarily used for financing illicit activities.","\"Part of the reason behind that is there are still many who don't yet fully understand crypto and the tech behind it, especially at the state and local levels,\" he said. \"But as regulation moves forward and we get more consumer protections, we'll see a change in the overall perception of crypto.\"","The pseudo-anonymous nature of crypto and blockchain data analytics, in fact, help track crypto transactions that would not be possible with fiat transactions, according to Whitaker. \"There's a lot more transparency in crypto than most people think,\" he said.","Huobi Trust is based in Las Vegas, Nevada, and has a headcount of over 20 employees, said Whitaker, adding that the firm is looking to expand its team further across various functions, including compliance and operations.","While Huobi Trust's parent company <a href=\"https:\/\/www.theblockcrypto.com\/post\/97074\/huobi-btc-eth-funds-hong-kong\" data-v-f87c67ca=\"\">Huobi Tech<\/a> shares the same brand and shareholders as Huobi Group, the owner of the Huobi Global crypto exchange, the two are separate legal entities that operate independently of each other, said Huobi Trust.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2015","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"Washington","content":"LOCATION"},{"type":"Huobi Global","content":"ORGANIZATION"},{"type":"Las Vegas","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"BIGG Digital Assets","content":"ORGANIZATION"},{"type":"Homeland Security","content":"ORGANIZATION"},{"type":"Illicit Digital Economy Program","content":"ORGANIZATION"},{"type":"U.S. Department of Homeland Security","content":"ORGANIZATION"},{"type":"Huobi Group","content":"ORGANIZATION"},{"type":"Nevada","content":"LOCATION"},{"type":"Huobi Trust","content":"ORGANIZATION"},{"type":"Robert Whitaker","content":"PERSON"},{"type":"Whitaker","content":"PERSON"},{"type":"Huobi Tech","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"D.C.","content":"LOCATION"},{"type":"Huobi Technology Holdings","content":"ORGANIZATION"}],"hashtag":["HIRING"],"authors":["Yogita Khatri","The Block"]}