{"summary":"Circle’s OTC head has resigned from the firm\nThe Block learned Friday that Daniel Matuszewski, formerly head of Circle Trade, has resigned\nWe also learned that Chris Hermida, who led the OTC desk in London, and Beatrice O’Carroll, a sales exec for Circle Trade, have also left in recent weeks","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/34610\/circle-otc-head-departs-firm-following-layoffs-and-departures","publishDate":"2019-08-02T12:37:54","id":58,"type":null,"title":"Circle Trade has lost 6+ employees, Including its unit head","category":["Exchanges"],"content":["At least six employees of Circle Trade have left the once-mighty over-the-counter trading business in recent months, sources close to the situation tell The Block.","<strong data-v-f87c67ca=\"\">Daniel Matuszewski<\/strong>, the head of the business unit, has resigned, according to an internal memo read by The Block.","Matuszewski said he would be leaving to pursue a \"brand new entrepreneurial opportunity in crypto.\"","\"I look forward to working with Circle in a professional capacity going forward from the other side of the trade,\" he wrote in his farewell note.","Matuszewski previously traded volatility for Bay Hill Capital, a Boston-area hedge fund","Nick Gustafson, previously a trader for Kraken's OTC desk, is taking over Matuszewski's position, according to the memo.&nbsp;","However, Matuszewski isn't the only one to depart in recent months, and this exodus comes on the heels of layoffs and changes to asset offerings due to regulatory pressures in the U.S.","<strong data-v-f87c67ca=\"\">Chris Hermida<\/strong>, an OTC trader for Circle in London left the firm this week, according to a source. He was the second trader on the desk and helped build it out in its earliest days. He is looking at launching a hedge fund, the source said. <strong data-v-f87c67ca=\"\">Beatrice O'Carroll<\/strong>, formerly a sales exec for Circle Trade, also left the company last month.&nbsp;","O'Carroll previously worked on Wall Street in sales and trading at firms like Citi and Deutsche Bank.&nbsp;","<strong data-v-f87c67ca=\"\">Paul Martin<\/strong>, who formerly did sales for Circle Trade, left in May. He is now a Vice President at Exodus.io, a crypto wallet.&nbsp;","<a href=\"https:\/\/www.linkedin.com\/in\/ryansalame\/\" data-v-f87c67ca=\"\">As The Block previously reported,<\/a><strong data-v-f87c67ca=\"\"> Ryan Salame<\/strong>, once-head of Circle OTC trading in Hong Kong, left his role in June to head Alameda’s OTC APAC desk. The firm still has Salame based in Hong Kong.","Similarly,&nbsp;<strong data-v-f87c67ca=\"\"><a href=\"https:\/\/www.linkedin.com\/in\/yinfengshao\/\" data-v-f87c67ca=\"\">YinFeng Shao<\/a><\/strong>&nbsp;left his position in May, according to LinkedIn, although his profile does not list his new role. Prior to his time at Circle, YinFeng was VP of Product at LedgerX. He’s been based out of New York since 2011.&nbsp;The company said the two roles have been filled, though declined to release the names of the new employees.&nbsp;","The OTC exits follow Circle's axing of 30 employees in its finance and products department this May, accounting for 10% of its total staff. Co-founder and CEO Jeremy Allaire said the move was in response to the challenging regulatory climate in the U.S.","Poloniex, an exchange Circle acquired in 2018, has also cut back its tokens in response to the climate. It “geofenced” assets in the U.S. this May, effectively delisting nine tokens for U.S. traders.&nbsp;","Meanwhile, Poloniex began <a href=\"https:\/\/www.theblockcrypto.com\/2019\/07\/09\/poloniex-exchange-now-allows-fiat-to-crypto-trading-credit-card-purchases\/\" data-v-f87c67ca=\"\">offering a new functionality<\/a> in July, allowing fiat-to-crypto trading so traders can deposit and withdraw funds using bank accounts and purchase crypto assets trading on Poloniex with debit and credit cards.&nbsp;","This is likely a move to increase its market share amidst a competitive U.S. market with the likes of Bitstamp’s recent U.S. launch and Binance’s plans for a step into the country. Still, Poloniex has seen its market share collapse to 1.1%, according to data gathered by The Block.","As bitcoin soared towards $20,000 at the end of 2017, Circle’s OTC business was known for being one of the biggest money-makers in the market for digital currencies."],"hashtag":[]}