{"summary":"Gnosis Safe has raised $100 million in a token sale led by 1kx as it seeks to expand the smart contract account ecosystem.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157050\/gnosis-safe-raises-100-million-led-by-1kx-as-it-rebrands-to-safe","publishDate":"2022-07-12T09:00:07","id":5800,"type":null,"title":"Gnosis Safe raises $100 million led by 1kx as it rebrands to Safe","category":["WEB3"],"content":["Gnosis Safe has raised $100 million in a token sale led by 1kx as it seeks to expand the smart contract account ecosystem.","Smart contract accounts are accessed and controlled via smart contract code rather than a private key or a seed phrase. The project says these accounts prevent hacks and also provide tools such as authentication via decentralized autonomous organizations (DAOs), spending limits and automation, and recovery and inheritance mechanisms.&nbsp;","Other investors in the round, announced on Tuesday, include Tiger Global, A&amp;T Capital, Blockchain Capital, Digital Currency Group, Greenfield One, Rockaway Blockchain Fund, ParaFi, Lightspeed, Polymorphic Capital and Superscrypt. The funding will go to the project's foundation, a non-profit organization that aims to protect its strategic assets, confirming a <a href=\"https:\/\/www.theblock.co\/post\/134253\/safe-foundation-proposed-steward-of-the-gnosis-safe-ecosystem-plans-to-raise-100-million\" data-v-f87c67ca=\"\">report<\/a> from The Block report in February.","Originating as a side project within prediction market project Gnosis, the raise is also aiming to crystallize its differentiation from Gnosis through a rebrand to Safe. This follows an <a href=\"https:\/\/snapshot.org\/#\/gnosis.eth\/proposal\/0x5187694133abfb3d140acce3b9ac2ecf033c657c816a18dc25d2e0c1a2a29ec7\" data-v-f87c67ca=\"\">April approval<\/a> by the Gnosis community to spin off Gnosis Safe from Gnosis Ltd., giving the project the get-go to launch as a separate entity.&nbsp;","\"How it emerged initially is in 2017, when we launched a token for Gnosis, we had many digital assets to manage so we wanted to do this self custody in a secure way,\" Gnosis Safe lead Lukas Schor explained in an interview. \"And so we built our own multi-sig smart contracts to manage these assets. We open-sourced this and saw adoption and suddenly it grew from an internal tool to an ecosystem project with a team working on it.\"&nbsp;","The project says the majority of the raised funds will be used to build out an ecosystem of applications and wallets using Safe accounts via grants and accelerator programs. Schor also noted that it raised such an amount so that the project could weather an extended bear market and not be forced into the position of raising again in a few months' time.&nbsp;","While Safe declined to share the valuation during this interview with The Block, it was reported that the project was worth $1.25 billion in February.","Safe's spinout from Gnosis follows similar moves by CoW protocol, which underlines the decentralized exchange CowSwap. The Block exclusively reported in March that it <a href=\"https:\/\/www.theblock.co\/linked\/139692\/cow-protocol-raises-23-million-and-spins-out-from-gnosis-dao\" data-v-f87c67ca=\"\">raised $23 million via a token round<\/a> as it spun out from Gnosis DAO to become an entity in its own right.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2017","content":"DATE"},{"type":"$1.25 billion","content":"MONEY"},{"type":"Tiger Global","content":"ORGANIZATION"},{"type":"Gnosis","content":"PERSON"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Greenfield One","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Lightspeed","content":"ORGANIZATION"},{"type":"Polymorphic Capital","content":"ORGANIZATION"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Gnosis Ltd.","content":"ORGANIZATION"},{"type":"Gnosis DAO","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"A&amp;T Capital","content":"ORGANIZATION"},{"type":"$23 million","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"Blockchain Capital","content":"ORGANIZATION"},{"type":"Lukas Schor","content":"PERSON"}],"hashtag":[],"authors":["Tom Matsuda","The Block"]}