{"summary":"The layoff comes nearly two months after Indian authorities began investigating WazirX for alleged money laundering. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/174264\/indian-crypto-exchange-wazirx-confirms-layoffs-coindesk","publishDate":"2022-10-01T14:47:33","id":5801,"type":null,"title":"Indian crypto exchange WazirX cuts 40% of staff","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">India-based crypto exchange WazirX has laid off more than 50 people as it navigates a period of languishing volumes, the company told CoinDesk on Saturday.<\/span>","As per reporting from CoinDesk, the crypto exchange has laid off as many as 70 employees or approximately 40% of its total workforce.&nbsp;","\"The crypto market has been in the grip of a bear market because of the current global economic slowdown,\" WazirX said in a statement shared with CoinDesk on Saturday. \"The Indian crypto industry has had its unique problems with respect to taxes, regulations and banking access. This has lead to a dramatic fall in volumes in all Indian crypto exchanges.\"","<span data-v-f87c67ca=\"\">The firm hopes the layoffs will allow it to &nbsp;maintain adequate financial stability to survive the crypto market downturn. Employees in customer service, HR, management, and other departments were impacted, and will each have 45 days of pay following termination.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">WazirX’s layoffs comes nearly two months after Indian authorities began investigating the company for alleged money laundering. India’s Directorate of Enforcement froze <\/span><a href=\"https:\/\/www.theblock.co\/post\/161727\/wazirx-bank-balances-frozen-ed-binance-crypto-exchange?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$8 million <\/span><\/a><span data-v-f87c67ca=\"\">worth of WazirX’s funds on Aug. 5, 2022.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Binance was thought to have acquired the Indian crypto exchange. After WazirX’s funds were frozen, however, Binance co-founder and CEO Changpeng Zhao <\/span><a href=\"https:\/\/www.theblock.co\/post\/161773\/binance-ceo-says-firm-never-completed-wazirx-purchase-after-funds-frozen\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">claimed<\/span><\/a><span data-v-f87c67ca=\"\"> that acquisition of WazirX never actually occured. <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Aug. 5, 2022","content":"DATE"},{"type":"India’s Directorate of Enforcement","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"India","content":"LOCATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"$8 million","content":"MONEY"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"},{"type":"Saturday","content":"DATE"},{"type":"40%","content":"PERCENT"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}