{"summary":"The two co-founders of Centra Tech, a Floria-based ICO, have been indicted for securities fraud and other related offenses after they allegedly didn’t use the ICO proceeds for their original intention\nThe US Attorney’s office handling the case filed a motion to compel, asking the judge to force the defendants to answer whether they indent to build a defense on alleged “advice of counsel” for any of the charges \nThe co-founders were allegedly advised by a man who leveraged success as an organizer during the Trump campaign to create a fake law career, without actually becoming a lawyer","author":["Nelson Rosario","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/28344\/centra-tech-co-founders-may-claim-advice-of-counsel-defense-in-ongoing-criminal-case","publishDate":"2019-06-22T08:45:54","id":581,"type":null,"title":"Centra Tech co-founders may claim advice of counsel defense in ongoing criminal case","category":["Legal"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1] United States v. Sohrab Sharma et al., Case №18-cr-340-LGS (S.D.N.Y. filed June 14, 2019)[NMR]<\/strong><\/em>","We’ve got a real wacky Centra Tech related update. For those that need a refresher, Centra Tech was the ICO out of Florida that had celebrity endorsements from none other than DJ Khaled and Floyd Mayweather. The idea behind Centra Tech was to use the ICO proceeds to build a crypto-backed debit card, and, well, that allegedly didn’t really happen, and now the two co-founders have been indicted for securities fraud and other related offenses.","This most recent filing in this criminal case is a motion to compel filed by the U.S. Attorney’s office handling the case. In particular, the U.S. Attorney is asking the judge to force the two defendants to “disclose whether they intend to assert any defense based on alleged advice of counsel to any of the crimes charged in the Indictment, and if so, to produce all discovery relating to such a defense.”","What is an “advice of counsel” defense? You can probably guess at the gist. It’s the argument you make that you were relying upon advice that your attorney gave you, and as such you shouldn’t be held accountable for your alleged criminal activity. Generally, there are a couple of catches to the defense. You have to give the attorney in question all the material facts related to your question, and you have to rely on said advice in good faith. If you don’t do those things than you can’t later claim “legal cleared it!” Additionally, as the prosecution in this case argues to the judge in their motion, if you are going to assert this defense you are probably going to have to give up communications with the attorney that would normally be covered by attorney-client privilege, because how else can a determination be made as to whether you were justified in relying on that advice?","That brings us to our Centra Tech co-founders. The SEC began an investigation of the duo in Q4 of 2017, at the same time as the criminal investigation. Discovery commenced in 2018, and has continued into 2019. During the discovery process multiple contacts to an attorney in New York, and a purported attorney in New York were discovered.","At multiple times in the discovery process the defendants said they relied on the advice of the attorney, and the purported attorney. Who is the attorney in question? Turns out it was an attorney who had been disciplined by the NY state bar a month before providing the alleged above to the founders. As for the purported attorney, that is where things get nutty. The purported attorney is allegedly a former college student who gained prominence as a student organizer promoting the 2016 Trump campaign. Allegedly, as the individual in question has a co-pending criminal prosecution, the student in question attempted to parlay their success in politics into a fake law career at a fake law firm as a fake lawyer. If I pitched that in Hollywood I’d be thrown out on my you know what.","The U.S. attorney’s office seeing this happening during discovering made multiple requests of the defendants for all relevant documents and communications between the defendants and the attorney and fake attorney. Those requests were not fulfilled, because the defendants claimed they were still going through the relevant documents. Now, not wanting to be caught off guard at trial, the U.S. attorney’s office is asking the judge to force the defendants to disclose if they plan to assert the defense and disclose anything relevant to the potentially asserted defense.","There is a lot going on here. If the defendants plan to assert the advice of counsel defense it’s hard to see how the judge doesn’t grant discovery. Assuming the defendants do wish to assert the defense and end up having to produce the alleged communications at issue, that will be some interesting reading.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part II of this week's analysis, Crypto Caselaw Minute, is above.<\/em>"],"hashtag":["SEC"]}