{"summary":"Bitcoin and other crypto assets were trading lower early Wednesday morning, as debt ceiling negotiations in the U.S. continue to drag on.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231949\/cryptocurrencies-dip-as-us-debt-ceiling-worries-grip-global-markets","publishDate":"2023-05-24T07:57:32","id":5810,"type":null,"title":"Cryptocurrencies dip as US debt ceiling worries grip global markets","category":["MACRO"],"content":["Cryptocurrency prices were trading lower early Wednesday morning alongside global equities as debt ceiling negotiations in the U.S. continue to drag on and fears of a possible default grip markets.&nbsp;","The price of bitcoin was trading down 1.86% at $26,713 per coin, while ether was trading down 2.14%.&nbsp;","European stocks were also trading lower, with the Stoxx 600 Index trading down 1.66% at 7:13 am EDT. Meanwhile, China's benchmark CSI 300 Index ended the day down 1.38%.","<span data-v-f87c67ca=\"\">Source: Tradingview<\/span>","While House Speaker Kevin McCarthy reported a \"productive\" meeting with President Biden on negotiations to raise the debt ceiling and avoid default, it's not clear to the market if any progress has been made that brings the two sides closer to finalizing a deal. The U.S. faces possible default in early June — a scenario that Treasury Secretary Janet Yellen described to lawmakers has \"highly likely.\"","As for crypto, bitcoin has held up better than most assets, as noted by trading firm QCP in a note released Wednesday.&nbsp;","<span data-v-f87c67ca=\"\">Source: QCP<\/span>","QCP added that the debt ceiling is \"front and centre of all narratives\" currently shaping crypto markets.&nbsp;","\"We believe that the disconnect between BTC holding up vs. other comparable markets, is due to investors having learnt from the recent banking crisis that BTC is the best high-beta hedge against a ‘no-deal’ scenario here,\" the firm said.&nbsp;","\"Although our medium-term bias is for higher BTC, on a deal scenario — we think BTC could quickly sync back with what other macro markets are implying.\"","\"On a ‘no-deal’ scenario however, we will easily take out the year’s highs,\" it concluded.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2.14%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"Kevin McCarthy","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Janet Yellen","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"1.38%","content":"PERCENT"},{"type":"1.86%","content":"PERCENT"},{"type":"EDT","content":"ORGANIZATION"},{"type":"morning","content":"TIME"},{"type":"$26,713","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"1.66%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Biden","content":"PERSON"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}