{"summary":"Hardware wallet maker Ledger has introduced a crypto data card and made key partnerships with major crypto exchanges and an NFT marketplace.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/126914\/ledger-unveils-crypto-debit-card-partners-with-ftx-coinbase-rarible","publishDate":"2021-12-09T05:39:07","id":5814,"type":null,"title":"Ledger unveils crypto debit card, partners with FTX, Coinbase, Rarible","category":["STARTUPS"],"content":["Hardware wallet maker Ledger made a slew of announcements at its inaugural — and now bi-annual — conference Ledger Op3n in Paris today.","Key among them was the reveal of its new crypto debit card, released on the basis that, as Ledger VP of payments Iqbal Gandham put it, “we need to start focusing on spending.” According to the presentation, it’s a Visa card that’s issued by Baanx, an affiliate of Contis Financial Services.&nbsp;","Called the Crypto Life card, it supports a range of cryptocurrencies and can be tracked through Ledger Live, the software companion to Ledger’s range of hardware wallets. Ledger has started a <a href=\"https:\/\/cl-cards.com\/waiting-list\/\" data-v-f87c67ca=\"\">waitlist<\/a> ahead of its launch.","Gandham said the card will convert to crypto at the point of sale, or card owners can request an interest-free credit line for 30 days, based on the crypto they hold. He added that early next year, a card holder will be able to have their salary sent to their account and have it automatically converted into crypto.","Ledger wants to make it safer to send NFTs between wallets.&nbsp;","Charles Hamel, VP of product at Ledger, said onstage that when users make an NFT transaction, they will either blind sign it (meaning they don’t see what data they’re agreeing to share) or they'll see a large “blob of data,” which is meaningless to most people. This is unlike a normal crypto transaction where users can typically see where they’re sending funds to when they approve the transaction.&nbsp;","Ledger’s alternative is to break down the transaction and present what’s going on in its mobile app at the point of signing. Hamel showed a demo where the app provided transaction details, including the destination address and the token being sent.&nbsp;","On top of this, Ledger has integrated Rarible into Ledger Live, so that Ledger owners can access the NFT marketplace to buy and sell NFTs while using the hardware wallet to execute transactions.","Coinbase’s non-custodial wallet, which is called Coinbase Wallet and is distinct from the main exchange’s wallet offering, will provide support for Ledger as its first hardware wallet.&nbsp;","This will enable users to interact with blockchain applications via their web browser and still use their hardware wallet.&nbsp;","Via a pre-recorded video, Max Branzburg, VP of product at Coinbase, said that the exchange is building out support for hardware wallets directly within its non-custodial wallet. He said this will begin with the browser version of its wallet, as opposed to its mobile app.","Ledger Live has also expanded its in-house trading options by introducing FTX into the line up.","The first version of this is a simple non-custodial swap function. This is where Ledger owners can agree to swap their crypto and the funds are taken straight from their wallet and the new funds are sent to the same wallet.","The second version will provide full exchange functionality, including derivatives, although this will be a custodial service. So Ledger owners would need to send their crypto to the exchange in order to make trades.","There is a slight catch. Trades will be more expensive through this service, since Ledger adds a small fee on trades made this way.","This isn’t the only way to exchange crypto on the platform. In June, the app <a href=\"https:\/\/www.theblockcrypto.com\/linked\/108353\/crypto-wallet-ledger-live-paraswap-first-defi-platform\" data-v-f87c67ca=\"\">integrated its first decentralized finance (DeFi) platform ParaSwap<\/a>, enabling users to swap tokens across multiple decentralized exchanges including Uniswap, Curve, Balancer, and Sushiswap, among others.","Ledger’s fifth announcement was an upgrade to its popular Ledger Nano S model, namely the S Plus. One key difference is that it is developer friendly, designed so that developers can test on the actual device itself rather than through an emulator. The other difference is that it has a larger memory capacity.&nbsp;","“Memory is important because, as we bring all these new use-cases to Ledger Live, you need more space,” said Ledger’s chief experience officer Ian Rogers.&nbsp;","He added that the company is working on another hardware project, implying that it might come out in 2022 or 2023.","<em data-v-f87c67ca=\"\">This article has been updated to clarify how the FTX integration will work. Also corrects the timing of Coinbase's integration.<\/em>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Contis Financial Services","content":"ORGANIZATION"},{"type":"Charles Hamel","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Paris","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Max Branzburg","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Ian Rogers","content":"PERSON"},{"type":"Iqbal Gandham","content":"PERSON"},{"type":"Alameda","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Hamel","content":"PERSON"},{"type":"Coinbase Wallet","content":"ORGANIZATION"},{"type":"Balancer","content":"LOCATION"}],"hashtag":["COINBASE","FTX","RARIBLE"],"authors":["Tim Copeland","The Block"]}