{"summary":"The U.K.&#x27;s finance watchdog issued a warning against BitMEX, saying that the exchange is &quot;not authorized&quot; to operate in the country. A BitMEX spokesperson told The Block: &quot;We are working closely with our advisors to assess the situation.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/57838\/bitmex-not-authorized-to-operate-in-uk-says-it-is-working-to-assess-the-situation","publishDate":"2020-03-05T04:11:10","id":5818,"type":null,"title":"BitMEX &#x27;not authorized&#x27; to operate in UK, says it is working to assess the situation","category":["EXCHANGES"],"content":["Crypto derivatives exchange BitMEX is \"not authorized\" to operate in the U.K., according to a warning notice issued by the country's finance watchdog.","The U.K. Financial Conduct Authority (FCA) <a href=\"https:\/\/www.fca.org.uk\/news\/warnings\/bitmex\" data-v-f87c67ca=\"\">published<\/a> the notice on Tuesday, saying that it believes BitMEX has been providing services in the country without its authorization.","\"[BitMEX] is not authorized by us and is targeting people in the UK. Based upon information we hold, we believe it is carrying on regulated activities which require authorization,\" said the FCA.","When reached for comment, a BitMEX spokesperson told The Block: \"We are working closely with our advisors to assess the situation. There is nothing more we can add at this time.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Kraken notice<\/strong><\/span>","The FCA also <a href=\"https:\/\/www.fca.org.uk\/news\/warnings\/kraken\" data-v-f87c67ca=\"\">issued<\/a> a similar warning against Kraken on Tuesday, but it later removed. The Block has learned that the notice was an error on the FCA's part and that Kraken's compliance team is looking into the matter with the FCA.","An FCA spokesperson did not respond to The Block's requests for comment by press time.","Notably, Kraken-acquired futures trading platform Crypto Facilities is regulated by the FCA, according to the watchdog's website.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">More warnings?&nbsp;<\/strong><\/span>","A source with knowledge of the matter told The Block that the FCA could issue more such warning notices against crypto exchanges. Deribit, CoinFLEX, and Bybit could be next, the source said.","A quick search on the FCA's website didn't show that the three exchanges are registered.","Deribit CEO John Jansen told The Block that the exchange is not actively seeking clients in the U.K. or is not actively promoting its services in the country, so “there is no problem at all.”","“To actively offer Deribit services in any other country in the EU would also require registration with the relevant authorities or being regulated. To make it clear: this would be needed in every single country where actively seeking clients. So instead of registering with every authority in the EU, Deribit simply does not actively engage in approaching prospective clients in the EU or operate from the EU,” Jansen added.","As for FCA warnings, Jansen said these are to make citizens aware of non-regulated exchanges. “This is nothing special,” he said, reiterating: “As long as a non-regulated exchange is not actively promoting or operating on UK grounds, there should be no problem.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nNotably, Deribit currently does not serve in the U.S. When asked why the exchange hasn't yet blocked U.K. clients, Jansen said it is \"not needed\" as the U.S., the U.K. and the EU do not have the same laws.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"The U.S. is more aggressive in the sense that their laws state that 'accepting US clients on a non-US regulated platform' can be seen as a crime. Instead in the U.K. or the EU, it simply is not allowed to promote the platform or to operate it from its territory, but if an EU or UK citizen seeks to trade on Deribit, that is allowed, as long as we do not actively try to convince him to do so \/ actively market the platform in the EU or the U.K.,\" Jansen added.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe Block has reached out to CoinFLEX and Bybit for comments and will update this story should we hear back.","Last month, the FCA <a href=\"https:\/\/www.fca.org.uk\/news\/news-stories\/fca-becomes-aml-and-ctf-supervisor-uk-cryptoasset-activities\" data-v-f87c67ca=\"\">became<\/a> a compliance supervisor of crypto activities in the U.K. As a result, all existing and new crypto businesses are required to be registered by the watchdog. The deadline for existing businesses to get registered is January 2021.","<em data-v-f87c67ca=\"\">(<strong data-v-f87c67ca=\"\">UPDATE:<\/strong> This story has been updated to include comments from Deribit CEO John Jansen)<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"U.K","content":"LOCATION"},{"type":"FCA","content":"ORGANIZATION"},{"type":"The U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Crypto Facilities","content":"ORGANIZATION"},{"type":"January 2021","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"U.K.","content":"LOCATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"John Jansen","content":"PERSON"},{"type":"UK","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"U.K. Financial Conduct Authority (FCA","content":"ORGANIZATION"},{"type":"U.S","content":"LOCATION"},{"type":"Jansen","content":"PERSON"}],"hashtag":["BITMEX","KRAKEN"],"authors":["Yogita Khatri","The Block"]}