{"summary":"The ruling party said it intends to postpone crypto tax for two more years and prioritize setting regulatory grounds for the local crypto space ahead of taxing investors.","author":["Danny Park","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277963\/south-koreas-ruling-party-mulls-crypto-tax-delay","publishDate":"2024-02-18T23:21:08","id":582,"type":null,"title":"South Korea’s ruling party mulls further crypto tax delay amid election campaign: report","category":["Regulation"],"content":["<span data-v-f87c67ca=\"\">South Korea’s ruling People Power Party is pushing for another two-year delay of taxation on cryptocurrency investment gains, potentially promising this as part of its campaign for the upcoming general election in April, according to a local media report.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The right-wing party said it will prioritize establishing a basic regulatory framework for crypto before taxation, and plans to propose a new set of regulations on the crypto industry in the upcoming term, local news outlet Herald Business Daily <\/span><a href=\"https:\/\/news.heraldcorp.com\/view.php?ud=20240219050101\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reported<\/span><\/a><span data-v-f87c67ca=\"\"> Monday.<\/span>","<span data-v-f87c67ca=\"\">The country’s crypto gains tax is currently scheduled to go into effect in January 2025, after being pushed back from the initial starting date of Jan. 1, 2023. Another potential delay would postpone the tax plan to start in 2027.<\/span>","<span data-v-f87c67ca=\"\">As part of its election campaign, the ruling party is considering a new bill that contains key elements for potential crypto regulations that would include setting requirements for crypto custody providers and token listing. The proposed regulations are expected to add to South Korea’s first set of crypto regulations set to go into effect in July.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The party will finalize its core election promises by the end of the month, according to the report. The People Power Party did not immediately respond to The Block’s request for comment.<\/span>","<span data-v-f87c67ca=\"\">Last month, a representative of South Korea’s Ministry of Economy and Finance said that the country’s legislative body should discuss whether to <\/span><a href=\"https:\/\/www.theblock.co\/post\/273280\/south-korea-weighs-crypto-tax-abolition-amid-new-income-tax-regime\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">abolish income tax on crypto assets<\/span><\/a><span data-v-f87c67ca=\"\">, in line with the current administration’s initiative to scrap the planned tax on financial investments such as stocks and funds.<\/span>","<span data-v-f87c67ca=\"\">However, the People Power Party is not considering a complete abolition of the planned taxation, Herald reported.<\/span>","<span data-v-f87c67ca=\"\">In addition to the proposed delay, the party aims to align the crypto tax threshold with that of stocks. While the tax plan imposes a 22% tax on crypto gains exceeding 2.5 million Korean won ($1,875), gains from stock are only taxed when they exceed 50 million won.<\/span>"],"hashtag":["ASIAN PARLIAMENTS","ASIAN REGULATION"]}