{"summary":"It was business before pleasure as Meta debuted its highly anticipated virtual-reality headset.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176358\/meta-prioritizes-work-over-play-when-showcasing-new-vr-headset","publishDate":"2022-10-11T15:47:03","id":5823,"type":null,"title":"Meta prioritizes work over play as it unveils costly new VR headset","category":["GAMING AND METAVERSE"],"content":["It was business before pleasure as Meta debuted its highly anticipated virtual-reality headset.","While bolstering social connections might be the thesis of the Facebook parent’s ultimate mission statement — and the reason it says its investing billions of dollars into building out the metaverse — the company appears to be targeting businesses more so than everyday consumers with its pricey new VR headset.&nbsp;","Available for pre-order as of Tuesday, the Meta Quest Pro VR device will cost $1,499, the company’s CEO Mark Zuckerberg announced at the company’s annual Connect conference. The often derided CEO changed his Facebook profile picture to one with him wearing the new headset.&nbsp;","After spending the early portion of the presentation reveling in the “social shift” occurring within Meta’s version of the metaverse — Zuckerberg and his team saying the top apps on the Quest store are social ones — the pre-recorded video’s focus turned towards aligning with and appealing to enterprise clients potentially less concerned with a heftier price tag. The new headsets costs more than three times the Meta Quest 2, which has a $399 price tag.","<em data-v-f87c67ca=\"\">Source: Meta presentation screenshot<\/em>","“This is a high-end device designed for work and people who want the best experience we can build today,” said Zuckerberg. “We’ve built Quest Pro to be the best device we can make for getting things done.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nMeta announced strategic partnerships with Microsoft, Accenture and Zoom.","The new headset, apparently primed for taking remote work to the next level, comes with features like a “workplace” charging dock and controllers that can also be used as markers for writing on virtual whiteboards. Other technological advancements, like facial tracking, will enable users to power avatars capable of more closely mirroring their emotions and expressions when communicating in virtual spaces.","Meta partnering with software giant Microsoft was likely the biggest announcement. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“We knew early on that we wanted this to be a good device for getting work done,” added Zuckerberg. “Working with Microsoft is a big part of making that happen.”","<em data-v-f87c67ca=\"\">Source: Meta presentation screenshot<\/em>","Microsoft will in part make it possible for workers to access both Microsoft Teams and Microsoft 365 while using their Meta headset, allowing users to meet up with coworkers or work solo in a virtual space.","“At Microsoft we’re incredibly excited about the metaverse and how digital and physical worlds are coming together and transforming everything [including] the way we do work,” Microsoft CEO Satya Nadella said during the presentation.","Meta also revealed it had partnered with global consulting firm Accenture which will aid in orchestrating large-scale virtual events. Accenture CEO Julie Sweet, who mentioned her firm has been working with Microsoft on virtual work solutions since 2019, says Accenture has “deployed” 60,000 Meta Quest 2 headsets.","Ahead of Connect, IDC senior analyst Tom Mainelli said if Meta could strike “partnerships with other big tech companies” it would represent a positive step forward after a year that has seen the company’s market capitalization drop by more than $600 billion; Zuckerberg's personal fortune simultaneously plummeting.","Meta did not say how many people are currently using its headsets to access its flagship social network Horizon Worlds. In February, the company said virtual social network had hit 300,000 users.","As of June of this year, Meta had sold nearly 15 million units of its Meta Quest 2 VR headset, making it the best-selling device of its kind, according to IDC research analyst Francisco Jeronimo.","Meta’s metaverse division, Reality Labs, <a href=\"https:\/\/www.theblock.co\/post\/173839\/metas-zuckerberg-warns-of-hiring-freeze-restructuring-plans-bloomberg\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">posted losses<\/a> of nearly $3 billion in the second quarter of this year.","The company’s metaverse executive Vishal Shah, who appeared in today's presentation alongside Zuckerberg, recently lamented that Meta employee engagement with Horizon Worlds has so far appeared apathetic while complaints from “creators, users, [and] playtesters” suggests the platform was neither “usable” or “well crafted,” according to a leaked memo published by <a href=\"https:\/\/www.theverge.com\/2022\/10\/6\/23391895\/meta-facebook-horizon-worlds-vr-social-network-too-buggy-leaked-memo\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">The Verge<\/a>.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\">IDC's Mainelli says Meta’s huge market share of the VR hardware market may give it a leg up on the competition but success could still be hard to come by. “[M]ost IT Decision Makers don’t really think of Meta as an enterprise-focused company, yet,” he said. “The way forward in commercial could be quite challenging.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nMoving forward, whether in the corporate or consumer spheres, public sentiment could play a role in how successful Meta ultimately is marketing its version of the metaverse. Many analysts wager the sector will be worth close to a trillion dollars a year in the not-too-distant future.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“The biggest challenge is that regulators and many members of the general public seem to be rooting against the company,” said metaverse expert Matthew Ball. “The Metaverse requires billions to be built and invested, and Meta is investing billions at a loss to do so, while maintaining openness that is, today, rare in platforms yet incredibly important.”<br data-v-f87c67ca=\"\">\n<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Julie Sweet","content":"PERSON"},{"type":"billions of dollars","content":"MONEY"},{"type":"$3 billion","content":"MONEY"},{"type":"a trillion dollars","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"$1,499","content":"MONEY"},{"type":"Mark Zuckerberg","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"Horizon Worlds","content":"ORGANIZATION"},{"type":"Zuckerberg","content":"ORGANIZATION"},{"type":"Matthew Ball","content":"PERSON"},{"type":"Accenture","content":"ORGANIZATION"},{"type":"IDC","content":"ORGANIZATION"},{"type":"second quarter of this year","content":"DATE"},{"type":"$399","content":"MONEY"},{"type":"Zuckerberg","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Meta Quest 2","content":"ORGANIZATION"},{"type":"Meta","content":"ORGANIZATION"},{"type":"Satya Nadella","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"Vishal Shah","content":"PERSON"},{"type":"Microsoft Teams","content":"ORGANIZATION"},{"type":"Tom Mainelli","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"Mainelli","content":"PERSON"},{"type":"$600 billion","content":"MONEY"},{"type":"Francisco Jeronimo","content":"PERSON"},{"type":"Reality Labs","content":"ORGANIZATION"}],"hashtag":["VR"],"authors":["RT Watson","The Block"]}