{"summary":"However, with the outlook of three Fed rate cuts, the booming market is facing an existential question — what will happen if interest rates go back to near zero? ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285861\/boom-or-bust-tokenized-rwas-in-the-face-of-easing-interest-rates","publishDate":"2024-04-01T09:01:02","id":583,"type":null,"title":"Boom or Bust? Tokenized RWAs in the Face of Easing Interest Rates","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">Boasting <\/span><a href=\"https:\/\/app.rwa.xyz\/treasuries\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$719 million<\/span><\/a><span data-v-f87c67ca=\"\"> in TVL, tokenization became top of mind for investors amidst the high-interest rate environment of 2023. However, with the outlook of three Fed rate cuts, the booming market is facing an existential question — <\/span><b data-v-f87c67ca=\"\">what will happen if interest rates go back to near zero?&nbsp;<\/b>","<span data-v-f87c67ca=\"\">With evolving macroeconomic circumstances, there are growing doubts about the profitability and sustainability of this asset class given its yield-sensitive design. Yet, a near 0% interest rate scenario might not see a sunset of this niche segment which continues to bring investment opportunities through its design and utility.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">The Zero-Interest Test<\/b>","<span data-v-f87c67ca=\"\">There is no doubt that the on-chain feature of tokenized RWAs will continue to be attractive to more discerning investors, who are searching for relatively liquid (“on-chain”) yet modest avenues to manage their portfolios. These investors will also bank on the increased bond prices, despite lowering yield, arising from safe-haven buying. Additionally, as RWAs brought on-chain diversifies, such as on-chain intermediate and long-term treasuries, risk-averse investors will be able to generate competitive returns over time by tapping into a range of maturities.<\/span>","<span data-v-f87c67ca=\"\">Beyond passive yield, some point to potential arbitrage opportunities between 0% off-chain rates and potentially rising on-chain rates once stimulus trickles down into the on-chain ecosystem. These views also anticipate a tangible increase in demand from CeFi lending activities, such as trading firms looking to take “free money” from the table as seen during previous bull markets with low interest rates.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Worth More than Yield&nbsp;<\/b>","<span data-v-f87c67ca=\"\">Another value proposition of tokenized RWA that will secure its future is the ability to serve as a collateral-backing tool commonly found in the TradFi world.<\/span> <span data-v-f87c67ca=\"\">Tokenised treasuries are known as a high-quality liquid asset for collateral, i.e. smooth on-ramp and off-ramp channels, and there are potential use cases to be expanded into DeFi and CeFi, such as <\/span><a href=\"https:\/\/usdv.money\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">yield-bearing stablecoins<\/span><\/a><span data-v-f87c67ca=\"\">, <\/span><a href=\"https:\/\/x.com\/term_labs\/status\/1735080811005698223?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">collateralised loans<\/span><\/a><span data-v-f87c67ca=\"\"> and margin trading.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The asset also opens the door to diversifying TradFi collaterals brought on-chain, such as mortgages and automobiles, akin to collateral loans in TradFi. This broadens on-ramp routes for more investors to explore the potential of on-chain activities and, in turn, expands the ecosystem.<\/span>","<b data-v-f87c67ca=\"\">Fortifying the Future<\/b>","<span data-v-f87c67ca=\"\">Tokenized RWAs and their recent adoption trend proved that there are extensive synergies between TradFi and DeFi. Now, the future of RWAs holds promise with greater financial utility.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">To fully materialize the potential of tokenized RWAs, the industry should continue to explore ways to ensure the sustainability and stability of the ecosystem. One way would be to enhance the infrastructural design and build the right integration and composability features to drive adoption, ultimately harnessing sufficient network effects to tide through the rate falls. They can also embed <\/span><a href=\"https:\/\/chain.link\/education\/cross-chain\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">native cross-chain capabilities<\/span><\/a><span data-v-f87c67ca=\"\"> to increase utility and unlock new use cases.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">With advanced design models and novel approaches, the allure of tokenized RWAs in a near-zero interest rate environment would be magnified — serving as a gateway to a next-gen financial architecture.&nbsp;<\/span>","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Matrixport <\/i><i data-v-f87c67ca=\"\">and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$719 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"Fed","content":"ORGANIZATION"},{"type":"Matrixport","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"0%","content":"PERCENT"}],"hashtag":[],"authors":["Sponsored","The Block"]}