{"summary":"This increase in dominance is underpinned by bitcoin&#x27;s year-long rally, which has seen its price rise by 81% since the beginning of the year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/258844\/bitcoin-dominance-hits-highest-point-in-over-two-years","publishDate":"2023-10-21T15:51:37","id":5831,"type":null,"title":"Bitcoin dominance hits highest point in over two years","category":["CRYPTO ECOSYSTEMS"],"content":["Bitcoin’s dominance in the cryptocurrency market has surged to over 49%, its highest level in more than two years, according to The Block’s data dashboard.<br data-v-f87c67ca=\"\">\n&nbsp;","&nbsp;","Bitcoin's dominance in the cryptocurrency market has increased to over 49%, marking its highest point in more than two years, according to The Block's <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/bitcoin-dominance\" data-v-f87c67ca=\"\">data dashboard<\/a>.&nbsp;","Bitcoin's dominance has experienced a steady rise, moving from approximately 38% at the start of this year to reach 48.85% on October 21, marking the highest level observed since April 2021. This surge in dominance can be attributed to a year-long rally in bitcoin, with the cryptocurrency's price surging by 81% since the beginning of the year.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/bitcoin-dominance\/embed\" title=\"Bitcoin Dominance\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","As noted by The Block Research's Rebecca Stevens, the increase in dominance reflects the crypto \"is holding strong in current market conditions and has actually been performing well for much of this week.\"","\"Inflation woes, geopolitical risk, and an increasingly partisan U.S. government have been weighing on investors who are looking to minimize risk,\" Stevens added. \"Meanwhile,&nbsp;<span class=\"il\" data-v-f87c67ca=\"\">bitcoin<\/span>&nbsp;seems closer than ever to getting a spot ETF approval and in a certain sense serves as an ideological hedge to the uncertainty on the world stage, helping it reclaim more&nbsp;<span class=\"il\" data-v-f87c67ca=\"\">dominance<\/span>&nbsp;in the&nbsp;<span class=\"il\" data-v-f87c67ca=\"\">crypto<\/span>&nbsp;space.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"81%","content":"PERCENT"},{"type":"Rebecca Stevens","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"49%","content":"PERCENT"},{"type":"38%","content":"PERCENT"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"April 2021","content":"DATE"},{"type":"48.85%","content":"PERCENT"},{"type":"October 21","content":"DATE"},{"type":"Stevens","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}