{"summary":"A stablecoin bill, considered low-hanging fruit among other crypto bills, has hit a roadblock, with time running out to get it to a vote.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283794\/stablecoin-bills-2024-passage-looks-bleak-as-talks-stall-and-time-dwindles","publishDate":"2024-03-20T16:05:44","id":5832,"type":null,"title":"Stablecoin bill&#x27;s 2024 passage looks bleak as talks stall and time dwindles","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">A stablecoin bill, considered low-hanging fruit among other crypto bills, has hit a roadblock, with time running out to get it to a vote.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Talks among lawmakers have been in a holding pattern for months as election season nears, making passing bills in Washington close to impossible, sources on Capitol Hill told the Block.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">A stablecoin bill led by House Financial Services Committee Chair Patrick McHenry, R-N.C., advanced out of that committee over the summer. However, it was caught up in bipartisan bickering, with Congressional Republicans blaming the White House for opposition to the bill. At the time, top Democrat Maxine Waters of California <\/span><span class=\"s2\" data-v-f87c67ca=\"\">said the bill was \"deeply problematic\" due to a <a href=\"https:\/\/www.theblock.co\/post\/241749\/us-stablecoin-talks-stall-as-senior-house-republican-blames-white-house\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">provision<\/span><\/a> that allows state regulators to approve stablecoin issuances without Federal Reserve input.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Since then, Waters and McHenry have met more often, but disagreement remains on who should be the primary regulator for stablecoin issuers.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">There is a \"workable frame\" McHenry said on Wednesday at Coinbase's Update the System Summit.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"We're in the phase where we can see the airport, we can see where we're going to land the plane, we can see how we're going to land the plane, we just don't know when we can land the plane,\" McHenry said. \"We need a legislative vehicle, we need a deadline and we can drive the stickier issues if we have a deadline.\"<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">He added that the chances of landing a stablecoin bill increase after the government has been funded. Waters did not respond to a request for comment.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Cody Carbone, <\/span><span class=\"s2\" data-v-f87c67ca=\"\">vice president of policy for the Chamber of Digital Commerce, confirmed that <\/span><span class=\"s1\" data-v-f87c67ca=\"\">Waters and McHenry went from meeting monthly to just about weekly but added that, after speaking with “drafters on both sides of the aisle on McHenry and Waters' teams is that we're really not anywhere closer on that.\" Nonetheless, while saying that talks have progressed,&nbsp; “we're still not anywhere closer on some of those substantive issues,\" Carbone said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">When asked how likely the stablecoin bill will pass the full House of Representatives, Carbone said its chances could be as much as 50% but gave it only 5% of becoming law.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"There's a lot of dynamics at play,\" Carbone said. \"If we get a bipartisan House bill, they come to some great agreement and grand bargain, and it passes the House with 400 votes, it would be very hard for the Senate to ignore that.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Sens. Kirsten Gillibrand, D-N.Y., and Cynthia Lummis, R-Wyo., plan to announce a stablecoin bill they have been working on for months that aims to provide clarity around stablecoins and protect consumers.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">A source familiar with the situation said the bill's details and strategy for completing it are unclear, calling the circumstances frustrating.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">A person familiar with the situation told The Block that talks around that bill had fallen through, but a spokesperson for Sen. Lummis said that wasn't so.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">\"That notion couldn’t be further from the truth,\" the spokesperson said. \"Providing regulatory clarity around stablecoins that enables continued innovation right here in the United States is a top priority for both Senators Lummis and Gillibrand, and our staff continue to meet every day to negotiate legislation that achieves that goal.\"<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">The administration is willing to move forward with stablecoin legislation, making it \"by far the most optimal portion of this to move forward,\" Sen. Lummis said on Wednesday at the Coinbase event. Lummis said there is a bipartisan effort, in part because Senate Majority Leader Chuck Schumer is willing to consider such a bill and that both Sens. Gillibrand and Lummis have stayed in touch with the House side.<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">\"I'm most optimistic for calendar year 2024 on stablecoins,\" Lummis said.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">Some stakeholders are also encouraged that there are efforts in both the Senate and House on a stablecoin bill.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">\"We have a limited number of legislative vehicles remaining before the end of the year, but there is clear motivation from all parties to get this done, so we are optimistic,\" said Ryan Eagan, associate director of government affairs at the Crypto Council for Innovation.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Elsewhere, the Senate Banking Committee has been focusing on other issues, such as housing and crypto itself is not seen as one of Chair Sherrod Brown's, D-Ohio, priorities.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">For the past few months, there have been reports of a potential package of bills that could lead to some compromise and eventual action, said Ron Hammond<\/span><span class=\"s2\" data-v-f87c67ca=\"\">, director of government relations at the Blockchain Association. For example, <\/span><span class=\"s1\" data-v-f87c67ca=\"\">Senate Democrats have been pushing for a marijuana banking bill called the Secure and Fair Enforcement Regulation Banking Act that could trade interests with a stablecoin bill. The bill would allow financial institutions to provide services to the marijuana industry. Another bill in the mix could be the Recovering Executive Compensation from Unaccountable Practices, dubbed the RECOUP Act,&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The hope is that maybe a package comprised of the large priorities for each Chair, even though people don't agree on everything, will be enough for folks to stomach, and then maybe they can advance a big package of bills and high priorities for a lot of members before summer kicks in, and it's back to the election cycle,\" Hammond said.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Even if the Senate were to advance any legislation, it would face a House that remains in gridlock. Republicans hold a slim, two-vote majority following the immediate retirement of Rep. Ken Buck, R- Colo., last week. If the Senate does reach a compromise on stablecoins and marijuana banking, the marijuana banking bill may have a hard time getting buy-in from House Speaker Mike Johnson, R-La. Johnson has repeatedly opposed the bill, according to multiple news reports.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Ultimately, work on advancing a stablecoin bill may come down to seeing how much lawmakers can achieve before the election to position themselves for the next Congress, said the Chamber of Digital Commerce's Carbone.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Maybe we can't pass them by December 31, but maybe we get them to a really good place,” Carbone said. “Or then we kick off the 119th Congress next January and we've got some almost near-final products.\"<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span><\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"December 31","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Crypto Council for Innovation","content":"ORGANIZATION"},{"type":"Sherrod Brown","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Colo.","content":"LOCATION"},{"type":"50%","content":"PERCENT"},{"type":"White House","content":"ORGANIZATION"},{"type":"Hammond","content":"PERSON"},{"type":"House of Representatives","content":"ORGANIZATION"},{"type":"Lummis","content":"PERSON"},{"type":"House Financial Services Committee Chair Patrick McHenry","content":"ORGANIZATION"},{"type":"Ron Hammond","content":"PERSON"},{"type":"Carbone","content":"PERSON"},{"type":"Kirsten Gillibrand","content":"PERSON"},{"type":"Ken Buck","content":"PERSON"},{"type":"Ryan Eagan","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Senate Banking Committee","content":"ORGANIZATION"},{"type":"Mike Johnson","content":"PERSON"},{"type":"Cynthia Lummis","content":"PERSON"},{"type":"McHenry","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"N.Y.","content":"LOCATION"},{"type":"Chuck Schumer","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Chamber of Digital Commerce","content":"ORGANIZATION"},{"type":"Washington","content":"LOCATION"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Cody Carbone","content":"PERSON"},{"type":"Wyo.","content":"LOCATION"},{"type":"January","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Coinbase's Update the System Summit","content":"ORGANIZATION"},{"type":"Ohio","content":"LOCATION"},{"type":"House","content":"ORGANIZATION"},{"type":"119th Congress","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"La","content":"LOCATION"},{"type":"Gillibrand","content":"PERSON"},{"type":"end of the year","content":"DATE"},{"type":"Democrat Maxine Waters of California","content":"ORGANIZATION"},{"type":"McHenry","content":"PERSON"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":["HOUSE FINANCIAL SERVICES COMMITTEE","SENATE BANKING COMMITTEE"],"authors":["Sarah Wynn","The Block"]}