{"summary":"With a broad investable universe, it’s no wonder that nascent asset classes like cryptocurrencies are treated with some skepticism.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/227762\/collaborate-today-to-safeguard-cryptos-future","publishDate":"2023-04-26T09:00:17","id":5833,"type":null,"title":"Collaborate today to safeguard crypto’s future","category":["SPONSORED"],"content":["With a broad investable universe, it’s no wonder that nascent asset classes like cryptocurrencies are treated with some skepticism. While headline-grabbing news can make this skepticism seem justified, market history shows that bumps occur along the path to asset class maturation as well as in established asset classes. History also shows us that what’s needed for maturing asset classes is collaborative action from business and regulators. Only then can markets stabilize and strengthen rather than be derailed.","<strong data-v-f87c67ca=\"\">History doesn’t repeat itself, but it does rhyme<\/strong><br data-v-f87c67ca=\"\">\nBefore we look forward, let’s look back to the derivatives market in the 1990’s. The derivatives market was overcomplicated for many, a magnet for some, akin to what we see in more nascent asset classes today, however, was also subject to a record-breaking shock due to a ‘rogue trader’. Billions of dollars were lost, a once golden boy fell from grace, and shockwaves rippled through the financial system including toppling a bank.","The vulnerabilities in the market were larger than one major scandal, however. Protections were needed to safeguard not only from bad actors, protect participation, but enable innovation to flourish. Only then can a market move beyond the early adopters to benefit a wider mix of participants, including those who are more skeptical of new ideas or complexity (real or perceived).Here is what came next for derivatives. Futures market regulators and relevant exchange officials came together to develop market and customer protections. Importantly, the industry also weighed into the debate on reforms, so that the proposals that would be implemented were both significant enough to protect customers whilst not being overly prohibitive, i.e. over-correcting and eroding the asset class’s potential.","Due in part to this collaboration, sensible measures and regulations were put place to minimize the potential of future blow-ups. Measures which addressed risk management, credit risk, liquidity risk, internal controls and more. It is thanks to these measures that &nbsp;the derivatives markets became safer, more resilient and transparent, and importantly, more accessible. Today they are &nbsp;&nbsp;a main stay of capital markets. &nbsp;This is one example of how the financial industry has flourished under the supervision of regulatory authorities. Digital assets would be no different. Sensible regulatory frameworks simply work.","LMAX Group takes the view that crypto, tokenisation and blockchain technology will be the foundation on which the financial markets of the future will sit.","To get there, what we need today is collaboration. Industry and policy makers must be in dialogue to create regulation that works for both sides. At LMAX Group we are engaging the relevant people and encourage those throughout the industry to do the same. From a regulatory point of view, there are foundation financial services frameworks to build from and whilst the asset class is new, many of the issues it faces are not.","Let’s take what we can learn from the past and across broader markets and apply it so we can keep creating fairer financial markets of the future.","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by LMAX <\/i><i data-v-f87c67ca=\"\">and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"1990","content":"DATE"},{"type":"LMAX Group","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"ups","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}