{"summary":"The Tornado DAO is currently brainstorming ideas on how to fight the US Sanctions imposed on Tornado Cash.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/163220\/tornado-cash-community-discussing-legal-avenues-to-challenge-us-sanctions","publishDate":"2022-08-12T08:19:35","id":5835,"type":null,"title":"Tornado Cash DAO discusses legal avenues to challenge US sanctions","category":["GOVERNANCE"],"content":["Tornado DAO members are currently discussing ways the community can challenge the recent <a href=\"https:\/\/www.theblock.co\/post\/162105\/us-treasury-sanctions-cryptocurrency-mixer-tornado-cash\" data-v-f87c67ca=\"\">sanctions imposed on Tornado Cash<\/a> by the US Treasury. This comes as one Tornado Cash developer was arrested today in Amsterdam.","Tornado DAO is the decentralized autonomous organization that governs the protocol’s treasury. It has over 9,000 members according to data from DeepDAO but only 163 members are active participants in its governance activities according to SnapShot data.","One of these active participants introduced a <a href=\"https:\/\/torn.community\/t\/saving-tornado-cash-formally-challenging-the-us-treasurys-sanctions\/3014\/6\" data-v-f87c67ca=\"\">proposal<\/a> titled “Saving Tornado Cash: Formally Challenging the US Treasury’s Sanctions.” The proposer advised the DAO to raise funds on behalf of Tornado Cash and hire a legal team to fight the sanctions. The proposal also called on the DAO to mount a legal challenge up to the US Supreme Court if necessary.","According to the proposer, successfully overturning the sanctions could set a precedent for other crypto privacy solutions like Tornado Cash. The proposal called on the DAO to leverage the US legal system even if crypto users are skeptical of government protocols.","Another community member suggested that the DAO's governance should administer any legal defense fund on-chain. There were also calls for the DAO to hold an on-chain vote to select a suitable law firm to represent the community in the legal process.&nbsp;","Some respondents to the proposal have, however, raised questions about this approach. MakerDAO delegate Chris Blec argued that since there is no legal entity called “Tornado Cash,” raising funds under such a banner for legal defense could “open up a whole new can of worms that is misleading and dangerous.” Blec stated that Tornado Cash is software code and that the best approach would be to fight for an individual's right to privacy.","Other respondents also called for Tornado Cash to be forked — using the protocol’s code to create other variants of the service. Proponents of this approach say it will help to further decentralize users’ right to privacy in using a crypto mixing service.","This approach does have one major disadvantage. Tornado’s effectiveness as a privacy tool for crypto transactions comes from its significant “anonymity set.” An anonymity set is a large number of similar entities that are not easily distinguished from one another by an observer.","In Tornado Cash’s case, the anonymity set is the collection of similar transaction inputs and outputs being mixed together. Before the sanctions, Tornado Cash functioned as a central hub for crypto mixing which allowed for large liquidity. This significant liquidity is what creates the anonymity set for users to ensure privacy. Yet the protocol has already seen a <a href=\"https:\/\/www.theblock.co\/post\/163019\/tornado-cash-hit-by-79-decline-in-deposits-as-users-rush-for-the-exit\" data-v-f87c67ca=\"\">79% decline in deposits since<\/a> the sanctions were imposed.","“For a privacy protocol like Tornado Cash to be effective you need a ‘central’ implementation that as many people are using as possible, if multiple implementations are being used and liquidity is fractured it’s much easier to de-anonymize individual users,” said the DAO member who submitted the proposal.","As a result, it's unlikely that such alternative versions of the protocol would be able to generate enough liquidity quickly enough to succeed — and other protocols and exchanges might be wary to interact with them since they could end up facing the same sanctions.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"US Treasury","content":"ORGANIZATION"},{"type":"Amsterdam","content":"LOCATION"},{"type":"US Supreme Court","content":"ORGANIZATION"},{"type":"79%","content":"PERCENT"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Chris Blec","content":"PERSON"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}