{"summary":"“Keeping barriers to entry low” mantra seems to have paid off well for cryptocurrency exchange Binance. The exchange has just crossed a whopping $1","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/43564\/binance-just-crossed-1-billion-in-cumulative-profit","publishDate":"2019-10-17T05:45:10","id":5836,"type":null,"title":"Binance just crossed $1 billion in cumulative profit","category":["EXCHANGES"],"content":["“Keeping barriers to entry low” mantra seems to have paid off well for cryptocurrency exchange Binance. The exchange has just crossed a whopping $1 billion in cumulative profit as of Sept. 30, 2019, according to The Block’s research.","Binance <a href=\"https:\/\/www.binance.com\/en\/blog\/391462665575727104\/9th-BNB-Burn-Q3-2019-Recap-from-CZ\" data-v-f87c67ca=\"\">today completed<\/a> a ninth quarterly burn of its native token Binance Coin (BNB), according to a blog post by the exchange’s CEO, Changpeng Zhao “CZ.”&nbsp; The burn involved 2,061,888 BNB tokens (worth nearly $36.7 million).","The USD value of Q3 burn is nearly the same as the value of Q2 and Q1 burns combined. In Q2, Binance burned 808,888 BNB tokens, while in Q1, it burned 829,888 tokens, totaling to 1,638,776 tokens.","","","<span data-v-f87c67ca=\"\">Source: Binance<\/span>","Binance burns BNB tokens worth 20% of its profits every quarter. Since it burned $36.7 million worth of tokens in Q3, we can deduce that it made approximately $183.5 million in profit in Q3 alone. And if we look at all the nine burns to date, the <a href=\"https:\/\/www.theblockresearch.com\/binance-recorded-its-second-best-quarter-ever-brought-186-million-in-profit-43560\" data-v-f87c67ca=\"\">cumulative profit<\/a> has crossed a whopping $1 billion-mark.","","","<span data-v-f87c67ca=\"\">Source: The Block Research<\/span>","CZ said in the blog post multiple times that Binance likes to “keep barriers to entry low” for all its products and services so that retail investors can easily access them. These include offering lower or no trading fees and easier user-interface, among other benefits.","Binance has launched at least 20 new offerings in the second half of this year alone, as <a href=\"https:\/\/www.theblockcrypto.com\/daily\/42731\/behind-binances-20-news-announcements-in-h2-2019-its-ambition-to-retract-lost-markets-and-snatch-new-one\" data-v-f87c67ca=\"\">The Block reported<\/a> this week. These announcements largely centered around three themes - venturing in China, the U.S. and expanding into the derivatives space.","It is interesting to see that despite the larger cryptocurrency market remains in a bearish mood, Binance’s ship has been sailing smoothly. While Binance’s trading volumes have been lower these past few months, the increasing profit could be coming from different avenues it has diversified into - such as futures trading platform and peer-to-peer (P2P) over-the-counter trading facility in China, <a href=\"https:\/\/www.theblockresearch.com\/binance-recorded-its-second-best-quarter-ever-brought-186-million-in-profit-43560\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">according to The Block's research director<\/a> Larry Cermak.","Binance <a href=\"https:\/\/www.theblockcrypto.com\/post\/38204\/binance-acquires-cryptocurrency-trading-platform\" data-v-f87c67ca=\"\">launched<\/a> a futures trading platform a month ago, and CZ said in the blog post that the platform is already at number 2 position in the market by trading volumes, just after BitMEX.","“Binance Futures has already recorded higher volumes than the Binance spot market, less than one month after its launch,” said CZ, adding: “We expect their [Binance Futures’] contributions to kick in for Q4, along with our newest services such as P2P trading.”","“Our direction for Binance has always been clear. [...] We will continue to hunker down, and BUIDL,” concluded CZ in the blog post.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"second half of this year","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$36.7 million","content":"MONEY"},{"type":"Changpeng Zhao “CZ","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"USD","content":"ORGANIZATION"},{"type":"$183.5 million","content":"MONEY"},{"type":"Larry Cermak","content":"PERSON"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Sept. 30, 2019","content":"DATE"},{"type":"Binance Futures","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"China","content":"LOCATION"}],"hashtag":["BINANCE","BNB","CZ"],"authors":["Yogita Khatri","The Block"]}