{"summary":"Optimism, the Ethereum scaling startup that is building a Layer-2 solution using a tool called optimistic rollup, has released the limited testnet.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/78813\/ethereum-scaling-optimism-releases-limited-testnet-layer2","publishDate":"2020-09-25T02:55:22","id":5837,"type":null,"title":"Ethereum scaling startup Optimism releases limited testnet of its Layer-2 solution","category":["ETHEREUM"],"content":["Optimism, the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/68593\/the-sender-of-5-million-ethereum-transaction-fees-has-revealed-itself\" data-v-f87c67ca=\"\">Ethereum<\/a> scaling startup that is building a Layer-2 solution using a tool called optimistic rollup, has released the limited testnet of its network.&nbsp;","Optimism <a href=\"https:\/\/medium.com\/@optimismPBC\/light-at-the-end-of-the-tunnel-c390a05bbcb8\" data-v-f87c67ca=\"\">said<\/a> it has opted for a gradual release process, where its network will be integrated with a small cohort of decentralized applications (dapps) one at a time, in order to \"best isolate bugs.\"","The first dapp to integrate with Optimism’s limited testnet is decentralized synthetic-asset exchange Synthetix. The exchange will incentivize its users to test Optimism’s network with 200,000 SNX tokens. That is about $930,000 in total rewards (one SNX token is currently priced at about $4.65).","“There are no words for how grateful we are to Synthetix for the opportunity to truly test our code in an environment that is as close to mainnet as possible, where serious value is in play,” said Optimism.","Other projects that have wished to test Optimism's network are top decentralized exchange Uniswap and decentralized price oracle Chainlink.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThere are four phases in which Optimism would be releasing its testnet and reach toward mainnet: Phase A, Phase B, Security drill, and Phase C.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","In Phase A, no deposits or withdrawals will be enabled. It will only allow airdrop tokens into L2 Goerli and enable participants to mint and burn sUSD (Synthetix’s stablecoin), and claim staking rewards.","In Phase B, deposits will be enabled, as well as airdrop of L1 Goerli SNX to participants. Users will be able to increase their staked SNX if they perform a deposit.","In the security drill phase, Optimistic Virtual Machine (OVM) contracts will be upgraded to add verification abilities. “We’ll actively commit fraud and reward the users who successfully submit a fraud proof,” said Optimism.","In the last Phase C, withdrawals will be enabled and participants will have to perform a successful withdrawal to receive their testnet rewards on mainnet. Optimism didn't reveal specific timelines for these phases.","Formerly known as non-profit Plasma Group, Optimism <a href=\"https:\/\/www.theblockcrypto.com\/post\/53017\/plasma-group-researchers-raise-3-5m-from-paradigm-and-ideo-to-start-new-company\" data-v-f87c67ca=\"\">rebranded and turned<\/a> to a for-profit startup last year, to entirely focus on Ethereum scaling. Optimism is backed by Paradigm and IDEO CoLab Ventures and has raised $3.5 million to date.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Goerli","content":"PERSON"},{"type":"Plasma Group","content":"ORGANIZATION"},{"type":"IDEO CoLab Ventures","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$930,000","content":"MONEY"},{"type":"$4.65","content":"MONEY"},{"type":"$3.5 million","content":"MONEY"},{"type":"Phase C.","content":"ORGANIZATION"}],"hashtag":["ETHEREUM","OPTIMISM","UNISWAP"],"authors":["Yogita Khatri","The Block"]}