{"summary":"A bill giving police in the UK more powers to seize illicit crypto assets has been passed to the final approval stages.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/251910\/uk-bill-to-seize-illicit-crypto-moves-to-final-stages-of-approval","publishDate":"2023-09-19T14:07:11","id":5842,"type":null,"title":"UK bill to seize illicit crypto moves to final stages of approval","category":["POLICY"],"content":["The UK's <a href=\"https:\/\/bills.parliament.uk\/bills\/3339\" data-v-f87c67ca=\"\">Economic Crime and Corporate Transparency Bill<\/a> has been passed to the final stages of approval by the House of Lords.","If final approval is granted later this year, it will give local authorities more power to freeze and confiscate crypto assets associated with crime.","The bill will give local courts and law enforcement agencies new powers to quickly seize crypto assets used to launder money, traffic drugs, commit cybercrime or facilitate terrorism offences. The new legislation eliminates <a href=\"https:\/\/www.theblock.co\/linked\/144486\/panama-assembly-passes-bill-to-permit-use-of-crypto-assets-report\" data-v-f87c67ca=\"\">specific legal hurdles<\/a> that currently slow the process of asset seizure, and provisions in the bill allow digital assets linked to criminal activities to be seized by authorities under the Proceeds of Crime Act 2002.","Currently, crypto assets that are associated with illegal activities can be frozen but cannot be seized in criminal proceedings unless there is an arrest or conviction.&nbsp;","The Bill was introduced in September 2022. Since then it has progressed through the House of Commons to the House of Lords, and is currently in the final stages of approval. To become law, it needs to go through a <a href=\"https:\/\/bills.parliament.uk\/bills\/3339\" data-v-f87c67ca=\"\">final assessment<\/a> by the House of Commons and then be granted Royal assent by King Charles.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"King Charles","content":"PERSON"},{"type":"UK","content":"ORGANIZATION"},{"type":"Corporate Transparency Bill","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2002","content":"DATE"},{"type":"September 2022","content":"DATE"},{"type":"House of Lords","content":"ORGANIZATION"},{"type":"House of Commons","content":"ORGANIZATION"}],"hashtag":[],"authors":["Brian McGleenon","The Block"]}