{"summary":"It is more likely that wallets that could support a British digital currency will be produced by the private sector. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/133153\/bank-of-england-is-highly-unlikely-to-develop-a-retail-wallet-for-cbdc-says-official","publishDate":"2022-02-05T11:39:34","id":5844,"type":null,"title":"Bank of England is ‘highly unlikely’ to develop a retail wallet for CBDC","category":["CENTRAL BANKS"],"content":["The Bank of England is exploring whether to issue a so-called CBDC and will set out the merits of doing so this year.","But the UK central bank does not appear to be considering the launch of a retail-facing wallet for such a currency.","A senior manager at the Bank of England says the 327-year-old institution is “highly unlikely” to develop a retail-facing wallet that could be used to store and spend digital currency.&nbsp;","The question of whether the United Kingdom’s central bank will issue a so-called Central Bank Digital Currency (CBDC) is far from settled. The Bank <a href=\"https:\/\/www.bankofengland.co.uk\/news\/2021\/november\/statement-on-central-bank-digital-currency-next-steps\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">plans to publish a consultation paper<\/span><\/a> setting out its assessment of the merits of what some have dubbed the ‘Britcoin’ later this year.&nbsp;","But while CBDC issuance remains an open question, the launch of an accompanying wallet appears to have been ruled out.&nbsp;","“I think it’s safe to say it’s highly unlikely that the Bank would issue a retail wallet,” said Katie Fortune, a senior manager in the central bank’s CBDC unit. Fortune said it is more likely that wallets that could support a British digital currency will be produced by the private sector.&nbsp;","That is not the case elsewhere, however. A pilot version of e-CNY, the mobile wallet for China’s digital yuan, went live on iOS and Android app stores in January. In El Salvador, citizens are encouraged to use <a href=\"https:\/\/www.theblockcrypto.com\/post\/131452\/el-salvadors-chivo-wallet-keeps-breaking-and-users-are-seeking-answers\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">state-backed wallet Chivo<\/span><\/a> to manage their bitcoin, which was made legal tender in the country last year.&nbsp;","Wallets aside, most other technical questions relating to the Bank of England’s CBDC work remain open.","It is not yet even clear, according to Fortune, whether any CBDC issued by the central bank would need to be underpinned by blockchain technology — a form of digital ledger that supports most major cryptocurrencies.&nbsp;","“That’s still a really open question for us. It’s not taken as a given that it is built on a blockchain, it’s not taken that it’s not,” she said, adding that the Bank has been canvassing a wide range of views through its <a href=\"https:\/\/www.bankofengland.co.uk\/news\/2021\/september\/membership-of-cbdc-engagement-and-technology-forums\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">CBDC forums<\/span><\/a>, whose members include representatives from banks, fintech firms and academics.&nbsp;","If the central bank chooses to move forward with a CBDC after publishing its consultation paper later this year, it would then enter a development phase that would involve “working up some prototypes,” Fortune said. She does not see a CBDC launching in the UK until 2025 at the earliest.&nbsp;&nbsp;","One consideration for the Bank of England as it continues to explore a CBDC launch is what impact such a currency may have on commercial banks in the UK.&nbsp;","Sir John Cunliffe, deputy governor of the Bank of England, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/84530\/boe-central-bank-digital-currencies-deputy\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">said in November 2020<\/span><\/a> that it is not the job of central banks to protect commercial banks from the impact of digital currencies. Fortune echoed that point.","“Financial stability is [the Bank’s responsibility] — it’s one of our mandates,” she said. “But preserving current business models isn’t. So we do care, but it’s not that things must stay the same.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2025","content":"DATE"},{"type":"El Salvador","content":"LOCATION"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Katie Fortune","content":"PERSON"},{"type":"John Cunliffe","content":"PERSON"},{"type":"fintech","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"Central Bank Digital Currency (CBDC)","content":"ORGANIZATION"},{"type":"CBDC","content":"ORGANIZATION"},{"type":"Bank","content":"ORGANIZATION"},{"type":"Bank of England’s CBDC","content":"ORGANIZATION"},{"type":"United Kingdom","content":"LOCATION"},{"type":"China","content":"LOCATION"},{"type":"November 2020","content":"DATE"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}