{"summary":"The cost of transacting on Ethereum has significantly declined since 2021, but users and activity has increased.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/172532\/ethereum-transaction-costs-have-fallen-sharply-since-last-november","publishDate":"2022-09-25T14:00:48","id":5845,"type":null,"title":"Ethereum transaction costs have fallen sharply since last November","category":["ETHEREUM"],"content":["The cost of transacting on the Ethereum network has significantly declined since the eye-popping days of 2021’s DeFi Summer and the subsequent boom in non-fungible token issuances.","Ethereum’s transaction costs have reached the lowest point they have ever been in the past two years, as of Sept. 22, according to <a href=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/average-transaction-fee-on-ethereum\" data-v-f87c67ca=\"\">data from The Block<\/a>.","Although transaction costs are hitting new lows, Ethereum transaction count and daily active users have not dropped concurrently. A likely culprit: transacting users don’t feel the need to pay high costs to get their transactions through in a speedy fashion.","“People are not in a hurry and are not willing to pay more for their transactions to go through sooner,” The Block Research data analyst Simon Cousaert explained.","When looking at the <a href=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/transactions-on-the-ethereum-network-daily\" data-v-f87c67ca=\"\">total transaction count<\/a> and <a href=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/number-of-active-addresses-on-the-ethereum-network-7dma\" data-v-f87c67ca=\"\">active addresses<\/a> on the Ethereum network, neither of these statistics is nearing all-time lows. In fact, both have increased roughly 20% and 60% in the same two-year time frame, respectively.","Uniswap, OpenSea, and ETH transfers were the highest gas-consuming (cost to perform a transaction) smart contracts in the past month, <a href=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/top-20-gas-consuming-smart-contracts-30d\" data-v-f87c67ca=\"\">according to The Block’s data.<\/a>","During the entire 14-month <a href=\"https:\/\/ultrasound.money\/\" data-v-f87c67ca=\"\">period<\/a>, OpenSea contributed to a huge portion of the total gas consumption but has fallen significantly since January. OpenSea consumed 230,000 ETH or roughly 16,400 ETH month-over-month (MoM). But within the last 30 days, this MoM number is well below the MoM average sitting at roughly 1,100 ETH.","This caused other transactions on the network, such as transfers and token swaps, to cost an astronomical amount more. The drop-off in transaction costs can be attributed to the significant reduction in OpenSea activity, and the slow migration of users switching to alternative blockchains in search of cheaper transactions.","There has been significant growth in the Layer 2 space, primarily in optimistic rollup solutions such as Arbitrum and Optimism. Though transaction costs are reaching new lows, transaction counts on the leading optimistic rollup solutions are on an upward trajectory.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/optimistic-rollups\/transaction-count-daily-7dma\/embed\" title=\"Transaction Count on Optimistic Rollups (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Simon Cousaert","content":"PERSON"},{"type":"Summer","content":"DATE"},{"type":"Sept. 22","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"popping days of 2021","content":"DATE"},{"type":"last 30 days","content":"DATE"},{"type":"January","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"60%","content":"PERCENT"},{"type":"Block Research","content":"ORGANIZATION"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}