{"summary":"Victims who lost and have not recovered funds from the hacked liquidity pools will get a grant equivalent to the funds in USD. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265739\/kyberswap-plans-to-offer-victims-treasury-grants-after-48-8-million-exploit","publishDate":"2023-12-01T13:47:48","id":5846,"type":null,"title":"KyberSwap plans to offer victims treasury grants after $48.8 million exploit","category":["CRYPTO ECOSYSTEMS"],"content":["The team behind KyberSwap announced that it will offer grants from the protocol’s treasury to victims of the recent exploit, aiming to provide monetary relief.","\"We are planning grants from the KyberSwap treasury to users to ease the hardship from the loss caused by the exploit,\" KyberSwap stated on <a href=\"https:\/\/twitter.com\/KyberNetwork\/status\/1730631569872916534\" data-v-f87c67ca=\"\">X.<\/a>","Victims who lost funds during the exploit will be given a grant from KyberSwap for an \"amount up to the USD value of such funds at the time when such funds were drained from their respective liquidity pools,\" the team added.","KyberSwap is still working out the details of the treasury grants and will offer more information in during the next two weeks.&nbsp;","The <a href=\"https:\/\/www.theblock.co\/post\/264432\/dex-protocol-kyberswap-appears-to-lose-47-million-in-possible-exploit\" data-v-f87c67ca=\"\">KyberSwap exploit<\/a> on Nov. 22 stemmed from a vulnerability in the tick interval boundaries of its concentrated liquidity pools, allowing an individual to artificially double the liquidity and drain value.","KyberSwap confirmed that $48.8 million had been <a href=\"https:\/\/www.theblock.co\/post\/264432\/dex-protocol-kyberswap-appears-to-lose-47-million-in-possible-exploit\" data-v-f87c67ca=\"\">lost<\/a>, slightly more than the $47 million in cryptocurrency that initially appeared to have been taken.&nbsp;","In a negotiation attempt, Kyber <a href=\"https:\/\/www.theblock.co\/post\/264579\/kyberswap-offers-10-bounty-to-hacker-following-47-million-exploit\" data-v-f87c67ca=\"\">offered a 10% white hat bounty<\/a> to the hacker in exchange for returning the funds. However, the hacker showed no interest in accepting the bounty and made other demands in a <a href=\"https:\/\/www.theblock.co\/post\/265429\/kyber-hacker-control-message\" data-v-f87c67ca=\"\">bizarre on-chain message<\/a>, including asking the team complete control over the project.","The team separately <a href=\"https:\/\/www.theblock.co\/post\/264756\/kyberswap-recovers-4-7-million-after-exploit\" data-v-f87c67ca=\"\">recovered<\/a> $4.7 million in funds drained during the hack that were taken separately by third-party MEV bots.","<em data-v-f87c67ca=\"\">Update: Clarified the quote from Kyber.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$4.7 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"$48.8 million","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Nov. 22","content":"DATE"},{"type":"USD","content":"ORGANIZATION"},{"type":"$47 million","content":"MONEY"}],"hashtag":["DEXS"],"authors":["MK Manoylov","The Block"]}