{"summary":"Last week, Anchor saw more than $1 billion in liquidations, the largest liquidation event for a single DeFi protocol.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/147998\/anchor-saw-1-billion-of-liquidations-during-ust-and-lunas-death-spiral","publishDate":"2022-05-20T10:49:28","id":5847,"type":null,"title":"Anchor saw $1 billion of liquidations during UST and Luna&#x27;s death spiral","category":["LENDING"],"content":["Terra-based lending protocol Anchor saw more than $1 billion in liquidations last week, the largest liquidation event for a single protocol. This happened as both the crypto market collapsed and the Terra project — including its tokens luna (LUNA) and TerraUSD (UST) — largely collapsed.","According to <a href=\"https:\/\/www.theblockcrypto.com\/data\/decentralized-finance\/cryptocurrency-lending\/lending-market-liquidations-daily\" data-v-f87c67ca=\"\">The Block’s Data Dashboard<\/a>, $1.048 billion worth of staked crypto collateral deposited by borrowers on Anchor was liquidated on the platform between May 7 and May 12.","Luna (LUNA) accounted for over $750 million — or close to 75% of the liquidations — on Anchor during the period. Liquidations of avalanche (AVAX) came in at $261 million, with the remainder spread across ether (ETH), solana (SOL), and cosmos (ATOM).","The last time a large liquidation event like this happened was a year ago. This was when DeFi lenders Compound and Aave saw a total of $633 million in liquidations amid a general market crash at the time.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/cryptocurrency-lending\/lending-market-liquidations-daily\/embed\" title=\"Lending Market Liquidations\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","In Anchor’s case, the crash of UST was the main instigator. To understand how it happened, we need to know how Anchor worked.","Anchor is a lending platform on the Terra ecosystem. Users can borrow from Anchor by putting up collateral in the form of bonded crypto assets, which can be LUNA, ETH, AVAX, SOL, or ATOM.","Borrowing on Anchor is at a 10% interest rate and borrowers can take loans of up to 60% of the collateral they deposit on the platform. Anchor provides these loans in the form of the UST stablecoin. Liquidations occur on Anchor when the value of the staked collateral falls to a certain point that exceeds the threshold required to pay back the loan.","Luna lost almost 99% of its value during this period of liquidations, falling from $73 to as low as $0.83. The other assets offered as collateral also dropped in value.","Borrowers who deposited Luna as collateral saw their positions become increasingly at risk as the price of the coin fell last week. The same also applied to borrowers who put the other assets as those tokens began to plunge amid a wider crypto market downturn.","<span data-v-f87c67ca=\"\">Anchor liquidations during last week's market crash. Source: The Block Research.<\/span>","When the value of the tokens used as collateral fell low enough, it meant that the positions had became underwater and were able to be liquidated. The above image shows that the bulk of the Luna liquidations occured between May 9 and May 10, when the price of the coin was in <a href=\"https:\/\/www.theblockcrypto.com\/post\/146309\/luna-terra-ust-terrausd-markets-crypto-blockchain\" data-v-f87c67ca=\"\">free fall<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$633 million","content":"MONEY"},{"type":"$73","content":"MONEY"},{"type":"$1.048 billion","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"May 7","content":"DATE"},{"type":"$261 million","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"Luna","content":"LOCATION"},{"type":"75%","content":"PERCENT"},{"type":"$0.83","content":"MONEY"},{"type":"99%","content":"PERCENT"},{"type":"60%","content":"PERCENT"},{"type":"AVAX","content":"ORGANIZATION"},{"type":"$750 million","content":"MONEY"},{"type":"The Block’s Data Dashboard","content":"ORGANIZATION"},{"type":"May 9","content":"DATE"},{"type":"UST","content":"ORGANIZATION"},{"type":"May 10","content":"DATE"},{"type":"May 12","content":"DATE"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}