{"summary":"MakerDAO&#x27;s DAI has swapped out a lot of USDC in its stablecoin reserves for U.S. Treasurys as its collateral changes shape.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236139\/makerdao-dai-collateral-usdc","publishDate":"2023-06-23T12:21:56","id":5850,"type":null,"title":"MakerDAO&#x27;s DAI has reduced its dependence on USDC as collateral","category":["CRYPTO ECOSYSTEMS"],"content":["MakerDAO’s decentralized U.S. dollar stablecoin, DAI, has significantly reduced its reliance on USDC as a collateral asset over the last few months.","The amount of USDC used as backing within MakerDAO’s peg stability module (PSM) has fallen significantly since the start of the year. The PSM allows users to deposit USDC and mint DAI at a 1:1 ratio, helping to keep the stablecoin pegged to the U.S. dollar.","In January 2023, about $2.4 billion of USDC was locked in the PSM, per DeFiLlama <a href=\"https:\/\/defillama.com\/protocol\/makerdao\" data-v-f87c67ca=\"\">data<\/a>. Now, this number has shrunk to around $520 million — indicating a 78% decline in the amount of USDC directly used to back DAI in its own contracts. That said, the project still has some extra exposure to USDC through its agreement with Coinbase.","Notably, USDC’s overall share for DAI's collateral reserves has dropped from around 50% to merely 8%, according to DeFiLlama <a href=\"https:\/\/defillama.com\/protocol\/makerdao\" data-v-f87c67ca=\"\">data<\/a>. The current supply of DAI stands at 4.7 billion.","“USDC [reserve] is going down as we have finally ways to get yield from those unproductive asset,” Sébastien Derivaux, analyst at MakerDAO’s Strategic Finance unit, told The Block.","The reduction was largely caused by MakerDAO's move to diversify its balance sheet with real-world assets, the core team said. It highlighted that MakerDAO has utilized $1 billion worth of its USDC reserves to <a href=\"https:\/\/www.theblock.co\/post\/235837\/makerdao-purchases-additional-700-million-in-treasury-bonds\" data-v-f87c67ca=\"\">purchase<\/a> U.S. Treasury bills and <a href=\"https:\/\/www.theblock.co\/post\/179074\/makerdao-on-course-to-custody-1-1-billion-usdc-with-coinbase-for-rewards\" data-v-f87c67ca=\"\">moved<\/a> an additional $500 million worth of USDC, transferring it to Coinbase Custody to earn rewards.","<span data-v-f87c67ca=\"\">MakerDAO USDC Reserves | Source: <a href=\"https:\/\/defillama.com\/protocol\/makerdao\" data-v-f87c67ca=\"\">DeFiLlama<\/a><\/span>","Meanwhile, the role of Ethereum derivatives as DAI’s collateral has surged. Wrapped ether (WETH) and wrapped staked ether (wstETH) now represent the largest chunk of DAI’s collateral, accounting for $4.3 billion, or 68%, of the total collateral value.","In a significant development, wstETH has gained ground in recent months and is closing in on WETH in terms of the total value locked (TVL) within MakerDAO. This means DAI can take advantage of Ethereum staking rewards, which will increase its backing over time.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"PSM","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"8%","content":"PERCENT"},{"type":"MakerDAO’s Strategic Finance","content":"ORGANIZATION"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"January 2023","content":"DATE"},{"type":"78%","content":"PERCENT"},{"type":"Coinbase Custody","content":"ORGANIZATION"},{"type":"Sébastien Derivaux","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"DAI","content":"ORGANIZATION"},{"type":"$2.4 billion","content":"MONEY"},{"type":"$500 million","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"68%","content":"PERCENT"},{"type":"$4.3 billion","content":"MONEY"},{"type":"$520 million","content":"MONEY"}],"hashtag":["ASSETS","DAI"],"authors":["Vishal Chawla","The Block"]}