{"summary":"Stablecoin platform Reserve Protocol has launched on the Ethereum Layer 2 Base, allowing users to create asset-backed tokens.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/255620\/reserve-protocol-deploys-on-coinbase-ethereum-layer-2-network-base","publishDate":"2023-10-10T12:01:04","id":5851,"type":null,"title":"Reserve expands stablecoin protocol to Coinbase&#x27;s Base network","category":["LAYER 2S AND SCALING"],"content":["Decentralized stablecoin protocol Reserve has launched on the Coinbase-incubated Layer 2 network Base, its first deployment beyond the Ethereum mainnet, according to a statement.&nbsp;","The move enables users to create their own “RTokens” — decentralized stablecoins, flatcoins (pegged to the cost of living) or tokenized indices — using Reserve’s Asset Backed Currency Factory on the cheaper Layer 2 network. These assets are backed by overcollateralized baskets of Ethereum-compatible ERC-20 tokens.","Reserve's collateral options on Ethereum and Base include major stablecoins, ether and wrapped bitcoin, on their own or in yield-bearing form from protocols such as Compound, MakerDAO, Aave, Convex, Curve, Morpho and Flux Finance, the project said.","\"DeFi should expand far beyond a few thousand power users,\" Reserve told The Block via email. \"Base’s lower fees will enable people who are interested in using yield bearing stablecoins to actually use them without having all benefits wiped out by gas costs.\"","The first RToken on Ethereum, <a href=\"https:\/\/blog.reserve.org\/introducing-the-electronic-dollar-eusd-cb9d8f50aae\" data-v-f87c67ca=\"\">Electronic Dollar (eUSD)<\/a>, was introduced in February by the global payments app Moby for private transactions.","During the tumultuous 2023 run on Silicon Valley Bank, eUSD was severely stress-tested when <a href=\"https:\/\/www.theblock.co\/post\/218993\/usdc-and-dai-remain-at-about-0-90-following-circles-disclosure-of-funds-at-svb\" data-v-f87c67ca=\"\">Circle's USDC stablecoin reserves<\/a>, housed at the bank, plummeted from $1 to 88 cents. eUSD's decentralized “self-healing” mechanism kicked in, <a href=\"https:\/\/blog.reserve.org\/eusd-emerges-strong-the-resilience-of-reserve-protocol-during-usdc-depegging-e5a698a990c9\" data-v-f87c67ca=\"\">autonomously recapitalizing<\/a> and returning to the $1 peg without relying on regulators or bank guarantees. This self-recovery feature is inherent to all RTokens, Reserve said.","The first RToken deployers on Base are expected to launch in the next few weeks, according to the team.","Reserve joins an array of <a href=\"https:\/\/www.theblock.co\/post\/244921\/compound-defi-base\" data-v-f87c67ca=\"\">protocols deploying on Base<\/a> since its <a href=\"https:\/\/www.theblock.co\/post\/243899\/base-mainnet-onchain-summer\" data-v-f87c67ca=\"\">public launch<\/a> in August, including Uniswap, SushiSwap, Compound and Chainlink.","Last week, real-world asset project Backed issued a <a href=\"https:\/\/www.theblock.co\/post\/255176\/real-world-asset-project-backed-issues-tokenized-security-on-base\" data-v-f87c67ca=\"\">tokenized security product on Base<\/a>&nbsp;which tracks a short-term iShares U.S. treasury bond ETF.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"88 cents","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Reserve","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"$1","content":"MONEY"},{"type":"Flux Finance","content":"ORGANIZATION"},{"type":"Convex","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":["BASE","ETHEREUM"],"authors":["James Hunt","The Block"]}