{"summary":"Visa now settles payments in the USDC stablecoin on the Ethereum blockchain.\nVisa is initially working with Crypto.com for the new service.\nThe company hopes to launch the USDC settlement capability for other partners as well “in the year ahead.”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/99639\/visa-now-settles-payments-in-usdc-stablecoin-ethereum","publishDate":"2021-03-29T05:00:12","id":587,"type":null,"title":"Visa now settles payments in USDC stablecoin on Ethereum blockchain","category":["Stablecoins"],"content":["Visa announced Monday that it now settles payments in the USDC stablecoin on the Ethereum blockchain.","The development means Visa has become the first major payments network to use stablecoin as a settlement currency. Until now, Visa settled payments in fiat currencies only.","For its new USDC settlement capability, Visa is initially working with Crypto.com as part of a pilot program, letting the crypto firm manage its card business now entirely in digital assets.","Previously, Visa's standard settlement process required Crypto.com to settle in a fiat currency, which added cost and complexity for the firm. Now Crypto.com won't have to go through conversations and settle with Visa directly in USDC.","\"The announcement today marks a major milestone in our ability to address the needs of fintechs managing their business in a stablecoin or cryptocurrency,\" said Visa's chief product officer Jack Forestell. \"And it's really an extension of what we do every day, securely facilitating payments in all different currencies all across the world.\"","<a class=\"editor-rtfLink\" href=\"http:\/\/crypto.com\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Crypto.com<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\"> co-founder and CEO Kris Marszalek said the firm wants to enable \"<\/span><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">millions of consumers across the world to access and use digital currencies,\" and Visa's <\/span><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">capability to \"directly accept and interact with digital currencies\" helps enable it to maximize the benefits of digital currencies.<\/span>","Visa's settlement agent for the USDC capability is crypto bank <a href=\"https:\/\/www.theblockcrypto.com\/daily\/97714\/diogo-monica-anchorage-crypto-bank\" data-v-f87c67ca=\"\">Anchorage<\/a>. That means Crypto.com sends USDC to Visa's Ethereum address at Anchorage.","\"Visa came to us in 2019 with an idea—make secure, efficient, and seamless settlement payments possible in digital currency by linking Visa's treasury with Anchorage's custody platform,\" said Diogo Mónica, co-founder and president of Anchorage. \"This would give the next generation of crypto native issuers the option to directly settle with Visa in a digital currency over a public blockchain.\"","Visa said the new service is \"one small step forward\" for its settlement platform, but \"one giant step forward\" to integrate digital assets.","After further testing and additional conversations with its clients, partners, and members of the regulatory community, Visa hopes to launch the USDC settlement capability for other partners as well \"in the year ahead.\"","Eventually, Visa also plans to settle payments in <a href=\"https:\/\/www.theblockcrypto.com\/tag\/central-bank-digital-currency\" data-v-f87c67ca=\"\">central bank digital currencies<\/a> (CBDCs). Earlier this month, Visa CEO Alfred Kelly <a href=\"https:\/\/www.theblockcrypto.com\/linked\/98552\/visa-ceo-podcast-bitcoin-stablecoins\" data-v-f87c67ca=\"\">said<\/a>&nbsp;the company aims to cover bitcoin and other cryptocurrencies as well, along with stablecoins.","Visa rival <a href=\"https:\/\/www.theblockcrypto.com\/post\/94669\/mastercard-cfo-cryptocurrencies-stablecoins-central-banks\" data-v-f87c67ca=\"\">Mastercard<\/a> has also intended to capture business opportunities in the crypto and stablecoins space, as well as in the future CBDCs space."],"hashtag":["USDC"]}