{"summary":"A lawmaker New Jersey has introduced a new bill that, if passed and signed into law, would mandate that cryptocurrency businesses must obtain a license in order to operate in the state.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/56651\/new-jersey-lawmaker-files-bill-to-require-licenses-for-crypto-companies","publishDate":"2020-02-21T16:03:07","id":5871,"type":null,"title":"New Jersey lawmaker files bill to require licenses for crypto companies","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">A lawmaker New Jersey has introduced a new bill that, if passed and signed into law, would mandate that cryptocurrency businesses must obtain a license to operate in the state.<\/span>","<span data-v-f87c67ca=\"\">The new bill – the \"Digital Asset and Blockchain Technology Act\" – &nbsp;aims to strengthen consumer protection laws in the cryptocurrency space, according to an&nbsp;<\/span><a href=\"https:\/\/www.assemblydems.com\/lopez-introduces-bill-to-create-consumer-friendly-protections-and-regulations-in-virtual-currency-industry\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">official announcement<\/span><\/a><span data-v-f87c67ca=\"\">. The measure was introduced on Feb. 20, according to data published on <a href=\"https:\/\/legiscan.com\/NJ\/bill\/A2891\/2020\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">LegiScan<\/a>.<\/span>","<span data-v-f87c67ca=\"\">The legislation states that such firms would have to obtain approval from the New Jersey Department of Banking and Insurance or another state that has agreements with the New Jersey government.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">To apply for the license, firms would have to disclose their legal names, their fictitious or trade names, their licensing and legal history, as well as their anti-money laundering and anti-terrorist financing policies.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Since the bill aims to shore up consumer protection, crypto companies would also have to release the terms and conditions for their consumer accounts, including a schedule of fees, their compliance status with the Federal Deposit Insurance Cooperation, and information on potential market risks.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"Throughout New Jersey, there are ATMs that dispense Bitcoins. People see and hear about it in their day to day lives, but most are not quite sure what it is,\" Assemblywoman Yvonne Lopez, the bill's prime sponsor, said in a statement. \"We must take steps to protect consumers looking to invest in cryptocurrency, while also allowing the sector to continue to develop and expand in New Jersey.\"<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New Jersey Department of Banking and Insurance","content":"ORGANIZATION"},{"type":"Feb. 20","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"New Jersey","content":"LOCATION"},{"type":"Federal Deposit Insurance Cooperation","content":"ORGANIZATION"},{"type":"Yvonne Lopez","content":"PERSON"}],"hashtag":[],"authors":["Yilun Cheng","The Block"]}