{"summary":"The decade-long path toward a spot bitcoin ETF descended into chaos in its final two days. Here’s what happened.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/271901\/spot-bitcoin-etf-approval-process-disaster","publishDate":"2024-01-11T11:20:52","id":5879,"type":null,"title":"The SEC&#x27;s spot bitcoin ETF finale was a complete disaster. What went wrong?","category":["LAYER 1S"],"content":["For something that was a decade in the making, it couldn't have gone worse.","Yesterday, the Securities and Exchange Commission approved <a href=\"https:\/\/www.theblock.co\/post\/271324\/the-sec-said-it-has-approved-proposals-for-spot-bitcoin-etfs-on-an-accelerated-basis\" data-v-f87c67ca=\"\">11 spot bitcoin ETFs for the first time<\/a>, with trading now fully underway. However, the approval announcement itself was full of wild twists and turns for two whole days — culminating in a mess of confusion and head-scratching. The ETFs were seemingly approved, then unapproved, then approved early without confirmation. Frankly, it's hard to imagine what else could have gone wrong.","<span data-v-f87c67ca=\"\">“[SEC Chair] Gary Gensler butchered this announcement so hard everyone is doubting it's real. The first <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.62%\n    <\/span><\/a> <!----><\/span><\/span> Spot ETFs have been approved and no one is believing it,\" <\/span><a href=\"https:\/\/twitter.com\/Tree_of_Alpha\/status\/1745186343196508246\" data-v-f87c67ca=\"\">posted<\/a> a pseudonymous crypto trader known as Tree of Alpha on X.","\"After this freakshow the SEC and especially Gensler can *never* be trusted again,” <a href=\"https:\/\/twitter.com\/lex_node\/status\/1745187479802491161\" data-v-f87c67ca=\"\">added Gabriel Shapiro<\/a>, general counsel at Delphi Labs.","It was a frantic period of excitement and drama. Here’s an in-depth look at how the final two days unfolded and what, exactly, broke down.","Ultimately, the biggest error was made long in advance of the ETF approvals. Despite regularly posting about cybersecurity awareness and the importance of using multi-factor authentication, it appears that the SEC failed to secure its own X account in the same way.","Shortly after 4pm ET on Tuesday, the SEC’s X account posted that it had granted approval for bitcoin ETFs for listing on all registered national securities exchanges. Immediately, the news spread, and everyone was proclaiming that the ordeal was over — when it had only just begun.","Gensler, at 4:26 p.m., took to his own <a href=\"https:\/\/twitter.com\/GaryGensler\/status\/1744833049064288387\" data-v-f87c67ca=\"\">X account<\/a> to say the regulator's account had been compromised, writing that \"the SEC has not approved the listing and trading of spot bitcoin exchange-traded products.\"","It was a further 16 minutes before the SEC deleted the post, instead <a href=\"https:\/\/twitter.com\/SECGov\/status\/1744837121406349714\" data-v-f87c67ca=\"\">posting<\/a> that its account was compromised and that it had not approved such listings.","The SEC said it will <a href=\"https:\/\/www.theblock.co\/post\/271423\/sec-says-it-will-work-with-law-enforcement-following-unauthorized-access-to-x-account\" data-v-f87c67ca=\"\">work with law enforcement<\/a> — and, later, <a href=\"https:\/\/www.theblock.co\/post\/271688\/sec-says-the-fbi-is-now-involved-in-investigating-false-post-about-spot-bitcoin-etfs\" data-v-f87c67ca=\"\">said that would include the FBI<\/a> —&nbsp;to investigate the breach and any related misconduct. X said it happened as someone <a href=\"https:\/\/www.theblock.co\/post\/271440\/x-reveals-sec-account-breach-stemmed-from-unprotected-phone-number\" data-v-f87c67ca=\"\">obtained control<\/a> over a phone number associated with the account. The social media platform said the SEC did not set up two-factor authentication for its account when it was compromised.","The <a href=\"https:\/\/www.theblock.co\/post\/271399\/crypto-leaders-decry-sec-mishap-over-spot-bitcoin-etf-news-biting-my-tongue-so-hard-its-bleeding\" data-v-f87c67ca=\"\">reactions were immediate<\/a>. \"Out of the entire 10+yr spot bitcoin ETF saga...This has to be, by far, the most twisted plot twist. Quentin Tarantino-esque,\" noted Nate Geraci, president of The ETF Store, at the time.","\"Today, the @SECGov continued its quest to harm US investors. Time for the SEC to hold the SEC accountable!\" joked Gemini CEO Tyler Winklevoss on X, adding, \"I expect @SECGov Enforcement to send the SEC’s Social Media and Cybersecurity teams a Wells Notice any minute.\"","Coinbase executives <a href=\"https:\/\/www.theblock.co\/post\/271478\/coinbase-executives-offer-to-help-the-sec-with-its-security-practices\" data-v-f87c67ca=\"\">even weighed in<\/a>, offering, in all sincerity, to help the SEC — the very agency that’s suing it over allegedly running an unregistered securities agency —&nbsp;with its security practices.&nbsp;\"Serious offer: as a crypto exchange we've had a lot of experience with security protocols around social media, and as a veteran and patriot I love to help my country,\" said Coinbase Chief Security Officer Philip Martin <a href=\"https:\/\/twitter.com\/SecurityGuyPhil\/status\/1744923073315582052\" data-v-f87c67ca=\"\">on X<\/a>.","Gensler and the SEC haven’t posted on X since the calamity, even after the approvals.","While Tuesday was more mangled, Wednesday was a raft of confusion.","It started with some good signs. Around midday, Fidelity’s trading app was seen to show some of the spot bitcoin ETFs including Ark Invest\/21Shares and while they were not available for trading, it suggested that approval was very likely to happen that day, as was largely expected.","Two hours later, it all kicked off. The Cboe exchange, set to list six spot bitcoin ETFs, <a href=\"https:\/\/www.theblock.co\/post\/271670\/cboe-says-multiple-spot-bitcoin-etfs-will-begin-trading-on-thursday-but-key-forms-not-yet-approved\" data-v-f87c67ca=\"\">published listing notifications<\/a> that said trading would start tomorrow for these products. What was strange is that the products had seemingly not yet been approved by the SEC.","Then this progress was undone. An hour later, the Cboe informed the SEC that it would be withdrawing its acceleration requests for the same ETFs (one of which was dated 2023). While this caused concern, analysts were quick to argue that the Cboe had likely jumped the gun on the listing announcements and were needing to temporarily take a step back.","“CBOE just was supposed to wait. If you're angry at someone, direct it at the CBOE,” <a href=\"https:\/\/x.com\/SGJohnsson\/status\/1745178316691189761?s=20\" data-v-f87c67ca=\"\">said<\/a> Scott Johnsson, general partner at Van Buren Capital, on X.","Cboe’s listing notifications were <a href=\"https:\/\/twitter.com\/theblockupdates\/status\/1745183932398604800\" data-v-f87c67ca=\"\">swiftly updated<\/a> to note that trading would start on Thursday, pending regulatory approval.","Less than an hour later, all the spot bitcoin ETFs were suddenly approved all at once, although it was hard to know for sure.","Those eagerly watching the SEC’s website for any files to be uploaded noticed that a document appeared with an URL that didn’t match the standard format for SEC documents. It wasn’t uploaded to the part of the site that shows SEC orders, nor was it pushed out on the SEC’s RSS feeds. It was also prior to market close.","The 22-page document said that all 11 spot bitcoin ETFs had been approved in one omnibus order. If real, it meant that all the 19b-4 forms had been approved and that only the S-1 filings needed to go effective for trading to begin. A few moments later, the website link for the document was showing up as a 404 error, suggesting either that the website was crashing under high load or that the document had been removed.","Despite the uncertainty, observers and analysts started celebrating —&nbsp;albeit with caveats.&nbsp;","“Bitcoin ETFs Likely Approved by the SEC,” <a href=\"https:\/\/twitter.com\/JSeyff\/status\/1745187087752572986\" data-v-f87c67ca=\"\">said<\/a> Bloomberg senior ETF analyst James Seyffart on X. “It certainly looks like the Bitcoin ETF Approval order had hit the SEC website but the link is no longer working. That said, this document looks accurate to me.”","“Can pretty much guarantee that the SEC did not intend for anyone outside the SEC to get their hands on this document\/link yet,” he <a href=\"https:\/\/twitter.com\/JSeyff\/status\/1745191756365176978\" data-v-f87c67ca=\"\">added<\/a>.","During this time, a SEC spokesperson did not reply to requests from The Block on whether the document was accurate.","Around 40 minutes after the document was seen, it was uploaded to the correct part of the SEC website and a spokesperson finally provided a link to the document with a standard format URL, showing the exchange and date — confirming its veracity. They also provided Gensler’s speech. It was arguably only at this point that it was confirmed the spot bitcoin ETFs had been approved.","Another 40 minutes later, Bitwise CIO Matt Hougan told The Block that the <a href=\"https:\/\/www.theblock.co\/post\/271341\/spot-bitcoin-etfs-can-start-trading-as-sec-clears-final-hurdle\" data-v-f87c67ca=\"\">S-1 approvals had started rolling in<\/a>. These soon started showing up on the SEC website. At this point it was determined that trading would begin the following day.","But the drama was not yet over. While Gensler proved to be the deciding vote that pushed the spot bitcoin ETFs through&nbsp;— with two Commissions voting against it — he made sure to reiterate his view that the agency was not endorsing the underlying asset.&nbsp;","He <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2024-01-11\/cathie-wood-says-gensler-denigrated-crypto-with-his-statement\" data-v-f87c67ca=\"\">criticized<\/a> bitcoin as a speculative, volatile asset that’s used for illicit activity including ransomware, money laundering, sanction evasion and terrorist financing. “While we approved the listing and trading of certain spot bitcoin ETP shares today, we did not approve or endorse bitcoin,” he said, <a href=\"https:\/\/www.theblock.co\/post\/271755\/gary-gensler-hasnt-changed-his-tone-on-crypto-even-with-sec-approval-of-spot-bitcoin-etfs\" data-v-f87c67ca=\"\">in his speech<\/a>.","Cathie Wood, CEO of Ark Invest, one of the firms behind a spot bitcoin ETF, told Bloomberg that Gensler “just denigrated the whole crypto space. I couldn’t believe it.”","Commissioner Hester Peirce, who also voted for the products, also took a highly critical view of the SEC’s actions up to this point in <a href=\"https:\/\/www.sec.gov\/news\/statement\/peirce-statement-spot-bitcoin-011023#_ftn8\" data-v-f87c67ca=\"\">her own speech<\/a>. She used the same language as a recent court case, saying that the SEC’s arbitrary and capricious treatment of applications in this area will continue to harm our reputation far beyond crypto.”","She added that the agency’s actions have caused confusion over its role. “Congress did not authorize us to tell people whether a particular investment is right for them, but we have abused administrative procedures to withhold investments that we do not like from the public,” she said.","Ripple Chief Legal Officer Stuart Alderoty said Pierce was spot on. “This long overdue approval comes only because the courts checked an out of control regulator. Gensler’s battle royal against crypto has turned the SEC into a caricature not to be trusted by the public, policy makers or judges,” he <a href=\"https:\/\/twitter.com\/s_alderoty\/status\/1745217648214843666\" data-v-f87c67ca=\"\">noted on X<\/a>.","All in all, it was a rough couple of days for the SEC. As Coin Center's Director of Communications Neeraj Agrawal <a href=\"https:\/\/twitter.com\/NeerajKA\/status\/1745190874168906058\" data-v-f87c67ca=\"\">put it<\/a>, \"I<span class=\"css-1qaijid r-bcqeeo r-qvutc0 r-poiln3\" data-v-f87c67ca=\"\">f I were charged with maintaining orderly markets I would simply not cause days of chaos resulting in millions in investor losses.\"<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Delphi Labs","content":"ORGANIZATION"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"Gabriel Shapiro","content":"PERSON"},{"type":"Today","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Wells Notice","content":"ORGANIZATION"},{"type":"4:26 p.m.","content":"TIME"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Nate Geraci","content":"PERSON"},{"type":"Cathie Wood","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"CBOE","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Stuart Alderoty","content":"PERSON"},{"type":"1","content":"DATE"},{"type":"James Seyffart","content":"PERSON"},{"type":"Hester Peirce","content":"PERSON"},{"type":"Pierce","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Scott Johnsson","content":"PERSON"},{"type":"Van Buren Capital","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Philip Martin","content":"PERSON"},{"type":"FBI","content":"ORGANIZATION"},{"type":"Tyler Winklevoss","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"-0.62%","content":"PERCENT"},{"type":"Cboe","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"ETP","content":"ORGANIZATION"},{"type":"Bitwise CIO Matt Hougan","content":"PERSON"},{"type":"Coin Center's Director of Communications Neeraj Agrawal","content":"ORGANIZATION"}],"hashtag":["BITCOIN","SPOT BITCOIN ETF"],"authors":["Tim Copeland","The Block"]}