{"summary":"The world’s largest cryptocurrency saw a minor price dip on Monday afternoon in Asia, as it continues fluctuating around $70,000.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285830\/bitcoin-lingers-below-70000-as-sideways-price-action-continues","publishDate":"2024-04-01T03:23:46","id":588,"type":null,"title":"Bitcoin lingers below $70,000 as sideways price action continues","category":["MARKETS"],"content":["Bitcoin traded below $70,000 on Monday, as the world's largest cryptocurrency continues to fluctuate around this level for the past few days.","Bitcoin's price dipped slightly, about 0.7% over the past 24 hours, to trade at $69,700 at around 3:15 a.m. EST, according to The Block's Price Page. Ether traded down 1.8% at $3,550.","<span data-v-f87c67ca=\"\">“Currently, prices are moving sideways with no clear catalysis to move prices up or down,” Justin d'Anethan, head of APAC business development of crypto market maker Keyrock, told The Block. “With a range [between] $69,000 and $71,000 for the past four days, it seems that investors are unwilling to breach all-time highs but also that any selling is met with a healthy demand.”<\/span>","<span data-v-f87c67ca=\"\">Lucy Hu, a senior analyst of Metalpha, said that the dipping in price appears to be part of normal adjustment and that “there is no clear trigger for the minor fluctuation this time.”<\/span>","<span data-v-f87c67ca=\"\">With <\/span><a href=\"https:\/\/www.theblock.co\/halving\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">bitcoin halving<\/span><\/a><span data-v-f87c67ca=\"\"> expected to occur later this month, the event might have some influence on the price movements.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Beyond simple macro factors, a core crypto-native catalysis is the Bitcoin halving, due later this month. Interestingly enough, halvings have historically been a bearish event in the few days following it but then turned to mark the beginning of long enduring bull runs,” said d'Anethan.<\/span>","<span data-v-f87c67ca=\"\">D'Anethan added that it is tricky to anticipate as “as the bull run has admittedly run for the past six months already (or year, depending on who you ask).”<\/span>","<span data-v-f87c67ca=\"\">“The catalysis was the anticipation and the realization of the bitcoin spot ETFs on American stock exchanges, which opened the flood gates for a flurry of yet inactive investors now able to get exposure to BTC,” d'Anethan continued.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Hu of Metalpha added that given the record in the past, “the market could experience heavy volatility approaching halving, with a strong price adjustment, during and past the halving event.”<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$3,550","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"Justin d'Anethan","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$71,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"1.8%","content":"PERCENT"},{"type":"0.7%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"APAC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$69,000","content":"MONEY"},{"type":"3:15 a.m. EST","content":"TIME"},{"type":"Monday","content":"DATE"},{"type":"$69,700","content":"MONEY"},{"type":"$70,000","content":"MONEY"},{"type":"Keyrock","content":"PERSON"},{"type":"Lucy Hu","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["BITCOIN"],"authors":["Timmy Shen","The Block"]}