{"summary":"The present is multi-chain, even in the midst of a crypto bear market. Since 2021, the proliferation of many high-quality Layer 1 blockchains and Layer 2 roll-ups meant that DeFi users could trade, lend, borrow, and earn yield across a variety of new ecosystems. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/154784\/is-the-end-of-bridging-in-sight-hashflow-makes-cross-chain-swaps-bridgeless","publishDate":"2022-06-29T09:00:27","id":5883,"type":null,"title":"Is the End of Bridging in Sight? Hashflow Makes Cross-Chain Swaps Bridgeless","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">The present is multi-chain, even in the midst of a crypto bear market. Since 2021, the proliferation of many high-quality Layer 1 blockchains and Layer 2 roll-ups meant that DeFi users could trade, lend, borrow, and earn yield across a variety of new ecosystems.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The key to unlocking all of that value was the ability to bridge assets. The total TVL in cross-chain bridges today still sits at roughly $9B, despite a near 60% drop since its peak in November, fueled by the downturn in broader market sentiment.<\/span>","<span data-v-f87c67ca=\"\">While bridges helped foster the interoperability between previously-siloed networks, the process of bridging assets today still creates many challenges for the end user. Bridging a native asset to another native asset on a different chain requires wrapping, using a combination of multiple bridges and DEXes, and in some cases, going through centralized exchanges.<\/span>","<span data-v-f87c67ca=\"\">To address these challenges, Hashflow launched the first <\/span><a href=\"https:\/\/www.theblock.co\/post\/143393\/hashflow-introduces-bridgeless-cross-chain-swaps\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bridgeless Cross-Chain Swaps<\/span><\/a><span data-v-f87c67ca=\"\"> in DeFi in April. Hashflow allows users to seamlessly swap any asset across any chain within minutes without the need for external bridges.<\/span>","<span data-v-f87c67ca=\"\">Imagine that you need to swap your AVAX on Avalanche to ETH on Ethereum mainnet. Before Hashflow, you had to first find a DEX that allows you to swap your AVAX to WETH on Avalanche. Next, you find a bridge that lets you convert your WETH on Avalanche to ETH on mainnet, which can take up to several hours — and sometimes days — depending on the project and the origination and destination chain.<\/span>","<span data-v-f87c67ca=\"\">Now imagine doing this for *every* cross-chain swap you want to make with different assets across multiple chains. How many hours or days would you spend researching different protocols and bridges? What if a bridge isn’t compatible with your assets? How do you know whether a bridge is secure?<\/span>","<span data-v-f87c67ca=\"\">With Hashflow’s Bridgeless Cross-Chain Swaps, you can now seamlessly swap native assets across chains within minutes – in one single transaction in one place:<\/span>","https:\/\/youtu.be\/0CbinA33SeY","&nbsp;","<span data-v-f87c67ca=\"\">In addition to a dramatically simplified experience, all cross-chain swaps on Hashflow are fully protected from both slippage and MEV exploits – whether the swap happens locally on one chain or across chains. No matter where you initiate a trade, you will receive your assets on any destination chain without losing any value.<\/span>","<span data-v-f87c67ca=\"\">All of this is made possible by Hashflow’s unique design. While most DEXs rely on automated market makers (AMMs) to enable the buying and selling of assets, Hashflow uses a request-for-quote (RFQ) model. This RFQ model allows professional market makers to source liquidity from anywhere and price assets using off-chain pricing functions instead of the constant product pricing function commonly used by AMMs. By moving pricing functions off-chain, users benefit from:<\/span>","<span data-v-f87c67ca=\"\">Hashflow’s Bridgeless Cross-Chain Swaps currently support Ethereum, Avalanche, BNB Chain, Arbitrum, Optimism, and Polygon. In the coming months, Hashflow will expand to more ecosystems including non-EVM chains like Solana. To understand the possibilities, imagine being able to swap any native assets directly for SOL, without ever having to manually bridge or use an AMM. In addition, Hashflow’s RFQ model will also allow for the trading of non-spot assets such as options and derivatives (in allowed jurisdictions) <\/span><a href=\"https:\/\/www.hashflow.com\/roadmap\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">in the near future<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Start <\/span><a href=\"https:\/\/app.hashflow.com\/?utm_source=article&amp;utm_medium=link&amp;utm_campaign=the_block_2022_4_29\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">trading on Hashflow<\/span><\/a><span data-v-f87c67ca=\"\"> today.<\/span>","<span data-v-f87c67ca=\"\">Website: <\/span><a href=\"https:\/\/hashflow.com\/?utm_source=article&amp;utm_medium=link&amp;utm_campaign=the_block_2022_4_29\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">hashflow.com<\/span><\/a>","<span data-v-f87c67ca=\"\">Twitter: <\/span><a href=\"https:\/\/twitter.com\/hashflow\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/twitter.com\/hashflow<\/span><\/a>","&nbsp;","<b data-v-f87c67ca=\"\">Disclosures<\/b>","<span data-v-f87c67ca=\"\">This post is commissioned by Hashflow and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/span>","<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2021","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$9B","content":"MONEY"},{"type":"60%","content":"PERCENT"},{"type":"November","content":"DATE"},{"type":"AVAX","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Arbitrum","content":"LOCATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"AMM","content":"ORGANIZATION"},{"type":"Hashflow","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"ups","content":"ORGANIZATION"},{"type":"Hashflow’s RFQ","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}