{"summary":"The securities regulator intends to oversee intermediaries for tokenized securities and the tokenization of investment products.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/260621\/hong-kong-sets-out-requirements-for-asset-tokenization-in-light-of-market-demand","publishDate":"2023-11-02T05:50:59","id":5886,"type":null,"title":"Hong Kong sets out requirements for asset tokenization in light of ‘market demand’","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">Hong Kong’s securities watchdog today published two circulars aimed at overseeing the city’s digital asset tokenization activities, as it positions itself as a web3 hub in Asia.<\/span>","<span data-v-f87c67ca=\"\">In the <\/span><a href=\"https:\/\/apps.sfc.hk\/edistributionWeb\/gateway\/EN\/circular\/doc?refNo=23EC52\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">circulars<\/span><\/a><span data-v-f87c67ca=\"\">, the <\/span><span data-v-f87c67ca=\"\">Securities and Futures Commission provided guidance for intermediaries engaging in tokenized securities-related activities and detailed the requirements for the tokenization of SFC-authorised investment products.<\/span>","<span data-v-f87c67ca=\"\">Specifically, the SFC held the view that tokenized securities are “fundamentally traditional securities with a tokenization wrapper.”<\/span>","<span data-v-f87c67ca=\"\">“The existing legal and regulatory requirements governing the traditional securities markets continue to apply to Tokenised Securities,” the SFC said.<\/span>","<span data-v-f87c67ca=\"\">Offerings of tokenized securities would be subject to the prospectus regime under the Companies Ordinance and the offers of investments regime under Part IV of the Securities and Futures Ordinance, according to the regulator.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The SFC also pointed out that intermediaries advising on tokenized securities, management of tokenized securities in the form of tokenized funds, and secondary market trading of tokenized securities on virtual asset trading platforms are also governed by existing conduct requirements for securities-related activities.<\/span>","<span data-v-f87c67ca=\"\">The regulator’s latest guidance comes as the city is studying and exploring the use of tokenization. The Hong Kong Monetary Authority, its de facto central bank, in February <\/span><a href=\"https:\/\/www.hkma.gov.hk\/eng\/news-and-media\/press-releases\/2023\/02\/20230216-3\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">issued the world's first tokenized green bond<\/span><\/a><span data-v-f87c67ca=\"\">, raising around $100 million.<\/span>","<span data-v-f87c67ca=\"\">Licensed trading platforms are required to put in place a compensation arrangement approved by the SFC to cover the potential loss of security tokens, according to the circular.<\/span>","<span data-v-f87c67ca=\"\">“The SFC wishes to clarify that it may consider, on application by a VATP, to exclude certain Tokenised Securities from the required coverage on a case-by-case basis,” the regulator said. “In assessing the application, the VATP will need to demonstrate to the SFC’s satisfaction that the risk of financial loss to its clients holding those Tokenised Securities can be effectively mitigated if the Tokenised Securities become lost.”<\/span>","<span data-v-f87c67ca=\"\">For example, crypto trading platform operators may demonstrate that they have adopted administrative controls such as transfer restrictions or whitelisting to protect the holders of tokenized securities, according to the regulator.<\/span>","<span data-v-f87c67ca=\"\">HashKey Exchange, a licensed crypto exchange in Hong Kong, <\/span><a href=\"https:\/\/www.theblock.co\/post\/260140\/hong-kong-crypto-exchange-hashkey-launches-app-targets-retail-users\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">told The Block<\/span><\/a><span data-v-f87c67ca=\"\"> earlier this week that it is <\/span><span data-v-f87c67ca=\"\">exploring realistic practices for real-world asset tokenization. Livio Weng, the exchange’s COO, said that it is in talks with the SFC for such tokenization and that it is “exploring two important RWA cases that may bring huge impact to the market.”<\/span>","<span data-v-f87c67ca=\"\">Discussions surrounding tokenization have gained traction lately and the SFC “<\/span><span data-v-f87c67ca=\"\">has observed financial institutions’ growing interest in tokenizing traditional financial instruments in the global financial markets,” the regulator said.<\/span>","<span data-v-f87c67ca=\"\">The securities watchdog <a href=\"https:\/\/apps.sfc.hk\/edistributionWeb\/gateway\/EN\/circular\/doc?refNo=23EC53\" data-v-f87c67ca=\"\">explained<\/a> that it has been<\/span><span data-v-f87c67ca=\"\"> assessing various proposals on the tokenization of SFC-authorized investment products — some for primary dealing of a tokenized product and some for secondary trading of a tokenized product on an SFC-licensed virtual asset trading platform.<\/span>","<span data-v-f87c67ca=\"\">“<\/span><span data-v-f87c67ca=\"\">The SFC sees the potential benefits of tokenization to the financial markets, particularly in increasing efficiency, enhancing transparency, reducing settlement time and lowering costs for traditional finance, but it is also aware of the new risks arising from the use of this technology,” it added.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Companies Ordinance","content":"ORGANIZATION"},{"type":"Securities and Futures Commission","content":"ORGANIZATION"},{"type":"Hong Kong Monetary Authority","content":"ORGANIZATION"},{"type":"SFC","content":"ORGANIZATION"},{"type":"Tokenised Securities","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"Securities","content":"ORGANIZATION"},{"type":"HashKey Exchange","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"}],"hashtag":["ASIAN REGULATION","TRADFI BANKS"],"authors":["Timmy Shen","The Block"]}