{"summary":"As renewable forms of energy production see major efficiency gains, there’s a growing question of what to do when a solar array or windmill produces more","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/11481\/asic-chip-technology-is-renewable-energys-future","publishDate":"2019-02-13T08:54:44","id":5888,"type":null,"title":"ASIC chip technology is renewable energy’s future","category":["TECHNOLOGY"],"content":["As renewable forms of energy production see major efficiency gains, there’s a growing question of what to do when a solar array or windmill produces more power than is immediately needed. Storing the energy in the grid or in batteries can be costly, inefficient, or impossible, so it’s commonplace to simply cut off energy production—a practice known as “curtailment.”","By installing chips known as “ASICs,” the renewable energy industry may be able to use this “excess” energy as an additional revenue source by using it to secure the Bitcoin network, which would convert the electricity to money at market value in a process called “mining.”","This article is intended to educate the reader about the magnitude of the curtailment problem focusing on China, briefly discuss options for dealing with curtailment and outline the potential benefits of using ASIC chips as a tool to help mitigate future curtailment. &nbsp;&nbsp;","Variable Renewable Energy (VRE) is a renewable energy source that is not necessarily available when a user might need it. This is in contrast to on-demand power generated by a nuclear or coal power plant that is available any time. The two most common forms of VRE are solar and wind.","<b data-v-f87c67ca=\"\">Solar <\/b>is the fastest-growing VRE source in the world as of 2017, with China leading global solar panel deployment. Solar curtailment in China was about <a href=\"http:\/\/www.ren21.net\/wp-content\/uploads\/2018\/06\/17-8652_GSR2018_FullReport_web_final_.pdf\" data-v-f87c67ca=\"\">6-7 percent in 2017<\/a>, meaning they purposely shut down the panels 6-7 percent of the time due to overproduction.","<b data-v-f87c67ca=\"\">Wind <\/b>is the next largest source of VRE, with China once again leading the world for wind deployment. <a href=\"http:\/\/www.ren21.net\/wp-content\/uploads\/2018\/06\/17-8652_GSR2018_FullReport_web_final_.pdf\" data-v-f87c67ca=\"\">Wind curtailment in China was 12 percent in 2017<\/a>.","<strong data-v-f87c67ca=\"\">Hydroelectric<\/strong> energy can be considered at least seasonally variable, with curtailment in <a href=\"https:\/\/www.researchgate.net\/publication\/327992077_Reform_and_renewables_in_China_The_architecture_of_Yunnan's_hydropower_dominated_electricity_market\" data-v-f87c67ca=\"\">China reaching 31 TWh in 2016<\/a>, or around 2-3 percent.","China produced 188 TWh of solar energy in 2017 (1.9 percent of the total energy it produced) and on average curtailed 6-7 percent, or about 11 TWh. This number does not include a reduction in solar panel efficiency as a result of air pollutants, which means the total inefficiency of solar was higher. Also, certain areas in China had curtailment rates as high as 22 percent. Multiple factors such as overproduction, <a href=\"https:\/\/www.nrel.gov\/docs\/fy14osti\/60983.pdf\" data-v-f87c67ca=\"\">transmission congestion<\/a>, or lack of transmission access cause VRE curtailment.","At the average Chinese electricity price of <a href=\"https:\/\/www.ovoenergy.com\/guides\/energy-guides\/average-electricity-prices-kwh.html\" data-v-f87c67ca=\"\">$.08\/KWh<\/a> (the U.S. averages around &nbsp;<a href=\"https:\/\/www.eia.gov\/electricity\/monthly\/epm_table_grapher.php?t=epmt_5_6_a\" data-v-f87c67ca=\"\">~$.13\/KWh<\/a>) 11 TWh of solar electricity is worth about $880 million, although wholesale electricity is generally sold to the grid at a lower rate (in the U.S., it’s about $.03-.04\/KWh). At the U.S. wholesale rate, 11 TWh would be worth $330-$440 million.","China curtailed 12 percent of its wind power in 2017, or roughly 41.9 TWh. With our estimate of $.08\/KWh, the excess wind in China in 2017 was worth $3.34 billion. Even if they were able to sell the energy at a price of $.001\/KWh, China would be losing out on $41.9 million of electricity by turning the windmills off.<a href=\"https:\/\/www.theblockcrypto.com\/2019\/02\/13\/asic-chip-technology-is-renewable-energys-future\/screen-shot-2019-03-13-at-4-22-45-pm\/\" rel=\"attachment wp-att-15673\" data-v-f87c67ca=\"\"><img class=\"size-full wp-image-15673 aligncenter\" src=\"https:\/\/www.theblockcrypto.com\/wp-content\/uploads\/2019\/02\/Screen-Shot-2019-03-13-at-4.22.45-PM.png\" alt=\"\" width=\"968\" height=\"586\" data-v-f87c67ca=\"\"><\/a>","<em data-v-f87c67ca=\"\">China Wind Curtailment 2010-2016<\/em>","To put this into perspective, the amount of wind and solar energy curtailed in China in 2017 could have powered the entire country of <a href=\"https:\/\/www.worlddata.info\/europe\/ireland\/energy-consumption.php\" data-v-f87c67ca=\"\">Ireland for two years<\/a>. If we add the curtailed hydroelectric energy from 2016, it would've increased to nearly 4 years.","Europe has a problem with VRE curtailment as well. Germany curtailed 3.7 TWh in 2016. The average cost of electricity in Germany in <a href=\"https:\/\/www.statista.com\/statistics\/418078\/electricity-prices-for-households-in-germany\/\" data-v-f87c67ca=\"\">2016 was EUR .29\/KWh<\/a>, which meant that had they been able to sell the energy at the average price instead of shutting off their power, they could have made EUR 1.073 billion ($1.2 billion).","<a href=\"https:\/\/www.theblockcrypto.com\/2019\/02\/13\/asic-chip-technology-is-renewable-energys-future\/screen-shot-2019-03-13-at-4-23-10-pm\/\" rel=\"attachment wp-att-15674\" data-v-f87c67ca=\"\"><img class=\"size-full wp-image-15674 aligncenter\" src=\"https:\/\/www.theblockcrypto.com\/wp-content\/uploads\/2019\/02\/Screen-Shot-2019-03-13-at-4.23.10-PM.png\" alt=\"\" width=\"1076\" height=\"594\" data-v-f87c67ca=\"\"><\/a>","<em data-v-f87c67ca=\"\">California VRE Curtailment Stats 2016-2019<\/em>","Curtailment of VRE in California can occasionally reach up to <a href=\"https:\/\/www.caiso.com\/documents\/curtailmentfastfacts.pdf\" data-v-f87c67ca=\"\">20-30 percent during certain times,<\/a> with an overall annual curtailment rate of 1-3 percent (and increasing) from 2015-2017, or up to .3 TWh. <a href=\"https:\/\/www.nrel.gov\/docs\/fy18osti\/71493.pdf\" data-v-f87c67ca=\"\">In Q1 2018, California curtailed .13 TWh<\/a>, losing out on around $16.8 million if they could have sold the electricity for $.13\/KWh, or $3.9-$5.2 million at the wholesale price. &nbsp;","There is a lot of money being left on the table, although the price of electricity would be lower than our estimates if it was produced and used more efficiently. The two most common solutions for curtailment are to use batteries to store the excess electricity and to improve grid management, like moving the electricity to sell in other countries. Batteries are expensive, require a lot of resources to construct, and lose anywhere from <a href=\"https:\/\/www.physicsforums.com\/threads\/power-consumed-during-battery-charging.570315\/\" data-v-f87c67ca=\"\">10-25 percent of the electricity<\/a> to heat during charging. The losses of efficiency for transporting electricity is <a href=\"https:\/\/blog.schneider-electric.com\/energy-management-energy-efficiency\/2013\/03\/25\/how-big-are-power-line-losses\/\" data-v-f87c67ca=\"\">estimated to be around 8-15 percent<\/a>.","ASIC stands for Application Specific Integrated Circuit. They are computer chips designed to perform a single function as efficiently as possible. SHA256 ASICs are a possible additional solution to help reduce VRE curtailment.","SHA256 ASIC chips consume electricity and produce SHA256 hashes, which are used to secure the Bitcoin network and are paid by the network in Bitcoin for the work accomplished. A single Bitmain S9 ASIC consumes 1.375 KWh of electricity at an efficiency rate of ~.1 Joules\/Gigahash. In 2017, the cost of a single <a href=\"https:\/\/www.bitcoinmining.com\/bitmain-antminer-s9-review-bitcoin-mining\/\" data-v-f87c67ca=\"\">S9 ASIC chip was $2,000<\/a>.","These chips and the Bitcoin network are designed to convert the cheapest electricity available directly into money, making them a fantastic candidate to help reduce VRE curtailment. The Bitcoin network will pay for all of the otherwise curtailed electricity it can get.","This section will attempt to calculate the low-end value that could have been captured from the curtailed solar\/wind energy in China in 2017 using ASIC chips to secure the Bitcoin Network.","Assumptions\/Inputs:","If we were able to burn all 11TWh of curtailed solar electricity in China, we can follow the below steps to see the value of USD we could have generated. Remember, the above are conservative assumptions used in an attempt to <b data-v-f87c67ca=\"\">underestimate<\/b> the profit.","First, let’s calculate the profitability of a single ASIC chip running for an hour. BTC issuance per second in 2017 was 12.5\/600, or .021 BTC\/second.<a href=\"https:\/\/www.theblockcrypto.com\/2019\/02\/13\/asic-chip-technology-is-renewable-energys-future\/screen-shot-2019-03-13-at-4-23-48-pm\/\" rel=\"attachment wp-att-15676\" data-v-f87c67ca=\"\"><img class=\"size-full wp-image-15676 alignleft\" src=\"https:\/\/www.theblockcrypto.com\/wp-content\/uploads\/2019\/02\/Screen-Shot-2019-03-13-at-4.23.48-PM.png\" alt=\"\" width=\"1206\" height=\"80\" data-v-f87c67ca=\"\"><\/a>","This gives us the profit per hour 1 ASIC chip would yield, ignoring the investment cost and given our inputs, which works out to about $.32\/hr. Next, let’s find the total hours we need to run the ASICs to burn all of the electricity. We’re using 1.375 KWh per ASIC.","<a href=\"https:\/\/www.theblockcrypto.com\/2019\/02\/13\/asic-chip-technology-is-renewable-energys-future\/screen-shot-2019-03-13-at-4-23-58-pm\/\" rel=\"attachment wp-att-15678\" data-v-f87c67ca=\"\"><img class=\"alignnone  wp-image-15678\" src=\"https:\/\/www.theblockcrypto.com\/wp-content\/uploads\/2019\/02\/Screen-Shot-2019-03-13-at-4.23.58-PM.png\" alt=\"\" width=\"364\" height=\"50\" data-v-f87c67ca=\"\"><\/a>","Finally, we can plug ASIC hours and the profit per hour per ASIC into the below equation to figure out the total profit subtracting the cost of purchasing the ASICs and using them for the entire year. We wouldn’t burn all of the ASIC hours at once.&nbsp;&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/2019\/02\/13\/asic-chip-technology-is-renewable-energys-future\/screen-shot-2019-03-13-at-4-24-10-pm\/\" rel=\"attachment wp-att-15680\" data-v-f87c67ca=\"\"><img class=\"size-full wp-image-15680 alignleft\" src=\"https:\/\/www.theblockcrypto.com\/wp-content\/uploads\/2019\/02\/Screen-Shot-2019-03-13-at-4.24.10-PM.png\" alt=\"\" width=\"1250\" height=\"88\" data-v-f87c67ca=\"\"><\/a>","With an investment of $1.8 billion in ASIC chips in January 2017, profits from the curtailed solar energy in China for the year would have been around $778,171,945. Profits from the 41.8 TWh of curtailed wind electricity at an investment of $6.9 billion in ASICs would have been somewhere in the realm of $2.96 Billion. For reference, China is planning to spend <a href=\"https:\/\/www.nytimes.com\/2017\/01\/05\/world\/asia\/china-renewable-energy-investment.html\" data-v-f87c67ca=\"\">$360 billion on renewables by 2020<\/a>.","Investing $5 billion into ASIC chips would certainly have inflated the overall hashrate and reduced the profitability, but I tried to account for this by using overly conservative estimates for the other parameters and by assuming the ASICs were used sporadically when there was curtailable energy instead of running them constantly.","Taking this formula and applying it to today’s network hashrate (45.67 Exahash) and BTC price ($3,436.89) while purchasing and using 2017 ASICs (14 TH\/S) at today’s price of $300 per S9 ASIC yields an estimated profit of $351,851,722 off of 11 TWh of curtailed solar electricity, and an estimated profit of $1.34 billion from 41.8 TWh of curtailed wind electricity.","Calculating the past values of what VRE producers <i data-v-f87c67ca=\"\">could have made<\/i> had they integrated ASIC chips is inherently inexact, but the takeaways are as follows.","It appears profitable to integrate ASIC chips with VRE sources at the time of deployment - by building them into solar panel installations, for example - to help offload surplus energy instead of curtailing it. Start by predicting the maximum curtailable electricity per VRE in KWh at a given time and work backwards to figure out how many ASICs to include using the formula above. While the hashrate of Bitcoin has increased and the price has decreased in 2018, the price of a 14 TH\/S ASIC chip has dropped substantially to somewhere around $300-$400 and the price of the high end ASIC chips which get 28 TH\/S is around $1,000. There is a substantial amount of money to be made by using ASICs powered by VRE instead of curtailing the energy.","That said, there are serious regulatory and bureaucratic barriers to installing ASICs. At least in the U.S., nearly all VRE producers have agreements with the grid for it to pay producers for the curtailed electricity, but this compounds the problem and makes overall energy production even less efficient and more expensive for consumers. Additionally, the reliability of ASICs and the costs of procuring such a large number of them could be difficult as the technology continues to advance and the suppliers compete to hit the technological limit of chip manufacturing (currently around 7nm).","With properly integrated ASIC chips, VREs would become even more efficient and competitive compared to polluting energy sources, increasing the pace at which we transition global energy production to cleaner methods, decreasing the price of energy further for consumers, and further reducing our CO2 emissions.","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$41.9 million","content":"MONEY"},{"type":"$3,436.89","content":"MONEY"},{"type":"$300","content":"MONEY"},{"type":"EUR","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$1.34 billion","content":"MONEY"},{"type":"ASIC","content":"ORGANIZATION"},{"type":"1.9 percent","content":"PERCENT"},{"type":"7 percent","content":"PERCENT"},{"type":"15 percent","content":"PERCENT"},{"type":"$2,000","content":"MONEY"},{"type":"Bitmain S9 ASIC","content":"ORGANIZATION"},{"type":"$.08\/KWh","content":"MONEY"},{"type":"$.001\/KWh","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$1,000","content":"MONEY"},{"type":"22 percent","content":"PERCENT"},{"type":"January 2017","content":"DATE"},{"type":"$3.34 billion","content":"MONEY"},{"type":"$880 million","content":"MONEY"},{"type":"California","content":"LOCATION"},{"type":"1.375 KWh","content":"MONEY"},{"type":"1.073 billion","content":"MONEY"},{"type":"~.1 Joules\/Gigahash","content":"ORGANIZATION"},{"type":"$330","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"$351,851,722","content":"MONEY"},{"type":"2015","content":"DATE"},{"type":"2016","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2010","content":"DATE"},{"type":"$400","content":"MONEY"},{"type":"12 percent","content":"PERCENT"},{"type":"$5.2 million","content":"MONEY"},{"type":"$5 billion","content":"MONEY"},{"type":"$2.96 Billion","content":"MONEY"},{"type":"EUR .29\/KWh","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Europe","content":"LOCATION"},{"type":"$3.9","content":"MONEY"},{"type":"$1.8 billion","content":"MONEY"},{"type":"$.13\/KWh","content":"MONEY"},{"type":"Germany","content":"LOCATION"},{"type":"Application Specific Integrated Circuit","content":"ORGANIZATION"},{"type":"$6.9 billion","content":"MONEY"},{"type":"$.03","content":"MONEY"},{"type":"$778,171,945","content":"MONEY"},{"type":"$440 million","content":"MONEY"},{"type":"3 percent","content":"PERCENT"},{"type":"30 percent","content":"PERCENT"},{"type":"$360 billion","content":"MONEY"},{"type":"$16.8 million","content":"MONEY"},{"type":"$.32","content":"MONEY"},{"type":"Bitcoin Network","content":"ORGANIZATION"},{"type":"$1.2 billion","content":"MONEY"},{"type":"China","content":"LOCATION"},{"type":"Ireland","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"25 percent","content":"PERCENT"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["HARDWARE"],"authors":["Contributor Network","The Block"]}