{"summary":"The Graph has begun the final phase of its migration to the Ethereum Layer 2 network Arbitrum to enhance scaling capabilities.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234561\/the-graph-arbitrum","publishDate":"2023-06-14T12:05:58","id":5890,"type":null,"title":"The Graph migrates to Arbitrum to enhance scalability","category":["LAYER 2S AND SCALING"],"content":["The Graph, a leading indexing and query protocol for organizing blockchain data, has entered the final phase of its migration to Arbitrum, a Layer 2 scaling solution built on Ethereum. The transition aims to reduce gas fees, accelerate transaction speeds and increase accessibility to the protocol.","Network participants voted on and approved the transition to Arbitrum via a Graph Improvement Proposal. According to a statement released on Wednesday, it aligns with the community's desire for an enhanced network experience and lower participation costs.&nbsp;","The process began in 2022 with the initial deployment as Phase One, with protocol rewards on Layer 2 enabled during Phase Two. Today marks the beginning of Phase Three of the integration — representing a complete migration to the Arbitrum network.&nbsp;","\"The Graph users have consistently sought solutions to improve gas efficiencies and other aspects of the network. After careful evaluation of available options, the ecosystem chose Arbitrum as the Layer 2 scaling solution to provide speed and affordability to protocol developers and network participants,\" Tegan Kline, CEO of Edge &amp; Node, one of the development teams behind The Graph protocol, said in the statement. The Edge &amp; Node co-founder was <a href=\"https:\/\/www.theblock.co\/post\/233809\/the-graph-creator-edge-node-taps-new-ceo-tegan-kline-as-growth-becomes-top-priority\" data-v-f87c67ca=\"\">appointed<\/a> as CEO last week.","The Graph's users will have the option to transition to Arbitrum across all of its products. Protocol rewards will gradually shift from Ethereum and eventually become fully operational on Arbitrum. The Graph's core developers are actively building Layer 2 transfer tools to aid the transition for network participants.","Delegators can delegate The Graph's native token, GRT, more efficiency due to lower gas fees available on Arbitrum. Delegators are network participants who delegate GRT to one or more Indexers. Indexers operate nodes in The Graph Network, and provide indexing and query-processing services. Indexers can claim GRT rewards, with gas fees reduced by up to 300 times following the transition, The Graph said.","“Blockchain data is a key component powering the next iteration of innovation in web3. With The Graph fully operating on Arbitrum, Arbitrum users can take advantage of data accessibility,” said Offchain Labs CEO Steven Goldfeder. Offchain Labs is the original developer of Arbitrum.","Following the announcement, The Graph and Arbitrum are hosting an event at the House of Web3 in San Francisco this evening.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Steven Goldfeder","content":"PERSON"},{"type":"Edge &amp; Node","content":"ORGANIZATION"},{"type":"Graph Improvement Proposal","content":"ORGANIZATION"},{"type":"last week","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Tegan Kline","content":"PERSON"},{"type":"House of Web3","content":"ORGANIZATION"},{"type":"this evening","content":"TIME"},{"type":"The Graph","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ARBITRUM"],"authors":["James Hunt","The Block"]}