{"summary":"Earlier crypto tax reporting requirements may crop up in the fuller language of the budget bill due to drop after Labor Day.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/116508\/what-does-the-looming-fight-in-congress-over-a-3-5-trillion-spending-plan-mean-for-crypto","publishDate":"2021-09-02T18:10:11","id":5892,"type":null,"title":"What does the looming fight in Congress over a $3.5 trillion spending plan mean for crypto?","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">The next two weeks could determine whether a new round of Congressional haggling over crypto takes place.<\/span>","<span data-v-f87c67ca=\"\">On August 24, the House of Representatives passed a <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/115578\/to-pass-budget-house-speaker-pelosi-commits-to-finalizing-infrastructure-bill-by-sept-27\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">framework for the 2022 budget<\/span><\/a><span data-v-f87c67ca=\"\"> and plans to spend trillions of dollars on President Joe Biden’s domestic agenda. Unlike the <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/114079\/senate-passes-trillion-dollar-infrastructure-bill-with-unamended-crypto-tax-language\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">notorious infrastructure bill<\/span><\/a><span data-v-f87c67ca=\"\"> that accompanies it, the budget framework has yet to single out cryptocurrency.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But right now, it’s just a framework. Since the night of the budget’s approval, Capitol Hill has been effectively a ghost ship, hosting sporadic committee hearings and pro forma floor sessions that clock in at under 10 minutes.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Backstage, however, the Democrats of the House committees are meeting with their Senate counterparts to fill in that framework. They are running the numbers, both for the budget’s accounts and legislative support. And they want to make sure that what they put out will pass both with minimal friction.<\/span>","<span data-v-f87c67ca=\"\">The package is under fairly tight deadlines, jammed between Labor Day and the fiscal year’s beginning on October 1. Speaker of the House Nancy Pelosi has <\/span><a href=\"https:\/\/www.rollcall.com\/2021\/08\/25\/pelosi-pledges-coordination-with-senate-on-3-5t-budget-package\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\"> that all relevant committees will have markups on the actual package done by September 15.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Keep in mind, the annual budget bill is an opportune time to push a legislative agenda. Rules set up in the twilight of the Nixon administration have established the budget as an omnibus package that the Senate cannot filibuster and which therefore can pass with simple, rather than two-thirds, majorities.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The formal process has barely begun. Only two House committees — Natural Resources and Oversight — held markups on Thursday, and neither is responsible for any of the major chunks of the budget. But otherwise, as of Thursday evening, the Congressional schedule between now and September 15 is blank.<\/span>","<span data-v-f87c67ca=\"\">Part of getting the initial budget framework passed in the House was wooing a renegade group of moderate Democrats who objected to its scale. Pelosi alluded to the package’s urgency, <\/span><a href=\"https:\/\/www.speaker.gov\/newsroom\/82421\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">saying<\/span><\/a><span data-v-f87c67ca=\"\">:&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We must keep the 51-vote privilege by passing the budget and work with House and Senate Democrats to reach agreement in order for the House to vote on a Build Back Better Act that will pass the Senate.”<\/span>","<span data-v-f87c67ca=\"\">Unlike the markups and committee hearings, however, that ongoing process is “informal” and largely behind closed doors. Ultimately, those involved need to balance the books convincingly. Given the scope of Biden’s agenda, that is going to require some new revenue intake, which will entail going back to the Treasury’s previously explained revenue wishlist.<\/span>","<span data-v-f87c67ca=\"\">The Treasury’s “General Explanations of the Administration’s Revenue Proposals,” or <\/span><a href=\"https:\/\/home.treasury.gov\/system\/files\/131\/General-Explanations-FY2022.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Green Book<\/span><\/a><span data-v-f87c67ca=\"\">, lay out the administration’s plans for where revenue will come from. It was the Green Book that initially spotlighted the need to classify crypto actors as “brokers” for tax reporting purposes, a proposal whose late-stage inclusion in the Senate infrastructure bill became a centerpiece of conflict over that bill and its processing.<\/span>","<span data-v-f87c67ca=\"\">A Roll Call <\/span><a href=\"https:\/\/www.rollcall.com\/2021\/08\/30\/treasury-pushes-global-crypto-data-sharing-rules-in-budget-bill\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">report<\/span><\/a><span data-v-f87c67ca=\"\"> from earlier this week suggested that the Treasury was pushing Democrats in Congress to include the <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">other,<\/span><\/i><span data-v-f87c67ca=\"\"> overlooked crypto provision from the Green Book in the budget. That provision would increase U.S. crypto broker reporting to foreign tax agencies on foreign account holders of U.S. accounts. The logic, the Treasury wrote, was that:&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“In order to ensure that the United States is able to benefit from a global automatic exchange of <\/span><span data-v-f87c67ca=\"\">information framework with respect to offshore crypto assets and receive information about U.S. <\/span><span data-v-f87c67ca=\"\">beneficial owners it is essential that United States reciprocally provide information on foreign <\/span><span data-v-f87c67ca=\"\">beneficial owners of certain entities transacting in crypto assets with U.S. brokers.”<\/span>","<span data-v-f87c67ca=\"\">A Treasury representative declined to go on the record with The Block to confirm or deny a renewed push.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Budget bills are bound by special standards of germaneness, but given their special urgency, they end up as massive omnibus constructions regardless.<\/span>","<span data-v-f87c67ca=\"\">Critically, anything that appears on the budget proposals as they emerge publicly in the coming weeks will have been galvanized among committee leadership in advance.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On the plus side for crypto advocates in Washington, Senator Ron Wyden chairs the Senate Finance Committee, which handles taxes and will play an outsized role in the budget. Wyden emerged during the infrastructure bill debate as a major supporter for crypto transaction privacy, ultimately declining to <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/113957\/senators-compromise-crypto-tax-infrastructure-bill\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">sponsor the final compromise<\/span><\/a><span data-v-f87c67ca=\"\"> because it did not protect network participants sufficiently.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A representative for the Senate Finance Committee did not respond to The Block’s request for comment as of publication time.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"earlier this week","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"October 1","content":"DATE"},{"type":"August 24","content":"DATE"},{"type":"House of Representatives","content":"ORGANIZATION"},{"type":"Administration","content":"ORGANIZATION"},{"type":"Joe Biden","content":"PERSON"},{"type":"Pelosi","content":"PERSON"},{"type":"Ron Wyden","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"trillions of dollars","content":"MONEY"},{"type":"House Nancy Pelosi","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Congressional","content":"ORGANIZATION"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"evening","content":"TIME"},{"type":"— Natural Resources","content":"ORGANIZATION"},{"type":"Senate Finance Committee","content":"ORGANIZATION"},{"type":"House","content":"ORGANIZATION"},{"type":"Nixon","content":"PERSON"},{"type":"September 15","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Biden","content":"PERSON"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":["CONGRESS"],"authors":["Kollen Post","The Block"]}