{"summary":"Korean prosecutors have reportedly officially launched an investigation into the UST and LUNA crash by summoning all Terraform employees.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/149309\/terraform-labs-employees-summoned-korea-prosecutors-ust-luna","publishDate":"2022-05-30T07:35:50","id":5897,"type":null,"title":"Korean prosecutors summon all Terraform Labs employees: JTBC","category":["LEGAL"],"content":["Prosecutors in South Korea have summoned all employees of Terraform Labs to investigate the collapse of TerraUSD, the stablecoin known by its UST ticker, according to a report from local television network JTBC on Saturday.","Specifically, the Seoul Southern District Prosecutors Office's joint financial and securities crime investigation team has summoned Terraform employees, <a href=\"https:\/\/news.jtbc.joins.com\/html\/590\/NB12060590.html\" data-v-f87c67ca=\"\">JTBC reported<\/a>, without citing any sources.","One unnamed employee, known to have been involved in the initial development of the Terra blockchain in 2019, has reportedly already testified.&nbsp;This employee is said to have told prosecutors that there were concerns about UST's design from some within Terraform Labs.","The algorithmic stablecoin UST dramatically crashed earlier this month, destroying more than $40 billion of value for investors. UST's price, which was always supposed to be $1, fell below 10 cents and still hasn't recovered. It is now trading at <a href=\"https:\/\/www.coingecko.com\/en\/coins\/terraclassicusd\" data-v-f87c67ca=\"\">3 cents<\/a>, according to CoinGecko data. UST's sister token, luna, lost almost its entire value and is now <a href=\"https:\/\/www.coingecko.com\/en\/coins\/terra-luna-classic\" data-v-f87c67ca=\"\">trading at<\/a> a fraction of a cent.","As a result of the implosions, Terraform Labs <a href=\"https:\/\/www.theblockcrypto.com\/post\/149127\/terra-gets-second-life-as-new-blockchain-goes-live-with-luna-2-0-airdrop\" data-v-f87c67ca=\"\">launched<\/a> the new Terra blockchain, called Terra 2.0, over the weekend. It abandoned UST as part of the new blockchain and renamed the original luna tokens to \"luna classic\" (LUNC).&nbsp;","Per the JTBC report, prosecutors are looking at the whole matter, including whether CEO Do Kwon and other Terraform Labs executives neglected UST's design flaws. Prosecutors are reportedly also looking into whether local cryptocurrency exchanges went through a proper listing review before listing UST or luna.","Earlier this month, Korea's financial regulators — the Financial Services Commission (FSC) and the Financial Supervisory Service (FSS) — reportedly <a href=\"https:\/\/www.theblockcrypto.com\/post\/147269\/south-korean-politician-calls-for-hearing-terra-do-kwon\" data-v-f87c67ca=\"\">launched<\/a> \"emergency inspections\" into local crypto exchanges to enhance investor protection.","The Block has reached out to Terraform Labs for comment on the JTBC report and will update this story should we hear back.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"3 cents","content":"MONEY"},{"type":"South Korea","content":"LOCATION"},{"type":"FSS","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"Korea","content":"LOCATION"},{"type":"Financial Supervisory Service","content":"ORGANIZATION"},{"type":"$1","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"10 cents","content":"MONEY"},{"type":"UST","content":"ORGANIZATION"},{"type":"Seoul Southern District Prosecutors Office","content":"ORGANIZATION"},{"type":"Financial Services Commission (FSC","content":"ORGANIZATION"},{"type":"Saturday","content":"DATE"}],"hashtag":["DO KWON"],"authors":["Yogita Khatri","The Block"]}