{"summary":"Sam Bankman-Fried was a prolific political donor during the last two election cycles, but candidates and political committees are distancing themselves from him after the FTX collapse.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195852\/democratic-groups-ditch-more-than-1-million-in-donations-linked-to-sam-bankman-fried","publishDate":"2022-12-16T16:31:39","id":5899,"type":null,"title":"Democratic groups ditch more than $1 million in donations linked to Sam Bankman-Fried ","category":["POLICY"],"content":["A trio of major Democratic political groups plans to return more than $1 million in political contributions linked to Sam Bankman-Fried, after the former FTX CEO was charged with breaking campaign finance laws.","Bankman-Fried was a megadonor who gave primarily to Democrats during the 2022 campaign cycle, but he has recently said he funded Republicans through dark-money groups that do not report their donors.&nbsp;","Three major Democratic political committees say they will return more than $1 million in political donations from Sam Bankman-Fried, after the disgraced former FTX boss was charged with violating campaign finance laws.","The Democratic National Committee plans to return $815,000 in donations from Bankman-Fried, according to a spokesperson. The party's Senate and House campaign committees will also set aside a combined $353,000 to return after they receive direction during legal proceedings.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Bankman-Fried was a prolific political donor during the 2020 and 2022 election cycles, spending millions on campaign contributions and his own super PAC. The move to return party funds follows a rush by <span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">individual lawmakers that have sought to <a href=\"https:\/\/www.theblock.co\/post\/188810\/lawmakers-weigh-what-to-do-with-sam-bankman-frieds-political-cash-after-ftxs-collapse\" data-v-f87c67ca=\"\">distance<\/a> themselves from Bankman-Fried by giving contributions he made to charity after news of troubles at the exchange first emerged.&nbsp;<br data-v-f87c67ca=\"\">\n<\/span>","The federally-indicted crypto mogul gave $45,000 to the National Republican Congressional Committee, according to Federal Election Commission filings. The committee, which did not immediately respond to a request for comment, also received $89,200 from FTX Digital Markets co-CEO Ryan Salame during the 2022 cycle.","The Department of Justice earlier this week <a href=\"https:\/\/www.theblock.co\/post\/194667\/disgraced-former-ftx-ceo-sam-bankman-fried-criminally-indicted\" data-v-f87c67ca=\"\">accused<\/a> Bankman-Fried of disguising political contributions to seem like they came from “wealthy co-conspirators,” when the funds allegedly belonged to FTX customers and had been transferred to Bankman-Fried’s trading firm. The former FTX CEO contributed approximately $40 million, primarily to Democrats, although he’s said recently that he secretly gave an equivalent amount in support of Republicans through dark-money groups that do not disclose their donors.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","\"All of this dirty money was used in service of Bankman-Fried's desire to buy bipartisan influence and impact the direction of public policy,\" U.S. Attorney for the Southern District of New York Damian Williams said in a press conference this week.","The Democratic Senatorial Campaign Committee plans to return $103,000 in donations associated with Bankman-Fried, and the Democratic Congressional Campaign Committee will return $250,000, according to <a href=\"https:\/\/www.washingtonpost.com\/business\/2022\/12\/16\/democrats-will-seek-return-more-than-1-million-bankman-fried\/\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">The Washington Post<\/span><\/a>.","Salame and former FTX Digital Markets Director of Engineering Nishad Singh also gave millions to political action committees and campaigns last cycle.&nbsp;","Bankman-Fried is being held without bail in a Bahamas jail until a February hearing. He has also been charged in two other cases filed by the Securities and Exchange Commission and the Commodity Futures Trading Commission.","FTX filed for bankruptcy protection last month after a run on its utility token. The firm could owe as much as $3.1 billion to more than 100,000 creditors, bankruptcy filings show.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/i><span class=\"c-message__edited_label\" dir=\"ltr\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"$89,200","content":"MONEY"},{"type":"$40 million","content":"MONEY"},{"type":"The Washington Post","content":"ORGANIZATION"},{"type":"National Republican Congressional Committee","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$815,000","content":"MONEY"},{"type":"Federal Election Commission","content":"ORGANIZATION"},{"type":"Democratic Senatorial Campaign Committee","content":"ORGANIZATION"},{"type":"$103,000","content":"MONEY"},{"type":"$250,000","content":"MONEY"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Ryan Salame","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$3.1 billion","content":"MONEY"},{"type":"February","content":"DATE"},{"type":"$353,000","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Democratic National Committee","content":"ORGANIZATION"},{"type":"House","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"FTX Digital Markets Director of Engineering Nishad Singh","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"$45,000","content":"MONEY"},{"type":"Democratic Congressional Campaign Committee","content":"ORGANIZATION"},{"type":"Bahamas","content":"LOCATION"},{"type":"December 2022","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"the Southern District of New York Damian Williams","content":"ORGANIZATION"},{"type":"Michael McCaffrey","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Senate","content":"ORGANIZATION"},{"type":"FTX Digital Markets","content":"ORGANIZATION"}],"hashtag":["FUNDRAISING","PACS"],"authors":["Stephanie Murray","The Block"]}