{"summary":"Crypto exchange Binance is set to delist four privacy coins — XMR, MOB, FIRO and ZEN — in Belgium later this month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/249473\/binance-privacy-coins-belgium","publishDate":"2023-09-06T12:46:56","id":59,"type":null,"title":"Binance moves to delist privacy coins in Belgium","category":["COMPANIES"],"content":["Roughly three months after delisting privacy coins in other European nations, Binance said it is also halting trading of the tokens in Belgium.","\"While we aim to support as many quality projects as possible, we are required to follow local laws and regulations regarding the trading of privacy coins,\" a Binance spokesperson told The Block by email in response to questions regarding an online <a href=\"https:\/\/x.com\/mister_ch0c\/status\/1699290391168618722?s=46&amp;t=oHf46otX4Di1EPF3Xc_kDA\" data-v-f87c67ca=\"\">post<\/a> that showed a message sent from the exchange's customer service department to Belgian users.","<span data-v-f87c67ca=\"\">In the post, Binance said customers \"that reside in Belgium will no longer be able to purchase, or trade certain privacy coins on our platform.\" The company referenced privacy coins including Monero (<span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248374\/monero-xmr-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/monero_logo.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">XMR<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.41%\n    <\/span><\/a> <!----><\/span>), MobileCoin (MOB), Firo (FIRO) and Horizen (ZEN).<\/span>","In June, Binance delisted privacy coins in <a href=\"https:\/\/www.theblock.co\/post\/232751\/binance-privacy-coins-delisting-europe\" data-v-f87c67ca=\"\">France, Italy, Poland and Spain<\/a>. The Belgium move comes after Binance <a href=\"https:\/\/www.binance.com\/en\/blog\/ecosystem\/binance-continues-to-serve-belgian-users-8435767371921116777\" data-v-f87c67ca=\"\">said<\/a> last week it will serve Belgian users via its Poland entity, and due to this migration, Poland rules now also apply to Belgian users.","From Sept. 21, Binance users who reside in Belgium will no longer be able to purchase or trade the four privacy coins on its platform.","Privacy coins are a type of cryptocurrency designed to anonymize transactions by implementing technologies such as zero-knowledge proofs that can conceal transaction details and make it difficult to track the sender, recipient and transaction amounts. The European Union has been actively addressing money laundering concerns associated with anonymous crypto transactions and is considering new regulations that <a href=\"https:\/\/www.theblock.co\/post\/187078\/european-aml-rules-could-ban-privacy-coins-coindesk\" data-v-f87c67ca=\"\">could ban privacy coins.<\/a>","Binance is moving to delist privacy coins in \"every market that we are required to,\" a Binance spokesperson said. \"We constantly monitor our regulatory obligations and will make further updates to our products and coin offerings as required.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sept. 21","content":"DATE"},{"type":"France","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"-0.41%","content":"PERCENT"},{"type":"Spain","content":"LOCATION"},{"type":"Italy","content":"LOCATION"},{"type":"Poland","content":"LOCATION"},{"type":"Binance spokesperson","content":"ORGANIZATION"},{"type":"Belgium","content":"LOCATION"},{"type":"Binance","content":"PERSON"},{"type":"European Union","content":"ORGANIZATION"}],"hashtag":["BINANCE"],"authors":["RT Watson","Yogita Khatri","The Block"]}