{"summary":"Firms vying for a spot bitcoin ETF have fixed some concerns over how those products should be structured, according to multiple sources.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/270222\/issuers-have-fixed-three-of-the-secs-remaining-concerns-for-spot-bitcoin-etfs-sources","publishDate":"2024-01-04T08:29:40","id":590,"type":null,"title":"Issuers have fixed three of the SEC&#x27;s remaining concerns for spot bitcoin ETFs: Sources","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Firms vying for a spot bitcoin exchange-traded fund have been hard at work behind the scenes, addressing the Securities and Exchange Commission's concerns over spot bitcoin exchange-traded funds over the last several weeks in meetings with the regulator.<br data-v-f87c67ca=\"\">\n<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">ETF issuers have been focusing on feedback, as indicated by high-ranking executives at multiple issuers and recent filings. These meetings have prompted companies like Grayscale to adopt a creation and redemption model preferred by the SEC. This has resulted in issuers agreeing to disclose authorized participants in what the source described as an unusual step. Additionally, concerns regarding hard forks have also been addressed.<\/span>","In certain ETF structures, funds adhere to an \"in-kind\" redemption model, allowing investors to exchange shares for its underlying securities or commodities — typically to avoid tax penalties. In a cash model, the issuer must transfer the stored bitcoin and immediately sell it to provide cash. Companies like BlackRock have indicated their inclination towards adopting a cash model for their proposed spot bitcoin ETF, and Grayscale is the latest to follow suit.","\"The SEC asked everyone if you want to be in the first wave you have to be cash,\" the source said.","<span class=\"s1\" data-v-f87c67ca=\"\">Grayscale had been pushing for in-kind, but acquiesced to the SEC’s desires, according to a source familiar. <\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">In a meeting with the SEC ahead of the Christmas holiday, Grayscale argued it should offer both in-kind and cash create and redemption models. The U.S. ETF marketplace has 86 commodity ETFs, Grayscale said, of which 15 are “true, physically-backed commodity ETPs.” All of those products have an in-kind redemption and creation model, it added.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">“In the 30-year history of the US ETP marketplace, all spot commodity ETPs have employed in-kind only primary market transactions,” Grayscale said during the meeting, according to the source. “Caution should be exercised before breaking with this convention, for the first time, as it relates to the approval of spot <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +1.05%\n    <\/span><\/a> <!----><\/span><\/span> ETPs.”<\/span><\/span>","This argument did not persuade the agency to change its mind. On Dec. 26, Grayscale amended its S-3 form to adopt the cash model.","<span class=\"s2\" data-v-f87c67ca=\"\">Over the course of amended filings over the last few days, firms keen to list a spot bitcoin ETF have begun naming authorized participants, which the issuer-linked source said is not customary but something the SEC pushed for.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\"><a href=\"https:\/\/www.theblock.co\/post\/269732\/blackrock-updates-sec-filing-for-spot-bitcoin-etf-names-jane-street-and-jpmorgan-as-authorized-participants\" data-v-f87c67ca=\"\">BlackRock<\/a>, for example, named Jane Street Capital and JP Morgan Securities LLC as authorized participants over the past week. V<\/span><span class=\"s4\" data-v-f87c67ca=\"\">alkyrie named Jane Street Capital and Cantor Fitzgerald. <\/span><span class=\"s2\" data-v-f87c67ca=\"\">Authorized participants a<\/span><span class=\"s1\" data-v-f87c67ca=\"\">re registered broker-dealers used in the creation and redemption processes, something that has emerged as a key point of interest in ongoing talks with the SEC.<\/span>","An additional issue that has been resolved pertains to managing hard forks and airdrops.","Forks occur when there is a modification in the code, leading to a new version of the blockchain. Notably, the Bitcoin network split into what's currently known as Bitcoin and another network known as Bitcoin Cash in 2017.","According to the source, discussions have revolved around establishing protocols to decide the course of action in the event of a fork. It has been agreed among issuers that trusts will relinquish any entitlements to a hard fork that diverges from the main chain, they said.","On Dec. 26, Grayscale amended its 3-S form to specify that its spot bitcoin ETF, if approved, would not receive any tokens through either a hard fork or an airdrop.","Exchanges have been busy meeting with the SEC this week as NYSE and Nasdaq met with the agency to discuss pending filings, according to two sources.","A person familiar with the matter said the SEC and Nasdaq met on <a href=\"https:\/\/www.theblock.co\/post\/270181\/nasdaq-to-meet-with-sec-today-to-discuss-spot-bitcoin-etfs-source\" data-v-f87c67ca=\"\">Wednesday<\/a> to discuss a spot bitcoin ETF, among other topics. A different source confirmed the NYSE meeting on the same day, which had been scheduled a week earlier. Fox News said there was a third meeting with the Chicago Board Options Exchange, citing its own sources.","<span class=\"s1\" data-v-f87c67ca=\"\">The meetings don't indicate any changes as to whether a spot bitcoin ETF will get the SEC's sign off, the source said. They also couldn't comment on timing for when a spot bitcoin ETF would get the SEC's approval or disapproval.&nbsp;<\/span>","A high-placed executive at an issuer claimed that the notion of a spot ether ETF is still up in the air due to one overlooked reason.","The source said that the SEC's approval of futures-based bitcoin ETFs forced its hand to eventually approve a spot fund. This is because the agency disapproved previous proposals based on price manipulation, which issuers for a spot fund were able to address. It also provided a legal basis to fight for a spot fund, which was evident in Grayscale’s fight with the SEC.","As for ETH, the SEC hasn’t provided disapproval for such a fund and thereby has not back itself into a corner.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2017","content":"DATE"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"U.S. ETF","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Dec. 26","content":"DATE"},{"type":"Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Fox News","content":"ORGANIZATION"},{"type":"3","content":"DATE"},{"type":"Cantor Fitzgerald","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"+1.05%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"” Grayscale","content":"ORGANIZATION"},{"type":"US ETP","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"NYSE","content":"ORGANIZATION"},{"type":"JP Morgan Securities LLC","content":"ORGANIZATION"},{"type":"Chicago Board Options Exchange","content":"ORGANIZATION"},{"type":"Jane Street Capital","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["SEC","SPOT BITCOIN ETF"],"authors":["Sarah Wynn","Frank Chaparro","The Block"]}