{"summary":"Bitcoin dominance has reached its highest level in nearly two years, as many other tokens recently got declared securities by the SEC.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234902\/bitcoin-dominance-high","publishDate":"2023-06-15T08:29:06","id":5900,"type":null,"title":"Bitcoin dominance reaches highest level in nearly two years","category":["MARKET UPDATES"],"content":["Bitcoin dominance has reached a level that has not been seen in almost two years, suggesting that traders and investors are flocking to the relative safety of the world's first and largest cryptocurrency over other smaller tokens.","Bitcoin dominance, or a percentage of the total cryptocurrency market capitalization that Bitcoin represents, has reached 45.84%, according to <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/bitcoin-dominance\" data-v-f87c67ca=\"\">The Block's Data Dashboard<\/a>. The last time such a level was seen was in July 2021, when it peaked at 46.77%.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/bitcoin-dominance\/embed\" title=\"Bitcoin Dominance\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","In April of this year, Bitcoin dominance <a href=\"https:\/\/www.theblock.co\/post\/221258\/bitcoin-dominance\" data-v-f87c67ca=\"\">touched<\/a> 45.65% but had been swinging in a range. Since last week, however, its dominance has been on the rise. It comes at a time when the United States Securities and Exchange Commission has declared several tokens as unregistered securities in its lawsuits against crypto exchanges Binance and Coinbase — claiming that most tokens are securities. Since then, the prices of many mentioned tokens have declined. Meanwhile, bitcoin's price has been relatively stable.","The upcoming Bitcoin halving in April or May 2024 could also be a factor. The Bitcoin halving is an event that occurs approximately every four years, reducing the reward for mining new Bitcoin blocks by half, effectively decreasing the rate at which new bitcoins are created, in order to control inflation and maintain the scarcity of bitcoin over time. The upcoming Bitcoin halving will see the block reward halve from 6.25 bitcoin to 3.125 bitcoin.","The upcoming halving could help bitcoin reach a price of $45,000, JPMorgan analysts <a href=\"https:\/\/www.theblock.co\/post\/232334\/bitcoin-price-45k-jpmorgan-gold\" data-v-f87c67ca=\"\">predicted<\/a> late last month. Michael Saylor, founder and chairman of bitcoin holder MicroStrategy — a permanent bitcoin bull — expects the price to increase tenfold and then again tenfold from the current level of around $25,000.","\"The entire industry is kind of destined to be rationalized down to Bitcoin and a half a dozen to a dozen other proof-of-work tokens,\" Saylor <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-06-13\/microstrategy-s-mstr-saylor-says-bitcoin-btc-market-share-will-climb-to-80\" data-v-f87c67ca=\"\">told<\/a> Bloomberg earlier this week. MicroStrategy holds over 140,000 Bitcoin (nearly worth $3.5 billion at current prices) on its balance sheet.","Bitcoin's network activity has also been heavily boosted by the rise of tokens and NFTs through the Ordinals platform.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"46.77%","content":"PERCENT"},{"type":"May 2024","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"United States Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"45.65%","content":"PERCENT"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"$45,000","content":"MONEY"},{"type":"April of this year","content":"DATE"},{"type":"$25,000","content":"MONEY"},{"type":"July 2021","content":"DATE"},{"type":"April","content":"DATE"},{"type":"$3.5 billion","content":"MONEY"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Saylor","content":"PERSON"},{"type":"45.84%","content":"PERCENT"},{"type":"Bitcoin","content":"PERSON"},{"type":"Michael Saylor","content":"PERSON"}],"hashtag":["BITCOIN"],"authors":["Yogita Khatri","The Block"]}