{"summary":"Auros filed for application for bankruptcy protection after $20 million in company funds became frozen on FTX, court documents show.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/196418\/auros-bankruptcy-filing-ftx","publishDate":"2022-12-20T02:19:32","id":5905,"type":null,"title":"Auros bankruptcy protection filings show funds tied up on FTX","category":["BANKRUPTCY"],"content":["<span data-v-f87c67ca=\"\">Market making firm Auros filed to begin bankruptcy proceedings in the British Virgin Islands, court documents show.<\/span>","<span data-v-f87c67ca=\"\">A digital asset market maker and algorithmic trading platform, Auros maintained operations via “a series of loans and financing arrangements with various lenders.” However, Auros found its capacity to manage those agreements affected due to its exposure to the collapse of FTX, the filing said. Auros is based in the British Virgin Islands.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“A significant proportion of the Company’s assets” — worth roughly $20 million — were held on the FTX on Nov. 11, when FTX filed for Chapter 11 bankruptcy protection in the U.S., according to Auros. With those assets frozen, Auros was effectively rendered insolvent.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Auros was seeking an order to be liquidated by the court and proposed Interpath Advisory as its liquidator, according to the filings.&nbsp;<\/span>","In a <a href=\"https:\/\/twitter.com\/Auros_global\/status\/1605227442838175745\" data-v-f87c67ca=\"\">statement<\/a> released today, Auros clarified that it had applied for a \"light touch\" Provisional Liquidation order, a \"debtor in possession\" restructuring mechanism where it's allowed to continue trading while a restructuring plan is developed.&nbsp;","\"A 'light touch' Provisional Liquidation is fundamentally different from a formal, final liquidation\/wind-up, and is commonly deployed where businesses are balance sheet solvent, but cash flow insolvent, and where this cash flow insolvency can be quickly and effectively remedied by a corporate restructure,\" the company said. \"Upon the successful implementation of the restructuring, it is anticipated that Auros' operations would resume as normal.\"","Auros continued: \"The actions of directors to proactively apply to the court for this order was part of a conscious, deliberate strategy by Auros to maximise value for all creditors and other stakeholders and we remain steadfast in our mission to see it through to completion.\"","<em data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/em>","<em data-v-f87c67ca=\"\">Update: Story updated to add comments from Auros on the nature of the restructuring.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Auros","content":"PERSON"},{"type":"Interpath","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"December 2022","content":"DATE"},{"type":"British Virgin Islands","content":"LOCATION"},{"type":"$20 million","content":"MONEY"},{"type":"Michael McCaffrey","content":"PERSON"},{"type":"Nov. 11","content":"DATE"}],"hashtag":["BANKRUPTCY FILINGS","INVESTMENT FIRMS"],"authors":["Jeremy Nation","Benjamin Robertson","The Block"]}