{"summary":"Trader Joe, a decentralized exchange, has partnered with LayerZero to let users move its tokens seamlessly across blockchains.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/208878\/trader-joes-native-token-joe-goes-omni-chain-with-layerzero-partnership","publishDate":"2023-02-06T09:53:19","id":591,"type":null,"title":"Trader Joe&#x27;s native token &#x27;joe&#x27; goes omni-chain with LayerZero partnership","category":["CRYPTO ECOSYSTEMS"],"content":["Decentralized exchange Trader Joe, not to be confused with the American grocery chain, has partnered with interoperability protocol LayerZero to convert its native ERC-20 token \"joe\" into an <a href=\"https:\/\/joecontent.substack.com\/p\/trader-joe-integrates-layerzero-joe\" data-v-f87c67ca=\"\">omni-chain fungible token (OFT).<\/a> The integration will enable joe tokens to be easily transferred from its native chain, Avalanche, to two other blockchains where Trader Joe operates, Arbitrum and BNB Chain.","<a href=\"https:\/\/www.theblock.co\/post\/137850\/layerzero-gears-up-for-launch-of-cross-chain-protocol-stargate\" data-v-f87c67ca=\"\">LayerZero<\/a>&nbsp;relies on a unified \"omni-chain\" communication protocol that can be used to move assets back and forth between blockchains. Such tokens are moved through LayerZero's decentralized communication protocol rather of relying on wrapping — a process where tokens have to be minted and burned continually. LayerZero's approach is considered more secure than wrapping, the Trader Joe team noted in a <a href=\"https:\/\/joecontent.substack.com\/p\/trader-joe-integrates-layerzero-joe\" data-v-f87c67ca=\"\">blog post<\/a>.","The partnership between <a href=\"https:\/\/www.theblock.co\/post\/199398\/trader-joe-dex-nft-marketplace-bnb-chain\" data-v-f87c67ca=\"\">Trader Joe<\/a> and LayerZero is expected to reduce or eliminate the security risks associated with traditional wrapping methods when transferring joe tokens across different blockchains.","Trader Joe, with over <a href=\"https:\/\/defillama.com\/protocol\/trader-joe\" data-v-f87c67ca=\"\">$110 million<\/a> in total assets staked on its platform, is a decentralized platform that allows users to swap crypto tokens and NFTs. It also caters to lending and borrowing requirements of crypto users.","<em data-v-f87c67ca=\"\">Update: Added a line to show the project is unaffiliated with the American grocery chain of the same name.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Joe","content":"PERSON"},{"type":"OFT","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Joe<\/a> and LayerZero","content":"PERSON"},{"type":"20","content":"DATE"},{"type":"$110 million","content":"MONEY"}],"hashtag":["ASSETS","CROSS-CHAIN SWAPS","DEXS","INTEROPERABILITY"],"authors":["Vishal Chawla","The Block"]}