{"summary":"The Reserve Bank of India is concerned about cryptocurrencies, but it is working on the digital rupee, governor Shaktikanta Das has said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/95908\/india-central-bank-rbi-major-concerns-crypto-working-digital-rupee-governor-comments","publishDate":"2021-02-24T06:00:14","id":5910,"type":null,"title":"India&#x27;s central bank has &#x27;major concerns&#x27; about crypto, but is working on digital rupee, governor says","category":["ASIA"],"content":["The Reserve Bank of India (RBI), the country's central bank, is concerned about cryptocurrencies, but it is working on the digital rupee, governor Shaktikanta Das has said.","<a href=\"https:\/\/www.youtube.com\/watch?v=HdmE9s0A1Is\" data-v-f87c67ca=\"\">In an interview<\/a> with CNBC TV-18 on Wednesday, Das said, \"we have major concerns [about crypto] from the financial stability angle [that] we have shared it with the government.\"","Das did not elaborate on those concerns but said the government is considering them, and he expects a decision on cryptocurrencies \"sooner or later.\"","\"If required, the Parliament also will consider and decide,\" he added.","The RBI has, in the past as well, expressed concerns about cryptocurrencies related to money laundering, terrorist financing, and tax evasion. In 2018, the central bank had barred banks from facilitating any crypto transactions, but that <a href=\"https:\/\/www.theblockcrypto.com\/post\/57708\/indias-supreme-court-strikes-down-rbis-banking-ban-against-crypto\" data-v-f87c67ca=\"\">curb was lifted<\/a> by the Supreme Court of India last year.","While the RBI has had concerns about cryptocurrencies, it has always supported the official digital currency development. In Wednesday's interview, Das revealed that the central bank is already working on the digital rupee.","\"Lot of work is going on there,\" Das said, adding that \"the RBI team is working on it, both the technology side as well as the procedural side.\"","The governor did not provide a timeline for the launch of the digital rupee but said, \"we are very much in the game\" and are \"targeting to launch\" it at some point.","\"Several loose ends need to be tied up, but it's receiving our full attention,\" Das concluded.","This appears to be the first time the RBI governor has detailed the central bank's ongoing digital currency work. Das' comments also appear to be in line with <a href=\"https:\/\/www.theblockcrypto.com\/post\/94740\/india-to-ban-crypto-investment-completely-report\" data-v-f87c67ca=\"\">recent reports that say<\/a> the Indian government would ban cryptocurrencies and regulate the digital rupee via a new bill called \"Cryptocurrency and Regulation of Official Digital Currency Bill, 2021.\"","The bill's contents are not known yet and could be made public during the current Parliamentary budget session that will run until April 8.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"18","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"Regulation of Official Digital Currency Bill","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"India","content":"LOCATION"},{"type":"Shaktikanta Das","content":"ORGANIZATION"},{"type":"Parliament","content":"ORGANIZATION"},{"type":"April 8","content":"DATE"},{"type":"Reserve Bank of India","content":"ORGANIZATION"},{"type":"the Supreme Court","content":"ORGANIZATION"},{"type":"Das","content":"PERSON"},{"type":"RBI","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}