{"summary":"This report provides insights into concentrated pooled liquidity provision on Automatic Market Makers (AMMs). AMMs have revolutionized decentralized exchanges (DEXes) and have turned out to be a major use case in DeFi, to the extent that they rival liquidity on centralized exchanges (CEXes)","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/149824\/pooled-liquidity-provision-in-defi-concentrated-liquidity-commissioned-by-orca","publishDate":"2022-06-02T09:34:03","id":5912,"type":null,"title":"Pooled Liquidity Provision in DeFi: Concentrated Liquidity- Commissioned by Orca","category":["RESEARCH"],"content":["<b data-stringify-type=\"bold\" data-v-f87c67ca=\"\">The Block Research was commissioned by Orca to create “Pooled Liquidity Provision in DeFi: Concentrated Liquidity”. To access the full report in PDF format, please fill out the form below:&nbsp;<\/b>","This report provides insights into concentrated pooled liquidity provision on Automatic Market Makers (AMMs). AMMs have revolutionized decentralized exchanges (DEXes) and have turned out to be a major use case in DeFi, to the extent that they rival liquidity on centralized exchanges (CEXes). After Uniswap v3’s introduction of concentrated liquidity in 2021, it quickly gained market share among DEXes. Compared to infinite price range liquidity provision, concentrated liquidity can be much more capital efficient. However, the flipside is an increasing risk of impermanent loss for liquidity providers.","Concentrated liquidity providers are given more degrees of freedom to set their pool position. This leads to several different strategy setups, some of which may be better confined to sophisticated investors, or active liquidity management protocols. That seems to apply, for example, to liquidity provision of volatile token pairs, which may require frequent rebalancing to be profitable. Automatic liquidity management protocols may have advantages because of lower transaction cost once their fund size increases, but also because they claim to offer more sophisticated management for retail liquidity providers. However, it remains to be seen whether their total return –including protocol fees, impermanent loss, and ‘compounded’ contract risk– offers value for money and adequately compensates liquidity providers.","Empirical results for concentrated liquidity provision are so far rather disappointing. In most studies it does not consistently outperform simple buy and hold strategies. This is mainly driven by impermanent loss. One possible exception are token pairs, which feature low risk of impermanent loss, such as stablecoins. The main advantage from higher capital efficiency of concentrated liquidity so far seems to accrue to swappers, who get much less slippage for their trades, even compared to centralized exchanges. Going forward that situation will likely redress, be it through more efficient strategies for liquidity provision, or a reduction in liquidity provision until liquidity providers are adequately rewarded for the risks they take.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Block Research","content":"ORGANIZATION"}],"hashtag":[],"authors":["Marcel Bluhm","The Block"]}