{"summary":"Coinbase CEO Brian Armstrong&#x27;s ResearchHub, which rewards scientists with cryptocurrency, has raised $5 million in a funding round. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234960\/scientists-can-earn-crypto-as-brian-armstrong-startup-raises-5-million","publishDate":"2023-06-15T12:39:05","id":5916,"type":null,"title":"Scientists can earn crypto as Brian Armstrong startup raises $5 million","category":["DEALS"],"content":["ResearchHub, a startup co-founded by Coinbase CEO Brian Armstrong that rewards scientists with cryptocurrency for publishing content, has raised $5 million in a funding round.&nbsp;","The seed round was led by Open Source Software Capital, with participation from Boost VC, RedHat's Bob Young, Vercel’s Guillermo Rauch, Replit's Amjad Masad, Y Combinator’s Garry Tan and others, ResearchHub announced in a <a href=\"https:\/\/www.researchhub.com\/post\/979\/researchhub-raises-5m-to-help-scientists-monetize-their-research\" data-v-f87c67ca=\"\">blog post<\/a>.","By publishing their work on ResearchHub, researchers earn ResearchCoin, a cryptocurrency specifically designed for the platform. The amount of RSC earned is determined by the community's perceived value of the content, and the crypto can then used to reward other scientists for completing research-related tasks such as peer reviews, answering scientific questions and providing feedback.&nbsp;","ResearchHub argues that scientific research is too important to be hidden behind paywalls and advocates for an open-source software-style model that fosters collaboration and rewards valuable contributions in an “academic town square.”","“With this new funding, ResearchHub will be able to expand our platform to reach more scientists worldwide,” co-founders Brian Armstrong and Patrick Joyce said in the post. “We will invest in new features and tools that enable our community to work together more efficiently and capture more of the value they help create.”","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Open Source Software Capital","content":"ORGANIZATION"},{"type":"Patrick Joyce","content":"PERSON"},{"type":"Bob Young","content":"PERSON"},{"type":"Garry Tan","content":"PERSON"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Vercel’s Guillermo Rauch","content":"PERSON"},{"type":"ResearchHub","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"RSC","content":"ORGANIZATION"},{"type":"$5 million","content":"MONEY"}],"hashtag":["BRIAN ARMSTRONG","COINBASE","SEED &AMP; PRE-SEED"],"authors":["James Hunt","The Block"]}