{"summary":"Liquidity begets liquidity, and when volume and volatility dry up, reversals are rare and trends remain steadfast, in this case, the sellers are in clear control.\nVolume was barely over its 50-week moving average. Momentum indicators are not oversold yet and the Stochastic Oscillator is barely showing signs of positive life.\nWithout a clear catalyst for higher prices, namely, a massive uptick in buying volume, the trend lower appears to be in tact. ","author":["Contributor Network","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/33854\/bitcoin-a-tale-of-two-vols","publishDate":"2019-07-29T15:50:02","id":592,"type":null,"title":"Bitcoin: A tale of two &#x27;Vol&#x27;s","category":["Markets"],"content":["<i data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\"><a href=\"https:\/\/twitter.com\/joemccann?lang=en\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Joe McCann<\/a>&nbsp;is the Founder and Chairman of the Board of NodeSource and f<\/em>ormer quant trader for Passport Capital. This piece is purely for informational purposes; nothing in this post should be construed as investment advice.<\/i>","<span data-v-f87c67ca=\"\">Volatility and volume, or lack thereof, has been the story for bitcoin this past week. Bitcoin volatility has dropped dramatically since the news of the CFTC investigating Bitmex was announced. I mentioned on <\/span><a href=\"https:\/\/el2.convertkit-mail2.com\/c\/preview\/m5ixnw92a5hk\/aHR0cHM6Ly90d2l0dGVyLmNvbS9qb2VtY2Nhbm4vc3RhdHVzLzExNTQ3OTY4Njc0NjIzODk3NjA=\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Twitter<\/span><\/a><span data-v-f87c67ca=\"\"> that this wouldn't last long and surely enough, we saw some fireworks in the Saturday session with bitcoin dropping nearly $1,000 that day alone.<\/span>","","","<span data-v-f87c67ca=\"\">Trading volume has also precipitously declined since the CFTC news. Liquidity begets liquidity and when volume <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">and<\/span><\/i><span data-v-f87c67ca=\"\"> volatility dry up, reversals are rare and trends remain steadfast, in this case, the sellers are in clear control.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">An inside candle was printed for the weekly this past week. Volume was barely over its 50-week moving average.<\/span>","<span data-v-f87c67ca=\"\">With price continuing to close below the 20 DMA, the midpoint of the Bollinger Bands, sellers remain in control. Momentum indicators are not oversold yet and the Stochastic Oscillator is barely showing signs of positive life.<\/span>","","","<span data-v-f87c67ca=\"\">Bitcoin failed to hold the 50 DMA and the 10 and 20 DMAs have now crossed below it as well. Structurally still bearish with next test of support at the 100 DMA, approximately, $8,750.<\/span>","","","<span data-v-f87c67ca=\"\">Without a clear catalyst for higher prices, namely, a massive uptick in buying volume, the trend lower appears to be in tact.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Good luck!<\/span>"],"hashtag":[]}