{"summary":"The governance token of the Solana-based liquid staking protocol Jito crossed a trading volume of $1.1 billion within a day of going live.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266735\/jito-token-witnesses-1-1-billion-of-trading-volume-in-first-day","publishDate":"2023-12-08T08:06:45","id":5923,"type":null,"title":"Jito token witnesses $1.1 billion of trading volume in first day","category":["CRYPTO ECOSYSTEMS"],"content":["The governance token of the Solana-based liquid staking protocol Jito crossed a trading volume of $1.1 billion within a day of going live.","Yesterday, the project released the <a href=\"https:\/\/www.theblock.co\/post\/264820\/solana-mev-developer-jito-launching-governance-token\" data-v-f87c67ca=\"\">Jito token<\/a>, distributing it to community members and enabling decentralized governance.","Soon after its roll-out, the token began trading around the $2 mark and has since risen in value by nearly 45%, according to <a href=\"https:\/\/www.theblock.co\/price\/266782\/jito-jto-usd\" data-v-f87c67ca=\"\">The Block's Price Page<\/a>. The token is currently changing hands at $2.9, translating to a fully diluted market capitalization of $2.9 billion.","The total supply of Jito tokens is capped at 1 billion, with 115 million currently in circulation.","Of these, 80 million were earmarked for the community airdrop, benefiting early users, as well as separate allocations for validators and other protocol contributors.","Some 9,800 users who interacted with the protocol and staked SOL received a minimum 4,941 JTO, equivalent to nearly $14,000 at the time of reporting.","Jito allows users to deposit SOL, Solana’s native cryptocurrency, in exchange for the derivative JitoSOL, serving as a receipt token for participants in the staking process.","It has over 6.4 million SOL locked in, equivalent to about $460 million. Jito Labs, the core developer behind Jito, also <a href=\"https:\/\/www.theblock.co\/post\/222207\/jito-labs-client-software-for-solana-now-manages-16-of-validator-stakes\" data-v-f87c67ca=\"\">operates<\/a> major client software for the Solana blockchain.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"45%","content":"PERCENT"},{"type":"$2.9 billion","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$2 mark","content":"MONEY"},{"type":"$2.9","content":"MONEY"},{"type":"$460 million","content":"MONEY"},{"type":"$1.1 billion","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"$14,000","content":"MONEY"}],"hashtag":["ASSETS","SOLANA"],"authors":["Vishal Chawla","The Block"]}