{"summary":"The Marshall Islands&#x27; national digital currency, the Marshallese sovereign (SOV), will be built using the Algorand blockchain. It plans to create 24 million SOVs initially, and 40% of that will be available for sale to people around the world.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/57547\/marshall-islands-digital-currency-will-be-built-on-algorand-blockchain","publishDate":"2020-03-03T05:21:55","id":5934,"type":null,"title":"Marshall Islands&#x27; digital currency to be built on Algorand blockchain","category":["LAYER 1S"],"content":["The Marshall Islands' national digital currency, the Marshallese sovereign (SOV), will be built using the Algorand blockchain.","Algorand <a href=\"https:\/\/www.algorand.com\/resources\/news\/marshall-islands-to-power-worlds-first-national-digital\" data-v-f87c67ca=\"\">announced<\/a> the news on Monday, saying that SFB Technologies, the appointed organizer for the SOV initiative, has chosen its blockchain for speed, scalability and security.","Jim Wagner, co-founder and CTO of SFB Technologies, said Algorand's protocol has \"functionality required to issue, manage and distribute the SOV on a global level,\" which ensures that the digital currency \"will be built on a scalable and secure platform.\"","The Marshall Islands initially announced its plans to create the SOV in February 2018, when it <a href=\"https:\/\/sov.foundation\/law.pdf\" data-v-f87c67ca=\"\">passed a law<\/a> to make the digital currency the new legal tender. The island nation <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2019-09-11\/tiny-pacific-nation-is-making-a-go-of-its-own-digital-currency\" data-v-f87c67ca=\"\">aims to lessen<\/a> its dependence on the U.S. dollar, its official currency, with the launch of SOV.","But the initiative has seen pushback from the International Monetary Fund (IMF). In September 2018, <a href=\"https:\/\/www.imf.org\/en\/Publications\/CR\/Issues\/2018\/09\/10\/Republic-of-the-Marshall-Islands-2018-Article-IV-Consultation-Press-Release-Staff-Report-and-46216\" data-v-f87c67ca=\"\">the IMF issued a 58-page report<\/a> on the Marshall Islands' digital currency plans, saying that its issuance as the&nbsp;second legal tender \"would increase macroeconomic and financial integrity risks, and elevate the risk of losing the last U.S. dollar correspondent banking relationship.\"","The IMF added at the time that the island nation should \"seriously reconsider\" the issuance of its digital currency because the potential benefits from revenue gains appear \"considerably smaller\" than the potential costs arising from economic, reputational, compliance and governance risks.","The Marshall Islands, however, appears to have moved forward with the SOV project despite the IMF's concerns.","It plans to create 24 million SOVs initially, and 40% of that will be available for sale to people around the world, according to information available on the SOV Development Foundation <a href=\"https:\/\/sov.foundation\/\" data-v-f87c67ca=\"\">website<\/a>.","\"Each year, the supply of SOV will increase by just 4%. This rate has been chosen to promote long-term sustainability and is algorithmically fixed by the SOV blockchain, so the supply cannot be manipulated,\" per the foundation.","The SOV will be introduced through a token pre-sale, and rights to future SOV will be sold in a series of auctions as part of a time-release monetary issuance (TRMI), which is expected to \"begin soon and will last for 18 months,\" according to the foundation.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"International Monetary Fund (IMF","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"IMF","content":"ORGANIZATION"},{"type":"4%","content":"PERCENT"},{"type":"Marshall Islands","content":"ORGANIZATION"},{"type":"February 2018","content":"DATE"},{"type":"40%","content":"PERCENT"},{"type":"SOV","content":"ORGANIZATION"},{"type":"Jim Wagner","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"SOV Development Foundation","content":"ORGANIZATION"},{"type":"CTO","content":"ORGANIZATION"},{"type":"SFB Technologies","content":"ORGANIZATION"},{"type":"Algorand","content":"ORGANIZATION"},{"type":"September 2018","content":"DATE"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}