{"summary":"Kain Warwick, the founder of Synthetix, has announced twelve proposals to incentivize the next phase of the project.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231936\/synthetix-founder-proposals","publishDate":"2023-05-24T06:01:02","id":5937,"type":null,"title":"Synthetix founder wants to buyback and burn millions of SNX tokens","category":["CRYPTO ECOSYSTEMS"],"content":["Kain Warwick, founder of decentralized derivatives trading protocol Synthetix, proposed 12 substantial governance proposals to propel the platform into its next phase.","These initiatives strive to broaden Synthetix’s capabilities and stimulate increased participation from its community members, as outlined in Warwick’s “State of Synthetix” post.","A significant proposition is the “SNX split and buyback” proposal in the post. Warwick suggested a 3:1 split of SNX, followed by a buyback and subsequent burn using the Treasury’s fee yield.","“Should we proceed with a 3:1 split, we would have approximately 90 million additional tokens for buyback and burn, with a market price of $60 million,” Warwick explained. The founder further clarified that the funds required to burn these tokens would be sourced from the treasury fee yield.","Another proposal, termed the “core contributor alignment,” seeks to incentivize project contributors by distributing Synthetix Network Tokens (SNX) as quarterly bonuses. Warwick believes this strategy could secure ongoing commitment to the protocol’s success from the platform’s contributors.","Additionally, Warwick proposed the allocation of SNX for trading incentives. This aims to stimulate trading volume and foster increased market activity on the Synthetix platform. Beyond this, he suggested giving SNX to stakers to boost their involvement and commitment to preserving the platform’s stability.","The Synthetix platform supports decentralized derivatives trading within its liquidity pools, which currently boast a total value locked (TVL) of over <a href=\"https:\/\/defillama.com\/protocol\/synthetix\" data-v-f87c67ca=\"\">$420 million<\/a> on Ethereum and the Optimism Layer 2 network.","The purpose of presenting proposals, Warwick said, was to start a conversation and ensure the Synthetix community is kept in the loop about potential directions for the platform. The proposals will be put to a vote by the Treasury Council (TC), Synthetix’s four-member governance body, which is responsible for resource allocation for the protocol’s expansion and growth.","Currently, these suggestions remain in the conceptual stage, needing votes to progress. “Nothing has been confirmed by a Treasury Council vote yet; however, many of these proposals have garnered support within the [council],” Warwick commented.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Warwick’s “State of Synthetix","content":"ORGANIZATION"},{"type":"Warwick","content":"PERSON"},{"type":"Kain Warwick","content":"PERSON"},{"type":"$60 million","content":"MONEY"},{"type":"$420 million","content":"MONEY"},{"type":"Treasury Council","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Synthetix Network Tokens","content":"ORGANIZATION"},{"type":"Treasury Council (TC","content":"ORGANIZATION"}],"hashtag":["ASSETS","DERIVATIVES","DEXS"],"authors":["Vishal Chawla","The Block"]}