{"summary":"CFTC Chair Rostin Behnam announced the agency is evolving its LabCFTC initiative into an Office of Technology Innovation (OTI).","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/159563\/cftc-will-evolve-labcftc-hub-into-office-of-technology-innovation","publishDate":"2022-07-25T17:05:35","id":594,"type":null,"title":"CFTC will evolve LabCFTC hub into Office of Technology Innovation","category":["REGULATION"],"content":["The US Commodity Futures Trading Commission (CFTC) is considering its role in crypto oversight in the framework of regulators, and it's taking action by retooling its office devoted to connecting with crypto innovators.","At the Brookings Future of Crypto Regulation event today, CFTC Chairman Rostin Behnam announced the regulator is evolving its LabCFTC initiative into an Office of Technology Innovation (OTI). The new office will update the program's operating model.","Crypto-friendly former Chairman Christopher Giancarlo established LabCFTC during his tenure as a hub for the agency's engagement with the fintech and innovation community. Since the program's inception, Behnam said the crypto space has reached a point of intersection with traditional markets that have put the issues front and center for the CFTC.&nbsp;","\"As I testified in February, we are past the incubator stage, and digital assets and decentralized financial technologies have outgrown their sandboxes,\" said Behnam in his remarks.","Now, Behnam said resources devoted to LabCFTC will be utilized through the OTI, reporting directly to the Chairman’s office and staffed by a director, a FinTech Policy and Technology specialist, a strategic Communications and Education leader and rotational opportunities for all CFTC employees to gain exposure and expertise. Still, that new structure will have flexibility to meet the needs of both the CFTC and the market, said Behnam.","Additionally, the Office of Customer Education and Outreach will be housed under the Office of Public Affairs. Behnam highlighted the need for educating the public in order to protect vulnerable consumers, citing a Federal Trade Commission statistic that more than 46,000 people have reported losing over $1 billion in crypto to scams since the start of 2021.&nbsp;","\"This strategic alignment will leverage resources and a broader understanding of the issues facing the general public towards addressing the most critical needs in the most vulnerable communities,\" Behnam said.","Behnam spent a portion of his remarks considering the \"inflection point\" he sees between the crypto market and regulatory space. He acknowledged that digital assets do not fall under a single comprehensive regime in the US, and that the CFTC, other federal agencies and state regulators are often compared to a \"patchwork blanket that is increasingly proving inadequate as temperatures drop and vulnerabilities lay bare.\"","His comments noted the importance of collaboration among regulators and the challenges that can arise when balancing different mandates in an emerging space.","\"While our oversight capabilities are generally complementary, market regulation and financial supervision in the U.S. often relies on the development of cooperative arrangements between regulators — a challenge given jurisdictional inexactitudes and sometimes imprecise or nonexistent statutory authority,\" he said.","Indeed, two of his fellow commissioners <a href=\"https:\/\/www.theblock.co\/post\/159098\/cftc-commissioners-speak-up-after-sec-files-crypto-insider-trading-case\" data-v-f87c67ca=\"\">called<\/a> for increased collaboration among regulators last week in response to the Securities and Exchange Commission's (SEC) decision to assert certain digital assets as securities in a newly filed insider trading case. Behnam did not mention the SEC in his comments and declined to comment on the insider trading proceedings when asked during the Q&amp;A portion of the event.","He did, however, address the challenge of untangling where the SEC and CFTC meet in regulating spot crypto exchanges. He pointed to bills in Congress, including recent crypto bill from Senators Cynthia Lummis, R-Wyo., and Kirsten Gillibrand, D-N.Y., as helpful tools for figuring out where those authorities lie.&nbsp;","\"But ultimately, we'd like to see law drawing lines,\" he said. \"And then I do think there's certainly a role for the regulator at that point for us to more clearly define which coins constitute securities, which countries constitute commodities.\"","Still, Behnam made it clear that the CFTC will step in where it feels its mandate requires:","\"Where there is direct, unambiguous impact on the integrity of CFTC jurisdictional markets or members of the public, an immediate, comprehensive enforcement-driven response from the CFTC is warranted. We will continue to use our enforcement authority to the fullest extent, and leverage our cash market expertise as a function of our historical mandate over the derivatives markets and assert essential oversight within our current statutory remit.\"","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Office of Customer Education","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"$1 billion","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Kirsten Gillibrand","content":"PERSON"},{"type":"Federal Trade Commission","content":"ORGANIZATION"},{"type":"US Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"Behnam","content":"PERSON"},{"type":"Cynthia Lummis","content":"PERSON"},{"type":"Brookings Future of Crypto Regulation","content":"ORGANIZATION"},{"type":"N.Y.","content":"LOCATION"},{"type":"Christopher Giancarlo","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Wyo.","content":"LOCATION"},{"type":"Rostin Behnam","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"Office of Public Affairs","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Office of Technology Innovation (OTI)","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"FinTech Policy and Technology","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"}],"hashtag":["CFTC"],"authors":["Aislinn Keely","The Block"]}