{"summary":"Duncan and Griffin Cock Foster, twin brothers and co-founders of Gemini-owned NFT platform Nifty Gateway, are leaving Gemini amid troubles at the company.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/205349\/nifty-gateway-gemini-troubles","publishDate":"2023-01-25T07:30:50","id":5946,"type":null,"title":"Nifty Gateway co-founders stepping down, departing Gemini amid troubles ","category":["PEOPLE"],"content":["Duncan and Griffin Cock Foster, twin brothers and co-founders of Gemini-owned NFT platform Nifty Gateway, are stepping down from their positions and leaving Gemini amid troubles at the company.","\"Some news — after almost 4 years, Griffin and I are departing Gemini and are passing the baton at Nifty Gateway,\" Duncan writes in a yet unpublished tweet thread obtained by The Block. \"This journey has been an incredible ride, but Griffin and I are founders at heart and we want to start another company.\"","Gemini <a href=\"https:\/\/www.theblock.co\/linked\/47589\/winklevoss-brothers-acquire-crypto-collectible-startup\" data-v-f87c67ca=\"\">acquired<\/a> Nifty Gateway in 2019 in its first-ever deal when NFTs were still a relatively new concept. The deal couldn't be more coincidental — the Cock Foster brothers are identical twins like Gemini co-founders Tyler and Cameron Winklevoss.","Their departure comes amid challenging times at Gemini. The crypto exchange operator <a href=\"https:\/\/www.theblock.co\/post\/187534\/gemini-earn-unable-to-meet-customer-redemptions-as-genesis-unit-pauses-withdrawals\" data-v-f87c67ca=\"\">halted<\/a> client withdrawals for its Earn product in November as its lending partner, Genesis Global Capital, paused withdrawals due to severe liquidity issues. Last week, Genesis&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/190311\/digital-currency-groups-genesis-global-files-for-bankruptcy-protection\" data-v-f87c67ca=\"\">filed<\/a> for bankruptcy protection, with Gemini being its biggest creditor. It <a href=\"https:\/\/www.theblock.co\/post\/204035\/genesis-owes-more-than-3-6-billion-to-top-50-creditors\" data-v-f87c67ca=\"\">owes<\/a> more than $765 million to some 340,000 Gemini Earn customers.","The Genesis woes led to layoffs at Gemini earlier this week. The company <a href=\"https:\/\/www.theblock.co\/post\/204738\/gemini-lays-off-10-of-staff-amid-troubles-at-genesis-dcg-the-information\" data-v-f87c67ca=\"\">shed<\/a> 10% of its staff in the third round since June. Gemini cut 10% of its workforce in June 2022, followed by more layoffs in the following month. As a result, its overall headcount slipped from 1,100 at the start of 2022 to around 700 people near the end of the year.","The latest 10% job cuts at Gemini also affected some Nifty Gateway staff, a source with direct knowledge of the matter told The Block. Earlier this week, Griffin noted on Nifty Gateway's Discord channel that some company employees were let go due to challenging market conditions. \"These choices are not easy; these are people we care about and respect,\" he added.","While the Cock Foster brothers have decided to leave Gemini, their last working day at the company isn't known yet — but they had decided to stay for four years at Gemini after the acquisition happened, according to the tweet thread. \"We ended up staying the max amount of time we originally thought possible, which shows how great this experience was,\" Duncan notes.","As for what comes next, the brothers don't have a plan yet. \"Our first step will be to take a sabbatical, digest what has happened over the five years since we started Nifty Gateway, and start brainstorming new startup ideas,\" Duncan writes.","After they officially depart, the brothers will continue working for Nifty Gateway in an advisory role, per the tweet thread. As for new leaders for the company, Eddie Ma, VP of engineering, will take over as technical leader for Nifty Gateway. Tara Harris, director of collector services and growth, will be the leader for non-tech, per the tweet thread.&nbsp;","Gemini, Duncan, and Griffin declined to comment on this story.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"earlier this week","content":"DATE"},{"type":"June 2022","content":"DATE"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Tara Harris","content":"PERSON"},{"type":"Griffin Cock Foster","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Gemini","content":"LOCATION"},{"type":"10%","content":"PERCENT"},{"type":"Eddie Ma","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"November","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Tyler","content":"PERSON"},{"type":"Nifty Gateway","content":"ORGANIZATION"},{"type":"Cameron Winklevoss","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"Duncan","content":"PERSON"},{"type":"$765 million","content":"MONEY"},{"type":"Griffin","content":"PERSON"},{"type":"Cock Foster","content":"ORGANIZATION"},{"type":"Genesis Global Capital","content":"ORGANIZATION"}],"hashtag":["CAMERON &AMP; TYLER WINKELVOSS","EXITS","GEMINI","NIFTY GATEWAY"],"authors":["Yogita Khatri","The Block"]}