{"summary":"The merger proposal includes integrating UX Chain’s lending logic with Osmosis’ decentralized exchange to form a comprehensive DeFi hub.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265824\/osmosis-ux-chain-merger-cosmos","publishDate":"2023-12-04T02:31:09","id":5949,"type":null,"title":"Osmosis and UX Chain propose merger within Cosmos ecosystem","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Osmosis <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248471\/osmosis-osmo-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/osmo.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">OSMO<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -2.53%\n    <\/span><\/a> <!----><\/span><\/span>, the largest decentralized exchange on Cosmos, and lending protocol UX Chain (previously <\/span><a href=\"https:\/\/www.theblock.co\/linked\/128813\/defi-startup-umee-raises-additional-32-million-in-coinlist-sale\" data-v-f87c67ca=\"\">Umee<\/a>) have proposed a merger with each other — signaling a major consolidation in the Cosmos ecosystem. Upon approval, this merger may see the integration of the lending logic and algorithms of the UX Chain with Osmosis' DEX and create a comprehensive DeFi hub.&nbsp;","This proposal, a collaborative effort by contributors from both <a href=\"https:\/\/www.theblock.co\/post\/239121\/cosmos-osmosis-concentrated-liquidity\" data-v-f87c67ca=\"\">Osmosis<\/a> and UX Chain, detailed a <a href=\"https:\/\/forum.osmosis.zone\/t\/merger-between-osmosis-and-umee\/780\" data-v-f87c67ca=\"\">strategic plan<\/a> for the proposed merger. The process will unfold in steps, beginning with integrating the UX Chain’s codebase onto the Osmosis Chain. This integration aims to amalgamate the capabilities of both platforms. Anticipated outcomes of this initial step include blending shared total value locked across the two networks. At this initial step, both chains will have their respective tokens — the Osmosis token and the UX token — continue to trade distinctly.&nbsp;","Subsequently, there will be the possibility of a step related to combining the two tokens, including a potential token swap or migration. According to the proposal, this step would lead to creating a unified token that represents both networks. The token swap configurations will be decided based on community governance.","\"Each chain will have a separate governance vote from each blockchain network. The community governance will manage the processes separately for each network toward achieving consensus around the end goal of creating the DeFi hub,\" Brent Xu, co-founder of UX Chain told The Block in a statement.","This proposed merger is also aimed at enabling UX Chain to add value to Osmosis’ <a href=\"https:\/\/www.theblock.co\/post\/231317\/osmosis-axelar-and-akash-fund-mesh-security-model-for-cosmos-ecosystem\" data-v-f87c67ca=\"\">mesh security<\/a> — the capacity of the network to secure other blockchain projects — by potentially leveraging the combined expertise or merging validator sets of both networks. Leveraging each other, UX Chain and Osmosis may explore the potential for developing advanced liquidations, native margin trading and MEV markets.","“This proposal to merge the Umee UX DeFi experience into the Osmosis chain would enable some really powerful new features and functionalities for our users — and we’re excited to continue our collaboration with UX Chain with what the community decides is best,” Osmosis co-founder Sunny Aggarwal said.","The development teams behind both projects have previously secured significant funding. UX Chain <a href=\"https:\/\/www.theblock.co\/linked\/128813\/defi-startup-umee-raises-additional-32-million-in-coinlist-sale\" data-v-f87c67ca=\"\">raised $32 million<\/a> through a CoinList coin offering in 2021, preceded by a <a href=\"https:\/\/www.theblock.co\/linked\/108442\/umee-raises-6-3-million-to-fuel-push-to-become-cross-chain-hub-for-defi-tools\" data-v-f87c67ca=\"\">$6.3 million seed<\/a> round led by Polychain Capital. The same year Osmosis secured $21 million in a token sale round, with Paradigm leading the investment.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Brent Xu","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"Aggarwal","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"UX Chain","content":"ORGANIZATION"},{"type":"$6.3 million","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$21 million","content":"MONEY"},{"type":"-2.53%","content":"PERCENT"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"$32 million","content":"MONEY"}],"hashtag":["ASSETS","COSMOS","DEXS"],"authors":["Vishal Chawla","The Block"]}