{"summary":"Eddy Alexandre agreed to forfeit $248.8 million, in addition to restitution.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210758\/crypto-ceo-pleads-guilty-to-250-million-scam-sdny-says","publishDate":"2023-02-10T17:18:40","id":5950,"type":null,"title":"Crypto CEO pleads guilty to $250 million scam, SDNY says","category":["POLICY"],"content":["Eddy Alexandre, the CEO of a purported cryptocurrency and currency trading platform called EminiFX, pleaded guilty to one count of commodities fraud and agreed to forfeit $248.8 million in addition to restitution, the U.S. Attorney's Office for the Southern District of New York said Friday.&nbsp;","Alexandre was alleged to have solicited investments from tens of thousands of investors and fabricated weekly returns of at least five percent, U.S. Attorney Damian Williams said in a statement.","\"Alexandre’s scam caused investors to lose millions of dollars, and this case should serve as yet another warning to cryptocurrency executives that the Southern District of New York is closely watching and ready to prosecute any and all misconduct in the crypto markets,” he said.","Alexandre is alleged to have transferred at least $14.7 million to his personal bank account, and he used investor funds to purchase a BMW for himself. The offense to which he pleaded guilty carries a maximum sentence of 10 years in prisons.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Alexandre’s","content":"PERSON"},{"type":"$14.7 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Southern District of New York","content":"LOCATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"$248.8 million","content":"MONEY"},{"type":"the Southern District of New York","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Eddy Alexandre","content":"PERSON"},{"type":"Damian Williams","content":"PERSON"},{"type":"BMW","content":"ORGANIZATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}