{"summary":"Binance&#x27;s payments partner Paysafe said &quot;the UK regulatory environment in relation to crypto is too challenging.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/219443\/binance-payments-partner-paysafe-says-uk-regulatory-environment-is-too-challenging","publishDate":"2023-03-13T18:18:13","id":5951,"type":null,"title":"Binance payments partner Paysafe says UK regulatory environment is &#x27;too challenging&#x27;","category":["THE BLOCK"],"content":["Paysafe decided to stop offering Binance customers its embedded wallet solution in the UK in a move it blamed on complex regulation. As a result, Binance <a href=\"https:\/\/www.theblock.co\/post\/219416\/binance-to-suspend-gbp-transactions-as-payments-partner-moves-away\" data-v-f87c67ca=\"\">will suspend GBP deposits<\/a> and withdrawals for new users starting March 13 and all users on May 22.","\"We have concluded that the UK regulatory environment in relation to crypto is too challenging to offer this service at this time and so this is a prudent decision on our part taken in an abundance of caution,\" a Paysafe spokesperson said in an email to The Block.","The UK unveiled in February <a href=\"https:\/\/www.theblock.co\/post\/207488\/the-uk-finally-reveals-plan-to-regulate-crypto-trading-and-lending\" data-v-f87c67ca=\"\">a plan to regulate crypto<\/a> trading and lending, with stricter rules and a broader reach. Paysafe will continue working with Binance in Europe and Latin America, as it expands in those areas.","\"While we recognize this is disappointing, the UK portion of our business with Binance is small,\" the company said.","Binance estimated this will affect less than 1% of its users but said in an email that it is \"working hard to find an alternative solution for them.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"UK","content":"ORGANIZATION"},{"type":"Paysafe spokesperson","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Latin America","content":"LOCATION"},{"type":"February","content":"DATE"},{"type":"1%","content":"PERCENT"},{"type":"March 13","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"},{"type":"May 22","content":"DATE"},{"type":"Europe","content":"LOCATION"}],"hashtag":["BINANCE"],"authors":["Catarina Moura","The Block"]}