{"summary":"An exploiter used a flash loan reentrancy attack to drain more than 1,300 ETH ($1.4 million) from NFT lender Omni.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156800\/hacker-drains-1-4-million-worth-of-eth-from-nft-lender-omni","publishDate":"2022-07-10T14:15:46","id":5955,"type":null,"title":"Hacker drains $1.4 million worth of ETH from NFT lender Omni","category":["HACKS"],"content":["Omni, a non-fungible token (NFT) money market platform, was drained of about 1,300 ETH ($1.43 million) in a flash loan reentrancy attack on Sunday, <a href=\"https:\/\/twitter.com\/peckshield\/status\/1546096506159058947\" data-v-f87c67ca=\"\">according<\/a> to PeckShield.","Omni allows users to stake their NFTs, usually from popular collections like Bored Ape Yacht Club, to receive tokens like ether (ETH).&nbsp;","Today’s <a href=\"https:\/\/etherscan.io\/tx\/0x05d65e0adddc5d9ccfe6cd65be4a7899ebcb6e5ec7a39787971bcc3d6ba73996\" data-v-f87c67ca=\"\">attack<\/a> saw the hacker exploit a <a href=\"https:\/\/www.theblock.co\/post\/137932\/defi-protocols-agave-and-hundred-finance-exploited-on-gnosis-chain-for-11-million\" data-v-f87c67ca=\"\">reentrancy vulnerability<\/a> in the Omni protocol. Reentrancy is a known vulnerability in projects coded with Solidity that allows a rogue actor to force its smart contract to make an external call to an untrusted contract. This external call is executed before the original function and can thus be used to repeatedly re-enter the protocol to drain its liquidity.","Yajin Zhou, CEO of blockchain security company BlockSec, explained the process of the exploit to The Block, saying that the attacker deposited NFTs from a collection called Doodles. These NFTs were used as collateral to borrow wrapped ETH (WETH).","The attacker then exploited the reentrancy vulnerability by withdrawing all but one of the NFTs deposited as collateral. This action <a href=\"https:\/\/twitter.com\/BlockSecTeam\/status\/1546141457933025280\" data-v-f87c67ca=\"\">triggered<\/a> a malicious callback function to the benefit of the attacker. This function allowed the hacker to use the borrowed funds to buy even more Doodles before liquidating the loan position.","Once the position is liquidated, the remaining Doodle NFT from the original collateral is returned back to the attacker. The loan position is liquidated because the value of the NFT that was initially left as collateral before the callback function was invoked was not sufficient to cover the debt position. This is where the reentrancy comes in, as the attacker is able to force through using the borrowed WETH to buy more NFTs before the liquidation occurs.","The attacker then used the Doodles acquired with the initial loan as collateral to borrow more WETH. Omni, however, did not recognize this new debt position, so the hacker could withdraw the NFTs without paying back the loan.","The attack drained more than 1,300 WETH ($1.4 million) from the protocol. Omni said that the exploit did not affect any customer funds as only internal testing funds were impacted, since the platform is still in beta testing mode.","The NFT money market platform said that it has paused the protocol pending a complete investigation. Data from Etherscan shows the exploiter has already <a href=\"https:\/\/etherscan.io\/address\/0x627a22ff70cb84e74c9c70e2d5b0b75af5a1dcb9\" data-v-f87c67ca=\"\">laundered<\/a> the funds via Tornado Cash, <a href=\"https:\/\/www.theblock.co\/linked\/127629\/ethereum-mixer-tornado-cash-announces-new-upgrades\" data-v-f87c67ca=\"\">a coin mixing service<\/a> for private transactions on Ethereum.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"PeckShield","content":"ORGANIZATION"},{"type":"Doodle NFT","content":"ORGANIZATION"},{"type":"Yajin Zhou","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"$1.43 million","content":"MONEY"},{"type":"$1.4 million","content":"MONEY"},{"type":"Etherscan","content":"ORGANIZATION"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}