{"summary":"Sumitomo Mitsui Financial Group is planning a trial of soulbound tokens for identity verification via a business partnership with HashPort Group.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193199\/smbc-trial-soulbound-tokens","publishDate":"2022-12-08T04:30:18","id":5956,"type":null,"title":"Japanese banking giant SMBC trialing soulbound tokens","category":["FINANCE FIRMS"],"content":["One of Japan's largest financial institutions, Sumitomo Mitsui Financial Group, is planning a trial of soulbound tokens for identity verification via a business partnership with HashPort Group.","Firstly, SMBC will issue soulbound tokens on a trial basis, according to <a href=\"https:\/\/www.moneycontroller.co.uk\/finance-news\/consideration-of-a-business-partnership-with-hashport-group-in-the-soulbound-token-domain-1000730\" data-v-f87c67ca=\"\">a release<\/a>, with technical support from HashPort, through the end of March 2023.","Secondly, it may look into testing soulbound tokens to prove behavior or claims about careers.&nbsp;Case studies may also be produced with companies interested in creating and marketing \"fan communities using tokens.\"","Going beyond soulbound tokens, SMBC and HashPort may also look at NFTs and web3 infrastructure development for domestic and overseas business penetration.","Today's announcement has been in the works for months. SMBC and HashPort have been in talks to launch a collaborative business effort to develop a web3 economic zone since July 2022.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"HashPort","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"HashPort Group","content":"ORGANIZATION"},{"type":"March 2023","content":"DATE"},{"type":"Sumitomo Mitsui Financial Group","content":"ORGANIZATION"},{"type":"July 2022","content":"DATE"},{"type":"Japan","content":"LOCATION"}],"hashtag":["DECENTRALIZED INFRASTRUCTURE","IDENTITY","INVESTMENT FIRMS"],"authors":["Adam James","The Block"]}