{"summary":"Grayscale, in an association with market research firm Q8 Research, surveyed 1,100 Americans between the ages of 25 and 64, providing insights into","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/33406\/grayscale-survey-70-of-bitcoin-interested-investors-in-us-are-parents","publishDate":"2019-07-25T09:17:03","id":5957,"type":null,"title":"Grayscale survey: More than one-third of American investors would consider buying bitcoin","category":["BITCOIN"],"content":["A recent survey by crypto asset manager Grayscale found that more than one-third (36%) of respondents said they would be interested in buying bitcoin","The survey attempted to shed some light on the demographics of bitcoin investors or would-be investors","Grayscale, in an association with market research firm Q8 Research, surveyed 1,100 Americans between the ages of 25 and 64, providing insights into profiles of average bitcoin holders and capturing bitcoin sentiment in the country.","The survey showed 21 million investors in the U.S. would consider investing in bitcoin, although a number of concerns are still keeping them from diving into the market.","According to the survey, published Thursday, over one-third (36%) of Americans are interested in buying into bitcoin, but issues such as hacks and lack of regulation are keeping cryptocurrencies from reaching a broader audience. Seventy-five percent of all investors and sixty-eight percent of those interested in investing in bitcoin say crime is their paramount fear.&nbsp;","Indeed, there has been a number of hacks in the cryptocurrency market. According to The Block’s <a href=\"https:\/\/www.theblockcrypto.com\/2019\/04\/01\/research-cryptocurrency-exchange-hacks-surpass-1-3-billion-all-time-61-coming-from-2018\/\" data-v-f87c67ca=\"\">research<\/a>, the total amount stolen from cryptocurrency exchanges to date now stands at nearly $1.39 billion.","<strong data-v-f87c67ca=\"\">What bitcoiners look like<\/strong>","Despite bitcoiners being associated with America's youth, most interested investors are parents.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBitcoin-interested investors are often middle-aged, middle-class and suburban, and most (70%) are parents and nearly half (49%) make less than $100,000 per year, Grayscale said. They are also slightly more experienced and risk-tolerant than average investors, it added.","One thing that appeals the most to them is that they can invest small amounts in the world’s largest cryptocurrency. Bitcoin’s growth potential and scarcity (limited supply of 21 million units) are some other appealing factors.","Grayscale said its research has shown that even a small allocation to cryptocurrencies can increase overall portfolio performance by only “modestly increasing” risk. The asset manager further said, according to its hypothetical simulations, over the period from Sept. 25, 2013 to June 30, 2019, adding just 5% in bitcoin to a simulated global 60% stock and 40% bond portfolio more than doubled cumulative returns from 41.9% to 90.9%.","Grayscale finally said more education from financial advisors and other intermediaries would help them move away from the sidelines as the future of investing is digital and bitcoin is \"here to stay.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Q8 Research","content":"ORGANIZATION"},{"type":"70%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"41.9%","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"$1.39 billion","content":"MONEY"},{"type":"America","content":"LOCATION"},{"type":"60%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"eight percent","content":"PERCENT"},{"type":"$100,000","content":"MONEY"},{"type":"36%","content":"PERCENT"},{"type":"five percent","content":"PERCENT"},{"type":"49%","content":"PERCENT"},{"type":"Sept. 25, 2013","content":"DATE"},{"type":"June 30, 2019","content":"DATE"},{"type":"90.9%","content":"PERCENT"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}