{"summary":"Court in Tezos’ class action litigation denies motion to compel filed by Plaintiff\nMarried defendants argued that their communication together was privileged under the marital communications privilege","author":["Stephen Palley","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/34475\/amor-vincit-omnia-tezos-court-denies-document-request-because-of-marital-privilege","publishDate":"2019-08-02T12:00:37","id":596,"type":null,"title":"Amor Vincit Omnia? Tezos court denies document request because of marital privilege","category":["Legal"],"content":["<strong data-v-f87c67ca=\"\">In re Tezos Securities Litigation, Case No. 17-cv-06779-RS, \"Order on Discovery Dispute\", 7\/30\/2019<\/strong>","<a href=\"https:\/\/www.scribd.com\/document\/420507630\/Tezos-Marital-Privilege-Opinion\" data-v-f87c67ca=\"\">Link to opinion<\/a>","The Tezos litigation has taken a number of procedural twists and turns but still remains a putative class action (no class has been certified). The litigants have gone to battle over a number of issues, the latest of which is whether marital privilege protects husband\/wife communications between Arthur and Kathleen Breitman from production to the plaintiffs.","In <a href=\"https:\/\/www.theblockcrypto.com\/2019\/07\/12\/tezos-founders-claim-marital-privilege-to-keep-emails-between-them-confidential\/\" data-v-f87c67ca=\"\">prior pieces published on the Block,<\/a> we've covered (1) the nature of the marital privilege in this case and (2) the arguments that the parties have raised in connection with a motion to compel filed by the Plaintiffs. In short, the Breitmans, who created Tezos, refused to produce various communication between them, arguing that because they are married the law protects it from disclosure. &nbsp;","The Court agreed. Specifically, the Court held that \"that the marital communications privilege shields from disclosure communications between Kathleen and Arthur that were withheld from production in this litigation and placed on [a] privilege log.\"","Looking at applicable caselaw, the Court said that there was no dispute that the communications at issue were made between two validly married people. At issue, per the Court, was \"the confidential nature of the communications.\" The defendants provided sworn statements to the effect that they didn't believe that their email communications were likely to be overhead\/read by third parties. Given this, the Court said that the Plaintiffs did not meet their burden to show that the privilege was inapplicable.","Plaintiffs also argued in the alternative that even if the privilege applied there's an exception for communications that would have been made anyway in the ordinary course of business if the spouses weren't married. The Court rejected this argument and declined to apply a business exception to the marital communications privilege:","If there were such an exception to the marital communications privilege, courts would be required to analyze specific communications merely to determine whether the communication was purely about business or whether it also contained any personal information. This scrutiny for a communication made, as here, without the likelihood of disclosure to a third party, is exactly the type of scrutiny that the marital communications privilege is designed to avoid.","For these reasons, the Court denied the motion.","This is of course only one ruling out of many and by no means decides the case, which is likely to poodle on for some time, at least through a class certification fight which may not take place until next year. &nbsp;In addition, the defendants have already apparently produced boatloads of documents, so it's not like the Plaintiffs don't have plenty to work with. &nbsp;","With that said, lawsuits are won and lost in many small battles (and sometimes they tell us something about the quality of the lawyering). We can only speculate about the content of the Breitmans' marital communications but the vigor with which production was resisted suggests that this is likely a meaningful victory. If there were spousal communications damaging to the defendants' arguments those will not be seen in this proceeding. It also shows that one of the advantages that the Breitmans have going for them is solid defense counsel. And while that is no guarantee of anything, it can definitely make a difference. &nbsp;","<i data-v-f87c67ca=\"\">Disclaimer: &nbsp;This summary is provided for&nbsp;educational purposes only. &nbsp;It is not intended to be and should be&nbsp;relied upon as legal advice. This is my opinion only, isn't authorized by any past, present or future client or employer. Also I might change our mind. &nbsp;I contain multitudes.<\/i>"],"hashtag":[]}