{"summary":"Crypto exchange Kraken will share user information with the Internal Revenue Service next month after receiving a court order in June.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/259757\/kraken-irs-user-data-order","publishDate":"2023-10-27T07:29:21","id":5960,"type":null,"title":"Kraken to share user data with IRS next month following June court order","category":["EXCHANGES"],"content":["Crypto exchange Kraken is set to share select user information with the Internal Revenue Service next month after being mandated by a court order received in June.","\"Kraken expects to share this information covered by the court's order in early November 2023,\" reads an email the crypto exchange sent to affected U.S. users on Wednesday that was seen by The Block. Kraken confirmed the email and reiterated some of the comments made in it.","The IRS-Kraken battle <a href=\"https:\/\/www.theblock.co\/linked\/104140\/irs-kraken-john-doe-summons-tax-information\" data-v-f87c67ca=\"\">began<\/a> in May 2021 when a U.S. federal court authorized the tax agency to serve a John Doe summons on the crypto exchange and its subsidiaries in a bid to catch tax dodgers. The IRS at the time said that Kraken had failed to comply with the summons. Then in February of this year, the tax agency filed a court document seeking permission to enforce the summons, and in June, a federal court <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.cand.407965\/gov.uscourts.cand.407965.34.0.pdf\" data-v-f87c67ca=\"\">ordered<\/a> Kraken to <a href=\"https:\/\/www.theblock.co\/post\/237381\/kraken-to-turn-over-information-to-irs-after-court-order\" data-v-f87c67ca=\"\">turn over<\/a> user information to the IRS.","According to the June order, Kraken must provide profile information and transaction histories for clients who conducted transactions exceeding $20,000 in any single year between 2016 and 2020. This information includes names, birthdates, taxpayer identification numbers, addresses, phone numbers, email addresses, and transaction histories for those five years.","The IRS had sought more extensive information, including users' IP addresses, employment details, sources of wealth, net worth, and banking information. However, Kraken said in Thursday’s email that it had successfully convinced the court to \"substantially reduce\" the number of affected clients and the amount of client data it must produce.","The reduced number appears to be 42,017, per June's court order, whereas the IRS had initially sought information on 59,331 Kraken users.","Kraken is not the only crypto firm sharing user information with the IRS. In 2018, its rival Coinbase shared details of around 13,000 users with the federal tax agency. In 2021, the IRS also issued similar summons to crypto exchange Poloniex and stablecoin issuer Circle.","<em data-v-f87c67ca=\"\">Updated with Kraken's comment.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"2016","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"May 2021","content":"DATE"},{"type":"Internal Revenue Service","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"$20,000","content":"MONEY"},{"type":"the IRS","content":"ORGANIZATION"},{"type":"John Doe","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"IRS","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"2020","content":"DATE"}],"hashtag":["KRAKEN"],"authors":["Yogita Khatri","The Block"]}