{"summary":"Legal strife around Tether and continual regulatory skepticism surrounding Facebook’s Libra project might have chilled the stablecoin market, however, the","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/31940\/huobi-backs-new-stablecoin-under-paxos-custody-eyeing-on-the-gap-in-regulated-stablecoin-market-left-by-tether","publishDate":"2019-07-17T10:13:04","id":5961,"type":null,"title":"Huobi backs new stablecoin under Paxos custody, eyeing regulated stablecoin market opening left by Tether","category":["STABLECOINS"],"content":["<span data-v-f87c67ca=\"\">Legal strife around Tether and continual regulatory skepticism surrounding Facebook’s Libra project might have chilled the stablecoin market, however, the competition in this space is still heating up.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Huobi Capital-backed crypto startup Stable Universal today launches a new dollar-pegged stablecoin, HUSD, with stablecoin issuer and custodian Paxos as its custody partner. The new coins will first be listed on cryptocurrency exchange Huobi Global and later become available on other exchanges, trading desks, and wallets, per a company statement.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Stable Univeral’s HUSD will be transitted from the old HUSD that Huobi Global <a href=\"https:\/\/medium.com\/huobi-global\/husd-a-new-stablecoin-solution-15cb10b33600\" data-v-f87c67ca=\"\">launched back in 2018<\/a>. The old HUSD was designed as a way to aggregate all existing stablecoins as one token to be traded with other cryptocurrencies on the Huobi exchange. However, according to Ricky Li, co-founder of one of Huobi's market makers Altonomy, the token was not getting as much liquidity as the exchange had expected.&nbsp;<\/span>","\"[The old] HUSD was not acting as a liquidity aggregator, because nobody wants to trade it since the pricing is not as transparent,\" said Li. \"We actually have been talking about this with Huobi for a long time to get rid of [the old] HUSD and get actual stablecoin pairs like Binance did and we will actually be much more comfortable trading them.\"&nbsp;","<span data-v-f87c67ca=\"\">Hoping to develop HUSD into \"an alternative to Tether,\" per a Huobi Global statement, the exchange is counting on its large user base and Paxos’ status as a regulated custodian for a solid landing in the competitive stablecoin space, as it sees that no regulated stablecoin has been able to clutch a substantial market share yet, according to Stable Universal CEO Frank Zhang.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Indeed, for now, much of the market<\/span> <span data-v-f87c67ca=\"\">is still dominated by Tether, which <\/span><a href=\"https:\/\/www.cryptocompare.com\/coins\/usdt\/overview\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">has over $10 million<\/span><\/a><span data-v-f87c67ca=\"\"> in daily trading volume. To snare some market share from the more established stablecoin issuer, HUSD is leveraging Huobi’s popularity to “build liquidity quickly with their massive customer base,” said Zhang.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, as much as HUSD relies on Huobi’s influence to generate liquidity, Tether and its affiliated exchange Bitfinex’s <\/span><a href=\"https:\/\/www.theblockcrypto.com\/2019\/07\/08\/latest-filings-from-nyoag-allege-bitfinex-and-tether-continued-some-new-york-operations-as-late-as-january-2019\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">prolonged dispute<\/span><\/a><span data-v-f87c67ca=\"\"> with the New York Attorney General’s Office (NYOAG) has already left many traders with a distaste against the mingling between exchanges and stablecoin issuers, according to Li.<\/span>","<span data-v-f87c67ca=\"\">“Issuers of new stablecoins are actually supposed to be independent. They should be a third party rather than the exchanges,” said Li. “Unfortunately, exchanges in the space are still in a dominant position.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">To preempt potential legal concerns, the company is trying to differentiate itself by having the reserve under the custody of Paxos, a New York State Department of Financial Services certified custodian. The company also provides HUSD with regular auditing and KYC and AML compliance services.<\/span>","<span data-v-f87c67ca=\"\">Paxos itself promises a fully backed reserve for its own stablecoin PAX and has rolled out <a href=\"https:\/\/www.theblockcrypto.com\/2019\/05\/13\/stablecoin-pax-can-now-be-redeemed-instantly-on-an-integrated-platform-with-exchange-itbit\/\" data-v-f87c67ca=\"\">a much-welcomed feature<\/a> that guarantees instant redemption of PAX for U.S. dollars. With its reserve held under the same regulatory standard as PAX, HUSD may be able to offer a similar feature in the future. If successful, it may give the new stablecoin a leg up over those more established players in the space.<\/span>","\"We dont really differentiate between stablecoins...<b data-v-f87c67ca=\"\"><\/b>But then what matters is actually maintaining redemption processes, the liquidity of these crypto pairs, and how many exchanges they are traded on. In those cases all the stablecoins are different,\" said Li.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Huobi Global","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"New York Attorney General’s Office (NYOAG)","content":"ORGANIZATION"},{"type":"Frank Zhang","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"Tether","content":"ORGANIZATION"},{"type":"KYC","content":"ORGANIZATION"},{"type":"Zhang","content":"PERSON"},{"type":"AML","content":"ORGANIZATION"},{"type":"Ricky Li","content":"PERSON"},{"type":"New York State Department of Financial Services","content":"ORGANIZATION"},{"type":"Huobi","content":"PERSON"},{"type":"Binance","content":"PERSON"},{"type":"$10 million","content":"MONEY"}],"hashtag":["HTX"],"authors":["Celia Wan","The Block"]}