{"summary":"Stack builds the framework to track assign and track points on-chain, including point allocations, leaderboards and trustless token redemption.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280173\/archetype-leads-3-million-seed-round-for-on-chain-points-startup-stack","publishDate":"2024-03-04T12:01:04","id":5963,"type":null,"title":"Archetype leads $3 million seed round for on-chain points startup Stack","category":["COMPANIES"],"content":["Stack, a startup developing on-chain points infrastructure, raised $3 million in seed funding.&nbsp;","The venture firm Archetype led the round, which saw additional participation from Coinbase Ventures, Scalar Capital, A.Capital, Balaji Srinivasan, Nadav Hollander, Henri Stern, Cooper Turley and Colin Armstrong.","\"Stack is front and center at the dawn of the application era for crypto,\" Archetype Founder Ash Egan told The Block. \"As we enter into this phase in the cycle, Archetype remains committed and excited about consumer products and infrastructure.\"","Stack builds the framework to assign and track points on-chain, including point allocations, leaderboards and trustless token redemption. User can redeem points for ERC-20 tokens, eth or other assets. Stack aims to provide more affordable and simpler on-chain points that dissuade \"farming,\" or abusing a project's financial system for personal gain.&nbsp;","“I believe that on-chain points add more value and security to loyalty programs and will drive faster consumer adoption for those applications, while reducing risk both for brands and consumers,\" said Stack CEO and Founder Graeme Boy in a statement. \"Point systems align seamlessly with the inherent strengths and use cases of blockchains.\"","<a href=\"https:\/\/www.theblock.co\/learn\/274899\/what-are-crypto-points\" data-v-f87c67ca=\"\">Crypto points<\/a> have gained traction in the web3 industry, with projects giving away <a href=\"https:\/\/www.theblock.co\/post\/277823\/crypto-projects-115b-points\" data-v-f87c67ca=\"\">115 billion<\/a> in points by Feb. 17, The Block previously reported. Crypto points are a way to incentivize community engagement and add some level of gamification to projects while attempting to dissuade selfish actors.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nadav Hollander","content":"PERSON"},{"type":"Colin Armstrong","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Cooper Turley","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Graeme Boy","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$3 million","content":"MONEY"},{"type":"Feb. 17","content":"DATE"},{"type":"Balaji Srinivasan","content":"PERSON"},{"type":"Scalar Capital","content":"ORGANIZATION"},{"type":"Henri Stern","content":"PERSON"},{"type":"Ash Egan","content":"PERSON"},{"type":"Coinbase Ventures","content":"ORGANIZATION"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}