{"summary":"The pre-fill solution streamlines account onboarding by verifying identity information using a customer&#x27;s phone number.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/217796\/bitstamp-us-partners-with-prove-identity-to-register-customers-in-under-a-minute","publishDate":"2023-03-08T08:02:49","id":5964,"type":null,"title":"Bitstamp US partners with Prove Identity to offer document-free, rapid onboarding","category":["COMPANIES"],"content":["Crypto exchange Bitstamp U.S. is optimizing its account onboarding process through a partnership with Prove Identity.","The exchange will use Prove Identity's pre-fill onboarding solution to streamline the account registration process. The pre-fill tool, which is powered by the Prove Identity Network, populates account applications with verified identity information that is tied to an individual's phone number, which means the exchange can onboard customers in under a minute, the company said in a release.","Prove creates anonymized identity tokens using telecoms and mobile network data combined with bank-grade compliant information such data from utility providers and banks, said Joon Pak, head of crypto at Prove in an interview with The Block.","\"We have the largest collection of identity tokens in the market,\" Pak said. \"If you've ever logged into Bank of America, American Express, PayPal, etc., we have your identity token. And that's what we call the Prove Identity Network, its what underpins all of the solutions that we provide here at Prove.\"","Prove's solutions are <a href=\"https:\/\/www.prove.com\/\" data-v-f87c67ca=\"\">used<\/a> by more than 1,000 businesses including PayPal, Coinbase and Mastercard. The company was founded in 2008 and was formerly known as Payfone.","The partnership with Bitstamp has been in the works for over a year, said Thomas Hook, chief compliance officer at Bitstamp U.S.","\"Frankly, I've been thinking about kind of these types of onboarding changes since I joined in May of 2021,\" Hook said. \"From my perspective, people don't often think of compliance as a business differentiator and it really can be, especially as in these areas like onboarding.\"","The pre-fill tool enables Bitstamp to remove the burdensome process of verifying an identity using documentation such as&nbsp; uploading photo ID. Prove Identity has confidence in the information its authenticating through its \"pro methodology,\" which verifies the user is actually in possession of the phone, that the phone number is reputable and that the individual is the operator of the phone.","\"We like to think of it as like three legs to a barstool, you need to have all three legs in order for the barstool to say upright,\" Pak said. \"And by having this pro methodology, this is how we can ensure that Thomas is actually presenting Thomas's information when he's creating a Bitstamp account.\"","While document verification will still have a place in some onboarding processes, Pak highlights that fraudsters are becoming increasingly sophisticated at thwarting that verification process.","\"Our stance is that yes, while [document] ID scanning is super important, that pro methodology, again the possession, reputation and ownership of a consumers phone, is really a powerful way to ensure that you're having the most compliant, most secure and safe onboarding experience,\" Pak said. \"You're letting the good guys through the front door and you're stopping bad actors when they try to get in.\"","The new onboarding service is only currently available on the Bitstamp U.S. exchange, but Hook hopes to expand this to different markets globally depending on jurisdictional requirements and being able to meet those needs through existing technology.","\"The U.S. has a great wealth of information about individuals that can be used in these processes, which are called non-documentary verification processes,\" Hook said. \"Given the amount of information that exists its a good jurisdiction to move in and I think it makes us more competitive and maybe even stronger than some of the other offerings out there in terms of onboarding.\"","The exchange is trying to also make itself more competitive by doubling down on building at a time when other players are pulling back.","\"When things start to go in the right direction, this is going to be very important, right?\" Hook said. \"People are gonna flood the market and they need to have a quick way to get on board and be able to take advantage of that.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mastercard","content":"ORGANIZATION"},{"type":"The U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Joon Pak","content":"PERSON"},{"type":"Bank of America","content":"ORGANIZATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Prove Identity","content":"ORGANIZATION"},{"type":"May of 2021","content":"DATE"},{"type":"Thomas Hook","content":"PERSON"},{"type":"2008","content":"DATE"},{"type":"Bitstamp U.S.","content":"LOCATION"},{"type":"Thomas","content":"PERSON"},{"type":"American Express","content":"ORGANIZATION"},{"type":"Bitstamp","content":"PERSON"},{"type":"Prove Identity Network","content":"ORGANIZATION"},{"type":"Payfone","content":"LOCATION"},{"type":"Pak","content":"PERSON"}],"hashtag":["BITSTAMP"],"authors":["Kari McMahon","The Block"]}