{"summary":"The Ethereum Name Service saw the second-largest ENS purchase yesterday as the 000.eth domain changed hands for $315,000.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/155685\/ethereum-name-service-records-second-highest-ens-name-sale","publishDate":"2022-07-04T05:44:06","id":5967,"type":null,"title":"Ethereum Name Service domain bought for $315,000 in second-biggest ever sale","category":["ETHEREUM"],"content":["The Ethereum Name Service (ENS) domain 000.eth was purchased for 300 ETH ($315,000) on July 3, making it the second-largest sale measured in both ether and dollars.","The domain was sold by an OpenSea user named EtheOS, according to <a href=\"https:\/\/opensea.io\/assets\/ethereum\/0x57f1887a8bf19b14fc0df6fd9b2acc9af147ea85\/24293655359084398983762148957951887367734741115283469135310733710692111186993\" data-v-f87c67ca=\"\">on-chain data<\/a>. They received the ENS name in June 2020 from another address that they may or may not own. They first listed it in September 2021 for 100 ETH (around $300,000 at the time), before relisting it in January this year for 500 ETH (around $1.6 million at the time). They then listed it again in March, where the offer sat for three months before being accepted.","The user that sold the domain also owns a few other NFTs, including another ENS name kimjonghyung.eth.","ENS domains are human-readable addresses designed to be used to replace blockchain addresses when sending blockchain transactions. Instead of a crypto user having to copy and paste their blockchain address, they can use such names to select where they are sending money. ENS names are also non-fungible tokens (NFTs) and can be sold on NFT marketplaces like OpenSea.","The biggest sale so far of an ENS domain was for paradigm.eth, which was purchased in October 2021 for 420 ETH (about $1.5 million at the time). Despite the name, crypto investment firm Paradigm reportedly denied that it made the purchase. Plus there was a few <a href=\"https:\/\/www.theblock.co\/post\/120211\/the-mystery-of-a-1-5-million-ethereum-name-purchase\" data-v-f87c67ca=\"\">other indicators<\/a> that suggested it might be a prank — although a rather expensive one.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1.5 million","content":"MONEY"},{"type":"June 2020","content":"DATE"},{"type":"$1.6 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"September 2021","content":"DATE"},{"type":"October 2021","content":"DATE"},{"type":"$315,000","content":"MONEY"},{"type":"January this year","content":"DATE"},{"type":"March","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ethereum Name Service","content":"ORGANIZATION"},{"type":"$300,000","content":"MONEY"},{"type":"July 3","content":"DATE"}],"hashtag":["CRYPTO"],"authors":["Tim Copeland","The Block"]}