{"summary":"&quot;On days when tech stocks rally, ETHBTC tends to rise as ETH benefits more than BTC,&quot; said Erik Norland, a senior economist at CME Group.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241738\/higher-tech-stocks-benefit-ether-more-than-bitcoin-cme-group-says","publishDate":"2023-07-27T11:36:10","id":5968,"type":null,"title":"Higher tech stocks benefit ether more than bitcoin, CME Group says","category":["MARKETS"],"content":["The performance of tech stocks is a common metric widely watched in crypto circles, but CME Group says that movements in the tech-heavy Nasdaq 100 tend to impact the price of ether more than the price of bitcoin.","\"On days when tech stocks rally, ETHBTC tends to rise as ETH benefits more than BTC,\" Erik Norland, a senior economist and executive director at CME Group, said in a <a href=\"https:\/\/www.cmegroup.com\/insights\/economic-research\/2023\/three-factors-driving-the-ether-bitcoin-price-nexus.html\" data-v-f87c67ca=\"\">report<\/a> released Thursday, referring to the exchange rate between ether and bitcoin.&nbsp;","The difference can be explained in how ether and bitcoin are supplied to the market and then used, Norland said, pointing to the \"practical applications\" of the Ethereum smart contract network. Bitcoin, on the other hand, is mainly being used as a \"highly volatile\" store of value and hedge against fiat devaluation.","While bitcoin and ether are both known for volatile price swings, the exchange rate between the world's two largest cryptocurrencies appears somewhat stable in comparison with a daily volatility rate of about 30% over the past year, according to the report. That's compared to 42% for bitcoin's price and 59% for ether.","\"On days in which BTC rises, ETH tends to rise even more,\" Norland wrote. \"When BTC falls, ETH tends to fall to a greater degree.\"","Still, the correlation between prices of the two cryptocurrencies has hovered at around 0.85 for the past year, suggesting a very close relationship.&nbsp;","<span data-v-f87c67ca=\"\">Source: CME Group<\/span>","Ether also appears to be more sensitive to swings in the U.S. dollar, and the ETHBTC rate reacts more strongly to changes in bitcoin supply than it does to ether supply, according to the report.","\"A stronger USD appears to be more negative for ETH than it is for BTC,\" Norland said. \"ETHBTC shows near-zero correlation to movements in interest rate, gold and crude oil futures.\"","Furthermore, ether's supply tends to rise after price increases relative to bitcoin. \"In other words, ETH supply responded to price rather than drive it,\" Norland said.","\"If BTC rallies ahead of its upcoming April 2024 halving as it did ahead of previous <a href=\"https:\/\/www.theblock.co\/post\/239581\/jpmorgan-bitcoin-halving-stress-test-miners\" data-v-f87c67ca=\"\">halvings<\/a>, that might also help ETH prices to rise even further on a relative basis,\" he added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"April 2024","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"CME Group","content":"ORGANIZATION"},{"type":"42%","content":"PERCENT"},{"type":"Erik Norland","content":"PERSON"},{"type":"USD","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"Norland","content":"ORGANIZATION"},{"type":"59%","content":"PERCENT"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}