{"summary":"Spiderchain offers a two-way pegged sidechain for Bitcoin, helping to enable Ethereum-like functionalities on the Botanix EVM Layer 2.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/251780\/spiderchain-helps-bring-ethereum-functionality-into-the-bitcoin-verse","publishDate":"2023-09-19T11:12:55","id":5971,"type":null,"title":"Can Spiderchain help bring Ethereum functionality into the Bitcoin-verse?","category":["LAYER 2S AND SCALING"],"content":["<span data-v-f87c67ca=\"\">With the <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.77%\n    <\/span><\/a> <!----><\/span><\/span> community recently distracted by the reignited debate around drivechains, Casa CTO Jameson Lopp argues the Botanix EVM Layer 2 protocol's proposal for pegging bitcoin to its Spiderchain sidechain has been overlooked.<\/span>","While the drivechain native, merge-mined sidechain mechanism for Bitcoin would require a contentious fork, Spiderchain could be implemented today without requiring any changes on the Bitcoin base layer, Lopp said in his <a href=\"https:\/\/blog.lopp.net\/an-introduction-to-spiderchain\/\" data-v-f87c67ca=\"\">latest blog post<\/a>.","Sidechains are secondary blockchains that run parallel to the main blockchain, allowing for the transfer of assets between the two chains. The challenge is doing this in a decentralized fashion.","<a href=\"https:\/\/a-us.storyblok.com\/f\/1014909\/x\/8d64a913a6\/botanix-protocol-whitepaper.pdf\" data-v-f87c67ca=\"\">Botanix Labs recently published a whitepaper<\/a><span data-v-f87c67ca=\"\"> for its proposed Botanix <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.033%\n    <\/span><\/a> <!----><\/span><\/span> Virtual Machine-compatible Layer 2 protocol and Spiderchain sidechain solution. While the software is not yet live, Lopp said that Spiderchain makes sense at a high level, but it remains to be seen if it can hold up to real-world edge cases and adversarial conditions.<\/span>","Ethereum's DeFi boom left Bitcoin somewhat in the shadows, especially when considering the total value locked in their respective second layers, Botanix argues in the whitepaper. Botanix EVM aims to bridge this gap by introducing a second layer on Bitcoin with full Ethereum Virtual Machine compatibility. This means developers could tap into the vast range of Ethereum smart contracts while retaining the security of Bitcoin's base layer via the Spiderchain sidechain. Synthetic BTC acts as the native currency for Botanix EVM, pegged 1:1 with bitcoin on Spiderchain.","The Casa CTO noted that detractors have said Bitcoin sidechains are useless, with its oldest and most notable, Liquid and Rootstock, struggling to gain significant adoption. However, Lopp argues continuing research into permissionless, two-way pegging mechanisms is a worthy pursuit, particularly as centralized solutions like wrapped BTC have seen strong demand, with over 150,000 BTC ($4 billion) deposited with a third-party custodian to issue bitcoin-pegged tokens on Ethereum.","The Ethereum Foundation's vision for scalability involves multiple layers of EVM-compatible chains, with the Ethereum base layer providing settlement. However, Lopp argues Ethereum still faces centralization concerns, with Botanix contending that Bitcoin provides a more suitable foundation to build these layers with its high level of immutability and proof of work security.","Spiderchain operates using a series of multisig wallets managed by entities called Orchestrators, Lopp explained. Users deposit bitcoin collateral into a multisig wallet as a stake to run an Orchestrator, which is slashed in the event of malicious activity. These Orchestrators run a Bitcoin node, a Botanix EVM node and a Spiderchain node, ensuring the integrity of peg-ins and peg-outs and verifying other Orchestrators are acting honestly.&nbsp;","Peg-ins result in the creation of a new multisig wallet managed by a random subset of active Orchestrators, with one Orchestrator chosen to manage each epoch (one Bitcoin block). This management of funds by dynamic stakers contrasts the static consortium model of federated multisig sidechains and the dynamic miner signing model of drivechains, Lopp added.","<a href=\"https:\/\/botanixlabs.xyz\/en\/home\" data-v-f87c67ca=\"\">Botanix<\/a> uses a Proof-of-Stake consensus model, leveraging Bitcoin's Proof-of-Work system to counterbalance potential centralization vulnerabilities, Lopp said, adding that the security model is robust, provided a majority of Orchestrators act honestly. However, it also means stakers do not receive any base fee rewards and can only collect transaction fees.","While Spiderchain presents an interesting solution, it's not without issues, Lopp pointed out. Questions arise around UTXO management, Orchestrator reliability and potential attack vectors. If anyone staked more than 50% of the funds pegged into the network, a Spiderchain multisig contained an adversarial quorum of 33% or a significant Bitcoin reorg occurred, the security model could fail, and the peg become broken, Lopp warned. Moreover, the cost and complexity of launching such sidechains remain a concern.","However, to avoid silent malicious majority attacks, Spiderchain plans to be bootstrapped over several phases, with the initial phase being composed of centralized Botanix-controlled Orchestrators, becoming more decentralized over time.","After a decade of research into permissionless sidechain pegging, Lopp argues there are only two viable options: federated models or a pool of pegged bitcoin.","Federated sidechains distribute trust among a large number of reputable entities. Pegged pools in drivechains create incentives for miners to manage the bitcoin, while Spiderchain pools incentivize stakers. Each model has its own trade-offs, Lopp added. But ultimately, the test will come from performance under real-world conditions.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"-1.033%","content":"PERCENT"},{"type":"$4 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"33%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Lopp","content":"PERSON"},{"type":"Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC","content":"ORGANIZATION"},{"type":"Spiderchain multisig","content":"ORGANIZATION"},{"type":"-0.77%","content":"PERCENT"},{"type":"Ethereum","content":"PERSON"},{"type":"Ethereum Virtual Machine compatibility","content":"ORGANIZATION"},{"type":"Casa CTO","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Casa CTO Jameson Lopp","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["BITCOIN","ETHEREUM","SIDECHAINS"],"authors":["James Hunt","The Block"]}