{"summary":"Matrixport, a spin-off from Bitmain, is launching a crypto derivatives exchange. The exchange will offer both futures and options products.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/72970\/matrixport-crypto-derivatives-exchange","publishDate":"2020-07-27T09:01:41","id":5972,"type":null,"title":"Bitmain spin-off Matrixport is launching a crypto derivatives exchange","category":["EXCHANGES"],"content":["Crypto financial services firm Matrixport, a spin-off from Bitmain, is venturing into the derivatives business.","Revealed exclusively to The Block, Singapore-based Matrixport said that it is launching Bit.com, a crypto derivatives exchange, which will offer both futures and options products. The exchange said it would first list a bitcoin (BTC)\/ U.S. dollar (USD) perpetual swap on August 3 and then will launch BTC options on August 17.","The launch of Bit.com comes at a time when the bitcoin derivatives market is growing faster than the spot market, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/67497\/bitcoin-derivatives-market-is-growing-faster-than-spot-market-suggesting-rising-institutionalization-in-the-space\" data-v-f87c67ca=\"\">as The Block reported<\/a> last month.&nbsp;In an interview, Matrixport COO Daniel Yan, who was previously a forex options trader at Merrill Lynch, predicted that the crypto derivatives market, especially options, is poised to grow \"30 to 100 times in the next five years.\"","\"So it's not too late to get into this market,\" said Yan.","The crypto options market is currently <a href=\"https:\/\/www.theblockcrypto.com\/post\/55519\/deribits-crypto-options-market-share-still-dwarfs-competitors-amid-ecosystem-growth\" data-v-f87c67ca=\"\">dominated by Deribit<\/a>, which possesses more than 85% of the current market share. Yan said having one professional exchange in the market is \"definitely not enough.\"","Further, there are some \"pain points\" of users that are not yet addressed by Deribit, Yan argued. \"One is liquidity. Deribit does not provide substantial liquidity. Another thing is Deribit has not given enough benefits for users to grow with it.\"","Yan went on to contend that Bit.com would \"substantially\" improve the liquidity of the options market. On the benefits point, he told Bit.com would take a different approach so that both retail and institutional users grow with it. Yan declined to provide specific details, saying that it should be revealed in the next few months.","The futures market is already 500 times bigger than the options market, as The Block has reported previously. Hence, it is not expected to grow as fast as the options market, Yan told The Block, but Bit.com wants to give traders the ability to trade futures as well.","Overall, Bit.com isn't looking to beat market leaders Deribit and BitMEX. Yan said the exchange wants to grow the crypto derivatives market together with the two leading exchanges. Bit.com won't serve residents of the U.S., Japan, and other restricted countries.","There are currently about 50 people working for Bit.com from Matrixport, which currently employs around 160 people. Since its founding last year by Jihan Wu, Matrixport offers crypto trading, lending, and custody services, and according to Yan, Matrixport has about 30,000 registered users in total.","In March, it was reported that Matrixport was looking <a href=\"https:\/\/www.theblockcrypto.com\/post\/57730\/jihan-wus-matrixport-plans-to-raise-40m-at-a-post-money-valuation-of-300m-report\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">to raise $40 million<\/a> at a post-investment valuation of $300 million. Yan told The Block that the firm did raise a Series B after March, but didn't publicly announce the move. He declined to share the amount raised or valuation details but said that Matrixport had raised $40 million in total to date, including a Series A. Matrixport also told The Block that the $300 million figure was misreported.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Matrixport COO Daniel Yan","content":"PERSON"},{"type":"Matrixport","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Matrixport","content":"PERSON"},{"type":"August 3","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$40 million","content":"MONEY"},{"type":"Bitmain","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Yan","content":"ORGANIZATION"},{"type":"85%","content":"PERCENT"},{"type":"Japan","content":"LOCATION"},{"type":"August 17","content":"DATE"},{"type":"March","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"Merrill Lynch","content":"ORGANIZATION"},{"type":"A. Matrixport","content":"PERSON"},{"type":"Deribit","content":"LOCATION"},{"type":"Jihan Wu","content":"PERSON"},{"type":"$300 million","content":"MONEY"}],"hashtag":["BITMEX"],"authors":["Yogita Khatri","The Block"]}