{"summary":"The liquid staking giant says it wants to bring staked ETH (stETH) to the Ethereum Layer 2 decentralized finance space.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/158154\/lido-to-launch-liquid-staking-on-ethereum-layer-2-networks","publishDate":"2022-07-18T11:29:17","id":5973,"type":null,"title":"Lido to launch liquid staking on Ethereum Layer 2 networks","category":["DEFI"],"content":["Lido Finance is set to debut liquid staking on several Ethereum Layer 2 networks, the platform <a href=\"https:\/\/blog.lido.fi\/lidos-steth-comes-to-layer-2\/\" data-v-f87c67ca=\"\">announced<\/a> on Monday.","Lido is a decentralized finance protocol (DeFi) for liquid staking of proof-of-stake cryptocurrencies. Liquid staking unlocks the value of staked crypto via staking derivative tokens that stakers can deploy on other DeFi protocols.","According to today’s announcement, Lido is bringing staked ETH (stETH) to Ethereum’s Layer 2 DeFi space. Staked ETH is the staking derivative token users receive in exchange for staking their ETH via Lido.","Lido has already integrated with both Aztec and Argent. The former is a privacy-focused Layer 2 network that uses zk-rollup while the latter is a Layer 2 wallet provider that uses zkSync.","Zk-rollup stands for zero-knowledge rollups and is a Layer 2 scalability solution that allows faster and cheaper transaction processing than on the Ethereum mainnet. ZkSync is an application of the zk-rollup technology.","Lido says its first foray into Layer 2 will begin by offering support for wrapped stETH (wstETH). With support for Aztec and Argent, zkSync users will be able to bridge and stake wsETH on supported Layer 2 networks. To bridge in crypto means to move coins across different networks.","Monday’s announcement also stated that Lido has plans to expand its Layer 2 footprint. These plans include allowing direct ETH staking on Layer 2 without bridging their assets back to the Ethereum mainnet.","Lido is already the <a href=\"https:\/\/www.theblockcrypto.com\/news+\/152516\/why-ethereums-dominant-liquid-staking-protocol-is-debating-whether-to-reduce-its-influence\" data-v-f87c67ca=\"\">dominant liquid staking platform on Ethereum<\/a>. The platform accounts for almost a third of all ether tokens staked on Ethereum 2.0. Lido Finance recently <a href=\"https:\/\/www.theblock.co\/post\/155070\/lido-community-strongly-against-limiting-its-ethereum-staking-dominance\" data-v-f87c67ca=\"\">voted against a proposal<\/a> to limit the protocol’s share of the ETH2 staking pool.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lido Finance","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Lido","content":"LOCATION"},{"type":"2023","content":"DATE"}],"hashtag":["ETHEREUM","LIDO FINANCE"],"authors":["Osato Avan-Nomayo","The Block"]}