{"summary":"Silvergate CEO Alan Lane is more bullish than ever on the crypto-friendly bank&#x27;s payments platform in this quarter&#x27;s earnings call.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/82326\/payments-network-remains-silvergates-ticket-to-rapid-growth-in-q3","publishDate":"2020-10-26T16:47:38","id":598,"type":null,"title":"Payments network remains Silvergate&#x27;s ticket to rapid growth in Q3","category":["INSTITUTIONAL INVESTORS"],"content":["Silvergate CEO Alan Lane is more bullish than ever on the crypto-friendly bank's payments platform in this quarter's earnings call. <a href=\"https:\/\/www.theblockcrypto.com\/post\/79999\/silvergate-payments-platform-billion-volume\" data-v-f87c67ca=\"\">Earlier this month<\/a> the Silvergate Exchange Network (SEN) exceeded $100 billion in transfer volumes just three years after its inception — and $36 billion of that amount was done in this quarter alone, according to the call.","The bank had a strong quarter across the board, and much of that was related to digital currency activity, according to Lane. The $36 billion in transfers this quarter eclipsed the amount transferred in all of 2019. From a quarter-to-quarter view, SEN completed 70% more transactions compared to the second quarter.&nbsp;","\"During the third quarter, bitcoin and other digital currencies saw strong price appreciation and an active trading environment, which we believe contributed to the increase in the number of transactions occurring on the SEN,\" said Lane.","","","<span data-v-f87c67ca=\"\">Source: The Block, Company Filings<\/span>","&nbsp;","<span data-v-f87c67ca=\"\">SEN growth also was paired with a rise in digital currency fee income, which grew from $2.4 million in Q2 to $3.3 million in Q3.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"These results clearly demonstrate the SEN's strong network effect and the need for digital currency investors to be on the SEN in order to efficiently transact in the digital currency ecosystem,\" said Lane.<\/span>","","","<span data-v-f87c67ca=\"\">Source: The Block, Company Filings<\/span>","&nbsp;","The growth of SEN is related to this quarter's increase in deposits. Digital currency deposits now sit at $2.1 billion, a $586 million increase this quarter. According to Lane, that's because customers maintained higher deposit balances to transact on the payments network. Silvergate now attributes more than 90% of its total deposit base to its digital asset servicing business.","","","<span data-v-f87c67ca=\"\">Source: The Block, Company Filings<\/span>","The number of digital asset customers has also risen, climbing to over 900 in a 23% increase from last year. Lane said the bank also has over 200 prospective clients.","Still, Silvergate is no longer the only one in the crypto banking game. JP Morgan is courting Silvergate customers and already banking a Silvergate client: Gemini. However, Lane said the competition from the traditional finance giant hasn't made an impact on deposits or overall business. Indeed, according to Lane, more competition isn't necessarily a bad thing.&nbsp;","\"Those exchanges really want to have multiple banking partners and multiple sources of liquidity. And nobody has the SEN other than Silvergate, and so we're basically seeing the same type of activity,\" said Lane. \"And when volumes increase across the ecosystem and volumes are increasing from other customers, we're seeing the same type of volume increases from those customers that JP Morgan is reportedly banking. So really no impact so far that we can see.\"","Meanwhile, SEN has paved the way for Silvergate's new loan product, SEN Leverage, which allows customers to obtain U.S. dollar loans collateralized by bitcoin. Lane said SEN Leverage is making \"significant progress\" and will conclude pilot program at the close of this quarter with approved lines of credit reaching $35.5 million. That's a jump from last quarter's $22.5 million.&nbsp;&nbsp;","\"We anticipate a long growth trajectory for SEN Leverage and will judiciously expand credit availability to our customers over time,\" said Lane.","However, Lane said for now the bank sees the product as bitcoin-only. While they're keeping an eye on other assets, there are no plans to expand beyond bitcoin. According to Lane, there's still a wealth of opportunity in BTC.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Silvergate","content":"ORGANIZATION"},{"type":"$3.3 million","content":"MONEY"},{"type":"70%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$586 million","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"Company Filings","content":"ORGANIZATION"},{"type":"$22.5 million","content":"MONEY"},{"type":"Alan Lane","content":"PERSON"},{"type":"$35.5 million","content":"MONEY"},{"type":"JP Morgan","content":"ORGANIZATION"},{"type":"Lane","content":"LOCATION"},{"type":"last quarter","content":"DATE"},{"type":"third quarter","content":"DATE"},{"type":"second quarter","content":"DATE"},{"type":"$2.1 billion","content":"MONEY"},{"type":"$36 billion","content":"MONEY"},{"type":"$2.4 million","content":"MONEY"},{"type":"this quarter","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Lane","content":"PERSON"},{"type":"23%","content":"PERCENT"},{"type":"SEN","content":"ORGANIZATION"},{"type":"SEN Leverage","content":"ORGANIZATION"},{"type":"$100 billion","content":"MONEY"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}