{"summary":"Jack Dorsey&#x27;s Block is asking developers to help it spur innovation in the Bitcoin mining sector with what it calls a &quot;mining development kit.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/217913\/block-solicits-feedback-for-bitcoin-mining-development-kit","publishDate":"2023-03-07T20:09:25","id":5983,"type":null,"title":"Block solicits feedback for bitcoin &#x27;mining development kit&#x27;","category":["COMPANIES"],"content":["Jack Dorsey's Block is soliciting developer feedback for what it calls a bitcoin \"mining development kit,\" which it says could unleash further innovation in the Bitcoin mining space and increase innovation, with a goal to reduce energy consumption.","The mining development kit, as so far envisioned in a <a href=\"https:\/\/www.mining.build\/the-mining-development-kit-unlocking-innovation-in-bitcoin-mining\/\" data-v-f87c67ca=\"\">blog post<\/a>, would be comprised of four parts: A Bitcoin mining hashboard, which would work with a controller board, and run on open-source firmware and software, and \"extensive reference materials and support documentation.\" Block has asked developers to weigh in on what they would like included in the first three components.&nbsp;","\"The intention behind the [mining development kit] is to provide developers with a suite of tools to help unlock creativity and innovation in bitcoin mining hardware,\" the company said in its blog post. \"We anticipate the [kit] being useful development projects focused on integrating bitcoin mining into various novel use cases — such as heating solutions, off-grid mining, home mining or intermittent power applications — as well as optimization of bitcoin mining hardware for traditional commercial mining operations.\"","Block did not specify when the suite would launch, but told developers to \"stay tuned.\" The company said it got \"overwhelmingly positive\" responses to CEO Jack Dorsey's 2021 <a href=\"https:\/\/twitter.com\/jack\/status\/1449110239442345995?ref=mining-build\" data-v-f87c67ca=\"\">tweet<\/a> that the company was considering building an open source mining suite and has been \"heads down building a team ever since.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Jack Dorsey","content":"PERSON"}],"hashtag":[],"authors":["Madhu Unnikrishnan","The Block"]}