{"summary":"MakerDAO has published a detailed roadmap for its five-phase Endgame plan that will lead to the introduction of a new blockchain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230518\/makerdao-roadmap-endgame-update","publishDate":"2023-05-11T17:54:47","id":5986,"type":null,"title":"MakerDAO unveils AI-fueled roadmap to new blockchain","category":["CRYPTO ECOSYSTEMS"],"content":["MakerDAO, the decentralized platform responsible for the DAI stablecoin, <a href=\"https:\/\/forum.makerdao.com\/t\/the-5-phases-of-endgame\/20830\" data-v-f87c67ca=\"\">published a broad roadmap<\/a> on Thursday for a major update <a href=\"https:\/\/www.theblock.co\/post\/229805\/makerdao-boosts-dai-lending-capabilities-via-spark-protocol-roll-out\" data-v-f87c67ca=\"\">dubbed Endgame<\/a>.","Designed to \"enhance efficiency, resilience, and participation,\" the update will use AI tools and apply them to \"open, scalable processes.\" The plan's short-term goal is to become the most widely-used stablecoin project within three years.&nbsp;","\"Endgame will streamline and parallelize the Maker Ecosystem, launching a new unified brand identity and the flagship release of 6 new SubDAOs that can be farmed by users and that will spearhead permissionless innovation and collateral allocation,\" MakerDAO co-founder Rune Christensen <a href=\"https:\/\/forum.makerdao.com\/t\/the-5-phases-of-endgame\/20830\" data-v-f87c67ca=\"\">said in a forum post<\/a>.","The upgrade will ultimately lead to the deployment of a new blockchain \"that is tightly coupled to Ethereum while increasing the governance security of the ecosystem and implementing the full range of advanced Endgame features and tokenomics,\" Rune added.","As a first step, a beta launch set to arrive within several months will focus on establishing a unified brand for the ecosystem.","While the Dai stablecoin and MKR governance token will not be altered, an upgrade to new versions currently being called NewStable and NewGovToken will be possible.","NewStable will be \"a new ERC20 wrapper of the same underlying stablecoin as Dai,\" while NewGovToken will be a \"a redenominated version of MKR with a larger supply.\"","\"Maker and Dai are established and trusted brands in the cryptocurrency space,\" Christensen wrote. \"Unfortunately they have drawbacks, including having two separate brands rather than a single cohesive concept. The Endgame transition is the ideal time to fix this fundamental issue.\"","Following the beta, a second phase will see the launch of six so-called SubDAOs that will function as \"born-decentralized, specialized divisions within MakerDAO.\"","The plan aims to remove costs and complexity related to daily operations and delegate away \"the bulk of complexity and risk.\"","A third phase will see the introduction of AI tools for governance monitoring and improvement, while a fourth phase will launch a program for governance incentives.&nbsp;","A fifth and final phase will see the deployment of a new blockchain, currently being called NewChain.","The chain will have the ability to use hard forks as a governance mechanism, and it will also have features that optimize it \"as a backend for AI-assisted DAO governance processes and AI tool users, including smart contract generation, state rent and in-protocol MEV capture.\"","\"The launch of NewChain will be the last step in the Endgame launch process, and once it is deployed MakerDAO will permanently enter the Endgame State where further major changes are impossible, and its core processes and balance of power remain decentralized, self-sustainable and immutable forever,\" Christensen said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Christensen","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"NewStable","content":"ORGANIZATION"},{"type":"NewChain","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Endgame State","content":"ORGANIZATION"},{"type":"Rune Christensen","content":"PERSON"},{"type":"NewGovToken","content":"ORGANIZATION"},{"type":"Dai","content":"ORGANIZATION"}],"hashtag":["DAI"],"authors":["Nathan Crooks","The Block"]}