{"summary":"The Philippines SEC has warned that Binance is not registered in the country and operates without necessary licenses.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265113\/binance-philippines-sec-warning","publishDate":"2023-11-29T05:03:14","id":5990,"type":null,"title":"Binance operates without license in the Philippines, warns country&#x27;s SEC","category":["EXCHANGES"],"content":["The Philippines Securities and Exchange Commission has warned the public against Binance, saying that the crypto exchange is not registered in the country and operates without the necessary license or authority.","Binance has been actively promoting its platform on social media websites to attract Filipinos for investment and trading, the SEC <a href=\"https:\/\/www.sec.gov.ph\/advisories-2023\/binancebinance-is-not-registered-as-a-corporation-in-the-philippines-and-operates-without-the-necessary-license-and-or-authority\/#gsc.tab=0\" data-v-f87c67ca=\"\">said<\/a> Tuesday, adding that it is not authorized to do so without required licenses.","The SEC further warned that individuals promoting Binance within the Philippines may face criminal liability under the Securities Regulation Code. They may be penalized with a maximum fine of five million pesos (around $90,260) or imprisonment of 21 years or both, the SEC added.","\"We acknowledge and respect the statement made by the Securities and Exchange Commission (SEC) of the Philippines,\" a Binance spokesperson told The Block. \"At Binance, we are committed to aligning with applicable local regulations. Under our new leadership, we have taken proactive steps to address the SEC's concerns.\"","The SEC has reportedly <a href=\"https:\/\/bitpinas.com\/regulation\/ph-sec-binance-advisory\/\" data-v-f87c67ca=\"\">decided to block Binance's website<\/a> and applications in the Philippines within three months, enabling local users to liquidate and withdraw their positions. Additionally, the SEC has reportedly requested Google and Meta to prohibit online advertisements from Binance in the country.","Kenneth Stern, who served as the general manager of Binance in the Philippines, departed from the crypto exchange this month, according to his <a href=\"https:\/\/www.linkedin.com\/in\/kenneth-stern\/\" data-v-f87c67ca=\"\">LinkedIn profile<\/a>. But the Binance spokesperson said Stern left the company in July, much before the SEC warning.","Binance, the world's largest cryptocurrency exchange, is now under the leadership of <a href=\"https:\/\/www.theblock.co\/post\/264776\/richard-teng-outlines-binance-vision-after-taking-over-from-ceo-cz\" data-v-f87c67ca=\"\">Richard Teng<\/a>, a former civil servant.","Last week, both Binance and its founder, Changpeng Zhao, <a href=\"https:\/\/www.theblock.co\/post\/253681\/changpeng-cz-zhao-steps-down-as-binance-ceo\" data-v-f87c67ca=\"\">pleaded guilty<\/a> to U.S. anti-money laundering and sanctions violations. As part of his guilty plea agreement to resolve the Department of Justice probe, Zhao resigned as CEO. Under the agreement, Binance is set to pay $4.3 billion in penalties, marking one of the largest such settlements in U.S. history, and Zhao will pay a $50 million fine. He faces up to 10 years jail term but is expected to get no more than 18 months under a plea deal.","As for Teng, he has emphasized collaborating with regulators worldwide to make sure the company follows high standards, fostering innovation while keeping users safe.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Philippines Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Teng","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"Binance spokesperson","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Zhao","content":"PERSON"},{"type":"Kenneth Stern","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Richard Teng","content":"PERSON"},{"type":"$90,260","content":"MONEY"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Zhao","content":"ORGANIZATION"},{"type":"Securities Regulation Code","content":"ORGANIZATION"},{"type":"Stern","content":"PERSON"},{"type":"the Philippines","content":"LOCATION"},{"type":"$4.3 billion","content":"MONEY"},{"type":"Binance","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":["ASIAN REGULATION","BINANCE"],"authors":["Yogita Khatri","The Block"]}