{"summary":"Binance.US has partnered with Unstoppable Domains to offer exclusive .BinanceUS domain names to its customers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228372\/binanceus-domain-name-unstoppable-domains-binance-polygon","publishDate":"2023-04-26T12:00:20","id":5991,"type":null,"title":"Binance US to offer branded web3 domain names on Polygon","category":["COMPANIES"],"content":["Binance.US, the American affiliate of the world's largest crypto exchange, has partnered with web3 domain name provider Unstoppable Domains to offer branded .BinanceUS addresses on Polygon.","The .BinanceUS domain names will be made available exclusively through the exchange's app in the coming weeks, Unstoppable Domains said Wednesday. For the first time, Unstoppable will also issue two-digit domain names for BinanceUS customers, such as 14.BinanceUS or 23.BinanceUS. It already also offers two-letter domain names.","\"People can sign up for the .BinanceUS waitlist immediately and we expect to start launching the domains in the coming weeks,\" <a href=\"https:\/\/www.theblock.co\/post\/217303\/unstoppable-domains-promotes-sandy-carter-to-chief-operating-officer\" data-v-f87c67ca=\"\">Sandy Carter<\/a>, chief operating officer and head of business development at Unstoppable Domains told The Block. \"We don't have a specific date as of now, but we'll keep the community posted.\"","Web3 domain names are registered on a blockchain network, making them decentralized and resistant to censorship. They simplify the process of sending and receiving cryptocurrencies, as users can leverage a human-readable web3 domain name (like yogita.crypto) instead of a long hexadecimal wallet address.","With .BinanceUS domains, the exchange's customers will be able to buy, sell and send cryptocurrencies within its app. Meanwhile, Unstoppable Domains customers will be able to use Binance.US to withdraw crypto to any Unstoppable domain, including their .crypto and .nft domains.","There are more than 3.4 million web3 domains minted with Unstoppable and any of them can be used on Binance.US.","Founded in 2018, <a href=\"https:\/\/www.theblock.co\/post\/159736\/unstoppable-domains-clinches-unicorn-status-in-65-million-series-a-round\" data-v-f87c67ca=\"\">Unstoppable Domains is a billion-dollar company<\/a> backed by investors, including Pantera Capital and Coinbase Ventures. Its closest competitor, Ethereum Name Service (ENS), provides .eth domain names — like <a href=\"https:\/\/twitter.com\/VitalikButerin\" data-v-f87c67ca=\"\">vitalik.eth<\/a> — and has minted over 2.7 million domains.","While unlike ENS mints all its domain names on Ethereum, Unstoppable Domains uses Polygon. Given gas fees are involved on Ethereum, ENS names can be costly. Unstoppable's domain names have no gas or renewal fees, according to its website.","As for .BinanceUS domain names, they will be able to purchase for as little as $10, Carter said. While Unstoppable domains are minted on Polygon, any self-custodied Unstoppable domain can be bridged to Ethereum if preferred, according to Carter. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"This is the first time Binance.US is launching a digital identity to their community,\" Nandini Maheshwari, vice president of business development at Binance.US, told The Block. \".BinanceUS domains will simplify the crypto experience for our community and enable users to take ownership of their digital identities.\"","Binance.US, however, is not the first company Unstoppable has partnered with for branded domains. It also works with Polygon Labs and Blockchain.com to offer <a href=\"https:\/\/www.theblock.co\/post\/219619\/unstoppable-domains-releases-web3-domain-names-for-polygon-blockchain\" data-v-f87c67ca=\"\">.polygon<\/a> and .blockchain domain names, Carter said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Carter","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$10","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"ENS","content":"ORGANIZATION"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"Nandini Maheshwari","content":"PERSON"},{"type":"Ethereum Name Service","content":"ORGANIZATION"},{"type":"Unstoppable Domains","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"Sandy Carter","content":"PERSON"},{"type":"Polygon Labs","content":"ORGANIZATION"}],"hashtag":["BINANCE","DECENTRALIZED INFRASTRUCTURE"],"authors":["Yogita Khatri","The Block"]}