{"summary":"Northern Data has secured a $610 million debt financing facility from Tether to expand its Bitcoin mining, AI and data center operations.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/260647\/tether-northern-data-600-million-unsecured-loan-facility-bitcoin-mining","publishDate":"2023-11-02T09:57:36","id":5994,"type":null,"title":"Tether extends debt financing to Northern Data capped at $610 million","category":["DEALS"],"content":["Northern Data Group, a German data center operator, has secured a debt financing facility of up to €575 million ($610 million) from Tether Group, the stablecoin issuer, to expand its Bitcoin mining, AI, and data center operations.","“Northern Data Group entered into a loan agreement with a company of the Tether Group, under which it secured a €575 million debt financing facility,” Northern Data wrote in a <a href=\"https:\/\/www.eqs-news.com\/news\/corporate\/northern-data-group-secures-eur-575-million-debt-financing-facility\/1930407\" data-v-f87c67ca=\"\">statement<\/a>. “The facility is unsecured, at standard market conditions and has a term until Jan. 1, 2030.”","\"As the demand for technological innovation and acceleration shows no signs of slowing down, this debt facility will allow Northern Data Group to continue capitalizing on the market opportunities within each sector of our three subsidiaries, Taiga Cloud, Ardent Data Centers and Peak Mining,\" Northern Data CEO Aroosh Thillainathan added. \"We’re excited for the further innovation we will achieve through this raise as we drive further progress in the AI, ML and Generative AI industries.”","Peak Mining is the group’s mining business, with the financing being used to scale its Bitcoin mining operations via purpose-built MicroBT liquid-cooling mining technology. Liquid-cooled mining offers more efficient heat management and potentially higher hardware performance compared to traditional air-cooled mining. However, it typically involves higher setup costs and more complex maintenance.","Peak Mining previously <a href=\"https:\/\/eqs-cockpit.com\/cgi-bin\/fncls.ssp?fn=redirect&amp;url=2b3d015ebe8ec2add647be3039c7b614&amp;application_id=1763035&amp;site_id=news_data&amp;application_name=news\" data-v-f87c67ca=\"\">signed<\/a> a contract with MicroBT in September — worth $150 million — for over 7 Exahashes of the latest generation WhatsMiners, making it one of the world's largest Bitcoin miners. The new financing will also be used to acquire sophisticated Nvidia AI hardware, enabling Northern Data’s Taiga Cloud business to expand its generative artificial intelligence cloud services.","Finally, the facility will be used to grow the group’s portfolio of Ardent Data Centers, the company said.","“Tether Group is proud to support Northern Data Group in its ability to provide customers access to flexible, energy efficient high performance computing infrastructure,\" Tether Group incoming CEO Paolo Ardoino said.","This loan facility, capped at 575 million EUR, is intended to be drawn over the next year. It will be covered using the company's profits and will not be part of Tether's stablecoin consolidated reserves. The transaction is facilitated through a separate investment vehicle within Tether Group to ensure segregation, Ardoino told The Block in a statement.","\"As publicly disclosed in our reports, Tether has been achieving an average of ~1B per quarter in net operating results as reported over the last quarters and the project remains the same going forward, due to the high interest rates on US T-Bills,\" Ardoino said. \"A significant portion of these profits has been prudently retained within our reserves, contributing to the accrual of excess reserves. This strategy has enabled us to overcollateralize our stablecoins by as much as 104%.\"","\"Additionally, as part of our disclosed plans, a minor portion of these profits will be strategically reinvested in data, energy and P2P communications infrastructure,\" he added.","Prior to this loan agreement, Tether made a <a href=\"https:\/\/www.theblock.co\/post\/252360\/tether-makes-strategic-investment-in-northern-data-group\" data-v-f87c67ca=\"\">strategic investment<\/a> in Northern Data in September to collaborate on AI, communication and data storage initiatives.&nbsp;","\"This investment is significant for Tether as it demonstrates its determination to support emerging technology,\" Tether wrote in a <a href=\"https:\/\/tether.to\/en\/tether-makes-strategic-investment-into-northern-data-group-set-to-become-the-biggest-independent-ai-player-in-europe\/\" data-v-f87c67ca=\"\">statement<\/a> at the time. The investment was for an undisclosed amount.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$610 million","content":"MONEY"},{"type":"Taiga Cloud","content":"ORGANIZATION"},{"type":"Northern Data’s Taiga Cloud","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Nvidia","content":"ORGANIZATION"},{"type":"104%","content":"PERCENT"},{"type":"Northern Data Group","content":"ORGANIZATION"},{"type":"Ardent Data Centers","content":"ORGANIZATION"},{"type":"Ardoino","content":"PERSON"},{"type":"Jan. 1, 2030","content":"DATE"},{"type":"\" Northern Data","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Northern Data","content":"ORGANIZATION"},{"type":"Tether Group","content":"ORGANIZATION"},{"type":"Paolo Ardoino","content":"PERSON"},{"type":"” Northern Data","content":"ORGANIZATION"},{"type":"$150 million","content":"MONEY"}],"hashtag":["BITCOIN","MINING COMPANIES","TETHER"],"authors":["James Hunt","The Block"]}