{"summary":"The IRS said the pair will help lead efforts in &quot;building service, reporting, compliance and enforcement programs focused on digital assets.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279500\/irs-sulolit-mukherjee-seth-wilks-hires","publishDate":"2024-02-28T04:21:24","id":6000,"type":null,"title":"IRS hires two private-sector experts for help lead crypto-tax efforts","category":["TAX"],"content":["The Internal Revenue Service hired two private-sector experts — Sulolit “Raj” Mukherjee, JD, and Seth Wilks, CPA — as executive advisors to assist the United States’ tax authority’s efforts pertaining to crypto and digital assets, the agency announced yesterday.","The IRS <a href=\"https:\/\/www.irs.gov\/newsroom\/irs-adds-two-key-experts-to-focus-on-cryptocurrency-other-digital-assets\" data-v-f87c67ca=\"\">said<\/a> the pair would help lead the agency’s efforts in “building service, reporting, compliance, and enforcement programs focused on digital assets.”","Mukherjee is joining the IRS from a private blockchain software technology company where he was Global Head of Tax. The agency noted that he has more than ten years of experience in tax compliance and tax information reporting for financial institutions.","Wilks, on the other hand, joins the IRS after six years of working in \"the digital asset tax policy space\" and prior extensive work \"with tax compliance and planning issues related to multinational corporations and manufacturing, with a focus on complex supply chains, transfer pricing and cross-border transactions.\"","“Seth and Raj expand our ability to understand this sector while designing systems for reporting of cryptocurrency and digital assets and related transactions,” IRS Deputy Commissioner of Services and Enforcement Doug O'Donnell said, adding: “Improving employee capacity and access to tools in this rapidly evolving global landscape is a top IRS priority.”","The Internal Revenue Service explicitly mentioned its somewhat controversial funding from the Inflation Reduction Act, which is self-reportedly being used \"on a variety of taxpayer service and technology improvements as well as expanding enforcement efforts in complex, high-wealth areas where there are compliance concerns.\"","The IRS also explicitly mentioned its John Doe summons efforts as part of its focus. Perhaps most notably, crypto exchange Kraken was <a href=\"https:\/\/www.forbes.com\/sites\/kellyphillipserb\/2023\/11\/08\/kraken-to-release-account-data-for-certain-crypto-clients-to-irs\/\" data-v-f87c67ca=\"\">forced<\/a> to turn over information of certain American users after a lengthy legal battle that began in 2021.","“This is a complex and evolving sector that has major tax administration implications,” IRS Commissioner Danny Werfel stated, adding: “It’s important we get this right for taxpayers and the nation.\"","\"Pulling in expertise from the private sector to work with the IRS team is critical to successfully building the agency’s efforts involving digital assets and helping us do it in a way that works well for everyone,\" he explained.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Danny Werfel","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Internal Revenue Service","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Seth Wilks","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"” IRS Deputy Commissioner of Services","content":"ORGANIZATION"},{"type":"John Doe","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Kraken","content":"PERSON"},{"type":"IRS","content":"ORGANIZATION"},{"type":"Seth","content":"PERSON"},{"type":"Raj” Mukherjee","content":"PERSON"},{"type":"Raj","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Doug O'Donnell","content":"PERSON"}],"hashtag":["IRS"],"authors":["Adam James","The Block"]}