{"summary":"The Avalanche Foundation announced incentives worth $4 million for decentralized trading platform GMX.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/183700\/avalanche-foundation-unveils-4-million-incentive-program-for-trading-platform-gmx","publishDate":"2022-11-07T10:57:49","id":6001,"type":null,"title":"Avalanche Foundation unveils $4 million incentive program for trading platform GMX","category":["DEFI"],"content":["<span data-contrast=\"none\" data-v-f87c67ca=\"\">The Avalanche Foundation is providing incentives worth $4 million in AVAX tokens for the decentralized trading platform GMX.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">The incentives come from Avalanche Rush, an $180 million liquidity incentivization program that aims to increase liquidity and users for decentralized finance (DeFi) applications on its smart contract platform. <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:0,&quot;335551620&quot;:0,&quot;335559685&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">GMX is a decentralized exchange that offers spot and perpetual futures contracts on Avalanche and another scaling protocol, Arbitrum.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:0,&quot;335551620&quot;:0,&quot;335559685&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The $4 million in AVAX tokens will be distributed over a multi-month timeframe, as well as with partner platforms building on top of GMX, the Avalanche Foundation said in a statement. Partner platforms include exchanges TraderJoe, YieldYak and Dopex.","GMX utilizes a different token model compared to other DEXs that aims to minimize impermanent loss for liquidity providers, which is a growing concern given that it has caused over <a href=\"https:\/\/twitter.com\/thiccythot_\/status\/1589022229983293440?s=20&amp;t=ZgZRLykPXopYhAphLMHfLQ\" data-v-f87c67ca=\"\">$100 million in losses<\/a> for LPs in October alone.","The caveat with GMX’s model is that instead of impermanent loss, liquidity providers take on the risk of losing capital if traders on GMX are profitable. When traders lose money or are liquidated, this generates fees that are paid out to liquidity providers for taking the other side of the trade. Conversely, if traders make money, liquidity providers are the ones who take the hit.","The incentive program offsets some of the risk associated with providing liquidity on GMX and enables partner protocols to build new types of products on top of the revenue model GMX uses. With $4 million being paid out over the course of a few months, users could be more inclined to provide liquidity on GMX and utilize the new products partner platforms are building.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Avalanche Foundation","content":"ORGANIZATION"},{"type":"$4 million","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"GMX","content":"ORGANIZATION"},{"type":"$180 million","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"AVAX","content":"ORGANIZATION"}],"hashtag":["AVALANCHE"],"authors":["Mike Truppa","The Block"]}