{"summary":"Clients of Silvergate, the popular La Jolla, California-based bank known for servicing cryptocurrency firms, reported issues with certain money wires to","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/59457\/silvergates-clients-experience-outbound-wire-transfer-issues-tied-to-problems-with-fedwire-payments-processor","publishDate":"2020-03-20T18:27:07","id":6012,"type":null,"title":"Silvergate&#x27;s clients experience outbound wire transfer issues tied to problems with Fedwire payments processor","category":["MARKETS"],"content":["Clients of Silvergate, the popular La Jolla, California-based bank known for servicing cryptocurrency firms, reported issues with certain money wires to the firm, several sources told The Block.","In a message to The Block, Silvergate CEO Alan Lane said wiring issues were tied to an outage by its payment processor, Finastra, which sits between Silvergate and Fedwire, the real-time settlement network that connects the country's banks.&nbsp;","Silvergate, which counts major crypto exchanges like Gemini and Kraken among its clients, serves over 800 crypto-related clients with banking services, as per its <a href=\"https:\/\/www.theblockcrypto.com\/post\/54316\/silvergate-bank-crypto-clients-industry-fees\" data-v-f87c67ca=\"\">Q4 earnings report<\/a>. According to several industry sources spanning crypto exchanges and high-speed trading firms, clients have been unable to wire money to the firm. One source said that Silvergate is processing orders manually at the moment.&nbsp;","","","In an interview with The Block, Lane confirmed that there were issues with inbound payments from clients, but said outbound payments were being processed manually through its backup \"secondary processing plans.\"","\"We had 60-70% of the staff working remotely earlier this week,\" he said. \"Thankfully, mostly only the wire desk is showing up now.\"","Approximately $200 million wire transfers were sitting at the Fed waiting for completion.","“It is painful, I don’t want to minimize it,” he said of the situation, noting, specifically, the impact on his trading firm clients.","\"Our trading partners send us money on Friday so they have funds on the platform ready to transfer to OTC desks over the weekend in case there are opportunities over the weekend to trade,\" he said. \"But for those folks with money on the platform, their accounts are working and are just fine.\"","\"While we are obviously extremely disappointed with our service provider, it is important for all existing Silvergate clients to know: Their funds are safe,\" he said.&nbsp;","Lane said its SEN platform, which is a network of digital currency exchanges and investors, was unaffected by the issues with its Fedwire payments processor. He said a similar situation had happened once before with a former payments processor.&nbsp;","Silvergate's customer base has grown 40% year-to-date, spanning crypto exchange-operators (Gemini, Bitstamp, Paxos), institutional investors (Blocktower, Polychain Capital) and other customers such as SoFi, Mike Cagney's Figure and Kiva.","","","Silvergate was up as much as 30% since its initial public offering on the New York Stock Exchange. Since the coronavirus, it's now down 25%.","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Silvergate","content":"ORGANIZATION"},{"type":"70%","content":"PERCENT"},{"type":"Fed","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"weekend","content":"DATE"},{"type":"New York Stock Exchange","content":"ORGANIZATION"},{"type":"Finastra","content":"ORGANIZATION"},{"type":"Kiva","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"Alan Lane","content":"PERSON"},{"type":"California","content":"LOCATION"},{"type":"OTC","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"Mike Cagney","content":"PERSON"},{"type":"Bitstamp","content":"LOCATION"},{"type":"$200 million","content":"MONEY"},{"type":"Friday","content":"DATE"}],"hashtag":[],"authors":["Frank Chaparro","Ryan Todd","The Block"]}