{"summary":"While down from the previous jump of 9.26%, the difficulty rise represents the fourth positive adjustment in a row. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/169793\/bitcoin-mining-difficulty-hits-another-record-up-3-45","publishDate":"2022-09-13T17:46:22","id":6015,"type":null,"title":"Bitcoin mining difficulty hits another record, up 3.45%","category":["MINING"],"content":["Bitcoin's mining difficulty increased by 3.45%, down from the previous jump of 9.26% but the fourth positive adjustment in a row.&nbsp;","The change since Aug. 31 is reflected in <a href=\"https:\/\/explorer.btc.com\/stats\/diff\" data-v-f87c67ca=\"\">data published<\/a> by BTC.com, which tracks network mining difficulty and posts an update as adjustments take place roughly every two weeks.&nbsp;","The mining difficulty had fallen significantly earlier this summer as bitcoin miners turned off their machines in response to conservation demands during peak power demand due to extreme heat.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoins-hash-rate-daily\/embed\" title=\"Bitcoin's Hash Rate (EH\/s, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Mining difficulty refers to the complexity of the process behind mining, during which miners are repeatedly trying to find a hash below a set level. Miners that \"discover\" this hash win the reward for the next transaction block. The difficulty adjusts every 2,016 blocks (roughly every two weeks) in sync with the network's hash rate.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"9.26%","content":"PERCENT"},{"type":"3.45%","content":"PERCENT"},{"type":"summer","content":"DATE"},{"type":"Aug. 31","content":"DATE"}],"hashtag":[],"authors":["Larry DiTore","The Block"]}