{"summary":"Fewer than three dozen Coachella NFTs have been minted, with just seven unique owners.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283684\/no-one-seems-to-want-1200-coachella-nfts-that-double-as-vip-passes","publishDate":"2024-03-20T12:35:45","id":6016,"type":null,"title":"No one seems to want $1,200 Coachella NFTs that double as VIP passes","category":["CORPORATE NFTS"],"content":["With the first weekend of Coachella less than a month away, tickets for the three-day music festival in the California desert are once again a hot commodity—except for those attached to NFTs.&nbsp;","Since Coachella announced it more than two weeks ago, over 1,000 NFTs that double as VIP passes to this year's event have been offered for sale, packaged with some exclusive access to the \"Oasis Lounge.\" However, the initiative has performed terribly. About 3% of the tokens on offer have been minted thus far.","Teaming up with NFT marketplace OpenSea, Coachella launched an initial collection of 1,024 non-fungible tokens that also serve as VIP passes with special perks. Only 34 of the NFTs created have been minted, according to OpenSea data.&nbsp;","\"The VIP Pass + Oasis Lounge Keepsake by Coachella is an NFT that grants holders one VIP ticket to the 2024 Coachella Valley Music and Arts Festival as well as access to the Oasis Lounge — an exclusive lounge + bar inside the festival grounds’ VIP section,\" according to the description of the collection published on OpenSea.","\"The collection offers a VIP access ticket and access to a special lounge with unique amenities, and additional events on top of that. We’re excited about the value of the collection,\" <span class=\"il\" data-v-f87c67ca=\"\">Coachella<\/span>'s innovation lead Sam Schoonover said in an emailed statement to The Block a few days after the launch.","The NFTs are listed for approximately $1,269 and minted on Avalanche. Consumers can purchase them using crypto or their debit card. This year's Coachella festival will feature performances from popular musical acts like Lana Del Rey, Blur and Tyler, The Creator.&nbsp;","OpenSea data shows fewer than three dozen NFTs have been minted, with just seven unique owners. The NFTs that have been minted also don't appear to belong to average consumers, according to an OpenSea spokesperson. \"The teams elected to set the drop live ahead of its dedicated marketing push to do a collaborative team mint for stakeholders that will be participating in the onsite Oasis Lounge activation, which drove the initial mints,\" OpenSea said a few days after the launch of the collection.&nbsp;","The \"dedicated marketing push\" was slated to begin last week. OpenSea also said it \"has been working with Coachella on coordinating the exceptional benefits of Oasis Lounge, which will include complimentary food &amp; drinks, art displays, and air-conditioning,\" according to a company spokesperson.","Contrasting the Coachella NFTs generating very little interest, it appears there is no shortage of demand for traditional ticket options. On Coachella's website, it says that the first weekend of the festival, including both general admission and VIP tickets, is sold out. Coachella's first weekend takes place over the April 12 to 14 weekend. Another three days of music kicks off on April 19.","This has been Coachella's second high-profile foray into NFTs. A little over two years ago, the <a href=\"https:\/\/www.theblock.co\/linked\/132706\/coachella-partners-with-ftx-us-to-launch-nfts\" data-v-f87c67ca=\"\">festival partnered<\/a> with now-defunct FTX to launch a series of collectible NFTs. At one point, Coachella also <a href=\"https:\/\/www.theblock.co\/post\/258007\/ftx-agreed-to-pay-riot-games-nearly-100-million-while-tomorrowland-and-coachella-also-had-big-deals-sbf-trial-evidence\" data-v-f87c67ca=\"\">signed a $25 million deal<\/a> with FTX, which famously paid large sums of money to sports stars and celebrities to promote its crypto exchange.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lana Del Rey","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"3%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Coachella Valley Music","content":"ORGANIZATION"},{"type":"$1,269","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"April 19","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"VIP","content":"ORGANIZATION"},{"type":"Coachella","content":"ORGANIZATION"},{"type":"Tyler","content":"PERSON"},{"type":"April 12 to 14 weekend","content":"DATE"},{"type":"California","content":"LOCATION"},{"type":"Sam Schoonover","content":"PERSON"},{"type":"two weeks ago","content":"DATE"},{"type":"OpenSea","content":"PERSON"},{"type":"$25 million","content":"MONEY"},{"type":"OpenSea spokesperson","content":"ORGANIZATION"},{"type":"Coachella","content":"LOCATION"}],"hashtag":["UTILITY NFT"],"authors":["RT Watson","The Block"]}