{"summary":"2023 has seen crypto and traditional markets transition from stagnant to bullish after a long winter. Through it all, Bitcoin continued to prove its","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267120\/the-state-of-bitcoin-in-2023","publishDate":"2023-12-13T08:31:51","id":6017,"type":null,"title":"The State of Bitcoin in 2023","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">2023 has seen crypto and traditional markets transition from stagnant to bullish after a long winter. Through it all, Bitcoin continued to prove its fundamental value while expanding its utility. Over the past twelve months, builders have expanded the functionality and efficiency of the network through numerous innovations and developments. A non-exhaustive list of new developments: improvements in scaling networks such as Lightning, Ordinals and BRC-20s, Taproot Assets, and growth in Bitcoin DeFi. This activity represents a wave of growth expanding Bitcoin’s capabilities while staying true to its decentralized ethos.<\/span>","<a href=\"https:\/\/thesis.co\/blog\/state-of-bitcoin-2023\/\" data-v-f87c67ca=\"\"><img class=\"wp-image-267457  aligncenter\" src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/12\/Newsletter-Banner-Link-Final-800x400.png\" alt=\"\" width=\"644\" height=\"322\" data-v-f87c67ca=\"\"><\/a>","<span data-v-f87c67ca=\"\">Bitcoin is becoming more versatile and user-friendly too. River Financial and other services reimagine Bitcoin as an intuitive financial instrument while emphasizing security and self-custody. Gaming platforms like Zebedee pioneer new monetization models rewarding players, while mainstream apps like Lolli and Fold offer cashback rewards to normalize everyday usage. And, of course, the approval of Bitcoin ETFs stands to unleash a flood of investment in the near future.<\/span>","<a href=\"https:\/\/thesis.co\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Thesis<\/span><\/a><span data-v-f87c67ca=\"\">, <\/span><span data-v-f87c67ca=\"\">a Web3 Venture Studio investing in and building at the forefront of Bitcoin infrastructure and consumer applications,<\/span><span data-v-f87c67ca=\"\"> has compiled <\/span><a href=\"https:\/\/thesis.co\/blog\/state-of-bitcoin-2023\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The State of Bitcoin 2023<\/span><\/a><span data-v-f87c67ca=\"\">, to synthesize this year’s events for investors and users.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The report is a deep dive into the innovations accelerating the network’s growth, backed by unique stats and analysis. Below is a summary of the report that outlines some of the ways Bitcoin is poised to grow as a store of value, a means of exchange, and a powerful tool.<\/span>","<b data-v-f87c67ca=\"\">A year of improving market fundamentals<\/b>","<span data-v-f87c67ca=\"\">The first thing most people look to when diagnosing the health of Bitcoin is the market. While 2023 was a volatile time overall, the year ended with strong fundamentals. BTC’s current rally has seen prices topping $40,000 and climbing.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The rise in small account balances demonstrates broad participation from mainstream retail investors (0.1 BTC-0.01 BTC). Long-term holders have taken advantage of dips in the market to expand their positions. All told, this reflects renewed confidence on the part of long-time believers, at the same time as many are acquiring BTC for the first time.<\/span>","<b data-v-f87c67ca=\"\">Scaling BTC<\/b>","<span data-v-f87c67ca=\"\">A major challenge for the Bitcoin network has been its slow transaction speeds. 2023 saw positive movement in this area with the growth of layer-2 (L2) networks. L2s have been popular on other chains to process transactions more quickly. Their growth on Bitcoin promises to expand the network’s ability to handle large amounts of transactions, accelerating progress toward enhanced user experience and broader adoption.<\/span>","<span data-v-f87c67ca=\"\">This year has seen more than 5,400 BTC, worth more than $230 million<\/span><span data-v-f87c67ca=\"\">, flow through LN payment channels. Capacity surged from August 2018’s 1 BTC to today’s robust liquidity pools. Supporting this growth are over 70 LN-enabled wallets offered by leading providers like BlueWallet, Muun, and Phoenix. Adoption ranged from citizens of inflation-ravaged countries to global corporations.<\/span>","<span data-v-f87c67ca=\"\">In addition to Lightning, 2023 has seen great advances in rollups, which come in a few forms with unique attributes. UTXO Model Rollups mirror Bitcoin’s existing state architecture but add more data per transaction. Shielded Rollups enhance privacy by encrypting transaction details, displaying only ciphertext on-chain. The security model for rollups on Bitcoin is critical – they must leverage the network’s innate cryptography and consensus without regressing to multi-signature schemes.<\/span>","<b data-v-f87c67ca=\"\">Integrating with mainstream networks and use cases<\/b>","<span data-v-f87c67ca=\"\">Bitcoin’s expansion in capabilities was matched in 2023 by an acceleration of mainstream businesses and use cases on the network. Major retailers expedited LN's consumer reach in 2023. Payment leader Stripe unlocked Lightning for corporations via its \"Pay With Bitcoin\" checkout button. A Twitter integration lets users seamlessly reward quality content. In gaming, Zebedee brought fast Bitcoin transactions into multiplayer worlds like Minecraft and Fortnite.<\/span>","<b data-v-f87c67ca=\"\">The Rise of Ordinals<\/b>","<span data-v-f87c67ca=\"\">As the State of Bitcoin Report lays out in detail, one development garnered outsized attention this year: Ordinals, which turn individual satoshis into unique digital artifacts that can be inscribed with data such as text or images. This development leverages Bitcoin's existing blockchain infrastructure, marking a departure from traditional digital assets and NFTs.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The proof of demand for Ordinals is shown in the statistics: by December 2023, over 47M Ordinals were inscribed on Bitcoin by 263K users. Miners have also enjoyed the new use of the network, raking in a massive $150M in fees paid on $850M of volume on Ordinals marketplaces.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This year also saw the development of the BRC-20 protocol, which enables the creation and management of ordinals with enhanced functionality. BRC-20s have also seen high levels of demand.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">DeFi on BTC<\/b>","<span data-v-f87c67ca=\"\">Bitcoin has seen major advancements in supporting and connecting cross-chain decentralized finance (DeFi) projects. tBTC, developed by Threshold, is a tokenized version of Bitcoin on the Ethereum blockchain. It is designed to enable Bitcoin's integration into other blockchains, including Ethereum and Solana, facilitating Bitcoin's participation in DeFi applications.<\/span>","<span data-v-f87c67ca=\"\">tBTC operates on a decentralized model, utilizing a network of users and smart contracts. This structure allows it to function without centralized control, aligning with Bitcoin’s decentralized principles.<\/span>","<a href=\"https:\/\/twitter.com\/thesis_co\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Thesis<\/span><\/a><span data-v-f87c67ca=\"\"> is proud to be supporting Threshold’s development of a decentralized and scalable tokenized BTC. Check out <\/span><a href=\"https:\/\/twitter.com\/thesis_co\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">our Twitter<\/span><\/a><span data-v-f87c67ca=\"\"> for frequent updates and our <\/span><a href=\"https:\/\/thesis.co\/our-work\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">portfolio page<\/span><\/a><span data-v-f87c67ca=\"\"> for more insight into what we are building.<\/span>","<b data-v-f87c67ca=\"\">Outlook and the Road Ahead<\/b>","<span data-v-f87c67ca=\"\">2024 is poised to be a breakout year for Bitcoin. The most prominent near-term development is the likely approval of the first Bitcoin ETF, which promises a major wave of new investment. Other exciting developments include BitVM, a means to “compute anything on Bitcoin,” which proposes a new way to process smart contracts, improving functionality and allowing more complex transactions.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Be sure to read the full <\/span><a href=\"https:\/\/thesis.co\/blog\/state-of-bitcoin-2023\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">State of Bitcoin report<\/span><\/a><span data-v-f87c67ca=\"\">, which covers more developments in greater detail. It’s a comprehensive analysis that will give investors, users, and first-time buyers the knowledge and insight they need to confidently navigate the Bitcoin ecosystem.&nbsp;<\/span>","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Thesis <\/i><i data-v-f87c67ca=\"\">and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Road Ahead","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Lolli","content":"PERSON"},{"type":"State of Bitcoin","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"Lightning","content":"LOCATION"},{"type":"Fortnite","content":"ORGANIZATION"},{"type":"Minecraft","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"$230 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$850M","content":"MONEY"},{"type":"Phoenix","content":"LOCATION"},{"type":"Lightning","content":"ORGANIZATION"},{"type":"Muun","content":"PERSON"},{"type":"Bitcoin DeFi","content":"LOCATION"},{"type":"$150M","content":"MONEY"},{"type":"BRC","content":"ORGANIZATION"},{"type":"December 2023","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"$40,000","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"August 2018","content":"DATE"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}