{"summary":"Coinbase&#x27;s earnings report caught many observers by surprise. How could that have happened, given that its trading volumes are public?","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/135467\/calculating-coinbases-revenue-public-volumes","publishDate":"2022-02-25T16:10:17","id":6019,"type":null,"title":"Here&#x27;s why calculating Coinbase&#x27;s revenue is trickier than just looking at public volumes","category":["EXCHANGES"],"content":["Coinbase caught many observers by surprise on Thursday when it revealed that it had exceeded Wall Street's expectations for fourth-quarter revenue by nearly $500 million —&nbsp; a sound beat by most standards.","It also left some scratching their heads. \"I'm confused how they beat expectations by much, their volume is public,\" Sam Bankman-Fried, chief executive officer of rival exchange FTX, <a href=\"https:\/\/twitter.com\/SBF_FTX\/status\/1496962300997218304?s=20&amp;t=tqfOO6xTBvquplrrxiwugw\" data-v-f87c67ca=\"\">tweeted<\/a>.","Bankman-Fried's question is a good one. Since more than 90% of Coinbase's revenue comes from trading volumes, simply checking the data should theoretically give a good indication of the vast majority of the firm's bottom line. But the reality is more complicated.","In the fourth quarter of 2021, the firm facilitated $459 billion in trading volumes, according to data from CryptoCompare.&nbsp;","<a href=\"https:\/\/www.theblockcrypto.com\/post\/135467\/calculating-coinbases-revenue-public-volumes\/screen-shot-2022-02-25-at-4-26-10-pm\" rel=\"attachment wp-att-135550\" data-v-f87c67ca=\"\"><img class=\"alignnone wp-image-135550 size-full\" src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2022\/02\/Screen-Shot-2022-02-25-at-4.26.10-PM.png\" alt=\"\" width=\"1130\" height=\"796\" data-v-f87c67ca=\"\"><\/a>","To figure out how much Coinbase made from that figure, multiply it by the so-called take rate, which is the average fee from a Coinbase trade. Over the last year, Coinbase's take rate has hovered between 0.5% and 0.6%.&nbsp;","Assuming a take rate of 0.5% and volumes of $459 billion (numbers via CryptoCompare), the exchange's revenues hit $2.29 billion — which is much closer to Coinbase's reported revenue of $2.5 billion than Wall Street's expectation of $1.97 billion.","Still, there are some trading volumes that add another level of complexity to calculating Coinbase's revenue.","Bankman-Fried is correct that Coinbase publicly releases data on volumes. But in fact, the firm does not release all of its volumes. While the lion's share is made public via APIs ($459 billion), that figure does not capture Coinbase's total volume of $547 billion.","According to a spokesperson, the difference represents the volumes Coinbase brought in via institutional trading offerings: its over-the-counter trading desk and prime brokerage unit Tagomi. This quarter it amounted to $88 billion — an all-time high.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/public-companies\/coinbase-otc-and-tagomi-volumes\/embed\" title=\"Coinbase OTC and Tagomi Volumes\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","That blind spot, combined in the disparity in the fees that retail traders pay versus what institutional ones pay, could explain how Wall Street came up short.&nbsp;","According Will Nance, a Goldman Sachs research analyst focused on digital assets, the revenue expectation was low because Wall Street was expecting Coinbase to hit a lower take rate.","\"The strong beat was driven by increases in retail volumes, with retail transaction revenue coming in ~36% above consensus estimates, while institutional trading revenues were ~11% below consensus estimates,\" Nance wrote in a note to clients. \"Take rate also increased by ~9bps sequentially, contributing to the revenue beat.\"&nbsp;","One analyst who asked to remain anonymous because their employer does not allow them to talk to the media told The Block that Wall Street thought fees would come in lower because they would be more dominated by institutional trading. The fees that large traders pay to use Coinbase are much lower than users of its retail brokerage.&nbsp;","\"If retail interest goes down, it's their pro users that are more active on the platform and that's where the fees trend lower,\" the person said.&nbsp;","But retail interest did not wane. In fact, it surged by more than 90% quarter over quarter, contributing to a take rate of 0.54%.","John Todaro of Needham &amp; Company said that the firm's listing of Shiba might have contributed to the strong interest among retail clientele.&nbsp;","\"COIN's weighted average retail fees rebounded from Q3 QoQ declines to 123 basis points from 109.9 basis points in Q3,\" Todaro wrote in a note to clients. \"We believe this rebound was in part driven by new retail users on to the platform, primarily looking to trade Shiba Inu, which saw heightened retail demand in Q4 '21.\"","Elsewhere, Coinbase saw its subscription revenue growth exceed Wall Street's expectations by 21%.&nbsp;","As for the first quarter of 2022, Wall Street might assume a higher take rate given guidance that the mix between retail and institutions will stabilize, as Nance notes.","\"Lastly, the company noted that the mix of retail volume in 1Q had not changed significantly from 4Q, which we believe implies a more stable take rate in 1Q than investors were expecting,\" he wrote.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"0.54%","content":"PERCENT"},{"type":"$2.29 billion","content":"MONEY"},{"type":"Shiba","content":"LOCATION"},{"type":"0.5%","content":"PERCENT"},{"type":"$459 billion","content":"MONEY"},{"type":"$1.97 billion","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$547 billion","content":"MONEY"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"Todaro","content":"PERSON"},{"type":"'21","content":"DATE"},{"type":"quarter over quarter","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$88 billion","content":"MONEY"},{"type":"21%","content":"PERCENT"},{"type":"0.6%","content":"PERCENT"},{"type":"fourth quarter of 2021","content":"DATE"},{"type":"11%","content":"PERCENT"},{"type":"first quarter of 2022","content":"DATE"},{"type":"Will Nance","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$500 million","content":"MONEY"},{"type":"John Todaro","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"36%","content":"PERCENT"},{"type":"Bankman","content":"PERSON"},{"type":"$2.5 billion","content":"MONEY"},{"type":"Needham &amp; Company","content":"ORGANIZATION"},{"type":"Nance","content":"PERSON"}],"hashtag":["COINBASE","EARNINGS"],"authors":["Frank Chaparro","The Block"]}