{"summary":"BaFin has warned about a new Android malware called GodFather that is targeting banking apps and crypto websites.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/200125\/crypto-and-banking-apps-targeted-by-godfather-malware-warns-bafin","publishDate":"2023-01-09T12:13:31","id":602,"type":null,"title":"Crypto and banking apps targeted by ‘Godfather’ malware, warns BaFin","category":["CRYPTO ECOSYSTEMS"],"content":["Germany’s financial regulator BaFin has warned that crypto and banking mobile apps are being targeted by cybercriminals using the “GodFather” Android malware.","BaFin stated that the malware has so far attacked 400 crypto and banking apps, including platforms operating out of Germany and 15 other countries, Monday’s <a href=\"https:\/\/www.bafin.de\/SharedDocs\/Veroeffentlichungen\/DE\/Verbrauchermitteilung\/weitere\/2023\/meldung_2023_01_09_warnung_aktuelle_schadsoftware.html\" data-v-f87c67ca=\"\">announcement<\/a> revealed. This includes 200 banking apps, 100 crypto exchanges, and 94 crypto wallets, according to a <a href=\"https:\/\/www.pcrisk.com\/removal-guides\/25588-godfather-malware-android\" data-v-f87c67ca=\"\">report<\/a> by PCrisk.","Today’s announcement is the latest warning of the growing threat posed by the GodFather malware. GodFather is among a class of <a href=\"https:\/\/www.theblock.co\/linked\/17532\/cryptocurrency-and-banking-apps-targeted-by-new-android-malware\" data-v-f87c67ca=\"\">Android-based trojans like Gustuff<\/a> that targets crypto and banking mobile apps. It tricks its victims by displaying fake versions of online crypto exchange and banking websites. Cybercriminals are able to use the malware to steal the login data of victims.","The GodFather malware can also steal text messages from the victim’s smartphone. This makes it possible for cybercriminals to use the malware to bypass two-factor authentication checks.","Security experts say the malware is able to mimic the Google Protect tool thus allowing it access to Accessibility settings on the victim’s phone. This access also allows the malware to expand its pool of infected apps. It does this by using the phone’s built-in screen capture capabilities to record keystrokes when logging in to apps outside of its list of infected apps.","“It is unclear exactly how the software gets onto the infected end devices of customers,” the BaFin announcement stated. However, security experts say cybercriminals are distributing the malware via trojan-infected apps on the Google Play Store. These apps are fake versions of legitimate apps that come loaded with the trojan.","Android users have been urged to review apps before installing them to avoid such fake apps. Android users have also been advised to turn on Google Play Protect. PCrisk also stated that the malware does not operate on devices that have their languages set to Uzbek, Russian, Azerbaijani, Kazakh, Kyrgyz, Armenian, Tajik, Belarusian, or Moldovan.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Monday","content":"DATE"},{"type":"Google Play Store","content":"ORGANIZATION"},{"type":"Germany","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Google Play Protect","content":"ORGANIZATION"},{"type":"BaFin","content":"ORGANIZATION"}],"hashtag":["HACKS"],"authors":["Osato Avan-Nomayo","The Block"]}