{"summary":"Senator Pat Toomey is adamant on establishing limits on a potential central bank digital currency, though he has not yet ruled out supporting one.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/129944\/fed-chair-and-us-senator-agree-on-core-principles-and-limits-for-a-potential-digital-dollar","publishDate":"2022-01-11T16:09:40","id":6023,"type":null,"title":"Fed chair and US senator agree on core principles — and limits — for a potential digital dollar","category":["CONGRESS"],"content":["Senator Pat Toomey is adamant on establishing limits on a potential central bank digital currency, though he has not yet ruled out supporting one.","<span data-v-f87c67ca=\"\">CBDCs were a hot topic during a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/129900\/powell-says-delayed-fed-report-on-digital-currencies-will-be-released-within-weeks\" data-v-f87c67ca=\"\">hearing before the Senate Banking Committee<\/a> earlier today focusing on Federal Reserve Chair Jerome Powell’s renomination. <\/span>","<span data-v-f87c67ca=\"\">In the past, Toomey, the leading Republican on the committee, has noted his desire to protect private stablecoins over a potential CBDC. Speaking with The Block following today’s hearing, he maintained that he would be open to authorizing the Fed to issue a CBDC, as long as it was not a means of pushing out private operators.<\/span>","<span data-v-f87c67ca=\"\">“It all comes down to design,” Toomey told The Block. “If design goes badly, then we’re much better off not having a central bank digital dollar. But if it’s properly designed, then I think it could make sense as long as we allow privately issued stablecoins to exist.”<\/span>","It's a critical question at this point. The President's Working Group has said outright that Congress should tightly restrict stablecoin issuance, with the Financial Stability Oversight Council <a href=\"https:\/\/www.theblockcrypto.com\/linked\/127997\/fsoc-says-it-will-seek-to-mitigate-stablecoin-risks-if-congress-doesnt\" data-v-f87c67ca=\"\">further threatening to take steps<\/a> should Congress fail to act.&nbsp;","<span data-v-f87c67ca=\"\">Regarding any direct Fed accounts, Toomey maintained that commercial banks still need to act as intermediaries.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In his final questions to the Fed chair, Toomey sought to confirm such limits on a CBDC. And Powell seemed to be on board, based on the dialogue. <\/span><span data-v-f87c67ca=\"\">Specifically, Toomey did not want the Fed to handle accounts for retail users, nor did he want a CBDC to crowd out private stablecoins.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Some have advocated,” said Toomey, “that individual Americans have retail accounts with the Fed. It seems to me there is absolutely nothing in the history, experience, expertise of the fed that lend the Fed to be a retail organization.”<\/span>","<span data-v-f87c67ca=\"\">“I would say yes,” agreed Powell.<\/span>","<span data-v-f87c67ca=\"\">Toomey continued to ask, given congressional authorization for a CBDC: “Is there anything about that that ought to preclude a well-regulated private stablecoin from coexisting with a digital dollar?”<\/span>","<span data-v-f87c67ca=\"\">Powell was similarly in Toomey’s corner, saying: “No, not at all.”<\/span>","However, Powell himself has been hesitant to throw his support behind any Fed issuance of a CBDC.","At a hearing before the Banking Committee in July, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/111538\/fed-chair-powell-legitimately-undecided-on\" data-v-f87c67ca=\"\">he called himself \"legitimately undecided\"<\/a> on the benefits of a digital dollar. While he may have changed his position, he has not made that change public. And despite a great deal of interest in the Fed's delayed report on cryptocurrencies, in today's hearing, he cautioned against setting expectations unnecessarily high, calling the pending report \"more an exercise in asking questions and seeking answers from the public” than a proverbial Magna Carta for digital dollar issuance.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Working Group","content":"ORGANIZATION"},{"type":"Federal Reserve Chair Jerome Powell","content":"ORGANIZATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"Pat Toomey","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Magna Carta","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Powell","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"Senate Banking Committee","content":"ORGANIZATION"},{"type":"the Banking Committee","content":"ORGANIZATION"},{"type":"Toomey","content":"LOCATION"},{"type":"Toomey","content":"PERSON"},{"type":"Financial Stability Oversight Council","content":"ORGANIZATION"}],"hashtag":["FEDERAL RESERVE","JEROME POWELL"],"authors":["Kollen Post","The Block"]}