{"summary":"Bware Labs has announced the launch of their INFRA token, which will take place on May 30, 2023, at 10:00AM UTC. The launch of INFRA reaffirms the company’s mission to become the one-stop shop for high performing infrastructure services and developer tools that assist blockchain builders in every step of their Web3 journey.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232264\/bware-labs-launches-infra-token-making-high-api-performance-possible-within-a-decentralized-web3-infrastructure","publishDate":"2023-05-29T09:00:52","id":6026,"type":null,"title":"Bware Labs Launches $INFRA Token, making high API performance possible within a decentralized Web3 infrastructure","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">May 29, 2023 – Bware Labs has announced the launch of their INFRA token, which will take place on May 30, 2023, at 10:00AM UTC. The launch of INFRA reaffirms the company’s mission to become the one-stop shop for high performing infrastructure services and developer tools that assist blockchain builders in every step of their Web3 journey.<\/span>","<span data-v-f87c67ca=\"\">In the ever-evolving landscape of Web3, decentralization has emerged as a paramount principle. With the aim of dismantling centralized control and fostering a more inclusive and resilient ecosystem, decentralization holds immense significance. It is the key to unlocking the true potential of Web3 by distributing power, ownership, and decision-making authority among its participants. In this revolutionary journey, Bware INFRA token has emerged as a pivotal catalyst, propelling the decentralization of blockchain API infrastructure to new heights while maintaining a high level of performance, speed, and reliability.<\/span>","<span data-v-f87c67ca=\"\">As the utility token in Blast’s staking and delegation mechanism, INFRA was designed to empower individual builders and communities and to serve as the cornerstone of Bware Labs' vision to decentralize access to infrastructure resources.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The way in which Blast is aiming to achieve decentralization and become permissionless is by enabling any blockchain node that can maintain the required level of quality to register within the platform. Earning INFRA tokens will encourage operators to run full nodes on all of the Blast supported chains, leading to node stability, a better reallocation of unused resources (thus cutting down on energy use), and lower infrastructure costs. By leveraging INFRA through staking, by becoming node operators, or through delegations, Bware Labs community members gain the ability to contribute to the network's growth, hold a share in its rewards, and shape its future direction.<\/span>","<span data-v-f87c67ca=\"\">Flavian Manea, Co-Founder and CEO of Bware Labs, commented, \"The INFRA token is serving as the driving force behind the entire Bware Labs ecosystem. It will enable the full transition of Blast API to a permissionless and decentralized platform and will fuel the platform's overall growth and development.\"&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The total supply of $INFRA tokens has been deployed on Ethereum, and then it will be partially bridged to the Avalanche Chain through the Avalanche Bridge. Set your watches for 30\/05\/2023, 10:00 UTC, and follow INFRA’s path to decentralization from listing day 1. $INFRA will be available on <\/span><span data-v-f87c67ca=\"\">KuCoin, Gate.io, Bitmart, MEXC, Uniswap, Trader Joe, and xExchange.<\/span>","<a href=\"https:\/\/bwarelabs.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Website<\/span><\/a> <a href=\"https:\/\/blastapi.io\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Blast API<\/span><\/a> <a href=\"https:\/\/twitter.com\/BwareLabs\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Twitter<\/span><\/a><span data-v-f87c67ca=\"\">&nbsp; <\/span><a href=\"https:\/\/bware.page.link\/discord\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Discord<\/span><\/a> <a href=\"https:\/\/medium.com\/bware-labs\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Medium<\/span><\/a> <a href=\"https:\/\/t.me\/bwareLabs\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Telegram<\/span><\/a>","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Bware Labs<\/i><i data-v-f87c67ca=\"\">&nbsp;and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"May 30, 2023","content":"DATE"},{"type":"Joe","content":"PERSON"},{"type":"Flavian Manea","content":"PERSON"},{"type":"Bitmart","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$INFRA","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Bware Labs","content":"ORGANIZATION"},{"type":"May 29, 2023","content":"DATE"},{"type":"Uniswap","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}