{"summary":"Andreessen Horowitz (a16z) has published new details on the company’s efforts to share some of its considerable sway over decentralized finance (DeFi) projects.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/115705\/a16z-answers-critics-with-fresh-disclosures-on-defi-delegate-program","publishDate":"2021-08-26T11:00:12","id":6028,"type":null,"title":"a16z answers critics with fresh disclosures on DeFi delegate program","category":["DEFI"],"content":["Andreessen Horowitz (a16z) has published new details on the company’s efforts to share some of its considerable sway over decentralized finance (DeFi) projects.","The Silicon Valley heavyweight, which launched<a href=\"https:\/\/www.theblockcrypto.com\/post\/109408\/a16z-third-crypto-venture-fund\" data-v-f87c67ca=\"\"> a new $2.2 billion crypto fund<\/a> in June, has invested heavily in crypto and DeFi. It has backed some of the sector’s best known decentralized protocols, including Uniswap and Compound.","Unlike traditional venture capital investing, investors in DeFi projects tend to amass the native token of a protocol.","As a big backer of the mobile-first DeFi platform Celo, for example, a16z<a href=\"https:\/\/www.theblockcrypto.com\/daily\/115562\/celo-architect-rene-reinsberg-mobile-defi\" data-v-f87c67ca=\"\"> holds a cache of CELO tokens<\/a>. Tokens provide both a financial exposure and the means to influence the development of a project through participation in governance voting.","One method that has emerged to avoid too great a concentration of influence, and to help projects scale, is the delegation of tokens to partner organizations.","A16z has<a href=\"https:\/\/a16z.com\/2021\/02\/05\/on-crypto-governance\/\" data-v-f87c67ca=\"\"> previously disclosed<\/a> that it has delegated tokens to student-run organizations, including Stanford Blockchain Club, Harvard Law Blockchain and Fintech Initiative, Blockchain at UCLA, and Blockchain at Berkeley.","But the practice has at times proven controversial. In July, Harvard Law Blockchain and Fintech Initiative<a href=\"https:\/\/www.theblockcrypto.com\/post\/111185\/harvard-law-blockchain-initiative-uniswap-dao\" data-v-f87c67ca=\"\"> received a $20 million grant<\/a> from the Uniswap treasury.","Chris Blec, founder of DeFi Watch, claimed that the proposal – which was subject to a vote by token holders – was decided largely by a16z delegates. He published<a href=\"https:\/\/drive.google.com\/file\/d\/12JZESGPKhRPyxhGKAqv4wJBMg4dlgJUs\/view\" data-v-f87c67ca=\"\"> an open letter<\/a> to a16z calling for more transparency about how the company’s delegation program works.","In a blog post published August 26, a16z shared more detail about its token delegation process, including a list of best practices; how delegates are assessed; legal mechanics; the makeup of the company’s existing delegate network; and ideas for future improvement.","The investment firm wrote that delegation is an effective method of instigating “the development of a higher-quality governing body over the long term.”","A16z went on to write:","“To truly unlock these benefits though, a ‘strong’ form of delegation is needed. One that not only reduces surface-level concentration, but that also enhances the quality and diversity of the governing body. And perhaps most important of all, one that empowers each delegate to vote independently from the token holder, in whatever way they see fit.”","One of a16z’s more eye-catching proposed best practices concerns independence. Any sway gained by an a16z delegate over the direction of a DeFi would be a sham without clear boundaries, given that its power exists entirely on the munificence of the investment firm.","“Delegates must be empowered to vote independently from the token holder. This is an essential property for any well-designed delegation program. At a minimum, this means that the token holder should not attempt to influence or dictate its delegates’ participation in any way, either explicitly or implicitly,” the company wrote.","The transparency proposal was also striking. A16z stated that it will become increasingly important to give DeFi communities access to information about “the relevant parties, the terms of the underlying delegations, their relationships to the token holder, and more.”","To that end, a16z has published a breakdown of its current delegate network for Uniswap and Compound.","The breakdown (embedded below) reveals for the first time that microfinance company Kiva and Mercy Corps, the NGO, have received tokens from a16z – alongside university groups, startups and crypto professionals.","Notably, the breakdown does not detail exactly how many tokens have been delegated to individual organizations. The Block asked an a16z spokesperson whether details of individual delegations would be published by the company, but did not receive a response.","<em data-v-f87c67ca=\"\">Source: a16z<\/em>","Going forward, a16z stated that it will delegate tokens to a wider array of organizations and implement its delegation methodology for new protocols. The company also aims to continue developing the delegation framework.","“Ultimately, we are strong proponents of delegation and believe it has an important role to play in protocol governance. Our hope in publishing this framework is that it can serve as a useful starting point for others who are beginning to think about delegation and how to incorporate it thoughtfully,” it said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Uniswap and Compound","content":"ORGANIZATION"},{"type":"$2.2 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Blockchain","content":"ORGANIZATION"},{"type":"Chris Blec","content":"PERSON"},{"type":"Silicon Valley heavyweight","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"August 26","content":"DATE"},{"type":"UCLA","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Fintech Initiative","content":"ORGANIZATION"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Berkeley","content":"LOCATION"},{"type":"$20 million","content":"MONEY"},{"type":"Harvard Law Blockchain","content":"ORGANIZATION"},{"type":"NGO","content":"ORGANIZATION"},{"type":"Stanford Blockchain Club","content":"ORGANIZATION"},{"type":"Mercy Corps","content":"ORGANIZATION"}],"hashtag":["ANDREESSEN HOROWITZ"],"authors":["Ryan Weeks","The Block"]}