{"summary":"ZkSync, an Ethereum scaling protocol, will integrate the Java, Go, and Pyton programming languages to expand application use cases.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/181880\/zksync-adds-support-for-new-coding-languages-on-its-network","publishDate":"2022-11-01T16:44:52","id":6029,"type":null,"title":"ZkSync adds support for new coding languages on its network","category":["LAYER 2S AND SCALING"],"content":["ZkSync, an Ethereum scaling protocol, will integrate three popular programming languages into its Software Developer Kits (SDKs).","By adding support for Java, Python, and Go, developers have access to and the ability to use a coding language they are accustomed to, and enables new use cases such as “mobile or hardware-specific applications,” <a href=\"https:\/\/twitter.com\/zksync\/status\/1587507606108614656\" data-v-f87c67ca=\"\">zkSync wrote on Twitter.&nbsp;<\/a>","This announcement comes shortly after zkSync launched its non-public mainnet on Oct. 28.","SDKs are the cornerstone of developer tooling for building applications and are one of the main bottlenecks withholding the expansion of new blockchain-based application use cases.","ZkSync is an Ethereum scaling protocol that centers around a principle it calls <a href=\"https:\/\/www.theblock.co\/post\/174169\/zksync-head-of-product-sees-starfield-of-10x-moments-for-layer-3\" data-v-f87c67ca=\"\">“10x moments.”<\/a> For blockchains to gain mass adoption, specific improvements such as ease of building, scalability, and speed must occur, according to the company.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAdding support for popular languages to its SDKs is a move that falls under the principle of ease of building and is the first development since its mainnet launch attempting to mitigate the headaches of building decentralized applications.","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Java","content":"LOCATION"},{"type":"Python","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Oct. 28","content":"DATE"}],"hashtag":["ZKSYNC"],"authors":["Mike Truppa","The Block"]}