{"summary":"Stablecoin issuer Tether released its latest attestation report on Thursday, reporting a profit of $700 million in the fourth quarter of 2022.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210023\/tether-reports-700-million-q4-net-profit-in-latest-attestation-report","publishDate":"2023-02-09T06:00:14","id":6031,"type":null,"title":"Tether reports $700 million Q4 net profit in latest attestation report","category":["STABLECOINS"],"content":["Stablecoin issuer Tether released its latest attestation report on Thursday, reporting a \"net profit\" of $700 million in the fourth quarter of 2022, which it says is additional to its reserves.","\"Tether's reserves remain extremely liquid, with the majority of its investments being held in cash, cash equivalents, and other short-term deposits,\" the company said in a statement while releasing its December report attested by accounting firm BDO. The report notes Tether's consolidated assets exceeded its liabilities as of Dec. 31, 2022.","Tether's consolidated total assets amounted to at least $67.04 billion as of the date, while its consolidated total liabilities amounted to $66.08 billion, per the statement, reflecting excess reserves of at least $960 million.","The $700 million profit is \"part of shareholder equity, that is, what's in excess of reserves,\" a Tether spokesperson told The Block. \"It's basically additional capital sitting in the company to further strengthen Tether,\" they added.","This is the first time Tether has disclosed profit figures. It, however, did not specify how the profit was realized.","","","Last December, Tether <a href=\"https:\/\/www.theblock.co\/post\/194620\/tether-vows-to-remove-secured-loans-amid-rush-to-show-solvency\" data-v-f87c67ca=\"\">said<\/a> it will remove all secured loans from its backing in 2023 after The Wall Street Journal said the company's increasing roster of loans might make it unable to pay back redemptions in the event of a crisis. Per today's report, Tether has reduced its secured loans by $300 million.","Tether CTO Paolo Ardoino said in the statement that the company \"once again proved its stability\" in the troubled year of 2022. \"Not only were we able to smoothly execute over $21 billion dollars in redemptions during the chaotic events of the year, but Tether has on the other side issued over $10 billion of USDT, an indication of continued organic growth and adoption of Tether,\" he said.","Tether <a href=\"https:\/\/www.theblock.co\/post\/177080\/tether-to-replace-commercial-paper-with-u-s-treasuries-reserves\" data-v-f87c67ca=\"\">eliminated<\/a> commercial paper from its reserves last October. Its other assets include corporate bonds, funds and precious metals. Tether's USDT is the largest stablecoin in the market, with a supply of over 68 billion tokens, according to <a href=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-stablecoin-supply\" data-v-f87c67ca=\"\">The Block's Data Dashboard<\/a>.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-stablecoin-supply\/embed\" title=\"Total Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<em data-v-f87c67ca=\"\">Updates with comments from a Tether spokesperson.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USDT","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"$960 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Tether","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$21 billion dollars","content":"MONEY"},{"type":"$66.08 billion","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"BDO","content":"ORGANIZATION"},{"type":"$10 billion","content":"MONEY"},{"type":"$67.04 billion","content":"MONEY"},{"type":"fourth quarter of 2022","content":"DATE"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"68 billion","content":"MONEY"},{"type":"$700 million","content":"MONEY"},{"type":"Dec. 31, 2022","content":"DATE"},{"type":"CTO Paolo Ardoino","content":"ORGANIZATION"},{"type":"$300 million","content":"MONEY"},{"type":"October","content":"DATE"}],"hashtag":["TETHER"],"authors":["Yogita Khatri","The Block"]}