{"summary":"No verified real-world attacks have been linked to “replacement cycling attacks&quot; on Lightning network in the past 10 months.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/258871\/developer-exposed-potential-security-issue-on-the-lightning-network","publishDate":"2023-10-23T01:39:30","id":6036,"type":null,"title":"Developer exposed potential security issue on the Lightning Network","category":["CRYPTO ECOSYSTEMS"],"content":["A vulnerability was identified in the Bitcoin Lightning Network, a second-layer solution aimed at accelerating transaction speeds on the Bitcoin blockchain.","The flaw was reported by Bitcoin developer Antoine Riard, who laid out the details in a&nbsp;<a href=\"https:\/\/github.com\/ariard\/mempool-research\/blob\/2023-10-replacement-paper\/replacement-cycling.pdf\" data-v-f87c67ca=\"\">report<\/a>&nbsp;published last week.","The vulnerability, referred to as “replacement cycling attacks,” could potentially jeopardize the security of funds flowing through the Lightning Network.","It theoretically may allow sophisticated attackers to execute a \"transaction-relay jamming attack\" and target a crucial Lightning Network component known as Hash Time Locked Contracts (HTLC). The objective of such an attack would be to disrupt the normal flow of transactions, causing delays or preventing them from being processed as expected. This could lead to potential risk of loss-of-funds within the network’s channels.","Although concerning, the flaw has not yet led to any verified real-world attacks. Riard stated that there’s no evidence of such activities over the past 10 months based on observational data. “While neither replacement cycling attacks have been observed or reported in the wild since the last ~10 months or experimented in real-world conditions on bitcoin mainnet,” the report highlighted.","Riard also revealed that the vulnerability was disclosed to Lightning developers and mitigation steps have been taken, with patches deployed across major Lightning Network implementations like Eclair, LND, and C-Lightning. However, he expressed reservations about the effectiveness of these mitigations against more advanced forms of the attack.","The implications of this vulnerability could extend beyond the Lightning Network. Riard’s report suggested that the flaw might affect a range of other Bitcoin protocols and applications, such as coinjoins, peerswap and batch payouts.","Riard, the developer who first unearthed the vulnerability, simultaneously published a note stating that he has ceased work on Lightning.","“Effective now, I’m halting my involvement with the development of the lightning network and its implementations, including coordinating the handling of security issues at the protocol level,” Riard wrote.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bitcoin Lightning Network","content":"ORGANIZATION"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"Antoine Riard","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Lightning","content":"ORGANIZATION"},{"type":"Hash Time Locked","content":"ORGANIZATION"}],"hashtag":["BITCOIN","EXPLOITS","HACKS"],"authors":["Vishal Chawla","The Block"]}