{"summary":"Chainlink co-founder Sergey Nazarov reckons banks will build their own blockchains and this will enable more value to flow into crypto.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240714\/chainlink-ceo-wants-to-bring-trillions-of-dollars-into-crypto-from-banks","publishDate":"2023-07-20T07:29:24","id":6037,"type":null,"title":"Chainlink co-founder wants to bring trillions of dollars into crypto from banks","category":["CRYPTO ECOSYSTEMS"],"content":["Chainlink launched its cross-chain interoperability protocol just a few days ago, in the hope of making it easier to send money between blockchains.","But the co-founder of Chainlink has far broader ambitions than simply linking public blockchains together. Sergey Nazarov anticipates that banks and financial institutions will roll out their own blockchains — likely controlled or permissioned in some ways — and that at some point the regulatory environment will let them connect to public blockchains like Ethereum.","And if this thesis is right, he argued, it could bring a huge amount of value to crypto.","“You have this public blockchain and internet of contracts primarily defined by DeFi, and you have this bank-chain world, which I think will be primarily defined by real-world asset tokens. The next stage will be getting these two worlds to overlap,” Nazarov told The Block in an interview at EthCC. “And when that happens, beyond the efficiencies and the gains for each of these groups, then you will see the blockchain industry as a whole, I think grow very, very rapidly by trillions of dollars.”","The recently launched <a href=\"https:\/\/www.theblock.co\/post\/240295\/synthetix-is-targeting-a-q4-launch-for-perps-v3-and-infinex-kain-warwick?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">protocol<\/a> serves as a technical infrastructure designed to transfer tokens from one chain to another. It leverages the Chainlink network, which has a history of providing reliable data to blockchains typically from real-world data, such as pricing information. However, in the context of CCIP, the network facilitates the exchange of information between blockchains, steering the movement of assets in a secure manner. While the network is presently operational on the mainnet, it remains in an early access phase and is being tested in collaboration with crypto projects, including <a href=\"https:\/\/www.theblock.co\/post\/240295\/synthetix-is-targeting-a-q4-launch-for-perps-v3-and-infinex-kain-warwick?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">Synthetix<\/a> and Aave.","The infrastructure has also already been trialed in the traditional banking system prior to its recent launch. Swift, the global inter-bank messaging network, and over a dozen financial institutions, have been <a href=\"https:\/\/www.swift.com\/news-events\/news\/swift-explores-blockchain-interoperability-remove-friction-tokenised-asset-settlement\" data-v-f87c67ca=\"\">exploring<\/a> CCIP for instructing token transfers across public and private chains through the existing Swift messaging infrastructure.","“So I've been selling these banks blockchain stuff for about six, seven years. And the historical pattern has been that when there is a downturn in crypto prices, the banks lose interest. But this time is the first time after the four cycles that I've been through that this hasn't happened. And I think the reason it hasn't happened is because their clients want blockchain stuff,” Nazarov said.","Based on Chainlink’s work dealing with Swift and banks, Nazarov explained why he thinks banks will build their own blockchains.&nbsp;","Nazarov claimed there are three stages of bank adoption. Stage 1 focuses on custody, and entails simply looking after crypto assets (driven by customer trading demands) on their native chains. Stage 2 encompasses tokenizing real-world assets, in a similar way to making derivative assets, which raises the question: onto which chain will these assets be placed? Nazarov contended that this juncture is when banks recognize the need to establish their own chains to exert full control over their tokenized real-world assets.","Pointing to banks that have set up their own digital asset departments, Nazarov observed, “And what all of those departments are coming to as a conclusion is we have to have our own app chain because why am I going to pay fees to some other one, some other person’s chain? I’ll just have my own chain.” He argued that this is when banks realize they should create their own chains to have complete control over their own tokenized real-world assets.","Stage 3 emerges when banks start the development of financial protocols on their proprietary chains, essentially mirroring the contemporary DeFi landscape but within a tighter, regulated framework. This is where Nazarov reckons Chainlink will come in.","“In that third stage, they're invariably going to be dealing with us because we power the vast majority of DeFi. They're going to need market data, they're gonna need identity data, they're gonna need automation, they're going to need functions. All the stuff we make, they're going to need,” he said. “I know that because I've already seen a lot of the designs, and the designs are basically copying the DeFi [protocols] we already power.”","Nazarov also posited that stablecoins could serve as the entry point. He found it notable that Societe Generale <a href=\"https:\/\/www.theblock.co\/post\/227297\/societe-generale-coinvertible-stablecoin-euro-mica-crypto\" data-v-f87c67ca=\"\">developed<\/a> a stablecoin and put it on a public blockchain. He anticipated that in the future, all banks will introduce their own stablecoins that will operate cross-chain. Nazarov predicted these banks might choose CCIP as they will want their stablecoin used in as many places as possible.","Should banks build their private blockchains, complete with their own stablecoins and DeFi protocols, a pressing question emerges: Will these chains operate in isolation, or will they connect to the current spectrum of public blockchains, possibly through technologies like CCIP? Nazarov believes the two worlds will eventually merge, but only once regulations have evolved sufficiently.","“So what we're doing is we're setting up the technical foundation for them to do it technically, and then doing it legally is something they're going to work through and figure out within the next three to five years,” he said.","Nazarov elaborated that banks would aim to interconnect their chains to amplify the reach of their financial products. He emphasized that banks could only market such products on chains they are linked to, underscoring the importance of tools like CCIP that enable asset transfers across diverse chains.","He further noted that, as soon as regulations permit, banks would be inclined to link with public blockchains if they present more lucrative market opportunities. He posited that if a bank could fetch a 5% higher return for an asset on a public blockchain compared to traditional banking chains, then they would likely do so.","Nazarov referenced the current experiments that Chainlink is working on with financial institutions. He said the second proof of concept is going successfully and that typically the next stage is to go to a pilot. “If we go to a pilot with real value moving between different bank chains, I mean, then the sky's the limit.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"trillions of dollars","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Nazarov","content":"PERSON"},{"type":"Sergey Nazarov","content":"PERSON"},{"type":"Societe Generale","content":"ORGANIZATION"}],"hashtag":["CROSS-CHAIN SWAPS","INTEROPERABILITY"],"authors":["Tim Copeland","The Block"]}