{"summary":"On-chain analysts noted that apparent insiders connected to Reddit&#x27;s Cryptocurrency subreddit sold off significant quantities of Moons.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/258476\/pair-of-reddit-mods-appear-to-have-sold-off-tokens-ahead-of-announcement-to-terminate-blockchain-based-program","publishDate":"2023-10-19T15:01:24","id":6048,"type":null,"title":"Pair of Reddit mods appear to have sold off tokens ahead of announcement to terminate blockchain-based program","category":["CRYPTO ECOSYSTEMS"],"content":["On-chain data suggests that apparent insiders connected to Reddit's Cryptocurrency subreddit seem to have sold off significant quantities of Moons, the forum's own cryptocurrency, before Reddit publicly announced plans to discontinue its Community Points program.","This <a href=\"https:\/\/www.theblock.co\/post\/258016\/reddit-plans-to-sunset-its-blockchain-based-reward-service-community-points\" data-v-f87c67ca=\"\">announcement<\/a> triggered an 85% plunge in the Moon token's value.","Reddit, a widely-used social media platform, told users on Tuesday that it planned to end its blockchain-based Community Points system, causing the Moon token’s value to plummet from $0.25 to less than $0.04 in a few hours.","Despite claims from subreddit moderators that they had been unaware of Reddit’s impending decision, blockchain data suggests a different tale. Wallets seemingly connected to these moderators unloaded substantial amounts of Moon tokens minutes before Reddit's <a href=\"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/17a33ql\/serious_sunsetting_community_points_beta_and\/\" data-v-f87c67ca=\"\">announcement at 1:02 p.m. ET<\/a> on Oct. 17.","Among the transactions scrutinized, several are notable. One such instance involved a subreddit moderator with the username Mcgillby, on-chain analysts <a href=\"https:\/\/twitter.com\/Pledditor\/status\/1714610041699930439\" data-v-f87c67ca=\"\">Pledditor<\/a> and Lookonchain first noted. This moderator transferred over 100,000 Moons through two separate transactions on the Arbitrum Nova blockchain, converting them into over $23,000 in ETH, <a href=\"https:\/\/nova.arbiscan.io\/address\/0x27bd8fff60c3ac59b38b37fe9ae31e9054f490f4#tokentxns\" data-v-f87c67ca=\"\">on-chain data<\/a> shows. The <a href=\"https:\/\/www.reddit.com\/user\/Mcgillby\/\" data-v-f87c67ca=\"\">user<\/a> subsequently deleted all previous Reddit posts.","In the past, Mcgillby had been <a href=\"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/xeehgl\/the_top_20_moon_holders\/\" data-v-f87c67ca=\"\">identified<\/a> as one of the top 20 Moon holders and one of the moderators. Moons, as ERC-20 tokens, can be stored in a specialized crypto wallet on Reddit known as Reddit Vault, which records all transactions involving moderators on the blockchain, linked to their wallet addresses.","Another moderator, \"<a href=\"https:\/\/www.reddit.com\/user\/rider_of_the_storm\" data-v-f87c67ca=\"\">rider_of_the_storm<\/a>,\" allegedly moved 345,422 Moons — valued at over $69,000 at the time — to an exchange <a href=\"https:\/\/nova.arbiscan.io\/address\/0x6886e62caeeca9d0d54adaa552d7579b15ed837f#tokentxns\" data-v-f87c67ca=\"\">address<\/a> just 17 minutes before Reddit's public announcement. This Reddit account has now been deleted.&nbsp;","Both Mcgillby and rider_of_the_storm have sold off tokens worth over $92,000. The two users have been removed from moderator roles on the subreddit. Currently there are <a href=\"https:\/\/www.reddit.com\/r\/CryptoCurrency\/about\/moderators\/\" data-v-f87c67ca=\"\">10 other moderators<\/a> supervising the subreddit.&nbsp;","The subreddit moderators issued a <a href=\"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/17a33ql\/comment\/k5ahcpu\/?utm_source=reddit&amp;utm_medium=web2x&amp;context=3\" data-v-f87c67ca=\"\">statement<\/a> at 1:07 p.m. ET from their shared account five minutes after Reddit's public announcement, indicating they were informed about the discontinuation of the Community Points program just one hour before it went public.","However, the rapid succession of on-chain transactions following this internal notice suggests that some moderators may have rushed to offload their Moon token holdings before the information was publicly disclosed.","\"Points were never intended to have any monetary value, and buying, selling, and trading Points has always been a violation of our terms for the product,\" a spokesperson for Reddit told The Block in an email.","\"Outside of that, we regularly preview updates to the platform to moderators before we roll them out for their feedback, which is what we did here. But that is irrelevant as the actions taken were against the terms the participants agreed to,\" the spokesperson continued.","<em data-v-f87c67ca=\"\">(Updates with comment from Reddit spokesperson. With reporting assistance from MK Manoylov.<\/em>)","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Reddit Vault","content":"LOCATION"},{"type":"Reddit","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Mcgillby","content":"PERSON"},{"type":"20","content":"DATE"},{"type":"$69,000","content":"MONEY"},{"type":"Moon","content":"PERSON"},{"type":"85%","content":"PERCENT"},{"type":"$0.25","content":"MONEY"},{"type":"$23,000","content":"MONEY"},{"type":"$0.04","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"Community Points","content":"ORGANIZATION"},{"type":"1:07 p.m.","content":"TIME"},{"type":"Oct. 17","content":"DATE"},{"type":"1:02 p.m.","content":"TIME"},{"type":"$92,000","content":"MONEY"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}