{"summary":"Some members of the Ethereum community are concerned that this regulatory compliance amounts to censorship.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173417\/at-least-23-of-ethereum-blocks-are-complying-with-us-sanctions","publishDate":"2022-09-28T10:34:16","id":6050,"type":null,"title":"At least 23% of Ethereum blocks are complying with US sanctions","category":["TECHNOLOGY"],"content":["At least 23% of Ethereum blocks are complying with U.S. sanctions due to the use of a service called Flashbots.","Ethereum researcher Toni Wahrstätter has <a href=\"https:\/\/twitter.com\/Nero_ETH\/status\/1574805871544213504\" data-v-f87c67ca=\"\">published<\/a> research showing that maximum extractable value (MEV) operator Flashbots is censoring all transactions originating from Tornado Cash. Out of all 19,436 Ethereum blocks generated on Ethereum after <a href=\"https:\/\/www.theblock.co\/post\/169299\/ethereum-activates-the-merge-as-it-shifts-to-proof-of-stake\" data-v-f87c67ca=\"\">The Merge<\/a> using Flashbots' relay software (for MEV Boost), not a single block contained a transaction connected to Tornado Cash, according to Wahrstätter.","“It's concerning to see how quickly the potential for censorship has grown unchecked since the Merge, and its potential to get much worse as more validators opt-in to mev-boost, unless awareness is raised,” <a href=\"https:\/\/twitter.com\/Labrys_io\/status\/1575039227431030784\" data-v-f87c67ca=\"\">said<\/a> Labrys, a web3 development company that built a site tracking compliant Ethereum blocks, on Twitter.","Flashbots appears to have been censoring transactions by default on its offering as it aims to be compliant with regulatory requirements. This is in line with <a href=\"https:\/\/twitter.com\/bantg\/status\/1559948198508118016\" data-v-f87c67ca=\"\">comments<\/a> made by Flashbots Strategy Lead Hasu in August that it planned on filtering out sanctioned transactions.","According to The Block research, while Flashbots alone accounts for 23% of Ethereum blocks, it’s possible the actual percentage of compliant Ethereum blocks may be much higher. “This data currently only shows validators that use MEV-Boost but those that don’t can also be OFAC compliant through their own internal systems,” said The Block researcher Steven Zheng.","<span data-v-f87c67ca=\"\">A graph showing how many blocks from different relays that contain Tornado Cash transaction. Image: Toni Wahrstätter.<\/span>","The data shows that Flashbots is the only MEV relay participating in transaction censorship. Meanwhile, MEV relay operators like Blocknative, Eden Network, Bloxroute, and Manifold are still producing blocks that have Tornado Cash transactions in them, according to Wahrstätter. This contrasts <a href=\"https:\/\/github.com\/remyroy\/ethstaker\/blob\/main\/MEV-relay-list.md\" data-v-f87c67ca=\"\">claims<\/a> by Blocknative, Eden Network and BloXroute Regulated that they are complying with sanctions.","MEV refers to the maximum value that can be extracted from block production and can be achieved by the reordering of transactions in a block. On Ethereum’s proof of stake blockchain, MEV is made possible by MEV Boost, a open source middleware mechanism to help gather transactions and propose blocks, relaying them to the block validators.&nbsp;","Flashbots runs one of the most widely used relays on MEV Boost. This relay tells validators which transactions they should prioritize in block production to get extra rewards and it receives a fee in return. The use of Flashbots has been steadily increasing since The Merge.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/number-of-blocks-proposed-from-flashbots-mev-boost-relay\/embed\" title=\"Number of Blocks Proposed from Flashbots MEV-Boost Relay\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The action from Flashbots has been taken in response to the U.S. Office of Foreign Assets Control (OFAC) <a href=\"https:\/\/home.treasury.gov\/news\/press-releases\/jy0916\" data-v-f87c67ca=\"\">blacklisting<\/a> of decentralized crypto mixer Tornado Cash in August. Here, OFAC sanctioned the use of Tornado Cash and certain Ethereum addresses connected to the app, citing use by cybercriminals for money laundering.&nbsp;","After the sanctions were announced, infrastructure projects like Alchemy and Infura refused to service users who try to bring assets to their platforms from Tornado Cash-linked accounts. Flashbots is the latest one to make a similar move.","Last month, Ethereum supporters and developers <a href=\"https:\/\/www.theblock.co\/post\/169508\/ethereum-is-grappling-with-the-risk-of-censorship-after-the-merge\" data-v-f87c67ca=\"\">expressed worries<\/a> that OFAC sanctions could make the blockchain vulnerable to censorship at the base layer. The developers highlighted the possibility that validators in the post-merge environment start censoring transactions leading to validators censoring on the network to an extent. MEV relays are also another point from where fears of censorship can potentially stem from.","Wahrstätter told The Block that Flashbots open-sourcing its code is a good attempt to get the issue under control. He said, \"Flashbots is doing a great job and now we can hope for increasing competition in the block building markets.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Toni Wahrstätter","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Flashbots Strategy Lead Hasu","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Steven Zheng","content":"PERSON"},{"type":"MEV Boost","content":"ORGANIZATION"},{"type":"23%","content":"PERCENT"},{"type":"Eden Network","content":"ORGANIZATION"},{"type":"Bloxroute","content":"LOCATION"},{"type":"Blocknative","content":"ORGANIZATION"},{"type":"Labrys","content":"PERSON"},{"type":"U.S. Office of Foreign Assets Control (OFAC","content":"ORGANIZATION"},{"type":"OFAC","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":["ETHEREUM","MEV"],"authors":["Vishal Chawla","Tim Copeland","The Block"]}