{"summary":"Revolut, the $5.5 billion London-based digital bank, is preparing to add dogecoin to the list of cryptocurrencies customers can trade on its app.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/104266\/revolut-dogecoin-crypto-trading-tool","publishDate":"2021-05-08T11:38:14","id":6053,"type":null,"title":"Revolut wants to add dogecoin to crypto trading tool: sources","category":["FINTECH"],"content":["Revolut, the $5.5 billion London-based digital bank, is preparing to add dogecoin to the list of cryptocurrencies customers can trade on its app.","People close to the situation told The Block that Revolut is hoping to launch dogecoin soon, although as of May 7 the startup was still running tests to ensure any update goes smoothly.","One source even suggested that dogecoin could be added to the app ahead of Tesla CEO Elon Musk’s appearance on Saturday Night Live this weekend. Analysts <a href=\"https:\/\/uk.finance.yahoo.com\/news\/cryptocurrency-dogecoin-rises-eve-elon-musk-snl-appearance-085057058.html\" data-v-f87c67ca=\"\">have suggested<\/a> that the possibility of Musk mentioning the meme-token on the show has further inflated its price over the past week.","The Block has not been able to verify the exact timing of any dogecoin launch on Revolut. A spokesperson for the company declined to comment.","Created as a joke in 2013, the price of dogecoin has soared in recent months after being hyped by billionaires Musk and Mark Cuban. According to CoinGecko, the cryptocurrency currently boasts a market capitalization of around $90 billion, up from just $7.5 billion in early April.","Revolut, which is rumored to be <a href=\"https:\/\/news.sky.com\/story\/revolut-founder-plots-path-to-10bn-valuation-with-new-fundraising-12277984\" data-v-f87c67ca=\"\">seeking further investment<\/a> at a $10 billion valuation, is a global leader in the burgeoning neobank sector. The startup began in 2015 as an app and card offering that allowed travelers to cheaply and easily convert currencies, but has since launched a multitude of products, including stock trading and crypto investment tools.","On May 6, Revolut announced that it would allow <a href=\"https:\/\/www.theblockcrypto.com\/daily\/103895\/revolut-crypto-withdrawals-stablecoins-interest\" data-v-f87c67ca=\"\">bitcoin withdrawals<\/a> for the first time, after recently <a href=\"https:\/\/www.altfi.com\/article\/7778_revolut-introduces-11-new-cryptocurrencies-as-users-flock-to-crypto-trading\" data-v-f87c67ca=\"\">adding 11 new tokens<\/a> to the crypto tool.&nbsp;","The company is also attempting to win banking licenses in various markets globally, including&nbsp;<a href=\"https:\/\/techcrunch.com\/2021\/01\/11\/revolut-applies-for-uk-banking-license\/\" data-v-f87c67ca=\"\">the United Kingdom<\/a>&nbsp;and&nbsp;<a href=\"https:\/\/techcrunch.com\/2021\/03\/22\/revolut-applies-for-bank-charter-in-the-us\/\" data-v-f87c67ca=\"\">the&nbsp;United States<\/a>. It is <a href=\"https:\/\/www.finextra.com\/newsarticle\/35753\/revolut-launches-licenced-bank-in-lithuania\" data-v-f87c67ca=\"\">already a licensed bank<\/a> in Lithuania.","Edward Cooper, Revolut’s head of crypto, told The Block in a recent interview that Revolut’s “end goal” is to allow users to access all their financial services through one super-app.","“That means banking makes sense; it means commodities makes sense; crypto makes sense. We don’t think these things are mutually exclusive,” he said.","Asked whether regulators such as the Bank of England – which will ultimately decide whether to award Revolut a banking license in the United Kingdom – might be perturbed by that blend of products, Cooper said that “the fact that Revolut has regulated products can actually help us to a certain extent, because when we go to talk to regulators and explain to them what our product’s going to be, they already have a good idea of our controls and systems that we have in place.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2015","content":"DATE"},{"type":"Edward Cooper","content":"PERSON"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Night Live this weekend","content":"TIME"},{"type":"May 6","content":"DATE"},{"type":"Cooper","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"May 7","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"Lithuania","content":"LOCATION"},{"type":"$90 billion","content":"MONEY"},{"type":"$7.5 billion","content":"MONEY"},{"type":"$10 billion","content":"MONEY"},{"type":"$5.5 billion","content":"MONEY"},{"type":"London","content":"LOCATION"},{"type":"Tesla CEO Elon Musk","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"United Kingdom","content":"LOCATION"},{"type":"Saturday","content":"DATE"}],"hashtag":["DOGECOIN"],"authors":["Ryan Weeks","The Block"]}