{"summary":"Advertisers of crypto services will face tougher rules in the UK from October 8, the Financial Conduct Authority announced today.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/233554\/fca-to-roll-out-stricter-rules-for-crypto-ads-including-referral-bonus-ban","publishDate":"2023-06-07T19:01:32","id":6054,"type":null,"title":"FCA to roll out stricter rules for crypto ads including referral bonus ban","category":["CRYPTO ECOSYSTEMS"],"content":["Advertisers of crypto services will face tougher rules in the UK from October 8, the Financial Conduct Authority announced today.","The UK watchdog said crypto companies must introduce a “cooling-off period” for first-time investors from October 8. Firms in the sector must also scrap “refer a friend” bonuses, which will be banned as part of a package to ensure crypto investors understand risk properly, the FCA said.","“It is up to people to decide whether they buy crypto. But research shows many regret making a hasty decision. Our rules give people the time and the right risk warnings to make an informed choice,” Sheldon Mills, executive director, consumers and competition, said in a written statement.","“The crypto industry needs to prepare now for this significant change. We are working on additional guidance to help them meet our expectations,” Mills added.","The news comes amid a dramatic crackdown by regulators on the other side of the pond — a campaign punctuated by the U.S. Securities and Exchange Committee filing lawsuits against <a href=\"https:\/\/www.theblock.co\/amp\/post\/233206\/sec-binance-showdown-sends-shockwaves-through-crypto\" data-v-f87c67ca=\"\">both Binance and Coinbase<\/a> this week.","In August 2022, the FCA <a href=\"https:\/\/www.theblock.co\/post\/160465\/uk-financial-regulator-unveils-stronger-ad-restrictions-with-crypto-rules-set-to-follow\" data-v-f87c67ca=\"\">finalized tougher rules<\/a> to combat misleading ads relating to high-risk investment products. Those restrictions didn’t include crypto, as the regulator was at that time awaiting confirmation from the government that crypto products would be brought under its remit.","The FCA said in its announcement today that the steps taken today to tackle crypto ads are consistent with the restrictions introduced last year for advertising high-risk investments.&nbsp;","It is also consulting on additional guidance laying out requirements for crypto advertisers. Those wishing to contribute have until August 10 to do so.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"August 2022","content":"DATE"},{"type":"FCA","content":"ORGANIZATION"},{"type":"Sheldon Mills","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Financial Conduct Authority","content":"ORGANIZATION"},{"type":"October 8","content":"DATE"},{"type":"Mills","content":"PERSON"},{"type":"UK","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"UK watchdog","content":"ORGANIZATION"},{"type":"August 10","content":"DATE"},{"type":"U.S. Securities and Exchange Committee","content":"ORGANIZATION"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}