{"summary":"Decentralized socialfi platform Boom has announced the launch of its application on the App Store and Google Play in addition to the Android version.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/134353\/decentralized-socialfi-platform-boom-live-on-app-store-unveiling-two-nft-airdrops","publishDate":"2022-02-16T08:00:51","id":6059,"type":null,"title":"Decentralized Socialfi Platform Boom Live on App Store, Unveiling Two NFT Airdrops","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">Decentralized socialfi platform Boom has announced the launch of its application on the<\/span><a href=\"https:\/\/apps.apple.com\/app\/id1592616541\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">App Store<\/span><\/a><span data-v-f87c67ca=\"\"> and<\/span><a href=\"https:\/\/play.google.com\/store\/apps\/details?id=org.boomapp.boom\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">Google Play<\/span><\/a><span data-v-f87c67ca=\"\"> in addition to the <\/span><a href=\"https:\/\/s1.boomapp.org\/downloads\/boom.apk\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Android<\/span><\/a><span data-v-f87c67ca=\"\"> version. For most Cryptocurrency projects, having to launch a mobile app is a huge accomplishment as it will attract a large number of users into the application, bringing the benefit of the application towards more users in the Web 3.0 social world.<\/span>","<span data-v-f87c67ca=\"\">Whether you are involved in the NFT or Cryptocurrency market or not - there’s massive hype and following inside the market, which resulted in an increased amount of fake usage of NFT inside Web 2.0 social platforms such as Twitter, Instagram, and Discord. Some of the users took screenshots or downloaded the picture and used it as a profile picture without actually owning the NFT. By doing so, it loses the purpose of owning the NFT without blockchain technology support. With this context, the Boom app has solved most of the problems that users and creators faced in Web 2.0 social platforms, which is authentication of assets in social platforms. With Boom going live on the App On App Store and Google Play Store, we can expect an increased number of users joining the Boom Community, creating more opportunities and collaboration in the industry while keeping the value of NFTs and Crypto Tokens. Besides that, Boom team is also working on a PC version of Boom that is expected to be released in Q1, March 2022.<\/span>","<span data-v-f87c67ca=\"\">Click here to see the <\/span><a href=\"https:\/\/fastdl.boomapp.org\/boom_offical\/boom_video_final.mp4\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Boom Introduction Video<\/span><\/a>","<span data-v-f87c67ca=\"\">On the Boom app, the main function is that users and creators can create their Boom account to browse through news or share their opinions about the current crypto market. Users are able to follow news that is published by Whales or KOLs and creators are able to share information or ideas on their account privately or publicly. With the recent updates, Boom even came out with the most important function which allows users to display their NFTs or Token into their profile as they wish.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As Boom is a community-centric-based application, they have also launched a<\/span><a href=\"https:\/\/www.prnewswire.com\/news-releases\/decentralized-mateverse-social-startup-boom-fund-1-million-to-support-creators-whilst-the-launch-ios-and-android-app-301451095.html\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">$1M Creator Fund<\/span><\/a><span data-v-f87c67ca=\"\"> to provide more qualitative support to content creators.<\/span>","<span data-v-f87c67ca=\"\">&nbsp;<\/span><b data-v-f87c67ca=\"\">Boom will join ZKSpace’s One-year anniversary carnival, giving away special NFTs to participants<\/b>","<span data-v-f87c67ca=\"\">As a partner of ZKSpace, Boom conducted a&nbsp; joint partnership with ZKSpace’s one-year anniversary carnival, giving away special NFTs to participants at the event. Along with ZKSpace, an all-featured layer 2 protocol using ZK-Rollups, the giveaway would be a limited edition NFT release by Boom and ZKSpace that will be operating on the Ethereum Network. The anniversary events will start from 14 February 2022 and end on 25 February 2022. To participate in this event and claim the precious limited edition NFT released by Boom and ZKSpace, users will need to follow the instruction below:<\/span>","<b data-v-f87c67ca=\"\">Boom Future Giveaways \/ Airdrops<\/b>","<span data-v-f87c67ca=\"\">In the future roadmap of Boom, the team is releasing Boom's official NFT in mid-April, 2022. The NFT is based on a concept created by the Boom Team. It began with an explosion that occurred on a planet in the solar system at the end of 2021. A new planet was born which we called Boom, composed of crypto lovers was born in the explosions. This group of crypto lovers performs their respective duties on the new planet and builds the planet’s ecosystem together. Among each respective character such as Whale, Influencer, Consumer, Creator, and Artist. As of now, Boom planet is issuing ID cards through airdrop to the first residents of the planet. There are several benefits included that are limited to community governance rights, personal brand exposure, product trial, exclusive exclusives bonuses, etc.<\/span>","<b data-v-f87c67ca=\"\">About Team Boom<\/b>","<span data-v-f87c67ca=\"\">About Boom was registered in Miami, Florida, the company was founded by a group of cyberpunk enthusiasts spreading across the United States, France, Sweden, the United Kingdom, and Malaysia. The founding members of Boom have different backgrounds but came together voluntarily out of common interest and vision.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Boom Community","content":"ORGANIZATION"},{"type":"$1M","content":"MONEY"},{"type":"Sweden","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Florida","content":"LOCATION"},{"type":"France","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"mid-April, 2022","content":"DATE"},{"type":"Miami","content":"LOCATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"Malaysia","content":"LOCATION"},{"type":"Future Giveaways \/ Airdrops","content":"ORGANIZATION"},{"type":"March 2022","content":"DATE"},{"type":"Crypto Tokens","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Google Play Store","content":"ORGANIZATION"},{"type":"February 2022","content":"DATE"},{"type":"Instagram","content":"LOCATION"},{"type":"Ethereum Network","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"United Kingdom","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}