{"summary":"A U.S. bankruptcy court must appoint an independent examiner to investigate the collapse of FTX, the Third Circuit Court of Appeals ruled.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273614\/ftx-must-be-investigated-by-independent-examiner-court-rules","publishDate":"2024-01-19T14:44:45","id":6061,"type":null,"title":"FTX must be investigated by independent examiner, court rules","category":["BANKRUPTCY"],"content":["<span data-v-f87c67ca=\"\">The Third Circuit Court of Appeals in Philadelphia ruled on Friday that FTX must be investigated by an independent examiner. An investigation was earlier requested by the U.S. Trustee overseeing the FTX bankruptcy but was opposed by FTX's current CEO and denied by the Delaware bankruptcy judge overseeing the process.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On Friday, that decision was remanded. An investigation by current CEO John Ray III is not enough, and an independent probe might shed new light on crypto industry practices, one of the appellate judges wrote in a precedential opinion.<\/span>","<span data-v-f87c67ca=\"\">Judge Luis Felipe Restrepo wrote that the examiner should not be an interested party or involved with the debtor. Regarding the current probe by Ray, there are concerns that FTX employees who may have engaged in fraud could still remain at FTX Group, and FTX lawyers, Sullivan &amp; Cromwell, used to be pre-petition advisors to FTX, the judge explained.<\/span>","<span data-v-f87c67ca=\"\">Appointing an examiner is required by the Bankruptcy Code, Restrepo wrote, if the debtor’s debts exceed $5 million, which is definitely the case with FTX. An independent investigation into FTX would be helpful for the crypto industry in general, the judge said.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"For example, an investigation into FTX Group’s use of its own cryptocurrency tokens, FTTs, to inflate the value of FTX and Alameda Research could bring this practice under further scrutiny, thereby alerting potential investors to undisclosed credit risks in other cryptocurrency companies,\" the opinion reads.<\/span>","<span data-v-f87c67ca=\"\">The matter was raised more than a year ago by the U.S. Trustee overseeing the case for the Justice Department but denied by the Delaware bankruptcy judge.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In December 2022, U.S. Trustee Andrew R. Vara asked the court to appoint an outside examiner who would investigate the crypto exchange's collapse independently from the current FTX CEO John Ray III. Ray opposed the motion saying that the probe he was leading was sufficient.<\/span>","<span data-v-f87c67ca=\"\">In February 2023, Judge John Dorsey denied the motion, saying that conducting two investigations in parallel would cost the estate too much.<\/span>","<span data-v-f87c67ca=\"\">\"I have no doubt that the appointment of an examiner would not be in the best interest of the creditors. Every dollar spent in these cases on administrative expenses is $1 less to the creditors,\" the judge said during a hearing last year.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"John Dorsey","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Delaware","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Ray","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"February 2023","content":"DATE"},{"type":"$1","content":"MONEY"},{"type":"Sullivan &amp; Cromwell","content":"ORGANIZATION"},{"type":"Restrepo","content":"PERSON"},{"type":"John Ray III","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"$5 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"Philadelphia","content":"LOCATION"},{"type":"Justice Department","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Third Circuit Court of Appeals","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"FTX Group’s","content":"ORGANIZATION"},{"type":"December 2022","content":"DATE"},{"type":"FTX Group","content":"ORGANIZATION"},{"type":"Andrew R. Vara","content":"PERSON"},{"type":"Luis Felipe Restrepo","content":"PERSON"}],"hashtag":["FTX"],"authors":["Anna Baydakova","The Block"]}