{"summary":"Brazil Central Bank President said CBDCs could eventually speed up international transactions and make them more efficient.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/258952\/brazils-central-bank-plots-next-moves-in-adoption-of-cbdcs-digital-payments","publishDate":"2023-10-23T11:58:44","id":6067,"type":null,"title":"Brazil&#x27;s Central Bank plots next moves in adoption of CBDCs, digital payments","category":["COMPANIES"],"content":["Brazil's central bank President Roberto Campos Neto sees one problem that is yet to be solved in the distributed ledger technology space as governments around the world experiment with the implementation of central bank digital currencies — bridging the delicate balance between open networks and privacy.&nbsp;","\"When you look at the CBDCs out there, they're not actually full DLTs. They are hybrid, which means that you have the DLT part inside the central bank, but then you have centralized for outside,\" he said Friday at a <a href=\"https:\/\/www.as-coa.org\/watchlisten\/bravo-symposium-brazils-payments-revolution-roberto-campos-neto\" data-v-f87c67ca=\"\">panel discussion<\/a> at the 2023 Council of the Americas Symposium and BRAVO Business Awards in Miami, where he was honored for his work in developing the country's <a href=\"https:\/\/www.theblock.co\/post\/250547\/buying-crypto-in-brazil-gets-easier-with-pix-payment-integration\" data-v-f87c67ca=\"\">digital payments platform<\/a> known as PIX.&nbsp;","\"DLT platforms were made by people that want an openness, so everybody can see what everybody else is doing,\" he continued. \"So the question is, how can you have a DLT platform so that you have the benefit of the nodes producing the registration and the contract without affecting the privacy issue? So this is the most challenging part. Nobody has solved this problem yet. I think we are very close to doing so.\"","Campos Neto said that CBDCs could eventually speed up international transactions and make them more efficient, without the need for a common currency,","\"If every country has a digital currency, and we are able to connect those currencies digitally, in a fast and secure way, you actually have achieved the goal of having a common currency without actually having to sacrifice your monetary policy,\" he said. \"We actually can connect centralized systems to DLT systems just as fast as DLT to DLT. So the idea that crypto is always going to be better than a system that connects CBDC is no longer true.\"","Brazil has been at the vanguard of digitals payments, passing new <a href=\"https:\/\/www.theblock.co\/post\/197036\/brazils-cryptocurrency-regulation-set-to-become-law-at-midnight\" data-v-f87c67ca=\"\">cryptocurrency regulation<\/a> last year and creating PIX, the almost free instant payment system that has skyrocketed in use. Campos Neto said there was a day this month on the PIX network that saw more than 170 million transactions, as it has now become the most popular payment system in the country.&nbsp;","In developing the country's digital real, known as <a href=\"https:\/\/www.bcb.gov.br\/en\/financialstability\/drex_en\" data-v-f87c67ca=\"\">Drex<\/a>, Campos Neto said he'd arrived&nbsp;at a solution he said would not impair the ability of banks to continue providing credit.","\"Our digital currency in Brazil is just a token, issued out of a deposit. So a bank blocks that deposit and issues a token on it. What's the advantage of that? Well, first it's much simpler and cheaper. Second, if you think about regulation, you don't need to do almost anything because you already have regulation for deposits. So this is just a digital deposit. So it inherits the regulation that you already have in place. Third part, which is very important, once you issue the concept of tokenization, we think the balance sheet of the banks, we have the thinking that the banks will be much more efficient.\"","He said Drex is not only good for payments, but that it also can improve processes around contracts and registration used in transactions like international real estate purchases, for example.","\"Today if you want to buy real estate in the U.S., your life is very hard. You have to have an escrow account, have to have a lawyer on one side, the lawyer on the other side. There is a lack of transparency, and it's very slow, and it costs a lot. So if you have a system that basically, you have a smart contract that is designed to do a payment of real estate, and it meets with encrypted code, which is the money that's actually been designed for that transaction, and it clicks, it generates a contract and a registration. And you don't need notaries in Brazil ... It improves a lot this process of contract and registration.\"","Campos Neto said he sees endless opportunities when it comes to new PIX features, because the platform is programmable.&nbsp;","\"You can do a lot of things when you have a programmable system,\" he said. \"So the programmability of money will allow you to do things like automatic payment, program payments.\"","\"I think that the credit card of the future, which is going to be programmable money, you're not going to have a card anymore. You're not going to be paying the big credit card companies the amount of money that you pay today, because you're going be able to do that in a much easier and faster way. I will say that in Brazil, I think the credit card environment will change a lot in the next three to four years.\"","He said that he believed current processes around tokenization of assets would be irreversible.&nbsp;","\"People will try to find a digital representation of assets and exchange into a platform that is more transparent, that is safer, that's faster and you can actually manage it better with the visibility, you can use the collateral there,\" he said.","\"For the countries that have not been able to have systems that are programmable and digital, they're going to lag behind a lot,\" he said. \"And I think it's already happening.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Miami","content":"LOCATION"},{"type":"Brazil","content":"LOCATION"},{"type":"Roberto Campos Neto","content":"PERSON"},{"type":"DLT","content":"ORGANIZATION"},{"type":"BRAVO Business Awards","content":"ORGANIZATION"},{"type":"Campos Neto","content":"PERSON"},{"type":"Drex","content":"PERSON"},{"type":"PIX","content":"ORGANIZATION"},{"type":"Drex","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Neto","content":"PERSON"}],"hashtag":["CBDCS"],"authors":["Nathan Crooks","The Block"]}