{"summary":"The purpose of yesterday&#x27;s congressional hearings was ostensibly for Facebook, Twitter, and (the absent) Google to discuss alleged bias in their","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/289\/mr-dorsey-goes-to-washington-muses-about-blockchain","publishDate":"2018-09-06T22:07:41","id":6069,"type":null,"title":"Mr. Dorsey goes to Washington, muses about blockchain","category":["LAYER 1S"],"content":["The purpose of yesterday's congressional hearings was ostensibly for Facebook, Twitter, and (the absent) Google to discuss alleged bias in their respective services. But while Facebook's Sheryl Sandberg and Twitter's Jack Dorsey <a href=\"https:\/\/www.recode.net\/2018\/9\/5\/17824744\/jack-dorsey-sheryl-sandberg-facebook-twitter-testimony-google-alex-jones-review\" data-v-f87c67ca=\"\">both acquitted themselves well overall<\/a>, it was the latter who hit on something of interest to The Block's readers.","Twitter has been battling with trolls, bots, and how to best handle community complaints about offensive or otherwise troublesome content. Dorsey was quick to admit after the hearing, the company hasn't always been successful. \"We failed our intended impartiality,\" he tweeted. \"Our algorithms were unfairly filtering 600,000 accounts, including some members of Congress.&nbsp;Bias in algorithms is an important topic. Our responsibility is to understand, measure, and reduce accidental bias due to factors such as the quality of the data used to train our algorithms.\"","Other than making a better Twitter, it was Dorsey's earlier testimony about&nbsp;<em data-v-f87c67ca=\"\">how&nbsp;<\/em>they might do this that intrigues. Doris Matsui of California asked specifically whether blockchain could help in the war against scams (including all the <a href=\"https:\/\/ci.covesting.io\/news\/cryptocurrency-news\/research-reveals-many-15000-crypto-scam-bots-twitter\" data-v-f87c67ca=\"\">phony crypto giveaways<\/a>) and bad information.&nbsp;","His reply was illuminating, suggesting blockchain could assist with distributed trust and&nbsp;<em data-v-f87c67ca=\"\">enforcement<\/em>. Core to the bias issue that has in Congress so upset is transparency at these social media sites is hard to come by. With Twitter accounts public by default, it's possible to see who \"likes\" what, the entirety of what a given account chooses to interact with, etc. But it's nearly impossible to do that in a systematic way.","More challenging still, is that if you want to know which accounts have been reported, suspended, etc. there's little visibility. Without designing Twitter's blockchain here, it's not hard to imagine how one could help. A public, accessible data repository that shows all the times an account was \"trusted,\" or reported, or generated unique new content, or merely retweeted from one of a handful of account (as bots tend to do), would go a long way toward making the very bias Dorsey hopes to combat easier to measure, audit, understand.","Still this is early days and he's up front about the fact Twitter isn't very far along in developing a blockchain solution.&nbsp;\"We haven't gone as deep as we'd like just yet in understanding how we might apply this technology to the problems we're facing at Twitter, but we do have people within the company thinking about it today.\"","In the end, that should make for a better Twitter tomorrow. And it might be an outstanding use case for showing how transparent, immutable blockchains can solve thorny problems that traditional methods haven't managed.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"California","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Sheryl Sandberg","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Doris Matsui","content":"PERSON"},{"type":"Dorsey","content":"PERSON"},{"type":"Jack Dorsey","content":"PERSON"}],"hashtag":[],"authors":["Steven Zheng","The Block"]}