{"summary":"Helsinki-based Tesseract raised $25 million in a Series A round last June.\nNow the business, previously focused on lending out institutional deposits, is rolling out a white-label platform.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/142786\/tesseract-unveils-yield-platform-to-help-mid-size-crypto-firms-compete-with-binance-and-coinbase","publishDate":"2022-04-21T05:49:43","id":607,"type":null,"title":"Tesseract unveils yield platform to help mid-size crypto firms compete with Binance and Coinbase","category":["Lending"],"content":["Tesseract has launched a platform to enable other crypto firms’ customers to earn yield on their holdings, as the Finnish lending firm branches out from its core institutional service into white labelling.","Tesseract co-founder and CEO Yichen Wu told The Block in an interview that the product — an API-based service called Tesseract Earn — went live in the past few months. The business has already signed up its first batch of customers for the white-label platform in Europe and Asia.","The Helsinki-based lender is targeting mid-sized crypto businesses — such as wallets and exchanges — that are competing with giants like Binance and Coinbase, but which often lack the resources to devise interest-bearing products on their own.","All of these companies are looking for “sticky” products to help retain their customers, according to Wu. “Yield products are a way to do it,” he said. “They will essentially be able to offer their clients a BlockFi, Celsius-esque product.”","Tesseract Earn will enable partners to offer interest-bearing products with a risk and return profile of their choosing. Tesseract will generate yield for end-users through three main avenues: borrowing and lending; market making and arbitrage-based strategies; and DeFi yield farming.","Wu described credit as “the unsexy part of crypto,” but added that it’s also one of the most difficult to crack.","“You have a lot of those retail-facing platforms that are out there, that in my personal opinion... are just like a semi-time bomb that is waiting to explode,” he said, pointing to the hedge fund-like activity that underpins such accounts and a lack of regulation as major concerns. Tesseract is supervised by the Finnish Financial Supervisory Authority.","Founded in December 2017, Tesseract has until now operated quietly as a B2B-only company focused on lending out deposits from institutions and sophisticated investors. Wu likened the business to Genesis, the US crypto trading heavyweight.","Its profile was boosted by <a href=\"https:\/\/www.theblockcrypto.com\/post\/108779\/finnish-crypto-lender-tesseract-25-million-investment\" data-v-f87c67ca=\"\">a $25 million Series A fundraise<\/a> led by Augmentum Fintech in June 2021. Half a dozen venture capital firms, including LeadBlock Partners, Coinbase Ventures and trading firm Wintermute, also participated in the raise.","Wu said that Tesseract was cash flow positive by the time the Series A funds came in, but chose to raise anyway — primarily to instil confidence in potential partners.","“When we started to deal with a lot of larger financial institutions, regulated entities… Their first line of reference point is: who has invested in you? Has any famous investor put a stamp on you, so we know you’re not a scam? Which is a silly thing, but it’s a strong signal to the market,” Wu explained.","Most of the $25 million is still sitting in the bank, he added.","Since the raise, Tesseract’s headcount has grown from 6 to around 40. Revenues and lending are also up substantially, with the firm’s outstanding loan book now in the hundreds of millions of dollars. Wu is hoping that the Earn platform — which he said takes aim at a “neglected market segment” — can help boost that number to a couple of billion dollars by year-end."],"hashtag":["LENDING"]}