{"summary":"FTX-backed NFT shop Limit Break said it&#x27;s the first company of its kind to buy time to advertise during the Super Bowl.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/208594\/ftx-backed-nft-company-airing-6-5-million-super-bowl-commercial","publishDate":"2023-02-03T15:47:25","id":607,"type":null,"title":"FTX-backed NFT company airing $6.5 million Super Bowl commercial","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">“Seinfeld” co-creator Larry David is unlikely to make an appearance at this year's Super Bowl after shilling for FTX during last year’s game, but <\/span><span data-v-f87c67ca=\"\">that doesn’t mean there won't be anyone with ties to the collapsed crypto exchange there promoting digital assets.<\/span>","<span data-v-f87c67ca=\"\">The NFT and gaming company Limit Break, backed by FTX in a funding round last year, spent $6.5 million for a 30-second advert that will air during this year’s Super Bowl, the company said in a statement. It’s the first time an NFT developer has purchased an ad during the Super Bowl, one of the most-watched events on television that brings in an audience of roughly 100 million people each year. <\/span>","<span data-v-f87c67ca=\"\">Limit Break will use its time to promote a “free” NFT tied to the web3 gaming ecosystem it has been developing. <\/span>","<span data-v-f87c67ca=\"\">Celebrities from David to Tom Brady promoted FTX but have been<a href=\"https:\/\/www.theblock.co\/post\/180530\/roblox-hollywoods-metaverse-safe-space-as-stars-retreat-from-crypto-winter\" data-v-f87c67ca=\"\">&nbsp;steering clear<\/a>&nbsp;of crypto for the most part since the exchange became marred in scandal late last year.<\/span>","<span data-v-f87c67ca=\"\">Limit Break’s not counting on VIP celebrity endorsements. Instead, its upcoming ad will feature an animated princess and a baby dragon promoting its “free-to-play” gaming model and “free-to-own” digital collectibles strategy.&nbsp;&nbsp;<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","<em data-v-f87c67ca=\"\">Screenshot from upcoming Super Bowl advertisement. Source: Limit Break.<\/em>","<span data-v-f87c67ca=\"\">Limit Break’s Super Bowl NFT mint is intended to bring new users into its “crypto community,” the company said. The NFTs will be part of DigiDaigaku, which Limit Break describes as “a digital collectible series of anime-style characters” that it hopes will help introduce people to what it calls a “new ‘free-to-own’ gaming model.\"<\/span>","<span data-v-f87c67ca=\"\">A web3 gaming startup developing massively multiplayer online (MMO) games, Limit Break announced last August it had raised $200 million over two rounds of venture funding. Crypto exchanges FTX and Coinbase participated in the fund raise, according to Limit Break.<\/span>","<span data-v-f87c67ca=\"\">The founders of Limit Break were previously top executives at the mobile gaming firm Machine Zone, which created free-to-play games such as Game of War, Mobile Strike and Final Fantasy: XV.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The football game featuring the Kansas City Chiefs and Philadelphia Eagles is set for Feb. 12.<br data-v-f87c67ca=\"\">\n<\/span>","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/i>","<em data-v-f87c67ca=\"\">(Updates story to add disclaimer in last paragraph.)<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Machine Zone","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"David","content":"PERSON"},{"type":"Larry David","content":"PERSON"},{"type":"Feb. 12","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Tom Brady","content":"PERSON"},{"type":"$6.5 million","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"VIP","content":"ORGANIZATION"},{"type":"Philadelphia Eagles","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"December 2022","content":"DATE"},{"type":"$200 million","content":"MONEY"},{"type":"Michael McCaffrey","content":"PERSON"},{"type":"Kansas City Chiefs","content":"LOCATION"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["RT Watson","The Block"]}