{"summary":"ConsenSyss Layer 2 Linea is following in the footsteps of similar networks like Arbitrum by running campaigns designed to boost activity.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229087\/consensyss-layer-2-linea","publishDate":"2023-05-02T10:47:09","id":6070,"type":null,"title":"ConsenSys Layer 2 Linea adds loyalty NFT campaign to drive adoption","category":["CRYPTO ECOSYSTEMS"],"content":["ConsenSys-built <a href=\"https:\/\/www.theblock.co\/post\/228112\/recursive-looks-to-connect-rollups-with-eigen-layer-based-omni-network\" data-v-f87c67ca=\"\">Layer 2 network Linea<\/a> is introducing a <a href=\"https:\/\/galxe.com\/Linea\/campaign\/GCzWYUZXj4\" data-v-f87c67ca=\"\">loyalty NFT campaign<\/a> to boost activity on its testnet.","The <a href=\"https:\/\/galxe.com\/Linea\/campaign\/GCzWYUZXj4\" data-v-f87c67ca=\"\">program<\/a> will reward users with NFTs for performing certain tasks related to using the testnet, according to a <a href=\"https:\/\/blog.galxe.com\/linea-voyage-public-testnet-quest-with-galxe-fd58e6958114\" data-v-f87c67ca=\"\">blog post<\/a>. The plan aims to help stress the network and test activities at scale ahead of the network’s mainnet launch expected in the coming months.&nbsp;","The weekly challenges will involve using bridging protocols built on the Linea testnet including Hop Protocol, Celer Network, Multichain and Connext. Bridging refers to the transfer of digital assets across different networks.","The campaign follows similar ones run by Layer 2 networks Arbitrum, Optimism and Polygon that all used the loyalty platform Galxe, which will also be used by Linea.","The campaigns have often resulted in large increases in activity on Layer 2 networks, sometimes causing congestion on the network. Arbitrum’s Odyssey campaign even resulted in fees temporarily rising higher than on the Ethereum mainnet, a suboptimal result for a supposed scaling solution.&nbsp;","The programs have been targeted by <a href=\"https:\/\/www.theblock.co\/post\/225215\/we-made-close-to-1-million-inside-the-murky-world-of-airdrop-farming\" data-v-f87c67ca=\"\">airdrop farmers<\/a> who use networks in the hope of meeting requirements to receive valuable tokens in the future. While the campaigns have not been directly used as criteria for receiving airdrops, using the networks to do the outlined tasks may have boosted chances of getting them.","Layer 2 networks including Optimism and, most recently, Arbitrum, have conducted airdrops that <a href=\"https:\/\/www.theblock.co\/post\/225215\/we-made-close-to-1-million-inside-the-murky-world-of-airdrop-farming\" data-v-f87c67ca=\"\">resulted in windfalls<\/a> for some earlier users.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Connext","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Arbitrum","content":"LOCATION"},{"type":"Linea","content":"LOCATION"},{"type":"Celer Network","content":"ORGANIZATION"},{"type":"2023","content":"DATE"}],"hashtag":["ZKEVM"],"authors":["Tim Copeland","The Block"]}