{"summary":"&#x27;Sadly, our good faith to cooperate with the liquidators was met with baiting,&#x27; Zhu Su says in his first tweet in nearly four weeks.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157058\/three-arrows-capitals-zhu-su-breaks-silence-accused-liquidators-of-baiting","publishDate":"2022-07-12T06:39:04","id":6072,"type":null,"title":"Three Arrows Capital&#x27;s Zhu Su breaks silence, accuses liquidators of &#x27;baiting&#x27;","category":["LEGAL"],"content":["Zhu Su, co-founder of the embattled crypto hedge fund Three Arrows Capital (3AC), spoke out on Tuesday morning on Twitter, following nearly a month of silence on the status of the future of funds connected to his business.","As speculation swirls about his and co-founder Kyle Davies' whereabouts, Zhu <a href=\"https:\/\/twitter.com\/zhusu\/status\/1546801270014758912\" data-v-f87c67ca=\"\">tweeted<\/a>: “Sadly, our good faith to cooperate with the liquidators was met with baiting.”","US bankruptcy court papers had shown on Friday that the pair had “failed to cooperate” in 3AC’s liquidation process. Teneo, an advisory firm, has been working to preserve the hedge fund’s assets following a spectacular collapse.","3AC had been a victim of the market-wide crypto selloff last month. As its balance sheets were hit, it began insolvency proceedings <a href=\"https:\/\/www.theblock.co\/post\/154809\/three-arrows-capital-liquidation-teneo\" data-v-f87c67ca=\"\">in the British Virgin Islands<\/a>, which was followed by a Chapter 15 bankruptcy filing in the US.&nbsp;","Zhu, today, tweeted screenshots of emails which appear to be from 3AC lawyers, Advocatus Law LLP. The first argues that creditors have failed to engage with the process of liquidation “in good faith.”","“It has come to our clients' attention that you have made an application in the United States of America, alleging that they have not been cooperating with you in any meaningful way, and detailing some of the discussions, and the manner in which we had them, on 8 July 2022,” wrote Christopher Anand Daniel, managing partner of Advocatus.","“It now appears clear why your Singapore solicitors were keen to ask if the discussions were on a 'without prejudice' basis. It was to use the discussions in Court filings without notice to our clients.”","The second screenshot addresses the company’s relationship with the Israeli crypto startup StarkWare — and whether 3AC’s liquidators had exercised the right to buy a StarkWare token. 3AC had <a href=\"https:\/\/www.theblock.co\/post\/148672\/starkware-raises-series-d-funding-8-billion-valuation\" data-v-f87c67ca=\"\">invested in<\/a> the business, which recently hit a valuation of $8 billion, and provides tech for Ethereum scalability and permissionless, decentralized ZK-rollups for deploying smart contracts.","“Our clients, as you know, besides being former directors of the company, are also investors, and shareholders of the company. One of our clients, Mr Zhu Su, is also a creditor,” Daniel wrote.","“In these capacities, they are extremely concerned by the Liquidators' failure to exercise StarkWare's token purchase offer (\"StarkWare Exercise\"), a fact that was confirmed by you in the call on 8 July 2022.”","The Block has contacted Advocatus and Starkware for comment.","<em data-v-f87c67ca=\"\">Update 7:15 a.m. ET: story updated throughout with additions.&nbsp;&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Daniel","content":"PERSON"},{"type":"Kyle Davies","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"United States of America","content":"LOCATION"},{"type":"Teneo","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Advocatus Law LLP","content":"ORGANIZATION"},{"type":"morning","content":"TIME"},{"type":"US","content":"LOCATION"},{"type":"Court","content":"LOCATION"},{"type":"7:15 a.m.","content":"TIME"},{"type":"British Virgin Islands","content":"LOCATION"},{"type":"Zhu Su","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Christopher Anand Daniel","content":"PERSON"},{"type":"July 2022","content":"DATE"},{"type":"$8 billion","content":"MONEY"}],"hashtag":["SU ZHU","THREE ARROWS CAPITAL"],"authors":["Lucy Harley-McKeown","The Block"]}