{"summary":"The Blockchain Transparency Institute yesterday tried to figure out the truth around trading at leading crypto exchanges. And what they found was","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267\/crypto-exchanges-keep-reporting-fake-trades-but-the-top-dogs-tell-the-truth","publishDate":"2018-08-29T17:18:14","id":6076,"type":null,"title":"Crypto exchanges keep reporting fake trades, but the top dogs tell the truth","category":["EXCHANGES"],"content":["The&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Blockchain Transparency Institute&nbsp;<\/em>yesterday tried to figure out the truth around trading at leading crypto exchanges.&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.blockchaintransparency.org\/reports\/\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.blockchaintransparency.org\/reports\/\" data-v-f87c67ca=\"\">And what they found was sobering<\/a>, if unsurprising: Some of the “leading exchanges” in crypto are doing far less volume than they claim. Overall the folks at BTI suggest up to two-thirds of crypto trades might be faked, using techniques like “wash sales” where tokens are sold and repurchased over and over again by the same entities.","There is, however, good news in the report. Using unique visitor accounts from ostensibly reliable third-party web traffic data, BTI concluded that the biggest exchanges were typically the ones least likely to report phony trading volumes. The trading volume reported by sites with more than 1M visitors monthly was only off by about 11%. And given that BTI’s methodology is imprecise, it could be even smaller. Top three exchanges Binance, Bitfinex, and Coinbase Pro all appear to be reporting trading volume accurately, BTI says.","BTI’s finding&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/medium.com\/@sylvainartplayribes\/chasing-fake-volume-a-crypto-plague-ea1a3c1e0b5e\" target=\"_blank\" rel=\"noopener\" data-href=\"https:\/\/medium.com\/@sylvainartplayribes\/chasing-fake-volume-a-crypto-plague-ea1a3c1e0b5e\" data-v-f87c67ca=\"\">confirm work done back in March by Sylvan Ribes<\/a>. He found that $3 billion in allegedly reported volume at the time simply didn’t exist. The five largest exchanges combined don’t average $3 billion right now, so that helps place the number in context. (Though it’s worth noting average token prices were higher in March, so fewer trades equalled more volume when measured in dollars).","In the BTI report, some credit was given to Bittrex, Kucoin, Cryptopia, and Bithumb. Why? Because their visitor counts might allow them to plausibly claim higher trading volumes than they do, i.e. their average visitor trades less than the typical crypto trader. While that points out a limitation of this research — specifically that using visitor counts as a proxy for what’s truly going on ignores differences in exchanges — it also helps flag the worst offenders.","Topping that rogues gallery are Coinex, Bibox, and ZB — the latter of which might be over-reporting volume by nearly 400x! But BTI also flagged Huobi, which is&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/cointelegraph.com\/news\/report-huobi-acquires-controlling-share-in-investment-company-via-backdoor-listing\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/cointelegraph.com\/news\/report-huobi-acquires-controlling-share-in-investment-company-via-backdoor-listing\" data-v-f87c67ca=\"\">attempting to go public through a backdoor method<\/a>&nbsp;and also is quite possibly inflating orders by 10x. Ribes was worried in March that “as it stands the state of crypto is arguably a testament to the failure of the free-market.” Huobi trading publicly with questionable books suggest the failures could continue for some time.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cryptopia","content":"LOCATION"},{"type":"$3 billion","content":"MONEY"},{"type":"Bitfinex","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"11%","content":"PERCENT"},{"type":"Bithumb","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Kucoin","content":"PERSON"},{"type":"BTI","content":"ORGANIZATION"},{"type":"Bittrex","content":"LOCATION"},{"type":"Sylvan Ribes","content":"ORGANIZATION"},{"type":"Huobi","content":"PERSON"},{"type":"Blockchain Transparency Institute","content":"ORGANIZATION"},{"type":"Bibox","content":"LOCATION"}],"hashtag":[],"authors":["John Biggs","The Block"]}