{"summary":"DWF Labs exploded onto the crypto scene earlier this year. But it’s been around for longer than you might think.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/268542\/the-origin-story-of-crypto-trading-firm-dwf-labs","publishDate":"2023-12-20T09:46:35","id":608,"type":null,"title":"The origin story of crypto trading firm DWF Labs","category":["CRYPTO ECOSYSTEMS"],"content":["It was in 2018 when Andrei Grachev had a tricky problem to solve.&nbsp;","At this time, Grachev was still somewhat new to crypto. Born in Uzbekistan, company records show, he had studied organizational management at Orenburg State University before spending two years as an oil trader, according to his <a href=\"http:\/\/web.archive.org\/web\/20210310010301\/https:\/\/vrm.trade\/team\/ag\" data-v-f87c67ca=\"\">archived biography<\/a>. In 2016, he got into crypto through running a small mining farm and making some personal trades. Two years later, he was the CEO of Huobi Russia at just 30 years old. His only problem? He needed trading volume, he later told <a href=\"https:\/\/www.theblockbeats.info\/news\/45416?from=telegram\" data-v-f87c67ca=\"\">BlockBeats<\/a>, and he needed it soon.","A lawyer that Grachev knew provided him with the solution. She mentioned that a small high-frequency trading firm in Switzerland was looking for low rates on exchanges — according to Grachev’s recent interview with the <a href=\"https:\/\/www.youtube.com\/watch?v=z44uUrygcqE\" data-v-f87c67ca=\"\">Steady Lads podcast<\/a> — something that would have a big impact on its profitability from trading.","Grachev seized upon the opportunity, but it presented another hurdle. Huobi Russia was a local exchange officially licensed by Huobi Global (now called HTX) through its cloud program. This meant it was able to use its branding, its software and its trading liquidity, but it had to get approval for big decisions, such as token listings and customer rates, according to a person familiar with the company. It took two months, Grachev told BlockBeats, for him to persuade the exchange to let him give the Swiss HFT firm preferential rates, allowing it cheap access to Huobi’s liquidity via the Russian proxy.","On its first day, the HFT firm deposited only $50,000, but by the end of the day it had done $10 million of trading volume. The next day, that figure rose to $22 million. “This is crazy,” Grachev reflected, speaking with BlockBeats.&nbsp;","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Andrei Grachev speaking at an event by Huobi Russia. Image: Huobi Russia.<\/span><\/em>","Grachev made sure to tout recent trading volume when Huobi Russia was <a href=\"https:\/\/www.prnewswire.com\/news-releases\/huobi-has-officially-launched-huobi-russia-300762261.html\" data-v-f87c67ca=\"\">officially launched<\/a> on Dec. 8, 2018, attributing it to high interest from the Russian community.","Little did Grachev know that this would be the start of a strong partnership that would eventually see him join forces with the young HFT firm to create one of the most influential — and controversial — companies in crypto, impacting more than 400 projects and purportedly splashing around hundreds of millions of dollars. A company that would result in Grachev’s own rise to prominence, attracting the attention and scrutiny of the entire crypto community. The company would be known as DWF Labs, and this is its origin story.","Three days after Huobi Russia’s official launch, and two thousand and five hundred miles away, the HFT firm was legally registered in Risch, Switzerland. Company records show it was named Digital Wave Finance, and its stated purpose was for market-making and proprietary trading purposes.&nbsp;","The HFT firm was run by Marco and Remo Schweizer — brothers, according to a person who knows them — and Michael Rendchen. All three were traders and had worked closely together at market-making firm IMC Trading, where they had become proficient in automated trading strategies. Their goal was to apply these types of strategies to crypto.","Marco Schweizer is an individual with little online presence. The person said he is around medium height with dark hair and did a PhD in physics at ETH Zurich University (the university declined to comment). They described him as money-focused “in a very extreme way,” with strong desires to become a billionaire.&nbsp;","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Digital Wave Finance's logo. Image: Digital Wave Finance.<\/span><\/em>","The person outlined Remo Schweizer as similar but slimmer, often wearing a baseball cap to cover his thinning hair, and said that he had previously studied computer science. As for Rendchen, he natively speaks Polish and German, according to his LinkedIn profile, and his profile photo shows that he also has dark hair and sports a thick beard.","Throughout 2019, Digital Wave Finance continued trading on Huobi Russia, as it ramped up its operations.","In December, a separate entity called Digital Wave Assets was set up in Zug, with early board members including Remo Schweizer, Rendchen and Louis Bisang, an original board member of Digital Wave Finance. Shortly after it was created, Marco Schweizer said the company was responsible for money from third parties, according to internal messages seen by The Block.","At this point, Digital Wave Finance had millions of dollars of interest from third parties, the messages show, but the trading firm turned down external funds in its early days as it had reached capacity with its own funds. The company would later state in pitch decks and publicly that it had no external investors.","Bisang left Digital Wave Finance in June 2020. During the year, Digital Wave Assets morphed into an asset management and securitization firm called Digital Waves, with Bisang as chairman according to his LinkedIn profile and company records, and it would later become regulated by the self-regulatory body VQF, per its website.","“We are aware about Digital Wave Finance\/DWF Labs, individual shareholders have had limited relationships with both companies. However, there has never been any active business, collaboration or transaction between Digital Wave AG (DWA) on one hand and DWF\/DWF Labs on the other hand,” said Tobias Straube, COO of Digital Waves.","During this time, Grachev had had a challenging year.&nbsp;","In February 2019, Grachev spoke at an event organized by the DealShaker platform, which was very closely connected with the <a href=\"https:\/\/www.justice.gov\/usao-sdny\/pr\/co-founder-multibillion-dollar-cryptocurrency-scheme-onecoin-sentenced-20-years-prison\" data-v-f87c67ca=\"\">$4 billion Pyramid Scheme OneCoin<\/a>, <a href=\"https:\/\/forklog.com\/news\/glava-huobi-russia-prinyal-uchastie-v-konferentsii-svyazannoj-s-onecoin-sotrudnichestvo-s-proektom-on-otritsaet\" data-v-f87c67ca=\"\">according to an article by local outlet Forklog<\/a>, translated through Google Translate and confirmed by a Russian speaker. This followed a previous meeting, which Grachev described as a training seminar, Forklog said. Grachev told the publication he did not know about its connection with OneCoin.","In April, Forklog published a <a href=\"https:\/\/forklog.com\/exclusive\/who-is-mr-grachev-soobshhestvo-obvinilo-glavu-huobi-russia-v-masshtabnom-moshennichestve\" data-v-f87c67ca=\"\">second article<\/a> referencing a video call with OneLife, one of the companies behind OneCoin. In the video, which is no longer available on YouTube, Grachev reportedly said negotiations about listing OneCoin on Huobi had been ongoing for almost a month and that he was confident a deal could be struck by the second quarter of the year. Grachev told Forklog that the exchange had not received any applications or documents for listing the token but did not comment on the statements he had made.","In the second article, Grachev also faced accusations that he had failed to repay a debt of $10,000 to the owner of an asset management company, per Forklog, and that he hadn’t repaid investors who had coughed up $157,000 for his 2018 ICO project called Export.Online — the closure of which was <a href=\"https:\/\/medium.com\/@exportonline\/some-important-news-for-you-1a174c03b3e6\" data-v-f87c67ca=\"\">described<\/a> as a “quantum leap” in development.&nbsp;","By September, Grachev was no longer CEO of Huobi Russia, although he remained working there as a partner for another year, according to a recent interview with <a href=\"https:\/\/en.foresightnews.pro\/foresight-interview-with-dwf-labs-founder-innovators-forge-ahead-leaving-the-old-hat-market-makers-behind\/\" data-v-f87c67ca=\"\">Foresight News<\/a>. He was replaced as CEO by Vladimir Demin, according to a <a href=\"https:\/\/www.prnewswire.com\/news-releases\/huobi-global-drives-deeper-into-russia-partnership-301116361.html\" data-v-f87c67ca=\"\">press release<\/a> at the time.&nbsp;","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Marketing for Jiamix said it would rock the crypto world. Image: Jiamix.<\/span><\/em>","During his time at Huobi Russia, Grachev met Zac Zou, director of regional marketing at crypto exchange OKEx (now called OKX). On Sept. 15, Grachev launched a similar cloud-based local exchange, but this time in partnership with OKEx. The exchange was called Jiamix, and was also based in Moscow, according to <a href=\"https:\/\/coinmarketcap.com\/exchanges\/jiamix\/\" data-v-f87c67ca=\"\">CoinMarketCap<\/a>. Its website described it as “the exchange of new opportunities,” while marketing copy said it would rock the crypto world. An OKX spokesperson recently told The Block that Jiamix was a broker and that it was never part of OKX or a branch of it.","It would shut down two years later.&nbsp;","In 2020, Digital Wave Finance picked up further momentum, expanding to the Korean market and Japanese exchanges.","Around this time, Marco Schweizer phoned up his former IMC colleague Clement Florentin and asked if he wanted to work together, according to an <a href=\"https:\/\/open.spotify.com\/episode\/75gO9CAcdCY2dRgWtAsb34?si=3fbqewdiSlSqF-92ypOAcw\" data-v-f87c67ca=\"\">interview<\/a> Florentin did last year with liquidity network Paradigm. Florentin — who was born on the Ile de Ré, a small island on the west coast of France <a href=\"https:\/\/www.ripleys.com\/weird-news\/donkeys-wear-pajamas\/\" data-v-f87c67ca=\"\">known for Donkeys wearing pajamas<\/a> — was an experienced quant trader, albeit not then focused on crypto.","Florentin flew to Switzerland, where the Schweizers had set up what Florentin described as a “Facebook house.” It was a chaotic place with dogs running around, where you pick a bed, find a space to put your laptop and just start coding. A person who visited the house said it was located in the south part of Zug, and the whole situation was summarized by the URL used to access the intranet, which contained the phrase “house of dogs.”","“When we started, we all started in the same big house, living and working together; it was a bit weird,” Florentin said in the interview.","Here they decided that Digital Wave Finance would continue targeting spot and futures trading, while Florentin would establish his own brand, Darley Technologies, to focus on options trading, exotic derivatives and requests for quotes (RFQs) — a means of getting quotes from multiple liquidity providers. Florentin wanted the option of getting exposure to third parties for RFQs and the ability to build out his own trading desk, he said.&nbsp;","“That’s the reason why we have two brands but then the teams are a bit the same,” he said in the interview, noting that they can be seen as sister companies. “For us we have two names but we don’t see it that way. We really see it more as one big family.”","Toward the end of 2020, Digital Wave Finance was seeing early results.&nbsp;","The HFT firm was operating on more than 10 exchanges, according to profit and loss documents seen by The Block, including two exchanges tied to Grachev:&nbsp;Huobi Russia and Jiamix. While it was largely only seeing results on Binance and Huobi’s futures platforms, it brought in more than $1 million of profit in September, the documents show.&nbsp;","Over time it built up quite a warchest. “Early success gave access to $50 million of capital,” said a person familiar with the company’s operations.","In December, Huobi Russia shut down and was replaced by an exchange called CDAX that was still providing access to Huobi’s liquidity in Russia, as noted by Jakub Rehor, co-founder of crypto trading firm Lucy Labs, <a href=\"https:\/\/github.com\/ccxt\/ccxt\/issues\/8112\" data-v-f87c67ca=\"\">on GitHub<\/a>. Grachev later told Foresight News that he sold “Huobi Russia” back to Huobi for a “substantial profit.”","It was around this point when Grachev and Digital Wave Finance became more closely intertwined. Just prior to Huobi Russia’s closure, Grachev had set up a Latvian entity called Vroom and launched a website under the name VRM Trade (while at times the project was also called Vrooom, according to two documents).&nbsp;","“We started talking to each other and [became] friends,” he later said on the <a href=\"https:\/\/www.youtube.com\/watch?v=z44uUrygcqE\" data-v-f87c67ca=\"\">Steady Lads podcast<\/a>. Grachev helped Digital Wave Finance to integrate with other exchanges and get suitable fees because of his connections in China, he recalled. With the joint venture, the HFT firm was responsible for trading tokens on major exchanges, while Grachev was responsible for interactions with exchanges and trading tokens on smaller ones.","VRM Trade was an “artificial brand” of Digital Wave Finance, Grachev would later describe in an interview with The Block in April 2023. On LinkedIn and in interviews, Grachev would say that VRM Trade began in 2018, when Digital Wave Finance did. This was shown by <a href=\"http:\/\/web.archive.org\/web\/20201127194834\/https:\/\/vrm.trade\/\" data-v-f87c67ca=\"\">its website<\/a> that listed $9 million of average daily trading volume in 2018, $440 million per day in 2019 and $1.7 billion per day in 2020 — all volume clearly belonging to Digital Wave Finance, as VRM Trade had only just launched.&nbsp;","VRM Trade still had its own blueprints though. One of its main strategies was to incubate other trading firms, scouting for talent. It would provide Digital Wave Finance’s low rates on exchanges, plus some funding, and any success stories would result in a joint venture providing VRM with 30-49% of the company. “What are positive results? Very simple. It is profit, nothing else!” the website said, <a href=\"http:\/\/web.archive.org\/web\/20210310010953\/https:\/\/vrm.trade\/research\" data-v-f87c67ca=\"\">archived versions<\/a> show.","It was certainly a lucrative offer. By this point, Digital Wave Finance was operating on even more exchanges, with high levels across the board. It had VIP 7 status on Bitfinex and OKEx and negative maker fees on at least seven exchanges, according to an internal document seen by The Block. A person familiar with its operations said that its trading volume was so high it was paying a few hundred thousand dollars in fees per day on Huobi, even with the lowest rates.","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">VRM Trade offered access to high tiers across many crypto exchanges. Image: VRM Trade.<\/span><\/em>","Such status comes with great benefits. The highest tiers at crypto exchanges offer the lowest rates for trading. For instance, the HFT firm’s maker fees (for placing trades) on Binance were -0.002% and its taker fees (for accepting trades) were 0.0157%. This made it far cheaper for the company and anyone using Digital Wave Finance’s sub-accounts to run high-frequency and other trading strategies. In a later <a href=\"https:\/\/weblock.medium.com\/recap-weblock-ama-session-with-the-world-leading-multi-billion-dollars-trading-team-vrm-206f5da710fa\" data-v-f87c67ca=\"\">interview with WeBlock<\/a>, Demin — who replaced Grachev at Huobi Russia and was a co-founder of VRM Trade — would say the company had worked with 30 such teams.","It seems VRM Trade had big ambitions, as shown by an internal document obtained by The Block. The company laid out its intentions for VRM Group to become the most influential unicorn crypto group — by investing in the next crypto unicorn company — with an inner circle forming a “decentralized Wall Street.”","The plan was to see its valuation rise to $100 million by 2021, and its core goal was to become “the most influential company that attracts all the talents and [dominates] the crypto world.”","VRM Trade’s ambitions began with a pitch for a financial ecosystem of products, all tied together around a token.","“The prime and unique idea of this project is to fulfill a growing market demand for fast trading of large chunks of crypto assets,” stated the project’s pitch deck. It said this would allow brokers and institutional players to quickly sell amounts of crypto worth more than $100,000 without moving the price on the open market.&nbsp;","The project was called Black Ocean and it consisted of a dark pool without any market data for institutions and a liquidity pool for brokers. At the heart of this — an “essential part of VRM’s business,” the deck stated — was the fly token. The exchange’s users would get discounts if they held between 1-3 million fly tokens and used further tokens for paying fees.","The deck stated that there would be 1.7 billion fly tokens in total, with the supply distributed among investors, customers, the team and advisors. Strategic partners were to get 5% of the token supply at an 80% discount.","The token went live in January 2021, and Grachev was very optimistic about its prospects. “It is going to be implemented into the whole ecosystem + listed on 10–15 exchanges around the world,\" he told WeBlock a few months later, adding that he would like it to be in the top 20 cryptocurrencies by market capitalization on CoinMarketCap by the end of the year.","Grachev’s connections he made with exchanges when working at Huobi Russia were a key part of this plan. The pitch deck listed Shawn Chong, a consultant at Huobi, on its team with Zou from OKEx and Euguene Ng, sales and business development director at Gemini, as advisors. One source familiar with the matter, however, cast doubt on whether Zou knew he was going to be named in the deck. The deck also listed both of Lucy Labs' co-founders, Rehor and George Chuang, as advisors.","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The pitch deck listed Black Ocean's advisors and the companies that they worked for. Image: VRM Trade.<\/span><\/em>","The company also had its own exchanges to give it support. An internal document obtained by The Block shows that it referred to CDAX — the exchange that cropped up when Huobi Russia was disbanded — as VRM Trade’s own exchange, alongside Jiamix.","Another internal document explained how Black Ocean’s potential clients would navigate the legal challenges of working with crypto at the time. It said clients would pass know-your-customer procedures and sign an agreement with one of VRM Trade’s entities to get access to crypto-crypto trading, plus trading against the U.S. dollar and the euro.","“By the way, these customers may trade on other markets, e.x. crypto\/RUB, but RUB withdrawal and deposit functions before signing a special agreement with a special legal entity will be unavailable (it’s like a Bithumb scheme - you may trade against KRW, but [if] you want to withdraw or deposit KRW, you have to pass additional requirements),” it added.","By March 14, 2021, VRM Trade had raised $4.3 million for Black Ocean, according to a <a href=\"https:\/\/coinpedia.org\/press-release\/black-ocean-closed-institutional-financial-round\/\" data-v-f87c67ca=\"\">press release<\/a>. Investors included VC firms NGC Ventures, FBG Capital and LD Capital. The release stated that Black Ocean would be launched in the second quarter of that year.","Only nothing ever went live.","“There wasn’t anything real that came out of that. The project lasted a year and then died,” said a person familiar with the company’s operations, adding, “None of the investors got reimbursed.”&nbsp;","The person said the company tried to build the exchange in a regulated way, even bringing on tactical hires to get it licensed in Gibraltar, but this was never achieved. While Russian and Korean developers did work on the code, no trades were ever made, they said.","VRM Trade said that it created a launchpad for “completely risk-free” initial decentralized exchange offerings, according to a <a href=\"https:\/\/www.prnewswire.co.uk\/news-releases\/fly-the-risk-free-launchpad-solution-for-protecting-money-when-investing-in-an-ido-820752353.html\" data-v-f87c67ca=\"\">press release<\/a> by Black Ocean in August. The idea was that, if the token price didn't perform well enough once launched, then investors would get their money back. The press release gave an example where a token doubled upon launch, but this token performance wasn’t acceptable and to “keep the community in profit,” investors were given their money back.&nbsp;","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The token launchpad was designed as \"risk-free\" the project claimed. Image: Black Ocean.<\/span><\/em>","Internal messages obtained by The Block show that Grachev said, from January 2022 onwards, new projects for the launchpad would need to agree on five conditions, including that the token price must increase by three times after the listing. If not, VRM Trade wouldn’t send the funds raised to the project. Another condition was that VRM Trade would need to know clearly “how the project will manage liquidity and pump,” stating that he should be involved in these discussions.","The press release also noted that the fly token’s price had risen 170% the previous weekend, while trading volume had increased. “Fly is expected to continue to increase on the back of new partnerships and services coming to market, definitely one to watch for the future,” it said at the time.","A company called VRM Korea would later <a href=\"https:\/\/medium.com\/@flyeco\/fly-ama-8653c7c0ef8d\" data-v-f87c67ca=\"\">acquire<\/a> the fly token project, which remains <a href=\"https:\/\/twitter.com\/FrankLinYield\/status\/1721754726482759798\" data-v-f87c67ca=\"\">in development<\/a>. The token’s price has flatlined since early 2022, down 99.5% from its all-time high.","Demin and Chong were long gone from the project, according to a person familiar with the company, by June 2022 when the VRM Trade branding was scrapped. At the same time, Grachev set up a Singapore entity for DWF Labs, which would take up the mantle as the public face of Digital Wave Finance. Grachev, the Schweizers and Rendchen were the initial shareholders.","At some point between July and October, Demin removed the line in his biography on his personal website that said he was chairman of the board of directors of VRM, according to <a href=\"https:\/\/web.archive.org\/web\/20220701000000*\/https:\/\/vladimir-demin.ru\" data-v-f87c67ca=\"\">archived versions<\/a> of the Russian version of his website.","In September, DWF Labs was <a href=\"https:\/\/cryptonews.net\/news\/finance\/11756069\/\" data-v-f87c67ca=\"\">officially launched<\/a>. This marked the beginning of its more active approach in the crypto markets, culminating in a rapid increase in deal flow and public awareness. DWF Labs was formed with a large number of sales representatives, said a person familiar with its operations, as its goal was to bring in business while the two sister companies carried out a lot of the trading work behind the scenes.","“DWF stands for Digital Wave Finance. We represent a new wave in Web3 Venture Capital investment. DWF Labs aligns its efforts with our customers’ business objectives to help their tokens get the best listing price, raise funds and create markets,” Grachev said <a href=\"https:\/\/www.nftgators.com\/web3-vc-and-market-maker-digital-wave-finance-launches-dwf-labs\/\" data-v-f87c67ca=\"\">at the time<\/a>.","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Andrei Grachev working out of his office in DWF Labs' early days. Image: <a href=\"https:\/\/twitter.com\/ag_dwf\/status\/1589642430080778240\/photo\/1\" data-v-f87c67ca=\"\">Andrei Grachev via X<\/a>.<\/span><\/em>","DWF Labs soon expanded to Seoul, South Korea, with former FTX consultant Harvey Kim running its operations there. In documents prepared for prospective clients, the trading firm would later list Korean exchanges including Upbit, Bithumb and Coinone among supported venues. Currently, foreign entities are prohibited from trading in Korea, and arbitrage is limited, leading to greater volatility in its markets. Despite these challenges, DWF Labs had a big focus on working with projects that were listed on Korean exchanges, according to a prospective client.&nbsp;","Grachev would <a href=\"https:\/\/twitter.com\/ag_dwf\/status\/1729044335658946804\" data-v-f87c67ca=\"\">later claim<\/a> that this was done compliantly. “For example - we support our portfolio companies on Korean markets. It is super tricky for everyone, but we are able to do it properly and in a compliant way. Be creative, not biased - this is our philosophy. High standards of services are beneficial for the whole industry,” he said on X.","Grachev, more generally, appeared to acquire a taste for trading in Asia. While poking fun at the U.S. Securities and Exchange Commission on Twitter, <a href=\"https:\/\/twitter.com\/ag_dwf\/status\/1666066813787033600?t=t3mCOaEDlcHIBwXYLgzffw&amp;s=19\" data-v-f87c67ca=\"\">he would later post<\/a> that Asian exchanges have more users and higher volumes —&nbsp;and are “much easier in terms of regulation.”&nbsp;","Kim would leave the company a year later.","By this point, there was a Swiss entity for Darley Technologies, which had been set up in 2021 with 30 bitcoin in starting capital — when bitcoin was around the $60,000 mark — and named Marco Schweizer and Rendchen as founding shareholders, according to company records. A person familiar with the matter said that Marco Schweizer had intended to invest around $1 million in Darley Technologies to pay for salaries in its early days.&nbsp;","In October 2022, Florentin became chairman of the board of Darley Technologies, with the Schweizer brothers also on the board, while Rendchen’s name was struck off.","&nbsp;\"I have never had any operational role in DWF Labs and have no interests in this entity since I left in 2022. I have no operational role in Digital Wave Finance AG or Darley Technologies since I left the boards of these entities in 2022,\" Rendchen told The Block.","In December, Florentin joined DWF Labs as a shareholder of its Singapore entity, according to company records. His LinkedIn profile previously stated that he was an adviser to DWF Labs since its launch, according to a screenshot seen by The Block, but this was scrubbed at some point in the last few months.&nbsp;","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Darley Technologies' website showed DWF Labs as a liquidity provider until recently. Image: Darley Technologies.<\/span><\/em>","Darley’s website would also go on to show DWF Labs as a liquidity provider, although the <a href=\"https:\/\/www.darleytechnologies.com\/partners\/\" data-v-f87c67ca=\"\">page<\/a> that mentioned this was recently removed from its website.&nbsp;","Around this time, DWF Labs was one of the creditors of FTX, having had funds on the exchange when it unraveled, Grachev later told Foresight News. Court records also show that Digital Wave Finance was an <a href=\"https:\/\/www.courtlistener.com\/docket\/65748821\/450\/1\/ftx-trading-ltd\/\" data-v-f87c67ca=\"\">owner of Series B shares<\/a> in FTX, which were initially released during <a href=\"https:\/\/www.theblock.co\/post\/112014\/ftx-900-million-funding\" data-v-f87c67ca=\"\">FTX’s two<\/a> <a href=\"https:\/\/www.theblock.co\/post\/121428\/ftx-420-million-round-69-investors-tiger-ribbit\" data-v-f87c67ca=\"\">Series B rounds<\/a> in 2021.","In January 2023, Zou (formerly at OKEx), Heng Yu Lee and Ng (formerly at Gemini) also became shareholders in DWF Labs’ Singapore entity. Lee had been a partner at DWF Labs since May 2022, according to his LinkedIn profile, while Ng had been a founding partner and advisor to DWF Labs since 2021, according to his profile. Both had previously served as advisors to VRM Trade, according to its pitch deck, while Zou had joined its team after leaving OKEx, according to a person familiar with the matter.","Ng is currently the co-founder of OpenEden, which has its vaults <a href=\"https:\/\/www.theblock.co\/post\/224565\/openeden-gemini-execs-tokenized-t-bill-vault\" data-v-f87c67ca=\"\">managed<\/a> by a<a href=\"https:\/\/eservices.mas.gov.sg\/fid\/institution\/detail\/411841-OPENEDEN-PTE-LTD\" data-v-f87c67ca=\"\"> registered<\/a> fund management company regulated by the Monetary Authority of Singapore and works with Zodia Custody, the crypto unit of Standard Chartered. Darley Technologies’ investment arm Darley Labs is also an investor in OpenEden, according to its <a href=\"https:\/\/www.darleytechnologies.com\/darley-lab\/\" data-v-f87c67ca=\"\">website<\/a>.","During this time, DWF Labs was present in Switzerland, Singapore, the British Virgin Islands, Hong Kong, Dubai — where it is licensed by the Dubai Multi Commodities Centre Authority free trade zone — and Korea, according to a pitch deck. Deals were typically made through its BVI or Singapore entities, according to documents seen by The Block and a person with direct knowledge of the company’s operations. BVI was favored, as DWF Labs isn’t licensed by Singapore’s market regulator, the Monetary Authority of Singapore, the person said.","In February, Sylvain Barbezange, then head of OTC trading at Darley Technologies, moved over to Digital Wave Finance where he became Head of Institutions, according to his <a href=\"https:\/\/www.linkedin.com\/in\/sylvain-barbezange-dwf\/\" data-v-f87c67ca=\"\">LinkedIn profile<\/a>.","From this moment on, DWF Labs really broke into public awareness for the first time.&nbsp;&nbsp;","While the company had made a few deals in late 2022, they picked up in frequency in March 2023. According to <a href=\"https:\/\/www.theblock.pro\/?section=deals-section\" data-v-f87c67ca=\"\">The Block’s Deals Dashboard<\/a>, DWF Labs made seven investments, allocating more than $100 million for projects including Conflux, Orbs, Synthetix, Radix and Fetch.AI.&nbsp;","In April, it found $10 million for a project called CryptoGPT, later renamed to LayerAI, a decision that <a href=\"https:\/\/twitter.com\/Tristan0x\/status\/1645544351878221824\" data-v-f87c67ca=\"\">raised questions<\/a> among the crypto community over the details of these investments. That month, reports by <a href=\"https:\/\/www.theblock.co\/post\/225705\/dwf-labs-biggest-crypto-investors\" data-v-f87c67ca=\"\">The Block<\/a> and <a href=\"https:\/\/www.coindesk.com\/business\/2023\/04\/14\/market-maker-dwf-labs-more-than-200m-in-deals-blur-what-investing-means\/\" data-v-f87c67ca=\"\">CoinDesk<\/a> shed further light into the way that these investments were made, revealing they were typically in the form of over-the-counter deals that were structured in daily tranches over a month or a few months.&nbsp;","The Block would later provide more details about how these deals are made and show insights into how the company communicates with clients, including a <a href=\"https:\/\/www.theblock.co\/post\/267354\/how-dwf-labs-makes-deals-and-its-tendency-to-talk-about-price\" data-v-f87c67ca=\"\">tendency to talk about price management with clients<\/a> and prospective clients. In one instance, Grachev asked how high the client would like their token’s price to be raised and discussed whether the company could deliver on this.&nbsp;","DWF Labs was not deterred by the spotlight throughout the year. It made even bigger deals, finding $45 million to buy EOS tokens from The EOS Network Foundation and $50 million to purchase ALGO from the Algorand Foundation. The Algorand Foundation previously said in its dealings with DWF Labs, there was no talk of moving the market or providing artificial volume. The Block has not reviewed documents or received information suggesting that any of the crypto projects mentioned in this article had conversations about price management with DWF Labs.","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Andrei Grachev in a panel discussion at an event organized by OKX. Image: <a href=\"https:\/\/twitter.com\/DWFLabs\/status\/1702318400717128154\/photo\/2\" data-v-f87c67ca=\"\">DWF Labs via X<\/a>.<\/span><\/em>","Following criticism, DWF Labs reworked its strategies. It told clients to begin referring to such deals as “strategic partnerships” instead of “investments,” according to <a href=\"https:\/\/www.dlnews.com\/articles\/fintech\/market-maker-dwf-labs-launches-investment-arm-amid-criticism\/\" data-v-f87c67ca=\"\">DL News<\/a>. It will also announce deals involving staggered purchases once they’ve been completed rather than at the beginning, according to <a href=\"https:\/\/www.theblockbeats.info\/news\/45416?from=telegram\" data-v-f87c67ca=\"\">BlockBeats<\/a>.","The company has applied for a virtual asset service provider license in the British Virgin Islands, according to BlockBeats, and is in the process of getting multiple licenses in general, <a href=\"https:\/\/twitter.com\/ag_dwf\/status\/1729044342042669170\" data-v-f87c67ca=\"\">Grachev posted<\/a> on X. It is also going through an audit by an unspecified Big Four accounting firm, he said.","Looking ahead, the company is starting an inaugural <a href=\"https:\/\/twitter.com\/DWFLabs\/status\/1729711815310053842\" data-v-f87c67ca=\"\">incubation program<\/a> for crypto companies, and it plans to create what Grachev <a href=\"https:\/\/twitter.com\/ag_dwf\/status\/1725526428358254855\" data-v-f87c67ca=\"\">described<\/a> as a compliant market for crypto OTC trades — mirroring the earlier plan for Black Ocean.","With its financial backing from Digital Wave Finance and the wealth of contacts it’s made along the way, DWF Labs has what it takes to be a considerable force in the crypto space in the near future.&nbsp;","That is, as long as it can shake off its past.","<em data-v-f87c67ca=\"\">This is the second of a two-part series on DWF Labs. The first article, looking at how it structures its deals and the way it communicates with clients, can be <a href=\"https:\/\/www.theblock.co\/post\/267354\/how-dwf-labs-makes-deals-and-its-tendency-to-talk-about-price\" data-v-f87c67ca=\"\">found here<\/a>.<\/em>","<em data-v-f87c67ca=\"\">The Block reached out to the Schweizers, Grachev, Rendchen, Bisang, Florentin, Ng, Lee, Zou, Demin, Chong, Barbezange, Rehor and Chuang for comment, plus Conflux, Orbs, Synthetix, Radix, Fetch.AI, LayerAI, the EOS Network Foundation and the Algorand Foundation.<\/em>","<i data-v-f87c67ca=\"\">Disclaimer: Evgeny Gaevoy, the founder and CEO of Wintermute —&nbsp;a competitor to DWF Labs — previously sat on The Block's board of directors from April 2023 to early November 2023 and remains a minority shareholder.<\/i>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"April 2023","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"January 2022","content":"DATE"},{"type":"January 2021","content":"DATE"},{"type":"Google Translate","content":"ORGANIZATION"},{"type":"January 2023","content":"DATE"},{"type":"July","content":"DATE"},{"type":"Evgeny Gaevoy","content":"PERSON"},{"type":"Heng Yu Lee","content":"PERSON"},{"type":"two years later","content":"DATE"},{"type":"Radix","content":"ORGANIZATION"},{"type":"Rendchen","content":"PERSON"},{"type":"Demin","content":"LOCATION"},{"type":"Ile de Ré","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Digital Wave Finance\/DWF Labs","content":"ORGANIZATION"},{"type":"Black Ocean","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Korea","content":"LOCATION"},{"type":"December","content":"DATE"},{"type":"February 2019","content":"DATE"},{"type":"March 2023","content":"DATE"},{"type":"Digital Wave Finance","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"NGC Ventures","content":"ORGANIZATION"},{"type":"$100,000","content":"MONEY"},{"type":"Singapore","content":"LOCATION"},{"type":"$1 million","content":"MONEY"},{"type":"Michael Rendchen","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Huobi","content":"PERSON"},{"type":"99.5%","content":"PERCENT"},{"type":"Seoul","content":"LOCATION"},{"type":"$157,000","content":"MONEY"},{"type":"2016","content":"DATE"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"80%","content":"PERCENT"},{"type":"The Block’s Deals Dashboard","content":"ORGANIZATION"},{"type":"Bisang","content":"LOCATION"},{"type":"France","content":"LOCATION"},{"type":"Chong","content":"ORGANIZATION"},{"type":"Tobias Straube","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"Louis Bisang","content":"PERSON"},{"type":"October 2022","content":"DATE"},{"type":"Darley Labs","content":"ORGANIZATION"},{"type":"VRM Group","content":"ORGANIZATION"},{"type":"Lucy Labs","content":"PERSON"},{"type":"Darley Technologies","content":"ORGANIZATION"},{"type":"Demin","content":"PERSON"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"COO of Digital Waves","content":"ORGANIZATION"},{"type":"Sept. 15","content":"DATE"},{"type":"49%","content":"PERCENT"},{"type":"Russia","content":"LOCATION"},{"type":"Web3 Venture Capital","content":"ORGANIZATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"Euguene Ng","content":"ORGANIZATION"},{"type":"British Virgin Islands","content":"LOCATION"},{"type":"June 2022","content":"DATE"},{"type":"June 2020","content":"DATE"},{"type":"IMC Trading","content":"ORGANIZATION"},{"type":"EOS Network Foundation","content":"ORGANIZATION"},{"type":"Orenburg State University","content":"ORGANIZATION"},{"type":"$4.3 million","content":"MONEY"},{"type":"Clement Florentin","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"Wintermute","content":"ORGANIZATION"},{"type":"Vroom","content":"PERSON"},{"type":"March 14, 2021","content":"DATE"},{"type":"BVI","content":"ORGANIZATION"},{"type":"Uzbekistan","content":"LOCATION"},{"type":"Barbezange","content":"LOCATION"},{"type":"Risch","content":"LOCATION"},{"type":"China","content":"LOCATION"},{"type":"Bisang","content":"PERSON"},{"type":"South Korea","content":"LOCATION"},{"type":"Switzerland","content":"LOCATION"},{"type":"$4 billion","content":"MONEY"},{"type":"Algorand Foundation","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Digital Wave AG","content":"ORGANIZATION"},{"type":"George Chuang","content":"PERSON"},{"type":"VRM Trade","content":"ORGANIZATION"},{"type":"Shawn Chong","content":"PERSON"},{"type":"$50,000","content":"MONEY"},{"type":"Schweizer","content":"PERSON"},{"type":"Foresight News","content":"ORGANIZATION"},{"type":"Lucy Labs","content":"ORGANIZATION"},{"type":"$22 million","content":"MONEY"},{"type":"Sylvain Barbezange","content":"PERSON"},{"type":"ETH Zurich University","content":"ORGANIZATION"},{"type":"170%","content":"PERCENT"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Florentin","content":"PERSON"},{"type":"$1.7 billion","content":"MONEY"},{"type":"second quarter","content":"DATE"},{"type":"Grachev","content":"LOCATION"},{"type":"euro","content":"ORGANIZATION"},{"type":"Marco Schweizer","content":"PERSON"},{"type":"August","content":"DATE"},{"type":"$60,000","content":"MONEY"},{"type":"Huobi Russia","content":"LOCATION"},{"type":"Lee","content":"PERSON"},{"type":"Zug","content":"LOCATION"},{"type":"KRW","content":"ORGANIZATION"},{"type":"Digital Waves","content":"ORGANIZATION"},{"type":"Bithumb","content":"PERSON"},{"type":"0.0157%","content":"PERCENT"},{"type":"DL News","content":"ORGANIZATION"},{"type":"hundreds of millions of dollars","content":"MONEY"},{"type":"$45 million","content":"MONEY"},{"type":"Vladimir Demin","content":"PERSON"},{"type":"Andrei Grachev","content":"PERSON"},{"type":"Dec. 8, 2018","content":"DATE"},{"type":"Huobi","content":"LOCATION"},{"type":"CoinMarketCap","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"},{"type":"Standard Chartered","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Harvey Kim","content":"PERSON"},{"type":"OpenEden","content":"LOCATION"},{"type":"Synthetix","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"second quarter of the year","content":"DATE"},{"type":"Dubai Multi Commodities Centre Authority","content":"ORGANIZATION"},{"type":"Jiamix","content":"PERSON"},{"type":"Dubai","content":"LOCATION"},{"type":"Moscow","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"Grachev","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"$10 million","content":"MONEY"},{"type":"Schweizers","content":"PERSON"},{"type":"May 2022","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"$440 million","content":"MONEY"},{"type":"Digital Wave Finance AG","content":"ORGANIZATION"},{"type":"DWA","content":"ORGANIZATION"},{"type":"Zodia Custody","content":"ORGANIZATION"},{"type":"GitHub","content":"ORGANIZATION"},{"type":"Marco","content":"PERSON"},{"type":"$10,000","content":"MONEY"},{"type":"OKX","content":"ORGANIZATION"},{"type":"$9 million","content":"MONEY"},{"type":"-0.002%","content":"PERCENT"},{"type":"FBG Capital","content":"ORGANIZATION"},{"type":"Gibraltar","content":"LOCATION"},{"type":"Remo Schweizer","content":"PERSON"},{"type":"Jakub Rehor","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Forklog","content":"ORGANIZATION"},{"type":"Zac Zou","content":"PERSON"},{"type":"Radix","content":"LOCATION"},{"type":"DWF Labs","content":"ORGANIZATION"}],"hashtag":["IDENTITY","INVESTMENT FIRMS"],"authors":["Tim Copeland","The Block"]}