{"summary":"Paradigm is moving beyond just crypto toward a broader array of technologies including AI, sources tell The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232247\/crypto-vc-paradigm-ai","publishDate":"2023-05-25T14:21:30","id":6080,"type":null,"title":"Paradigm shifts its crypto-only focus to include AI","category":["DEALS"],"content":["Crypto venture capital firm Paradigm, one of the most established and active players in the space, is going beyond just blockchain and highlighting a focus on a broader array of \"frontier tech\" that includes artificial intelligence, two sources with knowledge of the matter told The Block.&nbsp;","The change is subtlety visible on the firm's website, with the company now calling itself a \"research-driven technology investment firm\" as opposed to one that specifically invested in “disruptive crypto\/Web3 companies and protocols.” The revision appears to have gone live around May 3, according to the <a href=\"https:\/\/web.archive.org\/web\/20230502030653\/https:\/\/www.paradigm.xyz\/\" data-v-f87c67ca=\"\">Wayback Machine<\/a> that's operated by the Internet Archive.","A line that said \"we believe crypto will define the next few decades\" was removed from the home page, which now makes no mention of web3 or blockchains. One source who was not authorized to speak publicly said the change didn't mean the company was shying away from crypto but rather highlighting its reach into adjacent areas.&nbsp;","The company's portfolio section of the website still lists dozens of firms associated with crypto, decentralized finance and NFTs.&nbsp;","The person familiar with the strategy said the company had not changed its mandate and continued to focus on crypto and web3, with no practical change. The updated website copy was meant to emphasize its technical research, the person said, noting that Paradigm had backed companies that have explored new technologies within their core strategy such as AI Arena.&nbsp;","The company didn't immediately respond to a request for further comment.&nbsp;","The wider focus comes as the crypto industry is still dealing with aftershocks from the crisis last year marked by the collapse of the FTX exchange. Paradigm was an investor in FTX and <a href=\"https:\/\/www.theblock.co\/post\/186449\/paradigm-marks-down-ftx-investment-to-zero-sources\" data-v-f87c67ca=\"\">wrote off<\/a> its $290 million investment in the company after it filed for bankruptcy in November.","Paradigm was co-founded in 2018 by Coinbase co-founder Fred Ehrsam and former Sequoia partner Matt Huang. In November 2021, the firm <a href=\"https:\/\/www.theblock.co\/linked\/124327\/paradigm-launches-2-5-billion-venture-fund-for-crypto-companies\" data-v-f87c67ca=\"\">raised a $2.5 billion fund<\/a>, which at the time was the biggest ever crypto-focused venture fund. Its portfolio includes high-profile companies including Uniswap, OpenSea and Fireblocks, according to <a href=\"https:\/\/www.theblock.pro\/deals\/\" data-v-f87c67ca=\"\">The Block Pro’s Deals Dashboard<\/a>.","Paradigm has invested in over 100 crypto startups to date, according to the dashboard.","After a troubled year, crypto VC investments have slowed down. Venture capitalists put around $2.8 billion into crypto investments in the first quarter of 2023, down from about $3.5 billion in the fourth quarter of 2022, according to data tracked by The Block Research.","The fresh focus comes amid a surge in attention on AI this year, especially with the widespread adoption of OpenAI's ChatGPT language model. And there has also been much industry chatter about how AI and blockchain technology can be integrated.&nbsp;","Jeremy Allaire, the co-founder and CEO of stablecoin issuer Circle, said Thursday that he was already hearing about \"AI Bots spinning up on-chain wallets and using USDC.\"","\"AI and Blockchains are made for each other,\" <a href=\"https:\/\/twitter.com\/jerallaire\/status\/1661735753108570115\" data-v-f87c67ca=\"\">he wrote on Twitter<\/a>. \"Provenance of data, machine generated and enforced contracts, and machine to machine value exchange.\"","Allaire was responding to a <a href=\"https:\/\/twitter.com\/HHorsley\/status\/1661495771668316165\" data-v-f87c67ca=\"\">lengthy post<\/a> from Hunter Horsley, the CEO of <a href=\"https:\/\/bitwiseinvestments.com\/\" data-v-f87c67ca=\"\">crypto investment firm Bitwise<\/a>, who said he'd spent a lot of time talking with AI engineers over the past several days.","\"AI may be a catalyst for crypto in this cycle,\" Horsley wrote, adding that the tech would create new demand for cryptography and blockchains. \"Feeling increasingly convinced that these two disparate technologies are going to have intertwined futures, and that crypto is going to become a lot more important as AI starts to proliferate.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"Horsley","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"November","content":"DATE"},{"type":"Allaire","content":"PERSON"},{"type":"fourth quarter of 2022","content":"DATE"},{"type":"Blockchains","content":"PERSON"},{"type":"Hunter Horsley","content":"PERSON"},{"type":"Sequoia","content":"ORGANIZATION"},{"type":"November 2021","content":"DATE"},{"type":"$3.5 billion","content":"MONEY"},{"type":"Jeremy Allaire","content":"PERSON"},{"type":"Bitwise","content":"PERSON"},{"type":"May 3","content":"DATE"},{"type":"$290 million","content":"MONEY"},{"type":"The Block Pro’s Deals Dashboard","content":"ORGANIZATION"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"first quarter of 2023","content":"DATE"},{"type":"Matt Huang","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Wayback Machine","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Fred Ehrsam","content":"PERSON"},{"type":"$2.5 billion","content":"MONEY"},{"type":"$2.8 billion","content":"MONEY"}],"hashtag":["NEW VC FUNDS"],"authors":["Yogita Khatri","Frank Chaparro","Nathan Crooks","The Block"]}