{"summary":"January 29th saw Blockstack – the crypto industry startup that seeks to build a decentralized, user-centric Web – make a big announcement: that it had registered 1 million “verified users.”","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/55531\/whats-in-a-milestone-on-blockstacks-1-million-verified-users-and-the-quest-for-adoption","publishDate":"2020-02-11T14:45:00","id":6086,"type":null,"title":"What’s in a milestone? On Blockstack&#x27;s 1 million &#x27;verified users&#x27; and the quest for adoption","category":["STARTUPS"],"content":["<span data-v-f87c67ca=\"\">January 29th saw Blockstack –&nbsp;the crypto industry startup that seeks to build a decentralized, user-centric Web – make <a href=\"https:\/\/blog.blockstack.org\/blockstack-pbc-successfully-completes-milestone-2-for-network-growth\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a big announcement<\/a><\/span><span data-v-f87c67ca=\"\">: that it had registered 1 million “verified users.” In doing so, the startup unlocked some $6.8 million that it previously raised from investors.<\/span>","<span data-v-f87c67ca=\"\">“This self-imposed requirement was our way to introduce investor protection and signal that we’re building for the long-term in a disciplined manner. The decision as to whether a Milestone is met is determined by an independent Advisory Board,” the company wrote. “On January 16th, that Advisory Board unanimously determined that Milestone 2 had been achieved, and on January 29th, we filed a Form 1-U with the SEC disclosing the achievement.”<\/span>","<span data-v-f87c67ca=\"\">It was an announcement that <a href=\"https:\/\/twitter.com\/MessariCrypto\/status\/1222944025730256897\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">drew big plaudits<\/a> <\/span><span data-v-f87c67ca=\"\">in some quarters; as Messari noted in its write-up of the announcement, the event presented “<\/span><span data-v-f87c67ca=\"\">a notable milestone for any network, especially as numerous projects flood the market with new offerings and compete to win attention among an already thin user base.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But the announcement drew scrutiny as well (including, full disclosure, <\/span><a href=\"https:\/\/twitter.com\/lawmaster\/status\/1222993972714450946\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">from my colleagues<\/span><\/a><span data-v-f87c67ca=\"\"> here at The Block), primarily centered around the question of whether those one million verified users represent actual human beings –&nbsp;and how, exactly, Blockstack reached such a conclusion.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">I reached out to Blockstack in an effort to learn more about the process behind the milestone determination. Here’s what their representative initially sent me:<\/span>","<span data-v-f87c67ca=\"\">“Verification varies from app to app, and partner to partner, as they are independent. However, the Blockstack registration and authentication tool offers baked-in protection for spam registration, rate-limiting by IP, and more. Further, user acquisition campaigns by Blockstack PBC involved additional verification and\/or KYC processes. For example, through Blockchain.com, only 'Gold Level' users were added, a designation that requires that they have registered an address, government ID and more. At other times we've used the built-in browser social verification via Twitter, Facebook, Github, and other networks, and used phone number verification via Twilio step (restricted to trusted carriers and countries). All available information can be found in our blog post and the 1-U filing.”<\/span>","<span data-v-f87c67ca=\"\">While my follow-up interview request was declined, I was sent a link to a <a href=\"https:\/\/blog.blockstack.org\/user-activity-blockstack-network\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">new blog post<\/a><\/span><span data-v-f87c67ca=\"\">&nbsp;published on January 31st that could perhaps be construed as a response to questions I posed as well as the social media-based criticism directed toward Blockstack in the wake of the news. <\/span>","<span data-v-f87c67ca=\"\">As CEO Muneeb Ali wrote: “There have been some questions regarding username registrations vs. active users. In this post I will shed more light on the initial network growth and measurement limitations on the network.”<\/span>","<span data-v-f87c67ca=\"\">For what it's worth, I believe that such questions are perfectly valid and ought to be pursued. <\/span>","<span data-v-f87c67ca=\"\">In the nearly six years that I’ve covered the industry, the perennial Moby-Dick hunt of the bitcoin and blockchain faithful has been the pursuit of adoption. From payment processors to custody solutions to financial products to user experiences to conferences to –&nbsp;well, all of it – the general thrust has been to try and figure out ways by which the technology can be put in as many hands as possible, and to keep it there. And I would hazard a guess that some of the anxieties that exist in the space today share a common wellspring: the concern that adoption is slow and that this state of affairs may persist for the foreseeable future.<\/span>","<span data-v-f87c67ca=\"\">The Blockstack announcement –&nbsp;and the responses that followed – exist very much through that same lens. It’s either a vitally important achievement because it’s a strong indicator of adoption or it’s just a bunch of nonsense and a grab at investor money because it’s a poor indicator of adoption.<\/span>","<span data-v-f87c67ca=\"\">What is a “verified user”, exactly? <\/span><span data-v-f87c67ca=\"\">“Verified user” <\/span><a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1693656\/000119312520018075\/d878769d1u.htm\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">was defined<\/span><\/a><span data-v-f87c67ca=\"\"> by the advisory committee as a user account on the Blockstack network with at least one form of “acceptable attestation” indicating that the user account is owned by a human and not owned and operated by a computer program or bot. “Acceptable attestation,” defined in the sole discretion of Blockstack, is either a KYC verification process, a phone number confirmation or a social media verification.<\/span>","<span data-v-f87c67ca=\"\">Ali’s follow-up post focused on “username registrations” versus the term “verified users” as it existed in the original post, as well as the SEC filing that outlined the milestone. In fact, the term “verified user” isn’t mentioned at all in the January 31st post.<\/span>","<span data-v-f87c67ca=\"\">“Per our announcement, Blockstack PBC has on-boarded over 1 million registered usernames through a mix of collaborations, partnerships, marketing efforts, app growth driven by independent developers, and more. That being said, registered usernames are not the same as daily active users, nor have they ever been presented as such,” he wrote. “Back in 2017, when we were setting up the legal definition of users in the self-imposed milestone, we precisely defined a user as a registered username on the blockchain (not active user). The milestone was intended to introduce people to the Blockstack network. We’ve achieved this goal through various channels. Blockstack PBC is not claiming to have a million active users on the Blockstack network.”<\/span>","<span data-v-f87c67ca=\"\">In Blockstack’s <\/span><a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1719379\/000141057818000410\/filename4.htm\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">SAFT document<\/span><\/a><span data-v-f87c67ca=\"\">, governing the sales that took place in 2017 (as filed with the SEC), the firm said this: “‘Verified User’ shall mean a user account on the Network with at least one form of an ‘Acceptable Attestation’ indicating that the user account is owned by a human and not owned and operated by a computer program or bot. Acceptable Attestations will be defined in the sole discretion of Token LLC and communicated to the LP Advisory Committee by January 1, 2019.”<\/span>","In a separate statement from Blockstack, the team said of that definition and the process of verification:&nbsp;","\"The self-imposed Milestone 2 was legally defined in 2017 (legal definition in the&nbsp;<a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1693656\/000119312520018075\/d878769d1u.htm\" target=\"_blank\" rel=\"noopener noreferrer\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/www.sec.gov\/Archives\/edgar\/data\/1693656\/000119312520018075\/d878769d1u.htm&amp;source=gmail&amp;ust=1581528138639000&amp;usg=AFQjCNHllfKwr-czDV3HAjJMnGnj6Fu1XQ\" data-v-f87c67ca=\"\">SEC form 1-U<\/a>). The 2019 SEC disclosure refers to the application of those definitions. This process ultimately concluded in January 2020, upon the advisory board determining that Blockstack PBC met the milestone. Details in our blog post, along with clarification on registered usernames vs active users, can be found here: https:\/\/blog.blockstack.org\/user-activity-blockstack-network\/\"","<span data-v-f87c67ca=\"\">Ali went on to write in the January 31st blog post that “username registration serves as a proxy for broader network growth. Username registrations are also very broad and include new STX owners, traffic from various apps, partnerships, and marketing experiments.”<\/span>","<span data-v-f87c67ca=\"\">“We acknowledge that we’ve encountered bad actors. We’ve had to fight spam, and we’re proud of the measures we’ve taken, including IP rate limits for our registrar, social verifications, and phone verifications,” he continued.<\/span>","<span data-v-f87c67ca=\"\">It’s worth noting that in <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1693656\/000110465919039908\/a18-15736_1253g2.htm\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">an SEC filing dated July 11<\/a><\/span><span data-v-f87c67ca=\"\">, Blockstack offered some specifics on the number of user registrations it had received up to that point. As the startup said: “the second milestone is for 1,000,000 verified users to be registered on the Blockstack network by the end of January 2020.”&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">It continued:<\/span>","<span data-v-f87c67ca=\"\">\"As of the date of this offering circular, the network had approximately 115,780 registered user accounts. Of those 115,780 accounts, approximately 16,100 accounts had provided a “social proof” as evidence of having a human user, such as a GitHub link or Twitter message link. Of those 16,100 accounts, approximately 9,555 accounts had social proofs that could be verified with a link that was still working as of the date of this offering circular. These numbers are estimates, and the method of measuring the number of verified registered users for purposes of the second milestone is still under consideration by an independent advisory committee formed by the AI and QP Funds, the LP Advisory Committee.”<\/span>","<span data-v-f87c67ca=\"\">According to data, there were 156,600 total usernames <\/span><a href=\"https:\/\/web.archive.org\/web\/20191106154345\/https:\/\/explorer.blockstack.org\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">by November 6<\/span><\/a><span data-v-f87c67ca=\"\">, <\/span><span data-v-f87c67ca=\"\">504,000 <\/span><a href=\"https:\/\/theblockstats.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">by December 8<\/span><\/a><span data-v-f87c67ca=\"\"> and 1.97 million addresses by January 29. That means that from December 8 until January 29, Blockstack supposedly added nearly 1.5 million usernames and at least 50% of them would have to be verified.<\/span>","<span data-v-f87c67ca=\"\">So where did the one million verified users come from?&nbsp;<\/span>","<span data-v-f87c67ca=\"\">About 30% of the million verified users apparently came from the airdrop facilitated by Blockchain.com. Two days before the January 29 announcement, <\/span><a href=\"https:\/\/blog.blockstack.org\/welcoming-300000-new-stx-holders-through-the-blockchain-com-distribution\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Blockstack reported<\/span><\/a><span data-v-f87c67ca=\"\"> that more than 300,000 unique, verified Blockchain.com users participated in the airdrop (it’s worth noting that Blockchain.com was compensated for the airdrop and the total <\/span><a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1693656\/000110465919053807\/a19-19695_21u.htm\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">payment was dependent on the number of verified users that received it<\/span><\/a><span data-v-f87c67ca=\"\">.)<\/span>","<em data-v-f87c67ca=\"\">Source: https:\/\/theblockstats.com\/<\/em>","&nbsp;","<span data-v-f87c67ca=\"\">But most of the users that received the airdrop are likely already depicted in the chart above. The number of total addresses grew by 344,000 since early November, which is also around the same time when the airdrop started. Moreover, none of the STX tokens airdropped by Blockchain.com will be delivered until February 2020  –  they are all locked until then.<\/span>","<span data-v-f87c67ca=\"\">In a separate blog post, <\/span><a href=\"https:\/\/blog.blockstack.org\/growth-in-a-decentralized-ecosystem\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Blockstack disclosed<\/span><\/a><span data-v-f87c67ca=\"\"> that it was experimenting with airdropping STX tokens themselves and letting users verify their phone numbers through Twilio. That blog post highlighted exposure via privacy apps and messenger apps – both of which undoubtedly fit into the user profile of someone who would be attracted to a decentralized internet.<\/span>","<span data-v-f87c67ca=\"\">Blockstack further noted that it “engaged in various marketing campaigns to raise awareness around internet privacy and educate people about decentralized applications. Our marketing campaigns targeted at university students were especially interesting; data collected from these campaigns suggests that university students may be an interesting initial community where decentralized apps and Blockstack ID use takes off.”&nbsp;<\/span>So, in sum, they undertook a range of efforts to identify and reach out to different kinds of users who might be drawn to the ethos and practical usage of a decentralized internet.&nbsp;","<span data-v-f87c67ca=\"\">But all of this spurs on additional questioning. What was the exact process by which the verified-user count was determined? My efforts to learn more about it the project’s <a href=\"https:\/\/blog.blockstack.org\/introducing-the-advisory-board-for-the-blockstack-token-fund\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">token fund advisory board<\/a><\/span><span data-v-f87c67ca=\"\">&nbsp;were largely unsuccessful. Investor Arianna Simpson told me that “[t]he measures for meeting Milestone 2 were decided in 2017 (should be in the SEC filing), and the advisory board determined that under these pre-set guidelines, Blockstack PBC met these requirements.” But as Blockstack’s July filing indicates, “<\/span><span data-v-f87c67ca=\"\">the method of measuring the number of verified registered users for purposes of the second milestone is still under consideration by an independent advisory committee formed by the AI and QP Funds, the LP Advisory Committee.”<\/span>","<span data-v-f87c67ca=\"\">Further – and these are, perhaps, more subjective queries – should the people who were airdropped STX tokens even be counted as verified users? Are they a “user” given that the <\/span><a href=\"https:\/\/www.merriam-webster.com\/dictionary\/user\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">traditional definition<\/span><\/a><span data-v-f87c67ca=\"\"> of that term is “one who uses”? <\/span><span data-v-f87c67ca=\"\">And where did the other ~700,000 verified users come from, especially in such a short period of time?<\/span>","<span data-v-f87c67ca=\"\">And as Ali himself points out: “the privacy focus of our network makes it nearly impossible to measure active users, so by design, there is no way to collect activity data.” So if privacy is a major focus here, and by design it’s difficult to measure activity, why set such a goal at all? Why not set a milestone based on the number of registered users since day one?<\/span>","<span data-v-f87c67ca=\"\">Blockstack perhaps has an incentive to meet Milestone 2, as outlined in its <\/span><span data-v-f87c67ca=\"\">Reg A+ <\/span><a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1693656\/000110465919039908\/a18-15736_1253g2.htm\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">offering circular<\/span><\/a><span data-v-f87c67ca=\"\">, in which it wrote:<\/span>","<span data-v-f87c67ca=\"\">“In the event Blockstack fails or is deemed to have failed to [reach one million verified users], Blockstack will be required to return a significant amount of capital that Blockstack currently intends to use in the development of the Blockstack network. This could significantly delay or prevent the completion of the development of the Blockstack network, and limit Blockstack’s ability to retain and\/or hire key talent including but not limited to the core developers of the Stacks blockchain. As a result of the foregoing, the value of your Stacks Tokens could be adversely affected.”<\/span>","<span data-v-f87c67ca=\"\">As Ali pointed out in the January 31 post, the milestone “had a narrowly defined legal definition tailored to the Blockstack network’s specification, and we successfully met that requirement.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But there’s interchangeable language at play here that could allow for flexible definitions – username registrations, verified users and the like – and open the door to selective interpretation. It's that kind of semantic gamesmanship that fuels the perception that Blockstack may be spinning a growth narrative arguably at odds with definitions in SEC filings and not borne out by reality. <\/span>","<span data-v-f87c67ca=\"\">And so the industry finds itself in a kind of guessing game, wondering whether the users – on whom the whole experiment would seem to hinge on – are actually showing up.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Blockstack PBC","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"LP Advisory Committee","content":"ORGANIZATION"},{"type":"January 31","content":"DATE"},{"type":"January 2020","content":"DATE"},{"type":"January 29th","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"$6.8 million","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"Arianna Simpson","content":"PERSON"},{"type":"Github","content":"PERSON"},{"type":"30%","content":"PERCENT"},{"type":"November","content":"DATE"},{"type":"Advisory Board","content":"ORGANIZATION"},{"type":"February 2020","content":"DATE"},{"type":"Blockstack","content":"ORGANIZATION"},{"type":"Muneeb Ali","content":"PERSON"},{"type":"July 11","content":"DATE"},{"type":"January 16th","content":"DATE"},{"type":"Dick","content":"PERSON"},{"type":"January 1, 2019","content":"DATE"},{"type":"1 million","content":"MONEY"},{"type":"November 6","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"PBC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Facebook","content":"LOCATION"},{"type":"bot","content":"ORGANIZATION"},{"type":"December 8","content":"DATE"},{"type":"Blockstack","content":"LOCATION"},{"type":"Blockstack","content":"PERSON"},{"type":"January 29","content":"DATE"},{"type":"Token LLC","content":"ORGANIZATION"}],"hashtag":["SEC"],"authors":["Michael McSweeney","The Block"]}