{"summary":"CZ announced on X that his next project will be a &#x27;gamified&#x27; platform that aims to provide free basic education for all — with NFT badges.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283244\/changpeng-zhao-announces-project-involving-nfts","publishDate":"2024-03-18T21:12:41","id":6089,"type":null,"title":"Former Binance chief Changpeng Zhao announces new educational project involving NFTs","category":["PEOPLE"],"content":["<span data-v-f87c67ca=\"\">Changpeng Zhao, co-founder and former CEO of Binance, announced on <\/span><a href=\"https:\/\/twitter.com\/cz_binance\/status\/1769877743607448029?t=1PNdhXouLpfa3eGU2FesvA&amp;s=19\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">X<\/span><\/a><span data-v-f87c67ca=\"\"> on Tuesday morning in Asia that he's hiring for his next project named Giggle Academy. He described it as a “gamified, adaptive” platform that aims to provide free basic education for all.<\/span>","<span data-v-f87c67ca=\"\">The <\/span><a href=\"https:\/\/www.giggleacademy.com\/Giggle%20Academy%20v0.4%2020240221.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">concept paper<\/span><\/a><span data-v-f87c67ca=\"\"> for Zhao’s new platform said that the project's main target is to educate underprivileged children in developing nations by providing content covering education from grades one to 12.<\/span>","<span data-v-f87c67ca=\"\">Noted as a “zero revenue platform,” Giggle Academy plans to gamify its educational content using a system involving points, scores, rankings and non-fungible token (NFT) badges. However, Zhao <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1769781668842471888\" data-v-f87c67ca=\"\">noted<\/a> in a separate X post that there will be no cryptocurrency involved with this project. The concept paper also discussed the future possibility of adopting a “learn-to-earn” system.<\/span>","<span data-v-f87c67ca=\"\">“I thought about what to do next for a few months,” Zhao said in the paper. “I need to find something that has the maximum positive impact that I could achieve in this world. This would require me to do something that I am good at and scalable.”<\/span>","<span data-v-f87c67ca=\"\">In November last year, Zhao <\/span><a href=\"https:\/\/www.theblock.co\/post\/253681\/changpeng-cz-zhao-steps-down-as-binance-ceo\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">pleaded guilty<\/span><\/a><span data-v-f87c67ca=\"\"> to violating and causing a financial institution to violate the Bank Secrecy Act. He agreed to pay a $50 million penalty as an individual and stepped down as CEO of Binance.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Asia","content":"LOCATION"},{"type":"Zhao","content":"PERSON"},{"type":"November last year","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"morning","content":"TIME"},{"type":"Giggle Academy","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":["BINANCE","CZ"],"authors":["Danny Park","The Block"]}