{"summary":"Simmons & Simmons partner George Morris found “unsubstantiated” projections in a 2020 pitch deck produced by FTX and obtained by The Block.  \nA 2018 document produced by sister firm Alameda Research has already drawn scrutiny for promising high returns with “no risk.”","author":["Ryan Weeks","Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/188264\/ftx-pitch-deck-projections-not-viable","publishDate":"2022-11-18T03:43:47","id":609,"type":null,"title":"FTX pitch deck projections not backed by ‘viable assumptions,’ legal expert says","category":["Venture Capital"],"content":["<span data-contrast=\"none\" data-v-f87c67ca=\"\">As the list of venerable investment firms left with black eyes by FTX’s collapse grows longer by the day, The Block asked a legal expert to examine a 2020 pitch deck produced by the bankrupt crypto exchange for warning signs that may have been missed.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">This week, Singaporean sovereign wealth fund Temasek <\/span><a href=\"https:\/\/www.theblock.co\/post\/187868\/temasek-writes-down-275-million-investment-in-ftx\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">announced<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> a write-off of $275 million in bets on FTX businesses — while assuring readers it had done “extensive due diligence.” Silicon Valley venture firm Sequoia pointed to its “rigorous” diligence process on Nov. 9, when <\/span><a href=\"https:\/\/www.theblock.co\/post\/185136\/sequoia-says-its-investment-in-ftx-is-now-worthless\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">announcing<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> that it had written down to zero an investment of $213.5 million in FTX.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">But were there red flags that FTX’s blue-chip backers — which also include BlackRock, Tiger Global Management and SoftBank — missed? George Morris, a partner at the law firm Simmons &amp; Simmons, thinks so.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">A pitch deck produced by FTX in February 2020 for its Series B funding round and obtained by The Block features several projections that Morris describes as “unsubstantiated.” The deck was part of a plan to raise up to $50 million at a $1 billion valuation — although the round was ultimately far larger.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">While pitch decks are often only the first phase of a due diligence process, the document gives a sense of the audacious and at times farfetched vision that former FTX CEO Sam Bankman-Fried presented to investors.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Bankman-Fried and FTX’s media representatives did not immediately respond to requests for comment. <\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:0,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Morris — a London-based crypto specialist who is also the board-appointed lawyer for the lobby group CryptoUK — told The Block that claims made by FTX in the pitch deck “are very significant, and aren’t backed up by any viable assumptions or calculations.” In particular, the revenue figures for 2021 and 2022 don’t fit with projected volumes and fees, “meaning they don’t appear to be tied into anything specific,” he said.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">The pitch deck also includes projections of costs — such as rent, payroll and marketing — and a healthy net profit projection of $327 million in 2022. FTX estimated that payroll would cost just $7.65 million in the same year, which would be unlikely to support even 100 employees, according to Morris. FTX had <\/span><a href=\"https:\/\/www.nytimes.com\/2022\/11\/15\/technology\/ftx-sam-bankman-fried-psychiatrist.html\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">about 300 staff<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> at the time of its collapse, according to reports. “The costs that underpin this profit figure appear to be significantly underestimated,” Morris said.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">FTX’s Series B deck is not the first produced by Bankman-Fried’s companies to draw scrutiny. A 2018 <\/span><a href=\"https:\/\/www.theblock.co\/post\/186187\/alameda-promised-high-returns-with-no-risk-in-2018-pitch\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">pitch deck<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> put together by Alameda Research promised potential investors “high returns with no risk” on loans paying annualized interest rates of 15%. Tyler Gellasch, president and CEO at non-profit Healthy Markets, told The Block the language in the Alameda deck could raise major legal warning signs, in part because entrepreneurs soliciting funds must disclose risks appropriately. “This is a flashing red<\/span>&nbsp;<span data-contrast=\"none\" data-v-f87c67ca=\"\">flag for investigators,” Gellasch, a former Senate and SEC staffer, said. “These types of documents are likely to be an exhibit in court cases.”<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">FTX’s Series B pitch deck is perhaps less incendiary. Though some of the projections are punchy, most of it is “relatively innocuous,” Morris said. “My overall impression is that the deck was carefully put together from a risk management standpoint to avoid bold claims.”<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Nevertheless, two other elements of the deck stood out to Morris: a lack of clarity on FTX's regulatory status and the seemingly hurried nature of the raise.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“There is no commentary with respect to regulatory strategy, which cannot be written off as a sign of those times since FTX was offering derivatives, which have for a long time before February 2020 been subject to an existing and well-known regulatory regime, which raises the question around their sophistication at the time from a legal perspective,” Morris said.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">He added that the lack of attention paid to regulation is odd in a deck in which FTX also boasted extensively about its growth in the field of retail derivatives. “This would indicate that a strategy of aiming for regulated status was not something being considered in February 2020, or perhaps they did not think that was a crucial message to get across to investors at that time.”<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Finally, there is the issue of timing. Prior to this year’s bear market, fundraising had been a frantic process for crypto firms. In June, Accel partner Andrei Brasoveanu told The Block that the market for venture capital investing in crypto startups in 2021 <\/span><a href=\"https:\/\/www.theblockcrypto.com\/news+\/153982\/accels-fintech-partner-welcomes-vc-market-slowdown-after-frantic-year\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">was “overly transactional,”<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> with backers constantly in “catch up mode.” Former FTX Ventures lead Amy Wu, as recently as Nov. 5, described how term sheets were often signed within 24 hours during the bull market. She <\/span><a href=\"https:\/\/www.theblock.co\/post\/186084\/ftx-ventures-head-amy-wu-resigns-the-information\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">resigned<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> less than a week after making those comments.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">The timelines that FTX appears to have expected investors to keep to were similarly aggressive.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“It is worth noting that the timeline for completion of the raise was extremely short — the deck was produced at some time after Feb. 6 2020 (given the dates on the daily average user graphs on slide six) but the indicative offers were to be in by Feb. 20 2020, with the round closing on Feb 28. 2020,” said Morris. If kept to, such timings would leave “little chance to have done any significant due diligence to any extent prior to executing the round,” he added.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Exactly what became of FTX’s Series B fundraising effort in February 2020 is unclear, but it is noteworthy that it came on the cusp of the outbreak of the Covid 19 pandemic — which for a time sent financial markets into shock. Later, though, Covid lockdowns around the world prompted a boom in retail trading in both stocks and crypto.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">FTX’s Series B round ultimately netted it <\/span><a href=\"https:\/\/www.theblock.co\/post\/112014\/ftx-900-million-funding\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">$900 million<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> at a valuation of $18 billion in July 2021.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>"],"hashtag":["FTX","SERIES B"]}