{"summary":"Crypto custody provider BitGo has been quietly building out a lending business, the latest company to throw its hat in the ring of a growing market. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/57805\/as-crypto-credit-bubble-concerns-loom-bitgo-announces-launch-of-a-150-million-lending-business","publishDate":"2020-03-05T05:01:06","id":6090,"type":null,"title":"As crypto credit bubble concerns loom, BitGo announces launch of a $150 million lending business","category":["LENDING"],"content":["Crypto custody provider BitGo has been quietly building out a lending business, the latest company to throw its hat in the ring of a growing market.&nbsp;","Announced Thursday, the new business will be a separate legal entity, christened BitGo Prime LCC. The name hints at BitGo's ambitions to build out a full-scale prime broker, which in addition to offering its bread-and-butter custody services, will also cover trading and lending, according to people familiar with the situation.&nbsp;","As for the latter, the firm has built up a loan book of $150 million, a fraction of the approximately $500 million books operated by incumbents such as Genesis Global Trading and BlockFi.&nbsp;The firm will not operate in New York as it does not hold a BitLicense.&nbsp;","Still, it is early days for BitGo. Nick Carmi, head of financial services at BitGo, told The Block in a phone interview that the firm started the new unit with a select number of clients with which the firm was already doing business. Since January, the loan book has quadrupled, according to Carmi.&nbsp;","Looking to the future, Carmi said the firm plans to serve a small number of clients.&nbsp;","\"You can build a very profitable business with 20 to 30 large clients,\" Carmi said. The firm is targeting larger investors and traders with the new offering. Loan sizes are large, starting at $1 million, with the largest being $8 million, according to a spokeswoman. The firm did not share what the standards rates are for its loans.&nbsp;","BitGo enters lending as the market continues to grow. Most recently, U.K.-based Blockchain.com <a href=\"https:\/\/www.theblockcrypto.com\/post\/47054\/as-credit-concerns-loom-in-crypto-blockchain-com-secretly-builds-multi-million-dollar-loan-desk\" data-v-f87c67ca=\"\">gate-crashed<\/a> the space with its own offering, complimenting its wallet business. Indeed, the growth of crypto credit has some market observers thinking that a <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2019-10-29\/another-credit-bubble-grows-the-5-billion-crypto-loan-market\" data-v-f87c67ca=\"\">bubble<\/a> is looming.&nbsp;","\"The space is getting crowded,\" one trading executive said of BitGo's entrance into the market.","Carmi says the firm is differentiated from the competition because it is loaning out money from its own balance sheet in addition to client deposits, a model Carmi says more closely resembles Wall Street firms like Goldman Sachs.&nbsp;","\"The difference between us and all the other lenders in the crypto space is that we look at it similar to the repo lending businesses at big banks,\" Carmi said. \"They will use some of their capital to lend out and at the same time they will use other people's inventory to grow the business.\"","That gives BitGo skin in the game, according to Carmi.&nbsp;","\"I am not just borrowing from Mary and lending to Bill,\" he said. \"I have my own inventory and am just as much into that trade as anyone else.\"","As for whether Carmi is concerned about a potential bubble, he said he is concerned about certain lenders not doing the proper risk management.&nbsp;","\"I am concerned that other firms are lending out to the wrong counter-parties,\" he said. \"We want to see the financials, I want to know what you are trading and what your pedigree is.\"&nbsp;","\"I turned a client away coming into work at 5 a.m.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Carmi","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"5 a.m.\"","content":"TIME"},{"type":"Nick Carmi","content":"PERSON"},{"type":"U.K.","content":"LOCATION"},{"type":"$8 million","content":"MONEY"},{"type":"LCC","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"$500 million","content":"MONEY"},{"type":"$1 million","content":"MONEY"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Mary","content":"PERSON"},{"type":"$150 million","content":"MONEY"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}