{"summary":"Behind-the-scenes regulators, politicians and lobby groups are helping to shape the UK’s vision for becoming &quot;the world’s Web3 center.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236441\/meet-the-9-power-players-shaping-the-uks-growing-crypto-agenda","publishDate":"2023-07-01T07:30:25","id":6097,"type":null,"title":"Meet the 9 power players shaping the UK&#x27;s growing crypto agenda","category":["COMPANIES"],"content":["The UK is once again in the running to become a crypto hub, with Andreessen Horowitz (a16z) <a href=\"https:\/\/a16zcrypto.com\/posts\/announcement\/expanding-uk-andreessen-horowitz\/\" data-v-f87c67ca=\"\">choosing<\/a> London as its home for its first international outpost. The venture firm <a href=\"https:\/\/a16zcrypto.com\/posts\/announcement\/expanding-uk-andreessen-horowitz\/\" data-v-f87c67ca=\"\">lauded<\/a> that the UK government “sees the promise of web3.”","London is already a <a href=\"https:\/\/time.com\/6102902\/london-fintech\/\" data-v-f87c67ca=\"\">renowned hub<\/a> for fintech innovation and the UK has long been expected to create a similar pathway for digital assets and Web3 startups. However, those plans appeared&nbsp; to be on hold in recent years, as digital asset companies struggled to <a href=\"https:\/\/blockworks.co\/news\/crypto-startups-uk-bank-accounts\" data-v-f87c67ca=\"\">secure bank accounts<\/a> in the country as well as <a href=\"https:\/\/www.theblock.co\/post\/137484\/crypto-firms-uk-close-fca-register\" data-v-f87c67ca=\"\">register<\/a> as crypto asset firms with the Financial Conduct Authority (FCA). Some of the city’s biggest digital assets conferences <a href=\"https:\/\/www.theblock.co\/post\/222649\/london-paris-crypto-conference-hotspot\" data-v-f87c67ca=\"\">even decided<\/a> to move to new locations this year and the UK government <a href=\"https:\/\/www.theblock.co\/post\/223181\/uk-government-nft-canceled-royal-mint\" data-v-f87c67ca=\"\">halted<\/a> its own Royal Mint NFT launch.","The tide is now changing again with the government <a href=\"https:\/\/www.theblock.co\/post\/237082\/new-uk-financial-law-includes-crypto-hub-provisions-and-web3-rules\" data-v-f87c67ca=\"\">passing<\/a> the Financial Services and Markets bill, which includes <a href=\"https:\/\/www.theblock.co\/post\/208667\/uk-minister-andrew-griffith-wants-to-pass-finance-regulation-bill-by-easter\" data-v-f87c67ca=\"\">provisions<\/a> for crypto assets, while rolling out the red carpet for crypto-mad VC a16z. The UK’s Prime Minister Rishi Sunak said he’s <a href=\"https:\/\/a16zcrypto.com\/posts\/announcement\/expanding-uk-andreessen-horowitz\/\" data-v-f87c67ca=\"\">determined<\/a> to turn “the UK into the world’s Web3 center.”&nbsp;","Without further ado, meet the 9 power players helping to craft the UK’s web3 and digital assets agenda from behind-the-scenes.<b data-v-f87c67ca=\"\"><\/b>","<span data-v-f87c67ca=\"\">Dr Lisa Cameron, SNP MP and head of crypto and digital assets APPG. Image: Lisa Cameron<\/span>","Dr Lisa Cameron is a Scottish National Party MP who first started her career in the National Health Service (NHS). She moved into politics in 2015 and now heads up the Crypto and Digital Assets All Party Parliamentary Group (APPG) which is a forum for parliamentarians, regulators and industry to discuss the challenges and opportunities within the crypto industry. She is also the vice chair of the Web3 and Metaverse All Party Group.","After a 10-month inquiry, the digital assets APPG <a href=\"https:\/\/cryptouk.io\/appg\/#appg-crypto-inquiry-2022\" data-v-f87c67ca=\"\">published<\/a> a report in June calling for the urgent regulation of the crypto industry and the appointment of a “crypto tsar” to coordinate the country’s regulatory approach.&nbsp;","Cameron <a href=\"https:\/\/beincrypto.com\/uk-crypto-regulation-lisa-cameron-mp\/\" data-v-f87c67ca=\"\">first got involved<\/a> with crypto after a constituent lost some money in a scam and she discovered no one in Parliament was doing any work on the subject. She told The Block she sees her role as debating and challenging the government to ensure the UK develops the best regulatory system possible to harness this technology while providing guardrails.","“We are looking towards agreeing to take forward a CBDC and also a regulatory framework for cryptocurrency (within financial services) so that we can capitalize on a bespoke regime in the UK post brexit for both business and technological innovation,” Cameron told The Block.","<span data-v-f87c67ca=\"\">Ian Taylor, head of digital assets at KPMG UK. Image: CryptoUK<\/span>","Ian Taylor has long been a prominent figure in the UK crypto scene, having previously led CryptoUK, the UK’s trade body for digital assets. He recently transitioned to a board advisory position after becoming head of digital assets for big four accounting firm KPMG in the UK. CryptoUK is a non-profit member-led organization that works to help educate policymakers and regulators about the digital asset industry and support them in developing regulatory frameworks for the UK, according to <a href=\"https:\/\/cryptouk.io\/\" data-v-f87c67ca=\"\">its website<\/a>.","Taylor built CryptoUK from the ground up, helping it grow to over 160 members and has seen success with policy recommendations surrounding <a href=\"https:\/\/cryptouk.io\/resources\/public-consultations\/\" data-v-f87c67ca=\"\">the travel rule<\/a> and the <a href=\"https:\/\/cryptouk.io\/resources\/cryptouk-welcomes-his-majestys-treasurys-cryptoasset-regulatory-regime-consultation-paper-and-financial-promotion-exemption-plans\/\" data-v-f87c67ca=\"\">de facto ban on advertising<\/a>, Taylor told The Block. CryptoUK is also the secretariat for Cameron’s digital assets APPG group and collaborates with other industry bodies such as the Blockchain Association.","In the coming year, Taylor expects a comprehensive set of regulations that will bring many crypto activities within the regulatory perimeter, where they’ll be governed by the FCA.","“We expect this to become law in the next 12 months,” he added.","<span data-v-f87c67ca=\"\">Katie Fortune, senior manager in the Bank of England's CBDC unit. Image: Bank of England.<\/span>","Katie Fortune is a Bank of England veteran with over a decade of experience as an economist at the central bank. She is now a senior manager in the bank’s CBDC unit overseeing international and stakeholder engagement, as well as work on the functional design of the CBDC, <a href=\"https:\/\/www.linkedin.com\/in\/katie-fortune-n%C3%A9e-low-24a3a928\/\" data-v-f87c67ca=\"\">according to LinkedIn<\/a>.","In February, the bank <a href=\"https:\/\/www.bankofengland.co.uk\/paper\/2023\/the-digital-pound-consultation-paper\" data-v-f87c67ca=\"\">released<\/a> a paper on the digital pound, which concluded that such an innovation will likely be needed in the future and, while it was too early to decide whether to introduce the digital pound, continued preparatory work is needed.","During a panel at Citi’s Digital Money Symposium in March, Fortune provided more details on the potential design of the digital pound, stating that it would not contain government-enabled programmability functions, according to a <a href=\"https:\/\/www.ledgerinsights.com\/digital-pound-cbdc-not-programmable-government-control\/\" data-v-f87c67ca=\"\">report<\/a> from Ledger Insights.","<span data-v-f87c67ca=\"\">Andrew Griffith, Conservative MP and economic secretary to the Treasury. Image: Gov.uk.<\/span>","Andrew Griffith is a conservative MP who was appointed as economic secretary to the UK Treasury in October last year. He’s a former business executive who spent over 19 years at media company Sky.","As economic secretary to the Treasury, Griffith is responsible for the financial services sector, which includes fintech, crypto assets and CBDCs. Griffith is a known advocate for blockchain technology and in a <a href=\"https:\/\/hansard.parliament.uk\/Commons\/2023-06-13\/debates\/2661F803-E8CE-4255-BD72-3EAC7F13F6F9\/details\" data-v-f87c67ca=\"\">June hearing<\/a> said the technology could bring a profound and positive impact to multiple sectors in the UK. He also <a href=\"https:\/\/hansard.parliament.uk\/Commons\/2023-06-13\/debates\/2661F803-E8CE-4255-BD72-3EAC7F13F6F9\/details\" data-v-f87c67ca=\"\">celebrated<\/a> a16z’s London office announcement, noting that “industry can see that the UK has clear and ambitious plans for cryptoassets.”","“I hope that I have made it sufficiently clear that the Government wants to be a leader in this space,” said Griffith in the <a href=\"https:\/\/hansard.parliament.uk\/Commons\/2023-06-13\/debates\/2661F803-E8CE-4255-BD72-3EAC7F13F6F9\/details\" data-v-f87c67ca=\"\">June hearing<\/a>.","<span data-v-f87c67ca=\"\">Co-founders of Digital Economy Initiative Ijeoma Okoli (left) and Toby Norfolk-Thompson (right). Image: Digital Economy Initiative.<\/span>","Ijeoma Okoli and Toby Norfolk-Thompson co-founded and co-direct the Digital Economy Initiative, which is an independent think tank that focuses on promoting public policy for crypto assets in the U.S. and UK.","Prior to founding the Digital Economy Initiative, Okoli spent several years as an executive director at JP Morgan, where she co-designed the global risk management and governance framework for cryptocurrencies. Norfolk-Thompson worked with Matrixport, a global digital asset manager, as its U.S. and UK chief investment officer. He also spent 17 years in structured credit trading at Barclays in London.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“I have been actively involved in politics and economic policy debate all my life and set up the DEI with Ijeoma in 2021 to provide policy makers across the political spectrum with clear and reasoned recommendations and commentary drawn from a wide panel of experts across industry, technology and law,” Norfolk-Thompson told&nbsp; The Block.","The finalization of detailed market rules in the U.K. this year, such as the Financial Services and Markets bill,\"will provide clarity for stablecoin issuers and users alike and provide the legal and regulatory building blocks for that market to grow,” said Okoli to The Block.","<span data-v-f87c67ca=\"\">Sriram Krishnan, general partner at Andreessen Horowitz. Image: a16z.<\/span>","Sriram Krishnan is a general partner at Andreessen Horowitz (a16z) and the newest face in the London crypto scene. He will take the reins leading a16z’s new London office. Krishnan, who is currently based in Silicon Valley, <a href=\"https:\/\/a16z.com\/author\/sriram-krishnan\/\" data-v-f87c67ca=\"\">invests <\/a>in crypto and early stage consumer startups. Prior to joining a16z, he held several senior product roles at Twitter, Snapchat and Facebook.","“Leading a16z's UK office in London, I hope we can help build a first-class operation that cultivates and helps grow the existing London web3 ecosystem,” said Krishnan in a statement. “We know this won't happen overnight, but by working closely with entrepreneurs and universities and hosting our Crypto Startup School in London, we can create some exciting network effects to grow the web3 scene in London and the UK more broadly.”","A16z crypto’s head of policy Brian Quintenz <a href=\"https:\/\/fortune.com\/crypto\/2023\/06\/11\/andreessen-horowitz-announces-first-international-expansion-crypto-outpost-uk\/\" data-v-f87c67ca=\"\">told<\/a> Fortune that the move was viewed as “an investment in the UK.” He added that a16z Crypto hopes to guide discussions and work closely with 10 Downing Street.&nbsp;","<span data-v-f87c67ca=\"\">Teana Baker-Taylor, head of regulatory strategy for EMEA at Circle and non-executive director at CryptoUK. Image: CryptoUK.<\/span>","Teana Baker-Taylor started her career in marketing for TradFi titans such as Citi and HSBC before entering the crypto space. In 2017, she joined the first bitcoin exchange in London and later worked as the UK director for both Binance and Crypto.com.","While her first crypto roles focused on marketing and product development, she noticed early on that there was a lack of regulatory clarity in the UK for the asset class and helped establish two UK organizations focused on policy engagement, CryptoUK and Global Digital Finance.","Baker-Taylor led Global Digital Finance for two years and remains on the board of CryptoUK where she oversees its governance and provides input into its policy positions. She also leads regulatory strategy for stablecoin developer Circle in EMEA.&nbsp;","The passage of the Financial Services and Markets Bill (FSMB) will bring digital currencies into the regulated perimeter, said Baker-Taylor. She expects further regulatory developments for other crypto assets in the coming year as secondary legislation and notes that the opportunities for the U.K. to encourage investment into the country with regulatory clarity for blockchain and digital assets will now be exponential.","<span data-v-f87c67ca=\"\">Victoria McLoughlin, interim head of market interventions, digital assets department at FCA. Image: FCA.<\/span>","Victoria McLoughlin, a Financial Conduct Authority (FCA) veteran, has played a significant role in the FCA’s oversight of digital assets in recent years. She has <a href=\"https:\/\/www.theblock.co\/post\/236313\/fcas-head-of-digital-assets-leaves-less-than-one-year-after-joining\" data-v-f87c67ca=\"\">recently<\/a> been appointed as the interim head of markets interventions in the digital assets department at the FCA.","She also led the digital assets department on an interim basis <a href=\"https:\/\/www.theblock.co\/post\/177210\/uks-financial-conduct-authority-names-new-digital-assets-head-exclusive\" data-v-f87c67ca=\"\">until October<\/a> last year, which involved supervising registered, unregistered and new entrant digital asset firms based in the UK, as well as supporting the development of a new regulatory regime, <a href=\"https:\/\/www.linkedin.com\/in\/victoria-mcloughlin-75510a27\/?originalSubdomain=uk\" data-v-f87c67ca=\"\">according to LinkedIn<\/a>. Before taking on the interim head position, she led the FCA’s supervision of VASPs and cryptoasset firms.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"National Health Service (NHS","content":"ORGANIZATION"},{"type":"Brian Quintenz","content":"PERSON"},{"type":"Digital Economy Initiative","content":"ORGANIZATION"},{"type":"Barclays","content":"ORGANIZATION"},{"type":"FCA","content":"ORGANIZATION"},{"type":"Matrixport","content":"PERSON"},{"type":"EMEA","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Taylor","content":"PERSON"},{"type":"Baker","content":"PERSON"},{"type":"UK","content":"ORGANIZATION"},{"type":"Digital Economy Initiative Ijeoma Okoli","content":"ORGANIZATION"},{"type":"Andrew Griffith","content":"PERSON"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"KPMG","content":"ORGANIZATION"},{"type":"Metaverse All Party Group","content":"ORGANIZATION"},{"type":"over 19 years","content":"DATE"},{"type":"Griffith","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"Toby Norfolk","content":"LOCATION"},{"type":"Toby Norfolk","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Norfolk","content":"LOCATION"},{"type":"Katie Fortune","content":"PERSON"},{"type":"Twitter","content":"LOCATION"},{"type":"March","content":"DATE"},{"type":"June","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Rishi Sunak","content":"PERSON"},{"type":"CBDC","content":"ORGANIZATION"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"Krishnan","content":"PERSON"},{"type":"Financial Conduct Authority (FCA","content":"ORGANIZATION"},{"type":"Scottish National Party","content":"ORGANIZATION"},{"type":"Crypto and Digital Assets All Party Parliamentary Group (APPG","content":"ORGANIZATION"},{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"Ijeoma","content":"ORGANIZATION"},{"type":"2015","content":"DATE"},{"type":"HSBC","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Thompson","content":"PERSON"},{"type":"Ijeoma Okoli","content":"PERSON"},{"type":"U.K.","content":"LOCATION"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Financial Services","content":"ORGANIZATION"},{"type":"Global Digital Finance","content":"ORGANIZATION"},{"type":"Ian Taylor","content":"PERSON"},{"type":"Cameron","content":"PERSON"},{"type":"Parliament","content":"LOCATION"},{"type":"JP Morgan","content":"ORGANIZATION"},{"type":"London","content":"LOCATION"},{"type":"Okoli","content":"PERSON"},{"type":"SNP","content":"ORGANIZATION"},{"type":"Citi","content":"ORGANIZATION"},{"type":"APPG","content":"ORGANIZATION"},{"type":"Victoria McLoughlin","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"Royal Mint NFT","content":"ORGANIZATION"},{"type":"October last year","content":"DATE"},{"type":"KPMG UK","content":"ORGANIZATION"},{"type":"Citi’s Digital Money Symposium","content":"ORGANIZATION"},{"type":"October<\/a> last year","content":"DATE"},{"type":"Government","content":"ORGANIZATION"},{"type":"Crypto Startup School","content":"ORGANIZATION"},{"type":"Sriram Krishnan","content":"PERSON"},{"type":"Lisa Cameron","content":"PERSON"},{"type":"UK Treasury","content":"ORGANIZATION"}],"hashtag":["FCA"],"authors":["Kari McMahon","The Block"]}