{"summary":"Data labeling company Sapien has raised $5 million in a seed funding round. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287560\/sapien-raises-5-million-for-data-labeling-with-ai-applications","publishDate":"2024-04-10T08:56:18","id":61,"type":null,"title":"Sapien raises $5 million for data labeling with AI applications","category":["PRIVATE INVESTMENTS"],"content":["Sapien has raised $5 million in a seed-funding round to accelerate its data labeling business.","The round featured contributions from investors such as Primitive Ventures, Animoca, Artichoke Capital and Yield Guild Games. Sapien will use the funds to enhance its AI to better guide and assist its data labeling, the company says. The money will also go toward expanding Sapien’s blockchain infrastructure to build out its team of human labelers.","“This funding will allow us to expand our team, expand our frontend labeling infrastructure and provide better quality data for our growing list of enterprise customers,” Sapien co-founder Trevor Koverko said Wednesday in a statement.","Sapien uses rewards on the blockchain to essentially gamify data labeling, a process integral to advancing AI-powered language learning models like OpenAI’s Chat GPT. Data labeling involves tagging text, images, and various types of files with labels, enabling machine-learning models to interpret and learn from the data.","The data labeling market reached a valuation of $6.8 billion in 2021 and is expected to soar to nearly $75 billion by 2032, according to data labeler Fact.MR. Meanwhile, Statista's data shows that the broader artificial intelligence market is projected to grow to $738 billion in 2029, up from a valuation of roughly $242 billion last year.","<em data-v-f87c67ca=\"\">Editor's note: Ravikant Capital has been removed as a listed investor.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2032","content":"DATE"},{"type":"$242 billion","content":"MONEY"},{"type":"Artichoke Capital and Yield Guild Games","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Animoca","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"2029","content":"DATE"},{"type":"GPT","content":"ORGANIZATION"},{"type":"$738 billion","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"Ravikant Capital","content":"ORGANIZATION"},{"type":"Trevor Koverko","content":"PERSON"},{"type":"$75 billion","content":"MONEY"},{"type":"Statista","content":"ORGANIZATION"},{"type":"$5 million","content":"MONEY"},{"type":"$6.8 billion","content":"MONEY"}],"hashtag":[],"authors":["Elizabeth Napolitano","The Block"]}