{"summary":"Republicans sent a letter to Treasury Secretary Janet Yellen looking for answers on how FSOC ascertains how crypto should be defined. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276326\/republicans-probe-treasury-secretary-janet-yellen-on-regulatory-gaps-in-spot-crypto-markets","publishDate":"2024-02-06T15:55:09","id":6102,"type":null,"title":"Republicans probe Treasury Secretary Janet Yellen on regulatory gaps in spot crypto markets","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Republican lawmakers sent a <a href=\"https:\/\/financialservices.house.gov\/news\/documentsingle.aspx?DocumentID=409138\" data-v-f87c67ca=\"\">letter<\/a> to U.S. Treasury Secretary Janet Yellen looking for answers about how the Financial Stability Oversight Council she leads ascertains how cryptocurrencies should be defined at the federal level.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Lawmakers asked Yellen about coordination between the Securities and Exchange Commission and the Commodity Futures Trading Commission. <\/span><span class=\"s1\" data-v-f87c67ca=\"\">CFTC Chair Rostin Behnam and SEC Chair Gary Gensler are members of the FSOC, which is tasked with monitoring the stability of the financial system.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The FSOC has called out existing regulatory gaps in the spot market for digital assets, according to a 2022 <a href=\"https:\/\/home.treasury.gov\/system\/files\/261\/FSOC-Digital-Assets-Report-2022.pdf\/\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">report<\/span><\/a>, and recommended legislation be passed that would give rulemaking authority to financial regulators over the spot market.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"<\/span><span class=\"s3\" data-v-f87c67ca=\"\">Despite identifying these gaps, regulators have failed to facilitate an environment that ensures consumer protection and fosters digital asset innovation in the United States,\" the lawmakers said in a statement on Tuesday.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">House Financial Services Committee Chair Patrick McHenry of North Carolina, House Agriculture Committee Chair Glenn \"GT\" Thompson of Pennsylvania, Rep. French Hill of Arkansas and Rep. Dusty Johnson of South Dakota signed that letter.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">They asked Yellen about FSOC's views on how securities laws apply to \"crypto-asset issuers,\" citing last year's court case involving Ripple Labs and the SEC. A New York judge <a href=\"https:\/\/www.theblock.co\/post\/239559\/sec-faces-wake-up-call-after-ripple-ruling-though-appeal-likely\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">ruled<\/span><\/a> in July that some of Ripple's sales of XRP did not violate securities laws because of a blind bid process in place for them, while ruling that other direct sales of the token to institutional investors were, in fact, securities.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">Lawmakers also asked whether FSOC believes that both bitcoin and ether are not securities and whether expanding the CFTC's jurisdiction to then encompass the spot market would be appropriate. They said they want a response by Feb. 20.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">The four co-signers are also leading an effort for a bill called the Financial Innovation and Technology for the 21st Century Act, which takes a comprehensive approach to regulating crypto and would <\/span><span class=\"s4\" data-v-f87c67ca=\"\">essentially give the CFTC new <a href=\"https:\/\/crsreports.congress.gov\/product\/pdf\/IN\/IN12223\" data-v-f87c67ca=\"\"><span class=\"s5\" data-v-f87c67ca=\"\">authorities<\/span><\/a> over the cash market, though they have yet to garner the needed support with some saying the <a href=\"https:\/\/democrats-financialservices.house.gov\/news\/documentsingle.aspx?DocumentID=410718\" data-v-f87c67ca=\"\"><span class=\"s5\" data-v-f87c67ca=\"\">bill<\/span><\/a> is the \"wish-list of big crypto.\" The lawmakers on Tuesday said that bill would close the gaps mentioned by FSOC.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">Yellen testified in front of the House Financial Services Committee on Tuesday, and again made the call for Congress to pass legislation to regulate stablecoins and the spot market for crypto assets that are not securities.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">\"There are many areas with respect to digital assets where we do have clear regulatory authority, but we've identified some gaps where, for consumer investor protection and to address financial stability risks, it would be very useful for Congress to take action to fill those gaps,\" Yellen said.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">The CFTC does not have regulatory authority over spot markets, so that is a regulatory gap, Yellen said.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">The Treasury Secretary then honed in on stablecoins and said they pose risks to the financial system.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">\"We would very much welcome an effort by Congress to create a regulatory framework that would be appropriate to address those risks,\" Yellen said.&nbsp;<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Feb. 20","content":"DATE"},{"type":"Financial Innovation","content":"ORGANIZATION"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"House Financial Services Committee Chair Patrick McHenry of North Carolina","content":"ORGANIZATION"},{"type":"Thompson","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Janet Yellen","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Pennsylvania","content":"LOCATION"},{"type":"House Agriculture Committee Chair Glenn \"GT","content":"ORGANIZATION"},{"type":"Rep. Dusty Johnson of South Dakota","content":"ORGANIZATION"},{"type":"Arkansas","content":"LOCATION"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"Yellen","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Financial Stability Oversight Council","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Rostin Behnam","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"FSOC","content":"ORGANIZATION"}],"hashtag":["CFTC","SEC"],"authors":["Sarah Wynn","The Block"]}