{"summary":"Crypto VC funding plummeted by 68% in 2023 to $10.7 billion, compared to the $33.3 billion invested in 2022.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/268972\/crypto-vc-funding-2023-recap","publishDate":"2023-12-25T20:01:19","id":6104,"type":null,"title":"Crypto VC funding took a nosedive in 2023, down 68% compared to the year before","category":["DEALS"],"content":["In 2023, venture capitalists injected $10.7 billion into crypto and blockchain startups, marking a 68% decrease from the $33.3 billion invested in 2022.","Most of these investments took place in the first half of the year, with a dip in the second half — although November saw an uptick in funding. Notably, the proportion of deals allocated to pre-seed, seed, and Series A startups increased in 2023, while mid and later-stage deals declined compared to the previous year.","As for verticals, NFT\/gaming, infrastructure, and web3 maintained their dominance in terms of deal count, with other categories such as data, trading, and enterprise witnessing fewer deals. Here's a brief recap of 2023 crypto funding.","2023 ranked as the third-highest year in terms of the total amount invested, although it was significantly below the unprecedented levels reached in 2022, the largest year for crypto VC funding to date.","\"The significant drop in crypto funding in 2023 was largely expected given the macroeconomic environment, regulatory uncertainty, and the scars left by recent major crypto failures,\" Abhishek Saxena, principal lead at Polygon Ventures, told The Block. \"However, most investors and founders were still surprised by the sheer intensity of the funding pullback. This funding winter served as a healthy and necessary correction, enabling the industry to take stock and refocus on critical priorities,\" Saxena added.","Despite the slowdown in 2023, the year's total investment still outpaces prior bear markets. There was $6.4 billion invested in 2019-2020, significantly less than this year's funding.<br data-v-f87c67ca=\"\">\n","","There was also a slowdown in the number of crypto VC deals in 2023. The year saw 1,819 deals, 32% less than 2,671 in 2022. Overall, the number of deals in 2023 was consistently higher than monthly deals in 2020 and stayed close to the number of deals in 2021.","As for investment distribution by stage, the majority of funding in 2023 flowed towards pre-seed, seed, and pre-Series A startups, while mid and late-stage startups experienced lower activity, echoing the trend observed in 2022.","In 2023, investment in NFTs and gaming remained robust, while infrastructure and web3 also garnered significant attention. The distribution of funds among sectors appeared more diverse compared to previous years.","","","Looking ahead, crypto VCs expect a surge in funding and deals in 2024, aligning with the recent price shifts and expected bullish trends in the crypto markets.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Polygon Ventures","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Abhishek Saxena","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"32%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"November","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$6.4 billion","content":"MONEY"},{"type":"68%","content":"PERCENT"},{"type":"Saxena","content":"PERSON"},{"type":"$33.3 billion","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"$10.7 billion","content":"MONEY"}],"hashtag":["SEED &AMP; PRE-SEED","SERIES A","SERIES B","SERIES C &AMP; BEYOND","STRATEGIC INVESTMENTS"],"authors":["Yogita Khatri","The Block"]}