{"summary":"The Dutch banking group has spun out its digital asset custody platfrom Pyctor to market infrastructure player Gmex Group.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156835\/ing-sells-digital-custody-tech-to-gmex-group","publishDate":"2022-07-11T04:22:52","id":6109,"type":null,"title":"ING sells digital custody tech to Gmex Group","category":["CUSTODY"],"content":["Dutch banking group ING has sold its digital asset custody and post-trade infrastructure technology Pyctor to infrastructure player Gmex Group, according to a statement on Monday.&nbsp;","The tech was&nbsp;incubated in ING Neo’s Amsterdam innovation lab, in collaboration with major financial institutions and regulators.","Pyctor is now a service offering within Gmex. As part of the move, Gmex chairman and CEO Hirander Misra was appointed chairman of Pyctor. ING will continue its relationship with Pyctor and collaborate through ING’s digital assets team.","Olivier Guillaumond, global head of innovation labs and fintechs at ING, said in a <a href=\"https:\/\/www.gmex-group.com\/press-release-ing-spins-out-pyctor-digital-assets-technology-to-gmex-group\/\" data-v-f87c67ca=\"\">press release<\/a>&nbsp;that Gmex would \"scale Pyctor to the next stage.\"","\"It brings the ideal connectivity between multiple trading parties and digital assets custodians, while addressing interoperability issues experienced in the market,\" he added.&nbsp;","It was <a href=\"https:\/\/www.theblock.co\/linked\/50290\/banking-giant-ing-said-to-be-entering-into-crypto-custody-space\" data-v-f87c67ca=\"\">first reported in 2019<\/a> that ING was looking to enter the crypto custody space.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gmex Group","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Amsterdam","content":"LOCATION"},{"type":"Olivier Guillaumond","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"ING","content":"ORGANIZATION"},{"type":"ING Neo","content":"ORGANIZATION"},{"type":"Hirander Misra","content":"PERSON"},{"type":"2019","content":"DATE"}],"hashtag":[],"authors":["Lucy Harley-McKeown","The Block"]}