{"summary":"Blockchain.com bought Altonomy’s crypto OTC desk this month.\nA source with knowledge of the process said the deal was valued at $250 million in cash and stock. \nThe desk is said to have traded $16 billion in 2021. ","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/139805\/blockchain-coms-crypto-otc-trading-desk-acquisition-topped-250-million-source","publishDate":"2022-03-29T17:56:35","id":611,"type":null,"title":"Blockchain.com&#x27;s crypto OTC trading desk acquisition closed at $250 million: source","category":["Mergers &amp; Acquisitions"],"content":["Last week, crypto exchange and wallet service Blockchain.com <a href=\"https:\/\/medium.com\/blockchain\/accelerating-institutional-growth-through-the-acquisition-of-altonomy-3a2ebd4e351a\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">announced<\/a> the acquisition of Altonomy’s over-the-counter trading desk.","A source with knowledge of the process told The Block that the deal topped $250 million in a transaction involving both cash and stock.","Such a deal exceeds the value of past acquisition deals in the crypto space, including FTX’s $150 million acquisition of Blockfolio and Coinbase’s reported acquisition of prime brokerage Tagomi, said to have weighed in at around $90 million.","The deal speaks to a broader trend of larger market participants making “product-based” acquisitions with a focus on obtaining “regulatory licenses” and “new products,” including those in decentralized finance and the metaverse, according to Architect Partners, an advisory firm.","FTX.US’s acquisition of LedgerX offers a good example of the latter. The firm acquired the options exchange partially for the licenses it holds from the Commodities Futures Trading Commission to launch a futures platform.","As for Blockchain.com, the acquisition of Altonomy’s OTC business, which traded $16 billion last year, will help the firm expand its trading operation and presence in Asia, according to the source. Blockchain.com traded $10 billion last year across its OTC and other trading businesses. The core systems of Altonomy have been integrated into Blockchain.com’s existing trading platform.","In Architect Partners’ view, the deal will help Blockchain.com meet the needs of institutional clients who are keen to trade a more wide-range of coins.","\"Altonomy’s expertise in altcoin and OTC trading will expand Blockchain.com’s presence in this space, while also expanding their product suite,\" the firm said in a recent alert, adding:","Blockchain.com is not acquiring the entirety of Altonomy’s business. Altonomy was founded by Ricky Li, who previously worked in the hedge fund world.","Looking to the future, Architect expects M&amp;A to continue to ramp up, driven by large exchanges.","“Gobbling small firms—with over 400 active exchanges, there’s plenty of ripe picking to acquire accounts by buying smaller firms,” the firm noted."],"hashtag":[]}