{"summary":"Sam Bankman-Fried pleaded not guilty to an array of criminal charges.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/198982\/bankman-fried-pleads-not-guilty-to-criminal-charges","publishDate":"2023-01-03T14:32:48","id":6112,"type":null,"title":"Bankman-Fried pleads not guilty to criminal charges","category":["POLICY"],"content":["Sam Bankman-Fried pleaded not guilty to criminal charges in New York, after the former FTX CEO was extradited from the Bahamas and released on a $250 million bail bond.","Bankman-Fried faces multiple fraud charges and could spend decades in jail if he is convicted.","Disgraced former FTX CEO Sam Bankman-Fried pleaded not guilty to fraud charges in a New York federal court on Tuesday.","Bankman-Fried faces multiple charges, including wire fraud and campaign finance law violations, after his crypto exchange empire imploded last year. Bankman-Fried is accused of misusing FTX customer funds to prop up his crypto trading firm and make political donations, among other misdeeds. The not guilty plea was first reported by <a href=\"https:\/\/www.cnbc.com\/2023\/01\/03\/sam-bankman-fried-pleads-not-guilty-to-fraud-charges-in-new-york.html\" data-v-f87c67ca=\"\">CNBC<\/a>. The trial is expected to begin on Oct. 2.&nbsp;","A spokesperson for Bankman-Fried did not immediately respond to a request for comment.","The former FTX boss was arrested in the Bahamas last month. He was later extradited to the U.S. and released on a $250 million bail bond that was co-signed by his parents. Bankman-Fried’s lawyer requested on Tuesday the court <a href=\"https:\/\/www.theblock.co\/post\/198939\/bankman-fried-asks-for-250-million-bond-co-signers-to-remain-anonymous\" data-v-f87c67ca=\"\">conceal the identities of two people<\/a> who also co-signed Bankman-Fried’s bond, saying the individuals may face threats and harassment if they are identified.","Judge Lewis Kaplan granted that request to keep the co-signers anonymous, though said he would allow members of the media or others to contest the sealing of the information, according to The Wall Street Journal.","FTX filed for bankruptcy protection in November, after a run on its native utility token caused the crypto behemoth to collapse. FTX, once valued at $32 billion, could owe $3.1 billion to its top 50 creditors.&nbsp;","Several of Bankman-Fried’s top lieutenants have already pleaded guilty to FTX-related criminal charges and are cooperating in the case. Caroline Ellison, the former CEO of Bankman-Fried’s Alameda Research trading firm, and FTX co-founder Gary Wang pleaded guilty, according to U.S. Attorney for the Southern District of New York Damian Williams.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Bankman-Fried faces additional civil charges from the Securities and Exchange Commission and the Commodity Futures Trading Commission.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<em data-v-f87c67ca=\"\">Updated with Judge Kaplan's granting anonymity to the additional co-signers of Bankman-Fried's bail bond and with the tentative trial date.&nbsp;<\/em>","<em data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$32 billion","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"$250 million","content":"MONEY"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"Oct. 2","content":"DATE"},{"type":"Kaplan","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"last month","content":"DATE"},{"type":"Lewis Kaplan","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$3.1 billion","content":"MONEY"},{"type":"Fried’s Alameda Research","content":"ORGANIZATION"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Bahamas","content":"LOCATION"},{"type":"December 2022","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"the Southern District of New York Damian Williams","content":"ORGANIZATION"},{"type":"Gary Wang","content":"PERSON"},{"type":"Michael McCaffrey","content":"PERSON"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}