{"summary":"Yield Guild Games (YGG), a top web3 gaming guild based in Asia, is entering the venture capital space and raising $75 million for its first fund.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/212770\/yield-guild-games-ygg-ventures-fund-75-million-web3-gaming","publishDate":"2023-02-18T04:32:59","id":6114,"type":null,"title":"Yield Guild Games raising $75 million venture fund to double down on web3 gaming","category":["DEALS"],"content":["Yield Guild Games (YGG), a top web3 gaming guild, is entering the venture capital space, raising $75 million for its first fund.","\"The fund's mandate is to invest in early-stage token and equity deals in web3, gaming studios and the infrastructure that supports the growth of the industry to benefit the LPs [limited partners] of YGG Ventures Fund I,\" reads the fund's pitch deck, which was obtained by The Block. YGG co-founder Beryl Li confirmed the formation of YGG Ventures and the fund's targeted amount.","\"We are just about to begin raising from LPs for the fund,\" Li said. She is now also a director of YGG Ventures, according to the pitch deck. Li will be part of the fund's investment committee as well, along with Gabby Dizon, another co-founder of YGG, and Jeff Holmberg, head of asset acquisition at YGG, who will transition to partner at YGG Ventures. Holmberg will oversee the fund's strategy and day-to-day operations in his new role and manage a team of gaming analysts, according to the deck.","YGG Ventures Fund I comes at an interesting time, when funding for crypto startups has slowed following a series of collapses and bearish-to-cautious market sentiment. Still, Li said now is the \"perfect time\" to raise the fund because the market has already bottomed out.","\"We're very excited about the web3 gaming space, especially infrastructure. We're seeing a number of quality founders with improved game economics out there,\" she said. \"We want to continue to support the growth of the web3 ecosystem.\"","As a gaming guild, YGG currently acquires NFTs and gaming assets and lends them out to players. YGG's objective is to \"directly drive rewards for the guild community,\" but YGG Ventures, on the other hand, \"has a wider remit,\" according to the deck.","YGG Ventures won't take away from any of the activities of the <a href=\"https:\/\/medium.com\/yield-guild-games\/yield-guild-games-community-update-q2-2022-d6e4960410ba\" data-v-f87c67ca=\"\">YGG Association<\/a>, Li said. \"While the association will continue its strategic partnerships with games, Ventures aims to further support games with investment,\" she said. \"The two are set up in a way the former will receive a portion of economic upside from the latter's investment activities.\"","<a href=\"https:\/\/www.theblock.co\/post\/152064\/yield-guild-games-walks-away-from-merit-circle-with-10-times-its-investment-following-ouster\" data-v-f87c67ca=\"\">YGG<\/a> is backed by top investors, including Andreessen Horowitz (a16z), ParaFi Capital and Mechanism Capital. On Friday, a16z reinvested in YGG by participating in its $13.8 million token round.","While the fund is looking for LPs, YGG Ventures GP — a Cayman Islands-based entity — will serve as the general partner of the fund, according to the deck. The fund is seeking a minimum investment of $500,000 per LP and will have a duration of five to seven years.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gabby Dizon","content":"PERSON"},{"type":"Cayman Islands","content":"LOCATION"},{"type":"LP","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Beryl Li","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"YGG Ventures","content":"ORGANIZATION"},{"type":"$500,000","content":"MONEY"},{"type":"Holmberg","content":"PERSON"},{"type":"Jeff Holmberg","content":"PERSON"},{"type":"Li","content":"PERSON"},{"type":"$75 million","content":"MONEY"},{"type":"$13.8 million","content":"MONEY"},{"type":"YGG Association","content":"ORGANIZATION"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Friday","content":"DATE"}],"hashtag":["GAMING DAOS","PLAY2EARN","TRADING CARD GAMES"],"authors":["Yogita Khatri","The Block"]}