{"summary":"The SEC’s definition of securities may be too sweeping, encompassing collectibles along with investment contracts, according to Bloomberg’s legal analysis.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273662\/bloomberg-analyst-estimates-70-chance-of-coinbase-winning-sec-case","publishDate":"2024-01-21T16:46:15","id":6117,"type":null,"title":"Bloomberg analyst estimates 70% chance of Coinbase winning SEC case","category":["POLICY"],"content":["What differentiates a security from a collectible? That question is at the heart of the Securities and Exchange Commission’s lawsuit against Coinbase, as the agency is accusing the company of selling unregistered securities and operating an unlicensed staking-as-a-service program.&nbsp;","But after the SEC’s lawyers faced <a href=\"https:\/\/www.theblock.co\/post\/273221\/judge-grills-the-sec-with-pointed-questions-as-coinbase-hearing-begins\" data-v-f87c67ca=\"\">pointed questions<\/a> from New York District Judge Katherine Polk Failla, who wondered aloud whether or not the agency’s definition of collectibles was too broad, a Bloomberg analyst has estimated that Coinbase currently has the edge in the case.&nbsp;","“The judge wanted a limiting principle to the SEC definition of \"investment contract\" that wouldn't encompass collectibles. We view the one offered by Coinbase as more compelling, requiring investment in a business vs. just an ecosystem, along with an enforceable obligation,” Bloomberg senior litigation analyst Elliott Stein <a href=\"https:\/\/x.com\/nycstein\/status\/1748334299957367287?s=61&amp;t=7I5yxo0xaR4rsiFzR69uRg\" data-v-f87c67ca=\"\">wrote<\/a>.&nbsp;","Coinbase’s lawyers <a href=\"https:\/\/www.theblock.co\/post\/273253\/coinbase-takes-its-turn-in-court-arguing-the-tokens-it-listed-are-not-securities\" data-v-f87c67ca=\"\">argued<\/a> that not all cryptocurrency purchases constituted investment contracts, likening the difference to “investing in Beanie Baby Inc. and buying Beanie Babies.” Also in question was whether or not the tokens had an “ecosystem” behind them; lawyers on both sides differed on whether or not Bitcoin constituted an ecosystem, for example, with the SEC’s lawyers arguing that it does not.&nbsp;","Judge Faila did not rule from the bench at the end of the four-hour hearing, saying she needed more time to consider the questions at hand. If Coinbase’s motion is dismissed, either whole or in part, the case will continue on to discovery. Stein’s analysis notes that Coinbase may not win this motion, but projects that the company will win eventually.&nbsp;","“Our Thesis: Coinbase is 70% likely to beat the SEC, if not outright on this motion, then later,” Stein wrote. “Even if the case survives, it likely reaches the Supreme Court, which we think will narrow Howey,” Stein also argued, referring to the standard for deeming assets as securities under U.S. law.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Elliott Stein","content":"PERSON"},{"type":"70%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Katherine Polk Failla","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Beanie Baby Inc.","content":"ORGANIZATION"},{"type":"Faila","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Stein","content":"PERSON"},{"type":"Howey","content":"PERSON"},{"type":"the Supreme Court","content":"ORGANIZATION"}],"hashtag":["COURT HEARINGS"],"authors":["Zack Abrams","The Block"]}