{"summary":"The on-chain accumulator tool gives developers and users the ability to verify data from any point in Ethereum’s history.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/248584\/starkware-storage-proofs-ethereum-data","publishDate":"2023-09-01T05:53:57","id":6119,"type":null,"title":"StarkWare &#x27;storage proofs&#x27; used in verifying Ethereum historical data","category":["INFRASTRUCTURE"],"content":["<span data-v-f87c67ca=\"\">London-based startup Herodotus has introduced a developer tool called “on-chain accumulator,\" allowing users to read and verify data from any point in <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.87%\n    <\/span><\/a> <!----><\/span><\/span>’s history using a cryptographic method known as “storage proofs.”<\/span>","Developed in collaboration with <a href=\"https:\/\/www.theblock.co\/post\/208731\/starkware-open-sources-prover-technology-for-ethereum-layer-2-network\" data-v-f87c67ca=\"\">StarkWare<\/a>, a company focused on scalability solutions, the technology aims to overcome a current limitation in Ethereum that only validates the last 256 blockhashes.","“Suddenly, everyone will be able to access whatever they want from parts of Ethereum’s history — and, very soon, will be able to go however far back they want,” said Kacper Koziol, co-founder of Herodotus. “It’s an innovation that is sorely needed to bring Ethereum in line with the principles of transparency and accessibility that are so central in blockchain communities.\"","The StarkWare team noted that this technological development would help develop permissionless \"account recovery systems\" that depend on past and current on-chain data verification. It could also facilitate the creation of insurance protocols that use historical on-chain activities for determining payouts or offering coverage, it added.","The release of this on-chain accumulator tool was one of the major highlights at yesterday's Starknet Summit in San Francisco.","The accumulator tool utilizes the Stark prover — co-developed by Eli Ben-Sasson, President of StarkWare. More specifically, Herodotus employed a custom version of StarkWare’s shared prover (SHARP).","<a href=\"https:\/\/book.starknet.io\/chapter_8\/storage_proofs.html\" data-v-f87c67ca=\"\">Storage proofs<\/a> are cryptographic methods used to confirm the validity of data, transactions, or assets on a blockchain without requiring a third party. The technology is compatible with both Ethereum and Layer 2 blockchain Starknet.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"Kacper Koziol","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"London","content":"LOCATION"},{"type":"Herodotus","content":"ORGANIZATION"},{"type":"-0.87%","content":"PERCENT"},{"type":"Eli Ben-Sasson","content":"PERSON"}],"hashtag":["DEVELOPER TOOLS","STARKNET"],"authors":["Vishal Chawla","The Block"]}