{"summary":"Despite the bear market, some of the Polkadot projects have seen a breakthrough with gains up to 25% last week. Will the market turn towards Polkadot and Kusama now? Lurpis Wang, the co-founder of Bifrost, explains why liquid staking may be the bear market way out.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/150045\/is-liquid-staking-the-bear-market-remedy","publishDate":"2022-06-03T09:00:04","id":6120,"type":null,"title":"Is liquid staking the bear market remedy?","category":["SPONSORED"],"content":["<b data-v-f87c67ca=\"\">Is liquid staking the bear market remedy?<\/b>","<span data-v-f87c67ca=\"\">Despite the bear market, some of the Polkadot projects have seen a breakthrough with gains up to 25% last week. Will the market turn towards Polkadot and Kusama now? Lurpis Wang, the co-founder of Bifrost, explains why liquid staking may be the bear market way out.<\/span>","<b data-v-f87c67ca=\"\">Question<\/b><span data-v-f87c67ca=\"\">: Hi Lurpis, before we get into the merits of bear market and liquid staking, could you tell us a bit more about Bifrost and what is the main idea behind the project?<\/span>","<b data-v-f87c67ca=\"\">Lurpis Wang<\/b><span data-v-f87c67ca=\"\">: Certainly. I founded Bifrost in 2019. I was already working in crypto for 5 years at that time and felt really excited about Polkadot and PoS taking over PoW. I was also seeing that when it comes to staking assets, people usually have a dilemma whether to stake or use their assets. Locking coins for a certain period of time, means that they can’t be used for and yield profit in De-Fi applications. This user dilemma causes competition within the protocol itself - staking rewards compete with De-Fi rewards: less coins staked means weaker governance, while decreases in asset turnover in DeFi can lead to a decrease in asset price. It’s a stalemate. I knew crypto needed a solution out of this; for PoS users not having to choose and for PoS ecosystems to become stronger. That’s when I came up with the idea of Bifrost and liquid derivatives. I wanted (and still want) to develop a solution that will allow liquid stalking on over 80% PoS chains, a solution that will be a win-win for all.<\/span>","<b data-v-f87c67ca=\"\">Question: <\/b><span data-v-f87c67ca=\"\">Wow, inspiring! Could you tell us&nbsp; a bit more about what liquid staking is and how Bifrost is achieving that?<\/span>","<b data-v-f87c67ca=\"\">Lurpis Wang<\/b><span data-v-f87c67ca=\"\">: Yes, I find that often people get a bit confused and lost by technicality when they hear about Bifrost but the idea is pretty simple. Liquid stalking is issuance of liquid derivatives for the coins staked that yield staking rewards (which can be withdrawn at any time) but can also be used throughout the DeFi ecosystem the same way as the native coin. When staking via Bifrost, a user receives vToken (such as vKSM, vMOVR, vDOT etc.) per each native token staked. The vToken corresponds to the staked amount but can also be used for any in-protocol DeFi applications. Currently Bifrost supports vKSM staking but we plan to support other Kusama&nbsp; parachain tokens soon and multiple projects within the Polkadot ecosystem. The reason we chose Dotsama is because Bifrost wants to leverage the cross-chain interoperability between relay, para-, and heterogeneous bridged chains to provide liquid staking and liquid derivatives (vTokens), which can be used throughout multiple, briged ecosystems.<\/span>","<b data-v-f87c67ca=\"\">Question: <\/b><span data-v-f87c67ca=\"\">Do you think liquid staking is the way to go? Do you think it might combat the bear market?<\/span>","<b data-v-f87c67ca=\"\">Lurpis Wang:<\/b><span data-v-f87c67ca=\"\"> Oh, definitely! As I already mentioned, the more assets staked, the stronger the governance, and it doesn’t take a genius to know that asset turnover in DeFi applications will create a healthy market. Many people are resorting to staking their crypto during the bear market to yield some profit before the prices rise again. Yet, staking means locking up the assets, which aren’t then being used in DeFi. This makes it difficult for the market to be bullish as tokens are safely locked away rather than spent. If we all started hoarding our fiat rather than spending it, it’s a no brainer that the value would plummet causing deflation. Crypto is no different. Liquid staking could be the solution. Safe players would still benefit from staking profits but using the assets for DeFi could help restore the activity within the ecosystem and improve market conditions.<\/span>","<b data-v-f87c67ca=\"\">Question:<\/b><span data-v-f87c67ca=\"\"> So how are you incentivising asset holders to turn towards crypto staking during the bear market?<\/span>","<b data-v-f87c67ca=\"\">Lurpis Wang:<\/b><span data-v-f87c67ca=\"\"> We have just launched our Rainbow Boost Program - a long term, periodic rewards initiative for Bifrost’s users. As we aim to popularize liquid staking, Rainbow Boost encourages on-chain activity that helps to make liquid staking mainstream. We reward users with ‘Raindrops’ - non-tradable assets airdropped to participating wallets - that then entitle them to privileges such as coin and NFT airdrops, whitelist priorities, and more. Right now users can earn raindrops by: minting vKSM, participating in Crowdloans, or staking BNC (Bifrost’s native token). We are also partnering with other Kusama parachains such as <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">K<\/span><\/i><span data-v-f87c67ca=\"\">arura, Moonriver, Shiden, Khala and will be rewarding users who participated in Kusama crowdloans with raindrops that will then correspond to <\/span><span data-v-f87c67ca=\"\">K<\/span><span data-v-f87c67ca=\"\">AR, MOVR, SDN, PHA, and BNC<\/span><span data-v-f87c67ca=\"\"> dropped.<\/span>","<b data-v-f87c67ca=\"\">Question:<\/b><span data-v-f87c67ca=\"\"> This sounds great! Can’t wait to see everyone collecting Raindrops soon! Thank you for this interview and best of luck to you and the whole Bifrost family!<\/span>","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Bifrost <\/i><i data-v-f87c67ca=\"\">and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Rainbow Boost","content":"ORGANIZATION"},{"type":"80%","content":"PERCENT"},{"type":"Moonriver","content":"PERSON"},{"type":"Kusama","content":"PERSON"},{"type":"Kusama","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Khala","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"Shiden","content":"PERSON"},{"type":"Hi Lurpis","content":"PERSON"},{"type":"PHA","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"BNC","content":"ORGANIZATION"},{"type":"SDN","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"Dotsama","content":"ORGANIZATION"},{"type":"Lurpis Wang","content":"PERSON"},{"type":"Bifrost","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}