{"summary":"Chief Bankruptcy Judge Martin Glenn has authorized Flare network airdrops to eligible Celsius account holders.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/205337\/court-authorizes-flare-token-airdrop-to-eligible-celsius-accounts","publishDate":"2023-01-25T05:14:26","id":6122,"type":null,"title":"Court authorizes Flare token airdrop to eligible Celsius accounts","category":["COMPANIES"],"content":["Eligible account holders of bankrupt crypto lender Celsius will now be able to receive an airdrop of the Flare network's token (FLR).","Chief Bankruptcy Judge Martin Glenn of the U.S. bankruptcy court in the Southern District of New York authorized Celsius to credit eligible account holders with the Flare tokens they are entitled to, according to a court order <a href=\"https:\/\/cases.ra.kroll.com\/CelsiusCommittee\/\" data-v-f87c67ca=\"\">filed<\/a> on Jan. 24.","The Flare network is a Layer 1 blockchain and oracle provider. Earlier this month, the blockchain distributed Flare tokens to anyone who held one or more XRP tokens during a December 2020 snapshot. XRP holders had been <a href=\"https:\/\/www.theblock.co\/post\/200258\/flare-token-airdrop-finally-happens-after-two-year-wait\" data-v-f87c67ca=\"\">waiting<\/a> over two years for this distribution.","A grant distribution agreement between Celsius and Flare network meant that holders of XRP within Celsius accounts were also expected to receive the airdrop. However, Celsius filed for U.S. Chapter 11 bankruptcy in July and therefore needed to gain the approval of the court to grant the tokens.&nbsp;","Flare tokens are currently trading at around 3 cents, according to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/flare\" data-v-f87c67ca=\"\">data<\/a> from CoinGecko. The token hit an all-time high of 15 cents on Jan. 10, which was the day after the airdrop <a href=\"https:\/\/www.theblock.co\/post\/200258\/flare-token-airdrop-finally-happens-after-two-year-wait\" data-v-f87c67ca=\"\">took place<\/a>. Around 4.28 billion tokens were distributed to recipients&nbsp;.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Martin Glenn","content":"PERSON"},{"type":"December 2020","content":"DATE"},{"type":"3 cents","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"15 cents","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Southern District of New York","content":"LOCATION"},{"type":"Jan. 10","content":"DATE"},{"type":"4.28 billion","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"Jan. 24","content":"DATE"}],"hashtag":["BANKRUPTCY FILINGS"],"authors":["Kari McMahon","The Block"]}