{"summary":"The crypto markets experienced a correction and liquidations this month, but the challenging phase has likely passed, according to JPMorgan.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/247374\/jpmorgan-crypto-limited-downside","publishDate":"2023-08-25T05:19:34","id":6127,"type":null,"title":"JPMorgan sees &#x27;limited downside&#x27; for crypto markets over the near term","category":["MARKETS"],"content":["The crypto markets experienced a correction and liquidations this month, but the challenging phase has likely passed, according to JPMorgan.","Based on JPMorgan's analysis of CME bitcoin futures positions that serve as a proxy, the unwinding of long positions appears to be nearing its completion stage rather than being in its initial stages. \"As a result, we see limited downside for crypto markets over the near term,\" JPMorgan analysts led by Nikolaos Panigirtzoglou wrote in a note on Thursday.","Crypto traders had built long positions on the back of recent positive news — including <a href=\"https:\/\/www.theblock.co\/post\/235926\/sec-lawsuit-over-whether-xrp-is-a-security-will-go-to-trial\" data-v-f87c67ca=\"\">the XRP ruling<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/243569\/paypal-launches-stablecoin\" data-v-f87c67ca=\"\">the launch of PayPal's stablecoin<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/242986\/sec-hears-from-cricketer-musician-and-physicist-on-proposed-bitcoin-etfs\" data-v-f87c67ca=\"\">anticipation that the United States Securities and Exchange Commission will approve spot bitcoin exchange-traded fund applications<\/a>, as well as early positioning by some traders ahead of the bitcoin halving event scheduled for next year — the JPMorgan analysts said.","The crypto markets corrected as positive news faded, with the SEC delaying its decision on spot bitcoin ETF approvals, <a href=\"https:\/\/www.theblock.co\/post\/244036\/sec-files-letter-with-sdny-seeking-leave-for-interlocutory-appeal-in-ripple-case\" data-v-f87c67ca=\"\">the agency being confident in appealing the XRP ruling<\/a>, and Congress debating stringent regulations on stablecoins. \"The fading of the above previously positive news has induced a wave of long position liquidations in recent weeks that are still reverberating,\" the analysts said — but \"unwinding of long positions appears to be at its end phase rather than its beginning,\" they added.","This month's crypto market correction was in line with a broader correction in risk assets, such as equities and tech stocks — which, in turn, appear to have been induced by \"frothy positioning in tech, higher U.S. real yields and growth concerns about China,\" according to the analysts. The news related to <a href=\"https:\/\/www.theblock.co\/post\/246111\/spacex-wrote-down-bitcoin-holdings-by-373-million-wsj\" data-v-f87c67ca=\"\">SpaceX liquidating its bitcoin holding last year and in 2021<\/a> also acted as an additional catalyst for the correction in crypto markets, the analysts said.","Bitcoin, the first and largest cryptocurrency in the market, currently trades at around $26,000.","Earlier this week, crypto venture fund <a href=\"https:\/\/www.theblock.co\/post\/247161\/bitcoin-price-halving-pantera\" data-v-f87c67ca=\"\">Pantera Capital illustrated that the bitcoin price could reach $148,000 after the Bitcoin halving event<\/a> next year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"United States Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"$26,000","content":"MONEY"},{"type":"SpaceX","content":"ORGANIZATION"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"Nikolaos Panigirtzoglou","content":"ORGANIZATION"},{"type":"$148,000","content":"MONEY"},{"type":"China","content":"LOCATION"}],"hashtag":["BITCOIN","TRADFI BANKS"],"authors":["Yogita Khatri","The Block"]}