{"summary":"Yuga Labs completed the first load test of Otherside metaverse on Wednesday afternoon.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156146\/yuga-labs-tech-demo-draws-thousands-of-otherside-land-holders","publishDate":"2022-07-06T13:48:34","id":6129,"type":null,"title":"Yuga Labs tech demo draws thousands of Otherside land holders","category":["GAMING AND METAVERSE"],"content":["Yuga Labs, creators of the Bored Ape Yacht Club NFT collection, completed the first load test on Wednesday afternoon of the Otherside metaverse.","The test for the game -- which lets users turn their NFTs into playable characters -- lasted approximately 25 minutes. There was a gas-less signature to verify Otherdeed ownership and enter the test.","The feedback from land holders -- which Yuga Labs will incorporate into the final version -- was generally positive. Adam Hollander, who owns 20 Otherdeeds, initially had trouble logging into the platform. But he managed to get in and was \"extremely impressed\" by the stress test, he <a href=\"https:\/\/twitter.com\/HollanderAdam\/status\/1544721106531221504\" data-v-f87c67ca=\"\">said on Twitter<\/a>. He added that thousands of active players were able to run around as 3D models without lag.&nbsp;","tropoFarmer, an NFT collector, streamed the event on Twitch. His reaction was similar to Hollander's.","\"Insanely smooth, no visual nor input lag,\" he said on Twitter. \"Movement felt fluid and enjoyable + supporting 2500+ users concurrently in a single instance is insanely impressive.\"&nbsp;","There were some minor issues, said Sam Huber, CEO and founder of LandVault.&nbsp;","“There were some delays sending messages and it’s a shame the world was empty, although granted it was only a Loadtest,\" said Huber to The Block. \"The test was region specific to North America and Europe so others had to rely on VPNs. The voice sync worked well and the avatar mechanics were really smooth with functioning emotes and dances, à la Fortnite. No downloads or high end PCs required which is a bonus and creates a low barrier to entry.\"","The experience on Wednesday appeared to be a bare-bones version of what will come on July 16. Today's test featured a white space and over two thousand avatars roaming within it.","\"Thanks everyone who came out to stress test this,\" said Bored Ape Yacht Club co-founder Garga.eth on Twitter. \"Had about 2.5k concurrent users running around in the neutral space. Tons of great info compiled to make sure First Trip goes smoothly, and taking all your notes from Discord as well.\"","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Screenshot of the test. [Credit: Adam Hollander]<\/em><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sam Huber","content":"PERSON"},{"type":"Loadtest","content":"LOCATION"},{"type":"Bored Ape Yacht Club NFT","content":"ORGANIZATION"},{"type":"North America","content":"LOCATION"},{"type":"Huber","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Adam Hollander","content":"PERSON"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Hollander","content":"PERSON"},{"type":"July 16","content":"DATE"},{"type":"afternoon","content":"TIME"}],"hashtag":["BAYC","OTHERSIDE"],"authors":["Anushree Dave","The Block"]}