{"summary":"The BitDAO community will soon have to agree on whether to spend $100 million from the treasury to buy back its native bit token.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/196509\/bitdao-mulls-100-million-token-buyback-for-next-year","publishDate":"2022-12-20T07:35:41","id":6131,"type":null,"title":"BitDAO mulls $100 million token buyback for next year","category":["CRYPTO ECOSYSTEMS"],"content":["BitDAO is considering a $100 million buyback of its bit token beginning from the start of next year as part of the DAO’s capital deployment strategy.","The plan is contained in a governance <a href=\"https:\/\/discourse.bitdao.io\/t\/discussion-bit-purchase-program-update-jan-2023\/4373\" data-v-f87c67ca=\"\">proposal<\/a> filed with the DAO on Monday. This proposal calls for BitDAO to set its target daily purchase amount at $2 million in USDT for 50 days beginning from Jan. 1 next year. If approved, the DAO will have spent $100 million in USDT to repurchase its bit token at the end of the proposed 50 days. The proposal is also an extension of previous buyback schemes.","The suggested buyback is part of BitDAO’s efforts to promote internal capital deployment. <a href=\"https:\/\/www.theblock.co\/linked\/108602\/bitdao-raise-peter-thiel-alan-howard-defi\" data-v-f87c67ca=\"\">Launched in 2021<\/a>, BitDAO is unlike other DAOs built around DeFi protocols. Instead, BitDAO is an investment DAO that aims to support web3-based research and development <a href=\"https:\/\/www.theblock.co\/post\/162698\/bitdao-to-fund-africadao-with-20-million-for-web3-adoption-in-africa\" data-v-f87c67ca=\"\">via grants<\/a>. The DAO has also begun to develop its own projects and plans to release an <a href=\"https:\/\/www.theblock.co\/post\/190926\/bitdao-launches-modular-ethereum-layer-2-network-mantle\" data-v-f87c67ca=\"\">Ethereum Layer 2 network called Mantle<\/a> in 2023.","The funds for the buyback will come from BitDAO’s $1.7 billion <a href=\"https:\/\/etherscan.io\/address\/0x78605Df79524164911C144801f41e9811B7DB73D\" data-v-f87c67ca=\"\">treasury<\/a>, half of which is in its native bit token. As such, the percentage of the DAO’s holdings in its native token will increase at the end of the buyback period — if the community agrees to the plan.","DAOs whose native tokens form the bulk of their treasuries have had to <a href=\"https:\/\/www.theblockcrypto.com\/news+\/163745\/daos-wrestle-with-how-to-winterize-their-war-chests\" data-v-f87c67ca=\"\">deal with massive declines<\/a> in the value of their reserves this year. This is because these tokens, like the rest of the crypto market, have gone down in price throughout 2022. In response, DAOs are looking into ways to diversify their treasuries. They are doing so by increasing their exposure to stablecoins and also investing in low-risk real-world assets like U.S. Treasuries.","BitDAO owns the second-largest DAO treasury behind Uniswap. The DAO’s reserve currently holds $326 million in ether and $410 million worth of USDT and USDC stablecoins.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USDT","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$410 million","content":"MONEY"},{"type":"$2 million","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"$326 million","content":"MONEY"},{"type":"Mantle","content":"PERSON"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Jan. 1","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"$1.7 billion","content":"MONEY"}],"hashtag":["DAOS"],"authors":["Osato Avan-Nomayo","The Block"]}