{"summary":"Sam Bankman-Fried has requested a U.S. court to consider a sentence in the range of 63 to 78 months, according to a Tuesday court filing.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279487\/sbf-lawyers-prison-sentence","publishDate":"2024-02-28T02:11:17","id":6134,"type":null,"title":"Sam Bankman-Fried’s lawyers ask for prison sentence of 63 to 78 months","category":["LEGAL"],"content":["<span data-v-f87c67ca=\"\">The defense team of Sam Bankman-Fried<\/span><span data-v-f87c67ca=\"\">, former CEO of fallen crypto exchange FTX, requested a U.S. court to consider a sentence in the range of 63 to 78 months, according to a Tuesday court filing.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“An appropriate method of arriving at a just sentence would be to consider the Adjusted Offense Level (Subtotal) of 56, reduced by 30 levels based on zero loss, which yields an advisory Guidelines range of 63-78 months,” the court <\/span><a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.nysd.590939\/gov.uscourts.nysd.590939.407.0.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">filing<\/span><\/a><span data-v-f87c67ca=\"\"> said.<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried’s defense team called the pre-sentence report’s suggested sentence of 100 years “grotesque” and objected to several elements of the PSR, such as how $10 billion is not a reasonable estimate for the amount lost in the bankruptcy. <\/span><span data-v-f87c67ca=\"\">The court filing also highlighted Bankman-Fried’s upbringing, morality, attention to philanthropy and how his conduct was “never motivated by greed or status.”<\/span>","<span data-v-f87c67ca=\"\">“​​A sentence of decades-long duration would end Sam’s ability to lead a meaningful life and contribute to the neediest in society,” the filing said.<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, Bankman-Fried was found guilty by a New York jury last year for defrauding investors of FTX and Alameda Research in what prosecutors called \"one of the biggest financial frauds in U.S. history.\" <\/span>","<span data-v-f87c67ca=\"\">The U.S. court is expected to sentence Bankman-Fried next month.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"PSR","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$10 billion","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Sam’s","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"}],"hashtag":["COURT HEARINGS","SAM BANKMAN-FRIED","SBF TRIAL"],"authors":["Danny Park","The Block"]}