{"summary":"Bancor, a decentralized liquidity network, has announced the launch of its new Bancor Wallet, a non-custodial wallet offering cross-chain token trading","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/15110\/bancor-launches-new-wallet-to-improve-user-experience-for-cross-chain-token-trading","publishDate":"2019-03-11T11:00:47","id":6136,"type":null,"title":"Bancor launches new wallet to improve user experience for cross-chain token trading","category":["DEX"],"content":["<a href=\"https:\/\/www.bancor.network\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Bancor<\/a>, a decentralized liquidity network, has announced the launch of its&nbsp;new&nbsp;Bancor Wallet, a non-custodial wallet offering cross-chain token trading between Ethereum and EOS-based tokens. The Bancor Wallet is built on top of&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/tiny\/bancor-launches-bancorx-for-cross-chain-token-trading\/\" data-v-f87c67ca=\"\">BancorX<\/a>, Bancor's dApp for trading Ethereum and EOS tokens, which leverage Bancor's native token, BNT, to make the cross-chain transfers.","<span data-v-f87c67ca=\"\">Bancor's new wallet prioritizes user experience for trading cross-chain tokens. According to a Bancor statement \"the user experience of the Bancor Wallet resembles that of Coinbase and other popular custodial wallets.\" As&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/tiny\/bancor-launches-bancorx-for-cross-chain-token-trading\/\" data-v-f87c67ca=\"\">The Block<\/a>&nbsp;previously reported, <\/span>BancorX<span data-v-f87c67ca=\"\">&nbsp;users originally had to go through a multi-step process when converting between Ethereum and EOS tokens. The new Bancor Wallet turns the process into a single user action.&nbsp;<\/span>","","","<span data-v-f87c67ca=\"\">As to whether the firm appears to be shifting its focus to EOS, Bancor's head of communication, Nathaniel Hindman, tells The Block that while Bancor is still developing on Ethereum, the firm is \"seeing real dApp adoption and a lot of that usage is outside of Ethereum.\"<\/span>","<span data-v-f87c67ca=\"\">“There is this fading belief that there will one blockchain to rule them all,\" Hindman adds.<\/span>","<span data-v-f87c67ca=\"\">Due to the feeless structure of EOS, however, dApp usage, and thus the appearance of adoption, can be easily manipulated. Hindman agrees, stating that \"volume manipulation is a huge problem.\" Hindman, however, also notes that the Bancor team \"took a long hard look at some metrics to form the thesis that EOS is seeing a lot of activity.\" Since launching its EOS liquidity&nbsp;network in November, Bancor saw conversion trading volume averaging over $2 million a week. According to the firm, \"on several days, EOS volume matched Ethereum volume at roughly $1 million per day.\"<\/span>","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">“We are witnessing unprecedented growth in <\/span>dApp<span data-v-f87c67ca=\"\"> adoption and development as new blockchains emerge to meet the evolving needs of developers and users,” said Eyal Herzog, Bancor’s Co-Founder and Product Architect. “With token usage increasingly shifting from speculation to utility, Bancor’s aim is to offer a non-custodial wallet that creates a simple way to use your wallet on multiple blockchains, with intuitive token management and built-in conversions between ERC20 and EOS tokens, allowing users to more easily share value between the dApps they love.”<\/span><br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">To be sure, Bancor is not the only protocol providing token-to-token exchange features. Since launching at the beginning of November 2018,<\/span> <a href=\"https:\/\/uniswap.io\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Uniswap<\/a> <span data-v-f87c67ca=\"\">has quickly positioned itself as one of the most liquid decentralized exchange venues on the market. In fact, according&nbsp;<\/span><span data-v-f87c67ca=\"\">to <a href=\"https:\/\/blocklytics.org\/blog\/uniswap-vs-bancor\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Blocklytics,<\/a> <span data-v-f87c67ca=\"\">on February 13, Uniswap briefly overtook Bancor in daily trading volume on Ethereum. Uniswap, however, does not offer cross-chain swapping and has yet to surpass Bancor in total network volume<\/span>.<\/span>","<em data-v-f87c67ca=\"\">This post has been updated to clarify Uniswap's daily trading volume when compared to Bancor's<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bancor Wallet","content":"ORGANIZATION"},{"type":"Bancor","content":"ORGANIZATION"},{"type":"November 2018","content":"DATE"},{"type":"Eyal Herzog","content":"PERSON"},{"type":"February 13","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Hindman","content":"PERSON"},{"type":"$2 million","content":"MONEY"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Nathaniel Hindman","content":"PERSON"},{"type":"$1 million","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Steven Zheng","The Block"]}