{"summary":"eToro has launched its ‘CopyTrader’ feature for US cryptocurrency traders\nThe feature allows eToro users to automatically copy all the trades of top cryptocurrency traders\nThe firm has also hired popular actor Alec Baldwin to  promote the feature","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/45017\/social-trading-giant-etoro-launches-copytrader-feature-for-crypto-traders-in-us","publishDate":"2019-10-29T09:01:08","id":614,"type":null,"title":"eToro launches ‘CopyTrader’ feature for crypto traders in US","category":["Cryptocurrency"],"content":["Israel-based social trading platform <a href=\"https:\/\/www.theblockcrypto.com\/daily\/19746\/an-insiders-look-at-etoros-cryptocurrency-exchange-for-professional-traders\" data-v-f87c67ca=\"\">eToro<\/a> has launched its “CopyTrader” feature for cryptocurrency traders in the U.S.","The offering will allow US users of <a href=\"https:\/\/www.theblockcrypto.com\/linked\/17141\/tron-now-available-on-etoro-platform\" data-v-f87c67ca=\"\">eToro<\/a> to automatically copy all the trades of top cryptocurrency traders on its platform, according to an announcement Tuesday.","Nicholas Merten of DataDash, RhythmTrader and martial artist Ben Askren of the Ultimate Fighting Championship are some of the traders, users can copy, said eToro, which serves over 11 million registered users from more than 140 countries, who then trade over $1 trillion in volume per year.&nbsp;","“<a href=\"https:\/\/www.etoro.com\/en-us\/copytrader\/\" data-v-f87c67ca=\"\">CopyTrader<\/a> can help anyone to build their wealth in a simple and transparent way. Users who want to leverage the crypto asset class can now simply look for an investor with a proven track record and just hit copy to execute the same trades automatically,” said Guy Hirsch, U.S. managing director of eToro, in the announcement.&nbsp;","Hirsch separately told The Block that to launch CopyTrader, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/2892\/crypto-broker-etoro-confirms-it-is-rolling-out-a-wallet\" data-v-f87c67ca=\"\">eToro<\/a> had to identify a number of traders with \"significant\" trading experience and track record. The firm then worked with US law firms to ensure that the offering is \"fully compliant.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe CopyTrader feature has been already available for <a href=\"https:\/\/www.theblockcrypto.com\/linked\/29294\/etorox-runs-libra-implementation-trial\" data-v-f87c67ca=\"\">eToro's<\/a> users in other markets. Hirsch told The Block that Europe is the firm's largest market, \"but we’re growing rapidly throughout the world, including here in the U.S.\"","In August, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/43408\/etoro-launches-cryptocurrency-trading-strategy-based-on-twitter-sentiment\" data-v-f87c67ca=\"\">eToro<\/a> CEO Yoni Assia <a href=\"https:\/\/www.theblockcrypto.com\/post\/34412\/yoni-assia-etoro\" data-v-f87c67ca=\"\">revealed in The Block’s Scoop podcast<\/a> that the firm is bringing its CopyTrader feature for U.S. users “very soon.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Actor Alec Baldwin to market the feature&nbsp;<\/strong><\/span><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\neToro has <a href=\"https:\/\/twitter.com\/eToroUS\/status\/1189175006313533442?s=20\" data-v-f87c67ca=\"\">roped in<\/a> popular American actor Alec Baldwin to market the CopyTrader feature and has paid a major sum for it, according to an <a href=\"https:\/\/www.theblockcrypto.com\/post\/91221\/etoro-bitcoin-btc-limit-buying-weekends-notice-demand-volatility\" data-v-f87c67ca=\"\">eToro<\/a> spokesperson. In a new commercial ad, Baldwin calls novice investors in the cryptocurrency space to use CopyTrader and get the ball rolling.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nHirsch told The Block that <a href=\"https:\/\/www.theblockcrypto.com\/linked\/46110\/etoro-acquires-crypto-portfolio-tracker-delta\" data-v-f87c67ca=\"\">eToro<\/a> US team was \"excited to work with Alec Baldwin on an ad campaign that highlights the easy-to-use features of our platform.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<a href=\"https:\/\/www.theblockcrypto.com\/linked\/46978\/etoros-crypto-exchange-adds-5-more-native-stablecoins-including-south-african-rand\" data-v-f87c67ca=\"\">eToro<\/a> does not charge users any additional fee for CopyTrader, Hirsch told The Block, adding that <a href=\"https:\/\/www.theblockcrypto.com\/post\/2370\/etoros-recent-listing-looks-like-a-security-but-the-firm-isnt-worried-about-regulators\" data-v-f87c67ca=\"\">eToro<\/a> only generates revenue from spreads. The firm also compensates \"crypto influencers\" and \"top-performing\" cryptocurrency investors for being copied by users, per the announcement. Hirsch told The Block that \"popular investors\" are compensated based on the number of users that are copying them, adding that the firm selects these investors based on a number of factors, including \"low-risk profiles, a minimum amount of assets under management, and having several months of trading experience.\"","eToro <a href=\"https:\/\/www.theblockcrypto.com\/linked\/14854\/etoro-launches-cryptocurrency-exchange-available-in-31-u-s-states\" data-v-f87c67ca=\"\">launched<\/a> a cryptocurrency trading platform in the U.S. in March of this year. At the time, the firm offered its “CopyPortfolios” feature, which is <a href=\"https:\/\/www.etoro.com\/trading\/copytrader\/how-it-works\/\" data-v-f87c67ca=\"\">different<\/a> from CopyTrader. CopyPortfolios are like model portfolios that aggregate various assets together in a single portfolio, following a predetermined market strategy or focusing on a specific market segment.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"CopyTrader is a feature where users can copy a curated pool of other traders on the platform. CopyPortfolios are thematic or data-driven strategies that our users can access,\" explained Hirsch.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<a href=\"https:\/\/www.theblockcrypto.com\/linked\/80554\/step-into-crypto-trading-with-etoro\" data-v-f87c67ca=\"\">eToro<\/a> is a well-funded firm, with $162 million raised to date, Hirsch told The Block, adding that the firm has over 700 employees across all continents (apart from Antarctica) and is actively hiring in the U.S.","<em data-v-f87c67ca=\"\">UPDATE: This story has been updated to include comments from Guy Hirsch, U.S. managing director of eToro.<\/em>"],"hashtag":[]}