{"summary":"Cuban notes the regulator should create a registration system for exchanges and tokens without hindering startups. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234952\/mark-cuban-sec-and-gary-gensler-are-throwing-crypto-startups-under-the-bus","publishDate":"2023-06-15T12:22:14","id":6146,"type":null,"title":"Mark Cuban: SEC and Gary Gensler are throwing crypto startups &#x27;under the bus&#x27;","category":["COMPANIES"],"content":["Billionaire investor Mark Cuban argued that the Securities and Exchange Commission's approach to crypto leaves entrepreneurs and startups on their own without clear guidance.","Cuban largely denounced the convoluted rules for startups to follow, especially those in web3. He suggested the SEC and Congress create a basic registration system for tokens and exchanges that can enable startups and industry giants alike — all while protecting investors.&nbsp;","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">When I and others ask for bright line guidance and oppose “regulation via litigation,” the businesses I see that are thrown under the bus by the SEC and Gary Gensler <\/span><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">are the dorm room start ups that are driven by sweat equity,\" Cuban wrote on <a href=\"https:\/\/twitter.com\/mcuban\/status\/1669081002063585285?s=20\" data-v-f87c67ca=\"\">Twitter<\/a>.<\/span>","\"It’s time for Congress to respond again and modify the exemptions available to this technology so that registration is obvious and the path for exchanges are doable in a way that protects investors and enables the industry to grow. They are not mutually exclusive,\" Cuban <a href=\"https:\/\/twitter.com\/mcuban\/status\/1669338225197072387\" data-v-f87c67ca=\"\">added<\/a>.","The tech entrepeneur argued that the SEC shouldn't be making judgement calls on whether certain technologies are valid.","Cuban was debating the issue with John Reed Stark, f<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">ormer Chief of the SEC Office of Internet Enforcement. Stark claimed the argument that there is a lack of regulatory clarity is irrelevant, citing comments made by&nbsp;Judge Amy Jackson in the case. He also argued that litigation and enforcement is how securities regulation works.<\/span>","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">SEC registration is difficult to say the least but tough financial regulation makes for a safer\/more trustworthy marketplace. The crypto verse has just operated in an unregulated space for too long and likes it that way,\" said Stark.<\/span>","However, he did agree with Cuban on the barriers to entry for startups. \"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">I’m with you on the barriers to entry for entrepreneurs, especially relating to onerous, burdensome and unreasonable regulation,\" he <a href=\"https:\/\/twitter.com\/JohnReedStark\/status\/1669112705649606656\" data-v-f87c67ca=\"\">said<\/a>.<\/span>","Cuban invested in numerous high-profile crypto projects, such as the multichain wallet <a href=\"https:\/\/www.theblock.co\/post\/213890\/blocto-crypto-wallet-closes-series-a-round-at-an-80-million-valuation\" data-v-f87c67ca=\"\">Blocto<\/a> and the NFT utility project <a href=\"https:\/\/www.theblock.co\/post\/112933\/mark-cuban-nft-project-alchemynft-saft-funding\" data-v-f87c67ca=\"\">AlchemyNFT<\/a>.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gary Gensler","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Amy Jackson","content":"PERSON"},{"type":"Blocto","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"SEC Office of Internet Enforcement","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"John Reed Stark","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["SEC"],"authors":["MK Manoylov","The Block"]}