{"summary":"The Block takes a look back at the key bitcoin ETF news events of 2021.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/128866\/a-look-back-at-the-biggest-bitcoin-etf-news-of-2021","publishDate":"2022-01-01T12:19:07","id":615,"type":null,"title":"A look back at the biggest bitcoin ETF news of 2021","category":["Bitcoin"],"content":["<span data-v-f87c67ca=\"\">Many hoped 2021 would be the year of the bitcoin exchange-traded fund (ETF), and in some ways it was. <\/span>","<span data-v-f87c67ca=\"\">Though the industry ultimately did not successfully advance a spot bitcoin ETF through the Securities and Exchange Commission (SEC), the US did see its first crypto ETF in the form of a futures-based product. <\/span>","<span data-v-f87c67ca=\"\">In this piece, The Block takes a look through key events in 2021 to see where the question of SEC approval lies for 2022.<\/span>","<span data-v-f87c67ca=\"\">It all begins and ends with SEC chairman Gary Gensler. <\/span>","<span data-v-f87c67ca=\"\">The US Senate confirmed Gensler in April of this year with a final tally of 53-45 —&nbsp;most of the tally fell along party lines. Gensler served as the chair of the Commodity Futures Trading Commission (CFTC) under the Obama Administration and later taught classes on subjects including digital assets and blockchain technology at MIT, leaving many in the crypto industry <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/101595\/us-senate-confirms-gary-gensler-as-joe-bidens-sec-commissioner\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">hopeful<\/span><\/a><span data-v-f87c67ca=\"\"> that Gensler might be more sympathetic in his oversight. <\/span>","During an event appearance, Gensler made the powder-keg comment of the year for bitcoin ETFs.","In between discussions of exchange regulation and the possibility that many tokens may be securities, Gensler slipped in <a href=\"https:\/\/www.theblockcrypto.com\/post\/113416\/gensler-speech-crypto-defi-lending-sec\" data-v-f87c67ca=\"\">his views<\/a> on bitcoin ETF approvals:","\"I anticipate that there will be filings with regard to exchange-traded funds (ETFs) under the Investment Company Act (’40 Act). When combined with the other federal securities laws, the ’40 Act provides significant investor protections,\" he said. \"Given these important protections, I look forward to the staff’s review of such filings, particularly if those are limited to these CME-traded bitcoin futures.\"","It was off to the races from this moment on, with a number of firms filing for futures-based bitcoin products.&nbsp;","Most of the year's movement came in October, when a Bloomberg report <a href=\"https:\/\/www.theblockcrypto.com\/linked\/120758\/us-sec-said-allow-bitcoin-futures-etf\" data-v-f87c67ca=\"\">surfaced<\/a> claiming the SEC wasn't likely to block the bitcoin futures products issuers had filed for 75 days before. There's no formal green light for products filed in this way. <a href=\"https:\/\/www.theblockcrypto.com\/linked\/120894\/bitcoin-futures-etf-slated-to-list-monday\" data-v-f87c67ca=\"\">Once 75 days lapses<\/a> with no dissent from the SEC, the product is clear to list.&nbsp;","The industry responded with enthusiasm. As the listing of ProShares seemed <a href=\"https:\/\/www.theblockcrypto.com\/linked\/120894\/bitcoin-futures-etf-slated-to-list-monday\" data-v-f87c67ca=\"\">solidified<\/a>, bitcoin <a href=\"https:\/\/www.theblockcrypto.com\/post\/120795\/bitcoin-rallies-past-60000-on-the-news-of-a-possible-etf-launch\" data-v-f87c67ca=\"\">broke<\/a> the $60,000 mark as the report surfaced. ProShares broke the tape on Oct. 18, listing its ProShares Bitcoin Strategy ETF (BITO) on the New York Stock Exchange. <a href=\"https:\/\/www.theblockcrypto.com\/linked\/121364\/proshares-bitcoin-futures-etf-sees-historic-nearly-1-billion-trading-day\" data-v-f87c67ca=\"\">Opening day volumes<\/a> shattered expectations with $1 billion on launch day. <a href=\"https:\/\/www.theblockcrypto.com\/linked\/121821\/valkyries-bitcoin-futures-etf-posts-trade-volume-worth-nearly-80-million-on-opening-day\" data-v-f87c67ca=\"\">Valkyrie<\/a> and <a href=\"https:\/\/www.theblockcrypto.com\/linked\/121503\/vaneck-looks-to-be-second-issuer-to-list-a-bitcoin-futures-based-etf\" data-v-f87c67ca=\"\">VanEck<\/a> would follow soon after as a number of others awaited approval.&nbsp;","With the massive movement of October and the many submissions for spot ETFs waiting in the wings, the industry had <a href=\"https:\/\/www.theblockcrypto.com\/news+\/122135\/what-the-launch-of-bitcoin-futures-etfs-means-in-the-quest-for-a-spot-etf\" data-v-f87c67ca=\"\">high hopes<\/a> for the end-of-year months.&nbsp;","November started off strong with a coalition of US lawmakers sending a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/123177\/us-lawmakers-call-on-sec-chair-gensler-to-approve-a-spot-bitcoin-etf\" data-v-f87c67ca=\"\">letter<\/a> to Gensler on Nov. 3 expressing their concerns as to why a futures-based bitcoin ETF had been approved, but spot ETFs were still in proposal limbo.","That same day, the SEC circulated a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/123227\/sec-seeks-comments-on-grayscales-gbtc-etf-proposal\" data-v-f87c67ca=\"\">notice<\/a> asking for comments on Grayscale's spot ETF proposal. Still, issuers weren't yet deterred, with BlockFi <a href=\"https:\/\/www.theblockcrypto.com\/linked\/123678\/blockfi-joins-the-race-for-a-spot-bitcoin-etf\" data-v-f87c67ca=\"\">filing<\/a> a proposal for a spot product on Nov. 8.&nbsp;","At that time, Bloomberg ETF analyst James Seyffart <a href=\"https:\/\/twitter.com\/JSeyff\/status\/1457782369142788101?s=20\" data-v-f87c67ca=\"\">tweeted<\/a> Bloomberg's then-current list of crypto ETF filings with the SEC. It remains a pretty comprehensive picture of the issuers on the playing field. However, minor changes, such as multiple rejections, have since come down.","At the time of the tweet, Seyffart said the odds for approval were low. VanEck was first up and indeed received a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/124192\/sec-rejects-vanecks-spot-bitcoin-etf\" data-v-f87c67ca=\"\">rejection<\/a> on Nov. 12. The Commission concluded the product had not sufficiently mitigated market manipulation concerns — a passage that would appear in every rejection order that came after VanEck.&nbsp;","Just three days after the rejection of its spot product, VanEck's bitcoin futures product would <a href=\"https:\/\/www.theblockcrypto.com\/linked\/124332\/vanecks-bitcoin-futures-etf-to-list-tomorrow\" data-v-f87c67ca=\"\">list<\/a>.&nbsp;","Grayscale, which also has a product submission being reviewed by the SEC, expressed its concern over the VanEck denial in a letter to the securities regulator. It claimed the SEC could be in violation of the Administrative Procedures Act if it fails to approve Grayscale's spot product, since, as the issuer sees it, the Commission is applying unequal standards between spot and futures-based products.&nbsp;","But the final month of 2021 kicked off with some hope for 2022. VanEck <a href=\"https:\/\/www.theblockcrypto.com\/post\/125813\/well-be-back-vaneck-bitcoin-etf-podcast\" data-v-f87c67ca=\"\">told<\/a> The Scoop podcast that \"they'll be back\" and intend to continue pushing for a spot bitcoin ETF. Though, this was tempered with the second rejection of the year on Dec. 2, when the SEC <a href=\"https:\/\/www.theblockcrypto.com\/linked\/126181\/sec-denies-wisdomtrees-spot-bitcoin-etf-proposal\" data-v-f87c67ca=\"\">denied<\/a> WisdomTree's proposal.&nbsp;","The SEC has taken the full amount of time when reviewing bitcoin proposals, issuing the most extensions it can on each product. It kept up the habit, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/127912\/sec-punts-on-bitwise-and-grayscale-bitcoin-etf-proposals\" data-v-f87c67ca=\"\">punting<\/a> on Bitwise and Grayscale's proposals midway through the month.&nbsp;","The agency closed out the year with two more denials, <a href=\"https:\/\/www.reuters.com\/markets\/funds\/us-sec-rejects-valkyrie-kryptoin-bitcoin-trusts-2021-12-23\/\" data-v-f87c67ca=\"\">rejecting<\/a> Valkyrie and Kryptoin's proposals.&nbsp;","The year did not produce the spot product many were hoping for, but it did create significant momentum for the conversation surrounding bitcoin ETFs.","As Grayscale's APA argument plays out and issuers like VanEck and WisdomTree refile, pressure on the SEC to better define its barriers surrounding market manipulation concerns could mount. Many, like Grayscale, will continue to ask the question — how is a futures-based product that different from a spot product when it comes to preventing manipulative practices? And with crypto products of a sort now trading, the SEC may now have a proving ground for crypto ETFs.","Each year, industry hopefuls claim as the year of a spot bitcoin ETF approval, and while it's unclear if 2021 set up enough forward motion for a 2022 approval, it's certainly introduced enough new variables for a changing conversation.&nbsp;"],"hashtag":["BITCOIN","BITCOIN FUTURES ETF","SEC"]}