{"summary":"Markets sank post-Merge on Thursday as bitcoin ducked below $20,000 and ether flirted with levels around $1,500 throughout the day.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/170527\/bitcoin-slips-below-20000-ether-teeters-on-the-edge-of-1500-after-the-merge","publishDate":"2022-09-15T15:57:08","id":6150,"type":null,"title":"Bitcoin slips below $20,000, ether teeters on the edge of $1,500 after The Merge","category":["MARKETS"],"content":["Crypto markets slumped during a subdued trading day following Ethereum's official shift to proof of stake.","Bitcoin was trading at $19,763 on Coinbase, down about 0.48% over the past 24 hours, according to <a href=\"https:\/\/www.coinbase.com\/price\/bitcoin\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">data<\/a>&nbsp;from the exchange.","","","Meanwhile, ether was down 4.88% over the past 24 hours, trading at $1,498, according to Coinbase <a href=\"https:\/\/www.coinbase.com\/price\/ethereum\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">data<\/a>. Ether <a href=\"https:\/\/www.theblock.co\/post\/170283\/ether-and-related-ethereum-tokens-pull-back-following-merge-price-bump\" data-v-f87c67ca=\"\">whipsawed earlier<\/a> in the day, trading between $1,583 and $1,640 directly before and after The Merge.","Ethereum Classic and Lido DAO's token also spiked post-Merge before surrendering those gains.","","","Meanwhile, the global crypto market cap is again flirting with the $1 trillion mark, having flipped either side of this mark several times in the past few months.&nbsp;","Matt Weller, global head of market research at Forex.com, told The Block that Ethereum's upgrade went as smoothly as could have been hoped.","However, he went on to say that, \"in a classic 'buy the rumour, sell the news' reaction, we’re seeing ether fall to its lowest levels of the month.\"","Weller puts this down — in part — to \"unsophisticated traders who bought in anticipation of a quick win\" rushing to sell, as the short-term benefits of the merge are unlikely to offset the tough macroeconomic environment.","\"Both the narrative benefit of Ethereum’s 99.95% reduction in energy consumption and the fundamental supply and demand shift to a deflationary asset are likely to be felt only over longer-term periods,\" he concluded.","Ryan Shea, a crypto economist at Trakx, shared a similar sentiment with The Block on Thursday, noting the dip in price might merely be profit-taking.","\"While such price action may have some ether fans concerned, the most likely explanation is that having rallied strongly (up over 25%) in the weeks prior, the correction is simply profit-taking on the part of crypto speculators,\" he said.","Shea noted that this would explain why ether has underperformed significantly compared to bitcoin today, down over 5.4% compared to 1.7%.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"5.4%","content":"PERCENT"},{"type":"$1 trillion mark","content":"MONEY"},{"type":"Lido DAO","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"1.7%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"$1,583","content":"MONEY"},{"type":"$1,640","content":"MONEY"},{"type":"$19,763","content":"MONEY"},{"type":"$1,498","content":"MONEY"},{"type":"99.95%","content":"PERCENT"},{"type":"Matt Weller","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"Trakx","content":"ORGANIZATION"},{"type":"Ryan Shea","content":"PERSON"},{"type":"0.48%","content":"PERCENT"},{"type":"4.88%","content":"PERCENT"}],"hashtag":["BITCOIN","ETHEREUM"],"authors":["Adam Morgan McCarthy","The Block"]}