{"summary":"Kleiman v. Wright, “Order on Joint Motion for a 30-Day Extension” Case №18-cv-80176-BLOOM\/Reinhart, S.D. Florida, 9\/17\/2019 Link to order The Kleiman v.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/41257\/federal-judge-keeps-pressure-on-craig-wright-to-settle-lawsuit-following-earlier-sanctions-order","publishDate":"2019-09-27T18:55:30","id":6152,"type":null,"title":"Federal judge keeps pressure on Craig Wright to settle lawsuit following earlier sanctions order","category":["LEGAL"],"content":["<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Kleiman v. Wright, “Order on Joint Motion for a 30-Day Extension” Case №18-cv-80176-BLOOM\/Reinhart, S.D. Florida, 9\/17\/2019 [SDP]<\/strong>","<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.scribd.com\/document\/427715605\/Wright-Extension-Order\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/www.scribd.com\/document\/427715605\/Wright-Extension-Order\" data-v-f87c67ca=\"\">Link to order<\/a>","The Kleiman v. Wright litigation is a case study in how you can lose a case by breaking rules and pissing off federal judges. The wheels started to come off the bus for Craig Wright earlier this year when in June, Magistrate Judge Reinhart ordered him to testify in a hearing to show cause why he should not be held in “civil and\/or criminal contempt.”","The Court rejected almost of all of Wright’s arguments about why he hadn’t complied with discovery obligations, including his argument that “encryption is hard.” I predicted at the time that Wright would be sanctioned and that this would ultimately lead to the case settling, in part because the Court would heavily lean on Wright to do so.","","","Several months later, and several more Court orders finding that Wright flaunted discovery obligations and wasn’t truthful — from two judges — this all came to pass. A joint motion filed on Sept. 17 reported to the Court that the parties had reached a settlement in principle and asked the Court to give them time to finalize things.","While I’d like to claim oracular skills if you do this for a living it wasn’t all that hard to predict. Federal judges hate liars and rule breakers and will give litigants a certain amount of leeway until they don’t. That’s what happened here. The Court had entered an Order that was pretty much case ending for Wright, severely sanctioning him and giving him very little basis to defend the case, and basically calling him a liar. While it wasn’t completely impossible to come back from this it was practically so, and settlement was really the only rational resolution.","Anyway, as a postscript to this, the Court ruled on the motion for additional time by giving the parties 30 days but otherwise keeping the case schedule intact. And perhaps as a way to keep pressure on Wright to settle, the Court says that Kleiman’s motion for attorneys fees (which would be inevitably be granted) must be filed by Oct. 20, and pre-trial motions by Jan. 17, 2020, suggesting that the Court will not hesitate to push the case to a trial (which Kleiman would most likely win) early next year if the parties don’t wrap their settlement up, pronto.","Just like this case tells us very little about the identity of Satoshi, we are unlikely to learn anything about the terms of the settlement. It’s likely to be a condition of the settlement agreement they remain confidential, which is typical.","<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen D. Palley<\/a> and <a href=\"https:\/\/twitter.com\/nelsonmrosario\" data-v-f87c67ca=\"\">Nelson M. Rosario<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. And we might change our minds. We contain multitudes.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Court","content":"ORGANIZATION"},{"type":"Reinhart","content":"PERSON"},{"type":"Jan. 17, 2020","content":"DATE"},{"type":"Craig Wright","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Satoshi","content":"PERSON"},{"type":"Sept. 17","content":"DATE"},{"type":"Stephen D. Palley","content":"PERSON"},{"type":"Oct. 20","content":"DATE"},{"type":"SDP","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Nelson M. Rosario","content":"PERSON"},{"type":"Wright","content":"PERSON"},{"type":"Kleiman v. Wright","content":"PERSON"},{"type":"Kleiman","content":"PERSON"},{"type":"S.D. Florida","content":"LOCATION"}],"hashtag":[],"authors":["Stephen Palley","The Block"]}