{"summary":"The Harmony blockchain suffered a $100 million theft on its Horizon bridge\nSecurity analysts say the hacker first gained control of bridge’s multi-signature wallet.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/154029\/harmonys-100-million-hacker-took-control-of-its-multi-signature-wallet-analysts-say","publishDate":"2022-06-24T08:59:10","id":616,"type":null,"title":"Harmony&#x27;s $100 million hacker took control of its multi-signature wallet, analysts say","category":["Hacks"],"content":["<span data-v-f87c67ca=\"\">On Thursday, Harmony, a proof-of-stake (PoS) blockchain, lost <a href=\"https:\/\/www.theblock.co\/linked\/153973\/harmonys-cross-chain-bridge-hit-by-eth-theft-worth-nearly-100-million\" data-v-f87c67ca=\"\">$100 million<\/a> to a theft on its Ethereum-linked bridge.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The anonymous hacker stole multiple assets, including ETH, BNB, USDT, USDC and DAI. These assets were previously bridged from Ethereum to the Harmony blockchain through the Horizon bridge.<\/span>","<span data-v-f87c67ca=\"\">In response, Harmony said it was working with law enforcement agencies and cyber security firms. Still, the team did not explain how the hack took place.<\/span>","<span data-v-f87c67ca=\"\">While the Harmony team has yet to provide an official post-mortem, security experts have offered some insights into the hack. <\/span><span data-v-f87c67ca=\"\">According to <a href=\"https:\/\/twitter.com\/Mudit__Gupta\/status\/1540225234153996288\" data-v-f87c67ca=\"\">Mudit Gupta<\/a>, Polygon's chief information security officer, the perpetrator gained control of the multi-signature wallet used in deploying Harmony's <\/span><span data-v-f87c67ca=\"\">bridge.<\/span>","<span data-v-f87c67ca=\"\">A<\/span><span data-v-f87c67ca=\"\"> multi-signature wallet is a smart contract account that is managed with several private keys, divided among multiple entities rather than a single person. Gupta found that<\/span><span data-v-f87c67ca=\"\"> the bridge's wallet's funds required a permission from at least two of the total five private keys, so t<\/span><span data-v-f87c67ca=\"\">he perpetrator may have extracted two private keys and gained control.<\/span>","<span data-v-f87c67ca=\"\">“The bridge was essentially a 2 of 5 multi-sig. If any 2 addresses told it to transfer funds to someone, it did,” Gupta <a href=\"https:\/\/twitter.com\/Mudit__Gupta\/status\/1540225234153996288\" data-v-f87c67ca=\"\">said<\/a>. \"The hacker compromised 2 addresses and made them drain the money.\"<\/span>","<span data-v-f87c67ca=\"\">CertiK, a smart contract security firm, corroborated that the hacker did, in fact, target the bridge’s multi-signature wallet. In a Friday <a href=\"https:\/\/www.certik.com\/resources\/blog\/2QRuMEEZAWHx0f16kz43uC-harmony-incident-analysis\" data-v-f87c67ca=\"\">report<\/a>, CertiK said: <\/span><span data-v-f87c67ca=\"\">\"The attacker accomplished this [exploit] by somehow controlling the owner of the MultiSigWallet to call the confirmTransaction() directly to transfer large amounts of tokens from the bridge on Harmony.\"&nbsp;<\/span>","<em data-v-f87c67ca=\"\">This is a developing story. Harmony didn't immediately respond to a request for comment.<\/em>"],"hashtag":[]}