{"summary":"Wintermute — one of the largest trading firms in the DeFi market — has been building out a decentralized exchange aggregator.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/150978\/crypto-trading-firm-wintermute-has-been-incubating-a-new-decentralized-exchange-aggregator","publishDate":"2022-06-09T08:00:54","id":6162,"type":null,"title":"Crypto trading firm Wintermute has been incubating a new decentralized exchange aggregator","category":["CAPITAL MARKETS"],"content":["One of the largest trading firms in the decentralized finance market has been quietly incubating a product aimed at the masses.&nbsp;","Wintermute — the crypto firm led by high-speed trading veteran Evgeny Gaevoy — on Thursday unveiled&nbsp;a new decentralized trading platform, dubbed Bebop. It is a unique instance of an institutional market participant gate-crashing the retail trading world, with the product set to go head-to-head with decentralized exchange aggregators like 1inch.","Wintermute makes markets on both centralized and decentralized crypto exchanges, trading billions of dollars per month.&nbsp;","The move is somewhat comparable to a powerhouse of the traditional financial world, like Virtu Financial or Citadel Securities, launching a platform to rival Robinhood.&nbsp;","The project aims to solve for the inefficiencies that exist in decentralized finance trading, which is plagued by high gas fees and poor user interfaces.&nbsp;","\"The universe&nbsp;of DeFi is fragmented,\" a press release shared with The Block notes. \"The quality of platforms and offerings is inconsistent, making it difficult to&nbsp;navigate the landscape and to assess which can be most trusted.\"","Leveraging the trading expertise of Wintermute, Bebop aims to solve these problems by offering ordinary DeFi users the execution quality that is available to institutional traders. To that end, the project plans to offer users the ability to swap one token for several different types of tokens through one transaction.","\"This allows you to&nbsp;enter or exit positions 'in one go,' which can be especially important in fast markets. Not to&nbsp;mention enabling our users to save money on the network fees that would have been&nbsp;associated with each individual transaction,\" Wintermute said in the release.","The project also claims that users won't face slippage costs when trying to execute a swap. Typically, during periods of low liquidity, DeFi users might have to pay additional costs to execute a DeFi trade. Wintermute's Gaevoy said the project plans to fix this by showing the end-client a more direct price.","\"By showing a firm price in the first place. Other aggregators are showing price, then receive request from a user, but by the time they hit blockchain with their order the price on, for example, Uniswap could have changed and so user could pay more as a result.\"","As for how it fits into the broader Wintermute story, Gaevoy said that the idea to launch the product stemmed from its existing role in DeFi as one of the largest non automated market makers behind 1inch.&nbsp;","\"At some point we thought, if we are so good pricing wise, we can launch our own RFQ [request for quote] platform,\" he said. \"And then on top of it we can improve on user experience, start with features nobody has (one to many, many to one) and ultimately target to become leading DeFi cross chain trading platform.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Wintermute","content":"LOCATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"Wintermute","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"Virtu Financial","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Citadel Securities","content":"ORGANIZATION"},{"type":"Gaevoy","content":"PERSON"}],"hashtag":["WINTERMUTE"],"authors":["Frank Chaparro","The Block"]}