{"summary":"The Voyager sale plan proposal contains plans to settle with executives over their alleged roles in the nearly $1 billion loan to 3AC.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/178162\/voyager-sale-proposal-includes-settlement-for-executives-over-three-arrows-capital-loan","publishDate":"2022-10-18T19:11:08","id":6163,"type":null,"title":"Voyager sale proposal includes settlement for executives over Three Arrows Capital loan","category":["POLICY"],"content":["New court filings in the Voyager bankruptcy proceedings show the group tasked with investigating the lead-up to the lender's demise is recommending settlements with top executives over their roles in <a href=\"https:\/\/www.theblock.co\/post\/154316\/voyager-digital-issues-default-notice-against-three-arrows-capital\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">a nearly $1 billion loan<\/a> to fallen hedge fund Three Arrows Capital.","The documents come as part of a purchase agreement that will go before the court Wednesday. FTX purchased the embattled lender's assets for about $1.4 billion at the close of last month, bringing the Chapter 11 bankruptcy process into its end game. The court and creditors still need to approve the sale process.","Part of that sales process includes acting on the results of a special committee investigation into the business, including possible missteps by its executives.","Among its recommendations is a settlement with CEO Stephen Ehrlich and previous CFO Evan Psaropoulos. Ehrlich and Psaropoulos agreed to lend 3AC $1 billion in crypto. The hedge fund would suffer a sudden implosion with the collapse of the TerraUSD stablecoin and leave Voyager with a nearly $1 billion claim and concerns that perhaps Ehrlich and Psaropoulos failed to do sufficient due diligence or structure the loan in a way that could have better protected Voyager.&nbsp;","But the investigation found that it would be challenging to pursue negligence claims against the executives and is instead recommending settlements that would have them return $1.3 million to $3 million of personal assets and up to $20 million through directors and officers liability insurance. The investigation found no evidence of fraud or clear missteps around the 3AC loan that could easily be proven in court. While the settlement would not make a dent in the cost the executives' decisions may have led to, prosecuting them would likely result in less money, said the filings.","\"The Special Committee made the decision to settle, subject to Court approval, based on the fact that the individuals do not have personal assets available to satisfy any potential judgment even if the claims were successfully prosecuted, whereas the cost of prosecuting would likely dissipate the available D&amp;O insurance coverage and the assets that are being paid through the settlement in defense costs,\" said the filing.","This settlement would further release claims against Ehrlich and Psaroupoulos – a sticking point for the committee representing creditors.","In recent weeks, the creditor committee has filed a limited objection to the sale plan over releases that would protect the executives from the possibility of future legal action. The committee is asking the court to alert creditors to these stipulations and enable a third voting option in the creditor vote that assents to the plan but objects to the releases.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1.4 billion","content":"MONEY"},{"type":"Court","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Ehrlich","content":"PERSON"},{"type":"$1.3 million","content":"MONEY"},{"type":"The Special Committee","content":"ORGANIZATION"},{"type":"Psaropoulos","content":"PERSON"},{"type":"$3 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Stephen Ehrlich","content":"PERSON"},{"type":"Evan Psaropoulos","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"$20 million","content":"MONEY"},{"type":"last month","content":"DATE"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}