{"summary":"Bitcoin miner Argo is looking to sell assets to a third party and is &quot;hopeful&quot; to close a deal and avoid bankruptcy.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/194230\/bitcoin-miner-argo-accidentally-said-its-filing-for-chapter-11-but-is-actually-trying-to-avoid-that-fate-by-selling-assets","publishDate":"2022-12-12T13:57:10","id":6164,"type":null,"title":"Bitcoin miner Argo accidentally said it&#x27;s filing for Chapter 11, but is actually trying to avoid that fate by selling assets","category":["COMPANIES"],"content":["Bitcoin miner Argo is looking to sell assets and get a loan as it seeks to avoid bankruptcy as it runs low on cash and after it accidentally published a document implying it would file for Chapter 11.","The company is in \"advanced negotiations with a third party\" to sell certain assets and secure equipment financing, it said in a <a href=\"https:\/\/polaris.brighterir.com\/public\/argo_blockchain\/news\/rns\/story\/x5gmplw\" data-v-f87c67ca=\"\">statement<\/a>. \"The company is at risk of having insufficient cash to support ongoing business operations within the next month.\"","\"The company is hopeful that it will be able to consummate the transaction outside of a voluntary Chapter 11 bankruptcy filing in the United States, although there is no assurance that the company can avoid such a filing,\" it said.","Argo said that it accidentally published draft materials on its website saying that it was voluntarily filing for Chapter 11 bankruptcy protection in the U.S., leading its stock to be temporarily suspended on the London Stock Exchange on Friday.","\"Shareholders should note that the company has not filed for bankruptcy at this time,\" it said. \"The company has requested that the UK Financial Conduct Authority restore the listing of its ordinary shares and that is expected to happen as soon as practicable.\"","The miner had already <a href=\"https:\/\/www.theblock.co\/post\/181291\/argo-blockchain-shares-fall-bitcoin-miner-negative-cash-flow\" data-v-f87c67ca=\"\">warned that it would become cashflow negative<\/a> if it failed to raise more money, after a financing deal fell through. In that scenario it would also have to cease operations, the company said at the time. The news comes as miners struggle with increasing mining difficulty, higher energy costs and lower bitcoin prices.","Argo has hired legal advisers, financial advisers and investment bankers to help analyze options, it said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Stock Exchange","content":"ORGANIZATION"},{"type":"UK Financial Conduct Authority","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"London","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"United States","content":"LOCATION"}],"hashtag":["MINING COMPANIES"],"authors":["Catarina Moura","The Block"]}