{"summary":"MetaMask released a new function that allows users to change their RPC providers among a host of other privacy and security improvements.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/208058\/metamask-rolls-out-updates-to-privacy-settings-for-new-and-existing-users","publishDate":"2023-02-02T09:58:02","id":6165,"type":null,"title":"MetaMask rolls out updates to privacy settings for new and existing users","category":["CRYPTO ECOSYSTEMS"],"content":["Ethereum wallet provider MetaMask introduced new security and privacy functions for new and existing users, while making it easier for them to change their RPC providers.","MetaMask has introduced a range of features that the project says will give users more control over their data, according to an announcement on Feb. 2. These features include the ability to toggle on or off particular settings that control the transfer of user data to third-party services. These services help users to avoid falling victim to phishing attacks and they also help to decode incoming transactions.","It also made it easier to switch RPC (remote procedure call) providers. RPC providers offer nodes that allow apps like MetaMask to connect to blockchains, enabling such apps to broadcast user transactions to supported network. Users now have a more convenient way to <a href=\"https:\/\/twitter.com\/MetaMask\/status\/1621128525263638528?s=20&amp;t=Kb16pEdLxvSbwmefTGnIGw\" data-v-f87c67ca=\"\">set<\/a> their preferred RPC provider rather than using Infura, the default one on MetaMask.","To do so, MetaMask said new users can go to “set advanced privacy settings” to change their RPC provider. Existing users can find this option under “settings,” the announcement added.","This update comes after ConsenSys came under some scrutiny for <a href=\"https:\/\/www.theblock.co\/post\/189717\/consensys-says-it-collects-ip-addresses-of-metamask-users-via-infura\" data-v-f87c67ca=\"\">collecting MetaMask user data<\/a> via Infura. ConsenSys is an Ethereum software company that owns both MetaMask and Infura. This admission threw up privacy concerns from crypto participants.","ConsenSys clarified that it did not collect user data if they used other RPC providers. Users have been able to set alternative RPC endpoints on their MetaMask before this current update.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"MetaMask","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"RPC","content":"ORGANIZATION"},{"type":"Feb. 2","content":"DATE"}],"hashtag":["DEVELOPER TOOLS","WALLETS"],"authors":["Osato Avan-Nomayo","The Block"]}