{"summary":"Circle CEO Jeremy Allaire isn’t buying any narratives which suggests the traditional banking system needs to be protected from crypto. Instead, he believes the opposite to be true.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/220214\/circle-ceo-jeremy-allaire-talks-crypto-banks","publishDate":"2023-03-15T13:05:47","id":6166,"type":null,"title":"&#x27;We&#x27;re trying to save crypto from the banks&#x27;: Circle CEO Allaire","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Circle CEO Jeremy Allaire isn’t buying any narratives which suggests the traditional banking system needs to be protected from crypto. Instead, <\/span><span data-v-f87c67ca=\"\">he believes the opposite to be true.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n\"Everybody's talking about how we need to save the banks from crypto and right now we're trying to save crypto from the banks,\" &nbsp;said Allaire during an interview with the hosts of the Bankless podcast.<br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">The scrutiny of how traditional banks manage deposits they hold on behalf of crypto companies has intensified in recent days after a run of prominent financial institutions like Silvergate, Silicon Valley Bank and Signature Bank all shuttered.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nCircle is currently in the process of moving $3.3 billion from Silicon Valley Bank to BNY Mellon, said Allaire.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">“We’ve got $3.3 billion in transit and we can see in the fed wire system that the receiving bank is acknowledging ‘yes, this is incoming,’” said Allaire. “It hasn’t settled on the fed wire ledger.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nCircle operates the USDC stablecoin, which depegged on news that the company had money held at Silicon Valley Bank.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jeremy Allaire","content":"PERSON"},{"type":"Allaire","content":"PERSON"},{"type":"USDC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Silicon Valley Bank to BNY Mellon","content":"ORGANIZATION"},{"type":"$3.3 billion","content":"MONEY"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"},{"type":"Signature Bank","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}