{"summary":"Fidelity Investment&#x27;s crypto arm, Fidelity Digital Assets, launched commission-free trading on the two largest assets by market cap in crypto to all users (old and new) recently.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/220298\/fidelity-crypto-quietly-went-live-giving-millions-of-retail-customers-access-to-bitcoin-ether","publishDate":"2023-03-15T15:55:10","id":6167,"type":null,"title":"Fidelity Crypto quietly went live, giving millions of retail customers access to bitcoin, ether","category":["FINANCE FIRMS"],"content":["Fidelity Digital Assets quietly opened access to Fidelity Crypto for the masses recently.","Millions of users can now trade bitcoin and ether commission-free on the platform. The app was previously restricted to a waitlist, with users given access on a rolling basis. Fidelity Crypto is open to new and existing customers — first-time customers must create a Fidelity Brokerage account during the setup process. The service is not available in all states.","Bitcoin and ether are the two assets users can trade right now, and trading is commission-free. The firm will charge a spread of no more than 1%. Withdrawals haven't yet been enabled on the platform.&nbsp;","Fidelity, which 37.1 million total retail accounts, has acted sooner than most of its peers in the U.S. in offering crypto to retail clients. The full launch happened over the past few weeks, according to sources with knowledge of the matter.","The launch coincided with an increasingly hot regulatory environment in the U.S. and the collapse of two of crypto's biggest banking partners, Silvergate and Signature Bank.&nbsp;","The investment manager <a href=\"https:\/\/www.theblock.co\/post\/197928\/fidelity-files-for-metaverse-trademarks-in-latest-crypto-push\" data-v-f87c67ca=\"\">filed<\/a>&nbsp;three U.S.&nbsp;trademark applications at the end of 2022. The applications included providing services in the metaverse and other virtual worlds.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Fidelity Crypto","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Fidelity Digital Assets","content":"ORGANIZATION"},{"type":"Fidelity Brokerage","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"the U.S.","content":"LOCATION"},{"type":"Signature Bank","content":"ORGANIZATION"}],"hashtag":["FINTECH","INVESTMENT FIRMS","TRADFI BANKS"],"authors":["Adam Morgan McCarthy","Frank Chaparro","The Block"]}