{"summary":"Jeremy Allaire, the CEO and co-founder of stablecoin issuer Circle, is urging lawmakers to defend the primacy of the U.S. dollar and pass stablecoin legislation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234314\/circles-allaire-says-the-us-dollar-is-at-crossroads-urges-stablecoin-legislation","publishDate":"2023-06-12T17:03:33","id":6169,"type":null,"title":"Circle&#x27;s Allaire says the US dollar is at crossroads, urges stablecoin legislation","category":["COMPANIES"],"content":["Jeremy Allaire, the CEO and co-founder of stablecoin issuer Circle, will use scheduled testimony on Tuesday at a U.S. House Financial Services Committee Hearing to urge lawmakers to defend the primacy of the U.S. dollar and pass stablecoin legislation he said will help keep the currency competitive on a global scale.&nbsp;","\"The dollar is at a crossroads,\" Allaire said in <a href=\"https:\/\/www.circle.com\/executiveinsights\/payment-stablecoins-support-the-dollar-and-u.s.-economic-competitiveness\" data-v-f87c67ca=\"\">written testimony<\/a>, pointing to what he said are \"rapidly evolving geo-economic and geo-political blocs\" that are putting pressure on the dollar-based global financial system.","\"Dollar primacy allows the US to weather economic and financial shocks (as the dollar strengthens in times of crisis) and exert global influence far more than other countries,\" he added.","Allaire pointed to strides China has been making with a digital yuan and said a stablecoin bill would be a crucial piece of legislation to keep the U.S. currency at the forefront of the global financial system.","In April, the House Financial Services Committee released a new discussion <a href=\"https:\/\/www.theblock.co\/post\/226575\/new-stablecoins-bill-draft-introduced-house-of-representatives\" data-v-f87c67ca=\"\">draft bill<\/a> that would regulate stablecoins in the country.&nbsp;","\"Delivering a bill to President Biden’s desk should be a national priority,\" Allaire said, noting recent efforts in European Union, Japan and Hong Kong to regulate U.S. dollar stablecoins. \"Other nations are enacting laws to regulate the use of the US dollar.\"","Allaire said he believed there should be nationally-established standards for state and federally licensed issuers. He also called for \"tailored and limited rights<strong data-v-f87c67ca=\"\">\" <\/strong>for stablecoin issuers to access basic Federal Reserve account services.&nbsp;","\"This would facilitate more timely satisfaction of redemption requirements, enhance financial stability, and protect consumers without providing access to the discount window or other financing programs afforded only to banks,\" he said, arguing that financial intermediaries for stablecoins should be required to hold them at qualified custodians that can include trust banks.","Finally, Allaire called for criminal penalties for companies that knowingly issue false digital dollars.&nbsp;","\"I believe civil penalties alone are woefully insufficient to dissuade those who will have tremendous economic incentives to flout US law and undermine the dollar’s credibility at home and abroad,\" he said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jeremy Allaire","content":"PERSON"},{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"European Union","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"U.S. House Financial Services Committee Hearing","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Japan","content":"LOCATION"},{"type":"Allaire","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Biden","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}