{"summary":"PayPal&#x27;s stablecoin integration with the yield-bearing USYC token is being rolled out through a new partnership between Paxos and Hashnote.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284640\/paxos-hashnote-partner-for-paypal-stablecoin-and-usyc-token-integration","publishDate":"2024-03-26T09:00:03","id":617,"type":null,"title":"Paxos, Hashnote partner for PayPal stablecoin and USYC token integration","category":["STABLECOINS"],"content":["Digital asset manager Hashnote said it is partnering with Paxos as the two companies plan to roll out an integration between PayPal's stablecoin and the <span data-v-f87c67ca=\"\">yield-bearing USYC token, according to a statement.<\/span>","PayPal <a href=\"https:\/\/www.theblock.co\/post\/243569\/paypal-launches-stablecoin\" data-v-f87c67ca=\"\">launched<\/a> its PYUSD stablecoin last year in conjunction with Paxos. Now by partnering with Paxos, <a href=\"https:\/\/www.theblock.co\/post\/262992\/real-world-assets\" data-v-f87c67ca=\"\">Hashnote<\/a> aims to improve settlement for its <span data-v-f87c67ca=\"\">USYC token, which is <\/span><span data-v-f87c67ca=\"\">backed by investment in U.S. Treasury Bills, the company's statement said.<\/span>","\"<span data-v-f87c67ca=\"\">Hashnote initiated this partnership with Paxos, selecting PYUSD as our stablecoin of choice, because we see it as the future frontrunner in the stablecoin space,\" Hashnote CEO Leo Mizuhara told The Block. \"The critical advantage for all our stakeholders comes from the ability to instantly mint and redeem between PYUSD and USYC, a process that not only enhances liquidity but also positions us at the forefront of yield generation in the digital asset realm.\"<\/span>","The PYUSD-USYC integration will facilitate a \"<span data-v-f87c67ca=\"\">two-way atomic settlement process\" that allows for instantaneous conversions between the two tokens, Hashnote's statement said.&nbsp;<\/span>","According to Hashnote, <span data-v-f87c67ca=\"\">USYC is only accessible to investors outside the U.S. and is \"subject to eligibility restrictions and a $100,000 minimum investment.\"&nbsp; But U.S. investors \"can get exposure to USYC through the Hashnote Feeder Fund,\" the firm also said.<\/span>","PYUSD's market cap surpassed $300 million at the beginning of this year before shrinking considerably during March, according to <a href=\"https:\/\/www.theblock.co\/data\/stablecoins\/usd-pegged\/total-stablecoin-supply-daily\" data-v-f87c67ca=\"\">The Block's Data Dashboard<\/a>.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/stablecoins\/usd-pegged\/total-stablecoin-supply-daily\/embed\" title=\"Total Ethereum Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Paxos","content":"PERSON"},{"type":"Leo Mizuhara","content":"PERSON"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"USYC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"$100,000","content":"MONEY"},{"type":"Hashnote","content":"LOCATION"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"Hashnote","content":"PERSON"},{"type":"$300 million","content":"MONEY"},{"type":"Hashnote","content":"ORGANIZATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["PAYMENTS"],"authors":["RT Watson","The Block"]}