{"summary":"The venture capital firm can take risks others may not be able to, and then see deal flow from them. It recently revealed its latest open-source project, Magi.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/227476\/a16zs-strategy-crypto","publishDate":"2023-04-20T19:40:03","id":6175,"type":null,"title":"A16z&#x27;s looking to code, and not just fund firms anymore","category":["DEFI"],"content":["A16z doesn't want to just dole out money anymore.","The venture capital firm is one of the most deeply-pocketed and well-connected venture firms on Market Street, but its crypto division now wants <a href=\"https:\/\/a16z.com\/portfolio\/\" data-v-f87c67ca=\"\">potential portfolio companies<\/a> to focus on its ability to ship open-source code.","The firm — which has raised <a href=\"https:\/\/www.theblock.co\/post\/221574\/a16z-blockchain-game-eve\" data-v-f87c67ca=\"\">billions to deploy into the spine-tinglingly volatile market<\/a> for protocols and cryptocurrencies — on Wednesday revealed its latest open-source project, <a href=\"https:\/\/www.theblock.co\/post\/227136\/a16z-crypto-andreessen-horowitz-optimism-magi-orange-ball\" data-v-f87c67ca=\"\">Magi, a new rollup client for Optimism<\/a> (OP). <a href=\"https:\/\/www.theblock.co\/post\/203122\/ethereum-layer-2-protocol-optimism-surpasses-arbitrum-in-transaction-volume\" data-v-f87c67ca=\"\">Optimism is a Layer 2 blockchain<\/a> that aims to make Ethereum faster and more scalable.&nbsp;","It follows other recent software initiatives released by a16z crypto's team of engineers, which has also shipped <a href=\"https:\/\/github.com\/a16z\/halmos\" data-v-f87c67ca=\"\">tooling to improve security in Ethereum smart contracts and functionality in auctions<\/a>.&nbsp;","\"Our team's goal is genuinely to see [crypto] develop faster, more safely, and more decentralized,\" the firm's <a href=\"https:\/\/a16z.com\/author\/eddy-lazzarin\/\" data-v-f87c67ca=\"\">Chief Technology Officer Eddy Lazzarin<\/a> said in a phone interview with The Block. \"If that doesn't happen then we don't succeed.\"&nbsp;","A16z — a firm that has also raked in on the success of centralized companies like Facebook that crypto is attempting to disrupt — is of course also in the business of making money. In Lazzarin's view, contributing to software tooling that can be utilized by builders in crypto translates into new investment opportunities that would not otherwise be possible.&nbsp;","\"If we are really technically capable and we can demonstrate to the space that, then projects will want to work with us,\" Lazzarin said.&nbsp;","","","The roll-out of Magi, which effectively improves upon the existing infrastructure of an Optimism node, has already opened the doors to more deal-flow, according to Lazzarin.","\"Magi is written in Rust,\" he said, referring to the popular coding language. Working with an Optimism node that is written in Rust makes it more flexible for developers to work with and run deeper analytics on Ethereum.","Venture firms are uniquely positioned to contribute to these kind of software developments because it's a difficult endeavor from which to profit, and they're already rolling in it. Rivals VCs like Paradigm and Jump make similar types of software contributions that are billed as public good initiatives.&nbsp;","Some of the firm's existing portfolio companies are already set to use Magi. Coinbase, according to Lazzarin, which will leverage Magi-powered nodes for its layer-two network, base.&nbsp;","\"The feedback we're getting is blowing up; they want to contribute to Magi and use it for MEV research because of the performance characteristics,\" he said.&nbsp;","\"Generally, we get entrepreneurs pitching us because they see these tools and they can materialize stuff with us. We just hired someone two days ago because he was using our tools in creative ways.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lazzarin","content":"LOCATION"},{"type":"Lazzarin","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Eddy Lazzarin","content":"PERSON"},{"type":"MEV","content":"ORGANIZATION"},{"type":"Magi","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ANDREESSEN HOROWITZ"],"authors":["Frank Chaparro","The Block"]}