{"summary":"KYC procedures in crypto may become increasingly stringent, including regular verifications and incorporating more biometric data.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/250121\/crypto-kyc-increasingly-stringent-bitget-gracy-chen","publishDate":"2023-09-11T07:14:56","id":6177,"type":null,"title":"Crypto KYC may become increasingly stringent, Bitget MD Gracy Chen says","category":["PEOPLE"],"content":["Crypto Know-Your-Customer (KYC) measures are expected to become increasingly stringent, according to Bitget Managing Director Gracy Chen, and could see users required to undergo verification multiple times a year.","“It is possible that in the near future, undergoing regular KYC procedures will become the new standard in the market, necessitating users to verify their identities multiple times a year,” Chen told The Block in an interview. “The incorporation of biometric data into KYC processes also appears to be gaining traction. While opinions on this matter may vary, it will notably complicate the activities of fraudulent individuals.”","The crypto derivatives exchange and copy trading platform’s <a href=\"https:\/\/www.bitget.com\/blog\/articles\/bitget-to-introduce-mandatory-kyc-requirements#:~:text=VICTORIA%2C%20Seychelles%2C%20August%2022%2C,complete%20KYC%20verification%20upon%20registration.\" data-v-f87c67ca=\"\">mandatory KYC requirements<\/a> came into force on Sept. 1 for new users and Oct. 1 for existing users to be able to deposit and trade.","“Certain procedures have become essential to ensure continued global operations and to provide security and stability for our users,” Chen said, adding that the move didn’t lead to any significant issues for the firm, despite causing concern for some users.","“Firstly, we are not the first exchange to introduce mandatory KYC,” Chen said. “Secondly, it's a prevailing market trend that was a matter of time and not an unexpected development. Overall, the implementation of these updated requirements has minimal impact on the majority of our users who are seeking a trustworthy and secure platform for their operations.”","Bitget’s move follows crypto exchange rivals <a href=\"https:\/\/www.theblock.co\/post\/236838\/crypto-exchange-kucoin-mandatory-kyc\" data-v-f87c67ca=\"\">KuCoin<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/227943\/bybit-moves-to-impose-mandatory-kyc-rules-for-all-services\" data-v-f87c67ca=\"\">Bybit<\/a> in introducing mandatory KYC procedures for users earlier this year.","“We are confident that over time, users will appreciate KYC's role in building trust, as it helps crypto companies protect them against fraud and money laundering,” Chen said. “By complying with AML and KYC regulations, we demonstrate a commitment to transparency that builds confidence with partners. It also aligns us with global regulatory standards.”","The move also follows Bitget’s plan to expand its global presence as part of a “go beyond derivatives strategy.” Bitget launched a <a href=\"https:\/\/www.theblock.co\/post\/225504\/bitget-venture-fund\" data-v-f87c67ca=\"\">$100 million Web3 Fund<\/a> in April and <a href=\"https:\/\/www.theblock.co\/post\/221903\/bitget-bitkeep-acquisition-investment\" data-v-f87c67ca=\"\">invested $30 million in the decentralized BitKeep multi-chain wallet<\/a> in March, subsequently rebranding it to the Bitget Wallet. It also took a <a href=\"https:\/\/www.theblock.co\/post\/224702\/dragonfly-invests-bitget\" data-v-f87c67ca=\"\">$10 million strategic investment<\/a> from crypto investment firm Dragonfly Capital in April and <a href=\"https:\/\/www.theblock.co\/post\/237669\/bitget-crypto-loans\" data-v-f87c67ca=\"\">launched a crypto loans product<\/a> in July.","While KYC has been a part of Bitget's procedures since the platform launched in 2018, initially, users could access certain services without full KYC, especially if they weren't dealing with substantial sums.&nbsp;","“Previously, certain operations that didn't involve substantial sums of money and access to the full range of services were possible without undergoing KYC. However, we have now transitioned to a model where full KYC is mandatory for access to all exchange services,” Chen said.","Although KYC measures can help curb illicit activity like money laundering, it's not a silver bullet that can prevent all financial crimes, Chen argued.&nbsp;","“Despite advancements made in [KYC and AML] processes over the past decade, their effectiveness often falls short,” Chen said, with crypto exchanges needing more cost-effective, sustainable and scalable solutions for detecting and investigating financial crimes.","Future solutions should “harness innovative technologies, including workflow enhancements, analytics, human control, Robotic Process Automation, AI and machine learning to bolster and expedite risk detection and remediation,” Chen added. “Staying closely attuned to changes in the regulatory framework is essential,” as is strengthening “technical and human oversight over documents and transactions,” she said.","AI, in particular, offers a dynamic response to modern challenges, enhancing regulatory compliance efforts, according to Chen.","“One particularly promising solution lies in the application of AI, which holds the potential to bring about a substantial transformation in AML capabilities,\" the Bitget MD said.","“AI has the capacity to deliver substantial operational efficiencies in critical areas such as customer due diligence, screening and transaction monitoring controls,” she added. “For instance, traditional AML transaction monitoring systems often produce an excessive number of false positive alerts, leading to substantial operational burdens.”","Given substantial leaks of personal information from crypto companies following the collection of KYC data in the past, such as crypto hardware wallet firm <a href=\"https:\/\/www.theblock.co\/post\/88706\/a-detailed-look-at-the-ledger-data-leak-and-other-recent-incidents\" data-v-f87c67ca=\"\">Ledger’s data leak in 2020<\/a>, Chen acknowledged the need to balance security and privacy.","“There are entire hacking groups dedicated to hunting for personal data, identifying vulnerabilities, carrying out hacks and selling this information on the darknet,” Chen said. “However, our user data is stored with the same level of security as cryptocurrencies.”","“Protecting user privacy is a core priority of our KYC process,” Chen added. “We utilize strict protocols and advanced tools to guarantee users' personal data remains secure. Our KYC vendors have to go through a security assessment before implementation to ensure all our vendors are up to Bitget's security standards and our customer data are well protected.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Chen","content":"PERSON"},{"type":"Bitget","content":"ORGANIZATION"},{"type":"Gracy Chen","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Oct. 1","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Sept. 1","content":"DATE"},{"type":"Chen","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"$30 million","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"Robotic Process Automation","content":"ORGANIZATION"},{"type":"KYC","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"April","content":"DATE"},{"type":"$10 million","content":"MONEY"},{"type":"Dragonfly Capital","content":"ORGANIZATION"}],"hashtag":[],"authors":["James Hunt","The Block"]}