{"summary":"Zodia is planning to launch new products to help institutional investors earn yield on token holdings.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/137662\/standard-chartered-crypto-custodian-zodia-yield","publishDate":"2022-03-14T06:37:41","id":6187,"type":null,"title":"Standard Chartered’s crypto custodian to help clients earn yield on token holdings","category":["INSTITUTIONAL INVESTORS"],"content":["A crypto custody startup spearheaded by financial services giants Standard Chartered and Northern Trust is plotting new products aimed at generating yield for institutional investors.","Maxime de Guillebon, Zodia’s CEO, told The Block in an interview that the business is ready to launch collateral management products that will help big investors generate income on their crypto holdings.&nbsp;Any launch would require sign-off from regulators, but de Guillebon is hoping the products will be live this year.&nbsp;","“Given the rapid expansion and sophistication of the crypto asset industry, Zodia’s institutional clients are looking for more than spot exposure to digital assets,” said de Guillebon.","He explained that clients are calling for “efficient access to liquidity, leverage and yield” through a range of products familiar in traditional asset classes, such as derivatives, financing, and lending and borrowing services.","Zodia is also exploring staking products — which involve locking up crypto to earn rewards — and connecting clients to DeFi protocols, de Guillebon said, again subject to regulatory approval.","“By expanding our offering and giving clients the opportunity to generate yield, Zodia will be the only crypto asset servicing firm looking to facilitate via crypto native and traditional finance structures,” he added.","Zodia, which currently offers custody of bitcoin and ether, also plans to widen the range of tokens it supports in April, according to de Guillebon.","SC Ventures, Standard Chartered’s innovation and ventures unit, partnered with asset servicing giant Northern Trust to begin working on Zodia in December 2020.","The London-based company officially launched a year later, after <a href=\"https:\/\/www.theblockcrypto.com\/linked\/111600\/standard-chartered-backed-crypto-custodian-zodia-added-to-uk-fcas-crypto-register\" data-v-f87c67ca=\"\">getting registered<\/a> by the UK's Financial Conduct Authority in July 2021. But it had been doing business since October, and was chosen to provide custody services for <a href=\"https:\/\/www.globalcustodian.com\/northern-trust-and-standard-chartereds-zodia-to-provide-crypto-custody-to-new-invesco-bitcoin-etp\/\" data-v-f87c67ca=\"\">a new bitcoin exchange-traded product<\/a> launched by Invesco In November.","Zodia has garnered attention because of the potential scale it could bring to crypto markets. Chicago-based Northern Trust held $12.6 trillion in assets under custody as of December 2021, according to its website. Standard Chartered, a London-based investment bank, operates in 59 countries and employs some 85,000 people.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Standard Chartered and Northern Trust","content":"ORGANIZATION"},{"type":"UK's Financial Conduct Authority","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Maxime de Guillebon","content":"PERSON"},{"type":"Zodia","content":"ORGANIZATION"},{"type":"$12.6 trillion","content":"MONEY"},{"type":"November","content":"DATE"},{"type":"December 2020","content":"DATE"},{"type":"December 2021","content":"DATE"},{"type":"Northern Trust","content":"ORGANIZATION"},{"type":"London","content":"LOCATION"},{"type":"Invesco","content":"ORGANIZATION"},{"type":"Guillebon","content":"PERSON"},{"type":"Chicago","content":"LOCATION"},{"type":"April","content":"DATE"},{"type":"July 2021","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Standard Chartered","content":"ORGANIZATION"}],"hashtag":["STAKING"],"authors":["Ryan Weeks","The Block"]}