{"summary":"&quot;Institutions want to do business with other institutions.&quot; That&#x27;s the value proposition former Goldman Sachs managing director Tom Jessop sees in","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/47563\/with-trust-license-fidelity-eyes-new-client-opportunities-and-an-expansion-of-its-crypto-trading-platform","publishDate":"2019-11-19T11:01:38","id":6193,"type":null,"title":"With trust license, Fidelity eyes new client opportunities and an expansion of its crypto trading platform","category":["BITCOIN"],"content":["\"Institutions want to do business with other institutions.\"","That's the value proposition former Goldman Sachs managing director Tom Jessop sees in Fidelity Digital Assets' cryptocurrency custody business. The unit announced Tuesday that New York regulators approved its application for a trust license to operate in the state. It's a move Jessop, who leads FDAS, says will expand its pool of potential clients, putting it head to head with other custody business already operating in New York, including Coinbase Custody and Bakkt.&nbsp;","\"For many, a non depository trust license will check the box for folks looking for a qualified custodian,\" Jessop said in a phone interview.&nbsp;","The firm has also completed a SOC1 Type 1 certification with a Big Four auditing firm.&nbsp;","Still, the competition is steep. Intercontinental Exchange's Bakkt recently <a href=\"https:\/\/www.theblockcrypto.com\/post\/46549\/bakkt-officially-dives-into-crowded-crypto-custody-market-after-nydfs-blessing\" data-v-f87c67ca=\"\">received<\/a> the greenlight from New York to operate its own institutional cryptocurrency business, offering zero fees to its first round of clients, which included Pantera Capital, Galaxy Digital, and Tagomi. Indeed, Bakkt and Fidelity appear to be going after the same clientele. They will both act as custodians for Galaxy Digital's recently launched bitcoin funds. In addition, both are targeting traditional asset managers and crypto-native hedge funds.&nbsp;","\"We've had more inquiries that are the pension and endowment type,\" Jessop said, referring to institutional interest in Fidelity's product. Still, he estimates the breakdown of clients will be somewhere in the ballpark of 70-30, with the majority being crypto-native entities.&nbsp;","<strong data-v-f87c67ca=\"\">Differentiator <\/strong>","Still, Fidelity offers unique capabilities relative to its rivals in the crypto custody market. Its custody solution is paired with a trade execution platform, which allows its clients to buy and sell bitcoin across a number of liquidity sources.&nbsp;","The platform, which has been up and running for 6 months, provides a front-end clients can execute a trade at a competitive rate. It's a service that's similar to broker-dealer Tagomi. Fidelity brings custody and execution under one house.&nbsp;","Jessop said the firm would continue to add new sources of liquidity to its platform.","As for Jessop's thoughts on the one-year-old's business' progress so far, he said: \"We've exceeded expectations.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tom Jessop","content":"PERSON"},{"type":"Intercontinental Exchange","content":"ORGANIZATION"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Tagomi","content":"ORGANIZATION"},{"type":"Bakkt","content":"PERSON"},{"type":"30","content":"DATE"},{"type":"Jessop","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Fidelity Digital Assets","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}