{"summary":"Coinbase and The Block Research collaborated on a report, which highlights research on the three main trends that can positively affect the existing payments industry.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276339\/the-state-of-crypto-fairer-cheaper-faster-everyday-finance-in-partnership-with-coinbase","publishDate":"2024-02-07T08:03:51","id":62,"type":null,"title":"The State of Crypto: Fairer, Cheaper, Faster Everyday Finance — in partnership with Coinbase","category":["THE BLOCK"],"content":["\"<a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2024\/02\/Q4_2023_State_of_Crypto_-FINAL_2.5.24-.pdf\" data-v-f87c67ca=\"\">The State of Crypto: Fairer, Cheaper, Faster Everyday Financ<\/a><a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2024\/02\/Q4_2023_State_of_Crypto_-FINAL_2.5.24-.pdf\" data-v-f87c67ca=\"\">e<\/a>,\" a report written in collaboration between The Block Research and Coinbase, highlights three major themes that crypto offers to the traditional payments world: cheaper, faster, and more accessible.","The findings of the report underscore a public desire for innovation, with 71% of consumers advocating for cheaper transactions, 70% for speedier processes, and 63% for improved access. The current system's fees, long transaction times, and restricted accessibility are particularly pronounced for underbanked demographics and small businesses, creating a barrier to financial mobility and growth.","Blockchain networks, however, demonstrate a stark contrast, processing payments up to 5,000 times cheaper and 432,000 times faster than conventional methods. For instance, while wire payments can incur fees up to $50, some blockchain networks optimize fees to less than $0.01. Furthermore, DeFi loan processing outpaces traditional banking by 144 times, democratizing access to financial services.","The sentiment for change is largest among younger generations, with a substantial majority of Gen Z and Millennials poised to embrace a reformed financial framework that emphasizes cost-effectiveness, rapidity, and straightforward access.","In summary, the State of Crypto report paints a compelling picture of the tangible benefits blockchain &amp; crypto offer, proposing a future where financial transactions are not only cheaper and faster but also enable the potential for global accessibility.","In addition to the aforementioned insights, The Block Research has compiled a supplementary report that delves deeper into the transformative impact of crypto payments, which may be <a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2024\/02\/Final_V2_The_Block__Coinbase_Payments.pdf\" data-v-f87c67ca=\"\">read here<\/a>.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$0.01","content":"MONEY"},{"type":"70%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"$50","content":"MONEY"},{"type":"the State of Crypto","content":"ORGANIZATION"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"The State of Crypto","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"71%","content":"PERCENT"},{"type":"63%","content":"PERCENT"}],"hashtag":[],"authors":["The Block Research","The Block"]}