{"summary":"HSBC’s Metaverse Discretionary Strategy portfolio is designed specifically for high and ultra-high net worth professional investors and accredited investor clients.\nThe announcement follows investments in blockchain technology firm ConsenSys and virtual real estate over the past few months.","author":["Callan Quinn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/140842\/hsbc-launches-metaverse-fund-for-wealthy-clients-in-hong-kong-and-singapore","publishDate":"2022-04-06T08:14:45","id":620,"type":null,"title":"HSBC launches metaverse fund for wealthy clients in Hong Kong and Singapore","category":["Asia"],"content":["<span data-v-f87c67ca=\"\">HSBC Holdings has launched a fund focused on investment opportunities in the metaverse for wealthy clients in Singapore and Hong Kong.<\/span>","<span data-v-f87c67ca=\"\">According to a statement seen by <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-04-06\/hsbc-launches-portfolio-on-metaverse-for-rich-asian-clients\" data-v-f87c67ca=\"\">Bloomberg<\/a>, the Metaverse Discretionary Strategy portfolio will focus on five key areas of the metaverse: infrastructure, computing, virtualization, experience and discovery, and interface.<\/span>","<span data-v-f87c67ca=\"\">\"The metaverse ecosystem, while still at its early stage, is rapidly evolving,\" Lina Lim, regional head of discretionary and funds for investments and wealth solutions, Asia Pacific, at HSBC, said in the statement, according to <a href=\"https:\/\/www.reuters.com\/article\/hsbc-metaverse-idCNL2N2W40EA\" data-v-f87c67ca=\"\">Reuters<\/a>.<\/span>","<span data-v-f87c67ca=\"\">\"We see many exciting opportunities in this space as companies of different backgrounds and sizes are flocking into the ecosystem,\" she added.<\/span>","<span data-v-f87c67ca=\"\">The portfolio is designed specifically for high and ultra-high net worth professional investors and accredited investor clients. It will be managed by HSBC Asset Management and “aims to capture the [metaverse] growth opportunities globally over the next decade.”<\/span>","<span data-v-f87c67ca=\"\">Audit, consulting and tax services firm PricewaterhouseCoopers estimated last year that the value of the global metaverse market would increase from $45.4 billion in 2019 to $1.5 trillion by 2030.<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, a report from investment banking company Citigroup last Thursday increased that figure to $8-13 trillion by 2030.<\/span>","<span data-v-f87c67ca=\"\">HSBC appears considerably warmer towards metaverse investment than it is towards cryptocurrencies.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">It has always been fairly skeptical of crypto in general. In May 2021, HSBC CEO Noel Quinn <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/105844\/hsbc-no-plans-crypto-trading-desk-ceo-comments\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">stated<\/span><\/a><span data-v-f87c67ca=\"\"> the bank had no plans to launch a crypto trading desk or invest in cryptocurrencies on behalf of clients due to concerns about volatility and transparency. His comments were made during a market rout attributed to Chinese government comments about <\/span><span data-v-f87c67ca=\"\">\"cracking down on bitcoin mining and trading activities.\"<\/span>","<span data-v-f87c67ca=\"\">That said, in November last year, HSBC backed a $200 million funding round for blockchain technology firm ConsenSys, suggesting it may be changing its tune somewhat.<\/span>","<span data-v-f87c67ca=\"\">As for the metaverse, the bank is much more openly positive. Suresh Balaji, HSBC’s chief marketing officer for the Asia-Pacific region, said that the metaverse “is how individuals will experience web3, the next generation of the internet.”<\/span>","<span data-v-f87c67ca=\"\">It has been putting its money where its mouth is too. On March 16, the bank announced the <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/138003\/banking-giant-hsbc-partners-with-metaverse-firm-the-sandbox\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">purchase of virtual real estate<\/span><\/a><span data-v-f87c67ca=\"\"> in the Sandbox Metaverse, a subsidiary of venture capital company Animoca Brands.<\/span>","<span data-v-f87c67ca=\"\">&nbsp;<\/span><span data-v-f87c67ca=\"\">JP Morgan, however, was the first large bank to enter the metaverse when it <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/134311\/jpmorgan-stakes-a-claim-in-the-metaverse-with-decentraland-lounge\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">opened a lounge<\/span><\/a><span data-v-f87c67ca=\"\"> in Decentraland in February.<\/span>"],"hashtag":[]}