{"summary":"Blockchain Terminal, the ICO project aiming to build a crypto twist on the Bloomberg Terminal, was led by a man named Shaun MacDonald, according to several interviews The Block conducted over the last two months. Shaun MacDonald in 2012 was sentenced to prison for running a fraudulent $800 million hedge fund.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/4553\/two-identities-one-man-the-story-of-800-million-hedge-fund-fraudster-boaz-manor-who-led-the-alleged-31-million-blockchain-terminal-ico","publishDate":"2018-12-10T17:24:06","id":6200,"type":null,"title":"The story of $800 million hedge fund fraudster, led the Blockchain Terminal ICO","category":["HACKS"],"content":["BCT looked good on paper.&nbsp;","It had an all-star team, a product that promised to give Bloomberg a run for its money - the aptly-named Blockchain Terminal, and funding to run a massive ICO campaign. The founder, a mysteriously well-capitalized investor, was zealously dedicated and he had gathered a community of investors that were champing at the bit to grab a piece of future riches.","It was the perfect product for the next generation of traders. Geeky enough for gearheads and familiar enough for Wall Streeters, the BCT was supposed to bridge the gap between enthusiasts on an exchange and hard-charging professionals. And it almost did.","Still, many ex-employees said, BCT was a scam and that founding investor, a bearded Canadian with a quiet demeanor, was not who he claimed to be. In fact, they said, he was a known financial criminal. Those employees requested to speak anonymously, citing fear of reputation risk and physical danger.","Riding the initial coin offering wave, which took financial markets and media by storm at the end of 2017, this founder convinced large investors in Asia and Australia to pour millions into a token sale aimed at building out their terminal device. The firm shipped out dozens of the terminals to well-known crypto hedge funds. But the product itself, like the company, was a facade, according to former employees and investors.","At the heart of the venture is a man once jailed for running one of the most notable financial frauds in Canadian history: Boaz Manor. Working under the pseudonym Shaun MacDonald, Manor tricked BCT employees, investors, and potential customers and, in the process, created the definitive grift of this nascent crypto tech bubble.","Shaun MacDonald is a ghost. Searching for him online brings up a few random sightings including a <a href=\"https:\/\/angel.co\/shaun-macdonald\" data-v-f87c67ca=\"\">truncated AngelList profile<\/a> and countless links to footballer Shaun MacDonald of Wigan Athletic. Even ZoomInfo, a site that acts as a modern White Pages, <a href=\"https:\/\/www.zoominfo.com\/p\/Shaun-Macdonald\/-1351174821\" data-v-f87c67ca=\"\">brings up a MacDonald<\/a> in Newport Beach, California who works at Estey-Hoover.","Insiders noticed MacDonald’s presence on the New York blockchain scene at the end of 2016. Prior to diving into Blockchain Terminal, he was looking to buy Anthony Scaramucci’s SkyBridge Capital, according to a hedge fund manager who was briefed on the deal. He was tall with dark hair and a full beard, a face that looked a little worse for wear, and he was a few pounds overweight. He had money - lots of money - and after dumping the Scaramucci deal, he decided he wanted to build a terminal to give traders an edge in crypto transactions. He based the product on the ubiquitous Bloomberg Terminal, a tool that made former New York Mayor Mike Bloomberg a billionaire by serving just-in-time data to Wall Streeters using an arcane system that was a cross between a Telnet session and a video game.","And everything ran like a normal startup. They acquired a dev team and made videos. The advisory board bloated to the point of inoperability. High-profile hires studded the staff page like jewels in a crypto crown.","BCT made a major splash in the tech scene thanks to a PR team at <a href=\"https:\/\/www.createaripple.co\" data-v-f87c67ca=\"\">CreateARipple<\/a> that built the BCT website and began outreach to major tech blogs - although the <a href=\"https:\/\/techcrunch.com\/2018\/04\/11\/icos-like-to-move-fast-and-break-lots-of-things\/\" data-v-f87c67ca=\"\">coverage wasn’t always positive.<\/a>","\"It looked like a company.&nbsp;They actually did hire sales people and developers — the actually people to execute,\" one former employee said.","\"In the beginning we just thought [Shaun] was an overzealous investor,\" another former employee said. \"We didn't think he had any power.\"","Blockchain Terminal and CG Blockchain had all the fixings of a bonafide tech startup with world class offices, a president with an impressive Wall Street pedigree, and a <a href=\"https:\/\/techcrunch.com\/video\/the-bct-terminal-brings-crypto-to-wall-street\/\" data-v-f87c67ca=\"\">sleek and sexy product<\/a>.","But something seemed off to many employees of the firm.","“No one was aware of his true identity and no one knew his past,” said one former employee of Blockchain Terminal. \"Whenever people got close to the truth, Shaun would push them out.\"","","","In recent months, Blockchain Terminal employees discovered MacDonald was actually Boaz Manor, a disgraced asset manager from Canada. Boaz - Bo to his friends - was a financial golden boy, a strong-jawed financial titan who ran Portus Alternative Asset Management, a firm that managed $800 million at its height.","As reported by The Star, Portus misappropriated about $106 million and $8.8 million was sent to companies in Hong Kong to purchase diamonds. Those diamonds were picked up by Manor’s sister, according to court documents. Those diamonds are also now missing.","Quebec banned Manor from the securities industry and he was&nbsp;<a href=\"https:\/\/www.theglobeandmail.com\/report-on-business\/portus-partner-gets-2-years-for-fraud\/article18149613\/\" data-v-f87c67ca=\"\">sentenced to four years in prison for his transgressions<\/a>. Specifically, he pleaded guilty to one count of money laundering and one count of disobeying a court order. Chastened, he disappeared from public view and many thought he was gone.","But he wasn’t gone. He was just someone else.","Manor operated Blockchain Terminal in full disguise, concealing his name and any potential links to his past that would reveal his tarnished financial reputation. He also grew a beard and dyed his hair red. Although he wasn’t named the company’s president, Manor was secretly running the show according to several people familiar with the situation, making “all final decisions.”","“As soon as I saw that picture of Boaz I just about shit my pants,” said one hedge fund manager. MacDonald was Boaz.","“Under U.S. securities laws, the CEO of a company raising funds from the public has an obligation to provide investors true and accurate information. Changing your name, hiding the fact that you were banned from the securities industry in Canada and that you are a convicted criminal who spent up to four years in jail would qualify as material misrepresentations and as actionable conduct under U.S. law,” said crypto litigator David Silver.","“I googled Boaz Manor and I said ‘Holy shit.’ Not for a second did I think it was anyone but him,” a hedge fund manager who beta-tested the terminal product said.","While Boaz kept an underhand grip of the reigns, the person who appeared to be in charge was Bob Bonomo. The former chief information officer at $500 billion asset-manager AllianceBernstein, Bonomo joined BCT in late 2017.","According to numerous documents reviewed by The Block, Bonomo ran Blockchain Terminal as president of CG Blockchain, an affiliated company. He has since scrubbed any mention of Blockchain Terminal from his LinkedIn profile. In an interview with the Financial Post, following the publication of this report, Bonomo confirmed some of The Block's finding: \"The President title was in name only…. I had no exposure to, and no decision-making authority for, the management of any of the company’s finances, internal operations or personnel.\" &nbsp;","<iframe src=\"https:\/\/www.youtube.com\/embed\/qwVXYnru_F8\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" data-v-f87c67ca=\"\"><\/iframe>","While former employees working on Blockchain Terminal told The Block that the main objective of the product was often in flux internally, externally it was marketed as a institutional-grade tool that could lure in traditional Wall Street into the volatile crypto market.","\"We believe a convergence will occur over the next few years whereby the new digital currency asset class will be seamlessly integrated into traditional asset class processes, systems, and portfolios,\" Bonomo said in a video published March 2018. The $999 terminal included a 32-inch \"HD Terminal\" along with a wireless mouse and keyboard, and hardware private key.","The firm targeted crypto hedge funds with the product. It didn’t go well.","\"They sent us the terminal to test for free and they forgot to install it and it just hung out for three months before we forced them to come pick it up,\" one hedge fund manager, who declined to speak on the record, said of the terminal product.","\"They sent us a terminal and said they would get in touch with us about setting it up. That took six months,\" another fund manager said. An attachment in an email sent by adviser Christian Ferri to a hedge fund manager in March show that 20 crypto hedge funds were beta testing the product, including Dichotomy Capital, Three Bridges Capital, and Zega Financial. Ferri told The Block: \"I was shocked to learn about the deception perpetrated by Shaun MacDonald. I applaud the work of investigative journalists and hope that any bad actors in the cryptocurrency space take note that they will not be allowed to operate in the dark with impunity. I have been and continue to be a strong and consistent voice for full transparency in the cryptocurrency space so that the many great advancements and innovations can be brought to the public.\"","The aforementioned hedge funds didn't respond to a request for comment prior to publication. However, Three Bridges Capital later told The Block the firm \"<b data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">was not<\/i><\/b> a beta tester\" of the platform (emphasis is their own).","Still, in an interview with the Financial Post, Edith Pardo (more on her later) defended the firm's product's functionality, saying: \"BCT is a viable, operational company with a legitimate, viable product.\" Pardo, acting as a lawyer for BCT and CG, emailed The Block contractor Larry Cermak <a href=\"https:\/\/www.slideshare.net\/mdudas\/blockchain-terminal-summons-and-complaint\" data-v-f87c67ca=\"\">a lawsuit purporting to seek $40 million dollars in unspecified damages<\/a> after this story was originally published. &nbsp;","The team behind the terminal included \"PhDs and quants\" according to marketing materials. They included Founder Adnan Ali, VP of Government Policy Daniel Araya, COO Alexander Bogicevic, Ed Sappin, CFO, and CTO Andrew Pankov. <a href=\"https:\/\/www.linkedin.com\/in\/ozsultan\/\" data-v-f87c67ca=\"\">Former Economist dev and startup connector Oz Sultan<\/a> joined in 2017 as an advisor and left the company in September.","In addition, public relations specialist Edith Pardo worked alongside Manor and the Blockchain Terminal executive team. Pardo, an executive at Newport California-based public relations firm Estey-Hoover - the same firm that seemingly hired Shaun MacDonald - signed a Form D notice of exempt offering of securities with the Securities and Exchange Commission. The full extent of Estey-Hoover's relationship with Blockchain Terminal, or affiliated CG Blockchain, is not clear. Still, it is clear that the Pardo worked closely with Manor - Pardo is even friends with Manor on Facebook - and other executives at Blockchain Terminal used Estey-Hoover email addresses and they were paid by Estey-Hoover, according to documents reviewed by The Block and numerous people familiar with the situation.","\"Edith Pardo looked like she was working for Shaun,\" one employee said. Pardo did not respond to calls seeking comment. In an interview with the Financial Post Pardo said Manor was just an consultant for Blockchain Terminal.&nbsp;","CG Blockchain also announced partnership with Factset, the billion dollar financial data provider, to allow clients of the firm to access CG Blockchain crypto products, the firm announced in February. And that was not the only thing that added to Blockchain Terminal's legitimacy. Polished, well-spoken, former Wall Streeters also promoted the terminal in YouTube videos uploaded by the company.","\"For crypto traders it makes it easier to trade because you've got all the information right in front of you in one place. You've got the chat rooms, the social media news flows, and all the specific websites like CoinDesk, and all those types of flows,” said <a href=\"https:\/\/www.linkedin.com\/in\/michael-caponiti-5171285\/\" data-v-f87c67ca=\"\">Michael Caponiti<\/a> of Archimedes Fund Management while <a href=\"https:\/\/www.linkedin.com\/in\/joel-emery-2b33429\/\" data-v-f87c67ca=\"\">Joel Emery<\/a> of Tareo Capital found the team to be stellar.","<iframe src=\"https:\/\/www.youtube.com\/embed\/eCbXbaSKy1g\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" data-v-f87c67ca=\"\"><\/iframe>","\"My involvement with BCT was really my focus on compliance. And their focus as a company as a team, from a technology standpoint, on compliance is what really drew me from the technology originally. I think this is going to be very powerful,” he said in a video. Emery did not respond to a request for comment and is now advising another blockchain terminal called Lion.","The <a href=\"https:\/\/t.me\/blockchainterminal\" data-v-f87c67ca=\"\">Blockchain Terminal Telegram room<\/a> was a lively place full of boosters and populated by a team of social media managers who reacted to nearly every question. The Reddit community, found at <a href=\"https:\/\/www.reddit.com\/r\/blockchainterminal\/\" data-v-f87c67ca=\"\">\/r\/blockchainterminal<\/a>, was lively and excited about the prospect of a true trading tool for professional investors.","Both of those communications hubs are considerably diminished.","Further, despite questions surrounding its functionality, cryptocurrency media personalities raved about the product. Jon Rice — a managing editor at Crypto Briefing — wrote that \"The Blockchain Terminal represents a quantum leap in crypto trading\" in an article that <a href=\"https:\/\/cryptobriefing.com\/blockchain-terminal-revolutionizes-crypto-trading\/\" data-v-f87c67ca=\"\">appears to have been scrubbed from Crypto Briefing's site<\/a>. Ran NeuNer, host of CNBC South Africa's CryptoTrader show, wrote in a tweet dated June 15: \"I went to Blockchain Terminal today and had a demo of the system. It's really advanced and has many tools. It also has a market depth tool across all exchanges. If you are a serious trader that trades for a fund or a large portfolio tweet me and we may send you a screen.\"","https:\/\/twitter.com\/cryptomanran\/status\/1007705256652886017","NeuNer claimed to be an investor in the firm's initial coin offering. Two people familiar with the situation said he invested $1.3 million. NeuNer did not respond to a message seeking comment for this story. NeuNer at one point did list Blockchain Terminal on his investment <a href=\"http:\/\/cryptomanran.com\/investment-disclosure\/\" data-v-f87c67ca=\"\">disclosure page, but that disclosure has since been scrubbed.<\/a>&nbsp;NeuNer has said he only invested $350,000 into the project.&nbsp;","Like all good blockchain companies, BCT needed a token.","The BCT token that powered the Blockchain Terminal was to serve as a key that unlocked enhanced features and tools on the platform, according to a white paper dated April 27.","\"The BCT Token will provide access to all the features and tools of the Blockchain Terminal, and enhance the convenience of Blockchain Terminal devices,\" the paper said. \"With the BCT Token, users can access applications and tools offered on the Blockchain Terminal Fundstore,\" the team wrote. As per documents reviewed by The Block, the token sale began in September 2017.","According to the documents, the company offered 510 million tokens in the token offering.","\"They weren't selling the terminal,\" one U.S. hedge fund manager said. \"They offered them up for free.\"","The main point, he said, was to get the hedge fund managers to buy up the tokens which would increase the value for the original token holders.","\"’BCT will become the reserve currency for traders - just like BTC is the reserve currency’ - that was their exact marketing line,\" the trader said.","It is still possible to purchase tokens on BCT's website in various packages. In BCT's Telegram group, administrators described the token as a utility token. Still, it's not clear if that means the firm would have been required to subscribe to U.S. securities law.&nbsp;","As part of the token sale effort's the firm brought on a slew of world-class advisers, according to a person familiar with the situation. At the time of the firm's token sale, BCT's advisers included Todd Ruppert, former president and CEO of T. Rowe Price Global Investment Services, Scott Walker, CEO of DNA, an investor and consultancy in the crypto market, and James Duplessie, former Citigroup portfolio manager who is now an investor in blockchain technology at Pangea Investments. A <a href=\"https:\/\/icobench.com\/ico\/blockchain-terminal\/team\" data-v-f87c67ca=\"\">full list of the advisors exists here<\/a>.","","","\"In March and April the idea was for them to raise money. And then when the sale ended in April they were supposed to get proper titles. Legal found loopholes to extend the sale privately, which happened. And they continued to sell their tokens into August,\" one ex-employee said.","As money rolled in the ICO buyers grew more and more excited, the possibility of buying into something as exciting as the next Bloomberg terminal was palpable and the team - veterans all - promised to be able to deliver on that dream. But things took a sharp turn after Bonomo left the firm over the Summer. In the weeks after he quietly resigned, Manor revealed to his employees his true identity and the company stopped paying its employees. It’s not clear exactly where Manor is, but the project continues under a new leader and under a new company name, BCT Inc. At the end of October, BCT Inc announced the Blockchain Terminal would go on sale for the first time to the public.","“Developing an integrated blockchain platform for institutional presented significant technical hurdles,” BCT CEO Josh Dettman, wrote. “However, I feel strong pride in being part of a team with the vision and the perseverance to conquer those challenges.”&nbsp;","As for Boaz\/MacDonald, had BCT supporters seen his yearbook quote - \"Into the future I see an array of precious jems, diamonds, and rubies glowing with effervescent light ... and a guy named Louie yelling 'Put the jems in the yellow bag, the diamonds in the green bag, and get a move on it before we get busted!\" - they may have had a solid predictor of future behavior. Most didn't.","","","<em data-v-f87c67ca=\"\">With assistance from Larry Cermak and Isabel Woodford.&nbsp;<\/em>","<strong data-v-f87c67ca=\"\">This article has been updated from its original form to include quotes from Edith Pardo and Bob Bonomo published by a source following this report's publication. It was also updated to note that Ran NeuNer claims he only invested $350,000 into the project.&nbsp;It has also been updated to note that Pardo emailed a lawsuit to The Block contractor Larry Cermak.&nbsp;<\/strong>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Shaun]","content":"PERSON"},{"type":"Canada","content":"LOCATION"},{"type":"VP of Government","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Boaz","content":"PERSON"},{"type":"South Africa","content":"LOCATION"},{"type":"Manor","content":"ORGANIZATION"},{"type":"Todd Ruppert","content":"PERSON"},{"type":"Hoover","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"MacDonald","content":"ORGANIZATION"},{"type":"Michael Caponiti","content":"PERSON"},{"type":"March 2018","content":"DATE"},{"type":"T. Rowe Price Global Investment Services","content":"ORGANIZATION"},{"type":"Mike Bloomberg","content":"PERSON"},{"type":"Blockchain Terminal Telegram","content":"ORGANIZATION"},{"type":"Adnan Ali","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Pardo","content":"PERSON"},{"type":"Shaun","content":"PERSON"},{"type":"Boaz\/MacDonald","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Tareo Capital","content":"ORGANIZATION"},{"type":"California","content":"LOCATION"},{"type":"MacDonald","content":"PERSON"},{"type":"BCT","content":"ORGANIZATION"},{"type":"Edith Pardo","content":"PERSON"},{"type":"June 15","content":"DATE"},{"type":"BCT Token","content":"ORGANIZATION"},{"type":"Bloomberg Terminal","content":"ORGANIZATION"},{"type":"2016","content":"DATE"},{"type":"Reddit","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Pangea Investments","content":"ORGANIZATION"},{"type":"$8.8 million","content":"MONEY"},{"type":"Wigan Athletic","content":"ORGANIZATION"},{"type":"Blockchain Terminal","content":"ORGANIZATION"},{"type":"BCT Inc","content":"ORGANIZATION"},{"type":"Asia","content":"LOCATION"},{"type":"Financial Post","content":"ORGANIZATION"},{"type":"Financial Post Pardo","content":"ORGANIZATION"},{"type":"Bonomo","content":"PERSON"},{"type":"April 27","content":"DATE"},{"type":"James Duplessie","content":"PERSON"},{"type":"$999","content":"MONEY"},{"type":"Louie","content":"PERSON"},{"type":"SkyBridge Capital","content":"ORGANIZATION"},{"type":"Boaz Manor","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"Citigroup","content":"ORGANIZATION"},{"type":"CG Blockchain","content":"ORGANIZATION"},{"type":"Three Bridges Capital","content":"ORGANIZATION"},{"type":"Manor","content":"PERSON"},{"type":"Alexander Bogicevic","content":"PERSON"},{"type":"Larry Cermak","content":"PERSON"},{"type":"NeuNer","content":"PERSON"},{"type":"Andrew Pankov","content":"PERSON"},{"type":"ICO","content":"ORGANIZATION"},{"type":"Shaun MacDonald","content":"PERSON"},{"type":"Christian Ferri","content":"PERSON"},{"type":"Factset","content":"ORGANIZATION"},{"type":"Summer","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Joel Emery","content":"PERSON"},{"type":"$1.3 million","content":"MONEY"},{"type":"Daniel Araya","content":"PERSON"},{"type":"Zega Financial","content":"ORGANIZATION"},{"type":"Newport California","content":"LOCATION"},{"type":"Estey","content":"ORGANIZATION"},{"type":"Ferri","content":"PERSON"},{"type":"$106 million","content":"MONEY"},{"type":"Ed Sappin","content":"PERSON"},{"type":"$500 billion","content":"MONEY"},{"type":"$350,000","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"September 2017","content":"DATE"},{"type":"August","content":"DATE"},{"type":"Blockchain","content":"ORGANIZATION"},{"type":"Isabel Woodford","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"AllianceBernstein","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Scaramucci","content":"PERSON"},{"type":"Dichotomy Capital","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Anthony Scaramucci","content":"PERSON"},{"type":"Portus Alternative Asset Management","content":"ORGANIZATION"},{"type":"Australia","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"Josh Dettman","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Crypto Briefing","content":"ORGANIZATION"},{"type":"Bob Bonomo","content":"PERSON"},{"type":"Scott Walker","content":"PERSON"},{"type":"Newport Beach","content":"LOCATION"},{"type":"$40 million dollars","content":"MONEY"},{"type":"Jon Rice","content":"PERSON"},{"type":"Estey","content":"PERSON"},{"type":"$800 million","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"David Silver","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}