{"summary":"Congo&#x27;s Virunga National Park was in desperate need of money to stay afloat. A hydro-powered bitcoin mine was the answer, helping it to fund jobs, conservation and infrastructure.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/202302\/congo-national-parks-bitcoin-mining-bet-saved-it-from-going-bust-mit-tech-review","publishDate":"2023-01-13T16:41:18","id":6207,"type":null,"title":"Congo national park’s bitcoin mining bet saved it from going bust: MIT Tech Review","category":["CRYPTO INFRASTRUCTURE"],"content":["<span data-v-f87c67ca=\"\">Nestled on the eastern edge of the Congo basin, the Virunga National Park is the second-largest tropical rainforest in the world, home to half of Africa's terrestrial animals and a third of the last mountain gorillas.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nPlagued by a dramatic fall in tourism following kidnappings, Ebola and then COVID-19, work to preserve its conservation efforts turned to an unlikely bedfellow — bitcoin mining.<\/span>","<span data-v-f87c67ca=\"\">As park director Emmanuel de Merode explained in a report from <\/span><a href=\"https:\/\/www.technologyreview.com\/2023\/01\/13\/1066820\/cryptocurrency-bitcoin-mining-congo-virunga-national-park\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">MIT Technology Review<\/span><\/a><span data-v-f87c67ca=\"\">, park revenue fell 40% following the collapse of tourism. With the Congolese government contributing only around 1% of the budget it needed, the park was in desperate need of money.<\/span>","<span data-v-f87c67ca=\"\">\"It's not something we expected, but we had to work out a solution. Otherwise, we would have gone bust as a national park,\" de Merode said.<\/span>","<span data-v-f87c67ca=\"\">That's where bitcoin mining came in. De Merode and his park colleagues decided to leverage Virunga's river-run hydro plant to power $200,000 worth of bitcoin mining rigs. The plant was already built, with plans to increase the energy network gradually, but all that had come to a halt.<\/span>","<span data-v-f87c67ca=\"\">By embarking on a bitcoin mining project, de Merode’s team hoped to earn some profits to compensate for the shortfall in revenue while providing a viable way to utilize its hydropower resources to benefit the park and its local population.<\/span>","<span data-v-f87c67ca=\"\">The mining rigs set up camp in Luviro, a hamlet just outside Virunga, with the help of crypto investor Sébastien Gouspillou. His company, Big Block Green Services, also advised <\/span><a href=\"https:\/\/www.theblock.co\/post\/201275\/el-salvador-one-step-closer-to-bitcoin-bonds-after-law-passage\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">El Salvador<\/span><\/a><span data-v-f87c67ca=\"\"> on its Bitcoin City and another hydro-powered bitcoin mining project in the <\/span><a href=\"https:\/\/www.theblock.co\/post\/196508\/central-african-republic-delays-listing-sango-coin-2023\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Central African Republic<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">Virunga started mining in September 2020, becoming the world's first known national park-operated bitcoin mine, just as the bitcoin bull market was taking off. \"We were lucky — for once,\" de Merode said.<\/span>","<span data-v-f87c67ca=\"\">Fast-forward to today, and 10 chrome green containers, each 40 feet long and holding 250 to 500 machines, are directly powered by the hydro plant's four-meter turbines. They grind the days away in pursuit of bitcoin rewards while helping secure over $370 billion of network value.<\/span>","<span data-v-f87c67ca=\"\">Virunga's gorillas are an endangered species, but the park also cashed in on rare apes of a digital kind, teaming up with NFT project CyberKongz to auction off gorilla NFTs at Christie's. Some of the $1.2 million raised paid for two of the three containers owned by Virunga.<\/span>","<span data-v-f87c67ca=\"\">The remaining seven containers are owned by Gouspillou, paying Virunga for the power used, but retaining the mining rewards for his investors.<\/span>","<span data-v-f87c67ca=\"\">Virunga's bitcoin mining proceeds are already helping the park's conservation efforts, and funding jobs and infrastructure projects, including roads and water pumping stations.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">That's proved to be popular for many working in and around the park. Still, not everyone is convinced of Bitcoin’s conservation credentials. In fact, its detractors often criticize it for the opposite — mainly due to the amount of energy required to run mining operations, with the electricity usually generated from fossil fuels. The director-general of the European Central Bank even called it an \"unprecedented polluter.\"<\/span>","<span data-v-f87c67ca=\"\">Despite the criticism, for Gouspillou, it's about the model deployed rather than bitcoin mining itself. \"People say it's bad for the environment, but here it's clean energy. It's a formula that could be replicated,\" he said.<\/span>","<span data-v-f87c67ca=\"\">Michael Saylor, the co-founder of the business intelligence firm <a href=\"https:\/\/www.theblock.co\/post\/198220\/microstrategy-sold-bitcoin-worth-11-8-million-for-tax-benefits\" data-v-f87c67ca=\"\">MicroStrategy<\/a>&nbsp;known for investments in and advocacy of bitcoin, agreed. It was \"the ideal high-tech industry to put in a nation that has plenty of clean energy but isn't able to export a product or produce a service with that energy,\" he said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Despite the market turmoil that has rocked the industry over the past year with falling prices, scandal and bankruptcies, Virunga has largely been able to weather the storm.<br data-v-f87c67ca=\"\">\n<\/span>","\"Even if bitcoin dropped to 1% of its value, the 10 containers would remain profitable,\" d<span data-v-f87c67ca=\"\">e Merode said,&nbsp;<\/span><span data-v-f87c67ca=\"\">estimating that bitcoin mining generated around $500,000 for the national park last year.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">It's \"an incredibly good investment for the park,\" he added. \"We're not speculating on its value; we're generating it. We're making bitcoin out of surplus energy and monetizing something that otherwise has no value. That's a big difference.\"&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"El Salvador","content":"LOCATION"},{"type":"September 2020","content":"DATE"},{"type":"Gouspillou","content":"LOCATION"},{"type":"Merode","content":"PERSON"},{"type":"MIT Technology Review","content":"ORGANIZATION"},{"type":"$1.2 million","content":"MONEY"},{"type":"\" de Merode","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"},{"type":"Big Block Green Services","content":"ORGANIZATION"},{"type":"Luviro","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$200,000","content":"MONEY"},{"type":"Congo","content":"LOCATION"},{"type":"European Central Bank","content":"ORGANIZATION"},{"type":"Michael Saylor","content":"PERSON"},{"type":"Virunga","content":"LOCATION"},{"type":"Emmanuel de Merode","content":"ORGANIZATION"},{"type":"Bitcoin City","content":"LOCATION"},{"type":"19","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Sébastien Gouspillou","content":"PERSON"},{"type":"$370 billion","content":"MONEY"},{"type":"$500,000","content":"MONEY"},{"type":"Christie's","content":"ORGANIZATION"},{"type":"Virunga National Park","content":"LOCATION"},{"type":"1%","content":"PERCENT"},{"type":"Africa","content":"LOCATION"},{"type":"MicroStrategy","content":"ORGANIZATION"}],"hashtag":["MICROSTRATEGY"],"authors":["James Hunt","The Block"]}