{"summary":"Several news sites have filed to unveil the creditors of collapsed crypto exchange FTX, which come in at over 100,000. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193780\/ft-bloomberg-nyt-wsj-file-ftx-creditors-public","publishDate":"2022-12-09T17:43:40","id":6209,"type":null,"title":"FT, Bloomberg, NYT and WSJ file suit to make FTX creditors public","category":["COMPANIES"],"content":["The Financial Times, The Wall Street Journal, The New York Times and Bloomberg have filed a suit seeking to unseal who the creditors of the collapsed crypto exchange FTX are. The news organizations want at least the creditors' names.","On Nov. 22, a federal judge moved to keep the FTX creditors anonymous in bankruptcy case. The lawsuit seeks to reveal the more than <a href=\"https:\/\/www.theblock.co\/post\/188642\/ftx-owes-almost-3-1-billion-to-its-top-50-creditors-filing-says\" data-v-f87c67ca=\"\">100,000 creditors<\/a>, and potentially who of the top 50 are owed <a href=\"https:\/\/www.theblock.co\/post\/188642\/ftx-owes-almost-3-1-billion-to-its-top-50-creditors-filing-says\" data-v-f87c67ca=\"\">$3.1 billion<\/a> from FTX.&nbsp;","\"The news media acts as the eyes and ears of the public, informing the public of issues of the day,\" the lawsuit states. \"This valuable social function is hampered by sealing of judicial records.\"","The news organizations argue that while the redaction of contact information for the creditors may be necessary for safety reasons, the names of these creditors poses no risk to identity theft or personal danger.","FTX filed for Chapter 11 <a href=\"https:\/\/www.theblock.co\/post\/185083\/ftx-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">bankruptcy<\/a> protection on Nov. 11, after a \"serious liquidity crisis\" spurred by its leaked balance sheet revealed the firm to be insolvent.&nbsp;","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$3.1 billion","content":"MONEY"},{"type":"Financial Times","content":"ORGANIZATION"},{"type":"Nov. 22","content":"DATE"},{"type":"Nov. 11","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FTX"],"authors":["MK Manoylov","The Block"]}