{"summary":"Zak Williams, son of the late actor Robin Williams, is working with an NFT artist to raise money for a mental health charity.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/134647\/how-robin-williamss-son-is-using-nft-art-to-raise-money-for-mental-health","publishDate":"2022-02-18T14:30:35","id":6211,"type":null,"title":"How Robin Williams’s son is using NFT art to raise money for mental health","category":["NFTS"],"content":["<span data-v-f87c67ca=\"\">Zak Williams, son of the late actor Robin Williams, met NFT artist Jesus Martinez through a mutual friend at a Shabbat dinner in Los Angeles back in November. The two instantly hit it off.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We bonded over stories about our dads. He saw his father struggle with mental health, and I see my father struggle with that. So, we related to that and our similar childhoods,” said Martinez in an interview with The Block.<\/span>","<span data-v-f87c67ca=\"\">They also bonded over NFTs. Over dinner, the two began to discuss ways they could connect mental health initiatives and NFTs to raise money. And they came up with an idea for a project.<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Williams is the founder and CEO of a company that sells chewable dietary supplements. He’s also an active investor in several companies and sits on the board of a nonprofit organization called Bring Change to Mind, which is focused on mental health-related issues. Bring Change to Mind is a 501(c)(3) organization co-founded by actress Glenn Close.<\/span>","<span data-v-f87c67ca=\"\">Martinez is an NFT artist who mentors other artists in the LA area who want to break into crypto. Last summer, a surreal, animated landscape piece he created <\/span><a href=\"https:\/\/opensea.io\/assets\/0x495f947276749ce646f68ac8c248420045cb7b5e\/79376378573356908963283008766038966734831553824174280681567936157070378663937\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">sold<\/span><\/a><span data-v-f87c67ca=\"\"> on OpenSea for $38,000 USD.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Williams and Martinez decided that they would hold an auction for one of Martinez’s pieces and that the money raised from the NFT sale would go directly to Bring Change to Mind. The NFT is going live Friday on the SuperRare marketplace for a twenty-four hour period.<\/span>","<span data-v-f87c67ca=\"\">“The money raised from the NFT sale will actually go directly to supporting communities in low-income areas and schools,” said Williams.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Charities of all kinds are <\/span><a href=\"https:\/\/www.theblockcrypto.com\/news+\/133984\/how-nfts-are-raising-money-for-charity\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">increasingly turning<\/span><\/a><span data-v-f87c67ca=\"\"> to NFTs to raise money. Many artists have also started to see them as a new way to use their art to support causes.&nbsp; For Williams, crypto art seems like a natural way to raise money and awareness.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“NFTs as a medium for me is the future of ownership. It’s the future of new decentralized economies,” he said. “It’s where young people are interacting and transacting. Why not leverage that medium to support causes relating to mental health?”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“What we're starting with the early stages of developing is a community that will be a web3 community focused on mental health,” Williams added. “And a focus on specifically the mental health of artists and creatives.”<\/span>","<span data-v-f87c67ca=\"\">The artwork is inspired by Williams’ family and, in particular, his father. The image, which features a large glowing heart against a dark background “represents the many ethnicities, identities, passions, languages, words or forms of expression we have in the world,” said Martinez.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“My dad loves hearts. He always thinks of love and light. And I wanted to fully immerse myself in Robin Williams’s world. The best way to describe him was… in every film in every way possible he always tried to spread love and that’s how the artwork came to be — from darkness grows love.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Zak Williams","content":"PERSON"},{"type":"Williams","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Williams","content":"ORGANIZATION"},{"type":"Los Angeles","content":"LOCATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Robin Williams","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Martinez","content":"PERSON"},{"type":"Glenn Close","content":"PERSON"},{"type":"$38,000","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"summer","content":"DATE"},{"type":"Jesus Martinez","content":"PERSON"}],"hashtag":[],"authors":["Anushree Dave","The Block"]}