{"summary":"The Flashbots product lead says the project open-sourcing more of its infrastructure and knowledge base to foster greater competition.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/174977\/flashbots-product-lead-addresses-concerns-over-tornado-cash-censorship","publishDate":"2022-10-05T08:23:18","id":6213,"type":null,"title":"Flashbots product lead addresses concerns over Tornado Cash censorship","category":["INFRASTRUCTURE"],"content":["Robert Miller, product lead and steward at Flashbots, has <a href=\"https:\/\/twitter.com\/bertcmiller\/status\/1577482296629739520\" data-v-f87c67ca=\"\">stated<\/a> three ways in which the project is currently working to reduce its influence in the MEV market, which could serve to make Ethereum more decentralized and censorship-resistant.","Flashbots is a service that provides suggested blocks for validators to process, ones that will give them extra rewards. It has become very dominant in the block production process since it consistently offers blocks with the highest rewards. Yet it is by default censoring all transactions related to Tornado Cash, causing <a href=\"https:\/\/www.theblock.co\/post\/174386\/flashbots-now-accounts-for-39-of-ethereum-blocks-as-censorship-concerns-rise\" data-v-f87c67ca=\"\">widespread concerns<\/a> among the Ethereum community.","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">We hear you all that having more &amp; more blocks go through our centralized pipes today is problematic,\" said Miller on Twitter. \"So, what can we do on top of what we've been doing so far?\"<\/span>","According to Miller, Flashbots is exploring ways to reduce its dominance. For one, the project recently <a href=\"https:\/\/www.theblock.co\/post\/164152\/flashbots-to-hasten-open-sourcing-of-its-mev-boost-relay-code\" data-v-f87c67ca=\"\">open-sourced its relay source code<\/a>. Now, Miller says the project will open source more of its knowledge base and infrastructure in the coming weeks.","The Flashbots steward also said that the project will submit blocks from its builders to other relays. This is to help those relays bootstrap their own adoption. In Ethereum, block producers build and propose blocks to the network that are then validated by validators. MEV relay services like Flashbots help validators extract the maximum value from these blocks.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/number-of-blocks-proposed-from-flashbots-mev-boost-relay\/embed\" title=\"Number of Blocks Proposed from Flashbots MEV-Boost Relay\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The third action plan stated by Miller is the creation of a relay monitor. Miller stated that Flasbots will issue a grant for the development of such a service. Users will be able to evaluate and monitor the performance of the available relays in the MEV market using the monitoring service.","“These 3 things should accelerate the on-going maturation of the market as more relays and builders come to market and compete for market share,” Miller stated.","In the long term, Miller said that the platform is working towards a decentralized solution. It's possible this could be free of the constraints that Flashbots faces today.","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">We believe that a decentralized block building network is existential to the mass adoption of Ethereum and other technologies building towards the same vision,\" he said.<br data-v-f87c67ca=\"\">\n<\/span>","These assurances are coming at a time when Flashbots is dominating the block building process post-Merge having become popular among validators.","At the time of The Merge, 12% of all Ethereum blocks were using Flashbots. Now, this value has gone up to <a href=\"https:\/\/transparency.flashbots.net\/\" data-v-f87c67ca=\"\">40%<\/a>, raising censorship concerns as Flashbots has been <a href=\"https:\/\/www.theblock.co\/post\/173417\/at-least-23-of-ethereum-blocks-are-complying-with-us-sanctions\" data-v-f87c67ca=\"\">censoring Tornado Cash-related transactions<\/a> after the US Treasury <a href=\"https:\/\/www.theblock.co\/post\/162105\/us-treasury-sanctions-cryptocurrency-mixer-tornado-cash\" data-v-f87c67ca=\"\">sanctioned the crypto mixer<\/a>.","Critics say Flashbot’s dominance of the MEV and block production market could threaten Ethereum’s base layer neutrality. This refers to the condition where blockchain infrastructure participants such as relays, block producers, and validators, among others do not censor transactions. This follows a similar principle to the way core infrastructure participants of the Internet like ISPs, routers, email programs, and network switches among others, are supposed to abide by the principle of net neutrality.","MEV stands for maximal extractable value. It is a special fee that block producers can charge to order transactions in a certain way that will be <a href=\"https:\/\/www.theblock.co\/post\/139155\/mev-bots-earn-476000-by-targeting-large-stablecoin-swaps\" data-v-f87c67ca=\"\">beneficial to the user<\/a>. This special fee is a premium on top of the usual network transaction fee and boosts profits for validators that run the network.","Flashbots is a service that provides MEV solutions for Flashbots. It offers a service called MEV-Boost for more transparent value extraction from blocks and has become the dominant player in the Ethereum MEV market.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"US Treasury","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"12%","content":"PERCENT"},{"type":"Robert Miller","content":"PERSON"},{"type":"Miller","content":"PERSON"},{"type":"40%","content":"PERCENT"}],"hashtag":["CENSORSHIP","ETHEREUM","MEV"],"authors":["Osato Avan-Nomayo","The Block"]}