{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley. They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/30165\/federal-judges-orders-jail-following-civil-contempt-hearing-featuring-crypto-assets","publishDate":"2019-07-04T11:10:36","id":6216,"type":null,"title":"Federal judge orders jail following civil contempt hearing featuring crypto assets","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1] Odyssey Reinsurance Co. v. Nagby, №16-cv-3038-BTM-WVG, 2019 U.S. Dist. LEXIS 108871 (S.D. Cal. June 27, 2019) [SDP]<\/strong><\/em>","If you have been following the ongoing Kleiman v. Wright case in Florida federal court you know that the court is currently considering whether Craig Wright should be held in civil or criminal contempt of court. What does this mean? Is there anything special about contempt in crypto cases? A June 27, 2019 opinion from federal court in California suggests that the basic rules remain the same: cryptocurrency and lying to a federal judge don’t go together very well, at least not if you’re interesting in staying out of jail, and judges are free to disregard or discount the testimony of witnesses they don’t believe.","This particular case arose out of a dispute involving commission payments in an insurance and reinsurance brokerage arrangement (which itself had nothing to do with cryptocurrency, btw). Plaintiffs said that defendants owed them a bunch of money and ended up getting a judgment against defendants of $3.2 million plus interest. They didn’t pay the judgment, allegedly. Long story short — this lawsuit was filed to collect that judgment under legal theories and a statute that make transferring assets to avoid collection unlawful. (I am simplifying but that is the gist).","The Court issued a number of orders requiring one of the defendants to pay certain money in her possession to the Court’s registry. She didn’t. Order to Show Cause (“OSC”) proceedings were held to show why she shouldn’t be held in civil contempt. Following those proceedings, the Court held her in contempt.","The Court began (as courts do) by explaining the rules. A U.S. federal court “has the inherent power to enforce its orders through civil contempt. [In this particular federal circuit], a finding of civil contempt is proper when a party disobeys a specific and definite court order by failure to take all reasonable steps within the party’s power to comply.” Inability to comply is a defense but “the party asserting the defense must show categorically and in detail why he is unable to comply.” Furthermore, “[a]t the contempt hearing, the propriety of the underlying order is not at issue; rather, the question for the Court is whether the alleged contemnor has the present ability to obey the Court’s order.”","Applying these rules to the facts at issue, the Court found defendants in contempt.","One of the orders at issue enjoined her from “selling, assigning, transferring, liquidating or withdrawing any funds, shares, equity interests or proceeds in relation to any … bitcoin.” Also, “the Court ordered that [she] must provide discovery, with respect to [a number of accounts] and bitcoin. Also, “[t]he Court warned that ‘[a]ny violation of this Order may be treated as a civil or criminal contempt and may subject the violator to arrest and prosecution for such contempt.’”","The Court said that defendants “failed to produce documents and evidence” regarding cryptocurrency, which violated a Court order. Also, the Court did not believe her claim that she had lost access to a $680,000 investment in Monero from the “Mega Chrome Extension Hack”:","<em data-v-f87c67ca=\"\">Ms. Dostalik produced no information or documents that she ever had an account at ShapeShift. If Ms. Dostalik’s ShapeShift account was in fact hacked, there is no evidence, other than Ms. Dostalik’s testimony. Ms. Dostalik also failed to produce any evidence that she took steps to recover her $680,000 investment, such as filing a police report or at the very minimum, contacting Shapeshift. Moreover, if Ms. Dostalik did lose account information as a result of a hack that she reported occurred in August 2018, then she must have [*28] managed to create a new or separate account for the purpose of the cryptocurrency investment that she testified occurred in September. She failed to disclose any information about a new or separate account.<\/em>","The Court said this also violated a Court Order and that willfulness isn’t an element in a contempt proceeding the defendant acted willfully, “deceitfully and with little regard or respect for Court orders.” Among other things, “ after the Court ordered Ms. Dostalik to sign a consent directive instructing Caye International Bank to comply with discovery requests, she sent Caye Bank an altered copy with the majority of the directive crossed out. (Even though the Court denied Ms. Dostalik’s motion to include “under protest” with her signature, Ms. Dostalik hand wrote this language on the altered copy. She also wrote: “Forced to sign under duress, under protest and without A jury trial, as Requested. Do Not Follow this. Court Order. I was forced to sign this against my will without a jury trial. You do not have my authorization to Release any Records or any Funds.”","The Court also largely disregarded her testimony because she demonstrated that she is “an unreliable witness” with gaps and contradictions in her testimony. Thus her self-serving testimony about not being able to comply with the Court’s order — disregarded.","So … what happens when you’re found in civil contempt? In this case, the Court gave her 14 days to pay a chunk of money and to show up in court at the end of that time to do so. If she doesn’t comply — “she shall then and there surrender to the U.S. Marshal to be confined until she purges her contempt.” In other words, jail.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part I of this week's analysis, Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"] Odyssey Reinsurance Co.","content":"ORGANIZATION"},{"type":"the Court","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"$680,000","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"Dostalik’s ShapeShift","content":"PERSON"},{"type":"SDP","content":"ORGANIZATION"},{"type":"OSC","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"},{"type":"S.D. Cal","content":"LOCATION"},{"type":"Court","content":"ORGANIZATION"},{"type":"Florida","content":"LOCATION"},{"type":"Craig Wright","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"Dostalik","content":"PERSON"},{"type":"June 27, 2019","content":"DATE"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"U.S. Dist","content":"ORGANIZATION"},{"type":"California","content":"LOCATION"},{"type":"ShapeShift","content":"ORGANIZATION"},{"type":"Palley","content":"PERSON"},{"type":"Kleiman v. Wright","content":"PERSON"},{"type":"Caye International Bank","content":"ORGANIZATION"},{"type":"$3.2 million","content":"MONEY"},{"type":"August 2018","content":"DATE"},{"type":"Caye Bank","content":"ORGANIZATION"}],"hashtag":[],"authors":["Stephen D. Palley","The Block"]}