{"summary":"UK crypto businesses are expected to take &quot;all reasonable steps&quot; to comply with the Travel Rule from September 1, the FCA said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246006\/uk-crypto-firms-travel-rule-fca","publishDate":"2023-08-17T11:26:32","id":6223,"type":null,"title":"UK firms must take &#x27;reasonable steps&#x27; to comply with crypto Travel Rule","category":["REGULATION"],"content":["The UK's financial services regulator, the Financial Conduct Authority, has set out its expectations on how crypto businesses can comply with the upcoming Travel Rule for transparency in crypto transfers from Sept. 1.","In new <a href=\"https:\/\/www.fca.org.uk\/news\/statements\/fca-sets-out-expectations-uk-cryptoasset-businesses-complying-travel-rule\" data-v-f87c67ca=\"\">guidance<\/a> published today, the FCA’s expectations include crypto businesses taking \"all reasonable steps\" to comply with the rule when sending or receiving crypto transfers to a firm in the UK or any jurisdiction that has implemented it, even when using third-party suppliers.&nbsp;","Stemming from a change in UK money laundering legislation in July 2022, the rule mandates that crypto businesses must collect, verify and share information concerning crypto transfers.&nbsp;","The Travel Rule aims to curb illicit activities by bolstering global anti-money laundering and counter-terrorist financing endeavors. The Financial Action Task Force has called on other jurisdictions to implement it swiftly to synchronize crypto transaction practices with the standards in other financial sectors.","When sending crypto transfers to jurisdictions without the Travel Rule, UK firms must also determine if the recipient firm can access the required information. If not, they must gather, validate and store the data as mandated by the Money Laundering Regulations before initiating the transfer.","When receiving crypto transfers from jurisdictions without the Travel Rule, UK firms should evaluate the transfer's data completeness and the recipient country's Travel Rule status. It should then use this information for a risk assessment before releasing received crypto assets to the beneficiary.","The FCA, in alliance with the Joint Money Laundering Steering Group and HM Treasury, has been working on additional guidance to aid firms in Travel Rule compliance. UK firms have until Aug. 25 to <a href=\"https:\/\/www.jmlsg.org.uk\/consultations\/consultation-cryptoasset-transfers\/\" data-v-f87c67ca=\"\">contribute<\/a> their input.","Alongside the Travel Rule, the FCA said the upcoming financial promotions regime in October would \"better protect people, the integrity of our markets and support the sustained competitiveness of the crypto asset sector in the UK.\"","Last month, the FCA <a href=\"https:\/\/www.theblock.co\/post\/240231\/fca-crypto-memes-breach-financial-promotion-rules\" data-v-f87c67ca=\"\">warned<\/a> crypto memes breaching these financial promotion rules potentially risk unlimited fines and up to two years imprisonment.","The tighter regulatory environment in the UK is already impacting businesses operating in the country, at least temporarily, with companies like <a href=\"https:\/\/www.coindesk.com\/business\/2023\/08\/16\/paypal-to-stop-crypto-purchases-in-uk-until-2024\/\" data-v-f87c67ca=\"\">PayPal<\/a> recently announcing they would stop crypto purchases in the UK until 2024 due to the FCA rules.","Despite tightening regulations and UK Prime Minister Rishi Sunak’s desire to provide regulatory clarity regarding how crypto businesses should register and operate in the UK, he previously <a href=\"https:\/\/www.theblock.co\/post\/234095\/a16z-uk-expansion\" data-v-f87c67ca=\"\">announced<\/a> plans in June to turn the country into a web3 hub.","\"We must embrace new innovations like web3, powered by blockchain technology, which will enable start-ups to flourish here and grow the economy,\" Sunak's office said in a statement at the time.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Aug. 25","content":"DATE"},{"type":"FCA","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Sept. 1","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"the Financial Conduct Authority","content":"ORGANIZATION"},{"type":"HM Treasury","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Rishi Sunak","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"July 2022","content":"DATE"},{"type":"Financial Action Task Force","content":"ORGANIZATION"},{"type":"ups","content":"ORGANIZATION"},{"type":"Joint Money Laundering Steering Group","content":"ORGANIZATION"}],"hashtag":["ANTI-MONEY LAUNDERING","FCA"],"authors":["James Hunt","The Block"]}