{"summary":"The New York Department of Financial Services (NYDFS) ordered stablecoin issuer Paxos to stop issuing Binance USD (BUSD).","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210932\/paxos-will-no-longer-issue-binance-usd-stablecoin","publishDate":"2023-02-13T03:43:30","id":6228,"type":null,"title":"Paxos will no longer issue Binance USD stablecoin","category":["STABLECOINS"],"content":["The New York Department of Financial Services (NYDFS) ordered crypto infrastructure firm Paxos to stop issuing the stablecoin Binance USD (BUSD), a Binance spokesperson told The Block.","\"Paxos has informed us that they have been directed to cease minting new BUSD by the New York Department of Financial Services (NYDFS),\" they said. \"BUSD is a stablecoin wholly owned and managed by Paxos. As a result, BUSD market cap will only decrease over time. Paxos will continue to service the product, manage redemptions, and will follow-up with additional information as required.\"","The Wall Street Journal first reported the news. The move comes after CoinDesk reported on Friday that the NYDFS is investigating Paxos.&nbsp;","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Paxos&nbsp;<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.prnewswire.com\/news-releases\/paxos-will-halt-minting-new-busd-tokens-301744964.html\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">announced<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;that it will cease the issuance of new BUSD stablecoins effective Feb. 21. As for BUSD redemptions, the company said it will honor them \"through at least February 2024.\"<\/span>","\"New and existing Paxos customers will be able to redeem their funds in US dollars or convert their BUSD tokens to Pax Dollar (USDP), a regulated US dollar-backed stablecoin also issued by Paxos Trust,\" the company said.","It went on to say that USDP, pax gold (PAXG) and its business remain unaffected by the NYDFS order.","The U.S. Securities and Exchange Commission is also <a href=\"https:\/\/www.theblock.co\/post\/210919\/sec-to-sue-paxos-for-listing-binance-usd-stablecoin-wsj?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">reportedly<\/a> planning to sue Paxos over BUSD, alleging that the stablecoin is an unregistered security, the WSJ reported on Sunday. The SEC sent Paxos a letter informing it of “a possible enforcement action,” per the report, citing anonymous sources. The suit is reportedly for \"violating investor protection laws.\"","BUSD is a stablecoin pegged to the U.S. dollar. It was launched in 2019 by Binance and Paxos. BUSD is the <a href=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-stablecoin-supply\" data-v-f87c67ca=\"\">third largest<\/a> stablecoin in the market with a total supply of over $16 billion.","Binance's spokesperson said \"Paxos also assured the funds are safe, and fully covered by reserves in their banks.\"","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-stablecoin-supply\/embed\" title=\"Total Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","&nbsp;","\"Given the ongoing regulatory uncertainty in certain markets, we will be reviewing other projects in those jurisdictions to ensure our users are insulated from further undue harm,\" they added.","Larry Cermak, VP of Research at The Block, said, \"BUSD is quite important for Binance in terms of revenue as well. Based on my estimation, Binance currently generated roughly $300 million a year from the revenue share alone. And that revenue is great and stable in bear markets.\"","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">Updates with Paxos’s announcement on the NYDFS order<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"Feb. 21","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"WSJ","content":"ORGANIZATION"},{"type":"VP of Research","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Paxos Trust","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$16 billion","content":"MONEY"},{"type":"February 2024","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Larry Cermak","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"$300 million","content":"MONEY"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BUSD"],"authors":["Yogita Khatri","The Block"]}