{"summary":"Mike Cagney’s Figure Technologies has secured up to $1 billion in uncommitted credit from Jefferies\nThe loan is custodied on Figure’s distributed stakeholder blockchain Provenance.io","author":["Carol Gaszcz","Ryan Todd","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/22867\/mike-cagneys-figure-secures-up-to-1-billion-line-of-credit-on-the-blockchain","publishDate":"2019-05-10T13:52:36","id":623,"type":null,"title":"Mike Cagney’s Figure secures up to $1 billion line of credit on the blockchain","category":["Layer 1s"],"content":["Figure Technologies, a fintech company that focuses on issuing home equity lines of credit (HELOCs) on its private blockchain, has secured up to $1 billion in uncommitted asset-based financing facility, the company announced in <a href=\"https:\/\/www.prnewswire.com\/news-releases\/figure-technologies-jefferies-and-wsfs-institutional-services-close-1-billion-financing-facility-on-blockchain-300846989.html\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a press release<\/a>. The line of credit comes from global investment banking firm Jefferies and financial services company WSFS Institutional Services.","The startup, founded by former SoFi CEO Mike Cagney, will be able to receive advances from Jefferies periodically, and will be able to borrow up to $1 billion to fund new loans as needed. The financing facility is custodied on Figure's distributed stakeholder blockchain Provenance.io.","\"With the financing facility now in place, Provenance.io can support the entire end-to-end financing of loans, from origination to funding to servicing to financing,\" said Cagney. \"It paves the way for the first securitization on-chain, which will demonstrate the massive cost savings, risk reduction and liquidity benefits blockchain delivers.\"","According to the press release, the three companies have been partners and have worked on structuring deal for over the past 6 months. Head of the Securitized Markets Group at Jefferies Brian McGrath said thanks to the use of Provenance, “We’ve gained full transparency into the underlying assets, real-time access to loan performance and the process of accepting collateral has less friction than off chain.”","WSFS Institutional Services, on the other hand, is a participating member of Provenance. It also serves as a trustee for Jefferies.","Earlier this year, <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/ex-sofi-ceo-mike-cagneys-new-startup-figure-gets-65-million-in-funding\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Figure secured $65 million in funding<\/a>, bringing its total equity funding to $120 million. The last funding round was co-led by M Ventures and partners at DST Global, with participation from DCG, Nimble Ventures, and Morgan Creek.","In a recent <a href=\"https:\/\/www.lendit.com\/usa\/2019\/videos\/beyond-the-hype-how-blockchain-changes-everything-usa-2019\" data-v-f87c67ca=\"\">Lendit keynote speech<\/a>, Cagney detailed Figure's expectation to unlock blockchain-driven cost synergies by reducing origination times from 40 days to just minutes, and the ability to remove auditors and trustees within securitization deals. He estimated in aggregate, the business could see a 150-200 basis point cost takeout within securitized lending.","According to <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2019-02-27\/ex-sofi-ceo-s-new-blockchain-startup-is-getting-into-banking\" data-v-f87c67ca=\"\">Bloomberg<\/a>, Figure has now provided ~1,500 home equity lines of credit in 36 states. The upstart lender is now originating more than $1.5 million per day, and expects to double that amount every few months."],"hashtag":[]}