{"summary":"DeFi protocol AlloyX has launched a real-world asset vault after a $2 million pre-seed funding round led by Hack VC.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236406\/alloyx-real-world-asset-defi-vault","publishDate":"2023-06-29T10:00:32","id":6235,"type":null,"title":"AlloyX launches real-world DeFi asset vault after $2 million pre-seed round","category":["DEALS"],"content":["DeFi protocol AlloyX launched a real-world asset vault after a $2 million pre-seed funding round led by Hack VC.","The round also included investment from Circle Ventures, Digital Currency Group, Stratos, Lecca Ventures, MH Ventures, very early Ventures, Archblock, dao5 and Credix Finance, according to a statement.","The project has partnered with the decentralized credit marketplace Credix Finance to create the vault, tapping into a private credit market on DeFi worth over <a href=\"https:\/\/app.rwa.xyz\/\" data-v-f87c67ca=\"\">$534 million<\/a> in active loans, according to the analytics dashboard rwa.xyz.","AlloyX’s vault combines overcollateralized tokenized credit (digital tokens backed by real-world assets like loans or debt instruments) from Credix Finance with a smart contract for tokenized U.S. Treasury bills.","The vault aims to open up access to real-world asset liquidity for protocols, decentralized autonomous organizations and institutional investors in the DeFi space, offering diversification beyond existing crypto-based lending and liquidity provision opportunities. Users can create customized strategies that blend tokenized U.S. Treasury bills with a range of real-world assets to balance their yield and risk appetite in the first DeFi vault of its kind, AlloyX claimed.","AlloyX CEO Alexandre Liege highlighted a need for DeFi’s composability and flexibility in real-world assets, referencing the 2022 crypto market crash.","“As we saw during the crypto market crash in 2022, investors wanted to exit positions from real-world lending pools. But it was hard to get out of these real-world loans with years left before maturity,” Liege said in the statement. “The composability and flexibility that make DeFi valuable need to be available for real-world assets as well. To achieve this, we are building products to enable our community to invest and create real-world asset diversified baskets with automatic reinvestment, similar to what Yearn Finance created for digital assets.”","“We’ve seen demand from DAOs eager to allocate capital in the real-world assets space but are looking for flexible and liquid options that would work for them,” added Credix Finance co-founder and Chief Growth Officer Chaim Finizola. “We’re excited to see the AlloyX team launch the vault to give investors exposure to private credit while benefiting from the liquidity of U.S. T-Bills.”&nbsp;","The AlloyX team says it's reached $5 million in total value locked and generated average yields of over 18% for assets held on the platform since its inception in 2021. AlloyX currently has nine integrated credit protocols, <a href=\"https:\/\/alloyx.xyz\/\" data-v-f87c67ca=\"\">according<\/a> to its website.","AlloyX’s first real-world assets vault is set to go live in early Q3, with plans to integrate with additional DeFi protocols and launch more investment vaults later this year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$534 million","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$2 million","content":"MONEY"},{"type":"Lecca Ventures","content":"ORGANIZATION"},{"type":"MH Ventures","content":"ORGANIZATION"},{"type":"Circle Ventures","content":"ORGANIZATION"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"Liege","content":"LOCATION"},{"type":"18%","content":"PERCENT"},{"type":"Stratos","content":"PERSON"},{"type":"Archblock","content":"LOCATION"},{"type":"Credix Finance","content":"ORGANIZATION"},{"type":"Yearn Finance","content":"ORGANIZATION"},{"type":"Chaim Finizola","content":"PERSON"},{"type":"$5 million","content":"MONEY"},{"type":"Alexandre Liege","content":"PERSON"}],"hashtag":["ASSETS","SMART CONTRACTS"],"authors":["James Hunt","The Block"]}