{"summary":"Bastion, the largest DeFi protocol on the Aurora blockchain — a subnet of the NEAR blockchain — has raised $9 million in Series A funding.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/142874\/aurora-based-defi-protocol-bastion-raises-9-million-in-funding-led-by-three-arrows-capital","publishDate":"2022-04-21T11:00:58","id":6238,"type":null,"title":"Aurora-based DeFi protocol Bastion raises $9 million","category":["VENTURE CAPITAL"],"content":["Bastion, currently the biggest DeFi protocol on the Aurora blockchain — a subnet of the NEAR blockchain — raised $9 million in a Series A funding round as it plans to expand.","Three Arrows Capital led the round, with&nbsp;FTX Ventures, Jump Crypto, Jane Street, CMS Holdings, Crypto.com Capital and others participating.","Bastion was launched last month by pseudonymous founder \"N^2\" aka \"Near Squared.\" The protocol offers a lending and stableswap platform on <a href=\"https:\/\/www.theblockcrypto.com\/linked\/120620\/aurora-ethereum-compatible-near-protocol-funding\" data-v-f87c67ca=\"\">Aurora<\/a> — an Ethereum-compatible scaling network created by the team at the NEAR protocol.","More than a month after its launch, Bastion has become the biggest DeFi protocol on Aurora, according to data from <a href=\"https:\/\/defillama.com\/chain\/Aurora\" data-v-f87c67ca=\"\">DeFi Llama<\/a>.&nbsp;Its current total value locked or TVL <a href=\"https:\/\/app.bastionprotocol.com\/\" data-v-f87c67ca=\"\">stands at<\/a> over $600 million.&nbsp;","Bastion plans to further expand its ecosystem with new funding in place, N^2 told The Block. To that end, the project plans to hire people for its marketing and business development functions. Its current headcount is five people, N^2 said.","The Series A funding was raised via a mix of equity and token rounds, said N^2, adding that \"value is in the token.\"","Bastion <a href=\"https:\/\/bastionprotocol.medium.com\/bstn-token-launch-f4e44bba88f3\" data-v-f87c67ca=\"\">launched<\/a> its native token BSTN earlier today with a total supply of 5 billion. Users who pre-mined the token on Bastion or who participated in Bastion's $410 million \"lockdrop\" IDO (initial DEX offering) are eligible to claim their BSTN airdrop on the Bastion app.","Lockdrop is a way of distributing tokens, similar to an airdrop. But unlike an airdrop, where free tokens are given, in a lockdrop, users have to lock their assets to receive a free reward.","N^2&nbsp;said users locked in $410 million worth of capital into&nbsp;Bastion via its&nbsp;lockdrop IDO for up to 12 months in exchange for $3 million in NEAR rewards and 11% of BSTN's total supply.","The rest of the token supply is allocated for team members and advisers, liquidity mining incentives and treasury.","Jane Street is a repeat investor in Bastion. The trading giant also <a href=\"https:\/\/www.theblockcrypto.com\/linked\/138979\/trading-giant-jane-street-backs-near-based-lending-protocol-in-new-funding-round\" data-v-f87c67ca=\"\">participated<\/a> in Bastion's funding round last month, in which the protocol didn't disclose how much it raised.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"TVL","content":"ORGANIZATION"},{"type":"Aurora","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$410 million","content":"MONEY"},{"type":"Jane Street","content":"PERSON"},{"type":"$600 million","content":"MONEY"},{"type":"$3 million","content":"MONEY"},{"type":"11%","content":"PERCENT"},{"type":"FTX Ventures","content":"ORGANIZATION"},{"type":"5 billion","content":"MONEY"},{"type":"DEX","content":"ORGANIZATION"},{"type":"$9 million","content":"MONEY"},{"type":"Jump Crypto","content":"LOCATION"},{"type":"CMS Holdings","content":"ORGANIZATION"},{"type":"Bastion","content":"LOCATION"}],"hashtag":["THREE ARROWS CAPITAL"],"authors":["Yogita Khatri","The Block"]}