{"summary":"Coinbase&#x27;s new international perpetual exchange clocked in nearly $900 million in trading volumes between June 21 to June 28.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237048\/coinbase-international-nears-900-million-in-volume-over-eight-days","publishDate":"2023-06-29T10:12:28","id":6239,"type":null,"title":"Coinbase International nears $900 million in volume over eight days","category":["MARKETS"],"content":["Coinbase, which gate-crashed the offshore crypto derivatives market in May, is already clocking in about $100 million in volumes on a daily basis, according to data compiled by The Block.&nbsp;","Over the period of June 21 to June 28, the exchange clocked in nearly $900 million in trading volumes. Sources at the firm tell The Block that the market reception has been positive and volumes are strong for a venue with only two contracts to trade.","Trading volumes on Coinbase's international marketplace. Image: The Block Research.","The firm, which is being sued by the US Securities and Exchange Commission, said in May that it would enable international users to trade perpetual futures tied to bitcoin and ether through a new platform based in Bermuda. Volumes came in at $73 million on Wednesday — the lowest level over the past eight days. During that period the firm saw $892 million worth of crypto derivatives traded.&nbsp;","\"Coinbase International Exchange is off to a strong start since launching in early May,\" noted Emmanuel Goh, product manager at Coinbase and former Skew CEO, in an email to The Block.&nbsp;","\"We are working to bring new features and additional products to market over the second part of the year and continue growing our market share,\" he added","Binance is still the runaway leader in derivatives trading with $444 billion traded on its venue this month, according to The Block's data dashboard.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/futures\/volume-of-bitcoin-futures-monthly\/embed\" title=\"Volume of Bitcoin Futures\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$900 million","content":"MONEY"},{"type":"$892 million","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bermuda","content":"LOCATION"},{"type":"Coinbase International Exchange","content":"ORGANIZATION"},{"type":"$444 billion","content":"MONEY"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Emmanuel Goh","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"US Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"June 28","content":"DATE"},{"type":"June 21","content":"DATE"},{"type":"$73 million","content":"MONEY"}],"hashtag":["COINBASE"],"authors":["Frank Chaparro","The Block"]}