{"summary":"The funds will be used to expand imgnAI’s infrastructure and launch a “digital companion” product dubbed “Naifu.”","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274669\/imgnai-raise-digital-companion-launch","publishDate":"2024-01-26T12:01:58","id":624,"type":null,"title":"imgnAI raises $1.6 million seed round to support &#x27;digital companion&#x27; launch","category":["DEALS"],"content":["Crypto-native AI platform imgnAI has closed a $1.6 million seed funding round led by Hack VC. Rana Capital, Selini Capital, West Ham Capital, Motus Capital and dao5 also participated in the round, though a valuation was not disclosed.","The image-generation bot platform was launched in late 2022, with its imgnAI crypto token used to unlock premium features and mint images directly as NFTs, <a href=\"https:\/\/imgnai.com\/token\/\" data-v-f87c67ca=\"\">according<\/a> to its website. Tokens spent on such features are then burned, reducing the total supply.","\"imgnAI blends a user-friendly consumer AI product with powerful tools, promoting an enjoyable creative loop for artists of all skill levels,\" Hack VC Partner Roshun Patel said in a statement. \"Added crypto-native and social features round out imgnAI as a contender to capture attention at the intersection of art, crypto and AI.\"","The funding will be used to increase imgnAI's infrastructure capacity, accelerate product development and expand its marketing efforts, the project said. It also intends to use the capital to help support the launch of a \"digital companion\" product dubbed \"Naifu\" that's designed to offer high-performance text and image responses with greater creative freedom compared to web2 alternatives.","\"Our goal is to create products that support freedom and fun, while onboarding the next generation of crypto-native users,\" imgnAI co-founder and CEO Thelema said.","imgnAI claims its flagship image generation product, Nai, has been installed in more than 23,000 Telegram groups and 87,000 Discord servers, with thousands of daily active users on the platform alongside its web app.","imgnAI is among a number of projects seeking to leverage the integration of AI and crypto. On Tuesday, Bagel Network, a decentralized data platform aiming to support machine learning models, <a href=\"https:\/\/www.theblock.co\/post\/274016\/bagel-network-raises-3-1-million-to-develop-data-marketplace\" data-v-f87c67ca=\"\">raised<\/a> $3.1 million in a pre-seed round led by CoinFund.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bagel Network","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"$1.6 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$3.1 million","content":"MONEY"},{"type":"Thelema","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"West Ham Capital","content":"LOCATION"},{"type":"CoinFund","content":"ORGANIZATION"},{"type":"Rana Capital","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Selini Capital","content":"ORGANIZATION"},{"type":"Motus Capital","content":"ORGANIZATION"},{"type":"Roshun Patel","content":"PERSON"},{"type":"Nai","content":"PERSON"}],"hashtag":["SEED &AMP; PRE-SEED"],"authors":["James Hunt","The Block"]}