{"summary":"The Block spoke with Sui Chung, the CEO of CF Benchmarks that provides the index set to be used by several proposed spot bitcoin ETFs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/255560\/gold-etfs-could-shed-light-on-the-secs-thinking-about-proposals-for-spot-bitcoin-funds","publishDate":"2023-10-10T16:36:57","id":6241,"type":null,"title":"Gold ETFs could shed light on the SEC&#x27;s thinking about proposals for spot bitcoin funds","category":["COMPANIES"],"content":["With most applications for a spot bitcoin ETF in an extended waiting period after the Securities and Exchange Commission last month <a href=\"https:\/\/www.theblock.co\/post\/253620\/sec-continues-filing-frenzy-delaying-bitcoin-etfs-from-fidelity-vaneck-and-wisdomtree\" data-v-f87c67ca=\"\">delayed the ongoing processes<\/a> with fresh public comment periods, the industry has gone from the excitement of waiting for a possible approval with bated breath to the doldrums of now just waiting.","The Block spoke about all the recent moves with <a href=\"https:\/\/www.linkedin.com\/in\/sui-chung-ba9b6a11\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Sui Chung<\/a>, the CEO of Kraken-subsidiary&nbsp;<a href=\"https:\/\/www.cfbenchmarks.com\/about\/people\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">CF Benchmarks<\/a> that provides the index set to be used by some of the proposed spot bitcoin ETFs.","Chung, who has been <a href=\"https:\/\/www.theblock.co\/post\/236558\/multi-billion-dollar-question-posed-by-blackrock-move-for-a-spot-bitcoin-etf\" data-v-f87c67ca=\"\">intimately involved<\/a> in the bitcoin ETF filing process over the years, spoke about the ongoing approval process and what might need to happen before one of the proposed funds eventually comes to market.","(<em data-v-f87c67ca=\"\">The interview has been edited for length and clarity.<\/em>)&nbsp;","<strong data-v-f87c67ca=\"\">The Block:&nbsp;<\/strong>What's your read on everything we've seen over these past few months?&nbsp;","<strong data-v-f87c67ca=\"\">Sui Chung: <\/strong>Quite a lot has happened, and then quite a lot hasn't happened.&nbsp;In the meantime, unsurprisingly, the SEC has extended the comment period for the spot bitcoin ETFs.&nbsp;","We now have ether futures ETFs. So it's progress, no doubt. Having ether futures ETFs is better than not having ether futures ETFs, in my view. You've got people wanting to understand 'okay, how does this ether futures market work? How long has it been going? How liquid is it?' All the basic things, and that could only be a good thing, as more of the financial investment community learns about the crypto ecosystem.","It's very easy in the crypto space to think that everything should happen in five minutes. Because quite a lot does happen very quickly. You have a lot of very talented, very dedicated teams who throw all their resources and intellectual capacity at problems and solve them. But we've got to remember that we are now talking about the traditional financial sector, and it does not move at that speed.","<strong data-v-f87c67ca=\"\">The Block:&nbsp;<\/strong>What do you think it is that the SEC wants? We're in this extended comment period now, but is the SEC listening? Where is the discourse that matters actually happening?","<strong data-v-f87c67ca=\"\">Sui Chung: <\/strong>The discourse is happening within the four walls of the SEC. That's where the discourse is happening, and the comments, they do read them. They will become sort of agenda items within that internal discourse within the SEC. That's kind of how it works.","The ones that are more cogent, the SEC does address them. They do get read. However, it is not a dialogue. You make your statements. The SEC then writes up what they think of that. And there's no right of reply. So it's not a dialogue. That's the way it works, which can be frustrating.","<strong data-v-f87c67ca=\"\">The Block:&nbsp;<\/strong>Where do you think their current caution, or their need for more time, is coming from, especially given that ETFs for futures have already been approved? What's the real difference? What makes the spot market more prone to risk or in need of increased scrutiny?&nbsp;","<strong data-v-f87c67ca=\"\">Sui Chung: <\/strong>The stuff inside it, for a futures based ETF, is CFTC regulated futures contracts. So, in their view, that underlying instrument, that futures contract, is regulated by the CFTC, and therefore, it's a regulated instrument sat inside an ETF.","The SEC stance is that, when you have a spot ETF, the stuff inside, that instrument, that spot bitcoin, is not subject to regulation in the manner in which it is traded. It is traded on unregulated markets. The SEC has believed, up to now certainly, that that makes them fundamentally different.","Many commentators feel that they are the same, given how well the futures track the spot market. Being the provider of the index that settles those futures, I can tell you that yes, the futures track the spot market, remarkably well over a prolonged period of time.","<strong data-v-f87c67ca=\"\">The Block:&nbsp;<\/strong>I can understand that argument if it's the futures market where price discovery is happening, but what if its vice versa? I imagine there could be a difference. What if price discovery is happening in the spot market, and the futures are just following that? Are the futures tracking the price of the underlying asset? Or are they influencing the value of the underlying asset?&nbsp;&nbsp;","<strong data-v-f87c67ca=\"\">Sui Chung: <\/strong>There is sort of back and forth. The academic literature leans toward that the futures market leads the spot market, that in fact, in price formation terms, there is a lead-lag, and the lead, most of the time, resides in the futures market.","The reason the SEC has allowed other commodity ETFs to exist, like physical gold ETFs, is that it believes that the futures market for gold is where the price is set, that is the venue of price discovery, and that is a regulated market. So the futures lead the physical and therefore, that makes it okay, because that's a regulated market. So that's another sort of angle to look at it from. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nNational stock exchanges, that's the actual definition inside the Securities and Exchange Act 1933, they need to have the mechanisms in place to ensure that their markets are free from manipulation.","<strong data-v-f87c67ca=\"\">The Block:&nbsp;<\/strong>Does it come down to the size of the spot bitcoin market versus the size of the futures market?","<strong data-v-f87c67ca=\"\">Sui Chung: <\/strong>It's sort of not so much size, because if we take gold as the analogy, in gold no one actually knows how big the physical spot market is. Because it's not traded on a screen. It's not a central limit order book. It's brokers calling miners and asking them, \"can I buy this amount of gold?\" And then those brokers, talking to industrial users, \"do you want to buy this amount of gold. I will ship it to you.\" So no one actually even knows how big the spot market is.","Crypto is different because you have central order books that are available on the open internet that you can monitor.","<strong data-v-f87c67ca=\"\">The Block:&nbsp;<\/strong>So, getting back to the main question, why is a decision taking so long, whichever way it might go?&nbsp;","<strong data-v-f87c67ca=\"\">Sui Chung: <\/strong>There are some practicalities here. Whatever the SEC decides, approval or disapproval, they need to produce an order, which is like a 200-page essay on all the various merits of the rule change being proposed, the instrument, what precedents they're using to judge this, how they interpret the Securities and Exchange Act 1933, if they don't like it, why they don't like, et cetera, et cetera. So someone's got to write that essay. And if you recall, the chunk of that time was over the summer. Just practically speaking, no one is going to write a 200-page essay in August, anywhere in the world, no matter what job they've got, whether they work for the SEC or whether they work for Goldman Sachs or whether they work for Coca-Cola. That's just not happening.","So some of it is practicalities. And then, when you're writing a 200-page essay, you need to pull in a lot of information. So, to be fair to the SEC, that work, the work that's required to do this, because you are setting a precedent, as well as following precedents, it is a pretty involved task.","<strong data-v-f87c67ca=\"\">The Block:&nbsp;<\/strong>What's your read on some of the surveillance sharing agreements we saw proposed? Will they be able to provide the needed confidence that there is not any market manipulation going on in the spot market?&nbsp;","<strong data-v-f87c67ca=\"\">Sui Chung: <\/strong>If someone does engage in market manipulation, that's not necessarily the fault of the exchanges. They're not held accountable for that. What they're held accountable for is to have processes and procedures in place, mechanisms in place, to detect it and then potentially initiate, allow the SEC to initiate prosecutions.","The SEC believes that if you have that in place, it will deter people from trying manipulation in the first place because they know they're being watched. In traditional markets, there is something that exists called the Intermarket Surveillance Group, the ISG. Almost every stock exchange, every derivatives exchange is a member of this. And it exists so that if people engage in market manipulation across different venues, that they can be caught. The exchanges can share information on who placed what order and when, to be able to identify potential perpetrators of market manipulation.","That's what the SEC wants to see.","<strong data-v-f87c67ca=\"\">The Block:<\/strong> So, in that sense, do you think that there is more progress to be made on the crypto exchange side of things in terms of these information sharing mechanisms? Do they even have this capability right now to function like traditional finance, or does that still need to be built out?&nbsp;","<strong data-v-f87c67ca=\"\">Sui Chung: <\/strong>BlackRock, Fidelity, Franklin Templeton, WisdomTree, and the respective stock exchanges, they are seeking to list the ETFs. They seem pretty confident, otherwise they wouldn't have filed with what they put into their response. So they seem pretty confident that it will work.","But the question is whether the SEC believes it will work.","<b data-v-f87c67ca=\"\">The Block: <\/b>What are you expecting in terms of the calendar. What's the timeline that you're running with, in terms of when we could see some <a href=\"https:\/\/www.theblock.co\/post\/254940\/sec-spot-bitcoin-etf-blackrock\" data-v-f87c67ca=\"\">kind of a decision<\/a>?&nbsp;","<strong data-v-f87c67ca=\"\">Sui Chung: <\/strong>I don't have one, unfortunately. I've been doing this long enough whereby I realize that trying to guess where the SEC will land is hard enough, nevermind trying to stick a date on it.","In my view, you've got 10 applications. Nine of them are materially similar. Grayscale is a little bit different because it's a conversion. So there could be procedural things. But of the nine plain applications, they're pretty similar in their approach, in terms of what they wish to do. There's a slightly different cast of characters in terms of the ETF issuer, the index provider, and the custodian named. And that might have some bearing, but in principle, they are largely the same. So I think, at least in terms of the decision in principle, approval or disapproval, what applies to one will apply to the others.","Given that, it kind of makes sense that it will all happen, at least that approval or disapproval decision, will happen at the same time for everyone.&nbsp;","Now, the interesting thing is you can have approval and disapproval, that can happen on the same day for everyone. But if it is approval, then the interesting thing becomes, well, is everyone going to be ready? On the very next day? And I think that is not necessarily a given. The degree of operational preparedness that each individual issuer is at may very well vary. This is novel. It's not been done before in the U.S.","To make a crypto ETF function, you need a custodian, you need a fund admin, who are ready on the day you wish to launch. You need authorized participants who are ready to handle the the trading and the buying bitcoin, sending them to the custodian, in the creation and redemption process. These things have not been done before in the U.S. financial system.","So whether they'll all be ready at the same time, that is open to question. And I find it almost impossible to believe that they're all at the same level of operational preparedness.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Intermarket Surveillance Group","content":"ORGANIZATION"},{"type":"Sui Chung","content":"PERSON"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"WisdomTree","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Coca","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"1933","content":"DATE"},{"type":"Cola","content":"LOCATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Sui Chung","content":"LOCATION"},{"type":"summer","content":"DATE"},{"type":"ISG","content":"ORGANIZATION"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"August","content":"DATE"}],"hashtag":["SEC"],"authors":["Nathan Crooks","The Block"]}