{"summary":"Payments firm Mastercard completed a CBDC project with the Reserve Bank of Australia and the Digital Finance Cooperative Research Centre. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/256185\/mastercard-successfully-wraps-up-cbdc-pilot-with-reserve-bank-of-australia","publishDate":"2023-10-12T12:17:02","id":6246,"type":null,"title":"Mastercard successfully wraps up CBDC pilot with Reserve Bank of Australia","category":["CRYPTO ECOSYSTEMS"],"content":["Mastercard has completed a central bank digital currency pilot with the Reserve Bank of Australia and the Digital Finance Cooperative Research Centre.&nbsp;","The project tested how authorized parties, who have gone through know-your-customer protocols, could hold, use and redeem CBDCs. In addition, the project tested how a holder could purchase an Ethereum-based NFT by locking the pilot CBDC and minting an equivalent amount of Ethereum-based wrapped coins, according to a Mastercard <a href=\"https:\/\/www.mastercard.com\/news\/ap\/en\/newsroom\/press-releases\/en\/2023\/mastercard-demonstrates-interoperable-cbdc-for-trusted-web3-commerce-in-australia-and-beyond\/\" data-v-f87c67ca=\"\">statement<\/a>.","“As the digital economy continues to mature, Mastercard has seen demand from consumers to participate in commerce across multiple blockchains, including public blockchains,” Mastercard's Australasia division president Richard Wormald said in a statement. \"This technology not only has the potential to drive more consumer choice, but it also unlocks new opportunities for collaboration between the public and private networks to drive genuine impact in the digital currency space.\"","The Australian financial services firm Cuscal and blockchain tech firm Mintable partnered with Mastercard's pilot.&nbsp;","Mastercard had shown interest in exploring CBDCs since at least <a href=\"https:\/\/www.theblock.co\/linked\/77300\/mastercard-customizable-cbdc-testing-platform\" data-v-f87c67ca=\"\">2020<\/a>. The firm expressed ambitions to operate as a private-sector <a href=\"https:\/\/www.theblock.co\/linked\/103333\/mastercard-cbdcs-payments-beyond\" data-v-f87c67ca=\"\">partner<\/a> for CBDCs in 2021 and formed a CBDC <a href=\"https:\/\/www.theblock.co\/post\/246140\/mastercard-cbdc-ripple-consensys\" data-v-f87c67ca=\"\">program<\/a> with Ripple and Consensys in August of 2023.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Richard Wormald","content":"PERSON"},{"type":"Reserve Bank of Australia","content":"ORGANIZATION"},{"type":"Digital Finance Cooperative Research Centre","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Australasia","content":"LOCATION"},{"type":"August of 2023","content":"DATE"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["PAYMENTS"],"authors":["MK Manoylov","The Block"]}