{"summary":"Coinbase has announced Wallet-as-a-Service (WaaS), making it easier for companies to build web3 experiences for users.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/218055\/coinbase-announces-wallet-as-a-service-product-to-simplify-web3-onboarding","publishDate":"2023-03-08T09:00:55","id":6254,"type":null,"title":"Coinbase announces Wallet-as-a-Service product to simplify web3 onboarding","category":["WEB3"],"content":["<span data-v-f87c67ca=\"\">Coinbase introduced a product called Wallet-as-a-Service (WaaS), which allows companies to create fully customizable web3 wallets within their own apps with user onboarding as simple as in web2 applications.<\/span>","<span data-v-f87c67ca=\"\">Coinbase argued that the complexity of wallets remains a major challenge due to mnemonic requirements (seed phrase backup recovery) and counterintuitive UIs, in a blog post released today that The Block received an early copy of. That's despite the opportunities available for brands in web3 to create new revenue streams and strengthen user engagement, it said.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Using Coinbase WaaS, companies can build native wallets straight into their own applications to create a more seamless experience without redirecting users to any external app or spending significant time, resources and expertise developing their own solution.<\/span>","<span data-v-f87c67ca=\"\">Without having to set up and secure a complicated 24-word recovery phrase, WaaS provides users with access to web3 using Multi-Party Computation (MPC). MPC is a cryptographic technology that can improve existing multi-sig techniques, effectively allowing wallet keys to be “split” between the user and Coinbase.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As a full private key never exists in a single location, theft of the key is extremely difficult, even if a device becomes compromised, said Patrick McGregor, head of product for web3 developer platforms at Coinbase.<\/span>","<span data-v-f87c67ca=\"\">The design of WaaS means if a user loses access to their device, the key to the web3 wallet remains safe and can be securely restored. Coinbase is able to lock a wallet if a user notifies it, preventing it from being used to sign transactions. The design of MPC wallets means they are also natively cross-chain, offer cheaper transaction fees, provide more user privacy, avoid smart contract risks and are interoperable with ecosystem standards, McGregor added.<\/span>","<span data-v-f87c67ca=\"\">While existing web3 wallets are “functional for sophisticated and experienced users,” incoherent user experiences due to a lack of robust wallet integrations with apps, portability across devices and the secure backup and recovery of wallets were cited by McGregor as the main challenges WaaS can overcome.<\/span>","<span data-v-f87c67ca=\"\">Companies like Floor, Moonray, Thirdweb and Tokenproof have begun using WaaS to onboard web3 users across gaming, token-gated events and digital marketplaces.<\/span>","<span data-v-f87c67ca=\"\">“Individuals will no longer have to come with knowledge of how the blockchain works in order to interact with the brands they love. This is a huge step towards making the space more approachable and accessible,” said Tokenproof CEO Alfonso Olvera.<\/span>","<span data-v-f87c67ca=\"\">WaaS is a set of scalable and secure APIs designed to abstract away the complexities of blockchain infrastructure, providing access to web3 wallets with the ease of use of web2, while Coinbase handles everything under the hood.<\/span>","<span data-v-f87c67ca=\"\">The newbie-friendly approach enables users to create, access and restore wallets with authentication as simple as a username and password. MPC technology helps keep user assets secure by splitting, encrypting and distributing keys among multiple parties. McGregor explained that the keys used for signing are encrypted, requiring hardware-secured biometrics to decrypt and multi-factor authentication, like Google Authenticator and YubiKey, verification before restoring wallets.<\/span>","<span data-v-f87c67ca=\"\">While both multi-sig solutions and MPC enable assets to be secured by multiple parties, instead of using multiple individual signatures validated by a multi-sig smart contract, MPC introduces a “multi-user quorum structure,” meaning “multiple people are required to produce a single signature,” McGregor added.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Compared to most web3 wallets, this means that users don’t have to manage their keys alone. While that could be seen as a trade-off between convenience and full self-custody, users still retain control over their assets and can export their keys to another software platform at any time.<\/span>","<span data-v-f87c67ca=\"\">Coibase’s WaaS initiative, aimed at helping to scale the web3 ecosystem, comes two weeks after launching its own Ethereum Layer 2 network, dubbed <\/span><a href=\"https:\/\/www.theblock.co\/post\/214183\/coinbase-unveils-layer-2-network-and-developer-fund\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Base<\/span><\/a><span data-v-f87c67ca=\"\">, in February.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tokenproof CEO Alfonso Olvera","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Moonray","content":"LOCATION"},{"type":"Multi-Party Computation (MPC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Coinbase WaaS","content":"PERSON"},{"type":"MPC","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Patrick McGregor","content":"PERSON"},{"type":"McGregor","content":"PERSON"}],"hashtag":["BRIAN ARMSTRONG","COINBASE","WALLET MAKERS","WALLETS"],"authors":["James Hunt","The Block"]}