{"summary":"Polkadot has announced a new version of its governance system called Governance version 2 (or Gov2). ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/154838\/polkadot-to-scrap-its-council-body-in-new-governance-system","publishDate":"2022-06-29T12:17:31","id":6258,"type":null,"title":"Polkadot to scrap its &#x27;Council&#x27; body in new governance system","category":["LAYER 1S"],"content":["<span data-v-f87c67ca=\"\">Polkadot has announced a new version of its governance system called Governance version 2 (or Gov2).&nbsp;<\/span>","<span data-v-f87c67ca=\"\">With Gov2, the team hopes<\/span><span data-v-f87c67ca=\"\"> to significantly decentralize the decision-making process for <a href=\"https:\/\/www.theblock.co\/linked\/84526\/polkadot-most-popular-network-staking-dot-token\" data-v-f87c67ca=\"\">Polkadot<\/a> — an interoperability network that connects many application-specific blockchains.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">At the ongoing Decoded conference, the Polkadot core team said that its current governance system needed an overhaul as it found it to be too centralized. <\/span><span data-v-f87c67ca=\"\">They stated that the so-called Polkadot Council, a centralized body of executives, <\/span><span data-v-f87c67ca=\"\">had exclusive decision-making power on matters like treasury spending. <\/span><span data-v-f87c67ca=\"\">This, the team argued, ran counter to the ethos of decentralization. <\/span>","<span data-v-f87c67ca=\"\">As a result, it has chosen to scrap the body. <\/span><span data-v-f87c67ca=\"\">For Governance v2, the team has prepared a software framework that will remove the Council and replace it with \"referendum,\" a voting system where anyone can make proposals and get them passed.&nbsp;<\/span>","“Polkadot’s Governance v2 offers new building blocks for parachains to craft their desired governance process while sharing a common infrastructure. This unlocks new possibilities to implement governance processes with the right balance between decentralization and efficiency,” Bryan Chen, co-founder and CTO of Acala, a decentralized finance hub on Polkadot, told The Block.","<span data-v-f87c67ca=\"\">This new governance system is set to launch on Kusama, Polkadot's canary network, imminently. Later on, it will be deployed on the Polkadot mainnet but without the need of a hardfork — where the code of a blockchain is significantly changed — Robert Habermeier, Polkadot's co-founder, told The Block.<\/span>","\"Governance v2 demonstrates Polkadot's forkless upgrade capability is even capable of upgrading its own governance mechanism without a hard fork,\" <span data-v-f87c67ca=\"\">Habermeier added.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bryan Chen","content":"PERSON"},{"type":"Robert Habermeier","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Kusama","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Council","content":"ORGANIZATION"},{"type":"CTO","content":"ORGANIZATION"},{"type":"Polkadot Council","content":"ORGANIZATION"},{"type":"Acala","content":"LOCATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}