{"summary":"OpenZeppelin uncovered a significant vulnerability during a security audit for Coinbase of the Convex Finance protocol.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/140554\/convex-finance-addresses-bug-that-couldve-led-to-a-15-billion-rug-pull","publishDate":"2022-04-05T04:32:36","id":6259,"type":null,"title":"Convex Finance addresses bug that could&#x27;ve led to a $15 billion rug pull","category":["DEFI"],"content":["Convex Protocol, a platform that boosts rewards for those using the Curve stablecoin, has mitigated an issue that could've resulted in a $15 billion rug pull.","Rug pulls occur when seemingly legitimate cryptocurrency projects abscond with investor funds. It's become a considerable problem in the decentralized finance space in the <a href=\"https:\/\/blog.chainalysis.com\/reports\/2021-crypto-scam-revenues\/\" data-v-f87c67ca=\"\">past year<\/a>.&nbsp;","OpenZeppelin, a blockchain security firm, uncovered a significant vulnerability during a security audit for Coinbase of the Convex Finance protocol. The firm found that if two of the three multi-signature wallet signers of the Convex executed a specific series of steps, they could gain access to a pool of liquidity provider tokens. OpenZeppelin detailed the steps in a <a href=\"https:\/\/blog.openzeppelin.com\/15-billion-rugpull-vulnerability-in-convex-finance-protocol-uncovered-and-resolved\/\" data-v-f87c67ca=\"\">post<\/a>.&nbsp;","Because Convex holds the majority of Curve Finance's CRV stablecoins in circulation, considerable funds were at risk. The vulnerability could allow Convex's anonymous developers — in the form of two of three multisig signers — to gain control over Convex's locked value, which at the time was about $15 billion.&nbsp;","The bug could only be exploited or patched by Convex's development team, which OpenZeppelin said made the disclosure process complicated. The security firm said it was reasonably sure that the issue was unintentional, meaning developers didn't know about the vulnerability or have the intention of absconding with funds, but if the firm was wrong, the fallout of alerting the very people with the power to conduct the rug pull had the potential to be disastrous.&nbsp;","Ultimately, OpenZeppelin said it attempted to obtain assurances that the vulnerability would not be exploited ahead of describing the vulnerability to the Convex team. They used bug bounty partner Immunefi as an intermediary.&nbsp;","Since then, the bug has been patched. The vulnerability was never exploited and no funds were ever lost. Convex posted <a href=\"https:\/\/docs.convexfinance.com\/convexfinance\/faq\/known-issues\" data-v-f87c67ca=\"\">additional resources<\/a> breaking down the multisig weakness in its public documentation.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Curve Finance","content":"ORGANIZATION"},{"type":"CRV","content":"ORGANIZATION"},{"type":"$15 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"OpenZeppelin","content":"PERSON"},{"type":"Convex Finance","content":"ORGANIZATION"},{"type":"Convex","content":"ORGANIZATION"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}