{"summary":"A market maker for CME and Huobi just closed a $7 million seed round led by Polychain Capital, aiming to address the growing demand for cryptocurrency","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/31468\/liquidity-provider-for-cme-and-huobi-raises-7m-from-polychain-capital","publishDate":"2019-07-15T13:14:45","id":626,"type":null,"title":"Liquidity provider for CME and Huobi raises $7M from Polychain Capital","category":["INSTITUTIONAL INVESTORS"],"content":["A market maker for CME and Huobi just closed a $7 million seed round led by Polychain Capital, aiming to address the growing demand for cryptocurrency liquidity from institutional traders.&nbsp;","<span data-v-f87c67ca=\"\">Altonomy, a Singapore-based market maker, <a href=\"https:\/\/finance.yahoo.com\/news\/altonomy-raises-7-million-seed-130000452.html\" data-v-f87c67ca=\"\">is said to connect with<\/a> more than 60 cryptocurrency exchanges and OTC desks around the globe and trade over 250 cryptocurrencies. Besides providing liquidity to spot and derivatives exchanges, it also works with stablecoins including USDC, Tether, TrueUSD, and Paxos Standards.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"We are proud of our ability to source liquidity for customers, regardless of token type, order size, market cap, or whether the asset trades on centralized or decentralized exchanges,” said Altonomy co-founder Ricky Li in a statement.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Li told The Block that the company has witnessed an influx of institutions entering the crypto market recently. Indeed, as the crypto market matures and more liquidity pours into the space, Wall Street giants such as Fidelity, Goldman Sachs, and JPMorgan are all testing the cryptocurrency trading waters. Goldman Sachs recently built a new digital asset arm that <\/span><a href=\"https:\/\/www.theblockcrypto.com\/2019\/07\/09\/goldman-sachs-set-to-go-further-than-ever-before-with-new-digital-asset-project\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">is said to rival<\/span><\/a><span data-v-f87c67ca=\"\"> JPMorgan’s digital asset JPMCoin, while Fidelity is strengthening its own digital asset team to gear up for <\/span><a href=\"https:\/\/www.theblockcrypto.com\/tiny\/fidelity-is-hiring-for-9-positions-at-its-digital-asset-arm\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">a reported launch of bitcoin trading<\/span><\/a><span data-v-f87c67ca=\"\">. <\/span>","<span data-v-f87c67ca=\"\">These large legacy players may pose substantial competition to the one-year-old company, although Li believed that there is still space for Altonomy to grow.&nbsp;<\/span>","\"They (companies like Goldman Sachs and Fidelity) are mostly in bitcoins, but most of our volume goes to other coins,\" said Li. \"These are the tokens that actually need a deep understanding of the cryptocurrency and blockchain technology, as well as a network of the actual crypto players...We are attracting different customers.\"&nbsp;","<span data-v-f87c67ca=\"\">Meanwhile, the upswing in bitcoin derivatives trading volumes also signals institutional traders’ growing interest in cryptocurrencies. CME’s bitcoin futures are trading at all-time highs two months in a row,<\/span><a href=\"https:\/\/twitter.com\/CMEGroup\/status\/1144704415028469760\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> reaching a record $1.7 billion<\/span><\/a><span data-v-f87c67ca=\"\"> in notional value traded in late June. In addition, 950 new trading accounts <a href=\"https:\/\/www.coindesk.com\/june-sets-records-for-cme-bitcoin-futures-as-sign-ups-surge-30?utm_source=twitter&amp;utm_medium=coindesk&amp;utm_term=&amp;utm_content=&amp;utm_campaign=Organic%20\" data-v-f87c67ca=\"\">have been created on CME<\/a> in 2019 so far, a 30% increase from last year.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Altonomy is counting on its partnership with Polychain Capital, a noted name in the blockchain space, and the newly raised fund to help strengthen its market presence among institutions and expand its cryptocurrency inventory.&nbsp;&nbsp;<\/span>","\"It [having a large inventory] gives us a lot of comforts and expands our trading universe,\" said Li.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Altonomy","content":"ORGANIZATION"},{"type":"$7 million","content":"MONEY"},{"type":"Paxos Standards","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"Singapore","content":"LOCATION"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"OTC","content":"ORGANIZATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Ricky Li","content":"PERSON"},{"type":"$1.7 billion","content":"MONEY"},{"type":"CME","content":"ORGANIZATION"}],"hashtag":[],"authors":["The Block","The Block"]}