{"summary":"We take a look at what’s going to happen this coming week, with Blur’s trading volumes a key talking point and ETHDenver set to kick off.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215242\/three-big-crypto-stories-in-week-ahead-blur-ethdenver-and-sam-bankman-fried","publishDate":"2023-02-26T07:05:14","id":6260,"type":null,"title":"Three big crypto stories in week ahead: Blur, ETHDenver and Sam Bankman-Fried","category":["CRYPTO ECOSYSTEMS"],"content":["One of the biggest crypto stories this past week was the explosion of trading volumes on NFT marketplace Blur, which far outpaced rival OpenSea. The big question is whether this activity will find a sustainable path forward or if it’s all just airdrops and trading taking advantage of them.","This week will also see ETHDenver get underway, with a lot of key speakers and some big topics. Look for news coming from the conference.&nbsp;","Beyond that, former FTX CEO Sam Bankman-Fried remains stuck in deliberations over possible changes to his bail terms. Even though the deadline may get pushed back to the end of the week, there should be some updates on how he may find a path forward.","NFT marketplace Blur's trading volumes have surged into the lead against rival OpenSea.&nbsp;","Over the last month, Blur had held a slight edge on its competitor, but last week it raced into the lead with trading volumes about four times higher, according to <a href=\"https:\/\/dune.com\/sealaunch\/blur-vs-opensea\" data-v-f87c67ca=\"\">data via Dune<\/a>.","The marketplace saw a high of 62,351 ETH in daily trading volume last week from 55,000 sales, according to a different <a href=\"https:\/\/dune.com\/sealaunch\/blur\" data-v-f87c67ca=\"\">Dune dashboard<\/a>. So far, Blur has seen almost $1 billion in trading volume this month, compared with just $240 million for OpenSea, according to <a href=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/marketplaces\/nft-marketplace-monthly-volume\" data-v-f87c67ca=\"\">The Block’s Data Dashboard<\/a>. That said, OpenSea continues to have&nbsp;about twice as many users.","There are reasons for Blur's performance. One is that many users may be trading on the platform in anticipation of upcoming airdrops set to reward “loyalty” to the marketplace. This has certainly helped to drive up volumes.","Another aspect is that NFT holders have been taking advantage of the increased liquidity — further boosting volumes. Last week, two ​​Bored Ape Yacht Club NFT holders who run research and trading firm Degenz Finance <a href=\"https:\/\/www.theblock.co\/post\/214373\/bored-ape-whales-cash-out-using-blur\" data-v-f87c67ca=\"\">cashed out<\/a> to the tune of more than 6,000 ETH ($10 million). They had long considered how they would be able to cash out in size and saw this as an opportunity. “The liquidity provided by Blur is insane at the moment,” they said.","Still, while volume numbers are rising, it’s unclear whether this model is sustainable and if the activity will continue once the incentives disappear. Next week may provide more information, though the picture won’t be clear until there are no more potential airdrops.","Flagship Ethereum conference <a href=\"https:\/\/www.theblock.pro\/news\/post\/214228\/weve-never-done-anything-to-this-scale-before-ethdenver-founder-says\" data-v-f87c67ca=\"\">ETHDenver<\/a> kicks off this week. Following a hackathon, the main event will run from March 2 to March 5.","Jesse Pollack, Coinbase’s senior director of engineering and head of protocols, will be speaking at the conference. He’ll likely focus on the exchange’s recent testnet launch of its Layer 2 network Base.","ZkSync’s Head of Engineering Anthony Rose will be talking about zkEVMs, which are zero-knowledge proof-based Layer 2 networks that are Ethereum-compatible. Obol Labs will be talking about its distributed ledger technology, which is being <a href=\"https:\/\/www.theblock.co\/post\/213409\/obol-to-bring-distributed-validators-to-ethereum-this-year\" data-v-f87c67ca=\"\">slowly rolled out<\/a> this year.&nbsp;","Other talks will include decentralizing social media and upcoming Ethereum withdrawals.","Former FTX CEO Sam Bankman-Fried has asked the court to delay a deadline for him to propose bail terms amid a current dispute. He wants the deadline pushed back to March 3.&nbsp;","The dispute comes as prosecutors have urged the court to further restrict his bail terms regarding VPN usage. Bankman-Fried requested more time to find a technology expert to educate the court. He will also be filing a proposal for new bail conditions.","Bankman-Fried is awaiting an October trial in the U.S. District Court for the Southern District of New York. He was hit with four new charges last week, including bank fraud, when the court unsealed a superseding indictment in the case.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dune","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club NFT","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"’s Head of Engineering Anthony Rose","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Degenz Finance","content":"ORGANIZATION"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$240 million","content":"MONEY"},{"type":"Jesse Pollack","content":"PERSON"},{"type":"Alameda","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"The Block’s Data Dashboard","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"VPN","content":"ORGANIZATION"},{"type":"the Southern District of New York","content":"ORGANIZATION"},{"type":"March 5","content":"DATE"},{"type":"October","content":"DATE"},{"type":"$10 million","content":"MONEY"},{"type":"March 3","content":"DATE"},{"type":"March 2","content":"DATE"}],"hashtag":["BLUR","ETHEREUM","FTX","OPENSEA","SAM BANKMAN-FRIED"],"authors":["Tim Copeland","The Block"]}