{"summary":"The Block&#x27;s Frank Chaparro chats with Brett Harrison, president of FTX.US.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/116513\/brett-harrison-of-ftx-us-on-challenging-robinhood-and-coinbase-while-reshaping-market-structure","publishDate":"2021-09-03T14:41:17","id":6265,"type":null,"title":"Brett Harrison of FTX.US on challenging Robinhood and Coinbase while reshaping market structure","category":["PODCASTS"],"content":["Episode <strong data-v-f87c67ca=\"\">53 <\/strong>of Season 3 of The Scoop was recorded remotely with The Block’s Frank Chaparro and Brett Harrison, President at FTX.US.","<i data-v-f87c67ca=\"\">Listen below, and subscribe to The Scoop on&nbsp;<\/i><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Apple<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Spotify<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5tZWdhcGhvbmUuZm0vdGhlYmxvY2stdGhlc2Nvb3A?sa=X&amp;ved=0CAMQ4aUDahcKEwionbSO9fbxAhUAAAAAHQAAAAAQAg\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Google Podcasts<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Stitcher<\/i><\/a><i data-v-f87c67ca=\"\">&nbsp;or wherever you listen to podcasts. Email feedback and revision requests to <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"6b1b040f080a181f2b1f030e09070408000819121b1f0445080406\">[email&nbsp;protected]<\/a>.<\/i>","<strong data-v-f87c67ca=\"\">This episode is brought to you by our sponsors&nbsp;<a href=\"http:\/\/eventussystems.com\/\" data-v-f87c67ca=\"\">Eventus<\/a>,&nbsp;<a href=\"http:\/\/kraken.com\/scoop\" data-v-f87c67ca=\"\">Kraken<\/a>, and&nbsp;<a href=\"https:\/\/www.exodus.com\/\" data-v-f87c67ca=\"\">Exodus<\/a><\/strong>","<em data-v-f87c67ca=\"\">Eventus is the leading global provider of multi-asset class trade surveillance, transaction monitoring and market risk solutions. Eventus offers a powerful, award-winning trade surveillance platform that is easy to deploy, customize and operate. Eventus is proven in the most complex, high-volume and real-time environments and supports many of the industry’s leading crypto exchanges including Coinbase, Gemini, ErisX and OSL. The company’s rapidly growing client base relies on Eventus’ responsive support and product development teams to overcome its most pressing regulatory challenges.<\/em>","<strong data-v-f87c67ca=\"\">About Kraken<br data-v-f87c67ca=\"\">\n<\/strong><em data-v-f87c67ca=\"\">Whether you’re an experienced crypto trader or just starting out, Kraken has the tools to help you achieve financial freedom. With 50+ cryptocurrencies to choose from, industry-leading security and a wide variety of features to suit any investing strategy, Kraken puts the power in your hands to buy, sell and trade digital assets. Visit&nbsp;<\/em><a href=\"http:\/\/kraken.com\/scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Kraken.com<\/em><\/a><em data-v-f87c67ca=\"\">&nbsp;to get started today.<\/em>","<strong data-v-f87c67ca=\"\">About Exodus<br data-v-f87c67ca=\"\">\n<\/strong><em data-v-f87c67ca=\"\">Exodus is leading the world out of traditional finance by building beautiful and user-friendly crypto products. Forget having to learn the nuances of different cryptocurrencies. Exodus is designed for everyone and hides the complex details behind a beautiful and intuitive interface.<\/em>","&nbsp;","<span data-v-f87c67ca=\"\">FTX.US President Brett Harrison wants the company to be the next Robinhood, and he says they’re listening to every customer's comments to expand their user base and untangle the complexities of building an exchange.<\/span>","<span data-v-f87c67ca=\"\">“The retail user base wants to be heard,\" said Harrison.<\/span>","<span data-v-f87c67ca=\"\">On this episode of The Scoop, Brett Harrison took a break from coding FTX.US to join host Frank Chaparro for a discussion on how the company is expanding its user base and the company's planned entrance into crypto derivatives.<\/span>","<span data-v-f87c67ca=\"\">Unlike FTX, which is a global business and closed its Series A round of funding in July to the tune of an $18 billion valuation, FTX.US is focused exclusively on the US market. FTX.US, however, stands to benefit from its namesake’s most recent round of funding, of which Harrison said FTX will be allocating an undisclosed portion toward the US business. <\/span>","<span data-v-f87c67ca=\"\">But Harrison noted that the US arm may eventually pursue its own rounds of funding. <\/span>\"I think it's also very possible that sometime in the not too distant future we do a separate raise for us.<i data-v-f87c67ca=\"\">\"<\/i>","<span data-v-f87c67ca=\"\">Acknowledging a slump in the rebranding of Blockfolio to FTX.US (FTX acquired Blockfolio back in August of 2020), Harrison explained that some of that capital for FTX.US will be devoted to hiring, with their largest headcount in customer service and compliance. <\/span>","<span data-v-f87c67ca=\"\">Harrison also noted that the company is pursuing engineering hires strategically to keep operations lean and maintain a low cost of doing business. <\/span>\"Sometimes if you're dealing with some huge existing company, you can get lost and you might not get that personal user experience. And maybe that's another place in which we can outcompete a lot of our potential competitors.\"","<span data-v-f87c67ca=\"\">FTX.US is also focusing on M&amp;A, with an eye to expand its suite of products next year and prepare to go head-to-head with the likes of publicly traded companies like Coinbase and Robinhood. <\/span>","<span data-v-f87c67ca=\"\">As Harrison put it: \"I<\/span>t needs to have all the things that they want to trade.\" <span data-v-f87c67ca=\"\">This includes the recent inroads FTX.US has made to unlocking derivatives, which Harrison explained its US arm cannot offer without a Commodity Futures Trading Commission (CFTC) license. <\/span>","<span data-v-f87c67ca=\"\">But the company has never shied from pushing the needle on regulation and wants to keep lines of direct communication with regulatory bodies, according to Harrison.<\/span>","\"We need to engage [regulatory bodies] in an ongoing way, and so in the cases that we've done that been doing that we've had very positive experiences.\" Earlier this week, <span data-v-f87c67ca=\"\">FTX.US announced the acquisition of the long-running crypto derivatives exchange<\/span><span data-v-f87c67ca=\"\"><a href=\"https:\/\/www.theblockcrypto.com\/post\/116134\/ftx-us-acquires-crypto-derivatives-exchange-ledgerx\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"> LedgerX<\/a> and the firm has previously <a href=\"https:\/\/www.theblockcrypto.com\/post\/116189\/ftx-us-met-with-the-cftcs-leadership-in-the-run-up-to-its-ledgerx-acquisition-announcement\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">held meetings with CFTC leaders<\/a>.<\/span>","<span data-v-f87c67ca=\"\">“For something like FTX, there's really one player and it's FTX,\" said Harrison. \"We hold the money, we have the matching engine, we do the clearing, we do the settlements, we have the market data, the market is all free, all the connections are free, the API is free.”&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/i><br data-v-f87c67ca=\"\">\n<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$18 billion","content":"MONEY"},{"type":"Harrison","content":"PERSON"},{"type":"Google","content":"ORGANIZATION"},{"type":"The Scoop","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"August of 2020","content":"DATE"},{"type":"Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"OSL","content":"ORGANIZATION"},{"type":"Spotify","content":"LOCATION"},{"type":"Blockfolio","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Gemini","content":"LOCATION"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"December 2022","content":"DATE"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Brett Harrison","content":"PERSON"},{"type":"Michael McCaffrey","content":"PERSON"},{"type":"API","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}