{"summary":"Nouns DAO has been forced to redo its planned 100 ETH ($123,000) donation to ZachXBT after the initial proposal was mysteriously canceled.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193433\/nouns-dao-123k-donation-to-zachxbt-scrapped-vote-to-be-repeated","publishDate":"2022-12-08T16:40:24","id":6266,"type":null,"title":"Nouns DAO $123K donation to ZachXBT blocked, vote to be repeated","category":["CRYPTO ECOSYSTEMS"],"content":["A Nouns DAO’s plan to donate 100 ETH ($123,000) to ZachXBT has unexpectedly been called off, after the on-chain proposal to do so was canceled.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe identity of the person responsible for doing so is still unknown. The wallet <a href=\"https:\/\/etherscan.io\/address\/0x5089c25a8b2258f21e4ab311a4c91404e7d771b5\" data-v-f87c67ca=\"\">address<\/a> responsible for canceling the already finalized proposal only has three transactions in its history.","Nouns DAO will have to repeat the process following this latest development. This incident does, however, raise the question of how someone was able to cancel a finalized DAO governance proposal.","<a href=\"https:\/\/www.theblock.co\/post\/193256\/nouns-dao-donates-to-zachxbt\" data-v-f87c67ca=\"\">The Block reported<\/a> earlier today that the Nouns DAO community voted in favor of a proposal to reward on-chain sleuth ZachXBT with 100 ETH. ZachXBT is a pseudonymous Twitter personality whose work exposes fraudulent activities in the crypto space. The Nouns DAO donation was supposed to be a retroactive reward for ZachXBT’s efforts in exposing crypto scammers.","DAO member “Noun 40” filed the proposal. Noun 40 is the persona of Bitwise Asset Management Co-founder Hong Kim. The DAO voted on the proposal with 90% of participants in favor of the planned donation. All that was left was for the proposal to be executed and the funds sent to ZachXBT.","The issue stems from the fact that Kim delegated his tokens to House of Nouns, the DAO’s governance client, before the vote was executed. By so doing, Kim lost voting power and this enabled someone to <a href=\"https:\/\/etherscan.io\/tx\/0xd77c47a5cfeefd968aa9018e12321d5107156d02a57159a8184a72a0a6faf5cd\" data-v-f87c67ca=\"\">cancel<\/a> the proposal.","This cancellation of an already finalized vote is due to a quirk in the way the Nouns DAO governance works. It allows anyone to cancel a proposal if the address responsible for filing the proposal gives up its voting power. Nouns DAO has this quirk because it is a fork of the Compound DAO governance which uses this feature as an anti-spam measure.","Nouns DAO now has to repeat the process with another governance vote. “Assuming the vote passes as it did before — a near certainty — the funds will be delivered in about a week, once voting ends,” House of Nouns tweeted on Thursday.","The new vote will commence on Dec. 10, according to <a href=\"https:\/\/nouns.wtf\/vote\/184\" data-v-f87c67ca=\"\">details<\/a> on the DAO’s voting page. Kim also filed the proposal and acknowledged the mistake that led to it being canceled the first time around.","The DAO will transfer the funds from its $35 million treasury to an address labeled zachxbt.eth, if all goes as planned this time.","ZachXBT previously stated that the funds may remain unspent for a while or may be used to hire an intern.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Dec. 10","content":"DATE"},{"type":"” House of Nouns","content":"ORGANIZATION"},{"type":"$35 million","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$123,000","content":"MONEY"},{"type":"Kim","content":"PERSON"},{"type":"House of Nouns","content":"ORGANIZATION"},{"type":"Hong Kim","content":"LOCATION"},{"type":"Bitwise Asset Management","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Nouns DAO","content":"ORGANIZATION"}],"hashtag":["DAOS","GOVERNANCE VOTES"],"authors":["Osato Avan-Nomayo","The Block"]}