{"summary":"The European Commission will &quot;soon&quot; come out with a legislative proposal on a digital euro, European Central Bank President Christine Lagarde said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/183632\/eu-commission-propose-legislation-digital-euro","publishDate":"2022-11-07T04:35:03","id":627,"type":null,"title":"EU Commission set to propose legislation for digital euro","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">The European Commission will \"soon\" come out with a legislative proposal on a digital euro, European Central Bank President Christine Lagarde said in a video statement at&nbsp;the \"Towards a legislative framework enabling a digital euro for citizens and businesses\" conference.<\/span>","<span data-v-f87c67ca=\"\">“The timely adoption of a legal framework for the digital euro would give all stakeholders the necessary legal certainty to prepare for its possible introduction and send a strong signal of political support,” Lagarde said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I'm very much looking forward to the legislative proposal for establishing a digital Euro, which the European Commission will propose shortly,” she added.<\/span>","<span data-v-f87c67ca=\"\">The European Central Bank's digital euro project is centered around making central bank money digitally available. It launched an investigation into developing a central bank digital currency in 2021 and sought external opinions on the development of the digital euro, with public consultations, from April to June.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The two-year examination of the digital euro will conclude in September 2023, along with an indication of whether the European Central Bank will decide to launch a central bank digital currency.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lagarde","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"June","content":"DATE"},{"type":"European Central Bank","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Christine Lagarde","content":"PERSON"},{"type":"September 2023","content":"DATE"},{"type":"European Commission","content":"ORGANIZATION"},{"type":"Euro","content":"ORGANIZATION"},{"type":"April","content":"DATE"}],"hashtag":["ECB"],"authors":["Inbar Preiss","The Block"]}