{"summary":"The world&#x27;s biggest crypto exchange is not registered to operate in Canada&#x27;s Ontario province, despite its recent announcements.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/128831\/ontario-securities-regulator-slams-binance-after-crypto-exchange-claims-it-can-continue-operating-there","publishDate":"2021-12-30T15:11:28","id":6275,"type":null,"title":"Ontario securities regulator slams Binance after crypto exchange claims it can continue operating there","category":["EXCHANGES"],"content":["Binance users in Canada are getting mixed signals on whether the exchange can or cannot operate in the country.","On December 29, Binance users in the province of Ontario began flagging <a href=\"https:\/\/pbs.twimg.com\/media\/FHzhNXxXMAs47fU.png\" data-v-f87c67ca=\"\">updates<\/a> they had been receiving from the exchange.&nbsp;The updates, which representatives for Binance have confirmed as authentic to The Block, say that they no longer need to close accounts by the end of December.&nbsp;","After being contacted by The Block regarding those updates, the Ontario Securities Commission <a href=\"https:\/\/www.osc.ca\/en\/news-events\/news\/binance-not-registered-ontario\" data-v-f87c67ca=\"\">released<\/a> a statement saying in no uncertain terms: \"Binance is not registered in Ontario.\"&nbsp;","\"This is unacceptable,\" the announcement continued. \"No entity in the Binance group of companies holds any form of securities registration in Ontario.\"","Binance based its statement on its <a href=\"https:\/\/www10.fintrac-canafe.gc.ca\/msb-esm\/public\/detailed-information\/msb-details\/7b226d73624f72674e756d626572223a3136363636312c227072696d617279536561726368223a7b226f72674e616d65223a2262696e616e6365222c2273656172636854797065223a317d7d\/\" data-v-f87c67ca=\"\">recent registration<\/a> as a money services business with Canada's anti-money laundering authority, FinTrac. FinTrac is a federal MSB regulator, unlike in the US, where most crypto exchanges operate on the basis of MSB registrations with various state overseers.","In its announcement, Binance referred to \"ongoing and positive cooperation with Canadian regulators.\" The firm further said its MSB license \"allows us to continue our operations in Canada and resume business in Ontario while we pursue full registration.\"","The meaning of \"full registration\" was unclear at the time. A representative for Binance told The Block that \"we are making an application with IIROC to be a securities and derivatives dealer in Canada.\" The IIROC is the Investment Industry Regulatory Organization of Canada, a self-regulatory organization.","Following the publication of this article, a representative from Binance told The Block:","“Unfortunately, there has been a miscommunication. Earlier in the week we notified users in Ontario that they did not need to close their accounts by December 31, 2021 following discussions with the Investment Industry Regulatory Organization of Canada and the Alberta Securities Commission regarding registration across Canada. However, we did not meet directly with the Ontario Securities Commission about our intentions, which was clearly an error that we are correcting. We will provide updated guidance to users as soon as possible.\"","Binance had <a href=\"https:\/\/www.theblockcrypto.com\/linked\/109736\/binance-blocks-ontario-canada-users\" data-v-f87c67ca=\"\">taken steps to end access in Ontario<\/a> in June of this year, a reaction to a Canada-wide policy of restricting crypto trading to exchanges registered with securities authorities.","The Canadian Securities Administrators — which unites provincial securities authorities, the biggest of which is the Ontario Securities Commission — <a href=\"https:\/\/www.theblockcrypto.com\/post\/106206\/with-poloniex-action-canadas-securities-regulators-get-serious-about-crypto-exchange-oversight\" data-v-f87c67ca=\"\">began cracking down<\/a> on custodial exchanges earlier this year. The operative principle is that custodial accounts represent securities agreements with crypto exchanges, even if the cryptocurrencies involved are not necessarily securities.&nbsp;","A <a href=\"https:\/\/www.theblockcrypto.com\/linked\/127262\/binance-singapore-halts-licensing-push-amid-investment-in-hg-exchange\" data-v-f87c67ca=\"\">similar controversy<\/a> played out this month in Singapore. In that locale, Binance had operated both through its global exchange and via a Binance Singapore affiliate, neither of which had the necessary registrations to offer crypto trading.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"Investment Industry Regulatory Organization of Canada","content":"ORGANIZATION"},{"type":"June of this year","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Alberta Securities Commission","content":"ORGANIZATION"},{"type":"Canadian Securities Administrators","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"MSB","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Ontario","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"December 31, 2021","content":"DATE"},{"type":"December 29","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"Ontario Securities Commission","content":"ORGANIZATION"}],"hashtag":["BINANCE"],"authors":["Kollen Post","The Block"]}