{"summary":"Binance&#x27;s volume dominance also accompanies news that billions of dollars worth of coins and tokens are flowing out of centralized exchanges.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/184822\/binance-71-percent-spot-crypto-market","publishDate":"2022-11-09T11:11:53","id":6276,"type":null,"title":"Binance spot volume dominance jumps to 71% amid FTX freeze","category":["EXCHANGES"],"content":["After turning over more than $51.3 billion in volume over the past 24 hours, crypto exchange Binance currently holds 71% of the spot market for cryptocurrency trading, according to data from The Block Research.","That's up from just over 55% of the spot crypto market on Oct. 24.","Its next closest competitor, Coinbase, has 9% of the market with over $6.3 billion in 24-hour volume.","FTX, which has paused withdrawals and has signed a letter of intent to sell its non-US assets to Binance, holds a 6% market share with less than $4.5 billion in volume.","<span data-v-f87c67ca=\"\">Binance accounts for 71% of the crypto spot market. Source: The Block Research<\/span>","&nbsp;","The company's increased dominance over the spot crypto market coincides with the high-profile news that CEO Changpeng \"CZ\" Zhao signed a letter of intent to purchase embattled crypto exchange FTX after the exchange paused withdrawals amid a liquidity crunch. The exact extent of FTX's financial woes is currently unknown.","Should Binance's acquisition of FTX's non-US assets go through, its share of the overall crypto market volume would presumably increase further. Binance's volume dominance also accompanies news that billions of dollars worth of coins and tokens are <a href=\"https:\/\/www.theblock.co\/post\/184679\/billions-of-dollars-in-crypto-pouring-out-of-exchanges-following-ftx-fiasco\" data-v-f87c67ca=\"\">flowing<\/a> out of centralized exchanges — roughly $1 billion from Coinbase, alone.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"6%","content":"PERCENT"},{"type":"9%","content":"PERCENT"},{"type":"Binance","content":"LOCATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"55%","content":"PERCENT"},{"type":"$51.3 billion","content":"MONEY"},{"type":"71%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$4.5 billion","content":"MONEY"},{"type":"Alameda","content":"LOCATION"},{"type":"$6.3 billion","content":"MONEY"},{"type":"Oct. 24","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"}],"hashtag":["BINANCE","FTX"],"authors":["Adam James","The Block"]}