{"summary":"Avalanche’s leading decentralized exchange Trader Joe is launching on Ethereum scaling platform Arbitrum.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/191582\/avalanche-dex-trader-joe-is-deploying-on-arbitrum","publishDate":"2022-12-01T17:28:08","id":6288,"type":null,"title":"Avalanche DEX Trader Joe is deploying on Arbitrum","category":["DEFI"],"content":["Decentralized exchange Trader Joe is launching on the Ethereum scaling chain Arbitrum.","The move represents Trader Joe’s first deployment on a new chain since it launched in 2021. Trader Joe has the highest total trading volume across all applications on Avalanche, but has seen significant decreases since June, <a href=\"https:\/\/defillama.com\/dexs\/chains\/avalanche\" data-v-f87c67ca=\"\">according to DeFiLlama.<\/a>","Trader Joe will deploy on Arbitrum’s testnet in the coming days, with a mainnet launch expected early next year.","Trader Joe's Arbitrum debut will be limited in scope. Features such as its native token JOE, lending platform Banker Joe, and NFT marketplace Joepegs will only be available on <a href=\"https:\/\/joecontent.substack.com\/p\/trader-joe-to-deploy-onto-arbitrum\" data-v-f87c67ca=\"\">Avalanche.<\/a> Last week, it launched a <a href=\"https:\/\/joecontent.substack.com\/p\/trader-joe-presents-liquidity-book\" data-v-f87c67ca=\"\">new technology<\/a> called the Liquidity Book Automated Market Maker (AMM), which it claims is more efficient than traditional decentralized exchange models. Liquidity Book is the only other feature apart from trading that will be available on Arbitrum.","There are multiple Layer 2 networks, including Arbitrum, that are built on top of Ethereum. Arbitrum is the largest chain by market capitalization, <a href=\"https:\/\/l2beat.com\/scaling\/tvl\/\" data-v-f87c67ca=\"\">according to L2beat.<\/a>&nbsp;","Trader Joe's integration with Arbitrum follows a trend of other decentralized finance (DeFi) protocols deploying on multiple chains. Other DeFi protocols such as <a href=\"https:\/\/www.theblock.co\/post\/177141\/decentralized-exchange-protocol-uniswap-v3-is-deploying-on-zksync-2-0\" data-v-f87c67ca=\"\">Uniswap<\/a> and <a href=\"https:\/\/www.theblock.co\/linked\/138018\/aave-set-to-launch-third-version-of-its-defi-protocol-across-six-networks\" data-v-f87c67ca=\"\">Aave<\/a> have deployed on several chains over the past year, with the rationale being that more chains will result in reaching a greater number of users.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Joe","content":"PERSON"},{"type":"DeFiLlama","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Joe’s","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"June","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Liquidity Book Automated Market Maker (AMM","content":"ORGANIZATION"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}