{"summary":"The Hong Kong Monetary Authority said it expects lenders to work with properly licensed crypto firms to help them open bank accounts.\nThe news comes after authorities promised guidelines on a new licensing regime for crypto exchanges in May.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228743\/hong-kong-crypto-bank-accounts","publishDate":"2023-04-28T02:37:31","id":629,"type":null,"title":"Hong Kong to local banks: play nice with crypto firms","category":["Policy"],"content":["Regulators in Hong Kong are urging banks to provide much-needed services to crypto companies as part of a multi-faceted push to establish the city as an industry hub.","The Hong Kong Monetary Authority said it expects that “regulated <a href=\"https:\/\/www.hkma.gov.hk\/eng\/news-and-media\/insight\/2023\/04\/20230427\/\" data-v-f87c67ca=\"\">virtual asset service providers (VASPs) will be able to successfully apply for a bank account<\/a> through a reasonable process,” in a blog post published April 27 and signed by Arthur Yuen, the watchdog’s deputy chief executive.","In a circular sent later the same day, the HKMA said <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-04-28\/hong-kong-seeks-to-help-crypto-firms-escape-their-exile-from-the-banking-sector\" data-v-f87c67ca=\"\">banks should support licensed crypto firms<\/a> with “their legitimate need for bank accounts,” according to a Bloomberg report. &nbsp;","The updates come after Hong Kong’s <a href=\"https:\/\/www.theblock.co\/post\/228567\/hong-kong-crypto-exchange-license-regulation\" data-v-f87c67ca=\"\">Securities and Futures Commission signalled yesterday<\/a> that it would publish guidelines on its licensing regime for crypto exchanges in May.","It’s all part of a push to establish Hong Kong as a crypto-friendly jurisdiction, even as other regulators in other major financial hubs crack down on the sector. In the U.S., authorities have been piling pressure on the crypto industry — in part by shuttering lenders, such as Signature Bank and Silvergate Banks, that had worked closely with startups in the space.&nbsp; While in Europe, the lobby group CryptoUK wrote to the government last month to complain about <a href=\"https:\/\/cryptouk.io\/wp-content\/uploads\/2023\/03\/HMT-Andrew-Griffith-Letter-Banks-Ban-Transactions-20-March-2023.pdf\" data-v-f87c67ca=\"\">British banks blocking transfers to crypto exchanges<\/a>.&nbsp;","The Block reported on Feb. 20 that <a href=\"https:\/\/www.theblock.co\/post\/228567\/hong-kong-crypto-exchange-license-regulation\" data-v-f87c67ca=\"\">Hong Kong was planning to lift a ban on retail trading of cryptocurrencies<\/a>. The SFC said at the time that it was looking “to strike a better balance between investor protection and market development.”","In the blog post published yesterday, Yuen said, “In recent months we have actively discussed with banks and reminded them that there is no legal and regulatory requirement prohibiting banks in Hong Kong from providing banking services to virtual assets (VA) related entities.”"],"hashtag":["ASIAN REGULATION"]}