{"summary":"Binance has launched a copy trading feature specifically for futures markets.\nThe feature allows users to replicate strategies of experienced traders.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/255396\/binance-introduces-copy-trading-feature-for-futures-markets","publishDate":"2023-10-09T08:56:04","id":63,"type":null,"title":"Binance introduces copy trading feature for futures markets","category":["Exchanges"],"content":["Crypto exchange Binance has introduced a copy trading feature for futures products in selected markets. This addition is aimed at simplifying the trading process by allowing users to emulate the strategies and portfolios of experienced or “lead” traders.","Users registered with Binance can act as both copy and lead traders. When a copy trader opts to copy the trades of a lead trader, the latter receives a 10% profit share.","Copy traders can follow up to 10 lead traders simultaneously and have the discretion to set their own risk preferences — such as take profit\/stop loss, leverage levels, and margin configurations, as outlined by the exchange.","In a statement, Binance highlighted the potential of copy trading feature to enhance engagement within its trading community. \"We believe copy trading lowers the barriers to entry into crypto and can help improve social engagement within the community,” the exchange’s spokesperson remarked.","The exchange declined to comment to specify which markets would incorporate copy trading. The exchange spokesperson said that Binance continually reviews its products, emphasizing its commitment to regulatory adherence.","“Binance is constantly evaluating its product offerings as regulations and regulatory guidance develop. This is why availability of certain products varies in different regions - copy trading is only available in selected markets and we will continue to review our product offerings to ensure they remain welcomed by both users and regulators,” the spokesperson added.","Binance is the world’s largest cryptocurrency exchange by trading volume. However, it has also been one of the most controversial exchanges, having faced regulatory issues in multiple jurisdictions as previously reported.","Some regulatory bodies in various countries have expressed concerns, suggesting that Binance might not have implemented sufficient measures to prevent its platform from being used for unlawful financial activities. In response, Binance has repeatedly stated that it is committed to meeting all relevant legal and regulatory standards.","The U.S. Securities and Exchange Commission previously filed a legal <a href=\"https:\/\/www.theblock.co\/post\/233154\/sec-files-suit-against-binance\" data-v-f87c67ca=\"\">complaint<\/a><span data-v-f87c67ca=\"\"> action against Binance, claiming that the firm provided unregistered securities to U.S. clients through its <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248351\/bnb-bnb-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bnb-icon2_2x.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BNB<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +1.19%\n    <\/span><\/a> <!----><\/span> token and the associated BUSD stablecoin.<\/span>","Beyond this, Binance encountered regulatory challenges in various countries like <a href=\"https:\/\/www.theblock.co\/post\/230689\/bitcoin-binance-pulling-out-of-canada\" data-v-f87c67ca=\"\">Canada<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/235084\/binance-exits-the-netherlands\" data-v-f87c67ca=\"\">the Netherlands<\/a>, and others. As a result, Binance has had to either limit or entirely <a href=\"https:\/\/www.theblock.co\/post\/230689\/bitcoin-binance-pulling-out-of-canadahttps:\/\/www.theblock.co\/post\/230689\/bitcoin-binance-pulling-out-of-canada\" data-v-f87c67ca=\"\">pull out<\/a> its services in some of these regions."],"hashtag":["BINANCE"]}