{"summary":"A leader in the SEC&#x27;s internal investigations has left the agency after over 38 years in federal service. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193669\/nicholas-padilla-sec-internal-investigator-leaves","publishDate":"2022-12-09T12:41:17","id":6300,"type":null,"title":"SEC internal investigator leaves a month after raising staff retention issues","category":["POLICY"],"content":["The Securities and Exchange Commission has lost its acting inspector general, a month after he raised problems with the agency's staff retention under Chair Gary Gensler.","Nicholas Padilla has left as inspector general, where he led investigations, Bloomberg Law <a href=\"https:\/\/news.bloomberglaw.com\/securities-law\/sec-watchdog-out-two-months-after-criticizing-its-rulemaking\" data-v-f87c67ca=\"\">reported<\/a>. Though his <a href=\"https:\/\/www.sec.gov\/oig\/Article\/inspector_general_admin_bios_nicholas.html\" data-v-f87c67ca=\"\">page<\/a> on the SEC's site has not been updated, representatives for the agency confirmed that he left in November.&nbsp;","According to the SEC's representative, he had reached the statutory maximum of his service, which his page notes as entailing more than 38 years in various federal and military positions. Padilla could not be reached for comment.&nbsp;","In October, Padilla <a href=\"https:\/\/www.sec.gov\/files\/inspector-generals-statement-sec-mgmt-and-perf-challenges-october-2022.pdf\" data-v-f87c67ca=\"\">reported<\/a> to Gensler on the SEC's loss of staff. \"The SEC seems to be facing challenges to its retention efforts,\" the report reads, noting in particular the pace of the SEC's rulemaking and lack of policy communication under Gensler as a source of strife.&nbsp;","\"His departure had absolutely nothing to do with any of the substantive work of the Office of the Inspector General,\" a representative for the SEC said.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gary Gensler","content":"PERSON"},{"type":"Padilla","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Nicholas Padilla","content":"PERSON"},{"type":"Bloomberg Law","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"November","content":"DATE"}],"hashtag":["SEC"],"authors":["Kollen Post","The Block"]}