{"summary":"Infrastructure company Alchemy is now worth $10.2 billion after a fundraise co-led by private equity giant Silver Lake.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/133397\/alchemy-raises-at-10-2-billion-valuation-in-round-led-by-silver-lake","publishDate":"2022-02-08T09:00:16","id":6302,"type":null,"title":"Alchemy raises at $10.2 billion valuation in round led by Silver Lake","category":["THE BLOCK"],"content":["Alchemy, the crypto infrastructure company powering a wide-range of DeFi applications and NFT platforms, has nabbed a $10.2 billion valuation in a funding round that added $200 million to its coffers,&nbsp;the company announced Tuesday.&nbsp;","Led by Nikil Viswanathan and Joe Lau, the firm's latest raise comes just a few months after a Series C <a href=\"https:\/\/www.theblockcrypto.com\/post\/122318\/blockchain-infrastructure-provider-alchemy-clinches-unicorn-status-in-250-million-fundraise-led-by-a16z\" data-v-f87c67ca=\"\">round<\/a> that valued the firm at $3.5 billion — yet another example of the frenzied pace of fundraising in private crypto markets. Unlike consumer-facing firms like FTX and OpenSea, which both became unicorns last year, Alchemy sits in the background of well-known crypto firms by offering APIs that enable them to build blockchain-powered systems.&nbsp;","Notably, private equity giant Silver Lake joined the cap table in this latest round. The <a href=\"https:\/\/www.silverlake.com\/overview\" data-v-f87c67ca=\"\">firm<\/a> — which has more than $90 billion in assets — led the investment alongside Lightspeed Venture Partners.&nbsp;","Historically, Alchemy's clientele have been comprised of crypto-native firms like OpenSea, Dapper Labs, and Axie Infinity, but its future growth — and current valuation — relies on newcomers to the crypto space.&nbsp;","\"We think Web3 is in the first inning,\" said Viswanathan. He added&nbsp;that the firm's growth has been buoyed not just by the growth of its crypto clients but by a shift in mindset among non-crypto firms, which are no longer simply experimenting with Web3 projects.&nbsp;","\"They want to integrate Web3 into the core of their product,\" he said.&nbsp;","The firm has yet to tap into the reserves it has built from previous raises, but said the new raise will give it the bandwidth to put more resources into its <a href=\"https:\/\/www.web3.university\" data-v-f87c67ca=\"\">Web3 University<\/a> and its new free-tier for new developers in the space. The hope for the latter initiative is that offering its developer tools for free to new entrants will help them grow into larger clients that can afford their premium services. Alchemy has also been courting large Fortune 500 companies, which have been lured into crypto by the rise of non-fungible tokens.&nbsp;","Viswanathan said that the launch of NFT APIs, which effectively make it easier for companies to bridge their existing apps to the NFT space, resulted in an influx of new clients numbering in the thousands.&nbsp;","\"We thought it would be ten to fifteen,\" Viswanathan said.&nbsp;","The influx of capital will help the company scale to reach new clients as well as double down on its \"aforementioned initiatives,\" according to Lau.&nbsp;\"The second thing is crypto is not just a US thing but a global thing so we are expanding.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Axie Infinity","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Nikil Viswanathan","content":"PERSON"},{"type":"$90 billion","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Lau","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$10.2 billion","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"Alchemy","content":"ORGANIZATION"},{"type":"Lightspeed Venture Partners","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"$200 million","content":"MONEY"},{"type":"Web3 University","content":"ORGANIZATION"},{"type":"$3.5 billion","content":"MONEY"},{"type":"Joe Lau","content":"PERSON"},{"type":"Viswanathan","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}