{"summary":"North Korean APT Group led a massive NFT phishing campaign this year with one wallet reportedly stealing more than 1,000 NFTs from victims.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/197835\/suspected-north-korean-hacker-made-365000-from-1055-stolen-nfts-report","publishDate":"2022-12-24T12:23:08","id":6308,"type":null,"title":"Suspected North Korean hacker made $365,000 from 1,055 stolen NFTs: Report","category":["METAVERSE & NFT"],"content":["A wallet address associated with a suspected North Korean APT Group stole more than 1,000 NFTs from victims of phishing attacks and made 300 ETH ($365,000) from their sale, according to a report by blockchain security firm SlowMist.","APT stands for advanced persistent threat, cyber criminals who access internet networks and can remain undetected for long periods to steal data. These entities use various attack vectors such as phishing, and a few of them are reportedly sponsored by the North Korean government.","The SlowMist <a href=\"https:\/\/slowmist.medium.com\/slowmist-our-in-depth-investigation-of-north-korean-apts-large-scale-phishing-attack-on-nft-users-362117600519\" data-v-f87c67ca=\"\">report<\/a> said that North Korean APT Groups have been leading a massive NFT phishing campaign. Phishing is an attack method used by hackers in which they pretend to be reputable organizations in order to trick victims into revealing sensitive information. In the NFT space, such attacks can be modified with hackers posing as known NFT projects or marketplaces to deceive victims into signing malicious transactions that can lead to losing valuable NFTs from their wallets.","“The North Korean APT group targeted Crypto and NFT users with a phishing campaign using nearly 500 different domain names,” the report said. SlowMist identified one wallet address associated with the group that had stolen 1,055 NFTs. The wallet sold the items for 300 ETH ($365,000).","Several “blue chip” NFTs have been stolen in multiple phishing attacks this year. Hackers <a href=\"https:\/\/www.theblock.co\/post\/148750\/hackers-steal-29-moonbirds-valued-at-1-5-million-in-nft-phishing-attack\" data-v-f87c67ca=\"\">stole 29 Moonbirds<\/a> in May, valued at $1.5 million at the time. Before that, 35 NFTs including <a href=\"https:\/\/www.theblock.co\/post\/139917\/35-nfts-including-bored-apes-stolen-via-phishing-attack-in-last-week-alone\" data-v-f87c67ca=\"\">Bored Apes were stolen<\/a> in phishing attacks within a one-week spell in March.","The coordinated phishing attacks on NFT holders by North Korean hackers are part of a larger trend. Cybercrime syndicates reportedly sponsored by Pyongyang have also been targeting crypto exchanges and other cryptocurrency-related businesses. These groups have been linked with several large-scale crypto exchange platform hacks.","The UN reported in 2019 that North Korean crypto hackers had <a href=\"https:\/\/www.theblock.co\/linked\/34893\/crypto-hacks-have-helped-north-korea-collect-2b-to-fund-its-nuclear-programs-un-report\" data-v-f87c67ca=\"\">stolen as much as $2 billion<\/a>. The funds were reportedly being used to <a href=\"https:\/\/www.theblock.co\/linked\/35662\/un-details-how-north-korea-carried-out-crypto-and-swift-hacks-to-amass-2b-to-fund-its-nuclear-programs\" data-v-f87c67ca=\"\">further the country’s nuclear program<\/a>. The U.S. government has since sanctioned Tornado Cash, a crypto mixer that was <a href=\"https:\/\/www.theblock.co\/post\/184320\/new-treasury-sanctions-link-tornado-cash-to-north-koreas-nuclear-weapons-program\" data-v-f87c67ca=\"\">reportedly being used<\/a> by these hackers to funnel their stolen funds.","U.S. officials also <a href=\"https:\/\/www.theblock.co\/post\/142478\/us-government-warns-that-north-korea-is-targeting-crypto-firms\" data-v-f87c67ca=\"\">continue to warn<\/a> that North Korean hackers have not eased up in their crypto assault. The Department of Justice in May <a href=\"https:\/\/www.theblock.co\/linked\/147188\/north-korean-it-workers-are-getting-tech-and-crypto-jobs-online-us-agencies-warn\" data-v-f87c67ca=\"\">reported<\/a> that North Korean IT workers were getting tech and crypto jobs online.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"North Korean","content":"LOCATION"},{"type":"$1.5 million","content":"MONEY"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"$365,000","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"March","content":"DATE"},{"type":"UN","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"North Korean APT Group","content":"ORGANIZATION"},{"type":"Pyongyang","content":"LOCATION"},{"type":"$2 billion","content":"MONEY"}],"hashtag":["BAYC","HACKS"],"authors":["Osato Avan-Nomayo","The Block"]}