{"summary":"Parties in Voyager’s Chapter 11 bankruptcy proceedings met today for an emergency hearing on a request to honor its corporate card payments.\nThough the sum was relatively small in the scope of the proceedings, Judge Michael Wiles made it clear the firm will have to demonstrate significant need in its interim requests for relief.\nUS Trustee attorney Richard Morris said the creditors committee will likely be formed in the “very near future.”","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/158546\/court-approves-voyager-to-pay-corporate-cards-but-clarifies-the-bar-for-interim-relief","publishDate":"2022-07-19T15:20:49","id":631,"type":null,"title":"Court approves Voyager to pay corporate cards, but clarifies the bar for interim relief","category":["Legal"],"content":["An emergency hearing took place Tuesday in Voyager's Chapter 11 proceedings, and Judge Michael Wiles made it clear the firm will have to demonstrate significant need in its interim motions.","Voyager <a href=\"https:\/\/www.theblock.co\/post\/155990\/crypto-broker-voyager-digital-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">filed<\/a> for Chapter 11 protection earlier this month after <a href=\"https:\/\/www.theblock.co\/post\/155528\/voyager-digital-suspends-withdrawals-deposits-and-trading\" data-v-f87c67ca=\"\">suspending<\/a> user activity on July 1. According to court filings and statements from the firm, it has $1.3 billion in crypto on its platform, with over $350 million in cash held at a For Benefit of Customers (FBO) account at Metropolitan Commercial Bank, in addition to a more than $650 million claim against embattled crypto hedge fund Three Arrows Capital.","Chapter 11 proceedings allow a firm to remain operational as it restructures its business to pay creditors. But reorganizing a business is a process, and keeping the lights does not always allow the luxury of time to implement a new court-ordered business plan. To mitigate this, the court will hear arguments related to interim motions granting relief for specific purposes, essentially granting the business the right to pay an expense.&nbsp;","Voyager made such a request today ahead of its next scheduled hearing on August 4. That August 4 hearing will likely discern whether Voyager is cleared to withdraw funds from the MC FBO account to<a href=\"https:\/\/www.theblock.co\/post\/157946\/voyager-asks-bankruptcy-court-to-honor-withdrawals\" data-v-f87c67ca=\"\"> honor customer withdrawals<\/a>. But today, the court dealt with a more immediate concern – whether the firm could honor its Brex corporate card payments.","Historically, the firm has paid about $300,000 a month on company cards, according to court documents. In its bankruptcy documents, the firm reported five corporate cards, but counsel said today that new information has come to light. There are 24 cards: 9 physical cards, 14 virtual cards and a single card used for travel. Altogether they amount to a balance of $76,000, a smaller sum in the context of larger bankruptcy proceedings.","Shortly after first-day proceedings, Brex informed Voyager it'd be shutting off the corporate cards due to nonpayment, but the payments firm agreed to reinstate the cards if the balance was paid.&nbsp;","Counsel for Voyager, Christine Okike of Kirkland &amp; Ellis, argued the firm needs access to the cards in order to pay critical vendors.","But Judge Wiles pushed back. In his view, Voyager failed to assess other options to pay critical vendors or open other lines of credit. The Office of the US Trustee, which appoints a creditor committee to oversee the restructuring, did not take issue with the request given how small the sum is in the scheme of the proceedings.","For that reason, Wiles granted the motion, though he clarified that at this stage in the case, motions for relief are granted to prevent immediate and irreparable harm. In the future, he said he expects a greater demonstration of need.&nbsp;","Eventually, the committee of creditors will be consulted during requests for relief. The committee is appointed by the US Trustee, and in this case, may be formed in \"the very near future,\" according to US Trustee attorney Richard Morris. Morris advised the court and parties to look out for that notice.&nbsp;"],"hashtag":[]}