{"summary":"Ethereum re-staking protocol EigenLayer outlined its schedule to initiate the second phase of its mainnet in the first half of 2024.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/263473\/eigenlayer-to-enable-staking-with-operators-of-data-availability-layer-in-h1-2024","publishDate":"2023-11-17T08:51:30","id":6310,"type":null,"title":"EigenLayer to enable staking with operators of data availability layer in H1 2024","category":["CRYPTO ECOSYSTEMS"],"content":["Ethereum re-staking protocol EigenLayer outlined its schedule to initiate the second phase of its mainnet in the first half of 2024.","This phase is expected to permit users to delegate their staked ether to operators of the <a href=\"https:\/\/www.theblock.co\/post\/246998\/eigenlayers-tvl-nears-240-million-as-it-gears-up-for-eigenworlds-nft-mint?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">data availability solution<\/a> EigenDA. The goal here is to let these operators contribute to the protocol’s security system and to allow rollups — secondary scaling solutions — to integrate it for scaling needs.","EigenLayer intends to use staked ether and other liquid staking tokens to secure additional blockchain and data scaling services such as EigenDA. The first phase of its mainnet was introduced in June.","Yesterday, EigenLayer <a href=\"https:\/\/www.blog.eigenlayer.xyz\/launch-of-the-stage-2-testnet-eigenlayer-eigenda\/\" data-v-f87c67ca=\"\">activated<\/a> this second phase on its test network to enable operator registration and commencement of EigenDA verification.","This step follows the project’s initial launch, which brought re-staking to the Ethereum mainnet with limited utility. The upcoming phase is expected to enhance this functionality.","EigenDA will be the first service to be actively validated (AVS) on EigenLayer, indicating a system that relies on re-staking and obtains validation through EigenLayer.","The deployment of EigenDA is anticipated to decrease transaction fees for rollups. This may have a positive impact on the scaling of decentralized applications, especially in segments such as decentralized gaming and social media platforms, where transaction costs have historically been a constraint.","EigenLabs, the team behind EigenLayer, <a href=\"https:\/\/www.theblock.co\/post\/222901\/eigenlayer-series-a\" data-v-f87c67ca=\"\">closed<\/a> a $50 million Series A funding round led by Blockchain Capital in March.","The total amount of value in EigenLayer’s smart contracts <a href=\"https:\/\/www.theblock.co\/post\/246998\/eigenlayers-tvl-nears-240-million-as-it-gears-up-for-eigenworlds-nft-mint?utm_source=twitter&amp;utm_medium=social\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">crossed<\/a> $240 million after the platform’s second round of deposit caps for liquid staking assets such as stETH, rETH and cbETH were filled quickly in August.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$240 million","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"June","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"the first half of 2024","content":"DATE"},{"type":"Blockchain Capital","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"},{"type":"August","content":"DATE"}],"hashtag":["DEVELOPER TOOLS","VALIDATORS"],"authors":["Vishal Chawla","The Block"]}