{"summary":"A report from Moody&#x27;s said that municipalities could save money and improve transparency by using blockchain technology.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/222055\/blockchain-tech-could-save-municipalities-money-but-adds-risks-moodys-says","publishDate":"2023-03-22T16:30:04","id":6313,"type":null,"title":"Blockchain tech could save municipalities money but adds risks, Moody&#x27;s says","category":["CRYPTO INFRASTRUCTURE"],"content":["Moody's said that municipalities can save money by using blockchain-based platforms to issue bonds and for government operations, but doing so comes with possible risks that include cybercrime and operating in regulatory uncertainty.","Municipalities might be able to cut up to 35% of administrative costs over the life cycle of a bond by one estimate, the firm said in a report published on Wednesday.","Blockchain adoption for bond issuance at the municipality level might take some time, although some projects are already underway, Moody's said. However, it added that \"several recent municipal debt sales recorded on the blockchain with parallel record-keeping represent an initial small step toward incorporating blockchain in the municipal bond issuance process.\"","The report outlines a series of pros and cons for different types of crypto-related activities for municipalities.","On the one hand, \"the immutable nature of blockchain also enhances transparency and auditability,\" allowing governments to streamline services and even enable mobile voting in some cases. On the other, that comes with potential risks, like cyber crime and \"uncertainties surrounding regulatory and legal frameworks and the future of digital assets,\" Moody's said.","Local governments have benefited from additional revenue from more and more bitcoin mining companies looking to set up shop in North America, particularly in the state of Texas.","One site built by Argo Blockchain in Dickens County \"accounted for $17 million, or 6% of the county's $283 million property tax base as of the end of 2022,\" Moody's said.","On the flip side, relying too much on revenue from mining companies is risky, considering the volatility associated with the industry and the potential environmental impacts.","The bitcoin mining industry was devastated last year as bitcoin prices declined and power costs shot up, thinning margins for companies.","\"Since crypto mining company Core Scientific filed for bankruptcy in December 2022, the up to $11 million per year the city of Denton, Texas expected to receive in a deal with the company is now in question,\" Moody's said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"6%","content":"PERCENT"},{"type":"$11 million","content":"MONEY"},{"type":"North America","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$283 million","content":"MONEY"},{"type":"Texas","content":"LOCATION"},{"type":"Moody's","content":"ORGANIZATION"},{"type":"35%","content":"PERCENT"},{"type":"December 2022","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Moody","content":"ORGANIZATION"},{"type":"Argo Blockchain","content":"PERSON"},{"type":"Denton","content":"LOCATION"},{"type":"$17 million","content":"MONEY"},{"type":"Dickens County","content":"LOCATION"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}