{"summary":"The European Central Bank (ECB) has today published a comprehensive report on digital euro, saying that it needs to be prepared to issue a digital currency if and when the need arises.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/79653\/european-central-bank-report-digital-euro","publishDate":"2020-10-02T04:55:21","id":6315,"type":null,"title":"European Central Bank publishes report on digital euro, says &#x27;we need to be ready&#x27; to issue it","category":["CENTRAL BANKS"],"content":["The European Central Bank (ECB) has today published a comprehensive report on digital euro, saying that it needs to be prepared to issue a digital currency if and when the need arises.","The <a href=\"https:\/\/www.ecb.europa.eu\/pub\/pdf\/other\/Report_on_a_digital_euro~4d7268b458.en.pdf\" data-v-f87c67ca=\"\">50-page report<\/a>, prepared by the Eurosystem High-Level Task Force on central bank digital currency (CBDC) and approved by the Governing Council, said digital euro would complement cash, not replace it.","The ECB said it has not made a decision yet on whether to issue digital currency, but \"we should be prepared to issue...should the need arise.\"","The central bank has identified four possible scenarios that would require the issuance of digital currency: An increased demand for electronic payments, a \"significant\" decline in the use of cash, the launch of global private means of payment, and \"a broad take-up of CBDCs issued by foreign central banks.\"","ECB president Christine Lagarde said Europeans are increasingly turning to digital options for spending, saving, and investing. \"This means making sure the euro is fit for the digital age. We should be prepared to issue a digital euro, should the need arise,\" she said.","A digital euro would be an electronic form of central bank money accessible to all citizens and firms, said the ECB, adding that it would improve their payment experience.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Centralized or decentralized digital euro?&nbsp;<\/strong><\/span>","As for the technical approach, the ECB said a digital euro \"can either be centralised, with all transactions recorded in the central bank's ledger, or feature some decentralisation of responsibilities to users and\/or supervised intermediaries.\" But the back-end infrastructure should be ultimately controlled by the central bank, it said.","\"Whether or not we need a digital euro is a fundamental and pressing question, and the ECB and the national central banks of the euro area are considering it together,\" said Fabio Panetta, member of the ECB's Executive Board and chair of the CBDC task force.","The ECB appears to be confident that it can overcome challenges to create a digital currency. \"A digital euro would preserve the public good that the euro provides to citizens: free access to a simple, universally accepted, risk-free and trusted means of payment. It also poses challenges, but by following appropriate strategies in the design of the digital euro the Eurosystem can address these,\" said the central bank.&nbsp;","The ECB is opening a public consultation on the report on October 12. \"Experimentation will start in parallel, without prejudice to the final decision,\" it said.","The central bank has also <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2020-10-01\/ecb-applies-for-digital-euro-trademark-amid-feasibility-study\" data-v-f87c67ca=\"\">applied to trademark<\/a> the term \"digital euro\" as it assesses its benefits and challenges.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Fabio Panetta","content":"PERSON"},{"type":"Governing Council","content":"ORGANIZATION"},{"type":"ECB","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Level Task Force","content":"ORGANIZATION"},{"type":"Christine Lagarde","content":"PERSON"},{"type":"European Central Bank (ECB","content":"ORGANIZATION"},{"type":"Executive Board","content":"ORGANIZATION"},{"type":"October 12","content":"DATE"},{"type":"euro","content":"ORGANIZATION"}],"hashtag":["ECB"],"authors":["Yogita Khatri","The Block"]}