{"summary":"Cross-chain messaging has gained a lot of attention due to Uniswap’s latest proposal to make its exchange cross-chain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/208232\/bridging-platform-connext-releases-upgrade-that-allows-developers-to-build-cross-chain-applications","publishDate":"2023-02-02T17:13:35","id":6318,"type":null,"title":"Bridging platform Connext releases upgrade that allows developers to build cross-chain applications","category":["LAYER 1S"],"content":["Cross-chain messaging platform Connext released a new upgrade called Amarok that allows developers to build cross-chain applications, a move that could improve the on-chain user experience. The upgrade also allows for decentralized finance transactions such as liquidity providing, which could solve liquidity fragmentation issues. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"Today, when you search for cat videos on YouTube, you don’t need to know anything about Google’s complex distributed database infrastructure. You just interact with the app,\" Connext's founder and CEO Arjun Bhuptani said, highlighting the importance of cross-chain applications.","While there are several other bridges in the industry working on the same issue, Connext differentiates itself by having better security and trust assumptions, Bhuptani said.","\"Cross-domain communication is a difficult-to-understand topic with a large amount of misinformation &amp; propaganda spread by bridge projects, and high potential for disaster if done incorrectly,\" he said.","Cross-chain messaging is the term used to describe how blockchains or applications communicate and send transactions to each other, with the bridging sector gaining lots of attention recently. Uniswap's cross-chain governance proposal received the most attention \"in recent memory,\" Uniswap Foundation's Executive Director Devin Walsh <a href=\"https:\/\/www.theblock.co\/post\/208095\/uniswap-foundation-charts-path-forward-amid-cross-chain-bridge-governance-debate\" data-v-f87c67ca=\"\">said<\/a> earlier this week.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Connext","content":"ORGANIZATION"},{"type":"earlier this week","content":"DATE"},{"type":"Arjun Bhuptani","content":"PERSON"},{"type":"Uniswap Foundation","content":"ORGANIZATION"},{"type":"Today","content":"DATE"},{"type":"Devin Walsh","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Bhuptani","content":"PERSON"}],"hashtag":["DEXS","ETHEREUM","SIDECHAINS","SMART CONTRACTS","UNISWAP","ZKSYNC"],"authors":["Mike Truppa","The Block"]}