{"summary":"Vega is a developing a protocol for offering non-custodial derivatives trading\nThe firm has raised a $5 million seed round led by Pantera Capital","author":["Steven Zheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/41820\/vega-raises-5m-to-develop-decentralized-derivative-markets","publishDate":"2019-10-02T15:59:00","id":632,"type":null,"title":"Vega raises $5M to develop decentralized derivative markets","category":["Layer 1s"],"content":["Vega, a startup building decentralized trading technology, has raised a $5 million seed round led by Pantera Capital, with participation from investors including Xpring, Hashed, and RSK Ecosystem Fund.","The startup is building a blockchain-agnostic protocol that enables traders to create and participate in non-custodial markets for trading derivatives products. According to the firm, Vega is a layer 2 chain leveraging proof-of-stake and is currently built on top of the Tendermint consensus library used by protocols like Cosmos.","As a blockchain agnostic protocol, Vega's protocol can be integrated into various blockchains. The firm's first integration is with Ethereum. A user wanting to trade ether or ERC-20 tokens on Vega will lock up their tokens on a Vega Ethereum smart contract. A Vega node then reads the contract to ensure assets are locked before turning these assets into a collateral that can be traded on Vega's markets.","\"<span data-v-f87c67ca=\"\">Vega is designed from the outset for any given network\/shard to be able to act as a side chain to multiple asset ‘host’ blockchains. This would allow for cross-chain settlement and markets settled in assets outside of Ether and ERC20s,\" Vega co-founder Barney Mannerings tells The Block.<\/span>","While Vega's first integration is with Ethereum, Mannerings believes its users would soon build markets on other blockchains. \"<span data-v-f87c67ca=\"\">We are keen to quite quickly expand beyond Ethereum hosted assets, and the participation of both the RSK Ecosystem Fund and Xpring in this demonstrates the seriousness of our longer term, blockchain agnostic mission,\" he says.<\/span>","Vega is not the first non-custodial derivatives offering on the market. dYdX, an Ethereum-based non-custodial derivatives trading platform launched Alpha testing on the Etheruem mainnet in April. More recently, UMA Protocol, a decentralized financial contracts platform, <a href=\"https:\/\/github.com\/UMAprotocol\/whitepaper\/blob\/master\/research\/BitDEX.pdf\" data-v-f87c67ca=\"\">published<\/a> a research paper exploring a \"decentralized levered contract\" trading platform.","Mannerings tells The Block that Vega differs from these competing products because \"t<span data-v-f87c67ca=\"\">he protocol’s use of a separate blockchain custom designed for derivatives trading [which] also allows the protocol to mitigate issues like front running and makes it possible to easily support bespoke products with complex execution logic and risk models, in addition to providing 10-100x lower latency and higher throughput than blockchains like Ethereum on which many competing protocols are based.\"<\/span>"],"hashtag":[]}