{"summary":"Kraken, the crypto exchange operator, is reportedly seeking a partner to help with the creation of a new Layer 2 blockchain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/261834\/kraken-follows-coinbases-lead-with-plans-to-launch-layer-2-network-report","publishDate":"2023-11-06T21:35:26","id":6321,"type":null,"title":"Kraken follows Coinbase’s lead with plans to launch Layer 2 network: report","category":["CRYPTO ECOSYSTEMS"],"content":["Kraken, the crypto exchange operator, is reportedly seeking a partner to help with the creation of a new Layer 2 blockchain —&nbsp;following the lead of rival exchange Coinbase.","Coinbase introduced Base, its Layer 2, <a href=\"https:\/\/www.coinbase.com\/blog\/introducing-base\" data-v-f87c67ca=\"\">in February of this year<\/a>, and has <a href=\"https:\/\/www.theblock.co\/post\/246248\/ethereum-layer-2-base-daily-transactions-flip-optimism-arbitrum\" data-v-f87c67ca=\"\">quickly hoovered up market share<\/a> while diversifying its revenue streams.","Kraken is now weighing working in partnership with Polygon, Matter Labs or Nil Foundation to build out a Layer 2 network of its own, <a href=\"https:\/\/www.coindesk.com\/tech\/2023\/11\/07\/kraken-said-to-seek-partner-to-help-build-it-a-layer-2-blockchain-network\/?utm_medium=referral&amp;utm_source=rss&amp;utm_campaign=headlines\" data-v-f87c67ca=\"\">according to a report published today by CoinDesk<\/a>. Coinbase’s Base uses the OP Stack, from the team behind Optimism.","Kraken did not immediately respond to a request for comment, but a spokesperson told CoinDesk that the company is “always looking to identify and solve for new industry challenges and opportunities,” while declining to share further details.","Kraken is currently <a href=\"https:\/\/jobs.lever.co\/kraken\/d995b941-43d4-41e6-8cc6-f81f2b7045c4\" data-v-f87c67ca=\"\">advertising a job vacancy<\/a> for a “Senior Cryptography Engineer” who could be tasked, among other things, with the “design and implementation of layer-2 solutions.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"February of this year","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Matter Labs or Nil Foundation","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}