{"summary":"The move comes as the firm is facing a flurry of legal action from creditors following its bankruptcy. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173097\/celsius-ceo-resigns-as-company-struggles-to-pay-back-creditors","publishDate":"2022-09-27T10:31:16","id":6324,"type":null,"title":"Celsius CEO resigns as company struggles to pay back creditors","category":["THE BLOCK"],"content":["Alex Mashinsky, the founder and CEO of failed crypto lender Celsius, has resigned.&nbsp;","\"I will continue to maintain my focus on working to help the community unite behind a plan that will provide the best outcome for all creditors – which is what I have been doing since the Company filed for bankruptcy,”&nbsp; Mashinsky <a href=\"https:\/\/www.businesswire.com\/news\/home\/20220927005812\/en\/Celsius-Network-CEO-Submits-Letter-of-Resignation\" data-v-f87c67ca=\"\">said<\/a>&nbsp;in a press release announcing the move. “I believe we all will get more if Celsians stay united and help the UCC with the best recovery plan.&nbsp;","CFO Chris Ferraro is stepping in as \"Chief Restructuring Officer\" and interim CEO, the company <a href=\"https:\/\/www.businesswire.com\/news\/home\/20220927005796\/en\/Celsius-Appoints-Chris-Ferraro-to-the-Role-of-Chief-Restructuring-Officer-Interim-Chief-Executive-Officer-as-Alex-Mashinsky-Steps-Down\" data-v-f87c67ca=\"\">announced<\/a>.&nbsp;","Mashinsky himself has long been a controversial and often combative figure within the crypto industry. The collapse of his firm earlier this year brought about heightened scrutiny of its business operations as well as Mashinsky's leadership.&nbsp;","One of the largest lenders in crypto, Celsius offered retail clients interest-bearing accounts. Celsius compared them to high-interest bank accounts, but in the absence of federal deposit insurance regulators have called those accounts unregistered securities.&nbsp;","With the collapse of the crypto market earlier this year, Celsius cancelled client withdrawals and filed for bankruptcy, revealing massive <a href=\"https:\/\/www.theblock.co\/post\/157647\/celsius-bankruptcy-documents-claim-1-2-billion-balance-sheet-gap\" data-v-f87c67ca=\"\">disparities in the firm's balance sheet<\/a>. Despite ongoing <a href=\"https:\/\/www.theblock.co\/post\/171923\/celsius-revival-plan-appears-to-include-issuing-wrapped-assets\" data-v-f87c67ca=\"\">legal proceedings to recoup creditors<\/a>, the firm has been on the rocks for months. In a statement on his resignation, Mashinsky said \"I will continue to maintain my focus on working to help the community unite behind a plan that will provide the best outcome for all creditors – which is what I have been doing since the Company filed for bankruptcy.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Chris Ferraro","content":"PERSON"},{"type":"UCC","content":"ORGANIZATION"},{"type":"Alex Mashinsky","content":"PERSON"},{"type":"Mashinsky","content":"PERSON"},{"type":"Mashinsky","content":"ORGANIZATION"}],"hashtag":[],"authors":["Kollen Post","The Block"]}