{"summary":"OpenSea, the popular NFT marketplace, has launched a marketplace protocol with a range of new features.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/148094\/opensea-launches-new-marketplace-protocol-dubbed-seaport","publishDate":"2022-05-20T14:25:40","id":6331,"type":null,"title":"OpenSea launches new marketplace protocol dubbed &#x27;Seaport&#x27;","category":["NFTS"],"content":["Popular NFT marketplace OpenSea just launched a new marketplace protocol to buy and sell NFTs.&nbsp;","The news, which was first made apparent by an address linked to OpenSea on Etherscan earlier Friday, was confirmed in a <a href=\"https:\/\/opensea.io\/blog\/announcements\/introducing-seaport-protocol\/\" data-v-f87c67ca=\"\">blog post<\/a> by the company.","The protocol, dubbed Seaport, allows users to acquire NFTs in a range of new ways.","Bidders who use Seaport can bundle different assets in exchange for an NFT, unlike now where only crypto can be exchanged for an NFT.","For example, \"say you own a 40 ETH doodle and you want a 100 ETH ape. You can offer your doodle NFT and 60 ETH,\" said Steven Zheng, director of research at The Block.","Other tools, like SudoSwap, which lets a user barter for NFTs, offer this type of functionality today. But this feature is now becoming native to OpenSea.&nbsp;","Seaport will now also let people bid on specific traits from a collection. This is for cases whereby the bidder doesn't care what kind of NFT they get, as long as it features a trait they're looking for. For example, users who collect smiling NFTs can bid on any smiling Bored Ape from the collection.&nbsp;","The marketplace will also now allow tipping.&nbsp;","\"A fulfiller may include additional consideration items when fulfilling a listing as long as they do not “tip” more than the original offer,\" said the statement from OpenSea. \"This allows alternative interfaces to include their own fees.\"","OpenSea doesn't control the protocol, positioning it as a shared and open resource for developers.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/marketplaces\/nft-marketplace-monthly-volume\/embed\" title=\"NFT Marketplace Monthly Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"OpenSea","content":"ORGANIZATION"},{"type":"Steven Zheng","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"doodle NFT","content":"ORGANIZATION"}],"hashtag":["OPENSEA"],"authors":["Anushree Dave","The Block"]}