{"summary":"Though the deal may still not go through, a successful merger would make the new company the largest crypto exchanges in Canada.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/201771\/coinsquare-wonderfi-in-talks-to-form-largest-crypto-exchange-in-canada-bnn-bloomberg","publishDate":"2023-01-12T15:52:43","id":6332,"type":null,"title":"Potential Coinsquare and WonderFi merger in advanced talks","category":["COMPANIES"],"content":["Two of Canada's largest exchanges, Coinsquare and WonderFi, are in advanced merger talks, BNN Bloomberg <a href=\"https:\/\/www.bnnbloomberg.ca\/exclusive-coinsquare-wonderfi-in-merger-talks-to-create-canadian-crypto-giant-sources-1.1869367\" data-v-f87c67ca=\"\">reported<\/a>, citing sources.&nbsp;","If the deal goes through, the merged company would become the biggest crypto exchange in Canada with about 1.15 million users. An announcement could be made in the coming days, although it's not certain the deal will be completed, BNN Bloomberg said.","The terms and potential value weren't clear, but one possibility would see Coinsquare shareholders take a majority stake in the merged business.","Coinsquare had been planning to acquire crypto trading platform <a href=\"https:\/\/www.theblock.co\/post\/172467\/coinsquare-set-to-acquire-coinsmart-merging-the-two-trading-platforms\" data-v-f87c67ca=\"\">CoinSmart<\/a> but shelved the plans this month. One source with knowledge of the discussions with WonderFi told BNN Bloomberg that Coinsquare's regulatory status with Canada's Investment Industry Regulatory Organization could help it play a role in consolidating distressed crypto firms in the country.&nbsp;","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"BNN Bloomberg","content":"ORGANIZATION"},{"type":"Canada's Investment Industry Regulatory Organization","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Coinsquare","content":"ORGANIZATION"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}