{"summary":"Some Bored Ape holders are losing their staked ApeCoin tokens because they failed to delist their paired NFTs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/192598\/apecoin-holders-losing-staked-tokens-bored-ape-nft","publishDate":"2022-12-06T12:24:43","id":6338,"type":null,"title":"Apecoin holders are losing their staked tokens when paired Bored Apes get sold","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Holders of Bored Apes and Mutant Apes are losing their staked apecoin because they failed to delist their paired NFTs before staking their tokens.<\/span>","<span data-v-f87c67ca=\"\">Apecoin staking went live on Dec. 5 and already some Bored Apes and Mutant Apes holders have fallen victim to the<\/span>&nbsp;<span data-v-f87c67ca=\"\">issue, related to how the staking feature works, according to security firm PeckShield. Two traders have already <a href=\"https:\/\/twitter.com\/PeckShieldAlert\/status\/1600053481385381890\" data-v-f87c67ca=\"\">earned<\/a> between $8,000 and $10,000 in profits from targeting Bored Ape holders<\/span><span data-v-f87c67ca=\"\">. In both cases, the victims lost their staked apecoin after selling their NFTs.<\/span>","<span data-v-f87c67ca=\"\">These incidents are possible because of the way apecoin staking works. Users can stake their tokens directly or pair them with their Bored Ape or Mutant Ape NFTs. When they pair them, only the tokens are locked in the smart contract. The NFTs can still be sold on OpenSea or any other marketplace. However, when this happens, the holder loses the staked apecoin to the NFT's buyer because the paired NFT acts as the access key.<\/span>","<span data-v-f87c67ca=\"\">Smart-contract savvy arbitrageurs have targeted this apecoin staking feature. The process involves buying a Bored Ape or Mutant Ape whose owner has staked apecoins. These traders usually take a flash loan to obtain the capital needed to purchase the NFT. Once the NFT is sold, the new buyer receives the staked tokens. The next step involves selling the NFT and apecoin for ether. The funds realized from these sales are enough for the trader to repay the loan and still have some profit left over.<\/span>","<span data-v-f87c67ca=\"\">In one incident reported by PeckShield, the victim lost 6,400 APE ($26,240) to the trader when the paired NFT was sold. The trader used an 82 ETH ($103,000) flash loan from Dydx to buy the NFT and claim the staked tokens. The trader then sold both the NFT and the apecoin for 88 ETH in total. This gave the trader enough funds to cover the loan and still have 6 ETH left over as profit. These transactions happened in one single block — since that is how flash loans work — and cost only $14 in fees.<\/span>","<span data-v-f87c67ca=\"\">In another incident shared by PeckShield, a <\/span><span data-v-f87c67ca=\"\">trader scooped almost 8 ETH in a transaction <\/span><a href=\"https:\/\/etherscan.io\/tx\/0x34738ae6b3b6d9784dd8203bd0ce9c7fb3b5de724a9d91d0c6ff0ee85d608951\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">costing<\/span><\/a><span data-v-f87c67ca=\"\"> $17.<\/span>","<span data-v-f87c67ca=\"\">While Bored Ape developer Yuga Labs has faced criticism over these losses, <\/span><span data-v-f87c67ca=\"\">warnings over apecoin staking have been part of the<\/span> <a href=\"https:\/\/forum.apecoin.com\/t\/aip-4-staking-process\/44\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">discussions<\/span><\/a><span data-v-f87c67ca=\"\"> in the ApeDAO community governance forum for months. Web3 wallets like MetaMask also display a warning when connecting to the apecoin staking website.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$10,000","content":"MONEY"},{"type":"PeckShield","content":"ORGANIZATION"},{"type":"$8,000","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Mutant Ape NFTs","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Dec. 5","content":"DATE"},{"type":"Yuga Labs","content":"ORGANIZATION"},{"type":"$26,240","content":"MONEY"},{"type":"$17","content":"MONEY"},{"type":"$14","content":"MONEY"},{"type":"$103,000","content":"MONEY"}],"hashtag":["BAYC","HACKS","MAYC","YUGA LABS"],"authors":["Osato Avan-Nomayo","The Block"]}