{"summary":"The New York Department of Financial Services introduced new policies aimed at protecting stablecoin investors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/150903\/dfs-regulator-issues-new-guidance-on-stablecoins","publishDate":"2022-06-08T14:46:52","id":6341,"type":null,"title":"NY DFS issues new guidance on dollar-backed stablecoins","category":["STABLECOINS"],"content":["The New York Department of Financial Services (DFS) today became the first <span data-v-f87c67ca=\"\">financial regulator in the US to issue guidance outlining compliance requirements for dollar-backed stablecoins.<\/span>","<span data-v-f87c67ca=\"\"><a href=\"https:\/\/www.dfs.ny.gov\/industry_guidance\/industry_letters\/il20220608_issuance_stablecoins\" data-v-f87c67ca=\"\">The guidance<\/a> builds on informal policies used by the DFS since 2018, setting “baseline requirements” for any stablecoin issuer currently subject to DFS oversight, and any firm that applies to be regulated in the future. <\/span><span data-v-f87c67ca=\"\">It \"<\/span><span data-v-f87c67ca=\"\">creates clear criteria for virtual currency companies looking to issue USD-backed stablecoins in New York,\" according to Adrienne Harris, the state's Superintendent of Financial Services.<\/span>","<span data-v-f87c67ca=\"\">The document has three main components. <\/span><span data-v-f87c67ca=\"\">First, any stablecoin regulated by the DFS must be “fully backed” by a reserve of assets, meaning that the market value of a reserve is equal to the nominal value of a stablecoin’s outstanding units at the end of each business day. Issuers also must set clear policies for the redemption of tokens into US dollars, and fulfill redemption requests within two days, except under “extraordinary circumstances.”<\/span>","<span data-v-f87c67ca=\"\">Under the guidance, firms that issue USD-backed stablecoins will also need to separate their reserve assets from their proprietary assets and hold these reserves in specific asset categories, such as US treasury bills, reverse repurchase agreements fully collateralized by US treasury bills, government money-market funds and deposit accounts at US state or federally charted depository institutions.<\/span>","<span data-v-f87c67ca=\"\">Stablecoins will also need to be audited by an independent certified public accountant, who will attest to management's assertions on a monthly and yearly basis.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The guidance also specifies that fulfilling these requirements alone won't necessarily guarantee compliance. The department said it considers a “range of potential risks” before it authorizes the issuance of a stablecoin.&nbsp;<\/span>","New York's new policies come in the wake of <a href=\"https:\/\/www.theblockcrypto.com\/post\/146444\/terra-luna-and-ust-how-we-got-here\" data-v-f87c67ca=\"\">the collapse of the popular stablecoin TerraUSD<\/a> last month. US policymakers have yet to issue stablecoin-specific rules, but both the collapse of TerraUSD and stablecoin regulation more generally have been <a href=\"https:\/\/www.theblockcrypto.com\/linked\/146048\/us-treasury-secretary-yellen-points-to-ust-slip-asks-for-new-stablecoin-legislation-by-the-end-of-2022\" data-v-f87c67ca=\"\">a topic of conversation in recent Congressional hearings<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York","content":"LOCATION"},{"type":"Superintendent of Financial Services","content":"ORGANIZATION"},{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Adrienne Harris","content":"PERSON"},{"type":"DFS","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"US dollars","content":"MONEY"}],"hashtag":[],"authors":["Sam Venis","The Block"]}