{"summary":"Navin Gupta, former managing director of Ripple, became the new CEO of Crystal Blockchain as the firm eyes expansion in the Middle East and Asia.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277918\/ex-ripple-exec-is-now-ceo-of-crypto-intel-firm-crystal-blockchain","publishDate":"2024-02-19T00:01:05","id":6348,"type":null,"title":"Ex-Ripple exec is now CEO of crypto intel firm Crystal Blockchain","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Crystal Blockchain announced Monday that former Ripple managing director Navin Gupta will be its new chief executive officer. Current CEO Marina Khaustova, who helmed the company for the past five years, will now be chief operating officer.<\/span>","<span data-v-f87c67ca=\"\">Crystal provides transaction tracking software to companies and government agencies, competing with rivals like Chainalysis, Elliptic, Coinfirm and TRM Labs. The company with Ukrainian roots based in the Netherlands was founded by Bitfury in 2018.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Gupta is based in the UAE and was working in his role as Ripple’s managing director for South Asia, Middle East and North Africa for over seven years, according to his <\/span><a href=\"https:\/\/www.linkedin.com\/in\/navingupta2\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">LindkedIn profile<\/span><\/a><span data-v-f87c67ca=\"\">. He will now take a lead in expanding Crystal’s business in the region, the company said in its announcement.<\/span>","<span data-v-f87c67ca=\"\">It appears Crystal is positioning itself in anticipation of more demand by regulators for data tools as a result of the recent spot bitcoin ETF.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“As we continue to see adoption grow, we are committed to leveraging new-age tech to stay ahead of the curve. Regulators need superior intelligence and cutting-edge tools to navigate these changes, and TradFi institutions are seeking to manage risks effectively as they enter the digital assets market,” Gupta said.<\/span>","<span data-v-f87c67ca=\"\">Brian Brooks, Bitfury board member and former head of the Office of the Comptroller of the Currency, maintains that the recent bitcoin ETF launch will supercharge the further adoption of crypto, as well as a need to track bad actors and crypto-related crime.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Recent developments like the Bitcoin ETF approval have set the stage both for an increased appetite for digital assets and for compliance tools to keep pace with regulatory expectations,” said Brooks in the statement.<\/span>","<span data-v-f87c67ca=\"\">Former CEO Marina Khaustova will become a chief operating officer “co-piloting” with Gupta, she told The Block in a written comment.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“As Crystal has grown from a small team of engineers in Kyiv into a leader in the EU's crypto compliance market, my role has evolved too,” Khaustova said, adding: “With Navin joining as CEO, his expertise and vision in steering our expansion into the MENA and APAC region – a critical battleground in the crypto space – energizes our mission.”<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bitfury","content":"ORGANIZATION"},{"type":"Middle East","content":"LOCATION"},{"type":"Navin","content":"PERSON"},{"type":"Gupta","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"MENA","content":"ORGANIZATION"},{"type":"Khaustova","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"the Netherlands","content":"LOCATION"},{"type":"South Asia","content":"LOCATION"},{"type":"Kyiv","content":"LOCATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"APAC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Marina Khaustova","content":"PERSON"},{"type":"Brian Brooks","content":"PERSON"},{"type":"Navin Gupta","content":"PERSON"},{"type":"Brooks","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Elliptic","content":"LOCATION"},{"type":"North Africa","content":"LOCATION"},{"type":"UAE","content":"ORGANIZATION"}],"hashtag":["MOVES"],"authors":["Anna Baydakova","The Block"]}