{"summary":"Paxos is looking to disrupt a multiple quadrillion dollar corner of Wall Street, and it&#x27;s convinced two financial services heavy hitters to get behind","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/44901\/paxos-looking-to-upend-a-massive-corner-of-wall-street-credit-suisse-on-board-for-pilot","publishDate":"2019-10-28T17:12:03","id":6349,"type":null,"title":"Paxos looking to upend a massive corner of Wall Street; Credit Suisse on board for pilot","category":["LAYER 1S"],"content":["Paxos is looking to disrupt a multiple quadrillion dollar corner of Wall Street, and it's convinced two financial services heavy hitters to get behind it.&nbsp;","The New York-based financial technology company announced on Monday that the Securities and Exchange Commission has issued them a no-action letter that will allow the firm to test its new blockchain-based settlement service. Two European banks are among the first to sign up for the platform, which will support the settlement of certain securities trading on a few dark pool marketplaces, according to Melayna Ingram, director of product management at the firm.&nbsp;","Credit Suisse and Societe Generale are participating in the trial, which Paxos says will be the first time securities will trade outside of the legacy clearing system. In the U.S. stock market, DTCC sits behind Wall Street, facilitating the clearing and settlement of quadrillions of dollars worth of securities. As part of Paxos Settlement Service, participating firms will now have the ability to trade bilaterally and then settle the securities on Paxos' permissioned blockchain rather than through the National Securities Clearing Corporation (NSCC).&nbsp;","\"We've been working on this for about 18 months,\" said Ingram. \"We've been working with many large firms on the sell side and buy side as well as other vendors to work on the initial design and the approach to taking it to market.\"","The trial will only touch a small sliver of Wall Street trading. To start, participating firms will be able to trade a limited number of securities and will be capped at 100,000 shares per day, according to Ingram. Still, Paxos is promising a quicker alternative to Wall Street, which typically sees trades settle and clear, in some cases, several days after execution. Ingram said that the change of ownership of cash and securities will instead occur instantly at the time a trade settles.","\"We believe the process of securities settlement can be greatly optimized using blockchain, and with Paxos Settlement Service we will benefit from these efficiencies first hand,\" Emmanuel Aidoo, head of digital asset markets at Credit Suisse. \"We see this as a significant and important milestone in our Digital Asset Markets strategy and foresee opportunities to leverage this product across numerous asset classes in the future.\"","During the pilot, Paxos will not charge for the service.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Ingram","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Paxos","content":"PERSON"},{"type":"Paxos Settlement Service","content":"ORGANIZATION"},{"type":"DTCC","content":"ORGANIZATION"},{"type":"Melayna Ingram","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"National Securities Clearing Corporation (NSCC","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"quadrillions of dollars","content":"MONEY"},{"type":"Emmanuel Aidoo","content":"PERSON"},{"type":"Credit Suisse","content":"ORGANIZATION"},{"type":"Societe Generale","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}