{"summary":"The Bank of International Settlements published a wide-ranging central bank survey on digital currencies, including CBDCs, stablecoins and cryptocurrencies on Wednesday\nPer the survey, stablecoins are being investigated by many central banks for their impact on monetary and financial stability\nCryptocurrencies are “niche products with no widespread use as a means of payment” in the eyes of most CBs, per the survey.\nMost central banks are looking at CBDCs on a long-term horizon, though some are advancing into the pilot development stage, per the BIS survey","author":["Michael McSweeney","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/92844\/bis-cental-bank-survey-stablecoins-cbdcs","publishDate":"2021-01-27T16:28:23","id":635,"type":null,"title":"Stablecoins being studied by two-thirds of surveyed central banks: BIS","category":["Central Banks"],"content":["Central banks are taking their time when it comes to issuing digital currencies -- but the results of a new survey from the Bank of International Settlements suggest they're taking a keen interest in stablecoins.","<a href=\"https:\/\/www.bis.org\/publ\/bppdf\/bispap114.htm\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">The survey<\/a>, published Wednesday, comes just over a year after <a href=\"https:\/\/www.theblockcrypto.com\/post\/53882\/central-banks-bis-digita-currencies-work-survey\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">the last major BIS study<\/a> on the status of central banks' work on digital currencies. Since then, per the survey's authors, more central banks are moving in the direction of pilot programs and beyond initial experiments. That said, the time horizon for actually going online with CBDCs appears to remain distant, with some 60% of surveyed central banks still in the early stages. The BIS queried around 60 such institutions.","\"Most central banks are now exploring the case for CBDCs in some way and, overall, the survey indicates a continuous move from purely conceptual research to experimentation and pilot projects. Yet despite these developments, a widespread roll out of CBDCs still seems some way off,\" the report noted.","On the subject of stablecoins, the BIS survey indicated that two-thirds of surveyed central banks are focused on stablecoins, or digital currencies tied in some fashion to fiat currencies like the U.S. dollar.&nbsp; This work is focused on \"studying the impact of stablecoins on monetary and financial stability.\"","The report names in passing just one stablecoin issuer -- Tether, which operates the USDT stablecoin -- as well as Bitcoin as a cryptocurrency. On cryptocurrencies, per the report, \"central banks continue to see these as niche products with no widespread use as a means of payment.\"","As the report's authors noted:","The full report can be found <a href=\"https:\/\/www.bis.org\/publ\/bppdf\/bispap114.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">here<\/a>.","In addition to the central bank survey report, the BIS published <a href=\"https:\/\/www.bis.org\/speeches\/sp210127.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">remarks<\/a> from Agustín Carstens, the institution's general manager. Carstens argued that central banks should serve as issuers of digital currencies.","\"If digital currencies are needed, central banks should be the ones to issue them,\" Carstens said. \"If they do, CBDCs could also play a catalytic role in innovation, spurring competition and efficiency in payments.\""],"hashtag":["BITCOIN","CBDCS"]}