{"summary":"Stargate has integrated with the Layer 2 Ethereum scaling solution Metis in its first blockchain expansion since it was launched.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/203693\/stargate-integrates-with-metis-in-first-blockchain-expansion-since-launch","publishDate":"2023-01-19T09:07:10","id":6352,"type":null,"title":"Stargate integrates with Metis in first blockchain expansion since launch","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Cross-chain bridge protocol Stargate has integrated with the Layer 2 Ethereum scaling solution Metis in its first blockchain expansion since it was <\/span><a href=\"https:\/\/www.theblock.co\/post\/137850\/layerzero-gears-up-for-launch-of-cross-chain-protocol-stargate\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">launched<\/span><\/a><span data-v-f87c67ca=\"\"> by LayerZero Labs in March last year.<\/span>","Stargate’s integration with Metis aims to provide more flexibility for projects managing their funds, treasury, and yield strategies, according to an announcement.","“Web3 represents community and decentralization, both of which must begin at the infrastructural level. We firmly believe that, alongside the Stargate team, our partnership is a major step toward eliminating the barriers between blockchains and opening the doors to a more decentralized, multi-chain economy,” said Metis CEO and co-founder Elena Sinelnikova.","<span data-v-f87c67ca=\"\">Stargate went live in March 2022 on Ethereum, Avalanche, Polygon, BNB Chain, Fantom, Arbitrum and Optimism, shortly after <\/span><a href=\"https:\/\/www.theblock.co\/post\/139078\/stargate-bridge-attracts-2-billion-of-liquidity-within-a-week-of-launch\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">raising<\/span><\/a><span data-v-f87c67ca=\"\"> $25 million in a public sale of its native stargate tokens (STG). The multi-chain bridge <\/span><a href=\"https:\/\/defillama.com\/protocol\/stargate\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">gained<\/span><\/a><span data-v-f87c67ca=\"\"> $4 billion of liquidity within two weeks of the launch, attracted by 20-25% yields, but that has since fallen to around $350 million alongside the general crypto market decline.<\/span>","<span data-v-f87c67ca=\"\">Metis’s <\/span><a href=\"https:\/\/l2beat.com\/scaling\/tvl\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$95 million<\/span><\/a><span data-v-f87c67ca=\"\"> of assets held make it the fourth largest Layer 2 network, behind Arbitrum, Optimism and Loopring, dropping from a high of $743 million.<\/span>","<span data-v-f87c67ca=\"\">The new partnership aims to bring Metis users greater cross-chain efficiency, with the ability to leverage the benefits of DeFi across multiple chains supported by LayerZero.<\/span>","<span data-v-f87c67ca=\"\">“The integration of Metis is another big step in LayerZero’s expansion into the Layer 2 ecosystem of Ethereum, allowing for a unified flow of messaging across the entire Ethereum ecosystem,” added LayerZero Labs co-founder and CTO Ryan Zarick.<\/span>","<span data-v-f87c67ca=\"\">Metis and Stargate intend to continue their collaboration on an ongoing basis. Initially, Stargate will enable USDT for Metis across Ethereum, Avalanche, and BNB Chain, with plans to expand interoperability further.<\/span>","The ability to transfer liquidity across blockchain networks is a key part of web3 interoperability. Yet, most existing cross-chain bridges are unable to send native assets between chains without relying on wrapped tokens for the bridging process.","Bridging with wrapped tokens relies on multi-step locked liquidity models — locking up a crypto asset on one chain with a corresponding wrapped token minted on another. Regardless of whether those locked funds are stored in a multi-sig, smart contract or with a third-party custodian, they can become a target, with over $2.5 billion stolen from such cross-chain bridges in the past two years. In fact, a recent <a href=\"https:\/\/twitter.com\/tokenterminal\/status\/1582376876143968256\" data-v-f87c67ca=\"\">study<\/a> showed around 50% of all DeFi exploits occurred on cross-chain bridges.","Built on the interoperability protocol LayerZero, Stargate is designed to avoid the need for wrapped tokens, improving security, its team <a href=\"https:\/\/www.theblock.co\/post\/139078\/stargate-bridge-attracts-2-billion-of-liquidity-within-a-week-of-launch\" data-v-f87c67ca=\"\">claims<\/a>.&nbsp;","Stargate’s fully composable native asset bridge enables the transfer of native tokens between different blockchains in a single transaction. It does this by building unified liquidity pools that are shared between chains with instant transaction finality.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$350 million","content":"MONEY"},{"type":"$95 million","content":"MONEY"},{"type":"Stargate","content":"ORGANIZATION"},{"type":"Polygon","content":"LOCATION"},{"type":"$4 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Metis CEO","content":"ORGANIZATION"},{"type":"LayerZero Labs","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"March 2022","content":"DATE"},{"type":"March last year","content":"DATE"},{"type":"Fantom","content":"PERSON"},{"type":"Arbitrum","content":"LOCATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"$743 million","content":"MONEY"},{"type":"Metis","content":"ORGANIZATION"},{"type":"$2.5 billion","content":"MONEY"},{"type":"$25 million","content":"MONEY"},{"type":"CTO","content":"ORGANIZATION"},{"type":"Elena Sinelnikova","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ARBITRUM","CROSS-CHAIN SWAPS","OPTIMISM"],"authors":["James Hunt","The Block"]}