{"summary":"Valued at more than $1 billion, FTX&#x27;s stake in Anthropic is for sale, but the company isn&#x27;t considering Saudi Arabian investors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284292\/openai-rival-anthropic-selling-ftx-stake-but-saudi-buyers-left-out-of-consideration-report","publishDate":"2024-03-22T16:43:46","id":6361,"type":null,"title":"OpenAI rival Anthropic selling FTX stake, but Saudi buyers left out of consideration: report","category":["DEALS"],"content":["Artificial intelligence startup Anthropic is looking for a buyer to purchase a stake in the company currently owned by the defunct crypto exchange FTX but has ruled out selling to investors from Saudi Arabia, according to a <a href=\"https:\/\/www.cnbc.com\/2024\/03\/22\/anthropic-lining-up-a-new-slate-of-investors-ruled-out-saudi-arabia.html\" data-v-f87c67ca=\"\">report from CNBC<\/a>, which cites anonymous sources.","\"As bankers line up a group of potential new Anthropic backers, the company has ruled out taking money from the Saudis, according to people familiar with the matter. Anthropic executives cited national security, one of the sources told CNBC,\" the report said.","Three years ago, FTX bought shares in Anthropic for $500 million. Now, the 8% stake in the high-profile AI startup is valued at <a href=\"https:\/\/www.theblock.co\/post\/278705\/judge-approves-ftx-plan-to-sell-1b-stake-in-ai-startup-anthropic\" data-v-f87c67ca=\"\">more than $1 billion<\/a>. FTX is selling the Anthropic shares as part of its bankruptcy proceedings, and funds from the sale will be used to help reimburse clients who lost money after the cryptocurrency exchange went bankrupt.","\"The transaction is ongoing and is on track to wrap up in the next couple weeks,\" according to the report, which once again cited anonymous sources.","Anthropic is considering selling FTX's stake to \"other sovereign wealth funds,\" including the United Arab Emirates-based Mubadala, which has shown interest in purchasing Anthropic shares, the report also said.","In December, Anthropic <a href=\"https:\/\/www.cnbc.com\/2023\/12\/21\/openai-rival-anthropic-in-talks-to-raise-750-million-funding-round.html\" data-v-f87c67ca=\"\">was valued<\/a> at $18.4 billion. A judge approved the plan for FTX to sell its shares in the AI startup in February.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Saudi Arabia","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"8%","content":"PERCENT"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"Mubadala","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"United Arab Emirates","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$500 million","content":"MONEY"},{"type":"$18.4 billion","content":"MONEY"}],"hashtag":["FTX"],"authors":["RT Watson","The Block"]}