{"summary":"This article is a response to this piece by Arjun Balaji.  In Arjun’s article, he asks the question: “Why should we take EOS seriously, when it’s clearly","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/5724\/eos-is-a-dao","publishDate":"2018-12-21T10:39:43","id":6363,"type":null,"title":"EOS is a DAO","category":["OP-ED"],"content":["<span data-v-f87c67ca=\"\">This article is a response to <\/span><a href=\"https:\/\/www.theblockcrypto.com\/2018\/12\/07\/why-do-we-take-eos-seriously-when-its-clearly-a-plutocracy\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">this piece<\/span><\/a><span data-v-f87c67ca=\"\"> by Arjun Balaji.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In Arjun’s article, he asks the question: “Why should we take EOS seriously, when it’s clearly a plutocracy?” <\/span>","<span data-v-f87c67ca=\"\">In the context of a crypto asset as digital gold or Money 2.0, this view may be correct. But EOS isn’t that. EOS aims to be a decentralized autonomous organization (DAO).<\/span>","<span data-v-f87c67ca=\"\">This industry has largely failed to distinguish between different forms and applications of blockchain technology, lumping them all under the basket of “cryptocurrencies.” Many (if not most) blockchain tokens, including EOS, aren’t meant to be digital gold. <\/span>","<span data-v-f87c67ca=\"\">EOS the token is a pro-rata claim on access to the EOS network’s resources, as well as a pro-rata claim on its governance rights. EOS the network is a decentralized operating system governed by a DAO.<\/span>","<span data-v-f87c67ca=\"\">All publicly traded companies are plutocracies; the point is that people who are financially invested in the platform should have more influence. DAOs are an attempt to create a new form of corporation, in which users, developers, and block producers collaborate according to the rules of the protocol, rather than at the directive of the CEO.<\/span>","<span data-v-f87c67ca=\"\">EOS is built on delegated-proof-of-stake (DPOS), a form of proof-of-stake that gives token holders governance power relative to their stake in the system. In other words, those who have more stake, and thus have more at risk, are given more say. This is not some unfortunate byproduct of the system— it’s an explicit design choice! <\/span>","<span data-v-f87c67ca=\"\">Proof-of-stake (PoS) systems, especially those with stake-weighted governance, can create angst amongst those who believe that this technology stands to become the next form of money. Money is a universal system that underpins all economic activity, globally. The problem with PoS governance is that it allows those with the most money to control <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">the money itself<\/span><\/i><span data-v-f87c67ca=\"\"> by virtue of their holding more of it. That’s a bad outcome and one that does not appear to solve the centralization problems of the status quo, in which a relatively small set of actors (e.g. central banks) control the system. One of Bitcoin’s greatest features is what <\/span><a href=\"https:\/\/blog.kraken.com\/post\/219\/security-advisory-mobile-phones\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Pierre Rochard<\/span><\/a><span data-v-f87c67ca=\"\"> describes as its “<\/span><a href=\"https:\/\/medium.com\/@pierre_rochard\/bitcoin-governance-37e86299470f\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">peer-to-peer governance<\/span><\/a><span data-v-f87c67ca=\"\">” model. Just because you own more of the money, does not mean you get a greater say in how it behaves or evolves. <\/span>","<span data-v-f87c67ca=\"\">But EOS does not aim to be global state-free money. EOS is a DAO. DAOs should behave much more like businesses than money— they are owned by stakeholders who collectively control the entity. <\/span>","<span data-v-f87c67ca=\"\">Like businesses, these DAOs must compete with others in the market to offer the best goods and services to a set of potential users. EOS is a DAO that provides a decentralized operating system for applications built on a distributed ledger. EOS must compete with other blockchains and other DAOs that offer similar services. This includes not only Ethereum and Dfinity, but also other chains built using the free, open-source <\/span><a href=\"https:\/\/eos.io\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">EOSIO<\/span><\/a><span data-v-f87c67ca=\"\"> software published by <\/span><a href=\"https:\/\/block.one\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Block.one<\/span><\/a><span data-v-f87c67ca=\"\">; <\/span><a href=\"https:\/\/www.telosfoundation.io\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Telos<\/span><\/a><span data-v-f87c67ca=\"\"> and <\/span><a href=\"https:\/\/worbli.io\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Worbli<\/span><\/a><span data-v-f87c67ca=\"\"> are two such examples. <\/span>","<span data-v-f87c67ca=\"\">If any one of these chains fails to meet user expectations— whether that’s because of collusion, centralization, poor technical performance, chaotic governance, or anything else— then stakeholders will sell, and users will go elsewhere. This is crypto competition and evolution in action. In a world of free, open-source software, where anyone can borrow anyone else’s ideas, this competition is likely to be intense. Stakeholders are the key constituents that guide the evolution of these networks in order to maximize their value. Large holders stand to lose more if the system fails; with more skin in the game, they are given more say. They also stand to gain more if the system succeeds; this incentivizes them to act in ways that maximize value. <\/span>","<span data-v-f87c67ca=\"\">While we as an industry are still learning about how blockchain governance models should work, I would argue that systems that have purely <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">money<\/span><\/i><span data-v-f87c67ca=\"\"> use cases seem to function better with off-chain governance that doesn’t take into account users’ stake. DAO-like systems, on the other hand, can<\/span> <span data-v-f87c67ca=\"\">potentially benefit from stake-weighted governance. It’s still early, and these hypotheses are still being tested.<\/span>","<span data-v-f87c67ca=\"\">So within the context of EOS as a DAO, what exactly makes it so compelling? <\/span>","<span data-v-f87c67ca=\"\">Simply put, EOSIO is the most performant software in existence for decentralized applications. It’s the most user-friendly blockchain platform, with features like human-readable account names, customizable account permissions, zero individual transaction fees, high-throughput, low latency, deferred transactions, and more.<\/span>","<span data-v-f87c67ca=\"\">The ecosystem that’s been built around mobile use for EOS is far more advanced than most onlookers recognize: you can use a mobile wallet to send tokens, play games, trade on a DEX, and more, signing all transactions with TouchID, on EOS <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">today<\/span><\/i><span data-v-f87c67ca=\"\">. The user experiences built on EOS are far and away the best of blockchain-based applications.<\/span>","<span data-v-f87c67ca=\"\">Because of its unique architecture and usability, the EOS platform is best poised to capture many of the most exciting use cases for blockchains— gaming, NFTs, fully on-chain DEXs, decentralized social networks, and more. EOS is perfectly suited for anything that needs a neutral database— <\/span><a href=\"https:\/\/medium.com\/s\/story\/why-decentralization-matters-5e3f79f7638e\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">a database that a single company cannot control<\/span><\/a><span data-v-f87c67ca=\"\">— but that doesn’t need to withstand a coordinated assault by all the world’s governments.<\/span>","<span data-v-f87c67ca=\"\">Gaming, especially, seems likely to be the first major use case to gain traction here. True digital ownership combined with high-performance blockchain software opens up a huge opportunity set for game developers. As <\/span><a href=\"https:\/\/mythical.games\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Mythical Games<\/span><\/a><span data-v-f87c67ca=\"\">’ John Linden <\/span><a href=\"https:\/\/youtu.be\/Di2Ah_Ho4O8?t=1969\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">recently noted<\/span><\/a><span data-v-f87c67ca=\"\">, EOS-based <\/span><a href=\"https:\/\/eosknights.io\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">EOS Knights<\/span><\/a><span data-v-f87c67ca=\"\"> bring in more revenue per user per day than most legacy mobile games bring in per user per month, by orders of magnitude! Entrepreneurs may be able to create games that drive entirely new consumer behaviors because of the unique attributes that come with being built on a blockchain.<\/span>","<span data-v-f87c67ca=\"\">EOS is, by far, the most well-capitalized ecosystem in the space. It appears to be among the best suited to not just weather this bear market but to thrive in it. At a time when a number of prominent crypto companies have downsized or shut down altogether, Block.one is actively hiring and already has over 100 engineers building an iPhone wallet using the secure enclave, a DEX, and much more. EOS VCs— who are deploying $1B into startups building on the EOS ecosystem— continue to fund all sorts of projects, and <\/span><a href=\"https:\/\/github.com\/EOSIO\/eos\/releases\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">core development<\/span><\/a><span data-v-f87c67ca=\"\"> continues at an impressive pace. EOS is upgrading every month with new features and performance improvements (e.g. multi-threaded signature verification, improved resource management algorithm, etc).<\/span>","<span data-v-f87c67ca=\"\">Age-adjusted, EOS is the fastest-evolving ecosystem of any smart contract platform. The EOS mainnet launched just six months ago, and the performance and capacity of the network have increased several-fold since then. There is also an incredibly diverse ecosystem of infrastructure built around the network that greatly improves both user and developer experiences. EOS allows developers to abstract away much of the complexity of using a blockchain; dApps can create accounts for their users, and soon they’ll be able to directly allocate resources to them, as well. This will allow dApps to leapfrog many of the traditional barriers to entry for acquiring users in the blockchain space.<\/span>","<span data-v-f87c67ca=\"\">The EOS mainnet is just the first of many blockchains that will be built using the EOSIO software. Several teams are working on inter-blockchain communication contracts that will allow various EOSIO chains to communicate and interoperate. New projects may launch as sidechains or sister chains (code forks). We’ll see a number of different approaches tested; though many will likely fail, some high-quality projects that learn from the shortcomings of others will surely emerge.<\/span>","<span data-v-f87c67ca=\"\">In particular, I’m looking forward to seeing other projects that take slightly different approaches to governance in order to see what works best. Arjun is right in that ECAF, the quasi-legitimate “judicial branch” of EOS mainnet, is not working. I’ve written about that <\/span><a href=\"https:\/\/medium.com\/aurora-eos\/against-mandatory-arbitration-on-eos-32334ba3af9f\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">here<\/span><\/a><span data-v-f87c67ca=\"\">. The good news is that many within the EOS community <\/span><a href=\"https:\/\/twitter.com\/eosnewyork\/status\/1064952608434069504\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">share<\/span><\/a> <a href=\"https:\/\/medium.com\/@tokenika\/ecaf-on-eos-in-its-current-form-and-shape-is-a-dysfunctional-toxic-can-of-worms-that-should-be-c8128d76be2c\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">our<\/span><\/a> <a href=\"https:\/\/medium.com\/@Ashe_Oro\/critiques-of-ecaf-and-the-growing-risk-to-block-producers-d122bcc18218\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">views<\/span><\/a><span data-v-f87c67ca=\"\"> and are preparing to vote out ECAF through an upcoming on-chain referendum. If the EOS mainnet doesn’t get rid of this feature, then it will face intense competition from other chains that offer more freedom and less intervention to users and developers. <\/span>","<span data-v-f87c67ca=\"\">Many builders are realizing that optimizing for maximum decentralization at the expense of performance is a bad trade-off. For better or for worse, most users likely don’t care, as long as the platform is decentralized <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">enough <\/span><\/i><span data-v-f87c67ca=\"\">to be useful to them, which EOS is. What users do care about are performance and usability, and in those categories, EOS shines.<\/span>","<span data-v-f87c67ca=\"\">A common criticism is that EOS is just “AWS with a token.” The idea that a platform controlled by a single company, with no ability to natively transfer value p2p within that system, is equivalent to a functionally decentralized platform is simply intellectually dishonest.<\/span>","<span data-v-f87c67ca=\"\">The current EOS BPs are independent companies based in Israel, the Cook Islands, China, Japan, Canada, the British Virgin Islands, Brazil, Ukraine, the Cayman Islands, Sweden, the United Kingdom, and Singapore (and that list of countries doesn’t include standbys BPs who can be voted in at any time). None of these entities can unilaterally control or censor the shared database. While BPs can theoretically collude, it’s exponentially more difficult for this diverse array of companies to collude, than for a single decision maker at one company to make unilateral decisions. <\/span>","<span data-v-f87c67ca=\"\">Further, there aren’t just 21 nodes. There are 21 nodes producing blocks <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">at a time<\/span><\/i><span data-v-f87c67ca=\"\">, but the total number of possible nodes is unlimited, with every node competing to be among the top ~80, which are paid. Why 21? Although it’s somewhat arbitrary, the idea is that, beyond a certain point, having more nodes doesn’t meaningfully improve the benefits of decentralization— having a trust-minimized database— &nbsp;but it does come at the cost of performance and the ability of token holders to perform due diligence on the nodes.<\/span>","<span data-v-f87c67ca=\"\">Perhaps the largest unresolved challenge facing EOS is that on-chain governance is new, immature, and untested. It has not been tried at the scale it’s being tried with EOS before, and many users are unaware of how exactly the system works. On-chain governance <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">may be able to <\/span><\/i><span data-v-f87c67ca=\"\">align incentives in certain instances, but it may take several market cycles before it functions in a healthy way.<\/span>","<span data-v-f87c67ca=\"\">Despite these challenges, I’m incredibly excited about what the EOS ecosystem is collectively building. EOS is the best capitalized, fastest evolving, most usable and performant blockchain platform on the market, bar none. That’s worth paying attention to.<\/span>","<em data-v-f87c67ca=\"\"><a href=\"https:\/\/twitter.com\/myles_snider\" data-v-f87c67ca=\"\">Myles Snider<\/a> is a crypto analyst and the CEO of Aurora EOS, an EOS block producer.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"EOS","content":"ORGANIZATION"},{"type":"Cayman Islands","content":"LOCATION"},{"type":"Canada","content":"LOCATION"},{"type":"Sweden","content":"LOCATION"},{"type":"Arjun Balaji","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Brazil","content":"LOCATION"},{"type":"Pierre Rochard","content":"PERSON"},{"type":"John Linden","content":"PERSON"},{"type":"Japan","content":"LOCATION"},{"type":"Myles Snider","content":"PERSON"},{"type":"British Virgin Islands","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Cook Islands","content":"LOCATION"},{"type":"Worbli","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"Israel","content":"LOCATION"},{"type":"$1B","content":"MONEY"},{"type":"DAO","content":"ORGANIZATION"},{"type":"AWS","content":"ORGANIZATION"},{"type":"Aurora EOS","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"United Kingdom","content":"LOCATION"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":[],"authors":["Contributor Network","The Block"]}