{"summary":"By prompting users to prove they are human, Rarimo aspires to block AI spam bots from logging into platforms like Unstoppable Domains.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246627\/proof-of-humanity-plug-in-for-crypto-apps-launched-by-rarimo","publishDate":"2023-08-22T06:02:00","id":6364,"type":null,"title":"&#x27;Proof of humanity&#x27; plug-in for crypto apps launched by Rarimo","category":["STARTUPS"],"content":["<span data-v-f87c67ca=\"\">Aiming to help blockchain-powered applications discern real-life, human users from AI bots, the Rarimo protocol has launched a <\/span><span data-v-f87c67ca=\"\">“proof of humanity plug-in,” the organization said in a statement.<\/span>","<span data-v-f87c67ca=\"\">\"With the proliferation of AI exacerbating abuse from spam and bots across web3 dApps and services, Proof of Humanity solutions are vital in building the trust necessary for digital spaces and communities to succeed,\" Rarimo said in a statement.<\/span>","<span data-v-f87c67ca=\"\">Rarimo’s plug-in prompts users to prove they are human before being cleared to access digital identity providers Unstoppable Domains, Gitcoin Passport and Civic.<\/span>","<span data-v-f87c67ca=\"\">\"Not only is AI making the need for robust online credentials urgent, but many of the space's most exciting emerging innovations such as on-chain games and decentralized social media require some form of portable identity,\" said <\/span>Lasha Antadze, co-founder of Rarify Labs, a key contributor to the Rarimo protocol.","The deployment of bots across traditional social media networks like Facebook and Twitter has been, for years, considered highly problematic. By finding solutions to eradicate the practice, many builders of web3 platforms hope to imbue online interactions with a higher degree of trust and transparency.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Rarimo","content":"PERSON"},{"type":"Rarify Labs","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Lasha Antadze","content":"PERSON"},{"type":"Gitcoin Passport","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}