{"summary":"The Base network is designed to be a low cost, open source, developer sandbox for decentralized applications, said Coinbase.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/214183\/coinbase-unveils-layer-2-network-and-developer-fund","publishDate":"2023-02-23T09:00:39","id":6368,"type":null,"title":"Coinbase unveils its Ethereum Layer 2 network that won&#x27;t have a token","category":["COMPANIES"],"content":["Coinbase is officially jumping into the Layer 2 game.","The crypto exchange giant unveiled Base, a testnet version of its new Ethereum Layer 2 network, at ETHDenver. Modeled on Ethereum's Goerli testnet, it is designed to eventually connect to the main Ethereum network, according to Jesse Pollack, Coinbase's senior director of engineering.","<span class=\"s1\" data-v-f87c67ca=\"\">“Our goal with Base is to launch a platform that makes it really easy for developers to build apps that users actually want to use and then plug that into the Coinbase product suite to make it really easy for users to use those apps,”&nbsp; Pollack said.<\/span>","Notably, Pollack told The Block that Base won't sport its own dedicated token.","<span class=\"s1\" data-v-f87c67ca=\"\">“These networks don't need tokens to be successful,” said Pollack, adding that in some cases native tokens may obscure whether the networks are finding a product market fit with customers, users, and developers alike.<\/span>","Base is built on the open-source <a href=\"https:\/\/optimism.mirror.xyz\/fLk5UGjZDiXFuvQh6R_HscMQuuY9ABYNF7PI76-qJYs\" data-v-f87c67ca=\"\">OP Stack<\/a>, a blueprint for compatible blockchain Layer 2 networks that was created by the Ethereum Layer 2 network Optimism. Coinbase will also be joining Optimism as a core developer for the OP Stack.","<span class=\"s1\" data-v-f87c67ca=\"\">The existing suite of Coinbase developer tools will be integrated with Base, said Pollack, noting that “in collaboration with Optimism [OP] and building the OP Stack, we're going to make it so Base and other chains running on the OP stack are incredibly low cost, decentralized and secure.”<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Base will also mesh with consumer products from the company, such as Coinbase and Coinbase Wallet, and in so doing “give developers access to the 100 million plus users in the Coinbase ecosystem, 100 billion plus assets,\" and \"enable the scale that developers who are building web2 apps are used to in this new web3 economy,” said Pollack.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">To further spur development on Base, Coinbase and its venture arm, Coinbase Ventures, will launch the Base Ecosystem Fund to make “a bunch of investments … at the pre-seed stage in companies and organizations that are building on Base,” according to Pollack.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“We expect that lots of those developers will eventually go multichain or folks may start on another chain and then come to Base,” Pollack said.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">For the last year, Coinbase has been working on proto-dank sharding, an upgrade to Ethereum that will reduce fees on Layer 2 networks between 10-100 times current levels, Pollack said.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Layer 2 networks reduce the computation strain on Ethereum but require a certain amount of data availability to publish data to the main Ethereum chain. <\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Proto-dank sharding will scale data availability at Layer 1, and scale execution at Layer 2 in the rollups, according to Pollack.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“We expect there's going to be many of these Layer 2s, and that's why we're building based on the OpenStack, that's open source that anyone can use to run one of these L2s or roll-ups,” said Pollack, adding: “And then we can work to drive interoperability between all of them so that they increasingly work together, almost like that original Ethereum sharding at the execution layer vision, but in this new Layer 2 world.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jesse Pollack","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"Pollack","content":"PERSON"},{"type":"OP Stack","content":"ORGANIZATION"},{"type":"ups","content":"ORGANIZATION"}],"hashtag":["ARBITRUM","BASE","COINBASE","DECENTRALIZED INFRASTRUCTURE","DEVELOPER TOOLS","ETHEREUM"],"authors":["Jeremy Nation","The Block"]}