{"summary":"Jump Crypto announced today it is building a new open-source validator client for the Solana network.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/163667\/jump-crypto-announces-plan-to-build-new-validator-client-for-solana","publishDate":"2022-08-16T09:12:44","id":6369,"type":null,"title":"Jump Crypto announces plan to build new validator client for Solana","category":["EVENTS"],"content":["Jump Crypto announced today it is building a new open-source validator client for the Solana network.","This new initiative's main goal is to boost the scalability and reliability of the Solana network, which has experienced several extended periods of down time this year.","Validators play a critical role in Proof of Stake blockchains. Validators maximize the chance the canonical chain (the accepted chain that users interact with and post transaction blocks to) can be detected while also defending against potential attacks.","The reason why having multiple validators is important is because it makes it much more difficult and game-theoretically improbable for an attacker to coordinate an attack via miner (or staker) collusion.&nbsp;&nbsp;","Jump Crypto will propose significant upgrades to Solana’s open-source core software along with building a second and new open-source validator client using the C++ programming language, separate from the one built by Solana Labs. The process will be overseen by Jump Crypto’s chief science officer, Kevin Bowers.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Solana Labs","content":"ORGANIZATION"},{"type":"Crypto","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"Kevin Bowers","content":"PERSON"}],"hashtag":["SOLANA","VALIDATORS"],"authors":["Mike Truppa","The Block"]}