{"summary":"PayPal&#x27;s putting work on its stablecoin with Paxos on ice amid increasing regulatory scrutiny, Bloomberg reported.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210710\/paypal-pauses-stablecoin-project-amid-paxos-probe-bloomberg","publishDate":"2023-02-10T15:54:09","id":6378,"type":null,"title":"PayPal pauses stablecoin project amid Paxos probe: Bloomberg","category":["FINANCE FIRMS"],"content":["PayPal's putting work on its stablecoin on ice amid increasing regulatory scrutiny, Bloomberg News reported, citing a source.","The news came a day after a report that the New York Department of Financial Services was investigating Paxos, which PayPal had been working with on its stablecoin effort, Bloomberg said, adding that the coin was to have been launched in the coming weeks.","“We are exploring a stablecoin,\" a PayPal spokesperson said. \"If and when we seek to move forward, we will of course, work closely with relevant regulators.”","PayPal <a href=\"https:\/\/www.theblock.co\/linked\/129665\/paypal-confirms-that-it-is-exploring-a-stablecoin\" data-v-f87c67ca=\"\">confirmed<\/a> early last year that it was working on the stablecoin, which would be backed one-to-one with the U.S. dollar. Paxos holds a virtual currency license that was issued by the New York regulator, which issued stablecoin guidance in June following the Terra collapse and told issuers that stablecoins must be backed by assets that are kept separate from the issuers’ funds.","Paxos didn't immediately respond to requests for comment from The Block.","<em data-v-f87c67ca=\"\">(Updates with comment from company.)<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York","content":"LOCATION"},{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Bloomberg News","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}