{"summary":"Seven Seven Six reportedly plans to raise $177.6 million to invest in crypto tokens — and the firm&#x27;s founding partner Katelin Holloway believes &#x27;everything is on sale&#x27; in the sector.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/166427\/reddit-co-founder-alexis-ohanian-vc-crypto-token-fund","publishDate":"2022-08-30T04:52:25","id":6382,"type":null,"title":"Reddit co-founder&#x27;s VC firm seeking $177.6 million to invest in crypto tokens: The Information","category":["VENTURE CAPITAL"],"content":["Seven Seven Six, the venture capital firm led by Reddit co-founder Alexis Ohanian, plans to raise a new $177.6 million crypto fund to invest in tokens, The Information <a href=\"https:\/\/www.theinformation.com\/articles\/alexis-ohanians-seven-seven-six-targets-177-6-million-for-crypto-token-fund?rc=zqxydl\" data-v-f87c67ca=\"\">reported<\/a> Monday, citing fundraising materials.","The fund, dubbed Kryptós, will target tokens that are available at a discount thanks to the crypto market downturn. \"This is the best time to buy if you're really long on the industry,\" Seven Seven Six founding partner Katelin Holloway told The Information. \"It's on sale. Everything is on sale.\"","Seven Seven Six has registered as an investment adviser with the US Securities and Exchange Commission to invest in tokens. It received the registration in April.&nbsp;","Kryptós will charge investors a 2.5% management fee, according to the fundraising materials. It will also receive carried interest, or a share of the fund's profits, of 25%, with the possibility of 35% if the fund returns five times or more capital, per the materials.","This is Seven Seven Six's first crypto-focused fund. The firm has previously <a href=\"https:\/\/www.theblock.co\/linked\/132618\/terms-service\" data-v-f87c67ca=\"\">raised<\/a> two funds worth $500 million to invest across industries, including crypto. It manages more than $900 million in assets.","A growing number of high profile venture capital firms are raising funds specifically to invest in tokens. Earlier this year, Sequoia Capital <a href=\"https:\/\/www.theblock.co\/post\/134578\/sequoia-capital-new-crypto-fund-tokens\" data-v-f87c67ca=\"\">raised<\/a> $500 to $600 million to primarily invest in tokens and participate in the governance of projects. Bessemer Venture Partners also recently launched a $250 million crypto fund and created a decentralized autonomous organization or DAO to connect members of the crypto community for idea sharing, business development and tokenomics.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$900 million","content":"MONEY"},{"type":"Reddit","content":"LOCATION"},{"type":"Sequoia Capital","content":"ORGANIZATION"},{"type":"$500","content":"MONEY"},{"type":"$250 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Alexis Ohanian","content":"PERSON"},{"type":"Katelin Holloway","content":"PERSON"},{"type":"2.5%","content":"PERCENT"},{"type":"$600 million","content":"MONEY"},{"type":"$500 million","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"25%","content":"PERCENT"},{"type":"35%","content":"PERCENT"},{"type":"$177.6 million","content":"MONEY"},{"type":"US Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Bessemer Venture Partners","content":"ORGANIZATION"},{"type":"April","content":"DATE"}],"hashtag":["NEW VC FUNDS"],"authors":["Yogita Khatri","The Block"]}