{"summary":"DBS will issue digital Singapore dollars, while Open Government Products will enable smart contract capabilities.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/181305\/singapore-piloting-tokenized-fiat-smart-contract-capabilities","publishDate":"2022-10-31T06:09:10","id":6388,"type":null,"title":"Singapore pilots tokenized fiat with smart contract capabilities","category":["CENTRAL BANKS"],"content":["Singapore-based financial services group DBS is partnering with Open Government Products, a tech team within the Singapore government, to launch a live pilot for the issuance of purpose-bound money-based vouchers.","Notably, the vouchers are issued using tokenized Singapore dollars on a blockchain, according to an email from DBS.","The pilot is part of Project Orchid, led by the Monetary Authority of Singapore, which aims to enable a programmable digital Singapore dollar.&nbsp;DBS will issue digital Singapore dollars, while Open Government Products will enable smart contract capabilities.","The goal of this effort is to allow retail shopfronts to benefit from instant settlements, payments and collections through customer usage of the vouchers — purportedly increasing cash flow and saving time on administrative backend tasks, according to the email.","DBS claims the pilot may prove useful to the Community Development Council voucher scheme to assist with the negative effects of rising inflation and increased cost of living — again citing instantaneous payments and doing away with backend administration.","The live pilot will start relatively small, with six merchants and 1,000 select consumers.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Open Government Products","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"DBS","content":"ORGANIZATION"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Community Development Council","content":"ORGANIZATION"}],"hashtag":[],"authors":["Adam James","The Block"]}