{"summary":"Republican presidential candidates Asa Hutchinson, Vivek Ramaswamy and Democratic presidential candidate Dean Phillips spoke with CoinDesk, which was sponsoring the event, on Monday at the New Hampshire Institute of Politics at St. Anselm College. ","author":["Sarah Wynn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267125\/presidential-hopefuls-discuss-tornado-cash-and-pending-legislation-during-stand-with-crypto-event","publishDate":"2023-12-11T19:50:44","id":639,"type":null,"title":"Presidential hopefuls discuss Tornado Cash and pending legislation during Stand With Crypto event","category":["Policy"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">In a relatively rare move, U.S. presidential candidates got into the nitty gritty over cryptocurrency related issues at an event organized as part of Coinbase's grassroots initiative, Stand with Crypto.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Republican presidential candidates Asa Hutchinson, Vivek Ramaswamy and Democratic presidential candidate Dean Phillips spoke with CoinDesk, which was sponsoring the event, on Monday at the New Hampshire Institute of Politics at St. Anselm College.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Candidates got deep into the details — in particular Ramaswamy, who brought up Tornado Cash in his opening remarks. In August, a judge <a href=\"https:\/\/www.theblock.co\/post\/246100\/court-sides-with-government-in-coinbase-backed-lawsuit-over-tornado-cash-sanctions\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">agreed<\/span><\/a> with the Treasury Department after it sanctioned the crypto mixer last year. Critics in the crypto industry argued that Tornado Cash is not a person, but a software, criticizing Treasury's move and arguing it didn't have the authority to sanction the mixer.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Ramaswamy compared code to a \"form of speech.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Take what happened in the Tornado Cash case,\" Ramaswamy said. \"Penalizing an entire protocol or an entire way of doing business is illegal and unconstitutional under the current law in contrast to going after individual bad actors.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Crypto isn't very often brought up during presidential candidates. In a surprise, Republican presidential <a href=\"https:\/\/www.theblock.co\/post\/266601\/republican-presidential-debate-sees-candidates-discuss-sbf-binance-cbdcs-and-gary-gensler\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">candidates<\/span><\/a> talked about Binance, former FTX CEO Sam Bankman-Fried and Securities and Exchange Commission Chair Gary Gensler during last week's Republican presidential debate. Ramaswamy himself <\/span><span class=\"s3\" data-v-f87c67ca=\"\">unveiled his own crypto <a href=\"https:\/\/www.youtube.com\/watch?v=yAVWyTmgc5E\" data-v-f87c67ca=\"\"><span class=\"s4\" data-v-f87c67ca=\"\">plan<\/span><\/a> in front of the Texas Blockchain Council last month.&nbsp;<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">Phillips was asked on Monday by CoinDesk about what crypto businesses should do in the meantime, as the government looks to issue new legislation.<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">Phillips said he would consider a crypto market structure bill that was advanced over the House Financial Services Committee over the summer.&nbsp;<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">\"I do think that the FIT 21 bill is one that should be considered,\" Phillips said.<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">Phillips said he liked the privacy elements of crypto, but said it should not come at a cost and not be used nefariously.&nbsp;<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">\"I'm sure you would all agree with that and I think that's why we have to make thoughtful decisions,\" Phillips said. \"That's why I certainly don't come to you with my hardened heart, if you will, because I think these are the conversations that we need to start having and it's getting awfully late in the game to do so.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Hutchinson said on Monday that crypto \"is here to stay.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"I want to assure you that I want, under my administration, to make sure that crypto assets, the crypto industry flourishes,\" Hutchinson said. \"Let me repeat that, I want the crypto industry to flourish in America and that the United States will lead.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">To do that, rule clarification, \"continued consumer confidence,\" the \"ability to code,\" and energy that is affordable are needed, Hutchinson added.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Former President Donald Trump leads the Republican pool of candidates by far, according to news reports. Trump is followed by candidates Ron DeSantis, Nikki Haley, Ramaswamy, Chris Christie and lastly Hutchinson, according to <a href=\"https:\/\/projects.fivethirtyeight.com\/polls\/president-primary-r\/2024\/national\/\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">538<\/span><\/a>. President Joe Biden leads the polls by far for Democrats, followed by Marianne Williamson and Phillips, according to <a href=\"https:\/\/projects.fivethirtyeight.com\/polls\/president-primary-d\/2024\/national\/\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">538<\/span><\/a>.&nbsp;<\/span>"],"hashtag":[]}