{"summary":"A crypto-focused political action committee (PAC) has nabbed more than $20,000 to date from names like Coinbase CEO Brian Armstrong as well as Cameron and Tyler Winklevoss.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/59594\/winklevoss-twins-coinbases-armstrong-back-crypto-focused-pac-but-funds-will-flow-based-on-community-votes","publishDate":"2020-03-23T17:57:26","id":6393,"type":null,"title":"Winklevoss twins, Coinbase&#x27;s Armstrong back crypto-focused PAC, but funds will flow based on community votes","category":["REGULATION"],"content":["A cadre of well-known cryptocurrency investors has backed a newly-created political action committee (PAC) aimed at supporting campaigns of politicians who advocate for the technology.","Announced Monday, <a href=\"https:\/\/www.hodlpac.org\/\" data-v-f87c67ca=\"\">HODLpac<\/a> has registered with the Federal Election Commission (FEC) as a hybrid PAC. To date, it has more than $20,000 in contributions from the likes of Coinbase CEO Brian Armstrong and Gemini's Cameron and Tyler Winklevoss. HODLpac also boasts veterans of the intersection of the political and crypto spheres on its board, including Kristin Smith of the Blockchain Association.","Led by Tyler Whirty – an associate at venture capital firm the Takoma Group – the PAC is inspired by governance structures in the digital asset market, opting for a set-up that allows donors to vote on the candidates they would like to receive backing. The idea is to take a more decentralized approach than other PACs.","For every dollar donated, the contributor receives a so-called HODLvote; these HODLvotes are used to express their preference for a candidate or cause by spending them on \"Donation Points.\" Donation Points cost the square number of HODLvotes, meaning it takes four votes to buy two points, nine votes to buy three points and so on. This cuts the advantage of wealthier donors while also allowing all voters to express a degree of preference for multiple candidates, according to Whirty. Donation Points will be totaled and used to determine which candidates will receive funds from the PAC.&nbsp;&nbsp;","For now, crypto funds cannot be used for donations, but Whirty said he expects that to change.&nbsp;","Each community ballot period, the voting time, will last a week. As of now, there are four planned prior to Election Day on Nov. 3. The first is slated for May, when the PAC's board will select 10 candidates on which community members can spend their HODLvotes. At that point, folks who contributed $250 or more can nominate additional candidates.&nbsp;","For now, the board decides how to allocate funds, while the community decides to whom those funds go. As the community progresses, Whirty said the PAC may consider other ways of apportioning funds to popular candidates, like putting donation breakdowns to a Community Ballot. Additionally, the PAC plans to use the coming DAOs of its tech partner, <a href=\"https:\/\/medium.com\/peeps-democracy\/the-peeps-dao-is-coming-f13f13955357\" data-v-f87c67ca=\"\">We the Peeps<\/a>, to organize the use of independent expenditure funds.&nbsp; &nbsp;","In an interview with The Block, Whirty said those candidates would likely include some of the names in the Congressional Blockchain Caucus such as Florida Congressman Darren Soto (D-FL-9), who lead the <a href=\"https:\/\/soto.house.gov\/media\/press-releases\/rep-darren-soto-named-co-chair-congressional-blockchain-caucus\" data-v-f87c67ca=\"\">group<\/a> as co-chair.&nbsp;","As a hybrid PAC, it will have some of the capabilities of both a super PAC and a traditional PAC. As such, it will limit contributions to $5,000 per individual and only spend that amount on individual campaigns, per the rules of a PAC. Still, for any funds beyond that threshold, HODLpac will have the ability to collect and spend an unlimited amount of money on behalf of candidates, as per the rules of a super PAC.&nbsp;","\"We want to help those candidates who are supporting the decentralized economy and operate in a way that is inspired by that community,\" Whirty said.&nbsp;","While HODLpac's organization is a far cry from the corporate-backed super PACs derided by progressive politicians, some may still be skeptical of PAC money in politics. Whirty said the more decentralized governance of HODLpac makes it a new, more transparent iteration of the traditional PAC. But regardless of the zeitgeist surrounding money in politics, HODLpac can still connect donors with candidates that support their interests.","\"If we end being grouped in with other PACs then that is okay – in our HODLscore section we plan on hosting donation links to the individual candidates that are current and future champions of crypto-friendly policies so that HODLpac members can support them individually,\" said Whirty.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"Florida","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$5,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Kristin Smith","content":"PERSON"},{"type":"$20,000","content":"MONEY"},{"type":"Congressional Blockchain Caucus","content":"ORGANIZATION"},{"type":"Federal Election Commission (FEC","content":"ORGANIZATION"},{"type":"Tyler Winklevoss","content":"PERSON"},{"type":"Takoma Group","content":"ORGANIZATION"},{"type":"FL","content":"LOCATION"},{"type":"Tyler Whirty","content":"PERSON"},{"type":"Whirty","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Donation Points","content":"ORGANIZATION"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Nov. 3","content":"DATE"},{"type":"PAC","content":"ORGANIZATION"},{"type":"Community Ballot","content":"ORGANIZATION"},{"type":"$250","content":"MONEY"},{"type":"Darren Soto","content":"PERSON"}],"hashtag":["CONGRESS"],"authors":["Frank Chaparro","Aislinn Keely","The Block"]}