{"summary":"360 Mining plans to use funds raised in its latest round to increase natural gas production and mining capacity.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193399\/bitcoin-miner-360-mining-raises-2-25-million-as-it-scales-natural-gas-production","publishDate":"2022-12-08T18:37:57","id":6396,"type":null,"title":"Bitcoin miner 360 Mining raises $2.25 million as it scales natural gas production","category":["CRYPTO INFRASTRUCTURE"],"content":["Bitcoin miner 360 Mining raised $2.25 million in a new funding round and plans to deploy the funds to increase natural gas production and mining capacity.&nbsp;","The company's plans were revealed by Bitcoin mining software company Luxor, which <a href=\"https:\/\/luxor.tech\/corporate-news\/article\/luxor-technologies-participates-in-360-mining-growth-equity-round\" data-v-f87c67ca=\"\">said<\/a> it is participating in the funding around, along with BT Growth Capital.&nbsp;","360 Mining previously raised $6 million in a seed round in October 2021. The company is ramping up production at a time when some of the largest Bitcoin miners are <a href=\"https:\/\/www.theblock.co\/post\/181448\/bankruptcy-top-of-mind-as-miners-confront-market-downturn\" data-v-f87c67ca=\"\">struggling to pay the bills<\/a>. The fall of bitcoin value, combined with high spot energy prices and increased mining difficulty, has squeezed miner profits.","360 Mining currently operates a 2 megawatt capacity site in Texas, allowing for a hashrate of 45 PH\/s. The new funds will allow it to increase gas production eightfold, CEO Chris Alfano told The Block over Telegram. He anticipates adding 90 PH\/s by the first quarter of 2023.","\"We expect to replicate our model on larger gas assets that we can acquire throughout 2023,\" Alfano said, adding that the company plans to reach 50 megawatts of capacity by the end of next year.","Being fully integrated is a key part of the company's strategy to \"thrive in turbulent markets,\" the CEO explained.","\"By owning the underlying energy resource, 360 Mining is able to adapt and remain profitable in turbulent markets by monetizing produced gas across three uncorrelated markets,\" Luxor said in a statement. They include Bitcoin mining, traditional gas sales and electricity sales.","Access to low-cost energy has become essential to survival, and the <a href=\"https:\/\/www.theblock.co\/post\/161525\/a-land-use-dispute-in-colorado-spotlights-an-emerging-approach-to-powering-bitcoin-mining\" data-v-f87c67ca=\"\">use of stranded gas<\/a> by companies like Crusoe has grown in popularity.","360 Mining's natural gas, however, is not stranded — for many reasons. First, it \"provides a revenue stream uncorrelated to BTC\" and therefore more balance sheet flexibility, Alfano said. Second, it allows for greater gas volumes in a single location and thus more scalability.","\"Finding stranded gas is hard, finding large volumes of stranded gas is needle in the haystack,\" he added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Crusoe","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$2.25 million","content":"MONEY"},{"type":"first quarter of 2023","content":"DATE"},{"type":"Texas","content":"LOCATION"},{"type":"October 2021","content":"DATE"},{"type":"BT Growth Capital","content":"ORGANIZATION"},{"type":"Telegram","content":"LOCATION"},{"type":"$6 million","content":"MONEY"},{"type":"Alfano","content":"PERSON"},{"type":"Luxor","content":"LOCATION"},{"type":"Chris Alfano","content":"PERSON"}],"hashtag":["MINING COMPANIES"],"authors":["Catarina Moura","The Block"]}