{"summary":"Trust Wallet said it’s experiencing a Bitcoin node issue, responsible for users witnessing missed and failed transactions for several hours.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265408\/trust-wallet-bitcoin-transactions","publishDate":"2023-11-30T07:35:12","id":6399,"type":null,"title":"Trust Wallet says Bitcoin node issue is causing missing, failed transactions","category":["CRYPTO ECOSYSTEMS"],"content":["Binance-owned Trust Wallet has reported experiencing a Bitcoin node issue, leading to users experiencing failed or delayed transactions and missing transactional history in the wallet app.","The non-custodial wallet provider attributed the issue to a recent surge in Bitcoin transactions. “Increased transactions per block in the Bitcoin network are putting pressure on nodes, causing instability across providers,” the team <a href=\"https:\/\/x.com\/TrustWallet\/status\/1729947185049940320?s=20\" data-v-f87c67ca=\"\">posted<\/a> on X.","Trust Wallet said it was closely monitoring the situation, but “users may experience missing transaction history for the Bitcoin-blockbook chain, up to six hours, and failed transactions.” Bitcoin Blockbook, initially developed to support Trezor wallets, is a blockchain indexer and backend solution for cryptocurrency wallets, enabling efficient queries for specific information, like transaction history or wallet balances.&nbsp;","In response to the post, some users <a href=\"https:\/\/x.com\/plsxo2\/status\/1730054809431028156?s=20\" data-v-f87c67ca=\"\">complained<\/a> the issue had already been ongoing for several hours. Trust Wallet said it was working diligently to address the issue. However, there had been no update since yesterday at the time of publication.","Trust Wallet later <a href=\"https:\/\/x.com\/TrustWallet\/status\/1730264126830866841?s=20\" data-v-f87c67ca=\"\">updated<\/a> users on the issue, stating it had implemented a fix. \"We found that an address with extremely high volumes and frequency caused issues when interacting with our system,\" Trust Wallet said, assuring users all funds were and continue to be safe.","The seven-day moving average of transactions on the Bitcoin network reached a record high of over 600,000 this week, according to The Block’s data dashboard.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/transactions-on-the-bitcoin-network-daily\/embed\" title=\"Transactions on the Bitcoin Network (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The rise is mainly attributed to the latest surge in Bitcoin Ordinals inscriptions, frequently hitting 300,000 to 400,000 daily transactions over the last week, according to a Dune Analytics <a href=\"https:\/\/dune.com\/dataalways\/ordinals\" data-v-f87c67ca=\"\">dashboard<\/a>.","Average Bitcoin transaction fees also recently spiked to around $14 amid the surge, far higher than the usual $1 to $2 range but significantly less than the record average fees of over $50 in April 2021.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/average-transaction-fee-on-bitcoin-7dma\/embed\" title=\"Average Transaction Fee on Bitcoin (7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<em data-v-f87c67ca=\"\">Updated with Trust Wallet's response.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"$50","content":"MONEY"},{"type":"\" Trust Wallet","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"April 2021","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$14","content":"MONEY"},{"type":"$1","content":"MONEY"},{"type":"$2","content":"MONEY"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"last week","content":"DATE"},{"type":"Trust Wallet","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["BITCOIN","WALLETS"],"authors":["James Hunt","The Block"]}