{"summary":"Coinbase&#x27;s new report, conducted with The Block, reveals significant corporate adoption of crypto and web3 technologies.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235977\/more-than-50-of-fortune-100-companies-report-blockchain-initiatives-coinbase-finds","publishDate":"2023-06-22T09:07:54","id":6402,"type":null,"title":"More than 50% of Fortune 100 companies report blockchain initiatives, Coinbase finds","category":["EXCHANGES"],"content":["It looks like the crypto space might be bigger than the exchanges, DeFi projects, and trading firms that typically make news headlines.&nbsp;","As per a new <a href=\"https:\/\/assets.ctfassets.net\/c5bd0wqjc7v0\/6ZxyPKS945KFnSVH0vPEuW\/e7fb242895b1919581993d18db876738\/The_State_of_Crypto_-_Corporate_Adoption_-_Coinbase.pdf\" data-v-f87c67ca=\"\">report<\/a> conducted by crypto exchange Coinbase, more than 50% of Fortune 100 companies have had crypto projects in the works at varying stages of development since the beginning of 2020. Currently about 60% of Fortune 100 projects have been underway since the start of 2022.","<span data-v-f87c67ca=\"\">Fortune 100 companies: A quarterly breakdown of initiatives by stage.<\/span>","Titled \"The State of Crypto: Corporate Adoption,\" the report revealed 52% of Fortune 100 companies are investing in crypto or blockchain initiatives since the start of 2020. As of Q2 2023, 70% of Fortune 100 companies with crypto initiatives were in the publicly launched stage, the highest level since Q1 2020.","The report is based on an analysis of Fortune 100 web3 activity by <a href=\"https:\/\/www.theblock.pro\/\" data-v-f87c67ca=\"\">The Block Research<\/a>, and a survey of Fortune 500 executives conducted by a third-party research firm on behalf of Coinbase.","\"These companies are innovating and investing in these technologies because they know that the century-old global financial system needs updating, that blockchain can be a foundational solution, and that not keeping pace will mean losing ground in this global economy to competitors around the world, among other possible reasons,\" Coinbase noted.&nbsp;","Still, regulatory uncertainty and the lack of clear rules for crypto and <a href=\"https:\/\/www.theblock.co\/post\/234990\/blockchain-association-wants-to-know-more-about-secs-interactions-with-prometheum\" data-v-f87c67ca=\"\">blockchain<\/a> tech remain significant barriers to adoption, with 87% of surveyed executives indicating clear rules are vital for sustaining U.S. leadership in the global financial system.","\"The U.S. is at risk of losing out on 1 million web3 developer jobs and 3 million related non-technical jobs to other countries between now and 2030 if it continues on its current path of regulation by enforcement,\" the report claimed.","A key finding of the report was that since 2017, Fortune 100 companies have made 109 private venture capital investments in 80 crypto blockchain startups, contributing to rounds worth over $8 billion.","The report added that Citi Ventures, Google Ventures, <a href=\"https:\/\/www.theblock.co\/linked\/54799\/samsung-and-salesforce-ventures-join-digital-assets-series-c-funding-round-as-microsoft-vet-joins-its-board-of-directors\" data-v-f87c67ca=\"\">Microsoft Ventures<\/a>, and <a href=\"https:\/\/www.theblock.co\/post\/229922\/goldman-sachs-moodys-digital-assets-blockchain-network-canton\" data-v-f87c67ca=\"\">Goldman Sachs<\/a> have made as many crypto private investments as all other <a href=\"https:\/\/www.theblockresearch.com\/nearly-75-of-fortune-100-firms-have-explored-blockchain-initiatives-68506\" data-v-f87c67ca=\"\">Fortune 100<\/a> companies combined, and a survey of Fortune 500 executives revealed that they expect an average web3 initiative budget of nearly $5.8 million for 2023, with a notable increase in investment in these technologies expected over the next two years.","The report indicated that while <a href=\"https:\/\/www.theblock.co\/post\/235953\/foundation-claims-to-fix-self-destruct-feature-that-could-have-wiped-out-its-nfts\" data-v-f87c67ca=\"\">non-fungible tokens<\/a> (NFTs) may not be the primary focus of many Fortune 100 companies' projects and plans, they are driving a surge in the retail sector's web3 initiatives. This move diversifies participation beyond just tech and financial services and provides companies with a pathway to return on investment.","Across 199,347 transactions, Fortune 100 companies in the U.S. have amassed a cumulative royalty revenue of approximately $101.3 million, facilitated by 118,354 distinct consumers.","By category, NFTs made up 11% of Fortune 100 companies investments in web3 and blockchain, while financials services made up 24%. DeFi investments made up just 1%.","<span data-v-f87c67ca=\"\">The State of Crypto: Corporate Adoption report - Fortune 500<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"70%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Google Ventures","content":"ORGANIZATION"},{"type":"Citi Ventures","content":"ORGANIZATION"},{"type":"The State of Crypto","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"60%","content":"PERCENT"},{"type":"52%","content":"PERCENT"},{"type":"$101.3 million","content":"MONEY"},{"type":"2030","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"The U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"87%","content":"PERCENT"},{"type":"$5.8 million","content":"MONEY"},{"type":"11%","content":"PERCENT"},{"type":"Microsoft Ventures","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"24%","content":"PERCENT"},{"type":"1%","content":"PERCENT"},{"type":"2020","content":"DATE"},{"type":"$8 billion","content":"MONEY"}],"hashtag":["COINBASE","CRYPTO"],"authors":["Brian McGleenon","The Block"]}