{"summary":"Several parties are all pushing back on Celsius&#x27;s request to further extend its timeline for filing a Chapter 11 restructuring plan.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210028\/celsius-extension-request-denied-by-us-trustee-and-creditors-as-cash-burn-continues","publishDate":"2023-02-09T05:56:23","id":6408,"type":null,"title":"Celsius&#x27; extension request denied by US trustee and creditors as cash burn continues","category":["POLICY"],"content":["Several parties have objected to bankrupt crypto lender Celsius's motion to extend its timeline for filing a Chapter 11 restructuring plan once again.","The crypto lender, which <a href=\"https:\/\/www.theblock.co\/post\/157491\/crypto-lender-celsius-declares-chapter-11-bankruptcy-in-new-york\" data-v-f87c67ca=\"\">filed<\/a> for Chapter 11 bankruptcy protection in July 2022, <a href=\"https:\/\/cases.stretto.com\/celsius\/court-docket\/#search\" data-v-f87c67ca=\"\">filed<\/a> a motion on Jan. 25 to extend its exclusivity period — the time when it maintains the exclusive right to submit a Chapter 11 reorganization plan – by 44 days on March 31 and to solicit votes on the plan through to June 30.","The unsecured committee of creditors, Celsius borrowers and the U.S. trustee have all <a href=\"https:\/\/cases.stretto.com\/celsius\/court-docket\/#search\" data-v-f87c67ca=\"\">pushed<\/a> back on this request.","\"Given the rate at which professionals are consuming debtors’ assets, a further extension through June 31st without a proper basis is inappropriate,\" said William Harrington, the U.S. trustee, a Department of Justice official responsible for overseeing the administration of the bankruptcy case, in a filing.","\"Notwithstanding the debtors’ lip service to the volume of creditors in this case needing to be sent the plan and disclosure statement, it cites to no other case being granted such a long extension for solicitation during one motion for exclusivity,\" he added.","Celsius borrowers echoed these concerns in their own objection citing that Celsius was \"consuming enormous amounts of professional fees and the outcome remains highly uncertain.\"","The Chapter 11 bankruptcy process allows for the debtor to file a plan of reorganization. It is typically expected to be filed within four months. The lender already <a href=\"https:\/\/www.theblock.co\/post\/192418\/celsius-extension-chapter-11-reorganization\" data-v-f87c67ca=\"\">received<\/a> court approval to extend its exclusivity period to Feb. 15 after filing a motion in November 2022.","\"This extension is critical to allow the debtors to reach the finish line of these Chapter 11 cases swiftly and efficiently, unobstructed by the disruption of competing plans,\" said Celsius's lawyers in the motion filing. \"The debtors are well on their way to a value-maximizing conclusion to these Chapter 11 cases with the imminent filing of the plan.\"","There will be a hearing on the motion on Feb. 15.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 31st","content":"DATE"},{"type":"March 31","content":"DATE"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"June 30","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Celsius","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"William Harrington","content":"PERSON"},{"type":"Feb. 15","content":"DATE"},{"type":"Jan. 25","content":"DATE"},{"type":"July 2022","content":"DATE"},{"type":"November 2022","content":"DATE"}],"hashtag":["BANKRUPTCY FILINGS","CRYPTO BANKS AND LENDERS","INVESTMENT FIRMS"],"authors":["Kari McMahon","The Block"]}