{"summary":"Nirmala Sitharaman, finance minister of current G20 president India, said the group of major economies is discussing coordinated crypto regulation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210817\/g20-exploring-coordinated-crypto-regulation","publishDate":"2023-02-11T06:35:21","id":6414,"type":null,"title":"G20 exploring coordinated crypto regulation: Reuters","category":["INTERNATIONAL POLICYMAKING"],"content":["Nirmala Sitharaman, finance minister of current G20 president India, said the group of major economies is exploring whether it can coordinate on crypto regulation.","Sitharaman — whose government, under Prime Minister Narendra Modi, and central bank have long debated laws potentially banning cryptocurrencies — cited the sophisticated technology underpinning virtual assets as requiring discussion on regulatory actions, Reuters <a href=\"https:\/\/www.reuters.com\/world\/india\/g20-exploring-cryptocurrency-regulation-indias-finance-minister-says-2023-02-11\/\" data-v-f87c67ca=\"\">reported<\/a>. \"We are talking to all nations, that if it requires regulation, then one country alone cannot do anything,\" Sitharaman said.","\"We are talking with all nations, if we can make some standard operating procedure which is followed by everyone to make a regulatory framework, and if it can be effective,\" Sitharaman added.","Though the Indian government and the Reserve Bank of India have historically been opposed to decentralized cryptocurrencies, the central bank has shown a keen interest in central bank digital currencies. Late last year, it <a href=\"https:\/\/www.theblock.co\/post\/181369\/india-to-test-if-digital-rupee-can-cut-fees-when-trading-government-securities\" data-v-f87c67ca=\"\">began<\/a> a pilot for a wholesale digital rupee to reduce transaction costs and the need for collateral when trading government securities.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"the Reserve Bank of India","content":"ORGANIZATION"},{"type":"Narendra Modi","content":"PERSON"},{"type":"G20","content":"ORGANIZATION"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"India","content":"LOCATION"},{"type":"Sitharaman","content":"PERSON"},{"type":"Nirmala Sitharaman","content":"PERSON"}],"hashtag":[],"authors":["Adam James","The Block"]}