{"summary":"Scammers are using verified accounts on Twitter to pose to be the official Moonbirds account in an attempt to pilfer funds.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/142403\/latest-twitter-scam-aims-to-capitalize-on-moonbirds-success-and-snares-bernie-sanders-sons-verified-account","publishDate":"2022-04-18T17:07:44","id":6416,"type":null,"title":"Latest Twitter scam aims to capitalize on Moonbirds success — and snares Bernie Sanders&#x27; son&#x27;s verified account","category":["STARTUPS"],"content":["If you haven’t yet heard about Moonbirds, there are two big things to know.","For starters, Moonbirds is the latest non-fungible token (NFT) collection to reach blue-chip status, garnering over $200 million in sales volume this weekend.","But its success has also attracted a swarm of scammers who are using verified, apparently stolen Twitter accounts in an attempt to exploit the enthusiasm around the project and pilfer funds from users on the social media site.","“What are these Twitter @verfied accounts that keep spamming my mentions to promote NFT drops but then no crypto or NFT people follow them? This is bizarre,\" <a href=\"https:\/\/twitter.com\/laurashin\/status\/1516036447849046016\" data-v-f87c67ca=\"\">tweeted<\/a> journalist Laura Shin, who appears to be just one of the dozens of users on the receiving end of the spam messages.","Justin Mezzell, a co-founder of Proof Collective, the group behind the Moonbirds collection, <a href=\"https:\/\/twitter.com\/JustinMezzell\/status\/1516036459626696715\" data-v-f87c67ca=\"\">tweeted<\/a> Monday morning that “these are scammers who purchase verified accounts\" and pretend to be involved with the Moonbirds project.","It’s unclear if all the scam accounts are hacked accounts of actual verified users or if the verification status is purchased. Twitter did not address this question when contacted by The Block.","In one instance, U.S. Senator Bernie Sanders’s son <a href=\"https:\/\/twitter.com\/Celentra\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Levi Sanders’s account<\/a> appeared to be hijacked, with the account name changed to “Moonbirds.” The hijackers of the account then tweeted a link encouraging people to enter a giveaway. What followed were dozens of other tweets from the account that tagged Twitter users.&nbsp;","&nbsp;","<span data-v-f87c67ca=\"\">Screenshot of Levi Sanders's hacked Twitter account<\/span>","Sanders' account appears to have been re-controlled, with the handle changed back to \"Levi Sanders\" and some of the offending messages removed. However, numerous posts tagging numerous users are still available as of the time of writing.&nbsp;","The scams follow the same pattern as other recent NFT-related scams on Twitter. Just last week, Twitter users were <a href=\"https:\/\/twitter.com\/Yennkhai\/status\/1514274909664395267\" data-v-f87c67ca=\"\">raising alarms<\/a> about verified accounts that were tagging users to click on a fake free NFT airdrop link for Azuki, an NFT collection of 10,000 avatars.","Last month, scammers used verified Twitter accounts to <a href=\"https:\/\/twitter.com\/takenstheorem\/status\/1507183344915816453\" data-v-f87c67ca=\"\">steal a reported $1 million<\/a> in a fake ApeCoin airdrop. One victim <a href=\"https:\/\/twitter.com\/zachxbt\/status\/1507145844340015112?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1507145844340015112%7Ctwgr%5E%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fdecrypt.co%2F95995%2Ftwitter-scam-accounts-steal-million-fake-ape-coin-airdrop\" data-v-f87c67ca=\"\">lost $500,000<\/a> worth of NFTs after connecting his wallet and approving transactions on a scam website.","It’s unclear what steps Twitter may take to prevent future scams of this kind. The company, which started offering <a href=\"https:\/\/www.theblockcrypto.com\/post\/131235\/twitters-roll-out-of-nft-profile-pictures-offers-insight-into-what-users-really-want\" data-v-f87c67ca=\"\">NFT profile pictures<\/a> earlier this year, doesn’t state in its current “Misleading &amp; Deceptive Identities” <a href=\"https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-impersonation-and-deceptive-identities-policy#:~:text=You%20may%20not%20impersonate%20individuals,people%20can%20find%20authentic%20voices\" data-v-f87c67ca=\"\">policy<\/a> what happens when scammers hijack verified accounts like Sanders’ to deceive users.","The company’s “spam” <a href=\"https:\/\/help.twitter.com\/en\/rules-and-policies\/platform-manipulation\" data-v-f87c67ca=\"\">policy<\/a> states that spamming can lead to temporary account locks or permanent suspension. But this would punish the users whose accounts were hacked versus the hackers themselves.","At the moment, users who are aware of the issues are reporting the scam accounts and <a href=\"https:\/\/twitter.com\/mdudas\/status\/1516060109637570564\" data-v-f87c67ca=\"\">warning others<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Laura Shin","content":"PERSON"},{"type":"Bernie Sanders","content":"PERSON"},{"type":"“Misleading &amp; Deceptive Identities”","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"weekend","content":"DATE"},{"type":"Sanders","content":"PERSON"},{"type":"$500,000","content":"MONEY"},{"type":"Twitter","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Justin Mezzell","content":"PERSON"},{"type":"$1 million","content":"MONEY"},{"type":"morning","content":"TIME"},{"type":"Levi Sanders","content":"PERSON"},{"type":"last week","content":"DATE"},{"type":"Moonbirds","content":"PERSON"},{"type":"$200 million","content":"MONEY"}],"hashtag":["TWITTER"],"authors":["Anushree Dave","The Block"]}