{"summary":"The Hong Kong Monetary Authority published an 11-page circular Tuesday on its standards for digital asset custody.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278300\/hong-kong-lays-out-provisional-guidance-for-crypto-custody","publishDate":"2024-02-20T21:14:21","id":6417,"type":null,"title":"Hong Kong lays out provisional guidance for crypto custody","category":["ASIA"],"content":["<span data-v-f87c67ca=\"\">The Hong Kong Monetary Authority (HKMA) published an 11-page circular Tuesday on its standards for tokenization and digital asset custody for locally authorized institutions.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The <\/span><a href=\"https:\/\/www.hkma.gov.hk\/media\/eng\/doc\/key-information\/guidelines-and-circular\/2024\/20240220e4.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">document<\/span><\/a><span data-v-f87c67ca=\"\"> asked institutions to commit to comprehensive risk assessments and allocate sufficient resources for proper governance and risk management of their crypto custody services. Additionally, the HKMA requested the entities to establish internal policies to properly address potential or existing conflicts of interest.<\/span>","<span data-v-f87c67ca=\"\">Such authorized institutions are also expected to segregate client assets from company assets and maintain contingency and disaster recovery plans to lessen “the risk of loss of client digital assets due to theft, fraud, negligence or other acts of misappropriation, as well as delayed access or inaccessibility of client digital assets,\" the HKMA guidance said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Other requirements from Hong Kong’s de facto central bank include the full disclosure of risks involved with crypto custody arrangements and compliance with its anti-money laundering and countering terrorist financing guidance.<\/span>","<span data-v-f87c67ca=\"\">“Such [authorized institutions] or the relevant locally incorporated authorized institutions (with subsidiaries already engaging in such activities) should notify the HKMA and confirm that they meet the expected standards in the Annex within six months from the date of this circular,” the HKMA noted.<\/span>","<span data-v-f87c67ca=\"\">The guideline follows <\/span><a href=\"https:\/\/www.theblock.co\/post\/258733\/hong-kong-regulator-updates-policy-for-virtual-asset-activities\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Hong Kong’s<\/span><\/a><span data-v-f87c67ca=\"\"> recent movement to regain its position as Asia’s crypto hub. In June 2023, the region officially started its crypto licensing regime for virtual asset trading platforms, allowing licensed exchanges to offer retail trading services. Hong Kong has granted licenses to two platforms — HashKey and OSL.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Hong Kong Monetary Authority (HKMA","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"HKMA","content":"ORGANIZATION"},{"type":"Asia","content":"LOCATION"},{"type":"OSL","content":"ORGANIZATION"},{"type":"June 2023","content":"DATE"}],"hashtag":["ASIAN REGULATION"],"authors":["Danny Park","The Block"]}