{"summary":"An attacker has siphoned about $3 million in crypto from a DeFi protocol called Deus Finance DAO by means of a flash loan exploit.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/137817\/deus-finance-dao-suffers-3-million-flash-loan-attack","publishDate":"2022-03-15T07:40:35","id":6422,"type":null,"title":"Deus Finance DAO suffers $3 million flash loan attack","category":["DEFI"],"content":["Multi-chain DeFi protocol Deus Finance DAO has become the latest victim of a flash loan exploit, adding to the <a href=\"https:\/\/www.theblockcrypto.com\/daily\/108081\/flash-loans-a-blessing-or-a-curse\" data-v-f87c67ca=\"\">controversy surrounding flash loans<\/a> and the potential danger they pose to DeFi protocols.","The attacker reportedly earned about $3 million from the attack. Despite the attack, the Deus Finance team says funds are safe and that it will publish a post-mortem in due course.","According to blockchain security outfit PeckShield, the attacker <a href=\"https:\/\/twitter.com\/PeckShieldAlert\/status\/1503654217927786503\" data-v-f87c67ca=\"\">used<\/a> flash loans to carry out the attack. Flash loans are popular in the DeFi space as they allow users to borrow huge amounts of crypto without collateral — and at a relatively low cost — but require the loan to be repaid within the same transaction.","The exploit targeted the project’s stablecoin lending contract. The borrowed cash was used to manipulate the price oracle — a tool that provides price information to the blockchain — for the USD Coin\/DEI (USDC\/DEI) stablecoin trading pair.","By manipulating the price oracle, the attacker caused the lending positions of some users to become insolvent. The attacker then repaid the loans but still made away with about $3 million worth of DEI as profit. DEI is an algorithmic stablecoin in the Deus ecosystem.","Following the flash loan exploit, the attacker proceeded to <a href=\"https:\/\/etherscan.io\/txs?a=0x1ed5112b32486840071b7cdd2584ded2c66198dd\" data-v-f87c67ca=\"\">launder<\/a> the proceeds from the attack via Tornado Cash. Data from Etherscan show about 1,180 ETH ($2.9 million) has already been washed via Tornado Cash.","Following the attack, Deus Finance <a href=\"https:\/\/twitter.com\/DeusDao\/status\/1503652836978143242\" data-v-f87c67ca=\"\">stated<\/a> that the tokens are unaffected but that it has paused the lending contract targeted by the exploit and will carry out a comprehensive review of the matter.","The team promised to refund users liquidated by the flash loan attack. But it maintained that the incident did not lead to “an ecosystem wide exploit.”","DEUS, the project’s native coin initially suffered a 44% <a href=\"https:\/\/dexscreener.com\/fantom\/0x2599eba5fd1e49f294c76d034557948034d6c96e\" data-v-f87c67ca=\"\">slump<\/a> against Fantom (FTM) — the pair with the largest trading volume — following the news of the attack. The coin’s price has since posted a significant recovery and is up almost 20% in the last hour as of the time of writing.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$2.9 million","content":"MONEY"},{"type":"Deus Finance","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"oracle","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"FTM","content":"ORGANIZATION"},{"type":"Deus Finance DAO","content":"ORGANIZATION"},{"type":"$3 million","content":"MONEY"},{"type":"44%","content":"PERCENT"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}