{"summary":"Encryption protocol Elusiv has released one of the first-ever methods to privately trade assets on Solana.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246704\/elusiv-solana","publishDate":"2023-08-22T09:01:13","id":6427,"type":null,"title":"Elusiv rolls out &#x27;private token swaps&#x27; feature on Solana","category":["DEFI"],"content":["Encryption protocol Elusiv introduced one of the first methods for private decentralized asset trading on Solana.","Available through the Elusiv web app, the newly introduced “private token swaps” feature enables users to exchange crypto assets without disclosing their public wallet address information on the blockchain.","“Users and seasoned traders alike can hide their transaction history, trading strategies, and assets by decoupling token swaps and public keys, paving the way for open and fair DeFi,” said Julian Deschler, co-founder of Elusiv.","Elusiv’s private token swaps aim to reduce counterparty risk by using zero-knowledge proofs to encrypt users’ public keys. This approach ensures that the amounts swapped or traded within users’ wallets cannot be connected to their actual wallet addresses.","Inside the Elusiv app, users are required to deposit funds into a private balance before sending or swapping tokens — all without exposing their public key. The procedure includes the use of a temporary key, acting as a burner account, which disconnects the link between a user’s public key and encrypts the source of the transactions.","“Elusiv Privacy represents the future of blockchain transactions — achieving a seamless blend of zero-knowledge privacy, efficiency, and instantaneous settlement,” Anatoly Yakovenko, co-founder of Solana, said in a statement shared with The Block via a representative.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Elusiv Privacy","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Julian Deschler","content":"PERSON"},{"type":"Anatoly Yakovenko","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"}],"hashtag":["ASSETS","DEXS"],"authors":["Vishal Chawla","The Block"]}