{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley. They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/11911\/tezos-litigation-potentially-slowed-by-plaintiff-problems","publishDate":"2019-02-15T13:09:33","id":6428,"type":null,"title":"Tezos litigation potentially slowed by plaintiff problems","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]In Re Tezos Securities Litigation, 17-cv-06779-RS, N.D.Cal., Doc. # 201, 2\/7\/19 (“Defendants’ Arthur Breitman, Kathleen Breitman, and Dynamic Ledger Solutions. Inc.’s Response to Plaintiffs’ Motion to Substitute New Lead Plaintiff“) [SDP]<\/strong><\/em>","Class action litigation may seem complicated but like a lot of law it boils down to certain common-sense principles. One of the basic ideas behind this whole structure is that it’s more efficient to have one or a handful of people litigate claims on behalf of a big group of people than have thousands of people file separate lawsuits. There’s a flip side, though: you have to make sure that you choose the right class representative (and lawyers) to adequately represent the class' interests.","Lawyers for Arthur and Kathleen Breitman and Dynamic Ledger Solutions, Inc. (“the Tezos defendants”) argue in their most recent filing in the Tezos consolidated class action that determining adequacy of the lead plaintiff is up to the Court in securities class actions, under a federal law called the Private Securities Litigation Reform Act (“PSLRA”).","They argue that while the previously selected lead plaintiff, Arman Anvari, is a demonstrable no-goodnick, lead counsel’s attempt to replace him with a new “hand-picked client” shouldn’t be allowed. Instead, they want any proposed new lead plaintiff to be approved by the Court, to file their own new lawsuit and give the DLS defendants a chance to move to dismiss. This would, of course, stay any briefing or decision on the Motion for Class Certification filed on Jan. 10, for which a hearing was set for July 31.","A new Complaint and Motion to Dismiss would give the DLS defendants a couple of things — first, it would buy them time. Spitballing a bit, this would push class cert briefing and arguments down the road at least another six months. Second, it would give the defendants the opportunity to potentially do more discovery and reopen arguments about whether the plaintiff had “actual notice” of the contribution terms or was in the U.S. at the time he made his contribution\/investment:","“regardless of who is appointed to serve as the new lead plaintiff, DLS Defendants request that the Court order the filing of a new complaint and provide DLS Defendants with an opportunity to move to dismiss. To facilitate a swift resolution of any motion to dismiss, the lead plaintiff should be required to plead facts regarding their knowledge of the Contribution Terms, and explain their residency and their location at the time they contributed to the fundraiser.”","An interesting feature of the motion is that it contains an extended discussion that alleges that Anvari wrote things that were “racist, homophobic, and anti-Semitic, some of them even directed at those involved in the Tezos Project and other Defendants.” Whether or not this is true — and I am sure that the Defendants’ counsel believes it is, or they wouldn’t make the argument — doesn’t really matter, of course, if Anvari is no longer going to be lead plaintiff. It’s also irrelevant to the question of whether the so-called “contribution event” was an unregistered securities offering. So … why point this out? We have to speculate a little bit, but perhaps they think it doesn’t reflect well on counsel to propose a class representative and then withdraw him because of this sort of information. In other words, maybe it’s a credibility argument. As a rhetorical matter, it also deflects attention away from the defendants' own alleged unlawful actions.","Another observation, more about tactics, is that you are often better off in litigation if your adversaries are bickering amongst themselves. Some of that is happening here too, as other law firms propose their own plaintiffs and offer themselves as class counsel. It’s usually a plaintiff who benefits from defendants fighting. In class action litigation, as in this case, it can often be the opposite. Your adversaries fight amongst themselves, everything slows down.","Finally, and unrelated to these musings about tactics — one last interesting tidbit in the briefing is the fact that there was apparently a day-long mediation, which failed.","As of the date of this blog post, we don’t have a response from Anvari’s counsel. I imagine they will have something to say, and if so perhaps we’ll cover it here. The takeaway, though — the Tezos litigation may be slowed down a tetch because of plaintiff problems, depending on how the Court sees things. We don’t seem any closer to class certification, or a ruling from this Court on whether Tezzies are securities. That may not come for a while.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part I of this week's analysis,&nbsp;Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"the Court","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Jan. 10","content":"DATE"},{"type":"Kathleen Breitman","content":"PERSON"},{"type":"SDP","content":"ORGANIZATION"},{"type":"Arthur Breitman","content":"PERSON"},{"type":"Dynamic Ledger Solutions, Inc.","content":"ORGANIZATION"},{"type":"Tezos Project","content":"ORGANIZATION"},{"type":"Complaint and Motion to Dismiss","content":"ORGANIZATION"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"},{"type":"Court","content":"ORGANIZATION"},{"type":"Dynamic Ledger Solutions","content":"ORGANIZATION"},{"type":"July 31","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Arman Anvari","content":"PERSON"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"Arthur","content":"PERSON"},{"type":"DLS Defendants","content":"ORGANIZATION"},{"type":"DLS","content":"ORGANIZATION"},{"type":"Anvari","content":"PERSON"},{"type":"Doc","content":"PERSON"},{"type":"Palley","content":"PERSON"}],"hashtag":[],"authors":["Stephen D. Palley","The Block"]}