{"summary":"A Uniswap V3 NFT has been sold for 310 ETH (about $520,000) to a DAO.\nThe DAO could buy more art pieces with its current treasury worth about $200,000, Alex Svanevik, Nansen CEO and a DAO member, told The Block.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/99615\/uniswap-v3-nft-sold-dao-half-million-dollars","publishDate":"2021-03-27T10:25:09","id":643,"type":null,"title":"Uniswap V3 NFT has been sold for more than half a million dollars","category":["NFTs"],"content":["An animated video that was recently used by <a href=\"https:\/\/twitter.com\/Uniswap\/status\/1374069664297406467\" data-v-f87c67ca=\"\">Uniswap to promote its V3 platform<\/a> has been sold in the form of a non-fungible token (NFT).","The video and the NFT were created by the artist named \"@pplpleasr1,\" and it has fetched the price of 310 ether (ETH), currently worth about $520,000.","The buyer of the NFT is a first-of-its-kind decentralized autonomous organization (DAO) called \"<a href=\"https:\/\/twitter.com\/pleasrdao\" data-v-f87c67ca=\"\">pleasrdao<\/a>.\" The DAO, <a href=\"https:\/\/twitter.com\/lay2000lbs\/status\/1375195529504829443\" data-v-f87c67ca=\"\">ideated by<\/a> PoolTogether co-founder Leighton Cusack, was specifically formed to buy the NFT.","\"Pplpleasr created the most iconic NFT ever to have been minted on any blockchain,\" Alex Svanevik, CEO of crypto data platform Nansen and a member of the DAO, told The Block.","\"Pplpleasr inspired us to drive forward a community-first approach,\" he said. \"The charity angle she took as well was great.\"","Pplpleasr is donating the whole amount to the <a href=\"https:\/\/www.standwithasians.com\/\" data-v-f87c67ca=\"\">Stand With Asians<\/a> movement to help stop hate crimes and discrimination against Asian Americans and pacific islanders.","Commenting on the sale, Pplpleasr <a href=\"https:\/\/twitter.com\/pplpleasr1\/status\/1375626092011081733?s=20\" data-v-f87c67ca=\"\">said<\/a> she is \"moved beyond words\" and that the funds \"will not go to waste, I promise.\"","The NFT took Pplpleasr \"a little over a month\" to produce, <a href=\"https:\/\/twitter.com\/Cryptoyieldinfo\/status\/1375649104592707587?s=20\" data-v-f87c67ca=\"\">she said<\/a> in a video explaining her artwork. The piece <a href=\"https:\/\/foundation.app\/pplpleasr\" data-v-f87c67ca=\"\">was sold on<\/a> the NFT marketplace Foundation.App.","While the DAO was initially created to buy the Uniswap V3 NFT, it is now contemplating buying more art pieces from its treasury, Svanevik told The Block. The DAO treasury is currently worth about $200,000 in ETH, said Svanevik.","More than 30 people from the Ethereum community are part of the DAO, <a href=\"https:\/\/twitter.com\/_jamiis\/status\/1375635300005871616\" data-v-f87c67ca=\"\">including<\/a> Calvin Liu of Compound, Tarun Chitra of Gauntlet Network, and Andrew Kang of Mechanism Capital, Svanevik told The Block.","\"The future is community ownership,\" <a href=\"https:\/\/twitter.com\/Rewkang\/status\/1375707687720165380?s=20\" data-v-f87c67ca=\"\">according to Kang<\/a>. \"Not only do we get to 'win' with friends, but our collective ownership and appreciation of the NFT (and the incredible story), imposes more value for the NFT than if any individual\/central entity owned it themselves,\" <a href=\"https:\/\/twitter.com\/Rewkang\/status\/1375707710432235521?s=20\" data-v-f87c67ca=\"\">he said<\/a>.","Besides possibly buying more NFTs in the future, the DAO could also \"commission art from artists\" that it wants to support, Svanevik told The Block. \"Also, given the DeFi experience present in the DAO, we might experiment with bringing NFTs and DeFi together,\" he said."],"hashtag":["UNISWAP"]}