{"summary":"The crypto conference scene’s plans for 2023 have remained surprisingly robust in the face of market turmoil.\nOrganizers have been at pains to stand out amid a calendar that has reached saturation point. ","author":["RT Watson","Lucy Harley-McKeown","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195621\/swanky-crypto-meetup-scene-unlikely-to-cool-down-much-despite-downturn","publishDate":"2022-12-16T11:50:37","id":644,"type":null,"title":"Swanky crypto meet-up scene unlikely to cool down much despite downturn","category":["Companies"],"content":["<span data-contrast=\"none\" data-v-f87c67ca=\"\">Optimism may remain&nbsp;in short supply across the cryptoverse for some time to come, but that isn’t stopping conference organizers from staging a&nbsp;staggering number of events in the year ahead.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:0,&quot;335551620&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Champagne-fueled 'panels’ hosted in London’s Shard, <\/span><a href=\"https:\/\/www.nytimes.com\/2022\/12\/01\/style\/crypto-awards.html\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">free diamonds<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\">, Dubai yacht parties, supermodels in the Bahamas, private concerts with Grimes, corporate boxes at the Formula 1 Grand Prix, the list goes on. Even with the arrival of a prolonged bear market 2022’s event schedule may have been the busiest and most decadent on record, with thousands of speakers speaking to thousands more attendees. <\/span>&nbsp;","<span data-contrast=\"none\" data-v-f87c67ca=\"\">And while many insiders expect event organizers will scale back in 2023 and aim to spend with greater care, crypto enthusiasts eager to mingle will have a wide array of events to attend, especially if money and geography are not an obstacle. The question is, how will organizers balance sponsors' money wisely while simultaneously attracting top-flight speakers capable of luring droves of attendees willing to spend hundreds, if not thousands, of dollars on a handful of days of networking. <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:0,&quot;335551620&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“Bear markets are the time for reputable brands to stand out,” said Jason Yanowitz, co-founder of Blockworks’ Permissionless, which was held in Palm Beach, Fla. this year. “In bull markets, every company can sponsor a show. In bear markets, only the best companies tend to represent at events.”<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">This year's edition scored about 100 sponsors including major U.S.-based exchange Coinbase, which charged $2,500 for three-day general admission passes and hosted more than 5,000 attendees, according to Permissionless’ website.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Tickets for 2023 have been in “surprisingly high demand,” said Yanowitz, with the first batch of tickets selling out in six hours. Now there is a waitlist longer than the total number of available tickets, he added.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">NFT Paris co-founder Alexandre Tsydenkov echoed Yanowitz’s sentiments with regard to companies' commitment to the event circuit. “The more mainstream brands aren’t so bothered about crypto winter,” he said in an interview with The Block. “They don’t care about token prices.”<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Tsydenkov said he and his team are trying to craft the second edition of NFT Paris, which is scheduled for February, around immersive experiences and specially curated stages. They have decided to limit the number of speakers to 100 opposed to other similar — but unaffiliated — events like NFT LA and NFT.NYC, which this year hosted 250 and 1,500 speakers, respectively.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Wrangling 250 speakers wasn’t as difficult as deciding on who to invite, said Josh Kriger, who as the co-host of the “Edge of NFT” podcast, also organized NFT LA. “There were thousands of applicants,” he said. “The bigger challenge was narrowing down the pool of immensely qualified folks while being inclusive.”<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:0,&quot;335551620&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">While most event planners and sponsors largely exude optimism when describing the conference scene, others say there are steps that could be taken to improve things. “At the moment a lot of these events can feel disjointed and disorganized, and I think there is room for improvement in terms of organization,” said Trippy, a pseudonymous NFT artist and lead organizer of Beyond Basel, a web3 festival and three-day dance party put on in Miami this year.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">One marketing executive at a major NFT marketplace, and regular sponsor of events, said the conference scene is borderline unbearable. \"I am blown away by the volume of seemingly pointless and random events all over the world that happen in this space,” they said. “Obviously some are great, but most are fluff.” <\/span>&nbsp;","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Another marketing executive at a crypto custody software provider felt that the level of discourse declined over the course of the year. “After Covid, everyone flooded back to events and now are kinda over them,” she added. <\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Regardless of quality, the conference scene has evolved dramatically during the last five years. Gone are the days, according to Trippy, where people mostly spoke “about projects that had not yet launched” or people made “fairly big promises without much of a working product or platform.” Now Trippy says the industry is transforming and is full of specialization and “functioning technologies that regular consumers can use.”<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:0,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","And as use cases and the number of companies grew in parallel to the number of people buying crypto or NFTs, the number of places around the world hosting events has also proliferated. Besides the standard events in places like Miami and Dubai, 2023 will see events held all around the world including countries like Greece, Thailand, Singapore, Germany, South Africa, Romania and Brazil. &nbsp;","<script async=\"async\" src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\" data-v-f87c67ca=\"\"><\/script>","However, with the proliferation of events a kind of crypto-conference industrial complex has taken hold. A competitive and saturated circuit means event organizers are being forced to find creative ways to stand out, whether that be more immersive experiences, selling passes which offer additional networking opportunities, engineering collaboration among entrepreneurs and developers, or exclusive parties for wealthier attendees.","However, simultaneously rising inflation coupled with volatile market conditions and dramatically reduced values means attendees and sponsors alike have less discretionary income. And that will put financial pressure on organizers, according to Lisa Fridman, president and co-founder of web3 company Quadrata.","“Now that the industry is undergoing some growing pains, focusing more on risk management and perhaps learning some lessons from traditional finance, I expect to see a more balanced approach to conferences and more frugal spending,” she said.","Being thrifty while spending enough to hire high-profile speakers and rent out massive venues will be especially difficult for big events like Bitcoin 2023, which lured 25,000 people to <a href=\"https:\/\/www.theblock.co\/post\/141514\/bitcoin-2022-loses-some-evangelical-luster-as-crypto-goes-mainstream\" data-v-f87c67ca=\"\">this year’s<\/a> event in Miami and featured a cyborg bull statue designed by the same firm that made the Transformers for director Michael Bay's blockbuster film franchise. &nbsp;","This year two-day general admission passes cost about $500 while a VIP “Whale Pass” runs closer to $7,000. Bitcoin 2023 organizers are confident current market conditions won’t deter would-be attendees.&nbsp;","“This won’t be our first bear market conference. Our Bitcoin conference in 2019 was at the absolute bottom of a bear market, and it brought huge value to the community,” BTC Media General Manager Christian Keroles said by email. “We see it as an opportunity to go back to the fundamentals and focus on what’s different between bitcoin and crypto. We will focus on what is traditionally significant for any bitcoin bear market, building and learning.”","&nbsp;"],"hashtag":[]}