{"summary":"DX.Exchange, a cryptocurrency and tokenized securities trading platform, is shutting down just nine months after its launch. The exchange has, therefore, blocked all deposits and suspended trading on its platform. It has also asked users to withdraw funds by Nov. 15.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/45672\/nasdaq-powered-crypto-platform-dx-exchange-shuts-down-on-lookout-for-merger-or-acquisition","publishDate":"2019-11-04T04:11:09","id":6444,"type":null,"title":"DX.Exchange shuts down; on lookout for merger or acquisition","category":["EXCHANGES"],"content":["DX.Exchange, a cryptocurrency and tokenized securities trading platform, is shutting down just nine months after its launch.","The Estonia-registered platform, which is <a href=\"https:\/\/www.theblockcrypto.com\/linked\/6309\/nasdaq-powered-european-crypto-exchange-to-launch-next-week-with-tokenized-stock-offering\" data-v-f87c67ca=\"\">built on<\/a> Nasdaq’s matching engine and market surveillance technology, <a href=\"https:\/\/blog.dx.exchange\/2019\/11\/03\/6595\/\" data-v-f87c67ca=\"\">announced<\/a> Sunday that it is closing operations as it pursues a merger or outright sale.","“The costs of providing the required level of security, support and technology is not economically feasible on our own,” said DX.Exchange.","The exchange has, therefore, blocked all deposits and suspended trading on its platform. It has also asked users to withdraw funds by Nov. 15.","If a merger or acquisition does not take place in a timely manner, then the exchange could stop operations permanently, per the announcement. But it is hopeful for a deal as it wants to achieve “success for its shareholders and compete in this challenging market.”","DX.Exchange CEO Daniel Skowronski's <a href=\"https:\/\/www.linkedin.com\/in\/dskowronski\/\" data-v-f87c67ca=\"\">LinkedIn<\/a> showed that he left the firm in October, according to his profile. Notably, he also ran a separate business YIPO Technologies along with DX.Exchange, and now continues to run the business, per the profile.","Reached by LinkedIn message, Skowronski told The Block that he was still CEO, and had \"fixed\" his LinkedIn to show the position, which he has amended since publication. \"I am of course still with DX,\" he said.","DX.Exchange <a href=\"https:\/\/www.theblockcrypto.com\/post\/15784\/europes-dx-exchange-makes-waves-by-listing-security-tokens-for-secondary-trading\" data-v-f87c67ca=\"\">launched<\/a> its platform in January of this year, and offered trading in cryptocurrencies as well as tokenized securities such as stocks of Tesla and Apple and exchange-traded funds or ETFs like Invesco QQQ and SPDR S&amp;P 500. However, it appears that the firm has scrubbed any mention of tokenized securities on its platform as it is no longer referenced on its website.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nWhen asked, Skowronski told The Block: \"We have applied for an MTF (multilateral trading facility) exchange license and about to be granted under a different entity. Our intention was to move the digital stocks to the MTF. So they were removed from the website until then. The Security Token trading would fall under the MTF too.\"","DX.Exchange has staff in the range of 51-200, according to its <a href=\"https:\/\/www.linkedin.com\/company\/dxdotexchange\/about\/\" data-v-f87c67ca=\"\">LinkedIn page<\/a>. Skowronski told The Block that the firm has been \"cutting staff down but still have the vital employees to help with the transition who also might end up with the new company.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSome people on social media platforms <a href=\"https:\/\/twitter.com\/notsofast\/status\/1191044259232784384?s=20\" data-v-f87c67ca=\"\">are calling<\/a> DX.Exchange \"an exit scam.\" Earlier this year, CCN<a href=\"https:\/\/www.ccn.com\/is-dx-exchange-a-sham-crypto-platform-for-us-stock-trading-linked-to-shady-spotoption\/\" data-v-f87c67ca=\"\"> reported<\/a> that Limor Patarkazishvili, the sole shareholder of DX.Exchange, owned 90% of binary options platform SpotOption, which <a href=\"https:\/\/www.financemagnates.com\/forex\/technology\/spotoption-terminates-fx-cfds-business\/\" data-v-f87c67ca=\"\">shut down<\/a> last year after the Israel Securities Authority passed legislation banning binary options sales outside of the country. Skowronski told The Block that the scam claims are \"ridiculous.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIn Sunday's announcement, DX.Exchange said: \"ALL client FUNDS are SAFE and need to be returned to allow a merger\/sale to proceed.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","<em data-v-f87c67ca=\"\">UPDATE: This story has been updated to include comments from Daniel Skowronski, CEO of DX.Exchange.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"90%","content":"PERCENT"},{"type":"Limor Patarkazishvili","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Tesla","content":"LOCATION"},{"type":"Skowronski","content":"PERSON"},{"type":"CCN","content":"ORGANIZATION"},{"type":"Invesco QQQ","content":"ORGANIZATION"},{"type":"Daniel Skowronski","content":"PERSON"},{"type":"YIPO Technologies","content":"ORGANIZATION"},{"type":"Israel Securities Authority","content":"ORGANIZATION"},{"type":"MTF","content":"ORGANIZATION"},{"type":"Estonia","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"SPDR S&amp;P","content":"ORGANIZATION"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"Nov. 15","content":"DATE"},{"type":"Security Token","content":"ORGANIZATION"}],"hashtag":["TOKENIZATION"],"authors":["Yogita Khatri","The Block"]}