{"summary":"Garlinghouse also confirmed the company had explored markets outside the U.S. for an Initial Public Offering, but plans are on hold for now.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273079\/ripple-ceo-says-us-ipo-not-a-priority-crypto-hostile-sec","publishDate":"2024-01-17T06:41:35","id":6445,"type":null,"title":"Ripple CEO cites SEC&#x27;s &#x27;hostile&#x27; crypto stance for not prioritizing IPO","category":["COMPANIES"],"content":["Speaking with CNBC at the World Economic Forum in Davos, Switzerland yesterday, Ripple CEO Brad Garlinghouse said an initial public offering (IPO) in the U.S. was not an immediate term priority with a securities regulator that is “hostile” to the crypto industry.","“Trying to go public with a very hostile regulator that has to approve your S-1 — that doesn't sound like a lot of fun to me,” Garlinghouse <a href=\"https:\/\/www.cnbc.com\/video\/2024\/01\/16\/ripple-looked-at-an-ipo-outside-of-the-u-s.html\" data-v-f87c67ca=\"\">said<\/a>. “Coinbase obviously had their S-1 approved and now the Securities and Exchange Commission is suing them for doing things that were outlined in their S-1.” An S-1 prospectus is a form filed with the SEC prior to a potential IPO giving an account of the company's business operations and financials.","Garlinghouse referred to a scheduled <a href=\"https:\/\/www.theblock.co\/post\/272552\/weekly-preview-coinbase-v-sec-big-token-unlocks-and-more\" data-v-f87c67ca=\"\">hearing<\/a> in federal court today in Coinbase’s ongoing case with the agency on the issue, saying it was indicative of Ripple’s stance not to subject itself to further hostility.","Ripple’s CEO <a href=\"https:\/\/www.cnbc.com\/2022\/05\/25\/ripple-will-explore-ipo-after-sec-lawsuit-ends-ceo-says.html\" data-v-f87c67ca=\"\">previously<\/a> said it would look at a public listing after its own ongoing <a href=\"https:\/\/www.theblock.co\/post\/235926\/sec-lawsuit-over-whether-xrp-is-a-security-will-go-to-trial\" data-v-f87c67ca=\"\">lawsuit<\/a> with the SEC — which began in 2020 — comes to an end. He also confirmed yesterday that the company had explored markets outside the U.S. for an IPO, but any such plans are now on hold.","“We have looked at other jurisdictions that have clear rules of the road, but honestly, a lot of people go public because they need to raise capital,” Garlinghouse said. “Ripple is not really in a place where we need to raise capital, and so it is not a short term priority. We're obviously keeping that option open and we’ll evaluate it as time continues and we’ll evaluate again as we have new regulators sitting at the United States SEC.”","Garlinghouse also <a href=\"https:\/\/www.cnbc.com\/video\/2024\/01\/16\/ripple-ceo-calls-sec-chair-gary-gensler-a-political-liability.html\" data-v-f87c67ca=\"\">referred<\/a> to the current SEC Chair, Gary Gensler, as a “political liability,” adding that at some point there will be a new chair, which would be a “good thing for the American people.”","However, Garlinghouse didn’t see a potential future IPO as an exit for investors. “I don't think about an IPO as an exit. I think about an IPO as a step in the journey,” he said. “Shareholder liquidity is important to me. We have investors that first invested in Ripple in 2012, so they've been in this deal for eleven and a half years.”","Garlinghouse added that Ripple had been cash flow positive for the last couple of years, enabling it to invest in the firm’s operations and external acquisitions. Last week, Ripple initiated a $285 million share buyback that valued the company at $11 billion. “And so we want to provide that liquidity, which is one of the reasons why we've done these tender offers and now repurchased over a billion dollars of stock,” Garlinghouse said on Tuesday.","In July, a federal district judge sent the ongoing lawsuit between the SEC and <a href=\"https:\/\/www.theblock.co\/post\/235926\/sec-lawsuit-over-whether-xrp-is-a-security-will-go-to-trial\" data-v-f87c67ca=\"\">Ripple<\/a> to trial, refusing to grant a summary judgment on the status of <a href=\"https:\/\/www.theblock.co\/price\/248352\/xrp-xrp-usd\" data-v-f87c67ca=\"\">XRP<\/a> as an unregistered security.","<span data-v-f87c67ca=\"\">Judge Analisa Torres ruled that <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248352\/xrp-xrp-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/xrp-symbol-white-128.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">XRP<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.72%\n    <\/span><\/a> <!----><\/span> was not a security on the secondary market but would be a security when sold as part of an investment contract to institutional investors. Torres considered Ripple's \"programmatic\" sales, which the firm used to sell XRP automatically on exchanges, as not constituting securities offerings as the buyers \"did not invest in Ripple.\"<\/span>","In October, Ripple celebrated the <a href=\"https:\/\/www.theblock.co\/post\/258581\/ripple-celebrates-dismissed-lawsuit-calling-it-a-surrender-by-the-sec\" data-v-f87c67ca=\"\">dismissal of all charges<\/a> against its executives as part of the ongoing suit. Since then, it has been working to expand in <a href=\"https:\/\/www.theblock.co\/post\/268594\/ripple-vasp-ireland\" data-v-f87c67ca=\"\">Europe<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/262064\/ripple-targets-unlicensed-clients-with-new-payment-platform-announces-africa-partnership\" data-v-f87c67ca=\"\">Africa<\/a>.","The SEC also <a href=\"https:\/\/www.theblock.co\/post\/233270\/sec-sues-coinbase-binance\" data-v-f87c67ca=\"\">filed<\/a> a lawsuit against Coinbase in June last year, <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2023-102\" data-v-f87c67ca=\"\">accusing<\/a> Coinbase of violating national securities laws by selling crypto tokens that the agency argues constitute unregistered securities, along with failing to register its staking-as-a-service program. Coinbase <a href=\"https:\/\/fingfx.thomsonreuters.com\/gfx\/legaldocs\/akpeaaozrpr\/frankel-secvcoinbase--coinbasemotionforjudgment.pdf\" data-v-f87c67ca=\"\">argues<\/a> that the agency let the company go public, in effect signing off on its core business, and is overstepping its reach due to the lack of a congressional mandate.&nbsp;","There are four outcomes for today’s hearing in federal court, <a href=\"https:\/\/twitter.com\/MetaLawMan\/status\/1746187846191321163\" data-v-f87c67ca=\"\">according<\/a> to crypto attorney James A. Murphy. An outright win for the SEC, with the judge dismissing Coinbase's motion, would be a \"low bar,\" Murphy said, as the SEC merely has to show their claim is plausible. Coinbase has one shot at an outright victory: the judge granting Coinbase's motion with prejudice, meaning the SEC must appeal at a higher court to continue the case, he said.&nbsp;","Coinbase could also secure a narrower victory if the judge grants the motion concerning the tokens but denies it for the staking service. The final unlikely outcome is if the judge grants Coinbase's motion but allows the SEC to amend certain deficiencies, Murphy said.","If Coinbase's motion is dismissed, either in whole or in part, the case will move on to discovery for about a year, Murphy estimated, before a motion for summary judgment. Murphy added he does not expect a ruling in the case at this time.","The SEC did not immediately return a request for comment from The Block.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"a billion dollars","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Switzerland","content":"LOCATION"},{"type":"Murphy","content":"PERSON"},{"type":"2012","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Europe","content":"LOCATION"},{"type":"Brad Garlinghouse","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"eleven and a half years","content":"DATE"},{"type":"United States SEC","content":"ORGANIZATION"},{"type":"1","content":"DATE"},{"type":"XRP","content":"ORGANIZATION"},{"type":"James A. Murphy","content":"PERSON"},{"type":"-1.72%","content":"PERCENT"},{"type":"Davos","content":"LOCATION"},{"type":"the World Economic Forum","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Garlinghouse","content":"PERSON"},{"type":"$11 billion","content":"MONEY"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Analisa Torres","content":"PERSON"},{"type":"June last year","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"$285 million","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"Africa","content":"LOCATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["SEC"],"authors":["James Hunt","The Block"]}