{"summary":"Crypto payments sent to Chinese companies seen as helping to fuel the U.S. fentanyl epidemic, according to a new report.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231883\/chinese-fentanyl-precursor-producers-fueling-us-epidemic-received-millions-in-crypto-elliptic","publishDate":"2023-05-23T13:55:20","id":6446,"type":null,"title":"Chinese fentanyl precursor producers ‘fueling’ US epidemic received millions in crypto: Elliptic","category":["LEGAL"],"content":["<span data-v-f87c67ca=\"\">Elliptic identified crypto wallets, allegedly belong to Chinese companies producing fentanyl precursors, which received more than $27 million in crypto payments. <\/span>","<span data-v-f87c67ca=\"\">Elliptic said, a <a href=\"https:\/\/www.elliptic.co\/blog\/chinese-businesses-fueling-the-fentanyl-epidemic-receive-millions-in-cryptocurrency-payments\" data-v-f87c67ca=\"\">new report<\/a>, its <\/span><span data-v-f87c67ca=\"\">researchers received offers from dozens of “China-based companies to supply fentanyl precursors” with 90% of those companies saying they accepted cryptocurrency payments.. The companies also said they shipped to Mexico, <\/span><a href=\"https:\/\/edition.cnn.com\/2022\/02\/08\/politics\/fentanyl-commission-report\/index.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">where most of<\/span><\/a><span data-v-f87c67ca=\"\"> the fentanyl that flows into the United States comes from, the report also said.<\/span>","<span data-v-f87c67ca=\"\">“<\/span><span data-v-f87c67ca=\"\">Most fentanyl trafficked into the United States is manufactured using precursors imported from Chinese suppliers,” the blockchain analytics firm added.<\/span>","<span data-v-f87c67ca=\"\">Cryptocurrency being used for purchasing illicit substances and drugs is, of course, nothing new, with the dark-web Silk Road marketplace being perhaps the most <a href=\"https:\/\/www.theblock.co\/linked\/83552\/69000-bitcoins-that-moved-on-tuesday-likely-tied-to-silk-road-dark-market-elliptic\" data-v-f87c67ca=\"\">well-known example<\/a>.<\/span>","<span data-v-f87c67ca=\"\">Elliptic’s report, published on its website, asserted that the wallets belonging to the Chinese companies producing chemicals required for creating the dangerous narcotic fentanyl “<\/span><span data-v-f87c67ca=\"\">have received thousands of payments,” with the total number increasing “by 450% year-on-year.”<\/span>","<span data-v-f87c67ca=\"\">The report also stated that, by Elliptic’s estimations, $27 million worth of precursor would be enough to “produce fentanyl pills with a street value of approximately $54 billion.”<\/span>","<span data-v-f87c67ca=\"\">\"Seventeen of the businesses even offered to provide fentanyl itself,\" the report continued. \"Others offered to provide other synthetic opioids even more potent than fentanyl, but that are currently legal to produce and sell in China.\"<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$27 million","content":"MONEY"},{"type":"90%","content":"PERCENT"},{"type":"450%","content":"PERCENT"},{"type":"$54 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Mexico","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"China","content":"LOCATION"}],"hashtag":["CRYPTO"],"authors":["RT Watson","The Block"]}