{"summary":"As the Canadian crypto landscape evolves and matures, WonderFi has grown its footprint — and now controls nearly half the market.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/263140\/wonderfis-grip-on-canadian-crypto-market-grows-as-bitbuy-buys-bitvo","publishDate":"2023-11-15T09:54:24","id":6449,"type":null,"title":"WonderFi&#x27;s grip on Canadian crypto market grows as Bitbuy buys Bitvo","category":["MERGERS & ACQUISITIONS"],"content":["WonderFi subsidiary Bitbuy announced it has acquired the crypto trading platform Bitvo.com and all its clients, further expanding the company's substantial control of Canada's digital asset market.&nbsp;","With the purchase of Bitvo, WonderFi owns nearly half of all the regulated exchanges operating in Canada, the company said in a statement. \"WonderFi has now consolidated Bitbuy, Coinberry, Coinsquare, CoinSmart, and the Bitvo client accounts, which represents the client accounts, trading volumes, and associated net revenues from five of the eleven registered crypto-trading platforms in Canada,\" it also <a href=\"https:\/\/www.newsfilecorp.com\/release\/187449\" data-v-f87c67ca=\"\">said in its statement<\/a>.","In the case of the Bitvo acquisition, Bitbuy subsumes more than 17,000 customer accounts which have generated more than $235 million in trading volume during the last year. The Bitvo exchange itself also generated more over $35 million in trading volume, the statement also said.","\"The acquisition of Bitvo's clients represents a non-dilutive acquisition for WonderFi, with immediate cash flow, increased scale, and an expected payback period of less than six months,\" <a href=\"https:\/\/www.theblock.co\/post\/129232\/why-defi-platform-wonderfi-is-acquiring-crypto-exchange-bitbuy\" data-v-f87c67ca=\"\">WonderFi<\/a> CEO Dean Skurka said in the statement. \"This acquisition also accelerates our growth efforts, and diversifies our client profile with Bitvo's strong institutional client base.\"","While WonderFi grows its footprint in Canada, the competitive landscape there has evolved in recent months. U.S.-based trading platform Coinbase <a href=\"https:\/\/www.theblock.co\/post\/244688\/coinbase-official-launch-canada\" data-v-f87c67ca=\"\">officially launched<\/a> in Canada in August. The launch came after rival exchanges Binance and Bybit both exited the market.","Combined, the U.S. and Canada <a href=\"https:\/\/www.theblock.co\/post\/258999\/north-america-leads-world-in-crypto-usage-chainalysis-says\" data-v-f87c67ca=\"\">make up a large chunk<\/a> of crypto transactions. The two nations contributed about 24% of crypto transaction activity globally over the past year, according to blockchain intelligence firm Chainalysis found.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"$35 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Coinberry","content":"ORGANIZATION"},{"type":"Coinsquare","content":"LOCATION"},{"type":"$235 million","content":"MONEY"},{"type":"Skurka","content":"PERSON"},{"type":"Bitbuy","content":"ORGANIZATION"},{"type":"24%","content":"PERCENT"},{"type":"Bitvo","content":"PERSON"},{"type":"Bitvo","content":"LOCATION"},{"type":"Bitvo","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["RT Watson","The Block"]}