{"summary":"The Block is delighted to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley (@stephendpalley) and Nelson M.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/3884\/crypto-caselaw-minute-week-of-11-18-18-conundrums-come-from-bitmain-configurations-mislaid-ether","publishDate":"2018-11-23T08:00:50","id":6453,"type":null,"title":"Crypto Caselaw Minute, Week of 11.18.18: Conundrums come from Bitmain configurations, mislaid ether","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">The Block is delighted to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" data-v-f87c67ca=\"\">@NelsonMRosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full.<\/em>","Bitmain mining mishaps (alleged), misdirected Canadian ether, and a trip down memory lane to Mr. Ponzi’s furniture shop. These topics (and more) in today’s Crypto Caselaw Minute. (As always, Rosario summaries are “NMR” and Palley summaries are “SDP”; Our visiting author Evan Thomas is “EMT”).","<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario [twitter: @nelsonmrosario] and Stephen Palley [twitter: @stephendpalley]. This week we welcome our friend from north of the border Evan Thomas [@evanmthomas]. This is not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","<em data-v-f87c67ca=\"\">Link to complaint<\/em>: <a href=\"https:\/\/www.scribd.com\/document\/393870365\/Bitmain-Class-Action\" data-v-f87c67ca=\"\">Gevorkyan class action<\/a>","Gor Gevorkyan is the lead plaintiff in this recently filed class action lawsuit against Bitmain. Gevorkyan bought an Antminer S9 for the purpose of mining cryptocurrency in January 2018. For those that don’t know, the Antminer S9 is made by Bitmain. The company is the largest producer of application specific integrated circuit, or ASIC, crypto mining rigs. Bitmain also runs the worlds largest cryptocurrency mining pool, called Antpool.","Okay, well, so what? A guy buys an expensive mining rig near the top, gets rekt, and now wants to blame somebody else. You’d be forgiven for thinking that’s what this case is about, because the alleged truth is far stranger.","A lot of what gets covered here on Crypto Caselaw Minute are recently filed lawsuits. These complaints include the legal basis for a claim asserted in the suit, as well as factual&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">allegations&nbsp;<\/em>to support that claim. The allegations are not necessarily true. More specifically, with respect to this case, a class-action complaint is a lawsuit brought by one or more persons on behalf of a group of people that allegedly suffered similar injuries. Okay, now that we have that out of the way, let’s look at this class action brought against Bitmain.","The lawsuit includes a lot of alleged detail concerning the initial configuration process of setting up an Bitmain ASIC mining rig. Apparently, until about two years ago Bitmain ASIC devices started in low power mode prior to a user completing their initial setup, and did not mine cryptocurrency for anyone. Only after setup was complete would the device run at full power and would cryptocurrency be mined. Allegedly, that is no longer the case, per the Complaint:","<em data-v-f87c67ca=\"\">Recently, Bitmain modified the startup procedure for its ASIC devices such that the devices immediately start in full power high energy consumption mode before the customer’s account is linked to the device and stay in that mode until the setup process is complete. Moreover, the&nbsp;<strong class=\"markup--strong markup--blockquote-strong\" data-v-f87c67ca=\"\">default account setting<\/strong>&nbsp;on the Bitmain ASIC devices is&nbsp;<strong class=\"markup--strong markup--blockquote-strong\" data-v-f87c67ca=\"\">set to<\/strong>&nbsp;<strong class=\"markup--strong markup--blockquote-strong\" data-v-f87c67ca=\"\">contribute to Bitmain’s own account on its own Antpool server<\/strong>. (emphasis added)<\/em>","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">If<\/strong>&nbsp;these allegations are true (and we are not saying that they are)&nbsp;… that’s, that’s not good. Even under some sort of theory that customers agreed to this under the terms &amp; conditions of their purchase, or something like that, this is not a good look regardless of its legality. With respect to its legality, the plaintiff is alleging unfair business practices, unjust enrichment (<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">receiving a benefit at someone else’s expense<\/em>), and conversion (<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">basically stealing<\/em>).","Obviously, how Bitmain responds to this case will be very interesting to see. But, there are two more curiosities to this case. One, when filing a class action suit, you have to meet certain requirements to get certified as a class. One of those requirements, generally, is there needs to be a certain number of similarly affected people. Unless I’m mistaken, the plaintiff is claiming here that at least 100,000 people in the U.S. purchased Bitmain ASIC devices during the relevant time period. That seems… high? I mean, maybe&nbsp;.03% of the US population is mining crypto with Bitmain rigs, but, really?","The other curiosity, is hard to explain. As part of the factual allegations the plaintiff lists popular example cryptocurrencies. That list includes: bitcoin (<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">cool<\/em>), bitcoin cash (<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">fine<\/em>), Peercoin (<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">umm<\/em>), and Unobtanium (<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">oh come on<\/em>).","Lawsuits are weird.","<em data-v-f87c67ca=\"\">Link to judgment<\/em>: <a href=\"https:\/\/www.canlii.org\/en\/bc\/bcsc\/doc\/2018\/2018bcsc1709\/2018bcsc1709.html\" data-v-f87c67ca=\"\">British Columbia Supreme Court<\/a>","Sure, irreversible transactions sound great, but what happens when you mistakenly send $500,000 worth of ether to someone and they won’t send it back? Well, you can go to court.","That’s what happened in&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Copytrack Pte Ltd. v. Wall<\/em>, a recent British Columbia case.","We begin with Copytrack’s ICO. The defendant Wall bought 530 CPY tokens in February 2018. Copytrack sent 530 ether to Wall — at the time worth CAD$495,000 — instead of 530 CPY tokens — worth CAD$780. Ouch.","Copytrack realized the mistake immediately. It asked Wall to return the ether. He did not. Instead, he claimed that unknown persons had stolen the ether.","Litigation ensued.","Copytrack sought summary judgment on the basis of conversion and wrongful detention of the ether. Conversion is a claim where the defendant takes the plaintiff’s property and converts it to his or or his own use. Wrongful detention is a claim for damages for wrongfully keeping the plaintiff’s property.","Wall conceded that he had no right to the ether but argued he could not return it. To further complicate matters, Wall died the day after the hearing.","At the hearing, the court was troubled by the legal issue of whether ether was a form of property that could be converted or detained. While this issue may seem obscure, how ether and other crypto assets are classified as property (are they goods? currency? some form of intangible property?) could have broad implications under securities law, tax law, and commercial law, among other areas, so this case was potentially more important than the 530 ether at issue.","Alas, the court declined to answer this question before a full trial, where it would have more evidence. Given the potential implications beyond the immediate case, the court may have been hesitant to answer the question without more evidence.","In the end, with Wall’s death, the court saw no purpose in a trial. Instead, the court ordered that Copytrack could trace and recover the ether, regardless of who now holds it.","This was perhaps not the best outcome for Copytrack, for two reasons.","First, a judgment declaring that Copytrack owns the ether is largely useless without the private keys, which are either in the hands of unknown rogues or perhaps lost forever following Wall’s death. In contrast, a damages award could have been enforced against Wall’s other assets.","Second, 530 ether is not worth what it used to be. A damages award might have been calculated using the CAD price of ether in February 2018.","So why did Copytrack want the ether?","Well, sometimes you want a judgment for specific property, such as where the property is unique, like a piece of art. Another situation is if the defendant might be insolvent; in that situation, recovering specific property may be better than splitting the defendant’s assets with other creditors.","That may have been the strategy here. Perhaps Copytrack was concerned that Wall couldn’t pay a $500,000 damages award and so their only hope was recovering the ether.","Anyway, the larger lesson here is to be careful with your transactions; there are no do-overs in crypto, and the courts can only do so much.","You hear the term “Ponzi scheme” thrown around a lot in blockchain circles these days. In addition to being a vineyard that produces a lovely pinot noir, Ponzi is a surname of one Charles Ponzi, whose century old malfeasance is referenced in more than 8,000 reported U.S. cases.","But what is a Ponzi scheme exactly? There’s no better description than the one that the Supreme Court provides of Mr. Ponzi’s scheme, so lets start there:","<em data-v-f87c67ca=\"\">The litigation grows out of the remarkable criminal financial career of Charles Ponzi. In December, 1919, with a capital of $150, he began the business of borrowing money on his promissory notes. He did not profess to receive money for investment for account of the lender. He borrowed the money on his credit only. He spread the false tale that on his own account he was engaged in buying international postal coupons in foreign countries and selling them in other countries at 100 per cent profit, and that this was made possible by the excessive differences in the rates of exchange following the war. <\/em>","<em data-v-f87c67ca=\"\">He was willing, he said, to give others the opportunity to share with him this profit. By a written promise in 90 days to pay them $150 for every $100 loaned, he induced thousands to lend him. He stimulated their avidity by paying his 90-day notes in full at the end of 45 days, and by circulating the notice that he would pay any unmatured note presented in less than 45 days at 100% of the loan. Within eight months he took in $9,582,000 for which he issued his notes for $14,374,000. He paid his agents a commission of 10%. With the 50% promised to lenders, every loan paid in full with the profit would cost him 60%. He was always insolvent and became daily more so, the more his business succeeded. He made no investments of any kind, so that all the money he had at any time was solely the result of loans by his dupes.<\/em>","In short, the basic idea is that you fraudulently induce investors to put money into a non-existent business and then pay them “interest” using proceeds from follow-on investors. Repayment of principal happens the same way. These things can go on for a long time, like Bernie Madoff's did, until the scam doesn’t have enough new money to pay old investors, and the wheels come off the bus. Ponzi schemes are nothing new, and they certainly haven’t gone away with the development of magic internet money. Indeed, one of the first reported cases about bitcoin deals with a ponzi scheme. See, SEC v. Shavers, №13–416, 2013 WL 4028182 (E.D. Tex. Aug. 6, 2013). One of the allegations in the Bitconnect class action litigation in Florida (and in other lawsuits, for that matter) is that it was either a Ponzi scheme or a pyramid scheme.","Speaking of <em data-v-f87c67ca=\"\">pyramid<\/em>&nbsp;schemes — what is the difference between a ponzi scheme and pyramid scheme, you ask? Rather than reinvent the wheel, here’s a really nice chart from the SEC that lays out the distinctions visually:","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"E.D. Tex","content":"ORGANIZATION"},{"type":"British Columbia","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"CAD","content":"ORGANIZATION"},{"type":"Aug. 6, 2013","content":"DATE"},{"type":"Evan Thomas","content":"PERSON"},{"type":"2013","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"SEC v. Shavers","content":"ORGANIZATION"},{"type":"Bitmain","content":"PERSON"},{"type":"$9,582,000","content":"MONEY"},{"type":"Nelson Rosario [","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"60%","content":"PERCENT"},{"type":"$14,374,000","content":"MONEY"},{"type":"British Columbia Supreme Court","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"Copytrack Pte Ltd.","content":"ORGANIZATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"$100","content":"MONEY"},{"type":"Ponzi","content":"PERSON"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"},{"type":"Florida","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Charles Ponzi","content":"PERSON"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"Copytrack","content":"ORGANIZATION"},{"type":"Bernie Madoff","content":"PERSON"},{"type":"Gevorkyan","content":"PERSON"},{"type":"February 2018","content":"DATE"},{"type":"January 2018","content":"DATE"},{"type":".03%","content":"PERCENT"},{"type":"$500,000","content":"MONEY"},{"type":"December, 1919","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Copytrack’s ICO","content":"ORGANIZATION"},{"type":"Palley","content":"PERSON"},{"type":"Antminer S9","content":"ORGANIZATION"},{"type":"the Supreme Court","content":"ORGANIZATION"},{"type":"$150","content":"MONEY"},{"type":"Ponzi","content":"ORGANIZATION"}],"hashtag":[],"authors":["Contributor Network","The Block"]}