{"summary":"BitForex has reportedly stopped processing withdrawals after $57 million was seemingly transferred out of the exchange&#x27;s hot wallets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279086\/bitforex-hot-wallet-withdrawals","publishDate":"2024-02-26T08:03:38","id":6454,"type":null,"title":"BitForex website blocks users after apparent $57 million withdrawals","category":["EXCHANGES"],"content":["BitForex has gone offline following $57 million seemingly withdrawn from the crypto exchange's hot wallets late last week.","Noted blockchain investigator ZachXBT on X was one of the first to report on the development, noting that the crypto exchange has stopped processing withdrawals while its team has largely gone dark.","Attempts to access BitForex's official website yield \"Sorry, you have been blocked — You are unable to access bitforex.com\" results.","The reason for the exchange's apparent disappearance currently remains unknown.","Last year, regulators in <a href=\"https:\/\/www.fsa.go.jp\/policy\/virtual_currency\/kasoutsuka_mutouroku.pdf\" data-v-f87c67ca=\"\">Japan flagged the exchange<\/a> — alongside Bitget, MEXC Global and Bybit — for operating without proper registration. Earlier, in 2019, Chainalysis reported that the exchange <a href=\"https:\/\/www.chainalysis.com\/blog\/fake-trade-volume-cryptocurrency-exchanges\/\" data-v-f87c67ca=\"\">may have been faking its trading volumes<\/a>.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$57 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Japan","content":"LOCATION"}],"hashtag":[],"authors":["Adam James","The Block"]}