{"summary":"FalconX has cut ties with Silvergate&#x27;s SEN network for fiat wires. “The market is in a heightened risk environment. We are being extremely cautious,&quot; FalconX CEO Raghu Yarlagadda told The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/188373\/crypto-prime-broker-falconx-will-no-longer-use-silvergates-sen-network","publishDate":"2022-11-18T12:09:41","id":6456,"type":null,"title":"Crypto prime broker FalconX will no longer use Silvergate&#x27;s SEN network","category":["COMPANIES"],"content":["Crypto prime broker FalconX will no longer use the Silvergate Exchange Network (SEN), according to an email sent by FalconX to clients and obtained by The Block.","“Out of an abundance of caution for our customers, we will not be using Silvergate SEN and wires, effective immediately and until further notice,” the email said. “This action is based on publicly available information on Silvergate and is consistent with other market players.”","In response to a request for comment, FalconX co-founder and CEO Raghu Yarlagadda told The Block that “the market is in a heightened risk environment. We are being extremely cautious.”&nbsp;","In response to a request for comment, Silvergate said its banking platform was built to withstand periods of market volatility and it \"remains committed to solving problems for their customers,\" but did not specifically comment on FalconX.","Silvergate shares are <a href=\"https:\/\/www.tradingview.com\/symbols\/NYSE-SI\/\" data-v-f87c67ca=\"\">down nearly 11%<\/a> and have been falling since disclosing its exposure to FTX through deposits last week. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"Silvergate has no outstanding loans to, nor investments, in FTX, and FTX is not a custodian for Silvergate's bitcoin-collateralized SEN Leverage loans,\" Silvergate CEO Alan Lane said last week. \"To be clear, our relationship with FTX is limited to deposits.\"","SEN allows Silvergate clients to send U.S. dollars and euros 24 hours a day. The network has been a key driver of growth for the bank, handling over $445 billion in volume year-to-date, according to The Block's data dashboard.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/public-companies\/sen-transfer-volume\/embed\" title=\"Silvergate SEN Network Transfer Volume (Quarterly)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","\"Any assets sent via SEN or to Silvergate via wire transfer will be deemed an invalid settlement, and you will owe FalconX the full settlement amount,\" the FalconX email said. \"FalconX otherwise continues to operate as usual.\"","FalconX will accept settlement in the USDC stablecoin, according to the email.","Goldman Sachs analysts have <a href=\"https:\/\/www.theblock.co\/post\/187315\/silvergate-stock-sinks-12-on-ftx-links\" data-v-f87c67ca=\"\">slashed<\/a> Silvergate's price target to $40 from $64. The stock is down 20% since its FTX exposure disclosure.","<em data-v-f87c67ca=\"\">Updates with comment from Silvergate.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Silvergate","content":"ORGANIZATION"},{"type":"$64","content":"MONEY"},{"type":"$40","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"11%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Silvergate SEN","content":"ORGANIZATION"},{"type":"$445 billion","content":"MONEY"},{"type":"Alan Lane","content":"PERSON"},{"type":"last week","content":"DATE"},{"type":"Silvergate Exchange Network","content":"ORGANIZATION"},{"type":"Raghu Yarlagadda","content":"PERSON"}],"hashtag":["TRADFI BANKS"],"authors":["Yogita Khatri","Adam Morgan McCarthy","The Block"]}