{"summary":"The accounting firm says it is temporarily stopping all work for crypto exchange clients including proof of reserves audits.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195623\/mazars-pauses-crypto-audits","publishDate":"2022-12-16T05:39:56","id":646,"type":null,"title":"Mazars to pause all crypto exchange proof-of-reserves reports","category":["COMPANIES"],"content":["Accounting firm Mazars is temporarily ceasing all work for its crypto exchange clients, including proof-of-reserves reports for the likes of Binance, KuCoin and Crypto.com.&nbsp;","A spokesperson for Mazars' client Binance confirmed the news in a statement,&nbsp;adding that,&nbsp;“unfortunately, this means that we will not be able to work with Mazars for the moment.” Mazars did not immediately respond to a request for comment.","Mazars has been <a href=\"https:\/\/www.theblock.co\/post\/192062\/kucoin-engages-auditor-mazars-to-provide-factual-findings-report\" data-v-f87c67ca=\"\">working with crypto exchanges<\/a>&nbsp;to publish <a href=\"https:\/\/www.theblock.co\/post\/193684\/crypto-com-releases-proof-of-reserves-study-conducted-by-mazars\" data-v-f87c67ca=\"\">proof-of-reserves reports<\/a> since last month's collapse of FTX. These reports show the platform’s crypto holdings as a means of proving whether their reserves are <a href=\"https:\/\/www.theblock.co\/post\/192861\/binance-collateralized-mazars-audit\" data-v-f87c67ca=\"\">adequately collateralized<\/a>. While exchanges say these reports help to improve transparency, critics say <a href=\"https:\/\/www.theblock.co\/post\/193935\/skepticism-mazars-crypto-exchange\" data-v-f87c67ca=\"\">it is not enough<\/a> as they do not provide details about a platform's liabilities.","With Mazars temporarily out of the picture, Binance's spokesperson said the exchange giant will focus on other transparency measures. The spokesperson identified tools like Merkle Tree proof of reserves as one of the measures being developed. Merkle Trees a data structures that can be used to verify on-chain data. Bybit, another crypto exchange, recently <a href=\"https:\/\/www.theblock.co\/post\/193985\/bybit-crypto-exchange-says-customers-can-verify-its-crypto-reserves\" data-v-f87c67ca=\"\">rolled out<\/a> its Merkle Tree-based system that allows users to verify its reserve holdings.","Binance also highlighted the importance of having these proof-of-reserves reports verified by independent auditors. “We have reached out to multiple large firms, including the Big Four, who are currently unwilling to conduct a PoR for a private crypto company and we are still looking for a firm who will do so,” said the Binance spokesperson.","Indeed, Mazars is not the only accounting firm to pull out of working with crypto firms. Armanino, a long-time crypto accounting partner, <a href=\"https:\/\/www.forbes.com\/sites\/emilymason\/2022\/12\/15\/ftx-accounting-firm-armanino-ends-crypto-audit-practice\/?sh=3f84ad7e362f\" data-v-f87c67ca=\"\">announced<\/a> an end to its crypto audit services on Thursday.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mazars","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Mazars","content":"PERSON"},{"type":"Armanino","content":"ORGANIZATION"},{"type":"Binance","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["BINANCE","FTX"],"authors":["Osato Avan-Nomayo","The Block"]}