{"summary":"NFT marketplace OpenSea has confirmed its acquisition of Dharma Labs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/130606\/opensea-confirms-acquisition-of-dharma-sets-sights-on-fiat-onramps","publishDate":"2022-01-18T12:00:07","id":6460,"type":null,"title":"OpenSea confirms acquisition of Dharma, sets sights on fiat onramps","category":["CUSTODY"],"content":["NFT marketplace OpenSea confirmed its acquisition of Dharma Labs on Tuesday, a deal that could help the $13 billion crypto firm expand its technological prowess.&nbsp;","The announcement comes just weeks after Axios's Kia Kokalitcheva&nbsp;<a href=\"https:\/\/www.axios.com\/opensea-nft-dharma-acquire-f6df00d5-1cc0-463a-95fd-2f5039947ed8.html\" data-v-f87c67ca=\"\">reported<\/a> OpenSea was in talks to buy Dharma, a startup in the decentralized finance space. The terms of the deal were not disclosed, although a source close to the firm confirmed that the value of Dharma fell into Axios's estimated range of $110 million and $130 million.&nbsp;","\"Our teams share a vision that NFTs will be the cultural focal point of crypto's adoption for years to come — and that vision can only be realized if using NFTs becomes easy &amp; delightful for the average person,\" OpenSea co-founder Devin Finzer said in a blog post shared with The Block.","As part of the deal, Dharma's co-founder Nadav Hollander, a former software engineer at Coinbase and Google, was appointed chief technology officer.","\"Nadav’s impact will be wide-reaching, but his initial mandate will be two core priorities: improving the technical reliability and uptime of our products, and building web3-native mechanisms for engaging with and rewarding our early and loyal community,\" Finzer said.&nbsp;","Dharma, an early entrant to DeFi, set out to create a more seamless user interface for lending and swapping tokens — bridging the crypto and fiat world by enabling users to deposit $1,000 from their debit card to swap tokens listed on Uniswap v3. Dharma's app will be sunset, according to the company.&nbsp;","Still, scooping up Dharma's UX know-how could expedite OpenSea's own efforts to simplify and expand the way in which users can purchase digital collectibles and art. OpenSea told The Block that introducing new and accessible purchasing options, including fiat options, is top of mind for the firm.&nbsp;","Simplified fiat on-ramps could be a tailwind for the already fast-growing NFT market, which JPMorgan described this week as \"being the fasting growing universe in the crypto ecosystem.\"&nbsp;","OpenSea itself has kicked off 2022 on a strong note, <a href=\"https:\/\/www.theblockcrypto.com\/data\/nft-non-fungible-tokens\/marketplaces\/nft-marketplace-monthly-volume\" data-v-f87c67ca=\"\">clocking<\/a> in volumes above $2.35 billion in January. Still, competition in the market is mounting with new entrants like LooksRare coming on the scene recently, siphoning market share in the process.&nbsp;","For its part, OpenSea has amassed a significant war chest, having just recently closed a funding round that <a href=\"https:\/\/www.nytimes.com\/2022\/01\/04\/business\/opensea-13-billion-valuation-venture-funding.html\" data-v-f87c67ca=\"\">valued<\/a> the company at $13 billion.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nadav Hollander","content":"PERSON"},{"type":"Finzer","content":"PERSON"},{"type":"$2.35 billion","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"Axios","content":"ORGANIZATION"},{"type":"Devin Finzer","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"$1,000","content":"MONEY"},{"type":"Kia Kokalitcheva","content":"ORGANIZATION"},{"type":"$130 million","content":"MONEY"},{"type":"Dharma","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"OpenSea","content":"ORGANIZATION"},{"type":"Dharma","content":"LOCATION"},{"type":"$13 billion","content":"MONEY"},{"type":"$110 million","content":"MONEY"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}