{"summary":"The 2022 Consensus festival is a showcase and celebration of all that crypto has to offer. Thousands of the world&#x27;s brightest minds and impactful voices will take over Austin, Texas, June 9-12.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/150245\/consensus-2022-the-festival-for-the-decentralized-world-is-happening-this-week-in-austin-june-9-12","publishDate":"2022-06-06T09:00:51","id":6462,"type":null,"title":"Can’t Make It To Consensus IRL? - Introducing the Virtual Pass","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">Enjoy Consensus from wherever you are with the Consensus Virtual Pass. The Consensus 2022 livestream, presented by Bitget, allows you to tune in from anywhere in the world to hear industry leaders explore all aspects of crypto, blockchain, Web 3 and the metaverse.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">With the Virtual Pass, you can stream Consensus content from all conference stages, including Thursday’s Money Reimagined Summit, Creator Summit and Crypto Unlocked sessions.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The virtual pass will stream from the official Consensus website and mobile app, featuring content from all Consensus stages. Livestreaming begins on Thursday, June 9, and ends at the close of Consensus on Sunday, June 12. It will be available for 30 days following the event.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Use code THEBLOCK for 20% off your pass!&nbsp; <\/span><span data-v-f87c67ca=\"\">Learn more about the Virtual Pass and register <\/span><a href=\"https:\/\/www.coindesk.com\/consensus2022\/?utm_source=THeBlock&amp;utm_campaign=Homepage&amp;utm_medium=Paid_Ads&amp;utm_id=C22\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">here<\/span><span data-v-f87c67ca=\"\">.<\/span><\/a>","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by CoinDesk<\/i><i data-v-f87c67ca=\"\">&nbsp;and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","&nbsp;"],"entity":[{"type":"Sunday","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Consensus Virtual Pass","content":"ORGANIZATION"},{"type":"June 9","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"June 12","content":"DATE"}],"hashtag":[],"authors":["Sponsored","The Block"]}