{"summary":"Senator Elizabeth Warren introduced legislation targeting potential Russian crypto use that could ultimately require more action from exchanges this week.\nThe broad language of the bill has drawn outcry from the industry since it could encompass unexpected entities like technologists or those deploying open-source code.\nStill, it’s early in the legislative process and, as it stands, seems unlikely to pass.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/138519\/warren-bill-draws-outcry-over-broad-terms-but-seems-unlikely-to-pass","publishDate":"2022-03-19T12:35:48","id":647,"type":null,"title":"Warren bill draws outcry over broad terms, but seems unlikely to pass","category":["Regulation"],"content":["Senator Elizabeth Warren introduced legislation targeting Russian crypto use that could ultimately require more action from exchanges.","Some industry players say that although the implications of the bill's language are worrisome, it's early to sound the alarm.","Warren introduced the \"Digital Asset Sanctions Compliance Enhancement Act\" during a Senate Banking Committee hearing on March 17.&nbsp; It proposes to further empower the Treasury with authority to bar crypto service providers from transacting with all addresses associated with Russia and sanction anyone found to have materially assisted or supported a sanctioned person. The broad language used in these sections could see a number of unexpected service providers liable to be penalized if the administration were to leverage these expanded powers.","The specific language of the bill is the main sticking point for much of the industry.","The bill employs a broad definition of \"digital asset transaction facilitators,\" which it defines as \"any person, or group of persons, that significantly and materially facilitates the purchase, sale, lending, borrowing, exchange, custody, holding, validation, or creation of digital assets on the account of others, including any communication protocol, decentralized finance technology, smart contract, or other software, including open-source computer code.\"","Mark Wetjen, former acting head of the Commodity Futures Trading Commission and current head of policy and regulatory strategy at FTX, said in an interview with The Block that definitions are always key in digital asset legislation, and Warren's bill is no different.","\"It's pretty, pretty expansive language, particularly as it relates to the definition of a digital asset transaction facilitator,\" he said. \"Very, very broad and very similar to some of the reporting language there was in the funding legislation from last year...And if it were to become law, it certainly would implicate not just centralized platforms, but decentralized platforms as well.\"","As crypto policy think tank Coin Center pointed out, this extends the heightened requirements of the bill not only to exchanges but to technologists, decentralized finance protocols, un-hosted wallets, those who have written open-source software and others.","\"This bill’s language could easily be interpreted to encompass someone who has written software that is used by sanctioned persons to transact, persons who run nodes on peer-to-peer networks on which sanctioned persons transact, and persons who mine or otherwise validate blockchains on which sanctioned persons transact,\" the group wrote in a recent <a href=\"https:\/\/www.coincenter.org\/new-crypto-sanctions-bill-targets-publishing-code-facilitating-transactions\/\" data-v-f87c67ca=\"\">post<\/a>.","Some of those who could potentially be caught in the crossfire of this language may not even know, or be able to discern, that their tools are being used for sanctions evasion, like those who publish open-source code.","Due to its sweeping definitions, the bill has drawn criticism from industry players. As Coinbase's Head of US Policy Kara Calvert <a href=\"https:\/\/twitter.com\/karacalvert\/status\/1504527448184135686?s=20&amp;t=13e0Xle9przttWNQfS4uBg\" data-v-f87c67ca=\"\">tweeted<\/a>: \"The Warren bill is behind the curve, out of touch, and undemocratic.\"","It might even be unconstitutional, according to Coin Center. Under some interpretations, the language could empower the President to forbid the publication of open source code, which the think tank says is unconstitutional as a violation of the First Amendment. In its post, it called the bill \"dangerously overreaching and opportunistic.","\"It will do nothing to improve sanctions against the Russian war machine and may even increase the Russian government’s ability to isolate and control those within their borders who do not support the war,\" wrote Coin Center. \"We strongly object to Congress seizing on overblown concerns over sanctions to impose unreasonable and unconstitutional restrictions on the cryptocurrency ecosystem.\"","Exchanges are already complying with existing sanctions, according to industry players, and there's little evidence crypto is being used any more than traditional finance tools for sanctions evasions.","Thomas Hook, Chief Compliance Officer at crypto exchange Bitstamp, pointed to this lack of evidence and the greater capabilities of blockchain technology to thwart sanctions evasion.","\"<span class=\"notion-enable-hover\" data-token-index=\"0\" data-reactroot=\"\" data-v-f87c67ca=\"\">Blockchain analytics tools are commonly used throughout the cryptocurrency industry and globally and already allow unprecedented insight into funds' movement and provide greater control in preventing sanctions evasion than traditional finance,\" Hook told The Block. \"I<\/span><span class=\"notion-enable-hover\" data-token-index=\"0\" data-reactroot=\"\" data-v-f87c67ca=\"\">f stronger sanctions are what Congress is looking for, they should work within the existing processes to impose those, and we, along with the rest of the crypto industry, will enact controls to enforce those sanctions.”<\/span>","Though industry players have serious concerns, it's early in the legislative process.","\"It's not clear just how likely these bills are going to become law, but we're certainly going to be monitoring them and following the process as it unfolds,\" said Wetjen.","Some are confident Warren's proposal won't get far. Jerry Brito, executive director of Coin Center, tweeted that he doesn't see it moving for now.","\"It does not have bipartisan support, doesn't seem like it will be attached to anything 'must-pass', and flies in the face of what experts and the Administration recommend,\" he <a href=\"https:\/\/twitter.com\/jerrybrito\/status\/1504505164052447235?s=20&amp;t=8mThlOw_qCrsI7YzSwfqyw\" data-v-f87c67ca=\"\">tweeted<\/a>.","Jake Chervinsky, head of policy at The Blockchain Association, <a href=\"https:\/\/twitter.com\/jchervinsky\/status\/1504550509822291968?s=20&amp;t=8mThlOw_qCrsI7YzSwfqyw\" data-v-f87c67ca=\"\">echoed<\/a> Brito's thoughts. The two sought to put industry concerns in perspective in a recent Twitter thread conversation. When grassroots organizer Dennis Porter called on crypto advocates to call their Congress members to oppose the bill, Brito said that because the bill was unlikely to move forward, it's not a moment to exhaust community resources.","\"It is not time to call Congress. This is not a moment to pull the red alert lever. This bill, as it stands, so obviously lacks support that it likely won't move. Let's not cry wolf,\" he said in a tweet <a href=\"https:\/\/twitter.com\/jerrybrito\/status\/1504502901166776321?s=20&amp;t=j8tQ2rENS3I1SVbTCVFfog\" data-v-f87c67ca=\"\">response<\/a>.&nbsp;","The bill features co-sponsorship from 10 other Democratic senators, and Rep. Brad Sherman has also said he's planning to introduce a companion bill in the House."],"hashtag":["ELIZABETH WARREN"]}