{"summary":"Some of the biggest players in cryptocurrency derivatives are swapping Telegram for a newly launched trading platform. Paradigm, an over-the-counter (OTC)","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/37160\/crypto-derivatives-traders-are-abandoning-telegram-for-a-newly-launched-chatting-app-to-do-large-trades","publishDate":"2019-08-22T08:00:08","id":6471,"type":null,"title":"Crypto derivatives traders are abandoning Telegram for a newly launched chatting app to do large trades","category":["OTC"],"content":["Some of the biggest players in cryptocurrency derivatives are swapping Telegram for a newly launched trading platform.","Paradigm, an over-the-counter (OTC) messaging platform for cryptocurrency traders, launched on Thursday via a <span data-v-f87c67ca=\"\">partnership with cryptocurrency derivatives exchange Deribit.&nbsp;<\/span>The platform allows traders to place large buy or sell bitcoin orders (BTC) and ether (ETH) options and futures through Deribit while remaining within its chat interface. Although newly launched, the platform has already enlisted companies such as Singapore-based QCP Capital and cryptocurrency merchant bank Galaxy Digital as clients. The first test trade was also conducted with QCP Capital.&nbsp;","Founded by former oil and gas OTC trader, Anand Gomes, Paradigm sets out to solve the pain points of trading in the market, which is known for its lack of automation and opaqueness. For the most part, traders communicate via Telegram in crypto derivatives. In fact, an industry source told The Block that a large percentage - perhaps as much as 50% - of over-the-counter (OTC) cryptocurrency options trading is conducted via a single Telegram group chat made up of dozens of trading shops. When a trader wants to make a trade, she will manually ping the group with a quote. And if a counterparty is interested, then they will enter into a private chat to execute bilaterally. This outdated trading process is also shared by investors in traditional asset classes, according to Gomes.","Paradigm, however, offers a platform that mimics Telegram's style with a twist of automation.&nbsp;<span data-v-f87c67ca=\"\">It allows a buyer or a seller to send a message on its chatting platform for quotations of certain derivatives contracts. The platform then automatically quotes the prices of these contracts from the counterparty. Once a price and a trade size are agreed upon between the two counterparties, the trade is automatically carried out on Deribit. Investors do not have to directly engage with the exchange to execute the trade.&nbsp;&nbsp;<\/span>","\"[Paradigm] is just facilitating what is already happening [on Telegram],\" said QCP Capital managing partner Darius Sit.","<span data-v-f87c67ca=\"\">According to Deribit COO Marius Jansen, this is also the first time investors can trade large quantities of cryptocurrency derivatives contracts outside of the exchange's order books, a practice usually referred to as block trading. Although commonly seen in traditional equity trading, block trading has only been available on some cryptocurrency spot exchanges such as Gemini, causing investors headaches when they place large orders on cryptocurrency derivatives.<\/span>","<span data-v-f87c67ca=\"\">“When I am talking to trading parties and hedge funds, they really want this functionality. Right now they have to do the order one by one. Always having the risk if you put an order in and you want to be taken out it has already been taken out by someone else. This is a big problem,” explained Jansen.&nbsp;&nbsp;<\/span>","Cryptocurrency OTC GSR Markets is one of the trading firms that feel this pain point and adopt Paradigm's solution.","\"This will lead to smoother more efficient volatility trading and takes a positive step towards strengthening liquidity and robustness in crypto options markets,\" said GSR Markets trader John Kramer.&nbsp;","<span data-v-f87c67ca=\"\">Paradigm currently only offers Deribit's options and futures contracts through its platform. However, it will connect with other derivatives and spot exchanges in the near future, said Gomes.<\/span>","<span data-v-f87c67ca=\"\">“This [new feature] will set a precedent. Once this gets out, other exchange will see how this can be done. Once you see [trading] volume goes up, other exchanges will want to do the same,” said Gomes.&nbsp;<\/span>","According to Jansen, Deribit dominates around 95% of the total cryptocurrency options trading volumes, making it one of the most formidable players in the derivatives space. However, the <a href=\"https:\/\/www.wsj.com\/articles\/bitcoin-rally-fuels-market-in-crypto-derivatives-11562146202\" data-v-f87c67ca=\"\">market is heating up<\/a> with hedge funds and trading firms starting their own cryptocurrency structured products, including options. Cryptocurrency d<span data-v-f87c67ca=\"\">erivatives exchange LedgerX has also been offering options to U.S. institutional investors since 2017 <a href=\"https:\/\/www.reuters.com\/article\/us-usa-cftc-digitalcurrency\/ledgerx-gets-u-s-approval-for-derivatives-on-digital-currencies-idUSKBN1A92FZ\" data-v-f87c67ca=\"\">when it obtained<\/a> approval from the U.S. Commodity Futures Commission.&nbsp;<\/span>","\"I expect to see other exchanges also adding options and I am actually looking forward to it,\" said Jansen. \"It could also be good for us if a bigger exchange would come with options and maybe educate their users.\"&nbsp;","<em data-v-f87c67ca=\"\">Frank Chaparro contributed to this report<br data-v-f87c67ca=\"\">\n<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"QCP Capital","content":"ORGANIZATION"},{"type":"GSR","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Gemini","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Gomes","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"Deribit","content":"ORGANIZATION"},{"type":"95%","content":"PERCENT"},{"type":"Singapore","content":"LOCATION"},{"type":"John Kramer","content":"PERSON"},{"type":"Anand Gomes","content":"PERSON"},{"type":"Marius Jansen","content":"PERSON"},{"type":"Jansen","content":"PERSON"},{"type":"Chaparro","content":"PERSON"},{"type":"U.S. Commodity Futures Commission","content":"ORGANIZATION"}],"hashtag":["PARADIGM"],"authors":["Celia Wan","The Block"]}