{"summary":"Lawmakers debated whether a new rule proposed by the Consumer Financial Protection Bureau—one that could subject payment apps such as PayPal and Venmo to its oversight—should loop in crypto. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282299\/house-panel-spars-over-whether-crypto-should-be-a-part-of-a-proposed-cfpb-rule","publishDate":"2024-03-13T11:44:34","id":6472,"type":null,"title":"House panel spars over whether crypto should be a part of a proposed CFPB rule","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The rule was first proposed in <a href=\"https:\/\/www.consumerfinance.gov\/about-us\/newsroom\/cfpb-proposes-new-federal-oversight-of-big-tech-companies-and-other-providers-of-digital-wallets-and-payment-apps\/\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">November<\/span><\/a> and would give the CFPB the ability to supervise “larger nonbank companies” that have services like digital wallets and payment apps — and potentially crypto.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Lawmakers debated whether a new rule proposed by the Consumer Financial Protection Bureau—one that could subject payment apps such as PayPal and Venmo to its oversight—should loop in crypto.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">During a Wednesday congressional hearing, some House Republicans accused the CFPB of front-running Congress' efforts on crypto legislation and asked witnesses whether the agency had the authority to oversee the crypto industry.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"It would be rather discouraging if the CFPB could simply claim authority over the space with a stroke of a pen and very little legal basis,\" said Rep. Mike Flood, R-Neb, during the House Financial Services subcommittee hearing focused on digital assets and financial technology.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Meanwhile, some House Democrats say CFPB oversight over crypto is needed, given its volatile nature.&nbsp;<\/span><span class=\"s1\" data-v-f87c67ca=\"\">Rep. Stephen Lynch, D-Mass, said many of the cryptocurrencies that have launched over the past few years have since \"died,\" causing people to lose out on their investments.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"There's a huge amount of risk and volatility in that, and yet there are some who say there's no risk based reason fro the CFPB to venture into this,\" Lynch said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">At the heart of the debate is a proposed rule called \"Defining Larger Participants of a Market for General-Use Digital Consumer Payment Applications,\" which was first proposed in November. The rule would give the CFPB the ability to supervise \"larger nonbank companies\" that offer services like digital wallets and payment apps and would require nonbank financial companies handling more than five million transactions a year to follow the same rules as large banks and credit unions, the CFPB said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The 62-page CFPB <a href=\"https:\/\/files.consumerfinance.gov\/f\/documents\/cfpb_nprm-digital-payment-apps-lp-rule_2023-11.pdf\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">rule<\/span><\/a> mentions crypto a handful of times. Jack Solowey, a financial technology policy analyst at the libertarian think tank Cato Institute who testified during the hearing, said the rule \"inappropriately claims jurisdiction over crypto.\" Consumer payment transactions include fund transfers for personal use, which Solowey said could loop in crypto. The rule also sweeps in self-hosted wallets, Solowey noted in his prepared testimony.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">House Financial Services Committee Chair Patrick McHenry, R-N.C.,&nbsp; and Rep. French Hill, R-Ark., have <a href=\"https:\/\/www.theblock.co\/post\/275399\/republican-house-leadership-asks-cfpb-to-review-proposed-payments-rule-over-potential-impact-on-crypto\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">criticized<\/span><\/a> the proposed rule and said it has an unclear impact on digital assets. Many Republicans have historically not been fans of the CFPB, created in 2011 under the Dodd-Frank Act and tasked with overseeing financial services offered to consumers.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Rep. Warren Davidson, R-Ohio, said crypto firms have been asking regulatory agencies, including the Securities and Exchange Commission, for clarity. Those firms get lots of \"endless\" information but no answer, Davidson added.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"It's like Hotel California, in a sort of way,\" Davidson said. \"You can never check out, you can never leave.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Crypto, in some form, should be included in the rule and subject to CFPB supervision, partly because its operations can be opaque, said Christopher Odinet, law professor at the University of Iowa, in his opening remarks.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Take for instance the high profile collapse of the crypto exchange giant FTX,\" Odinet said. \"It has exposed, I think, how little was previously known about the true nature of these transactions and the handling of consumer assets.\"&nbsp;&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">FTX, which was once led by former CEO Sam Bankman-Fried, filed for bankruptcy in late 2022. Bankman-Fried was found <a href=\"https:\/\/www.theblock.co\/post\/261240\/sam-bankman-fried-convicted-on-all-counts-report\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">guilty<\/span><\/a> of defrauding customers, lenders, and investors of FTX a year later.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Neb","content":"ORGANIZATION"},{"type":"Hotel California","content":"LOCATION"},{"type":"2011","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Christopher Odinet","content":"PERSON"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Solowey","content":"PERSON"},{"type":"University of Iowa","content":"ORGANIZATION"},{"type":"Odinet","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Jack Solowey","content":"PERSON"},{"type":"Lynch","content":"PERSON"},{"type":"Stephen Lynch","content":"PERSON"},{"type":"House Financial Services Committee Chair Patrick McHenry","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Warren Davidson","content":"PERSON"},{"type":"House Financial Services","content":"ORGANIZATION"},{"type":"Consumer Financial Protection Bureau","content":"ORGANIZATION"},{"type":"Mass","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Ohio","content":"LOCATION"},{"type":"House","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Davidson","content":"PERSON"},{"type":"CFPB","content":"ORGANIZATION"},{"type":"Bankman","content":"PERSON"},{"type":"Ark.","content":"LOCATION"},{"type":"Cato Institute","content":"ORGANIZATION"},{"type":"General","content":"ORGANIZATION"},{"type":"Mike Flood","content":"PERSON"}],"hashtag":["CFPB","HOUSE FINANCIAL SERVICES COMMITTEE","SEC"],"authors":["Sarah Wynn","The Block"]}