{"summary":"Bitcoin miners remain the best equity proxy to bitcoin as the cryptocurrency heads toward $150,000, according to Bernstein analysts.\nRecent underperformance from public bitcoin miners represents the last window of opportunity before the halving, with mining stocks set to more than catch up with bitcoin’s price action, the analysts predicted.","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281692\/miners-best-equity-proxy-bitcoin-150000-usd-bernstein","publishDate":"2024-03-11T10:32:05","id":648,"type":null,"title":"Miners remain best equity proxy as bitcoin targets $150,000, Bernstein says","category":["Equities"],"content":["Investing in bitcoin miners is the best equity proxy to bitcoin as the largest cryptocurrency by market cap heads toward $150,000, according to analysts at research and brokerage firm Bernstein.","<span data-v-f87c67ca=\"\">“Investors merely look at daily correlation of <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.37%\n    <\/span><\/a> <!----><\/span><\/span> miners, only during days when they see bitcoin rallying,” Bernstein analysts Gautam Chhugani and Mahika Sapra wrote in a note to clients on Monday. “This selective periodic view is incomplete.”<\/span>","The analysts noted that miners almost always outperform bitcoin during bull markets and underperform during bear markets. “Investors have to take a through-cycle view and for us, we are still mid-way into the 2024-25 cycle and see every window of miner weakness as a buying opportunity,” they said.","Chhugani and Sapra argued that bitcoin miner stocks are retail-dominated, with institutions largely avoiding bitcoin proxies. “Traditional equity investors remain skeptical and still approach crypto with a rear-view bias,” they said. “Bitcoin miners’ under-performance during strong bitcoin days are opportunity windows, as bitcoin sucks away retail liquidity from miners.”","With bitcoin climbing to <a href=\"https:\/\/www.theblock.co\/post\/281510\/bitcoin-breaks-through-71000-to-fresh-highs\" data-v-f87c67ca=\"\">all-time highs<\/a> above $72,000 today, Bernstein's analysts expect institutional interest in bitcoin-related equities to awaken, with miners set to be the largest beneficiaries.","The Bernstein analysts said they were particularly focused on Riot Platforms and CleanSpark stocks, suggesting that at current bitcoin price levels and above — even if their production costs were to double after the halving — Riot and CleanSpark would generate around 70% and 60% gross profit margins, respectively. “Any reduction of miner capacity post halving (we estimate 10-15% would shut down), would lead both RIOT and CLSK to gain relative market share,” they added.","Bitcoin halvings are programmed to occur automatically every 210,000 blocks — roughly every four years. The next halving event, <a href=\"https:\/\/www.theblock.co\/post\/280125\/bitcoin-halving-50-days\" data-v-f87c67ca=\"\">expected<\/a> in April, will see the reward subsidy for miners on the network drop from 6.25 BTC to 3.125 BTC per block. However, they continue to earn additional transaction fees for each block mined.","Furthermore, as activity in the Bitcoin ecosystem builds up through the development of additional Layer 2\/sidechain solutions, DeFi and NFTs, the analysts expected the current 5% of miner revenue generated from Bitcoin fees to rise to a sustainable 15%.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoin-miner-revenue-daily\/embed\" title=\"Bitcoin Miner Revenue (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Though bitcoin is already trading past its prior $69,000 all-time high, moving into price discovery, Chhugani and Sapra expect a further breakout post-halving, with the analysts now “more convinced” about their $150,000 bitcoin price target.","The analysts said they had built institutional flows into their estimates to arrive at the price target — initially expecting $10 billion of inflows this year following the launch of spot bitcoin ETFs in the U.S. on Jan. 11 and another $6 billion in 2025.","However, net inflows have already crossed <a href=\"https:\/\/www.theblock.co\/post\/281618\/blackrock-ibit-spot-bitcoin-etf-10-billion-usd\" data-v-f87c67ca=\"\">$9.5 billion<\/a>, with an average run rate of approximately $370 million daily. If this continues, the spot bitcoin ETFs will surpass Bernstein's 2025 estimates within 166 trading days.","“Although the ETFs would ebb and flow, we understand that leading ETF issuers have not even scratched the surface on integration with IRAs, private banks, wirehouses and other traditional pools of capital such as sovereigns, pensions, etc.,” the analysts noted. “These are still early days of bitcoin’s integration into traditional asset portfolios.”"],"hashtag":["BITCOIN","MINING COMPANIES","SPOT BITCOIN ETF"]}