{"summary":"SEBA Bank AG, the crypto bank headquartered in Zug, Switzerland, today announced a rebrand to AMINA Bank AG.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265569\/swiss-crypto-bank-seba-rebrands-to-amina","publishDate":"2023-11-30T20:24:30","id":6481,"type":null,"title":"Swiss crypto bank SEBA rebrands to AMINA","category":["COMPANIES"],"content":["SEBA Bank AG, the Swiss crypto bank, today announced a rebrand to AMINA Bank AG.","Headquartered in Zug, Switzerland, the crypto firm has been authorized by FINMA to provide banking serivces since 2019.","AMINA said the rebrand marks a new chapter for the firm, adding that the name itself stems from the term “transamination” — the transference of one compound to another.","“Our brand signifies a new era in the company’s growth and strategy; we are a key player in crypto banking and are here to define the future of finance. With our client-focused approach, our years of traversing traditional and crypto finance, we offer a platform for investors to build wealth safely and under the highest regulatory standards,” said Franz Bergmueller, CEO of AMINA, in a statement.","AMINA said clients would not be affected by the change, with operations uninterrupted. Its Abu Dhabi branch and subsidiaries in Hong Kong and Singapore will subsequently apply for a name change to fall into line with the Zug headquarters.","AMINA said clients would not be affected by the change, with operations uninterrupted. Its Abu Dhabi branch and subsidiaries in Hong Kong and Singapore will subsequently apply for a name change to fall into line with the Zug headquarters.","AMINA is just weeks removed from <a href=\"https:\/\/www.theblock.co\/post\/262117\/crypto-bank-seba-obtains-hong-kong-license-for-crypto-related-services\" data-v-f87c67ca=\"\">acquiring a license<\/a> to offer services in Hong Kong as part of the new crypto authorization framework in the region.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"SEBA Bank AG","content":"ORGANIZATION"},{"type":"AMINA Bank AG","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Zug","content":"LOCATION"},{"type":"Switzerland","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"Franz Bergmueller","content":"PERSON"},{"type":"Abu Dhabi","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}