{"summary":"Telegram may launch a new marketplace to allow users to transfer usernames via “NFT-like smart-contracts,” founder Pavel Durov said in a message on the","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/164883\/telegram-founder-floats-new-auction-marketplace","publishDate":"2022-08-22T15:25:43","id":6488,"type":null,"title":"Telegram founder floats new auction marketplace","category":["WEB3"],"content":["Telegram may launch a new marketplace to allow users to transfer usernames via “NFT-like smart-contracts,” founder Pavel Durov said in a <a href=\"https:\/\/t.me\/durov\/194\" data-v-f87c67ca=\"\">message<\/a> on the platform.","“Imagine how successful Telegram with its 700 million users could be if we put reserved @ usernames, group and channel links for auction,” Durov wrote on Monday. “In addition to millions of catchy&nbsp;t.me&nbsp;addresses like&nbsp;@storm&nbsp;or&nbsp;@royal, all four-letter usernames could be made available for sale.”<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","TON jumped around 10% after Durov sent the message. The company did not immediately respond to a request for comment.","Durov is eyeing the TON blockchain, which he designed, to host decentralized sales, saying the Telegram team can “write bullet-proof smart contracts for TON.” He cited the success of a recent auction TON conducted for domain and wallet names, including wallet.ton which sold for 215,250 Toncoin (about $260,000) and casino.ton for about $244,000.","“Let's see if we can add a little bit of Web 3.0 to Telegram in the coming weeks,” Durov said.&nbsp;","In addition to t.me addresses like @storm or @royal, all four-letter usernames could be made available for sale, such as @bank, @club and @game, he said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$244,000","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Durov","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Pavel Durov","content":"PERSON"},{"type":"$260,000","content":"MONEY"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}