{"summary":"Telegram released a statement Monday, notably announcing that the TON Wallet won&#x27;t be integrated with the company&#x27;s popular messenger app at launch.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/52128\/telegram-says-ton-wallet-wont-integrate-with-its-messaging-app-at-launch","publishDate":"2020-01-06T11:10:37","id":6489,"type":null,"title":"Telegram says TON Wallet won&#x27;t integrate with its messaging app at launch","category":["ICO AND IEO"],"content":["Telegram said on Monday that when the TON cryptocurrency network launches, the official wallet app for the network won't be integrated with its popular messaging app.&nbsp;","In a <a href=\"https:\/\/telegram.org\/blog\/ton-gram-notice\" data-v-f87c67ca=\"\">notice<\/a> dated Jan. 6, the company said the TON Wallet, an application built on the network that can store TON's native Gram tokens, will be a stand-alone service independent from Telegram Messenger.","The notice stated:","\"At the time of the anticipated launch of the TON Blockchain, Telegram’s TON Wallet application is expected to be made available solely on a stand-alone basis and will not be integrated with the Telegram Messenger service. In this regard, the TON Wallet is expected to compete with any other wallet applications designed and offered by third parties. Telegram may integrate the TON Wallet application with the Telegram Messenger service in the future to the extent permitted under applicable laws and governmental authorities.\"","In a <a href=\"https:\/\/telegram.org\/tos\/wallet\" data-v-f87c67ca=\"\">Terms of Services<\/a> dated Oct. 2019, the firm said that the Grams Wallet would either be an independent application or \"as incorporated into the Telegram Messenger application.\"&nbsp;","Telegram also stressed its independence from the TON network in the Jan. 6 note, saying that it has not made any promise or commitment to develop any applications for the blockchain and may not do so after the network goes live.&nbsp;","\"It will be the sole responsibility of&nbsp;third parties and the community to adopt and implement such applications or smart contracts on the TON Blockchain in the manner they choose. Telegram does not, and cannot, guarantee that anyone will adopt or implement such features or provide such services, on any given timetable or at all,\" the notice explained.","The statement comes as Telegram is locked in a legal fight with the U.S. Securities and Exchange Commission (SEC) over its allegedly illegal $1.7 billion token sales.","A recent document filed in court by the regulator <a href=\"https:\/\/www.theblockcrypto.com\/post\/51954\/telegram-refuses-to-share-bank-records-related-to-its-token-sale-says-sec\" data-v-f87c67ca=\"\">stated<\/a> that Telegram refused to disclose financial details regarding the usage of the raised funds, and the SEC is now&nbsp;<a href=\"https:\/\/www.courtlistener.com\/recap\/gov.uscourts.nysd.524448\/gov.uscourts.nysd.524448.54.0.pdf\" data-v-f87c67ca=\"\">urging<\/a> the&nbsp;court to compel Telegram to provide relevant documents.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Oct. 2019","content":"DATE"},{"type":"TON Blockchain","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"Terms of Services","content":"ORGANIZATION"},{"type":"Grams Wallet","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"TON Wallet","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$1.7 billion","content":"MONEY"},{"type":"Jan. 6","content":"DATE"}],"hashtag":["SEC"],"authors":["Celia Wan","The Block"]}