{"summary":"Crypto exchanges don&#x27;t monetize market data like their equity counter parts. And they would be wise to keep it free.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/111748\/why-crypto-market-data-will-be-free-for-a-long-time","publishDate":"2021-07-16T17:56:08","id":649,"type":null,"title":"Market data in the crypto market is going to continue to be free","category":["EXCHANGES"],"content":["Market data is the lifeblood of Wall Street.&nbsp;","Any market structure wonk can tell you that the topic of market data is an issue which <a href=\"https:\/\/www.businessinsider.com\/stock-exchanges-market-data-cost-becoming-big-issue-2016-10\" data-v-f87c67ca=\"\">frequently divides<\/a> financial services firms (despite how boring that conversation can be). On one side, there are brokers who want to pay less for access to proprietary exchange data. On the other side there are the exchange firms, which have myriad amounts of market data, and as the centers of trading activity, expect to charge money for access.","As such, stock market data is fairly restricted in a way that is markedly different from the crypto market. Crypto exchanges make most data free (whether its volumes, bids, or offers), whereas stock exchanges charge for such data. For the most high-speed access to data, they <a href=\"https:\/\/www.businessinsider.com\/iex-commercial-mocks-the-high-cost-of-exchange-fees-2019-2\" data-v-f87c67ca=\"\">charge even more<\/a>. That raises the question: will crypto exchanges follow the path of equity exchanges? That question was on full display this week when an anonymous crypto account took to Twitter to <a href=\"https:\/\/twitter.com\/runtheirstops\/status\/1414682866408099850?s=20\" data-v-f87c67ca=\"\">complain<\/a> that FTX had limited open interest and liquidation data for its futures products.","Here's the tweet:","","","It turned out <a href=\"https:\/\/twitter.com\/SBF_Alameda\/status\/1414689589118193679?s=20\" data-v-f87c67ca=\"\">not to be true<\/a>, according to crypto wunderkind Sam Bankman-Fried.&nbsp;And, frankly, there's a good reason for why it's not true. And that reason speaks to why market data is still open and free in the Wild West crypto market.&nbsp;","In crypto, exchanges like FTX, Coinbase and Binance have ample ways to make money outside of data, whereas equities exchanges like Nasdaq and New York Stock Exchange earn a small fraction of a penny matching stock trades. As a result, exchanges like Coinbase make 90%+ of their revenues from trading, while equity exchanges like ICE make more than 50% of their money from data.&nbsp;","Furthermore, the business of a crypto exchange is far more broad relative to their equity market counterparts.&nbsp;","SBF put it well in a recent phone conversation:","\"We have the GUI, the custody, the clearing, the brand name, and the retail-facing business. So, at the end of the day, our take rate on revenue is a whole lot higher than exchange in equities that is just in the business of matching sellers and buyers. We are making so much more from making data free than we would from increasing revenue from data.\"","He added that a 10% increase on data cost would result in a customer loss that would offset such an upcharge. Of course, FTX isn't the only exchange in crypto that has a similar business model: Coinbase, Gemini, and Kraken look very similar.","So when will exchanges start charging for market data access in crypto? It will likely happen at some point, but before it does, competition needs to compress. Until the crypto market is dominated by fewer exchanges akin to the environment in equities, that won’t happen.&nbsp;","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Gemini","content":"LOCATION"},{"type":"10%","content":"PERCENT"},{"type":"New York Stock Exchange","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"GUI","content":"ORGANIZATION"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["FTX"],"authors":["Frank Chaparro","The Block"]}