{"summary":"Alongside development studio MetaversePlus, legacy clothing brand Aeropostale has launched AeroPax, an NFT collection with 30,000 one-of-a-kind avatars.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/222062\/aeropostale-metaverse-tiktok","publishDate":"2023-03-23T19:15:04","id":6491,"type":null,"title":"Aeropostale dug itself out of bankruptcy via TikTok. Now it&#x27;s turning to the metaverse","category":["METAVERSE & NFT"],"content":["TikTok saved once-bankrupt fashion retailer Aeropostale with the popularity of \"tiny tops.\" Now the brand is turning to the metaverse for its newest attempt at virality.&nbsp;","The shopping mall stalwart, in partnership with development studio MetaversePlus, today <a href=\"https:\/\/www.prnewswire.com\/news-releases\/aeropostale-partners-with-metaverseplus-to-introduce-aeroworld-an-immersive-digital-brand-experience-with-incredible-tesla-giveaway-301768016.html\" data-v-f87c67ca=\"\">launched<\/a> AeroPax, an NFT collection with 30,000 one-of-a-kind avatars, which \"will build community and give members exclusive perks, including access to limited-edition apparel and VIP promotions.\"&nbsp;","Aeropostale is the latest mainstream fashion label to jump into the metaverse, joining several other fashion brands like Gucci, Forever 21 and Balenciaga. The potential payoff could be big: The global metaverse market <a href=\"https:\/\/www.precedenceresearch.com\/metaverse-market#:~:text=The%20global%20metaverse%20market%20was,forecast%20period%202022%20to%202030.\" data-v-f87c67ca=\"\">accounted<\/a> for almost $69 billion in 2022 and is estimated to surpass around $1.3 trillion by 2030, according to Precedence Research. Additionally, digital objects offer the ability for infinite reproducibility at little cost and a built-in marketing platform.","That said, as a recent McKinsey report suggested, \"direct sales may not be front and center on the metaverse right now.\" In other words, it's a marketing play and, for now, making money is not exactly the point.","Just a few years ago, Aeropostale was a bankrupt fashion retailer with a large and ailing physical store presence. The millennial playbook of skinny jeans and graphic tees, which had been the brand's bread-and-butter for years, was no longer working.","And then seemingly out of nowhere, the brand's \"<a href=\"https:\/\/milled.com\/ps-from-aeropostale\/tik-tok-our-famous-tiny-tops-are-selling-fast-8UP9vCXd_9j_nEyA\" data-v-f87c67ca=\"\">tiny tops<\/a>\" went viral on <a href=\"https:\/\/www.instagram.com\/p\/CRKTSDQh5n4\/?hl=en\" data-v-f87c67ca=\"\">TikTok<\/a>, and the brand found relevance once more.&nbsp;","In the metaverse, the company may also be looking for a similar viral impact, though what exactly that could be remains a mystery.","\"We think of it as the formation of a community of like-minded individuals ... a new generation coming together to build a brighter, more inclusive future,\" said Michael DeLellis, Aeropostale's head of marketing. We \"have no preconceived notions about the makeup of this new community. All are welcome!\"","The project has gained some momentum thus far, including more than 7,000 Instagram followers and more than 500 newcomers to the company's Discord channel.&nbsp;","The impetus for this gathering of digital souls, however, may have more to do with the company's plan to give away 10 Tesla Model Y's than with bunny-character NFTs. After all, the chance to win a $50,000-plus car might be more compelling than access to a custom Aeropostale wolf, but in crypto you never know.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Precedence Research","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$69 billion","content":"MONEY"},{"type":"$50,000","content":"MONEY"},{"type":"Aeropostale","content":"ORGANIZATION"},{"type":"Balenciaga","content":"ORGANIZATION"},{"type":"Michael DeLellis","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"VIP","content":"ORGANIZATION"},{"type":"$1.3 trillion","content":"MONEY"},{"type":"2030","content":"DATE"},{"type":"Gucci","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sam Venis","The Block"]}