{"summary":"Ethereum Layer 2 network Public Goods Network (PGN) is shutting down operations, aiming for closure by mid-2024.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273389\/gitcoin-backed-layer-2-network-pgn-is-winding-down","publishDate":"2024-01-18T10:08:12","id":6493,"type":null,"title":"Gitcoin-backed Layer 2 network PGN is winding down","category":["CRYPTO ECOSYSTEMS"],"content":["Gitcoin-backed Public Goods Network, a Layer 2 solution on Ethereum, is winding down all operations within the next six months — targeting a complete shutdown by mid-2024.","\"After a thorough assessment, it has decided to wind down PGN over the next 6 months – tentatively closing in June 2024,\" the project stated.","The move marks a significant pivot for the network, which was initially launched last year as an appchain to complement Gitcoin's existing operations around public goods and developer funding.","The project cited several reasons for the decision to wind down PGN, including challenges in migrating users to the network and operational costs beyond its budget.","\"Encouraging people to migrate without the convenience of a scaled network was challenging, and the resources needed to support this were out of scope with PGN’s budget,\" the team <a href=\"https:\/\/twitter.com\/pgn_eth\/status\/1747652988670517369\" data-v-f87c67ca=\"\">noted<\/a> on X.","A collaborative effort between Gitcoin and Conduit, PGN was designed to operate as a low-cost Layer 2 solution on Ethereum. It was developed using OP Stack – a software tool from the developers of OP Mainnet. It joined a roster of Layer 2 projects, including the <a href=\"https:\/\/www.theblock.co\/post\/243721\/uniswap-gets-deployed-on-coinbases-layer-2-network-base\" data-v-f87c67ca=\"\">Coinbase-backed Base<\/a>, Zora, and BNB Chain, based on OP Stack.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"BNB","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Gitcoin","content":"PERSON"},{"type":"Public Goods Network","content":"ORGANIZATION"},{"type":"PGN","content":"ORGANIZATION"},{"type":"June 2024","content":"DATE"}],"hashtag":["OPTIMISM","SIDECHAINS"],"authors":["Vishal Chawla","The Block"]}