{"summary":"The Salvadoran congress passed the proposed law with a majority vote, securing 62 votes out of a possible 84.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/107699\/el-salvador-becomes-the-first-country-ever-to-make-bitcoin-legal-tender","publishDate":"2021-06-09T03:39:20","id":6495,"type":null,"title":"El Salvador becomes the first country ever to make bitcoin legal tender","category":["BITCOIN"],"content":["<span data-v-f87c67ca=\"\">El Salvador’s legislature has passed a bill that will make bitcoin legal tender in the country. <\/span>This marks the first time a country will recognize the cryptocurrency as a satisfactory form of payment for any sort of monetary debt.","El Salvador’s president, Nayib Bukele, submitted the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/107675\/el-salvador-bitcoin-legal-tender-law\" data-v-f87c67ca=\"\">bitcoin proposal<\/a> to the Legislative Assembly on Tuesday evening, calling for the country to \"regulate bitcoin as unrestricted legal tender.\"","<span data-v-f87c67ca=\"\">The proposal received a favorable opinion from the legislature, before they held an official vote. Legislature members passed the bill on late Tuesday night with a supermajority vote, receiving <a href=\"https:\/\/twitter.com\/nayibbukele\/status\/1402507380710051840?s=20\" data-v-f87c67ca=\"\">62 votes for the bill<\/a> out of a possible 84. According to the count, 19 opposed and three abstained.&nbsp;<\/span>","\"The #BitcoinLaw has been approved by a supermajority in the Salvadoran Congress,\" Bukele <a href=\"https:\/\/twitter.com\/nayibbukele\/status\/1402507224916836352\" data-v-f87c67ca=\"\">tweeted<\/a>. \"History!\"","El Salvador is not the only country that will let bitcoin be used to buy goods and services, but it is the only one currently to accept crypto for all forms of monetary debt. While Japan’s Payment Services Act defines cryptocurrency as a property value, it states crypto transactions are only applicable to property values stored digitally on electronic devices, not as a legal tender.","<span data-v-f87c67ca=\"\">The new law makes several proposals around how the country should adopt the cryptocurrency. This includes<\/span><span data-v-f87c67ca=\"\"> requiring any business — whether it be for acquiring a good or service — to accept payments in crypto, allowing people to pay their taxes in bitcoin. On top of that, it excludes bitcoin from capital gains taxes. <\/span>","<span data-v-f87c67ca=\"\">In addition to this, the country will also be required to provide alternatives that allow the user to make transactions in bitcoin and be able to seamlessly convert from bitcoin to USD if they want to. <\/span>","<span data-v-f87c67ca=\"\">The law calls for the country to put into place training and other educational materials that will help the population understand how bitcoin transactions work. <\/span>It also calls for the creation of a trust at the Banco de Desarrollo de El Salvador to enable instantaneous convertibility of bitcoin into USD.&nbsp;","\"In order to promote the economic growth of the nation, it is necessary to authorize the circulation of a digital currency whose value answers exclusively to free-market criteria, in order to increase national wealth for the benefit of the greatest number of inhabitants,\" an English translation of the bill <a href=\"https:\/\/twitter.com\/nayibbukele\/status\/1402446890466217985\" data-v-f87c67ca=\"\">stated<\/a>.&nbsp;","<span data-v-f87c67ca=\"\">The president will sign the bill early in the morning, and it will go into effect 90 days after its publication in the Official Gazette, where all documents ordered by EL Salvadorian law are published.&nbsp;<\/span>","\"This night is historic and the Salvadoran people have been watching what is happening. This day, we have begun a major economic transformation,\" said Congressman William Soriano. ","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"This night","content":"TIME"},{"type":"William Soriano","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Salvadoran Congress","content":"ORGANIZATION"},{"type":"morning","content":"TIME"},{"type":"2023","content":"DATE"},{"type":"evening","content":"TIME"},{"type":"Nayib Bukele","content":"PERSON"},{"type":"Banco de Desarrollo de El Salvador","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"Japan","content":"LOCATION"},{"type":"Official Gazette","content":"LOCATION"}],"hashtag":["BITCOIN"],"authors":["Saniya More","The Block"]}