{"summary":"For the longest time, the phrase was echoed ad-nauseam by crypto bulls. So much so, that after years of minimal institutional adoption, it was used to satirize this cohort. If one thing has become apparent over the last ~24 months, it is that the institutions are finally here. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/191550\/institutional-adoption-trends-in-digital-asset-markets-commissioned-by-polygon","publishDate":"2022-12-01T16:57:36","id":6497,"type":null,"title":"Institutional Adoption: Trends in Digital Asset Markets- Commissioned by Polygon","category":["RESEARCH"],"content":["<b data-stringify-type=\"bold\" data-v-f87c67ca=\"\">The Block Research was commissioned by Polygon to create “Institutional Adoption: Trends in Digital Asset Markets”. To access the full report in PDF format, please fill out the form below:&nbsp;<\/b>","<b data-v-f87c67ca=\"\">Executive Summary<\/b>","<span data-v-f87c67ca=\"\">“The institutions are coming.”<\/span>","<span data-v-f87c67ca=\"\">For the longest time, the phrase was echoed ad-nauseam by crypto bulls. So much so, that after years of minimal institutional adoption, it was used to satirize this cohort. If one thing has become apparent over the last ~24 months, it is that the institutions are finally here.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This research report outlines how digital asset infrastructure improvements have paved the way for institutional adoption and identifies the most popular ways that institutions are integrating the technology. The report is structured in four sections.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Section 1: Introduction <\/b><span data-v-f87c67ca=\"\">- The emergence of stablecoins, decentralized finance (DeFi), and non-fungible tokens (NFTs) has broadened the “surface area” of the digital asset landscape. While fluctuations in prices and overall sentiment will continue to impact when and how institutions integrate digital assets, there are now several avenues for adoption.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Section 2: Institutional Building Blocks <\/b><span data-v-f87c67ca=\"\">-<\/span> <span data-v-f87c67ca=\"\">Infrastructure providers have emerged to “check the box” for institutions and given them the minimal required footing to integrate the technology into their businesses. Despite these infrastructure improvements, lack of regulatory clarity remains a significant challenge for institutions.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Section 3: Current State of Institutional Adoption <\/b><span data-v-f87c67ca=\"\">-<\/span> <span data-v-f87c67ca=\"\">Institutional adoption of digital assets is occurring across a range of industries. This section explores the “digital asset journeys” of top financial institutions and banks, card networks, financial technology companies, and major corporate brands.<\/span>","<b data-v-f87c67ca=\"\">Section 4: Conclusion and Appendix<\/b><span data-v-f87c67ca=\"\"> - Institutional adoption hit an inflection point in 2021. Despite market turbulence in 2022, institutional product launches and partnerships with digital asset startups have continued unabated. All signs point to the fallout of FTX stifling institutional engagement in the near term. <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Current State of Institutional Adoption","content":"ORGANIZATION"},{"type":"Block Research","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":[],"authors":["Andrew Cahill","Saurabh Deshpande","The Block"]}