{"summary":"Universal Market Access (UMA)’s project token has been listed on Uniswap \nThe token’s initial listing price of $0.26 is same as the price offered to seed investors two years ago, but the tokens are sold on a curve and buyers will be paying an up to 300% premium as the number of purchased tokens reaches one million\nSince listing, $UMA has seen over $3.4 million in volume and over one million UMA tokens have been exchanged for approximately $605,000 in ETH.","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/63588\/uniswap-token-distribution-universal-market-access","publishDate":"2020-04-30T14:20:45","id":65,"type":null,"title":"Uniswap sees its first major token distribution with Universal Market Access listing","category":["The Block"],"content":["<span data-v-f87c67ca=\"\">The project token for Universal Market Access (UMA), a financial contract platform built on Ethereum, has been listed on Uniswap.<\/span>","<span data-v-f87c67ca=\"\">First announced in 2018, the project consists of two products – a synthetic token issuance platform and an oracle mechanism. On Wednesday, the project token was made available to the public on Uniswap at an initial listing price of $0.26. The development represents the first large-scale distribution event on Uniswap, something akin to an initial token offering in the eyes of some observers.<\/span>","<span data-v-f87c67ca=\"\">The newly released tokens, $UMA, will allow users to interact with the protocol in two ways. In the first place, token holders can participate in community governance and collectively make decisions on the types of contracts that can access the platform, the asset types that the protocol should support, as well as future upgrades.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The second scenario where token holders can make a difference pertains to the price discovery system. UMA's price oracle aims to minimize on-chain price requests. However, there will still be cases where a price is disputed. When this happens, token holders can come in and fulfill the price request.<\/span>","<span data-v-f87c67ca=\"\">According to <\/span><a href=\"https:\/\/www.coingecko.com\/en\/coins\/uma\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">CoinGecko<\/span><\/a><span data-v-f87c67ca=\"\"> data, within less than 24 hours, $UMA has seen over $3.4 million in volume and its price has ranged from $0.26 to $2.22 per token. At the time of writing, over one million UMA tokens have been exchanged for approximately $605,000 in ETH.<\/span>","<span data-v-f87c67ca=\"\">Christopher Burniske, a partner at UMA investor Placeholder, told The Block that $UMA's initial listing price is the same as the one offered to seed investors two years ago.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"The initial listing price was the same price seed investors paid roughly two years ago, a mechanism meant to allow the public market to set the valuation after taking into account the two years of work and resources that have been put into building the UMA protocol since its seeding,\" said Burniske.<\/span>","<span data-v-f87c67ca=\"\">\"Instead of catering to centralized exchanges or seeking illiquid and bespoke private market valuations, the UMA protocol used Uniswap for initial price discovery of its UMA token today,\"&nbsp;he continued. \"This attempt at novel and low-cost price discovery will allow the UMA protocol to capitalize itself from here, and we'll be interested to see how UMA progresses as new markets are added over time.\"<\/span>","<span data-v-f87c67ca=\"\">At the same time, it's important to note that the public does not necessarily have equal access to the tokens as seed investors. Although the initial listing price is the same as the seed round price, the tokens are sold on a curve. With 1000 UMA purchased, buyers are paying a 10% premium. But the percentage can rise to up to 300% as the overall number of purchased tokens reaches 1 million.<\/span>","",""],"hashtag":["UNISWAP"]}