{"summary":"The upgrade would add transaction fees payment in STRK, the protocol&#x27;s forthcoming native token, as well as ether. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/270391\/starknet-opens-up-delegated-vote-for-moving-strk-fee-payment-upgrade-from-testnet-to-mainnet","publishDate":"2024-01-04T10:50:28","id":6501,"type":null,"title":"Starknet opens up delegated vote for moving STRK fee payment upgrade from testnet to mainnet","category":["CRYPTO ECOSYSTEMS"],"content":["The Ethereum Layer 2 validity roll-up Starknet opened up a community vote over the transitioning of major upgrades in Starknet v0.13.0 from testnet to mainnet.","The upgrades facilitate transaction fee payments in STRK, the native token for Starknet, in addition to ether, which the protocol had been accepting prior. STRK is not yet available, and it wasn't immediately clear how the vote would impact issuance.&nbsp;","Community members can voice input from 7:00 a.m. ET on Jan. 4 to&nbsp; 7:00 a.m. ET on Jan. 8 at on the Starknet Governance Hub, the protocol wrote on <a href=\"https:\/\/twitter.com\/Starknet\/status\/1742881134910824622\/photo\/1\" data-v-f87c67ca=\"\">social media<\/a>.&nbsp;","Some community members appeared confused as to how the vote could occur before the STRK airdrop, but the vote relies on delegates, not token holders. Over the past year, Starknet Foundation distributed voting power to a broad group of independent delegates.","\"We encourage ALL members of the Starknet community to join the discussion and voice opinions on the proposed update on the community forum,\" Starket wrote.","Starknet did not immediately respond to a request for comment from The Block.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"7:00 a.m.","content":"TIME"},{"type":"November 2023","content":"DATE"},{"type":"Jan. 4","content":"DATE"},{"type":"Starknet Governance Hub","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Starknet Foundation","content":"ORGANIZATION"},{"type":"Jan. 8","content":"DATE"}],"hashtag":["STARKNET"],"authors":["MK Manoylov","The Block"]}