{"summary":"Central banks must develop innovative infrastructures to protect consumers, says Bank of International Settlements chief Agustin Carstens.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/213862\/bis-general-manager-imagines-financial-innovation-without-stablecoins","publishDate":"2023-02-22T04:50:06","id":6502,"type":null,"title":"BIS general manager imagines financial innovation without stablecoins","category":["INTERNATIONAL POLICYMAKING"],"content":["<span data-v-f87c67ca=\"\">The turmoil in crypto markets has erased the Bank of International Settlements’ belief that there is any hope that stablecoins would be the future of money, according to the financial institution's chief, Agustin Carstens. Yet, he sees central bank digital currencies and tokenized deposits as essential for innovation in finance.<\/span>","<span data-v-f87c67ca=\"\">“CBDCs replicate existing forms of money in a technologically superior way,” Carstens <a href=\"https:\/\/www.bis.org\/speeches\/sp230222.htm\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">said<\/a> in a speech at the Monetary Authority of Singapore. The Swiss-based global institution for financial regulators is also actively experimenting with tokenized deposits, which are meant to replicate the role of commercial bank money, he noted.<\/span>","<span data-v-f87c67ca=\"\">When it comes to stablecoins, however, the BIS top dog said that the events of the last year “have cast serious doubts” on their reliability as a form of money.&nbsp;<\/span><span data-v-f87c67ca=\"\">The collapse of Terra's algorithmic stablecoin in May 2022 turned regulators’ heads and broke down their already feeble trust in the non-governmental fiat-backed currencies.<\/span>","<span data-v-f87c67ca=\"\">Carstens still imagines that the technological developments from crypto will form the basis of the financial future. A “unified ledger” would allow the different parts to work together “seamlessly.” He noted that “CBDCs and tokenized deposits would appear in separate partitions in the unified ledger. Because they share a common ledger, they can be brought together and used in an efficient way, through smart contracts.\"<\/span>","<span data-v-f87c67ca=\"\">Carstens also said, \"it is incumbent upon central banks to make sure they contribute to developing an infrastructure that meets these demands: if central banks do not innovate, others will step in.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Agustin Carstens","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"May 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Carstens","content":"PERSON"},{"type":"Terra","content":"ORGANIZATION"},{"type":"BIS","content":"ORGANIZATION"},{"type":"Bank of International Settlements","content":"ORGANIZATION"}],"hashtag":["CBDCS"],"authors":["Inbar Preiss","The Block"]}