{"summary":"Current estimates indicate that the next mining difficulty update will fall between 7% and 8%, which would make it the largest single drop this year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/191583\/bitcoins-mining-difficulty-set-for-largest-single-drop-of-2022-next-week","publishDate":"2022-12-02T14:21:27","id":6505,"type":null,"title":"Bitcoin&#x27;s mining difficulty set for largest single drop of 2022","category":["CRYPTO INFRASTRUCTURE"],"content":["It's a sign of the times: the next bitcoin mining difficulty update might be the largest drop this year.","The adjustment is projected to happen in the early hours of next Tuesday and could be between -8% and -7%, according to most estimates. <a href=\"https:\/\/data.hashrateindex.com\/network-data\/btc\" data-v-f87c67ca=\"\">Luxor<\/a> placed it at -7.98%, <a href=\"https:\/\/insights.braiins.com\/en\/#advanced_bitcoin_mining_data\" data-v-f87c67ca=\"\">Braiins<\/a> at -7.9% and <a href=\"https:\/\/www.bitrawr.com\/difficulty-estimator\" data-v-f87c67ca=\"\">Bitrawr<\/a> between -7.9% and -7.5%, at the time of publication.&nbsp;","Those numbers are subject to change over the next few days, depending on how many machines go on and offline, but still paint a pretty clear picture of the current state of the mining economics.","Companies are hurting, with the biggest one by hash rate, Core Scientific warning that it <a href=\"https:\/\/www.theblock.co\/post\/180358\/core-scientific-to-run-out-of-cash-by-the-end-of-2022\" data-v-f87c67ca=\"\">might have to file for bankruptcy<\/a>. The industry has seen margins plunge due to rising power costs and declining bitcoin prices. And some companies are <a href=\"https:\/\/www.theblock.co\/post\/181448\/bankruptcy-top-of-mind-as-miners-confront-market-downturn\" data-v-f87c67ca=\"\">cash-strapped and buried in debt<\/a>.","\"The upcoming difficulty adjustment is tracking to be significantly negative, as hashprice levels hit resistance points due to mining profitability thresholds turning negative,\" said Ethan Vera, COO of Luxor, a bitcoin mining software company, which runs a mining pool.","Hashprice points to&nbsp;revenue miners earn from a unit of hashrate over a specific timeframe.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoin-hashprice-index\/embed\" title=\"Bitcoin Hashprice Index\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","On top of that, \"many distressed miners are unplugging and relocating machines, adding additional downward pressure on network difficulty,\" Vera added.","In other words, a \"difficulty drop is (the) result of miners shutting off machines that are no longer profitable,\" said Jeff Burkey, VP of Business Development at Foundry.","\"I actually think we're going to see potentially another drop because selling machines are not profitable at this price. A lot of S19J Pros are not profitable,\" said William Foxley, Compass Mining's media and strategy director.","While more and more ASIC machines flood the market, average prices have crashed generally about 80% compared to last December, according to data from Luxor.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoin-asic-price-index\/embed\" title=\"Bitcoin ASIC Price Index\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Difficulty refers to the complexity of the computational process behind mining and it adjusts roughly every two weeks (or every 2,016 blocks) in sync with the network's hash rate. The network's hashrate has fallen over 7% since Nov. 20, the date of the last update.","A drop in difficulty of this size could give miners some breathing room.","\"This will benefit the miners that can weather the hashprice environment with low-cost operations and high-efficiency machines,\" Vera said.","It would contrast sharply with the <a href=\"https:\/\/www.theblock.co\/post\/175900\/bitcoin-mining-difficulty-jumps-to-all-time-high-levels\" data-v-f87c67ca=\"\">13.55% jump<\/a> in difficulty observed early in October. At the time, summer temperatures were mellowing, which translated into \"better uptime and less curtailment across mining facilities,\" Kevin Zhang, senior vice president at Foundry, then <a href=\"https:\/\/www.theblock.co\/post\/175345\/bitcoin-miners-face-a-big-difficulty-jump-next-week-heres-whats-in-store\" data-v-f87c67ca=\"\">pointed out<\/a>.","At the same time, more efficient latest-generation machines like the Antminer S19 XP were finally being deployed. The largest drop this year so far has been 5.01% in July.","\"The first half of Q4 saw a consistent supply of new generation machines being plugged into open rack space, which will come at the expense of older-generation and higher-cost operators,\" said Vera.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"80%","content":"PERCENT"},{"type":"Ethan Vera","content":"PERSON"},{"type":"VP of Business Development","content":"ORGANIZATION"},{"type":"Compass Mining","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"-7.98%","content":"PERCENT"},{"type":"Foundry","content":"ORGANIZATION"},{"type":"Vera","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"William Foxley","content":"PERSON"},{"type":"Luxor","content":"LOCATION"},{"type":"-7%","content":"PERCENT"},{"type":"13.55%","content":"PERCENT"},{"type":"7%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Jeff Burkey","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"-7.5%","content":"PERCENT"},{"type":"5.01%","content":"PERCENT"},{"type":"Kevin Zhang","content":"PERSON"},{"type":"-7.9%","content":"PERCENT"},{"type":"Nov. 20","content":"DATE"},{"type":"-8%","content":"PERCENT"},{"type":"October","content":"DATE"},{"type":"summer","content":"DATE"}],"hashtag":["MINING COMPANIES"],"authors":["Catarina Moura","The Block"]}