{"summary":"Ethereum core developers have suggested possible dates for The Merge, one of the most anticipated events in crypto&#x27;s history.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/162988\/ethereum-foundation-suggests-tentative-dates-for-the-merge","publishDate":"2022-08-11T11:30:13","id":6507,"type":null,"title":"Ethereum core developers suggest tentative dates for The Merge","category":["THE MERGE"],"content":["Ethereum core developers discussed possible dates for The Merge on a Consensus Layer Call today, as they prepare for one of the most anticipated events across the industry and in Ethereum's history.","The Merge will move Ethereum from proof of work to proof of stake. It's split into two upgrades: Bellatrix and Paris. The second part is when The Merge fully occurs. Paris will happen when the network reaches a certain total terminal difficulty (TTD), which relates to the network's hash rate.","During the call, the core developers debated which dates would be most suitable to target and consensus fell roughly on dates for the two main upgrades. They found agreement on the 144896 epoch for the Bellatrix upgrade, meaning it would land on September 6. The date for Paris that they currently would like to target is September 15 — at a TTD of <span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">58750000000000000000000<\/span>.","These dates are not definitive and may get tweaked in the coming days and weeks. Some of the dates may also change due to block times and hash rate fluctuations. The developers added that the foundation will put out a blog post on August 23 with data on client releases.","The Merge is planned to take place after the Bellatrix mainnet upgrade but before the end of September. If the Ethereum hash rate drops significantly — which would result in slower block times and push back the expected time for The Merge — then there might be a manual override.","The Merge aims to solve many of the core problems the industry faces today with security, scalability, and environmental sustainability being the three core issues.","The discussions on timelines came shortly after a successful Goerli testnet merge on August 10, which was the final step that needed to occur successfully before mainnet launch.","<em data-v-f87c67ca=\"\">This article has been update to clarify that the call was between Ethereum core developers as opposed to the Ethereum Foundation.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bellatrix","content":"ORGANIZATION"},{"type":"September 6","content":"DATE"},{"type":"Paris","content":"LOCATION"},{"type":"September 15","content":"DATE"},{"type":"September","content":"DATE"},{"type":"August 10","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"August 23","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"TTD","content":"ORGANIZATION"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ETHEREUM"],"authors":["Mike Truppa","The Block"]}