{"summary":"Canaan, the bitcoin miner manufacturer that&#x27;s listed on the Nasdaq exchange, saw its stock price soar by more than 80%. As noted by The Block, mining equipment prices change dynamically based on bitcoin price movements","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/55721\/nasdaq-bitcoin-hardware-canaan-price-stock-surge","publishDate":"2020-02-12T17:29:41","id":651,"type":null,"title":"Canaan&#x27;s (Bitcoin Mining Hardware Proivder) Stock Price Surges","category":["ASIA"],"content":["Cryptocurrency miner manufacturer Canaan’s stock price surged by around 80%, closing at $8.04 per share&nbsp;","Over 11 million shares have traded hands, compared to the average trading volume of 250,000 prior to today","The Block’s research analyst Matthew Yamamoto pointed out that Canaan’s stock might be underperforming compared to the Chinese stock market","Canaan, the bitcoin miner manufacturer that's listed on the Nasdaq exchange, saw its stock price soar by more than 80% on Wednesday.&nbsp;","Canaan's stock, CAN,&nbsp;<a href=\"https:\/\/finance.yahoo.com\/quote\/CAN?p=CAN\" data-v-f87c67ca=\"\">closed<\/a> at $8.04 per share at the end of the trading day, representing an increase of 82.73%. The stock price began the day's session at $4.42 and hit a high of $8.69. according to data from Yahoo! Finance.","More than 11 million shares traded hands, compared to the average daily trading volume of 250,000 prior to today.","The China-based miner manufacturer's stock performance had been underwhelming since it debuted on Nasdaq in Nov. 2019. Before the market opened today, CAN had declined by 50% since its IPO and at once hit a $4.31 all-time-low.&nbsp;","In an <a href=\"https:\/\/www.theblockresearch.com\/is-canaans-sell-off-overblown-55628\" data-v-f87c67ca=\"\">op-ed<\/a> published this morning, The Block's research analyst Matthew Yamamoto pointed out that Canaan's stock might be underperforming compared to the Chinese market, while the market signal also appears bullish for mining equipment manufacturers&nbsp;","Indeed, as the miners anticipate their mining reward being halved in May, many have been cycling out their old mining rigs, generating high demand for equipment that has a higher hash rate and better energy efficiency produced by manufacturers like Canaan, Bitmain, and MicroBT.","Recently Bitcoin price rally may also encourage more miners to scale their operations by purchasing newer rigs.&nbsp;","\"As noted by <a href=\"https:\/\/www.theblockresearch.com\/are-bitcoin-miners-pricing-in-the-effects-of-the-block-reward-halving-53483\" data-v-f87c67ca=\"\">The Block<\/a>, mining equipment prices change dynamically based on bitcoin price movements. With bitcoin prices up, this should prove to be a bullish signal for Canaan as their equipment fetches higher price tags,\" Yamamoto wrote in this morning's post.&nbsp;","Meanwhile, shares of publicly-listed mining farms such as Hut 8, Bitfarms, and Argo Blockchain have also risen substantially since the start of the calendar year, climbing by 76%, 90%, and 28% respectively.&nbsp;","However, other market participants take a more precarious view of Canaan's price skyrocket. The coronavirus outbreak in China has impacted most of the China-based mining hardware maker ecosystem, causing delays in their production and shipping schedule.","Given that Canaan is listed on Nasdaq, they have to record their revenue after machines are delivered, meaning that a delay in delivery would lead its recorded quarterly revenue to take a dip as well.&nbsp;","\"There’s still a lot of time in the quarter but if they don’t get these units shipped out prior to 3\/31 they can’t record deposits etc as revenue under US GAAP (Generally Accepted Accounting Principles). So it doesn’t make sense for why CAN is skyrocketing (unless there is news of them closing a large deal or rumored buyout),\" U.S.-based mining rig broker Blockware Solution CEO Matt D'Souza said.","<em data-v-f87c67ca=\"\">Source: TradingView<\/em>","<em data-v-f87c67ca=\"\">Source: FactSet<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"this morning","content":"TIME"},{"type":"80%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"TradingView","content":"ORGANIZATION"},{"type":"$8.69","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"$8.04","content":"MONEY"},{"type":"Bitmain","content":"LOCATION"},{"type":"76%","content":"PERCENT"},{"type":"$4.42","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"Yamamoto","content":"PERSON"},{"type":"Yahoo! Finance","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"the quarter","content":"DATE"},{"type":"82.73%","content":"PERCENT"},{"type":"FactSet","content":"ORGANIZATION"},{"type":"Matt D'Souza","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$4.31","content":"MONEY"},{"type":"Nov. 2019","content":"DATE"},{"type":"28%","content":"PERCENT"},{"type":"US","content":"LOCATION"},{"type":"Canaan","content":"ORGANIZATION"},{"type":"Matthew Yamamoto","content":"PERSON"},{"type":"China","content":"LOCATION"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":[],"authors":["Celia Wan","The Block"]}