{"summary":"During the institution panel at MIT Bitcoin Expo, Ada Kokoshi from State Street argued that financial service providers care most of all about offering value to their clients and see cryptocurrency as only one of the potential ways to do so\nAccording to experts, security tokens and settlement are two areas of interests for institutions.","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/58300\/security-tokens-blockchain-settlement-draw-interest-from-institutions-mit-bitcoin-expo-panel","publishDate":"2020-03-11T10:32:41","id":651,"type":null,"title":"Security tokens, blockchain settlement draw interest from institutions: MIT Bitcoin Expo panel","category":["Institutional Investors"],"content":["<span data-v-f87c67ca=\"\">Amid growing competition between providers, institutions in the traditional finance space are looking at blockchain as another way to offer value to their clients – but it might not be their top priority, according to experts who appeared at the MIT Bitcoin Expo this weekend.<\/span>","<span data-v-f87c67ca=\"\">\"If you remove yourself from the crypto space, there are tons of events happening in finance,\" said Ada Kokoshi, vice president and digital asset lead at State Street. \"For example, the stock market last week just didn’t behave well. And with things like 401(k) plans, exchange-trusted funds (ETF), and mutual funds, there are tons of competition between providers which are driving the fees down.\"<\/span>","<span data-v-f87c67ca=\"\">As a result, she said, even though financial service providers have the desire to understand emerging technologies like blockchain, their top priority remains to provide value to their customers.<\/span>","<span data-v-f87c67ca=\"\">\"Crypto might be one way to do that,” <\/span><span data-v-f87c67ca=\"\">she<\/span><span data-v-f87c67ca=\"\"> said. \"But that involves redesigning their entire value chain, and there’s still a lot of work to be done.\"<\/span>","<span data-v-f87c67ca=\"\">On the other hand, <\/span><span data-v-f87c67ca=\"\">Kokoshi said<\/span><span data-v-f87c67ca=\"\">, clients have become more accustomed to the ideas of blockchain. Financial services providers are starting to look at Bitcoin and other cryptocurrencies as a way of diversifying their portfolios, either through fund allocation or direct investment, she contended.<\/span>","<span data-v-f87c67ca=\"\">Ria Bhutoria, director of research at Fidelity Digital Assets, also appeared during the panel session. According to her, while crypto-native startups dominated the space in 2018 and prior, there has been more support from incumbent institutions in 2019. Last year, Harvard, Yale, and MIT all made allocations to the space indirectly through a crypto fund.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"They are realizing that this is an asset class can’t be ignored,\" she said. <\/span>","<span data-v-f87c67ca=\"\">The concept of tokenizing securities has taken off in institutional investment as well.<\/span>","<span data-v-f87c67ca=\"\">\"Investors and participants are hungry for transparency in the space, and blockchain promises more transparency,\" Kokoshi said. Coupled with the self-executing capability of smart contracts and the promise of lower costs, the technology is very enticing for issuers of security tokens. \"Marrying a legacy system into the crypto ecosystem promises a lot of efficiencies in this area,\" she said.<\/span>","<span data-v-f87c67ca=\"\">Lucas Nuzzi, network data product manager at Coin Metrics,<\/span><span data-v-f87c67ca=\"\"> agreed with <\/span><span data-v-f87c67ca=\"\">Kokoshi's<\/span><span data-v-f87c67ca=\"\"> assessment and highlighted security tokens as a \"high point of interest\" for institutions. French lender Societe Generale, for example, issued <a href=\"https:\/\/www.societegenerale.com\/en\/newsroom\/first-covered-bond-as-a-security-token-on-a-public-blockchain\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a $112 million bond<\/a> on Ethereum in April 2019.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Crypto-native participants might not see security tokens as a particularly exciting development, he said, but there's a lot of demand on the institutional side of things to explore this area and look at public blockchains like Ethereum as another backend for their services.&nbsp;<\/span><span data-v-f87c67ca=\"\">Real estate, for example, is one of the first promising use cases in this regard. Here, i<\/span><span data-v-f87c67ca=\"\">ncorporating blockchain technology allows potential investors to keep better track of rates and other information.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The London Stock Exchange last year came out with a regulatory sandbox for companies who want to explore blockchain technology. As a result, companies can issue shares themselves, the cost of which is much lower than going public with a firm like Morgan Stanley. According to Nuzzi, this represents a very tempting value-add for incumbents.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Given that the current security token landscape is still somewhat limited and focused mostly on Ethereum, he said, this could be an area where incumbent providers work with crypto-native companies to bridge the gap.<\/span>","<span data-v-f87c67ca=\"\">Bhutoria from Fidelity <\/span><span data-v-f87c67ca=\"\">highlighted settlement as another area of interest for institutions.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"Right now, when you trade, the actual settlement happens 2-3 days after,\" she said. \"There are a lot of proofs-of-concept on briding the detachment between trading and settlement...This is a low hanging fruit for blockchain.\"<\/span>","<span data-v-f87c67ca=\"\">Paxos, for instance, recently rolled out a pilot project that aimed to speed up settlement for equity trades by using blockchain technology.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"Most of these have just been pilots so far, it'd be interesting to see how these use cases play out over time,\" she said.<\/span>"],"hashtag":[]}