{"summary":"One of the world&#x27;s largest capital markets firm&#x27;s received approval from the UK financial regulator to launch a wholesale crypto exchange for institutional clients.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/191215\/tp-icap-gets-fca-approval-to-offer-crypto-services-to-institutional-clients","publishDate":"2022-12-01T05:29:54","id":6512,"type":null,"title":"TP ICAP gets FCA approval to offer crypto services to institutional clients","category":["MARKETS"],"content":["Capital markets firm TP ICAP has received approval from the UK's Financial Conduct Authority (FCA) to register as a cryptoasset exchange provider.&nbsp;","TP ICAP's new exchange, known as Fusion Digital Assets, will use the firm's electronic OTC platform, Fusion, to give clients access to a non-custodial cryptoasset exchange for order matching and trade execution. The interdealer broker's new trading venue will be for institutional clients only.","The firm's new venture will also integrate with Fidelity Digital Assets for safekeeping clients' assets and settlement services. The platform will offer diversified Liquidity from proven market makers around the globe.","The wholesale crypto market has \"lacked the credible infrastructure and assurance necessary for the firm's traditional client base to allocate capital,\" said Duncan Trenholme, co-head of digital assets at TP ICAP Group.&nbsp;","The firm's segregated model, track record of operating venues, and ability to distribute are well recognized by institutional players, Trenholme added.&nbsp;","Despite the current crypto downturn, Trenholme said blockchain technology would lead to the tokenization of traditional asset classes. \"This will result in a more efficient, automated, and risk-mitigated trading and settlement process for financial markets,\" he added.","The venture is committed to a multi-custody model. The firm will work closely with several custodians to provide segregated interoperable custody services to its clients. Custodians will come online in line with demand and prioritization over the next few years.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"TP ICAP","content":"ORGANIZATION"},{"type":"UK's Financial Conduct Authority (FCA","content":"ORGANIZATION"},{"type":"Fusion","content":"ORGANIZATION"},{"type":"Fusion Digital Assets","content":"ORGANIZATION"},{"type":"Fidelity Digital Assets","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Duncan Trenholme","content":"PERSON"},{"type":"TP ICAP Group","content":"ORGANIZATION"},{"type":"Trenholme","content":"ORGANIZATION"},{"type":"ICAP","content":"ORGANIZATION"}],"hashtag":["INVESTMENT FIRMS","TRADFI BANKS"],"authors":["Adam Morgan McCarthy","The Block"]}