{"summary":"Video game company Square Enix is launching a non-fungible token project related to its Final Fantasy franchise.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/158875\/square-enix-launches-final-fantasy-vii-nft-collection-with-the-help-of-enjin","publishDate":"2022-07-20T20:55:47","id":6514,"type":null,"title":"Square Enix launches Final Fantasy VII NFT collection with the help of Enjin","category":["THE BLOCK"],"content":["Video game company Square Enix is launching a non-fungible token (NFT) project related to its Final Fantasy franchise.","With the help of NFT infrastructure firm Enjin, Square Enix plans to launch a collection of Final Fantasy VII 25th Anniversary cards and figures on Enjin's Efinity blockchain. Consumers will be able to purchase a commemorative action figure that comes with a code to redeem an NFT version of the figure. Pre-orders for the figures are available today, while trading card preorders will be available later this year.&nbsp;","It's unclear how the project will play with fans of the franchise given other decisions to include NFTs in games have been met with significant backlash. GSC Game World, a Ukrainian game development company behind the S.T.A.L.K.E.R franchise, <a href=\"https:\/\/www.theblock.co\/post\/127952\/backlash-leads-s-t-a-l-k-e-r-2-developers-to-pull-planned-nfts-from-forthcoming-game\" data-v-f87c67ca=\"\">cancelled its plans<\/a> to include NFTs in its S.T.A.L.K.E.R. 2 release when fans pushed back on the decision.&nbsp;","Square Enix President Yosuke Matsuda previously has teased that the firm would allocate more to blockchain technology in 2022. In a <a href=\"https:\/\/www.theblock.co\/post\/128874\/square-enix-plans-to-invest-more-in-blockchain-gaming-in-2022\" data-v-f87c67ca=\"\">January 1 letter<\/a>, he said the firm was looking into issuing its own tokens, but tempered those comments by saying it was seeing examples of overheated trading in the NFT space.","\"This, obviously, is not an ideal situation, but I expect to see an eventual right-sizing in digital goods deals as they become more commonplace among the general public, with the value of each available content corrected to their true estimated worth, and I look for them to become as familiar as dealings in physical good,\" Matsuda said in the letter.","Since then, the firm has delved deeper into blockchain, <a href=\"https:\/\/www.theblock.co\/linked\/144765\/tomb-raider-developer-square-enix-sells-off-300-million-in-ip-and-studios-to-invest-in-blockchain-tech\" data-v-f87c67ca=\"\">selling<\/a> $300 million in intellectual property and studios to invest in the technology along with artificial intelligence and cloud investments.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Enix","content":"ORGANIZATION"},{"type":"Enjin, Square Enix","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Enjin","content":"ORGANIZATION"},{"type":"Yosuke Matsuda","content":"PERSON"},{"type":"Matsuda","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"January 1","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$300 million","content":"MONEY"},{"type":"GSC Game World","content":"ORGANIZATION"}],"hashtag":["GAME"],"authors":["Aislinn Keely","The Block"]}