{"summary":"A U.S. district judge has accepted a guilty plea from former Binance CEO CZ on charges related to anti-money laundering violations. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266430\/seattle-judge-accepts-former-binance-ceo-changpeng-zhaos-guilty-plea","publishDate":"2023-12-06T17:02:35","id":6515,"type":null,"title":"Seattle judge accepts former Binance CEO Changpeng Zhao&#x27;s guilty plea","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">A U.S. district judge has accepted a guilty plea from former Binance CEO Changpeng Zhao on charges related to anti-money laundering violations.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Judge Richard Jones accepted Zhao's guilty plea on Wednesday, according to a court <a href=\"https:\/\/ecf.wawd.uscourts.gov\/doc1\/197110983819\" data-v-f87c67ca=\"\">filing<\/a> in the U.S. District Court for the Western District of Washington in Seattle.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Zhao, also known as CZ, pleaded guilty last month to anti-money laundering and sanctions violations following years-long probes by federal regulators. Binance agreed to pay $4.3 billion in one of the largest corporate settlements in history. Zhao agreed to pay a $50 million fine and stepped down as CEO.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Zhao also <a href=\"https:\/\/www.theblock.co\/post\/265014\/cz-steps-down-as-binance-us-board-chairman\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">stepped<\/span><\/a> down as chairman of the board of directors for Binance.US last week, effectively removing his influence from Binance.US's governance and rendering his interest in the U.S. arm of the exchange \"purely economic.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Zhao has been active on X since stepping down as Binance CEO and pleading guilty. Over the past week, he has posted about his lunch, reposted the new Binance CEO Richard Teng and talked about taking risks.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"10 years ago today, I quit my job, sold my house, and aped into <span class=\"s4\" data-v-f87c67ca=\"\">#bitcoin<\/span>,\" Zhao posted. \"No, I am not saying you should do the same. Many people asked, how could you take such risks? Me, I knew I could easily get a job... Everyone's risk profile is different. Learn risk management.\"&nbsp;<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Richard Jones","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Western District of Washington","content":"ORGANIZATION"},{"type":"Binance CEO","content":"ORGANIZATION"},{"type":"Richard Teng","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"$4.3 billion","content":"MONEY"},{"type":"Seattle","content":"LOCATION"},{"type":"10 years ago today","content":"DATE"},{"type":"$50 million","content":"MONEY"}],"hashtag":["BINANCE"],"authors":["Sarah Wynn","The Block"]}