{"summary":"The change was made to &#x27;help keep this Meeb party going,&#x27; the company said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/160247\/yuga-labs-adjusts-meebits-royalty-terms-to-receive-5-cut-of-secondary-sales","publishDate":"2022-07-29T11:00:39","id":652,"type":null,"title":"Yuga Labs adjusts Meebits royalty terms to receive 5% cut of secondary sales","category":["NFTS"],"content":["Yuga Labs said via Meebits' Twitter account late Thursday that it will begin taking a 5% royalty fee on secondary sales of the pixelated non-fungible tokens (NFTs), beginning <a href=\"https:\/\/twitter.com\/MeebitsNFTs\/status\/1552776013201002501\" data-v-f87c67ca=\"\">immediately<\/a>.","\"Behind the scenes, we’ve been hard at work — lurking, discussing, experimenting, building, mumbling about voxels in our sleep,\" the company wrote. \"We’ve also put together an incredible team for the Meebs, including some brilliant creative thinkers and some die-hard Meebits community members.\"","The change was made to \"help keep this Meeb party going,\" the company added. The collection did not previously charge royalty fees.&nbsp;","It marks a new approach by Yuga to bring in funds via the collection, which it <a href=\"https:\/\/www.theblock.co\/linked\/137631\/bored-apes-creator-yuga-labs-acquires-ip-for-cryptopunks-and-meebits\" data-v-f87c67ca=\"\">acquired from Larva Labs<\/a> earlier this year alongside the CryptoPunks collection. Of its headline collections, Bored Ape Yacht Club and Bored Ape Mutant Club currently charge a 2.5% royalty. Otherdeeds, the NFT connected to the Otherside virtual land plots, charges 5%.&nbsp;","Since the acquisition in March, Yuga has been working with its legal team to draft new terms and conditions for the holders of CryptoPunks and Meebits. BAYC holders have always had full commercial rights to their NFTs and Yuga said it planned to give Meebits and CryptoPunk holders the rights to theirs also.","At the time of the sale, the company wrote: \"By handing over these rights, we’re further aligning CryptoPunks and Meebits with the web3 ethos, and we expect a wide-range of third party developers and community creators to incorporate CryptoPunks and Meebits into their web3 projects. We’ll be building the overall brand right alongside them.\"","Yuga played around with royalties for NFT collections once before, opting to donate a royalty of the secondary sales of the derivative Bored Ape Kennel Club NFT collection to charity for a limited time after it launched. There had been speculation about what new payment and IP structures might emerge for both Meebits and CryptoPunks since the NFT behemoth acquired them.&nbsp;","As for what's next for Meebits, the company tweeted on Thursday that the vision \"centers around embracing the currents already core to the community – play, DIY experimentation, tech minimalism, and interoperability – and dialing them way up.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Larva Labs","content":"LOCATION"},{"type":"Bored Ape Kennel Club NFT","content":"ORGANIZATION"},{"type":"Yuga","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Yuga","content":"PERSON"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"2.5%","content":"PERCENT"},{"type":"Bored Ape Mutant Club","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"earlier this year","content":"DATE"}],"hashtag":["MEEBITS","YUGA LABS"],"authors":["Lucy Harley-McKeown","The Block"]}