{"summary":"The Maker Foundation has added a new poll to its governance portal aiming to introduce a 24-hour governance delay to its protocol after a community member","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/49793\/makerdao-proposes-new-security-feature-to-prevent-losing-all-its-collateral-to-hackers","publishDate":"2019-12-09T17:44:34","id":6524,"type":null,"title":"MakerDAO proposes new security feature to prevent losing all its collateral to hackers","category":["TECHNOLOGY"],"content":["The Maker Foundation has added a new poll to its governance portal aiming to introduce a 24-hour governance delay to its protocol after a community member flagged a loophole that can potentially compromise the system's $340 million worth of ETH collateral.&nbsp;","On Monday, freelance developer Micah Zoltu published a <a href=\"https:\/\/medium.com\/coinmonks\/how-to-turn-20m-into-340m-in-15-seconds-48d161a42311?\" data-v-f87c67ca=\"\">blog post<\/a> warning the public of a security vulnerability MakerDAO, the protocol behind the ERC20 synthetic stablecoin, Dai. According to Zoltu, since there are currently no safeguard features regarding emergency shutdown and governance delays, anyone with a substantive amount of MKR tokens can simply create an executive contract programmed to transfer all collateral from Maker to their account, immediately vote on and activate the contract, and effectively steal all of Maker's collateral.","In response to Zoltu’s criticism, MakerDAO released an official <a href=\"https:\/\/blog.makerdao.com\/governance-security-module-gsm\/\" data-v-f87c67ca=\"\">blog post<\/a> claiming that Zoltu’s article has increased the possibility of hackers exploiting this loophole. It has therefore added an additional <a href=\"https:\/\/vote.makerdao.com\" data-v-f87c67ca=\"\">poll<\/a> to introduce the Governance Security Module (GSM).&nbsp; If the proposal goes through, the Governance Security Module (GSM) delay will increase from 0 to 24 hours.","<strong data-v-f87c67ca=\"\">Funds aren't safe<\/strong>","In his blog post, \"how to turn $20M into $340M in 15 seconds,\" Zoltu elaborates on how the loophole can lead to a severe attack which he claims any “good script kiddie” can easily execute.","Right now, he explains, there are around 80,000 MKR staked on the current executive contract, which means that anyone holding more than this amount of tokens can pass any proposal of their choosing. To make the situation worse, he says, since these tokens could potentially be split between two contracts each with 40,000 MKR in it, attackers can find the right timing and steal all of the system’s collateral with only around $20 million.","Typically, to mitigate malicious attacks like this, there would be a delay period before a new executive contract is activated for community members to flag and shut down the contract. But since the delay is currently set at 0 seconds, there is no safeguard against such thefts.","“This isn’t #DeFi, this is #CeFi,” he said. “Instead of only one person being able to steal all your money (the bank), the bank&nbsp;or any of a number of large individual shareholders, or a group of smaller shareholders&nbsp;could decide to steal all of your money at any time.”","<strong data-v-f87c67ca=\"\">New poll<\/strong>","On Nov. 18, MakerDao <a href=\"https:\/\/www.prnewswire.com\/news-releases\/multi-collateral-dai-launches-and-introduces-the-dai-savings-rate-300960077.html\" data-v-f87c67ca=\"\">launched<\/a> the Multi-Collateral DAI (MCD) MakerDAO protocol, an upgrade from its single-collateral system, which allows almost all tokenized assets with appropriate risk parameters to serve as collateral in its system.&nbsp;","According to its Head of Engineering Wouter Kampmann, MakerDAO had always had plans to implement the delay. However, since the system is still fresh, the community needs to first agree on which routine governance actions to exempt from the delay. The team has been waiting until consensus has been reached to roll out the delay mechanism.&nbsp;","\"The system has only been launched for three weeks. We are just trying to find the desired governance model, especially because the migration from Single-Collateral DAI is still going on,\" Kampmann said. \"I think it would be unreasonable to think that we can figure it out immediately after launch.\"","However, after Zoltu's article received wide attention, the team believes the risk of hacking has increased and decided to move up the proposal.&nbsp;","“The community previously considered the possibility of the exploit but it was not an immediate issue,” MakerDAO's blog post says. “However, the probability of this exploit grew due to potential publicity from the aforementioned blog. For this reason, the community is being presented with a poll to mitigate this hypothetical exploit in advance of our typical debate and consensus-seeking processes.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Zoltu","content":"LOCATION"},{"type":"Nov. 18","content":"DATE"},{"type":"Dai","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Maker Foundation","content":"ORGANIZATION"},{"type":"Zoltu","content":"PERSON"},{"type":"Micah Zoltu","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"$340 million","content":"MONEY"},{"type":"Wouter Kampmann","content":"PERSON"},{"type":"Kampmann","content":"PERSON"},{"type":"$340M","content":"MONEY"},{"type":"$20M","content":"MONEY"},{"type":"$20 million","content":"MONEY"},{"type":"Zoltu","content":"ORGANIZATION"}],"hashtag":["DAI"],"authors":["Yilun Cheng","The Block"]}