{"summary":"Crypto startup MoonPay has named former Coinbase and Andreessen Horowitz (a16z) executive Mike Lempres to its board of directors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265402\/moonpay-board-mike-lempres-former-coinbase-a16z-exec","publishDate":"2023-11-30T09:00:05","id":6527,"type":null,"title":"Former Coinbase and a16z exec Mike Lempres joins MoonPay’s board","category":["COMPANIES"],"content":["Crypto startup MoonPay has named former Coinbase and Andreessen Horowitz (a16z) executive Mike Lempres to its board of directors as regulatory scrutiny intensifies in the United States.","Lempres has joined MoonPay USA LLC's board, a wholly owned subsidiary of MoonPay's parent company MoonPay Inc., the company said Thursday. Lempres was previously Coinbase's chief policy officer when he <a href=\"https:\/\/www.theblock.co\/post\/3851\/coinbases-chief-policy-officer-is-leaving-and-fannie-maes-former-general-counsel-is-taking-his-place\" data-v-f87c67ca=\"\">left<\/a> the crypto exchange company in 2019 for a16z, where he worked as an executive in residence for over two years. Lempres still serves on the boards of Coinbase, rival exchange Bitstamp, and crypto-friendly Silvergate Bank.","\"We look forward to leveraging Mike's unique experience in navigating regulatory uncertainty, as well as his track record for building a successful business and scaling growth stage companies,\" Ivan Soto-Wright, co-founder and CEO of MoonPay, told The Block. \"Whether it is his expertise in corporate governance, maturing compliance and risk management, or his experience in crypto specifically, we expect Mike to contribute on a wide range of topics and initiatives.\"","During his tenure at Coinbase, Lempres helped Coinbase with its initial public offering or IPO. When asked if MoonPay plans to go public soon, Soto-Wright said, \"We are focused on making MoonPay an iconic private company. We have no immediate plans to go public.\"","MoonPay was founded in 2018 and offers various crypto products and services, including an <a href=\"https:\/\/www.theblock.co\/post\/255192\/moonpay-crypto-swaps-app\" data-v-f87c67ca=\"\">investment app<\/a>, payment infrastructure, and an NFT platform. MoonPay <a href=\"https:\/\/www.theblock.co\/post\/124980\/moonpay-raise\" data-v-f87c67ca=\"\">was valued at $3.4 billion<\/a> in late 2021 following its mega $555 million Series A funding round led by Tiger Global Management and Coatue.","Besides Lempres, MoonPay's other current board members include Soto-Wright, Max Crown, the company's chief finance and operating officer, and Theodora Vardis, managing partner at HODL.vc, said Soto-Wright.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Silvergate Bank","content":"ORGANIZATION"},{"type":"Soto","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Coatue","content":"ORGANIZATION"},{"type":"$555 million","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Tiger Global Management","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"$3.4 billion","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"Mike","content":"PERSON"},{"type":"Theodora Vardis","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Max Crown","content":"PERSON"},{"type":"Ivan Soto","content":"PERSON"},{"type":"Mike Lempres","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Wright","content":"PERSON"},{"type":"MoonPay","content":"ORGANIZATION"},{"type":"MoonPay USA LLC","content":"ORGANIZATION"},{"type":"MoonPay Inc.","content":"ORGANIZATION"}],"hashtag":["CRYPTO","HIRING"],"authors":["Yogita Khatri","The Block"]}