{"summary":"Messaging app giant Telegram has further postponed the launch of its TON blockchain network -- this time by one more year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/63524\/telegram-now-delays-launch-of-its-blockchain-by-one-more-year-ready-to-return-investor-money","publishDate":"2020-04-30T04:55:06","id":6529,"type":null,"title":"Telegram now delays launch of its blockchain by one more year, ready to return investor money","category":["LAYER 1S"],"content":["Messaging app giant Telegram has further postponed the launch of its TON blockchain network -- this time by one more year.","The company was scheduled to launch Telegram Open Network (TON) today, but it has now been delayed to April 30, 2021, according to Telegram’s <a href=\"https:\/\/smart-lab.ru\/blog\/618122.php\" data-v-f87c67ca=\"\">letter to investors<\/a> on Wednesday (the letter was posted by a Russian forum).","Telegram cites \"recent U.S. district court decision\" as the reason for the delay. Last month, a U.S. judge <a href=\"https:\/\/www.theblockcrypto.com\/post\/59831\/court-in-telegram-case-blocks-gram-token-issuance-says-token-distribution-likely-violates-securities-law\" data-v-f87c67ca=\"\">ruled<\/a> that the company cannot launch its blockchain or issue gram tokens until its case with the U.S. Securities and Exchange Commission (SEC) is resolved.","Telegram and the SEC <a href=\"https:\/\/www.theblockcrypto.com\/post\/43039\/the-sec-sues-telegram-says-gram-tokens-are-securities\" data-v-f87c67ca=\"\">have been in a legal battle<\/a> since October 2019, when the regulator sued Telegram for conducting an “illegal” sale of its gram tokens and allegedly violating securities laws. Telegram raised $1.7 billion in 2018 by pre-selling its gram tokens.","The legal battle first forced Telegram to delay the TON launch from October to April 2020, and now to April 2021. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nNotably, in October, the company promised investors to return 72% of their money in case of any further delays. In Wednesday's letter, the company is offering investors that option.","\"Under the terms of the purchase agreement, we owe you the termination amount. We are hereby honoring our plan communicated to you in October 2019 to repay 72% of your original investment,\" the letter reads.","If all investors agreed to take refunds, Telegram would pay back $1.2 billion, since the total amount raised was $1.7 billion.","But, will investors go for the refund option?","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">A new twist<\/strong><\/span>","In a new twist, Telegram is now giving investors an alternative option to stay put: 110% of their original investment by April 2021, which is “53% higher than the termination amount.”","“Detailed documents describing this option, including a loan agreement, will be provided shortly to those who express interest,” according to the letter.&nbsp;","Telegram said it is “continuing to engage in discussions with the relevant authorities” in connection with TON and the issuance of gram tokens to original purchasers.","If it receives permissions before April 30, 2021, “purchasers who opted for the loan will have the further option to receive grams or potentially another cryptocurrency on the same terms as those in their original purchase agreements.”","If Telegram doesn’t receive permissions even by then, it will repay the debt using equity, it said. At present, Telegram is 100% owned by its founder and CEO, Pavel Durov.","“With 400 million monthly users and organic growth of 1.5 million sign-ups each day, Telegram is the # 1 most downloaded social media application in 27 countries… Based on the valuation of messaging services at similar stages of their growth, we believe Telegram's equity value will exceed the aggregate amount of its potential debt resulting from this offer by at least several times,” per the letter.&nbsp;","Investors have until Friday to decide whether they want refunds or are interested in reviewing the loan option.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"April 2020","content":"DATE"},{"type":"October 2019","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"April 2021","content":"DATE"},{"type":"53%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"72%","content":"PERCENT"},{"type":"110%","content":"PERCENT"},{"type":"100%","content":"PERCENT"},{"type":"April 30, 2021","content":"DATE"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Telegram","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Pavel Durov","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"$1.7 billion","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"$1.2 billion","content":"MONEY"}],"hashtag":["SEC","TOKENS"],"authors":["Yogita Khatri","The Block"]}