{"summary":"Solana Labs CEO Anatoly Yakovenko looked at what the Solana network can achieve — if it can overcome its challenges.\nHe said the network has fixed many problems related to its uptime, but it has four key things to solve.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/183473\/solana-labs-ceo-we-want-to-synchronize-the-world-at-the-speed-of-light","publishDate":"2022-11-05T15:49:55","id":653,"type":null,"title":"Solana Labs CEO: &#x27;We want to synchronize the world at the speed of light&#x27;","category":["Cryptocurrency"],"content":["Solana has faced and overcome a lot of challenges over the past year, said Solana Labs CEO Anatoly Yakovenko, as it remains on its path to providing a fast, scalable blockchain.","Yakovenko discussed how the blockchain has struggled with maintaining uptime, particularly in June, but new developments should avoid this in the future. He then broke down the blockchain's four biggest problems moving forward; if it's able to solve these, then it will achieve the blockchain's ultimate goal.","\"We want to <span data-dobid=\"hdw\" data-v-f87c67ca=\"\">synchronize<\/span> the world at the speed of light,\" Yakovenko said on stage at Breakpoint, Lisbon, in an interview with Austin Federa, head of communications at Solana Foundation.","In June, block times fell to one second between blocks on average, he said. While this seems fast — and is faster than blockchains like Bitcoin and Ethereum — it’s slow for Solana’s typical performance. This was due to the network going down on occasion as it struggled with spam on the network.","Yakovenko said having a second client implementation of the Solana blockchain — with a different code base — should help prevent issues on the network. \"The probability of the same kind of bug incurring in both is probably zero,\" he said.","The Solana Labs CEO highlighted the difficulty of fees on the network. Solana offers low transaction fees, which can lead to plenty of spam. He said that a few projects have helped to avoid these issues, such as QUIC, which limits bots from sending 100 gigabytes of spam to the network.","Solana faces three hard challenges going ahead, Yakovenko highlighted. First, there's formal verification, which refers to the security guarantees on the network. Second, there's type-rich bytecode, which refers to how different parts of the network talk to each other. Third, there's dynamic pricing for storage, a way for validators to manage how much the Solana blockchain grows in size.","The biggest challenge going ahead, Yakovenko added, is how to have multiple block producers operate at the same time. If this can be solved, it should let the network operate much faster.","Yakovenko said he would also like to see the block production process become separated from the transaction execution process. This should let users of the Solana blockchain know their transaction has been processed more quickly.","Looking back, 21.9 million NFTs have been minted on Solana so far, said Federa. He added that the network has seen $1.1 billion in primary sales of NFTs and $2.5 billion in secondary sales.","So far at Breakpoint, there have been a few announcements. Google Cloud said it <a href=\"https:\/\/www.theblock.co\/post\/183459\/google-cloud-adding-bigquery-support-for-solana-in-q1-2023\" data-v-f87c67ca=\"\">intends to support<\/a> Solana in its data availability platform BigQuery and its Blockchain Node Engine, which is its managed service for running nodes. Development on the Solana phone has kept going, with 3,500 pre-production versions of the upcoming phone <a href=\"https:\/\/www.theblock.co\/post\/183429\/pre-production-solana-phone-to-ship-to-developers-in-december\" data-v-f87c67ca=\"\">set to ship<\/a> to developers in mid-December. Plus, shoemaker Asics has <a href=\"https:\/\/twitter.com\/SolanaConf\/status\/1588486201979314176?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1588486201979314176%7Ctwgr%5Ee4f92a179f3ba974c518a42a476aa1660535e097%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fnews.coincu.com%2F139927-asics-collaborates-with-solana-stepn%2F\" data-v-f87c67ca=\"\">dropped<\/a> a Solana-themed shoe.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe development and launch of the Solana phone, called Saga, is taking a lot of blood, sweat and tears, Yakovenko said. He added that it was “a little crazy to take on Apple and Google” in terms of competing with their app stores, but appreciated being able to use Android.","<em data-v-f87c67ca=\"\">Update: This article has been updated to correct \"Quick\" to \"QUIC.\"<\/em>"],"hashtag":["ANATOLY YAKOVENKO","SOLANA"]}