{"summary":"The main governing body for the world&#x27;s most popular sport is moving blockchains as it releases another set of digital collectibles.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267031\/fifa-drops-nfts-that-offer-chance-at-world-cup-final-tickets-moves-to-polygon","publishDate":"2023-12-11T12:39:26","id":6538,"type":null,"title":"FIFA drops NFTs that offer chance at World Cup final tickets, moves to Polygon","category":["NFT COLLECTIONS"],"content":["FIFA, the international governing body for the world's most popular sport, is dropping a limited number of digital collectibles later this week that will give holders the opportunity to watch the final game of the 2026 World Cup, according to a statement.&nbsp;","\"For the first drop, 100 digital collectibles will be made available ... and will feature the rarest collectibles that offer the chance to secure 2026 FIFA World Cup final tickets,\" the statement said. \"A total of 900 other digital collectibles will be issued on the Polygon network and made available on the OpenSea platform.\"","FIFA's NFTs were <a href=\"https:\/\/www.fifa.com\/about-fifa\/commercial\/media-releases\/fifa-to-launch-fifa-collect\" data-v-f87c67ca=\"\">originally minted<\/a> on Algorand, but are now planning to move to Polygon with the second stage of this upcoming collection, a blockchain popular among web3 gaming projects. Future FIFA digital collectible launches will also utilize Polygon, the statement said.","When FIFA first announced \"FIFA+ Collect\" last year, it was billed as offering \"football fans around the world with the chance to affordably own unique digital collectibles.\" The NFT drop comes as the FIFA Club World Cup 2023 is set to kick off tomorrow in Saudi Arabia.&nbsp;","While NFT trading volumes have <a href=\"https:\/\/www.theblock.co\/post\/265883\/blur-dominates-almost-80-of-nft-trading-volume-as-market-activity-spikes\" data-v-f87c67ca=\"\">rebounded<\/a> recently, levels are still far below where they were during the last bull run when PFP non-fungible tokens from top-tier collections like Bored Ape Yacht Club sometimes sold for millions of dollars. Big brands, however, have continued to pursue opportunities to service and monetize super fans with digital collectible initiatives.","FIFA also announced that Modex will be taking over \"strategic management\" of its digital collectible platform, which has already dropped several football-branded collections. \"Digital collectibles increase the ways in which fans can interact with their favorite players, teams, and the game they love, and we're honored to support FIFA on realizing this goal,\" Modex CEO Francesco Abbate said in a statement.","Using professional sports as an avenue to connect with consumers has been employed by various companies operating in the blockchain and crypto space. Crypto exchange OKX has a <a href=\"https:\/\/www.theblock.co\/post\/237200\/okx-manchester-city\" data-v-f87c67ca=\"\">sponsorship deal<\/a> in place with Manchester City, while the<span data-v-03de5780=\"\" data-v-f87c67ca=\"\"> French fantasy sports gaming company Sorare has a partnership with the English Premier League.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Saudi Arabia","content":"LOCATION"},{"type":"2026","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Modex","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Francesco Abbate","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Manchester City","content":"LOCATION"},{"type":"PFP","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"OKX","content":"ORGANIZATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"FIFA","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}