{"summary":"Prime International Trading, Inc. et al. v. BP P.L.C., et al. (№17–2233, 2d Cir., August 29, 2019) Link to case One of the things I like about technology","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/38849\/indirect-connection-to-u-s-markets-not-enough-for-commodities-price-fixing-case-to-survive-in-u-s-court","publishDate":"2019-09-07T16:16:58","id":6540,"type":null,"title":"Indirect connection to U.S. markets not enough for commodities price fixing case to survive in U.S. Court","category":["LEGAL"],"content":["<a class=\"cj cf ml mm mn mo\" href=\"http:\/\/www.ca2.uscourts.gov\/decisions\/isysquery\/fb445c9b-2879-4aca-bdb6-b76750a19fe4\/2\/doc\/17-2233_opn.pdf#xml=http:\/\/www.ca2.uscourts.gov\/decisions\/isysquery\/fb445c9b-2879-4aca-bdb6-b76750a19fe4\/2\/hilite\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Link to case<\/a>","One of the things I like about technology law — crypto and otherwise — is figuring out how existing laws apply to new technology. As you know if you follow this space, there’s no reported case where a judge has said: “hang it all, this technology hard — there’s simply no way we can reach a decision.” You can always find precedent if you look hard enough. Lawyers (and thus judges) are trained to reason by analogy and use rule of construction to fit new stuff into the existing legal rubric.","So if you’re interested in “crypto caselaw” this necessarily means that one has to keep an eye on all developments in all sorts of areas, and in cases that may not even mention the words “bitcoin”, “crypto-currency” or “blockchain.” This is how we end up this week looking at a class action involving alleged bitcoin price manipulation arising from predominately offshore conduct. In particular, the case deals with the extraterritorial application of the Commodities Exchange Act (CEA) in a case involving alleged misconduct in the trading of crude oil from Europe’s North Sea. For people working on crypto-related projects who are interested in avoiding the long arm of U.S. law, this case (and cases like it) are a useful read, which is why it’s finding its way into today’s Crypto Crude Oil Minute.","The plaintiffs in this cases are a bunch of folks who traded “futures and derivatives contracts pegged to North Sea oil — also known as Brent crude — on the Intercontinental Exchange Futures Europe (‘ICE Futures Europe’) and the New York Mercantile Exchange (‘NYMEX’) between 2002 and 2015.\" The defendants have an array of roles in connection with Brent crude — producing, refining, distributing, purchase and sale on the physical market and trading on global derivatives markets.","After explaining who the parties are, the Court offers this brief explanation of how Brent crude is extracted and delivered to markets, and how price is set:","Brent crude is extracted from the North Sea of Europe, and refers to oil pulled from four fields in the region: Brent, Forties, Oseberg, and Ekofisk (collectively, “BFOE”). The price of Brent crude serves as the benchmark for two‐ thirds of the world’s internationally‐traded crude.","Following extraction, Brent crude is delivered via pipeline to ports in Europe where it is loaded onto ships for delivery. These physical cargoes are bought and sold through private, over‐the‐counter (“OTC”) transactions between producers, refiners, and traders. Because these physical transactions are private and do not occur on an open exchange, the price of Brent crude is not immediately available to the public. Instead, price‐reporting agencies collect information about transactions from market participants and report it to the consuming public.","Spot prices for Brent Crude are based on reporting by a London company called Platts, which relies on market participants to report private transactions, but which exercises “discretion to accept or reject transactional data[.]”. Plaintiffs alleged that the Defendants engaged in market manipulation in violation of the Commodities Exchange act by “by executing fraudulent bids, offers, and transactions in the underlying physical Brent crude market” and then reporting the fake transactions to Platts to manipulate the price through a series of offshore acts that ultimately ended up involving U.S. markets:","Plaintiffs’ claim involves a causal chain that can be summarized as follows: Defendants engaged in artificial trades of physical Brent crude in foreign markets; Defendants systematically reported the artificial trade data to Platts; Platts reviewed and incorporated the fraudulent data into its calculation of the Dated Brent Assessment; ICE Futures Europe in turn incorporated the manipulated Dated Brent Assessment into the ICE Brent Index; the manipulated ICE Brent Index was used to settle Brent Futures that were traded on both the London‐based ICE Futures Europe and the U.S.‐based NYMEX; as a result, Brent Futures traded and settled at artificial prices, causing economic loss to traders such as Plaintiffs.","So one of the questions before this Court is whether this claimed activity is enough to trigger a U.S. Court’s jurisdiction under the Commodities Exchange Act. The trial court said no, and dismissed the case (which was filed in 2013, by the way). The 2d Circuit Court of Appeals affirmed, framing the question as “whether [the CEA] permits suit against Defendants for alleged manipulative conduct that transpired in Europe.”","The Court observed first that it would analyze the CEA in light of a basic presumption that U.S. laws do not apply extraterritorially — this is a “basic premise of our legal system.” Courts follow a two-step process to see if a statute is intended to apply outside the U.S. First, does the statute clearly state the intention to do so? Second, a claim may survive absent such a statement if it “properly states a ‘domestic application’ of the statute.”","According to the Court, and in contrast to certain parts of U.S. Securities laws, the relevant portions of the Commodities Exchange Act contain no “affirmative textual indication that it applies abroad.” One section of the CEA involving swaps does contain a clear statement of extra-territorial application where the activity has “a direct and significant connection with activities in, or effect on, commerce of the United States; or (2) contravene[s] such rules or regulations as the Commission may prescribe.” Unfortunately for the Plaintiffs, they didn’t raise this part of the CEA until their appeal, which was too late, and which the Court said actually hurt their argument because it showed that Congress knows how to make a law apply outside the U.S. when it wants to.","Next, the Court considered whether or not the conduct at issue was sufficiently tied to the U.S. to warrant application of the statute. Under existing precedent, the Court said it wasn’t — the conduct was “so predominantly foreign” that there wasn’t a proper domestic application of the statute. The “ripple effect” theory didn’t convince the court:","all of the relevant conduct here relating to that focus occurred abroad — Plaintiffs contend that Defendants sought to manipulate the price of Brent crude, and did so by fraudulently transacting in the physical market in Europe. Plaintiffs make no allegation of manipulative conduct or statements made in the United States. To the contrary, they expressly rely on a “ripple effect” or chain of events that resembles a falling row of dominoes commencing in the North Sea.","Now there is a big difference between Brent oil extraction, pricing, sales and trading and bitcoin mining, pricing sales and trading of course but … well, I confess that I read this entire case thinking about it might be applied in the future to cases alleging crypto price manipulation under the CEA, either by private plaintiffs (as here) or by the CFTC. Bottom line — just because you touch the U.S., it doesn’t mean that you necessarily have access to U.S. courts under the CEA. At the same time, while these plaintiffs lost, this case provides a potential roadmap for future litigants seeking to find their way into U.S. Courts.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2015","content":"DATE"},{"type":"the Court","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"ICE Futures Europe","content":"ORGANIZATION"},{"type":"Oseberg","content":"LOCATION"},{"type":"Brent Crude","content":"ORGANIZATION"},{"type":"Platts","content":"ORGANIZATION"},{"type":"2013","content":"DATE"},{"type":"Forties","content":"ORGANIZATION"},{"type":"2d Circuit Court of Appeals","content":"ORGANIZATION"},{"type":"Europe’s North Sea","content":"LOCATION"},{"type":"Crypto Crude Oil Minute","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"Futures Europe","content":"LOCATION"},{"type":"North Sea of Europe","content":"LOCATION"},{"type":"London","content":"LOCATION"},{"type":"CEA","content":"ORGANIZATION"},{"type":"North Sea","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"Intercontinental Exchange Futures Europe","content":"ORGANIZATION"},{"type":"Court","content":"ORGANIZATION"},{"type":"Commodities Exchange","content":"ORGANIZATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"Platts","content":"PERSON"},{"type":"Platts","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"2002","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"New York Mercantile Exchange","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["LAWSUITS"],"authors":["Stephen Palley","The Block"]}