{"summary":"Celsius&#x27; Committee of Unsecured Creditors addressed comments made by executives in a recently leaked recording of a company meeting.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/170089\/celsius-presents-creditors-plan-to-revive-business-operations","publishDate":"2022-09-14T16:22:38","id":6541,"type":null,"title":"Celsius presents creditors plan to revive business operations","category":["LEGAL"],"content":["Representatives for creditors and customers trying to claw back money from bankrupt crypto lender confirmed that Celsius's leadership has contacted them about a plan to revive business operations.&nbsp;&nbsp;","But the representatives, known collectively in proceedings as the Committee of Unsecured Creditors (UCC), have not thrown support to the proposed revival plan from the firm's executives, details of which leaked after they were discussed at an all-hands meeting.&nbsp;","Gregory Pesce, a lawyer for the committee, addressed ambitions by Celsius executives to restart business operations for the company.&nbsp;","<b data-v-f87c67ca=\"\">\"<\/b>The debtors, as has been widely reported, met with the UCC,\" said Pesce. \"They presented a concept. UCC does not support that concept. We don't support any end game here.\"","A <a href=\"https:\/\/t.co\/n5x4HJwWAk\" data-v-f87c67ca=\"\">recording<\/a> of a company all-hands meeting <a href=\"https:\/\/www.theblock.co\/post\/169710\/celsius-ceo-mashinsky-held-revival-plan-meeting-the-new-york-times\" data-v-f87c67ca=\"\">circulated yesterday<\/a> in which the two executives detailed their plan for a comeback, saying they hoped to pivot the firm towards more custodial services and charge fees for certain types of transactions, a project code-named \"Kelvin.\" In that <a href=\"https:\/\/www.youtube.com\/watch?v=40-w9r7WSKM\" data-v-f87c67ca=\"\">recording<\/a>, Celsius executives Alex Mashinsky and Oren Blonstein said they had already met with UCC representatives to present the proposal and \"got positive feedback.\" The recording was originally obtained and verified by the New York Times.&nbsp;","Pesce told the court that Celsius, \"have committed to running a process to market check what is out there and whatever the management team might ultimately produce,\" he said. Pesce added that creditor representatives are talking to Celsius and want the company to file a full plan in court.&nbsp;","In his leaked remarks, Blonstein indicated that the firm would propose the new business plan as a means of repaying customers who lost funds through the company. Celsius recently got approval <a href=\"https:\/\/www.theblock.co\/post\/167214\/celsius-seeks-to-reopen-withdrawals-for-certain-customers\" data-v-f87c67ca=\"\">to honor withdrawals<\/a> for certain custody customers, but it's unclear what remedy other types of users will see. In a recording posted online by Tiffany Fong, a Celsius customer and public commentator, Blonstein can be heard describing a proposal to restart staking and lending services.","Celsius' CEL token saw a brief spike in the hours after the recording leaked.&nbsp;","TradingView","Celsius <a href=\"https:\/\/www.theblock.co\/post\/157491\/crypto-lender-celsius-declares-chapter-11-bankruptcy-in-new-york\" data-v-f87c67ca=\"\">entered<\/a> Chapter 11 bankruptcy proceedings in July. Since the start of the process, multiple entities have demanded more clarity into the firm's financial management in the lead up to its collapse, including securities regulators. Some <a href=\"https:\/\/www.theblock.co\/post\/168369\/celsius-ran-a-ponzi-like-scheme-states-allege\" data-v-f87c67ca=\"\">contend<\/a> that Celsius has continuously misled the public as it relates to its financial health. Today's hearing is also ruling on the appointment of an <a href=\"https:\/\/www.theblock.co\/post\/168733\/creditor-representatives-support-plan-to-appoint-examiner-in-celsius-bankruptcy\" data-v-f87c67ca=\"\">outside examiner<\/a>, which would create a third-party report on Celsius' management and financials.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Committee of Unsecured Creditors (UCC","content":"ORGANIZATION"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"UCC","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Alex Mashinsky","content":"PERSON"},{"type":"Kelvin","content":"PERSON"},{"type":"Oren Blonstein","content":"PERSON"},{"type":"Tiffany Fong","content":"ORGANIZATION"},{"type":"Gregory Pesce","content":"PERSON"},{"type":"Pesce","content":"PERSON"},{"type":"Blonstein","content":"PERSON"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}