{"summary":"Ethereum scaling project StarkWare plans to open-source the StarkNet Prover in an effort to increase transparency of its code.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/208731\/starkware-open-sources-prover-technology-for-ethereum-layer-2-network","publishDate":"2023-02-05T06:58:39","id":6543,"type":null,"title":"StarkWare to open-source prover technology for Ethereum Layer 2 network","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Ethereum scaling project StarkWare plans to open-source the StarkNet Prover in an effort to make the technology publicly available and increase the transparency of its code.<\/span>","<span data-v-f87c67ca=\"\">The prover is a crucial component of the <a href=\"https:\/\/www.theblockresearch.com\/building-on-chain-gaming-on-starknet-154278\" data-v-f87c67ca=\"\">StarkNet<\/a>, a widely adopted Layer 2 scaling network for Ethereum based on the ZK-STARKs technology. The prover is responsible for generating cryptographic proofs to compress transactions and improve the efficiency of Layer 2 scaling.<\/span>","<span data-v-f87c67ca=\"\">The open-sourcing of the StarkNet Prover will allow for more individuals to review the code, helping to detect bugs and increase transparency. This move may also be viewed as a positive step toward greater decentralization of the StarkNet, the team said.<\/span>","<span data-v-f87c67ca=\"\">Eli Ben-Sasson, co-founder of StarkWare and co-inventor of ZK-STARKs, commented on the open-sourcing, saying, \"This marks a significant step for scaling Ethereum and cryptography, as STARK technology becomes a publicly available resource.\"<\/span>","<span data-v-f87c67ca=\"\">StarkNet was launched on the Ethereum mainnet in November 2021 in alpha stage, and since then the StarkWare team has gradually open-sourced elements of the StarkNet stack, including the <a href=\"https:\/\/www.theblock.co\/post\/189798\/starkware-open-sources-latest-version-of-its-cairo-programming-language\" data-v-f87c67ca=\"\">Cairo 1.0<\/a> programming language, <a href=\"https:\/\/www.theblock.co\/post\/201471\/starkware-rolls-out-open-source-client-papyrus-for-starknet\" data-v-f87c67ca=\"\">Papyrus<\/a> client software and the StarkNet sequencer. Today's decision will mark the completion of open-sourcing the full StarkNet software stack once implemented in near future, the team said.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"November 2021","content":"DATE"},{"type":"Eli Ben-Sasson","content":"PERSON"},{"type":"Cairo","content":"LOCATION"},{"type":"This marks","content":"MONEY"}],"hashtag":["STARKNET"],"authors":["Vishal Chawla","The Block"]}