{"summary":"Our industry just experienced its most significant crises ever. The events of this past year forced a stress test upon every industry player, especially major CeFi lenders, and many who positioned themselves as good, prudent actors ultimately failed.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/207621\/lending-is-here-to-stay","publishDate":"2023-02-20T08:50:00","id":6544,"type":null,"title":"Lending is here to stay","category":["SPONSORED"],"content":["<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Our industry just experienced its most significant crises ever. The events of this past year forced a stress test upon every industry player, especially major CeFi lenders, and many who positioned themselves as good, prudent actors ultimately failed.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">While the demise of some of the best-known lenders has understandably rocked confidence, these failures do not signal the death knell of CeFi. With the ongoing need for capital and the state of digital asset lending today, the need for strong CeFi lenders is greater than ever before. However, lessons from those who failed, and from those who survived like Ledn, must be learned.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Whether operating in CeFi, DeFi or TradFi, all lending businesses come with risks. To succeed, an experienced lender must manage those risks and protect the assets that clients entrust to them, particularly during times of volatility. To do so, prudent lenders combine robust credit underwriting and credit monitoring practices with strong and sensible risk management protocols. Not every lender is created equal in this regard.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">With several legacy CeFi lenders no longer active, some investors are left wondering whether DeFi lending is the next logical step. While developments in DeFi lending have shown some promise in this past cycle, there are things that DeFi is not built to offer, such as bespoke loan terms to meet unique customer needs, issuing a Bitcoin-backed mortgage on a real-world asset, offering customer support, among others.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Furthermore, CeFi lenders, whether in crypto or TradFi, bring value to the crypto lending ecosystem that simply cannot be replaced by algorithms today, such as:<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Although Ledn had exposure to FTX and Alameda, Ledn fully absorbed the impact of such exposure with no clients’ assets impacted. Instead of pausing withdrawals like some of our competitors, we processed them in record time during the turmoil. Clients put their faith in Ledn’s ability to execute on its sound risk management policies and procedures when called upon, and as designed, Ledn did just that.&nbsp;<\/span><span data-ccp-props=\"{&quot;134245417&quot;:false,&quot;201341983&quot;:0,&quot;335559740&quot;:240}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Crypto still needs capital management, and many within the industry are looking for partners who will help them manage their holdings prudently and responsibly. Ledn will continue to re-examine and strengthen its risk management program. We pioneered Proof of Reserves for the industry, and we are evaluating how we can raise the bar even further by incorporating even greater transparency and client control into its product innovation. At Ledn, we are in a privileged position to lead and reshape the digital asset lending industry moving forward.&nbsp;&nbsp;<\/span><span data-ccp-props=\"{&quot;134245417&quot;:false,&quot;201341983&quot;:0,&quot;335559740&quot;:240}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">—<\/span><span data-ccp-props=\"{&quot;134245417&quot;:false,&quot;201341983&quot;:0,&quot;335559740&quot;:240}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<i data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">Mauricio Di Bartolomeo is the Co-Founder and Chief Strategy Officer of Ledn Inc. He is the author of The Bitcoin Economic Calendar, a weekly market insights newsletter. Check out <\/span><\/i><a href=\"https:\/\/blog.ledn.io\/en\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">https:\/\/blog.ledn.io\/en<\/span><\/i><\/a><i data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\"> to subscribe.<\/span><\/i><span data-contrast=\"none\" data-v-f87c67ca=\"\">&nbsp;<\/span><span data-ccp-props=\"{&quot;134245417&quot;:false,&quot;201341983&quot;:0,&quot;335559738&quot;:240,&quot;335559739&quot;:240,&quot;335559740&quot;:240}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<em data-v-f87c67ca=\"\">This post is commissioned by Ledn and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ledn","content":"PERSON"},{"type":"Alameda","content":"LOCATION"},{"type":"Mauricio Di Bartolomeo","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"The Bitcoin Economic Calendar","content":"ORGANIZATION"},{"type":"Chief Strategy Officer of Ledn Inc","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}