{"summary":"Base appeared to stall on Tuesday, with the Layer 2 having since identified the issue and said it is implementing a solution. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/249343\/coinbase-incubated-base-experiences-stall-in-block-production","publishDate":"2023-09-05T18:03:52","id":6545,"type":null,"title":"Coinbase-incubated Base experiences stall in block production","category":["CRYPTO ECOSYSTEMS"],"content":["Coinbase-developed blockchain Base appeared to stall on Tuesday. The Layer 2 quickly deployed a fix and said it had started to see a recovery.&nbsp;","\"We are investigating a stall in production of blocks,\" Base wrote in a status <a href=\"https:\/\/status.base.org\/\" data-v-f87c67ca=\"\">update<\/a>. \"Users may have issues submitting transactions. We are actively investigating and will provide updates as we have them.\"","Base has since identified the issue and said it is implementing a solution. \"We've begun remediating,\" it wrote in a status update.","\"We have deployed a fix and are starting to see recovery of block production and gossip,\" it added at 6:09 p.m. ET.","The Block Research confirmed around 5:45 p.m. ET that transactions had not been going through. The issue appeared to have been the largest technical glitch the protocol has experienced since its public <a href=\"https:\/\/www.theblock.co\/post\/243899\/base-mainnet-onchain-summer\" data-v-f87c67ca=\"\">launch<\/a> on Aug. 9.&nbsp;","Despite it's short life-span, Base has come to dominate daily new unique addresses for optimistic rollups, The Block's Data Dashboard shows.&nbsp;&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/optimistic-rollups\/daily-new-unique-addresses-for-optimistic-rollups\/embed\" title=\"Daily New Unique Addresses for Optimistic Rollups\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"6:09 p.m. ET","content":"TIME"},{"type":"5:45 p.m.","content":"TIME"},{"type":"Tuesday","content":"DATE"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Block Research","content":"ORGANIZATION"},{"type":"Aug. 9","content":"DATE"}],"hashtag":["BASE"],"authors":["MK Manoylov","The Block"]}