{"summary":"S&amp;P Global Ratings ranked USDM&#x27;s ability to keep its peg as &quot;adequate&quot; by looking at market risk, reserve funds and other criteria.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283433\/sp-global-ratings-deems-mountain-protocols-usdm-as-adequate-in-new-stablecoin-stability-assessment-report","publishDate":"2024-03-19T11:22:15","id":6548,"type":null,"title":"S&amp;P Global Ratings deems Mountain Protocol&#x27;s USDM as &#x27;adequate&#x27; in new Stablecoin Stability Assessment report","category":["STABLECOINS"],"content":["S&amp;P Global Ratings has issued its ninth Stablecoin Stability Assessment, this time focusing on Mountain Protocol's yield-bearing stablecoin USDM.","The assessment evaluates a stablecoin's capacity to sustain its peg, with USDM receiving a rating of 3, indicating \"adequate\" performance according to the firm's criteria.","S&amp;P Global Ratings assesses numerous aspects of the stablecoin, including credit risk, market risk, custody risk, reserve funds, robustness of its liquidation mechanism and available overcollateralization. Additional factors such as governance, regulatory frameworks and third-party dependencies are also considered. The firm then scores these criteria between 1 for “very strong” and 5 for “weak.”&nbsp;","Other stablecoins previously assessed include <a href=\"https:\/\/www.theblock.co\/learn\/251863\/what-is-usdc-and-how-does-it-work-a-guide-to-circles-stablecoin\" data-v-f87c67ca=\"\">USDC<\/a> at 2 (strong), Tether at 4 (constrained) and DAI at 4 (constrained).&nbsp;","\"We are thrilled with the overwhelmingly positive market reception to our Stablecoin Stability Assessment and are excited to expand our coverage to include USDM,\" said \"Chuck Mounts, Chief DeFi Officer at S&amp;P Global Ratings, in a statement. \"We remain committed to enhancing transparency and insights in the rapidly evolving world of decentralized finance.”","Mountain Protocol <a href=\"https:\/\/www.theblock.co\/post\/250201\/mountain-protocol-launches-yield-bearing-stablecoin-announces-seed-fundraise\" data-v-f87c67ca=\"\">launched<\/a> USDM in early September 2023 and was licensed by the Bermuda Monetary Authority. USDM is an ERC-20 token fully backed by short-term U.S. Treasuries. It gives holders a daily yield using a rebasing mechanism, with an algorithm to help maintain the token's price, and was characterized by Mountain as being \"very similar to Lido Finance's&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/158154\/lido-to-launch-liquid-staking-on-ethereum-layer-2-networks\" data-v-f87c67ca=\"\">stETH<\/a>.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Bermuda Monetary Authority","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Chuck Mounts","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"USDM","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"S&amp;P Global Ratings","content":"ORGANIZATION"},{"type":"Lido Finance","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"September 2023","content":"DATE"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}