{"summary":"Sheryl Sandberg, chief operating officer of Meta for 14 years, will step down later this year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/149733\/meta-coo-sheryl-sandberg-is-stepping-down-from-her-role-after-14-years","publishDate":"2022-06-01T16:28:14","id":6549,"type":null,"title":"Meta COO Sheryl Sandberg is stepping down from her role after 14 years","category":["COMPANIES"],"content":["Sheryl Sandberg, the chief operating officer of Meta, will depart the company after 14 years.","Sandberg took the role of COO at Meta, then known as Facebook,&nbsp; in March of 2008, after having met Meta chief executive Mark Zuckerberg at a Christmas party.","Prior to her tenure at Facebook, Sandberg had built the advertising business at Google. In 2012, Sandberg become the eighth board member and first female board member of Facebook. At the social media giant, she oversaw the advertising business that helped businesses target users through data collected from their profiles and user activities.","Sandberg wrote in the post, shared Wednesday:","\"When I took this job in 2008, I hoped I would be in this role for five years. Fourteen years later, it is time for me to write the next chapter of my life. I am not entirely sure what the future will bring – I have learned no one ever is. But I know it will include focusing more on my foundation and philanthropic work, which is more important to me than ever given how critical this moment is for women.\"","During her tenure, she also oversaw operations including sales, marketing, human resources, and communications.","Sandberg will officially leave the company this fall, after transitioning her direct reports over the coming months.&nbsp;","\"Over the next few months, Mark and I will transition my direct reports and I will leave the company this fall. I still believe as strongly as ever in our mission, and I am honored that I will continue to serve on Meta’s board of directors,\" she wrote.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"fall","content":"DATE"},{"type":"Sandberg","content":"PERSON"},{"type":"March of 2008","content":"DATE"},{"type":"2012","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Meta","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"Sheryl Sandberg","content":"PERSON"},{"type":"Facebook","content":"LOCATION"},{"type":"2008","content":"DATE"},{"type":"Mark Zuckerberg","content":"PERSON"}],"hashtag":[],"authors":["Anushree Dave","The Block"]}