{"summary":"Binance is adding zk-SNARKs to its proof-of-reserves (PoR) system to increase transparency for users&#x27; funds.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210137\/binance-deploys-zk-snarks-on-proof-of-reserves-system","publishDate":"2023-02-10T05:10:00","id":6551,"type":null,"title":"Binance deploys zk-SNARKs on proof-of-reserves system","category":["EXCHANGES"],"content":["Binance, the largest centralized cryptocurrency exchange by volume, has incorporated a type of zero knowledge proofs called zk-SNARKs into its proof-of-reserves verification. This is to attest that funds held on the platform are backed 1:1 while preserving the privacy of sensitive user data.","<span data-v-f87c67ca=\"\">Currently, this updated PoR system supports verifying the exchange's reserves for 13 different crypto assets.<\/span>","<span data-v-f87c67ca=\"\">The exchange made this addition in response to growing concerns from investors about the safety of their funds on cryptocurrency exchanges. Binance had previously released a PoR system solely based on Merkle Tree — a data structure used in cryptography that can be used for verification.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">The Binance team found the Merkle Tree-based system alone was not ideal for user privacy, so it added support for zero-knowledge proofs.<\/span>","<span data-v-f87c67ca=\"\">\"Continuing the efforts in providing transparency on user funds, Binance is excited to introduce zk-SNARKs, a zero-knowledge verification method that keeps sensitive information private and more secure, to its proof-of-reserves (PoR) verification system,\" the exchange <a href=\"https:\/\/www.binance.com\/en\/support\/announcement\/binance-proof-of-reserves-verification-system-upgrade-introducing-zk-snarks-d8e1e2ed54d343c1b40bf812f0914236\" data-v-f87c67ca=\"\">said<\/a>.<\/span>","<span data-v-f87c67ca=\"\">Zk-SNARK is a cryptographic tool for verifying or proving certain information without actually showing or revealing what that information is. Binance has also decided to make the zk-SNARK software open-source, allowing anyone to review the code. <\/span><span data-v-f87c67ca=\"\">The team maintains that by making it open-source, it can build greater trust on the platform.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Binance","content":"PERSON"}],"hashtag":["BINANCE"],"authors":["Vishal Chawla","The Block"]}