{"summary":"Acala Network, the decentralized finance hub of Polkadot, was breached and its stablecoin depegged from the dollar.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/163467\/polkadot-based-stablecoin-ausd-depegs-after-acala-network-breach","publishDate":"2022-08-14T09:49:58","id":6554,"type":null,"title":"Polkadot-based stablecoin aUSD depegs after Acala Network breach","category":["HACKS"],"content":["Acala Network, the decentralized finance hub of Polkadot, has been breached and its stablecoin depegged from the dollar mark.","Early this morning, Acala's Twitter page <a href=\"https:\/\/twitter.com\/AcalaNetwork\/status\/1558642849649856512\" data-v-f87c67ca=\"\">posted<\/a> that it noticed configuration issues regarding the Honzon protocol, which affects its stablecoin aUSD, leading to a vote to pause operations on Acala while it investigated the issue.&nbsp;","According to Coinmarket cap, the stablecoin is currently <a href=\"https:\/\/coinmarketcap.com\/currencies\/acala-dollar\/\" data-v-f87c67ca=\"\">below the $1 dollar mark<\/a>, at one point dropping to a low of $0.58. Acala's aUSD is \"a decentralized, multi-collateralized stablecoin backed by cross-chain assets\" according to its <a href=\"https:\/\/acala.network\/\" data-v-f87c67ca=\"\">website<\/a>.&nbsp;","\"We have identified the issue as a misconfiguration of the iBTC\/aUSD liquidity pool (which went live earlier today) that resulted in error mints of a significant amount of aUSD,\" said Acala in a <a href=\"https:\/\/twitter.com\/AcalaNetwork\/status\/1558785360670298112\" data-v-f87c67ca=\"\">Twitter statement<\/a>. \"The misconfiguration has since been rectified and wallet addresses that received the errorneously minted aUSD have been identified, with on-chain activity tracing in respect of these addresses underway.\"&nbsp;","While Acala has yet to confirm the amount that was involved in the breach, Binance CEO Changpeng Zhao reacted to the news by saying it was <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1558731164558442498\" data-v-f87c67ca=\"\">possible that \"over a billion $AUSD\"<\/a> was obtained by the attacker.&nbsp;","The Block reached out to Acala Network for comment but hadn't heard back by the time of publication.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"this morning","content":"TIME"},{"type":"$0.58","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$AUSD","content":"MONEY"},{"type":"Polkadot","content":"LOCATION"},{"type":"Acala","content":"ORGANIZATION"},{"type":"$1 dollar mark","content":"MONEY"},{"type":"Changpeng Zhao","content":"PERSON"}],"hashtag":[],"authors":["Tom Matsuda","The Block"]}