{"summary":"The SEC said the video game publisher knew employee retention issues were &quot;a particularly important risk in its business,&quot; but did not have adequate controls in place to assess and address workplace misconduct complaints between 2018 and 2021. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/208517\/activision-blizzard-pays-35-million-sec-fine-for-disclosure-control-whistleblower-violations","publishDate":"2023-02-03T10:51:11","id":6556,"type":null,"title":"Activision Blizzard pays $35 million SEC fine for disclosure control, whistleblower violations","category":["COMPANIES"],"content":["Activision Blizzard agreed to pay a $35 million fine from the Securities and Exchange Commission for its failure to maintain disclosure controls and whistleblower violations stemming from allegations of workplace misconduct.","The SEC <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2023-22\" data-v-f87c67ca=\"\">said<\/a> the video game publisher knew employee retention issues were \"a particularly important risk in its business,\" but did not have adequate controls in place to assess and address workplace misconduct complaints between 2018 and 2021.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe regulator also said Activision Blizzard violated whistleblower laws by requiring former employees to tell the company if the SEC ever reached out for information.&nbsp;","In paying the fine, Activision Blizzard neither admitted nor denied the commission's findings.&nbsp;","Activision Blizzard's former chief operating officer, Daniel Alegre, is set to take over Bored Ape Yacht Club creator Yuga Labs. He had served as the COO since April 2020.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Daniel Alegre","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"April 2020","content":"DATE"},{"type":"$35 million","content":"MONEY"},{"type":"Activision Blizzard","content":"ORGANIZATION"},{"type":"COO","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Activision","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["YUGA LABS"],"authors":["Larry DiTore","The Block"]}