{"summary":"Sam Bankman-Fried wants to use FTX’s director and officer insurance plan to reimburse his costly legal bills","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/223832\/ftx-bankman-fried-request-to-pay-legal-bills-unfair-and-inequitable","publishDate":"2023-03-29T16:41:15","id":6557,"type":null,"title":"FTX: Bankman-Fried request to pay legal bills &#x27;unfair&#x27; and &#x27;inequitable&#x27;","category":["POLICY"],"content":["It would be \"unfair\" and \"inequitable\" to let former FTX CEO Sam Bankman-Fried \"drain\" a $10 million company insurance policy to pay his legal bills, lawyers for troubled crypto firm FTX said in a court filing.&nbsp;","\"Multiple other current and former directors, officers and employees are facing government inquiries and other claims covered by the D&amp;O Policies. All are looking to the same, limited insurance,\" the FTX debtors said. \"If the court is inclined to lift the automatic stay ... the court should enter relief broad enough to allow the insurers to pay any or all insureds, pursuant to the terms and conditions of the policies, and not just Mr. Bankman-Fried.\"","The former CEO made the request in the U.S. Bankruptcy Court for the District of Delaware earlier this month. The FTX debtors are not legally allowed to oppose Bankman-Fried's request to lift a stay on the insurance policy.","In a separate filing, the Official Committee of Unsecured Creditors, a group of FTX or FTX-affiliated company customers, asked the judge to deny Sam Bankman-Fried’s request to use the insurance policy to reimburse his legal bills.","“Directors and officers insurance policies exist to protect the company and its directors and officers in situations where they make honest decisions in the ordinary course of the business. This is not that case,” the committee said in a court filing on Wednesday. “This court should decline Mr. Bankman-Fried’s request.\"","Bankman-Fried and the FTX debtors, which includes the entity West Realm Shires, “share entitlement” to the $10 million in coverage under the insurance plan, according to the committee, which noted that every dollar that essentially goes to Bankman-Fried's legal costs reduces the amount of money that can be used to repay creditors.&nbsp;","“For every dollar extended by the insurance carrier to Mr. Bankman-Fried’s defense costs, there is one less dollar to pay the WRS debtors’ covered losses,” the committee said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","FTX's statement and the creditors committee’s objection come after <a href=\"https:\/\/www.forbes.com\/sites\/sarahemerson\/2023\/03\/29\/sam-bankman-fried-legal-fees-funded-by-alameda-money-gifted-to-father-joe-bankman\/?sh=79dbd6593f57\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">reports<\/span><\/a> that Bankman-Fried is funding his criminal legal defense with a gift that Alameda Research, his bankrupt crypto trading firm, made to his father. Bankman-Fried is accused of mishandling FTX customer funds and using the money to prop up Alameda Research and make illegal political donations, among other crimes.","Bankman-Fried pleaded not guilty in the U.S. District Court for the Southern District of New York and is awaiting an October trial.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<i data-v-f87c67ca=\"\">The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.<\/i>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"Official Committee of Unsecured Creditors","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Shires","content":"PERSON"},{"type":"Alameda","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"the Southern District of New York","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"$10 million","content":"MONEY"},{"type":"the District of Delaware","content":"ORGANIZATION"}],"hashtag":["FTX","SAM BANKMAN-FRIED"],"authors":["Stephanie Murray","The Block"]}