{"summary":"Federally chartered banks can hold reserve funds for fiat-backed stablecoin issuers, according to new guidance from the U.S. Office of the Comptroller of the Currency. \n“This opinion provides greater regulatory certainty for banks within the federal banking system to provide those client services in a safe and sound manner,” Acting Comptroller Brian Brooks said in a statement.\nThe letter stressed that banks are cleared to hold such reserves provided that ” the issuer has sufficient assets backing the stablecoin in situations where there is a hosted wallet.”","author":["Michael McSweeney","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/78426\/us-banks-stablecoins-reserves","publishDate":"2020-09-21T16:00:06","id":656,"type":null,"title":"U.S. banks can hold reserve funds for stablecoin issuers, says federal regulator","category":["The Block"],"content":["National banks and federal savings associations can now hold reserve funds for stablecoin issuers, according to new guidance from the U.S. Office of the Comptroller of the Currency.&nbsp;","A new six-page interpretive letter notes that \"stablecoin issuers may desire to place assets in a reserve account with a national bank to provide assurance that the issuer has sufficient assets backing the stablecoin in situations where there is a hosted wallet. For the reasons discussed below, we conclude that a national bank may hold such stablecoin “reserves” as a service to bank customers.\"","The OCC goes on to stress that \"[w]e are not presently addressing the authority to support stablecoin transactions involving un-hosted wallets. In addition, this letter only addresses the use of stablecoin backed on a 1:1 basis by a single fiat currency where the bank verifies at least daily that reserve account balances are always equal to or greater than the number of the issuer’s outstanding stablecoins.\" As expected, it stresses that banks that undertake such lines of business adhere to anti-money laundering and Know-Your-Customer regulations, as well as federal securities laws.&nbsp;","\"A bank should consider all relevant risk factors, including liquidity risk and compliance risk, before entering any agreement or relationship with a stablecoin issuer,\" the letter concludes.","Monday's development notably follows the OCC's decision to allow federally chartered banks <a href=\"https:\/\/www.theblockcrypto.com\/post\/72628\/us-bank-regulator-crypto-custody\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">to hold custody of cryptocurrencies<\/a>. Industry observers and stakeholders <a href=\"https:\/\/www.theblockcrypto.com\/daily\/72693\/occ-crypto-custody-big-banks\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">cheered the move at the time<\/a>, with some contending that it represented a positive long-in-the-making, policy shift.","In a statement, Acting Comptroller of the Currency Brian Brooks said that federally chartered banks are \"currently engage in stablecoin related activities involving billions of dollars each day.\"","\"This opinion provides greater regulatory certainty for banks within the federal banking system to provide those client services in a safe and sound manner,\" he said.","Published alongside the OCC letter was <a href=\"https:\/\/www.sec.gov\/news\/public-statement\/sec-finhub-statement-occ-interpretation\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a staff statement<\/a> from the SEC's FinHub unit, which focuses in part on issues related to digital assets. Though stressing that the staff statement does not represent guidance or an statement from the wider Commission, the released noted that \"[w]hether a particular digital asset, including a so-called \"stablecoin,\" is a security under the federal securities laws is inherently a facts and circumstances determination.\"","\"This determination requires a careful analysis of the nature of the instrument, including the rights it purports to convey, and how it is offered and sold,\" the staff continued, noting:","\"The Staff stands ready to engage with market participants to assist them and to consider providing, if appropriate, a \"no-action\" position regarding whether activities with respect to a specific digital asset may invoke the application of the federal securities laws,\" the staff statement concluded.","<em data-v-f87c67ca=\"\">The full interpretive letter can be found below:<\/em>","<a title=\"View 2020-125a on Scribd\" href=\"https:\/\/www.scribd.com\/document\/476914986\/2020-125a#from_embed\" data-v-f87c67ca=\"\">2020-125a<\/a> by <a title=\"View MichaelPatrickMcSweeney's profile on Scribd\" href=\"https:\/\/www.scribd.com\/user\/265494999\/MichaelPatrickMcSweeney#from_embed\" data-v-f87c67ca=\"\">MichaelPatrickMcSweeney<\/a> on Scribd","<iframe id=\"doc_36742\" class=\"scribd_iframe_embed\" title=\"2020-125a\" src=\"https:\/\/www.scribd.com\/embeds\/476914986\/content?start_page=1&amp;view_mode=scroll&amp;access_key=key-F88nSjhvUICpzHFzbutg\" width=\"100%\" height=\"600\" frameborder=\"0\" scrolling=\"no\" data-auto-height=\"false\" data-aspect-ratio=\"0.75\" data-v-f87c67ca=\"\"><\/iframe>"],"hashtag":["OCC"]}