{"summary":"Ethereum scaling project Polygon no longer has C-suite positions such as CEO and COO, The Block has learned.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/128753\/polygon-co-founders-no-longer-have-c-suite-positions","publishDate":"2021-12-30T07:00:12","id":6562,"type":null,"title":"Polygon co-founders say they&#x27;ve ditched C-suite positions","category":["DEFI"],"content":["Ethereum scaling project Polygon no longer has C-suite positions such as CEO and COO.","Polygon co-founder Sandeep Nailwal, who was also the COO of the project, has removed that position from his job title sometime this month, according to his <a href=\"https:\/\/www.linkedin.com\/in\/sandeep-nailwal-60709a33\/\" data-v-f87c67ca=\"\">LinkedIn<\/a> profile.","When contacted, Nailwal told The Block that he recently updated his LinkedIn profile as Polygon has removed all C-suite positions.","","","","","Another co-founder of Polygon, Mihailo Bjelic, told The Block that Polygon, being a decentralized project, decided to quash C-level roles \"months ago.\"","\"We want to make it even more decentralized,\" he said, adding that the functional degree of co-founders' work remains the same.","\"Sandeep is in charge of all pretty much all the operations of the business side. Absolute nothing has changed here,\" he added.","Bjelic went on to compare Polygon to Ethereum, saying that the latter doesn't have C-suite positions either.","Earlier this month, the Polygon network was at risk of losing all of its <a href=\"https:\/\/www.theblockcrypto.com\/post\/128784\/polygon-critical-bug-24-billion-matic-tokens-at-risk-hard-fork\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">more than 9 billion MATIC tokens<\/a> (currently worth over $23 billion) due to a <a href=\"https:\/\/blog.polygon.technology\/all-you-need-to-know-about-the-recent-network-upgrade\/\" data-v-f87c67ca=\"\">critical bug<\/a>. But whitehat hackers discovered the bug and Polygon moved to upgrade its mainnet (or hard forked its network). In the process, Polygon paid a total of about $3.46 million in bug bounties to two whitehat hackers.","Polygon's removal of C-level positions comes as more crypto companies are declaring themselves decentralized and doing away with headquarters. Earlier this year, <a href=\"https:\/\/blog.coinbase.com\/coinbase-is-a-decentralized-company-with-no-headquarters-a9762c02546\" data-v-f87c67ca=\"\">Coinbase said<\/a> it is a \"decentralized company\" with no headquarters.","Binance, on the other hand, is now looking to set up headquarters somewhere because having no head office \"doesn't go well with regulators,\" and some think the company is \"dodgy,\" <a href=\"https:\/\/www.theblockcrypto.com\/linked\/117855\/binance-shift-away-decentralized-headquarters-pitch\" data-v-f87c67ca=\"\">according to Binance CEO<\/a> Changpeng Zhao.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"9 billion","content":"MONEY"},{"type":"Polygon","content":"LOCATION"},{"type":"COO","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Nailwal","content":"ORGANIZATION"},{"type":"$23 billion","content":"MONEY"},{"type":"Coinbase","content":"PERSON"},{"type":"$3.46 million","content":"MONEY"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Sandeep Nailwal","content":"PERSON"},{"type":"Mihailo Bjelic","content":"PERSON"},{"type":"Sandeep","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["POLYGON"],"authors":["Yogita Khatri","The Block"]}