{"summary":"DeFi lending platform Compound has placed borrow caps on 10 non-stablecoin crypto collateral assets, including its own token COMP.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/190583\/defi-lender-compound-to-set-borrow-caps-on-10-crypto-collateral-assets","publishDate":"2022-11-29T08:43:19","id":6569,"type":null,"title":"DeFi lender Compound to set borrow caps on 10 crypto collateral assets","category":["DEFI"],"content":["Compound will enforce loan limits on 10 crypto tokens in its version 2 protocol at the end of November, thus reducing the amount of the affected collateral that users can borrow.","This decision is based on a governance <a href=\"https:\/\/compound.finance\/governance\/proposals\/135\" data-v-f87c67ca=\"\">vote<\/a> concluded on Monday. The governance vote was on a <a href=\"https:\/\/www.comp.xyz\/t\/risk-parameter-updates-2022-11-23\/3802\" data-v-f87c67ca=\"\">proposal<\/a> submitted by DeFi risk management protocol Gauntlet to the Compound DAO. Gauntlet’s proposal called for Compound to set borrow caps on certain collateral assets. This move, Gauntlet explained, was to adjust the risk parameters of Compound v2.","The 10 crypto collateral assets affected include Compound’s own COMP token as well as wrapped bitcoin (WBTC) and Uniswap’s UNI token. Other tokens include SushiSwap’s SUSHI, Aave’s AAVE, and MakerDAO’s MKR. In total, 10 collateral assets will have borrow limits on Compound v2. Half of these tokens, including WBTC and SUSHI, did not previously have any borrow caps.","<span data-v-f87c67ca=\"\">The new borrow cap for non-stablecoin collateral on Compound v2. Table: Compound governance<\/span>","For Gauntlet, the need to enforce loan limits has to do with limiting the impact of high-risk attack vectors. The DeFi risk manager pointed to DeFi lender Aave, which recently incurred <a href=\"https:\/\/www.theblock.co\/post\/189606\/llama-and-gauntlet-submit-proposal-to-cover-1-6-million-in-bad-debt-on-aave\" data-v-f87c67ca=\"\">$1.6 million in bad debt<\/a>. Aave’s bad debt originated from <a href=\"https:\/\/www.theblock.co\/post\/189167\/curve-token-jumps-50-amid-squeeze-on-big-short-position\" data-v-f87c67ca=\"\">a big short position<\/a> on the CurveDAO token (CRV).","Gauntlet argued that borrow caps on non-stablecoin collateral assets had insignificant capital efficiency risks. This is because 96% of Compound’s lending volume is in stablecoins. The DeFi risk manager added that these limits could be increased in the future if organic demand for the affected collateral assets begins to increase.","Not everyone in the Compound community agreed with Gauntlet’s plan. Some community members argued that enacting borrow caps could reduce Compound’s competitiveness in the DeFi market and force volume to migrate to competitors like Aave. Despite these objections, the vote passed with unanimous approval.","Compound setting borrow caps on these assets is the latest move by DeFi lenders to protect against market manipulation and other tail risks associated with tokens with unfavorable liquidity profiles. Compound previously <a href=\"https:\/\/www.theblock.co\/post\/179688\/compound-suspends-four-tokens-with-low-liquidity-as-lending-assets\" data-v-f87c67ca=\"\">suspended the use of four tokens<\/a> — 0x, basic attention token, yearn, and MKR — as lending collateral. These tokens are among the list of ten tokens with borrow limits. Aave has also paused the use of <a href=\"https:\/\/www.theblock.co\/post\/190199\/aave-pauses-lending-markets-for-17-ethereum-based-tokens\" data-v-f87c67ca=\"\">17 Ethereum-based tokens<\/a> in its lending platform.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gauntlet","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"CRV","content":"ORGANIZATION"},{"type":"$1.6 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Compound DAO","content":"ORGANIZATION"},{"type":"96%","content":"PERCENT"},{"type":"November","content":"DATE"}],"hashtag":["DAOS","GOVERNANCE VOTES","LENDING"],"authors":["Osato Avan-Nomayo","The Block"]}