{"summary":"MyEtherWallet (MEW), an ethereum wallet that allows users to store, send and receive ether (ETH) and ERC-20 tokens, has released an updated Google Chrome extension. Updated extension allows users to create a burn wallet address to interact with decentralized applications (dApps).","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/45194\/myetherwallet-revamps-chrome-extension-allowing-users-to-create-a-burn-address-to-privately-interact-with-dapps","publishDate":"2019-10-30T13:59:54","id":6572,"type":null,"title":"MyEtherWallet revamps Chrome extension; allows users to create a burn address","category":["WALLETS"],"content":["MyEtherWallet (MEW), an ethereum wallet that allows users to store, send and receive ether (ETH) and ERC-20 tokens, has released an updated Google Chrome extension.","Revealing the news exclusively to The Block on Wednesday, MEW said the updated extension allows users to create a burn wallet address to interact with decentralized applications (dApps). Burn addresses don't hold any funds and are not connected to any other existing wallet addresses, ensuring privacy.","The majority of dApps today require users to provide their ethereum address before they can explore or interact with them, said MEW, adding that with a burn address users can explore dApps without revealing their more permanent wallet addresses where they hold funds.","“MEW Chrome extension is the first to ensure that its users are in total control of which addresses and accounts they share with any Dapps, making user privacy a first priority,\" said Kosala Hemachandra, founder and CEO of MEW, in the announcement.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nHemachandra separately told The Block that the creation of burn addresses gives users \"full control over their Dapp use and their privacy.\"","The updated MEW Chrome extension also blocks known phishing websites to protect users, per the announcement.","MEW always offered a Chrome extension but wanted to give it a full update to improve security and user experience, Hemachandra told The Block. There are currently 158,203 users for the MEW Chrome extension, according to the <a href=\"https:\/\/chrome.google.com\/webstore\/detail\/myetherwallet\/nlbmnnijcnlegkjjpcfjclmcfggfefdm?hl=en\" data-v-f87c67ca=\"\">Chrome web store<\/a>. MEW rival MetaMask, on the other hand, has <a href=\"https:\/\/chrome.google.com\/webstore\/detail\/metamask\/nkbihfbeogaeaoehlefnkodbefgpgknn?hl=en\" data-v-f87c67ca=\"\">over 1 million<\/a> users for its Chrome extension.","Hemachandra further told The Block that the extension is currently free to use but to monetize it in the future, MEW may offer opt-in services through partners - similar to its website.","While Hemachandra did not disclose the firm's current revenues, he said it is based on partnerships and the firm is diversifying its revenue streams by increasing the number and types of services users can access.","Notably, MEW has never raised any funds via venture capital firms or crowdfunding platforms, Hemachandra told The Block, adding that the firm is open to such options in the future.","There are currently 20 people working for MEW, with most based in Los Angeles, and the firm is currently not actively looking to hire new talent, Hemachandra told The Block.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kosala Hemachandra","content":"PERSON"},{"type":"Google Chrome","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Los Angeles","content":"LOCATION"},{"type":"MEW","content":"ORGANIZATION"},{"type":"Hemachandra","content":"PERSON"},{"type":"20","content":"DATE"},{"type":"Hemachandra","content":"ORGANIZATION"}],"hashtag":["WALLETS"],"authors":["Yogita Khatri","The Block"]}