{"summary":"The collection was inspired by the 18-year-old artist&#x27;s experiences as a young, transgender artist growing up in an abusive household.  ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/110145\/nft-collection-by-digital-artist-fewocious-rakes-in-over-2-million-at-christies","publishDate":"2021-07-01T09:47:25","id":6573,"type":null,"title":"NFT collection by artist FEWOCiOUS rakes in over $2 million at Christie&#x27;s","category":["NFTS"],"content":["A collection of five non-fungible tokens by digital artist FEWOCiOUS has sold for $2.16 million in a sale hosted by auction house Christie's.&nbsp;","The collection of NFTs, titled \"<a href=\"https:\/\/www.christies.com\/features\/FEWOCiOUS-on-his-life-in-art-11746-3.aspx\" data-v-f87c67ca=\"\">Hello, i'M Victor (FEWOCiOUS) and This Is My Life<\/a>,\" was inspired by the 18-year-old artist's experiences as a young, transgender artist growing up in an abusive household.&nbsp;&nbsp;","NFTs, or non-fungible tokens, are collectibles stored on the blockchain that can represent digital files like images, audio, and video. Each of the 1\/1 NFTs in this collection captures a year in the life of FEWOCiOUS, chronicling his childhood life in Las Vegas to his eventual move to Seattle. Each NFT is also paired with a collection of newly minted doodles, drawings, and journal entries curated from his archives of that year.&nbsp;","FEWOCiOUS (b. 2003), Year 1, Age 14 — It Hurts To Hide, 2021. Image: Christie's","The sale was <a href=\"https:\/\/onlineonly.christies.com\/s\/hello-im-victor-fewocious-my-life\/lots\/2048\" data-v-f87c67ca=\"\">live<\/a> from June 23 to June 30 and received bids from more than 20 collectors. Buyers had the option of paying in ether and bitcoin.","In addition to owning an NFT from the collection, all successful buyers will have the opportunity to meet FEWOCiOUS in person and will also receive the physical painting.&nbsp;","Shortly after the sale closed, FEWOCiOUS <a href=\"https:\/\/twitter.com\/fewocious\/status\/1410322978735263745\" data-v-f87c67ca=\"\">tweeted<\/a>, \"at a loss for words right now. thank you so much to everyone for making me feel so loved, believing in my art and believing in me, it means the world.\"","FEWOCiOUS, otherwise known as Victor Langlois, rocketed to fame earlier this year when his collaboration with musician Two Feet generated over <a href=\"https:\/\/twitter.com\/niftygateway\/status\/1361012336937500674?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1361012336937500674%7Ctwgr%5E%7Ctwcon%5Es1_c10&amp;ref_url=https%3A%2F%2Fwww.theblockcrypto.com%2Fdaily%2F99418%2Ffewocious-crypto-art-nft-teen-artists\" data-v-f87c67ca=\"\">$1 million<\/a> in sales on NFT marketplace NiftyGateway. The artist has also been a part of several well-known NFT collaborations with digital fashion brand <a href=\"https:\/\/rtfkt.com\/\" data-v-f87c67ca=\"\">RTFKT Studios<\/a> and collaborators Odius, Parrot_ism and Jonathan Wolfe — partnerships which have also brought in millions.&nbsp;","FEWOCiOUS said he turned to art as a way to escape the pain of an abusive household. He discovered the NFT space after a person who bought one of his paintings encouraged him to mint his other work. FEWOCiOUS submitted an application to join NFT platform SuperRare. After getting approval, he sold multiple pieces for over <a href=\"https:\/\/fewocious.com\/\" data-v-f87c67ca=\"\">half a million dollars<\/a> in the span of just a few months. He was eventually able to move out of the house he had grown up in.&nbsp;","“I feel healthier and in a way, I feel them not supporting my art at all fueled this fire,\" he <a href=\"https:\/\/www.theblockcrypto.com\/daily\/99418\/fewocious-crypto-art-nft-teen-artists\" data-v-f87c67ca=\"\">told<\/a> The Block in March. “Art saved my life in so many different ways.”","While FEWOCiOUS is known for his signature use of dynamic and vibrant colors as well as the distorted, unrealistic proportions in his artwork, many in the NFT community, particularly younger, emerging artists, have looked to him as a source of inspiration and support in their own careers. FEWOCiOUS has even been known to get involved in art auctions to make sure that his peers don’t miss out on profits.","“He sends positivity around the community and sets a better example for everyone,” said digital artist Pierce&nbsp;(<a href=\"https:\/\/twitter.com\/Blizzy\" data-v-f87c67ca=\"\">@Blizzy<\/a>), a member of a three-person teenage artist collective called RetroCoin (<a href=\"https:\/\/twitter.com\/RETROCOlN\" data-v-f87c67ca=\"\">@RETROCOIN<\/a>). “FEWOCiOUS shows that he is not cordoned off to the VIP area.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2003","content":"DATE"},{"type":"Pierce","content":"PERSON"},{"type":"June 30","content":"DATE"},{"type":"$2.16 million","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"Las Vegas","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Victor Langlois","content":"PERSON"},{"type":"Jonathan Wolfe","content":"PERSON"},{"type":"a million dollars","content":"MONEY"},{"type":"Victor (","content":"PERSON"},{"type":"Christie's","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"Seattle","content":"LOCATION"},{"type":"June 23","content":"DATE"}],"hashtag":[],"authors":["Saniya More","The Block"]}