{"summary":"Emurgo, Cardano’s official arm, said its USDA stablecoin will be pegged to the U.S. dollar and will be introduced early next year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/188276\/cardano-developer-emurgo-to-issue-fiat-pegged-stablecoin-called-usda","publishDate":"2022-11-18T07:12:23","id":6575,"type":null,"title":"Cardano developer Emurgo to issue fiat-pegged stablecoin called USDA","category":["CRYPTO ECOSYSTEMS"],"content":["Cardano developer Emurgo announced plans to issue a U.S. dollar-pegged stablecoin called USDA on the network in early 2023.","Emurgo, which functions as Cardano’s official commercial arm, said USDA will be the first regulated stablecoin on the blockchain that is backed by a fiat currency. The Cardano developer also revealed that USDA will be the first delivery from its Anzens product market line. Anzens is the <a href=\"https:\/\/www.theblock.co\/post\/171694\/cardano-vasil-upgrade-triggers-after-a-3-month-delay\" data-v-f87c67ca=\"\">Cardano developer’s<\/a> financial services product, created to bridge crypto and real-world finance.","Stablecoins have become an integral part of the crypto trading and credit ecosystem. Major Layer 1 networks including Ethereum, BNB Chain and Solana have stablecoins. These stablecoins facilitate activities like trading, borrowing, lending and staking, among others. Such stable currencies offer a means of transferring value between the crypto and broader financial markets. They also help users store value, as crypto tokens tend to have volatile price movements.","Cardano developers have been working to create stable currencies for the network. USDA joins a list of other planned stablecoins, including <a href=\"https:\/\/coinmarketcap.com\/alexandria\/article\/cardano-will-soon-have-a-stablecoin-for-the-very-first-time\" data-v-f87c67ca=\"\">Djed<\/a>, an algorithmic stable currency being developed by Cardano in partnership with the Coti Network.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Cardano","content":"PERSON"},{"type":"Emurgo","content":"ORGANIZATION"},{"type":"USDA","content":"ORGANIZATION"},{"type":"Coti Network","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}