{"summary":"DePINs provide a revenue-generating opportunity analogous to today’s gig economy, according to Solana Foundation DePIN lead Kuleen Nimkar.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/252775\/solana-depin-projects-gig-economy-next-level","publishDate":"2023-09-25T11:35:19","id":6577,"type":null,"title":"Solana DePIN projects aim to take gig economy to next level","category":["INFRASTRUCTURE"],"content":["<span data-v-f87c67ca=\"\">Decentralized Physical Infrastructure Networks (DePINs) are reshaping traditional infrastructure models, providing an opportunity analogous to today's gig economy, according to <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Solana <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/33827\/solana-sol-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/solana.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">SOL<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.59%\n    <\/span><\/a> <!----><\/span><\/span> Foundation DePIN lead Kuleen Nimkar.<\/span>","While many people today earn supplemental income from driving for Uber or delivering for DoorDash, over time people can also generate additional income by contributing hardware to DePIN protocols, Nimkar told The Block in a recent interview.","More powerfully, Nimkar argues, contributors to DePIN networks can generate significant income from supporting a network early on, earning tokens that later appreciate as the network grows. \"That's something that never happened with the web2 gig economy, early Uber drivers didn't see an outsized benefit for supporting Uber before it became a giant,\" he added.","DePIN protocols leverage token incentives, composable with the broader DeFi ecosystem, to help bootstrap hardware networks, offering services like computing power and storage.","<span data-v-f87c67ca=\"\">Nimkar highlighted Solana DePIN projects such as Hivemapper, <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Render <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248420\/render-rndr-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/rndr.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">RNDR<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -2.72%\n    <\/span><\/a> <!----><\/span><\/span> and <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Helium <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248474\/helium-hnt-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/Helium_HNT.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">HNT<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +1.52%\n    <\/span><\/a> <!----><\/span><\/span> as examples — incentivizing contributors to build network growth and reducing upfront investment costs compared to traditional infrastructure models.<\/span>","Hivemapper offers tokens to drivers who install a dashcam and collect mapping data as they drive around. Render allows anyone with excess GPU power to connect their hardware to its protocol and earn by providing computing power for customer use cases such as machine learning training. Decentralized wireless network Helium, which recently debuted a <a href=\"https:\/\/decrypt.co\/152533\/helium-mobile-debuts-crypto-wireless-network-miami-5-month\" data-v-f87c67ca=\"\">5G mobile service<\/a> in Miami at $5 a month, enables distributed node runners to generate revenue by hosting dedicated hotspots from their homes or businesses to provide mobile connectivity to nearby users.","Organizations can pay for DePIN project services with their respective tokens. However, Nimkar suggested this may switch to stablecoins as these new platforms mature, with protocol token utility focusing on governance instead.","While the Solana Foundation occasionally grants or invests in such projects, its focus is on accelerating the ecosystem and giving leverage to the best builders, Nimkar said. \"Whether or not a team received a grant or investment doesn't impact that focus.\"","Nimkar believes Solana is now the \"default choice\" for decentralized physical infrastructure projects due to its low transaction cost, high-throughput speed, scalability and existing DePIN ecosystem.","Helium is a case in point, <a href=\"https:\/\/www.theblock.co\/post\/172107\/helium-foundation-announces-migration-to-solana-following-community-vote\" data-v-f87c67ca=\"\">migrating from its own blockchain to Solana<\/a>, which, along with existing DePIN projects, has \"catalyzed a ton of tooling and infrastructure development for DePIN on Solana that makes it even easier for new DePIN projects to leverage Solana,\" Nimkar said.","Often criticized over perceived centralization and occasional downtime, Nimkar argues Solana has become one of the most decentralized blockchains today by most measures. Nimkar pointed toward the network's approximate 2,000 globally distributed validator nodes and its Nakamoto Coefficient, a measure of network security, outpacing many of its peers.","As an example of Solana's distribution, Nimkar highlighted German data center operator <a href=\"https:\/\/www.theblock.co\/post\/182283\/1000-solana-validators-go-offline-as-hetzner-blocks-server-access\" data-v-f87c67ca=\"\">Hetzner's blocking of Solana<\/a> activity last year, which resulted in 1,000 validators temporarily falling offline, stopping them and their delegators from earning stalking rewards. Because the remaining validators were decentralized across other infrastructure providers, the network operated \"without a hitch,\" Nimkar said, with nearly all the affected validators <a href=\"https:\/\/solana.com\/news\/validator-health-report-march-2023\" data-v-f87c67ca=\"\">back online at different data centers within a few days<\/a>.","Nimkar added that the Solana Foundation was particularly excited about the launch of <a href=\"https:\/\/www.theblock.co\/post\/204495\/jump-crypto-firedancer-project-optimize-solana-hft\" data-v-f87c67ca=\"\">Jump Crypto's validator client, Firedancer<\/a>. Firedancer is an open-source, independent Solana validator client, which can help identify bugs, vulnerabilities or inefficiencies in the original client and provide network redundancy in case issues arise with one client, Nimkar said.","\"Once Firedancer is live, Solana will be the only large Layer 1, aside from Bitcoin and Ethereum, to have multiple independently managed validator clients,\" Nimkar added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Solana <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/33827\/solana-sol-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/solana.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">SOL","content":"ORGANIZATION"},{"type":"Solana Foundation","content":"ORGANIZATION"},{"type":"Nimkar","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Miami","content":"LOCATION"},{"type":"Hetzner","content":"ORGANIZATION"},{"type":"Kuleen Nimkar","content":"PERSON"},{"type":"GPU","content":"ORGANIZATION"},{"type":"Nakamoto Coefficient","content":"PERSON"},{"type":"+1.52%","content":"PERCENT"},{"type":"$5","content":"MONEY"},{"type":"-2.72%","content":"PERCENT"},{"type":"-0.59%","content":"PERCENT"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["DECENTRALIZED INFRASTRUCTURE","SOLANA"],"authors":["James Hunt","The Block"]}