{"summary":"Injective, a layer 1 blockchain, raised $40 million in a round round led by Jump Crypto. BH Digital also participated in the round. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/162096\/layer-1-blockchain-injective-raises-40-million-round-led-by-jump-crypto","publishDate":"2022-08-10T09:05:32","id":6578,"type":null,"title":"Layer 1 blockchain Injective raises $40 million round led by Jump Crypto","category":["WEB3"],"content":["Injective, a DeFi-focused layer 1 blockchain, raised a $40 million round in a private token sale led by Jump Crypto.","Jump will also be acting as a market maker for Injective Pro, one of the ecosystem's decentralized apps (dApps), according to an announcement this morning.&nbsp;","BH Digital, the digital asset division of billionaire hedge fund manager Alan Howard's Brevan Howard, also took part in the round, which closed in July. The valuation was not disclosed.&nbsp;","Through Injective, founder Eric Chen's aim is to create an interoperable blockchain specialized in decentralized finance use cases. Key features of the technology include its on-chain order book and incentives for reductions in gas fees, Chen adds.&nbsp;","The deal also comes at a turbulent time in crypto markets, with the price of bitcoin slumped below $25,000 and startup valuations down across the board. According to The Block research, venture capital deals in the blockchain sector&nbsp;<a href=\"https:\/\/www.theblockresearch.com\/q2-22-blockchain-private-funding-and-ma-recap-157208\" data-v-f87c67ca=\"\">plunged in the second quarter of this year<\/a> from $12.5 billion in Q1 to $9.8 billion.&nbsp;","&nbsp;","","","Despite this, Chen thinks now is the optimal time to raise.&nbsp;","\"We want to go against what the current trend is,\" he says. \"We want to be in the best position possible during a bear market to build and support new incoming developers and capture those opportunities.\"&nbsp;","Injective plans to do this by using the capital is just raised to create incentives for developers to migrate over to its network. Most recently, Aperture, a dApp previously native to Terra, made the leap to Injective.&nbsp;","The capital will also be used to provide liquidity to existing Injective dApps and build out the utility of its native token INJ.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"this morning","content":"TIME"},{"type":"Chen","content":"PERSON"},{"type":"second quarter of this year","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$40 million","content":"MONEY"},{"type":"Eric Chen","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"$9.8 billion","content":"MONEY"},{"type":"Terra","content":"LOCATION"},{"type":"Alan Howard","content":"PERSON"},{"type":"$25,000","content":"MONEY"},{"type":"Brevan Howard","content":"PERSON"},{"type":"$12.5 billion","content":"MONEY"}],"hashtag":[],"authors":["Tom Matsuda","The Block"]}