{"summary":"The digital asset sector in the UK received a boost in the nation&#x27;s &quot;mini-budget&quot; announcement on Wednesday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/264389\/uk-finance-minister-announces-legislation-to-boost-the-nations-digital-asset-sector","publishDate":"2023-11-22T14:34:45","id":6579,"type":null,"title":"UK finance minister announces legislation to boost the nation&#x27;s digital asset sector","category":["POLICY"],"content":["<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The digital asset sector in the UK received a boost in the nation's \"mini-budget\" announcement on Wednesday.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">UK Chancellor of the Exchequer Jeremy Hunt outlined 110 measures for growing the nation's economy in his <a href=\"https:\/\/www.gov.uk\/government\/publications\/autumn-statement-2023\" data-v-f87c67ca=\"\">Autumn Statement<\/a>. This included a governmental initiative to facilitate the expansion of the digital assets sector.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The UK government will pass legislation to implement the Digital Securities Sandbox (DSS), which aims to facilitate the adoption of <a href=\"https:\/\/www.theblock.co\/post\/262021\/digital-assets-were-involved-in-almost-half-of-all-charges-brought-by-the-cftc-in-record-setting-year\" data-v-f87c67ca=\"\">digital assets<\/a> across financial markets. \"The government will lay a statutory instrument to implement the Digital Securities Sandbox, delivering on the Edinburgh Reform announcement to implement a Financial Market Infrastructure Sandbox in 2023,\" the budget statement said.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">It is expected that the DSS initiative will begin in the first quarter of 2024. The <a href=\"https:\/\/www.theblock.co\/post\/261389\/uk-treasurys-crypto-asset-proposals-are-a-step-in-the-right-direction-bittrex-global-ceo-says\" data-v-f87c67ca=\"\">UK government<\/a> also plans to publish its response to a <a href=\"https:\/\/www.gov.uk\/government\/consultations\/consultation-on-the-digital-securities-sandbox\" data-v-f87c67ca=\"\">consultation<\/a> on the DSS that was launched in July.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The DSS is an important development in the evolution of the securities industry, according to Zodia Markets General Counsel Dina White. <\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"We are seeing a continual progression of digitalization across a range of financial instruments, and this represents a critical step in the adoption of new technologies as they are applied to traditional financial assets,\" White told The Block.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The Zodia Markets General Counsel added that the sandbox will allow firms to use digital asset technology to establish and operate critical financial market infrastructure, such as central securities depositories or trading venues.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"It will also allow for a wide range of assets to interact with wider financial market activities, such as being used as collateral, or as part of repo transactions. Given that these will include both 'digitally native’ securities and digital representations of traditional instruments, this represents an exciting time for experimentation in a well-established industry,\" White added.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Copper Head of Public Affairs Eva Gustavsson called the UK finance minister's plan \"a significant commitment.\" She added that controlled environments like that of the DSS that test products and services can produce unique solutions that add to the UK’s reputation as a home for innovation.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"The announcement is an encouraging commitment from the government, and we look forward to learning more about the Digital Securities Sandbox in due course,\" Gustavsson told The Block.<\/span>","The upcoming Digital Securities Sandbox will differ from the already functioning <a href=\"https:\/\/www.fca.org.uk\/news\/news-stories\/launch-permanent-digital-sandbox\" data-v-f87c67ca=\"\">Digital Sandbox<\/a>, which was launched by the UK's <a href=\"https:\/\/www.theblock.co\/post\/240231\/fca-crypto-memes-breach-financial-promotion-rules\" data-v-f87c67ca=\"\">Financial Conduct Authority<\/a> this August.","The FCA's Digital Sandbox aims to support firms in the early stages of digital product development. However, according to a <a href=\"https:\/\/www.youtube.com\/watch?v=l_VGSr7m2bs\" data-v-f87c67ca=\"\">speech<\/a> made by FCA Head of Capital Markets Helen Boyd at the CCData Digital Assets Summit in October, the DSS will have \"a new rule set that would allow it to do new things with digital securities.\"","According to the UK's DSS consultation paper, the initiative will give companies an opportunity \"to set up financial market infrastructures that utilize digital asset technology, which can perform a number of activities in relation to digital securities under a temporarily modified legislative and regulatory framework.\"","The DSS will be enacted via a statutory instrument, which is a type of legislation in the UK that allows an Act of Parliament to be brought into force without Parliament having to pass a new Act.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Digital Securities Sandbox (DSS","content":"ORGANIZATION"},{"type":"the first quarter of 2024","content":"DATE"},{"type":"Jeremy Hunt","content":"PERSON"},{"type":"Helen Boyd","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Zodia Markets General Counsel Dina White","content":"ORGANIZATION"},{"type":"DSS","content":"ORGANIZATION"},{"type":"FCA","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"UK","content":"ORGANIZATION"},{"type":"Digital Securities Sandbox","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"CCData Digital Assets Summit","content":"ORGANIZATION"},{"type":"Eva Gustavsson","content":"PERSON"},{"type":"UK's <a href=\"https:\/\/www.theblock.co\/post\/240231\/fca-crypto-memes-breach-financial-promotion-rules\" data-v-f87c67ca=\"\">Financial Conduct Authority","content":"ORGANIZATION"},{"type":"Parliament","content":"ORGANIZATION"},{"type":"Gustavsson","content":"PERSON"},{"type":"Autumn Statement","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Edinburgh Reform","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":["UK PARLIAMENT"],"authors":["Brian McGleenon","The Block"]}