{"summary":"Binance Labs, along with Arrington XRP Capital, Neo Global Capital, Fenbushi Capital, and several other venture funds, is investing $3.5 million in a","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/36589\/binance-lab-backed-crm-solution-raises-3-5m-to-bring-more-enterprises-onto-blockchains","publishDate":"2019-08-19T10:00:23","id":6581,"type":null,"title":"Binance Lab-backed CRM solution raises $3.5M to bring more enterprises onto blockchains","category":["THE BLOCK"],"content":["<span data-v-f87c67ca=\"\">Binance Labs, along with Arrington XRP Capital, Neo Global Capital, Fenbushi Capital, and several other venture funds, is investing $3.5 million in a blockchain customer relationship management (CRM) startup, hoping to bring enterprise big names onto the Binance Chain and accelerate enterprise blockchain adoption. <br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">A recent graduate of Binance’s incubator program Binance Labs, Cere Network has already attracted several clients, including a trucking business that has 200,000 users and a cosmetics brand. The company’s current CRM solution registers customer data on its proprietary blockchain, although it will soon integrate with the Binance Chain and eventually become blockchain agnostic, according to Cere Network co-founder Kenzi Wang. This means that enterprises adopting Cere Network's solution will be indirectly using Binance's blockchain services in the near future.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We can bring a lot of real-world brands to Binance, so they see it as a long-term play integrating with us and they chose to work with us and incubate us,” said Wang.<\/span>","<span data-v-f87c67ca=\"\">The CRM space Cere Network trying to disrupt is one of the most lucrative and competitive software categories, <\/span><a href=\"https:\/\/www.forbes.com\/sites\/louiscolumbus\/2019\/06\/22\/salesforce-now-has-over-19-of-the-crm-market\/#3279b0f7333a\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">sitting on a $48.2 billion market cap<\/span><\/a><span data-v-f87c67ca=\"\"> in 2018. With Salesforce, Oracle, and Microsoft as its major competitors, Cere Network is trying to leverage its advantage as a blockchain-native firm to quickly deploy this new technology in this software industry.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Salesforce has its own blockchain initiative built on Hyperledger… but their technology is years behind us. The solution is in the past because they are not blockchain experts like us,” said Wang.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Claiming to be “the first decentralized CRM solution,” Cere Network hopes to ride the tailwind of enterprises becoming more interested in the incipient blockchain technology. According to Wang, after Facebook announced its blockchain project, Libra, many companies “are a little bit FOMO [fear of missing out] by blockchain technology.”<\/span>","<span data-v-f87c67ca=\"\">“When Facebook is going all into blockchain it forces the hands for all the other enterprises in America or in the world. I wouldn't be surprised if Twitter is working on something very similar, and Oracle and Microsoft are launching something. It's gonna become a trend,” said Wang.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Indeed, a <\/span><a href=\"https:\/\/www2.deloitte.com\/insights\/us\/en\/topics\/understanding-blockchain-potential\/global-blockchain-survey.html.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">recent Deloitte survey<\/span><\/a><span data-v-f87c67ca=\"\"> showed that 53% of senior executives said blockchain has become a critical priority for their company this year, while 86% believe this new technology will achieve mainstream adoption.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">With the newly raised capital, Cere Network plans to roll out its mainnet soon and strengthen its marketing efforts.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Binance Chain","content":"ORGANIZATION"},{"type":"Binance Labs","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"53%","content":"PERCENT"},{"type":"86%","content":"PERCENT"},{"type":"$3.5 million","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"America","content":"LOCATION"},{"type":"Wang","content":"ORGANIZATION"},{"type":"Cere Network","content":"ORGANIZATION"},{"type":"Fenbushi Capital","content":"ORGANIZATION"},{"type":"Oracle","content":"ORGANIZATION"},{"type":"Arrington XRP Capital","content":"ORGANIZATION"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"$48.2 billion","content":"MONEY"},{"type":"Deloitte","content":"ORGANIZATION"},{"type":"Libra","content":"LOCATION"},{"type":"Kenzi Wang","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":[],"authors":["Celia Wan","The Block"]}