{"summary":"Stepn is the latest crypto project to announce an airdrop as Genesis sneaker holders get set for GMT token reward.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/212831\/gmt-token-airdrop-on-way-for-early-stepn-nft-holders","publishDate":"2023-02-17T08:54:30","id":6589,"type":null,"title":"GMT token airdrop on way for early Stepn NFT holders","category":["METAVERSE & NFT"],"content":["Move-to-earn crypto platform Stepn is set to <a href=\"https:\/\/twitter.com\/Stepnofficial\/status\/1626550531660431360?t=iR9FrxBfBMncbqUbkd5CSA&amp;s=19\" data-v-f87c67ca=\"\">airdrop<\/a> its GMT tokens to holders of its Genesis sneaker NFT collection.","The airdrop is based on a snapshot taken on Feb. 12. A snapshot is a static record of a blockchain at a particular point in time. Snapshots are used for retroactive airdrops to filter eligible users.","In Stepn’s case, the snapshot selected its Genesis sneaker holders. Stepn launched this collection in August 2022. The snapshot criteria also designated holders who had their NFTs in their spending wallets. Users who listed their Genesis sneaker NFTs for sale are not part of the airdrop.","<span data-v-f87c67ca=\"\">GMT token down 7% today. Image: CoinGecko<\/span>","The airdrop will reward <a href=\"https:\/\/www.theblock.co\/post\/180785\/stepn-founders-bright-idea-for-its-new-nft-marketplace-compulsory-royalties\" data-v-f87c67ca=\"\">NFT holders<\/a> with GMT tokens based on the rarity of their sneakers. This will range from 4,000 GMT ($1,800) for uncommon sneakers to 32,000 GMT ($14,400) for NFTs with “epic” rarity. Each NFT represents one airdrop, Stepn said.","Stepn said the airdrop is to reward early supporters who held on to their NFTs through the crypto bear market. Some community members, however, faulted the decision to restrict the airdrop to what they described as a small fraction of the project’s community.","GMT is currently trading at $0.45, down 7% in the last 24-hour trading period.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"$0.45","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$1,800","content":"MONEY"},{"type":"$14,400","content":"MONEY"},{"type":"August 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Feb. 12","content":"DATE"},{"type":"Stepn","content":"PERSON"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}