{"summary":"Months after creating Sango coin as its national crypto, the Central African Republic now wants to make the token a part of its economy.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/203468\/central-african-republic-working-to-integrate-sango-coin-into-its-economy","publishDate":"2023-01-18T14:11:36","id":6593,"type":null,"title":"Central African Republic working to integrate Sango coin into its economy","category":["POLICY"],"content":["The Central African Republic (CAR) has set up a task force to explore modalities for integrating its national crypto, called the Sango coin, into the country’s economy, according to a statement from the government on Tuesday.","CAR’s new crypto committee will work toward drafting a law on the usage of cryptocurrencies in the country. The task force will also submit guidelines for asset tokenization in the country.","The 15 members of the committee were selected from several government ministries including mines and geology, rural development and town planning.","CAR became the first African nation to create a national crypto when it <a href=\"https:\/\/www.theblock.co\/post\/155665\/central-african-republic-launches-national-cryptocurrency-called-sango-coin\" data-v-f87c67ca=\"\">launched Sango coin<\/a> in July last year. The land-locked central African nation also <a href=\"https:\/\/www.theblockcrypto.com\/post\/143738\/central-african-republic-adds-bitcoin-as-legal-currency-afp\" data-v-f87c67ca=\"\">legalized bitcoin in 2022<\/a>, becoming the second country to do so after El Salvador.","Part of the country’s crypto adoption drive involves the <a href=\"https:\/\/www.theblock.co\/post\/150041\/central-african-republic-announces-plan-to-tokenize-countrys-minerals\" data-v-f87c67ca=\"\">tokenization of its minerals<\/a>. CAR is home to vast deposits of oil and gas, diamonds, gold and copper, among other natural resources. Despite this, it ranks as one of the poorest and least-developed nations in the world. CAR President Faustin Archange Touadera has previously said tokenization of the country’s minerals could create new investment opportunities.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tuesday","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Faustin Archange Touadera","content":"PERSON"},{"type":"July last year","content":"DATE"},{"type":"Sango","content":"LOCATION"},{"type":"El Salvador","content":"ORGANIZATION"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}