{"summary":"Crypto Twitter has made a parody of the idea that wrapped ether might be in trouble. Here’s why there’s no need for alarm.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/190296\/wrapped-ether-remains-perfectly-fine-despite-jokes-on-twitter","publishDate":"2022-11-28T11:54:56","id":6596,"type":null,"title":"Wrapped ether remains perfectly fine, despite jokes on Twitter","category":["CRYPTO ECOSYSTEMS"],"content":["It's all fun and games until someone loses...the plot.&nbsp;","What started as a series of jokes among the crypto Twitterati took on a life of its own. But wrapped ether — a token on Ethereum backed by ether — is perfectly fine despite what some had earlier suggested.","The fun started at a time when there was a lot of confusion surrounding wrapped bitcoin, a token that serves a similar purpose but works very differently. So some mischievous crypto Twitter personalities decided to suggest that wrapped ether (WETH) was insolvent and was going to lose — or already had lost — its peg to ether.&nbsp;","&nbsp;","&nbsp;","","","Arcane Assets CIO Eric Wall <a href=\"https:\/\/twitter.com\/ercwl\/status\/1596676776759296002\" data-v-f87c67ca=\"\">tweeted<\/a> WETH is depegging. Yearn core developer Banteg \"revealed\" that <a href=\"https:\/\/twitter.com\/bantg\/status\/1597030780924211200\" data-v-f87c67ca=\"\">WETH<\/a> had been secretly hacked in 2019. Ethereum bull Anthony Sassano tweeted in a since deleted post, “ETH is nuking because WETH is currently insolvent.\"","Wrapped ether has about $1.3 billion of value, so this all sounded pretty dire. The worry even briefly made its way into mainstream news reports from Bloomberg.","","","Sassano returned to Twitter later with a bit of a mea culpa.","“Gotta be clear for the homies since the WETH shitposting took on a life of its own,\" he <a href=\"https:\/\/twitter.com\/sassal0x\/status\/1597065213156941825\" data-v-f87c67ca=\"\">tweeted<\/a>. \"WETH is completely fine and anyone stating otherwise is joking\/being sarcastic (or actually being serious because they don't understand that WETH is fine).”","Part of the reason behind the jokes is that WETH is a relatively simple concept. When someone wants to turn their ether into wrapped ether, they use the smart contract and it locks up their tokens. If they want to redeem wrapped ether, they just unwrap it. During that time period, the ether is locked up securely in a smart contract — which is publicly viewable.","This means a couple of things. First, the underlying ether isn’t being lent out to generate yield — so there’s no risk that there might be hidden liabilities that would result in the protocol going insolvent. Second, the ether sits in a smart contract that’s publicly viewable. This ensures that anyone can check it's fully backed at all times.&nbsp;","While, like anything in crypto, there is some smart contract risk, it’s a very simple piece of code that’s been safely working for quite some time. And, really, that's the heart of the matter: if a protocol is truly decentralized and runs on working code, it is much safer than centralized entities that could mishandle the funds and lose them — making WETH one of the few remaining things crypto Twitter can safely joke about when it comes to insolvency.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Eric Wall","content":"PERSON"},{"type":"Twitterati","content":"PERSON"},{"type":"$1.3 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Anthony Sassano","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":["ETHEREUM"],"authors":["Tim Copeland","The Block"]}