{"summary":"The data site is launching an NFT marketplace aggregator and hopes to suck up some of the market for trading NFTs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/134225\/solana-nft-data-site-solanalysis-rebrands-to-hyperspace-and-raises-4-5-million","publishDate":"2022-02-15T08:00:31","id":6599,"type":null,"title":"Solana NFT data site Solanalysis rebrands to Hyperspace, raises $4.5M","category":["TECHNOLOGY"],"content":["When NFTs started taking off on Solana in August, it was lacking in marketplaces to trade them and had a scarcity of data sites for monitoring price changes. Solanalysis carved out a niche by tracking the top NFT collections on the blockchain platform and making it easy to compare them.","Since then, the data site has added more features, such as the ability for users to track the value of their own NFTs. It has also recently brought out a launchpad for NFT projects to launch new collections.&nbsp;","Now it’s announcing a rebrand, a recent fundraise and an NFT marketplace aggregator designed to let it capture some of the NFT trading market.","Now known as Hyperspace (with a new domain <a href=\"https:\/\/hyperspace.xyz\/\" data-v-f87c67ca=\"\">Hyperspace.xyz<\/a>), the site has announced a $4.5 million seed round led by Dragonfly and Pantera Capital. There was further participation from Jump Capital, Solana Capital, NFX, Galaxy Digital, Shima Capital, Coinbase Ventures, Sfermion, 6th Man Ventures, Soma Capital, Social Capital, and Folius Ventures.&nbsp;","The money was raised a few months ago but the round has only just been announced. Hyperspace is also planning to do another raise in a few months.&nbsp;","Beyond this, Hyperspace is looking to sneak into the NFT trading market with an aggregator. The aggregator will let the website’s users purchase NFTs from any of the major Solana NFT marketplaces. NFTs on offer across all of the marketplaces will be available for browsing in one place.&nbsp;","Hyperspace is achieving this by directly interacting with the smart contracts for each of the NFT marketplaces — a tricky feat since they’re all built slightly differently. But it enables the site’s users to purchase NFTs on any of these marketplaces without having to leave the website.","Hyperspace co-founder Kamil Mafoud says that when it comes to trading NFTs, there’s always a buyer, seller and a site in the middle facilitating that interaction. “We want to be the platform that sits in the middle,” he says.&nbsp;","At present, Hyperspace will not be adding a fee to any of these purchases in order to grow market share without adding any friction, but it may do so in the future.&nbsp;Buyers already need to pay fees to the marketplace facilitating the trade and to the NFT collection or artist if required.","“Right now it’s growth for us. At that point when we have concentrated as many eyeballs then we can think about adding a fee on the aggregation side,” Mafoud says.","The bigger goal for Hyperspace, however, is to take hold of a share of the NFT market. Its aggregator will also be a fully fledged marketplace. As a result, users will also be able to list NFTs for sale on Hyperspace directly, which other Hyperspace users will be able to buy.","The idea is that taking off as an aggregator, could help it to become a popular marketplace in its own right.","One challenge to this plan is that an aggregator is more likely to succeed in an ecosystem where NFT volumes are spread across multiple marketplaces — because users would need to be more careful that they’re checking prices across multiple marketplaces in order to not miss out on a better deal.&nbsp;","Yet on Solana, the NFT market has largely been cornered by Magic Eden, which has sucked up more than 90% of the deal flow. As a result, there might be little demand for an aggregator right now. But Mafoud remains <span data-dobid=\"hdw\" data-v-f87c67ca=\"\">unperturbed<\/span>.","“Very highly concentrated liquidity will reduce the need for it but the level of fragmentation is generally wavering,” Mafoud says. He speculates that Magic Eden might spread to Ethereum and OpenSea — the dominant NFT marketplace on Ethereum —&nbsp;might stretch to Solana. There may even be new entrants, such as Coinbase’s planned NFT marketplace, he says. &nbsp;","“Very much today, much more concentration, in a month, you’re going to see even more fragmentation,” he says.","Among NFT marketplaces, across both Ethereum and Solana, there has been a lot of interest in which platforms will launch tokens. On Ethereum, OpenSea appears to have opted for a different route, while LooksRare is trying to tempt users away from it with its own token. As for Solana, Magic Eden co-founder Zhuoxun Yin recently told The Block the <a href=\"https:\/\/www.theblockcrypto.com\/news+\/133632\/how-magic-eden-became-the-opensea-of-solana\" data-v-f87c67ca=\"\">team is interested<\/a> in the idea of a token but is not rushing to build one straight away.","Hyperspace too, seems open to the idea.","“We very much get excited by being able to tie the power of a token into the platform. It is one of the few moats in Web3,” says Mafoud, adding that it’s very hard to win without one.","He says there are three important things: gaining market share, having a really good user experience and user interface, and having the community invest back into the business. “And that’s probably what we’ll look to do,” he says.","Mafoud says that the team is talking about whether some fees from the marketplace should go toward a DAO that’s managed by its community. And there have been discussions about how that would look and what percentage of each trade would be taken as a fee.&nbsp;","“I don’t know if the best thing to do is to go public as an NFT marketplace. It’s very hard to operate in Web3 under that construct,” he says.&nbsp;","But when it comes to established marketplaces like OpenSea, he can see the opposite strategy might work — that there might be a greater reward and less risk to going public, as opposed to the crypto-style decentralized approach.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Zhuoxun Yin","content":"PERSON"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Solana NFT","content":"ORGANIZATION"},{"type":"Hyperspace","content":"ORGANIZATION"},{"type":"Kamil Mafoud","content":"PERSON"},{"type":"$4.5 million","content":"MONEY"},{"type":"Sfermion","content":"LOCATION"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Soma Capital","content":"ORGANIZATION"},{"type":"Solana Capital","content":"ORGANIZATION"},{"type":"Folius Ventures","content":"ORGANIZATION"},{"type":"Dragonfly","content":"ORGANIZATION"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"Shima Capital","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"August","content":"DATE"},{"type":"Magic Eden","content":"ORGANIZATION"},{"type":"Mafoud","content":"PERSON"}],"hashtag":["SOLANA"],"authors":["Tim Copeland","The Block"]}