{"summary":"Facebook has a blockchain group. And while only 12 people on LinkedIn will identify as being a part of this group, there is simply no way that Facebook","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225\/facebook-blockchain","publishDate":"2018-08-10T16:33:55","id":66,"type":null,"title":"Facebook Blockchain","category":["LAYER 1S"],"content":["Facebook has a blockchain group. And while only 12 people on LinkedIn will identify as being a part of this group, there is simply no way that Facebook would have this much unsupported senior talent on any project. So we can assume that the initiative is already much larger than it was just a few months ago. In fact, non-executives of Facebook Blockchain are rapidly deleting any public affiliation with the project as soon as their participation is pointed out!<br data-v-f87c67ca=\"\">\n\n","Lots of senior talent is part of the Facebook Blockchain team","","You won’t find any information about this secretive group from searching in the Facebook PR Newsroom, but as the LinkedIn image above shows, the group has managed to assemble a star-studded group of VP+ talent, including David Marcus, the former President of PayPal and Kevin Weil, the former SVP Product of Twitter and VP Product of Instagram. David Marcus confirmed the existence of the group in a Facebook post on May 8 with a brief note: “I’m setting up a small group to explore how to best leverage Blockchain across Facebook, starting from scratch.” Since then, the most the company has acknowledged about the group is via classically dry job postings:","We’re looking for such a manager for a newly created software engineering team which will be part of Facebook’s new blockchain group. The group is a startup within Facebook, with a vision to make blockchain technology work at Facebook scale and improve the lives of billions of people around the world.","Executives like Marcus, Weil and their colleagues simply don’t leave posts heading up the 1B+ strong Messenger or the Instagram product in order to twiddle their thumbs. In other words, this tiny gang of executive pirates is clearly up to something big. Very big. So big that it will “improve the lives of billions of people.” But what might that be?","For starters, it is important to note that this group emphatically refers to themselves as a blockchain group, not a cryptocurrency group. And while the company won’t acknowledge any specific products or plans, their prospective partners are talking, including insiders involved with Stellar, the 6th largest cryptocurrency by market cap at $4.2B as of August 10 at 5pm ET. According to those close to Stellar, Facebook is considering using a fork of the Stellar blockchain to enable bank functions in a superior manner, such as rapid money movement across the globe from Facebook users to merchants. However, this same article highlighted a much more likely framework for how Facebook would approach blockchain technology:","A source close to Facebook’s blockchain business said the company was making a long-term bet on blockchain that would most likely resemble its investments in artificial intelligence. Rather than targeting a specific vertical, such as payments, Facebook’s blockchain group would provide a foundation from which the firm will be able to target an array of possible opportunities.","On the same day that this quote dropped, Marcus resigned from the board of Coinbase, the most popular cryptocurrency exchange in the US, with ~ 30 million registered accounts. He had been in the role since December 2017, or less than one year. It is hard to conclude anything other than that Facebook is considering entering lines of business directly competitive with or adjacent to Coinbase.","The best mainstream speculation I have seen recently is a piece today in TechCrunch speculating that Facebook might be working on 3 things: 1) a crypto wallet with a proprietary token that could be used to purchase products discovered via Facebook Ads, 2) utilization of that same token for Facebook-enabled P2P payments plus micro-payments to creators and\/or 3) “Facebook Connect for crypto”, an identity service similar to the recently announced Telegram Passport.","As Josh Constine said about this potential identity platform:","Facebook could use its expertise in operating a popular identity platform to ease login to dApps. While the company has faced plenty of privacy issues and attacks on election integrity, Facebook has a strong record of not being traditionally hacked. It hasn’t suffered a massive user data breach like LinkedIn, Twitter and other social networks. Using an overtly centralized identity system to connect with decentralized apps might be counterintuitive, but Facebook could deliver the UX convenience necessary to unlock a new wave of blockchain utility.","While all of the above are possible, if not likely, I do believe that Facebook’s ambitions are even larger. With more than two billion customers — and more joining every day, Facebook is larger than any country and reaches more people than any other single entity on Earth. In a world with more than 2 billion unbanked people, Facebook’s largest impact, both societally and financially, would be to bank the unbanked. For my money, I believe that Facebook will be the largest “bank” in the world within a decade — and the first truly global bank. Starting from scratch using a blockchain as the underlying platform will help ensure a cost-effective, highly performant system. Utilizing “Facebook Coin” will ensure consistency across geographic regions — and universal recognizability. Taking advantage of Facebook’s strong user design and adoption sensibilities to get users onboard with these new products would be very welcome in an industry that is notorious for poor UX and design (although a design movement is finally underway.)","Facebook Blockchain’s biggest opportunity to change the world for the better is to “bank the unbanked” and accelerate global financial inclusion. And while they likely can and will introduce a proprietary coin as part of their efforts, they should follow the lead of Jack Dorsey’s Square, who now offer Bitcoin through Cash App. Bitcoin has the highest probability of any cryptocurrency today of being a long term store of value, something that is much needed in so many corners of the globe. And if it does achieve this store of value status, it can also act as a global medium of exchange and unit of account. A world with a Facebook Coin and Bitcoin available to billions would liberate many to both store wealth and move money — and to participate in the global economy far more easily.","It is time for Facebook Blockchain to change the world. It is time for them to include those who have been excluded from our global economy. Facebook is perhaps the only single entity on Earth with the reach, product chops and talent to accomplish such a massive undertaking. So, Facebook Blockchain, I look forward to you overtaking Bank of China, HSBC, JP Morgan Chase and all the rest by 2030. It’s time to get banking and economically connecting your customers — on a blockchain!","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$4.2","content":"MONEY"},{"type":"HSBC","content":"ORGANIZATION"},{"type":"Marcus","content":"PERSON"},{"type":"Facebook Blockchain","content":"PERSON"},{"type":"Kevin Weil","content":"PERSON"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"December 2017","content":"DATE"},{"type":"Josh Constine","content":"PERSON"},{"type":"2 billion","content":"MONEY"},{"type":"VP Product of Instagram","content":"ORGANIZATION"},{"type":"David Marcus","content":"PERSON"},{"type":"Bitcoin through Cash App","content":"ORGANIZATION"},{"type":"Weil","content":"PERSON"},{"type":"2030","content":"DATE"},{"type":"JP Morgan Chase","content":"ORGANIZATION"},{"type":"Earth","content":"LOCATION"},{"type":"SVP","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Facebook","content":"LOCATION"},{"type":"Bank of China","content":"ORGANIZATION"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"August 10","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"May 8","content":"DATE"}],"hashtag":[],"authors":["Mike Dudas","The Block"]}