{"summary":"Crypto exchange OKEx is adding support for Bitcoin’s Lightning Network in the coming weeks.\nThe move is aimed at enabling cheaper and faster bitcoin transactions for users.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/93364\/okex-bitcoin-lightning-network-support-plan","publishDate":"2021-02-02T05:05:22","id":66,"type":null,"title":"Crypto exchange OKEx to add support for Bitcoin&#x27;s Lightning Network","category":["Bitcoin"],"content":["Cryptocurrency exchange OKEx is adding support for Bitcoin's Lightning Network in the coming weeks.","Revealing the news exclusively to The Block on Tuesday, OKEx said the move is aimed at enabling cheaper and faster transactions for users.","Specifically, bitcoin deposits and withdrawals will get cheaper, said the exchange.","The <a href=\"https:\/\/ycharts.com\/indicators\/bitcoin_average_transaction_fee\" data-v-f87c67ca=\"\">current average cost<\/a> of one bitcoin transaction is about $11, and its average confirmation time is between 10-30 minutes. \"This is impractical as more users join the network,\" OKEx CEO Jay Hao told The Block.","With Bitcoin's <a href=\"https:\/\/www.theblockresearch.com\/the-growth-of-the-lightning-network-has-been-remarkable-but-theres-a-catch-7315\" data-v-f87c67ca=\"\">Lightning Network<\/a>, a Layer-2 scaling solution, the average cost will come down to \"less than 0.01 cents,\" and the average confirmation time will reduce to \"1-3 seconds,\" said Hao.","That would be a huge benefit, but there are certain limitations of the Lightning Network. It is mainly meant for micro-transactions.","In other words, there is a cap on bitcoin withdrawals. \"For now, we are setting the limit at 0.000001 BTC to 0.05 BTC [$0.035 to $1,770],\" Hao told The Block.","For deposits, OKEx doesn't control the limit, \"but when you withdraw on another Lightning Network node to that deposit, that node will have similar limits,\" said Hao.","OKEx has partnered with Lightning Labs for the integration, meaning the exchange will become one of the nodes on the Lightning Network.","The network is made up of nodes to send and receive bitcoin from each other. These nodes open payment channels between them to increase the liquidity of the network. There are currently more than 8,600 nodes with payment channels, according to <a href=\"https:\/\/bitcoinvisuals.com\/lightning\" data-v-f87c67ca=\"\">data<\/a> from Bitcoin Visuals.","There is no specific date by when OKEx's integration with the network will be live, but Hao said it should be completed by March.","A number of crypto exchanges have announced support for the Lightning Network in recent weeks, including <a href=\"https:\/\/www.theblockcrypto.com\/linked\/92129\/okcoin-bitcoin-lightning-network\" data-v-f87c67ca=\"\">OKCoin<\/a> and <a href=\"https:\/\/www.theblockcrypto.com\/linked\/88027\/kraken-lightning-network-bitcoin-integration\" data-v-f87c67ca=\"\">Kraken<\/a>. Bitfinex, Bitstamp, and a few other exchanges already support the feature.&nbsp;"],"hashtag":["BITCOIN"]}