{"summary":"Episode 28 of The Scoop was recorded on Skype with Frank Chaparro, Larry Cermak, and Paolo Ardoino, CTO of Bitfinex and Tether. Listen below, and","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/46788\/paolo-ardoino-cto-of-bitfinex-tether-discusses-bitfinexs-failures-in-transparency-accusations-of-bitcoin-price-manipulation-and-bitfinexs-future-plans","publishDate":"2019-11-12T16:15:12","id":6601,"type":null,"title":"Paolo Ardoino, CTO of Bitfinex &amp; Tether discusses Bitfinex&#x27;s failures in transparency, accusations of Bitcoin price manipulation, and Bitfinex&#x27;s future plans","category":["PODCASTS"],"content":["<em data-v-f87c67ca=\"\">Episode 28 of The Scoop was recorded on Skype with Frank Chaparro, Larry Cermak, and Paolo Ardoino, CTO of Bitfinex and Tether.&nbsp;Listen below, and subscribe to The Scoop on <a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Apple<\/a>,&nbsp;<a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Spotify<\/a>,&nbsp;<a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Google Play<\/a>,&nbsp;<a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Stitcher<\/a>, or wherever you listen to podcasts. Email feedback and revision requests to&nbsp;<a href=\"\/cdn-cgi\/l\/email-protection#a3d3ccc7c0c2d0d7e3d7cbc6c1cfccc0c8c0d1dad3d7cc8dc0ccce\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"afdfc0cbcccedcdbefdbc7cacdc3c0ccc4ccddd6dfdbc081ccc0c2\">[email&nbsp;protected]<\/span><\/a>.<\/em>","<iframe src=\"https:\/\/playlist.megaphone.fm?e=BLOCK7240809786\" width=\"100%\" height=\"200\" frameborder=\"0\" scrolling=\"no\" data-mce-fragment=\"1\" data-v-f87c67ca=\"\"><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><\/iframe>","In this episode of The Scoop, Paolo discusses several topics with Chaparro and Larry, including:","&nbsp;","The transcript is provided for your convenience, please excuse any errors or typos resulting from the transcription process:","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Ladies and gentlemen, thank you so much for tuning into what is a very special episode of the Scoop. We have, joining us, the Chief Technology Officer of Bitfinex and Tether Paolo. Thank you so much for joining us on the show today. We have a lot to talk about - you guys have been in the news a lot this past week. Paolo Ardoino. Am I saying that right? Did we get that? How would we how do we say--what's the correct pronunciation?","<strong data-v-f87c67ca=\"\">Paolo Ardoino <\/strong>It's Ardoino Yeah. Yeah.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>(speaking italian) on joining us. Well, I think the best place to start is a lot of us know you from crypto Twitter. You know, an ardent defender of your company, even when there are bad headlines, negative headlines. Walk us through your role, though, because you're not, you know, the \"Chief Twitter Officer.\" You are, you know, behind a lot of the technology, a lot of the business decisions, but you're also the face of the company. What else falls under your your your helm?","<strong data-v-f87c67ca=\"\">Paolo Ardoino <\/strong>So, if I may start with a brief history of my relationship with Bob Bitfinex and Tether: so I came in to Bitfinex in 2015, so there was two issues with the mentioned engine making time. No doubt quality of the changes was still a demand on my opinion. So I had experience in parallel computing, distributed networks and scalability. So basically I met John Carload, a senior to CFO. We liked each other, of course. We're Italians, so it's kind of easy.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>That's the only reason why he came on the podcast","<strong data-v-f87c67ca=\"\">Paolo Ardoino <\/strong>Basically, yes, yes. Yes. So, the idea is that he asked me to improve the matching engine that was quite, well during the peak times, was lacking. And then I had to start working with a field porter and so on. And, you know, things start to become really interesting for me. And after a while that I was working there, the dimension engine was able to do 1000 times the decline, the number or the second that was doing when I came onboard. So basically, until that happens, it 2016. I was the guy behind the mission engine at the new WebSocket APIs. If you think back to late 2015, Bitfinex had only--it was refreshing the books and most of the changes was refreshing the book, a way of professional books only every 30 seconds by rest APIs. Now, so in 2016 I took your specs off X and basically matching engine web sockets, all the V2 API that you see I had been developed by me. So far I'm being still the main maintainer of all the core infrastructure in Bitfinex, when it comes to development, so developing the core tools, the course mic services, the match, matching engine, almost the entire derivatives platform that we that we are offering has been developed mainly by me, with the help of testers and of course risk management. But when it comes to code, I prefer to take on really risky tasks myself. And yeah, I mean, lately I'm being more involved on Twitter because I believe that unfortunately, it seems like if if you are a shy person or a shy company and you don't say many things publicly, then it means that you have something to hide. So I was physically I decided to enter in the battlefield on Twitter and am trying to defend the good work that both companies I worked for.","<strong data-v-f87c67ca=\"\">Frank Chaparro<\/strong> Great, Larry is kicking me virtually from thousands of miles away in Germany. Docs, Larry Cermak, our Director of Research, who's been following Bitfinex for most of his cryptocurrency career, is also on the line to help guide this conversation with Paolo. I guess my second question has to do exactly with what you just alluded to: Bitfinex is sort of--the role or the way folks view the company in this space, right, over the past few years, you know, whether it's the skeptics coming after you, or research tying you guys manipulation or popular Twitter accounts like Bitfinex casting this sort of shadow of shadiness or adding to what might be considered by some a questionable reputation. How how does this impact the firm and how do you navigate it? How do you navigate this notion that, as you said, there might be something wrong in the state of Denmark?","<strong data-v-f87c67ca=\"\">Paolo Ardoino <\/strong>So, I think that one interesting fact, if I can start with that, is that you would imagine that when days there are these troubles, I'm told, about the New York attorney general class action or, you know, when you share with your teams that we have a problem with crypto capital--about eight hundred eighty million dollars. You can imagine that people start -- your teammates start to be worried and start maybe screaming and so on because I mean, it's legitimate, right? But no one left really. No, we don't have anyone in the personnel that ever left the company and that is about company culture. So really more than what is being said on the outside, I care that my team is happy and everyone in the company understands that whatever is being said is just a door stroll central. So I mean, maybe I'm naive in my approach, but so far It worked. I've been spending a lot of time on the internal company culture and growing that. I mean, we are an army of basically sparked on scene in the sport compared to the size of the other teams. So of course, then, you know, it's not easy to navigate on a daily basis where you get to keep continuously adding up the good things that you do, all the good work that you did in the past as well. It's diminished. But, so you can see that a lot of people are appreciating our new approach to transparency, to visibility, to be more public. And that's also really good to see. We discussed with, you know, after the hockey doesn't 16, we have we had quite a few shareholders that converted to BFX tokenized and equity. So we had future few shoulders that suggested that that pushed us to become better in in in PR and marketing. So far, and keep in mind that we didn't have any marketing team and PR team until, basically, til this August, August 2019, because we were so focused in the coding all day long. I mean, we are in a tech first company and we didn't have any technical debt. Now we just hired the first two PR experts and the first two marketing experts. And you can see the change in the last month and a half where we started to publish more things. Also, we had we were able to accelerate on the number of projects that we were able to deliver, thanks to thanks to our thanks to the fact that our hands became more free after we did very successfully the futures product. So we spent honestly most of 2019 trying to figure out how to react to all these things that were said to us, and now I think that we are demonstrating a bit more, let's say, less naivety and more strength in the public face.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Out of all the criticisms that have been waged against the firm, whether it's the New York attorney general or some other questions of the skeptic, et cetera, what would you say is the most legitimate, or the one that internally has forced you guys to change direction or act differently?","<strong data-v-f87c67ca=\"\">Paolo Ardoino <\/strong>So, of course, having the crypto capital problem, it was not really nice, of course, that led us to the decision of issuing Leo. We didn't have any interest in the issuing LEO, because the company was so profitable that, you know, we even had and we didn't need any money. So in the company, no one takes a first class flight. Even if these 12 hours are all cheap guys, we eat on like fancy stuff. So you can see how a company like ours would not raise money if not necessary. So we basically at that time was kind of and we were forced to issue LEO. Someone says, well, LEO was in the plants since a while. But that is not that is not true. We just basically decided to issue that company token. And we got support by a lot of people that believed, in our roadmap, you know, white paper and eventually in 10 days. And we raised one billion dollars. And, you know, we at some point, yes, it was locked in my face because I say, well, look, this is not real you know, I'm dreaming. And I think it's crazy. I mean, but I mean, there are different reasons why that happen, I believe is that different companies and individuals in our space that really care about our industry and know our scenes, basically 2013, 2014 knew that. We know that we are good guys. And they basically they know that what is happening to us is also the way it has been presented publicly. Here was a way to take us basically down and create more craziness.","<strong data-v-f87c67ca=\"\">Larry Cermak <\/strong>There are some companies in this space that struggle to race way smaller sums. Some saw some club was having issues this year, raising way less than you guys raised. You know, you guys came in and raised one or one billion dollars in less than two weeks. So could you tell us a little bit more about the investor profile of the people that decided to invest? And what do you think led them to commit that much capital that quickly?","<strong data-v-f87c67ca=\"\">Paolo Ardoino <\/strong>So the number of investors that invest you know that Leo was a private sale. So we had this concept of starting with a product sale. Now, of course, the goal is selling first to find new friends and then basically go on a public sale. We were able to accomplish everything as a private sale. So, Leo. So we have a really big variety of investors. We I think the number two, the number of investor equals less than 100 and divide from different sizes from one billion dollars to 100 million dollars. I mean, it's a single it's a single more than 100 million dollar single person.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Damn, who's that guy? And that's a good friend.","<strong data-v-f87c67ca=\"\">Paolo Ardoino <\/strong>Yeah. Yeah. I can tell you that we I mean, there are different and different people that really care about us. And I mean, it is so it's so good because you see that people want to redeem it. We need to be leading that way. You know, our success long term. And, you know, no one would bet that kind of money on and on when a company that is deemed to fail. So if someone really paid or have that kind of money. I think that is a good sign. &nbsp;","<strong data-v-f87c67ca=\"\">Frank Chaparro<\/strong> Larry and I would both agree. Right. But are a number of strikes to the company. Traders, for the most part are not abandoning tether, despite all the headlines. They find it as they find it as useful on ramp to the crypto currency market, helping them with their trading. And you know, the folks we talked to about the Bitfinex's liquidity speak fairly highly of the platform, especially the most professional and high speed trading groups there. They're still working with you guys. But at the same time, the transparency problem has hung over the company to a degree. Do you think the transparency issue you guys had was your own sort of doing.","<strong data-v-f87c67ca=\"\">Paolo Ardoino <\/strong>OK, I think that, well, you make a good point in the sense that while it touches what I was saying before, that of course we haven't been. I mean, someone can call it nontransparent find. But I mean, I can call it basically focusing on he's on our own work and not sharing information, being private companies. We didn't feel the need. You know, again, in a nice way to say more information that more information that what we were obliged to that I'm not sure it will be, you know, that he's better than me. Also, again, we didn't we didn't have any PR marketing teams whatsoever, not an audience of companies right now. What we decided to do is to go fully transparent and say, okay, fine. People want transparency. Let's change trying to change the game. We did it with LEO. We could easily show all the daily revenues. So it's really good. We show that we are making a ton of money. When it is a bad day and the volume is low is that we show that the earnings are lower and we are planning to also keep with even more updates on the tether side. We are keeping working with different firms to that that are high level first who provide more information about transparency. We ask sources to confirm that our tech balance, the balance on our bank accounts to downtick. And so, yeah, there are so many so many things that we are doing. There are a lot of things that we should be doing more. And I'm not excusing him that we will be doing them as well. Of course, you wish you can publish everything at the same time. Can I talk about. If I can tell you something that to to do, to make an example, your case example that feel to me to this, it's a lack of them being published diminished, our&nbsp; perception into the public opinion is that people think that our KYC AML program. It's not up to date or is not good as it should be. But the reality of things is that our CCO Peter work is has been working for many years and is super knowledgeable team and COO go to law enforcement meetings. They teach to law enforcement. We got praised by law enforcement about the fact that our KYC AML program is more thorough than what a bank? Well, also, we went to the first platform to see that servicing the US customer that led to problems. So we decided to move away from us before than anyone else. So I think that we had some sort of vision of where this space is going. And we are trying to keep up and do our best. Of course, sometimes there are mistakes.","<strong data-v-f87c67ca=\"\">Larry Cermak <\/strong>You mentioned this previously a little bit, but Bitfinex is a really lean company. You guys have about 110 or 120 employees. While some larger Asian exchanges have more than 10000. And, you know, you also mentioned that you have quite you know, your expenses are fairly low for a company this size and a company that generates this much profit. Could you maybe speak about, you know, if this is a long term plan as well to stay lean? Or do you or do you do you plan to expand to a lot more employees in the future?","<strong data-v-f87c67ca=\"\">Paolo Ardoino <\/strong>So, I mean, we come from. So I think that be lean for a company should be always focused. You should never I mean, at least making an ever hire more people and that what you really need. As long as you have redundancy in that in their roles, that's a good thing. Bitfinex never hires union developers or meeting about us. We only ask senior developers because we believe that we I personally don't believe in micromanagement. The reason why indicate more than 90 percent of my time in development and coding is that everyone is really great. You, my team, and not for any other teams. So if I had to spend most of my time in not making sure that projects are done in a timely fashion, it would be it would make me really annoyed and I would not work with the same enthusiasm. So. And that applies to all the other teams. Customer support is quite small. It's like 30 people. Compliance is 30 as well. The development team is 30. So our legal team is five or six. So everything and the marketing sport. So we are definitely just one third had headcount spray.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>It's funny shifting to current events and and shifting to what I know you're really proud of as a member of the executive team is Bitfinex's UI and UX&nbsp; and you tweeted today in reference to The Wall Street Journal's article about that research report tying tether to the manipulation of Bitcoin. The first thing that popped out to you was how sexy the UX is, which I thought was funny. But of course, you also know what a pile of nonsense to the extent that you can, because I know, Paolo, I understand that it is tied This this report to a court proceeding just generally at a high level in your see. What are your thoughts on this report? It's come up again. It's updated. Larry has noted some fundamental flaws in it. A lot of people in this case have noted some fundamental flaws in it. But generally, what are you what do you think?","<strong data-v-f87c67ca=\"\">Paolo Ardoino <\/strong>So I appreciate the question. I think that we are still reviewing all the details. With the legal team. I I personally think that these displays kind of easy. We are still the easiest&nbsp; target. We are the biggest and most successful especially when it comes to tether company. So it's easy to be a target for money grabbing or for to get to get fame. I mean, no, no, no. I just I work with a lot of academics in my life. I started out in them in our search team. Mostly and Italy. I I I had to really higher respect of academics and I can I don't know the person that wrote this paper. And I just think that I didn't like the approach that he took. I think back to before writing these fraud allegations, he should have double checked or seek more consensus or more data because it was easy for a lot of people to find flaws with it. So it's not just us said we say, well, that our biased is to say, OK, these guys are not did not their job. Correct. So, I mean, we'll see. And I think that we don't have anything to hide. And the change of target, I don't know what to think about it, even if from one side it could seem backwards for us. The change of target figure. We don't have, as you can imagine, that I mean, that we don't have anything to hide and we don't have anything to how our users are all controlled. We would never have elected a user to exploit our platform to ask for any nasty behavior. So I believe that we are now in our approach will not change in any way. We will fight until we showed that there was no wrongdoing by us or our users or dogs of our users that.","<strong data-v-f87c67ca=\"\">Larry Cermak <\/strong>Yeah. So let's switch to a little bit more of a technical side, since, you know, I know that's that's your area of expertise. So there are now some exchanges, I saw Kraken talking about it a little bit, you know, they're saying that they might support the network for deposits or withdrawals on their exchange. Some. I'm wondering, you know, what's what's Bitfinex thinking about supporting LN on their exchange for customers and what would potentially be some of the downsides? And how hard this would be technically to implement?","<strong data-v-f87c67ca=\"\">Paolo Ardoino <\/strong>Sure. So, yes, yes. As a we we were one of the first exchanges to support or that the first top tier exchanged support deposits withdrawls always come bech32 segwit addresses. And I think that it was a big win for us. This shows our commitment to this space. And one of the most notable things is that you create beautiful products and then you publish an on Twitter and you get like an average engagement as soon as we publish anything that is related to Bitcoin, Segway. Everyone gets the crazy and we got a lot of interest because I do. I understand it is also more exciting for me to keep it to keep working on the end goal of some of the well, I think it's Bitfinex industry to basically push new features to that makes our main blockchain more scalable. Right. So to two attention to you. If I have to talk about the like network, I'm really, really a big fan of the like network. I believe that it is exactly how and second layer peer to peer payment I made from a payment mechanism should be designed and should work, of course, is really. I mean, is it still new that people complain that is still new quite some time now? But you know, there's some good things and complex things take time and you want to have to do to make sure that the security around 80s is manageable and its done in the right way. We are working and we are funding as Bitfinex a project this RGB that aims to bring assets so Tether and other possible assets on lightning network. And that is one of the most interesting, cool things that that we could be involved in because that that will allow micro payments in tether in a fully peer to peer fashion. So Bitfinex, of course, these interests continue to work to act like a network deposit and withdrawal. I've seen a short time before possibly the competition.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>So adding lighting deposits and withdrawals. That's part of the tech roadmap. Despite the success of te, it's so sticky traders, despite the surging competition over the past two years, they're still using tether Bitfinex. On the other hand, as we've we've talked about this before, the market share is a little bit more modest, has dipped from around 25 percent now around 8. You've talked to us before that. You've seen this story before, you've seen this play out. You've gone from 7 or so percent back up to 25. I'm assuming lightning, whether it's withdrawals, deposits or adding and contributing to that ecosystem, is part of the plan. But just walk us through the broader product roadmap or the broader tech roadmap and how it plays into recapturing the market share you had going into 2020.","<strong data-v-f87c67ca=\"\">Paolo Ardoino <\/strong>Yes. Thank you for the question. So that is really my specialty because basically I'm leading the team, the team that basically develops old to new features and a road map. So go in the road map and we can reference also to our white paper. We talk about different things, right? Well, the first one has been deployed and is derivatives and futures. We. We got to use a different company called iFinex Technologies Limited. And that that was done. That was a big project. It each require a few months of full-time development. We've basically seen anything else in the world from me and a few other people in the team that now are the product and the machine engineers ready for that perpetual swap said. What we would deliver. We are working on an now legal compliant basket futures and well, basket perpetual swaps also standard features with standard library compliant options. I think that everything will be sealed tether based. I see that some other competitor is now rolling out tighter based perpetual swaps and futures market. That is a really big weakness for us because it gives more trust, more and more spread to tether, even farther. And these are. So our goal is to launch options in Q1 2020. We are working. We want external market makers to ensure that there will be good liquidity then. You know, one thing that I read like in our space is the concept of a circular economy. So we will be working with a big and well-known partner that provides gift cards. And I said, why gift cards&nbsp; to create cryptocurrencies to integrate them in Bitfinex, to create the proper appropriate a system where people can use their crypto currencies in order to buy things from. From i don't know Amazon or out of place because, you know, it's important that people can see the father and value of having and having crypto currencies right in and just trading back and forth between Bitcoin and USD or whatever. So yeah, I think that that will be that will show our commitment or time and will show that we are seeking to diversify our business lines and product lines. Another really important thing on the Bitfinex side it was mentioned in the white paper is our interest in opening to prediction markets. The white paper was named as backed-finex. We are probably now trying to narrow down the scope of the project, but to make it sooner rather than later, we were thinking late 2020 will be much faster. Our approach to this and I think that we will open up to really interesting and crazy possibility for us still. We want to make sure that it's not a will. We don't like gambling, so it will be just a pure and legal compliant creature market system. We showed our capabilities with our 60 system. That was the change we took in system that we use in the past to predict or act to have a price prediction mechanism for a certain chain block bitcoin related blockchain events like the bitcoin, bitcoin gold hard fork and things like that. So we will use similar mechanism and we will of course leave only to use to verify customers. We don't what we want to make sure that everyone is protected well. Then, on the tether side, we are working hard to deliver. I think one of the most interesting and beautiful products that is next. Tether gold. Tether gold is same as Tether USDT but gold backed.","<strong data-v-f87c67ca=\"\">Frank Chaparro<\/strong> Interesting. So you guys are I mean, this is this is really interesting stuff, whether it's option. The perpetual swaps platform, a gift card prediction market. All New Frontier for Bitfinex, but each is competitive in its own respect, each. Each of those markets has a number of different participants working in those respective spaces. We obviously can't talk about all of them on this episode. But if we were to just focus on the perpetual swap platform, which is already up and running. When you look at the competition, you have bit, bit Mex. Right. The major giant that kind of really pioneered that financial product and there are several others. Kraken is another example. Binance has launched their own derivatives platform. How do you how do you stand out in such a crowded market? What can you do with that product that makes it differentiated from others and will draw people to your to your venue?","<strong data-v-f87c67ca=\"\">Paolo Ardoino <\/strong>Sure. And first of all, I think that I'd say something to Twitter about it. We are. Our approach is more difficult than our competition. So in order to trade futures on Bitfinex, you have to be verified. And we are excluding, of course, also certain jurisdictions like Canada and few others, because we believe that we want to be really protective of our users. We want also to be prepared when it is clear that regulators are looking at this case more thoroughly. So it's easier and better to have to have started the product in 2019. And it's if verified, only product rather than at anyone can join product. I, of course, support our decision or any number five users. I like the fact that there is freedom of between our users, but I can. I need to also be aware that there is more regulation, pressure and offering a fully verified product is the right choice. There is no other way around in my opinion either. In two years, stir the regulation will be even more complete. So it is. It is if you are going to out and seeking a license for or whatever in for other products that you want to add to your line. If you showed that as soon as you launched a new product, you took the right steps. It is easier to be introduced and talk to our great. So that is our approach. I think it makes things harder for us. And of course, the volume of is not as nice as it would be on the on the perpetual swap spot. It will grow over time. More market makers are now all working two out there. The support of our futures and perpetual swaps offering very happy eyes. So, yeah, I mean, we are not in a rush. We are have plenty of other products in the meantime to launch. And this whole ecosystem will drive users from and interest from one product to another.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Interesting. Going back to the main exchange venue, right. What is often known for is its liquidity. And I think what's missed sometimes is the difference between liquidity and volume. Not necessarily the same thing. I speak to speak to why Bitfinex has been able to achieve this level of liquidity. How do you maintain that?","<strong data-v-f87c67ca=\"\">Paolo Ardoino <\/strong>So I think that we've been having started so. So back in time, we have a lot of aficionados to Bitfinex. I mean, everyone loves the slickness of our interface, our APIs. They are. If you are nearby, have a server nearby to our data centers is basically is crazy fast. We offer and there is nice treats that probate that you can send thousands of orders per second hand to head. Eric, right. From the server within one second for all the thousand orders. Right. So that is one of the things that excites users. And they don't a day for a day on a mission, they don't find it anywhere else. So we take proud of this. And also our marching system, our peer to peer marches system allow real and just shows the real interest. Step two steps had also to be on our problem. So from one side, I have to have lenders and on the other side you have people that are short and wronging certain peers. So this is why you there. There are more competitors now on the lending side. I think that the peer to peer lending is the way to go because it shows really the real interest or your appetite for the users to lend their rates in the market. So I think that that also gives to our users a better understanding and age of how where the market might go or not. Also, as this goes to lead along the lines of what is safe for LEO, big traders are wanting to stay. Stick with us. They trust us. Whatever happens, they trusted us in the past. Still trust us. And they saw our recovery. And now clients after the 2016 hack and after the after LEO. So, I mean, there's no other exchange that has this history of resilience or this history of being able to manage really difficult situations. So I I can see why traders formed to say, stick with us. Of course. Also, I want to note that I mean, I like, one thing that I really like about our volume is that when the market is is slow, we do really low volumes. But as soon as there is a price spike, basically we will indeed get or to the gap in movement between the caution proportional gap movement of our volume is higher than almost any exchange that I think Larry mentioned in the making. Because I mean, I can see why me, if I might, in a margin position and I can see why if the market doesn't move, I don't I don't care to take much. Also, I believe that it's important our fees are really protective against wash trading and things like that. I believe that having one basis point fee is really dangerous for the. I prefer I come from a school, maybe traditional, naive, or whatever, and where you need to have some sort of friction in the markets in order to ensure that there is no interest to manipulate or create additional volume. So I think that and if I like the fact that the market, the volumes are calm when the market is down and then spikes when the market spikes and is, I should be in a normal world.","<strong data-v-f87c67ca=\"\">Larry Cermak <\/strong>Yeah. One more question. You briefly mentioned that they're gold as the new product. So you know that this is a completely new Tether product. Would you want to share a little bit more about that? You know, there are already some competitors in this area. And, you know, any details would be interesting. Where does where does the plan to store the digital physical gold?","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>And also any kind of details you'd like want to use it like what is the use case for having digital gold","<strong data-v-f87c67ca=\"\">Paolo Ardoino <\/strong>Good question. I think that we encounter excitement and skepticism. I know that there are competitors out there first of all They are not better. So I believe that we can do much. Even if we are late, our product will be willl have more an option just because people trust us already. With kind of some money and that will happen. Also, tether gold. I think that what excites me is to seed or give the ability of letting people to to use tether gold and having a sort of comparison between physical gold and digital gold that is bitcoin. So, you know, we we are we are going down that path. I think that is really exciting. I cannot tell if it will be a huge success as TetherUSDT or not. What I can tell you is that we got a lot of requests and excitement even eat there or even after our competition was out there. So we always listen to to the people that we work with our customers, and we decided to do it. Of course, we'll be fully gold backed. We are working the system to be sure that every single you know, every single tether gold is linked to a specific gold bar. There are a lot of legal things to to do to take care about. But I believe that it's it can be one of the things that that brings more and more interest in our space also from traditional finance.","<strong data-v-f87c67ca=\"\">Larry Cermak <\/strong>And there are currently more better about variations right there. There is also euro CNY, and they haven't been getting as much traction as the USD pair. So could you maybe speak a little bit about why you think that is?","<strong data-v-f87c67ca=\"\">Paolo Ardoino <\/strong>Yeah, I think that I mean, we didn't really push any of these and we let the market decide so that if you think that Tether was trading two 2013 it took three, three years to get some traction. I think that the tighter CNY sorry CNH is quite new. And we got we did it just for where us from our customers to to do it because they want to have actually a way to etch themselves from from the FX risk if depending on. So there are maybe hedge funds and so on and they may want to have a different way to hedge themselves rather than just U.SDT. So it's basically a another way or another product that if it doesn't, it doesn't get any traction, fine. We think we will leave it like that. But I'm sure that with time, it will get traction. I mean, if you think about the fact that we have tether euro and CNH seeing each now we have the 3 most liquid and the biggest currencies and on boarded on tether And that covers most of the needs from now on from our users.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>I think it might be worthwhile to go back to. The company has really deep roots with early Bitcoin investors. You mentioned this, the strong relationship you have. And this sense of trust that they have. But there are obviously questions that they also likely have. And I was just curious about how you guys might be addressing them specifically something like. With Crypto capital. Does it matter at this point if that money if you if you get that money back. And do you expect to get it back? And broadly to the first part of the question. Do your clients care that much about what's going on there?","<strong data-v-f87c67ca=\"\">Paolo Ardoino <\/strong>Yeah, I mean, I think that one of the reasons why we were able to raise that kind of money short term is also because deep our users trusted us and trust our abilities to recover their done and defiance from come from crypto capital. So I think that we are in a really good. First of all, with crypto capital, we were danger and party. So we were the one that we are on the defense here and what when it comes to recover the funds, we are sure and we're working on it and we are confident that we can make our case in the different courts, in the different jurisdictions. And I think that when people know that we are not the time kind of guy, that we basically that wait on the sidelines. That's for something to happen. We we just we will keep fighting. hammering this matter till we get all of it or a good part of it back. And that's also why we see that he doesn't. And even if there are not amazing news, maybe Leo holds its price because people believe in the long term, I think is as you said, is fair. I know he was explicitly designed for to not have to not risk any crazy price fluctuation. Of course it went to at some point, but it was fairly new. I mean, I think that people that invested in LEO are investing for long term and they believe that you are able to recover a good chunk of it. So and we will never let it go. I mean, everyone would wait to years, even if it meant make it even if you had to recover. I don't know, 850 million dollars being from Genoa. That is that one of the Italian places where people are more attached to money. I would wait until the eternity for that kind of money. So I believe our fully assesses with the same.","<strong data-v-f87c67ca=\"\">Larry Cermak <\/strong>So one of the reasons why you guys work with crypto capital was because it was just really challenging to get reliable banking. Has that improved recently? Like what? I know that you guys can talk about specifics, but what is the banking situation like currently?","<strong data-v-f87c67ca=\"\">Paolo Ardoino <\/strong>It's really good, actually. So we have different banks open and all the banks that that took that deal at that, you know, given the deal that went through that. Well, dismissed all the news that were found online and basically came there actually to talk to us. Decided to work with us. They reviewed with our KYC AML system again. Also, they said that it's even more painful at ours. So, you know, everyone in all these banks that now we are working with, then I mean, you took the one. One example is that fact that... is second bank by donation in my arms. I mean, all these banks are willing to work with us and don't have any problem. We are in constant talk. We requested all our manuals for KYC AML. They have time contact with any one of us and they are more than happy to do business with us. So I think that there is some mismatch of the picture that is being painted and what really The companies that work with us will find eventually.","<strong data-v-f87c67ca=\"\">Larry Cermak <\/strong>One more question. I go for it, right?&nbsp;","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>it was going to be a joke. Someone on twitter asked what you favorite New York City pizza place","<strong data-v-f87c67ca=\"\">Paolo Ardoino <\/strong>I never been to New York. I never been, you know, I never be a travel outside of two hours on a flight. Take the. Because I just am afraid to leave my--you know, my new job undone. I mean, I wanted to stay on top of everything. Between London and Switzerland.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>How come you don't live in Italy?","<strong data-v-f87c67ca=\"\">Paolo Ardoino <\/strong>So because basically I spent some years in in London to work first with my startup to create coin cluster, and then and then basically I decided, well, let's try to travel a bit. Since the tally ice is being spent almost all my life in Italy, I said, well, why not try? And Switzerland is beautiful and there are lakes and things. And I basically I spent 16 hours per day on a laptop. So I just can enjoy some nature outside of the window.","<strong data-v-f87c67ca=\"\">Larry Cermak <\/strong>You know, Switzerland thinks it's just like me. So it's curious. You say that, you know, you work most of your time, but what is what do you like to do outside of work? If you do anything, any hobbies or anything interesting.","<strong data-v-f87c67ca=\"\">Paolo Ardoino <\/strong>No, I was I used to be a guitar player, but there were mystique. I know I'm pretty terrible at that. I don't have time to do anything now. I had to do a bit of sports to not get too out of shape, but missed a couple times a week. Otherwise basically my wife will kill me. It's just that we are almost they have so much.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>And happy wife, happy life. Right? That's the motto. I want to be respectful of your time, obviously. And I think that's all I have on my end. We've been we've been gone over the hour, mark. I think people are going to find a lot of value in not only hearing about the new new products that are coming down the pike, but just, you know, getting some insights into the thinking around. A lot of the issues that are in the headlines might not mollify all the skeptics, but at least provide some context that might be helpful. Larry, any other questions?","<strong data-v-f87c67ca=\"\">Larry Cermak <\/strong>I was going to ask one question, actually. So you guys have historically been very chain agnostic. Can you talk briefly about why you've taken that stance as opposed to some other exchanges? They're more focused on purely Bitcoin or some other crypto currencies.","<strong data-v-f87c67ca=\"\">Paolo Ardoino <\/strong>Yeah, I mean, we started with Bitcoin, so it is the first love of everyone in the company. And but we showed support to Ethereum. We also start at an ethfinex. We should support EOS an and our involvement plans. But producers and a lot of other things. We also know we tanter there are plenty of blockchain that want to integrate tighter. And of course there are plenty of technical legal discussions around it. But we are happy to to spread our products as much as many as many project blockchain as possible. I mean, Bitcoin is the first lobbyists that work for me and for a lot of people in the companies, the key. So we tried to do our best to continue with that vision. We are funding different projects. So this is just basically our belief. That is the best design cryptocurrency so far and the fact that everything is in a different layer from attacking a pure technical point of view. I really. The fact that there is like network is so nicely done is I mean it's pure, pure technique out from a developer point of view is just beautiful.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>That's right. Now, that's helpful. Yeah, I mean, I don't think I have any more questions.","<strong data-v-f87c67ca=\"\">Paolo Ardoino <\/strong>Yeah, I went to this seems to be the lastly that I mean, we also like to get positive critiques and that's why I'm here with you guys. And we are all aware that we could do better on the community side. So I think that might be interesting, too, to have updates with you in long time.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Yeah. Absolutely. And you know where to find us. Thank you so much for taking the time. Coming on the scoop. We appreciate it. And we'll be in touch. We'll be in back. The critics will continue because they're trolling it. Sure. And yes. But it's all good. You know, like we've come such a long way. Just if I can hearken back on the halcyon days for a moment when there was all that nagging questions around banking and hopping around and opening up accounts here and there, there was this level of just opaqueness around the firm that that I think whether it was us or other people kind of added to a level of heightened skepticism. And I think in having conversations like that or like this, it helps them just understand things a little bit better. And we appreciate your time and hope. Hope you'll come on the scoop again in a few months and we'll keep in touch.","<strong data-v-f87c67ca=\"\">Paolo Ardoino <\/strong>Sure. Thank you very much, Frank. Thank you.","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York City","content":"LOCATION"},{"type":"Canada","content":"LOCATION"},{"type":"Chaparro<\/strong> Larry","content":"PERSON"},{"type":"RGB","content":"ORGANIZATION"},{"type":"Chaparro <\/strong>Damn","content":"PERSON"},{"type":"Amazon","content":"LOCATION"},{"type":"Switzerland","content":"LOCATION"},{"type":"Peter","content":"PERSON"},{"type":"last month and a half","content":"DATE"},{"type":"one billion dollars","content":"MONEY"},{"type":"New York","content":"LOCATION"},{"type":"Spotify","content":"LOCATION"},{"type":"BFX","content":"ORGANIZATION"},{"type":"Denmark","content":"LOCATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"Chaparro","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"LEO","content":"LOCATION"},{"type":"Bitfinex","content":"LOCATION"},{"type":"Bitfinex","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Larry","content":"PERSON"},{"type":"Chaparro<\/strong> Great","content":"PERSON"},{"type":"CFO","content":"ORGANIZATION"},{"type":"Frank Chaparro <\/strong>Interesting","content":"ORGANIZATION"},{"type":"John Carload","content":"PERSON"},{"type":"August, August 2019","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"CNH","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"2014","content":"DATE"},{"type":"2015","content":"DATE"},{"type":"2016","content":"DATE"},{"type":"Frank","content":"ORGANIZATION"},{"type":"2013","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"The Scoop","content":"ORGANIZATION"},{"type":"100 million dollars","content":"MONEY"},{"type":"Bitfinex","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Bob Bitfinex","content":"PERSON"},{"type":"Germany","content":"LOCATION"},{"type":"Italy","content":"LOCATION"},{"type":"London","content":"LOCATION"},{"type":"past two years","content":"DATE"},{"type":"Leo","content":"PERSON"},{"type":"850 million dollars","content":"MONEY"},{"type":"eighty million dollars","content":"MONEY"},{"type":"Frank Chaparro<\/strong> Interesting","content":"ORGANIZATION"},{"type":"Larry Cermak","content":"PERSON"},{"type":"LEO","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Genoa","content":"LOCATION"},{"type":"CTO","content":"ORGANIZATION"},{"type":"Paolo","content":"LOCATION"},{"type":"Paolo Ardoino","content":"PERSON"},{"type":"Skype","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"90 percent","content":"PERCENT"},{"type":"Bitcoin","content":"LOCATION"},{"type":"25 percent","content":"PERCENT"}],"hashtag":[],"authors":["Frank Chaparro","Larry Cermak","The Block"]}