{"summary":"OrangeDAO, a decentralized autonomous organization only open to former Y Combinator founders, has launched its own accelerator program.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/178888\/y-combinator-alumni-dao-unveils-web3-fellowship-program-exclusive","publishDate":"2022-10-21T09:48:10","id":6602,"type":null,"title":"Y Combinator alumni DAO unveils web3 fellowship program: Exclusive","category":["VENTURE CAPITAL"],"content":["OrangeDAO, a 1300-member decentralized community open to Y Combinator founders, has unveiled a web3 fellowship program.&nbsp;","The ten-week program is the result of a collaboration with Press Start Capital, a venture firm founded this year to invest in web3 gaming, NFTs and entertainment.&nbsp;","Described as an \"experiment\" by Press Start Capital founding partner Steven Chien, its inaugural cohort kicked off in early September. OrangeDAO members accepted onto the fellowship received mentorship and were paid a $25,000 grant in USDC. The program will culminate in a closed demo day in early November.&nbsp;","Most of the projects backed by the fellowship are in very early stages, with some not even having an established entity or name.&nbsp;","Some of the ideas under development include a DAO network for formerly incarcerated Americans to provide help in reintegration, a personal web3 executive assistant to leverage the utility of one's NFT and token holdings, and a software development kit to build \"normie-friendly\" web3 apps.&nbsp;","\"So we are literally the first check-in into these projects and that's normally a pretty risky strategy,\" said Chien. \"But we feel that because we're partnering with OrangeDAO, who are all experienced YC alum, there's less of a risk here.\"","OrangeDAO itself benefits from its connection to the startup accelerator but is not officially affiliated with YC.","Three of the ten projects are in the process of raising money, claimed Chien. Both OrangeDAO and Press Start Capital have the right to participate in future rounds for these projects if they choose to raise.&nbsp;","The fellowship is backed by Press Start, which contributed $100,000, and OrangeDAO which used $150,000 of its funds. Previously, OrangeDAO <a href=\"https:\/\/techcrunch.com\/2022\/08\/23\/y-combinator-80-million-web3-crypto-startup-venture-capital-dao\/\" data-v-f87c67ca=\"\">raised<\/a> $80 million for its venture fund primarily from layer-one blockchains Algorand and Near.&nbsp;","Chien sees the fellowship as a bridge to other accelerators, saying that the bar for getting into <a href=\"https:\/\/techcrunch.com\/2022\/10\/18\/a16z-crypto-web3-startup-school-accelerator-chris-dixon-disrupt-2022\/\" data-v-f87c67ca=\"\">a16z's Crypto School<\/a> or web3 accelerator AllianceDAO today is what obtaining a Series A would have been ten years ago.&nbsp;","\"We really view ourselves as a micro-accelerator,\" said Chien \"And that we can feed into other accelerators like AllianceDAO or a16z's Crypto School.\"&nbsp;","Along with the a16z and AllianceDAO accelerators, the new effort joins other programs geared towards accelerating projects in the crypto space. Earlier this week, fashion retailer Farfetch and venture firm Outlier Ventures <a href=\"https:\/\/wwd.com\/business-news\/technology\/farfetch-outlier-cohort-web3-accelerator-metaverse-1235392215\/\" data-v-f87c67ca=\"\">welcomed<\/a> eight startups to its inaugural fashion-focused web3 accelerator, Dream Assembly Base Camp. In April, Ignite, a core development team within the Cosmos ecosystem, <a href=\"https:\/\/www.theblock.co\/post\/141302\/ignite-formerly-tendermint-launches-150-million-accelerator-for-web-3-projects\" data-v-f87c67ca=\"\">revealed<\/a> a $150 million accelerator for web3 projects.","According to The Block Research, Y Combinator's crypto alumni have <a href=\"https:\/\/www.theblockresearch.com\/mapping-out-y-combinator-crypto-alumni-171747\" data-v-f87c67ca=\"\">raised<\/a> over $1 billion in funding to date. Close to half of the funding went to NFT marketplace OpenSea, which <a href=\"https:\/\/www.theblock.co\/linked\/129250\/opensea-eyeing-raise-that-would-value-it-at-13-billion-with-backing-from-coatue-and-paradigm-sources\" data-v-f87c67ca=\"\">closed<\/a> a $300 million round in January.&nbsp;","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"1300","content":"DATE"},{"type":"Dream Assembly Base Camp","content":"ORGANIZATION"},{"type":"Chien","content":"PERSON"},{"type":"$150,000","content":"MONEY"},{"type":"$80 million","content":"MONEY"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Crypto School","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Steven Chien","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$100,000","content":"MONEY"},{"type":"ten years ago","content":"DATE"},{"type":"USDC","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Chien \"","content":"PERSON"},{"type":"Press Start Capital","content":"ORGANIZATION"},{"type":"$25,000","content":"MONEY"},{"type":"$300 million","content":"MONEY"},{"type":"Outlier Ventures","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"$150 million","content":"MONEY"}],"hashtag":[],"authors":["Tom Matsuda","The Block"]}