{"summary":"A regulated institutional decentralized finance platform, Hashnote, has $5 million in backing from web3 startup incubator Cumberland Labs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215589\/cumberland-labs-backed-hashnote-launches-regulated-defi-platform","publishDate":"2023-02-28T09:00:56","id":6603,"type":null,"title":"Cumberland Labs backed Hashnote launches regulated DeFi platform","category":["DEALS"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Hashnote founder and CEO Leo Mizuhara said regulated DeFi platforms are the key to attracting institutional money to the space.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">A regulated decentralized finance (DeFi) platform for institutions, Hashnote, launched after a $5 million incubation with early stage blockchain investor Cumberland Labs.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“We are kind of a funnel into DeFi for institutional investors,” Hashnote founder and CEO Leo Mizuhara told The Block in an interview. “Think of us almost like an on-ramp.”<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Hashnote is a compliance driven DeFi platform on the Ethereum blockchain that conforms to Know-Your-Customer (KYC) and Anti-Money-Laundering (AML) standards and offers clients exposure to crypto-based investments such as yield generation, downside protection and leveraged upside products, the company said.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“Our ecosystem is a walled garden, whitelisted ecosystem,” said Mizuhara, noting that if customers want to bring their own wallets, they must follow KYC procedures that he thinks are “important for being regulated in the U.S. as well as really regulated anywhere else in the world.”<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">With respect to an institutional market sector that may not be familiar with web3 interfaces, Hashnote is taking a multi-pronged approach to onboarding newcomers into the DeFi ecosystem, according to Mizuhara.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">One approach allows clients to wire cash directly to Hashnote, with the option to track transactions on the blockchain.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">A second option allows traders to send a wire transaction but opt for Hashnote to create an empty wallet which receives assets but requires both Hashnote and the recipient to sign a transaction, which Mizuhara referred to as a “safe way” to approach DeFi.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The third option allows knowledgeable web3 traders to practice self custody and interact with Hashnote via MetaMask or any other blockchain wallet, said Mizuhara.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Institutions are seeking a fully regulated KYC platform to access DeFi, according to Mizuhara, who added Hashnote is “getting a ton of interest” and that financial products of this nature are “in demand right now.”<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“We should be looking at trillions, not billions,” Mizuhara said. “And I think the way forward is onboarding all these people who are in the traditional finance space and bridging that gap between what we call traditional finance and DeFi.”<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“I think we'll be able to onboard the next couple billion–trillion dollars into the crypto space,” he added.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cumberland Labs","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Hashnote","content":"LOCATION"},{"type":"–trillion dollars","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Leo Mizuhara","content":"PERSON"},{"type":"AML","content":"ORGANIZATION"},{"type":"Hashnote","content":"PERSON"},{"type":"Hashnote","content":"ORGANIZATION"},{"type":"$5 million","content":"MONEY"},{"type":"Mizuhara","content":"PERSON"}],"hashtag":[],"authors":["Jeremy Nation","The Block"]}