{"summary":"SEBA Bank said today that its subsidiary in Hong Kong has obtained an official license from the SFC to operate crypto-related services.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262117\/crypto-bank-seba-obtains-hong-kong-license-for-crypto-related-services","publishDate":"2023-11-08T01:07:56","id":6604,"type":null,"title":"Crypto bank SEBA obtains Hong Kong license for crypto-related services","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">SEBA Bank, a Swiss crypto bank, obtained a license from Hong Kong’s Securities and Futures Commission for its subsidiary to operate crypto-related services in the city.<\/span>","<span data-v-f87c67ca=\"\">SEBA said today in a statement that the license allows SEBA Hong Kong to deal in and distribute all securities, including virtual assets-related products, such as OTC derivatives and structured products with underlying virtual assets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The crypto bank is also allowed to advise on securities and virtual assets, and conduct asset management for discretionary accounts in both traditional securities and virtual assets.<\/span>","<span data-v-f87c67ca=\"\">“The region’s position at the forefront of finance, trading, and innovation has long been attractive to us, as servicing APAC clientele is an integral aspiration of the team’s DNA,” Amy Yu, SEBA’s chief executive officer for APAC, said in the statement.<\/span>","<span data-v-f87c67ca=\"\">In November last year, SEBA Bank&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/190860\/crypto-bank-seba-opens-office-in-hong-kong-as-the-city-aims-to-reclaim-crypto-hub-status\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">expanded<\/a>&nbsp;into Hong Kong with a new office just a month after Hong Kong authorities released a series of&nbsp;<a href=\"https:\/\/www.info.gov.hk\/gia\/general\/202210\/31\/P2022103000454.htm?fontSize=1\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">policy statements<\/a>&nbsp;on cryptocurrencies, suggesting it would reopen to firms focused on digital assets.&nbsp;Currently, SEBA Bank operates globally from its regulated hubs of Switzerland, Abu Dhabi and Hong Kong.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Franz Bergmueller, Group CEO of SEBA Bank added that Hong Kong has been at the center of the crypto economy since Bitcoin’s inception, and said SEBA is “very pleased to have added this Hong Kong licence with the full approval from the SFC to our existing licenses in Switzerland (FINMA) and Abu Dhabi (FSRA).”<\/span>","<span data-v-f87c67ca=\"\">Last month, Hong Kong’s SFC <\/span><a href=\"https:\/\/www.theblock.co\/post\/258733\/hong-kong-regulator-updates-policy-for-virtual-asset-activities\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">updated its guidance on virtual asset-related activities<\/span><\/a><span data-v-f87c67ca=\"\"> for intermediaries with two additional investor protection measures. In June, the city officially started its crypto licensing regime for virtual asset trading platforms, allowing licensed exchanges to offer retail trading services.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"SEBA","content":"ORGANIZATION"},{"type":"Switzerland","content":"LOCATION"},{"type":"Amy Yu","content":"PERSON"},{"type":"SFC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"APAC","content":"ORGANIZATION"},{"type":"November last year","content":"DATE"},{"type":"Futures Commission","content":"ORGANIZATION"},{"type":"Abu Dhabi","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"SEBA Bank","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"}],"hashtag":["ASIAN REGULATION","CRYPTO","TRADFI BANKS"],"authors":["Timmy Shen","The Block"]}