{"summary":"I&#x27;m John Biggs and I&#x27;m The Block&#x27;s new editor-in-chief.  In about 2011 my friend Tom Printy AIMed me (!) to tell me about a new currency that he was","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/7420\/how-the-block-works","publishDate":"2019-01-15T10:01:46","id":6608,"type":null,"title":"How The Block works","category":["THE BLOCK"],"content":["I'm <a href=\"http:\/\/bigwidelogic.com\" data-v-f87c67ca=\"\">John Biggs<\/a> and I'm <em data-v-f87c67ca=\"\">The Block<\/em>'s new editor-in-chief.&nbsp;","In about 2011 my friend <a href=\"https:\/\/www.linkedin.com\/in\/tomprinty\/\" data-v-f87c67ca=\"\">Tom Printy<\/a> AIMed me (!) to tell me about a new currency that he was mining on his computer. I thought the idea was silly - a network-based currency? That I could generate using my computer? It would never work.","It did.","I've been covering blockchain with some skepticism and much optimism since, posting one of the first guides for <a href=\"https:\/\/techcrunch.com\/2013\/08\/13\/how-to-build-a-raspberry-pi-based-bitcoin-mining-rig\/\" data-v-f87c67ca=\"\">mining Bitcoin under your desk<\/a>&nbsp;and interviewing assorted figures at various events in hopes of bringing the beliefs that they so closely held into the the bright light of scrutiny. The results have been mixed.","Now, I join you here on <em data-v-f87c67ca=\"\">The Block<\/em> as editor-in-chief. Why? Because this team is trying to assess crypto startups using the tools for analyzing real businesses and we're finding things are sorely lacking. The last ICO craze brought us deeply funded \"unicorns\" that fell over as soon as they stood up. The crypto bear market injected a panic not seen since the dot-com boom. The major figures in the industry are being exposed as either patient pragmatists or charlatans - there is no middle ground. And money is moving through the space at a frenetic pace and the bag holders are dumping.","","","The rats, as they say, have started leaving the sinking ship. But we believe all of us can right that ship.","We at <em data-v-f87c67ca=\"\">The Block<\/em> are optimistic about the future. Blockchain and crypto are two of the purest products of our new century. Just as the Web connected us socially, crypto will connect us economically. This is vitally important. I haven't felt this much excitement and potential in a technology since I first ran the primitive&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/Lynx_(web_browser)\" data-v-f87c67ca=\"\">Lynx<\/a>&nbsp;browser on an Andrew terminal at Carnegie Mellon. The possibilities were limitless although the visible horizon was limited.","The mission of a journalist is to afflict the comfortable and comfort the afflicted. This rarely, if ever, lines up to the results of financial reporting, but you can be damn sure that we will try to maintain this mantra as we go forward. If this technology is to enlighten the future we cannot concede defeat to those who would drive it into darkness.","Founders: We work with you, not for you. You'll grow to appreciate this over time.","Investors: We will bring you the truth and nothing but.&nbsp;","Makers: We want to hear from you. Contact us when you make something cool.","You can email us directly at <a href=\"\/cdn-cgi\/l\/email-protection#a7d3ced7d4e7d3cfc2c5cbc8c4ccc4d5ded7d3c889c4c8ca\" data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"394d50494a794d515c5b55565a525a4b40494d56175a5654\">[email&nbsp;protected]<\/span><\/a>. We want to hear from you. Now, we'd like to address our sourcing guidelines.","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">The Block<\/em> covers blockchain and financial news, primarily cryptocurrency-related startups. If you are part of this group or are related to topics we might cover, we will reach out to you via multiple media. This is what we’d like you to know.<\/span>","<b data-v-f87c67ca=\"\">Are we actual journalists?<\/b>","<span data-v-f87c67ca=\"\">Yes.<\/span>","<span data-v-f87c67ca=\"\">A journalist reports the truth as clearly as possible for a mass audience. Our focus is the esoteric and sometimes freewheeling world of fintech and cryptocurrency. In this fast-changing environment the truth may change overnight. We try to reflect that as much as possible.<\/span>","<span data-v-f87c67ca=\"\">We are not professional programmers and as such we may not be able to reflect many of the deeper points associated with the industry. It behooves you and your team to help our journalists understand your topic as clearly as possible. We will often use outside sources like <a href=\"http:\/\/techforreporters.com\" data-v-f87c67ca=\"\">TechForReporters.com<\/a>&nbsp;in order to help us understand nuances of the space.<\/span>","<span data-v-f87c67ca=\"\">We look for at least two named sources per article or point of fact. Barring that, we aim to have at last one immutable source for each piece of data.<\/span>","<span data-v-f87c67ca=\"\">We are not paid by sources, we do not accept any form of payment for positive coverage, and we will report on any efforts to pay us for coverage. Those who represent us as journalists follow this same code and will never ask for cash in exchange for coverage. If this happens, please contact us immediately.<\/span>","<b data-v-f87c67ca=\"\">But you’re bloggers!<\/b>","<span data-v-f87c67ca=\"\">Online media - blogging - &nbsp;is journalism. Blogging is journalism on a tight deadline, more akin to the writing created by wire services like the AP or Reuters than long-form writing found in magazines. As such, we are under a tight deadline to produce stories that are immediately topical. We also do not have the luxury of long lead times or lengthy interactions with sources.<\/span>","<b data-v-f87c67ca=\"\">Why would we contact you?<\/b>","<span data-v-f87c67ca=\"\">We are a news organization and we desire to cover news fairly with as little injected bias as possible. We also publish op-eds by our writers that comment - positively or negatively - on the current state of the blockchain industry. We want to see a vibrant blockchain scene bloom through the spread of truth and clarity. Therefore, we will contact you to ask you for both.<\/span>","<span data-v-f87c67ca=\"\">We will contact you if your company has made news, if you have expertise in a topic we are researching, or if we need to confirm a rumor regarding your business or the industry. It is our job to cover as much of this industry as possible and we receive most of our stories via tips others give us. We aim to confirm these tips in all cases. <\/span>","<strong data-v-f87c67ca=\"\">How will we contact you?<\/strong>","The following is our protocol for outreach:","1. A public or private tweet via your public Twitter account.<br data-v-f87c67ca=\"\">\n2. An email to a single email we find for you online, including press@ and personal emails.<br data-v-f87c67ca=\"\">\n3. Outreach on your public Telegram in search of a mod who can connect us to you or your media relations person.","In each case we will identify ourselves as <em data-v-f87c67ca=\"\">The Block<\/em> reporters.","<b data-v-f87c67ca=\"\">How long do I have to reply?<\/b>","<span data-v-f87c67ca=\"\">If we reach out to you via any media - email, Twitter, Facebook, Telegram, and the like - you will have at least one hour. To clarify, if a story requires comment from you or your organization we will contact you at least one hour before publishing but we aim to at least give you and your team a few days to prepare a response. <\/span>","<span data-v-f87c67ca=\"\">Unfortunately, the fast-moving nature of new media requires this sort of speed. It is also important for your organization to be ready to speak on important topics at any time. It is this sort of back and forth that is absolutely imperative in growing the industry past its current level of fawning “reportage” and enthusiast media.<\/span>","<span data-v-f87c67ca=\"\">We will be there for you if you are there for us.<\/span>","<b data-v-f87c67ca=\"\">How do I know it’s urgent?<\/b>","<span data-v-f87c67ca=\"\">Writers will note something is urgent in the subject line. If you do not respond before publication we will include the note “XX company did not respond before publication.”<\/span>","<b data-v-f87c67ca=\"\">How can I contact you?<\/b>","<span data-v-f87c67ca=\"\">You can email our writers or contact the team directly at <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"d7a3b2b6ba97a3bfb2b5bbb8b4bcb4a5aea7a3b8f9b4b8ba\">[email&nbsp;protected]<\/a>.<\/span>","<b data-v-f87c67ca=\"\">Are my comments ever off the record?<\/b>","<span data-v-f87c67ca=\"\">No. There is no such thing in journalism as “off the record.” Any time you are talking to a working journalist you are on the record unless it is agreed at the time that you and that journalist are not speaking in a professional capacity.<\/span>","<span data-v-f87c67ca=\"\">However, in some rare cases you can request to be quoted on “deep background,” which allows for anonymity of the source (“A source close to the matter said:”). Note that we are working to bring clarity to this industry and we cannot offer anonymity at all times. <\/span>","<span data-v-f87c67ca=\"\">The following is not “off the record:”<\/span>","<b data-v-f87c67ca=\"\">Is social interaction with reporters on the record?<\/b>","<span data-v-f87c67ca=\"\">We know our reporters and editors are human and, as such, will interact with others in various situations. Anything they say to you in a professional capacity in person is on the record and anything they say to you in any capacity on social media is on the record. There is no such thing as a “private Twitter conversation,” even in direct messages. Therefore it cuts both ways - our reporters understand that their actions in person and online can be used for reportage or complaint. <\/span>","<b data-v-f87c67ca=\"\">Can I see articles before publication?<\/b>","<span data-v-f87c67ca=\"\">No. At points we will contact you with clarifications on quotes but you will never see an article before publication.<\/span>","<b data-v-f87c67ca=\"\">Do I have to talk to your journalists?<\/b>","<span data-v-f87c67ca=\"\">No, but it helps us both to have an open dialogue.<\/span>","<b data-v-f87c67ca=\"\">I’m upset.<\/b>","<span data-v-f87c67ca=\"\">We are sorry. Please email me at&nbsp;<\/span><span data-v-f87c67ca=\"\"><a href=\"\/cdn-cgi\/l\/email-protection#5b313433351b2f333e39373438303829222b2f3475383436\" data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"0b616463654b7f636e69676468606879727b7f6425686466\">[email&nbsp;protected]<\/span><\/a>, <a href=\"https:\/\/twitter.com\/johnbiggs\" data-v-f87c67ca=\"\">Tweet me<\/a>, or hit me on <a href=\"https:\/\/t.me\/johnbiggs\" data-v-f87c67ca=\"\">Telegram<\/a>.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Reuters","content":"ORGANIZATION"},{"type":"2011","content":"DATE"},{"type":"Tom Printy","content":"PERSON"},{"type":"Carnegie Mellon","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"John Biggs","content":"PERSON"},{"type":"fintech","content":"ORGANIZATION"}],"hashtag":["CRYPTO"],"authors":["John Biggs","The Block"]}