{"summary":"Bitcoin maintained its level above $31,000 on Friday, having first crossed the threshold Thursday following a U.S. court ruling that suggested XRP isn’t necessarily a security when sold on exchanges.","author":["Brian McGleenon","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239685\/bitcoin-price-breaks-through-31000-in-wake-of-xrp-court-ruling","publishDate":"2023-07-14T13:10:13","id":661,"type":null,"title":"Bitcoin price breaks through $31,000 in wake of XRP court ruling","category":["Markets"],"content":["Bitcoin's price maintained its position above $31,000 on Friday, having crossed the threshold a day earlier in the wake of a <a href=\"https:\/\/www.coingecko.com\/en\/coins\/bitcoin\" data-v-f87c67ca=\"\">ruling<\/a> from a U.S. judge that suggested the XRP token isn't necessarily a security if sold on an exchange.","The price of the world's largest crypto currency was up 1% over the past day to $31,251 as of 12:51 p.m. in New York, according to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/bitcoin\" data-v-f87c67ca=\"\">CoinGecko<\/a>.","Approximately $56 million worth of Bitcoin short positions have been liquidated in the past 24 hours, according to data from <a href=\"https:\/\/www.coinglass.com\/LiquidationData\" data-v-f87c67ca=\"\">CoinGlass<\/a>.","The news has also been positive for <a href=\"https:\/\/www.theblock.co\/post\/239646\/coinbase-sees-crypto-winter-thawing-after-ripples-partial-legal-victory\" data-v-f87c67ca=\"\">Coinbase.<\/a> It's shares have rallied 37% this week, although trading was mostly flat on Friday.&nbsp;","“The XRP news highlights the important role of exchanges as accessible trading venues for digital assets, and it enables increased investment into infrastructure for the growing asset class,\" Enclave Markets CEO David Wells told The Block.","Scott Freeman, co-founder at JST Digital, echoed that view, saying the ruling was positive step for the crypto community, especially for exchanges and protocols.","\"While there is still plenty of work to be done in Congress, recent court decisions like this one help as we wait for clearer legislative guidance,\" he said.","\"Investors hope that the coins sued by the SEC may now carry reduced risk, enabling Coinbase to secure more revenue from these altcoins,\" BTCM chief economist Youwei Yang said.","There has been less enthusiasm about the ruling from some analysts, however.","Konstantin Anissimov, an independent digital asset analyst, told The Block that he \"noticed lawyers being a lot less optimistic about this news than everybody else.\"","CoinShares head of product Townsend Lansing shared that view.","\"In regards to direct sales to institutional investors, the court has confirmed that the law was indeed violated, marking a considerable victory for the SEC. It sets a precedent for legal actions against other cryptocurrencies,\" he told The Block.","Youwei Yang said uncertainties and lack of clarity remain on closer examination of the court document.","\"The SEC determined institutional sales of XRP to be unregistered investment contracts, while programmatic sales were not. Other distributions were not deemed investment contracts. This ruling sets a precedent that tokens can be classified as both 'security' and 'not a security' depending on circumstances,\" he added."],"hashtag":["CRYPTO MOVERS","FEDERAL RESERVE","SEC"]}