{"summary":"The government should &quot;beef up&quot; its enforcement actions on crypto scams, Treasury Secretary Janet Yellen said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179440\/yellen-doubles-down-on-call-for-more-crypto-enforcement","publishDate":"2022-10-24T12:13:23","id":6615,"type":null,"title":"Yellen doubles down on call for more crypto enforcement","category":["POLICY"],"content":["The government should use its enforcement powers to crack down on crypto scams, Treasury Secretary Janet Yellen said at a financial conference.","The U.S. Treasury Department issued a series of reports on digital assets this fall, which called for more enforcement and new digital asset regulations.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The U.S. government should use its enforcement authorities to crack down on crypto scams and operational failures, Treasury Secretary Janet Yellen said, reiterating her agency’s call for “beefed up” enforcement on digital assets.","The Biden administration released a series of digital asset reports in September and October, in an attempt to unite the many federal agencies that touch cryptocurrency issues. Yellen spoke about the reports at the Securities Industry and Financial Markets Association’s annual meeting in New York City.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“Our report found that there are too many instances of fraud and scams and operational failures,” Yellen said. “There are some existing enforcement authorities and we would like to see those beefed up, and greater enforcement in this area.”","Yellen spoke broadly about risks to the economy and said cryptocurrencies do not yet pose a significant risk to financial stability. The crypto market is “not yet big enough or connected enough,” but that could change as the technology matures, Yellen noted.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“It could pose a risk,” Yellen said. “So we would like to see an improvement in regulation in these areas.”<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<a href=\"https:\/\/www.theblock.co\/post\/170770\/here-are-all-of-the-biden-administrations-crypto-reports\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">The administration’s digital asset reports<\/a> identified three areas that require regulation: Spot markets for crypto assets that are not securities, stablecoins and vertical integration by crypto firms. Yellen touched on each issue in her remarks at the SIFMA meeting.","Lawmakers on the House Financial Services Committee have <a href=\"https:\/\/www.theblock.co\/post\/171565\/draft-stablecoin-bill-in-congress-to-require-fed-state-regulator-approval\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">spent months<\/a> drafting stablecoin legislation, although it’s <a href=\"https:\/\/www.theblock.co\/post\/178003\/stablecoin-bill-is-not-happening-this-congress-says-rep-himes\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">unclear<\/a> whether a bill could advance out of committee before this Congress ends in January.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Yellen doubled down on her call for new stablecoin rules in her remarks in New York City.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“That's kind of an example of regulatory arbitrage. We think that's essentially a banking-type product that really needs a much firmer regulatory framework to operate safely,” Yellen said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York City","content":"LOCATION"},{"type":"fall","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"U.S. Treasury Department","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Janet Yellen","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Securities Industry and Financial Markets Association","content":"ORGANIZATION"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"Biden","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Yellen","content":"PERSON"}],"hashtag":["JANET YELLEN"],"authors":["Stephanie Murray","The Block"]}