{"summary":"CryptoGPT announced raising $10 million in a Series A funding round from DWF Labs at a $250 million token valuation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225531\/cryptogpt-raises-dwf-labs","publishDate":"2023-04-10T09:24:30","id":6617,"type":null,"title":"CryptoGPT raises funds at a $250 million token valuation","category":["DEALS"],"content":["CryptoGPT, a zero-knowledge layer 2 blockchain network attempting to leverage the success of artificial intelligence, announced raising $10 million in a Series A funding round from DWF Labs at a $250 million token valuation.","But only $420,000 of the total amount has thus far been invested by DWF Labs, CryptoGPT co-founder and CTO Dejan Erja told The Block. DWF Labs began investing last week and the rest of the amount will be invested over 285 days, Erja said.","\"DWF Labs follows the vesting schedule that's outlined in our tokenomics. The investment is done over a 285-day period, aligning with the vesting of those tokens,\" he added.","As part of the deal, DWF Labs, a web3 investment firm that is also a market maker, will also make market for CryptoGPT's GPT token \"The deal is mainly for them to become an active market maker in our books,\" Erja said.","The GPT token was launched last month and its current fully diluted valuation stands at around $210 million, lower than what DWF invested, according to data from <a href=\"https:\/\/www.coingecko.com\/en\/coins\/cryptogpt-token\" data-v-f87c67ca=\"\">CoinGecko<\/a>.","CryptoGPT was founded in July 2022, according to Erja. Jamila Jelani was named as founder and CEO of the project as recently as last month on some social media <a href=\"https:\/\/twitter.com\/CryptoGPT0\/status\/1636175672459534336?s=20\" data-v-f87c67ca=\"\">accounts<\/a> and in news <a href=\"https:\/\/thechainsaw.com\/defi\/cryptogpt-twitter-token-scratching-heads\/\" data-v-f87c67ca=\"\">articles<\/a>. But her current title on the CryptoGPT website is marketing personnel. Jelani said \"3rd party sources quoted me as CEO as I’ve been told, but I’m handling marketing. It is sloppy work on their end.\" Erja is the founder and CTO of CryptoGPT, she said, although he's named as a co-founder in today's press release.&nbsp;","CryptoGPT grabbed headlines last month around its token launch and the rapid rise of AI bots like OpenAI's ChatGPT. CryptoGPT claims to help users own and monetize their data via its Layer 2 blockchain network that is under development.","\"Use our apps in fitness, dating, games and education. CryptoGPT captures and packages data. Own your data and earn from selling it,\" Erja said. CryptoGPT's mainnet is expected to go live in the third quarter of this year, he added.","With DWF's investment, CryptoGPT aims to grow its developer team from the current 22 people and grow in Asia, according to Erja.&nbsp;","CryptoGPT previously raised $3 million in a token round through a public sale via DAO Maker last month, according to Erja.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"CTO Dejan Erja","content":"ORGANIZATION"},{"type":"Jamila Jelani","content":"PERSON"},{"type":"Erja","content":"ORGANIZATION"},{"type":"$250 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$3 million","content":"MONEY"},{"type":"Erja","content":"PERSON"},{"type":"Asia","content":"LOCATION"},{"type":"Erja","content":"LOCATION"},{"type":"GPT","content":"ORGANIZATION"},{"type":"$420,000","content":"MONEY"},{"type":"$210 million","content":"MONEY"},{"type":"Jelani","content":"PERSON"},{"type":"CTO","content":"ORGANIZATION"},{"type":"third quarter","content":"DATE"},{"type":"$10 million","content":"MONEY"},{"type":"July 2022","content":"DATE"}],"hashtag":["SERIES A"],"authors":["Yogita Khatri","The Block"]}