{"summary":"Grayscale is the latest firm to file its Form 8-A, signaling progress towards a potential spot bitcoin exchange-traded fund.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/270379\/fidelity-grayscale-filing-8-a-forms-show-progress-for-spot-bitcoin-etf-applications","publishDate":"2024-01-04T09:12:21","id":6620,"type":null,"title":"Asset managers including Ark, Grayscale and Fidelity file 8-A forms in latest sign of progress for spot bitcoin ETF applications","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Grayscale, Ark Investments, Valkyrie and VanEck are the latest firms to <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1588489\/000095017024001501\/btc_form_8-a12b_1.4.24.htm\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">file<\/span><\/a> their <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1838028\/000093041324000030\/c107594_8a12b.htm\" data-v-f87c67ca=\"\">Form<\/a> 8-As, signaling progress towards a potential spot bitcoin exchange-traded fund.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The move signifies registration that allows issuers to trade on an exchange once the product has been approved. The issuers' moves comes a day after Fidelity filed its Form 8-A and days ahead of an upcoming deadline for when the Securities and Exchange Commission will have to decide whether to approve or disapprove of a spot bitcoin ETF.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Grayscale is looking to convert its flagship GBTC fund to a spot bitcoin ETF, following a long journey and an August court win that ruled that the <\/span><span class=\"s3\" data-v-f87c67ca=\"\">SEC has to re-review Grayscale's bid for a spot bitcoin ETF. <\/span><span class=\"s1\" data-v-f87c67ca=\"\">Other firms including BlackRock and Fidelity have thrown their hats in for a spot bitcoin ETF over the past year.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"At Grayscale, we continue to work collaboratively with the SEC to uplist GBTC to NYSE Arca as a spot bitcoin ETF,\" a Grayscale spokesperson said. \"Grayscale remains ready to operate GBTC as an ETF upon receipt of regulatory approvals.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Anticipation has heated up for a spot bitcoin ETF, which would be a first in the U.S. if the SEC does grant approval.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">ETF issuers including BlackRock and Fidelity filed amended registration forms with the SEC in late December, which were seen as a final push for a spot bitcoin ETF. BlackRock named Jane Street Capital and JP Morgan Securities LLC as authorized participants.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">Issuers have been <a href=\"https:\/\/www.theblock.co\/post\/270222\/issuers-have-fixed-three-of-the-secs-remaining-concerns-for-spot-bitcoin-etfs-sources\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">ironing<\/span><\/a> out the details of these potential spot bitcoin ETFs over the past few weeks, including discussions around creation and redemption models, naming authorized participants and hard forks.&nbsp;<\/span>","<em data-v-f87c67ca=\"\">(Updated at 2:05 p.m. ET to include Ark's filing of Form 8-A.)<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"VanEck","content":"PERSON"},{"type":"2:05 p.m.","content":"TIME"},{"type":"JP Morgan Securities LLC","content":"ORGANIZATION"},{"type":"Ark Investments","content":"ORGANIZATION"},{"type":"Jane Street Capital","content":"ORGANIZATION"},{"type":"August","content":"DATE"},{"type":"NYSE Arca","content":"ORGANIZATION"}],"hashtag":["SEC","SPOT BITCOIN ETF"],"authors":["Sarah Wynn","The Block"]}