{"summary":"India-based crypto exchange CoinDCX is now valued at $1.1 billion after raising $90 million in a Series C funding round.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/114012\/india-crypto-exchange-coindcx-unicorn-90-million-series-c","publishDate":"2021-08-10T03:44:06","id":6621,"type":null,"title":"Crypto exchange CoinDCX becomes unicorn with latest $90 million funding","category":["VENTURE CAPITAL"],"content":["India-based cryptocurrency exchange CoinDCX has raised $90 million in a Series C funding round. The round brings CoinDCX's valuation to $1.1 billion, making it the first Indian crypto exchange to become a unicorn.","B Capital, founded by Facebook co-founder Eduardo Saverin, led CoinDCX's Series C round. Existing investors Coinbase Ventures, Polychain Capital, Block.one, Jump Capital, and others also backed the round.","The Series C comes just eight months after CoinDCX <a href=\"https:\/\/www.theblockcrypto.com\/post\/88842\/indian-crypto-exchange-coindcx-raises-13-9-million-series-b\" data-v-f87c67ca=\"\">raised<\/a> $13.9 million in Series B funding. When asked why it raised funds again so soon, CoinDCX co-founder and CEO Sumit Gupta told The Block that demand for crypto as a trading option is rising in India, and CoinDCX wants to expand its user base and grow its operations.","CoinDCX currently claims to have 4 million users, and it aims to have 50 million users in the future. To that end, CoinDCX has been on an aggressive advertisement drive on social media and television. It recently signed a sponsorship deal with the reality show Bigg Boss. CoinDCX has also collaborated with several social media influencers, offering end-users \"free\" bitcoin worth around $1.5 or so if they end up opening new accounts.","\"With these efforts in place, we have been able to increase our user base and will continue to grow our active user base through these sustained efforts,\" said Gupta.","CoinDCX also plans to partner with fintech firms to expand its user base and set up a new research and development facility, but Gupta said those plans are still in the pipeline with no concrete details to share at this time.","CoinDCX also has two new products in the works: CoinDCX Prime and Cosmex. CoinDCX Prime will cater to wealthy clients, and Cosmex will offer crypto-to-crypto trading, said Gupta.","The exchange is hiring for various roles and is looking to expand its headcount from current 185 to about 400 in the near future, said Gupta.","Indian crypto exchanges and firms have been raising funds despite an uncertain regulatory environment in the country. This shows global venture firms perceive upside in India becoming a major market for crypto and are hopeful regulators will warm up to the sector.","The Series C round brings CoinDCX's total funding to date to $109.4 million. The exchange has previously raised $19.4 million in various rounds since launching in 2018.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1.5","content":"MONEY"},{"type":"Gupta","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Bigg Boss","content":"ORGANIZATION"},{"type":"fintech","content":"ORGANIZATION"},{"type":"$19.4 million","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"Sumit Gupta","content":"PERSON"},{"type":"$109.4 million","content":"MONEY"},{"type":"$90 million","content":"MONEY"},{"type":"$13.9 million","content":"MONEY"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"India","content":"LOCATION"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"Cosmex","content":"ORGANIZATION"},{"type":"$1.1 billion","content":"MONEY"},{"type":"Eduardo Saverin","content":"PERSON"}],"hashtag":["SERIES C &AMP; BEYOND"],"authors":["Yogita Khatri","The Block"]}