{"summary":"A total of 97 crypto funds have shut down this year out of the more than 700 that exist around the world, Bloomberg News reported.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/243303\/almost-100-crypto-funds-have-closed-this-year-report","publishDate":"2023-08-04T16:13:43","id":6626,"type":null,"title":"Almost 100 crypto funds have closed this year: report","category":["CRYPTO ECOSYSTEMS"],"content":["A total of 97 crypto funds have shut down this year out of the more than 700 that exist around the world, Bloomberg News <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-08-04\/crypto-hedge-funds-are-being-hit-by-shutdowns-lagging-returns-in-2023#xj4y7vzkg\" data-v-f87c67ca=\"\">reported<\/a>, citing data from the Swiss investment adviser 21e6 Capital AG.","While the funds returned 15.2% on average in the first half of the year, they underperformed bitcoin's gain of 83.3%. Many of the funds had been holding more cash than usual as a result of industry turmoil last year, according to the report.","Some funds have been struggling to find new partners for banking services, 21e6 head of marketing and sales Maximilian Bruckner told Bloomberg.&nbsp;","\"Directional funds performed well, but underperformed bitcoin,\" Bruckner said in a <a href=\"https:\/\/assets.21e6.io\/blog\/half-year-review-2023\" data-v-f87c67ca=\"\">blog post<\/a> about the 21e6 data. \"While many funds had to slow down their operations due to regulatory uncertainties surrounding popular banking partners and fund administrators, discretionary crypto funds did not face this issue.\"","Quantitative funds, meanwhile, were held down by \"choppy\" markets.","\"Investor confidence improved slightly, but fund inflows and fund launches are not yet signaling a full recovery in sentiment,\" Bruckner said.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bruckner","content":"PERSON"},{"type":"Capital AG","content":"ORGANIZATION"},{"type":"83.3%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"15.2%","content":"PERCENT"},{"type":"Bloomberg News","content":"ORGANIZATION"},{"type":"Maximilian Bruckner","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":["HEDGE FUNDS"],"authors":["Brian McGleenon","The Block"]}