{"summary":"Decentralized finance protocols across a range of blockchains are now looking after $200 billion in value, per DefiLlama.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/120379\/decentralized-finance-is-now-a-200-billion-industry","publishDate":"2021-10-13T06:13:56","id":6638,"type":null,"title":"Decentralized finance is now a $200 billion industry","category":["DEFI"],"content":["There's now $200 billion tied up in decentralized finance (DeFi) protocols, according to tracking site <a href=\"https:\/\/defillama.com\/home\" data-v-f87c67ca=\"\">DefiLlama<\/a>. That number has doubled since late June.","This metric is known as the total value locked (TVL) in these protocols. It refers to the dollar value of the tokens held in smart contracts within DeFi protocols, such as lending or trading platforms. It's worth noting that these estimates are not perfect, since such trackers can count the same coins more than once.","<span data-v-f87c67ca=\"\">The TVL across multiple blockchains has reached $200 billion. Source: DefiLlama.<\/span>","DefiLlama looks at these protocols across multiple blockchains, so this is quite a wide ranging figure, encompassing big blockchains like Ethereum as well as those newer to DeFi, like Avalanche and Solana.","The majority of the value is held in projects on Ethereum. DefiLlama puts this figure at $140 billion (notably this is 55% higher than the estimate on DeFi Pulse). Up next comes Binance Smart Chain with $18.5 billion and Solana with $11.7 billion. The next biggest chains are Terra, Avalanche and Fantom.","DefiLlama also includes a few scaling networks built on Ethereum, such as Polygon (although more of a sidechain), Arbitrum and Optimism. The latter two have only recently launched and have relatively small amounts of value locked in protocols on their networks.","Despite Ethereum's strong market share and growing TVL, it has lost significant dominance due to the emergence of DeFi protocols on other chains. It has declined from 98% dominance in January to 68.5% today. During that timeframe, however, its TVL increased by four times.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"TVL","content":"ORGANIZATION"},{"type":"68.5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"98%","content":"PERCENT"},{"type":"January","content":"DATE"},{"type":"55%","content":"PERCENT"},{"type":"$200 billion","content":"MONEY"},{"type":"Fantom","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"$140 billion","content":"MONEY"},{"type":"Terra","content":"ORGANIZATION"},{"type":"$11.7 billion","content":"MONEY"},{"type":"$18.5 billion","content":"MONEY"},{"type":"Solana","content":"PERSON"}],"hashtag":["ETHEREUM"],"authors":["Tim Copeland","The Block"]}