{"summary":"The Financial Stability Board (FSB) has gained the IMF’s approval as a global leader for coordinating and setting crypto regulation standards.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/172999\/imf-calls-on-global-financial-watchdog-to-lead-crypto-regulation-push","publishDate":"2022-09-27T07:32:30","id":6639,"type":null,"title":"IMF calls on global financial watchdog to lead crypto regulation push","category":["REGULATION"],"content":["Two new reports by the International Monetary Fund (IMF) on regulating stablecoins and unbacked cryptoassets have called on the Financial Stability Board (FSB) to set and lead global efforts on crypto regulation.","The reports, published on Monday, state that the watchdog is \"well placed to take the lead in coordinating and establishing global standards to support national regulation of crypto assets,” as well as guiding the national implementation of regulation of crypto assets while considering sector-specific standards.","Some of the measures in the reports include the development of common global categories to inform cross-sectoral standards and guide data collection. They also tout a risk-based approach with additional requirements for “entities and activities that generate more risk” as well as recommending the backing of stablecoins with safe and liquid assets.","The FSB will report to G20 finance ministers and central bank officials in October on “high-level recommendations” regarding crypto and particularly stablecoins, according to a <a href=\"https:\/\/www.fsb.org\/wp-content\/uploads\/P110722.pdf\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">statement<\/a> issued by the FSB from this summer.","The IMF has also mentioned its close collaboration with FSB in the past in a <a href=\"https:\/\/www.imf.org\/en\/Blogs\/Articles\/2021\/12\/09\/blog120921-global-crypto-regulation-should-be-comprehensive-consistent-coordinated\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">blog post<\/a> from December 2021 to develop regulatory frameworks for cryptoassets. The results of the collaboration are visible as the reports lean on the Basel-based organization’s existing research, frameworks and definitions as a basis for its recommendations.","The FSB was created in the wake of the 2008 financial crisis as a successor to the Financial Stability Forum.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"International Monetary Fund (IMF","content":"ORGANIZATION"},{"type":"G20","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"IMF","content":"ORGANIZATION"},{"type":"Basel","content":"LOCATION"},{"type":"2008","content":"DATE"},{"type":"December 2021","content":"DATE"},{"type":"Financial Stability Forum","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"FSB","content":"ORGANIZATION"},{"type":"Financial Stability Board (FSB","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"summer","content":"DATE"}],"hashtag":[],"authors":["Inbar Preiss","The Block"]}