{"summary":"The Internal Revenue Service (IRS) is sending out a new round of letters to cryptocurrency holders, this time listing the specific amounts of money that","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/36070\/irs-sends-new-letters-to-crypto-holders-stating-amounts-they-owe-to-the-agency","publishDate":"2019-08-14T20:28:32","id":664,"type":null,"title":"IRS sends new letters to crypto holders, stating amounts they owe to the agency","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">The Internal Revenue Service (IRS) is sending out a new round of letters to cryptocurrency holders, this time listing the specific amounts of money that these letter recipients owe to the tax collector.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The new IRS notice, CP2000, is intended for the occasion when there are discrepancies between the information taxpayers report on their tax return and the information the agency obtains independently from third parties. The amount stated on the notice is the proposed amount that the IRS believes the taxpayers owe, although taxpayers can dispute the amounts within 30 days of receiving the notice. The agency warns that failing to respond to the letter may incur further interest owed and penalties.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In July, the IRS <\/span><a href=\"https:\/\/www.theblockcrypto.com\/2019\/07\/26\/irs-sends-letters-to-warn-over-10000-cryptocurrency-investors-to-report-and-pay-tax-properly\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">started sending out 10,000<\/span><\/a><span data-v-f87c67ca=\"\"> educational letters to cryptocurrency holders, urging them to report and pay their cryptocurrency-related taxes properly. However, the CP2000 notice is believed to be separate from the 10,000 letters, according to CoinTracker co-founder Chandan Lodha, whose company provides software that helps taxpayers figure out their cryptocurrency-related taxes.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“[CP2000] is more severe [than the previous 10,000 letters] in the sense that there is an actual, specific amount that the IRS is saying that is the proposed amount due, as opposed to… a very general warning letter,” said Lodha.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On one CP2000 notice shared with The Block, the IRS obtained the third-party information that it uses to calculate the proposed tax amount from a Form 1099-K, a document some cryptocurrency exchanges send out to customers that have conducted transactions above certain thresholds. Exchanges are also required to file a separate copy of the same form to the IRS.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">However, some cryptocurrency taxation researchers pose doubts on the IRS’ methods of using Form 1099-K to calculate cryptocurrency-related taxes, since the form only reflects aggregated transaction volumes, but not the actual gains that individuals make through these transactions.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The 1099-K… isn’t really a good fit for reporting cryptocurrency tax information<\/span><span data-v-f87c67ca=\"\">,” said Coin Center senior research fellow James Foust, who specializes in cryptocurrency taxation. “But <\/span><span data-v-f87c67ca=\"\">it [1099-K] and the 1099-MISC are the only information reports that the IRS mentions in Notice 2014-21 and I suspect that may be the reason exchanges have opted to use it in the absence of clear guidance from the agency.”&nbsp;&nbsp;<\/span>","It is unclear how many CP2000 notices were sent out at this time.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"CoinTracker","content":"ORGANIZATION"},{"type":"2014","content":"DATE"},{"type":"Chandan Lodha","content":"PERSON"},{"type":"1099","content":"DATE"},{"type":"James Foust","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Internal Revenue Service (IRS","content":"ORGANIZATION"},{"type":"Lodha","content":"PERSON"},{"type":"MISC","content":"LOCATION"},{"type":"July","content":"DATE"},{"type":"IRS","content":"ORGANIZATION"},{"type":"21","content":"DATE"}],"hashtag":["IRS"],"authors":["Celia Wan","The Block"]}