{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley. They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/15155\/gsr-markets-missing-2m-in-bitcoin-after-poor-escrow-tricks","publishDate":"2019-03-08T17:56:39","id":6648,"type":null,"title":"GSR Markets allegedly missing $2M in bitcoin after poor escrow tricks","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]GSR Markets Limited v. Diana McDonald et al., Case 1:19-cv-01005-MLB, N.D. Ga., 3\/1\/19 [SDP]<br data-v-f87c67ca=\"\">\n<\/strong><\/em>","A number of crypto lawsuits have involved escrow arrangements gone awry. This case seems to be the latest, with the added peculiarity that a lawyer is allegedly involved. In a nutshell, the plaintiffs allege that they wired $4 million to a lawyer’s trust account and expected to receive bitcoin in exchange, and that they haven’t received the bitcoin and that only half of their money was returned. The lawyer has since responded and says that she didn’t do anything wrong and that if there was a scam that she is a victim too.","It’s a little bit challenging to figure out exactly what happened here, and the plaintiff and the defendant present a different view of the facts. The pleadings are a tangled web of accusation and response. According to the plaintiff, “Valkyrie [one of the defendants] promised that it would provide Bitcoin to GSR Markets [plaintiff]in exchange for $4 million. In reliance on that promise, GSR Markets wired $4 million into the Wells Fargo IOLTA account (a fiduciary account) of McDonald and McDonald Law [also defendants]. After the bitcoin didn’t arrive, plaintiff says it demanded its money and only received half, while the defendants kept the other $2 million. Plaintiff is a Hong Kong company and all of the defendants are American.","Plaintiff says that it acted a broker for a company called Alivia Corporation Pty, Ltd. (“Alivia”). It also alleges that “[o]n January 3, 2019, Plaintiff wired $4,000,000 into the Account, expecting that it would immediately receive 1,000 Bitcoins from the Sellers. Based on that expectation, GSR Markets shorted those 1,000 Bitcoins, based on a purchase price of $3,635 per Bitcoin.” No bitcoin ever arrived, and Plaintiff says it also lost $380,000 in order to unwind its short position. Plaintiff says they got $2 million back but are still out of pocket $2 million.","Plaintiff asks for injunctive relief and also alleges fraud and breach of fiduciary duty against the law firm. The breach of fiduciary theory is premised on the the theory that “McDonald and McDonald Law were to hold Plaintiff’s funds in the Account in trust for Plaintiff. As such, they owed certain fiduciary duties to Plaintiff, including the duty to act in good faith and in the best interests of Plaintiff.” In addition to suing the lawyer and the seller, plaintiff also sued Wells Fargo bank — where the IOLTA account was held — for aiding and abetting fraud. Their lawyer also filed a complaint with the Georgia bar. The Court has entered a temporary restraining order freezing any funds held by the lawyer — IOLTA or not — at Wells Fargo Bank.","The lawyer has since filed a response and says that she didn’t owe a fiduciary duty to the buyer — that her duties only ran to the seller. She further says after wiring a portion of the funds to “unlock” a bitcoin wallet, the Seller “informed Defendant McDonald that there was a delay in delivery of the Bitcoin to GSR because of hacking issues affecting [its]storage systems.” She also claims that Plaintiff “confirmed delivery of 2000 “non-spendable” bitcoin, which probably … isn’t … actually … a thing.","Most cases have two sides and this one appears to be no different. I am not suggesting that this lawyer was in cahoots with a scammer. I would suggest, however, that it is a really questionable proposition for lawyers to act as escrow agents and use their trust accounts for bitcoin transactions, and even more so when they don’t clearly understand how the stuff works.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part I of this week's analysis,&nbsp;Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Plaintiff","content":"LOCATION"},{"type":"GSR","content":"ORGANIZATION"},{"type":"McDonald","content":"ORGANIZATION"},{"type":"Wells Fargo Bank","content":"ORGANIZATION"},{"type":"N.D. Ga.","content":"LOCATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"Diana McDonald","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Alivia Corporation Pty, Ltd.","content":"ORGANIZATION"},{"type":"Rosario","content":"PERSON"},{"type":"$380,000","content":"MONEY"},{"type":"McDonald Law","content":"ORGANIZATION"},{"type":"McDonald Law [","content":"ORGANIZATION"},{"type":"$4,000,000","content":"MONEY"},{"type":"2000","content":"DATE"},{"type":"$4 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$3,635","content":"MONEY"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"$2 million","content":"MONEY"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"Georgia","content":"LOCATION"},{"type":"Wells Fargo","content":"LOCATION"},{"type":"January 3, 2019","content":"DATE"},{"type":"Palley","content":"PERSON"}],"hashtag":[],"authors":["Stephen D. Palley","The Block"]}